{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:28:27", "date_modify": "2025-05-21 06:28:27", "date_publish": "2025-04-01 00:00:00", "description": "Myanmar junta chief Min Aung Hlaing has also rejected calls for a ceasefire to facilitate the delivery of desperately needed relief supplies.", "filename": "news_live_c2dep0r5ygnt_1747808907.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d783/live/3f780aa0-0f74-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c2dep0r5ygnt_1747808907.html", "title": "Junta fires on convoy bringing aid to quake-hit regions", "title_page": "Junta fires on convoy bringing aid to quake-hit regions - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for joining us\nWe are pausing our live coverage now. Here's where things stand:\nThe death toll in Myanmar has gone up to 2,886, according to the junta. This figure is still expected to rise as rescue efforts continue.\nAt least 21 people have died in Thailand, where more than 70 people are trapped under the rubble of a high-rise building in Bangkok.\nBBC's Burmese service has reached Sagaing, the city closest to the earthquake's epicentre, where at least a third of its buildings have been destroyed.\nRescue and relief efforts are ongoing, and survivors are still being found. However, hundreds remain missing.\nMyanmar's military fired at a Chinese Red Cross convoy bringing aid into quake-hit areas on Tuesday night. No injuries were reported, and the junta says it's investigating the incident.\nThank you for joining us today. If you'd like to know more about the Myanmar earthquake and its aftermath, there are some other stories from across the BBC that you can read:\nMandalay was the 'city of gold' - now it reeks of death\nHeartbroken parents call out children's names at earthquake-hit pre-school\n'People are screaming help me': Myanmar earthquake survivors describe horror\nThe man mourning 170 loved ones lost in the quake\nZeyar Htun and Tessa Wong\nReporting from Bangkok\nAs the call to prayer rang out in Sagaing last Friday, hundreds of Muslims hurried to the five mosques in central Myanmar.\nThey were eager to hold their last Friday prayers for Ramadan, just days away from the festive period of Eid that would mark the end of the holy month.\nThen, at 12:51 local time (06:21 GMT), a deadly earthquake struck. Three mosques collapsed, including the biggest one, Myoma, killing almost everyone inside.\nHundreds of kilometres away, the former imam of Myoma mosque, Soe Nay Oo, felt the quake in the Thai border town of Mae Sot.\nIn the following days, he found out that around 170 of his relatives, friends and members of his former congregation had died, mostly in the mosques. Some were leading figures in the city's close-knit Muslim community.\nHere's more on how Soe Nay Oo is mourning his loved ones\nJunta leader to attend summit in bangkok\nMyanmar junta leader, Min Aung Hlaing, is due to attend a summit in Thailand this week, Thai foreign ministry spokesman Nikorndej Balankura has told reporters at a news conference in Bangkok.\nThe summit of leaders of the Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Co-operation (Bimstec) is due to take place in Bangkok on 3 and 4 April.\nBimstec comprises Bangladesh, Bhutan, India, Myanmar, Nepal, Sri Lanka and Thailand.\nAs we've been reporting here, Myanmar's military fired at a Chinese aid convoy which was bringing supplies to areas hit by a magnitude 7.7 earthquake, saying it was not notified that the convoy would be passing through.\nMin Aung Hlaing has also rejected calls by armed rebel groups for a ceasefire to allow aid into quake-hit areas.\n'We would not stay at a place where we see the ceiling'\nMin Thu, a food seller, told BBC Burmese at the Royal Palace in Mandalay that he and his family have been camping there alongside other locals for fear of returning home.\n\"We do not have plans to go back even if our home is safe for move in. We would not stay at a place where we see the ceiling. We are afraid,\" he said.\n\"We are living with fear. We cannot sleep well at night. Me and my family are waking up to any sounds.\"\nMin Thu said he lost friends in the rubble.\n\"My home is damaged but thanks to God I am alive,\" he said. \"I do not have enough courage to face what's yet to come. All of our lives are in the hand of God.\"\nTourist haven Inle Lake devastated by earthquake\nNick Beake\nReporting from Bangkok\nInle Lake was once Myanmar’s aquatic tourist paradise - but video footage emerging from there shows how the earthquake has devastated the community.\nBamboo homes that once perched above the water's surface have collapsed and the area is now a floating disaster zone, with locals saying at least 100 people have died.\nAustrian charity SONNE International has now reached the lake, and says the two worst affected villages are nearly completely wiped out with more than 1,000 homes destroyed.\nWe made contact with Jochen Meissner, from the charity, who said he and others had been able to give some aid, but only the basics to survive, and there were no other big international aid agencies in the area.\nThe picturesque refuge of Inle Lake once drew more than a hundred thousand foreign visitors every year - at least before the military coup in 2021.\nCivil war stole their livelihoods. The earthquake stole their lives.\n'I don't have money to rebuild my house'\nAt the grounds of Mandalay's Royal Palace, many locals have been camping out, trying to find somewhere to sleep as aftershocks continue to rock the city.\nAmong them are Phyo Su and her two sons. The 35-year-old narrowly escaped death when the quake hit on Friday.\n\"Everybody ran to the ground,\" she told BBC Burmese. \"The stairs were destroyed as I ran.\"\nHer house \"leaned a bit\" after the earthquake, but she has no money to rebuild it, she said.\n\"They only let us go back home for a while to take our belongings and told us not to move back in,\" she said. \"All of the residents moved here.\"\n\"Mosquitoes are everywhere here, but people give us food and water, so it should be fine.\"\nHow did Myanmar get here?\nYvette Tan\nBBC News\nAfter a prolonged civil war, a severe food crisis and an economy on the decline, Myanmar now finds itself devastated by a powerful earthquake.\nOn Friday, the 7.7 magnitude quake hit the city of Sagaing in central Myanmar, and was followed by reports of destruction coming from nearby Mandalay - the country's second largest city - as well as the capital, Nay Pyi Taw, which is more than 150 miles (241km) away.\nMany aid groups have called this an unprecedented disaster for a country that has seen decades of unrest and military rule since its independence from Britain in 1948.\nIt appeared to move away from this dark past in 2011, when it began to transition out of full military rule, and in 2015 held free elections which Nobel Peace Prize laureate Aung San Suu Kyi won.\nDemocratic hopes were dashed in 2021, however, when Aung San Suu Kyi and her government were overthrown by a coup led by military chief Min Aung Hlaing.\nThe coup triggered huge protests, with thousands taking to the streets daily, demanding the restoration of civilian rule.\nFour years on, violent fighting between the military and armed resistance groups has left millions living in constant fear and insecurity.\nFood insecurity has reached \"unprecedented levels\", the UN's World Food Programme says, adding that rapid inflation has made food unaffordable for many.\nHere's more on why this earthquake is so devastating for an already war-torn country\nWhy is it so hard to find out what's happening in Myanmar?\nGetting information out of Myanmar is difficult.\nThe country has been ruled by a military junta since a coup in 2021, complicating access to information.\nThe state controls almost all local radio, television, print and online media. Internet use is also restricted.\nMobile signal in the affected areas is patchy, and tens of thousands live without electricity, making it difficult for the BBC to reach people there.\nForeign journalists are rarely allowed into the country officially.\nDespite these challenges, the BBC Burmese Service regularly covers the latest on Myanmar from Yangon, and a team has reached Mandalay - the city closest to where the quake struck - to bring updates on the aftermath.\nMandalay was the 'city of gold' - now it reeks of death\nKelly Ng\nReporting from Singapore\nMandalay used to be known as the city of gold, dotted by glittering pagodas and Buddhist burial mounds, but the air in Myanmar’s former royal capital now reeks of dead bodies.\nSo many corpses have piled up since a 7.7 magnitude earthquake struck last Friday close to Mandalay, that they have had to be \"cremated in stacks\", one resident says.\nThe death toll from the quake and a series of aftershocks has climbed past 2,700, with 4,521 injured and hundreds still missing, Myanmar's military chief said. Those figures are expected to rise.\nResidents in the country's second most populous city say they have spent sleepless nights wandering the streets in despair as food and water supplies dwindle.\nRead more on how they've been living out of tents, fearing what's left of their homes will not hold up against the aftershocks\nMyanmar junta fires at aid convoy\nWe have just received news that Myanmar's military fired at a convoy that was bringing aid into quake-hit areas Tuesday night.\nThe Ta'ang National Liberation Army (TNLA), an armed rebel group, said military troops shot at a convoy of nine vehicles using heavy machine guns as it was passing through the Naung Cho township in the northern Shan state, en route to Mandalay.\nThe TNLA said the convoy had informed the junta of its route and aid delivery plans. However the military said it was not notified that the convoy would be passing through, and that it opened fire because did not stop.\nNo one was injured, the junta claims, adding that it is investigating the incident.\nWreckage of houses and ancient pagodas in Sagaing\nHtet Naing Zaw\nBBC Burmese, reporting from Sagaing\nWe have just reached Sagaing, across the Irrawady river from Mandalay.\nSagaing is just 25km from Mandalay, a journey that would ordinarily take about half an hour. But it has taken us three hours to get here.\nFriday’s massive earthquake damaged the two main bridges between Mandalay and Sagaing, rendering them impassable. So, we had to take a longer route through the Amarapura township.\nThe bridge collapse has meant that little help and aid has reached Sagaing in the past few days. But this is changing.\nWe encountered traffic en route to the city - much of it made up of rescue teams and local aid.\nAs we drove by, we saw the collapsed Sagaing bridge on our left and wreckage of ancient pagodas on the right. This region is also home to many Buddhist temples, some hundreds of years old, including the U Min Thonze Pagoda, which is more than 900 years old. We’ve heard that many of these did not survive the quake.\nA rescue worker from Sagaing told us last Saturday that at least a third of all buildings there have been destroyed. As per a 2014 report, there are about 30,000 structures in the region. We can see that as we drive through the streets - three out of every five houses have collapsed.\nWe have driven the length of the country through Naypyitaw, Kyaukse and Mandalay. Sagaing is the worst I’ve seen so far.\nWhat have armed groups and the military said about a ceasefire?\nNick Marsh\nReporting from Bangkok\nRebels fighting in Myanmar's civil war unilaterally declared a ceasefire in an effort to support the humanitarian response to Friday's devastating earthquake.\nThe death toll has now risen to 2,700 but in the past the military junta has played down the death toll in other disasters.\nBut in state media, the country's ruling military junta said that it would not be stopping its offensives, both on land and from the air.\nAid agencies say food, water, medicine and shelter are in very short supply in Myanmar and urged the international community to ramp up relief efforts before the monsoon season arrives next month.\nThe UN has accused the junta of weaponising the aid that has arrived, by blocking it at checkpoints to areas held by rebel groups -- which could comprise up to three-quarters of the country.\nForeign rescue help is being led by the regime's traditional allies Russia and China. A small aid team from the United States is yet to arrive.\nCivil war severely hinders earthquake relief\nEven before the earthquake, Myanmar has been ravaged by a bloody civil war, a crippled economy and widespread disillusionment since the military took power in a coup in 2021.\nFriday's quake and its series of aftershocks adds to the suffering of the country's 50 million people, and the patchwork of civil conflicts has not helped with relief efforts.\nAid workers have reported challenges getting aid through to the worst-hit areas, with some saying they have not been granted authorisation by the junta. Splintered control on the ground - with parts of the country controlled by junta forces, and others by armed rebel groups - also hinder efforts to move resources where they are most needed.\nPoor infrastructure adds another hurdle. Many hospitals in rebel-held areas have been bombed, while the quake has also buckled highways crucial for getting to areas stricken by the quake.\nHere's more on how the earthquake has added to the war-torn country's troubles.\nJunta rejects ceasefire proposals\nMyanmar's military chief has rejected ceasefire proposals from rebel groups meant to facilitate rescue operations and aid delivery to quake-stricken areas.\nA shadow government formed by lawmakers removed in the 2021 military coup had announced a two-week ceasefire on Sunday, saying poor infrastructure and a patchwork of conflicts are severely hampering the relief effort.\nHowever junta chief Min Aung Hlaing has accused groups allied to the shadow government of exploiting the pause.\n“Some ethnic armed groups may not be actively engaging in battles right now, but they are gathering and training in preparation for attacks.\n\"Since this is a form of aggression, the military will continue necessary defense operations,” he said during a fundraising event in the capital city Nay Pyi Taw on Tuesday.\nAccording to local media reports, the military has continued its offensives across the country in the past few days, including opening fire on villages in the quake-hit region.", "url": "https://www.bbc.com/news/live/c2dep0r5ygnt"}