{"authors": ["Mahjooba Nowrouzi", "www.facebook.com"], "date_download": "2025-04-26 07:46:44", "date_modify": "2025-04-26 07:46:44", "date_publish": "2025-02-27 00:59:13", "description": "The Taliban say 90,000 CCTV cameras in Kabul will reduce crime but there are fears for human rights.", "filename": "news_articles_cjev9kzxeqqo_1745653604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ec83/live/bcb7b430-f286-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjev9kzxeqqo_1745653604.html", "title": "Inside the Taliban's surveillance network monitoring millions", "title_page": "Inside the Taliban's surveillance network monitoring millions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In a crowded control centre, surrounded by dozens of TV screens, the Taliban's police force proudly shows off its newly-acquired network of 90,000 CCTV cameras - used to watch over the day-to-day lives of millions of people.\n\"We monitor the entire city of Kabul from here,\" says Khalid Zadran, a spokesperson for the Taliban police chief, pointing to one of the screens.\nThe authorities say such surveillance will help fight crime, but critics fear it will be used to clamp down on dissent and to monitor the strict morality code enforced by the Islamist Taliban government under their interpretation of Sharia law.\nThe BBC are the first international journalists allowed to see the system in action.\nInside the control room, police officers sit in rows watching the live streams from thousands of cameras, keeping tabs on the lives of the six million people who live in Kabul.\nFrom car licence plates to facial expressions, everything is monitored.\n\"In certain neighbourhoods, when we notice groups of people and suspect they might be involved in drug use, criminal activities, or something suspicious, we quickly reach out to the local police,\" says Zadran.\n\"They arrive swiftly to investigate the nature of the gathering.\"\nUnder the previous government, Kabul was threatened daily with attacks from the Taliban and so-called Islamic State militants, as well as high profile kidnappings and car-jackings. When the Taliban retook power in 2021, they promised to crack down on crime.\nThe dramatic increase in the number of surveillance cameras in the capital is a sign of growing sophistication in the way the Taliban enforce law and order. Before their return, just 850 cameras were in place in the capital, according to a spokesman for the security forces that were driven from power.\nHowever, in the past three years, the Taliban authorities have also introduced a range of draconian measures limiting people's rights and freedoms, especially those of women. The Taliban government has not been formally recognised by any other country.\nThe surveillance system the BBC is shown in Kabul features the option to track people by facial recognition. On the corner of one screen images pop up with each face categorised by age range, gender, and whether or not they have a beard or a face mask.\n\"On clear days, we can zoom in on individuals [who are] kilometres away,\" says Zadran, highlighting a camera positioned up high that focuses on a busy traffic junction.\nThe Taliban even monitor their own personnel. At a checkpoint, as soldiers popped open the trunk of a car for inspection, the operators focused their lenses, zooming in to scrutinise the contents within.\nThe interior ministry says the cameras have \"significantly contributed to enhancing safety, curbing crime rates, and swiftly apprehending offenders\". It adds the introduction of CCTV and motorcycle controls have led to a 30% decrease in crime rates between 2023 and 2024 but it is not possible to independently verify these figures.\nHowever, rights groups are concerned about who is being monitored and for how long.\nAmnesty International say installing cameras \"under the guise of 'national security' sets a template for the Taliban to continue their draconian policies that violate fundamental rights of people in Afghanistan - especially women in public spaces\".\nBy law women are not allowed to be heard outside their houses, although in practice this is not being strictly enforced. Teenage girls are prevented from accessing secondary and higher education. Women are barred from many forms of employment. In December, women training as midwives and nurses told the BBC they had been ordered not to return to classes.\nWhile women continue to be visible on the streets of cities like Kabul, they are required to wear a face covering.\nFariba*, a young graduate who lives with her parents in Kabul, has been unable to find work since the Taliban came to power. She tells the BBC there is \"significant concern that surveillance cameras may be used to monitor women's hijabs [veils]\".\nThe Taliban say only the city police have access to the CCTV system and the Propagation of Virtue and Prevention of Vice Ministry – the Taliban's morality police - does not use it.\nBut Fariba is concerned the cameras will further endanger those opposed to Taliban rule.\n\"Many individuals, especially ex-military members, human rights advocates and protesting women, struggle to move freely and often live in secrecy,\" she says.\n\"There is significant concern that surveillance cameras will be used to monitor women's hijabs too,\" she says.\nHuman Rights Watch, meanwhile, says Afghanistan does not have the data protection laws in place to regulate how the collected CCTV footage is held and used.\nThe police say the data is kept only for three months, while, according to the interior ministry, the cameras do not pose a threat to privacy as they \"are operated from a special and completely confidential room by a specific and professional person in charge\".\nThe cameras appear to be Chinese-made. The control room monitors and branding on the feeds the BBC saw carried the name Dahua, a Chinese government-linked company. Earlier reports that the Taliban were in talks with China's Huawei Technologies to buy cameras were denied by the company. Taliban officials refused to answer BBC questions about where they sourced the equipment.\nSome of the cost of installing the new network is falling on ordinary Afghans who are being monitored by the system.\nIn a house in central Kabul the BBC spoke to Shella*, who was asked to pay for some of the cameras installed on the streets near her home.\n\"They demanded thousands of afghanis from every household,\" she says. It's a large amount in a country where those women who have jobs may earn only around 5,000 afghanis ($68; £54) a month.", "url": "https://www.bbc.co.uk/news/articles/cjev9kzxeqqo"}