{"authors": ["Justin Parkinson", "www.facebook.com"], "date_download": "2025-05-19 15:28:54", "date_modify": "2025-05-19 15:28:54", "date_publish": "2015-02-05 01:42:57", "description": "It's 100 years since British passports started including photographs. How have they changed?", "filename": "news_magazine-30988833_1747668534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80779000/jpg/_80779795_passport_puff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_magazine-30988833_1747668534.html", "title": "How have passport photos changed in 100 years?", "title_page": "How have passport photos changed in 100 years? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's 100 years since British passports first included photographs. How have they changed?\nIt can be a pain getting passport photos right. Smiling, frowning, hats (unless worn for religious reasons), leaning sideways, dark backgrounds, hair over eyes, red eye, glasses, sunglasses - there is a long list of no-nos, external. Anything wrong and Her Majesty's Passport Office may return the application.\nBut it hasn't always been like this. When the British government introduced passport photographs in February 1915, the rules were more lax. Whole families, rather than just one person, could be shown. As long as faces were visible, the pose and location of those involved did not matter.\nRather than sit in a booth as one would today, Sherlock Holmes author Sir Arthur Conan Doyle, in 1915, stood with his wife as his two sons sat in a dog cart.\nA year later, Archbishop of Canterbury Randall Davidson appeared in his robes, crozier - the staff signalling care of his flock - in hand. The photograph was used for a passport allowing him to visit troops on the Western Front.\nIn France, where there was a similar lack of rules, a woman wore a hat looking like a dead pheasant. One mother and child were even photographed on the beach.\n\"Although photography had been around for more than half a century, its adoption seems to have caught the authorities by surprise,\" says Martin Lloyd, external, author of The Passport: The History of Man's Most Travelled Document. \"They made no rules on how to pose for a picture. They were simply asked to send one in. So they did.\"\nBritish passports came in the form of a foldable single sheet of paper. The individualism shown by applicants was perhaps a symptom of a longstanding aversion to officialdom. In 1835, Foreign Secretary Lord Palmerston became embroiled in a row with the Belgian government, which had told him British passports should include physical descriptions of holders, such as height and eye colour. He refused, calling such requirements \"degrading and offensive\".\n\"He didn't want British people being perused by foreigners,\" says Lloyd, who worked as an immigration official for 25 years. \"That situation continued until the beginning of World War One.\"\nOther countries, including the US and France, started adding descriptions of people's physical characteristics during the 19th Century. By the time WW1 started in 1914, there were widespread fears of German spies operating in Britain, so the lack of a photograph or description on the country's passports came in for greater criticism.\nConcerns increased following the capture and execution, in November 1914, of Carl Hans Lody, who had spied on Britain for Germany using a fake US passport, external. \"They realised in Britain that the passport as it was did not in fact identify the people,\" says Lloyd.\nThe British Nationality and Status of Aliens Act of 1914 made both a photograph and a personal description compulsory. Not all were happy with official amendments. Just a fortnight after the law came into force in 1915, the explorer and natural historian Bassett Digby wrote to the Times about the Foreign Office's \"high-handed methods\".\n\"On the form provided for the purpose I described my face as 'intelligent',\" he complained. \"Instead of finding this characterisation entered, I have received a passport on which some official, utterly unknown to me, has taken it upon himself to call my face 'oval'.\"\nThe passport, the first known English version of which dates back to the early 15th Century, had to be signed by the foreign secretary until 1857 and featured a printed signature afterwards.\nA further change came in 1920, following a decision by the League of Nations to standardise passports. The blue cardboard-covered British booklet passport, the last of which expired in 2003, came into being. This was designed to prevent excessive folding of the single-sheet version, known to damage enamelled photographs.\nBy 1926, when the second version of the booklet passport was introduced, the requirement was for two duplicate, unmounted photographs printed on thin paper, \"full face\" showing, with no hats worn, which remains the norm. Pictures had to be a certain size to fit the box provided. This meant an end to the early free-for-all.\nIn 1941, the government specified the photograph size in inches, rather than just \"small\".\nCoin-operated photo booths, with origins as far back as the 1880s, came into wider usage in the 1950s, the same time as mass overseas tourism began, further homogenising passports.\n\"The very precise requirements of the Passport Office mean that passport photos are more standardised than they have ever been since 1915,\" says Michael Pritchard, external, director-general of the Royal Photographic Society, external. \"No smiling, straight-on and white backgrounds don't provide the flattering images of the traditional High Street photographer and we've probably lost something, which is a shame, especially as we all have to live with that image for 10 years.\"\nSmiling was banned in 2004, external, along with long fringes and dummies in babies' mouths. Today, passports, which come in the standard burgundy covers used within the European Union, must include colour photographs measuring 45mm by 35mm. There are more than 20 separate stipulations. Part of the reason is the introduction of biometrics - using the distances between facial features for more reliable identification - in 2006.\nThere is slightly more leeway for children, who have had to have passports separate from their parents since 1998. They can still smile, not having to adopt a \"neutral\" expression. Even so, it's a long way from the freedoms of 100 years ago.\nSubscribe to the BBC News Magazine's email newsletter to get articles sent to your inbox.", "url": "https://www.bbc.com/news/magazine-30988833"}