{"authors": ["Zoe Conway", "www.facebook.com"], "date_download": "2025-04-26 04:02:41", "date_modify": "2025-04-26 04:02:41", "date_publish": "2025-03-04 00:00:11", "description": "The policy is part of 250 additions to the Employment Rights Bill, although the amendment will not spell out what \"short notice\" means.", "filename": "news_articles_c981p02kgxeo_1745640161.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c2c1/live/1968c260-f876-11ef-a40e-1dcee1447ad7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981p02kgxeo_1745640161.html", "title": "Zero-hour agency workers to get paid if shift changed at short notice", "title_page": "Zero-hour agency workers to get paid if shift changed at short notice - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Agency workers who choose to be on zero-hour contracts will be eligible for compensation if their shifts are cancelled or changed at short notice, the BBC understands.\nThere are around one million agency staff in the UK, working across areas such as warehouses, in hospitality and within the NHS.\nThe policy comes as part of some 250 additions to the Employment Rights Bill which are set to be outlined, although the amendment on compensation will not spell out what \"short notice\" means.\nNew rules under the bill will also mean that agency workers will have to be offered a contract guaranteeing a minimum number of hours each week.\nWhile unions welcomed the inclusion of agency workers in the ban, the Recruitment and Employment Confederation (REC), which represents the sector, said the change should not \"undermine\" the \"flexibility\" that zero-hour contracts offer some workers.\nThe Labour government pledged last year to ban \"exploitative zero-hours contracts\" as part of the Employment Rights Bill.\nThe minimum hours offered in a contract to agency workers will be calculated according to the average number of hours they normally work.\nThe BBC understands that the government is yet to decide whether this will be based on a 12-week reference period or longer.\nTrade unions have been campaigning for agency workers to be included in the legislative changes to prevent employers getting round the proposed zero hours rules by hiring agency staff.\nPaul Novak, general secretary of the Trades Union Congress, said the government was right to close this \"loophole\".\nHe said agency workers \"make up a significant proportion of the zero-hours workforce and need protections from bad working practices too\".\nBut the REC said it was concerned about the change.\nIts deputy chief executive, Kate Shoesmith, said people choose agency work \"for the flexibility it provides at a time and stage in their life\" and that the new rules must not undermine that.\nShe added that time should be given \"to ensure any legislative changes do not conflict with existing and hard-won protections for agency workers\".\nThe REC would \"keep working with the government to ensure that,\" she said.\nOther amendments being tabled are expected to include the doubling of the penalty imposed on companies that engage in so-called \"fire and rehire'' practices.\nThis means that if they fail to properly consult employees before dismissing and then rehiring them on less favourable terms, they could be forced to pay the worker 180 days' worth of pay in compensation up from the current 90-day penalty payment.\nThe amendments also contain a commitment to extend sick pay to workers earning under £123 a week from the first day of their illness.\nThey will be entitled to 80% of their average weekly earnings or statutory sick pay - which is currently £116.75 per week – whichever is lowest.\nCurrently, to qualify for statutory sick pay, a worker must have been ill for three days in a row.\nThere will also be changes to rules around trade union recognition and the ability of unions to take industrial action.\nThe government is proposing that workers will have to give their employers 10 days' warning of any strike action – rather than the existing 14 days' notice.\nCurrently, there can be a ballot for union recognition if 10% of the workforce is a member of a union.\nThe government had been consulting on lowering it to 2% but the proposed amendment will not state a figure and will simply give the secretary of state the power to lower the 10% threshold.\nMr Novak said the changes were about ''creating a modern economy that works for workers and business alike'' and that driving up standards \"will stop good employers from being undercut by the bad, and will mean more workers benefit from a union voice\".\nSeveral business groups have been critical of the government for not providing more detail about how the legislation will work in practice.\nThey are unlikely to be satisfied by what is in the amendments.\nMartin McTague, national chair of the Federation of Small Businesses, said the majority of the trade association's members were \"very concerned\" about the Employment Rights Bill.\n\"Two thirds of small businesses are deciding that they're not going to take on any future employees. About a third are saying they might reduce their workforce as a result of these changes,\" he told the BBC's Today programme.\nMr McTague added the key issues with the bill were the government not helping small businesses to fund sick pay and the changes to day one dismissal rights.\n\"We're not sort of crying wolf, we're saying these will have really damaging effects and if the government wants the economy to grow they need small businesses on their side,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c981p02kgxeo"}