{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:18:08", "date_modify": "2025-05-19 15:18:08", "date_publish": "2017-08-10 00:00:00", "description": "Wall Street indexes fall after North Korea says it will have plans for a missile strike near Guam in a matter of days.", "filename": "news_live_business-40853283_1747667888.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_business-40853283_1747667888.html", "title": "US stocks fall as NK tensions build", "title_page": "Business Live: US stocks fall as NK tensions build - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "US stocks close down after escalating North Korea and US tensions\nUS indexes closed lower as investors continued to fret over escalating tensions between the US and North Korea.\nPresident Donald Trump on Thursday escalated his rhetoric on North Korea, saying his \"fire and fury\" comment might not be \"tough enough.\"\n\"Maybe that statement wasn't tough enough,\" Trump told reporters as he prepared to meet with top national security advisers. \"If anything, that statement may not be tough enough.\"\nHis comments came after North Korea said it was completing plans to fire four intermediate-range missiles over Japan to land near the US Pacific island territory of Guam, in an unusually detailed threat.\nThe Dow Jones Industrial Average was down 0.9% at 21,844.01 and the S&P 500 was down 1.5% at 2,438.21. The Nasdaq Composite lost 2.1% to 6,216.87.\nTech entrepreneurs on acid\nA fascinating piece in the FT, external digs into a San Francisco fashion among entrepreneurs for taking microdoses of LSD.\nAt a small dose, the illegal hallucinogen stimulates the mind, rather than causing a full-blown acid trip, the entrepreneurs claim.\nThey take it as an alternative to coffee as a bit of a pick-me-up, apparently.\nAnd it certainly seems to explain some of the impenetrable, jargon-heavy press statements issued by Silicon Valley firms, too.\nKylie Jenner's make-up brand could be worth $1bn by 2022, says her mum\nShe may be only 20, but Kylie Jenner may soon have a beauty business worth more than a billion dollars.\nFor the first time, the youngest Kardashian-Jenner has revealed how much money her Kylie Cosmetics brand makes.\nIn an interview with WWD, external, Kylie and her mum Kris Jenner revealed she's made $420m (£323m) in retail sales in 18 months.\nHer cosmetics brand has outsold established companies like Bobbi Brown and Lancome.\nRead more here.\nFSA: 'People deserve food they can trust'\nBBC Radio 5 live\nThe Food Standards Agency (FSA), which is investigating the importation of around 700,000 eggs from potentially contaminated Dutch farms, has told 5 live why it decided to withdraw some products from supermarkets despite saying the risk to health was \"very unlikely\".\nSteve Wearne, Director of Policy at the FSA, said: \"We think people deserve food they can trust and part of that is not having to eat food that's got chemicals in it that aren’t authorised, and that's the case with this. It's not supposed to be in food.\"\nEleven products containing egg - including sandwiches and salads - have been withdrawn from supermarkets. Asda, Waitrose, Sainsburys and Morrisons are affected.\nMr Wearne added: \"We've been working closely with UK industry to trace eggs up and down the food chain and that's helped us to come to this new figure: 700,000.\n\"It is a small proportion of the 10 billion eggs we eat in the UK each year.\"\nOff the menu...\nChris Johnston\nBusiness reporter, BBC News\nShares in Blue Apron, the US meal kit delivery company, have sunk 13% in New York today following its first results as a public company, external.\nNo prizes for guessing why they weren't appetising: despite a rise in the number of active customers to 943,000, they are spending less on orders amid stiff competition from the likes of Hello Fresh and Amazon. Costs also soared and the company reported a net loss of $31.6m (£24.3m).\nBlue Apron only listed in late June, but its shares have since fallen 45% to $5.42. Ouch.\nUS 'to use Reagan-era trade weapon'\nThe US risks using a dud in bringing back a 1980s era trade weapon, Bloomberg Politics reports., external\nIt's weighing up an investigation into alleged Chinese intellectual property infringement using section 301 of the 1974 Trade Act.\nBut that was only successfully used in retaliatory action twice, Bloomberg says.\nThe US has had a far better hit-rate under WTO arbitration, it adds.\nBesides, China has levers it can pull if a trade war erupts, including targeting imports of soya beans from the US, which exceeded $14bn (£11bn) last year.\nSterling touches three week low against the dollar\nSterling touched a three-week low against the dollar as a mixed bag of output and trade data did little to boost investor enthusiasm for an economy struggling to meet Bank of England targets.\nThe pound fell by as much as a third of a percent in early trade to as low as $1.2952 before recovering some ground after industrial production numbers just beat analyst forecasts.\nIt's trading about 0.1% down at $1.2989.\nConstruction output was weaker than expected and other data showed the UK's external trade gap expanded further despite the weakening of the pound over the past year.", "url": "https://www.bbc.com/news/live/business-40853283"}