{"authors": ["Claire Hamilton", "www.facebook.com"], "date_download": "2025-04-26 08:03:09", "date_modify": "2025-04-26 08:03:09", "date_publish": "2025-02-26 16:29:00", "description": "The leader of Liverpool City Council says it \"should have dealt better\" with communications.", "filename": "news_articles_cr426vy5dwgo_1745654589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7fcf/live/595c7440-f45a-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr426vy5dwgo_1745654589.html", "title": "Liverpool: Council 'sorry' over Caribbean centre proposal", "title_page": "Liverpool: Council 'sorry' over Caribbean centre proposal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council leader has apologised for the way the authority handled plans to build a new school on the site of a Caribbean community centre.\nLiverpool City Council said it wanted all-girls Muslim faith school built on land it owns off Upper Parliament Street in Toxteth, to help address a shortage of secondary places in the south of the city.\nBut trustees of the African Caribbean Community Centre, which currently uses the site, said they had not been properly consulted.\nSpeaking on BBC Radio Merseyside, leader of Liverpool City Council Liam Robinson said \"over many years we could and should have dealt better in our communications with the Caribbean centre \".\nAbout 100 people gathered outside a council meeting to protest against the plans.\nCaribbean Centre board member Linda Priddie, whose father helped found it in the 1970s said she felt the council was reluctant to engage with the group, and that there had been no meaningful consultation.\nShe said \"we had no indication that this was going on\", that the council had been \"duplicitous\" and that the situation \"was not good for community cohesion\".\nShe said the centre was \"open to everyone\" and a \"valuable resource in L8\".\nShe added: \"We are not moving under any circumstances.\n\"I was brought up there, my children have been to activities there and I'd like to take my grandchild there and say 'this is your place'.\n\"As far as I am aware there are other sites which might not tick as many boxes as this one, but this is not the only site.\"", "url": "https://www.bbc.co.uk/news/articles/cr426vy5dwgo"}