{"authors": ["Olivia Copeland", "www.facebook.com"], "date_download": "2025-04-26 07:04:46", "date_modify": "2025-04-26 07:04:46", "date_publish": "2025-02-28 06:39:57", "description": "Four free pilot sessions for women who have experienced birth trauma will be held.", "filename": "news_articles_cd7ee2prj78o_1745651086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/97a8/live/8c4db870-f52a-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ee2prj78o_1745651086.html", "title": "Birth trauma counselling sessions to be trialled", "title_page": "Birth trauma counselling sessions to be trialled in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Women who have experienced birth trauma could receive help to process their experience through group sessions, the government has said.\nThe States' Health and Social Care department currently runs individual sessions through its mental health and wellbeing service Healthy Minds.\nA group of eight to 10 women who have referred themselves for help will be invited to four free pilot sessions.\nA HSC spokesperson said if research finds the sessions successful, they will be offered to more women.\nThey added birth trauma can impact women for months or years after giving birth, and could be similar to symptoms of anxiety or depression.\nThe HSC department said those who take part would not be required to share their experiences with the group.\nDr Amy Gilmour, a counselling psychologist who will lead the sessions, said women can refer themselves for help online or by emailing Healthy Minds.\nShe said: \"Some women can feel an element of shame that they aren't coping well enough when they experience birth trauma.\n\"The most important thing they can do is know it isn't their fault and know there is help for them out there.\"", "url": "https://www.bbc.co.uk/news/articles/cd7ee2prj78o"}