{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:06:40", "date_modify": "2025-04-26 04:06:40", "date_publish": "2025-03-03 16:29:30", "description": "A hospital focuses on carpal tunnel surgery with 47 operations at the weekend.", "filename": "news_articles_c9q402e57qwo_1745640400.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d77d/live/4d921aa0-f844-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q402e57qwo_1745640400.html", "title": "Suffolk hospital's 'Super Saturday' surgeries tackle waiting lists", "title_page": "Suffolk hospital's 'Super Saturday' surgeries tackle waiting lists - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hospital team offered what it called a \"Super Saturday\" of 47 surgeries to tackle patient waiting lists.\nWest Suffolk Hospital in Bury St Edmunds, Suffolk, had 154 people on a carpal tunnel surgery waiting list towards the end of last month.\nCarpal tunnel syndrome causes tingling, numbness or pain in the fingers, hands and arms due to pressure on a nerve in the wrist.\nThe NHS said Super Saturday on 22 February reduced the list by 30.5% which Dr Michael Dunne described as a \"brilliant\" effort.\nSuper Saturdays are part of the hospital's 12-month programme to reduce waiting times.\nOn the day, the teams made used of all three operating theatres in the day surgery unit with more than 20 members of staff involved.\n\"Carpal tunnel syndrome can be an extremely achy and painful condition... severely affecting everyday life,\" Dr Dunne, a trauma and orthopaedic surgeon, explained.\n\"It is brilliant that through the efforts of our waiting list and clinical teams and a quick procedure, we can give so many people their lives back, helping them regain their independence and return to doing the things they love most.\"", "url": "https://www.bbc.co.uk/news/articles/c9q402e57qwo"}