{"authors": ["Madeline Halpert", "www.facebook.com"], "date_download": "2025-04-26 04:04:32", "date_modify": "2025-04-26 04:04:32", "date_publish": "2025-03-03 18:56:57", "description": "Kennedy previously called the outbreak \"not unusual\", but now says it's a \"top priority\".", "filename": "news_articles_c99n18zlzg3o_1745640272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b215/live/bb539e30-f856-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99n18zlzg3o_1745640272.html", "title": "RFK Jr changes stance on measles outbreak as virus spreads", "title_page": "RFK Jr changes stance on measles outbreak as virus spreads - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Health Secretary Robert F Kennedy Jr has shifted his stance on the US measles outbreak, now calling it \"serious\" after previously describing it as \"not unusual\".\nThe outbreak has sickened over 140 children in western Texas, while several other states also are battling cases.\nLast week, Kennedy - who has spread misinformation about childhood vaccinations - faced a backlash from public health experts after he appeared to minimize the outbreak, which killed an unvaccinated six-year-old for the first time in a decade.\nThen on Friday, in a post on X, the health secretary backtracked, saying: \"I recognize the serious impact of this outbreak on families, children, and healthcare workers\".\n\"The measles outbreak in Texas is a call to action for all of us to reaffirm our commitment to public health,\" he wrote.\nAs of last week, the US reported a total of 164 measles cases in nine states, including Texas, neighbouring New Mexico, California and Georgia. Washington state reported its first case in an infant over the weekend.\nDuring his first public appearance in the Oval Office last week, after the first measles death was announced, Kennedy told reporters the US has measles outbreaks \"every year\".\nBut in an essay published on Fox News on Sunday, he struck a different tone, calling the outbreak a \"top priority\". Kennedy encouraged parents to talk to their doctors about vaccinations against measles. He noted the vaccines \"not only protect individual children from measles, but also contribute to community immunity, protecting those who are unable to be vaccinated due to medical reasons\".\nMeasles is a dangerous virus that can lead to a host of complications including pneumonia, brain swelling and death.\nA large portion of the population - more than 90% - needs to be vaccinated to help protect those who cannot get the shot, including pregnant people, children under one year and the immunocompromised.\nIn Gaines County in western Texas, where the measles outbreak began, as few as 82% of kindergartners are vaccinated against the virus.\nKennedy had yet to encourage people to get vaccinated, a move local health officials said was critical to help slow the spread of the virus.\n\"It would be nice to have some confidence coming out of the powers-that-be - at the national level - to show that this is a good vaccine,\" Ron Cook, a family physician and Lubbock health official leading the response against measles, told the BBC last week, before Kennedy's op-ed.\nIn the past, Kennedy has repeated widely debunked claims about childhood vaccinations, though he changed course this year, saying during his confirmation hearing that he supported immunizations.\nThe US declared measles \"eliminated\" from the country in 2000, but in recent years, as anti-vaccine sentiments has risen, the country has seen several outbreaks of the virus.", "url": "https://www.bbc.co.uk/news/articles/c99n18zlzg3o"}