{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:29", "date_modify": "2025-05-19 14:25:29", "date_publish": "2015-04-10 14:00:05", "description": "Police were told a burglar alarm had gone off at the scene of the Hatton Garden safety deposit raid - but decided it did not require a response.", "filename": "news_uk-england-london-32253724_1747664729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82170000/jpg/_82170312_82170126.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-london-32253724_1747664729.html", "title": "Hatton Garden raid: Police failed to respond to alarm", "title_page": "Hatton Garden raid: Police failed to respond to alarm - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Police were told an intruder alarm had gone off at the scene of the Hatton Garden safe deposit box raid but decided it did not require a response.\nAbout 70 safety deposit boxes were opened at the Hatton Garden Safe Deposit Ltd in central London over the Easter Bank Holiday weekend.\nThe Met Police said they received a call on Friday 3 April at 00:21 BST.\nOfficers are now investigating why the call was given a grade that meant no police response was deemed necessary.\nIn a statement, the Met Police said: \"It is too early to say if the handling of the call would have had an impact on the outcome of the incident.\"\nMeanwhile CCTV footage has emerged which appears to show the group of burglars behind the raid.\nThe video, obtained by the Mirror, external, shows men in high visibility jackets outside the safe deposit building.\nOne is seen pushing a wheelie bin, which the paper said could have contained the large drill used for breaking a hole through the lift shaft.\nThe Mirror said the men made two separate visits before leaving on Easter Sunday with the contents of 72 safety deposit boxes in wheelie bins and bags and making a getaway in a white van.\nA source told the paper the raid was the work of a professional gang who \"planned this job down to every last detail\".\nScotland Yard has declined to comment on the footage.\nThe Met Police has said items were stolen from at least 56 safety deposit boxes and officers are in the process of contacting the holders.\nIn total, 72 boxes were opened. Five were vacant and 11 were due to be opened by the company following the non-payment of fees, police said.\nBBC Home Affairs Correspondent Danny Shaw said: \"It is quite possible - and this is certainly one aspect that the inquiry will be looking at - that there had been so many false alarms previously that the police had decided not to respond to any more alerts.\n\"There is a police policy that if there are three false alarms in a 12-month period they won't respond anymore when intruder alarms go off and it is possible that may well have been what happened here.\"\nHe added that the security guard at the building had also been spoken to by officers.", "url": "https://www.bbc.com/news/uk-england-london-32253724"}