{"authors": ["Mike Wendling", "www.facebook.com"], "date_download": "2025-04-26 06:14:48", "date_modify": "2025-04-26 06:14:48", "date_publish": "2025-03-01 23:37:03", "description": "The Ukrainian president's military-style attire was questioned by a Maga media star before he was upbraided by President Trump and JD Vance.", "filename": "news_articles_c1d4r9yvqzpo_1745648088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ce68/live/cb4a1050-f714-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4r9yvqzpo_1745648088.html", "title": "How criticism of Zelensky's clothing made it to the Oval Office", "title_page": "How criticism of Zelensky's clothing made it to the Oval Office - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It was the first thing President Donald Trump said when Ukraine President Volodymyr Zelensky stepped out of his car at the White House on Friday.\n\"You're all dressed up today,\" Trump said as he greeted him, referring to Zelensky's military-style black sweatshirt, adorned with the Ukrainian trident.\nZelensky has eschewed suits, button-down shirts and ties - even during important meetings with world leaders and an address to the US Congress - since the start of the full-scale Russian invasion of his country began in 2022.\nThe Ukrainian leader has said his choice of clothing is a show of solidarity with soldiers fighting the Russian army on the war's frontlines.\nBut it has long been an irritant for some critics of US aid to Ukraine, and after years as a talking point in right-wing media circles, the issue came to global attention in a spectacular way during Friday's now infamous Oval Office meeting with Trump and US Vice-President JD Vance.\nA question to Zelensky from a reporter accused him of disrespecting the occasion by not wearing a suit and this immediately changed the atmosphere in the room, according to BBC reporters present.\nAnd a short time later, larger issues of respect and gratitude fuelled the extraordinary argument that saw the US president and vice-president upbraid their European ally in front of the world's TV cameras.\nWhen the meeting was opened up to questions from reporters, one came from Brian Glenn, chief White House correspondent for conservative cable network Real America's Voice.\n\"Why don't you wear a suit?\" Glenn asked. \"You're at the highest level in this country's office, and you refuse to wear a suit.\n\"Do you own a suit?\" he continued. \"A lot of Americans have problems with you not respecting the dignity of this office.\"\nThe aggressive questioning marked the moment when the Ukrainian president – who until then seemed to be having a diplomatic, even friendly, conversation with Trump – first appeared tired and irritated.\n\"I will wear costume after this war will finish,\" Zelensky replied. (The word \"suit\" can be translated into Ukrainian as \"kostyum\".)\nThe Ukrainian president then made a verbal jab at the reporter.\n\"Maybe something like yours, yes. Maybe something better, I don't know,\" he said, to laughter in the room. \"Maybe something cheaper.\"\nGlenn's question gave voice to a longstanding gripe in the world of Make America Great Again (Maga) politics, where some - like JD Vance - argue that the Ukrainian leader does not seem to be showing enough gratitude or respect to the US for three years of military aid.\nA former local TV reporter in Dallas who became better known in conservative circles for his work at another pro-Trump channel, Right Side Broadcasting Network, Glenn is an unabashed Trump fan. Last year he told Politico, external that he was \"100 percent behind President Trump and the America First agenda.\"\nHe is also reportedly dating Marjorie Taylor Greene, the Georgia congresswoman who is one of Trump's most outspoken supporters.\nGlenn was in the room as part of the White House press pool, a group of reporters which covers the president at official events on behalf of the wider media.\nThe Trump administration took control of the pool this week from an association of journalists, saying it would give more access to \"new voices\". It has continued to bar the Associated Press from the pool.\nReal America's Voice, which was founded in 2020, is a relatively obscure right-wing cable news outlet, one of several pro-Trump channels that have cropped up in recent years. Its guests and hosts have spread conspiracy theories about a variety of subjects, including the 2020 presidential election, the 2021 Capitol riot and QAnon.\nIts show line-up includes some big names from the Maga world, including Trump's former chief advisor Steve Bannon, classic rocker turned political activist Ted Nugent and Charlie Kirk, the founder of the conservative Turning Point group. The BBC contacted the network for comment.\nAfter the Oval Office spat, Glenn posted online that he had \"extreme empathy for the people of Ukraine\" but said that Zelensky's lack of a suit demonstrated \"his inner disrespect\" for the US.\nZelensky's defenders online posted pictures of Winston Churchill wearing casual clothes during World War Two.\nPictures from the period show the British leader wearing jumpsuit-like clothes to a meeting with then-US President Franklin Roosevelt, and he also wore military uniforms and suits during conflabs with world leaders.", "url": "https://www.bbc.co.uk/news/articles/c1d4r9yvqzpo"}