{"authors": ["James Dundon", "Julia Gregory", "www.facebook.com"], "date_download": "2025-04-26 04:25:58", "date_modify": "2025-04-26 04:25:58", "date_publish": "2025-03-03 11:47:05", "description": "The man who created 100 tiny wooden houses for the trail says he might take them all down.", "filename": "news_articles_cvgwwnvv7rvo_1745641558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8993/live/99e95ae0-f50a-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwwnvv7rvo_1745641558.html", "title": "Truro fairy doors creator disenchanted by vandalism", "title_page": "Truro fairy doors creator disenchanted by vandalism - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The creator of a series of wooden fairy houses says he can see no option but to take them all down after they were repeatedly vandalised.\nJohn Rowe made the Enchanted Trail at Coosebean Woods in Truro during the coronavirus pandemic in 2020 to \"lift morale\".\nHe has since created 100 intricate wooden houses, some of them in memory of local people who have died, but said he was dismayed by the latest spate of vandalism.\nMr Rowe said he had taken down two of the miniature houses already as it was \"monotonous when you come along and see damaged doors lying on the floor\".\nDamage over the last five years has included doors being ripped off, windows pushed in and wooden posts uprooted.\nMr Rowe said he had asked Truro City Council to install security cameras in the area but this had been declined.\nHe said he had tried not to blame vandals for the damage but after a while it became obvious they were the culprits.\nHe said: \"I made excuses all the time saying perhaps it was an accident, perhaps the door wasn't strong enough, but it wasn't that all, it was people.\"\nDog walker Olivia Bundy said the vandalism in January was probably the worst there had been but it had happened many times before.\n\"John's tried everything he could to stop this from happening, even raising awareness of what the houses mean to people and to kids,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cvgwwnvv7rvo"}