{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:44:00", "date_modify": "2025-04-26 07:44:00", "date_publish": "2025-02-26 18:08:59", "description": "The Vice President of the States has decided no further action will be taken.", "filename": "news_articles_clyj4qvrj3jo_1745653440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0293/live/fc336bc0-f3a0-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj4qvrj3jo_1745653440.html", "title": "No action taken after Alderney States' President complaint", "title_page": "No action taken after Alderney States' President complaint - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "No further action will be taken after a code of conduct complaint against the president of the States of Alderney.\nBruce Woodhead resigned from the States of Alderney in December 2024 and submitted the complaint against President William Tate on 6 February.\nThe Vice President of the States, Steve Roberts, decided no further action would be taken. However, Woodhead said Roberts had a \"conflict of interest\" and, in his view, the complaint still stood \"until it is properly dealt with\".\nThe BBC has approached Roberts for a comment, while Tate said he would not comment on the complaint.\nWoodhead said Tate had been \"totally biased\" against the States' former chief executive Theo Leijser during a Policy and Finance Committee meeting in December 2024 at which Leijser's employment status was discussed.\nWoodhead said in his complaint Tate had been \"incensed\" by a press release about the departure of Nigel Vooght, who had stepped down as chair of the Policy and Finance Committee days before the committee meeting.\nHe said Tate had told the committee Mr Leijser \"should not have passed comment\" on the departure of Vooght, \"either good or bad\".\nWoodhead said it had turned the meeting \"into a kangaroo court\", and that committee members had subsequently voted by six to two in favour of terminating Leisjer's employment contract.\nIn January, the States of Alderney announced Leisjer's departure, although no reason was given.\nIn response to the complaint, Roberts said the complaint \"has not been substantiated\" and \"determined that that no further action will be taken\".\nWoodhead said Roberts had a \"conflict of interest\" as he had attended the meeting.\nThe States of Alderney had been due to agree the Commissioner for Standards for both Jersey and Guernsey, Dr Melissa McCullough, should have her role extended to Alderney in December 2024, but the planned vote on the appointment was withdrawn.", "url": "https://www.bbc.co.uk/news/articles/clyj4qvrj3jo"}