{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:55:49", "date_modify": "2025-05-21 06:55:49", "date_publish": "2025-03-29 00:00:00", "description": "Tens of thousands of people are lining Newcastle's streets for an open top bus parade.", "filename": "news_live_cpdewx7jvdvt_1747810549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f3ba/live/effb5c40-0cbf-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cpdewx7jvdvt_1747810549.html", "title": "Howay! Newcastle celebrates Carabao Cup win", "title_page": "Howay! Newcastle celebrates Carabao Cup win - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight from us after a memorable day\nPamela Tickell\nBBC News, North East and Cumbria\nThat's all for our live coverage tonight.\nIt's been a day no-one in Newcastle will ever forget. Remarkable and emotional.\nNewcastle United legend Alan Shearer summed it up perfectly, I think.\n\"We could get used to this.\"\nThe story of the day in pictures\nIt has been a pretty special day in Newcastle - it was a long-time coming but when it did, the Toon Army made sure it was something that would live long in people's memories.\nHere's a selection of photos telling the story of the day.\n'No strangers in the centre of Newcastle today'\nKelly Scott\nBBC Radio Newcastle\nWhat a moment it was to be in Newcastle today.\nOutside St James' Park, the only colours to be seen were black and white.\nNewcastle United fans of all ages were out in force to celebrate team bringing back the Carabao Cup - a trophy fans have been waiting more than 70 years for.\nAnd they were more than ready to welcome it.\nThere were groups of friends cheering aloud, families with young kids and picnics, children on their parents' shoulders with flags flying and eyes full of happy tears.\nEven shop workers were dipping out from behind the till to take a look, drivers were beeping their horns, and black and white flags were waving out of all windows.\nSeeing Eddie Howe's face revealed on a giant flag hung 10 storeys high on a hotel caused an earth shattering roar of approval.\nThere seemed to be no strangers in the centre of Newcastle today - its a family of proud Geordies.\nAnyone who was lucky enough to be part of the celebrations today will never forget it.\nThis has been a night to remember\nJim Scott\nBBC North East & Cumbria\nWell what an evening it’s been on the Town Moor.\nThere has been celebration after celebration. There’s been laughter, lots and lots of crying but above all, fans have told me how this will be a night to remember.\nNow, the big question - how do tens of thousands of fans get home any time soon? After all, some have travelled from as far away as Australia.\nThe roads are expected to be extremely busy as they all navigate their way out of the city.\nMeanwhile public transport is also set to be congested for some time as bus and rail services deal with a huge influx of fans.\nListen: Dan Burn says the parade was unforgettable\nDan Burn, who scored the first goal in Newcastle's 2-1 victory in the Carabao Cup at Wembley says today is \"something I'll never forget.\"\n\"The lads were starting chants all the way down, you could hear the fans doing it.\n\"Just being able to take in that moment. It's only an hour, but it's an hour I'll never, ever forget.\"\nPlayers and manager speak about huge support of crowd\nJim Scott\nBBC North East & Cumbria\nIf you’re lucky enough to be right at the front of the pen, you have incredible front row positions to feel the atmosphere and the banter as Ant & Dec quiz Eddie Howe and his team.\nHowe says \"we're nothing without the support of you\".\nWembley goal hero Dan Burn tells Dec he feels numb as they’re not used to winning trophies. He says he had to stay composed as the bus travelled through the city.\nAlexander Isak gives fans his best Geordie accent: \"Areet wor kid?\"\nEddie Howe says the team 'now wants more'\nThe Newcastle manager Eddie Howed said the whole team felt the city had \"taken us to our hearts\" since the Carabao Cup win.\nHe said it had been an amazing few weeks and \"we want more now.\"\nNo doubt that will be music to the Geordie faithful's ears who will be desperate there is not another 70-year wait for a domestic trophy.\nEarlier a huge banner with Howe's image on it was unfurled close to St James' Park by the fans' group Wor Flags.\nAlan Shearer takes the stage\n\"We could get used to this, couldn't we?\" Alan Shearer hollers to cheers from the crowd on the Town Moor.\nThe Newcastle United legend has taken to the stage at the Town Moor celebration\n\"I said I was going to party heavier than anyone and I think I did. I don't know where I am, what time it is, what day it is,\" Shearer says.\n\"The last two weeks have just been... probably the best of my life.\"\n\"I wanted this to happen in my lifetime and it's happened so whatever happens from now on, I can go happy.\"\n\"These guys who are backstage, Eddie Howe and the rest of the team have done us, and done our magnificent city so proud, haven't they?\"\n'Makes you proud to be a Geordie'\nEmma Millen\nBBC Radio Newcastle\nStanding behind a sea of black and white, the atmosphere in the crowd is pure passion, charged with an energy that makes you want to slap your chest and shout \"Toon Army\".\nThe roar of the fans bouncing off the buildings and thunderous cheer echoing through the streets of Newcastle.\nThere is a sense of disbelief mixed with pure joy, faces lit up in wide grins, eyes gleaming from the young lasses dressing in their black and white tutus to the dogs with their NUFC bandanas and the mixture of different variations of the team strip from the last 70 years.\nFans hug, jump, and dance.\nIt’s a proper celebration and makes you super proud to be a Geordie!", "url": "https://www.bbc.com/news/live/cpdewx7jvdvt"}