{"authors": ["Ben Woolvin", "www.facebook.com"], "date_download": "2025-04-26 04:31:55", "date_modify": "2025-04-26 04:31:55", "date_publish": "2025-03-03 06:05:11", "description": "Government statistics show more people are from Africa and India and fewer from EU countries.", "filename": "news_articles_c8x44027v5eo_1745641915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d367/live/bb1452d0-f607-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x44027v5eo_1745641915.html", "title": "'South West labour market has shifted since Brexit'", "title_page": "'South West labour market has shifted since Brexit' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A North Devon charity which provides English language lessons has noticed a shift in the demographic of the South West labour market since Brexit, bosses say.\nLatest government figures show a decline in the number of National Insurance Numbers (NINos) being issued to people born in the EU and an increase in those for people born in Africa and Asia.\nDr Ben Brindle, researcher at Oxford University's Migration Observatory, external, said the shift was a result of \"the post-Brexit immigration system\".\nNatali Guevara, engagement officer at Sunrise Diversity, external, said the Devon charity was supporting \"a lot of people from Africa and India\" and fewer people born in European Union countries.\nThe government's statistics show there were more than 11,500 NINos allocated to people born overseas and living in Devon, Cornwall, Dorset and Somerset in the year to September 2024, about 1,000 more than 10 years ago.\nThe proportion of NINos issued to people born in EU countries fell from 85% in 2014, to 8% in 2024.\nOver the same 10-year period the proportion issued to people born in Asian countries increased from 7% in 2014, to 52% in 2024.\nDr Brindle said the number of people from non-EU countries coming to the UK had \"sharply risen\" since the end of freedom of movement for people born in the EU in 2020.\nHe said restrictions preventing migrants from claiming benefits meant the majority of people being allocated a NINo would be working.\nIn the year to September 2024, 16 people from overseas per 1,000 people in Exeter were allocated a NINo. That was double the rate of the next highest council in the region, Plymouth, with eight per 1,000.\nThe England average was 11 per 1,000 people. In London, 25 were issued per 1,000. In Somerset, the figure was four, while in both Cornwall and Dorset it was three per 1,000.\nDr Brindle said it was difficult to be certain about the cause of the difference between the rate in Exeter and Plymouth, but international students were likely to be a significant factor.\nIn the 2022/23 academic year, there were 11,790 international students in the South West, making up 25% of the student population at the University of Exeter; 15% at the University of Plymouth; and 6% at Falmouth University, according to the Higher Education Statistics Agency.\nAnother factor could be people coming from Ukraine, said Dr Brindle.\n\"More [Ukrainians] came to Exeter relative to the size of the population than Plymouth,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c8x44027v5eo"}