{"authors": ["Aleem Maqbool", "Steve Swann", "www.facebook.com"], "date_download": "2025-04-26 07:54:49", "date_modify": "2025-04-26 07:54:49", "date_publish": "2025-02-25 12:59:30", "description": "The report into prolific abuser John Smyth accuses several members of the Church of safeguarding failures.", "filename": "news_articles_cg5dyyq6v86o_1745654089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/feec/live/22b03d60-f3aa-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg5dyyq6v86o_1745654089.html", "title": "Ten Church of England clergy facing disciplinary action over abuse report", "title_page": "Ten Church of England clergy facing disciplinary action over abuse report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Church of England says it is initiating disciplinary proceedings against 10 members of clergy following a review of evidence in the report into the prolific abuser, John Smyth.\nAmong those facing action are former Archbishop of Canterbury George Carey and Rev Andrew Cornes - who was due to be on the committee picking the next Archbishop of Canterbury.\nSmyth, who died in 2018, used horrific violence to attack boys at his Winchester home in the 1970s and 1980s, the Makin Review into his abuse found.\nJustin Welby, who stepped down as Archbishop of Canterbury earlier this year because of the scandal, is among several senior figures not facing action because of \"insufficient evidence\" for disciplinary proceedings.\nAlso not facing action but coming under criticism in the Makin Review are four serving bishops - the current Bishop of Lincoln Stephen Conway, Bishop of Episcopal Ministry in the Anglican Communion Jo Bailey Wells, Bishop of St Edmundsbury and Ipswich Martin Seeley and the Archbishop of Cape Town Thabo Makgoba.\nA survivor of Smyth's abuse told the BBC he was relieved that some were \"at long last\" being held to account for their failings but said he was surprised others had not been named.\nThe long-awaited report was released in November, external and detailed \"the prolific, brutal and horrific\" abuse perpetrated against more than 120 boys and young men by Smyth at Christian camps from the late 1970s in England until his death in South Africa in 2018.\nThat review led to the resignation of Justin Welby for what he acknowledged was his \"personal and institutional responsibility\".\nThe Church's National Safeguarding Team has since reviewed the evidence against nearly 40 other active clergy criticised in the report, deciding that some of it meets the threshold for further action.\nThose who are facing disciplinary proceedings by the Church of England are accused in the report of various degrees of failing to act during the timeline of Smyth's abuse.\nThe report said former Archbishop of Canterbury George Carey had been informed of the abuse in an outline of a report in 1983 which \"contained enough information about abuses to signal a need for action regarding John Smyth\".\nLord Carey denied seeing it and told the review he did not know Smyth when he studied at Trinity Theological College when Lord Carey was principal. Makin said that \"seems highly unlikely\" given Smyth's public prominence at the time.\nHe gave up his \"permission to officiate\" in December following a BBC investigation into the Church of England's handling of a separate sexual abuse case.\nAnother priest that now faces disciplinary action is Canon Andrew Cornes, a retired clergyman from the Chichester diocese who was due to be a member of the Crown Nominations Commission that will appoint the next Archbishop of Canterbury.\nThe Makin review said Rev Cornes was told in 1982 by a victim of Smyth about abuse he suffered. It said there was \"no evidence to suggest that Andrew Cornes took action to respond to this, he suggests that he thought that the matter was being dealt with\".\nThe Church of England has clarified that Rev Cornes has \"voluntary stepped back from ministry pending the outcome of this process and will not be participating in the Crown Nominations Commission\".\nMark Stibbe was groomed and brutally beaten by Smyth after joining his school's Christian Forum in 1977 and has waited decades for justice.\nMr Stibbe said he was \"relieved\" those identified in the review would be \"held to account for their failings\".\n\"I, along with my fellow Smyth survivors, wait with keen interest to see whether any disciplinary measures are enforced,\" he said.\n\"I am surprised that those senior clergy who in 2013 knew the full extent of Smyth's abuses, and who did not properly ensure that Smyth was brought to justice, are not named in the list released today,\" he added.\n\"Nevertheless, it's good to know that after all these years not only the truth is being discovered but that justice is being done\".", "url": "https://www.bbc.co.uk/news/articles/cg5dyyq6v86o"}