{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:55", "date_modify": "2025-04-26 04:02:55", "date_publish": "2025-03-03 22:25:52", "description": "A man was also taken to hospital for serious injuries after being punched in a separate attack in Belfast city centre.", "filename": "news_articles_c4geknkp6nko_1745640175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43e2/live/f3526070-f87c-11ef-91ae-3fa943d282b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4geknkp6nko_1745640175.html", "title": "Belfast: Woman knocked unconscious after being punched in assault", "title_page": "Belfast: Woman knocked unconscious after being punched in assault - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman was knocked unconscious after she was assaulted in Belfast city centre at the weekend.\nIt happened just before 03:30 GMT on Sunday morning as the woman and a man walked in the High Street area.\nTwo unknown males then entered into a verbal altercation with the pair, before one of them punched the man in the mouth and punched the woman to the ground.\nShe was treated at the scene, before being taken to hospital for further assessment.\nSeveral hours earlier, a man was taken to hospital for serious injuries after being attacked in the city centre.\nTwo men in their 20s were in Donegall Square West in Belfast city centre when they were assaulted by two unknown males at about 23:20 on Saturday.\nOne of the victims was punched in the left side of his face, before falling backwards and hitting his head off the pavement.\nHe is currently in hospital, having suffered a head injury and a cut below his eye. Police have said his condition is \"serious, but not life threatening at this time\".\nThe second victim was left with a number of facial injuries, including a cut to his nose and a split lip.\nA police spokesperson said one suspect had dark hair, and was wearing dark trousers and shoes, as well as a blue jacket.\nThe second was also wearing dark trousers and shoes with a grey jacket.\nPolice have appealed for information in both cases.", "url": "https://www.bbc.co.uk/news/articles/c4geknkp6nko"}