{"authors": ["David Knox", "www.facebook.com"], "date_download": "2025-04-26 06:54:33", "date_modify": "2025-04-26 06:54:33", "date_publish": "2025-02-28 15:55:34", "description": "Bus drivers have been instructed to call the police if disruptive children refuse to leave their vehicle.", "filename": "news_articles_cj4n5xql1xjo_1745650473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5606/live/a4b32150-f5ea-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n5xql1xjo_1745650473.html", "title": "Bus services in Hawick cancelled due to rowdy school pupils", "title_page": "Bus services in Hawick cancelled due to rowdy school pupils - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rowdy school pupils are forcing the cancellations of bus services in a Borders town.\nDespite efforts by transport and education bosses over the past year, anti-social behaviour has continued on the Hawick town service in the hour before and after school.\nThis week two late afternoon services between the town centre and Burnfoot housing estate were cancelled due to the abusive and aggressive behaviour.\nA spokesperson for Borders Buses said: \"It has reached the point where we are having to cancel services because of this type of behaviour.\"\nTransport chiefs in the Borders say that anti-social behaviour is limited to isolated incidents.\nBut Hawick has been the one problem area with pupils travelling to and from school on public service buses.\nA Borders Buses spokesperson added: \"Hawick and, in particular, Burnfoot is where most of these type of incidents happen.\n\"We are talking to the school, and I know the school is talking to the parents, but we need this type of behaviour to stop.\n\"Our staff and passengers shouldn't have to put up with screaming, shouting and these people, generally, being anti-social.\"\nDrivers on Hawick services are now being instructed to call the police if rowdy pupils refuse to leave the bus.", "url": "https://www.bbc.co.uk/news/articles/cj4n5xql1xjo"}