{"authors": ["Elliot Ball", "www.facebook.com"], "date_download": "2025-04-26 04:37:55", "date_modify": "2025-04-26 04:37:55", "date_publish": "2025-02-28 10:53:06", "description": "A local pest controller has been asked to set up traps where the non-native rodent has been seen recently.", "filename": "news_articles_c78ee1949jgo_1745642275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d593/live/9577e830-f5d4-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ee1949jgo_1745642275.html", "title": "Islanders told not to gather around squirrel", "title_page": "Islanders told not to gather around squirrel spotted in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Islanders have been warned by the States of Guernsey to not \"gather\" where a grey squirrel has been sighted.\nIt comes after the Guernsey Society for the Prevention of Cruelty to Animals (GSPCA) reported that a non-native grey squirrel had \"accidentally\" found its way to Guernsey.\nThe charity said the animal came to the island \"via a vehicle\" and it was seen near Bluchip in St Sampsons on Monday evening.\nThe States has since tasked a pest controller with trapping the squirrel, which it said would be made harder if islanders gathered in the area.\nA spokesperson said: \"To retrieve the grey squirrel which has been spotted in the island, the States Veterinary Officer has asked a local pest controller to set up traps where it has been seen most recently.\n\"We'd kindly ask islanders not to gather where the squirrel has been sighted as this will make the pest controller's job more difficult.\"\nThe grey squirrel has been classed as an invasive non-native species to the island and the States' spokesperson said no decision had been made about what the next steps would be if the squirrel was safely caught.\nBut the spokesperson added: \"Every avenue will be explored to try to return the squirrel to a more suitable environment.", "url": "https://www.bbc.co.uk/news/articles/c78ee1949jgo"}