{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:30:43", "date_modify": "2025-05-19 14:30:43", "date_publish": "2017-07-10 00:00:00", "description": "Live news, sport, travel and weather updates from around Northamptonshire.", "filename": "news_live_uk-england-northamptonshire-40535911_1747665043.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-northamptonshire-40535911_1747665043.html", "title": "BBC Local Live: Northamptonshire", "title_page": "BBC Local Live: Northamptonshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheers everyone!\nKris Holland\nBBC Radio Northampton\nSo, while I'm here I may as well make the most of it...\nThanks for following today's feed, where we went behind-the-scenes at Silverstone during practice day.\nScroll down to catch up on all the highlights, as Mercedes dominated in the two sessions.\nTalking of sessions...\nNah. I'd better not.\nCatch you all again soon!\nMore views from the fans\nKris Holland\nBBC Radio Northampton\nAlso down the local are these lads from Oldham.\nPaul (far right) said: \"It's our seventh time here. I think it's Lewis' race to win this weekend.\"\nMeanwhile, Ian and Tony have made the trek up from Portsmouth.\nIan (left), talking about the uncertain future of the race in Silverstone, said: \"They need to negotiate it and hopefully we'll see it continue.\"\nFingers crossed!\nAfter a long day by the track...\nKris Holland\nBBC Radio Northampton\nWhere better to go than to the local pub.\nI'm in the rather picturesque Silverstone village, where a number of F1 nuts have headed for a pint (and in some cases, some nuts) following today's practice sessions.\nBrothers Matt, 33, and Daniel, 31, are here from Eastbourne for the race. Last weekend they were in Austria.\nMatt told me: \"I'd love to see Lewis make it four in a row, but Bottas [his Mercedes team-mate] is driving well too.\nDaniel: \"It's a must win for Lewis to be honest. I hope Kimi does well too. The Ferrari's have been really strong this year - it's good to be seeing competition in the sport.\nTalking about the recent decision by the owners of Silverstone to try and renegotiate its contract - putting the future of F1 in Northamptonshire at risk past 2019, Matt added: \"I'd be devastated if Silverstone lost the race - this is the home of motorsport.\"\nIt's not all about F1\nStuart Bailey\nBBC News\nThe likes of Lewis Hamilton and Fernando Alonso aren't the only stars of Silverstone - a whole load of acts have been booked to play the main stage in the F1 Fanzone.\nTonight there's an '80s theme with Carol Decker (pictured) from T'Pau and a Sara Cox DJ set.\nStage manager Tanya Baker is responsible for organising the entertainment and said: \"It takes a lot of planning - we start thinking about it in October.\n\"We make sure what goes out on the stage is enjoyable and suitable for everybody - of all ages.\n\"It's not just about people who want to watch Lewis Hamilton for hour after hour - it's for people who just want a good day out.\"\nMan who died in M45 crash named\nA man who died in a crash on the M45 at Dunchurch last week has been named by police, external as 55-year-old Mark Folwell from Northampton.\nThe single-vehicle crash happened on Thursday 6 July on the eastbound carriageway at about 04:30.\nPeter's family said he would be \"truly missed by each and every person that was lucky enough to have known him\".", "url": "https://www.bbc.com/news/live/uk-england-northamptonshire-40535911"}