{"authors": ["Holly Phillips", "www.facebook.com"], "date_download": "2025-04-26 03:49:50", "date_modify": "2025-04-26 03:49:50", "date_publish": "2025-03-05 13:16:37", "description": "Steve Baker, owner of Richard King Memorials, says the theft from his workshop left him \"emotional\".", "filename": "news_articles_cdelzje0gl6o_1745639390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/021c/live/4b6edb70-f9c3-11ef-9e3a-ef9ebe93cf17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdelzje0gl6o_1745639390.html", "title": "Lincolnshire stonemason 'shocked they stole from a gravedigger'", "title_page": "Lincolnshire stonemason 'shocked they stole from a gravedigger' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A stonemason was left \"in shock\" when his mini-digger was stolen.\nSteve Baker, who owns Richard King Memorials, said the digger and a trailer had been taken from his workshop in Long Sutton, Lincolnshire.\nThieves broke into the compound through a fence in the early hours of Tuesday morning.\n\"It's just a bit of a shock that they chose to steal from a gravedigger,\" Mr Baker said.\n\"It was quite emotional. It's not nice to have anything stolen from anybody, regardless of how big the impact is, or how little.\"\nHe said the theft \"just seems a bit immoral\".\n\"I think everyone's as equally in shock that they've come to a place that deals with bereaved families and tried to inconvenience them,\" he added.\nMr Baker said customers would not be directly affected because his team would dig graves by hand until a new mechanical digger arrived.\nHowever, manually digging graves would take about three times longer.\n\"Ultimately, we're still prepared, committed and capable of meeting all of our services so there's no worries for any families,\" Mr Baker said.\n\"We're very fortunate that we are able to continue and have the skills here to get around it.\"\nLincolnshire Police said it was investigating the theft.", "url": "https://www.bbc.co.uk/news/articles/cdelzje0gl6o"}