{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:53:15", "date_modify": "2025-04-26 06:53:15", "date_publish": "2025-02-28 16:35:05", "description": "Prince William visits Poole to mark a partnership for his Homewards homelessness project.", "filename": "news_articles_c70w5jq9x4eo_1745650395.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/949f/live/550bb9d0-f5f1-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70w5jq9x4eo_1745650395.html", "title": "Prince William hugs student on visit to Poole college", "title_page": "Prince William hugs student on visit to Poole college - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Prince of Wales has hugged a student, sown broccoli seeds and tried boat building skills during a visit to Dorset.\nPrince William was in Poole on Friday to mark a new partnership for his Homewards project, which aims to tackle homelessness.\nHe visited a housing scheme for people with mental health issues as well as a boat building course linked to the scheme.\nDuring the trip, Bournemouth and Poole College student Natasha Gorry asked the prince for a hug and said she \"loved it\" when he obliged.\nThe prince's five-year Homewards project fosters partnerships to reduce homelessness in six areas around the UK, including Bournemouth, Christchurch and Poole.\nIt has now joined forces with Lloyds Banking Group, which has made £50m of loans available to organisations tackling the issue.\nThe prince visited Millennium House, an 11-bed supported housing scheme in Poole, run by Bournemouth Churches Housing Association (BCHA), where he planted vegetable seeds with residents.\nHe also went to Bournemouth and Poole College to see how Homewards was working with local firms to create employment programmes for people who are homeless or at risk of homelessness.\nParticipants are able to interview for the Sunseeker boat building programme, which is taught at the college's Sunseeker Skills Academy and at the yacht maker's shipyard.", "url": "https://www.bbc.co.uk/news/articles/c70w5jq9x4eo"}