{"authors": ["Ben Woolvin", "Lisa Young", "www.facebook.com"], "date_download": "2025-04-26 07:30:02", "date_modify": "2025-04-26 07:30:02", "date_publish": "2025-02-27 18:02:04", "description": "Alison Hernandez says she will write to the Home Office for its support.", "filename": "news_articles_cj9223x9gywo_1745652602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94c5/live/a956fc30-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj9223x9gywo_1745652602.html", "title": "Devon and Cornwall PCC calls for power to investigate staff", "title_page": "Devon and Cornwall PCC calls for power to investigate staff - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police and crime commissioner has called for powers to investigate senior staff over allegations of misconduct.\nAlison Hernandez said she was \"incredibly frustrated\" by the length of time it was taking to investigate allegations.\nDevon and Cornwall Police's substantive Chief Constable Will Kerr was suspended in July 2023 following allegations of sexual offences, which he denies, and Acting Chief Constable Jim Colwell was then suspended in November after allegations of misconduct.\nHernandez said she would write to the Home Office asking for powers to investigate senior police staff.\nShe said the monthly cost of employing two chief constables, along with interim boss James Vaughan who was appointed in December, was £63,913, which included pension contributions and all remunerated allowances.\nIn February, Mr Colwell returned to his substantive role of deputy chief constable while suspended which reduced the monthly cost.\nHernandez said: \"I believe this experience demonstrates that Police and Crime Commissioners should be granted investigatory powers relating to Chief Constable misconduct allegations, so the resources and timeframes of such investigations remain within their control.\"\nThe IOPC previously said its investigation of Will Kerr had been temporarily suspended pending the outcome of a criminal investigation in Northern Ireland.\nAn IOPC spokesperson said: \"Our investigation into misconduct allegations against chief constable Will Kerr has had to remain suspended pending a decision in Northern Ireland on potential criminal proceedings.\"\n\"We are progressing our investigation into misconduct allegations against the acting chief constable [Jim Colwell] as swiftly as possible.\"", "url": "https://www.bbc.co.uk/news/articles/cj9223x9gywo"}