{"authors": ["Rebekah Wilson", "www.facebook.com"], "date_download": "2025-04-26 03:51:51", "date_modify": "2025-04-26 03:51:51", "date_publish": "2025-03-05 11:26:27", "description": "The new scheme will create a new supply of affordable rented homes at below market rents.", "filename": "news_articles_cddyzjm5y5mo_1745639511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5bc3/live/36dd0a60-f9b4-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddyzjm5y5mo_1745639511.html", "title": "Affordable homes to be built under new intermediate rental model", "title_page": "Affordable homes to be built under new intermediate rental model  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A total of 300 new homes will be built across Northern Ireland under a new rental scheme, the Department for Communities has said.\nThe intermediate rent model will offer a below-market rate to help those on lower incomes who earn too much to qualify for social housing but are priced out of the private sector.\nThe homes will be built by property company Maple & May and it is hoped the first tenants will be in place from late 2026.\nCommunities Minister Gordon Lyons said the scheme was an important step for hard working people and families struggling to access a home suited to their needs.\nEligibility for an intermediate rental property will be income-based and those eligible will be able to apply for the houses once advertised.\nIt is understood a single adult household must have an annual income of less than £30,000 and less than £40,000 for two-adult households,\nRent under this model should not be more than 30% of the household income.\nIt is understood as part of the intermediate rent model, tenancy deposits will not be upfront, but can be paid over a period of time. In addition, the tenancy agreement can be made for up to five years.\nIt is understood the houses will be built across 11 sites, with expected locations to include Belfast, Londonderry, Lisburn and Dungannon.\nLyons said: \"I am pleased to reach this significant milestone, partnering with Maple & May to deliver the first affordable rent homes here as Intermediate Rent Operator. These will be high quality new build houses, providing excellent homes.\"\nBuilding work is expected to start at the beginning of 2026 and be available to rent later in the year.", "url": "https://www.bbc.co.uk/news/articles/cddyzjm5y5mo"}