{"authors": ["Adrian Browne", "www.facebook.com"], "date_download": "2025-04-26 07:51:30", "date_modify": "2025-04-26 07:51:30", "date_publish": "2025-02-25 15:07:52", "description": "Veterans commissioner says it's difficult to give them the priority treatment they are entitled to.", "filename": "news_articles_cy05lw2nenwo_1745653890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/84f9/live/049b2b60-f386-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05lw2nenwo_1745653890.html", "title": "Veterans: Ex-forces priority care 'difficult' with long NHS waits", "title_page": "Veterans: Ex-forces priority care 'difficult' with long NHS waits - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is \"very difficult\" for ex-armed forces personnel in Wales injured in the line of duty to get priority treatment due to long waits for surgery, MPs have been told.\nVeterans are entitled to priority treatment for conditions related to their service under the Armed Forces Covenant.\nBut, appearing before the Commons' Defence Committee, Wales Veterans Commissioner Colonel James Phillips questioned where they \"fit into a waiting list full with people waiting two years for elective surgery\".\nThe number of patients waiting longer than two years for treatment in Wales fell 3% to 23,621 in December, according to the latest figures. Welsh ministers said every health board has an armed forces champion.\nThe Defence Committee is holding an inquiry into the Armed Forces Covenant, which sets out help for servicemen, women, and their families in a range of areas, including healthcare and housing.\nColonel Phillips told the committee: \"When the National Health Service in a nation is struggling it's very difficult to provide priority for service related injuries.\n\"But also there's a perception from the veteran community that they're not valued and not being supported for their service related injuries, which might be difficult to relate to service.\n\"You're asking a clinician to decide that a veteran who did national service, perhaps, and needs a knee replacement in his 70s or 80s, is that related to his service of two years in the military, it is that just degradation?\n\"How do you prioritise him over the wider civilian population?\"\nIt was, he said, \"relatively easy to do with a young service leaver who's got an amputated leg and he comes with his medical documents\".\nColonel Phillips said prioritisation for ex-military in health was \"problematic\".\n\"Where do you fit into a waiting list that's already full with people waiting two years for elective surgery?\" he asked.\nColonel Phillips also raised the shortage of affordable and social housing in Wales.\nSome veterans in Wales and elsewhere in the UK, he said, were \"living in their car\".\nHe said putting veterans into crisis housing, which is full of people who have addiction problems\" doesn't work well for veterans \"used to a very disciplined service and lifestyle\".\n\"Which is why veterans prefer to go into veteran specific crisis units that support them and their needs.\n\"They're with other veterans and they are not in a chaotic lifestyle and they are not living alongside people who challenge them.\"\nColonel Phillips, who served 33 years in Army including in Iraq, Afghanistan, Northern Ireland and the Balkans, was appointed Wales' first veterans commissioner in 2022 by the previous Conservative UK government.\nScotland and Northern Ireland already had dedicated commissioners.\nBut he told MPs on Tuesday he had \"no real teeth\" and suggested his role would benefit from \"legal clout\" to give him and his fellow UK commissioners \"more of a role of holding people to account\".\n\"I have the power of personality, and the name of commissioner, to allow me to engage with public bodies and to advocate on behalf of veterans but I don't have any legal clout to that.\n\"If I write to a public body they don't have to respond.\n\"They do it out of the normal FOI and some Freedom of Information Acts, I don't have any real teeth.\"\nWelsh Conservative shadow housing and armed forces secretary Laura Anne Jones said veterans had \"put their lives on the line and sacrificed so much\" and \"the least we can do is ensure they are cared for properly\" in the NHS.\nBy also \"failing to provide adequate housing\" for them Labour ministers were allowing them to \"fall through the cracks, denying them the dignity and support they need\", she added.", "url": "https://www.bbc.co.uk/news/articles/cy05lw2nenwo"}