{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:43", "date_modify": "2025-05-19 15:31:43", "date_publish": "2015-02-12 09:20:05", "description": "A report by the Amateur Swimming Association has ruled out Coventry city centre as the location for a 50 metre pool.", "filename": "news_uk-england-coventry-warwickshire-31434882_1747668703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/72306000/jpg/_72306983_coventryswimmingpool.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-coventry-warwickshire-31434882_1747668703.html", "title": "Coventry city centre ruled out for 50m pool site", "title_page": "Coventry city centre ruled out for 50m pool site - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The council decided to close the current 50m pool on Fairfax Street after saying refurbishing it would be too expensive.\nThe ASA said there were no other city centre sites available to build a 50m pool.\nCoventry Swimming Club said it feared the city would lack facilities to accommodate swimmers.\nThe ASA, the national governing body for swimming, said it had worked with the council to look at the case for retaining a 50m pool in Coventry.\nIt said the Fairfax Street facility would not meet the technical requirements for the sport without extensive and \"prohibitively expensive\" remodelling.\nLocations for a 50m pool are now being considered elsewhere in Coventry and the West Midlands.\nCouncillor Kevin Maton said a water park and a 25m pool would be built in the city centre by 2019, when the Fairfax Street facility would close.\nHe said: \"The excitement of going to a water park is more of an incentive for people wanting to go swimming than the idea of a 50m pool.\n\"We will continue to work with the ASA to deliver a competition pool for the West Midlands.\"\nHe added the nearest pool for people in the Midlands wishing to swim in a public-run 50m pool was Corby, in Northamptonshire.\nAdam Ruckwood, head coach of the swimming club, said: \"When you have an eight-lane, 50m pool, you can get a lot of swimmers in. If you replace it with a water park, there simply won't be enough room. Our concern is what will happen to our 700-plus swimmers.\n\"This is not just about competition swimmers. We are a community group, with members aging in range from three to 76, and we are asking where all of our swimmers are going to go.\n\"Once the 50m pool goes, there won't be enough space in the city for them to swim.\"\nNationally, there has been a 245,000 fall in swimming participation, according to Sport England.", "url": "https://www.bbc.com/news/uk-england-coventry-warwickshire-31434882"}