{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:23:21", "date_modify": "2025-05-21 05:23:21", "date_publish": "2025-01-05 00:00:00", "description": "An amber warning for snow is in place across the North East and Cumbria throughout Sunday.", "filename": "news_live_cy0nejredvjt_1747805001.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cy0nejredvjt_1747805001.html", "title": "North East and Cumbria: Heavy snow arrives after warning", "title_page": "North East and Cumbria: Heavy snow arrives after warning - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for joining us\nWe are ending our live coverage of Sunday's winter weather for the timebeing, thank you for joining us. We'll be back if the conditions deteriorate again.\nMuch of the region has been blanketed with snow causing disruption on the roads and rails, with people asked to stay at home.\nThose who do have to travel are being urged to take precautions.\nThe Met Office has an amber warning for snow and ice in place until midnight tonight when it turns to a yellow one in force until noon on Monday.\nPlease take care.\nYellow warning for snow and ice for Monday\nThe Met Office has issued a yellow warning for snow and ice, external across much of the region tomorrow.\nIt comes into effect at midnight tonight, replacing the amber warning currently in force, and is in place until noon on Monday.\nA spokesman said snow would become more sporadic during Monday morning, though some further accumulations of a few centimetres were likely over the Pennines and perhaps the North York Moors.\nThey added icy stretches were likely to develop quite widely, making for some difficult travelling conditions.\nKeep up to date with your BBC local radio station\nYou can stay up to date with what's happening through the afternoon on your BBC local radio station.\nThere will be a programme running on BBC Cumbria and BBC Lancashire between 14:00 and 18:00 to bring you weather updates, forecasts and travel updates - you can listen here.\nAnd in the North East BBC Newcastle and BBC Tees will be keeping across the weather you can listen here:\nBBC Newcastle\nBBC Tees\nFive things you might not know about snow\nSarah Keith-Lucas\nWeather presenter\nThe mention of snow in our forecasts always pricks people ears up, whether it is the prospect of sledging and snowball fights, or the threat of travel disruption and school closures.\nBut did you know snow is not actually white, or that it falls at an average of three miles per hour?\nLove it or loathe it, here are five things you might not know about snow.\nSnow turning to rain in some areas\nSam Thomson\nBBC Newcastle Journalist\nThere’s still a lot of snow on the ground in Stanley, County Durham, but the winter wonderland people here woke up to may not last – which will come as a relief to some.\nOver the last hour or so, snowfall has turned to rain – with further wintry showers expected here through the afternoon.\nMost people are making the sensible decision to stay in and not try to drive. Though some of the main roads have been gritted and are passable, quieter roads, lanes and streets are still best avoided.\nSunderland sees a light dusting\nJim Scott\nBBC news, Sunderland\nWearside didn’t expect to see much, if any snow, overnight but people here did wake to a light dusting on rooftops and pavements.\nBut by early morning, spells of rain across Sunderland managed to make sure any ungritted roads were cleared of the white stuff.\nBy its nature, the city’s location on the coast makes it difficult for snow to lay on the ground.\nConditions easing at airports as runways cleared\nThe snow brought some disruption to the North East's airports this morning but the situation seems to be easing.\nPosting on X, external, Newcastle Airport said: \"The snowy conditions are beginning to lift at the airport.\n\"Thank you to our passengers for your patience and to the teams on the ground who have worked tirelessly, from the early hours of the morning, to keep the airport open and to attempt to clear the falling snow.\n\"The runway is now fully cleared and we are working with our airline partners to return our flight schedule back to normal as quickly as possible.\nThe runway at Teesside Airport was closed earlier for about five hours but has since been reopened.\nThere was a slight delay to a KLM flight to Amsterdam, it said.\nHundreds of homes remain without power\nThe weather led to hundreds of power cuts across the region.\nLast figures at 10:30 were 1,856 customers without supply in Northumberland, County Durham and Tyne and Wear, and with a further 27 restored earlier.\nOn Teesside it had restored power to 102 customers, but 21 were still off supply.\nIts power cuts map, external shows estimated restoration times, but it warned that challenging conditions meant these might be subject to change.\nWarning to stay off roads and fells\nSnow has created \"challenging conditions\" on Cumbria's roads, with people being urged to travel only if necessary and also stay away from the fells.\nSupt Matt Pearman, of Cumbria Police, said: \"Agencies across Cumbria are working together in response to the impact that snowfall and ice is continuing to have on the roads.\n\"I would urge anybody considering travelling in Cumbria today to only do so if necessary. The cold temperatures and further snowfall forecasted today will make road conditions even more difficult.\n\"If you are still planning to travel, please take extra care on roads, especially in rural locations, be aware of road closures and allow extra time for your journeys.\n\"Mountain Rescue volunteers are already responding to a number of incidents requiring their assistance and therefore I would also ask residents and visitors to make responsible decisions to keep not only you, but our volunteer colleagues safe.\"\nYou can find the latest on road closures and traffic incidents here, external.", "url": "https://www.bbc.com/news/live/cy0nejredvjt"}