{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:20", "date_modify": "2025-05-19 15:34:20", "date_publish": "2017-07-04 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across Cumbria on Tuesday 4 July 2017.", "filename": "news_live_uk-england-cumbria-40462784_1747668860.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-cumbria-40462784_1747668860.html", "title": "BBC Local Live: Cumbria", "title_page": "BBC Local Live: Cumbria for Tuesday 4 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage throughout the day\nLee Macaulay\nJournalist, BBC Cumbria\nOur updates have now ended for the day.\nWe'll be back tomorrow from 08:00 with the news, sport, weather and travel for Cumbria.\nHere's a recap of today's main stories:\nThe moment a South Cumbrian man came out as gay to his parents has been featured in a BBC Three documentary.\nCumbrian farmers have been told to adapt to survive the uncertainty of Brexit.\nA Cumbrian hospital boss has been asked to take charge of another Cumbrian hospital trust as well.\nIf you've got any stories or photos to share in the meantime, let us know by sending us an email or getting in touch via Facebook, external or Twitter, external.\nRepair work to start on Cumbrian bridge later this month\nWork will begin to repair a bridge that was washed away in North Cumbria in just over a week's time, according to Cumbria County Council.\nThe historic Bell Bridge collapsed into the River Caldew in January 2016 following the huge amount of rain brought by the winter storms including Storm Desmond.\nThe local authority has appointed Story Contracting to design and construct a new bridge which is intended to be in place by November 2017.\nCouncillor Keith Little, Cumbria County Council cabinet member for highways and transport, said: “The loss of Bell Bridge had a significant impact on the local community and I’d like to thank them for their patience and understanding during this period.\n\"I’d also like to thank the engineers and officers from both the council and Story for their hard work in what is a tricky and complex set of plans – their skills and knowledge have been vital to finalising the design and construction programme for the new bridge.”\nMore redevelopment work at West Cumbrian hospital\nA new diagnostics suite and mortuary will be completed by next spring as part of a project redeveloping West Cumberland Hospital in Whitehaven.\nThe trust running the hospital says it has invested £8.9m into \"Phase 1b\" of the work, which follows the opening of a new hospital building in 2015.\nThe diagnostics suite will be in an area of the old hospital building refurbished to the same standards as the new building.\nSome staff offices will also be created so that areas of the old hospital building can be demolished in preparation for redevelopment Phase 2, which was delayed after it emerged that the cost of the work had increases dramatically in 2015.\nMan pleads guilty to Maryport dangerous driving\nA West Cumbrian man has admitted driving dangerously on three roads in Maryport.\nAlan Baker, 62, of Main Road, Flimby, pleaded guilty to dangerous driving on Curzon Street, Lawson Street and John Street.\nBaker also admitted being more than twice the legal alcohol limit and two courts of both failing to stop and failing to report an accident.\nAll the offences took place on Friday 13 January 2017.\nThe case was adjourned until 31 July 2017 and Baker was granted bail and given an interim driving ban.\nSeven days till Lake District world heritage decision\nAn update on a story we've been following for months now, the bid for the Lake District National Park to become a Unesco World Heritage site., external\nThe Unesco World Heritage Committee is meeting in Krakow, Poland for the next week, external which is where the final decision will be made.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThirty-four sites from around the world have been put forward for world heritage status.\nAt the same meeting, a final warning is due to be discussed for Liverpool's waterfront which is currently included on the World Heritage in danger list.\nMan sentenced for viewing thousands of child abuse images\nA man who looked at thousands of pictures of child abuse while alone in his Carlisle bedsit has been given a suspended prison sentence.\nPolice found almost 4,000 illegal images on 45-year-old Tadeusz Chechinski's laptop and Carlisle Crown Court heard that some of the children were of a \"very young age\".\nJudge Barbara Forrester heard that Chechinski would benefit from \"support, assistance and guidance\" rather than prison so she gave him an eight-month jail sentence, suspended for two years.\nHe must also sign the sex offenders' register and following the terms of a sexual harm prevention order for 10 years.\nNorth Cumbrian hospital boss to also run Cumbria Partnership trust\nThe man in charge of the hospitals in North Cumbria is being appointed to run the trust which runs mental health and community hospitals county-wide.\nThe Cumbria Partnership Foundation Trust, external's board of directors has agreed to appoint North Cumbria University Hospital Trust, external chief executive Stephen Eames as its own chief executive on an interim basis.\nAs reported by the News and Star, external, he would take up the job after current chief executive Claire Molloy leaves - but that date is yet to be confirmed.\nQuote Message\nThe appointment of Stephen Eames as interim chief executive for Cumbria Partnership NHS Foundation Trust, CPFT, was agreed at the board of directors last week... Stephen will be meeting with CPFT non-executive directors later this month to finalise arrangements.\"\nCumbria Partnership Trust statement\nYour photos: Ullswater\nThanks to Dave Lamb from Darlington for sharing this photo of Ullswater which was taken from the top of Knotts Hill.\nIf you would like to see one of your own photo here, let us know by sending us an email or getting in touch via Facebook, external or Twitter, external.\nAdapt to survive Brexit, Cumbrian farmers told\nA Cumbrian firm is calling on farmers to diversity their businesses to help cope with the uncertainty of leaving the European Union.\nH&H Land and Property is hosting a conference at Buckabank Farm in Dalston near Carlisle, external on ways that farmers can prepare for the future.\nIt's because the Brough family who own the farm have invested in a robotic milking system which allowed them to increase the size of their dairy herd.\nQuote Message\n“The current political uncertainty, and the issues Brexit will introduce, are not set to promote stability in agriculture. However, opportunities will appear and we need to be ready to respond to market forces and alter production accordingly.\"\nDr Nick Prince, Senior farm business management consultant, H&H Land and Property", "url": "https://www.bbc.com/news/live/uk-england-cumbria-40462784"}