{"authors": ["Clarissa Sebag-Montefiore", "www.facebook.com"], "date_download": "2025-05-19 15:04:55", "date_modify": "2025-05-19 15:04:55", "date_publish": "2015-02-04 16:13:38", "description": "Australian musicians are set to win a bunch of Grammys this month, Clarissa Sebag-Montefiore reports, but it wasn't always so.", "filename": "news_world-australia-31104158_1747667095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80743000/jpg/_80743549_025005044.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-australia-31104158_1747667095.html", "title": "Australian musicians lead charge at Grammy Awards", "title_page": "Australian musicians lead charge at Grammy Awards - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Today, Australian music is popular with American recording companies and US college students alike, and Australian musicians are set to win a bunch of Grammys this month. But it wasn't always so.\nIn 1983, when Australian band Men at Work won Best New Artist at the Grammys, one thing stuck out for lead vocalist Colin Hay: a compliment from rock and roll legend Little Richard.\n\"He told me he liked my coat,\" says the Scottish-Australian former front man, adding: \"It was very exciting - all of a sudden we were in this [famous] company.\"\nIn the 1970s and 1980s, Australian musicians - with a few notable exceptions such as Olivia Newton John and AC/DC - were invisible on the global music scene.\n\"There was a sense that it was too hard to get famous outside of Australia,\" says Iain Shedden, music writer at The Australian newspaper. \"The music for some reason didn't travel that well.\"\nThree decades later Australians are not only topping the charts worldwide, they are leading the charge at the Grammys, America's largest and most important annual music awards.\nThe 57th Annual Grammy Awards, held on 8 February in Los Angeles, sees four Australian artists nominated. To boot, iconic Aussie rockers AC/DC will perform on the night.\nCompeting for coveted Record of the Year is hip-hop artist Iggy Azalea, a native of Mullumbimby in New South Wales, and the Adelaide-born singer-songwriter sensation Sia Furler. Both are nominated for four Grammys each.\nMeanwhile, composer Fiona Joy's song Grace is up for Best New Age Release, and Grammy-award-winning Keith Urban is nominated for Best Country Solo Performance and Best Country Duo/Group Performance.\n\"It's a strong reflection that Australian music is doing incredibly well around the world,\" says Dan Rosen, chief executive officer of the Australian Recording Industry Association (Aria).\nLast year's Grammys attracted 28.51 million viewers on CBS; countless more tuned in on social media (15.2 million Tweets were sent about the awards according to Twitter). The moneymaking event is as much about glitz, glamour and show biz as it is a celebration of music.\nBut big audiences mean big profit. And performing at the awards - particularly in the wake of YouTube - can arguably lead to greater exposure than winning. In the digital age of downloads and online streaming, the Grammys has a near instantaneous effect on sales and charts.\nIn 2013, singer-songwriter Gotye won a hat-trick of awards including Record of the Year for Somebody That I Used to Know, becoming only the second Australian to take home that accolade, after Olivia Newton John in 1974. Sales of the single, featuring New Zealand artist Kimbra, climbed 101% the week after the awards and of his album Making Mirrors by 124%.\n\"Gotye became a global sensation. That momentum certainly helps other Australian acts come through,\" says Mr Rosen. \"Australia has always been known more for its rock bands and [this] opened people's minds to all different genres.\"\nThe Belgium-born Australian was hardly undiscovered. At the time, Gotye's single had already topped the charts in the US, UK and 24 other countries, sold 13 million copies worldwide, and been watched 383 million times on YouTube.\nThe Grammys is \"reactive, not proactive,\" points out Hay, now a US-based solo artist with a new album, Next Year People, out this month. \"The train has always left the station by the time they get on board.\"\nThis can mean a long wait before finding recognition across the pond. AC/DC, formed in 1973, was nominated five times before finally winning a Grammy in 2010. Meanwhile it took Kylie Minogue 17 years after the release of Locomotion to win Best Dance Recording in 2004.\nOne undisputed winner is the Australian music industry.\nAt their peak, Men at Work were the quintessential Australian band, recognised worldwide for songs such as Down Under. Hay believes the band's Grammy raised people's awareness about Australian music.\n\"There was a lot of ignorance,\" says Hay. \"It did mean that things that came from [Australia] got noticed.\"\nAny acknowledgement as a foreign artist in the 1980s at the predominately American Grammys was an achievement. Today, however, the growth of technology and travel has improved Australia's global reach.\n\"We're seeing the benefits of the world being a little flatter and the barriers of entry to big markets being a little smaller,\" says Mr Rosen.\nMr Shedden agrees: \"Australia's reputation as a music producing nation has increased dramatically in the past 10 years. There is an appetite in the American industry for Australian music. At college radio level Australian music is quite hip and the major record companies are taking note of that.\"\n\"If anything, I think it's been underselling itself in the past, partly because of geography and technology,\" he adds. \"It was not that Australia wasn't making good music before - it's just that it was harder to get out there.\"\nNo matter what happens at this year's Grammys, it seems that's no longer true. The rise of Iggy Azalea, the first non-American female rapper to top Billboard's rap albums chart, is testament to the fact that in music terms, the world is shrinking.", "url": "https://www.bbc.com/news/world-australia-31104158"}