{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:35:05", "date_modify": "2025-05-19 15:35:05", "date_publish": "2015-02-04 21:25:16", "description": "The man accused of operating Silk Road, a deep web marketplace where illegal drugs were sold, has been found guilty by a jury in New York.", "filename": "news_world-us-canada-31134938_1747668905.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80794000/jpg/_80794730_80794727.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31134938_1747668905.html", "title": "Ross Ulbricht: Silk Road creator convicted on drugs charges", "title_page": "Ross Ulbricht: Silk Road creator convicted on drugs charges - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The man accused of operating Silk Road, a deep web marketplace where illegal drugs were sold, has been found guilty.\nRoss Ulbricht, 30, was convicted by a Manhattan jury on all seven counts including narcotics and money laundering conspiracies.\nProsecutors said more than a million drug deals took place on Silk Road, earning Ulbricht about $18m in Bitcoins\nHis defence lawyers had argued he was framed for much of the site's activity and had quit the site.\nThe jury deliberated less than day before handing down the verdict, which leaves Ulbricht facing a possible life sentence.\nUS Attorney Preet Bharara said the conviction sent a clear message: \"The supposed anonymity of the dark web is not a protective shield from arrest and prosecution.\"\nThis was a swift and damning verdict, and represents a significant victory for federal prosecutors after a meticulously planned sting.\nBut this trial was always about far more than one individual or even a website. The Silk Road, a site once seen as the poster-child for truly anonymous black market e-commerce, has been destroyed and its mastermind punished.\nOfficials say the outcome sends a clear message to others. But with millions of dollars amassed by Ulbricht in just two years, the online underworld was and remains a lucrative arena.\nIt is a fluid, mercurial environment. Within days of its closure in 2013, other Silk-Road rivals emerged in what has become a depressing game of \"whack-a-mole\" for the authorities.\nCollectively, the only lesson these sites appear to have learnt thus far: the need for caution. Today's \"darknet\" administrators are more guarded in their dealings with their customers.\nWhether today's verdict will prompt them to revise their strategy more widely is questionable.", "url": "https://www.bbc.com/news/world-us-canada-31134938"}