{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:34:46", "date_modify": "2025-04-26 07:34:46", "date_publish": "2025-02-27 15:25:08", "description": "Tyler Byrne, 30, was working on tracks in Surbiton in February 2021 when he was struck and killed.", "filename": "news_articles_cly446r0x8eo_1745652886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ab43/live/24e3bda0-f5b7-11ef-accd-233028a2e09e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly446r0x8eo_1745652886.html", "title": "Network Rail fined £3.41m over track worker Tyler Byrne's death", "title_page": "Network Rail fined £3.41m over track worker Tyler Byrne's death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Network Rail has been fined £3.41m over the death of a track worker in south-west London who died after he was struck by a train.\nTyler Byrne, 30, from Aldershot in Hampshire, was killed after a train travelling at about 76mph (120 km/h) hit him as he was working on tracks in Surbiton in February 2021.\nThe company pleaded guilty to an offence under workplace health and safety legislation at Kingston Crown Court, the Office of Rail and Road (ORR) said.\nIt comes after the regulator's investigation uncovered failings in the planning, monitoring and supervision of the work.\nMr Byrne was part of a four-person group of track workers carrying out inspections while trains were running in both directions.\nThe ORR said the group was exposed to the risk of being hit by a train as there were inadequate warnings and no protection.\nEarlier this month, Network Rail was fined £3.75m over a separate incident after two workers were struck and killed by a train at Margam, near Port Talbot, in July 2019.\nEllie Burrows, Network Rail's managing director for the southern region, said the incident which killed Mr Byrne \"should never have happened on our railway\" and the company was \"deeply sorry for what happened\".\n\"Since this tragic event we've continued to take significant steps to improve safety,\" she added.\n\"We have done this by carrying out maintenance work at different times, using alternative technology, and we continue to examine our planned work to keep our colleagues safe.\n\"Tyler's death will never be forgotten, and we will continue to strive to ensure something like this never happens again.\"\nChief inspector of railways Richard Hines said: \"Our industry's track workers play a crucial role in delivering a safe railway for passengers and users of the system, often working in challenging and difficult conditions.\n\"It's essential that they are also protected from harm.\n\"In a period when we also remembered those who lost their lives at Margam in 2019, let us keep our focus on reducing the risks faced by our people.\"", "url": "https://www.bbc.co.uk/news/articles/cly446r0x8eo"}