{"authors": ["Sarah Sanderson", "www.facebook.com"], "date_download": "2025-04-26 04:28:29", "date_modify": "2025-04-26 04:28:29", "date_publish": "2025-03-02 09:12:43", "description": "Cuts to business rates relief in April will hit the hospitality industry hard, a landlord says.", "filename": "news_articles_cpq220qyew1o_1745641709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a07/live/bbdab840-f5d4-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq220qyew1o_1745641709.html", "title": "Hospitality businesses need more help - landlord", "title_page": "Hospitality businesses need more help - landlord - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A pub landlord in East Yorkshire is calling on the government to do more to support struggling hospitality businesses.\nBusiness rates relief of 75% was introduced for pubs, restaurants, bars and cafes in response to the Covid-19 pandemic, but is set to be reduced to 40% in April.\nRichard Knocker, who runs the Wolds Inn in Huggate, said that, despite it continuing, the impact of reducing the support would hit the industry hard.\nThe Treasury said without its intervention, business rates relief would have ended completely.\n\"We are rated at £20,000 a year and we currently get 75% on that, which means we pay £5,000,\" Mr Knocker said.\n\"Relief going down to 40% will mean we pay another £7,000.\"\nAccording to the British Beer and Pub Association, the equivalent of six pubs a week closed across England and Wales in 2024.\nMorgan Schondelmeier, policy manager for tax and trade, said hospitability businesses were facing a perfect storm, with the cut in business rates relief alone meaning an increase of several thousand pounds to an average pub.\n\"At the same time we are going to see an increase in wages, along with an increase in National Insurance contributions that the publicans are going to have to pay for their staff,\" she added.\nMr Knocker said rising costs had also impacted the business, with the cost of meat and fish rising from £600 to £1,800 a week over the last two years.\n\"We can't reflect that in our pricing so our margins have got tighter and tighter. We need help from the government by reducing the VAT to help the hospitality sector,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cpq220qyew1o"}