{"authors": ["Jacob Panons", "Emily Coady-Stemp", "www.facebook.com"], "date_download": "2025-04-26 06:28:03", "date_modify": "2025-04-26 06:28:03", "date_publish": "2025-02-27 11:48:04", "description": "Concerns have been raised about noise, local infrastructure and the potential environmental impact.", "filename": "news_articles_cpwddzv9nnko_1745648883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/478a/live/671fb220-f51a-11ef-ba54-ef76fba8facc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpwddzv9nnko_1745648883.html", "title": "Gatwick Airport second runway backing sparks mixed reactions", "title_page": "Gatwick Airport second runway backing sparks mixed reactions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents across the South East have expressed mixed views to a second runway at Gatwick Airport being backed by the government.\nTransport Secretary Heidi Alexander said she was \"minded to approve\" the expansion, providing measures to reduce noise were put in place.\nIan Brooker, who lives near Three Bridges, in West Sussex, said he was in favour of the plans due to the additional jobs it could bring to the area.\nMeanwhile, campaign group Communities Against Gatwick Noise Emissions (Cagne) said: \"We will continue to hold Gatwick's feet to the fire to ensure the local communities of Sussex, Surrey and Kent do not pay for this burden, as well as the planet.\"\nMr Brooker said Gatwick Airport was the main employer in the area.\n\"The more people that work there, the better,\" he said.\nBut Cathy Barclay, from Charlwood, Surrey, said there was a \"fairly strong belief\" in the area that another runway was not needed.\n\"If you think of the road and the rail and the housing, everything that supports the infrastructure here, it's tight enough as it is now,\" she said.\n\"It would be horrendous.\"\nJulie Jones, who owns 52 The Street Cafe in Charlwood, says the extra runway is not needed.\n\"There are other areas of England that are in desperate need of further infrastructure in their own towns and cities, Charlwood actually isn't one of them,\" she explained.\nPeter Barclay, who is chairman of the Gatwick Area Conservation Campaign (GACC), says he is glad to see the decision pushed back.\n\"We're pushing once again to a victory because we've had six attempts at an additional runway at Gatwick so far and we've beaten five and we're going to beat the sixth one,\" he said.\nThe campaign chairman said it was \"highly questionable\" that the second runway could be brought into use in a \"satisfactory way\".\nMr Barclay explained: \"You can't get rid of the environment impacts.\n\"Its our lives, its our future lives, its our children, our grandchildren, everybody's lives [that could be impacted].\"\nHe said the group was challenging the plans on behalf of local communities.\nCharlwood resident John Shelley said: \"It's dreadful, the concept of putting a full working second runway in such a rural area with such small roads, such small infrastructure, it's just ridiculous.\"\nHe added: \"We've been going so long, trying to keep Charlwood this wonderful rural community, and where's it going to go?\"\nPenny Shoubridge, who also lives in the village, says a second runway would make an \"enormous difference\" as some residents are already impacted by the noise.\n\"That has a hugely detrimental impact on our health, on our sleeping,\" she explained.\nRachel Martin, who lives under a flight path in Horley, says she thinks another runway could make flights more noticeable for those living in the area.\nShe added that residents would \"just have to put up with it if it goes ahead\".\nThe transport secretary's support does not guarantee the expansion will go ahead as it would still need planning permission.\nIf permission is granted, work would start almost immediately, the BBC understands.", "url": "https://www.bbc.co.uk/news/articles/cpwddzv9nnko"}