{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:58:53", "date_modify": "2025-05-21 04:58:53", "date_publish": "2025-01-23 00:00:00", "description": "Rudakubana, 18, pleaded guilty on Monday to murdering three girls, 10 attempted murders, producing ricin, possessing terrorist material, and possessing a knife.", "filename": "news_live_czepl8406n8t_1747803533.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_czepl8406n8t_1747803533.html", "title": "Southport killer Axel Rudakubana sentenced to 52 years in jail for attacks", "title_page": "Southport killer Axel Rudakubana sentenced to 52 years in jail for attacks - live updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southport killer begins 52-year sentence\nMatt Spivey\nLive page editor\nWe're now closing our live coverage of the sentencing of Southport killer Axel Rudakubana, who has been handed a minimum of 52 years in jail.\nMr Justice Goose said it was highly unlikely Rudakubana would ever be released.\nRudakubana murdered three girls, Elsie Dot Stancombe, 7, Alice da Silva Aguiar, 9, and Bebe King, 6, at a Taylor Swift themed dance class in Southport in July 2024.\n\"For some time he had planned to kill as many people as he could,\" the judge said today.\nIn Liverpool Crown Court today, we heard statements from the families of Elsie and Alice - as well as the parents of some of the surviving children.\nLeanne Lucas, the dance instructor running the class, was stabbed five times by Rudakubana and told the court today: \"For Alice, Elsie, Bebe, Heidi and the surviving girls, I’m surviving for you.\"\nThe court also heard details of the attack, including how an instructor told the children to run away, and how a local man was injured as he tried to help.\nThis investigation was one of the \"most harrowing\" the Merseyside force has ever dealt with, Detective Chief Inspector Jason Pye said.\nFor more on this story, you can read how red flags were missed, learn how the atrocity has \"forever changed\" Southport and keep up to date with our news story.\nRudakubana cannot apply to leave jail until 2077\nDominic Casciani\nHome and Legal Correspondent\nRudakubana’s minimum term of 52 years is awfully close to the record of 55. That was given to Hashem Abedi, the brother of the Manchester arena suicide bomber, who murdered 22 people.\nMr Justice Goose’s sentence started with an official guideline of at least 27 years and then almost doubled it.\nSo 18-year-old Rudakubana cannot apply to leave jail before he is 70, in the year 2077. Given the judge said Rudakubana would have got a whole life order if he had been an adult at the time of the attacks, it seems unlikely he will ever be released.\nCritics of the judge’s decision would have to convince the Court of Appeal that the sentence - seemingly the second longest minimum term ever - is not just shorter than they would have wanted, but “unduly” so.\nAn unduly lenient sentence is one that falls short of the range the judge could have reasonably considered, applying all the relevant factors about the crime and offender.\nThe Court of Appeal would only increase the minimum term if it concluded there had been an “error of principle”, the circumstances were exceptional and public confidence could be damaged if it did not intervene.\nMost harrowing investigation we've dealt with - Detective Chief Inspector Jason Pye\nWe've just heard from Detective Chief Inspector Jason Pye who says the attack by Rudakubana was the most \"harrowing and large-scale investigation our force has ever dealt with\".\nHe calls the attack \"cowardly\" and \"terrifying\" and says that although no outcome today could ease the pain and trauma of the victims' families, he hopes that knowing Rudakubana will spend a considerable amount of time in prison will at least bring some comfort.\nPye thanks the first responders, who he says will still be affected by what they witnessed.\nTo Elsie, Alice, and Bebe, he says: \"You will never be forgotten.\"\nDeputy head stopped Rudakubana's hockey stick attack in assembly\nEd Thomas\nBBC News UK Editor\nThe BBC has been speaking to neighbours and former classmates of Axel Rudakubana, in Southport.\nOne ex-classmate, at Range High School, recalled the time he interrupted a school assembly, attacking classmates with a hockey stick.\nThe man, who didn’t want to be named, said: “I heard yelling over my shoulder. I quickly turned and saw a hockey stick in the air.”\nHe said Rudakubana was “swiftly taken down” by the school’s deputy head teacher.\nThe former classmate added: “I want to know how no-one has managed to stop him before he’s done this. It seems insane to me that he’s able to go out and perform such a horrific crime.”\n“After the incident with the hockey stick I didn’t think it would go any further,” he added.\n“I thought the justice system would have done something or he would have learned from his mistakes.”\nQuestions need to be asked, family of Elsie Dot Stancombe say\nWe've just received a statement from the family of Elsie Dot Stancombe - one of the three girls killed by Axel Rudakubana.\n\"It has been very clear from the outset that it is wrong that a young person, who has grown up in our society, could commit such an unspeakable act of hatred,\" the statement reads.\n\"It is therefore right and proper that questions need to be asked, and we welcome the announcement of a Public Inquiry into the events that took place.\"\nThe family conclude the statement by saying: \"Our heartfelt thanks go out to everybody who has supported our family, and our condolences and sympathies are with all the other families affected by this tragedy.\"\nLaw officers to consider if 52-year sentence is 'unduly lenient'\nEarlier, we reported that Southport MP Patrick Hurley has asked the Attorney General to review Axel Rudakubana’s sentence as “unduly lenient”.\nWe can now confirm that law officers, within minutes of Rudakubana being jailed, received a request to consider whether the 52-year minimum term was too short.\nThe case was referred under the unduly lenient sentence scheme - which allows anyone to ask for a Crown Court sentence to be reviewed by the Attorney General’s Office (AGO) if they think it is too lenient.\nJust one request is needed for it to be considered.\nThe law officers - Attorney General Lord Hermer and Solicitor General Lucy Rigby - have 28 days to decide whether to refer the sentence to the Court of Appeal.\nThere is a high threshold for a successful reference under the scheme.\n'Crown Prosecution Service strives to be transparent and open'\nChief Crown Prosecutor for Mersey and Cheshire Sarah Hammond is repeatedly asked why the Crown Prosecution Service (CPS) delayed making certain information about the case public.\nShe says that CPS could not disclose certain details that could have identified Rudakubana when he was 17 years old, and reporting restrictions had not yet been lifted.\n\"The CPS always strives to be transparent and open,\" she adds.\nHammond is asked if the CPS delayed the decision to charge Rudakubana on the production of a biological toxin and possession of terrorist material.\nShe says they didn't delay the decision, but notes that they needed the evidence in a certain format before charging, and that took longer to be presented due to the complexities of the case.\nPictured: The toxin discovered under Rudakubana's bed\nAxel Rudakubana produced a biological toxin, ricin, on or before 29 July - which was found during a search of his house following the attack.\nThe prosecution counsel told Liverpool Crown Court today there was no evidence it was used either during the attack at The Hart Space studio or at any other time.\nRicin is a naturally occurring toxin found in the seeds (or beans) of the castor oil plant. The substance is 6,000 times more poisonous than cyanide.\nThe police discovered the poison in a sealed food container in Rudakubana's bedroom along with a pair of safety goggles, a lab beaker and a pestle and mortar.\nA bag which had contained castor seeds, used to make the substance, was also found - having been bought in 2022.\nThe form it was found in was deemed to be \"low to very low risk\".\nStarmer's statement - in full\nWe've just received the full statement from Prime Minster Keir Starmer on the sentencing of Axel Rudakubana.\nHe says: \"The thoughts of the entire nation are with the families and everyone affected by the unimaginable horrors that unfolded in Southport. No words will ever be able to capture the depth of their pain.\n\"I want to say directly to the survivors, families and community of Southport - you are not alone. We stand with you in your grief.\n\"What happened in Southport was an atrocity and as the judge has stated, this vile offender will likely never be released.\n\"After one of the most harrowing moments in our country's history we owe it to these innocent young girls and all those affected to deliver the change that they deserve.\"\n'Not severe enough': Southport MP calls for review of sentence\nPatrick Hurley, Southport’s MP, has asked the Attorney General to review Axel Rudakubana’s sentence as “unduly lenient”, saying it is “not severe enough”.\nIn a post on social media, he said: “The sentence handed down today is not severe enough, it is not long enough for the crimes committed, we need a sentence that represents the severity of this crime that has terrorised the victims and their families.\n“I have submitted a review to the Attorney General to review the sentence, the undue leniency does not reflect the crimes committed and a review is required to uphold public confidence in our justice system.”\n'Rudakubana had obsession with violence, killing and genocide', police chief says\nMerseyside Police Chief Constable Serena Kennedy calls the attack \"cowardly\" and \"vicious\".\nIn a statement released after the sentence, she says: \"[The girls] had come together for a Taylor Swift-themed morning to enjoy dancing, singing and making friendship bracelets in honour of their idol.\n\"Those girls - who range in age from six to 13 - were the polar opposite of the calculating teenager who carried out the harrowing and atrocious, pre-meditated attack.\"\nReferring to the detail given by prosecution counsel today, Kennedy adds that two of the children who died \"suffered particularly horrific injuries\".\nShe says documents and images found on his devices show he had a \"long-standing obsession with violence, killing and genocide.\n\"We can say that from all those documents is that no one ideology was uncovered and that is why this has not been treated as terrorism.\"", "url": "https://www.bbc.com/news/live/czepl8406n8t"}