{"authors": ["Lynette Horsburgh & Rachael Lazaro", "www.facebook.com"], "date_download": "2025-04-26 07:07:45", "date_modify": "2025-04-26 07:07:45", "date_publish": "2025-02-28 06:03:07", "description": "Remains are found in the search for Rania Alayed, murdered by her husband after she tried to leave him.", "filename": "news_articles_c5yxx0jv15ro_1745651265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/337c/live/6ef895e0-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxx0jv15ro_1745651265.html", "title": "Who was Rania Alayed?", "title_page": "Murdered for wanting a new life: Who was Rania Alayed? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With police revealing human remains have been found in the search for missing Rania Alayed, a 12-year quest for the truth appears to be finally drawing to a close.\nThe 25-year-old went missing in June 2013 and her husband was jailed for her murder a year later.\nBut at trial and under police caution, he refused to say where the mother-of-three had been buried.\nNumerous searches took place at the side of the A19 in Thirsk, North Yorkshire, but to no avail.\nFinally that mystery could have been solved after Greater Manchester Police said officers \"strongly suspected\" the remains of Ms Alayed had been discovered on Tuesday.\nRania Alayed was born in Syria and grew up on a refugee camp.\nIt was there she met her husband-to-be Ahmed Al-Khatib and married him at the age of 15.\nShe left the violence of Syria in search of a new life in the UK, but Manchester Crown Court heard she had endured years of domestic abuse.\nShe previously lived in Norton, Teesside, where she had asked for help from the police and a solicitor, before moving to Greater Manchester.\nAn intelligent 25-year-old, she had attended college in Manchester, made new friends and embraced life in the UK.\nShe had moved to Cheetham Hill, Manchester, in January 2013 and studied English as a foreign language at Openshaw College.\nShe had tried to separate from Al-Khatib but her new freedoms angered him and he would not accept her requests for a fresh start.\nShe disappeared on 7 June 2013.\nAhmed Al-Khatib was a blacksmith in Syria when he met Ms Alayed.\nThroughout the murder trial, the jury was told Ms Alayed was Al-Khatib's \"only love\", his childhood sweetheart, but she had suffered \"years of abuse\" at his hands.\nHe became jealous, violent and controlling, and when Ms Alayed eventually walked out, he invited her and their children to his brother's Salford flat - and killed her while the children were in another room.\nThe proseuction said Al-Khatib murdered Ms Alayed because she became \"too westernised\" and was \"establishing an independent life\".\nThe court heard he had gone to great lengths to try to convince her family and friends she was still alive, texting them and even being caught on CCTV wearing a headscarf in an attempt to look like her.\nAl-Khatib admitted in court he had been unhappy when his wife started college and began wearing make-up.\nBut he tried to claim he was mentally ill when he killed his wife - seeing her as an evil spirit attempting to destroy him.\nThe jury did not believe him and neither did her family.\nMs Alayed's uncle Ali Aydi said Al-Khatib was \"a murderous monster, a wicked man\" who had \"committed the worst act\".\n\"He is a good actor. He was beating Rania. She lived a very hard life,\" he said.\nAfter Al-Khatib was sentenced to life with a minimum term of 20 years Det Ch Insp Phil Reade said Ms Alayed's death had been a so-called \"honour killing\".\nHonour-based abuse is perpetrated by people who claim to be upholding the so-called honour of a family or community.\nIt can include forced marriage, coercive control, and even murder.\nSo-called honour killings are a brutal reaction within a family against someone who is perceived to have brought \"shame\" upon relatives.\nThe victims are often females and are associated especially with cultures which highly value family honour.\nWhat constitutes dishonour depends entirely on the family involved - but experts in the field say it can be anything from wearing clothes or choosing a career which the family disapprove of, to marrying outside of the wider community.\nIt happens worldwide, from South America to Asia.\nAfter more than a decade of anguish, Ms Alayed's family have wanted to find her body and lay their mother to rest.\nRania's son, Yazan said the discovery of human remains more than a decade on at the lay-by area was a \"surreal surprise to me and my family\".\nHe added: \"At last, being able to provide a final resting place is all we have wanted for the last 11 years.\n\"To have the ability to lay down a few flowers for my mother is more than I can ask for from this world.\"", "url": "https://www.bbc.co.uk/news/articles/c5yxx0jv15ro"}