{"authors": ["Julia Bryson", "www.facebook.com"], "date_download": "2025-04-26 07:40:05", "date_modify": "2025-04-26 07:40:05", "date_publish": "2025-02-27 12:51:34", "description": "Daryl Benn called or texted his victim up to 450 times a day for eight years, police in Leeds say.", "filename": "news_articles_ce8mm3d345mo_1745653205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3ab8/live/d041c420-f504-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8mm3d345mo_1745653205.html", "title": "Jail for Leeds stalker who bombarded woman with texts", "title_page": "Jail for Leeds stalker who bombarded woman with texts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A stalker who called or texted a woman up to 450 times a day after they struck up a conversation in a shop has been jailed for four years.\nDarryl Benn, 31, met the woman in a store in Leeds in 2015 and befriended her after they had talked about a shared interest.\nBenn went on to harass her for eight years, with messages becoming increasingly sexualised and threatening, culminating in the victim receiving over 11,000 in just three weeks, police said.\nBenn, of Sycamore Walk, Pudsey, who was arrested in September, was jailed at Leeds Crown Court on Wednesday after earlier admitting stalking involving fear of violence and sending a threatening communication and indecent images.\nDuring the hearing, he was also given a lifetime restraining order.\nWest Yorkshire Police said Benn had repeatedly asked the woman to send him explicit images, and threatened to harm her if she blocked him.\nHe also sent explicit images of himself to the victim, took pictures of her in the city centre and created indecent AI-generated images.\nAfter Benn was sentenced, the victim said in a statement: \"I feel relieved I finally have a voice, and I am being listened to, but the prolonged trauma and constant degrading words towards me has really taken a toll on my mental health.\n\"I hope now I can start to rebuild my life in peace, building my confidence and having freedom to go where I want, wear what I want and do what I want, without the worry of someone following me.\"\nDet Con Ellie Blacklock, from Leeds CID, said: \"This was a prolonged and relentless campaign of abuse which saw the victim subjected to eight years of trauma caused by somebody she simply met in a shop.\n\"The offending became increasingly disturbing, culminating in the victim receiving more than 11,000 messages in the space of three weeks.\n\"I want to praise her for her strength and courage in coming forward to report it.\"\nShe added: \"This case demonstrates the huge lasting harm caused by non-contact sexual offences and I would urge any victims to please come forward to report them to us.\n\"We have specialist teams who will work with you to support you through the process.\n\"Women and girls should be able to go about their daily lives free from the fear of harassment and we are committed to creating an environment where they can feel safe.\"\nVictims of any stalking or sexual offences, recent or not, have been urged to contact West Yorkshire Police.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/ce8mm3d345mo"}