{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:17", "date_modify": "2025-05-19 15:29:17", "date_publish": "2015-02-05 00:25:00", "description": "The European Central Bank (ECB) toughens its stance with Greece by restricting financing to the country's banks, sending shares falling.", "filename": "news_business-31142437_1747668557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80796000/jpg/_80796280_80796177.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31142437_1747668557.html", "title": "European Central Bank toughens its stance on Greece", "title_page": "European Central Bank toughens its stance on Greece - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The European Central Bank (ECB) has toughened its stance with Greece by restricting financing to the country's banks, sending shares falling.\nIn a statement, external, the central bank said it would no longer accept Greek government bonds as collateral for lending money to commercial banks.\nThe move makes access to cash more expensive for Greece's banks.\nIn Athens, the stock market fell more than 6%, while bank stocks tumbled as much as 16%.\nThe ECB said that its move was because it could not assume a \"successful\" deal on Greece's €240bn (£179bn) bailout.\nShares in Greek banks fell sharply, with Alpha Bank shares were down 10%, Eurobank shares down 15%, and National Bank of Greece 12.3% lower. The wider Athens stock market initially fell more 10% before recovering slightly.\nItalian and Spanish stock markets were also trading down about 1% by mid-morning.\nThe yield, or interest rate, on Greek bonds rose more than two percentage points as investors demanded higher returns on the country's debt.\nThe newly-elected Greek government is in talks with international creditors over the terms of its bailout, which it thinks are too harsh.\nThe Greek finance ministry said the ECB's decision, which is due to come into effect on 11 February, would have \"no adverse impact\" on the country's financial industry.\nIt said the sector was \"fully protected\", with other options still available.\nBanks can still access funding through the Emergency Liquidity Assistance (ELA) programme, run by Greece's central bank, and at a much higher cost to the banks.\nAccording to the Greek newspaper Kathimerini, external, the interest rate is 1.55%, compared with 0.05% on regular ECB financing.\nEarlier on Wednesday, Greek Finance Minister Yanis Varoufakis, met the ECB's president Mario Draghi to discuss the country's bailout.\nAnalysts said the ECB statement was a sign the meeting had not been a success.\n\"This is clearly the ECB signalling to the Greek government: You're going to have to talk to [international lenders] the troika and get a deal,'' Jacob Kirkegaard, senior fellow at the Peterson Institute for International Economics told the Associated Press.\n\"Otherwise, really bad things are going to happen.''\nThe euro fell sharply against the dollar on the news, dropping more than a cent to $1.1331.\nOn Thursday, Mr Varoufakis is due to meet his German counterpart, Wolfgang Schaeuble, one of the toughest critics of the new Greek government.\nThe European Central Bank's decision reflects the uncertainty about whether Greece will reach an agreement on its bailout programme with the rest of the Eurozone.\nGreek government bonds have such a poor credit rating that the ECB only accepts them as collateral if the Government has such a support programme in place.\nThe immediate direct impact on the Greek banks is likely to be relatively moderate. They can use other assets to borrow from the ECB and they can turn to the national central bank - but at a higher interest rate.\nThe move does however add to the pressure on the Greek government to do a deal.\nOver the next few weeks the banks in Greece could face further stress.\nAlready, significant amounts have been withdrawn from accounts, and there is a possibility of further restrictions on their access to central bank funds.", "url": "https://www.bbc.com/news/business-31142437"}