{"authors": ["Matthew Richards", "www.facebook.com"], "date_download": "2025-04-26 06:55:23", "date_modify": "2025-04-26 06:55:23", "date_publish": "2025-02-28 15:31:16", "description": "A 30-year-old man has appeared in court charged with the murder of a dad, Craig Richardson.", "filename": "news_articles_c20dzlzedpmo_1745650523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/da48/live/309004d0-f5e7-11ef-86a6-15c2bb2c0119.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20dzlzedpmo_1745650523.html", "title": "Wrexham: Man charged with murder of Craig Richardson", "title_page": "Wrexham: Man charged with murder of Craig Richardson - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 30-year-old man has appeared in court charged with the murder of a 37-year old.\nThomas Iveson, from the Plas Madoc area appeared via video link from custody at Mold Crown Court on Friday.\nCraig Richardson died at his home in Acrefair, Wrexham on 23 February.\nMr Iveson's case was adjourned and he is due to appear for a pre-trial preparation hearing at the same court on 23 May.\nThe judge Rhys Rowlands told Mr Iveson that the case would be listed for a trial on 20 October which could last up to three weeks.\nOfficers were called to the address just before 12:30 GMT following concerns for the safety of Mr Richardson.\nHe was pronounced dead by paramedics.\nA 32-year-old from Wrexham who was also arrested has been released on bail while investigations continue.\nMr Richardson's family paid tribute to him as \"a loving son, dad, brother, uncle, nephew, cousin, partner and a friend to many who we all loved with all of our hearts\".\n\"Everybody who really knew Craig will say he had the biggest heart, would give you his last and was full of fun.\n\"Craig will be missed forever, and in our hearts forever and ever.\"", "url": "https://www.bbc.co.uk/news/articles/c20dzlzedpmo"}