{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:32:46", "date_modify": "2025-05-19 14:32:46", "date_publish": "2017-08-21 00:00:00", "description": "News, sport, weather and travel updates from across Kent on Monday 21 August 2017.", "filename": "news_live_uk-england-kent-40733712_1747665166.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-kent-40733712_1747665166.html", "title": "BBC Live: Kent - as it happened", "title_page": "BBC Live: Kent - as it happened on Monday 21 August 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's goodnight from us\nStuart Maisner\nBBC Live reporter\nThanks for joining the team today - we'll be back from 06:00 BST with all your news, sport, travel and weather.\nIs there anything you'd like to tell us about?\nYou can get in touch on Twitter, external, on Facebook, external or by sending us an email.\nValuables and stories to be discovered in shipwreck\nLizzie Massey\nBBC Live reporter\nA ship excavation is expected to reveal a \"treasure trove\" of items and stories from Europe's global trading history.\nAn international team of maritime archaeologists are diving, excavating and recording the wreck of Dutch ship the Rooswijk off the Kent coast.\nAll 300 shipmen died when the vessel, carrying coins and silver ingots, sank on Goodwin Sands in January 1740.\nNever before have any of the Dutch East India Company's 250 wrecks been scientifically excavated on this scale.\nHistoric England is working with the Dutch government to discover more about the vessel as part of its #Rooswijk1740 project.\nSeven arrests after man's death in Folkestone\nThree more people have been arrested in connection with a suspicious death in Folkestone.\nA 28-year-old man, a 24-year-old woman and a 25-year-old man are all currently in custody as part of an investigation by the Kent and Essex Serious Crime Directorate.\nThey are all from the Folkestone area.\nKent Police was called at 02:24 BST on Saturday 19 August to a report of a man found with serious injuries near the harbour wall.\nThe victim, Steve Holton, 54, was pronounced dead at the scene by ambulance staff.\nA total of seven arrests have now been made in connection with the incident.\nTwo people have been released pending further enquiries while the other five all remain in custody.\nWitnesses or anyone with information is urged to call 101 quoting reference ZY/39012/17.\nAlternatively contact Kent Crimestoppers anonymously on 0800 555111.", "url": "https://www.bbc.com/news/live/uk-england-kent-40733712"}