{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 12:41:00", "date_modify": "2025-05-20 12:41:00", "date_publish": "2023-08-03 00:00:00", "description": "The former president spoke on the airport tarmac after pleading not guilty to all four new counts in court.", "filename": "news_live_world-us-canada-66390992_1747744860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/DED4/production/_130644075_de49.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-us-canada-66390992_1747744860.html", "title": "Trump live updates: Trump calls it a 'very sad day' for America after not guilty plea", "title_page": "Trump live updates: Trump calls it a 'very sad day' for America after not guilty plea - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for following our live coverage\nThis concludes the BBC's live page of Donald Trump's court appearance in Washington DC.\nFor more related coverage:\nTrump says election case is political persecution\nWho are Trump's six alleged co-conspirators?\nThe man who could bring down Donald Trump\nVoter panel: 'Indictment is pulling us apart'\nThank you to our team of journalists: Kayla Epstein, Sam Cabral, Bernd Debusmann, Max Matza, Mike Wendling, Adam Durbin and Brandon Drenon.\nThe editors for today's live page were: Emma Owen, Brandon Livesay, Marianna Brady and Dulcie Lee.\nTrump's (latest) day in court\nSam Cabral\nReporting from court\nDonald Trump is not a man used to waiting.\nBut at a court hearing in the nation's capital, the former US president found himself fidgeting in his seat while he waited 20 minutes for the judge to arrive.\nIn the meantime, he also stole furtive glances at Special Counsel Jack Smith, the prosecutor who has now indicted him in two separate federal cases.\nIn recent days, Trump has raged on social media against what he calls a continuing \"witch hunt\" led by a \"deranged\" and \"wild\" Smith.\nBut in the courtroom, he had to stay silent.\nTrump listened carefully and answered politely, save for the occasional noticeable shake of the head in dismay.\nIn one moment, unprompted by the judge, he stood up to answer her question and was told he could sit back down.\nStanding up later, he affirmed that his lawyers were entering a plea of not guilty on his behalf.\nTrump is likely to use a free speech defence\nKayla Epstein\nUS reporter\nOne defence strategy Trump and his lawyers will likely attempt is a First Amendment and free speech argument – that Trump’s false statements about election fraud were political speech and therefore protected by the US Constitution.\n“After 2020, he saw all these irregularities, he got affidavits from around the country, sworn testimony, he saw the rules being changed in the middle of the election process - as a president, he’s entitled to speak on those issues,” his attorney, John Lauro, told CBS News.\nTrump’s allies have already started making this argument in the court of public opinion.\nJack Smith’s indictment was “a complete violation of an individual’s First Amendment rights,” Republican congressman Byron Donalds told Fox News today.\nBut that argument runs into a problem: speech in service of a crime is not protected.\n“What we know from an everyday application of criminal law is that if you engage in speech to trick or deny somebody of their rights, that’s an unlawful act,” Anthony Michael Kreis, a professor of constitutional and employment law at Georgia State University, told BBC News.\n“We charge people all the time for this, where the speech is incidental to underlying criminal conduct.”\nThis is why the indictment lays out a broad picture of Trump using false rhetoric about the election during his attempts to reverse the results, and why the document points to several instances where top Trump officials told him that the election had not been stolen.\nYou might recognise the other man with a Trump-branded umbrella\nIt was a rainy day during Donald Trump's visit to Washington, DC, where he heard criminal charges against him in court for the third time this year.\nLuckily for Trump, his trusted aide Walt Nauta was there to hand the former president an umbrella as he exited a black SUV on the airport tarmac.\nIf that name, and face, is familiar, it's because Nauta has been in the news quite a bit lately.\nThat's because Nauta faces his own charges in the Mar-a-Lago confidential documents case, alongside Trump.\nNauta has been accused of helping to hide secret documents for his boss at the Mar-a-Lago resort in Florida.\nBoth Trump and Nauta have pleaded not guilty in the case.\nTrump supporters respond: ‘This is election interference’\nMike Wendling\nUS disinformation reporter\nTrump’s allies have been out in force, alleging the charges against the former president are politically motivated “election interference”.\nIt may seem ironic – given that Trump himself is being charged with illegally interfering with the 2020 vote – but his fans aren’t merely protesting his innocence. They’re trying to turn the tables and pointing fingers at the Biden administration.\nSpeaking outside the court just before today’s hearing, Trump's attorney Alina Habba rattled off a timeline of news events and allegations against President Biden, implying a vast conspiracy of tit-for-tat legal action guided from the top.\n“This is election interference at its finest against the leading candidate right now for president,” she said.\n“President Trump is under siege in a way that we have never seen before.”\nThe theme was quickly picked up by Trump’s biggest supporters in Congress – including Ohio Senator JD Vance and Georgia Congresswoman Marjorie Taylor Greene both of whom repeated the “election interference” phrase on X, formerly known as Twitter.\nIt seems that a big part of the former president’s strategy – at least in public, if not in court – will be to skirt around the substance of the charges at hand and instead engage in whataboutery.\nTrump - 'This is a very sad day'\nSpeaking to reporters outside of his private plane, Trump has denounced the investigation.\n\"This is a very sad day for America, and it was also very sad driving through Washington DC and seeing the filth and decay.\"\n\"This is not the place that I left,\" he says about the city on only his second visit back since leaving office.\nTrump then describes the charges against him as the \"persecution of a political opponent\".\n\"If you can't prosecute them, persecute them,\" he says before leaving without taking any questions.\nClosing remarks before hearing ends\nSam Cabral\nReporting from court\n\"This case will benefit from normal order, including a speedy trial,\" said a prosecutor on behalf of the government a few minutes ago before the hearing ended.\nTrump's lawyer John Lauro pushed back and said his team needs time to weigh \"the scope and extent\" of the justice department's evidence in this case, given that the government has had three years to set forth its side.\nHe added a just and fair trial - one that protects Trump's constitutional rights - is just as important as a speedy trial.", "url": "https://www.bbc.com/news/live/world-us-canada-66390992"}