{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:49:55", "date_modify": "2025-04-26 06:49:55", "date_publish": "2025-03-01 08:29:36", "description": "The crash happened in the townland of Baltoney, Gortahork, on Friday night at about 21:30 local time.", "filename": "news_articles_cy05yqz1kq2o_1745650195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3400/live/5d1e5180-f6bb-11ef-84d4-499fadd0dc53.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05yqz1kq2o_1745650195.html", "title": "Donegal: Two dead after vehicle crashes into house", "title_page": "Donegal: Two dead after vehicle crashes into house - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two people have died after the vehicle they were travelling in crashed into the gable wall of a house in County Donegal.\nIt happened in the townland of Baltoney, Gortahork, on Friday night at about 21:30 local time.\nThe driver, who was in his teens, and a back seat passenger who was in his 20s were both pronounced dead at the scene.\nThe front seat passenger, aged in his 20s, and another back seat passenger in his teens were seriously injured.\nGardaí (Irish police) and other emergency services attended the scene.\nThe road will remain closed on Saturday while forensic collision investigators carry out a technical examination of the crash site.\nGardaí have appealed to anyone who witnessed the crash, or has footage recorded in Baltoney around the time of the collision, to contact them.\nSinn Féin TD for Donegal Pearse Doherty said that the community had been left \"completely heartbroken\".\n\"At times like this, there are no words, but the community just comes together and wraps ourselves around all of those who are suffering the real loss here,\" he said.\nMeanwhile, Fianna Fáil TD for Donegal Pat 'The Cope' Gallagher said that \"a dark cloud descended over west Donegal when the news broke\".\n\"This is a very tightly knit community that will stand in solidarity with these families during the weeks and months ahead,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cy05yqz1kq2o"}