{"authors": ["Mark Savage", "www.facebook.com"], "date_download": "2025-04-26 06:24:21", "date_modify": "2025-04-26 06:24:21", "date_publish": "2025-03-01 00:24:22", "description": "The 2025 Brit Awards are upon us - so who will win, and who'll give the biggest performances?", "filename": "news_articles_c4g007jjlyqo_1745648661.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eaae/live/10d07c80-f5d6-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g007jjlyqo_1745648661.html", "title": "Brit Awards: Five things to look out for at tonight's ceremony", "title_page": "Brit Awards: Five things to look out for at tonight's ceremony - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The biggest night in British music is upon us, as the Brit Awards gear up for their 45th edition.\nCharli XCX leads the nominations this year, with five in total - including artist of the year and album of the year, all thanks to her critically-acclaimed, trend-setting album Brat.\nThe Essex-born singer will attend the show but, surprisingly, is not expected to perform. Instead, there'll be big numbers from Ezra Collective, Sam Fender, Lola Young, and Teddy Swims.\nAn eclectic set of nominations also sees recognition for The Beatles, a Christmas song by Eurovision star Sam Ryder, and hits by TikTok stars like Artemas and KSI.\nHere's what you need to know ahead of the ceremony.\nIt might not have been year's biggest-selling album, but Charli XCX's Brat spawned the most conversations.\nReleased in June, it combined abrasive dance-floor beats, soaring hooks and meme-friendly artwork as the 32-year-old assessed her place in the music industry, the real and imaginary rivals she'd accumulated, and whether or not to leave it all behind to have a baby.\nJust as everyone was absorbing that, she hired a bunch of guest stars - Billie Eilish, Ariana Grande, Addison Rae, Bon Iver - and re-recorded an entirely new, sometimes superior, version of the album.\nAs authentic as it was catchy, Charli's seventh album introduced her to a whole new audience... and brought her a clutch of Brit nominations.\nEarlier this week, organisers announced she'd won songwriter of the year - earning the star her first ever Brit award (she'd received nominations before in the best female and best pop act categories).\nThat sets the scene for her to dominate tonight's show. If she wins everything she's nominated for, she'll tie with Raye as the most-awarded artist in a single Brits ceremony.\nSabrina Carpenter gave one of the best performances at last month's Grammy Awards.\nArriving on stage in a sparkly tuxedo dress, she rearranged her hits Espresso and Please Please Please in a jazzy big band style, and even delivered a fleet-footed tap dance sequence.\nBetter still, she turned the whole performance into a screwball comedy - missing her cues, dropping her cane, and accidentally knocking over her set.\nA former Disney star, she sold it all with a cheeky nod and a wink, undercutting the ceremony's more self-serious acts (The Weeknd, we're looking at you).\nHopefully the singer will deliver something equally Short n' Sweet when she pops into the Brits ahead of her UK tour.\nLiam Payne had a huge connection to the Brits, both as part of One Direction and as a solo artist, so it's likely that the ceremony will include a tribute to the star - who tragically died in Argentina last October.\nGossip columns have speculated that his former bandmates would reunite to honour his memory, but with Zayn and Louis both on tour, that seems unlikely.\nAccording to The Sun, the tribute will be \"a strong section of the show and not simply an In Memoriam name-check\".\nQuoting an unnamed source, the newspaper said: \"His family aren't involved in the plans but they are being kept in the loop.\n\"The Brits are treating it with the utmost respect and sensitivity.\"", "url": "https://www.bbc.co.uk/news/articles/c4g007jjlyqo"}