{"authors": ["Emma Saunders, Helen Bushby and Chi Chi Izundu", "www.facebook.com"], "date_download": "2025-04-26 07:58:07", "date_modify": "2025-04-26 07:58:07", "date_publish": "2025-02-25 12:00:18", "description": "A report into what the BBC knew about DJ's conduct found it was \"too deferential to high-profile individuals\".", "filename": "news_articles_ce98n0074zro_1745654287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5af7/live/730adb00-f371-11ef-8402-45d3cf1c2dcb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce98n0074zro_1745654287.html", "title": "BBC sorry for 'missed opportunities' over DJ Tim Westwood's 'bullying behaviour'", "title_page": "BBC sorry for 'missed opportunities' over DJ Tim Westwood's 'bullying behaviour' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The BBC board has apologised over \"missed opportunities\" to tackle \"bullying and misogynistic behaviour\" by former BBC Radio 1 DJ Tim Westwood.\nAn independent report into what the BBC knew about Mr Westwood's conduct was published on Tuesday, highlighting a series of incidents and allegations it said amount to a \"considerable body of evidence\" which it failed to investigate properly.\nThe report added the BBC had \"inadequate record keeping and communication with people who raised complaints or concerns\", and \"an insufficiently rigorous attempt to address the substance of concerns raised\".\nThe BBC had previously acknowledged six complaints about bullying and sexual misconduct. In a video that appeared on social media last year, the DJ said: \"It's all false allegations.\"\nCulture Secretary Lisa Nandy said the allegations against Mr Westwood were \"very serious\" and there had been \"far too many instances of appalling behaviour in the media industry\".\nThe BBC board admitted it did not \"take adequate action\", saying: \"It is clear that in the past, the BBC has not only been too siloed but too deferential to high-profile individuals.\"\n\"The board also wants to take this opportunity to apologise on behalf of the entire BBC to anyone impacted by what the review has found,\" it added.\n\"Your voice has been heard, and the findings of the review will further fuel the drive to ensure it does not happen again.\"\nGemma White KC led the report commissioned by the BBC board in 2022.\nMore than 120 individuals contributed to the review and thousands of records from the time were examined.\nThe DJ's solicitors told Ms White:\nHe denies the allegations of criminal and other misconduct and \"confirms he has never had any sexual interest in children under the age of 16\".\nHe has never acted in a \"predatory and/or sexual manner\" and \"did not (and does not) present any risk to young women, at the BBC nor elsewhere\".\nHe has been \"denied the opportunity of presenting a defence to allegations set out in [the report] as a result of the vague nature of the allegations and the ongoing police investigation\".\nMr Westwood, who has not responded to the BBC's requests for comment, had a gig in Oyo state in Nigeria on Monday.\nThe report highlighted some staff felt uncomfortable raising grievances with management about the DJ.\nThose who spoke to Ms White referenced:\n\"A feeling that they could not raise issues with the controller or other people in senior management because of the importance of the 'talent' to Radio 1/1Xtra.\n\"A feeling that presenters were valued over production staff and that senior management were likely to side with presenters.\"\nShe noted evidence of senior management \"reacting firmly\" to public complaints about the DJ, along with \"evidence of their intention to create an environment in which employees would feel able to raise concerns\".\nBut the \"lack of formality adopted\" towards concerns raised about workplace misconduct, and the \"type of material broadcast on air\" were likely to have resulted employees not feeling confident that workplace conduct concerns about the DJ \"would be properly addressed.\"\nThe BBC board said: \"Beyond assessing any alleged criminality, which is a matter for the police, it is clear there were times where the BBC, on learning about concerns regarding Mr Westwood's behaviour, did not take adequate action.\"\nIt cited \"evidence of bullying and misogynistic behaviour on the part of Mr Westwood and the plain fact is that his general conduct was entirely incompatible with BBC values – not just now, but then\".\n\"The organisation fell short and failed people – including our own staff – who had a right to expect better from us,\" it added.\nThe report has cost approximately £3.3m.\nIt found \"there was no widespread or significant or BBC knowledge of allegations or concerns about predatory sexual behaviour by Mr Westwood\".\nBut it said there were \"instances where the organisation missed opportunities that might have led to action.\"\nThe BBC says it has since improved its processes.\nNandy, whose government brief covers the BBC, said she met with director general Tim Davie on Tuesday to discuss the Tim Westwood report.\nWestwood, 67, was a presenter on BBC Radio 1 and Radio 1Xtra between 1994 and 2013, where he hosted the UK's first nationally broadcast hip-hop show.\nIn July 2022, the BBC revealed it had received six complaints about alleged bullying or sexual misconduct by Mr Westwood, one of which had previously been referred to police.\nThen in August, the Metropolitan Police confirmed it was investigating a man over allegations of of non-recent sexual offences in London in 1982, 1985, 2010 and 2016.\nA Met spokesperson said on Monday: \"A full file of evidence remains with the CPS for their consideration. Detectives from the Met continue to make enquiries, with support from prosecutors.\"", "url": "https://www.bbc.co.uk/news/articles/ce98n0074zro"}