{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:43:46", "date_modify": "2025-05-19 14:43:46", "date_publish": "2015-02-21 03:17:23", "description": "New US Defence Secretary Ash Carter arrives in Afghanistan, days after taking up the post, saying he wants \"lasting success\" for the country.", "filename": "news_world-asia-31564051_1747665826.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81159000/jpg/_81159383_ash.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31564051_1747665826.html", "title": "Afghanistan conflict: Ash Carter makes first visit", "title_page": "Afghanistan conflict: Ash Carter makes first visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New US Defence Secretary Ash Carter has arrived in Afghanistan days after taking up the post, saying he wants \"lasting success\" for the country.\nMr Carter will meet US commanders and Afghan heads on the unannounced visit.\nHe said he had made Afghanistan his first visit as the 10,000 US troops still in the country \"come first in my mind, always\".\nForeign troops ended their combat role in December but the nation still faces a bloody Taliban insurgency.\nThe US troops still in the country are engaged in training and advisory roles.\nMr Carter, who was sworn in on Tuesday, said: \"We're looking for success in Afghanistan that is lasting.\n\"How to do that, what the best way to do that is, is precisely what I'm here to assess.\"\nHe revealed little to reporters travelling with him about any future policy shifts.\nThe current plan is to reduce US troops to 5,500 by the end of this year, a policy that has drawn sharp criticism from Republicans in Congress.\nAfghan President Ashraf Ghani has also said he wants the withdrawal slowed.\nWhen asked about any Islamic State penetration into Afghanistan, Mr Carter said: \"The reports I've seen still have them in small numbers.\"\nMr Carter is meeting Mr Ghani, as well as Gen John Campbell, the top US commander in Afghanistan, and Gen Lloyd Austin, head of Central Command.\nThe visit comes after the bloodiest year in Afghanistan since the Taliban conflict began in 2001, with some 5,000 Afghan security personnel killed.\nThe number of civilian deaths and injuries also rose by 22% in 2014, the United Nations says.\nThe total of 3,699 Afghans killed and 6,849 injured made 2014 the deadliest year since the UN began keeping those records in 2009.\nFor the first time more people were killed in battles between the Taliban and government forces than by roadside bombs, the figures show.", "url": "https://www.bbc.com/news/world-asia-31564051"}