{"authors": ["Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 06:13:11", "date_modify": "2025-04-26 06:13:11", "date_publish": "2025-03-02 06:20:41", "description": "A driving expert fears \"reckless\" motorists are being let loose having cheated on their tests.", "filename": "news_articles_cy4vv03lxjko_1745647991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5140/live/1273fcb0-f5bd-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vv03lxjko_1745647991.html", "title": "Learner drivers in Essex caught hiring impersonators for test", "title_page": "Learner drivers in Essex caught hiring impersonators for test - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Learner drivers are hiring impersonators to pass their practical test because of lengthy waits for an exam, an expert has warned.\nCarly Brookfield, of the Driving Instructors Association, said she feared \"reckless\" motorists were being let loose on the road as a result.\nFifteen people were caught in Essex posing as somebody to sit a practical test in 2024, according to figures obtained by the BBC.\nThe Driver and Vehicle Standards Agency (DVSA) said detecting and preventing fraud was a \"top priority\".\nThe data, obtained via a Freedom of Information request, showed a further 127 incidents of cheating were detected at Essex theory test centres last year.\nOf those, 95 cheats were suspected to have been using covert devices to assist them, while the others used impersonators.\nNone of the cases reported in Essex have led to prosecutions.\nMs Brookfield said five-month waits for a driving test in the UK was steering people towards desperate measures.\n\"They're thinking 'if I don't pass first time, it's going to be a very long wait until I get my next driving test slot',\" she said.\n\"They are calculating that risk and thinking it's worth cheating to try and ensure they pass.\"\nNational figures provided to the BBC showed 2,059 incidents of cheating were recorded by the DVSA in the 2023-24 financial year.\nSentences for impersonators or those caught using them range from prison terms to community orders.\nTheory tests cost £23 to sit and practical exams £62 - before extra money spent on hiring an instructor's car in most cases.\nMs Brookfield called on the DVSA to implement more robust deterrents to crack down on those cheating the system.\n\"If somebody is cheating their way to a pass, that is risky behaviour in a person that's going to manifest itself in risky behaviour on the road,\" she said.\n\"Where it looks like a very long wait [for an exam], there is temptation to take a risk you wouldn't normally take.\"\nThe government has been working to cut wait times for tests by hiring hundreds of driving examiners.\nLilian Greenwood, minister for the future of roads, said in December that learners were being denied the chance to get their licence.", "url": "https://www.bbc.co.uk/news/articles/cy4vv03lxjko"}