{"authors": ["Marc Waddington", "www.facebook.com"], "date_download": "2025-04-26 03:45:21", "date_modify": "2025-04-26 03:45:21", "date_publish": "2025-03-05 06:20:32", "description": "People who own leases in Queensland Place in Liverpool hope their victory could set a precedent.", "filename": "news_articles_cz039dd27z5o_1745639121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a17f/live/07bfd5a0-f905-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz039dd27z5o_1745639121.html", "title": "Leaseholders' legal victory over offshore landlord", "title_page": "Liverpool: Leaseholders' legal victory over offshore landlord - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of leaseholders have won a legal battle to prove they were unlawfully deprived of the chance to take control of their own building when their landlord sold it to an offshore firm.\nPeople who invested in Queensland Place, in Liverpool, should have been given the right to buy the freehold of the complex before it was sold to an Isle Of Man-based company by property developer Elliot Lawless, a court found.\nMr Lawless claimed the freehold was transferred between connected companies, rather than sold, but the evidence he produced was ruled inadmissible by the First Tier Tribunal (FTT).\nThe leaseholders said their victory could be a milestone for other people who said they had the same experience with Elliot Group developments, while Mr Lawless and Isle Of Man-based Schloss Roxburghe Holdings could not be contacted for comment.\nQueensland Place, in the Kensington area of Liverpool, was built by the Elliot Group to house about 400 students and opened in 2016.\nLeases on individual flats and rooms were sold to people as buy-to-let investments while the freehold of the building was kept by the developer.\nMr Lawless was arrested as part of an ongoing bribery and corruption probe in 2020 and several of his companies - including the one that built Queensland Place - were placed into administration the following year.\nAt the time, Mr Lawless was reported as saying \"bad publicity\" around his arrest had been behind the failure of several ongoing projects.\nHe has denied any wrongdoing, and no charges have been brought.\nThe court heard the freehold on Queensland Place belonged to a company solely owned by Mr Lawless, called 1Dom Ltd.\nBut leaseholders then discovered the freehold was then the property of Schloss Roxburghe Holdings in the Isle Of Man, and they had not been given their right of first refusal to buy it.\nGreig Morrish, who led the legal fight on behalf of leaseholders, said the court sided with their case that their legal right of first refusal had been withheld from them.\nHe said: \"The ruling shows that companies that attempt to put freeholds beyond the reach of leaseholders will be held to account.\n\"This is an important victory for all leaseholders who want to take back control of their own buildings.\"\nThe tribunal heard that Schloss Roxburghe Holdings, which had become the owner of the freehold, was an associated company of Mr Lawless's firms and therefore the move of the freehold was just a transfer of stock.\nTowards the end of the two-year legal case, Mr Lawless produced a document said to be from 2019 showing a transfer of stock from his company to Schloss Roxburghe Holdings.\nBut the tribunal said it had never been seen before, was not stamped and could not be included as evidence.\nThe tribunal had also seen evidence that at the time the freehold changed hands, Mr Lawless was the sole shareholder in 1Dom and Schloss Roxburghe Holdings owned no part of it.\nMr Morrish said the process had been lengthy because of the way the opposing side had delayed and repeatedly changed their arguments.\nThe tribunal made an award that some of the leaseholders' costs should be paid by Schloss Roxburghe Holdings because the proceedings had been \"delayed and confused\".", "url": "https://www.bbc.co.uk/news/articles/cz039dd27z5o"}