{"authors": ["Kulsum Hafeji", "www.facebook.com"], "date_download": "2025-04-26 04:39:36", "date_modify": "2025-04-26 04:39:36", "date_publish": "2025-02-28 09:18:57", "description": "Sarah Dattani Tucker says her South Asian heritage made her think she wouldn't be able to succeed in the industry.", "filename": "news_articles_c9vymgkg90wo_1745642376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c29/live/c3505ec0-f450-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vymgkg90wo_1745642376.html", "title": "Lola Young's Messy music director surprised by success", "title_page": "Lola Young's Messy music director surprised by success - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "You might not know her name but chances are you've seen Sarah Dattani Tucker's work - more than 40 million have at least.\nShe directed the video for Lola Young's Messy , the track that's earned the singer her first UK number one.\nShot on film, the visualiser shows Lola performing in a bare room with an enormous cake which, by the end, has been destroyed.\n\"The concept is inspired by intrusive thoughts,\" she says.\n\"The room is empty because it's supposed to represent a neutral space, like your head space.\"\nIt was one of seven films Sarah made for the pop star to accompany tracks from her second album, This Wasn't Meant for You Anyway.\nSarah's also worked with Arlo Parks and says she never imagined she could do this kind of job, let alone reach this level of success.\nPart of that, she says, is due to her Gujarati heritage.\n\"Sometimes people don't necessarily know where to place you,\" she tells BBC Newsbeat.\n\"As a South Asian in the music industry, I often feel really misunderstood.\n\"There's so few of us in the wider industry.\"\nSarah was born and raised just outside of Manchester to a British dad and a Gujarati mum who was born in Uganda.\nAt school, Sarah says she loved art but was never shown how she might be able to turn that into a career.\n\"I did not come from a family of creatives,\" she says.\n\"I don't want to stereotype in any way, but I would say most of my family are like accountants or pharmacists.\"\nAnd while she says she was never discouraged from pursuing her passion, when she took her first steps in the industry \"family members definitely didn't fully understand exactly what my job was\".\n\"I definitely had to keep reminding everyone that this is a real job.\"\nFeeling misunderstood wasn't limited to school and family life though. Even now Sarah says she can feel out of place in the music industry.\n\"The music industry is so based on genre, and sometimes I've felt like people look at me and they're like, 'oh, you can't really work on this or that'.\n\"I've definitely really struggled with it. It's been really hard.\"\nThe latest diversity report by UK Music, external recorded that in 2024, 7.6% of people working in the music industry identified as Asian.\nThe group represents all sectors of the industry and noted there had been \"positive movement in the right direction\", with people from minority backgrounds now representing more than 25% of the workforce - up from 15.6% when the survey started in 2016.\n\"Nonetheless barriers still exist and we must continue to seek change,\" the report said.\n\"There is a lot of misunderstanding and lack of acknowledgement sometimes,\" Sarah says.\nAnd a lack of acknowledgement is something she'd like to address not just for British Asians, but the people working behind the scenes in the music industry too.\nLola Young is up for best pop act at Saturday's Brit Awards and, until 2019, music videos had a chance to be nominated for prizes too.\nThat award, British Video of the Year, no longer exists - it was last won by Little Mix for their Woman Like Me video.\nOther big awards like the Grammys still make a point of celebrating music videos and even go one step further with an award for best recording package, which goes to the artistic director behind a project.\nThis year it was won by Charli XCX and her creative director Imogene Strauss for Brat, which took on a life of its own - even being named Collins Dictionary 2024 word of the year.\n\"That's such a special moment because that campaign and the creative behind it is incredible,\" Sarah says.\nShe says she would like to see more opportunities for creative teams to be recognised.\n\"It would be nice to have that kind of recognition, just because it is such a big production.\n\"There's so many parts to a campaign, it's so multi-faceted.\"", "url": "https://www.bbc.co.uk/news/articles/c9vymgkg90wo"}