{"authors": ["Sarah-May Buccieri", "www.facebook.com"], "date_download": "2025-04-26 04:30:08", "date_modify": "2025-04-26 04:30:08", "date_publish": "2025-03-03 06:25:38", "description": "Parents say the decision is \"silly\" and \"a bit extreme\".", "filename": "news_articles_cpwdd7781k2o_1745641808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/56db/live/17f8a020-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpwdd7781k2o_1745641808.html", "title": "Lincoln school rips out mirrors to get kids back in class", "title_page": "Lincoln school rips out mirrors to get kids back in class - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A school has removed all mirrors from its toilets because pupils are spending too much time in them.\nGrant Edgar, headteacher of William Farr Comprehensive School in Welton, near Lincoln, said: \"Mirrors can encourage students to spend too much time in toilets often in large groups\".\nMr Edgar added this can make some children feel \"uncomfortable\".\nHowever, one parent said the decision was \"silly\" and \"a bit extreme\" while another said it was \"strange\".\nMr Edgar said the academy faced \"some issues at transition times\" and this could \"affect punctuality to lessons\".\nMirrors, according to Mr Edgar, \"encourage\" students to spend too much time in toilets and students often gathered there in \"large groups\".\n\"This can make it uncomfortable for some students to use the toilets,\" he said.\nIf students require a mirror \"for a medical purpose\", they can ask for one at reception.\nOne parent, Kelly, said she found the decision \"quite strange\" and believed the removal of mirrors would affect her daughter.\n\"My daughter has contact lenses and braces,\" she said.\n\"She does need a mirror if she needs to get her contact lenses out.\"\nKelly said she believed the decision would not \"get rid of any issues\".\nAnother parent, also called Kelly, said the removal of the mirrors was \"silly\" and \"a bit extreme\".\n\"They're just mirrors, aren't they?\"\n\"We have mirrors at home, why can't we have them in school?\" she asked.\nKaren, also a parent, said she first found out about the mirrors after her daughter told her.\n\"I said what's your issue?\" she asked.\n\"She can't go in and check her hair and check her eyelashes haven't fallen off,\" Karen said.\n\"Now she can't do that and she can get to class on time, it's actually probably not a bad thing.\"\nKaren said she could see the \"pros and cons\" to the decision, but there may be circumstances where a mirror was needed.\n\"What if they have something in their teeth?\"\nMs Kenny said she believed the \"bigger issue\" should tackle why children are spending too much time in school toilets.\n\"Maybe something needs to change intrinsically within the school,\" she said.\n\"It can feel like you are running a gauntlet at high school even if you have lovely teachers and pastoral support.\"\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cpwdd7781k2o"}