{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:40:22", "date_modify": "2025-04-26 07:40:22", "date_publish": "2025-02-27 12:22:34", "description": "John Kirtley was a \"leading\" figure in the Sunderland riot which saw police attacked, a court hears.", "filename": "news_articles_cy4vvewng00o_1745653222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f471/live/82552270-f4ff-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vvewng00o_1745653222.html", "title": "Sunderland rioter who 'brought shame on England flag' jailed", "title_page": "Sunderland rioter who 'brought shame on England flag' jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rioter who repeatedly attacked police while draped in an England flag during a night of disorder has been jailed for almost five years.\nJohn Kirtley, 27, was a \"leading\" figure in the violence in Sunderland on 2 August, Newcastle Crown Court heard.\nThe city was one of several to see outbreaks of disorder after anti-immigration protests were held in the wake of the murder of three young girls in Southport.\nKirtley, from Sunderland, admitted rioting, with a judge saying he \"brought shame\" on himself and the St George's flag.\nJudge Robert Spragg said Kirtley was a \"leading member\" of a group throwing beer kegs at police in Keel Square and encouraged and \"whipped up\" others to attack.\nThe court heard Kirtley, of Rutherglen Road, was also part of a group which tried to stop an unmarked police car and he was seen throwing stones and kicking at officers outside a mosque.\nHe was heard shouting claims including \"the government is to blame for this\" and \"come on, this is England\", the court heard.\nJudge Spragg said Kirtley had expressed remorse, especially for the \"racial element\" of his offending, and had \"got in with the wrong crowd\" from whom he was \"seeking validation\".\nJailing him for four years and eight months, the judge told Kirtley: \"Your behaviour was utterly disgraceful, you have brought shame on yourself and the St George's flag you chose to drape yourself in.\"", "url": "https://www.bbc.co.uk/news/articles/cy4vvewng00o"}