{"authors": ["Simon Gilbert and Alix Hattenstone", "www.facebook.com"], "date_download": "2025-04-26 04:18:02", "date_modify": "2025-04-26 04:18:02", "date_publish": "2025-03-04 06:55:49", "description": "The UK has been one of the most popular destinations for international students in recent years - but is the appeal still there?", "filename": "news_articles_cvgwwgl2nleo_1745641082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5598/live/4c3aaeb0-f849-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwwgl2nleo_1745641082.html", "title": "Is the UK becoming less attractive for international students?", "title_page": "Is the UK becoming less attractive for international students? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK has been one of the most popular destinations for international students in recent years - but is its appeal starting to fade?\nHome Office figures show UK sponsored study visas dropped by 31%, external – from 600,024 in 2023 to 415,103 in 2024 - and with this, money many university cities rely on.\nUniversities UK, which represents 141 institutions, says measures to reduce net migration have \"created significant uncertainty around the UK's post-study work offer\".\nThe government says international students \"will always be welcome but the net migration levels seen in recent years have been completely unacceptable, and we have committed to reducing those numbers substantially\".\nCoventry in the West Midlands is particularly dependent on the international student economy.\nIn 2022-23, of universities with at least 10,000 students, Coventry University had the second highest percentage of international students in England outside London.\nThere were 16,285 non-UK students out of a total of 35,405, according to the most recent figures from the Higher Education Statistics Agency, external (HESA).\nJingwen Yuan, 30, spent seven years as a construction project manager in her native China, where she oversaw building projects that housed more people than are found in some UK cities.\nThe Coventry University alumnus has a masters degree in advanced engineering management and paid £3,000 to stay in the UK on a graduate visa while looking for work - but has been unable to find a job.\n\"All of my bachelor degrees classmates from home have gone back to China,\" she says.\n\"My friend got £5,000 to £6,000 from our government if she came back. And for us, if we choose to stay, we need to pay £3,000 to the UK government. Can you see the difference?\"\n\"The one thing stopping more students coming here is recent changes in the visa,\" says Mohammed Abdullah Sayyed, 21, from India.\nStudent visa restrictions took effect in January 2024, meaning postgraduates lost the right to bring dependant family members to the UK and new students were prevented from switching to a work visa before the end of their courses.\nThere was an 85% drop in the number of sponsored study visas for dependants, from 143,276 in 2023 to 21,978 in 2024.\nMohammed says another factor is international students pay more than UK ones.\nCoventry University says tuition fees can vary depending on the course - but as of September 2024, most courses cost approximately £16,800 – £20,050 per year for international students.\nThat's compared to £9,250 for domestic students, which will rise to £9,535 in September.\nCoventry University says Brexit has had \"a profound impact\" on UK universities' ability to attract EU students.\nThe House of Commons Library, external states the number of EU students fell sharply after changes to visa requirements and funding rules in 2021-22.\nSince August 2021, new students from the EU generally have had to pay international fees and do not qualify for tuition fee loans.\nLaura Alonso is studying international relations at Coventry University.\nThe 21-year-old from Spain says: \"There's a lot of international people and international students, especially in Coventry, so you always feel welcome\".\nBut she believes the UK's withdrawal from the Erasmus+ programme, external put lots of Spanish students off studying there.\nThe Turing Scheme, external, which replaced it, funds UK participants to study or work abroad - but does not fund international students coming to the UK.\nWhilst the number of international visas has fallen by almost a third, the number of international students applying to study in the UK via The University and Colleges Admissions Service (UCAS) has increased.\nUCAS saw a 2.7% rise in international undergraduate applicants between 2024 and 2025\nHowever this does not represent the full picture, as UCAS figures do not account for students applying directly through colleges and universities, or postgraduate courses.\nCoventry University says it is proud to widen accessibility to education: \"It would be odd to constrain our mission and values within national borders.\n\"Our long-term strategy of diversifying income to help counter the fact UK tuition fees have been frozen for several years has been successful and remains the right thing to do.\n\"The sustained growth in student numbers over a number of years allowed us to create many jobs and increased economic and social benefits. We are now having to rebalance the organisation based on changes outside of our control.\"\nThe government says its Immigration White Paper will set out \"a comprehensive plan to restore order to our broken immigration system, linking immigration, skills and visa systems to grow our domestic workforce, end reliance on overseas labour and boost economic growth.\"\nVivienne Stern, CEO of Universities UK, says funding issues mean universities are reducing students' options - and the drop in international students is hurting communities.\n\"There are people in all sorts of walks of life who benefit from the fact that universities bring students in who spend money in shops and cafes - local businesses, getting their hair cut, taking taxis.\n\"It really contributes to economies right across the UK, and I think that's really special.\"", "url": "https://www.bbc.co.uk/news/articles/cvgwwgl2nleo"}