{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:49:29", "date_modify": "2025-04-26 07:49:29", "date_publish": "2025-02-26 22:32:40", "description": "It was running in January 2023 following £25m of repairs before it was closed again due to snagging issues.", "filename": "news_articles_c0kg5lgxv7eo_1745653769.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5bb4/live/04329d20-f458-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg5lgxv7eo_1745653769.html", "title": "Cairngorm funicular railway reopens after lengthy closure", "title_page": "Cairngorm funicular railway reopens after lengthy closure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK's highest railway has returned to service following an extensive programme of work.\nThe Cairngorm funicular near Aviemore, was closed for four years from September 2018 due to structural issues with the track.\nIt was reopened to the public in January 2023 following £25m of repairs before it was closed again in August that year due to snagging issues.\nOwner Highlands and Islands Enterprise (HIE) said the remediation work had been completed.\nThe public agency said, weather conditions permitting, the 1.2-mile (2km) funicular railway would now run a regular service throughout the day, seven days a week.\nThe facility near Aviemore is operated by Cairngorm Mountain (Scotland) Ltd (CMSL).\nInterim chief executive Tim Hurst said: \"We recognise how critical the railway is, not only to our entire team here at CMSL, but to all our customers and to many businesses in the local and regional area.\n\"We would like to thank all our visitors for their patience whilst remediation took place.\"\nOpened in 2001 at a cost of £19.5m, the railway connects a base station with a restaurant and a ski area 1,097m (3,599ft) up Cairn Gorm - the UK's sixth highest mountain.", "url": "https://www.bbc.co.uk/news/articles/c0kg5lgxv7eo"}