{"authors": ["Joe Willis", "www.facebook.com"], "date_download": "2025-04-26 08:13:03", "date_modify": "2025-04-26 08:13:03", "date_publish": "2025-02-26 11:32:29", "description": "Village primary is closing as it has just 16 pupils left but parents are campaigning against it.", "filename": "news_articles_c62z7d0p383o_1745655183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ca6/live/fe21af50-f431-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62z7d0p383o_1745655183.html", "title": "North Yorkshire: Parents ask education secretary to save school", "title_page": "North Yorkshire: Parents ask education secretary to save school - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Parents have urged a government minister to reconsider her decision to allow the closure of a North Yorkshire primary school.\nCampaigners have pledged to fight to save Kirkby Fleetham Church of England Primary School, near Northallerton, with more than 600 people signing a petition calling for the school to remain open.\nThe Dales Academies Trust announced last month it planned to close the school at the end of the summer term due to low pupil numbers.\nEducation secretary Bridget Phillipson has agreed to the closure, with North Yorkshire Council this week saying it had \"no alternative\" but to agree to the move as the authority has no control over the decision of an academy trust.\nIn their latest move, members of the Save Our School campaign have written to Phillipson and contacted Richmond and Northallerton MP Rishi Sunak for help.\nParent Tim Barker, from the campaign group, said: \"The school is one of the reasons that attracted local families to move here. Without it we're at risk of becoming solely a silver-haired retirement village.\"\nHe added: \"There's 250 years of heritage in the school that is going to be lost.\"\nMr Barker said the trust had announced the closure with \"zero consultation\".\nHe said the campaign group rejected the trust's claim that low numbers impacted on children's social development.\nNorth Yorkshire Council senior officers and councillors met behind closed doors on Tuesday to discuss the proposed closure, according to the Local Democracy Reporting Service.\nNorth Yorkshire Council's executive member for education, learning and skills, Councillor Annabel Wilkinson, whose division includes Kirkby Fleetham, said in a statement after the meeting: \"As the school is an academy, it is not for us to make a decision about the closure, instead the process is being overseen by the trust under guidance set out by the Department for Education.\"\nHowever, she said the council objected to the process of closing academies \"which does not allow for a public consultation\".\n\"We will write to the secretary of state regarding this,\" Wilkinson added.\nA report prepared for the meeting stated that there were 16 children currently at the school, which has a capacity of 63 pupils.\nAlthough this was predicted to fall to 15 next year, it was estimated that it would rise to 23 by 2029/30.\nDamian Chubb, chief executive of the Dales Academies Trust, had previously defended the closure, saying that a review had identified that low pupil numbers would impact on children's social development and the financial sustainability of the school.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c62z7d0p383o"}