{"authors": ["Georgia Roberts", "www.facebook.com"], "date_download": "2025-04-26 07:05:59", "date_modify": "2025-04-26 07:05:59", "date_publish": "2025-02-28 06:20:51", "description": "High Peak MP Jon Pearce calls for Peak District authorities to take \"immediate and decisive action\".", "filename": "news_articles_cly3387z43ro_1745651159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f46/live/17a55140-f525-11ef-ba6e-5dc164a31f2d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly3387z43ro_1745651159.html", "title": "'TikTok craze behind beauty spot parking issues'", "title_page": "'TikTok craze behind beauty spot parking issues' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP says a \"TikTok craze\" is behind the \"increasingly untenable\" state of parking at beauty spots in the Peak District.\nJon Pearce, who represents High Peak in Derbyshire, says social media users have been flocking to the area to see the sunrise and sunset at Mam Tor.\nRoads in the national park have recently been blighted by bad parking, including on 11 January, when \"around 200 cars\" prevented gritting from taking place.\nPearce has now written to Peak District authorities calling for \"immediate and decisive action\", less than a week after councillors in Hope Valley called for an \"urgent plan of action\" to tackle parking in the area.\nIn the letter addressed to the Peak District National Park Authority, Derbyshire County Council, Derbyshire Police and High Peak Borough Council, Pearce said the situation was \"unacceptable\".\nHe said: \"Residents are rightly alarmed that current parking restrictions are failing to deter motorists from parking irresponsibly.\n\"The consequences of this unchecked behaviour are severe - our roads are increasingly unsafe.\"\nPearce told the BBC he lives in Hope Valley, where parking has \"got out of hand\" and is \"causing chaos\".\nHe said: \"I understand a lot of the issues we're having at the moment is because there's a TikTok craze for going and seeing sunrise, sunset on Mam Tor and that's caused the peak in the parking issues we've got at the moment.\n\"But that has at least given us the heads-up that we've got to be prepared for the summer.\"\nPearce says he believes solutions such as barriers on verges, higher fines, improved road signage and more seasonal public car parking sites can be put in place before the peak tourism season this summer.\nA Derbyshire County Council meeting on Wednesday heard that boulders could be placed on either side of the road near Mam Tor to try and curb the spike in illegal parking.\nRushup Edge has seen the most parking fines in the most recent complete year at almost 2,000, above Edale and Castleton, according to the Local Democracy Reporting Service, external (LDRS).\nA council highways manager told the meeting that a key issue on Mam Tor was a \"lack of education\" around road restrictions, such as clearways and double-yellow lines.\nA spokesperson for the Peak District National Park Authority said it would be meeting other local authorities in March to discuss \"realistic, appropriate and workable ideas\" to address the issue.\nThey said: \"The priority of the National Park Management Plan is to create an 'area management' style approach, but also back this with a clear evidence-base of accurate and timely data.\n\"It is the authority's intention to pilot this approach in the areas currently affected by increased visitor footfall, such as around Castleton.\"\nDerbyshire Police said officers were conducting frequent patrols in problem areas, adding that parking dangerously was \"not an option\".\nA force spokesperson said: \"Most people do manage to park safely, but we have seen dangerous and irresponsible parking from some people in recent weeks, bringing roads to a standstill and hindering emergency services.\n\"Nowhere safe to park? Drive on, there are hundreds of options of places to start a walk.\"\nCouncillor Charlotte Cupit, the county council's cabinet member for highways assets and transport, said not all of the parking problems were under the authority's control or remit.\nHowever, she said the council was \"doing all we can to deal with the issues we are responsible for\", adding it had been working with police and other authorities on a \"multi-agency basis to try to resolve the issues, and we will continue to do this\".\nCupit said the authority did not own any land or car parks in the national park, but was \"working to proactively support sustainable travel, rather than concreting over the Peak District\".", "url": "https://www.bbc.co.uk/news/articles/cly3387z43ro"}