{"authors": ["Samantha Noble", "Kayleigh Hall", "www.facebook.com"], "date_download": "2025-04-26 06:35:46", "date_modify": "2025-04-26 06:35:46", "date_publish": "2025-02-27 06:10:36", "description": "Richard Usher, founder of the museum, says it is \"the holy grail of television Land Rovers\".", "filename": "news_articles_cj6755dr371o_1745649346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d5b/live/3f14ff80-f44b-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj6755dr371o_1745649346.html", "title": "Vera's Land Rover from detective show goes on display", "title_page": "Vera's Land Rover from detective show goes on display - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A British TV detective's famous car has gone on display after the final episode was aired.\nThe 1996 Land Rover Defender 90, driven by actress Brenda Blethyn in the ITV drama Vera, has found a new home at the Great British Car Journey museum, in Ambergate, Derbyshire.\nDet Ch Insp Vera Stanhope's light blue Land Rover Defender, which has an extra step for the 5ft 2in (157cm) tall actress, could be seen on TV screens on Sunday nights when the series ran between 2011 and 2025.\nRichard Usher, founder of the Great British Car Journey, told the BBC it was \"the holy grail of television Land Rovers\".\nThe final episode of Vera aired in January, after it was filmed last summer.\nMr Usher said: \"This car was almost as big a star as Brenda herself - it featured in pretty much every episode.\n\"To Land Rover enthusiasts, which there are many, this is the holy grail of television Land Rovers.\"\nDescribing the vehicle, he said when you opened the driver's door, the first thing you saw was a little step.\n\"Apparently Brenda is about 5ft 2in, so that was fitted so she could get in and out properly,\" he said.\nHe added: \"Probably its little guilty secret is it has an automatic gearbox.\n\"From what I understand, Brenda only has a licence for an automatic car.\"\nMr Usher said this model of Land Rover had not been built with an automatic gearbox.\n\"When it was decided they were going to use the Land Rover, they had to get an auto box fitted to this,\" he said.\n\"She does pretend to change gear - she sort of fakes it on TV.\"\nMr Usher said it had been parked in the museum opposite Sir Elton John's \"amazing Bentley\", which he said was made about the same year as the Land Rover.", "url": "https://www.bbc.co.uk/news/articles/cj6755dr371o"}