{"authors": ["Archana Shukla", "www.facebook.com"], "date_download": "2025-04-26 04:33:57", "date_modify": "2025-04-26 04:33:57", "date_publish": "2025-03-03 02:42:13", "description": "India's market regulator recently banned a dozen financial influencers from giving trading advice.", "filename": "news_articles_cddyye3zplno_1745642037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f529/live/4bb259d0-f4f1-11ef-ae0a-4bca4f518eb0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddyye3zplno_1745642037.html", "title": "Asmita Patel: Ban on financial influencer exposes regulation cracks", "title_page": "Asmita Patel: Ban on financial influencer exposes regulation cracks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "YouTuber Asmita Patel's mission was to \"make India trade\".\nThe wildly popular financial influencer called herself the \"She-Wolf of the stock market\" - her take on the Hollywood film The Wolf of Wall Street. At last count, she had clocked upwards of half a million subscribers on YouTube and hundreds of thousands on Instagram. Fees for her stock trading courses ran into thousands of rupees.\nLast month, the market regulator Securities and Exchange Board of India (Sebi) put a spanner in the works. It barred her and six others from trading, external, alleging she was selling illegal stock tips disguised as investor education and making millions of rupees in the bargain.\nThe regulator's crackdown on Patel is its latest attempt to tighten the noose around social media influencers offering quick money schemes and trading advice disguised as education.\nIndia's post-pandemic market boom attracted a wave of new mom-and-pop investors. Online trading accounts grew from merely 36 million in 2019 to more than 150 million last year, data from the brokerage Zerodha shows.\nMany of these first-time market entrants relied on social media for trading tips which, in turn, birthed a new breed of self-styled \"investment gurus\" or \"financial influencers\" like Ms Patel, promising quick money.\nWith only 950 registered investment advisors and 1,400 financial advisors in the country, these influencers quickly filled the void, amassing hundreds of thousands of subscribers and followers.\nMost operated without regulatory registration, blurring the line between investment advice and stock market education. This prompted Sebi to crack down, banning at least a dozen influencers, including a Bollywood actor, from offering trading advice.\nThe regulator has also barred brokerages and market players from partnering with influencers who peddle illegal stock tips or make misleading return claims.\nSebi has also laid down strict guidelines for educators, effectively barring them from offering real-time trading tips or using live market data for educational purposes.\nThe regulator found Ms Patel and her husband, Jitesh, directing students and investors to trade specific stocks through their advisory firm. She allegedly used private Telegram channels, Zoom calls and courses to sell tips without mandatory registration.\nSebi acted in Ms Patel's case after 42 participants complained of trading losses and demanded compensation. It is now moving to seize millions of rupees that Patel and her associates earned from course fees between 2021 and 2024.\nAs markets correct, the economy slows and regulators crack down, other influencers face a credibility test.\nThousands of angry investors have recently accused high-profile influencers of faking their success to sell trading courses and earn millions in brokerage referrals.\nSebi's order in Ms Patel's case too revealed she made just over $13,700 (£10,800) as trading profits in the past five years but earned more than $11.4m (£9m) by selling courses.\nMs Patel didn't respond to the BBC's request for comment.\nWhile Sebi's drive to protect small investors is well intentioned, its recent regulatory actions have drawn criticism for being delayed and lacking clarity.\nThe regulator has been both a \"selective\" and \"reluctant regulator\", Sucheta Dalal, veteran financial journalist and author, told the BBC.\n\"It should have acted a few years ago when trading sites started paying influencers to promote their products. Now this phenomenon has become too big.\"\nSumit Agrawal, a former officer with Sebi, says the regulator singled out a few as an example instead of enforcing a clear, comprehensive policy.\n\"Curbing unregulated stock tips is necessary, but requiring trading schools to use three-month-old data for educational purposes and not teaching practical experience of trading strategies on live market crosses into over-regulation,\" he says.\nManish Singh, a chartered accountant and YouTuber with half a million followers, makes market analysis videos. He says Sebi's new rules have created confusion over what's allowed.\n\"Even genuine content creators who are trying to guide people in the right direction will lose subscribers and the monetary incentive of brand deals as confidence to work with creators is shaken,\" Singh told the BBC.", "url": "https://www.bbc.co.uk/news/articles/cddyye3zplno"}