{"authors": ["Kirsteen O’Sullivan", "www.facebook.com"], "date_download": "2025-04-26 04:14:21", "date_modify": "2025-04-26 04:14:21", "date_publish": "2025-03-04 11:09:51", "description": "Henry, who is aged 11 and in Year 6, has a mitochondrial disease which affects his energy levels.", "filename": "news_articles_c871jzjnw0vo_1745640861.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f630/live/e1a46ae0-f86c-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c871jzjnw0vo_1745640861.html", "title": "Oxfordshire boy taught 'in isolation' because of SEND issues", "title_page": "Oxfordshire boy taught 'in isolation' because of SEND issues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The parents of a boy with special educational needs and disabilities (SEND) say they are \"devastated\" he is being taught in isolation away from other pupils after his school said it could no longer meet his needs.\nHenry, who is aged 11 and in Year 6, has a mitochondrial disease which affects his energy levels.\nLast year St Nicholas Primary School, in Abingdon, said he needed specialist provision but a place at another school could not be found, so he is taught in a separate building at the school.\nOxfordshire County Council said it was in the process of making improvements to its SEND provision.\nAll of Henry's lessons are held by a specialist tutor.\nHis parents, Rachel and Ralph, said that while friends can visit, they often forget.\nThey told the BBC that he had managed well and described him as academically bright.\nHis father Ralph said: \"No one visited him on his birthday, it was one of those days people forgot to visit.\n\"We just want him to be treated like everyone else.\n\"He wants those social opportunities, which are being taken away from him - he's not even allowed in the school photo.\"\nRalph added that the situation was \"just devastating, every part of it\".\nSt Nicholas CE Primary School was asked for comment but referred the BBC to the county council.\nLast week Oxfordshire County Council's scrutiny committee met to review improvements to its SEND provision, following a highly critical 2023 Ofsted report.\nThe authority said overall progress was being made but admitted it was \"not fast enough\" and \"not in all areas\".\nKate Gregory, the council's cabinet member for SEND improvement, said: \"Obviously I want every child and young person to receive the support they need and I'm sorry that this isn't yet the case for every child and young person.\"\nShe added: \"We've been working really hard as a Local Area Partnership (LAP) to build and deliver real lasting impact for families. It's going to take time to turn things around.\"\nIn a statement the council said that due to safeguarding and data protection it could not comment on individual cases.\nIt said: \"We care deeply about improving the lives of children and young people and supporting them, along with their families, to thrive.\"\nResponding to the statement, Ralph said: \"For Henry, there's been no improvement at all - he's just accepted collateral damage.\"\nHenry's mother Rachel added: \"Who is thinking about Henry here? There might be rules and regulations but really, what's best for Henry?\"", "url": "https://www.bbc.co.uk/news/articles/c871jzjnw0vo"}