{"authors": ["David Dixon", "www.facebook.com"], "date_download": "2025-04-26 04:31:50", "date_modify": "2025-04-26 04:31:50", "date_publish": "2025-03-03 06:07:27", "description": "People living in Grampound want to buy the Dolphin Inn and run it as a community asset.", "filename": "news_articles_c5y0dn4823go_1745641910.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/88f5/live/78f33860-f5eb-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0dn4823go_1745641910.html", "title": "Community group wanting to buy local pub needs to raise £450,000", "title_page": "Community group wanting to buy local pub needs to raise £450,000  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People living in the Cornish village of Grampound are starting a campaign to buy the local pub.\nThe Dolphin Inn has been put up for sale for £415,000 by the owners St Austell Brewery.\nA group has been set up to explore the possibilities of buying and running the pub as a community asset.\nOne of the campaign leaders said he was optimistic, adding: \"If anybody can do it, Grampound can.\"\nSupporters of the idea of taking over the pub for the community have created a Facebook page and are carrying out a survey, external to collect peoples' views.\nSimon Fielder, who is one of the group's founders, said: \"A village needs a hub and without a pub the village is just a street with houses either side and it needs more than that but getting the money together will be the first obstacle.\"\nDean Jenkins, a retired doctor and a councillor on Grampound with Creed Parish Council who is also part of the group, said he wasn't sure how they would raise the money yet.\n\"We have no idea at the moment but there's match funding that could be available from organisations like 'The Pub is the Hub' and Plunkett,\" he admitted.\n\"If anybody can do it, Grampound can.\"", "url": "https://www.bbc.co.uk/news/articles/c5y0dn4823go"}