{"authors": ["Chris Mason", "www.facebook.com"], "date_download": "2025-04-26 06:24:15", "date_modify": "2025-04-26 06:24:15", "date_publish": "2025-03-01 01:28:46", "description": "Sunday's summit of European leaders in London, to be attended by Ukraine's leader, is shaping up to be crucial, the BBC's political editor writes.", "filename": "news_articles_cj6787zzg79o_1745648655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/40f6/live/ac293940-f664-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj6787zzg79o_1745648655.html", "title": "Colossal stakes for Starmer's summit on Ukraine", "title_page": "Trump Zelensky: Colossal stakes for Starmer's summit on Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In the immediate hours after those astonishing exchanges between Presidents Donald Trump and Volodymyr Zelensky in the White House, European leaders, one after another, offered their public support for Ukraine.\nBut the prime minister remained silent.\nThen, as I dashed into the studio for the BBC News at Ten, my phone went.\nI had been sent a statement from No 10: Sir Keir Starmer had spoken to them both and the prime minister \"retains unwavering support for Ukraine and is doing all he can to find a path forward to a lasting peace\".\nFriday afternoon in the White House had not only entirely upended in the most spectacular fashion the relationship between two allies - America and Ukraine - but the diplomacy of recent days too, with the visits of President Emmanuel Macron of France and then the prime minister to the White House.\nJust 24 hours before Volodymyr Zelensky's visit to the Oval Office, I had stood there in the same room witnessing Trump and Sir Keir's warmth and bonhomie: what a contrast to what was to come next.\nSir Keir, like Emmanuel Macron before him, had sought to ingratiate himself with the wildly unpredictable American president, convinced that was the pragmatic course of action.\nNow the prime minister confronts a situation where two of the UK's allies are at loggerheads in the most public and angry way.\nSources are tight-lipped about the precise nature of the two phone calls Sir Keir made on Friday night, very aware of the acute sensitivities of this delicate situation.\nBut the UK's diplomatic efforts in recent weeks at least allowed those calls to be possible, allowing the UK to attempt to act as a bridge between both Kyiv and Washington, and Washington and Europe.\nIt comes, though, at some political cost. The government's domestic critics such as the Scottish National Party argue that the invitation for Donald Trump to come to the UK on a second state visit should be rescinded.\nSunday's summit of European leaders in London, hosted by the prime minister and attended by President Zelensky, was already shaping up to be crucial. It has now taken on further importance.\nTo give you a sense of that, Trade Minister Douglas Alexander told BBC Radio 4's Any Questions that not only were the scenes in the Oval Office \"deeply troubling and sobering\" but demonstrated \"in the starkest possible terms\" the extent to which \"the world we've all experienced for the last 80 years\" had changed, adding we that were in \"uncharted waters\".\nHe also called President Zelensky the \"bravest political leader in Europe since Winston Churchill\".\nAnd the European Union's top diplomat, Kaja Kallas, said that it had \"become clear that the free world needs a new leader. It is up to us, Europeans, to take this challenge.\"\nBut that is the crux of this. Is Europe capable of that?\nAt the heart of the UK and others' request of America is that the White House provides a security guarantee to Ukraine under any peace deal.\nThe UK wants that to amount to air cover. This would be a big ask of any president at any time, with the danger of conflict escalating with Russia.\nBut it is a colossal ask of a president who has made it abundantly clear he has no appetite whatsoever for American foreign military adventures.\nWhich brings us to this weekend and President Zelensky joining his European allies in the UK.\nThere is a colossal amount at stake.", "url": "https://www.bbc.co.uk/news/articles/cj6787zzg79o"}