{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:57:10", "date_modify": "2025-05-19 14:57:10", "date_publish": "2015-02-13 10:13:36", "description": "Tory MP calls on Labour leader Ed Miliband to publish tax documents after claims he used provisions associated with minimising inheritance tax liabilities.", "filename": "news_uk-politics-31452496_1747666630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80981000/jpg/_80981172_80981168.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31452496_1747666630.html", "title": "Ed Miliband should publish tax documents - Conservative MP", "title_page": "Ed Miliband should publish tax documents - Conservative MP - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Conservative MP has called on Labour leader Ed Miliband to publish documents relating to his share of his parents' former home.\nThe Daily Mail says, external provisions were made to split ownership after his father's death, which could be used to cut inheritance tax liabilities.\nA Labour spokesman said the claims were a \"straightforward lie\" and that \"no tax was avoided\".\nTory MP Andrew Bridgen said Mr Miliband should be open about his tax affairs.\nMr Miliband has confirmed his mother Marion set up a deed of variation after the death of his father Ralph.\nIt is believed this altered provisions relating to the house in his will.\nThe Daily Mail reported the deed allowed ownership of the house to be split between Mrs Miliband and her sons. The paper quoted experts suggesting such arrangements could be used to reduce eventual inheritance tax liabilities.\nMr Miliband later sold his share to brother David who also bought the rest of the property from his mother.\nMr Bridgen said: \"It is absolutely beyond doubt - and not for a moment denied by Ed Miliband - that he and his family used a deed of variation in 1994 and that this arrangement was in place for 10 years.\n\"As the former head of tax at PwC has said 'the reason people use deeds of variation is to save on inheritance tax'.\n\"Ed Miliband should now publish this deed of variation that he is currently hiding away and be as open about his own tax affairs as he demands others to be. The public can then judge for themselves.\"\nBut a Labour spokesman said: \"Ed paid 40% capital gains tax when the house was sold in 2004/05. It can't be tax avoidance if no tax was avoided.\"", "url": "https://www.bbc.com/news/uk-politics-31452496"}