{"authors": ["Kayla Epstein", "www.facebook.com"], "date_download": "2025-04-26 03:56:21", "date_modify": "2025-04-26 03:56:21", "date_publish": "2025-03-04 15:11:02", "description": "Democrats were largely outraged by the decision, but even some Republicans voiced concerns that the move would only aid Russia.", "filename": "news_articles_cp8l25453l3o_1745639781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dfc9/live/3fc64450-f9c0-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8l25453l3o_1745639781.html", "title": "Trump faces pushback in Washington over Ukraine aid freeze", "title_page": "Trump faces pushback in Washington over Ukraine aid freeze - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump's decision to pause shipments of military equipment to Ukraine following a heated meeting with its President Volodymyr Zelensky has shocked many in Washington.\nUkraine has relied heavily on the US for military aid since Russia launched its full-scale invasion of the country in 2022. Such a pause could have a significant effect on the war.\nThe aid pause was decried by Democrats and split Republicans - some of whom broke with the president to criticise the aid cuts.\n\"I do not think we should be pausing our efforts,\" Republican Senator Susan Collins of Maine said. \"It's the Ukrainians who are shedding blood.\"\nRepresentative Don Bacon, a Nebraska Republican, noted that Russia would continue to get support from its backers as the US ceased its aid.\n\"Too bad Iran, North Korea and China are not pausing their military aid and economic support,\" he told Politico.\nIn an Oval Office meeting last week, Trump accused Zelensky of \"gambling with World War Three\" after the Ukrainian leader expressed scepticism that diplomacy alone could deter Russian President Vladimir Putin.\nThe meeting led at least one of the Ukrainian leader's Republican supporters, Senator Lindsey Graham of South Carolina, to openly criticise him.\n\"What I saw in the Oval Office was disrespectful and I don't know if we can ever do business with Zelensky again,\" Graham told reporters outside the White House last week immediately after the meeting.\nAfter Trump announced the aid pause on Monday night, Graham posted on X that he has \"tried very hard to maintain support for the efforts of the Ukrainian people to repel the Russian invasion and have expressed admiration for President Zelensky's leadership during the most difficult times\".\nHe then added: \"I, like so many others, can only give advice. It's up to President Zelensky to determine whether or not to take it.\"\nTrump's decision comes amid an escalating White House pressure campaign on Zelensky to negotiate a ceasefire deal with Russia, and to sign a related deal with the US involving its rare mineral resources.\nHR McMaster, Trump's former national security adviser, who has since criticised the president, said that Putin \"couldn't be happier\" as a result of the tensions between the US and Ukraine.\n\"What he sees is all of the pressure on Zelensky, all of the pressure on Ukraine and no pressure on him,\" the retired general told CBS News, the BBC's US partner.\nTrump's current national security adviser, Mike Waltz, had a different view when he appeared on CNN on Monday. He said that Zelensky simply needed to show he was \"ready to go to peace\".\nMeanwhile, Democrats, who have been more unified in their support for Ukraine, expressed outrage over the pause. They argued it would damage US national security.\n\"It is a critical strategic mistake for Donald Trump to unilaterally disarm against Putin,\" Senate Minority Leader Chuck Schumer posted on X.\nSenator Elizabeth Warren of Massachusetts accused Trump of \"siding with Putin over US allies in Europe\".\nThe effect is being felt far beyond Washington, as it has sent the US's allies in the UK and Europe scrambling to address the potential fallout.\nUkrainians expressed widespread shock and dismay at the US military aid pause.\nOleksandr Merezhko, who chairs the Ukrainian parliament's foreign affairs committee, told BBC Breakfast it could have \"dangerous consequences\".", "url": "https://www.bbc.co.uk/news/articles/cp8l25453l3o"}