{"authors": ["Nick Clark", "www.facebook.com"], "date_download": "2025-04-26 06:31:25", "date_modify": "2025-04-26 06:31:25", "date_publish": "2025-02-27 09:04:31", "description": "Developers built 10 more flats at Willow Tree House in Langley than they had permission for.", "filename": "news_articles_c39vvv8v4z1o_1745649085.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/97c7/live/65fff270-f4e7-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vvv8v4z1o_1745649085.html", "title": "Slough flats already built and occupied refused permission", "title_page": "Slough flats already built and occupied refused permission - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Planning permission for a block of flats has been refused by councillors – despite the fact that it has already been built and fully let to tenants.\nProperty developer Redsky Homes built 51 flats at Willow Tree House on Station Road in Langley, despite only having permission for 41.\nSlough Borough Council's planning committee voted unanimously to refuse retrospective planning permission.\nCommittee member councillor Pavitar Mann said developers should not be allowed to bypass the planning system.\nIt means Redsky Homes will have to either demolish the building or change it to match the approved plans for 41 homes.\nThe developer has the option to appeal to the government's Planning Inspectorate to overturn the decision.\nMs Mann told the meeting: \"The applicant continued to build the scheme knowing that they were in breach of the planning permission that they have.\"\nPlanning permission for the 41-home development – on the site of the former Willow Tree pub – was granted on appeal by the government's Planning Inspectorate in August 2021.\nRedsky Homes applied for permission for a six-storey block of 53 flats on the site in August 2023, later amended to 47 flats the following May.\nIn the meantime, it began construction work that the council said \"didn't appear to reflect the original consents\".\nRedsky withdrew its application for a six-storey development in November last year.\nIn the same month it applied for permission for the 51-home building – which had already been built.\nCouncil planning officers told the committee they had tried to work with the developer to make the plans acceptable – while also warning it to stop building.\nBut they said the developer had \"proceeded very quickly to complete and let the flats out\" while talks were ongoing.\nA representative of Redsky Homes' planning agent Savills, arguing in favour of granting permission, highlighted Slough's \"significant housing shortfall\", which the development would help address.\nBut planning officers said the benefit was outweighed by concerns that amounted to \"substantive harm\" – including the scale and bulk of the building and the fact that it contains no affordable housing.", "url": "https://www.bbc.co.uk/news/articles/c39vvv8v4z1o"}