{"authors": ["James Pearson", "www.facebook.com"], "date_download": "2025-04-26 07:05:37", "date_modify": "2025-04-26 07:05:37", "date_publish": "2025-02-28 06:25:54", "description": "Major Post Office branches face the axe as part of a national shake-up.", "filename": "news_articles_cg5ddq0241vo_1745651137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2367/live/a9001250-f4ef-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg5ddq0241vo_1745651137.html", "title": "Customers and Redditch MP urge Post Office not to close town branch", "title_page": "Customers and Redditch MP urge Post Office not to close town branch - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Customers and the MP for Redditch have urged the Post Office not to close the \"lifeline\" central branch in the town.\nLabour's Chris Bloore said 1,100 people had signed a petition calling on the taxpayer-owned business to explore all options to keep its services in the constituency.\nOne woman said she used the town's post office as Studley, where she lives, has already lost its branch.\nWhile the Post Office denied a decision had been made over the fate of Redditch, it confirmed it was assessing the future of its 108 loss-making directly-managed branches.\n\"This is an integral part of the high street. A lot of people, a lot of elderly and vulnerable people, rely on this Crown Post Office and so they're really worried about the future,\" he said.\nIn a meeting with Post Office bosses last week, the Labour MP said he had urged managers to think of \"imaginative\" ways to keep the branch going, including potentially moving it to a better location.\nCustomers at the branch said closure would have a direct impact on them.\nJane Ellison, 57, from Studley, said she used the branch as a \"last resort\", after having already lost her village Post Office.\n\"Generally I use it for stamps. I use it for parcel packaging, sending parcels,\" she said.\n\"I don't drive so I have to rely on the bus... there's nothing like it in our little village at all. Everything's gone.\"", "url": "https://www.bbc.co.uk/news/articles/cg5ddq0241vo"}