{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:49:54", "date_modify": "2025-04-26 03:49:54", "date_publish": "2025-03-05 13:15:26", "description": "Two men who raped girls who were \"vulnerable in the extreme\" in Rotherham are sentenced.", "filename": "news_articles_c7vzr4jq077o_1745639394.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bd72/live/e15a00a0-f9ba-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7vzr4jq077o_1745639394.html", "title": "Pair jailed for grooming and raping teenagers", "title_page": "Operation Stovewood: Pair jailed for grooming and raping teenagers in Rotherham - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two men who groomed and raped girls described as \"vulnerable in the extreme\" in Rotherham have been jailed.\nRomulad Stefan Houphouet and Absalom Sigiyo were found guilty at Sheffield Crown Court of a number of sexual offences committed in 2011 and 2012.\nTheir five-week trial heard how two 15-year-olds who lived at a children's home were sexually assaulted several times a week by a gang of men who called them \"fresh meat\".\nOn Wednesday, Houphouet, 37, an Ivorian national of Burngreave, Sheffield, was jailed for 20 years and Sigiyo, 41, a Zimbabwean national of Catcliffe in Rotherham, for 18-and-a-half years.\nJudge Sarah Wright told the men they had inflicted \"severe psychological harm\" on the girls, who were still suffering to this day.\nThe complainants showed \"bravery beyond measure\" by reporting the abuse and speaking in court during the trial, she added.\nThe National Crime Agency (NCA) said the victims had been raped \"countless\" times, with one victim reporting being raped two to three times a week by Sigiyo.\nThe NCA said Houphouet first encountered the girls in 2011, then aged 24, when he took one of them into an alley in Rotherham town centre and raped her.\nHe raped her again in an \"act of revenge\" after he found his lodger, Jacek Brzozowski, having sex with her. She was also raped by Sigiyo.\nBrzozowski, 35, a Polish national of Rawmarsh in Rotherham, will be sentenced in April after admitting sexual activity with a child.\nKath Blain, senior investigating officer, said \"words can barely describe\" the bravery of the two women in reporting their experiences.\n\"It cannot have been easy for them to have relived the terrible abuse they suffered,\" she added.\n\"They did so with strength, courage and utmost dignity.\"\nHouphouet was convicted on Monday of four counts of rape and one count of sexual assault, both relating to the same victim.\nSigiyo was convicted of two counts of rape, penetrative sexual activity with a child, attempted rape, inciting a child to engage in sexual activity and intimidation.\nHe was also found guilty of intimidating one of the victims and trying to stop her from supporting the investigation, which launched in 2018.\nThe convictions are the latest in the NCA's Operation Stovewood, which investigates child sexual exploitation in Rotherham between 1997 and 2013.", "url": "https://www.bbc.co.uk/news/articles/c7vzr4jq077o"}