{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:14:49", "date_modify": "2025-05-21 04:14:49", "date_publish": "2025-02-01 00:00:00", "description": "The plane had been on a medical transportation mission to Mexico, carrying a child patient, her mother and four crew members.", "filename": "news_live_c3e1d3y4nq2t_1747800889.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c3e1d3y4nq2t_1747800889.html", "title": "Person in car killed along with six people on board medical plane in Philadelphia crash", "title_page": "Person in car killed along with six people on board medical plane in Philadelphia crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Investigators look for debris in gardens and around parked cars\nThe crash site is extensive - officials say it not only spans four to six blocks, but there is also debris in remote areas.\nFor this reason, investigators can be seen scouring the gardens of residential homes, as well as on and around parked cars in the area.\nThe mayor earlier called on residents to check their cars for any evidence of the crash, and if they find something, call 911 and do not touch it.\nRed Cross asks people to stop bringing donations\nDuring the news conference earlier, the mayor said that donations were not needed in this tragedy. That message has been echoed by the Red Cross Philadelphia.\n\"We understand people want to help and appreciate the support,\" the charity organisation wrote on X.\n\"Red Cross has what it needs to support the community. We ask that you not bring material donations such as clothing or food to the shelter. We're working to identify partners to handle donations.\"\n'I'm trying to check on my cousin... I haven't heard from her yet'\nPhiladelphia residents have been reacting to Friday night's crash, with one man saying the area of the site is \"unrecognizable\".\n\"I come here almost every day, I'm a field rep salesman. And fortunately yesterday I didn't go into the field. But coming back today, this place is unrecognizable,\" Zach Coates tells Reuters.\n\"Everything that was here, the community, everything I can tell, everybody is impacted by it,\" he adds.\nOne woman, Tanisha, becomes emotional as she explains that she is trying to get in touch with her cousin, who lives on a block which is currently cordoned off.\n\"Oh, man. I haven't heard from her yet. So I'm trying to make sure she is okay. My heart is racing. There is a lot going on, a lot of emotions,\" she says.\nFifteen people treated at Jefferson Health after crash\nWe have a few more details about the people who were injured on the ground.\nJefferson Health told NBC News that they provided care for 15 people on Friday night, 12 of whom have since been discharged.\nTwo people have been admitted for further care, and one patient has been transferred to another hospital.\nAs a reminder, Philadelphia's Mayor said earlier that 19 people were injured on the ground, but this number could change\nWhere did the plane set off from, and when did it crash?\nThe private Learjet 55, a medical transportation jet, took off from Northeast Philadelphia Airport in the state of Pennsylvania yesterday afternoon.\nThe plane was headed to Springfield-Branson National Airport in Missouri, where it was stopping off before continuing to Mexico.\nFlight logs show it was only in the air for a minute before it crashed at approximately 18:10 local time (23:10 GMT).\nArea of impact spans several blocks and remote areas, city manager says\nOfficials are still answering questions from journalists.\nCity Manager Adam Thiel says the area of impact is around \"four to six blocks\" and there is also debris in remote areas.\nHe reiterates that the incident covers a \"widespread area\" and says residents who live between the location of the crash and Northeast Philadelphia Airport may find evidence related to the crash.\nIf they do, he urges them not to touch it and call 911.\nHe also says locals should contact authorities if anyone they know is missing.\n'Could be days or more' before final death toll is known, city official says\nThe media are asking questions now.\nThe first question is about structural damage to the neighbourhood and if there could be more deaths.\nFire commissioner Jeffrey Thompson says there were five fires as a result of the crash - all have now been extinguished.\nPhiladelphia Managing Director Adam Thiel steps in, and says \"this is a very large area with a lot of damage and we are still working in a number of different ways to assess that damage.\"\nThey are going \"literally house-by-house, door-to-door,\" he adds.\nOn victims, Thiel says there could be changes to the casualty number. There are several patients in hospitals and they are still unclear about \"who was where\" last night.\nIt \"could be days or more\" until they can say how many people died in this crash.\nMayor says officials 'will not act in haste' with sharing information about the crash\nThe mayor says authorities were hesitant to say how many people had died last night, because they \"knew those numbers would be moving.\"\n\"We will not act in haste as we are reporting on this issue,\" she says, adding that they won't share information that hasn't been verified extensively.\nShe passes over to the Pennsylvania Governor Josh Shapiro.\nStay away from the crash site, mayor says\nThe public should not come to the crash site right now, Mayor Parker says, reiterating that it is still an active scene.\nShe adds that no donations are needed - a message also shared by the local Red Cross - and there has been no donation page set up dedicated to this tragedy.\nParker expresses her appreciation for the desire to help and says she will keep the public updated on the formal ways people can do so.\nAs a reminder: The mayor has confirmed all six people on board the flight that crashed in Philadelphia have died as well as one other person who was in their car at the time.\nMayor praises collaboration between agencies and thanks White House\nParker says \"our local, state and federal partners, they are all working together as we work to address this tragedy.\"\nShe thanks all of those involved in the efforts following the crash, including the agencies and officials.\n\"We are grateful for your support.\"\nThe effort has been helped \"with the support of the White House, with the support of our senators... every state legislator who is present here.\"\n\"What you witness here today is everyone standing up together.\"\nPower outage still affecting local households\nMayor Cherelle Parker says nearby households have been impacted by the loss of power and utility services are working to restore it. She urges locals to check online for further updates.\nThe mayor says they are encouraging people in the area to stay at home if they can can as the crash site remains an \"active investigation\".\nShe adds that there are police officers and fire authorities on every block and residents should have no problems if they plan to leave.", "url": "https://www.bbc.com/news/live/c3e1d3y4nq2t"}