{"authors": ["Selin Girit", "www.facebook.com"], "date_download": "2025-05-19 14:23:28", "date_modify": "2025-05-19 14:23:28", "date_publish": "2015-03-31 09:35:35", "description": "Turkish MPs back sweeping new powers for police - and critics fear that intolerance is becoming entrenched, Selin Girit reports from Istanbul.", "filename": "news_world-europe-32129015_1747664608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82024000/jpg/_82024670_turkpoliceankaranewap.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-32129015_1747664608.html", "title": "Alarm as Turkey backs new police powers", "title_page": "Alarm as Turkey backs new police powers - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Turkish parliament has agreed to give the police sweeping new powers - but only after weeks of long debate, punch-ups between MPs and sit-in protests.\nThe controversial new security bill is expected to be approved by President Recep Tayyip Erdogan.\nThe police will have the right to conduct stop-and-search, detain people for up to 48 hours without court orders and use firearms against demonstrators carrying petrol bombs or other \"injurious weapons\". Critics say that could mean a firecracker or a simple slingshot.\nDemonstrators who are masked, for example with a scarf, could face up to five years in prison. Governors - who are appointed by the government - would be given the right to order police investigations.\nThe government argues the measures are needed for security and protection from violent protests and are in line with European standards. The opposition says the bill, if approved, is bound to turn Turkey into a police state.\nIt comes at a sensitive time for Turkish domestic politics. A general election will be held on 7 June and peace talks to end three decades of Kurdish insurgency have faltered recently, as splits emerged between the governing AK Party and Mr Erdogan over how to proceed.\nThe Kurds are particularly wary of the new bill, saying it could be used specifically to target them. It was introduced after pro-Kurdish protests in October, in which almost 50 people died.\nMehmet Ersoy, an MP in the ruling, Islamist-rooted AKP, says those protests convinced the government to adopt extra police measures in order to \"stop provocations\".\nThe bill would have a positive impact on the peace process, he told the BBC.\n\"Let's see who really wants peace. Let's take the masked vandals with Molotov cocktails off the scene,\" he said. \"We just want to stop the violence.\"\nHowever, Ertugrul Kurkcu, an MP from the pro-Kurdish party HDP, does not share that optimism.\n\"If the gendarmerie, who will now be under the interior ministry, or the police rely on the powers granted to them and try to intimidate, pressurise or use violence against people, that will damage the peace atmosphere. There will no longer be a suitable climate for peace talks - neither politically, nor psychologically,\" he said.", "url": "https://www.bbc.com/news/world-europe-32129015"}