{"authors": ["Claire Hamilton", "www.facebook.com"], "date_download": "2025-04-26 04:31:17", "date_modify": "2025-04-26 04:31:17", "date_publish": "2025-03-03 06:11:55", "description": "A council leader says she will \"continue to fight\" to save a Victorian pier that needs £13m repairs.", "filename": "news_articles_cyveqpvj56vo_1745641877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fccd/live/8232e1a0-f5f5-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyveqpvj56vo_1745641877.html", "title": "Fight to save Southport Pier 'will continue after funding blow'", "title_page": "Fight to save Southport Pier 'will continue after funding blow' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council leader has said she will continue fighting for funding to fix a Victorian pier, despite being told a National Lottery Heritage grant would not be available \"at this time\".\nMarion Atkinson told a Sefton Council meeting on Thursday that the authority had made an expression of interest to the funding body for £10m to fix Southport Pier, but had been \"politely\" told it would not be immediately invited to make a full application.\nThe pier has been closed since December 2022 due to health and safety concerns.\nThe National Lottery Heritage Fund said the council's proposals were not something it would support \"in its current form\".\nEarlier this year, the council secured the listed buildings consent needed to allow repairs to be made.\nAtkinson said her council would \"apply again when the time is right\" and added the local authority had done \"all within our power to be ready to replace the pier when the money becomes available\".\nShe added: \"We have a plan. We have commitment.\"\nAtkinson went on: \"Let's be clear, the bottom line is the need for money, which the council does not have.\"\nThe leader of the Liberal Democrat opposition, former Southport MP John Pugh, said the National Lottery response was a \"hammer blow\" to the council's ambitions.\nBut he said Sefton Council had found £20m of its own money to help pay for a new conference centre next to the pier, £32m to buy the Strand, £8m to loan to its own housing company and £54m over the last five years to boost children's services.\nHe said: \"Sefton can clearly fund the repair by appropriate use of revenue and capital resources. It just does not want to do so.\"\nThe BBC understands Sefton Council submitted an expression of interest to the Heritage Lottery Fund for the maximum £10m which would require development and delivery over a number of years.\nThe council could submit a revised expression of interest, perhaps for a smaller amount, later in the year.\nA National Lottery Heritage Fund representative confirmed an expression of interest, as part of a pre-application process, had been submitted by Sefton Council.\n\"The project outline submitted was not something The National Lottery Heritage Fund would be likely to support in its current form,\" the representative said.\n\"We have provided feedback to Sefton Council and have invited them to get in touch with us if they would like to discuss this further.\"", "url": "https://www.bbc.co.uk/news/articles/cyveqpvj56vo"}