{"authors": ["Isaac Ashe", "www.facebook.com"], "date_download": "2025-04-26 04:40:31", "date_modify": "2025-04-26 04:40:31", "date_publish": "2025-03-02 07:20:29", "description": "Sandra Kinyanjui waited an hour with a young boy at South Wigston Railway Station.", "filename": "news_articles_c3d881ezlx8o_1745642431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7dbf/live/b73888d0-f502-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d881ezlx8o_1745642431.html", "title": "Train station encounter with boy in care inspired 10k challenge", "title_page": "Train station encounter with boy in care inspired 10k challenge - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A chance encounter at a railway station in Leicestershire inspired a woman to take on a 10k challenge.\nSandra Kinyanjui, a 25-year-old education consultant, was considering taking on a personal challenge when she got talking to a stranger, a boy about 10 years old, on his own at South Wigston Station.\nThe boy asked Miss Kinyanjui to use her phone to call his children's home and as she spent an hour waiting with him to be collected she learned about his experiences in care.\nShe said: \"I feel like it was all in God's plan for me to meet that boy.\"\nMiss Kinyanjui said the boy reaching out to her for help \"pulled on my heartstrings\" and led her to choosing to run the Leicester 10k on Sunday to raise money for the Black Care Experience.\nShe said: \"He was just having a really tricky time and it was really quite sad to see.\n\"I thought this could be my little brother in an alternate universe.\n\"I've heard anecdotally that with the experiences of young black children in care, there's a disparity there, so then I was like, OK I'm going to find a charity, and the Black Care Experience just sort of stood out.\"\nMiss Kinyanjui, from Leicester, has been training for about four months to work up to 10k.\nShe added: \"Just knowing that I'm doing it for a good cause is definitely going to keep me going - I've got to finish it somehow.\"\nMiss Kinyanjui is one of thousands of people of all abilities who will be lacing up their running shoes for the annual Leicester 10k on Sunday, organised by Jane Tomlinson's Run For All.", "url": "https://www.bbc.co.uk/news/articles/c3d881ezlx8o"}