{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 06:57:24", "date_modify": "2025-04-26 06:57:24", "date_publish": "2025-02-28 14:18:37", "description": "The coins were minted by Royalists who needed their own form of currency while under siege.", "filename": "news_articles_cd0nn02lzpmo_1745650644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b77e/live/999e3720-f5c5-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0nn02lzpmo_1745650644.html", "title": "Rare civil war siege coin to be sold at auction", "title_page": "Newark: Rare civil war siege coin to be sold at auction - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rare coin minted by Royalists during the English Civil War is to be put up for auction.\nThe lozenge-shaped coin is said to offer an insight into a pivotal moment of history, when the Nottinghamshire town of Newark was held by forces loyal to Charles I.\nThree sieges took place in Newark between 1643 and 1646 during the conflict with Parliamentarians, which left Royalists cut off and in need of a form of currency, which was created using silver items people of the town were forced to donate.\nA shilling depicting a crown, the initials CR and Newarke 1645, which was part of a private collection, will be auctioned by Anderson & Garland in Newcastle on Thursday.\nFred Wyrley-Birch, auctioneer and director of Anderson & Garland, said: \"Newark was under siege three times during the civil war and the longest period was for about six months.\n\"The main reason for minting these coins was to pay the soldiers to keep them fighting.\n\"They would go into people's houses and anyone who had any silver was pressed into giving over whatever they had.\"\nThe coin is expected to fetch between £1,000 and £2,000.\nThe same auction will feature a George III Northumberland shilling from 1763.\nIt was produced by the Royal Mint among an issue of 100,000 coins, £100 worth of which were distributed to people in Dublin when Hugh Percy, the 2nd Earl of Northumberland, was installed as Lord Lieutenant of Ireland.\nMr Wyrley-Birch said: \"They were distributed in the same way as Maundy money.\n\"But only about 800 of the 100,000 coins minted were distributed in this way, the rest would have been sent off to various banks.\n\"These coins do survive, but they are relatively rare, as many examples of them wear down over the years and you cannot tell what they are.\"\nBoth coins came from a collection of shillings owned by a long-term customer of the auctioneers, who has died.\nThe auction will be broadcast live online.", "url": "https://www.bbc.co.uk/news/articles/cd0nn02lzpmo"}