{"authors": ["Mark Smith", "www.facebook.com"], "date_download": "2025-04-26 08:04:54", "date_modify": "2025-04-26 08:04:54", "date_publish": "2025-02-26 15:27:15", "description": "Moat Primary Academy in Matson is to close with pupils and staff moving to nearby Robinswood Primary.", "filename": "news_articles_c07zkyv7j82o_1745654694.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/beed/live/0fccaa90-f435-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zkyv7j82o_1745654694.html", "title": "Two Gloucester primary schools to merge after government approval", "title_page": "Two Gloucester primary schools to merge after government approval - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two primary schools are to merge, with one site closing, after the move was approved by the Department for Education.\nMoat Primary Academy in Matson, Gloucester will close as it merges with nearby Robinswood Primary Academy from 1 September.\nThe Greenshaw Learning Trust, which runs both schools and held a consultation on the plans, said it was \"an exciting opportunity for growth and development that will benefit all children across both schools\".\nHowever, Labour MP for Gloucester Alex McIntyre said unless a clear transition plan was in place with support for children and families he would push for the merger to be delayed until September 2026.\nThe trust has said there were not enough pupils to sustain both schools.\nThere was a heated meeting at Moat Primary last November when senior members of the Greenshaw Learning Trust and school staff told parents about the merger proposal.\nIn a statement announcing the amalgamation plans had been approved, the trust acknowledged \"change can be challenging\", but added the merger would \"enhance educational opportunities for all children\".\nIt also said the move would \"create a more resilient learning environment that will serve the Matson community for years to come\".\nThe trust said its immediate focus was on appointing a permanent headteacher and choosing a name for the new school.\nBut Mr McIntyre described the announcement of the merger as \"disappointing and worrying\" for a number of families.\nHe pledged to work with Greenshaw Learning Trust, the county council and community to make the transition as smooth as possible.\n\"My priority throughout all of this is firstly what is best for the children so they get the best possible education and secondly that local people's voices are heard in this process,\" Mr McIntyre said.\nHe said he made made clear \"we've been a bit disappointed\" over the consultation.\n\"We don't think the community has been involved as much as we would like,\" the MP said.\n\"I know this is not a decision that everyone will agree with, but now it has been made let's work together to make sure that all of those children at the new school in September 2025 are getting the best possible education,\" he added.\nThe trust said the decision followed a period of consultation where feedback from staff members, parents and carers, and local stakeholders was received and considered, and was also being used to guide future planning.", "url": "https://www.bbc.co.uk/news/articles/c07zkyv7j82o"}