{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:55:12", "date_modify": "2025-04-26 06:55:12", "date_publish": "2025-02-28 15:40:13", "description": "A selection of the week's best photos from across the African continent and beyond.", "filename": "news_articles_c78ee2qlx9lo_1745650512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/946e/live/aa9d4050-f5db-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ee2qlx9lo_1745650512.html", "title": "Africa's week in pictures: 21-28 February 2025", "title_page": "Africa's week in pictures: 21-28 February 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On Wednesday, a boy attempts to outrun his opponents on a sandy football pitch in Ivory Coast's largest city, Abidjan.\nAmanuel Ghebreigzabhier from Eritrea has the same goal in mind as he leads the pack during the seventh UAE Tour on Saturday.\nResidents of Bukavu, in the Democratic Republic of Congo, gather for a meeting on Thursday organised by the M23, a rebel group that has taken over the city.\nAt a Global Citizen concert last Friday in neighbouring Rwanda, US musician John Legend commands the spotlight.\nThousands of miles away, a model at London Fashion Week on Sunday presents garments from British-Nigerian designer Tolu Coker.\nAlso catwalk-worthy? These mustard yellow school uniforms are spotted on the streets of the Nigerian city of Jos on Thursday.\nOn the same day in Senegal, staff at Dakar's Massalikoul Djinane Mosque, the biggest mosque in West Africa, prepare for the holy fasting month of Ramadan.\nPhotographer Cem Ozdel shared images this week from a recent trip to The Gambia where he attended a Ngente ceremony, which is held to name babies - blending Islamic culture with local traditions, and involves shaving the newborn's head...\nHe also witnessed the arrival of fishing boats in Tanjeh and the women waiting to unload the catch.\nOn Saturday, two lions and a lioness in South Africa unwind in the shade in a Johannesburg safari park.", "url": "https://www.bbc.co.uk/news/articles/c78ee2qlx9lo"}