{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:36:56", "date_modify": "2025-04-26 06:36:56", "date_publish": "2025-02-26 06:39:38", "description": "A head teacher says the free breakfasts will make sure \"no child starts the day hungry\".", "filename": "news_articles_cgl0y09n68ko_1745649416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f912/live/742478a0-f382-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl0y09n68ko_1745649416.html", "title": "School welcomes 'much-needed' breakfast scheme", "title_page": "School welcomes 'much-needed' breakfast scheme - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A city school has welcomed the government's free breakfast club scheme.\nThe government has announced the first 750 schools where pupils will be offered a free daily breakfast, benefiting up to 180,000 pupils.\nTwo Peterborough schools - Northborough Primary School and St John Henry Newman Catholic Primary School - will be among the first to take part in the scheme from April.\nMark Cooper, head teacher at St John Henry Newman in Hampton, said this scheme provided \"much-needed support, easing financial pressures and ensuring that no child starts the day hungry\".\nLabour campaigned on a promise of free breakfast clubs in every English primary school and later tripled funding to £30m.\nAnnouncing the first schools to join the pilot scheme, the Department for Education (DfE) said breakfast clubs had \"an important role to play in the government's commitment to remove the stain of child poverty\".\nAcross Cambridgeshire, 14 schools have been included in the first stage of the rollout.\nAs part of the pilot, parents will be able to drop off children 30 minutes before their usual school time, knowing they will be offered a free breakfast, the government said.\nMr Cooper said the school was \"pleased\" to be part of the scheme and he estimated about 35% of their pupils would benefit from the initiative.\n\"DfE funding levels are a concern, however we firmly believe that the positive impact on children and families far outweighs the challenges,\" he said.\n\"Additionally, the social aspect of breakfast clubs fosters a sense of belonging and routine, promoting emotional wellbeing and school engagement.\n\"By embracing this scheme early, we aim to steer the development of this project, ensuring that when this is fully rolled out across all schools nationally it impacts all school communities positively.\"\nGuidance sent to schools taking part in the pilot scheme says they will receive a set-up payment to cover equipment and material.\nUnder the scheme, schools will then be reimbursed by the government based on attendance at the clubs - a school with 50% participation in the pilot scheme could get £23,000 a year, the government said.\nThe National Association of Head Teachers (NAHT) welcomed the news but also voiced concern that funding could fall short.\n\"It will be crucial that these concerns are addressed before the programme is rolled out across the country, to ensure that it does not place further pressure on already strained school budgets,\" said NAHT general secretary Paul Whiteman.", "url": "https://www.bbc.co.uk/news/articles/cgl0y09n68ko"}