{"authors": ["Rob Thomas", "www.facebook.com"], "date_download": "2025-04-26 06:51:39", "date_modify": "2025-04-26 06:51:39", "date_publish": "2025-02-28 17:42:33", "description": "Details of the issues being investigated have not been made public.", "filename": "news_articles_cp3y4w7nxw4o_1745650299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9481/live/85559e10-f5f8-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3y4w7nxw4o_1745650299.html", "title": "Bangor: Church launches safeguarding inquiry at cathedral", "title_page": "Bangor: Church launches safeguarding inquiry at cathedral - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An investigation has been launched into a \"very serious and urgent\" safeguarding issue at a cathedral, the Church in Wales has said.\nArchbishop of Wales Andrew John wrote to people connected to Bangor Cathedral in Gwynedd last October, about the issues that had been brought to his attention.\nThe archbishop, who is also the Bishop of Bangor, ordered a Visitation - the church term for an inquiry - to be carried out, conducted by senior figures from the Church in Wales, external.\nDetails of the issues being investigated have not been made public, but the church said a summary report and recommendations would be published \"once the process is complete\".\nThe church has also asked Thirtyone:eight, external, a body specialising in providing safeguarding advice in church settings, to look into the issues raised.\n\"We take safeguarding extremely seriously,\" the Church in Wales said in a statement on Friday.\n\"When concerns were drawn to the attention of the Archbishop of Wales, he initiated the visitation process.\"\nIt added that due to confidentiality concerns \"we will not be giving further details of the matters under consideration at this time\".\n\"The purpose of the visitation to Bangor Cathedral is to ensure that the spiritual wellbeing of the cathedral community is being cared for, and to verify compliance with established safeguarding processes,\" the statement added.", "url": "https://www.bbc.co.uk/news/articles/cp3y4w7nxw4o"}