{"authors": ["Alex Bish", "www.facebook.com"], "date_download": "2025-04-26 04:31:46", "date_modify": "2025-04-26 04:31:46", "date_publish": "2025-03-03 06:07:34", "description": "Some rescues have taken place as far south as Dieppe, more than 180km (112 miles) from Calais", "filename": "news_articles_c62z992l1y4o_1745641906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5080/live/feb46730-f0b4-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62z992l1y4o_1745641906.html", "title": "Migrant boats launched further away from Calais", "title_page": "Migrant boats launched further away from Calais - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some migrants are being rescued from small boats that have been launched into the English Channel much further south of Calais than before.\nThe Maritime Prefecture of the Channel and North Sea said there had been an extension of the departure areas to the south, with some as far as Dieppe.\nIt also said in its annual report, external that the average number of people per boat has risen from 45 in 2023 to 54 last year.\nAudrey Baconnais-Rosez, the local state representative in Dieppe, told BBC South East they had seen \"an increase in people trying to depart from Normandy, but the number of migrants is still much lower than what we have in the north of France.\"\nThe majority of the small-boat crossing attempts are made from the Calais and Dunkirk region, but some rescues took place in the Dieppe area in December and January - about 180km (112 miles) further south.\nLaunch locations began to include estuaries that police have countered with barrages and dams.\nSome gangs have used \"taxi boats\", where migrants get a craft into the water and then pick up others as they wait offshore in the surf.\nNine years ago the authorities stepped up security at Dieppe to prevent small boat crossings and stop migrants stowing away on lorries bound for Newhaven in East Sussex.\nBut in August 2024, a van driver was found guilty of smuggling seven migrants into the UK in the hidden compartment of a vehicle on a cross-Channel ferry.\nMs Baconnais-Rosez said: \"We've saved nearly 90 people at sea and brought them back to the shore. In January we saved 46 people.\n\"We found 50 people inside the Dieppe harbour next to the ferry,\" she said.\n\"All the French authorities have decided to increase patrols in order to prevent those departures. We have also put more cameras and more security around the Dieppe harbour.\n\"We want to safeguard life at sea and have increased the surveillance.\"", "url": "https://www.bbc.co.uk/news/articles/c62z992l1y4o"}