{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:48:24", "date_modify": "2025-04-26 06:48:24", "date_publish": "2025-03-01 11:23:57", "description": "The fire service said people should avoid lighting any fires outdoors between Saturday and Wednesday.", "filename": "news_articles_c17q59k52eno_1745650104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/97bc/live/2045adf0-f687-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17q59k52eno_1745650104.html", "title": "Risk of wildfires 'very high' in north and east Scotland", "title_page": "Risk of wildfires 'very high' in north and east Scotland - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"very high\" risk warning for wildfires has been issued for the north and east of Scotland over the coming days.\nThe Scottish Fire and Rescue Service (SFRS) said people should avoid lighting any fires outdoors between Saturday and Wednesday.\nThe affected areas include the northern parts of the Highlands, Grampian, Fife and the east coast stretching down to the Borders.\nIts is the first wildfire alert issued in 2025.\nArea commander Michael Humphreys warned that fire can ignite and spread very quickly and \"burn with high intensity\" during any period of heightened risk.\nHe said: \"At this time of year in early spring, even when the weather is still bitterly cold in some areas, we typically have a large volume of dead, bone-dry vegetation across large areas of countryside. This essentially acts as a fuel for fire.\n\"There are currently vast areas that are tinder dry and vulnerable, which provides all the ingredients for fire to take hold and spread.\"\nMr Humphreys added: \"Human behaviour is the cause of most wildfires in Scotland, so it is imperative we all act responsibly while enjoying the outdoors over the coming days and weeks ahead.\n\"By following some simple but key advice, we can significantly reduce the risk of wildfire occurring.\"\nFirefighters tacked several wildfires across Scotland last year.\nIn May, one blaze saw the A85 in Argyll close after it set alight 500 square metres of grass and gorse.\nAnother fire spread to 100 square metres of gorse at Brimmond Hill near Aberdeen in the same month.\nThe fire service said it saw more than one wildfire a day between March and June in 2023.\nForty-eight of the 133 fires recorded spread to an area of over a hectare each.\nHundreds of firefighters and community partners tackled the blazes over several weeks, with two injured at Cannich.\nThe Cannich blaze was thought to be the largest recorded in the UK, with Nasa satellites detecting it from space.", "url": "https://www.bbc.co.uk/news/articles/c17q59k52eno"}