{"authors": ["Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 03:48:15", "date_modify": "2025-04-26 03:48:15", "date_publish": "2025-03-05 15:03:03", "description": "The actress tells followers her mastectomy in January was \"a success and has healed really well\".", "filename": "news_articles_c62zgy1l3e6o_1745639295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cdbd/live/527293e0-f9cc-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zgy1l3e6o_1745639295.html", "title": "Ali Bastian: Hollyoaks and Doctors star says she is free of cancer", "title_page": "Ali Bastian: Hollyoaks and Doctors star says she is free of cancer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Soap actress Ali Bastian has said she is \"free from cancer\" following a mastectomy, chemotherapy and radiotherapy treatment.\nThe 43-year-old announced last year that she had been diagnosed with stage two breast cancer after finding a lump while breastfeeding her daughter.\nBastian has now told her Instagram followers, external she is on her \"final week of radiotherapy which should mark the end my active treatment\", as part of a post thanking supporters for their birthday messages.\nShe added: \"I had my mastectomy in January which was thankfully a success and has healed really well, it proved that my chemo had worked. As I sit here right now, I'm free from cancer. I can't even believe it.\"\nShe said the staff had given her \"compassion, time and space to share and talk about my experience of a very challenging treatment pathway\", which she called \"an awful lot to process mentally and emotionally\".\n\"To be coming out of the other side of this feels unreal, after the shock of a diagnosis it's hard to let in the light and believe that it might just be OK,\" she added.\n\"The road back to my life won't be a linear one... and I will share with you as always, as much of my truth of this experience as I can. I am so, so grateful for all of your support.\n\"People with cancer, experiencing cancer treatment need love. Full stop. Unconditional, arms around you love and support. I've really felt that from you all, also in my day to day life... from the most unexpected of places. When it's dark, look for stars.\"\nAccording to Cancer Research UK, stage two breast cancer is an early form of the condition and can mean the disease is either in the breast or in the nearby lymph nodes, or both.", "url": "https://www.bbc.co.uk/news/articles/c62zgy1l3e6o"}