{"authors": ["Tom McArthur", "Jaroslav Lukiv", "www.facebook.com"], "date_download": "2025-04-26 06:27:04", "date_modify": "2025-04-26 06:27:04", "date_publish": "2025-02-28 19:13:33", "description": "The US president clashes with Ukraine's leader in a fiery Oval Office exchange over ending the war with Russia.", "filename": "news_articles_c9dejydynngo_1745648824.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3fd/live/dce0b560-f608-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9dejydynngo_1745648824.html", "title": "Trump accuses Zelensky of 'gambling with World War Three'", "title_page": "Donald Trump accuses Zelensky of 'gambling with World War Three' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump has clashed with Volodymyr Zelensky in a furious exchange at the White House, with the US president telling his Ukrainian counterpart to make a deal with Russia \"or we are out\".\nThe pair interrupted each other repeatedly in front of the media during what was supposed to be a prelude to the two leaders signing a minerals deal.\nAfter relations first became strained over Trump's handling of Ukraine peace talks with Russia, the minerals agreement was supposed to be a stepping stone towards further security ties between the countries.\nBut Zelensky was told by the Americans to leave before the deal could be signed.\nThe meeting to discuss the US-Ukraine deal, which involved access to Ukrainian oil, gas and rare minerals, came after the new US president appeared to blame Zelensky for the war and chided him for not starting peace talks with Russia earlier.\nHis tone had softened in recent days, with Trump saying he had \"a lot of respect\" for the Ukrainian leader.\nBut Friday's conversation soured after the US Vice-President JD Vance - who was sat alongside other politicians in the room - told Zelensky that the war had to be ended through diplomacy.\nZelensky responded by asking \"what kind of diplomacy?\", referencing a previous ceasefire deal in 2019, agreed three years before Russia's full-scale invasion when Moscow was supporting and arming separatist fighters in Ukraine's east.\nThe vice-president then accused Zelensky of being disrespectful and \"litigating\" the situation in front of the media.\nFrom there, the discussion escalated quickly, as Trump and Vance accused Ukraine's president of being ungrateful for three years of US support during the war with Russia, with Trump saying Zelensky was in no position to tell the US how it should feel.\nNot long after the meeting - and well ahead of the pre-planned schedule - Zelensky was seen leaving the White House in his official vehicle.\nTrump took to Truth Social, the social media platform he owns, to say \"Zelensky disrespected the US in its cherished Oval Office\", external.\n\"I have determined that President Zelensky is not ready for Peace if America is involved, because he feels our involvement gives him a big advantage in negotiations,\" the Republican president continued. \"I don't want advantage, I want PEACE.\"\nZelensky also posted on social media, thanking the president and the US four times.\nIn a later interview with Fox News, Zelensky said the public spat \"was not good\" - but the relationship between him and Trump could be salvaged.\n\"Because the relations are more than just two presidents,\" he said, adding that it was also about \"strong relations between our two people.\"\nReaction to the White House meeting among US politicians appeared to fall along partisan lines, with Republicans praising Trump and Democrats criticising him.\nRepublican Senator Lindsey Graham - once a staunch supporter of Ukraine - told reporters: \"What I saw in the Oval Office was disrespectful and I don't know if we can ever do business with Zelensky again.\"\nHe said Zelensky \"either needs to resign and send somebody over that we can do business with, or he needs to change\".\nDemocratic House minority leader Hakeem Jeffries described Zelensky's treatment as \"appalling\", adding that it \"will only serve to further embolden Vladimir Putin\".\nIn Ukraine, there was broadly appreciation for Zelensky holding his ground over what is, for them, an existential war.\n\"Trump's administration was so arrogant,\" one man in Kyiv told the BBC. \"When you look at Zelensky's face, you understand that the discussion behind the closed doors was not so polite.\n\"They are so rude, they don't respect the people of Ukraine. They even don't hide it.\"\nThe Oval Office spat also prompted words of support for Zelensky from key European allies, including France.\nA spokeswoman for UK Prime Minister Sir Keir Starmer - who has cast himself as a mediator between the US and Europe as the Trump administration adopts a more isolationist approach to the continent - said he had spoken to both leaders.\nShe said Sir Keir \"retains unwavering support for Ukraine, and is doing all he can to find a path forward to a lasting peace\".\nFriedrich Merz, who is expected to become Germany's next chancellor, wrote that he stood with Ukraine \"in good and testing times\", adding: \"We must never confuse aggressor and victim in this terrible war.\"\nEU foreign policy chief Kaja Kallas said that \"today, it became clear that the free world needs a new leader. It's up to us, Europeans, to take this challenge\".\nRussia, meanwhile, said Trump and Vance had acted with restraint. A foreign ministry spokeswoman said it was a miracle the pair hadn't hit Zelensky.", "url": "https://www.bbc.co.uk/news/articles/c9dejydynngo"}