{"authors": ["Andrea Pluck", "www.facebook.com"], "date_download": "2025-04-26 06:28:42", "date_modify": "2025-04-26 06:28:42", "date_publish": "2025-02-27 11:34:06", "description": "The Queensway Motorbike Track will be a \"lasting legacy\" to Dylan Holliday, who died in August 2021.", "filename": "news_articles_cy834dxrkyxo_1745648922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2678/live/0b258cb0-ef7f-11ef-85a9-c7d843fd355b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy834dxrkyxo_1745648922.html", "title": "Wellingborough bike track to be revived in memory of Dylan", "title_page": "Wellingborough bike track to be revived in memory of Dylan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former motorbike track is to be restored and reopened in memory of a local teenager.\nThe project to revive Queensway Motorbike Track in Wellingborough, Northamptonshire, began after the fatal stabbing of 16-year-old Dylan Holliday in 2021.\nTogether Connect NN, a community interest company, has been formed by Dylan's family and members of the community to support the opening of the site, which will be called Dylan's Bike Track, or DBT.\nDavinia Walsh, Dylan's mother, said it would be a \"lasting legacy\" to her son and a safe space for children.\nMs Walsh said: \"Behind where Dylan was murdered is an old motorbike track and with what's happened to my son, I think it's a great opportunity to give something back to the community.\n\"There are so many children that don't go to school in Wellingborough who need help and support, and this will be a safe zone for them.\"\nShe said Dylan was \"passionate\" about bikes and the project was a fitting tribute to her son.\nTogether Connect NN has been granted a five-year lease for the site by North Northamptonshire Council and plan to reopen the track for both off-road motorbikes and push bikes by the summer.\nThose involved with the project have relied on donations of tools and equipment and set up a Go Fund Me page to help finance the track.\nThe group aims to operate a fully supervised track with health and safety measures in place to give young people in the area \"their own safe environment\" whilst raising awareness of knife crime.\nMs Walsh added: \"We also want to teach them [children] how to maintain a motorbike and do an oil change and just teach them some life lessons.\n\"We're just setting up the track for the community and then they can bring their ideas on how they want the track to be too.\n\"The death of Dylan has made such an impact in this town and my vision is that the track is going to be heaving and kids are going to be happy.\"\nThe Reverend Ben Lewis, vicar at St Mark's Church on the Queensway estate, is one of the directors of Together Connect NN and believes the project will provide opportunities for local children.\n\"It's right on the site where we have tragically lost Dylan, so it's very much about regenerating and redeeming this area of land where something tragic happened,\" he said.\n\"It will encourage them in their love of biking and develop their resilience and independence.\"\nAn open day for Dylan's Bike Track will take place on 12 April to show the community the progress of the area and to raise funds to complete the project.", "url": "https://www.bbc.co.uk/news/articles/cy834dxrkyxo"}