{"authors": ["Nick Jackson", "www.facebook.com"], "date_download": "2025-04-26 06:17:02", "date_modify": "2025-04-26 06:17:02", "date_publish": "2025-03-01 18:44:33", "description": "Sheltered accommodation residents oppose a charity's plans to convert a pub into temporary housing.", "filename": "news_articles_cy83ev3x09jo_1745648222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f323/live/fb265960-f691-11ef-9dad-2d98b18c0719.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83ev3x09jo_1745648222.html", "title": "Elderly Wigan residents 'terrified' about homeless shelter plans", "title_page": "Elderly Wigan residents 'terrified' about homeless shelter plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Elderly residents have said they will be \"terrified\" to leave their sheltered accommodation if plans to convert a former pub into a new homeless centre are approved.\nPeople living at Saddle Court in Wigan said a charity's bid to convert the nearby Queens Arms into temporary accommodation would exacerbate existing anti-social behaviour problems in the area.\nAnti-poverty charity The Brick wants to transform the disused pub near the town centre so that it can house up to 14 people transitioning out of rough sleeping. The new centre would replace its current shelter.\nThe Brick's planning application will be considered by Wigan Borough Council.\nA petition has been launched by a resident on nearby Bridgewater Street, which claims the facility would create \"increased anxiety among residents\".\nOne sheltered accommodation resident Rose Parkinson, 79, said that while people living there had nothing against the homeless, they had been left feeling \"frightened and vulnerable\".\nPat Meadow, who lives in a ground floor flat opposite the pub, described the plans as \"awful\".\nThe 77-year-old said she was now frightened to open her windows.\nSylvia Carrier, 85, said: \"I think it's disgusting that they are trying to do this.\"\nAnother resident, 71-year-old Sandra Reade, said: \"It's a worry because I've just lost my husband. In my eyes, this is more frightening.\n\"I'm really anxious and nervous.\"\nTommy Foster, 83, has been living at Saddle Court for two years.\nHe also said he was worried about what may happen if The Brick's application is approved by councillors.", "url": "https://www.bbc.co.uk/news/articles/cy83ev3x09jo"}