{"authors": ["Joshua Nevett and Sam Francis", "Jonathan Beale", "www.facebook.com"], "date_download": "2025-04-26 07:55:31", "date_modify": "2025-04-26 07:55:31", "date_publish": "2025-02-25 12:51:53", "description": "The PM will head to Washington a day after announcing military budgets would rise to 2.5% of national income by 2027.", "filename": "news_articles_clyrkkv4gd7o_1745654131.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3dd9/live/23650fa0-f3c4-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrkkv4gd7o_1745654131.html", "title": "Starmer cuts aid to fund increase in defence spending", "title_page": "Keir Starmer cuts aid to fund increase in defence spending - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has set out plans to increase defence spending to 2.5% of national income by 2027.\nThe prime minister said he would cut the foreign aid budget to fund the military boost - a move welcomed by the US administration but labelled a \"betrayal\" by development charities.\nSir Keir will face MPs in the Commons on Wednesday before flying to the US, where Ukraine will be top of the agenda in a meeting with President Donald Trump.\nThe spending announcement came as leaders across Europe looked to overhaul defence policies over fears the US could make a deal with Russia to end the Ukraine war which leaves the continent vulnerable.\nTrump - who has long called for European members of the Nato military alliance to spend more on defence - is attempting to cut a rapid deal to bring the Ukraine war to an end after speaking to Russian President Vladimir Putin.\nHe has been a staunch critic of the previous US administration's military support for Kyiv and wants Europe to play a bigger role in any future security guarantees for Ukraine.\nOn Tuesday, Ukrainian officials confirmed to BBC News a deal had been reached which gives American firms access to the country's vast deposits of valuable rare earth minerals, which Trump signalled could mean continued US military support for Kyiv until a ceasefire with Russia is reached.\nAnnouncing the defence spending plan, Sir Keir said the UK's aid budget would be reduced from 0.5% of gross national income to 0.3% in 2027, \"fully funding the investment in defence\", which will rise from 2.3% of GDP.\nHe told the Commons that would mean spending £13.4bn more on defence every year from 2027.\nLast year the UK spent £53.9bn on defence.\nThe prime minister said defence spending would rise to 2.6% of GDP by 2027, once the contribution of intelligence services to defence had been factored in.\nThe move was praised by US Defence Secretary Pete Hegseth, who called it a \"strong step from an enduring partner\".\nUrging European allies to step up, Sir Keir said the UK would also set out a \"clear ambition\" to increase defence spending to 3% of GDP after the next general election.\nHolding a news conference following the announcement, Sir Keir said an election pledge to raise defence spending to 2.5% of GDP had been brought forward \"in light of the grave threats that we face\", with the country facing a \"dangerous new era\".\nAsked if pressure from Trump had pushed him to act, Sir Keir insisted it was \"very much my decision, based on my assessment of the circumstances that we face as a country\".\nBut he conceded \"the last few weeks have accelerated my thinking\".\n\"I think in our heart of hearts we've all known that this decision has been coming for three years, since the beginning of the conflict in Ukraine,\" the prime minister added.\nIn its election manifesto, Labour pledged to restore development spending to 0.7% of gross national income \"as soon as fiscal circumstances allow\" - a goal the government says it is still committed to.\nCharities were stunned by the aid cut, with Save the Children calling it \"a betrayal of the world's most vulnerable children and the UK's national interest\".\n\"There is nothing respectful about slashing lifelines for families in the most dangerous places,\" the charity's chief executive Moazzam Malik said.\nLabour MP Sarah Champion, who chairs the Commons International Development Committee, called on the government to \"rethink today's announcement\".\n\"Cutting the aid budget to fund defence spending is a false economy that will only make the world less safe,\" she said.\nResponding to the criticism, Sir Keir said it was \"not a decision I wanted to make\" but he argued there was \"no driver of migration and poverty like conflict\".\nThe hike in defence spending will help the UK's armed forces, which have experienced severe cuts since the end of the Cold War.\nHowever, it will not completely reverse the decline in the country's military capability.\nEven before this extra cash injection, the Ministry of Defence was facing a black hole in its equipment budget of around £17bn over the next decade, according to the National Audit Office.\nA large part of the increase will go towards plugging holes in underfunded programs and fixing urgent shortages in munitions, according to Malcolm Chalmers, deputy director of the Royal United Services Institute think tank.\nBut he said the commitment to reach 3% of GDP by the mid-2030s could lead to a \"transformation in how our military fights\", giving the armed forces the ability to plan long-term and \"ensuring that innovation is not always squeezed out by spending on big platforms\".\nDr Simon Anglim, a fellow at the Department of War Studies at King's College London, said spending 3% of GDP on defence by 2030 is \"the barest minimum\" to build a military strong enough to deter Russia.\nIf the US were to withdraw military support \"we may have to start talking about more than that\", he told the BBC.\nConservative leader Kemi Badenoch welcomed the increase in defence spending and the \"repurposing\" of money from the aid budget.\nBut she did question whether the government had a strong enough economic strategy to underpin the rise in spending on defence.\nThe Liberal Democrats have previously called for cross-party talks on reaching 3% of GDP on defence \"as soon as possible\".\nParty leader Sir Ed Davey welcomed the announcement but urged the government to \"raise the money in different ways\" through seizing frozen Russian assets or by increasing taxes on multi-national tech companies.\nThe SNP's Westminster leader, Stephen Flynn, said that whilst his party backed the increase in defence spending, it could not support \"the populist playbook\" of cutting aid to fund it.", "url": "https://www.bbc.co.uk/news/articles/clyrkkv4gd7o"}