{"authors": ["Archie Farmer", "www.facebook.com"], "date_download": "2025-04-26 07:44:05", "date_modify": "2025-04-26 07:44:05", "date_publish": "2025-02-26 18:03:08", "description": "Reaching this step means that the centre is now over a quarter of the way to its fundraising goal.", "filename": "news_articles_cg4k5wr41n1o_1745653445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8492/live/d2174780-f440-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4k5wr41n1o_1745653445.html", "title": "Victor Hugo Centre fundraiser reaches £2m", "title_page": "Guernsey's Victor Hugo Centre fundraiser reaches £2m - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Supporters of opening a Victor Hugo Centre in Guernsey have announced that they have received £2m in funding pledges and donations so far.\nThe money is being raised to fulfil plans to create a \"gateway attraction\" within the St Peter Port Tourist Information Centre which is set to cost a total of £7.5m.\nThe latest total means that the centre is now over a quarter of the way to its fundraising goal.\nMoney raised includes matched funding from the States of 50 pence for every £1 raised privately.\nHugo lived in Guernsey for 15 years from 1855.\nNovels he wrote in St Peter Port included Les Miserables, Toilers of the Sea, The Man Who Laughs, The Legend of the Ages and Ninety-Three at Hauteville House.\nPlans for the centre include a series of six multimedia interactive galleries focusing on Hugo's life and works.\nLarry Malcic, chair of the Victor Hugo Centre Guernsey LBG, said: \"This is a significant milestone towards the creation of the Victor Hugo Centre that demonstrates the generosity of islanders and a recognition of the benefits that the centre will provide for Guernsey.\n\"The centre will celebrate not only Guernsey's most famous resident, but also the island's vigorous creative community and talented young people.\n\"The theme of the centre is Guernsey as an island of inspiration – the island inspires many forms of creativity today, just as it inspired Victor Hugo in his time.\"", "url": "https://www.bbc.co.uk/news/articles/cg4k5wr41n1o"}