{"authors": ["Arunoday Mukharji", "www.facebook.com"], "date_download": "2025-04-26 03:38:53", "date_modify": "2025-04-26 03:38:53", "date_publish": "2025-03-04 22:14:23", "description": "The EV giant has begun hiring in India and is reportedly hunting for showrooms in Delhi and Mumbai.", "filename": "news_articles_crkn28dpl4no_1745638733.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/89bd/live/dede7a60-f8eb-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crkn28dpl4no_1745638733.html", "title": "Tesla: Can Elon Musk's EVs win over India's price-conscious car buyers?", "title_page": "Tesla: Can Elon Musk's EVs win over India's price-conscious car buyers? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After years of speculation, Tesla could finally be making its India debut.\nThe American electric vehicle (EV) giant has begun hiring for a dozen jobs in Delhi and Mumbai. It is also reportedly hunting for showrooms in both cities.\nAsia's third largest economy offers an interesting growth opportunity for Tesla's futuristic cars as its global EV sales plummet and competition from Chinese manufacturers gets more intense.\nBut there's a million-dollar question - can Tesla compete in India's price-sensitive market?\nTata Motors currently holds pole position in India's EV market - with over 60% market share. MG Motors - jointly owned by India's JSW and a Chinese firm - is second at 22%. They are followed by Mahindra and Mahindra.\nEVs made by these companies cost less than half of what consumers will have to shell out - around $40,000 (£31,637) - for just the base model of Tesla. It will, therefore, be seen as a luxury car, competing with higher-end EVs made by Hyundai, BMW and Mercedes.\nSimply in volume terms, this will make India a tiny market for Tesla chief Elon Musk, unless the company introduces a low-cost model specifically for the country.\nBesides price, India's road conditions could pose a challenge.\nTesla cars have very low ground clearance - or the distance between the lowest point of the car's undercarriage and the ground. This will make adapting to Indian roads difficult. To operate in the country, existing models may have to be re-engineered - which would drive up manufacturing costs.\nWill Tesla do this just for one developing market where it could have only a small presence?\n\"It's been a challenge even with other global original equipment manufacturers (OEMs) at the high end with small volumes. You can't justify these major engineering changes,\" Hormazd Sorabjee, editor of Autocar India magazine, told the BBC.\nAlso, amidst all the hype, it is easy to forget that EV sales still make up less than 3% of overall passenger vehicle sales in India. Even critical ancillary infrastructure, like charging stations, have taken years to come up. While they have picked up pace, there are only around 25,000 charging stations across India.\nIn effect, Tesla will be jostling for space in a very small, albeit growing, EV market.\nBut at a policy level, India appears to be making every effort to woo the carmaker.\nThe country has outlined an ambitious national vision to go electric. It plans to have 30% of private cars, 70% of commercial cars, 40% of buses and 80% of two and three-wheelers go electric by 2030. Most provincial governments have also established their own EV policies to incentivise demand and supply.\nSubsidies offered by India on electric cars are also the highest among major economies, according to HSBC Securities. They amount to as much as 46% of the price of the country's top-selling electric car model.\nIt's no surprise then that passenger EV sales have grown astronomically by over 2,000% in less than five years - going from a low base of 4,700 annually to a 100,000 cars.\n\"The price difference between regular cars and EVs has reduced a lot, making customers rethink their choice,\" says Jyoti Gulia, founder of JMK Research.\nIn April last year, India also cut import taxes on EVs for global carmakers which committed to investing $500m (£400m) and starting local production within three years.\nTesla and other imported electric vehicles costing over $35,000 (£27,550) can now enjoy a lower import duty of 15% on up to 8,000 vehicles. This came after Musk complained that high import duties had prevented the firm from launching its cars in the world's fastest-growing major economy.\n\"It's quite clever, as it forces a global player to localise - which is the way the game works: come and build in India,\" says Sorabjee.\nThe proposed policy could put Indian domestic carmakers at a disadvantage, however, given that the investment requirement for foreign players is \"not significant\" compared to Indian players in this segment, an HSBC research paper warns.\nImport duty of 15% is also \"much lower\" than the tax on comparable combustion engine cars in India which also pay an additional road tax, according to HSBC.\nDomestic EV players say having a \"level playing field\" is important, but appear unperturbed by Tesla's impending entry for now.\n\"We welcome competition,\" Rajesh Jejurikar, Mahindra and Mahindra's Executive Director and CEO, told the BBC. His company feels that more players will strengthen India's existing EV ecosystem and is working to improve the appeal of their offerings.\nCritical issues like \"range anxiety\" - the worry whether an EV's battery charge will be enough to complete a journey - have been addressed through \"robust battery integration and rigorous real-world testing across diverse road conditions\", says Mr Jejurikar, adding that the brand is deploying cutting-edge technology into their product.\nIt will be hard to beat Tesla's edge in this area though, and coupled with sturdier batteries and a better user interface, it will certainly differentiate Tesla cars from others in the market, says Sorabjee.\nWhat might also give Tesla tailwind is the rising share of premium vehicles in the Indian auto market. As a global brand with a perceived \"cool quotient\", owning a Tesla will be a status symbol for the young, aspirational Indian population.\nBut none of this - India's EV policy or the growing demand for premium cars among India's affluent - has yet led to a commitment from Tesla to put manufacturing dollars into an EV facility.\nFor now, it appears the carmaker will only ship units from its factories abroad.\nWhen that changes will depend on a lot of things - how quickly India's affluent consumer base widens, and what tariff structures look like once India completes trade negotiations with the US.\nPresident Donald Trump has already voiced displeasure over Tesla potentially building a factory in India to avoid high tariffs. In an interview with Fox News recently, he said that this would be \"unfair\" to the US.\nCould Trump's 'America First' policy diminish Musk's appetite for starting manufacturing units in India then?\nThe question is moot, but for now it does look like India will first get glitzy Tesla showrooms for its rich, rather than job-creating Tesla factories for its under-employed masses.", "url": "https://www.bbc.co.uk/news/articles/crkn28dpl4no"}