{"authors": ["David Gritten", "www.facebook.com"], "date_download": "2025-04-26 03:50:16", "date_modify": "2025-04-26 03:50:16", "date_publish": "2025-03-05 12:53:39", "description": "They say the Arab League's proposal for post-war reconstruction fails to address realities in Gaza.", "filename": "news_articles_cn7vd4pnxx3o_1745639416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d70c/live/093d6b50-f9bd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vd4pnxx3o_1745639416.html", "title": "US and Israel reject Arab alternative to Trump's Gaza reconstruction plan", "title_page": "US and Israel reject Arab alternative to Trump's Gaza reconstruction plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US and Israel have rejected an Arab plan for the post-war reconstruction of the Gaza Strip that would allow the 2.1 million Palestinians living there to stay in place.\nThe proposal, endorsed by Arab leaders at a summit in Cairo, is their alternative to President Donald Trump's idea for the US to take over Gaza and permanently resettle its population.\nThe Palestinian Authority and Hamas welcomed the Arab plan, which calls for Gaza to be governed temporarily by a committee of independent experts and for international peacekeepers to be deployed there.\nBut both the White House and Israeli foreign ministry said it failed to address realities in Gaza and stood by Trump's vision.\nThe summit took place amid growing concern that Gaza's fragile ceasefire deal could collapse after the six-week first phase expired last Saturday.\nIsrael has blocked aid from entering the territory to pressure Hamas to accept a new US proposal for a temporary extension of the truce, during which more hostages held in Gaza would be released in exchange for Palestinian prisoners.\nHamas has insisted the second phase should begin as agreed, leading to an end of the war and a full Israeli troop withdrawal.\nThe $53bn (£41bn) Arab plan for rebuilding Gaza once the war ends was presented by Egypt at an emergency Arab League summit on Tuesday.\nA statement endorsing the plan stressed \"the categorical rejection of any form of displacement of the Palestinian people\", describing such an idea as \"a gross violation of international law, a crime against humanity and ethnic cleansing\".\nThe plan envisages reconstruction taking place over three phases and taking five years, during which some 1.5 million displaced Gazans would be moved into 200,000 prefabricated housing units and 60,000 repaired homes.\nIn the first phase, which would last six months and cost $3bn, millions of tonnes of rubble and any unexploded ordnance would be cleared.\nThe second phase, lasting two years and costing $20bn, would see housing and utilities rebuilt. An airport, two seaports and an industrial zone would be built during the third phase, which would take another two years and cost $30bn.\nThe Arab plan also proposes that an \"administrative committee\" made up of independent Palestinian technocrats run post-war Gaza for a transitional period while \"working towards empowering the Palestinian Authority to return\".\nHamas - which is proscribed as a terrorist organisation by Israel, the US, UK and others - took full control of Gaza in 2007, ousting forces from the Fatah-dominated PA in violent clashes a year after winning parliamentary elections. The PA was left governing parts of the occupied West Bank.\nPalestinian President Mahmoud Abbas, who heads the PA, told the summit that he welcomed the Arab plan and urged Donald Trump to support it.\nHamas said it appreciated \"the Arab position rejecting attempts to displace our people\".\nIsraeli Prime Minister Benjamin Netanyahu has ruled out any future role in Gaza for Hamas or the PA.\nHowever, Israel's foreign ministry swiftly rejected the Arab League's statement endorsing the Egyptian plan, saying it \"fails to address the realities of the situation following 7 October 2023, remaining rooted in outdated perspectives\".\n\"Now, with President Trump's idea, there is an opportunity for the Gazans to have free choice based on their free will. This should be encouraged!\" it added.\n\"Instead, Arab states have rejected this opportunity, without giving it a fair chance, and continue to level baseless accusations against Israel.\"\nWhite House National Security Council spokesman Brian Hughes said the Arab plan did \"not address the reality that Gaza is currently uninhabitable and residents cannot humanely live in a territory covered in debris and unexploded ordnance.\"\nThe Assistant Secretary General of the Arab League, Hossam Zaki, told the BBC on Wednesday that Trump's approach was unacceptable.\n\"It is based on the forced displacement of Palestinians out of their homes and of their land. This is against international law and, we have said this time and again, this is not a way to treat this man-made crisis,\" he said.\n\"This is a war that has been waged by Israel partly with the aim of driving Palestinians out of their territory,\" he added.\nHe also described the Israeli foreign ministry's response to the Arab plan as \"against humanity and against morals\".\nPalestinians fear a repeat of the Nakba - the Arabic word for \"catastrophe\" - when hundreds of thousands fled or were driven from their homes before and during the war that followed the creation of the State of Israel in 1948.\nMany of those refugees ended up in Gaza, where they and their descendants make up three-quarters of the population. Another 900,000 registered refugees live in the West Bank, while 3.4 million others live in Jordan, Syria and Lebanon, according to the UN.\nThe Israeli military launched a campaign to destroy Hamas in response to an unprecedented cross-border attack on 7 October 2023, in which about 1,200 people were killed and 251 were taken hostage.\nMore than 48,400 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry.\nMost of Gaza's population has also been displaced multiple times. Almost 70% of buildings are estimated to be damaged or destroyed; the healthcare, water, sanitation and hygiene systems have collapsed; and there are shortages of food, fuel, medicine and shelter.", "url": "https://www.bbc.co.uk/news/articles/cn7vd4pnxx3o"}