{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:15:36", "date_modify": "2025-05-21 07:15:36", "date_publish": "2025-02-08 00:00:00", "description": "More than 180 Palestinians are freed as part of the ceasefire deal which saw three Israelis released from Gaza earlier.", "filename": "news_live_c1we2e2v5d2t_1747811736.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1we2e2v5d2t_1747811736.html", "title": "Palestinian prisoners released after Hamas frees hostages", "title_page": "Palestinian prisoners released after Hamas frees hostages - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Prisoners and hostages released as planned, but concerns raised\nJamie Whitehead\nLive page editor\nIsrael and Hamas have completed the fifth exchange of Israeli hostages and Palestinian prisoners as agreed under stage one of the ceasefire process.\nThe three Israelis - Eli Sharabi, Ohad Ben Ami and Or Levy - were released first, but Hamas' choreography of the release has drawn criticism.\nIsrael's Prime Minister, Benjamin Netanyahu said the country \"would not gloss over the shocking scenes\", referring to the pictures of their release broadcast around the world.\nIn front of a large crowd in Deir al-Balah in the Gaza Strip, the three men were taken one at a time to a small stage and made to speak to the crowd and Hamas media before being handed over to the International Committee of the Red Cross (ICRC).\nThe health and appearance of the three men caused concern, with Ben Ahmi's daughter saying she \"barely recognised\" her dad.\nA spokesman for Hamas said the hostage release was \"civilised\".\nA short while later, the 183 Palestinian prisoners started being freed from Israeli jails.\nWe saw scenes of joy in Ramallah as families were reunited, in some cases after many years, but once, again, there was concern over the appearance of some.\nMustafa Barghouti, secretary general of the Palestinian National Initiative, told the BBC that one prisoner, released after 22 years, had lost 35kg (77 pounds) in body weight.\nThe Palestinian prisoners released include some detainees convicted of deadly attacks on Israelis, but most going back to Gaza were arrested during the war and were held without trial or charge.\nIn the last hour, the ICRC has said it is \"increasingly concerned\" about the conditions surrounding the releases of both groups, and urged \"all parties... to ensure that future released are dignified and private\".\nWe're bringing our coverage to an end now, but there is plenty more to read across the BBC:\nHostages freed and prisoners released in latest ceasefire exchange\nIsraeli soldier jailed for abusing Palestinian detainees from Gaza\nTrump says Israel will hand over Gaza to US after fighting ends but our international editor Jeremy Bowen says this plan won't happen, but it will have consequences\nAnother exchange of Israeli hostages and Palestinian prisoners is due next weekend.\n'My happiness is beyond words' - mother of released Palestinian prisoner\n\"I feel so happy, overjoyed—my happiness is beyond words.\"\nThat's how Khadra al-Daghma, the mother of a recently released Palestinian prisoner, has described the feeling of seeing her son, Ammar Fadel al-Daghma, after 15 years of not seeing him.\nAccording to the Israeli Prison Service he was detained for offences including arson, attempted murder and service to an illegal organisation.\n\"The entire world feels too small for my joy. I saw my son, and my heart is filled with happiness. I wish the same joy for all mothers and wives, may they all experience this moment, God willing,\" she told a reporter in Gaza.\n\"May all prisons be emptied, God willing.\"\n\"Of course, my son has changed—he is not the same. He has changed a lot,\" Daghma said, noting how her son used to be \"more beautiful\".\nShe is ultimately happy though that both her son has returned and that the ceasefire deal has held, and says \"the deal was good, may God protect them, and may freedom come to all prisoners\".\nFor context: The BBC works with trusted freelance journalists in Gaza, as Israel does not allow independent access for international journalists\n'Soon we'll be able to embrace him' - Ohad Ben Ami's daughters\nThe Hostages and Missing Families Forum Headquarters has just released a statement saying Yulie, Ella, and Natalie - Ohad Ben Ami's daughters - have now spoken with him by phone and are waiting to meet him at Ichilov Hospital.\nOhad Ben Ami was taken from Kibbutz Beeri on 7 October 2023, along with his wife, Raz, who was later released by Hamas.\nHis daughters shared this message:\n\"Our father has emerged from the horror, and you can see the trauma he endured written on his face. But we are staying strong for him here, just as he stays strong for us, and soon we'll be able to embrace him. We got our father back. Now we must not stop until the last hostage is returned.\"\nBelow, you can see the some of the first images of Ohad being reunited with his wife, Raz, at the initial absorption point in Israel.", "url": "https://www.bbc.com/news/live/c1we2e2v5d2t"}