{"authors": ["Glenn Campbell", "www.facebook.com"], "date_download": "2025-04-26 07:49:01", "date_modify": "2025-04-26 07:49:01", "date_publish": "2025-02-26 22:54:22", "description": "The first minister is calling on civic Scotland to come together and tackle populist politics.", "filename": "news_articles_cyve4zj2981o_1745653741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe72/live/07c74a70-f4f9-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyve4zj2981o_1745653741.html", "title": "Can John Swinney lead a united front against Reform?", "title_page": "Can John Swinney lead a united front against Reform? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There are at least two ways to view John Swinney's offer to convene a summit of mainstream party and civic leaders to counter political forces they reject.\nMany people will accept his leadership at face value and applaud his efforts to achieve domestic consensus at a time of global upheaval and uncertainty.\nOthers will regard it as a major irony that a politician who has spent his adult life trying to divide the UK into two states is recasting himself as a unifying figure.\nTo be fair, he has demonstrated commitment to building consensus at Holyrood since becoming first minister.\nThat has been most notable in budget negotiations to secure Green and Liberal Democrat support for the Scottish government's tax and spending plans in exchange for concessions.\nThere also seems to be greater cooperation between the Scottish and UK governments on a range of issues and a greater willingness by Holyrood ministers to allow Westminster to legislate for Scotland on devolved issues.\nThat also reflects the change in the UK government from Conservative to Labour.\nThe first minister is now suggesting a collaborative approach could be extended to countering political forces to the right of the Holyrood mainstream.\nHe is offering to use the convening power of the Scottish government to bring people together.\nDomestically, this is an effort to resist the politics of Nigel Farage and his anti-immigration Reform UK party, which polls suggest is on course to win seats at the 2026 Holyrood election.\nA political breakthrough of that sort would probably squeeze support for the Conservatives and Labour much more than the SNP.\nThat probably makes it difficult for John Swinney's Holyrood opponents to reject his call for a cross-party \"summit\".\nThat doesn't mean the idea will be greeted with great enthusiasm.\nOne Labour MSP told me roundtable meetings were the SNP's default alternative to taking meaningful action.\nOpposition parties may also spot a potential trap - worrying that the more they work with the Swinney government and accept his leadership on this, the harder it might become to distinguish themselves as alternatives to the SNP in the election campaign to come.\nIt is surely not an accident that the proposed date for this get together is the end of April - almost exactly one year before the 2026 election.\nAnother concern within Holyrood is that taking on Nigel Farage directly could elevate his status in Scottish politics and amplify his arguments.\nThe first minister's response is that public frustration with current politics must be tackled head on, with issues underlying shifting political loyalties needing to be addressed.\nFor him, that means demonstrating that the Scottish government and the wider parliament can deliver improvements to public services and the economy.\nThe SNP's rivals argue that successive nationalist administrations have underperformed over nearly two decades.\nReform UK also insists that arguing for controlled immigration is not \"racist\" and that they regard Russian President Vladimir Putin as a \"despicable aggressor\".\nJohn Swinney accused Nigel Farage of being an apologist for Putin.\nBut the SNP leader has avoided extending his criticism of the political right to the Trump administration as the prime minister prepares to travel to Washington for talks with the US president.\nThe first minister previously said that American proposals to take over Gaza and turn it into a Mediterranean resort would amount to \"ethnic cleansing\".\nMore cautiously, the prime minister has emphasised his support for Palestinians being allowed to return to their homes and rebuild rather than attacking the Trump proposals.\nWhether it was a response to Swinney's intervention or not, US Vice-President JD Vance singled out the Scottish government's abortion buffer zones law in a speech criticising perceived threats to free speech in Europe.\nVance claimed the Scottish law criminalised private prayer in the homes of those living within these zones - a claim that is without foundation.", "url": "https://www.bbc.co.uk/news/articles/cyve4zj2981o"}