{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 03:46:36", "date_modify": "2025-04-26 03:46:36", "date_publish": "2025-03-05 05:38:37", "description": "East Suffolk Council is working to repairs erosion damage on sea walls at Aldeburgh and Southwold.", "filename": "news_articles_c4g0k2yqyqlo_1745639196.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6d66/live/4cbba6d0-f8ff-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g0k2yqyqlo_1745639196.html", "title": "Southwold and Aldeburgh set for weeks of sea wall repairs", "title_page": "Southwold and Aldeburgh set for weeks of sea wall repairs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents of two coastal towns have been warned to expect disruption as work begins to repair their sea walls.\nEast Suffolk Council is working to repair a collapsed section on Southwold's promenade and also announced this week it would be repairing an area in Aldeburgh.\nMaintenance contractor, Water Management Alliance, is working on both promenades.\nThe council has urged people to take extra care in both areas and take notice of any signage and fencing.\nIn December, two rectangular-shaped sections of the seafront walkway in Southwold fell inward due to erosion and stormy weather.\nContractors began work at the end of February to fill in voids under the promenade and replace the collapsed slabs.\nThe reconstruction is expected to last two more weeks before further works take place to repair the lower section of the sea wall under the beach, which had suffered erosion damage.\nThe council said recent erosion had exposed this area sooner than expected which ultimately led to the collapse.\nWork will begin from 22 April and will be completed by the start of the school summer holidays.\nA cordon to the north of the pier will remain in place until all the works are finished and there is no access to the promenade or beach in the area.\nPhilip Ridley, head of nationally significant infrastructure at the council, said the work would return the sea wall \"to its former good condition\".", "url": "https://www.bbc.co.uk/news/articles/c4g0k2yqyqlo"}