{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 03:53:53", "date_modify": "2025-05-21 03:53:53", "date_publish": "2025-01-24 00:00:00", "description": "While Trump promotes his \"no tax on tips\" proposal in Las Vegas, Senate Republicans are working to secure his team.", "filename": "news_live_ce8y3yk00yjt_1747799633.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_ce8y3yk00yjt_1747799633.html", "title": "Trump touts economic policy at rally as Senate works to confirm cabinet", "title_page": "Trump touts economic policy at rally as Senate works to confirm cabinet - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Here's the politics news you missed today\nIt's been quite the busy Saturday in US politics both in and out of the nation's capital. Here's a rundown of the day:\nSenate confirms Trump’s Homeland Security pick: The Senate confirmed Kristi Noem late this morning to serve as Department of Homeland Security secretary by a vote of 59-34. Noem became the fourth cabinet nominee to be confirmed by the Senate since Trump has entered office.\nHegseth sworn in as defence secretary: Pete Hegseth was sworn in as the US's Secretary of Defense this morning after the Senate confirmed his nomination late last night. His nomination was approved by the narrowest possible margin after three Republicans voted against Hegseth, forcing Vice President JD Vance to cast the deciding vote.\nTrump fires inspectors general: Trump has fired at least a dozen inspectors general - independent watchdogs for federal agencies - prompting claims that the dismissals are unlawful. This news broke late Friday night, but response came pouring in on Saturday. Senate Minority Leader, Democrat Chuck Schumer, said at least 12 had been dismissed \"in the dark of night\" and called it a \"chilling purge\".\nTrump holds Las Vegas rally: President Trump began the second day of his first domestic trip since his inauguration in Las Vegas, where he held a rally in a downtown casino. He spoke on executive orders, artificial intelligence and touted his no tax on tips campaign promise.\nWe're ending our live coverage now. Here is more on what Trump has done since taking power and you can find an explanation of his \"no tax on tips\" policy here.\n'Disingenuous': Independent voter who backed Harris on Trump's first week\nThe 37-year-old Massachusetts independent voted for Harris in November.\nI really found a lot of the content of Trump's inaugural speech to be disingenuous, because he mentioned specific things like justice, honour, integrity, trustworthiness. These are not qualities that I think are reflected in his policy or his behaviour. I found the content provoking. I watched it out of a sense of civic duty.\nI think what we see right away with this early surge of executive orders and other actions is that he no longer feels any sense of restraint, and I think that that is because there have been no consequences for his actions in breaking the law.\n'Showmanship': Independent voter who backed Trump on president's first week\nThe Floridian is an independent voter who supported Trump in November. He was struck by the spectacle of Trump’s unconventional inauguration day.\nI felt like I was watching like WWE, professional wrestling. Just the boisterousness, the showmanship, the playing for the cameras. You can tell that the entertainment is a big part of Donald Trump's credo as opposed to whether you had Barack Obama or Joe Biden inaugurated.\nI just think that he does exactly what he tells you he's going to do, for better or worse. The showmanship of it, the throwing pens, the doing executive orders in an arena in front of a crowd, like he was putting on a performance.\nAfghan refugees impacted by Trump foreign aid order\nTrump's order to freeze foreign aid appears to have had immediate consequences.\nShawn VanDiver, the president of the non-profit #AfghanEvac that assists Afghan refugees who worked with the US, tells the BBC that it has immediately affected many of those that his organisation helps.\nVanDiver explains that the order is a functional pause of the special immigration visa program. While the approval process for someone to get into the program or interview for a visa is still ongoing, relocation flights and funding for housing resettlements are paused.\n\"I think they didn’t know where all the foreign aid money went and how it tentacled out,” he says of the Trump administration's decision to enact the state department order.\nVanDiver says refugee families or anyone in the special immigration visa program are stuck in limbo.\nHe stresses that special immigration visas and refugees are legal immigration pathways to the United States, which differ from the illegal immigration and border security issues Trump campaigned on.\n“We just spent the last three and half years rebuilding this system… We were keeping our promises to our wartime allies - even if it wasn’t fast enough. We were doing that and now we’re not,” VanDiver says.\n#AfghanEvac has urged the Trump administration to grant an immediate exemption for the Afghans affected in a letter that VanDiver says described what \"would happen if they didn't apply a scalpel rather than a hatchet\".\nUS Secretary of Defense says Pentagon will adopt 'warrior ethos'\nEarlier today, Donald Trump's Secretary of Defense pick - Pete Hegseth - was sworn in. He has since outlined his priorities for the department, saying the Pentagon under his watch \"will put America first, and we will never back down\".\nIn a written message to the department's three million employees - which includes more than a million uniformed personnel - the former Fox News host said he would restore a \"warrior ethos\", rebuild the military and reestablish US deterrence strategies.\n\"We are American warriors. We will defend our country,\" Hegseth wrote. \"Our standards will be high, uncompromising, and clear. The strength of our military is our unity and our shared purpose.\"\nThe statement hemmed closely to what Hegseth said during his Senate hearing earlier this month, where he said repeatedly said he would return the focus of the Pentagon to the strength and lethality of America's military.\nHegseth was confirmed late on Friday after a tie-breaking vote from Vice-president JD Vance. Concerns over Hegseth's qualifications as well as misconduct and sexual harassment allegations nearly derailed his confirmation.\nThree Republicans ultimately voted against him.\nTrump works the casino floor after speech\nAnthony Zurcher\nNorth America correspondent reporting from Las Vegas\nI'm here in Las Vegas reporting on the first domestic trip of Trump's new administration.\nAs I wrote earlier, Trump's speech at Circa Casino today served as a bit of a victory lap - and it seems he's making a literal lap of the building now.\nI just saw Trump walk onto the floor of the casino and approach the gaming tables.\nHe chatted with a cocktail waitress, touting his no tax on tips proposal, and then watched a couple of rolls on the craps table.\nAnd that essentially concludes Trump's trip, which included visits to disaster areas in North Carolina and California before the stop here. He's now heading to Miami for his Doral Golf Club.\nCulinary union welcomes no tax on tips\nJust a bit ago, we heard President Trump briefly discuss his plan to cut taxes on tips, saying he planned to work with lawmakers in Congress in the coming weeks.\nThe proposal has been applauded by the Culinary Union, a union in Nevada that includes cocktail and food servers, porters, bellmen, cooks, bartenders, laundry, and kitchen workers.\n\"The Culinary Union welcomes plans to end taxes on tips,\" said Secretary-Treasurer Ted Pappageorge in a statement. \"But it must not end there.\"\n\"Ending the $2.13 sub-minimum wage, that is the reality in too many states across the country, will uplift millions of hospitality workers,\" he said.\nFor context: the federal tipped minimum wage is to $2.13 per hour but tipped employees must earn at least $7.25 per hour with their wage and tips combined. Some states have higher minimum standards, but recent efforts to raise minimum wage nationwide have stalled in Congress.\nOath Keepers founder Rhodes at Trump rally\nAs we've been reporting, Trump just addressed a rally in Las Vegas.\nStewart Rhodes, the founder of far-right militia group Oath Keepers, was in attendance.\nRhodes was one of 14 people who had their sentences commuted by President Trump this week after they were imprisoned for their role in the 6 January Capitol riot.\nRhodes, a former US Army paratrooper and Yale-educated lawyer, was charged for leading a contingent of Oath Keepers members to Washington. Although he didn't enter the Capitol, he directed his members from outside.\nHe was sentenced to 18 years in federal prison in 2023 for seditious conspiracy and evidence tampering, but he was released hours after Trump commuted his sentence.\nThis isn't Rhodes' only political appearance this week, as he was seen on Capitol Hill on Wednesday. He told reporters that he was meeting with House Republicans.\nTrump jokes about serving more than 2 terms\nTrump has just joked about serving more than two terms in the White House.\n\"It will be the greatest honour of my life to serve not once, but twice - or three times or four times,\" he jokes with a smile. \"Headlines for the fake news!\"\nTrump then clarifies he'll only serve two terms - the maximum amount a president is legally allowed to remain in office.\n\"For the next four years, I will not rest. I will not yield and together we will not fail,\" he says.\nImmigration authorities have arrested hundreds in past week, Trump says\nTrump spent a fair amount of time talking about his administration's efforts to address US immigration policy.\nHe said he has begun to leverage the power of the federal government to eliminate foreign gangs and criminal networks.\n\"We don't allow people to enter our country and dump our prisons into the United States of America any more,\" he said.\nTrump adds that law enforcement officials now \"can do whatever the hell they want to do\" in response to immigration at the US southern border.\nHe says Immigration and Customs Enforcement has already arrested hundreds of undocumented immigrants during his first week in office.\nTrump suggests 'no tax on tips' pledge helped him win Nevada\nTrump was clearly enjoying this speech - it was peppered with jokes and Trump stopped to laugh frequently.\nHe moved on to his plan to cut taxes on tips, which is met with much enthusiasm from the crowd.\nTrump joked that it must have had \"no influence\" on him winning Nevada for the Republicans.\n\"No tax on tips,\" Trump said, to enthusiastic applause.\nTrump briefly described his vision for the policy and offered a few anecdotes from people in the service industry before moving on to describing his immigration crack down.\nTrump mocks Biden for missing calls with foreign leaders\nTrump is now describing how his win in the 2024 election has brought \"light over America\". He goes on to say foreign leaders are calling him up and telling him that they hate him, but there's now \"light over the world\".\nHe retells a story where he alleges that a foreign leader told him that former President Joe Biden wouldn't speak with them. Instead, they'd be told that Biden was very busy and would call them back in two months.\n\"He's extremely busy sleeping,\" Trump says.\nBut then, Trump says, Biden would never return make the promised call.\n\"These stories are not very exaggerated, I want to tell you, a little bit for laughter, but it's only for the laughter,\" he says.\n\"The fake news will say, 'Oh, he exaggerated it was only one month you know,'\" he adds to laughter from the crowd.\n'We got rid of the woke crap' – Trump\nTrump says his administration has accomplished more in one week than others have done in four years.\n\"And we're just getting started. We got rid of the woke crap,\" he says, to applause and cheers from the crowd.\nHe says companies were \"petrified of it\", in an apparent reference to diversity, equity and inclusion (DEI), and suggests many companies didn't believe in it.\nTrump's White House has moved quickly to end DEI programmes in the federal government and ousting many workers connected to them.\nTrump's economic speech includes boasts and political jabs\nAnthony Zurcher\nNorth America correspondent reporting in Las Vegas\nThis was billed as an economic speech, but as is typical with Donald Trump he is already covering a wide range of topics.\nHe has bashed the record of the Biden administration, boasted of the scope of his electoral victory last November, celebrated his Cabinet nominees who have been confirmed and reviewed his early executive actions as president – particularly on immigration.\n“American decline is over,” he said. “What the world witnessed this week is nothing less than a revolution of wealth creation and common sense.”\nHe also once again touched on his interest in territorial expansion, noting that the US has been the same size for decades.\n“We might be an enlarged country pretty soon,’ he said.", "url": "https://www.bbc.com/news/live/ce8y3yk00yjt"}