{"authors": ["Sarah Rainsford", "Jacqueline Howard", "www.facebook.com"], "date_download": "2025-04-26 04:03:38", "date_modify": "2025-04-26 04:03:38", "date_publish": "2025-03-03 19:59:32", "description": "The Pope resumes mechanical ventilation after suffering two \"acute respiratory failures\" on Monday.", "filename": "news_articles_crmjk9mjnwmo_1745640218.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e638/live/9979a1e0-f867-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjk9mjnwmo_1745640218.html", "title": "Pope Francis 'alert' after respiratory failure", "title_page": "Pope Francis 'alert' after respiratory failure, Vatican says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pope Francis is alert after suffering two episodes of \"acute respiratory failure\" on Monday afternoon, the Vatican has said.\nDoctors were forced to intervene to clear mucus from the Pope's lungs, an update from the Holy See said, though it said he was alert throughout.\nThe 88-year-old pontiff has resumed the use of an oxygen mask and ventilator to assist his breathing, but remains \"alert, focused and cooperative\", the Vatican said.\nThis is now the third serious downturn since the 88-year-old pontiff was admitted to hospital 18 days ago with pneumonia.\nOn Friday, Pope Francis suffered an \"isolated\" breathing crisis involving vomiting, the Vatican said.\nUpdates from the Holy See reported that he responded well to oxygen therapy, with Vatican officials saying on Sunday the Pope no longer required \"non-invasive mechanical ventilation, only high-flow oxygen therapy\".\nFollowing Monday's episodes, Pope Francis has resumed that mechanical ventilation.\nHis illness has meant that Pope Francis has been unable to deliver his traditional Angelus prayer in person for three weeks in a row, with the Vatican publishing his written comments instead.\nOfficials said the text, sent from his hospital room in Rome, had been written \"in the past few days\". In it, the Pope thanked people for their prayers and thanked his medical team for their care.\nHe will also miss the procession and mass this Wednesday that mark the first day of Lent, the six-week period leading to Easter.\nHundreds of Catholics gathered outside in St Peter's Square on Monday for an eighth evening to pray for the Pope's health, many carrying rosary beads as they headed across the cobbles towards the Basilica.\nThe crowd, a mixture of priests and nuns based in Rome and Catholic pilgrims here for a Jubilee year, were led by an American cardinal.\n\"I come every night to pray, but this night I am pretty worried,\" Javier, a Romanian priest, voiced the feelings of many on the square. \"We still have hope, but it doesn't look good.\"\n\"It looks bad, and that's a shame because we really like Francis,\" Patricia, a Spanish catholic from Toledo, told the BBC.\nShe was following the prayers with her husband and young daughter.\n\"He's really opened the doors of the church to many, like LGBT people. I think they will look for a more conservative pope next, to stop the change.\"\nCatholics have also been visiting the Gemelli hospital in Rome to pray for him - hoping he might come to the window, as has happened in the past.\nBut although the Vatican recently described the Pope's condition as stable, he remains too sick even to greet the crowd below.", "url": "https://www.bbc.co.uk/news/articles/crmjk9mjnwmo"}