{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:54:18", "date_modify": "2025-04-26 03:54:18", "date_publish": "2025-03-04 17:40:23", "description": "Experts believe the artefact was buried as a sacrifice during the construction of the house.", "filename": "news_articles_cx2x00795l8o_1745639658.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5245/live/55ec2c80-f917-11ef-becb-07cbf84d799c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2x00795l8o_1745639658.html", "title": "Roman brooch found in Ayrshire during archaeological dig", "title_page": "Roman brooch found in Ayrshire during archaeological dig - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Experts are investigating the discovery of a mysterious Roman artefact uncovered in an Iron Age settlement under an Ayrshire distillery.\nArchaeologists believe the enamelled bronze brooch may have been placed in the foundations of the fortified roundhouse as a sacrifice during its construction to grant \"protection\" to the household.\nThe item, thought to have dated from about the second century AD, was found during an excavation at the William Grant and Sons Girvan Distillery at the Curragh in South Ayrshire in 2020.\nResearchers from Guard Archaeology believe the brooch could shine a light on the way people in ancient Scotland interacted with Roman soldiers guarding Hadrian's Wall.\nThe Romans left Scotland in about 210 AD, but remained in Britain for a further 200 years.\nJordan Barbour, who co-authored a report into the find, said it was unclear how the brooch passed from Roman hands to those of the Britons.\nBut he said it was a possible the artefact was a \"trophy won in battle\".\nHe said: \"It's the only Roman artefact recovered from the site. If the inhabitants had established regular trade with Roman Britain, we might expect to find a greater variety of Roman objects, but this is a solidly native context.\n\"Rather, the brooch is more likely to have been obtained through ad hoc exchange with Roman troops operating north of Hadrian's Wall, perhaps even taken in battle as a trophy.\"\nThe household was likely to have been that of a wealthy farming family.\nThe abandonment of the Antonine Wall earlier in the century meant there were no Roman forts nearby at the time the dwelling was built.\nHowever, there was evidence of a previously military presence in the area in the form of a Roman marching camp.", "url": "https://www.bbc.co.uk/news/articles/cx2x00795l8o"}