{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:25", "date_modify": "2025-05-19 14:23:25", "date_publish": "2015-04-13 08:53:29", "description": "Family of missing Johanna Powell say the Foreign Office has told them that the body of a woman has been found in a search of a river in Laos, Asia.", "filename": "news_uk-wales-south-east-wales-32282276_1747664605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82279000/jpg/_82279544_johannapowell.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-south-east-wales-32282276_1747664605.html", "title": "Johanna Powell: body found in Laos river search", "title_page": "Johanna Powell: body found in Laos river search - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Family of missing Johanna Powell say the Foreign Office has told them that the body of a woman has been found in a search of a river in south-east Asia.\nBBC Wales picture editor Johanna Powell, 37, of Cardiff, was on a trip on the Mekong River near Pak Beng, Laos.\nShe was with three friends from Wales as part of a group of 10 on the boat.\nHer brother-in-law Dean Price said he was told the boat hit rapids, causing it to tip, take on water and capsize.\nThe co-owner of the cruise company, Adisak Star, said the boat sank quickly after hitting a rock while travelling though rapids.\n\"The boat went down in a minute,\" said Mr Star, of Thailand-based Nagi of Mekong.\nMr Price said his sister-in-law was sleeping at the time of the accident.\nMr Star said the other passengers managed to jump off the steel-bottomed boat, but it is not known what happened to Ms Powell.\nOne of the survivors ran across the roof of the boat until it sank and then swam to the rocks.\nShe described the water as \"so rough - like a washing machine\" and believes the conditions were why the boat sank.\n\"It was terrifying. We all thought we were going to die,\" she said.", "url": "https://www.bbc.com/news/uk-wales-south-east-wales-32282276"}