{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:45:39", "date_modify": "2025-04-26 03:45:39", "date_publish": "2025-03-05 06:16:38", "description": "A youth project aims offers activities that are \"more positive than just congregating in public\".", "filename": "news_articles_cp8ymvvnvqgo_1745639139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/35cd/live/1ed3fe10-f90f-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8ymvvnvqgo_1745639139.html", "title": "Guernsey youth group invites more to join to battle boredom", "title_page": "Guernsey youth group invites more to join to battle boredom - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A youth charity in Guernsey is encouraging more young people to join in an effort to get people off the streets.\nGuernsey's Youth Commission reported its \"Street Reach\" team had seen more than 200 young people out at night this winter - including a group of 50 congregating near the bus terminus during half-term.\nEmmie Bougourd, a senior youth support worker who helps run the team, said teenagers were often hanging about because of \"boredom, they don't really have anything else to do\".\nShe said the project tried to offer \"something that they can engage in that's more positive than just congregating in public\".\nThe project aims to find out what young people like to do and offer them somewhere warm and safe to enjoy activities.\nThe team is also renovating an old coach into a portable youth club, she added.\nMs Bougourd said teenagers could be prone to risk-taking behaviour in large groups without adults.\n\"That's when it can turn a little bit more troublesome,\" she said.\nDetailing her experiences, she said one teenager asked her \"why are you doing this for bad kids like me?\"\n\"They've got that perception that people just think they're bad,\" she said.\n\"I said, 'You're not a bad kid, just because you sometimes do silly things doesn't mean that you're a bad kid'.\n\"Just because they don't fit into a mould as such, they've still got multiple different options and opportunities that they can do and they can really thrive and turn out to be amazing adults.\"", "url": "https://www.bbc.co.uk/news/articles/cp8ymvvnvqgo"}