{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 04:25:10", "date_modify": "2025-04-26 04:25:10", "date_publish": "2025-03-03 12:13:35", "description": "The store would bring clothing and homeware departments to Hull for the first time since 2019.", "filename": "news_articles_cj4n2zxl5x1o_1745641510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a51b/live/d873f4c0-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n2zxl5x1o_1745641510.html", "title": "Plans for major new M&S store in Hull submitted", "title_page": "Plans for major new M&S store in Hull submitted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to create a new Marks and Spencer (M&S) store in Hull have been submitted, six years after the closure of a similar shop in the city centre.\nThe 61,000-sq ft (5,659-sq m) food, home and clothing store, at Kingswood Retail Park, would create 43 jobs, according to the proposal.\nAt present, the retailer operates a food store at Kingswood, but the applicant said it was \"too small to meet M&S's business model requirements\".\nCouncillor Mike Ross, the leader of Hull City Council, welcomed the announcement, saying the proposal was a \"massive sign of confidence\" in the local economy.\nThe application has been submitted by Burnett Planning on behalf of Legal & General Assurance (Pensions Management) Limited, the owner of the retail park.\nIt would involved dividing the existing Matalan store into two units, with Matalan continuing to trade from a new, smaller space.\nM&S would occupy the larger part of the building, with a food hall on the ground floor. Clothing and home departments would occupy part of the ground floor and a new first-floor space.\nAdditional space would be used for staff facilities and storage.\nIn addition to the Kingswood store, M&S operates \"Simply Food\" halls in Anlaby and Beverley. The Kingswood store would be the first to offer clothing and homeware in the city since the closure of the Whitefriargate store in 2019.\nDavid Hooper, a director at Hull and Humber Chamber of Commerce, described the announcement as \"great news\".\n\"M&S is one of the major high street brands and it has been missed from the city,\" he said. \"To see them come back will be welcomed by shoppers and the public.\"\nRoss, a Liberal Democrat who represents the Beverley and Newland Ward, said: \"Marks and Spencer's news is a massive sign of confidence in the local economy here in Hull.\n\"This will improve the offer to residents across the city and help us attract more people to Hull and the surrounding area.\"\nWill Smith, head of property at M&S, said: \"We are delighted to see the submission of this planning application for a new full-line M&S store in Hull.\n\"This marks a significant milestone in our commitment to modernising our UK store estate and ensuring we are in the right locations to serve our customers.\"\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cj4n2zxl5x1o"}