{"authors": ["Jodie Halford and Kate Scotter", "www.facebook.com"], "date_download": "2025-05-19 14:43:19", "date_modify": "2025-05-19 14:43:19", "date_publish": "2017-07-21 14:48:33", "description": "The story of the young airman who vanished on a night out baffled the nation - what happened to Corrie Mckeague?", "filename": "news_uk-england-suffolk-39344553_1747665799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14B1D/production/_95256748_corriewithnicola1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-suffolk-39344553_1747665799.html", "title": "The tortuous search for Corrie Mckeague", "title_page": "The tortuous search for Corrie Mckeague - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The search at a landfill site for the body of Corrie Mckeague, the young airman who went missing after a night out, has been called off. For months, his disappearance set social media aflame with appeals and conspiracy theories alike. This is the story of his mother's search for the truth.\nOn the afternoon of 26 September 2016, Nicola Urquhart's phone rang. It was the police telling her that her 23-year-old middle son, Corrie, an airman at RAF Honington in Suffolk, had been reported missing.\nMrs Urquhart, hundreds of miles away at the family home in Dunfermline, was told he had not turned up to parade that morning.\nInformation about his last known movements was quickly coming to light - he had been on a night out in Bury St Edmunds, and had been seen walking into a bin loading bay area known as \"the Horseshoe\" before disappearing from the view of CCTV cameras.\n\"In the first five days, I had complete confidence in the police team,\" recalls Mrs Urquhart. \"The phone calls I was getting, the updates I was getting - we didn't even come down to Suffolk. I stayed at home.\n\"They'd searched the Horseshoe area and there was no trace of him there. In my mind, it was a case of follow him on the camera and we're going to find him.\n\"I had complete faith that was what was going to happen.\"\nWhile Corrie's fate is unknown, police believe his remains are probably in the landfill site. If that is the case, his last night alive certainly seems to have been a boisterous one.\nHe had been out with friends before becoming separated from them when he was thrown out of a club for drinking too much.\nCorrie moved on to his favourite takeaway Pizza Mama Mia, where he bantered with the staff, before sleeping for a couple of hours in the doorway of Hughes Electrical.\nHe then made his final, solitary journey through the streets of the quiet Suffolk town and entered the Horseshoe.\nSomehow, he ended up in a large bin, filled with bags of household waste, and was most likely crushed to death a short time later in the hopper of a bin lorry.\nPolice have now revealed that Corrie had been known to \"sleep in rubbish\" during nights out.\nInvestigations showed that his mobile phone followed the same route as the lorry, which had headed to Milton, Cambridgeshire, 30 miles away.\nAt that time, detectives had been told the weight of a bin-load collected from the site was 11kg (1st 10lb) - far too light to contain Corrie's body. As a result, the landfill site was not searched at this point in the inquiry.\nBut in March, almost six months after the airman's disappearance, it was revealed by police that the bin's weight was in fact over 100kg (15st 10lb) - more than heavy enough to have contained the missing airman.\nSince realising the body was most probably at the 120-acre (48.5 hectare) landfill site in Milton, a team of eight officers have been trawling through the waste, examining 60 tonnes of rubbish each day.\nMrs Urquhart and her two sons Darroch and Makeyan travelled from Scotland and set up base nearby, living a \"daily torture\" as they waited for police to call to say they had found Corrie.\nThe family is very close - Corrie would often spend hours on the phone with his mum or siblings.\nThe middle brother of three, he was born in Perth and raised 25 miles up the road in Cupar, Fife.\nTheir parents split up when Corrie was nine and the boys moved 28 miles (45km) to Dunfermline with Mrs Urquhart.\nMakeyan said they were just \"normal brothers\" who would play, fight, torment each other \"the way brothers do\", while Darroch described Corrie as the \"most outgoing person\", who loved attention and being around people.\nA couple of months after he went missing, Mrs Urquhart posted a video of him sitting in the back garden singing \"I Want to be Popular\" from the musical Wicked.\n\"That just sums that boy up completely,\" she said.\nWriting on the Find Corrie Facebook page, Mrs Urquhart said she had tried to wait \"quietly, patiently and remain positive\" during the long search.\nNow, she faces a future in which she might never find out what happened to her son.\n\"I understand that Corrie may never be found. I am realistic and we will find a way to deal with that scenario, but it would have to be knowing that a sound investigation had been carried out and there are no other lines of inquiry that could be followed.\n\"We are still a long way off that.\"", "url": "https://www.bbc.com/news/uk-england-suffolk-39344553"}