{"authors": ["Joe Gerrard", "www.facebook.com"], "date_download": "2025-04-26 06:35:44", "date_modify": "2025-04-26 06:35:44", "date_publish": "2025-02-27 06:11:53", "description": "The artwork planned for Front Street in York is being designed with help from school pupils.", "filename": "news_articles_cx2xkzplkgmo_1745649344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/301c/live/a74a0480-f458-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xkzplkgmo_1745649344.html", "title": "Mural to be unveiled in York Front Street regeneration", "title_page": "Mural to be unveiled in York Front Street regeneration - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A mural planned as part of the regeneration of one of York's high streets has been designed with help from school pupils.\nThe wall painting is being created by art company Art of Protest at Front Street in Acomb and is due to be unveiled on 22 March.\nDesign work included workshops where young people were invited to use spray paints to create their own artworks.\nJeff Clark, Art of Protest's creative director, said: \"It has been a privilege to work in our home town and our ambition is to create a design Acomb residents will be proud of.\"\nMr Clark said for a \"true sense\" of the place, artists needed input from people who lived and worked in the area.\n\"In the last month, we have heard many voices about what they want to see and feel down Front Street,\" he said.\nThe design of the mural was now being finalised following 17 community engagement sessions held at local hubs and four schools, Art of Protest said.\nThe company also ran a street art academy for residents to learn new skills, according to the Local Democracy Reporting Service.\nThe £38,000 project is part of the council's ongoing regeneration of Front Street, which includes new benches, wider crossings and the removal of bollards.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cx2xkzplkgmo"}