{"authors": ["Aurelia Foster", "www.facebook.com"], "date_download": "2025-04-26 06:50:25", "date_modify": "2025-04-26 06:50:25", "date_publish": "2025-03-01 07:58:35", "description": "Traffic will be banned from part of the road near the Tube station in a trial to avoid overcrowding.", "filename": "news_articles_c5y26n42vj8o_1745650225.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c50b/live/e9e26b70-f46c-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y26n42vj8o_1745650225.html", "title": "Camden High Street to be pedestrianised near Tube station", "title_page": "Camden High Street to be pedestrianised near Tube station  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Traffic is to be banned from a busy section of Camden High Street near Camden Town Tube station, as part of a trial.\nThe road will be pedestrianised from the junction with Parkway and Kentish Town Road up to the junction of Jamestown Road and Hawley Crescent, with buses being rerouted around the area.\nCamden Council says it will create a \"safer and healthier\" place for residents and visitors to the world famous street.\nIn a recent consultation more than 70% of local residents were in favour of a traffic ban but a disability charity has raised concerns about accessibility.\nContra-flow cycle lanes will be introduced and blue badge parking bays will be installed on nearby roads.\nOn Jamestown Road, paid parking bays will be converted into outdoor seating areas and loading bays for businesses.\nA spokesperson for disability charity Inclusion London, said fully pedestrianising the high street could make it difficult for disabled people to get around.\n\"Many of us rely on buses, cars and taxis to get us exactly where we need to be,\" they said.\n\"This trial must be carried out with disabled people and our organisations, rather than just consulting us afterwards.\"\nThe scheme will be kept under review during the trial, with tests being carried out to understand the impact.\nIt will be brought in for an initial period of up to 18 months, but could be made permanent, the council said.\nAdam Harrison, cabinet member for planning, said this area of the high street was the first part of Camden many visitors experience.\n\"At peak times there can be as many as 40,000 people on the high street, creating significant overcrowding and a stressful experience,\" he said.\n\"So many people ask why the high street is not already pedestrianised – now we are delivering on that call.\"\nTransport for London has provided £130,000 for the introduction of the trial, which will be brought in under a local authority Experimental Traffic Order.\nThe traffic ban will begin this year marked by an opening event, with a specific date yet to be announced.", "url": "https://www.bbc.co.uk/news/articles/c5y26n42vj8o"}