{"authors": ["Echo Chambers", "www.facebook.com"], "date_download": "2025-05-19 15:34:08", "date_modify": "2025-05-19 15:34:08", "date_publish": "2015-01-29 22:25:16", "description": "An Illinois school district's letter informing parents that they may be asked to provide their children's social media passwords has parents, and privacy advocates, up in arms.", "filename": "news_blogs-echochambers-31033024_1747668848.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80656000/jpg/_80656745_79493977.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_blogs-echochambers-31033024_1747668848.html", "title": "Can a school demand your Facebook or Twitter login?", "title_page": "Can a school demand your Facebook or Twitter login? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A school district in Illinois is embroiled in controversy after a letter it sent to parents was published, explaining that school officials are allowed to demand access to students' social media accounts.\nAt the beginning of this year a law, external went into effect across the state that charges public schools with the task of investigating instances of bullying. It also expands the definition of bullying to include cyberbullying, even if it occurs outside of school hours.\nMany privacy advocates are taking issue with the implications of the law - particularly when it's combined with a 2013 law, external that allows administrators to request a student's login information when they think they are cyberbullying or breaking other school rules.\nJason Koebler, writing for Vice's Motherboard, broke the story, external, publishing the legal-sounding letter sent to parents by the Triad Community Unit School District No 2.\n\"If your child has an account on a social networking website, eg, Facebook, Instagram, Twitter, ask.fm, etc, please be aware that state law requires school authorities to notify you that your child may be asked to provide his or her password for these accounts to school officials in certain circumstances,\" the letter reads.\n\"Illinois can't seem to decide whether it's the home of the mid-western gentlefolk or of the most draconian humans this side of Moscow,\" writes, external CNET's Chris Matyszczyk.\nMatyszczyk wonders what schools will do if they stumble upon irrelevant information in their search for proof of wrongdoing. For instance, what if they find out about criminal activity or a sexual relationship? What about a medical problem?\n\"It's one thing for authorities to observe what employees, students or suspects are posting on social media,\" he says. \"It's surely another to think that they have the automatic right to simply demand what is quite obviously personal information.\"\nSome parents who received the notice were also unnerved about the lack of privacy. Sara Bozarth, a mother in the school district, spoke to, external local Fox News affiliate KTVI.\nShe said it's OK for her or her child to access a social media account so a teacher can view it, \"but to have to hand over your password and personal information is not acceptable to me.\"\nWhile the new law doesn't explicitly state that schools are allowed to ask for passwords, the old law only requires that schools have \"reasonable cause\" to justify demanding a student's account information - an action which is otherwise illegal.\n\"But this is not a broad exception,\" writes, external Alexandra Svokos of the Huffington Post. \"A school could only request passwords if there is ample evidence of a school rule being violated - such as a football player drinking alcohol. Moreover, students weren't required to provide the passwords - schools were simply allowed to request them under these circumstances.\"\nIn fact, the law Svokos is referring to does says that elementary and secondary schools can \"request or require\" login information. This fact wasn't lost on Koebler, who defended his original reporting in the comment section of the Huffington Post article.\n\"This (HuffPo) story is quite flippant about the idea that any rule-breaking student technically can be asked for their social media passwords,\" he writes. \"That's a power that's likely to be abused at some point.\"\nBut it's also a power that hasn't been used yet - or at least not at Triad.\nIn a press release obtained by Koebler, external the school district says the letter was just meant to provide notice to parents about the law and was based on a form letter distributed widely by the Illinois Association of School Boards. So far they say they haven't felt the need to request any of their students' passwords.\n\"The district understands student privacy interest as well and will not haphazardly request social media passwords unless there is a need and will certainly involve parents throughout the process,\" the press release says.\nThis, however, doesn't mean that other districts have been so restrained with implementing similar laws enacted across the country.\nIn 2013 one school district in California made headlines, external after spending more than $40,000 (£26,500) to monitor their students online.\nSome argue that the law in Illinois violates Facebook's terms of use, external, which forbids users from sharing their password or letting anyone else access their account.\nOthers, like Kade Crockford, say it even might be unconstitutional. Ms Crockford, the director of Massachusetts' American Civil Liberties Union, is quoted in Koebler's article as saying that the law is an example of government overreach.\n\"Anytime a school is trying to control students' behaviour outside school, it's a serious threat to their privacy and to their futures,\" she says.\n(By Kierran Petersen)", "url": "https://www.bbc.com/news/blogs-echochambers-31033024"}