{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:47", "date_modify": "2025-05-19 15:30:47", "date_publish": "2015-02-05 03:28:53", "description": "Nick Clegg has set out the Liberal Democrats' economic policies for the next Parliament, including tax rises worth £8bn and £16bn in spending cuts.", "filename": "news_uk-politics-31141549_1747668647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80793000/jpg/_80793030_025643336-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31141549_1747668647.html", "title": "Lib Dems propose £8bn in tax rises to reduce deficit", "title_page": "Lib Dems propose £8bn in tax rises to reduce deficit - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Liberal Democrats would increase taxes on the better-off to raise £8bn and sign up to £16bn spending cuts, Nick Clegg has said.\nSetting out his party's financial plans, Mr Clegg said wealthy individuals and big business did not always pay their \"fair share\".\nHe vowed to balance the books by 2017-18 - the same date as the Tories.\nBut while the Tories say they would not raise taxes, Mr Clegg plans a mix of spending cuts and tax rises.\nLabour says it will achieve a surplus by 2020, the end of the next Parliament.\nTax increases would include aligning capital gains tax - charged on profits from home and property sales - more closely with income tax, Mr Clegg told BBC deputy political editor James Landale.\nRaising capital gains tax would be \"to make sure the gap between income tax and what you pay in your capital gains isn't so big,\" said Mr Clegg said.\nThere's been quite a debate at Westminster about the exact ratio of spending cuts to tax rises that the Lib Dems are proposing in order to eliminate the deficit.\nThe answer depends on whether you start counting from 2015 or 2010, when the current government came to power.\nBut today there was little doubt that Nick Clegg's criticisms of his two potential coalition partners - Conservatives and Labour - was not 50:50.\nMr Clegg described Ed Miliband's party as \"dismal\" but directed most of his fire at his coalition partners. He avoided answering directly when I asked if he would veto another Tory coalition if George Osborne stuck to his line that no tax rises are necessary - but he described the chancellor's plans as \"implausible and undeliverable\".\nThe Lib Dem leader claims at least £8bn of tax rises are needed to balance the books.\nThis latest policy announcement adds to the mood music directed by Mr Clegg at the Labour leadership. It comes as analysis published by think tanks The Fabian Society and Centre Forum suggests about 100 areas where Labour and Lib Dem policies overlap.\nIt is too soon to talk about a Labour/Lib Dem coalition - the harsh arithmetic of seats and votes will decide whether that is possible - but preparations for the post-election courtship might be under way.\nHowever, as part of spending cuts, £4bn would be taken from the welfare budget. Chief Secretary to the Treasury Danny Alexander said between £10bn and £12bn would come from cuts to government departmental spending.\nA \"high value property levy\" - formerly called a \"mansion tax\" - would raise up to £1.5bn, and a crackdown on tax avoidance would be expected to save £6bn.\nMr Clegg said: \"It is incomprehensible to most people that you would try and balance the books without asking for a contribution from the wealthiest people in our country.\n\"Liberal Democrat plans are for a bigger tax contribution from those who can afford to pay - the wealthiest individuals and big businesses which are not always paying their fair share.\n\"Our plan means that in the last year of the next Parliament, we will cut £38bn less than the Conservatives. And we will have borrowed £70bn less than Labour.\"\nThe Lib Dem plans did not require any increase in the \"headline\" rates of taxation - income tax, national insurance, VAT and corporation tax, Mr Clegg said.\nThe Lib Dems are pledging to protect low-and middle-income earners as well as spending on education, the National Health Service and foreign aid.\nThere would also be an increase in the banking levy and changes to the tax deductibility of interest payments.\nThe Lib Dem announcements come after the Institute for Fiscal Studies (IFS) said the worst of the UK's spending cuts was still to come.\nIts Green Budget, which looks at options and issues ahead of next month's Budget, says the UK's finances still have \"a long way to go\".\nThe IFS has also said voters face a \"stark choice\" between the parties in May's general election.", "url": "https://www.bbc.com/news/uk-politics-31141549"}