{"authors": ["Elaine Mitchell", "www.facebook.com"], "date_download": "2025-04-26 03:50:06", "date_modify": "2025-04-26 03:50:06", "date_publish": "2025-03-05 13:05:27", "description": "An anti-poverty strategy was first committed to 18 years ago in an effort to tackle deprivation.", "filename": "news_articles_czjekz19kplo_1745639406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0fea/live/db478500-f9bc-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czjekz19kplo_1745639406.html", "title": "Anti-poverty: Stormont in legal breach over strategy", "title_page": "Anti-poverty: Stormont in legal breach over strategy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stormont's Executive Committee has been found in breach of its legal obligation to adopt an anti-poverty strategy at the Royal Courts of Justice.\nThe strategy was first committed to 18 years ago in an effort to tackle poverty, social exclusion and deprivation.\nThe human rights group, the Committee on the Administration of Justice (CAJ), took the case against the Stormont Executive, the communities minister and the first and deputy first ministers.\nThe judge said there was no evidence that the communities minister or the first and deputy first ministers were in breach of their duties.\nA spokesperson for the Department for Communities said the department had noted the findings of the court and officials was considering these in detail.\nThe spokesperson added that strategy remains a \"key priority\" for the minister.\nThe court heard while the Communities Minister Gordon Lyons had \"abandoned\" work done for the strategy, it did not amount to a \"deliberate attempt to thwart\" publication of the anti-poverty strategy.\nLawyer Una Boyd, representing the human rights group, said while the judgement had not gone entirely their way, it was a \"significant victory\".\n\"What is very important about the outcome is it reiterates that an anti-poverty strategy isn't a policy decision, it isn't something that's nice to have.\n\"It's a legal obligation, and that legal obligation simply has not been filled.\"\nThe court heard a timeline of the delays in adopting the anti-poverty strategy, which was included in the Northern Ireland Act following the St Andrews Agreement in 2006.\nThe case, brought by the CAJ, is also supported by members of the Equality Coalition including Unison, Barnardo's NI and the Northern Ireland Anti-Poverty Network.\nGerry Murphy, from the Irish Congress of Trade Unions, said the outcome showed there was a \"malaise affecting decision making\" at Stormont.\n\"Poverty is widespread across our community,\" he said.\n\"On top of all of that, it's affecting people who are never affected by poverty before.\"", "url": "https://www.bbc.co.uk/news/articles/czjekz19kplo"}