{"authors": ["Oliver Slow", "www.facebook.com"], "date_download": "2025-04-26 08:00:12", "date_modify": "2025-04-26 08:00:12", "date_publish": "2025-02-25 10:50:05", "description": "The One That Got Away focuses on the murder of a nurse in a Welsh seaside town.", "filename": "news_articles_cvgpemvlj3po_1745654412.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e84b/live/14e780d0-f364-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgpemvlj3po_1745654412.html", "title": "BBC series showcases Wales' 'beautiful and bleak' scenery", "title_page": "BBC series showcases Wales' 'beautiful and bleak' scenery - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The writer of a new Wales-based crime drama said the series will showcase the country's \"beautiful and bleak\" landscape.\nCatherine Tregenna wrote The One That Got Away, which was filmed in south Wales and Pembroke Dock, areas she describes as among her favourite places.\n\"Artists are drawn there from all over the world,\" she said, adding she believed the show's artistic directors had done the area \"justice\".\nThe six-part series focuses on the murder of a nurse that risks reopening old wounds in a Welsh seaside town.\nThe show was filmed simultaneously in English and Welsh, and Tregenna – who has also written for Doctor Who, EastEnders and Casualty – spoke about writing in Welsh, which she learned when she was 10.\n\"I speak it somewhat fluently, but I haven't quite mastered the mutations,\" she said.\nShe described the show as a \"forensic analysis of a love affair\", between Det Sgt Rich Sheldon, played by Richard Harrington, and Elen Rhys' Det Insp Ffion Lloyd, who were previously engaged.\nA recent murder also stirs up tensions in the community, casting doubt on a historic conviction and raising concerns about a potential copycat killer.\n\"They think it's all behind them because they got the man who did it,\" Tregenna told BBC Radio Wales Breakfast.\nShe said she also wanted to create characters that were not your typical \"maverick detectives\" who have \"sacrificed their personal lives for the sake of the job\".\n\"We meet a quite contented, married detective sergeant, and a more ambitious detective inspector, who goes back to the bosom of her family, which is very warm,\" she said.\nThe first series of The One That Got Away will air on BBC One Wales at 21:20 GMT on Tuesday.", "url": "https://www.bbc.co.uk/news/articles/cvgpemvlj3po"}