{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:24:34", "date_modify": "2025-04-26 04:24:34", "date_publish": "2025-03-03 12:37:37", "description": "Paul Pender's two victims revealed the impact on their lives, saying it should be his shame to bear.", "filename": "news_articles_c93ny78x1p9o_1745641474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29b9/live/98c04420-dd64-11ef-8a5c-9385ebd82e68.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93ny78x1p9o_1745641474.html", "title": "Wheatley Hill man jailed for historical child sex abuse", "title_page": "Wheatley Hill man jailed for historical child sex abuse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been jailed for 18 years for the sexual abuse of two children.\nPaul Pender, 58, committed historical offences against two children who were both aged under 12 at the time, Newcastle Crown Court heard.\nHis victims said the lorry driver had devastated their lives, adding that the shame they had felt regarding the abuse should have been his, not theirs, to bear.\nPender, from Wheatley Hill, County Durham, had denied any wrongdoing but was found guilty of 10 offences including rape, indecent assault and gross indecency.\nHis first victim told the court the abuse had \"massively affected\" their life and its impact could only be described through \"pain, heartbreak and loss\".\nThey said they had felt \"scared, alone and unlovable\" as a child and had been treated as a \"dirty little secret who could be blamed for it all\".\n\"Pender made me feel dirty, degraded and abused,\" the victim said, adding: \"I used to feel deeply ashamed, but have come to realise it's not my shame to hide.\"\nPender's other victim said they had repressed the abuse as a child, but the memories had come flooding back after speaking with police.\n\"My life, as I knew it, was shattered in an instant,\" they said, adding: \"It has infected every part of my life.\"\nJudge Sarah Mallet said both victims had been \"incredibly brave\" and Pender had inflicted \"severe psychological harm\" on them.\nJudge Mallett said Pender, of Rock Farm Mews, would have to serve two thirds of his jail term before becoming eligible for parole.\nIn addition, he will have to serve a further year on extended licence.\nPender must sign the sex offender register for the rest of his life, with a sexual harm prevention order also issued, restricting any future contact with children.", "url": "https://www.bbc.co.uk/news/articles/c93ny78x1p9o"}