{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:01:02", "date_modify": "2025-05-21 04:01:02", "date_publish": "2025-04-07 00:00:00", "description": "A major public health incident has been declared by the city council, with uncollected bin bags attracting rats.", "filename": "news_live_cdxgv0yy5ept_1747800062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fbb6/live/54d60290-13e7-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cdxgv0yy5ept_1747800062.html", "title": "Birmingham’s rubbish piles high as still no agreement in bin strike talks", "title_page": "Birmingham’s rubbish piles high as still no agreement in bin strike talks - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Strike set to continue\nWe're going to end our live coverage for today, thanks for joining us.\nTalks to end the strike have finished for the day without a deal and are set to continue tomorrow.\nOur reporters Josh Sandiford, Anna Whittaker, David Lumb, Sarah Julian and Rob Mayor have been reporting from the streets of Birmingham through the day.\nHere's what they found:\nBin bags have continued to pile up in many areas and attract rats and other vermin\nIt was difficult to tell fly-tipping from residents' rubbish in many cases\nRefuse collectors told us they were also eager for a deal\nMobile collection sites in Erdington and Billesley have again proven popular\nEmergency bin crews have been more effective than last week at getting out to pick up bins\nNeighbouring council steps in to help remove piles of rubbish\nCaroline Gall\nBBC News\nLichfield District Council has announced it will provide support to help clear the piles of rubbish in nearby Birmingham.\n“Our crews and vehicles are being deployed - not to carry out routine bin collections, but to help clear the mountains of uncollected waste that have built up on the streets of Birmingham,\" leader Doug Pullen said.\n\"The city is currently seeing rubbish accumulate at a staggering rate of around 1,000 tonnes each week.”\nThe support is being provided at a commercial rate, meaning Lichfield residents will not bear any cost for the assistance being given, he added.\nHe said the council was \"proud to be a good neighbour\", but its first duty was to Lichfield.\n\"I can reassure residents that our routine services will remain unaffected and our teams will continue to deliver the high standards people rightly expect,\" he said.\nThe first collections will begin on Wednesday.\n'We're working as quick as we can'\nAsked if it could be another few weeks before a solution is found, Unite regional officer Zoe Mayou said she hoped not, but it would depend on how often the two parties could meet.\n“We’re trying to all work as quick as we can. Unfortunately things don’t always progress, for various reasons, as quick as anyone would like,” she said.\n“We are trying to work on this [the dispute]. We had a meeting today and we do want to resolve this.\"\n'Children shouldn't have to wade through rubbish'\nSadia Khan and her fellow Friends of Spark Green Park are just the sort of volunteers Ayoub Khan could have been talking about in the Commons.\nShe told us last week that her team had found it hard to clear an increase in rubbish dumped in the park, including builders' waste.\n\"It's so hard for our littler pickers to remove rubble and brick. It is getting a lot more of a nuisance. There's rats you can see in broad daylight,\" she said.\nMs Khan added that the volume of rubbish was also an issue for many businesses across the city, including food outlets in the Balti Triangle, and a concern for both public health and residents' mental health.\n\"It's depressing, it shouldn't be the norm. Children shouldn't have to wade through it on their way to school,\" she said.\nMP repeats call for army to be deployed\nA Birmingham MP has repeated his suggestion for the government to deploy the Army to help clear up the city’s streets.\nSpeaking in the House of Commons, Ayoub Khan, independent MP for Birmingham Perry Barr, asked whether the Army could be used to “assist the local charities and organisations” that were trying to clear some of the rubbish.\nLocal government minister Jim McMahon said in response that the government wanted a “sustainable deal that can hold”, including one that did not “stray into potentially compromising the equal pay settlement”.\n“Bearing in mind, that's already £1bn of cost to the local authority,” he added.\nAnt infestation due to rubbish not being collected - student\nCaroline Gall\nBBC News\nBirmingham student Harry Clayton shares a house with seven others and said their home now has an ant infestation due to rubbish not being collected.\n“People respond to the news saying residents can sort their own rubbish out, and that we just don't care, but we live in a student house of eight people, with no cars and no parents who live locally,\" the 22-year-old told BBC News.\n“Taking our own litter, which would need to be done multiple times a week, is simply not possible for us, and with the bin men now not working, it has left us no other choice than to leave litter outside, and let ant infestations bear down on our home due to the litter.\"\n'Things are moving forward'\nUnite regional officer Zoe Mayou said this afternoon's meeting with the council, which lasted a couple of hours, was \"productive\".\nShe told the BBC: “Things are moving forward. Obviously these things take time and we have arranged a further meeting tomorrow.”\nMs Mayou said both Unite and the council have agreed not to go into the details of what they were talking about publicly.\n“All I can say is we both want an end to this dispute,\" she added.\n\"We both want to come together and it really is just looking at how we can do that mutually, and what the timescales are around that.”\nNo temporary halt in strike 'for now' - Unite\nAsked about residents’ hopes that there could be a temporary halt to the strike action, Unite regional officer Zoe Mayou said “not for now”.\nShe said it might be considered if the council offered the striking workers “something more concrete” but it had not been discussed.\n“I’m sure the people of Birmingham would love that. If we can get something and our members agree to do that, then we will,” she added\n“Unfortunately, we’re not in that position at the moment.”\nBoost for council as depot entrances cleared\nRob Mayor\nPolitical reporter, Birmingham\nBirmingham City Council has high hopes of what it can achieve despite the strike, now that its trucks can leave depots without delay.\nAt the depot in Tyseley for example, it was taking a couple of hours for bin wagons to reach the end of the road as they were delayed by striking workers.\nThis morning I saw half a dozen leave unimpeded before 06:30.\nThe council says it had more than 20 bin lorries out on Saturday and on Sunday, and I’ve seen street cleaning teams reassigned to bin trucks this morning, tackling some of the worst spots in the Alum Rock area.\nBut with 17,000 tonnes of rubbish to clear, it’s going to take some time.\nStrike follows seven-week dispute in 2017\nOliver Staunton in our last post isn't the only local resident hoping for a long-term solution.\nThat's because strikes by bin workers in 2017 were equally as disruptive.\nThat seven-week dispute was over restructuring plans.\nIt ended with an agreement from the council that certain posts would not be made redundant and union officials in return recommended staff considered accepting rota changes.\nThere was also a dispute in 2019 when Unite claimed members of the GMB union were given larger \"conciliatory payments\" at the resolution of the 2017 dispute.\nThe GMB union said this was because its members did not take part in the strike and the extra payments were because they had been left out of conciliatory talks.\nThat dispute ended the following month when a financial settlement was agreed to satisfy Unite members.\n'I can understand the deadlock'\nJosh Sandiford\nBBC News, West Midlands\nOliver Staunton from Erdington, like many of us, are wondering how this strike can be resolved.\nSpeaking before news of the latest collapse in talks, he said: \"I can understand why the council are saying they want to standardise the rates of payment and I can understand why the workers wouldn't want to accept that, so it seems like a deadlock.\"\nMr Staunton says he's hoping for a \"long-term solution\" to prevent another strike taking place a few years down the line.\nWhat stage are negotiations at?\nCaroline Gall\nBBC News, West Midlands\nThe strike began on 11 March, but how close, or not, are the council and union Unite to reaching an agreement?\nTalks between the two parties have ended again today with no deal, after also breaking down last week.\nThere have, however, been offers on the table, including about offering workers alternative roles.\nAll affected staff have been offered other jobs at the same pay, the council said, adding that almost three-quarters of them had either taken up the offer, or decided to take voluntary redundancy.\nUp to 41 workers have declined any offer, and 35 who opted for driver training \"have also told us via a letter from Unite that they are working under protest\", the council said.\nThe next round of talks will begin tomorrow afternoon, this time at the city council's offices.\nA formal period of consultation by the council as it looks to make compulsory redundancies for those who have declined deals began on 31 March.\nThe union has said it hopes the council will have a change of heart over the potential redundancies and added that by threatening redundancies it sent a message it was not serious about resolving the dispute.\n'We want a breakthrough - it's not a good look for Birmingham'\nPhil Mackie\nBBC News Midlands correspondent\nDaniel Taylor has worked on the bin lorries for 25 years.\nHe told me he faces losing £6,000 a year if he’s downgraded, and has five kids to support.\n\"It's a lot of money to lose. We're living in a financial crisis, a cost of living crisis. There's rent, phone bills, car fuel, insurance to pay,\" he said.\nHe explained how he was at the top of his band as a loader, but under the new structure would be dropped to a Grade 2 role. Instead he has been offered a role as a driver, but he has to pass a test first.\n\"The council says it wants to modernise the service. You don't modernise the services by cutting people's wages. Especially when there is a cost-of-living crisis,\" he said.\nThe strikers want to get back to work, he added, and clear the streets.\n\"We want a breakthrough. We don't want to be out here. We want to be out there doing our jobs. We enjoy our jobs.\n\"It's not a good look for Birmingham at all. There is mess everywhere.\"\n'The sight, the stench, the mess - it's got to end'\nKathryn Stanczyszyn\nBBC Radio WM presenter in Washwood Heath\nKamran Khursheed lives in the Washwood Heath area of Birmingham and says bin bags have been piling up on the streets around him for more than six weeks.\nHe's calling for something to be \"done about it now\" and says the issue is just getting worse, particularly around Fernbank Road.\n“The sight, the stench, the mess – it’s got to end. It’s embarrassing as well,\" he adds.\n\"We’re England, the world is seeing this and it’s just not right at all.\"\nBirmingham bin strike - a timeline of events\nAlex McIntyre\nBBC News, West Midlands\nThe all-out bin workers strike in Birmingham began in March but the dispute was going on for months before that.\n6 January: Bin workers who are members of the Unite union walk out in what was originally meant to be the first of 12 days of strike action taking place over four months.\n3 February: Unite announces an intensification of industrial action, with 12 days of strikes scheduled for February.\n26 February: The union announces a further escalation\n11 March: An all-out strike begins as more than 350 refuse workers take indefinite industrial action.\n27 March: Talks between the city council and Unite break down. The former threatens compulsory redundancies for those who have “declined all offers on the table”.\n31 March: The council declares a major incident in response to concerns of risks to public health and damage to the environment. It claims picket lines blocking depots have prevented refuse vehicles from getting out, leading to about 17,000 tonnes of rubbish not being collected.\n2 April: The bin strike is raised during Prime Minister’s Questions and Sir Keir Starmer says the government will put in whatever support the council needs.\n3 April: Unite general secretary Sharon Graham writes to deputy prime minister Angela Rayner and accuses ministers of sitting on their hands.\n5 April: Rayner meets council leaders to discuss ways of clearing the streets.", "url": "https://www.bbc.com/news/live/cdxgv0yy5ept"}