{"authors": ["Ewan Gawne & Richard Stead", "www.facebook.com"], "date_download": "2025-04-26 07:51:39", "date_modify": "2025-04-26 07:51:39", "date_publish": "2025-02-25 15:01:36", "description": "Nico Logan is sentenced for orchestrating the importation of cocaine to the UK from inside his cell.", "filename": "news_articles_cj9211007n8o_1745653899.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43e9/live/dad2c420-f36f-11ef-8402-45d3cf1c2dcb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj9211007n8o_1745653899.html", "title": "Man running drug empire from behind bars has jail time doubled", "title_page": "Man running drug empire from behind bars has jail time doubled - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A prisoner who continued to run his drug empire from behind bars will have his jail sentence almost doubled for arranging to import £1m worth of cocaine from the Netherlands into the UK.\nNico Logan, 31, orchestrated the delivery from HMP Manchester, formerly known as Strangeways, through phone calls to an accomplice on the outside.\nHe was arrested after his phone records were traced and border guards intercepted a parcel packed with cocaine at Birmingham Airport in June 2023 that was destined for a property in Wythenshawe.\nLogan was found guilty of conspiracy to import and supply cocaine and jailed for a further 15 years on top of his existing 16-year sentence for drug offences.\nThe plot was uncovered after a parcel sent from an address in the Netherlands to a home in Wythenshawe was searched by border guards at Birmingham Airport.\nTwelve brown-taped packages of cocaine worth an estimated street value of £1.2m were found inside.\nDetectives then began a covert operation, observing another man, 34-year-old Michael Garside, collecting the parcel at an address in Wythenshawe.\nHe rang Logan in prison, a call officers believe was an attempt to update him on the delivery, before placing the parcel in his car and driving to another property on Cedars Road, the court heard.\nGarside was arrested and the drugs were found in the parcel, but he was then released while police analysed his phone records to discover he was working under Logan's direction.\nThe call logs and phone records linked the two and Logan was arrested in March 2024.\nGarside, from Wythenshawe, pleaded guilty to conspiracy to supply and import cocaine and was handed a nine-year and seven month jail sentence.\nDetective Constable Chris Chinnery told BBC Radio Manchester the offences showed how \"brazen\" Logan was inside the jail.\nFollowing his sentence, Logan has been transferred to HMP Northumberland.", "url": "https://www.bbc.co.uk/news/articles/cj9211007n8o"}