{"authors": ["Danny Fullbrook", "www.facebook.com"], "date_download": "2025-04-26 04:00:09", "date_modify": "2025-04-26 04:00:09", "date_publish": "2025-03-04 05:23:00", "description": "The multiple Brits winner \"was a force to be reckoned with\" at hockey, her former headmaster says.", "filename": "news_articles_cvgenz6mg97o_1745640009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b1dd/live/b3f87290-f82f-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgenz6mg97o_1745640009.html", "title": "Charli XCX was 'exceptional pupil' at Bishop's Stortford College", "title_page": "Charli XCX was 'exceptional pupil' at Bishop's Stortford College  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A school has said it was \"extremely proud\" of former pupil Charli XCX after she won five Brit Awards.\nThe 32-year-old, who was born in Cambridge and lived near Stansted Airport in Essex, attended Bishop's Stortford College in neighbouring Hertfordshire.\nDuring the ceremony Charli, whose real name is Charlotte Aitchison, was given three of the biggest prizes at the industry ceremony including best artist and best album.\nCollege headmaster, John Maguire, described her as an \"exceptional pupil\".\nBishop's Stortford College is a private school for boarding and day pupils aged 3-18.\nCharli attended between 1999 and 2010 and was part of Benson House.\nMr Maguire recalled: \"She was talented, determined, and independent, and worked hard at everything - academic, sports, and particularly the arts.\n\"On the hockey pitch, Charli was a force to be reckoned with and regularly played as part of the 1st XI team.\"\nAt the Brits, the singer also picked up trophies for Best British Dance Act, Songwriter of the Year, and Song of the Year for Guess, her collaboration with Billie Eilish.\nIn February, XCX won her first Grammy awards for her album Brat and for the track Von Dutch.\nThe headmaster said: \"From the start of her GCSE music, she showed great skill as a composer and through her music, communicated the same infectious love of life that she brought to everything she did at school.\"\nThe singer signed to Asylum Records, part of Warner Music Group, in 2010, which was the same year she performed at her school's annual Stars in their Eyes competition.\nThe school said her success highlighted the importance of the arts being taught at schools.\nMr Maguire said: \"Her success demonstrates the importance of music in schools - she is not the College's only alumni to have a recording contract.\n\"Coincidentally, the 2025 Stars in their Eyes concerts take place at Bishop's Stortford College this week, where the next Charli XCX may be discovered.\"", "url": "https://www.bbc.co.uk/news/articles/cvgenz6mg97o"}