{"authors": ["Jessica Moriaty", "www.facebook.com"], "date_download": "2025-04-26 04:30:02", "date_modify": "2025-04-26 04:30:02", "date_publish": "2025-03-03 06:28:57", "description": "The council leader will write to the government about the \"attack\" on the county's \"farming heritage\".", "filename": "news_articles_c39vvgg1yd0o_1745641802.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29d4/live/ba824240-f5d6-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vvgg1yd0o_1745641802.html", "title": "Wiltshire Council's 'dismay' at tax on farming inheritance", "title_page": "Wiltshire Council's 'dismay' at tax on farming inheritance - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council leader is set to write to the government to express the local authority's \"dismay\" at planned changes to inheritance tax for farmers.\nWiltshire Council passed a motion which called it an \"attack on Wiltshire's farming heritage\".\nUnder the government's planned changes, from April 2026, inherited agricultural assets worth more than £1m, which were previously exempt, will be liable to the tax at 20% - half the usual inheritance tax rate.\nThe prime minister has said that he understood farmers' concerns but \"the vast majority\" would be unaffected.\nWiltshire Council will do an analysis of how many of the county's farms will be affected.\nThe majority speaking at the meeting on 25 February raised concerns over the financial impact on family farms.\nCouncillor Richard Rogers - one of the motion's authors said: \"Many farmers simply can't afford this burden, which would force them to sell land and assets, jeopardising the viability of their farms.\"\nConservative councillor Zoë Clewer added farmers she had spoken to agreed the £1m threshold is \"far too low once dwellings, stock, and machinery are included\".\nCouncil leader councillor Richard Clewer and the leader of the Liberal Democrats on the council, councillor Ian Thorn, supported the motion.\nAlthough the leader of the Labour group on the council, councillor Ricky Rogers, agreed the council should investigate how many farms would be affected, he explained that he could not support the full motion.\nHe said: \"I agree that farmers work hard, so do I. I've run a construction business for 50 years, that's hard work as well.\n\"The rest of us pay 40% inheritance tax, that's what we pay.\n\"Farmers are being asked to pay 20%, from 2026, and ten years to pay it back,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c39vvgg1yd0o"}