{"authors": ["Ken Banks and Louise Hosie", "www.facebook.com"], "date_download": "2025-04-26 04:22:43", "date_modify": "2025-04-26 04:22:43", "date_publish": "2025-03-03 13:44:23", "description": "A man was hit by a police car and a police dog was injured amid the alleged knife incident in Aberdeen.", "filename": "news_articles_c7890jrkv0ko_1745641363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b76e/live/26269bb0-f819-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7890jrkv0ko_1745641363.html", "title": "Armed response concerns after man hit by police car", "title_page": "Armed response concerns after man hit by police car - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Concerns over how a man said to be carrying a knife was detained - after being struck twice by a police car - have been raised by the Scottish Police Federation (SPF).\nA police car was driven at a man in Aberdeen on Friday afternoon as officers tried to disarm him. A police dog was also injured.\nThe SPF - the organisation representing Scotland's police officers - told BBC Scotland News an armed response vehicle (ARV) had been deployed, but was not given authorisation to take action. The SPF said such delays could put lives at risk, and that it should instead be an automatic authorisation.\nA 28-year-old man has appeared at Aberdeen Sheriff Court in connection with the incident.\nFootage of the dramatic collision in the Seaforth Road area on Friday afternoon showed a man flipping over the car bonnet before getting up and striding towards another officer.\nEventually police close in on the man, using a car and a police dog to cut him off.\nThe dog was injured in the incident and taken to a vet.\nPolice Scotland said \"specialist tactics\" were used to protect the public and the officers.\nThe SPF said an armed response vehicle was called to the scene - as per protocol for a knife incident – and that it was there, but said it did not receive authorisation to take action.\nThe SPF said officers already there then had to take matters into their own hands by driving the car at the man - which the SPF said it had concerns about.\nDavid Kennedy is from the SPF and discussed the ARV situation.\n\"My understanding is officers were called to attend, and the armed response vehicle was also called to attend, at some point during that officers who were on the scene dealt with it as well as they could from using their own officer safety techniques,\" he said.\n\"There was an armed response vehicle nearby, waiting to be authorised, but it wasn't authorised.\n\"Ultimately those officers had to self-authorise, but by that time it was to render first aid rather than actually use firearms. The control room have to make a decision when to authorise and when not to authorise.\"\nMr Kennedy added: \"This is the problem we have, we need a policy put in place that means if you're a member of the public and you're carrying a knife, that ARVs have an automatic authorisation.\n\"To send an officer with a taser for instance, that's not acceptable in our view, it's there for protection.\n\"Anything with a firearm or anything with a bladed weapon or a weapon that can cause death or serious harm to somebody should be a firearms officer that's attending to deal with it.\"\nHe described it as \"extremely frightening\" circumstances for all those involved.\n\"Any delay absolutely is potentially putting people's lives at risk,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c7890jrkv0ko"}