{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:52:41", "date_modify": "2025-04-26 06:52:41", "date_publish": "2025-02-28 17:09:22", "description": "Reece Bruns, 20, and a 17-year-old youth are on trial for murder at Lincoln Crown Court.", "filename": "news_articles_c9vye8j8p3zo_1745650361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/82e5/live/aca43c70-f5f2-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vye8j8p3zo_1745650361.html", "title": "Lincolnshire murder accused says he did not mean to stab victim", "title_page": "Lincolnshire murder accused says he did not mean to stab victim - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man accused of murder told a jury he did not deliberately stab his victim during an altercation in a Lincolnshire park.\nKyle Marshall, 37, died after allegedly being stabbed in the heart with a machete by Reece Bruns in Well Head Fields, Bourne on 26 June last year.\nGiving evidence at Lincoln Crown Court, Mr Bruns insisted he only used the knife to scare Mr Marshall away and had no intention to kill him.\nHe said he thought Mr Marshall was also armed with a knife and he felt scared for his life and claimed \"I thought I'd acted in self defence.\"\nProsecutors had previously said there had been a number of disagreements between the two men which escalated after Mr Bruns allegedly attacked Mr Marshall's brother-in-law at a beer festival.\nOn the night of the death, Mr Bruns said Mr Marshall came into the park and started to run towards him.\nHe said when Kyle got close he heard him swear and say \"I'm going to kill you.\"\n\"He was really angry, like nothing was going to stop him,\" Mr Bruns told the jury.\nHe said other people in the park ignored his appeal for help.\n\"I felt like I'd exhausted all my options,\" Mr Bruns explained.\n\"At the time I was pretty sure I saw something sharp in his hand. It looked like he had a blade, a knife.\"\nMr Bruns said at that stage he could not remember if he asked the youth for the knife or he just gave it to him.\n\"As I had it (the knife) I was moving backwards to try and avoid him.\n\"I saw something sharp. I thought if I've got this in my hand, no one's helping me. I've exhausted all my options. Surely he's going to back away.\n\"But he just kept on coming towards me.\"\nMr Bruns said he thought it was Kyle who threw the first blow.\n\"I remember getting a cut on my finger. I tried to block it,\" he said.\n\"He kept on coming towards me and somehow we just both ended up on the floor. It was really quick.\n\"He was on top of me and I somehow managed to break free.\"", "url": "https://www.bbc.co.uk/news/articles/c9vye8j8p3zo"}