{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:51", "date_modify": "2025-05-19 15:22:51", "date_publish": "2015-03-03 16:01:22", "description": "A former resident of a secure residential school tells Jersey's care inquiry he was \"physically abused\" by former education department boss Mario Lundy.", "filename": "news_world-europe-jersey-31713172_1747668171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80582000/jpg/_80582795_screenshot-00050.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-jersey-31713172_1747668171.html", "title": "Mario Lundy 'physically abused' victim, Jersey care inquiry told", "title_page": "Mario Lundy 'physically abused' victim, Jersey care inquiry told - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A former resident of a secure residential school in Jersey had told an inquiry he was \"physically abused\" by a former education department boss.\nThe man, known only as Witness 145, said Mario Lundy had targeted him while he was at Les Chenes school from 1981 and 1985\nGiving evidence anonymously, he said two other members of staff had also assaulted him during his time there.\nBut another witness said alleged victims were \"stirring trouble\".\nWitness 145 described Mr Lundy, who worked at Les Chenes at the time, as \"vicious\".\nHe told the inquiry another member of staff was \"free with his fists\" and described another as \"a drunk\".\nInquiry counsel, Patrick Sadd, also asked Witness 145 if he had organised a meeting of former Les Chenes residents in 2008.\nHe said he had attended, but left early because others at the meeting were \"drunk or stoned\".\nA statement from a different witness said Les Chenes staff were good teachers, and organisers of the meeting were \"stirring trouble\".\nThe hearing, which is investigating claims of child abuse in Jersey's care system, continues.", "url": "https://www.bbc.com/news/world-europe-jersey-31713172"}