{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 14:42:57", "date_modify": "2025-05-20 14:42:57", "date_publish": "2023-07-26 00:00:00", "description": "The bank's boss, Dame Alison Rose, stepped down after admitting to being the source of an inaccurate BBC story about the ex-UKIP leader.", "filename": "news_live_business-66296935_1747752177.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/15632/production/_130520678_de29.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_business-66296935_1747752177.html", "title": "Farage calls for whole NatWest board to resign over Coutts leak", "title_page": "Dame Alison Rose: Farage calls for whole NatWest board to resign over Coutts leak - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for joining us\nWe're now closing our live coverage of the row over Nigel Farage's bank account, which led to NatWest CEO Dame Alison Rose stepping down.\nThe early-hours resignation comes after days of mounting pressure over a decision to move Farage's account from the prestigious Coutts bank, which is owned by NatWest.\nFor our latest report, click here.\nTo read more about Dame Alison, click here.\nFor a look back at the government's involvement in the row, read our chief political correspondent Nick Eardley's latest story here.\nThis page was edited by Emma Owen and Heather Sharp. The writers were Dearbail Johnson, Jennifer McKiernan, James Harness, Malu Cursino and Emily Atkinson.\nThe story, the source, the fallout... and why it matters\nKatie Hope\nBBC business digital editor\nThe fallout over Nigel Farage’s bank account being closed is an insight into a key tenet of journalism - sourcing stories. Reporters have to be able to trust their sources and it's standard journalistic practice not to reveal who they are.\nDame Alison was said to have had dinner with the BBC’s business editor Simon Jack the night before he reported the reason for Farage’s account being closed was because he had fallen below the wealth threshold, citing a source familiar with the matter..\nShe did not confirm that the conversation had taken place at the dinner, but said on Monday she had made “a serious error” in discussing Farage’s relationship with the bank with Jack.\nThis was Dame Alison’s first admission that she had been involved in the story.\nShe said in conversations with Jack \"she had confirmed that Farage was a Coutts customer and he had been offered a NatWest bank account\". She said she had believed this was public knowledge.\nThe BBC is not commenting on the latest development in the story or who Jack’s source was.\nHowever, in a letter from BBC News CEO Deborah Turness apologising to Farage for its inaccurate report, Turness said Jack had gone back to the source to check they were happy for the BBC to publish the information. They said they were.\nFarage highlighted this as a discrepancy between the BBC's and Dame Alison’s account of what had happened.\nHours later, Dame Alison resigned.\n'It's not the job of the bank to tell us what to think' - Griffith\nHere's a bit more from the interview with City Minister Andrew Griffith.\nHe says it's important that lessons are learned from what has happened at NatWest.\nAt a meeting with bank and building society chiefs this morning, Griffith says he relayed the importance that \"customers have trust in their banks, that they're not going to have their services withdrawn because of their political views.\"\nHe adds: \"Its not the job of the bank to tell us what to think or what political party we should support,\"\nHe called on the whole sector to swiftly implement the government's new regulations making it easier for customers to challenge account closures.\nNatwest is part-owned by the taxpayer, and Griffith was asked whether, given the disruption to the bank, the government was putting political considerations ahead of the commercial interest of the taxpayer.\nHe replied: \"No, I don't accept that... there's a very clear principle here at stake.\"\nNo need for Natwest chair to quit, says City minister\nCity minister Andrew Griffith doesn't think Natwest's chair should resign - because he's on the way out anyway.\n\"The chairman of NatWest is already stepping down,\" he has said in an interview with broadcasters.\n\"There's already a search under way... for his replacement. We should let that continue and then in due course, obviously, the bank will need to appoint a new chief executive\" he added.\nNatwest announced earlier this year that is had begun to search for Davies' successor and that he is expected to stand down by the middle of next year.\nPaul Thwaite, who is chief executive of Natwest's business banking unit, will replace Alison Rose as group boss for an initial period of 12 months.\nExceptions to the rules\nDearbail Jordan\nBusiness reporter\nHere's a little bit more from that meeting between bank and building society chiefs and Andrew Griffith, who is the economic secretary to the Treasury and the city minister.\nBanks and building societies will not have to give a 90-day termination notice in all circumstances if they intend to close a customer's account.\nIn the read-out from the meeting, the Treasury said that \"shorter termination periods would be allowed where providers are obliged to comply with financial crime law\".\nThere will also be limited exceptions to the requirement for a bank to spell out to a customer why their account has been closed: \"For example to ensure that bank communications aren’t interfering with investigations into criminal activity.\"\nBanks commit to account closure reforms\nDearbail Jordan\nBusiness reporter\nThe banks and building society heads who met with City Minister Andrew Griffith have all committed \"to the principle of non-discrimination based on lawful freedom of expression\".\nAmong the bank leaders who met with him was David Lindberg, chief executive of Natwest's retail banking group. Other attendees were from Barclays, HSBC, Lloyds, Nationwide and Santander.\nThe lenders said they would bring their policies into line with reforms proposed by the government. These include giving a customer 90 days notice if the bank intends to close their account.\nThis would give customers more time to challenge a decision through the Financial Ombudsman Service or find a replacement bank.\nLenders will also have to spell out why they are terminating an account, which will boost transparency for customers and aid efforts to overturn decisions, the Treasury says.\nTwo MPs say they have been refused bank accounts\nTwo MPs have told the BBC they have been refused bank accounts due to being considered a Politically Exposed Person (PEP), which puts them at higher risk of bribery and corruption.\nThe first MP said the problem was \"absolutely rife\" in banking and they'd had \"no joy\" trying to open a bank account for office expenditure and it made things \"too complicated\" to open a joint account.\nA second MP said they'd been warned by a predecessor that \"I would have an awful lot of trouble like this\", adding \"loads of colleagues are facing the same\".\nThey said: \"One bank turned me down when I was applying for a remortgage earlier this year on the basis that I was a PEP.\n\"Even being accepted involved much longer for them to do extra checks.\n\"I also had to change accountants because they would no longer take me on.\"\nCity minister meeting banks to discuss account closures\nCity minister Andrew Griffith is meeting with the leaders of banks and payment services companies now to discuss the termination of customer accounts and \"freedom of expression\".\nIn a letter asking lenders and other related firms to attend, Griffith wrote: \"The government is unequivocal that banks and other payment service providers – which occupy a privileged place in society – should not be terminating contracts of payment account facilities on grounds relating to users’ exercising of their right to lawful freedom of expression.\"\nOne banking leader who won't be going is Charlie Nunn, chief executive of Lloyds, who has spent this morning discussing the company's results.\nBut he's not too concerned. Nunn said: \"Our policy is really clear. We don't include looking at political beliefs, or personal beliefs, as part of that policy.\"\nWhat now for NatWest's chairman?\nOn Tuesday NatWest's chair Sir Howard Davies said that the board \"retains full confidence\" in Alison Rose as the bank's chief executive.\nBy very early on Wednesday morning, she was gone.\nNigel Farage reckons that more heads should roll over the debacle. Would that include the chair?\nDavies has a lot of experience overseeing banks.\nHe was the first chair of the Financial Services Authority, the city watchdog which regulated the industry between 2001 and 2013.\nHe held the role between 1997 and 2003, leaving well before the global banking crisis nearly crashed the world economy.\nDavies has been chair of NatWest since 2015. Earlier this year, Natwest announced it would begin a search for Davies's successor and he would step down in the middle of 2024.\nBut could that date now be brought forward?\nNatWest's share price drops\nNatWest is the biggest faller on the FTSE 100 share index in London this morning, leading other banks lower.\nNatWest's share price has fallen by nearly 3% to 243.9p each.\nLloyds Banking Group has also seen its share price drop, down 2.5% to 44.87p each. Although that could be more to do with the fact that it published financial results on Wednesday morning and its profits did not rise as much as expected.\nBarclays' share price slid by 1.6% ahead of its own results which will be released at 07:00am on Thursday morning.\nAnd then on Friday, NatWest will publish its results.\nWill Alison Rose get severance pay?\nAt this stage, we simply don't know - but the BBC has contacted NatWest and asked.\nWhat we do know is that Dame Alison Rose's remuneration was at risk when she admitted \"a serious error in judgement\" after she said she discussed Nigel Farage's relationship with the bank with the BBC's business editor Simon Jack.\nIn a statement released just hours before Rose's resignation, NatWest's chair Sir Howard Davies said: \"The events will be taken into account in decisions on remuneration at the appropriate time.\"\nRose was paid £5.25m last year. That includes £2.4m in fixed pay, a £643,000 bonus and £2.1m in share payments.", "url": "https://www.bbc.com/news/live/business-66296935"}