{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:43:36", "date_modify": "2025-04-26 03:43:36", "date_publish": "2025-03-05 08:34:45", "description": "High-value car owners were threatened to make them hand over their keys, court hears.", "filename": "news_articles_cqly24qknkxo_1745639016.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/915d/live/5ae5d940-f811-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqly24qknkxo_1745639016.html", "title": "Gang who stole £1m worth of cars across West Yorkshire jailed", "title_page": "Gang who stole £1m worth of cars across West Yorkshire jailed  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Members of an organised crime group who stole more than £1m worth of cars and motorbikes from homes across West Yorkshire have been jailed.\nAccording to West Yorkshire Police, Ellis Ashley, Luke Linden, Reece Southern and Simon Hamilton targeted \"high value\" vehicles and threatened homeowners with weapons to make them hand over their keys.\nThe men were caught as part of Operation Hindland, which launched following an increase in motorbike and later car thefts in Bradford and Calderdale.\nAshley, Linden, Southern and Hamilton all pleaded guilty to conspiring to steal motor vehicles and handling stolen goods and were jailed at Bradford Crown Court on Friday.\nLinden, 22, of Albert Terrace, Bradford was sentenced to seven years for conspiracy to steal motor vehicles and conspiracy to handle stolen goods.\nSouthern, 24, of Collingham Avenue, Bradford was sentenced to six years and four months for conspiracy to steal motor vehicles and conspiracy to handle stolen goods.\nAshley, 19, of Lingdale Road, Bradford was sentenced to three years and 11 months for conspiracy to steal motor vehicles and conspiracy to handle stolen goods.\nHamilton, 18, of Lingdale Road, Bradford was sentenced to three years for conspiracy to steal motor vehicles and conspiracy to handle stolen goods.\nAs part of the operation, officers seized a significant number of phones and the evidence identified more than 70 offences as being linked to the group.\nOne vehicle was stolen from a vulnerable adult, who had a wheelchair in the boot.\nThe wheelchair was discarded from the vehicle after it was stolen.\nThis vehicle alongside others was recovered by police and returned, with other vehicles found abandoned or stripped down.\nDet Con Brooke Farrington, of Calderdale District Police said: \"What became clear throughout the investigation was the lack of consideration to the families they were stealing these vehicles from.\n\"I hope this serves as a reminder that we will continue to relentlessly pursue those involved in organised crime and bring them to justice.\"", "url": "https://www.bbc.co.uk/news/articles/cqly24qknkxo"}