{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:55", "date_modify": "2025-05-19 15:22:55", "date_publish": "2015-03-03 17:21:42", "description": "NHS staff have voted to accept a government pay offer, Unison has announced.", "filename": "news_health-31714249_1747668175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79669000/jpg/_79669259_docnurses.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_health-31714249_1747668175.html", "title": "Unison: NHS staff vote to accept pay deal", "title_page": "Unison: NHS staff vote to accept pay deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "NHS staff in England have voted to accept a government pay offer, Unison has announced.\nSome 67% of the union's members agreed to the deal despite the dispute over pay prompting the first NHS strike in 34 years.\nUnison leaders said although the offer did not go far enough it would make a difference - particularly to more than 250,000 of the lowest-paid in the NHS.\nNHS Employers said the move is likely to signal the end of industrial action.\nMinisters in England had initially awarded NHS staff a 1% increase, but only for those without automatic progression-in-the-job rises.\nAutomatic pay rises are given to about half of all staff. They are designed to reward professional development.\nBut an independent pay review board had said the 1% increase should be across the board.\nThe new offer would mean some people - particularly the lowest-paid members of the NHS - get more than a 1% pay rise - up to 5.6% next year. This would include some caterers, porters and administration staff.\nBut other workers on higher pay, including a number of experienced nurses and senior managers, would not stand to get the 1% pay rise. And for 2015-16 there would be a freeze on incremental rises in pay for higher-paid staff.\nUnison's head of health, Christina McAnea, said: \"Although it does not go far enough, it is an improvement and it will make a difference particularly to over 250,000 of the lowest-paid in the NHS.\n\"By ignoring the recommendations of the NHS Pay Review Body for England, the government forced health workers to take strike action over pay for the first time in 34 years.\n\"Their industrial action has forced the government to negotiate with us and sent a warning that NHS workers will not sit back and do nothing when their standard of living is attacked.\n\"We are calling on any government elected in May to develop a pay strategy that rewards health workers fairly for the demanding jobs they do, and ensures the NHS can continue to recruit and retain a high quality workforce.\"\nResponding to the ballot results, Danny Mortimer, chief executive of the NHS Employers organisation, said: \"It is now very likely these difficult months of NHS industrial action are over.\n\"This will be a huge relief for many patients, staff and health services.\n\"This is a clear signal that the NHS is entering a new phase where all parties must work together in partnership to ensure that the national pay system is sustainable for the future.\n\"Any solution will need to support better, safer and more responsive services to patients and more efficient use of NHS resources.\"\nIn the last few days, the Royal College of Midwives, the Royal Society of Radiographers and GMB announced ballot results that were in favour of accepting the offer. The Royal College of Nurses is yet to take a decision.\nFurther meetings between the unions are expected before a final decision is taken.", "url": "https://www.bbc.com/news/health-31714249"}