{"authors": ["Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 06:20:47", "date_modify": "2025-04-26 06:20:47", "date_publish": "2025-03-01 06:29:09", "description": "Naomi Long was speaking at Alliance's second annual conference since devolved government was restored.", "filename": "news_articles_c4gej05g5p1o_1745648447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6122/live/749f99d0-f6a8-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gej05g5p1o_1745648447.html", "title": "Alliance: ‘No pretence of respecting Trump’, says Long", "title_page": "Alliance: ‘No pretence of respecting Trump’, says Long - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of the Alliance Party has said she will \"make no pretence of respecting\" US president Donald Trump.\nNaomi Long told her party's annual conference in Belfast they were \"taking a stand\" by not attending the White House for St Patrick's Day events.\nBut she said Alliance would \"continue to engage\" with those in Washington DC who \"remain genuinely interested in Northern Ireland and its future\".\nLong said a \"window of opportunity\" exists to have \"serious dialogue\" about reforming Stormont's devolved institutions.\nThe Alliance conference this weekend is its second since Northern Ireland's devolved government was restored in February 2024 following a two-year collapse.\nThe Democratic Unionist Party (DUP) had blocked the institutions in protest at post-Brexit trade rules, but ended its boycott after a deal with the UK government.\nAlliance has two ministers in the four-party executive at Stormont, with Long serving as justice minister and Andrew Muir as agriculture minister.\nIn her conference speech, Long warned party members the power-sharing institutions remained at risk.\n\"Any one of the scandals and disputes over the last year could have upended the institutions, and who's to say that something in the coming year won't?\"\nThe Alliance leader has long argued for changes to voting procedures and to prevent any single party vetoing the establishment of the devolved institutions.\nLong said that with Stormont functioning and new UK and Irish governments in place, there was a \"crucial window of opportunity to have a serious dialogue about reform\".\nStormont parties and executive ministers usually travel to the US in March for engagements surrounding St Patrick's Day.\nBut this year Sinn Féin, Alliance and the Social Democratic and Labour Party (SDLP) have said they will not attend the White House's celebrations.\nIt follows criticism of Trump's stance on the Israel-Gaza conflict.\nDeputy First Minister Emma Little-Pengelly, a DUP assembly member, has said she will go to Washington DC.\nShe said it was important to \"maintain long and rewarding\" relationships with the US.\nAddressing her party conference, Long said that while others would go to the White House, Alliance was \"taking a stand and declining to do so\".\n\"To be clear, I respect the right of US citizens to elect whomever they wish as president,\" she said.\n\"I also respect the office of president. However, I do not and will make no pretence of respecting the current office-holder.\"\nBut the Alliance leader said her party colleague, assembly member Nuala McAllister, would be in Washington \"to discuss the issues of policing and institutional reform with interested parties\".", "url": "https://www.bbc.co.uk/news/articles/c4gej05g5p1o"}