{"authors": ["Cash Murphy", "www.facebook.com"], "date_download": "2025-04-26 07:07:37", "date_modify": "2025-04-26 07:07:37", "date_publish": "2025-02-28 06:03:42", "description": "Dame Jacqueline Wilson, 79, has written more than 100 books since her debut novel in 1969.", "filename": "news_articles_c5y002nl9zjo_1745651257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/970c/live/adab20c0-f5d4-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y002nl9zjo_1745651257.html", "title": "Jacqueline Wilson to guest edit BBC Radio Sussex and Surrey show", "title_page": "Jacqueline Wilson to guest edit BBC Radio Sussex and Surrey show - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Author Dame Jacqueline Wilsonbecame the latest guest editor for BBC Radio Sussex and BBC Radio Surrey.\nWilson, who has written more than 100 books, was born in Bath, Somerset, but now resides near Alfriston in East Sussex.\nThe 79-year-old was recently made a Dame Grand Cross of the Order of the British Empire last year for her services to literature.\nShe took control of an edition of the BBC Radio Sussex and BBC Radio Surrey mid-morning show on Friday.\nThe decorated writer had mixed success with about 40 books before her breakthrough to fame in 1991 with The Story of Tracy Beaker.\nFor her edition of the programme on Friday, she said she had chosen to focus on the conservation work being undertaken at Drusillas Park, fostering and the importance of reading aloud to children.\nThe author has won numerous awards including the Smarties Prize and the Guardian Children's Fiction Prize.\nShe was also the chancellor of the University of Roehampton for six years until August 2020, receiving an honorary doctorate in 2007.\nWilson has also received honorary degrees from the University of Winchester, University of Dundee, University of Bath and Kingston University.\nFor her lifetime contribution as a children's writer, she was also a UK nominee for the international Hans Christian Andersen Award in 2014.\nThe programme is available to listen to on BBC Sounds.", "url": "https://www.bbc.co.uk/news/articles/c5y002nl9zjo"}