{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 12:33:16", "date_modify": "2025-05-20 12:33:16", "date_publish": "2023-08-04 00:00:00", "description": "Craig Crouch was convicted of murder, and Jacob's mother Gemma Barton of causing or allowing the death.", "filename": "news_live_uk-england-66397830_1747744396.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9B22/production/_130641793_a39a2d49-6885-4cdb-b07b-f111664b6af7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_uk-england-66397830_1747744396.html", "title": "Jacob Crouch death: Stepfather jailed for minimum of 28 years for murder of baby", "title_page": "Jacob Crouch death: Stepfather jailed for minimum of 28 years for murder of baby - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This page is closing now\nSam Hancock\nLive reporter\nWe're going to end our live coverage there. If you want to read more about today's hearing - or the seven-week trial of Craig Crouch and Gemma Barton - we suggest heading to today's main news story as a starting point.\nA quick reminder of what happened today:\nJacob Crouch's stepfather Craig - convicted of the 10-month-old's murder - was jailed for life with a minimum term of 28 years\nJacob's mother Barton - convicted of allowing his death to happen - received a sentence of 10 years\nMr Justice Kerr, the judge, described Jacob as a \"happy, smiley, bubbly baby\", and said it was \"nothing less than tragic that he will never become a boy, and then a man\"\nOnce again, if you or someone you know needs help after reading this page, the details of organisations offering assistance can be found on the BBC Action Line website.\nThis page was edited by myself, Jamie Whitehead and James FitzGerald. It was written by Phil Mackie, Alex Homer, Adam Durbin, Gem O'Reilly, Andre Rhoden-Paul, Jacqueline Howard, Ben Morris and Anna Boyd - with video produced by James Harness.\nHappy family facade didn't raise suspicions\nPhil Mackie\nReporting from Derby Crown Court\nGemma Barton was very much a victim as well, in that she was a victim of coercive control from a man who didn't really allow her a say.\nCraig Couch was dominating, had his very set ways and was a bully. He imposed his rules on the house and physical discipline of Jacob.\nBut Crouch was actually described as an unlikely murderer because he had no previous convictions, he held down a steady job, wasn't a drug addict and didn't have a chaotic lifestyle.\nThe authorities simply didn't know what was going on because of the controlling relationship that Craig Crouch had with Gemma Barton.\nVarious family members had become estranged and they weren't in close contact with Jacob so they hadn't seen what was happening themselves.\nJacob's carers also put on this facade of being a happy family, posting videos, sharing content, that wouldn't have raised suspicions.\nCoercive control a very subtle form of domestic abuse - campaigner\nSharon Bryan, from the National Centre for Domestic Violence, says she doesn't \"think any of us can say that it won't happen again\", telling the BBC that coercive control in particular is a \"very subtle form of domestic abuse\".\nShe says \"sadly I don't think that we can stop it\" but we can try and make domestic abuse of any form \"socially unacceptable\" so that people start to report things when they see them or suspect them.\nPolice asked about child cruelty during lockdown\nDet Ch Ins Bullock is taking questions from the media now.\nAsked about increased risk of child cruelty for those born during lockdown, Bullock says there will be police inquires wherever this is the case.\n\"Hopefully this is the last one [we] will have to deal with,\" he says of Derbyshire Constabulary.\nOn his own team, Bullock says it's fair to say they're \"exhausted\". They've dealt with it all fantastically, he adds, and will continue to support one another as time goes on.\nWith that, he's thanked for his time and returns inside the court.\n'A dangerous individual can cause no further harm'\nDet Ch Ins Paul Bullock from Derbyshire Constabulary has just delivered an emotional statement saying: \"No sentence can bring Jacob back. I hope today brings the family some closure on what has been a horrific two-and-a-half years.\"\nBullock says his condolences are with the family and would like to ask for privacy \"for them during this time.\"\nHe added: \"I would like to thank those involved who helped to secure justice for Jacob and that has meant that a dangerous individual can cause no further harm.\"\nAbuse likely missed as Jacob was born during Covid, expert says\nJacob Crouch being born at the height of the pandemic may have led to him being missed by social services, a child safeguarding adviser has said.\nKelechi Ukandu describes him as \"unseen child\", who was not seen by social workers in person when many services were being held remotely.\nThis means if no specific concern for his safety was raised, then social services might never have had Jacob referred to them, she tells BBC News.\nUkandu also says Jacob's age made him particularly vulnerable, as at 10-months old he had no means of communicating the abuse he was being subjected to.\nBarton dabbed her eyes as sentence given\nAlex Homer\nReporting from Derby Crown Court\nGemma Barton was found guilty of causing or allowing the death of her son.\nAs the Judge passed sentence, she continued to dab her eyes and nose with a tissue as she cried, looking at her feet while she sat.\nThe Judge Mr Justice Kerr said he had to pass a longer jail term because Barton must have known Jacob Crouch suffered “prolonged and multiple incidents of serious cruelty which she ignored”.", "url": "https://www.bbc.com/news/live/uk-england-66397830"}