{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:45:22", "date_modify": "2025-04-26 03:45:22", "date_publish": "2025-03-05 06:20:30", "description": "The project will collaborate with young people to bring the physical collection to life online.", "filename": "news_articles_ckgdn7xv6qeo_1745639122.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7c58/live/a97380d0-f861-11ef-b75c-0ba717285eef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgdn7xv6qeo_1745639122.html", "title": "Fashion Museum Bath gets grant for online catalogue project", "title_page": "Fashion Museum Bath gets grant for online catalogue project - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Fashion Museum Bath has been awarded a grant to help it develop a new online catalogue project.\nThe museum closed in 2022 for a major refurbishment, and is not expected to reopen in its new home until 2030.\nArt Council England's £20,000 grant will help the venue create a searchable catalogue, in collaboration with the local library service.\nSophie McKinlay, Fashion Museum Bath project director, said the grant would help the team rethink how its collection can be experienced for future generations.\nThe collection at Fashion Museum Bath spans across four centuries of work, from 1600 to the modern era, and was moved in 2022 to Dents heritage glovemakers in Warminster while the new venue is developed, meaning there is only limited public access.\nYoung people will co-create the catalogue, along with Bath and North East Somerset Libraries, focussing initially on the Dress Of The Year exhibition.\nMs McKinlay added: \"We are excited to embark on this journey to create the museum's first searchable online catalogue starting with the Dress of the Year collection.\n\"By creating an online catalogue, we aim to set a new standard in cultural preservation and accessibility.\n\"It marks an exciting moment in our ambition to make Fashion Museum Bath accessible to all.\"\nCouncillor Paul Roper, Cabinet Member for Economic & Cultural Sustainable Development, said the council was \"delighted\" to get the grant, adding it will support creative jobs in the city.\nEmmie Kell, director of museums and Cultural Property at Arts Council England, said: \"This is great news for public access to one of the most important fashion collections in the country.\n\"As the Fashion Museum undergoes transformation, the digitisation of its archives will ensure ongoing public access to its unique Designated collections.\n\"I'm especially pleased to hear young people will be part of the process... a project sure to support the museum's next exciting chapter.\"", "url": "https://www.bbc.co.uk/news/articles/ckgdn7xv6qeo"}