{"authors": ["Ruth Lucas", "www.facebook.com"], "date_download": "2025-04-26 04:19:22", "date_modify": "2025-04-26 04:19:22", "date_publish": "2025-03-04 06:17:22", "description": "Two GP surgeries in Bracknell could be closed in the next five years as they are \"poorly located\".", "filename": "news_articles_cpde458jy5xo_1745641162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a4ae/live/c7d1c080-f827-11ef-a033-b58d3bfaf1a1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpde458jy5xo_1745641162.html", "title": "Bracknell GP surgeries could close due to 'poor locations'", "title_page": "Bracknell GP surgeries could close due to 'poor locations' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two GP surgeries could be closed in the next five years because they are poorly located and have \"limited ability to transform\", a care board has said.\nRepresentatives from NHS Frimley told Bracknell Forest councillors that the unnamed practices \"don't support the current or future model of care\".\nTherefore, they said they should be disposed of within the next five years.\nMeanwhile, three primary care practices have been identified as needed in the next five years, but potentially not needed in the long term, as the NHS' clinical model \"evolves\".\nThat leaves five buildings that will remain delivering primary care services for at least the next decade.\nIt comes as the Binfield Health and Community Centre opened last October.\nClinical lead for Bracknell, Dr Annabel Buxton, said the two surgeries recommended for closure had been identified as having \"limited ability to transform\".\nChairwoman of the commission, councillor Georgia Pickering, asked whether the new centre in Binfield had a full capacity of GPs yet.\nIn response, Dr Buxton, who is also a GP partner at The Waterfield Practice, said it was \"incredibly tricky\" for GP surgeries to recruit due to the funding streams system.\nMost recent data shows 53% of people in Bracknell Forest who booked a GP appointment got one on the same day.\nWhile 5% could book one for the next day, and 11% of people had to wait two to seven days.", "url": "https://www.bbc.co.uk/news/articles/cpde458jy5xo"}