{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:35:55", "date_modify": "2025-04-26 04:35:55", "date_publish": "2025-02-28 12:02:34", "description": "Friends of Bethnal Green Working Men's Club set up a crowdfunder to save the LGBT-friendly venue.", "filename": "news_articles_cm2nndg1gj3o_1745642155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02b0/live/25c79780-f5c3-11ef-97ab-abb74cabf06c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2nndg1gj3o_1745642155.html", "title": "Bethnal Green Working Men's Club: Crowdfunding campaign launched", "title_page": "Bethnal Green Working Men's Club: Crowdfunding campaign launched  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Friends of Bethnal Green Working Men's Club (FoBGWMC) have set up what they are calling a \"fighting fund\" as part of the next stage of a campaign to save the at-risk LGBT-friendly venue in east London.\nFoBGWMC said the fund would pay for a planning bid to persuade Tower Hamlets Council to save the club. About £7,000 has been raised, with the aim to raise £12,000 by 8 April.\nIn June 2024, the club was given a two-month eviction notice. Equity, the actor's union, then launched an online petition to halt plans to close the venue.\nEquity's Nick Keegan said the venue, where some scenes from Netflix's Baby Reindeer were filmed, was a \"crucial and irreplaceable fixture of London's cultural heritage\".\nMore than half of London's LGBTQ+ venues closed between 2006 and 2022, Greater London Authority data shows.\nBGWMC has functioned as a community-owned social club since 1973, with a history of shared ownership that goes back to 1888.\nFoBGWMC said the money from the crowdfunding campaign would pay for a full chartered survey and valuation of the building, as well as cover the planning application costs.\nIt added an extended target of £18,000 would allow the group to develop a robust business plan with financial projections and cover all consultancy and accountancy costs.\nThe aim is to build an investment case for one of two preferred outcomes: for Tower Hamlets Council to buy the club and then lease it back to FoBGWMC or for the council to allow FoBGWMC to purchase the club themselves.\nThe building is owned by a group called the Boro of Bethnal Green Working Men's Club.\nFoBGWMC said despite the ongoing success of the club, the group wanted to sell the building, with the proceeds shared between about 50 individuals, potentially ending 130 years of working-class community ownership.\nEquity's Mr Keegan added: \"A community purchase on this scale will be no small task.\n\"We believe it is essential to save this unique cultural facility and give it a chance to continue serving the local community of Tower Hamlets, the LGBTQ+ community, and the wider cultural tapestry of London for future generations.\"\nA spokesperson for Tower Hamlets Council said: \"The BGWMC is an important venue for our LGBTQIA+ community, especially at a time where there is a decline in LGBTQIA+ spaces across London.\n\"This is why the council has approved an application for the Bethnal Green Working Men's Club to be an asset of community value.\n\"We have not received notice of the owner's intention to sell the property and we are not aware of the building being marketed as 'for sale'. We have contacted the freeholder for further details, and about their obligation to inform us of any intention to sell.\"", "url": "https://www.bbc.co.uk/news/articles/cm2nndg1gj3o"}