{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:10", "date_modify": "2025-05-19 15:32:10", "date_publish": "2015-02-27 18:28:38", "description": "Tory MP David Davis accuses Sir Malcolm Rifkind's Intelligence and Security Committee of being taken in by the \"glamour\" of spying and failing to do its job properly.", "filename": "news_election-2015-31665312_1747668730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81300000/jpg/_81300470_81286311.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_election-2015-31665312_1747668730.html", "title": "UK spy watchdog 'taken in' by security agencies - MP", "title_page": "UK spy watchdog 'taken in' by security agencies - MP - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The committee monitoring the security services has been taken in by the \"glamour\" of spying and is failing to do its job, its founder has said.\nConservative MP David Davis said the Intelligence and Security Committee had been \"captured by the agencies they are supposed to be overseeing\".\nAnd ex-chairman Sir Malcolm Rifkind acted as a \"spokesman\" for MI5, MI6 and GCHQ rather than a watchdog.\nSir Malcolm said the criticisms were \"ludicrous\" and had no basis in fact.\nHe said Mr Davis had been \"captured\" by the civil liberties lobby.\nSir Malcolm was this week forced to step down as chairman of the committee after five years over \"cash-for-access\" claims.\nHe will carry on as a committee member until the election in May, when he will step down as an MP.\nThe Tory MP and Labour MP Jack Straw were secretly filmed apparently offering their services to a private firm for cash. Both deny wrongdoing.\nIn an interview for BBC Radio 4's Yesterday in Parliament, to be aired at 2330 on Friday, Mr Davis said members of the security services had told him privately that they \"have never taken the ISC seriously, saying 'well they only know what we tell them'\".\nHe said security committees around the world were prone to fall into the same trap as the ISC.\n\"What sort of people join an Intelligence and Security Committee? They approve of what the agencies are trying to do, as do most of us.\n\"But they are excited by it and they get taken in. It is a very glamorous world and they feel privileged to be inside it so there is a tendency to capture.\"\nBut he said it had not developed the teeth he had expected it to - and it too often acted as an apologist for the security services, citing the revelations by US whistleblower Edward Snowden about the extent of spying by CGHQ as an example.\nSir Malcolm \"found himself time and again justifying it, saying it is legal and they are acting within the law. Whether it is right or wrong, I don't even think he knew himself,\" said Mr Davis.\n\"He should be calling in the head of the agency and saying 'why wasn't I told about this?'\"\nHe also criticised the committee's report into the murder of Fusilier Lee Rigby, which said it could not have been prevented despite his killers appearing in seven intelligence investigations.\n\"It was really pretty clear a lot of mistakes were made and yet the ISC report ends up blaming the internet company,\" said the MP.\nAt the moment, the chairman is chosen by committee members who have been nominated by the prime minister.\nSir Malcolm said Mr Davis' accusations of \"capture\" were \"absurd\" and the committee, which is made of a cross-party group of MPs and peers, had gained considerable new powers under his chairmanship and was fully independent.\nHe told the BBC News website: \"Our job is to criticise the intelligence agencies when they do something wrong or stupid and we do.\n\"If the evidence says they are not responsible then we point that out too.\"\nIn the case of the Lee Rigby murder, he said the committee's report , externalcontained much criticism of the security agencies but the key piece of evidence that might have stopped the attack was an exchange on Facebook which the spies did not have access to.\nSir Malcolm said that the committee's powers had been beefed up by the 2013 Justice and Security Bill and the security services now had a legal obligation to provide material to the committee.\nIt could also \"examine their files in the middle of their own headquarters, which it had done at GCHQ, and also had the power to investigate operations, something it had been prevented from doing in the past.\nListen to the full interview with David Davis and Sir Malcolm Rifkind on Yesterday in Parliament at 2330 on BBC Radio 4.", "url": "https://www.bbc.com/news/election-2015-31665312"}