{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:33:21", "date_modify": "2025-04-26 07:33:21", "date_publish": "2025-02-27 16:13:40", "description": "Andrei Matei stole more than £19,000 from cash machines across England, court hears.", "filename": "news_articles_cly88jlyp9go_1745652801.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ffbd/live/b2ecb5e0-f524-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly88jlyp9go_1745652801.html", "title": "Man who stole money from cash machines across England jailed", "title_page": "Man who stole money from cash machines across England jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who stole money from hundreds of cash machines across England has been jailed for more than two years.\nAndrei Matei stole more than £19,000 by using a tool to jam cash dispensers open, West Yorkshire Police said, allowing him to take money from inside.\nThe 35-year-old Romanian national, of Failsworth, Greater Manchester, stole from more than 480 cash machines in locations including West Yorkshire, London, Wiltshire, Nottinghamshire and Berkshire, causing damage valued at £30,000.\nAppearing before Leeds Crown Court on Wednesday, Matei was sentenced to 27 months in prison after admitting 483 charges of theft and criminal damage.\nHe will also be deported once he has been released, the force said.\nThe investigation started in West Yorkshire, but officers from the Yorkshire and Humber Regional Organised Crime Unit later established Matei and an accomplice were also targeting cash machines further afield.\nMatei, of Oldham Road, was arrested in Nottinghamshire in September 2023, police said.\nDuring 2023, he targeted machines at supermarkets, garages and on shopping streets in Huddersfield, Bradford, Nottingham, Newbury, Salisbury, Bath, Bristol, Devizes, London and Stopsley.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/cly88jlyp9go"}