{"authors": ["Adrian Browne", "www.facebook.com"], "date_download": "2025-04-26 08:09:55", "date_modify": "2025-04-26 08:09:55", "date_publish": "2025-02-26 12:42:08", "description": "Keir Starmer's decision to boost defence at the expense of foreign aid under fire from charities.", "filename": "news_articles_cx2ey1g57lxo_1745654995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba05/live/9f7d7540-f438-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2ey1g57lxo_1745654995.html", "title": "Overseas aid cut to boost defence dereliction of duty, says charity", "title_page": "Overseas aid cut to boost defence dereliction of duty, says charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cutting international aid to boost defence spending is an \"absolute dereliction\" of duty, a charity promoting projects between Wales and Africa has said.\nPrime Minister Sir Keir Starmer is reallocating UK aid funds to boost military spending to 2.5% of national income by 2027.\nClaire O'Shea, head of partnership at Hub Cymru Africa, said that following \"devastating\" cuts to the US aid budget the United Kingdom is \"no longer contributing to some of the biggest global challenges\". Christian Aid in Wales said it worried about the \"human cost\" of the \"huge\" cut to UK foreign aid.\nBut Wales Office Minister Dame Nia Griffith said this was an \"unprecedented moment\" for Europe and the UK.\nThe aid budget will be cut from 0.5% to 0.3% of national income by 2027, with the UK spending £13.4bn more on defence every year from 2027.\nSir Keir heads to Washington later ahead of a meeting on Thursday with US President Donald Trump, who has long demanded European leaders increase their defence spending.\nThose leaders fear a Trump deal with Russia to end the Ukraine war could leave the continent vulnerable.\nMs O'Shea told BBC Radio Wales Breakfast \"I understand the need for national security but the aid budget should not be the first to get cut,\" calling Starmer's approach an \"absolute dereliction\" of duty.\n\"The news that the USA plan to cut their aid budget last week was devastating but to be followed up with news that the UK would also make cuts means the infrastructure and groups that usually support the work of charities from Wales has all but disappeared,\" she said.\n\"We've been concerned since 2021 when the first enormous cut came to the aid budget by the previous UK government.\"\n\"Since then groups have struggled to limp on and continue to do their work.\"\n\"At that point there was lots of research done which said women and girls suffered the most as a result of aid cuts so we expect to see that pattern continue.\"\n\"We know the aid budget goes to support really important projects so there is concern.\"\nHead of Christian Aid in Wales Mari McNeill told BBC Radio Cymru's Dros Frecwast that the prime's minister's decision was \"such disappointing news\".\n\"International aid is such an important way for us to support people who are facing some of the most intense crises in the world today, be it armed conflict, the effects of the climate crisis, hunger,\" he said.\n\"Aid is such an important way for us to show solidarity with our neighbours around the world.\n\"Our biggest concern is of course the human cost, the cut from 0.5% to 0.3% means around £6bn, and of course we don't know what the full extent of that decision will be - it's a huge amount.\"\nCharities' concerns were shared by a Welsh Labour MP, speaking on condition of anonymity.\n\"Whilst I understand the need to balance budgets it is difficult to watch overseas aid being cut significantly,\" they told BBC Wales.\n\"Cutting this financial lifeline will lead to the world becoming a more unsafe place as people in crisis, whether through poverty, persecution or war, will feel obliged to leave their home country to seek a better life.\n\"This will increase the numbers of migrants across the world.\n\"I accept that the government has pledged to increase it again but we have no clear timeframe for this.\"\nPlaid Cymru Cymru leader Rhun ap Iorwerth accepted there was a case for considering defence spending \"as the international context changes\" but \"as conflict, climate change, and extreme poverty become increasingly interconnected, offering people a lifeline in some of the most destitute conditions on earth is critical\", he said.\n\"Collective action of this kind can help promote peace internationally.\n\"First Trump bows to Putin, now Starmer bows to Trump. This dangerous domino effect will make the world even more unstable and we have a moral duty to condemn it.\"\nBut Dame Nia stressed the United Kingdom now found itself in an \"unprecedented moment, I think, if you look at the world geopolitical situation\".\n\"We have been facing not only a country that's been invaded in Europe, Ukraine, as we know for the past three years, we've also been facing many other types of attacks,\" she told Radio Wales.\n\"We had the Skripal attack on our own soil [the failed nerve agent attack on Sergei Skripal in Salisbury], we've had many unattributable attacks like the [undersea] cables being cut, internet warfare.\n\"We really have to make sure that we're in a position to deal with all of these threats.\n\"What I can say is that we are absolutely committed to getting back to that 0.7% of our national income to be spent on development.\"\nLabour promised in its manifesto for last year's UK general election to return aid spending to 0.7% of national income \"as soon as fiscal circumstances allow\".\nAdditional reporting by Bethan James", "url": "https://www.bbc.co.uk/news/articles/cx2ey1g57lxo"}