{"authors": ["Charles Heslett", "www.facebook.com"], "date_download": "2025-04-26 06:17:53", "date_modify": "2025-04-26 06:17:53", "date_publish": "2025-03-01 07:34:29", "description": "Police urge families in Bradford with large amounts of gold jewellery at home to review security.", "filename": "news_articles_clynny9me9wo_1745648273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1a9e/live/90465c10-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynny9me9wo_1745648273.html", "title": "Warning as high value gold burglaries in Bradford triple", "title_page": "Warning as high value gold burglaries in Bradford triple  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families in Bradford who keep large amounts of gold jewellery at home have been urged to review their security measures after a big rise in thefts.\nDet Ch Insp Mark Atkinson, head of Bradford district's Serious and Organised Crime division, issued the warning after over 60 households were targeted across the city in a seven-month period - more than triple the previous year's total.\nIn some cases, victims - who police said were mostly, but not exclusively, from the city's Asian communities - were threatened with knives and told to hand over valuables worth thousands of pounds.\nDet Ch Insp Atkinson said: \"The impact is devastating. Anybody coming into your house is a horrific thing to happen.\"\nDet Ch Insp Atkinson said the number had risen \"significantly\" from previous years.\n\"Gold prices are at an all-time high, and also there's a degree of deprivation in the area,\" he said.\n\"Criminals do want to get money from somewhere, and because of the gold prices I believe that's the key factor as to why it's being specifically targeted and taken.\"\nIn one burglary, the owner's gold was taken while diamonds were left behind, while in another raid between £30,000-£40,000 of gold was stolen, Det Ch Insp Atkinson explained.\n\"In the majority of the burglaries, the suspects are not confronting the families,\" he said.\n\"However, on one occasion there has been an incidence where the victims were threatened with knives.\"\nDet Ch Insp Atkinson said some families stored valuables in wardrobes and even in cardboard boxes, which he specifically warned against.\nHe also appealed to everyone with high value gold jewellery in their houses to \"look at their security measures\".\n\"Make sure the CCTV is working. If you've got a house alarm, make sure it's serviced and working,\" he said.\n\"We do hear of victims where the gold is kept in wardrobes. Please try to move it around the house and please try to hide jewellery or use more secure locations.\"", "url": "https://www.bbc.co.uk/news/articles/clynny9me9wo"}