{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:44", "date_modify": "2025-05-19 15:29:44", "date_publish": "2015-02-04 18:48:08", "description": "A man who lost his wife to suicide criticises the health authorities for discharging her from hospital early, despite her begging to stay.", "filename": "news_uk-northern-ireland-31135714_1747668584.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80790000/jpg/_80790929_michaelmcgeown.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31135714_1747668584.html", "title": "Fiona McGeown death: Widower angry over suicidal wife's care", "title_page": "Fiona McGeown death: Widower angry over suicidal wife's care - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A man who lost his wife to suicide has criticised the health authorities for discharging her from hospital early, despite her begging to stay.\nFiona McGeown, who had been suffering from depression, took her life in 2013.\nHer widower, Michael, said she was \"devastated\" when she was discharged from Holywell hospital in Antrim.\nHowever, the Northern Trust said Mrs McGeown's \"tragic death could not have been predicted at that time.\"\nThe trust offered its condolences to the family and said a review of Mrs McGeown's case had been undertaken.\n\"The panel concluded that Mrs McGeown received an overall good standard of care and a significant level of input from the service, and that her … tragic death could not have been predicted at that time,\" a spokesperson for the trust said.\nMr McGeown contacted the BBC after hearing that a national review of inpatient psychiatric care for adults across the UK is set to begin.\nHis said his wife of 23 years was once a \"vibrant, outgoing person\" who was always the \"life and soul\" of parties, but he described how she gradually became very withdrawn and socially isolated.\nMrs McGeown was diagnosed with depression at the age of 43, and was prescribed medication for her condition.\nHowever, at 45, she told her family she was suicidal and asked to be admitted to hospital for treatment. She was given a inpatient bed in a psychiatric ward at Holywell hospital.\n\"When she had been admitted to Holywell, they had said it would be a six to eight-week process, a programme of care, but after three weeks, Fiona got home leave for two days,\" Mr McGeown said.\nHe said that she took only one of the home leave days offered to her, because \"she felt she couldn't handle the two days\" away from the hospital.\n\"She was home on the Sunday and arrived back then on the Monday morning to the ward and was told she was being discharged.\"\n\"She started to come round a bit, she was having a bit of fun, smiling. She was responding very well to the programme of care provided. She was taking her medication on a regular basis - something that she wouldn't have done.\n\"She would have been prescribed anti-depressants for a number of years prior to her taking her own life, but when she was in the ward at Holywell she was responding very well and very happy to be there.\"\nMr McGeown said he was \"so angry \" that they were sending his wife home early and pleaded with medical staff, but added it was clear the decision had been made.\n\"On discharge, she seemed to lose all hope.\"\nMr McGeown added that life has been very difficult for both him and his son since his wife's death.", "url": "https://www.bbc.com/news/uk-northern-ireland-31135714"}