{"authors": ["Joe Locker", "www.facebook.com"], "date_download": "2025-04-26 08:16:42", "date_modify": "2025-04-26 08:16:42", "date_publish": "2025-02-26 10:32:10", "description": "It is hoped the charge would raise more than £1m to reinvest in making the city more attractive.", "filename": "news_articles_cm2y7pn4y0ro_1745655402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7afe/live/9e9a6d70-f426-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2y7pn4y0ro_1745655402.html", "title": "Vote on Nottingham tourist tax delayed", "title_page": "Vote on Nottingham tourist tax delayed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vote on introducing a form of tourist tax on hotel stays in Nottingham has been delayed again.\nIn July last year, city councillors formally supported the plan by the city's Business Improvement District (BID) organisation to introduce a nightly £2 levy on providers of accommodation in the city.\nLevies are typically added to customer's bills and it is anticipated it could help bring in an extra £1.7m a year to the city's economy.\nBID members, made up of the retail, hospitality and leisure sectors, were due to vote on the plans in September and again in February but this has now been delayed until near the end of the year \"for further consultation\".\nDirect tourist taxes are used in some popular destinations abroad but they are not currently permitted by law in the UK.\nHowever, some UK cities including Manchester, Liverpool and Bournemouth, have utilised a legal workaround to introduce such a charge.\nAccording to the Local Democracy Reporting Service, the workaround is achieved through the creation of an \"Accommodation BID\", which has been proposed by the city's BID.\nBIDs are non-profit organisations designed to encourage investment in the local economy. The Nottingham version, called It's In Nottingham, brings in about £1.14m annually from a levy on members.\nThe body is also currently seeking a new five-year term from members and the city council.\nA BID spokesperson explained the delay, and said: \"This will enable the shadow board to fully understand the economic landscape for the proposed term and to allow for further consultation on the proposal.\n\"The delay will also enable Nottingham BID Company Ltd who have overseen the proposal to complete consultation with its members and gain endorsement of a new five-year strategic business plan.\"\nIt anticipated the vote will be \"within the fourth quarter of 2025\" and it was confirmed the levy still had a planned introduction date of January 2026.", "url": "https://www.bbc.co.uk/news/articles/cm2y7pn4y0ro"}