{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:17", "date_modify": "2025-05-19 14:23:17", "date_publish": "2015-03-12 14:29:38", "description": "Voters across Israel share their views on who they want to see in power - and who they want kept out - ahead of the general election.", "filename": "news_world-middle-east-31762003_1747664597.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81596000/jpg/_81596635_cynthiacohen.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31762003_1747664597.html", "title": "Israel election: What do voters want?", "title_page": "Israel election: What do voters want? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The voters of Israel go to the polls on 17 March in an election which will decide the next prime minister.\nIncumbent Benjamin Netanyahu, head of the right-wing Likud party, faces a tough challenge from the centre and left. Whatever the outcome, the next government - like the current one - is expected to be formed by an alliance of the nation's many parties.\nThe BBC News website has heard from a range of voters on who they want to see in power - and who they want kept out.\nLast time I voted for Likud and I have been disappointed. I fail to understand why he [Benjamin Netanyahu] failed to exploit the potential for demilitarising Gaza after the summer war - a bit of a sore point for people like me who are just waiting for the next hail of rockets.\nLikud and [the Zionist Union's] Tzipi Livni and Isaac Herzog are close. Forming a government will be more difficult than last time, many parties are refusing to join a government with other parties.\nI would love for Yesh Atid and Yair Lapid to win. I feel like they attempted a lot of good work in the last government and have sensible economic, educational, and health policies. Failing that, and because it is unrealistic, I would hope for a strong centrist government: too left and decisions with bad security consequences might happen, too right and peace is shelved with associated international relationship problems.\nMost of last summer we, including my three children, were running for safety several times a day. Strangely, my experiences of living \"under fire\" have made me swing to the left as opposed to the right, which understandably has happened to a lot of people. I look at my children, growing up under rocket fire, and then the heart-rending images from Gaza and I refuse to give up hope for peace, however hostile the conditions for it may be.\nThe result will probably be a stalemate, with an unfortunately more right-wing influence.\nI would have liked a government much further to the left than at present, but I've never got the party I wanted!\nI'm not sure Likud will stay in power.\nPersonally, I don't believe in Benjamin Netanyahu, everything is just posture and a balancing act with his allies.\nIf the government becomes more right-wing it will be distanced from the outside world. With that and an ultra-religious demographic, Israel is becoming even more unrealistic in its viewpoint.\nIt's always lived in a bubble, distanced from the outside, but up to now there's always been a realistic influence on it.\nIf talks are renewed with the Palestinians and were more conciliatory, we would get back to the more optimistic attitudes we had, for example, around the time of [Egyptian President Anwar] Sadat. The government would then be more practical about finding a solution.\nIt is my first election as an Israeli citizen and I plan to vote for Naftali Bennett's Jewish Home party.\nI don't agree with all his policies but I want the next coalition to be more right-wing and believe that this election boils down to a clear choice between left, Zionist Union, and right, Jewish Home, as to who sits in the government with Likud.\nIt would be one of the political surprises of our generation if Likud is not in power in the next parliament.\nColleagues and friends seem to be voting for other parties because they have an \"anyone but Netanyahu\" attitude.\nThe Israeli public believe that the grass is greener on the other side but sometimes change for change's sake is not for the best.\nI am used to electioneering in the UK, but this specific election has been one where all parties have been guilty of negative campaigning.\nIt has got out of hand now and has actually turned people off politics, which is sad as there is a lot to do here socially, economically and of course the resolving of the Palestinian issue.\nI'm an Arab from Israel. I think the right-wing will win the elections again but with some differences from previous years.\nSome people may vote for other right-wing parties because in their eyes Benjamin Netanyahu's security policies have failed. Those who agree with his security attitude may vote for more leftist parties because of economic and social aspects.\nI think more Arabs will vote in this election compared to previous years as a result of the union of parties representing them, but I think the right-wing will win with less votes for the Likud party and the opposition will be stronger.\nThe Israeli people will quit voting for the right-wing when they see how bad the situation is and disconnect from security fear via positive experiences with Palestinians and other Arabs and Muslims.\nIf another right-wing party is voted in maybe there would be some small changes in the economy, but if the left-wing rules, Israeli-Palestinian relations will be better, Israel will be accepted more by Western countries, there will be fewer attacks from Palestinians towards Israelis, less racism from Jews towards Arabs, a better economy and more prosperity.\nI think we'll have a change of government and Yitzhak Herzog and Tzipi Livni will oust Netanyahu. I hope Herzog and Livni can form a strong coalition and bring about much needed change.\nI'd like a return to a centre-left government.\nOur national security issues won't change dramatically unless the Palestinians also choose to pursue peace.\nWe live under continuous stress with the threat of wars and terrorist attacks and I hope more than anything for a government that can bring us calm and security.\nI think we need to strengthen our core and build more within the [pre-1967 armistice] Green Line - settlement expansions cost us diplomatically, and financially, and I'm not a supporter of such policies.\nI hope there'll be a move towards a better socio-economic climate here. Far too many people are living in, or on the edge of poverty. The cost of living is extortionate and average salaries are very low.\nI'd like a government who can show the West just how amazing our tiny country is.\nWritten by Richard Irvine-Brown", "url": "https://www.bbc.com/news/world-middle-east-31762003"}