{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:22", "date_modify": "2025-05-19 15:34:22", "date_publish": "2017-07-04 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across the North East on Tuesday 4 July 2017.", "filename": "news_live_uk-england-tyne-40462779_1747668862.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-tyne-40462779_1747668862.html", "title": "BBC Local Live: Updates from North East England on Tuesday 4 July 2017", "title_page": "BBC Local Live: Updates from North East England on Tuesday 4 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nThat's all for today - thank you for joining us.\nTo keep up with what's happening overnight, head to BBC Tees, BBC Newcastle, Look North, and online.\nYou can tweet your photos to @BBCNewsNE, external, email them, or contact us via our Facebook page, external.\nWe'll be back tomorrow from 08:00. Have a great evening.\nMP calls for tougher restrictions on drone use\nDrones could cause a \"catastrophic incident\" by flying too close to planes unless tougher regulations are brought in, Middlesbrough MP Andy McDonald has warned.\nMr McDonald, who is Labour's shadow transport secretary, accused ministers of failing to tackle the threat caused by drones, describing a sharp increase in near misses with 33 incidents in the first five months of the year.\nTop pilots warned over the potential danger after flights were disrupted on Sunday when a drone flew too close to Gatwick Airport.\nMr McDonald said: \"With the proliferation of drones in recent years, we have also seen a sharp increase in the number of near misses with planes.\n\"Latest figures show there were 33 such incidents confirmed in the first five months of this year and 70 last year, whereas there were only 29 in 2015 and just 10 the five years before that.\n\"Those in the aviation industry have expressed their concern over the Government's failure to bring in legislation to tackle this worrying trend.\"\nThe government said it would look at the legislation surrounding the use of drones.\nMP calls for more locally-trained GPs\nMore needs to be done to recruit and retain GPs in the North East, a Labour MP has told the House of Commons.\nHoughton and Sunderland South's Bridget Phillipson, said her constituency is suffering a particular difficulty in retaining trained doctors.\nShe said: \"In recent years the number of family doctors in Sunderland has plummeted.\n\"All the evidence shows that doctors are more likely to stay in the areas where they have trained.\"\nShe called on the government to fund new medical places in the city.\nHealth Minister Steve Brine said the government was already funding training for increasing numbers of medics, including those in the North East.\nHe said since 2016, 10 newly-qualified GPs had been recruited through a scheme based in Sunderland.\nExtra cash to tackle potholes\nCounty council bosses in Northumberland have pledged an extra £500,000 to tackle potholes.\nThe authority said the cash was on top of £20m already being spent on the problem.\nThe county's five local councils are each being allocated £100,000 to spend on the worst affected routes.\nA county council spokesman said: “Keeping our 3,000 miles of roads in good condition is a priority for us and this scheme is an excellent way for local areas to identify key locations for improvement.\n“Local councillors know their own roads extremely well and where the issues are, and we are committed to more decision making at a local level.\n“The scheme will ensure areas of concern are being flagged and long-standing issues with potholes and road surfaces corrected in a timely manner.”\nBanker's £14m claim against Ashley was just 'drink banter'\nNewcastle United owner Mike Ashley has accused investment banker Jeffrey Blue (pictured) of using \"drink banter\" as evidence he is owed £14m.\nLawyers for Mr Ashley have described Mr Blue's claim as an \"opportunistic try-on\".\nAnd in a writtent statement Mr Ashley has told the High Court: \"I can't believe that (Mr Blue) is now trying to take me for £14m off the back of some drink banter that he is seeking to engineer into something more.\"\nMr Ashley's barrister David Cavender QC, told the High Court: \"The claim appears to have been issued on the basis that the threat of negative press alone would compel Mr Ashley to settle.\n\"In truth, there was no purported agreement and Mr Blue could not have thought so at the time.\"\nMr Cavender said Mr Ashley \"fairly\" said he could not recall details of conversations in the Horse & Groom \"particularly in the light of the amount of drinking\".\n\"He does recall 'that there was a lot of banter and bravado',\" said Mr Cavender.\n\"He does not recall any discussion about whether Mr Blue would be paid a sum of money if the share price reached #8 a share.\"\nMr Cavender added: \"He says if there was 'it would have been obvious that he was joking'.\"\nThe court has already been told that Mr Ashley would \"nap under the table\" during \"boring meetings\" at the pub.\nThe hearing continues.\nDrones used to crack crime on troubled estate\nCleveland Police has turned to drones in an effort to crack down on crime and anti-social behaviour on a Middlesbrough estate.\nThe force said since the technology was introduced as a trial last month, it had already helped deal with public order offences, criminal damage and in the arrest of a man suspected of assaulting a police officer on the town's Grover Hill estate.\nOfficers trained to pilot drones are also working with Cleveland Fire Brigade and social housing providers, a force spokesman said.\nHe added: \"We have had some great successes so far.\n“Residents should be assured we will continue this operation as long as necessary and that they should continue to report concerns to us so that we can take action.\n“Using the drone is an extremely valuable additional tool in our on-going fight against crime.\n\"Criminals should be aware we have been watching them and they could expect us to knock on their door to speak to them about their activity.\"\nAll commercial use of drones is covered by guidelines from the Civil Aviation Authority, external and organisations must register drones of a certain size with the regulator.\nShot man was victim of 'targeted attack'\nA man was beaten with baseballs bats by a gang before being shot in the leg in what police have described as a \"targeted attack\" in Middlesbrough.\nFour men are being hunted after the victim was set upon close to an industrial estate in the town's Murdock Road just before 09:00.\nThe man, in his 40s, was taken to the James Cook University Hospital, although his injuries are not thought to be life threatening.\nA Cleveland Police spokesman said the four attackers got out of a blue Volkswagon Golf car which had \"distinctive\" silver wing mirrors and damaged a white Mercedes before turning on the man.\nThe Voilkswagon was later found burnt out in woods near Saltburn.\nDet Ch Insp Steve Young said: “We are in the very early stages of this inquiry, however, indications so far suggest that this was a targeted incident.\n\"There will be increased patrols in the area whilst the investigation continues and anyone with information is urged to contact police.”\nAshley lawyers accuse banker of 'making up evidence'\nAn investment banker suing Newcastle United owner Mike Ashley over an alleged unpaid bill of £14m has been accused of making up evidence.\nJeffrey Blue (pictured right) says Mr Ashley, who also runs Sports Direct, promised to pay him £15m if he boosted the company's share price - but was only paid £1m.\nThe High Court was told the deal was allegedly struck in a London pub called the Horse & Groom in 2013.\nMr Blue came under attack from Mr Ashley's lawyers as he gave evidence during the second day of the hearing.\nBarrister David Cavender QC, who is leading Mr Ashley's legal team, accused Mr Blue of \"making up evidence\".\nMr Ashley, who is due to give evidence on Wednesday, watched from the back of the court as Mr Blue was questioned by Mr Cavender.\nEarlier the court was told that Mr Ashley once hosted a management meeting at the same pub, where he drank 12 pints and vomited into a fireplace.\nThe hearing continues.\nFlorian Lejeune 'very happy' with move to Newcastle\nParis-born Florian Lejeune has said he is 'very happy' with his move to Tyneside.\nThe centre-half is the second player to move to St. James’ Park this summer, following the permanent arrival of winger Christian Atsu in May.\nLejeune began his career with the Centre de Formation de Paris, before spending time with Racing Club de France, Beziers, Sete and Adge.\nHe said: “I’m very happy to have signed. Newcastle United is a big club, and I’m very happy to be here.\n“When you have a manager like Rafa Benitez who wants you, you are very happy to come. Since I’ve been in touch with the manager, it was an easy decision for me to come here.”\nBenitez added: “I would like to welcome Florian to Newcastle United. He is a player that has done very well this year in Spain. I have known about him for a while, since he began playing for Villarreal.\n\"He has progressed a lot as a player in the last few years and I know he will give us something different at the back - he is good with both feet, he's big and he's good in the air also.\n\"If he settles well into English football then I am sure he will be a success and will give us a lot of competition in this area.”", "url": "https://www.bbc.com/news/live/uk-england-tyne-40462779"}