{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:16", "date_modify": "2025-05-19 14:23:16", "date_publish": "2015-03-14 15:12:22", "description": "Israelis vote in the second snap election in two years on 17 March, and polls indicate that rightwing Prime Minister Benjamin Netanyahu's Likud party is facing a serious challenge from the centre-left Zionist Union.", "filename": "news_world-middle-east-31815481_1747664596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81550000/jpg/_81550052_81550051.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31815481_1747664596.html", "title": "Israel election: Who are the key candidates?", "title_page": "Israel election: Who are the key candidates? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Israelis vote in the second snap election in two years on 17 March, and polls indicate that right-wing Prime Minister Benjamin Netanyahu's Likud party is facing a serious challenge from the centre-left Zionist Union.\nBut Israel's proportional representation electoral system means that several other parties will enter the Knesset parliament, and the larger of them will be vital in deciding who forms the next government.\nBenjamin Netanyahu is a veteran of Israeli politics who has led Likud twice - in 1993-99, and since 2005.\nHe has been prime minister at the head of a series of coalitions of various colours since 2009, having served a previous term in 1996-99, and has also held several other senior ministerial posts.\nHe has a reputation for negotiating the volatile party system with skill, but his best efforts failed to maintain a stable parliamentary majority in the Knesset elected in 2013.\nHis broad coalition collapsed in late 2014, prompting the March elections, and for the first time in years he faces a real danger of losing office to an alliance of centre-left parties.\nBorn in 1949 into a prominent right-wing political family, Mr Netanyahu spent part of his early life in the United States.\nThat is where he acquired the fluent English that made him a leading international spokesman for Israel in the 1980s, culminating in his appointment as ambassador to Washington.\n\"Bibi\", as he is known, has a strong following in Likud, based on his impressive electoral record and his hawkish stance on Iran and the question of a settlement with the Palestinians.\nBut these qualities, combined with his forceful personality, nationalist rhetoric and association with economic liberalism, also make him a divisive figure little liked on the left.\nJust as Mr Netanyahu is a product of a conservative political family, so is Yitzhak Herzog a scion of a centre-left Labour Party dynasty.\nHis father Chaim was president of Israel for 10 years, and his uncle Abba Eban was the country's high-profile foreign minister in the 1960s and early 1970s.\nHe won the Labour Party leadership election in 2013, and is currently leader of the opposition in parliament and co-leader of the centre-left Zionist Union electoral alliance.\nBorn in 1960 and a lawyer by profession, Mr Herzog served in various middle-ranking ministerial positions between 2005 and 2011, when Labour left the Likud-led coalition.\n\"Bougie\", as Mr Herzog is known, has continued Labour's traditional opposition to Likud's economic polices, accusing the government of depressing Israeli living standards, but has also campaigned aggressively against Mr Netanyahu's foreign policy and alleged neglect of the Palestinian issue.\nHe has highlighted the fact that he was a major in an elite military intelligence unit after Mr Netanyahu - a former special forces officer - accused him of being \"soft\" on security.\nThe Zionist Union - whose name was chosen to reinforce the alliance's nationalist credentials - has been running neck-and-neck with or slightly ahead of Likud in the most recent opinion polls.\nMs Livni, who was born in 1958, followed in his footsteps, moving steadily from the 'dovish' wing of Likud to her current position as leader of the liberal Hatnua party.\nShe supported Prime Minister Ariel Sharon's policy of withdrawal from Gaza in 2005, following him out of Likud into the centrist Kadima party, serving as foreign minister before becoming party leader ahead of the 2009 election.\nAlthough Kadima won the most seats, socially-liberal Ms Livni refused to accept the coalition terms demanded by Jewish religious parties and went into opposition.\nShe later lost the party leadership, and formed Hatnua in protest at what she saw as Kadima's move to the right.\nShe is a prominent advocate of seeking more cooperation with the Palestinian Authority and Israel's Arab community, and lost her job as Mr Netanyahu's justice minister in 2014 over a range of policy disagreements.\nShe is one of the few mainstream Israeli leaders to speak out openly in favour of gay rights, and is well-regarded in European, US and, albeit mutedly, many Arab diplomatic circles for her record of pragmatism as foreign minister.\nCharismatic journalist and broadcaster Yair Lapid also has politics in the family, as his father and fellow-newsman Yosef \"Tommy\" Lapid led the firmly secular and relatively hawkish Shinui party from nowhere into government, then back into oblivion in the mid-2000s.\nYair Lapid, born in 1963, formed a similar party - Yesh Atid - from scratch in 2012, and scored a striking success in the following year's election with 19 seats and the post of finance minister in Benjamin Netanyahu's government.\nTense relations with his boss and poor ratings for his performance as minister plagued his time in office, which ended when Mr Netanyahu sacked him along with Ms Livni in 2014.\nBut a vigorous election campaign, in which he has accused the prime minister of \"leading Israel into unnecessary elections\", looks like ensuring that Yesh Atid will have a smaller but still significant number of seats in the next Knesset and make life difficult for Mr Netanyahu.\nThe religious party Jewish Home looks set to keep something like its 12 Knesset seats.\nIts leader, Naftali Bennett, is a charismatic and eloquent software entrepreneur who balances economic liberalism with a pro-settler stance, and has largely pushed aside the more secular Yisrael Beitenu of Foreign Minister Avigdor Lieberman.\nBorn in 1972 to US immigrants, Mr Bennett is the outgoing minister of the economy.\nLike many politicians competing for the same right-wing constituency as Benjamin Netanyahu, Mr Bennett objects to the prime minister's political pragmatism and even accuses him of planning a coalition with the Zionist Union.\nBut in the next Knesset he, like Mr Lieberman, would almost certainly join any Likud-led government.\nBBC Monitoring, external reports and analyses news from TV, radio, web and print media around the world. You can follow BBC Monitoring on Twitter , externaland Facebook, external.", "url": "https://www.bbc.com/news/world-middle-east-31815481"}