{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:28", "date_modify": "2025-05-19 15:22:28", "date_publish": "2015-02-27 21:37:26", "description": "Greek PM Alexis Tsipras denies his country will need a third international bailout, and vows to \"start working hard\" to change the country.", "filename": "news_world-europe-31668779_1747668148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81302000/jpg/_81302645_81302644.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31668779_1747668148.html", "title": "Greece debt: PM Alexis Tsipras rules out third bailout", "title_page": "Greece debt: PM Alexis Tsipras rules out third bailout - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Greece will not need a third international debt bailout when its current programme ends in four months, the country's prime minister has said.\nAlexis Tsipras vowed his government would \"start working hard\" to change the country, which is saddled with a debt 175% of its GDP.\nGreece has already received two bailouts since 2010, totalling 240bn euros (£188bn; $272bn).\nGermany's parliament ratified a four-month extension on Friday.\nWhile some MPs had expressed doubts about the deal and there was substantial public scepticism in the EU's leading economic power, the vote passed easily.\nParliaments in all 19 eurozone states must approve the extension for it to be granted, but Germany's vote is seen as significant because of its key role as a creditor nation.\nReacting to the Bundestag vote, Mr Tsipras told the Euronews TV channel: \"The German parliament gave Europe a vote of confidence today.\n\"Europe has now recognised that Greece has turned a new page... We start working hard, in order to change Greece within a Europe that changes direction.\"\nIn order to secure the extension his government, a coalition of anti-austerity parties led by the radical left-wing Syriza alliance, pledged to raise revenue by cracking down on tax evasion and reviewing government spending.\nAt the same time, Mr Tsipras is committed to easing the hardship endured by Greeks, many of whom have seen their standard of living plummet since the financial crisis of 2008.\nHe told the cabinet in Athens that the government's first bill on Monday would be aimed at addressing what he called the \"humanitarian crisis\".\nMeasures to be tabled, he said, would include supplying free electricity to poor families, as well as housing for 30,000 people and debt relief for some individuals and companies.\nSeveral cars were set alight and shops and banks were damaged.\nEven if the bailout extension is ratified by the entire eurozone, Greece still faces the formidable task of trying to service its debt obligations.\nIt will need to flesh out its reform programme in detail by April and prove that reforms are bedding in before receiving a final disbursement of 7.2bn euros.\nIn the meantime, it has to repay several billion euros in maturing debts, including about 2bn euros to the IMF in March. Some 6.7bn in ECB bonds is due to mature in July and August.\nGreek Finance Minister Yanis Varoufakis suggested in an interview broadcast on Friday that his negotiating team had been deliberately vague in order to clinch the bailout extension.\n\"We're proud of the degree of ambiguity,\" he told Antenna TV in a pre-recorded TV interview. \"I'm using a term here, creative ambiguity.\"\nSuspicion about the Greek government's intentions persists in Germany despite approval for the bailout extension.\n\"Look at Tsipras, look at Varoufakis: would you buy a used car from them?\" Klaus-Peter Willsch, a dissident MP from Chancellor Angela Merkel's conservative bloc, said in parliament.", "url": "https://www.bbc.com/news/world-europe-31668779"}