{"authors": ["Tess De La Mare", "www.facebook.com"], "date_download": "2025-04-26 06:31:13", "date_modify": "2025-04-26 06:31:13", "date_publish": "2025-02-27 09:46:21", "description": "The cost of the Drop and Go and the Short Stay and Pick Up car park is rising.", "filename": "news_articles_cx204vzr8vjo_1745649073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22bf/live/12edac80-f4ec-11ef-ae0a-4bca4f518eb0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx204vzr8vjo_1745649073.html", "title": "Bristol Airport announces changes to parking fees for second year", "title_page": "Bristol Airport announces changes to parking fees for second year - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Charges for two airport car parks are set to increase next month.\nThe price of a 10-minute stay at Bristol Airport's Drop and Go car park and a 30-minute stop in the Short Stay and Pick Up car park will both rise from £6 to £7 on 3 March.\nThe airport said the increase was necessary to cover the increasing costs of National Insurance rates for employers.\nAirport bosses said the extra charge would also cut traffic by encouraging passengers to use public transport.\nThe move represents a year-on-year hike for those who use the car parks, as charges increased from £5 to £6 in 2024.\nDrop and Go is the highest generator of car traffic, the airport said, resulting in four journeys for those dropping off and picking up, rather than two if customers use public transport or drive themselves.\nThose dropping off or collecting a passenger with a disability will still be able to use the Drop and Go car park for up to 40 minutes for £7 by scanning their blue badge at the exit barrier.\nBristol Airport added that there is a free one-hour car park by the entrance to the Silver Zone to the south of the site, with a free shuttle bus to connect passengers to the terminal.\nIt added that it has several long-stay parking options and hosts a number of meet and greet services.\nThe airport is due to open a new £60m public transport interchange and car park is part of upgrade works intended to expand its capacity to 12m passengers a year.", "url": "https://www.bbc.co.uk/news/articles/cx204vzr8vjo"}