{"authors": ["Hannah Richardson", "www.facebook.com"], "date_download": "2025-04-26 08:10:54", "date_modify": "2025-04-26 08:10:54", "date_publish": "2025-02-26 12:12:07", "description": "A network of air raid shelters and tunnels were found during the demolition of two school buildings.", "filename": "news_articles_cp3ywpv6vq0o_1745655054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7112/live/709367c0-f434-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3ywpv6vq0o_1745655054.html", "title": "Historic find delayed building of new Leicester homes", "title_page": "Historic find delayed building of new Leicester homes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An unexpected historic find delayed work to replace two former Leicester city schools with new homes.\nThe demolition of the Newry and Southfield schools in Eyres Monsell began in late 2022 to make way for new council housing when a network of air raid shelters and tunnels were discovered beneath the site.\nTwo years on from the discovery, Leicester City Council said construction work for the 53 new properties would restart this week and added the finds had been removed.\nThe Local Democracy Reporting Service (LDRS) said the project, funded through the council's housing revenue account and Right to Buy receipts, would cost about £16m and take 16 months to complete.\nA council spokesperson said the air raid shelters and tunnels needed to be recorded \"for historical purposes\" before they could be removed.\nAdditional work was also required to \"backfill the voids\" and make them ready for construction.\nThey added \"more detailed design work\" was necessary before the contract could go to tender, the spokesperson said.\nThis has now all been completed and construction company GEDA was appointed to carry out the build of the new homes.\nThe development will comprise 44 houses and nine flats, all of which will be for social rent.\nThe project has long been touted as one of the necessary steps to address the city's housing crisis.\nAccess to the site will be via The Newry, rather than the existing access off Southfield Drive. This is because of the one-way restriction on Southfield Drive.\nElly Cutkelvin, assistant city mayor for housing, said: \"The redevelopment of the vacant and disused Newry and Southfield school sites for new housing represents an important step in our wider strategy to address the housing crisis in the city.\n\"I'm pleased that construction work is now able to get under way on this complex and exciting project.\"", "url": "https://www.bbc.co.uk/news/articles/cp3ywpv6vq0o"}