{"authors": ["Conor O'Grady", "www.facebook.com"], "date_download": "2025-04-26 07:06:06", "date_modify": "2025-04-26 07:06:06", "date_publish": "2025-02-28 06:18:53", "description": "The council says the work is part of its responsibility to ensure visitors are safe.", "filename": "news_articles_cj4n8j24z89o_1745651166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dc96/live/e177d860-f455-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n8j24z89o_1745651166.html", "title": "Gravestones deemed 'unsafe' during cemetery checks", "title_page": "Amber Valley: Gravestones deemed 'unsafe' during cemetery checks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dozens of gravestones in part of Derbyshire have been deemed unsafe by council staff.\nOfficers from Amber Valley Borough Council placed yellow signs behind graves during routine safety checks of cemeteries it operates.\nOfficials said the move was part of the council's \"ongoing responsibility to ensure the safety of visitors\", although the upkeep of the graves was the responsibility of relatives of the deceased.\nA council spokesperson said: \"Please be assured that every effort will be made to carry out these checks with the utmost care and respect.\"\nDozens of graves at Ripley Cemetery have had markers placed next to them.\nOther sites the council operates are Alfreton Cemetery, Leabrooks Cemetery, Belper Cemetery, Heanor Cemetery and Croshill Cemetery.\nThe spokesperson added where officers had deemed a headstone or memorial to be potentially unsafe, \"they will, as a matter of public health and safety, temporarily stabilise it if possible, or lay it flat to prevent accident or injury\".\nThe labels that are placed next to the memorials include the council's contact details so grave owners are able to get more advice.\nIndependent cemetery experts believe the problem is most common due to a lack of dowelling on construction, or the use of unsuitable foundations.\nJulie Dunk, chief executive of the Institute of Cemetery and Crematorium Management, added: \"Placing a notice is probably the best option, as people visiting the grave will notice that there is a problem. Hopefully there will be contact details that they will call and get the proper information.\n\"The only way to tell that a headstone is unsafe is to inspect it. That would involve a visual inspection, and then do a gentle hand test.\n\"That's where you apply pressure to the apex to the memorial. If that memorial moves, then that is deemed as unsafe.\"", "url": "https://www.bbc.co.uk/news/articles/cj4n8j24z89o"}