{"authors": ["Tom MacDougall", "www.facebook.com"], "date_download": "2025-04-26 03:54:40", "date_modify": "2025-04-26 03:54:40", "date_publish": "2025-03-04 17:10:00", "description": "Gary Swift secures a 3-1 win in his classification group at the World Championship in Thailand.", "filename": "news_articles_clynxz91yv8o_1745639680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/decd/live/c4f15bc0-f9ba-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynxz91yv8o_1745639680.html", "title": "Sheffield disability snooker champion brings back gold", "title_page": "Sheffield disability snooker champion brings back gold - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A snooker star from Sheffield has claimed the top spot in the first World Disability Snooker Championship.\nGary Swift, who has used a wheelchair since he was 14, represented Great Britain at the contest in Nonthaburi, Thailand.\nHe secured a 3-1 victory against Thailand's Numpol Thongpusawan in the Group 1 final.\nReturning home after 40 hours of travelling, Swift said he was \"tired but feeling great\".\nThere was rivalry between the two finalists, as opponent Thongpusawan had scored a 3-1 win of his own against Swift during the group stages.\nEach had then secured 3-0 wins against their opponents in the semi-finals, before meeting again for the title-deciding match, which would last more than six hours.\nThongpusawan initially took the lead by winning the first frame, putting Swift on the back foot.\nBut he was able to turn the tables, taking the following three frames and sinking the last pink to be crowned champion.\n\"I had to dig in deep and fight, but I came back well,\" he said.\n\"It's every player's dream when they turn professional to win a world championship, and no-one's ever won a world championship from Sheffield.\"", "url": "https://www.bbc.co.uk/news/articles/clynxz91yv8o"}