{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 03:47:48", "date_modify": "2025-04-26 03:47:48", "date_publish": "2025-03-04 17:53:32", "description": "A law firm representing affected families calls for a new investigation into the 1973 disaster.", "filename": "news_articles_c62zggp068zo_1745639268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4397/live/175b3780-f918-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zggp068zo_1745639268.html", "title": "Fresh bid for Summerland fire inquest submitted", "title_page": "Isle of Man: Fresh bid for Summerland fire inquest submitted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A formal application for a fresh inquest into the deaths of 50 people in the 1973 Summerland fire disaster has been submitted to the Isle of Man's Attorney General.\nThe Justice for Summerland Group, made up of survivors and relatives of victims, has previously called for the original misadventure verdicts to be overturned.\nBelfast-based human rights law firm Phoenix Law, representing the families, said it wanted to reopen the case to \"ensure a comprehensive investigation\" using \"modern legal and forensic standards\".\nThe Isle of Man government said the Attorney General's Chambers can confirm that an application has been received and will be given appropriate consideration.\nAbout 3,000 people were at the Summerland entertainment complex, which at the time was one of the biggest indoor leisure complexes in Europe, when a blaze broke out on the evening of 2 August 1973,\nIt was thought to have been started by three boys from Liverpool smoking.\nA public inquiry held in the aftermath found there were \"no villains\" and only human beings who made mistakes.\nHowever, making its application, Phoenix Law said there had been an \"irregularity of proceedings in the original inquest\" which had not commented on or addressed \"substantial issues\" including the cause of the fire.\nThe firm said there was \"substantial fresh evidence which was not heard at the original inquest or commission which call into question the central conclusions\", suggesting the forensic analysis of the time was now \"unreliable\".", "url": "https://www.bbc.co.uk/news/articles/c62zggp068zo"}