{"authors": ["Greig Watson", "www.facebook.com"], "date_download": "2025-04-26 07:59:39", "date_modify": "2025-04-26 07:59:39", "date_publish": "2025-02-25 11:27:30", "description": "The incident took place in the early hours of the morning and led to roads in the campus being closed.", "filename": "news_articles_c99nyxjgr8mo_1745654379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e5c/live/20b9d520-f369-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99nyxjgr8mo_1745654379.html", "title": "Nottingham student, 18, dies after e-bike incident on campus", "title_page": "Nottingham student, 18, dies after e-bike incident on campus - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An 18-year-old woman who suffered serious injuries in a road traffic incident at the University of Nottingham has died.\nThe student, who was riding an electric bicycle, was injured while on the University Park Campus in the early hours of Tuesday morning, police said.\nShe was taken to hospital but was pronounced dead a short time later.\nThe victim's parents have been informed, officers confirmed, but no more details of the circumstances of the incident have been released.\nDet Sgt Paul Clark said: \"Officers will remain at the scene for much of the day as we work to understand the sequence of events that led to this young woman's tragic and untimely death.\n\"As that work continues, our thoughts are with her family at this very difficult time.\"\nA University of Nottingham spokesperson said: \"It is with great sadness that we confirm the death of one of our students on University Park Campus in the early hours of Tuesday morning in a road traffic incident.\n\"This is a deeply upsetting time, and all of our thoughts are with friends, family, and loved ones.\n\"We will continue to provide support to our community as we process the weight of this loss.\"", "url": "https://www.bbc.co.uk/news/articles/c99nyxjgr8mo"}