{"authors": ["Sarah Spina-Matthews", "www.facebook.com"], "date_download": "2025-04-26 04:40:20", "date_modify": "2025-04-26 04:40:20", "date_publish": "2025-03-02 07:30:51", "description": "An ex-road deaths investigator says her old job prepared her to support others in high-stress jobs.", "filename": "news_articles_c62zzqdm98zo_1745642420.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/84a2/live/bd290f90-f5e7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzqdm98zo_1745642420.html", "title": "York woman switches police career for stress workshops", "title_page": "York woman switches police career for stress workshops - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The retired head of a police force's road deaths investigation unit has said her experiences in that tough job now helped her to support others working in high-stress environments.\nFormer North Yorkshire Police inspector Zoe Billings said in her old role, she and her colleagues regularly saw things \"you don't ever want to see\".\nToday, as a private consultant whose clients include the NHS and America's FBI, Ms Billings - who also has a doctorate in biology - runs workshops aiming to help people gain resilience by teaching them \"the biology of chronic stress\".\nShe said: \"People that have a duty of care over others often struggle to look after themselves. You've got to look after yourself.\"\nMs Billings told BBC Radio York that as a road deaths investigator for North Yorkshire Police, \"we all had a job that got to us\".\n\"You rely on your colleagues, and if you needed a cry, you had a cry,\" she explained.\n\"It was surprising to people that cops do cry and that stuff does get to them.\"\nBut Ms Billings said while that role had at times proved \"incredibly traumatic\", it was also very rewarding.\n\"You do end up carrying people who are deceased. You do end up attending post-mortems. But you also help give families answers.\"\n\"You're never on the clock. If the family needs to speak to you, we've got the time for it.\"\nShe recalled one particular case where she had helped secure a conviction against a lorry driver who had hit and killed a cyclist.\n\"We were able to give the widow some closure and actually get justice done,\" she said.\n\"[The widow] said if it wasn't for me she wouldn't be here. Hearing that, it makes the hairs on the back of your neck stand up.\"\nMs Billings added: \"I've always liked being able to help people in difficult times.\"\nThe former inspector said she began applying her biological knowledge to her work while still on the North Yorkshire force, running courses for colleagues examining the \"biology of stress\".\nAfter retiring, she and fellow former North Yorkshire Police officer Mark Pannone co-founded a consultancy as a way to keep helping people.\n\"We're both driven by making a positive difference for people,\" she said.\nMs Billings believed her experience on the front line of policing had helped her relate to her clients.\n\"I've taught this to some fairly robust Yorkshire folk, and when I tell them, 'I'm going teach you about breathing', they roll their eyes,\" she said.\n\"But when we teach the science behind it, they go, 'OK, I'll have a go at that'. If you understand the 'why', you'll do it.\"\nHowever, Ms Billings said she still had to be careful to look after herself, too.\nNow living on what she described as \"effectively a private nature reserve\" near York, she said the process of regenerating several acres of land had been vital to her own wellbeing.\n\"Nature is not only good for restoring your mental health, it's good for actually proactively helping prepare you and enabling you to deal with more stress in the future,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c62zzqdm98zo"}