{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 06:34:59", "date_modify": "2025-04-26 06:34:59", "date_publish": "2025-02-27 06:18:13", "description": "An innovative planting method will be used to create the forest in an area as big as a tennis court.", "filename": "news_articles_crrd0029ep4o_1745649299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/229a/live/2c610880-f373-11ef-80a6-edca8054bafc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd0029ep4o_1745649299.html", "title": "'Tiny forest' with 600 trees to be planted in Loughborough park", "title_page": "'Tiny forest' with 600 trees to be planted in Loughborough park - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new 'tiny forest' is set to be created in a park in Loughborough using an innovative planting method.\nUp to 600 native trees will be planted in an area of Jubilee Park the size of a tennis court.\nThe scheme will use a woodland management and establishment technique called the Miyawaki method and aims to \"connect\" residents with nature.\nThe method was developed in the 1970s by Japanese botanist Dr Akira Miyawaki, who found planting different species close together helped to establish new dense woodland quickly, without the use of chemicals or fertilisers.\nA community planting event, organised by environmental charity Earthwatch, will be held at the park on Wednesday, 5 March at 10:00 GMT.\nThe project is being overseen by Charnwood Borough Council and paid for through the local authority treescapes fund from the Forestry Commission.\nAnne Gray, Charnwood Borough Council's lead member for waste, open spaces and leisure facilities, said: \"We're delighted to bring a Tiny Forest to Jubilee Park, which will provide a fantastic space for the community to connect with nature, learn about the environment, and enjoy the benefits of green spaces.\n\"This project not only helps tackle the effects of climate change but also creates a haven for wildlife and a valuable resource for local residents.\n\"We're excited to see the community come together to plant and nurture this new woodland, leaving a positive legacy for generations to come.\"", "url": "https://www.bbc.co.uk/news/articles/crrd0029ep4o"}