{"authors": ["Guy Henderson", "www.facebook.com"], "date_download": "2025-04-26 07:59:58", "date_modify": "2025-04-26 07:59:58", "date_publish": "2025-02-25 11:02:22", "description": "The plan's opponents say the illuminated blue sign is part of Brixton Theatre's identity.", "filename": "news_articles_c86pwy84wxpo_1745654398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea3a/live/619f5170-f2b8-11ef-8db0-bbc7a4fcf665.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pwy84wxpo_1745654398.html", "title": "Plan to remove Devon theatre sign causes controversy", "title_page": "Plan to remove Devon theatre sign causes controversy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A plan to remove an illuminated sign from a Devon theatre has caused controversy.\nTorbay Council had proposed removing the Brixham Theatre sign on the building at Bolton Cross, which doubles as a council chamber, and replacing it with a simple Town Hall sign instead.\nOne person commented online that removing the sign could be a \"death sentence\" for the theatre, adding: \"People won't go to see shows if they don't know where the theatre is\".\nThe council, which owns the building, said it only wanted to change the sign that faces New Road, where the entrance is mainly used for the town hall - an approach it described as \"balanced and fair\".\nAll 45 comments on the application which have been posted on Torbay Council's planning portal website were against the change while a social media campaign has also been set up.\nAnother commenter on the council's website said: \"The theatre is just making a comeback after Covid! PLEASE don't take this away from Brixham!\".\nTorbay Council said the theatre's trustees had the option to use their own sign on the section of the building mainly occupied by the theatre, which faces Market Street.\nThe council said the proposal respected \"both the needs of the town hall and the theatre while maintaining clarity for residents and visitors\".", "url": "https://www.bbc.co.uk/news/articles/c86pwy84wxpo"}