{"authors": ["James Gregory", "www.facebook.com"], "date_download": "2025-04-26 03:58:18", "date_modify": "2025-04-26 03:58:18", "date_publish": "2025-03-04 13:13:25", "description": "The BBC removed the programme after it emerged the 13-year-old narrator was the son of a Hamas official.", "filename": "news_articles_cwynrn0g0lko_1745639898.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/629c/live/fe8bb100-f8ed-11ef-aa9e-0529c5c73157.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynrn0g0lko_1745639898.html", "title": "'I lost trust' in Gaza film, says BBC director general Tim Davie", "title_page": "'I lost trust' in Gaza film, says BBC director general Tim Davie - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The BBC's director general told MPs he decided to pull a documentary from iPlayer about children's lives in Gaza because he \"lost trust\" in it.\nThe BBC has already apologised over \"serious flaws\" in the making of Gaza: How to Survive a War Zone, after it emerged its 13-year-old narrator was the son of a Hamas official.\nTim Davie said he removed the film while concerns raised about the boy's connections to Hamas - which is proscribed as a terrorist organisation in the UK - were investigated.\nThe independent company behind the film has said it asked if the boy had any Hamas connections but none were disclosed. The BBC has also said the corporation should have done more to uncover the link.\nDavie said on Tuesday the BBC had received about 500 complaints that the film was biased against Israel and another 1,800 over its removal from iPlayer.\nHoyo Films, the independent company that made the documentary for the BBC, has said it is \"cooperating fully\" with the BBC to \"help understand where mistakes have been made\".\nThe initial internal review by the BBC found Hoyo had paid a member of the boy's family \"a limited sum of money for the narration\".\nConcerns were raised when it aired last month because it centred on a boy called Abdullah - who it later transpired is the son of Hamas's deputy minister of agriculture.\n\"There were specific concerns – specific questions – about the father of the boy. And as we dug into it, we found out we were not told,\" Davie told the Culture, Media and Sport select committee on Tuesday.\n\"There is a lot of frustration and disappointment. We're very sorry to the audience,\" he said.\nDavie continued: \"If you're asked a number of times [about the boy's family] and that question was not answered [by Hoyo Films]... that is basics.\n\"And at the end of the day, as editor in chief, I have to be secure, not only editorially where the film was at, but the making of that film.\n\"And at that point, quite quickly, I lost trust in that film and therefore I took decision to take it off iPlayer while we do this deep dive.\"\nHe said the decision had \"nothing to do with one side or the other\" in the Israel-Gaza conflict, adding that the corporation did not \"bow to lobbies\".\nDavie said Hoyo Films had written to the BBC to say that no money had been given to Hamas but a \"forensic analysis\" would be taking place into what happened.\n\"As I understand it today, the BBC has only made one payment to the programme maker to make the film,\" he said.\nAsked whether the documentary could return to iPlayer following the conclusion of the investigation, the director general said he was not \"ruling anything out\".\nHe explained that it was a \"very difficult decision\" and a \"very hard situation\" for the BBC to find itself in.\n\"There was absolutely legitimate journalism to be done and the voices of those children in Gaza is absolutely something we need to hear - that's what makes it frankly frustrating where we are.\"\nHe said the broadcaster had a \"rich and important current affairs history\" in the Middle East and the documentary maker had a \"great reputation\".\n\"Overall, I am proud of the way we're covering some of these polarised, fiendishly difficult events where many of our journalists, as you know, are under enormous pressure, ferocious lobbying, and it's been extremely difficult,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cwynrn0g0lko"}