{"authors": ["Glenn Campbell", "www.facebook.com"], "date_download": "2025-05-19 15:38:09", "date_modify": "2025-05-19 15:38:09", "date_publish": "2015-02-06 11:33:53", "description": "US families of Lockerbie bombing victims accuse some UK relatives of pursuing a \"disgraceful\" campaign to clear the man convicted of the atrocity.", "filename": "news_uk-scotland-south-scotland-31164653_1747669089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80828000/jpg/_80828840_hi009836941.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-south-scotland-31164653_1747669089.html", "title": "Lockerbie bombing: Campaign to clear Megrahi 'disgraceful'", "title_page": "Lockerbie bombing: Campaign to clear Megrahi 'disgraceful' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "US families of Lockerbie bombing victims have accused some UK relatives of a \"disgraceful\" campaign to clear the only man convicted of the atrocity.\nDr Jim Swire, who lost his daughter Flora, and some other UK relatives believe Abdelbaset al-Megrahi suffered a miscarriage of justice.\nThey want the Scottish Criminal Cases Review Commission to send his case back to the High Court for a fresh appeal.\nUS relatives have written a letter, external saying they do not support the move.\nThe Libyan agent was jailed in 2001 for murdering the 270 people who died when Pan AM flight 103 exploded over southern Scotland on 21 December 1988.\nHe dropped a second appeal against his conviction days before the Scottish government released him on compassionate grounds in August 2009.\nMegrahi died from cancer three years later.\nA posthumous appeal is possible if it is deemed to serve the \"interests of justice\" and is sought by someone with a \"legitimate interest\" in the case.\nDr Swire's application was made jointly with members of Megrahi's family, including someone named as the executor of his estate.\nThe Megrahi family would be expected to qualify to request an appeal.\nThe SCCRC was proceeding on that basis but became convinced that the application was only \"actively supported\" by victims' families.\nNever before has a murder conviction been appealed in these circumstances.\nIn December, the commission asked the High Court to decide if Dr Swire and other UK relatives had a \"legitimate interest\" to pursue the case.\nThe judge, Lady Dorrian, has asked interested parties to make submissions to the court before the matter is considered at a hearing in March.\nIt is not clear if US relatives will make legal representations but their letter to the SCCRC sets out their opposition to a fresh appeal.", "url": "https://www.bbc.com/news/uk-scotland-south-scotland-31164653"}