{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 04:41:46", "date_modify": "2025-04-26 04:41:46", "date_publish": "2025-03-02 07:05:46", "description": "A round-up of stories from local newspapers and the BBC from the past week in the West of England.", "filename": "news_articles_c1mn5n8vxllo_1745642506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9fd6/live/604aa9c0-f5e0-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mn5n8vxllo_1745642506.html", "title": "Fatal XL bully attack and school closure", "title_page": "West of England headlines: Fatal XL bully attack and school closure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Here's our weekly roundup of stories from across local websites in the West of England.\nWe have a daily round up as well. Make sure you look out for it on the website and the local section of the BBC News app.\nKasha Sanderson, 39, of Wick, Bristol, appeared at Maidstone Magistrates' Court this week after 13 firearms, including a submachine gun, and 13 rounds of ammunition were seized from a vehicle at Dover, external.\nEight of ten trees in Weston-super-Mare have had to be removed due to vandalism, the Weston Mercury has reported, external. Planted in 2023, the trees were picked specifically as they would thrive in a coastal location, but now council officers are looking to replace them.\nMeanwhile, one Cheltenham Town FC fan truly captured the chaos, external of a late comeback goal on Tuesday evening when they grabbed the club's pitch-side \"fan cam\" to film a wild celebration.\nAnd a part of St Pauls, in central Bristol, was completely closed, external for three days for filming. While it is not confirmed what was being filmed, the same area was previously used for scenes in Young Sherlock.\nFinally, a woman in Somerset, external was banned from keeping animals for ten years after moving home and leaving her cats alone to starve. Jodie Louise Davey, of Mariners Close, Bridgwater, was also sentenced to 12 weeks custody, suspended for 18 months.", "url": "https://www.bbc.co.uk/news/articles/c1mn5n8vxllo"}