{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 04:37:57", "date_modify": "2025-04-26 04:37:57", "date_publish": "2025-02-28 10:49:19", "description": "New signs are installed around Port St Mary to remind motorists of the newly introduced limits.", "filename": "news_articles_c9q44x31wnzo_1745642277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d722/live/639352a0-f5c0-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q44x31wnzo_1745642277.html", "title": "Port St Mary becomes first village to see more 20mph speed limits", "title_page": "Port St Mary becomes first village to see more 20mph speed limits - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A southern village has become the first on the Isle of Man to introduce a 20mph (32km/h) speed limit on all residential roads, ahead of a further roll out of the scheme.\nThe Department of Infrastructure (DOI) has installed new signs in Port St Mary to signal the shift, with changes set to be introduced in Douglas and Onchan next.\nThe department said the measure reflected a commitment made by Tynwald in 2023 for all Manx towns and villages to be 20mph (32km/h) zones.\nThe move also addressed calls for limits to be reduced on roads near to local primary school Scoill Phurt le Moirrey, the DOI said.\nInfrastructure Minister Michelle Haywood welcomed the change on the road past the school, which previously had no safety zone, but said changes through the rest of the village were likely to be \"marginal\" as traffic averaged just above the new limit.\n\"Although slower traffic may reduce the number of wing mirrors that get smashed into,\" she added.\nJuan Watterson SHK, who previously called for restrictions around the school, said while it might not seem like the biggest priority to the people of Port St Mary who were \"still struggling to get the high street fixed\", the village has had issues \"where cars have been going too fast and putting kids in danger\".\nThe need for motorists to take extra care in the area had \"very much been at the forefront of teacher and parents' minds\", he added.", "url": "https://www.bbc.co.uk/news/articles/c9q44x31wnzo"}