{"authors": ["Eleanor Maslin", "Jake Zuckerman", "www.facebook.com"], "date_download": "2025-04-26 06:26:49", "date_modify": "2025-04-26 06:26:49", "date_publish": "2025-02-28 19:41:48", "description": "Defence Secretary John Healey says he supports the continuation of the Red Arrows.", "filename": "news_articles_c1d4r5n9dzgo_1745648809.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f14/live/40d8cb70-f5ff-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4r5n9dzgo_1745648809.html", "title": "Red Arrows future not under threat, says defence secretary", "title_page": "Red Arrows future not under threat, says defence secretary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Defence Secretary John Healey has said there is \"no threat\" to the future of the Red Arrows.\nSpeaking at RAF Waddington on Friday, he made clear his support for the Royal Air Force Aerobatic Team.\nHealey said: \"It's a proud British institution, it trains some of the best pilots in the world and sets standards for other air forces.\n\"There is no threat to the Red Arrows, we want them to fly for the future and continue to set new standards.\"\nThe jets, based at RAF Waddington in Lincolnshire, cost almost £80,000 a day to run and their future was raised by Conservative MP Ben Obese-Jecty in Parliament last month.\nChancellor Rachel Reeves, who accompanied Healey on the visit, was asked about plans to increase defence spending to 2.5% of national income by 2027.\nReeves said: \"The world has changed and we can see that before our eyes. With the threats that we see within Europe means we need to up what we spend on defence.\"\nEarlier this month, Maria Eagle, the Minister for Defence Procurement, stated the Red Arrows' Hawk T1 aircraft would go out of service in March 2030 and the annual cost to maintain the aircraft was £27.7m.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c1d4r5n9dzgo"}