{"authors": ["Jude Winter", "www.facebook.com"], "date_download": "2025-04-26 04:06:24", "date_modify": "2025-04-26 04:06:24", "date_publish": "2025-03-03 16:42:17", "description": "Taylor Green, 22, was found unresponsive outside an industrial unit in Tuxford on Tuesday.", "filename": "news_articles_cr42z9r1vg7o_1745640384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a21/live/4b8d9e70-f84c-11ef-b5bf-275f2ed479cc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr42z9r1vg7o_1745640384.html", "title": "Tuxford: Five further arrests after man dies at scene of burglary", "title_page": "Tuxford: Five further arrests after man dies at scene of burglary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A further five people have been arrested after a man was found dead at the scene of a reported aggravated burglary.\nPolice were called to Lodge Lane, Tuxford, Nottinghamshire, shortly after 22:40 GMT on Tuesday, where 22-year-old Taylor Green was found unresponsive outside and was pronounced dead a short time later.\nOfficers said they have now arrested three men, aged 24, 26 and 43, on suspicion of aggravated burglary and two women, aged 23 and 24, on suspicion of assisting an offender.\nAll five people remain in custody, said police.\nOn Tuesday, police said a 24-year-old man and 21-year-old woman were arrested on suspicion of murder as part of the investigation.\nThe 24-year-old man has now been released on conditional police bail, and the 21-year-old woman was previously released without charge, said police.\nDet Insp Clare Gibson, who is leading the inquiry, said: \"Following the events of Tuesday night, the investigation team have been working to understand the sequence of events which led to Mr Green's death.\n\"We believe this was an isolated incident and are still appealing for any additional information that may help our inquiry.\"", "url": "https://www.bbc.co.uk/news/articles/cr42z9r1vg7o"}