{"authors": ["Lucy Vladev", "Catriona Aitken", "www.facebook.com"], "date_download": "2025-04-26 03:51:11", "date_modify": "2025-04-26 03:51:11", "date_publish": "2025-03-05 12:04:25", "description": "Nerys Bethan Lloyd pleads guilty to gross negligence manslaughter after four paddleboard deaths.", "filename": "news_articles_c241vmzm6gmo_1745639471.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/00d7/live/29bb6170-f9a9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c241vmzm6gmo_1745639471.html", "title": "Nerys Lloyd: Ex-paddleboard firm owner admits manslaughter", "title_page": "Nerys Lloyd: Ex-paddleboard firm owner admits manslaughter - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A paddleboard tour company owner has admitted to gross negligence manslaughter after the deaths of four people.\nPaul O'Dwyer, Andrea Powell, Morgan Rogers and Nicola Wheatley drowned while paddleboarding in \"extremely hazardous conditions\" on the River Cleddau, Haverfordwest, Pembrokeshire, in October 2021.\nNerys Bethan Lloyd, 39, an ex-police officer from Port Talbot, is the former owner of Salty Dog, the now-dissolved company operating the tour that the four, and four others who survived, were on.\nIt was revealed she did not have the correct qualifications to run the tour.\nAt Swansea Crown Court on Wednesday, she also pleaded guilty to one offence under the Health and Safety at Work Act.\nFollowing the plea hearing, the Crown Prosecution Service (CPS) said the paddleboard tour on 30 October 2021 occurred despite \"heavy flooding and severe weather warnings\" being in place.\nIt added \"the river was running fast and the weir was in an extremely hazardous condition\", and three of the participants became trapped after being pulled over the top of the Haverfordwest Town Weir.\nMr O'Dwyer, who was an instructor on the tour, initially exited the river safely, but then re-entered the water in an attempt to rescue the others.\nThe four victims died due to drowning.\nThe CPS added Lloyd did not have a suitable qualification, and her planning and supervision was inadequate, with the prosecution following a joint investigation by Dyfed-Powys Police and the Health and Safety Executive (HSE).\nLisa Rose, specialist prosecutor with the CPS special crime division, added it was \"an avoidable tragedy\".\n\"Despite going to check the state of the river before departing on the tour, Nerys Lloyd failed to inspect the weir,\" she said.\n\"The majority of participants had limited experience, and Lloyd was not qualified to take paddleboarders out in such hazardous conditions.\n\"There was no safety briefing or formal risk assessments, and the participants were not advised that they would be traversing a weir or instructed on options to get out of the water.\"", "url": "https://www.bbc.co.uk/news/articles/c241vmzm6gmo"}