{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 06:39:00", "date_modify": "2025-04-26 06:39:00", "date_publish": "2025-03-02 16:50:46", "description": "Participants lifted the equivalent weight of 37 air ambulances and learnt lifesaving CPR skills.", "filename": "news_articles_c1jp5rn32kdo_1745649540.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5661/live/163925a0-f76b-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jp5rn32kdo_1745649540.html", "title": "Gloucestershire gym raises £1k for Great Western Air Ambulance", "title_page": "Gloucestershire gym raises £1k for Great Western Air Ambulance - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of fitness enthusiasts have raised £1,000 for a lifesaving charity by lifting the equivalent weight of 37 air ambulances.\nMembers of CrossFit Paratus in Gloucester lifted 118,700lbs (53,835kg) to thank Great Western Air Ambulance for funding a public access defibrillator installed outside their gym.\nParticipants also cycled, rowed or skied the equivalent of 80 rugby pitches (37,795ft or 11,520m), while learning CPR and how to use the defibrillator to save a life.\nIt comes after gym co-owners Dan Smart and Sarah Blandford's elderly parents joined the CrossFit sessions and they wanted to implement extra precautions.\nThe pair said they wanted to ensure as many people as possible knew how to use the defibrillator in the event of an emergency.\n\"My parents are both in their 70s and, when they started doing CrossFit with us, we knew there was an importance to have something nearby,\" said Ms Blandford.\n\"What we do is high intensity, so we wanted to make sure we're protected if anything does happen, but hopefully we never need to use it.\"\nCrossFit workouts typically consist of functional movements such as rowing, running, cycling, with added elements including gymnastics or weightlifting.\nThe oldest participant to take part in the challenge was Ms Blandford's father Dave, aged 76, with the youngest being just five-years-old.\nMs Blandford explained the gym runs an over-50s fitness class, but emphasised that a cardiac arrest could can happen to anyone.\nIn the UK, cardiac arrest kills 12 fit and healthy young people aged between 14 and 35 every week, according to the Great Western Air Ambulance Charity (GWAAC).\nIf a defibrillator is used within the first three to five minutes to restore a normal heartbeat, survival rates jump from 6% to 74%.", "url": "https://www.bbc.co.uk/news/articles/c1jp5rn32kdo"}