{"authors": ["Eleanor Lawson", "Shyamantha Asokan", "www.facebook.com"], "date_download": "2025-04-26 07:51:42", "date_modify": "2025-04-26 07:51:42", "date_publish": "2025-02-25 14:56:21", "description": "Alexander Westwood, who appeared in Netflix series Sex Education, is described as predatory.", "filename": "news_articles_cx2rmn0ww33o_1745653902.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/491c/live/08aa23c0-f361-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2rmn0ww33o_1745653902.html", "title": "Actor Alexander Westwood who raped teen in acting classes jailed", "title_page": "Actor Alexander Westwood who raped teen in acting classes jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An actor who appeared in Netflix series Sex Education has been jailed for sex offences, including raping a schoolgirl who came to him for acting lessons.\nAlexander Westwood was convicted of 26 crimes against children and two pupils who attended his acting tuition, with one child being targeted over eight years.\nThe 24-year-old, of Shropshire, was described in court as \"manipulative and predatory\" and jurors were told his repeated offending against five victims was \"a habit, a lifestyle\".\nSentencing Westwood to 15 and a half years custody at Wolverhampton Crown Court, Judge Neil Chawla said he used his minor celebrity status to prey on impressionable, innocent, young girls.\nWestwood, who also appeared in the BBC's Doctors series, smirked in the dock as details of his behaviour were read out.\nHe was found guilty in December of sexual offences against a young child, a boy aged between nine and 10, two teenage girls who came to him for help with acting and a woman.\nThe judge said his \"campaign of sexual offending\" had \"devastating consequences for the five victims\" adding the actor had displayed a \"seemingly nonchalant attitude\" that bordered on \"arrogance\".\nWarning: Some people may find details in this story distressing.\nWestwood's abuse of his youngest victim started when she was six years old and he was 10, with prosecutor Andrew Wallace saying it led to years of \"the normalisation of sexual abuse\".\nBetween November 2020 and September 2021, Westwood, from Albrighton raped and sexually assaulted an acting student who had lessons with him, as well as inciting her to engage in sexual activity.\nShe was made to strip while doing a monologue by Ophelia from Hamlet, the court heard.\nHe also talked to the girl about a sex scene from the 1991 film Frankie and Johnny and a masturbation scene from Bridgerton.\nThe actor would touch her and touch himself, and he raped her, Mr Wallace said.\nHe added Westwood had threatened to go to the principal of the Birmingham drama school the girl wanted to attend, if she stopped her acting lessons with him.\nHe made her sign a contract and said she would owe him as much as £18,000 or £36,000 if she broke it.\nHis abuse of the second teenager overlapped, occurring between May and August 2021.\nShe was forced to act out \"inappropriate\" scripts, including a Greek incest scene and Westwood made her strip, touching her breasts and vagina.\nShe said she felt \"disgusted\".\nThe court also heard that Westwood encouraged a young boy to touch himself as part of a \"game\", when the actor was 18 years old and the boy was 10.\nHe was also \"highly manipulative and controlling\" towards a woman whom he held down \"every few weeks\", despite her telling him she did not want to have sex.", "url": "https://www.bbc.co.uk/news/articles/cx2rmn0ww33o"}