{"authors": ["Jon Cuthill", "www.facebook.com"], "date_download": "2025-04-26 03:45:45", "date_modify": "2025-04-26 03:45:45", "date_publish": "2025-03-05 06:13:11", "description": "The move is part of a review of a stretch of coastline between Keyhaven and Lymington.", "filename": "news_articles_cge1qgldyv0o_1745639145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b73c/live/9965d940-f90b-11ef-b5c1-27f306935cb2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge1qgldyv0o_1745639145.html", "title": "Keyhaven: Environment Agency buys land in coastline plan", "title_page": "Keyhaven: Environment Agency buys land in coastline plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Environment Agency has begun purchasing land ahead of plans to adapt a stretch of coastline because of climate change.\nThe agency bought 160 hectares of arable farmland around Keyhaven, Hampshire, as part of its legal obligation to replace any future loss of habitat.\nThe move is part of a review of the 15km (9.3 mile) stretch of coastline between Keyhaven, Pennington marshes, and Lymington.\nPredicted rising sea levels and a higher frequency of storms mean the agency is looking at the best way to manage the area over the next 100 years.\nThe current proposals would maintain the defences at the mile-long Hurst Spit for the next 10 to 20 years, after which intervention would be gradually reduced.\nNick Gray, Environment Agency (EA) flood manager for the Solent and South Downs area, said: \"We are proposing that for places where there are homes and businesses - communities like Lymington - we need to keep investing in maintaining and improving those flood defences.\n\"How we manage Hurst Spit into the future needs to have a more blended approach.\"\nThe method could see the spit roll back naturally, becoming lower and wider.\nThe agency said this could increase the flood risk, with new defences needed further inland.\nIt could also result in the loss of saltmarsh, an internationally important habitat for birds and plants.\nThe purchase of the land around Keyhaven is to replace that lost habitat.\nCampaign group Save Lymington and Keyhaven has been formed in response and has met with the agency to address worries.\nResident Wendy told the BBC: \"I don't like it... I don't like the idea of change.\n\"Anything that they're suggesting doesn't look as if it's going to actually help the wildlife or the people who enjoy this area.\"", "url": "https://www.bbc.co.uk/news/articles/cge1qgldyv0o"}