{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:46:36", "date_modify": "2025-05-19 14:46:36", "date_publish": "2015-02-13 10:46:56", "description": "A new image of the planned Marischal Square development in Aberdeen is released by the developers.", "filename": "news_uk-scotland-north-east-orkney-shetland-31452992_1747665996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80983000/jpg/_80983350_newmarischalsquare.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-north-east-orkney-shetland-31452992_1747665996.html", "title": "New image of Aberdeen Marischal Square plan released", "title_page": "New image of Aberdeen Marischal Square plan released - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new image of the planned Marischal Square development in Aberdeen has been released.\nMuse - granted planning permission for the £107m hotel, office and retail project last year - said it showed the planned view from Broad Street of historic Provost Skene House.\nProtesters fear it will block the view of Provost Skene House and iconic Marischal College.\nA public demonstration is planned this weekend.\nSteve Turner, regional director for Scotland at Muse Developments, said: \"There has been an extremely encouraging reaction to the Marischal Square development from a number of leading businesses seeking to establish a presence in Aberdeen for the first time.\n\"We believe Marischal Square is a fantastic business location which will bring forward the much needed regeneration of this part of Aberdeen, with Marischal College at its heart.\"\nLorna McHattie, of the Reject Marischal Square campaign, told BBC Scotland she was pleased more of Provost Skene House was visible in the new image, but that the overall development was still too high and too dense.\nCampaigners against the development released their own new images earlier this week.", "url": "https://www.bbc.com/news/uk-scotland-north-east-orkney-shetland-31452992"}