{"authors": ["Georgina Rannard", "Erwan Rivault", "www.facebook.com"], "date_download": "2025-04-26 04:15:24", "date_modify": "2025-04-26 04:15:24", "date_publish": "2025-03-04 10:27:14", "description": "The iceberg appears to be stuck and may start breaking up near the island of South Georgia.", "filename": "news_articles_c20d1xp6046o_1745640924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d513/live/eed73b20-f8d5-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20d1xp6046o_1745640924.html", "title": "A23a: World's biggest iceberg runs aground off remote island", "title_page": "A23a: World's biggest iceberg runs aground off remote island - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The world's largest iceberg has run aground in shallow waters off the remote British island of South Georgia, home to millions of penguins and seals.\nThe iceberg, which is about twice the size of Greater London, appears to be stuck and should start breaking up on the island's south-west shores.\nFishermen fear they will be forced to battle with vast chunks of ice, and it could affect some macaroni penguins feeding in the area.\nBut scientists in Antarctica say that huge amounts of nutrients are locked inside the ice, and that as it melts, it could create an explosion of life in the ocean.\n\"It's like dropping a nutrient bomb into the middle of an empty desert,\" says Prof Nadine Johnston from British Antarctic Survey.\nEcologist Mark Belchier who advises the South Georgia government said: \"If it breaks up, the resulting icebergs are likely to present a hazard to vessels as they move in the local currents and could restrict vessels' access to local fishing grounds.\"\nThe stranding is the latest twist in an almost 40-year story that began when the mega chunk of ice broke off the Filchner–Ronne Ice Shelf in 1986.\nWe have tracked its route on satellite pictures since December when it finally broke free after being trapped in an ocean vortex.\nAs it moved north through warmer waters nicknamed iceberg alley, it remained remarkably intact. For a few days, it even appeared to spin on the spot, before speeding up in mid-February travelling at about 20 miles (30km) a day.\n\"The future of all icebergs is that they will die. It's very surprising to see that A23a has lasted this long and only lost about a quarter of its area,\" said Prof Huw Griffiths, speaking to BBC News from the Sir David Attenborough polar research ship currently in Antarctica.\nOn Saturday the 300m tall ice colossus struck the shallow continental shelf about 50 miles (80km) from land and now appears to be firmly lodged.\n\"It's probably going to stay more or less where it is, until chunks break off,\" says Prof Andrew Meijers from British Antarctic Survey.\nIt is showing advancing signs of decay. Once 3,900 sq km (1,500 sq miles) in size, it has been steadily shrinking, shedding huge amounts of water as it moves into warmer seas. It is now an estimated 3,234 sq km.\n\"Instead of a big, sheer pristine box of ice, you can see caverns under the edges,\" Prof Meijers says.\nTides will now be lifting it up and down, and where it is touching the continental shelf, it will grind backwards and forwards, eroding the rock and ice.\n\"If the ice underneath is rotten - eroded by salt - it'll crumble away under stress and maybe drift somewhere more shallow,\" says Prof Meijers.\nBut where the ice is touching the shelf, there are thousands of tiny creatures like coral, sea slugs and sponge.\n\"Their entire universe is being bulldozed by a massive slab of ice scraping along the sea floor,\" says Prof Griffiths.\nThat is catastrophic in the short-term for these species, but he says that it is a natural part of the life cycle in the region.\n\"Where it is destroying something in one place, it's providing nutrients and food in other places,\" he adds.\nThere had been fears for the islands' larger creatures. In 2004 an iceberg in a different area called the Ross Sea affected the breeding success of penguins, leading to a spike in deaths.\nBut experts now think that most of South Georgia's birds and animals will escape that fate.\nSome Macaroni penguins that forage on the shelf where the iceberg is stuck could be affected, says Peter Fretwell at the British Antarctic Survey.\nThe iceberg melts freshwater into salt water, reducing the amount of food including krill (a small crustacean) that penguins eat.\nThe birds could move to other feeding grounds, he explains, but that would put them in competition with other creatures.", "url": "https://www.bbc.co.uk/news/articles/c20d1xp6046o"}