{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:13:56", "date_modify": "2025-04-26 04:13:56", "date_publish": "2025-03-04 11:35:31", "description": "Peter Straughan, from Gateshead, says everybody in LA congratulated him \"all night long\".", "filename": "news_articles_cx2gvjy07dzo_1745640836.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/20ff/live/8f310c50-f8da-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gvjy07dzo_1745640836.html", "title": "Gateshead Oscar winner Peter Straughan 'still reeling from shock'", "title_page": "Gateshead Oscar winner Peter Straughan 'still reeling from shock' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A screenwriter says he is \"still reeling from the shock\" of winning an Oscar for Best Adapted Screenplay.\nPeter Straughan, who was born in Gateshead, was awarded the gong for Conclave at the 97th Academy Awards in Los Angeles.\nHe said: \"Helpfully, just before they announced me they said that the show was being watched by a billion people, so I had that in my head when they called my name out.\n\"When you walk around holding the Oscar, everybody in LA says congratulations to you all night long, so that was kind of nice.\"\nStraughan also won a Golden Globe earlier this year for Conclave, and the Best Adapted Screenplay BAFTA for Tinker Taylor Solider Spy in 2012.\nHe said went back to the hotel \"quite early\" following Sunday's ceremony.\n\"I woke up this morning and the Oscar was sitting on the table across from me and it was just such a surreal moment to think, 'Oh, that's mine. I'm taking that home with me,'\" Straughan said.\nHe said team behind the film, which is an adaptation of the 2016 novel by Robert Harris, had been \"so lovely\" to work with.\n\"We've all been on this journey together.\"", "url": "https://www.bbc.co.uk/news/articles/cx2gvjy07dzo"}