{"authors": ["George King", "www.facebook.com"], "date_download": "2025-04-26 03:44:01", "date_modify": "2025-04-26 03:44:01", "date_publish": "2025-03-05 07:47:37", "description": "Jacob Bailey voluntarily struck off the register after he tells a tribunal he is \"deeply ashamed\".", "filename": "news_articles_c5y9kp85yego_1745639041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41f5/live/4202e4c0-f93a-11ef-9335-49fc611b7783.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y9kp85yego_1745639041.html", "title": "East of England paramedic laughed about patient 'moaning in pain'", "title_page": "East of England paramedic laughed about patient 'moaning in pain' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A paramedic who laughed about a patient \"moaning in pain\", made derogatory comments about others and took his hands off the wheel while driving an ambulance has been struck-off.\nJacob Bailey was working for the East of England Ambulance Service when he disclosed confidential information about patients in a Facebook group chat between November 2021 and January 2022.\nDuring his employment in the mid and south Essex sector of the service he also posted images of himself wearing a paramedic uniform and swearing at the camera in the messenger group.\nHe was dismissed by the ambulance service in August 2022 and has now been removed from the register following an investigation by the Health and Care Professions Tribunal Service.\nThe tribunal heard, external a total of 59,615 posts, comments, reactions and other actions were made in the group chat, with 2,840 being attributed to Bailey.\nSome of them included pictures showing patients' addresses and defibrillator monitors displaying patients' vital observations, including ECGs.\nBailey, who once admitted \"falling asleep\" on a patient's sofa, also made rude comments about patients who were in his care.\nOn one occasion, he sent a message saying he was with a patient who would not \"stop moaning in pain\", followed by a swear word and two laughing emojis.\nWhile attending another call-out, he said his patient was \"too old but the f***** didn't have DNAR\" – meaning he would have been obliged to try to resuscitate them.\nHe also referred to one female patient as a \"wet wipe\" and commented that another would have been \"easier to manage\" had she had a cardiac arrest.\nAnd while at a patient's home in Harwich, he sent a message saying there were cat faeces on the floor, it smelt of cannabis and there was pornography on the television.", "url": "https://www.bbc.co.uk/news/articles/c5y9kp85yego"}