{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:00", "date_modify": "2025-05-19 15:32:00", "date_publish": "2015-02-20 07:07:59", "description": "Ahead of the Academy Awards, the cast and director of Whiplash talk about making the jazz drumming film.", "filename": "news_entertainment-arts-31494942_1747668720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81065000/jpg/_81065544_whiplash_top.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31494942_1747668720.html", "title": "Whiplash stars drum up Oscar hopes", "title_page": "Whiplash stars drum up Oscar hopes - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ahead of the Academy Awards, the cast and director of Whiplash talk about making the jazz drumming film.\nSince Whiplash first premiered at the Sundance Film Festival last year, critics have lavished much praise on 30-year-old Damien Chazelle's movie.\nJK Simmons' portrayal of ferocious, bullying music teacher Fletcher has gone on to win numerous awards including a Golden Globe and a Bafta - and he is also tipped to win one of the five Oscars for which the film is competing.\nBeginning life as a Sundance-winning short film (which also starred Simmons), Chazelle tells the story of an ambitious young drummer - played by Miles Teller - who is pushed to his limit by his cut-throat teacher.\nSpeaking to the BBC at the Toronto Film Festival back in September, the director and his cast talked about turning the short film into a full-length feature for the big screen, showcasing their musical talents and Simmons' terrifying character.\nIt was the former - no one wanted to make the feature script I had written so it led to the short. It was hard trying to convince people a movie about a jazz drummer could be watchable, let alone exciting.\nI knew to me it felt like high stakes drama, but it was hard to convince people of that on the page. So we pulled a scene from it and took it to Sundance, and that helped us get the money.\nJK, how did you get involved?\nJason Reitman (who directed Simmons in Juno) handed me the script for both the short and the feature. The fact it came from Jason's hand was enough, so I knew it would be something good. They were both fully realised and brilliant stories, so it was a no-brainer to sign up for the short to generate the budget to make the feature.\nIs JK's character based on a real person?\nChazelle: It's based in large on a teacher I had as a drummer. It's a composite of that and some other people's teachers, and vicariously living through those experiences.\nJK is great in the movie, tell me a bit about working with him.\nChazelle: I can't take that much credit. When we were making the short we didn't have time for any rehearsal, so the day before the shoot I said 'when you're yelling don't just yell, become an animal'. He came back the next day and he scared all of us. And he did the same thing on the film.\nJK and Miles, your on-screen relationship is quite tortuous, did you keep apart on set to avoid getting too friendly?\nSimmons: Yeah it was contractual - he wasn't allowed to look at me or speak to me [laughs].\nNo, we settled into a rhythm pretty quickly. We behaved like a couple of idiots in between and kept it light because there was enough drama when the camera was rolling.\nJK, you are quite frightening as Fletcher - did it come naturally to you?\nI guess I'm just a natural bastard [laughs]. It's like anything you're bringing out, whether it's laughter or tears, you've got to go down and get it and bring it out - but that's our job.\nTeller: As an actor, JK has such control over his voice which is such a powerful tool.\nYou all have musical backgrounds, was this a dream role to be able to show off your talents?\nTeller: For me, my mum says this will always be her favourite movie because she gets to watch her kid play music. We were a multiple instrument household - all my sisters played piano and I played saxophone and guitar. My mum loved it - I really think she wanted a Partridge family where she could be the lead singer in her kids' band.\nIt's rare to find a movie where you get to play an instrument and it's not a biopic. For me, to be able to play the drums was great. With drummers no one ever asks you to play a solo because if you're not good, it's just noise and drums are hard to exist by themselves. It was very gratifying and will probably never happen again.\nSimmons: I studied music at college but I was never good at any instrument - my hands don't work that way, but I did study conducting, composition and singing. But it was cool when I was playing the piano - it was pretty simple, but I practised it quite a lot.\nWhen you saw the final scene in the script did you think it was doable as it is so fast-paced and ambitious?\nTeller: I think it's awesome the film ends with a climax. I can't even tell you the last film I saw where the last scene in the movie was the best scene in the movie. Rarely do films leave you like that.\nJK, you've mainly played supporting roles and people say this is the performance of your career…\nTeller: [interrupts laughing] Yeah, but have you seen his career…?!\nThe word \"Oscar\" has been bandied about - how have you got to the point in your career where this sort of part has only come up now and where can you go from here?\nWith varying degrees of success I've always gravitated to what I think is a good project, and script and actors to work with. And this is one of those instances where I was fortunate to be offered something with greatness.\nAs is always the case with the best projects I've been involved with it's a true collaboration, so if there is awards chatter being tossed around that's great for the movie and great for me.\nWhiplash is on general release.", "url": "https://www.bbc.com/news/entertainment-arts-31494942"}