{"authors": ["Galya Dimitrova & Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 06:39:18", "date_modify": "2025-04-26 06:39:18", "date_publish": "2025-03-02 16:14:53", "description": "The sculpture was damaged and taken from his seat in Paddington creator Michael Bond's home town.", "filename": "news_articles_cd7egx029l9o_1745649558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/731e/live/da89a380-f75c-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7egx029l9o_1745649558.html", "title": "Two arrested as Newbury's stolen Paddington statue recovered", "title_page": "Two arrested as Newbury's stolen Paddington statue recovered - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two men have been arrested after a Paddington Bear statue was damaged and stolen from a bench, police have said.\nThe sculpture was taken from his seat in Northbrook Street, Newbury, at about 02:00 GMT Sunday morning, according to Thames Valley Police.\nThe force said on Sunday evening it had recovered the statue, adding that Paddington was \"heading to Newbury police station for a much-needed marmalade sandwich\".\nTwo 22-year-old men, both from Basingstoke, were arrested on suspicion of theft and criminal damage and remain in police custody.\nInsp Alan Hawkett said: \"The Paddington Bear statue is a beloved part of Newbury so we have been doing everything we can to locate it and the offenders.\"\nThe force said it would keep the sculpture safe and support its restoration.\nThe statue of the Peruvian bear, holding one of his beloved marmalade sandwiches, was unveiled in the home town of Paddington creator Michael Bond in October.\nIt was one of 23 celebrating the children's character placed across the UK last year as part of the Paddington Visits trail, ahead of the StudioCanal film Paddington in Peru.\nResidents in the Berkshire town earlier expressed their dismay at the theft, saying he was \"a lovely addition to Newbury\".", "url": "https://www.bbc.co.uk/news/articles/cd7egx029l9o"}