{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:40:25", "date_modify": "2025-04-26 03:40:25", "date_publish": "2025-03-05 10:08:54", "description": "A look at what stories are trending across the West of England on 5 March 2025", "filename": "news_articles_ckgy53d071do_1745638825.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b5e4/live/f4ab33d0-f9a7-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgy53d071do_1745638825.html", "title": "'Pioneering' rescue vehicle and bakery closes after 55 years", "title_page": "'Pioneering' rescue vehicle and bakery closes after 55 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After 55 years, The Crusty Cob has ceased trading, external as of yesterday, according to Burnham-on-Sea.com. They also have bakeries in Tiverton and Exmouth, among others.\nA Ukrainian florist in Bristol provided the flowers , externalat 10 Downing Street, as the Prime Minister's office marked three years since the start of the war in Ukraine.\nThousands of homes could be built near the River Severn, external \"to create a new community\", according to Gloucestershire Live. Some 2,750 houses would make up Sharpness Vale.\nAnd people living next to a nursery in St Andrew's in Bristol have complained about the noise from children playing in the garden, external, says Bristol Live. It's come about as Zebedees Nursery looks to expand its provision by a third.\nA new tube feeding system at RUH Bath means families can go home earlier, external, according to the hospital. This post shows the first couple to use this method.\nAvon Fire & Rescue are trialling a \"cutting-edge underwater Remote Operating Vehicle\", external, which will be based at Temple Fire Station. It uses sonar and a mechanical arm to find and help people in the water.\nBristol Rovers says it will be hosting a Grand Iftar event, external next week at the Memorial Stadium, which will be the first of its kind there.\nThere is a public consultation in Calne on plans to build 180 new homes, external and a medical centre.\nAnd an open letter from Roelof van der Merwe, external has had a lot of love on the Somerset County Cricket Club pages – as he sets to leave the club before the start of the 2025 season.", "url": "https://www.bbc.co.uk/news/articles/ckgy53d071do"}