{"authors": ["James Turner", "www.facebook.com"], "date_download": "2025-04-26 04:14:07", "date_modify": "2025-04-26 04:14:07", "date_publish": "2025-03-04 11:27:11", "description": "The changes are part of South Holland District Council's budget for 2025-26.", "filename": "news_articles_c4g083gjgjno_1745640847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/af43/live/e4712230-f8ea-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g083gjgjno_1745640847.html", "title": "Spalding parking charge rise 'will raise thousands'", "title_page": "Spalding parking charge rise 'will raise thousands' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Motorists in Spalding are facing an increase in parking charges from 1 April.\nThe changes were announced in South Holland District Council's budget, which was rubber-stamped at a meeting last week.\nOfficials said tariffs would rise by 10p, with the move expected to raise £404,000 in 2025-26, compared with £381,000 in the last financial year.\nMembers also agreed to increase council tax on residents by the maximum amount of 2.99%, taking the annual bill for Band D properties to £208.53 – an increase of £7.11.\nAt present, parking for an hour at council-owned car parks in Vine Street, Herring Lane and the Castle swimming pool costs £1.20, with two hours at £1.80 and four hours at £2.80.\nThe new charges will rise to £1.30, £1.90 and £2.90 respectively.\nSimilar increases will apply at the Victoria Street and Westlode Street car parks, and at council-owned sites in Holland Road, The Vista and Winfrey Avenue.\nFree parking will be retained on Sundays, but drivers will still be required to display a ticket, according to the Local Democracy Reporting Service,\nCouncillor Paul Redgate told the meeting there were significant pressures affecting the district.\n\"Each year since I have become finance portfolio holder, there have been challenges, and this year is no different, but with a different emphasis,\" he said.\n\"Driven not from worldwide events, as we have seen previously, but from government and policy changes.\n\"This means that we are receiving significantly less government support than in previous years, especially with the removal of the rural services delivery grant.\"\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c4g083gjgjno"}