{"authors": ["Alex Moss", "www.facebook.com"], "date_download": "2025-04-26 04:40:18", "date_modify": "2025-04-26 04:40:18", "date_publish": "2025-03-02 07:33:58", "description": "Paul Chuckle shares memories of his late brother - and talks about the challenges of going solo.", "filename": "news_articles_cx2xxe474zgo_1745642418.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eaf7/live/7f1a9dc0-f5f8-11ef-9de2-8d109cf4aecf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xxe474zgo_1745642418.html", "title": "Chuckle Brothers: Barry is always by my side, says Paul", "title_page": "Chuckle Brothers: Barry is always by my side, says Paul - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chuckle Brothers star Paul Chuckle made a promise to his late brother Barry that he would keep on making people laugh. Here he talks about life without his comic sidekick and how humour and happiness can exist alongside grief.\nIf you were a child of a certain generation, then chances are you were familiar with the farcical adventures of the Chuckle Brothers.\nThe duo, born Paul and Barry Elliott from Rotherham, were a staple in British homes with their TV show ChuckleVision, which aired nearly 300 episodes during the 1990s and 2000s.\nIts premise was good old-fashioned, family humour. Paul and Barry were the well-meaning but hapless, accident-prone brothers who unintentionally caused chaos wherever they went, often with the mutterings of \"To me, to you\".\nPaul, 77, reflects: \"He said, 'you're not going to pack it in are you?' and I said 'no of course I'm not'. I mean what else would I do? It's too late to join a football team.\"\nHaving forged an inseparable bond on screen and off over decades of performing together, it was a difficult adjustment.\nPaul says: \"I was always the straight one and Barry was the comedian.\n\"I would feed the jokes and he would give the punchline but now I've got to do it on my own.\"\nBut from panto appearances to frequent DJ stints in nightclubs, Paul continues to keep busy and fulfil his brother's wish.\nAlthough no longer physically by his side, Paul says Barry stays close in spirit, especially when he is performing which brings \"immense comfort\".\n\"Since 1963 I'd never really been on stage without him by my side.\n\"But I'm used to it now and I feel he's with me all the time. Whenever I walk on stage I feel he's there and it's a lovely feeling.\"\nHis career has seen a slight directional change with a new gangster film, Fall to the Top, set to air next year showing a more serious side to the comical brother.\n\"Everyone expects me to be silly and stupid but now I'm a stupid killer,\" he adds.\n\"It's completely different to other things I've done but I really enjoyed it.\"\nAsked whether Barry would approve of his role, he replies: \"He loves it, I know he does. He's always said I was a nasty so-and-so.\"", "url": "https://www.bbc.co.uk/news/articles/cx2xxe474zgo"}