{"authors": ["Liv McMahon", "www.facebook.com"], "date_download": "2025-04-26 04:39:34", "date_modify": "2025-04-26 04:39:34", "date_publish": "2025-02-28 09:22:18", "description": "Technical issues have affected UK banking app users on payday for the second-month running in 2025.", "filename": "news_articles_cz9nnz2eqzdo_1745642374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3156/live/d3502ca0-f5b4-11ef-accd-233028a2e09e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9nnz2eqzdo_1745642374.html", "title": "Lloyds Bank says app issues fixed after payday IT issue", "title_page": "Lloyds Bank says app issues fixed after payday IT issue - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Banking apps have once again been hit by IT issues on payday in the UK.\nLloyds Bank and Halifax apps went down on Friday morning, according to thousands of user reports to platform outage monitor Downdetector.\nUsers also reported technical issues affecting access to the TSB and Bank of Scotland apps.\nThe number of reports flagging problems with the apps has since declined.\nA Lloyds Banking Group spokesperson has told the BBC that the Lloyds, Halifax and Bank of Scotland apps and online banking services are now working as normal.\nThe British banking giant apologised for the issues in an earlier statement.\nIt is the second time in 2025 that banking apps users have encountered problems on payday, after a Barclays app outage affected UK customers in January.\nWhich? retail editor Reena Sewraz said the IT problems \"could cause real headaches for thousands of customers\".\n\"Some people may miss important bill payments, find themselves unable to pay for essential services or risk going overdrawn, all of which could have serious consequences,\" she said.\nOne user told the Lloyd's Bank social media account on X that they could not access their business account to pay their staff, external.\nAnother said in a post tagging Lloyds Bank's X account they had been told to transfer funds into their account, but could not due to the issues affecting its app.\n\"Your new cards have no phone numbers on and I'm nowhere near a branch,\" they wrote - adding \"help!\".\nBarclays customers told the BBC last month that their bank's outage, lasting several days for some, left them unable to purchase essentials or make vital transactions.\n\"I could cry. I changed to you when Barclays had a major breakdown on payday,\" one X user told Lloyds in a reply to one of their posts on Friday.\n\"Now this month you've gone down on payday,\" they added.\nThe Treasury Committee recently wrote to the bosses of nine banks asking for information about the scale and impact of IT failures on customers.", "url": "https://www.bbc.co.uk/news/articles/cz9nnz2eqzdo"}