{"authors": ["Matt Murray", "www.facebook.com"], "date_download": "2025-04-26 06:53:01", "date_modify": "2025-04-26 06:53:01", "date_publish": "2025-02-28 16:52:11", "description": "Ginger is believed to be the oldest retired miners in the UK.", "filename": "news_articles_cwyj07m4mdno_1745650381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1e1/live/63ad0770-f608-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyj07m4mdno_1745650381.html", "title": "Ebbw Vale: Retired miner celebrates 103rd birthday with party", "title_page": "Ebbw Vale: Retired miner celebrates 103rd birthday with party - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 103rd birthday party has been thrown for a man believed to be one of the oldest retired miners in the UK.\nRon \"Ginger\" Parsons, from Cwm, near Ebbw Vale, started in the pit just before his 14th birthday and spent 50 years working at the coal face.\nFormer colleagues, family and friends joined Ginger today for the birthday celebrations.\nGinger said the secret to living so long is he \"never argued with anyone\" or \"made any enemies\".\nGinger said: \"I remember my first day saying to the manager, 'can I work with my uncle?' He said you're only 14 and you're not very big. I told a friend, 'he says I'm too small and too young'.\"\nHe said he was told to tell the manager \"I'm taller than you\", to which the manager said \"okay, start Monday\".\nGinger said: \"I worked there six days a week for 50 years.\"\nHe started at the Marine Colliery in Cwm 90 years ago, first above ground but then at the coalface when he turned 14.\nIn the mid-1970s Ginger nearly died after a heavy fall which left him trapped underground.\nBut his team, including Christopher 'Bamba' Williams, went back to dig Ginger out.\nMr Williams said: \"We dug him out and made a stretcher from some timber to carry him out of the pit. I shouted to him 'are you ok Ginger?' and he shouted back 'Bamba, I'm okay'. We then took him to Neville Hall hospital.\nGinger was offered a management position but told bosses \"you keep the pencil, I'll keep my shovel!\".\nHe finally hung up the shovel at 65 years old.\n\"They used to call me the music man and I use to sing all the time,\" Ginger said.\n\"I was the first person in Cwm to have a microphone and that made me popular, all the girls wanted me.\n\"I use to sing South of the Border, Mexico way. That was my favourite.\"\nHe said the secret of living to 103 is that he \"loved everybody in Cwm and I never argued with anyone and never made any enemies\".", "url": "https://www.bbc.co.uk/news/articles/cwyj07m4mdno"}