{"authors": ["Karen Gardner", "Lucy Tegg", "www.facebook.com"], "date_download": "2025-04-26 07:05:47", "date_modify": "2025-04-26 07:05:47", "date_publish": "2025-02-28 06:22:26", "description": "A family-run cookware store in Salisbury is closing after 40 years in business.", "filename": "news_articles_c30mm8e261ro_1745651147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b0a6/live/6141d080-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c30mm8e261ro_1745651147.html", "title": "Rising costs and online shopping blamed as Salisbury shop closes", "title_page": "Rising costs and online shopping blamed as Salisbury shop closes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A well-known cookshop and cafe in Salisbury is to close after more than 40 years.\nDinghams Cookshop has been trading from the site on the Market Place for the last 20 years, having opened on Fisherton Street in 1982.\nA social media post explained that: \"Rising costs, changes in consumer habits, and external economic pressures have made it increasingly difficult\".\nIt went on: \"The combination of these pressures has made it unsustainable for us to continue operating as an independent business.\"\nThe Dinghams team thanked customers via Facebook, saying: \"It has been an unforgettable experience, and we will always be grateful for the support.\"\nThe firm blamed a lack of support following the novochok incident in 2018, which was followed by the Covid pandemic, along with an increase in online shoppng for playing a part in the store's demise.\nNicola Hardingham, who runs Dinghams said: \"We tried to keep positive, expand the cafe, we tried new things, we were really fighting, but just nothing seemed to be enough.\"\n\"Then we got the cost of living crisis and the rise in all our costs, it's just a losing battle,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c30mm8e261ro"}