{"authors": ["Kelly Morgan & Sophie Parker", "www.facebook.com"], "date_download": "2025-04-26 07:37:32", "date_modify": "2025-04-26 07:37:32", "date_publish": "2025-02-27 14:11:25", "description": "The Labour-led council says it's budget is \"sensible\" to keeps front-line services going.", "filename": "news_articles_clyrrgv9lpxo_1745653052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0b7d/live/d0309e60-f50a-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrrgv9lpxo_1745653052.html", "title": "Swindon's council tax to rise by 4.99% to avoid service cuts", "title_page": "Swindon's council tax to rise by 4.99% to avoid service cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Swindon's council has approved a maximum increase in council tax and a sell-off of buildings to help plug a £14.7m shortfall.\nThe Labour-led council said the budget, which passed at a council meeting on Wednesday evening, means there will be no cuts to services.\nLeader, Councillor Jim Robbins, said it was a \"sensible\" budget that would allow them to keep \"front-line services going\".\nHowever, the Conservative opposition put in an alternative proposal involving £5m of savings, which was rejected.\nThe budget passed with 39 votes in favour and 14 against.\nMr Robbins said: \"We're really pleased that we've got the budget through. We think it's a really sensible budget that will allow us to keep on delivering the Swindon plan, keep on doing that work to improve the town but allows us to keep our really important front line services going that will make a real difference to Swindon residents this year.\"\nSwindon Borough Council is one of 30 councils to be given exceptional financial support by the government - which means they can now begin selling assets.\nThese are likely to be buildings previously bought as investments.\nThe council tax increase means the average bill will go up by around £6.52 a month.\nThere was opposition from the Conservatives - they put forward an alternative proposal, which was rejected, but proposed £5m of savings.\nThey accused Labour of being \"arrogant\" and and not working in a cross-party way.\nMr Robbins refuted this, saying they are \"not serious\" about it and went to media before ever speaking to them, with none coming to see him about the proposal.\nHe said: \"Every single one of the Labour administrations that took over from the Conservatives are in the same position as us. There have been years of under investment in key services. We are doing our best in a really tricky situation to sort it out.\"", "url": "https://www.bbc.co.uk/news/articles/clyrrgv9lpxo"}