{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:37:25", "date_modify": "2025-04-26 04:37:25", "date_publish": "2025-02-28 11:23:42", "description": "The Conservative-led ruling group in Dumfries and Galloway is considering its position at the helm.", "filename": "news_articles_cyveeq9njjeo_1745642245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b5b7/live/b4c87fc0-f4ed-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyveeq9njjeo_1745642245.html", "title": "Dumfries and Galloway Council administration considers position after budget defeat", "title_page": "Dumfries and Galloway Council administration considers position after budget defeat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The ruling group of a Scottish council is considering its position after its budget proposals were defeated for the second year in a row.\nThe Conservative-led administration on Dumfries and Galloway saw its proposals voted down in favour of SNP plans backed by Labour councillors.\nConvener Malcolm Johnstone said his group would have to reflect on what had happened at the budget-setting meeting where a 9% rise in council tax was agreed.\nHowever, he admitted the prospect of trying to work with another group's financial strategy was a difficult one.\nThe Conservatives took control of the local authority as a minority administration two years ago after the collapse of a previous coalition.\nLast year their budget proposals failed to be passed but they carried on with another group's financial plans.\nMr Johnstone said they had \"major concerns\" about taking forward parts of the SNP's plans this year - particularly around the use of reserves.\n\"We will consider our position,\" he confirmed.\n\"I am not going to make any sort of knee-jerk reaction - we weren't going to sit in the chair and flounce off, that wasn't going to happen.\n\"We will be giving it very careful consideration over the next days and couple of weeks.\"\nHe said he believed some sort of collaborative budget-setting needed to be found rather than potential instability over the next few months.\n\"The council really needs a stable administration and a stable leadership,\" he added.\nThe Conservatives, with 16 councillors, have the most of any political group on the 43-member authority.\nThey are followed by the SNP with 11, Labour with eight, three in a \"democratic alliance\", three independents, one Lib Dem and one not specified.\nIt has made forming a stable coalition challenging.\nSNP group leader Stephen Thompson said the Conservative group's continued hold on power did not seem viable in the circumstances.\n\"It doesn't seem tenable to continue running with other people's budgets,\" he said.\n\"If you can't command the support across the chamber for your own budget I would ask questions of myself.\n\"It is really up to them to see where their moral compass takes them.\"\nThe Labour group's Linda Dorward expressed some sympathy for the position her political rivals found themselves in.\n\"I think they are where they are and they are doing the best they can with what they have - I think if we were in that position we would be doing the same thing,\" she said.\n\"It is not about competence or about ability here, it is about numbers - the bottom line is about numbers.\n\"We can play games about it, we can make political points, but actually I think we have got a lot of our work done in an opposition working with others.\n\"I think we have done a lot of good work in the past year.\"", "url": "https://www.bbc.co.uk/news/articles/cyveeq9njjeo"}