{"authors": ["Jayne McCormack and Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:31:05", "date_modify": "2025-04-26 04:31:05", "date_publish": "2025-03-03 06:14:52", "description": "The programme for government includes a target of treating an extra 70,000 patients to reduce hospital waiting lists.", "filename": "news_articles_ce8vvzg2n6mo_1745641865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1b0d/live/97e00200-f85a-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vvzg2n6mo_1745641865.html", "title": "Stormont: Programme for government presented to the NI Assembly", "title_page": "Stormont: Programme for government presented to the NI Assembly - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The programme for government is \"a message of ambition\", the deputy first minister has said.\nThe plan, called Doing What Matters Most, was unanimously agreed by the four parties in the executive last week.\nIt was presented to the Northern Ireland Assembly on Monday, with First Minister Michelle O'Neill describing it as a \"significant milestone\".\nHowever, the Social Democratic and Labour Party (SDLP)'s Matthew O'Toole said it was a \"missed opportunity\" and that his party would be \"demanding better than this late, limp, listless programme for government\".\nTreating an extra 70,000 patients to reduce hospital waiting lists and building more than 5,000 new social homes by 2027 are targets for the government in the programme.\nLittle-Pengelly, from the Democratic Unionist Party (DUP), said the programme for government was \"not the totality of our ambitions\".\n\"This is about prioritisation, and prioritisation is always difficult,\" she told assembly members on Monday.\n\"We are in a fiscally constrained environment. It is difficult to fund everything that we want to fund and that does require hard decisions.\"\nSpeaking in the assembly, O'Neill said the final document recognised the four-party executive's \"shared ambitions\".\nIt is just over a year since the Northern Ireland Executive reformed in February 2024.\nA draft version of the programme was published last September before an eight-week public consultation.\nMore than 1,400 responses were received in the consultation process for the draft programme for government.\nThe last time an executive managed to get one over the line was during the assembly's fourth term between 2011 and 2015.\nO'Neill, the Sinn Féin vice-president said the programme showed the public parties were \"willing to work together to do right by them.\"\n\"I believe the programme for government shows what we need to prioritise in order to make this a better place to live, work and invest,\" O'Neill said.\n\"As a result we have introduced targets and annual objectives, which will be updated each year aligned to our budget.\"\nLittle-Pengelly said her message was one of \"hope\".\n\"It is a message of ambition and it is a message of seeking to do everything in our power to deliver for the people of Northern Ireland,\" she added.\n\"The programme for government provides a roadmap to grow our economy, strengthen our communities and support hardworking families.\"\nSocial Democratic and Labour Party (SDLP) member Matthew O'Toole said his party would be \"demanding better than this late, limp, listless programme for government\".\nThe leader of the opposition said: \"This document contains aspirations we share, but it is far short of the kind of clear, targeted plan that the people of Northern Ireland deserve after so many years of failure.\"\nHe added: \"This programme is better than nothing. It's a modest improvement on the draft, but it's a missed opportunity. It's nowhere near good enough.\n\"I say to the first and deputy first ministers, and indeed all ministers - is this it?\"\nAlliance Party deputy leader Eóin Tennyson said the process of developing the programme for government was \"fraught at times\" and involved \"needless delay\", but he welcomed agreement on it as a \"step forward\".\nHe said the paper was not an \"exhaustive list\" of what ministers would achieve, \"nor should it be seen as the ceiling of our ambition\".\n\"It does however set out a series of positive proposals in a number of areas where there is consensus amongst the four parties within mandatory coalition,\" he said.\nThe Police Federation for Northern Ireland (PFNI) said it was \"beyond disappointing\" that the programme for government failed to make \"cast-iron promises\" on police numbers and general funding.\nPFNI chair Liam Kelly said: \"This is dismaying. It is a standstill agenda. All we have here an intention to 'develop a robust business case that will seek to stabilise, and begin to grow, police officer numbers'.\n\"There is nothing to say what that actually means or a fixed timeline.\"\nAlongside the priorities there are specific targets.\nOn the issue of waiting lists, the programme said that by 2027, which is when the assembly mandate runs out, the executive will have invested up to £135m a year \"to reduce waiting lists by treating an additional 70,000 patients\".\nIt added that it would also increase elective care capacity through expansion of elective care centres and mega clinics by investing an extra £80m a year to \"remove the demand/capacity gap that causes waiting lists to grow\".\nHealth Minister Mike Nesbitt said the amounts were \"very dramatic and very welcome\", but he would be writing to the first and deputy first ministers, and the finance minister, to seek clarity on the proposals and timelines.\nThe Ulster Unionist Party (UUP) minister added that £80m is what is needed to stop waiting lists getting longer, and £135m was needed per year for five years to reduce them.\n\"If that money's come in... I need to start planning immediately about getting that money out and getting people seen in a more timely manner,\" he said.\nTraditional Unionist Voice (TUV) assembly member Timothy Gaston said the document does not address unionist concerns over post-Brexit trade arrangements under the Northern Ireland Protocol.\n\"Where is the section on how this executive is going to deal with the protocol? It isn't so much as mentioned,\" he said.\n\"I ask unionists who claimed that they would fight the protocol within the arena of Stormont - how's that working out for you?\"\nPeople Before Profit (PBP) assembly member Gerry Carroll said the programme for government was a \"clear indication that the executive is out of touch with the people they claim to represent\".\nHe added: \"The mere existence of this programme for government has been hailed as a celebration. I would ask, is the bar really this low? Do ordinary people not deserve better?\"\nOn social housing, the document said that the executive \"want to commit to the long-term public subsidy required to deliver more social homes\".\nIts target for 2027 is to have started work on at least 5,850 new build social homes in Northern Ireland.\nKirsten Hewitt, director of homelessness services at the Simon Community, told BBC News NI's Good Morning Ulster that while the organisation welcomed the focus on social housing, further action was needed.\n\"Absolutely, it's so important but what we need are the actions that are associated with that – how are we going to deliver at least 2,000 social homes each year because that's whats needed in Northern Ireland.\n\"Last year, we had just over 1,300 built so we really need to improve.\"\nShe said government departments needed to work together to address homelessness.\nOn childcare, the executive said that it would have agreed a comprehensive Early Learning and Childcare Strategy.\nIt also committed to increasing renewable electricity capacity by 40% by 2027 and considering an Employment Rights Bill for introduction in the assembly.\nThe document also specifically mentioned the issue of special educational needs and said the executive would produce a reform agenda and delivery plan to help improve outcomes for children with SEN and their families.\nThe paper stated that the executive would \"make progress\" on the redevelopment of Casement Park, but did not include a definitive timeframe for this.\nThe programme for government also committed to establishing a delivery unit to drive reform and transformation across government and wider public services.\nAlongside the document, the executive promised to keep the public updated by \"publishing annual reports on the progress we are making\".\nIt added: \"This will show that meaningful progress is being made to deliver the projects and programmes included in the programme for government.\"", "url": "https://www.bbc.co.uk/news/articles/ce8vvzg2n6mo"}