{"authors": ["Tessa Wong", "www.facebook.com"], "date_download": "2025-05-19 14:51:34", "date_modify": "2025-05-19 14:51:34", "date_publish": "2015-03-06 00:41:35", "description": "The sudden mass death of tonnes of fish off the coast of Singapore has upset farmers and nature lovers.", "filename": "news_world-asia-31724554_1747666294.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81392000/jpg/_81392500_81391049.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31724554_1747666294.html", "title": "Mass fish deaths off Singapore coast spark concern", "title_page": "Mass fish deaths off Singapore coast spark concern - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Last Sunday morning, Bryan Ang woke up onboard his floating fish farm on the Johor Strait between Malaysia and Singapore to find nearly all his stock had died.\n\"We woke up and saw all the fish floating belly-up,\" he said. \"It's devastating.\"\nHe was not alone. Hundreds of tonnes of fish - both farmed and wild - died over the weekend in the eastern part of the strait. Fish farmers lost hundreds of thousands of dollars in stock overnight.\nFloating out at sea and washing up on the beaches and mangroves, dead sea creatures began to appear, from sea snakes and seahorses to squid and moray eel.\nNature guide and environmental biology student Sean Yap - who supplied some of these pictures to the BBC - said he was jogging along the eastern Pasir Ris beach on Saturday evening when he smelt a foul stench.\nIt came from what he described as a \"mass grave\" - thousands of dead fish washed up on shore.\n\"There were cleaners present on the shore on Sunday morning to deal with the carcasses, but when we returned at night the high tide had brought in a new batch of bodies.\"\nThe environmental authorities said the deaths were due to a plankton bloom, where a species of plankton multiplies rapidly, damaging the gills of fish. It can be triggered by sudden changes in temperature, high nutrient levels in the water, and poor water circulation.\nGovernment agencies were unable to provide the BBC with figures, but said they were \"concerned\" about the potential impact on marine biodiversity and were taking steps to investigate and help farmers clean up.\nThere have been similar mass fish deaths in the past five years. This time round, the authorities had given an early warning to farmers - giving them time to move their stock into protective nets, activate pumps to keep the water moving or even float their entire farm to safer areas.\nSome managed to save their stock, but few had anticipated the intensity of the plankton bloom nor how quickly it would strike, killing the fish en masse within hours.\nSeveral fish farmers told the BBC that rapid development in the western part of the strait in Johor, the Malaysian state closest to Singapore, was one of the factors affecting the water quality.\n\"The plankton bloomed this fast because the nutrient content in the sea is so high. And where are all these nutrients coming from? Land reclamation in Malaysia,\" said Frank Tan.\nBut tiny Singapore has also reclaimed parts of its northern coast, and dammed up estuaries in the northeast to create reservoirs. It has pumped millions of dollars into the fish farming industry to boost its domestic food security.\nLatest government figures show there are now 117 fish farms in waters surrounding the island, spread out over 102ha - twice the amount of space compared to a decade ago.\nDr Lim Po Teen, a marine scientist with the University of Malaya, said climate change was in part to blame for the blooms, by affecting temperatures and weather patterns.\n\"But on a local level, you can see the number of farms increasing in the last few years\", he said, which is directly increasing the level of nutrients in the water from fish food and waste.\n\"We need to have very strict controls and improve the water circulation.\"\nSome of the farmers reeling from the loss of their stock were considering moving away altogether to less troubled waters.\n\"This weekend's incident was the worst I'd ever seen. Everyone is horrified.\" said Mr Tan. \"We may have to relocate now.\" He said he was eyeing spots to the south of Singapore.\nBut many of the farmers were hoping to get through the year by restocking with new fry and selling what little they could save of their remaining stock. Said Mr Ang: \"We are trying to explain to people that our fish is still edible. We just need to regain people's trust.\"\nAdditional reporting by Heather Chen", "url": "https://www.bbc.com/news/world-asia-31724554"}