{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:33:30", "date_modify": "2025-04-26 06:33:30", "date_publish": "2025-02-27 06:43:53", "description": "Zack Kerr has been campaigning for Changing Places facilities at motorway service stations since 2017.", "filename": "news_articles_cp8lkryz2p5o_1745649210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8563/live/25b02820-f474-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8lkryz2p5o_1745649210.html", "title": "Man's pride as 54 accessible toilets installed at service stations", "title_page": "Man's pride as 54 accessible toilets installed at service stations - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who has helped steer a campaign for more accessible toilets at service stations is celebrating as 54 new ones have now been installed on the motorway network in England.\nZack Kerr, who has cerebral palsy, and his family have been fighting for facilities for severely disabled people known as Changing Places toilets (CPT) since 2017.\nIt followed a \"distressing\" journey from his home in Oswaldtwistle, Lancashire, to south Wales when he made three stops at services and none had accessible changing facilities.\nMr Kerr said he was \"really proud\" after the new CPTs were added to motorway services, adding they would \"make a huge difference to people's lives\".\nChanging Places facilities are designed for people who need facilities that are not provided in standard disabled toilets, and include equipment such as a hoist, privacy screens and an adult-sized changing bench.\nThe new CPTs were funded as part of a £2m grant by the Department for Transport in association with Muscular Dystrophy UK.\nMr Kerr, whose father is Ceri Davies the Changing Places Programme Officer, told BBC Radio Lancashire: \"I am very happy about the success of my campaign and I am really proud of what I have achieved from starting out with my petition in 2017.\"\nThe 29-year-old, who has won the positive role model award for disability at the National Diversity Awards, said: \"It's been a long journey and sometimes I really can't believe what has happened.\"\nHe added: \"The [Changing Places] will all make a huge difference to people's lives.\"\nSpeaking about the \"distressing\" trip that inspired his campaign eight years ago, Mr Kerr said: \"We stopped at three service stations on route along the M62, M6 and M5 but none of them had an accessible changing facility.\"\nMr Kerr added: \"There were about 10 [Changing Places] in the whole country and none of them were north of Birmingham\".", "url": "https://www.bbc.co.uk/news/articles/cp8lkryz2p5o"}