{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:51:36", "date_modify": "2025-05-19 14:51:36", "date_publish": "2015-03-06 07:54:22", "description": "Archaeologists and officials express outrage about the reported bulldozing of the ancient Assyrian city of Nimrud in Iraq by Islamic State (IS) militants.", "filename": "news_world-middle-east-31760656_1747666296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81436000/jpg/_81436039_7d3128b3-a0c8-4d16-8136-0b67b028909c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31760656_1747666296.html", "title": "Nimrud: Outcry as IS bulldozers attack ancient Iraq site", "title_page": "Nimrud: Outcry as IS bulldozers attack ancient Iraq site - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Archaeologists and officials have expressed outrage about the bulldozing of the ancient Assyrian city of Nimrud by Islamic State militants in Iraq.\nIS began demolishing the site, which was founded in the 13th Century BC, on Thursday, according to Iraqi officials.\nThe head of the UN's cultural agency condemned the \"systematic\" destruction in Iraq as a \"war crime\".\nIS, which controls large areas of Iraq and Syria, says shrines and statues are \"false idols\" that have to be smashed.\n\"They are erasing our history,\" said Iraqi archaeologist Lamia al-Gailani.\nNimrud lies on the Tigris river, about 30km (18 miles) south-east of Mosul, which IS controls.\nMany of the artefacts found there have been moved to museums in Baghdad and overseas, but many remain on site.\nBBC Middle East correspondent Jim Muir says the attempt to destroy Nimrud is already being compared with the Taliban's demolition of the Bamiyan Buddha rock sculptures in Afghanistan in 2001.\nAs well as destroying artefacts, Islamic State also trades in them - and the trade is one of its key sources of revenue, external.\nIS \"assaulted the historic city of Nimrud and bulldozed it with heavy vehicles,\" the tourism and antiquities ministry said on Thursday.\nIt said the militants continued to \"defy the will of the world and the feelings of humanity\", calling for a UN Security Council meeting to discuss how to protect cultural heritage in Iraq.\nNimrud covers a large area, and it is not yet clear whether it has been totally destroyed, our correspondent says.\nBut a local tribal source told Reuters news agency: \"Islamic State members came to the Nimrud archaeological city and looted the valuables in it and then they proceeded to level the site to the ground.\n\"There used to be statues and walls as well as a castle that Islamic State has destroyed completely.\"\nIn the video, the artefacts are described as \"false idols\" and their destruction justified in religious terms.\nThat attack was also condemned by the UN as a war crime.\nIS has controlled Mosul, Iraq's second largest city, and nearby areas since June 2014 - a region with nearly 1,800 of the country's 12,000 registered archaeological sites.\nIraqi forces and Shia militia, have united to try to drive IS militants from the northern city of Tikrit, with the support of Iran.\nThe militants are also being targeted by a US-led coalition mounting air strikes.\nOn Friday, Iraqi forces were said to have cleared IS fighters from the town of al-Baghdadi, in the western Anbar province, with the support of US-led strikes.\nThe town, which was taken over by IS last month, is about 8km (5 miles) from an air base housing hundreds of US troops who are training Iraqi soldiers.", "url": "https://www.bbc.com/news/world-middle-east-31760656"}