{"authors": ["Ian Aikman & James Gregory", "www.facebook.com"], "date_download": "2025-04-26 08:09:29", "date_modify": "2025-04-26 08:09:29", "date_publish": "2025-02-26 13:10:51", "description": "The US and Ukraine have taken the first step to finalising a deal that would set up an investment fund for Ukraine's reconstruction.", "filename": "news_articles_cn527pz54neo_1745654969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ffe3/live/4004c9d0-f463-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn527pz54neo_1745654969.html", "title": "Ukraine minerals deal: What we know so far", "title_page": "Ukraine minerals deal: What we know so far - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Washington and Kyiv are moving closer to signing a deal involving Ukraine's mineral deposits, almost two months after President Volodymyr Zelensky first travelled to the US to finalise it - but failed to do so.\nDetails are still emerging about what the latest version of the agreement would include, but previous leaks suggest it may include control of Ukraine's energy infrastructure, oil and gas, in addition to minerals.\nA signed memorandum of intent, published by the Ukrainian government on 18 April, says the countries intend to set up an investment fund for the reconstruction of Ukraine as part of an economic partnership. Kyiv and Washington aim to finalise the text by 26 April, the memo says.\nThe initial agreement was due to be signed in February, but it was derailed after a meeting between US President Donald Trump and Zelensky turned into a public shouting match.\nThe memo released on Friday contains broad statements, saying the US and Ukraine \"intend to establish a reconstruction investment fund as part of an economic partnership between the two peoples and governments\".\nIt provides no detail as to how this fund would work, nor does it mention the word \"minerals\" at all.\nIt also does not include the promise of a security guarantee from the US, something Zelensky has pushed hard for throughout negotiations.\nTrump, for his part, has suggested a deal could act as compensation for US military aid given to Ukraine since Russia launched a full-scale invasion of its neighbour in February 2022.\nThe memo does not explicitly frame the agreement in this way, but it does make note of the US's \"significant financial and material support\" for Ukraine.\nUkrainian Economy Minister Yulia Svyrydenko acknowledged the text of the final document was still being worked on, but said she expected the deal to be \"very beneficial for both countries\".\nUkrainian Prime Minister Denys Shmyhal previously said the fund would be managed by Kyiv and Washington on \"equal terms\".\nClues about the agreement might be found in previous leaks, as US Treasury Secretary Scott Bessent has said the current deal was \"substantially what we'd agreed on previously\".\n\"When the president [Zelensky] was here, we had a memorandum of understanding,\" said Bessent, who signed the memo over a video call with Svyrydenko.\n\"We went straight to the big deal, and I think it's an 80-page agreement and that's what we'll be signing,\" he added.\nThe text prepared in February was never officially shared, but a version was published by Ukrainian media, external ahead of Zelensky's meeting with Trump.\nIt envisaged Ukraine contributing 50% of future proceeds from state-owned mineral resources, oil and gas to an investment fund, which would be used \"to promote the safety, security and prosperity of Ukraine\".\nIt also said the US would \"maintain a long-term financial commitment to the development of a stable and economically prosperous Ukraine\".\nSince that draft was published, multiple sources have told the BBC's US partner CBS News that the updated version would be different.\nThe extent of this change, though, remains unclear.\nDisagreement over the terms formed part of a deepening rift between Trump and Zelensky, days before he travelled to Washington to sign it.\nThe Ukrainian president rejected an initial request from the US for $500bn (£395bn) in mineral wealth, but this demand was dropped from the version published online.\nFriday's memo says the final agreement was still being worked out, with Shmyhal due to visit Washington next week to conclude \"technical discussions\".\nBoth countries aim to complete discussions by 26 April, with the aim of signing a final deal \"as soon as possible\", according to the memo.\nTrump has said he hopes to sign the deal sooner, by 24 April.\n\"We have a minerals deal which I guess is going to be signed on Thursday... next Thursday. Soon. And I assume they're going to live up to the deal. So we'll see. But we have a deal on that,\" he said this week.\nTrump had previously said he and Zelensky would sign the deal during February's meeting at the White House.\nUkrainian PM Shmyhal said a final version of the agreement had been prepared ahead of that meeting, though Zelensky aide Mykhaylo Podolyak said only a framework agreement was due to be signed.\nBut nothing at all was signed during the visit, which instead descended into a heated exchange between Trump and Zelensky in the Oval Office.\nAt one point, a furious Trump said Zelensky was not grateful enough for the US's support during the war, and that he was \"gambling with World War Three\".\nHe said Zelensky had to \"make a deal or we're out\", adding: \"You don't have the cards.\"\nNot long after - and well ahead of schedule - the Ukrainian president was seen leaving the White House.\nThe White House then announced the deal had not been agreed - and said Trump had decided to call off the signing ceremony himself.", "url": "https://www.bbc.co.uk/news/articles/cn527pz54neo"}