{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:04:40", "date_modify": "2025-04-26 04:04:40", "date_publish": "2025-03-03 18:25:33", "description": "The four-piece released a string of acclaimed EPs and albums before breaking up in 2004.", "filename": "news_articles_c62zvm40y4po_1745640280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b1a5/live/ac364b50-f856-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zvm40y4po_1745640280.html", "title": "Beta Band reform for new tour after 21 years away", "title_page": "Beta Band reform for new tour after 21 years away - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Indie rock group The Beta Band are to reunite for their first tour in 21 years.\nThe four-piece formed in Fife in 1996 and released a string of acclaimed EPs and albums before breaking up in 2004.\nThe reunion tour begins on 25 September at Glasgow's Barrowlands, before dates in Leeds, Bristol, Nottingham, London and Manchester. This will be followed by a run of American shows.\nThe group said they would play their 1998 album The Three E.P.'s - which collected their early recordings - as well as \"other classics\" on the tour.\nThe band said: \"The Beta Band, as everyone knows, is an institution, like Bedlam, or the RSPCA, and as such has its own indelible stain on the bedsheet of Western culture.\n\"It was the great John Noakes who said 'you have to shake it out at least once every couple of decades, if you want to know what the moths did.'\n\"So with both those facts in mind, we realise the time has come to show the wall the Luminol, kill the lights and hit the UV.\"\nThe line-up for the tour will be Steve Mason on guitar and vocals, Richard Greentree on bass, John Maclean on samples and keyboards and Robin Jones on drums.\nTheir music featured in Hollywood film High Fidelity, where their track Dry the Rain was spotlighted by the main character, played by John Cusack.\nAfter the band split following an Edinburgh gig in December 2004, Mason released music as a solo artist while Maclean and Jones formed another band, the Aliens.\nMaclean also moved into film, directing Slow West in 2015 and this year's Tornado, which opened the Glasgow Film Festival last week.", "url": "https://www.bbc.co.uk/news/articles/c62zvm40y4po"}