{"authors": ["Becky Morton", "www.facebook.com"], "date_download": "2025-04-26 03:50:03", "date_modify": "2025-04-26 03:50:03", "date_publish": "2025-03-05 13:07:49", "description": "US vice-president has faced criticism for saying \"20,000 troops from some random country\" will not deter Putin.", "filename": "news_articles_cz9nkz928v9o_1745639403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5649/live/3268f120-f9e5-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9nkz928v9o_1745639403.html", "title": "PMQs: Keir Starmer pays tribute to British troops after JD Vance comments", "title_page": "PMQs: Keir Starmer pays tribute to British troops after JD Vance comments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has paid tribute to British veterans who fought in Afghanistan and Iraq, after US Vice-President JD Vance was accused of disrespecting UK troops.\nWithout directly referring to Vance's comments, Sir Keir opened Prime Minister's Questions by remembering those who \"died fighting for Britain alongside our allies\".\nOn Tuesday, Vance was criticised for saying a US stake in Ukraine's economy was a \"better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years\".\nThe UK and France have said they would be willing to put troops in Ukraine as part of a peace deal - although Vance later insisted he did not mention either country.\nThe prime minister told the Commons: \"Tomorrow marks 13 years since six young British soldiers were on patrol in Afghanistan when their vehicle was struck by an explosive tragically killing them all.\"\nHe added: \"These men fought and died for their country, our country. And across the wars in Afghanistan and Iraq, 642 individuals died fighting for Britain alongside our allies, many more were wounded.\n\"We will never forget their bravery and their sacrifice, and I know the whole House will join me in remembering them and all those who serve our country.\"\nChallenged over whether the tribute was a direct response to Vance's comments, the prime minister's official spokesman said: \"You can draw your own conclusions.\"\nIt is not standard practice for the PM to mark the anniversaries of the deaths of soldiers.\nVance's comments were later raised by Liberal Democrat MP Richard Foord, who suggested the vice-president should have more respect for those who lost their lives.\nHe asked Sir Keir whether he would remind the US government the UK supported the country in Iraq following the 9/11 attacks.\nIn response, the PM said: \"He speaks for the whole House.\n\"We do remember the role we played historically with our allies and we particularly remember those that made the ultimate sacrifice in that duty for their country and for our allies and that's why it's so important that we make that point today.\"\nAlthough Vance did not specify which country or countries he was referring to in his interview with Fox News's Hannity programme, he later stressed that he did not mention the UK or France.\nIn a social media post, he said: \"But let's be direct: there are many countries who are volunteering (privately or publicly) support who have neither the battlefield experience nor the military equipment to do anything meaningful.\"\nSo far only the UK and France have publicly committed troops towards policing any potential peace deal in Ukraine, although Sir Keir has previously said a \"number of countries\" have agreed to.\nVance's original comments drew criticism from opposition MPs in the UK, as well as the French armed forces minister.\nThe UK joined the US invasion of Afghanistan in October 2001, following the 9/11 attacks, with France also sending forces to the country.\nThe UK was also part of a US-led invasion of Iraq in March 2003, with British forces in the country peaking at 46,000.\nDuring Prime Minister's Questions, Sir Keir was asked about reports that the US had told the UK to suspend intelligence-sharing with Ukraine, after it paused military aid to the country this week.\nThe PM did not respond directly but said: \"We work very closely with the United States on defence, on security and on intelligence.\"\nHe also insisted the US was still \"a reliable ally\" despite the move to suspend aid to Ukraine.\nEarlier, the head of the US Central Intelligence Agency (CIA), John Ratcliffe, appeared to confirm the US had also cut off intelligence sharing with Ukraine alongside aid.\nFollowing the session in the Commons, Sir Keir's official spokesman was asked whether the UK would still be allowed to pass on American intelligence to Kyiv.\n\"It does remain a long-standing position not to comment on intelligence, but what I would say is that we have been clear previously that we will do everything to put Ukraine in the strongest possible position across all aspects of our support, particularly around defence and security, and that position hasn't changed,\" he said.\nIt was an unusually quiet PMQs, with Conservative leader Kemi Badenoch restrained in her exchanges with Sir Keir.\nWhile she praised the prime minister's efforts during his visit to Washington last week, Badenoch also pressed him over what further steps were been taken to obtain a US security guarantee for Ukraine.\nIn response, Sir Keir said he did discuss security guarantees with Donald Trump and the president made clear his commitment to the Nato principle that if one member of the alliance is attacked, others will come to their aid.\nHe added that the US \"would have our backs\" and Trump agreed to further talks over the issue.\nSir Keir has said US security guarantees - such as air cover - will be needed to deter Vladimir Putin from invading Ukraine again, if there is a deal to end the war.\nHowever, Trump has so far refused to pledge this, instead arguing that US workers in Ukraine as part of a minerals deal could provide such assurances.", "url": "https://www.bbc.co.uk/news/articles/cz9nkz928v9o"}