{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:41", "date_modify": "2025-05-19 14:25:41", "date_publish": "2015-03-26 16:07:18", "description": "Police are searching for a man who subjected a 20-year-old woman to a \"horrendous\" rape in South Lanarkshire.", "filename": "news_uk-scotland-glasgow-west-32072482_1747664741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81928000/jpg/_81928261_81928260.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-glasgow-west-32072482_1747664741.html", "title": "Woman, 20, suffers 'horrendous' rape in Uddingston woods", "title_page": "Woman, 20, suffers 'horrendous' rape in Uddingston woods - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Police are searching for a man who subjected a 20-year-old woman to a \"horrendous\" rape in South Lanarkshire.\nThe woman was walking home from Uddingston train station when she was approached from behind by a man at about 22:15 on Tuesday.\nHe raped her in a wooded area close to the town's Castle Gate.\nThe suspect is described as white, aged between 30 and 50-years-old and about 5ft 9in tall. He was wearing dark clothing including a hood.\nThe man is also described as having red hair and red facial hair\nPolice said he left the area in an unknown direction following the attack and the woman immediately contacted police.\nDet Insp Tom Carty, of Police Scotland, said: \"This was a horrendous ordeal for a young woman to have to experience and it is critical that we trace this man as soon as possible.\n\"I would like to reassure the community that our officers are doing everything they can to find the person responsible.\n\"Incidents like this are extremely rare particularly in this area. However, we need help from members of the public who may have vital information to assist with the investigation.\"\nHe added: \"We are looking to speak to anyone who was in the area of Uddingston train station, Main Street Uddingston, Castle Avenue and Castle Gate between 21:15 and 22:30 on Tuesday 24th March 2015.\"\n\"I would urge anyone who was in the surrounding area around that time who may have seen a man matching this description to contact police immediately.\"\nDet Insp Carty said officers were continuing inquiries at the scene, analysing CCTV footage and conducting door-to-door inquiries.", "url": "https://www.bbc.com/news/uk-scotland-glasgow-west-32072482"}