{"authors": ["Stuart Maisner", "www.facebook.com"], "date_download": "2025-04-26 03:55:00", "date_modify": "2025-04-26 03:55:00", "date_publish": "2025-03-04 16:40:40", "description": "JD Wetherspoon says it should not have been made to pay damages to a man injured by security staff.", "filename": "news_articles_ckg1jr04dpxo_1745639700.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9d32/live/145bba80-f915-11ef-b698-2d7c94e2f7af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg1jr04dpxo_1745639700.html", "title": "Guildford: Weatherspoon not liable for injury payout, court told", "title_page": "Guildford: Weatherspoon not liable for injury payout, court told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pub chain JD Wetherspoon should not have been made to pay £71,000 to a man whose hip was dislocated as he was restrained by two security guards, the High Court has heard.\nStephanus Bernardus Burger needed emergency surgery after the incident at The Rodboro Buildings in Guildford, Surrey, in August 2018, a hearing in London was told.\nIn September 2023, a judge awarded Mr Burger damages after finding the company \"vicariously liable\" despite the security guards being employed by Risk Solutions BG Ltd.\nJD Wetherspoon (JDW) is challenging the ruling, with its lawyers telling the hearing that the judge \"fell into error\" in his decision and that Risk Solutions was a \"true independent contractor\".\nIn written submissions, Jonathan Payne, for JDW, said: \"The training by Risk Solutions informed exactly how they (the security guards) performed their task and for which JDW had absolutely no input.\n\"On the night in question, JDW had no control and took no part in what happened.\"\nMr Payne told the court in written submissions that Mr Burger had attended the pub with two friends on the night of the incident but was refused entry.\nHe said the judge in 2023 found Mr Burger was walking away from the pub when one of the security guards jumped towards him with his knee or leg, connecting with his back and causing him to land face down.\nMr Payne said the judge found it was \"an unprovoked and cowardly attack on a man walking away from the pub\", which was \"a vendetta for Mr Burger's rude and insulting behaviour\".\nRisk Solutions was not represented at the hearing.\nLia Moses, for Mr Burger, told the court in written submissions that the relationship between JDW and the security staff was \"akin to employment\".\nShe said: \"Mr Burger's primary case is that (the judge) did not err in relation to his treatment of these matters, taking into account the evidence that was available.\"\nShe added that the finding that Mr Burger should be awarded the costs of private treatment is not \"rationally insupportable\".\nMr Justice Sweeting is expected to hand down a judgment in writing at a later date.\nAdditional reporting by PA Media.", "url": "https://www.bbc.co.uk/news/articles/ckg1jr04dpxo"}