{"authors": ["James Landale", "www.facebook.com"], "date_download": "2025-04-26 04:07:53", "date_modify": "2025-04-26 04:07:53", "date_publish": "2025-03-02 21:33:37", "description": "Europe stepping up is only half of the story and much depends on whether the US is willing to play its part.", "filename": "news_articles_cn04551n6wpo_1745640473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ecb9/live/8acae3d0-f7ad-11ef-b95c-5969b6e5ad46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04551n6wpo_1745640473.html", "title": "Was Starmer's summit enough to shift the diplomatic dial?", "title_page": "Was Starmer's summit enough to shift the diplomatic dial? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lancaster House may have been bathed in sunshine as European leaders gathered to chart a way forward for Ukraine.\nBut there was a cloud hanging over the summit amid the gilt-edged grandeur of the former royal townhouse in central London.\nIt came in the form of a question - was it all worth it? Was this gathering of European powers enough to shift the diplomatic dial? Or had the United States made up its mind to go it alone on finding a ceasefire in Ukraine?\nThe prime minister's answer was very much that Europe still had a role to play. He said the UK, France and others would work with Ukraine on a plan to stop the fighting and then discuss that plan with the US.\nHe said Europe would keep military aid flowing now and, in the event of a peace deal, it would boost Ukraine's own defensive capabilities, building up the country's \"armed forces and border defences\" to ensure that \"Ukraine can draw on munitions, finance and equipment to defend itself,\" according to the official conclusions of the summit.\nAnd Sir Keir said there would be a \"coalition of the willing\" to defend Ukraine and guarantee peace.\nWho or what that would involve is not yet clear. The prime minister merely said that there would be \"a force consisting of European and other partners\".\nThe UK and France have already said they would be willing to put boots on the ground in Ukraine to help deter Russian aggression.\nThe European Commission chief, Ursula von der Leyen, said the purpose was to turn Ukraine into a \"steel porcupine that is indigestible for potential invaders\".\nThe aim, it would appear, is to beef up the European offer for post-war security guarantees for Ukraine in an attempt to convince Donald Trump to promise a US military backstop.\nThe president has thus far been reluctant to go down that route, suggesting the presence of US mining firms on the ground in Ukraine would be enough to keep the peace.\nSir Keir does not share this view, saying explicitly \"to support peace on our continent and to succeed, this effort must have strong US backing\".\nThis summit was in many ways an attempt by Europe to take some ownership of the diplomacy. In recent weeks, efforts to end fighting in Ukraine have been led by Trump speaking to Russian's President Vladimir Putin and at his Ukrainian counterpart Volodymyr Zelensky.\nThe Europeans also wanted to find ways of repairing the transatlantic alliance, which is looking pretty fragile after the confrontation between Trump and Zelensky in the Oval Office on Friday.\nThe summit in London was an attempt by the prime minister both to calm diplomatic brows and stiffen diplomatic sinews. Diplomats said there was clear resolve around the table to support Ukraine but also to build on Trump's desire to find a ceasefire.\nBut Europe stepping up is only half of the story and much depends on whether the US is willing to play its part.\nDiplomats say the US is willing to de-escalate the tensions with Zelensky, but there were mixed messages on Sunday. The US Secretary of State Marco Rubio said America was ready to engage with Ukraine, but the National Security Adviser Mike Waltz suggested Zelensky might have to resign as part of any ceasefire.\nSo the outcome of the Lancaster House summit was seemingly a united European front in backing Zelensky, with the promise of more military support for Ukraine to come.\nBut the cloud lurking in the London skies remains what the United States does next. And that is not yet clear. Trump and his deputy have made their antipathy towards Zelensky as clear as their trust in Putin.", "url": "https://www.bbc.co.uk/news/articles/cn04551n6wpo"}