{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:14:29", "date_modify": "2025-04-26 04:14:29", "date_publish": "2025-03-04 11:04:33", "description": "New figures show over 90% of children and young people referred for care started treatment within 18 weeks.", "filename": "news_articles_c7vzrzd0v57o_1745640869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5ca3/live/8bd1b3b0-f8e5-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7vzrzd0v57o_1745640869.html", "title": "Children's mental health waiting times target met for first time", "title_page": "Children's mental health waiting times target met for first time - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Just over 90% of children and young people being referred for mental health care in Scotland started treatment within 18 weeks, the latest official figures show.\nIt is the first time the Scottish government target for referrals to Child and Adolescent Mental Health Services (CAMHS) has been met since it was set over a decade ago.\nHowever, the Public Health Scotland data, external also reveals that for the three months to December last year there was a slight increase in the overall number of young people waiting to start treatment.\nThat figure of 4,362 was up by 3.1% (131) compared to 4,231 in the previous quarter.\nIn total, 8,919 children and young people were referred to CAMHS in Scotland.\nOf those, 3,812 started treatment.\nThat was up by 0.3% from 3,801 in the previous quarter, and down by 15.9% from 4,531 in the same period at the end of 2023.\nHalf of the children and young people started treatment within four weeks of referral, which was down from six weeks in both the previous quarter and the corresponding 2023 figure.\nTo help cut waiting times, some health boards are setting up new referral pathways for children with conditions such as ADHD or autism.\nThe move has been welcomed by specialists and charities but they warn that without additional staff it will lead to competition for resources.\nCurrently there is no national data to show how many children are waiting for neurodivergence assessments instead of waiting to see a CAMHS specialist.\nDr Kandarp Joshi, who chairs the CAMHS Faculty at Royal College of Psychiatrists in Scotland, said meeting the 18-week waiting time target for the first time was welcome news, \"but ministers cannot assume the job is now done\".\nHe added: \"Alarmingly, waiting times may be even higher because the Scottish government don't report on the wait after a young person's first assessment.\n\"They also don't take into the account the waiting times for neurodevelopmental conditions such as Autism or ADHD - which are also on the rise.\n\"The Scottish government must keep their own promise to commit 10% of the total NHS spend towards mental health and 1% for CAMHS, because young people with severe and complex mental health conditions need investment more than ever.\"\nThe Scottish Children's Services Coalition (SCSC), an alliance of care and education providers, also raised concerns that 145 children and young people have been waiting more than a year for mental health treatment.\nA spokesperson said: \"Each one of these statistics is an individual, and we would urge the Scottish government ensure the adequate resourcing of mental health services for our children and young people so that they can get the care and support they need, without lengthy waits.\"\nThe charity Children First said the progress on meeting waiting times targets should be applauded, but \"it shouldn't deflect attention from the still growing mental health crisis among Scotland's children and young people\".\nChief executive Mary Glasgow said: \"The fact remains that children are often not getting support until they are in severe distress. This must stop.\n\"The Scottish government must invest more in early help and support to prevent children reaching crisis point.\"\nWhat we see in today's data is an increase in the proportion of under-18s starting treatment, which will be seen as positive news.\nBut at the same time, more children are being referred and more are on waiting lists, which indicates demand continues to grow.\nAnd the numbers don't tell the full story.\nFor many years, specialists have been arguing that CAMHS should focus on children with the most serious mental health issues and that services in schools and the community should be developed that could better support young people with milder anxiety or conditions such as ADHD or autism.\nIn response to this, health boards have been setting up separate referral routes for young people who may have neurodevelopmental conditions, but at the moment there is no national data to tell us how many are waiting for these assessments instead of waiting to see a CAMHS specialist.\nSome families have told us they are left in limbo after being told it will take up to three years for an ADHD assessment on the NHS, and charities warn there is a risk of competing resources with shortages of psychologists and psychiatrists.\nStill, the government says it is not complacent and will continue to invest in child and adolescent mental health services.\nThe first minister has made it a priority for his government to clear the CAMHS backlog by the end of this year.", "url": "https://www.bbc.co.uk/news/articles/c7vzrzd0v57o"}