{"authors": ["Nadira Tudor", "www.facebook.com"], "date_download": "2025-04-26 03:55:12", "date_modify": "2025-04-26 03:55:12", "date_publish": "2025-03-04 16:32:30", "description": "The government says the towns could use the money on setting up community grocers.", "filename": "news_articles_ce8yzy6y20xo_1745639712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f434/live/f7d48a90-f8e7-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yzy6y20xo_1745639712.html", "title": "Harlow, Canvey and Clacton to receive High Streets cash", "title_page": "Harlow, Canvey and Clacton to receive High Streets cash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three towns in Essex have been promised a slice of £1.5bn in funding which the Labour government says will \"restore pride in neighbourhoods\".\nHarlow, Canvey Island and Clacton-on-Sea are due to receive up to £20m each from the government's Plan for Neighbourhoods, external.\nThe money could be spent on issues such as High Street paving and setting up low-cost community grocers, the government said.\n\"When our local neighbourhoods thrive, the rest of the country thrives too,\" said Local Growth Minister Alex Norris.\nThe money was announced by the previous administration as part of its Long-Term Plan for Towns.\nHowever, Labour said the Tories' package was made up of \"unfunded pledges\" and the new plan \"doubles the scope\" of the projects that would be targeted.\nThe Ministry of Housing, Communities and Local Government said local boards - made up of residents, businesses and \"campaigners\" - would decide how the money would be spent.\nMayors would also have a formal role, a spokesperson said.\nIn total, 75 places across the UK were told they would receive the money.\nThis includes Great Yarmouth, King's Lynn and Thetford in Norfolk, and Wisbech in Cambridgeshire.", "url": "https://www.bbc.co.uk/news/articles/ce8yzy6y20xo"}