{"authors": ["Katie Razzall", "www.facebook.com"], "date_download": "2025-04-26 06:25:23", "date_modify": "2025-04-26 06:25:23", "date_publish": "2025-02-28 22:16:23", "description": "Fallout from the film about Gaza's children is a reputationally damaging mess, says the BBC's media editor Katie Razzall.", "filename": "news_articles_c2d4egk17l2o_1745648723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3432/live/c69028e0-f5ef-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2d4egk17l2o_1745648723.html", "title": "Questions still remain for BBC after damaging Gaza documentary", "title_page": "Questions still remain for BBC after damaging Gaza documentary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As guests sat down on the red cinema-style seats in the screening room of a plush central London hotel, nobody could have imagined that, less than a month later, the BBC would find itself forced to apologise for serious and unacceptable flaws in the documentary that was about to be shown.\nIn the darkness, Gaza: How to Survive a Warzone unfolded over an hour, telling in bleak and upsetting detail the story of Gaza's children over recent months of the war.\nScreenings are standard practice for media companies, primarily for outside press to review a programme ahead of broadcast.\nAlso in the room was BBC News CEO Deborah Turness and other senior executives from the BBC's news and current affairs to view what one described as a \"landmark\" piece of filmmaking.\nBut after the programme went out on BBC Two, it emerged that the child narrator at the heart of the film, 13-year old Abdullah, was the son of a Hamas government official. The outcry and accusations of anti-Israel bias and lack of transparency led the BBC to pull the film from iPlayer.\nQuestions were asked in Parliament.\nCriticism continued about the programme's subtitling choices – including contributors using the Arabic word for \"Jews\" on camera, which was translated in the subtitles as \"Israelis\" or \"Israeli army\". Some argue that the BBC covered up antisemitism. Others have claimed the subtitles are closer to what the speaker intends rather than a literal translation.\nAfter an initial investigation, the BBC said the programme, which had been commissioned by the BBC and made by an outside production company, \"fell short of our expectations\".\nIt launched a further review headed by the director of editorial complaints and reviews, Peter Johnston. He will look at whether editorial guidelines were broken and whether anyone should be disciplined.\nIt's a reputationally damaging mess, but how could it have happened? How did the commissioners of the programme not know that the child narrator's father was a deputy minister for agriculture in the Hamas-run government?\nThe BBC says it had asked the production company \"a number of times\" in writing during the making of the film about any connections he and his family might have with Hamas, a proscribed terrorist organisation by the US, UK and others.\nIn a statement on Thursday the BBC said Hoyo Films, the maker of the film, acknowledged it \"never told the BBC this fact\".\nBut what did it tell the BBC about the child?\nCrucially, the BBC failed to uncover the information itself.\nEmbarking on a documentary about one of the most polarising and contested issues of our age was always going to be challenging.\nThe talented director at Hoyo, Jamie Roberts, has won an Emmy award for his film about the evacuation of Kabul. He's award-nominated for a powerful documentary about the events of 6 January in the US. He also made a searing film for the BBC about the Ukraine war.\nBut he hadn't directed a documentary set in the Middle East before. He was working with the Palestinian journalist, Yousef Hammash, whose Gaza reporting for Channel 4 has won him a Bafta and an Emmy last year.\nThe BBC commissioners in current affairs will have known the programme wasn't without risk.\nIn circumstances like this, it's even more difficult to understand how the failings that have driven headlines for days - and done terrible damage to the BBC's reputation - could have occurred.\nProgramme-makers and commissioners have previously told me they draw up risk grids to ensure they have the answers to any criticism thrown at them about their documentaries. They check and check and check to ensure they won't face problems after their programmes go out - or if they do, that they have the counter-argument ready.\nDorothy Byrne, Channel 4's head of news and current affairs until 2020, told BBC Radio 4's Media Show she would have done her own checks rather than relying on the independent company.\n\"If I was making this film, I wouldn't just ask who the boy was, who his father was, who his mother was, I would ask for the entire family tree. They could easily have found out about him, it shows that due diligence was not done.\n\"I didn't wait for people to inform me of things,\" she added. \"I asked them the right questions.\"\nByrne says in her view the film isn't \"pro-Hamas\".\nWatching it, I was struck by the efforts at balance. It contains voices who curse the leaders of Gaza.\nOne of the children followed by the documentary, 11-year old Zakaria, says he doesn't like Hamas \"because they started the war, they caused all this misery, this is wrong\". A woman says \"they are causing us harm\". There's a conversation about why taking Israeli civilians hostage is wrong.\nBut we also see the horrors and violence of what's taken place in Gaza - through the eyes of children. Zakaria, who hangs around the hospital to help the paramedics rather than remaining with his family because, he says, there's no food and water where they are, tells the camera he thinks he's seen 5,000 dead bodies.\nRenat who's 10 and is building up a social media presence with an online cookery show, describes drones that shoot bullets. She smiles and laughs wildly on camera, as she describes, still clearly traumatised, how a bomb just exploded right next to her as she was walking outside her apartment.\nAs the press release put it, the documentary is an \"unflinching and vivid view of life in a warzone\". It's the kind of programme Turness said, as the BBC apologised, that her department \"should be doing\".\nBut she added \"Of course we have to get it right.\"\nThe BBC brand is based on impartiality - on being trusted around the world. All of us in news and current affairs take fact-checking very seriously. Mistakes are sometimes made, of course. But on this occasion both the independent production company and the BBC made serious errors which threaten trust in the corporation.\nSince joining the BBC as head of news in 2022, Turness has prioritised transparency to grow trust. Not informing viewers about the child narrator's family story is the opposite of transparent.\nShe will have trusted the experienced BBC commissioners who oversaw the programme to do the appropriate due diligence. They will have trusted the filmmakers and the executive working with them.\nThis isn't the end of the story and questions still remain. What exactly did the BBC ask about the boy and his family's potential connections to Hamas? Hoyo Films has said it's \"co-operating fully with the BBC and Peter Johnston to help understand where mistakes have been made\".\nThere's also the question about exactly how much was the \"limited sum\" paid for the young narrator's work - and whether that money ended up in the hands of Hamas. Yesterday in Parliament, Lisa Nandy said she had sought assurances from the BBC that it hadn't.\nThe scandal comes in a week in which the BBC already was apologising over its failure to tackle behaviour by the DJ Tim Westwood - after a separate review that cost more than £3m.\nWhat's happened has damaged trust in the BBC in so many ways. Those who argue the corporation is biased against Israel will feel vindicated.\nLeo Pearlman, co-CEO of the major British production company Fulwell 73, told us on Radio 4 that the BBC has \"gaslit the Jewish community\" in the 16 months since October 7th and that this documentary parroted 'the propaganda of Hamas\".\nFor others who view the BBC as having anti-Palestinian bias, the decision to pull the documentary and apologise will confirm their beliefs.\nGary Lineker, Anita Rani, Riz Ahmed and Miriam Margolyes are among those who signed a letter published by Artists for Palestine UK, which says the claims about the identity of the child's father are \"misleading\" and that to conflate his \"civil service role\" with terrorism is \"factually incorrect\".\nThe International Centre of Justice for Palestinians has lodged a formal complaint against the BBC for taking down the documentary and \"suppressing the testimony of Palestinians\". It says the deputy minister for agriculture's role involves \"food production relating to crops, fishing and livestock\".\nWhat's unfolded since the programme's broadcast is unlikely to change minds on any side.\nThe losers in all this are the young citizens of Gaza. The stories of the children in this film - and the suffering they have endured - aren't now being seen.\nHoyo Films said it believes \"this remains an important story to tell, and that our contributors – who have no say in the war – should have their voices heard\".\nThe BBC has made clear it has no plans to broadcast the programme again in its current form or return it to iPlayer.", "url": "https://www.bbc.co.uk/news/articles/c2d4egk17l2o"}