{"authors": ["Jasmine Coleman", "www.facebook.com"], "date_download": "2025-05-19 14:47:25", "date_modify": "2025-05-19 14:47:25", "date_publish": "2015-03-04 10:19:01", "description": "Europe's top human rights watchdog criticises France for failing to explicitly ban smacking children, saying its laws are \"not sufficiently clear\".", "filename": "news_world-europe-31727515_1747666045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81350000/jpg/_81350116_81350111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31727515_1747666045.html", "title": "France violates treaty on smacking - Council of Europe", "title_page": "France violates treaty on smacking - Council of Europe - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Europe's top human rights watchdog has criticised France for its failure to explicitly ban smacking children.\nThe Council of Europe said that France's laws on corporal punishment were \"not sufficiently clear, binding and specific\".\nFrench law forbids violence against children, but recognises the parents' \"right to discipline\" children.\nThe ruling follows a complaint by a British children's charity against France and six other EU countries.\nThe charity, Approach, says the countries are violating a section of the European Social Charter, external calling on signatories to protect children.\nThe Council of Europe, which has no power to sanction member states, has called for all of its 47 members to ban corporal punishment of children. So far, 27 have banned the practice.\nIn its decision published, external on Wednesday, the Council's European Committee of Social Rights said: \"There is now a wide consensus at both the European and international level among human rights bodies that the corporal punishment of children should be expressly and comprehensively prohibited in law.\"\nWelcoming the ruling, Approach spokesman Peter Newell said: \"In many countries, violent punishment of children is the only form of inter-personal violence in the family that is still legal.\n\"We are pleased that the Council finds France in violation of the Social Charter.\"\nThe French government denied the allegations put forward by Approach, saying existing laws already offered sufficient protection for children.\nReacting to the media reports ahead of the ruling, France's Family Minister Laurence Rossignol said she did not believe it was necessary to legislate on the issue of smacking.\n\"We don't need a law, but we do need to collectively consider the usefulness of corporal punishment in bringing up children,\" she told AFP.\nOne poll from 2007 said 87% of French parents had smacked their children on the bottom, with 32% saying they had given them a \"resounding\" slap on the face.\nMeanwhile Gilles Lazimi, coordinator of an anti-smacking campaign by Fondation Pour L'Enfance, told the UK's Guardian newspaper, external that studies had shown that 50% of French parents hit their children before the age of two.\nPolls have shown widespread support in both Britain and France for the right to smack children.\nBut the laws in France have occasionally caused controversy.\nIn 2013, a father was fined €500 ($560; £364) for spanking his nine-year-old son, a case that reignited the debate about corporal punishment in France.\nThe Council of Europe is due to announce its decisions on other countries included in the Approach complaint in May.", "url": "https://www.bbc.com/news/world-europe-31727515"}