{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:32:21", "date_modify": "2025-04-26 06:32:21", "date_publish": "2025-02-27 08:11:25", "description": "Drag queen The Vivienne is recognised with a posthumous icon award at the first Metro Pride Awards.", "filename": "news_articles_cly888x7g24o_1745649141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe4c/live/248cd0a0-f4de-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly888x7g24o_1745649141.html", "title": "The Vivienne honoured with posthumous award", "title_page": "Liverpool: Drag star The Vivienne honoured with posthumous award - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Drag queen The Vivienne has been honoured with a posthumous icon award at the inaugural Metro Pride Awards.\nJames Lee Williams, who won the first series of RuPaul's Drag Race UK performing under the drag name, died at the age of 32 in January.\nThe TV star's family accepted the award during the London ceremony on Wednesday, hosted by TV and radio presenter Rylan Clark.\nSpeaking on the red carpet, Clark told the PA news agency: \"She's been taken way too soon... Viv was such a talented performer, and it's absolutely shocking that they're not with us anymore.\"\nRuPaul's Drag Race UK star Cheryl, who goes by Cheryl Hole and Cheryl The Queen, was among those who honoured The Vivienne with a special performance at the event.\nThe drag artist said: \"This event is the first of its kind, and she was the pioneer, the trailblazer of UK drag, and I truly am so honoured that we get to be here and keep her legacy alive and her spirit on fire.\"\nLast month friends and fans gathered to pay their respects in a vigil at St George's Hall in Liverpool which was lit up in green in a nod to the drag queen's role as the Wicked Witch of the West in The Wizard Of Oz musical.\nThe drag professional finished third on Dancing On Ice in 2023 and was honoured on the skating show when the latest series started in January.", "url": "https://www.bbc.co.uk/news/articles/cly888x7g24o"}