{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:48:03", "date_modify": "2025-05-19 14:48:03", "date_publish": "2015-02-18 00:59:12", "description": "As the Baltic states look on uneasily at Ukraine’s latest fragile ceasefire, what has the conflict revealed about the West’s military alliance Nato?", "filename": "news_world-europe-31503859_1747666083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81057000/jpg/_81057930_natoprotests_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31503859_1747666083.html", "title": "How strong is the Nato military alliance?", "title_page": "How strong is the Nato military alliance? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "War in Ukraine and the threat of conflict in the Baltics raise fundamental questions about the West's military alliance. What is Nato - the North Atlantic Treaty Organisation - for? And is it up to the job?\nDo would-be aggressors still believe that - as stated in Article 5 of Nato's founding treaty - an attack on one Nato member would be treated as an attack on all?\nFour expert witnesses including Anders Fogh Rasmussen - who led the organisation until a few months ago - share their insights with the BBC World Service's The Inquiry.\n\"But that leaves... at present less than 1% for signing new contracts for purchasing new kit, and modernising the equipment.\n\"And of course on that basis, you can keep things afloat for a short period, but it's an absolute killer over the longer haul.\"\nIt's a similar picture across many of Nato's member-states. Entire divisions and weapons systems have been dismantled over the past few decades.\nBut why not cut defence? After all, Nato was founded to block Soviet expansion into Europe - so with the collapse of the Soviet Union, hadn't it served its purpose?\n\"As the Cold War started softening up in the late 1980s, there was a justifiable call for reaping the so-called peace dividend, and reshuffle government spending away from defence to other policy areas.\n\"That established a trend of decreasing defence expenditures that has now carried through roughly three decades.\"\n\"The idea was that Nato had a critical role to play in uniting and democratising the European continent and that there was an opportunity now to create a new European security order, a security order that would be based on liberal democratic principles rather than spheres of influence or blocs or the balance of power.\"\nProfessor Moore says this unity was summed up by a book she heard about while travelling in the late 1990s - a collection of folk-tales gathered from Nato member-states.\n\"It was actually being distributed in Prague at the time that I was there by a Czech ministry of defence official to schoolchildren, and was quoted as having said that 'the book was important to teach people that Nato is not just about armies, it's about a broader relationship between countries'.\n\"That would be... a harder case to make today than it was at that time.\"\nThe key reason? Nato's size. At the end of the Cold War, the alliance had 16 members. Now it has 28.\n\"I would say that there is perhaps a lack of a really common vision, as to what the alliance's ultimate political purpose is.\"\nSome want the alliance to perform a more global role, conducting training and crisis-management missions such as those Nato carried out in Iraq, Afghanistan and Libya. Others say it should return to its original goal - defending Europe's borders.\n\"I think that's probably the disagreement that's been the most pronounced and that's had greatest impact on Nato decision-making in recent years.\"\n\"Every country who signs the Nato pledge when it joins says that an attack on one is an attack against all. So Nato is conceptually the strongest alliance that's ever been built.\"\nBut he acknowledges that strength isn't realised if aggressors don't believe that Nato will act when a member is attacked:\n\"Western democracies always have, traditionally, been slow to respond to these kinds of threats. It was after all France and Britain who failed to respond to Hitler's reoccupation of the Rhineland in 1936.\n\"Today the democracies have a difficult time coming to grips with the challenge of military force... and they don't want to admit that Putin, while he's trying to broker peace [is] a main proponent of war.\"\nGen Clark argues President Putin is exploiting this hesitance.\n\"He's playing the politics. He's playing the media, he's playing the economic card and he's manoeuvring.\n\"He understands the way western democracies work. Europe had two devastating wars in the 20th Century [and] nobody wants another one. He's learned that because Western democracies don't want to use force that he can get away with it.\"\nAnd with shrinking defence budgets, and war-weary populations Gen Clark says politicians need to work harder to get the public onside.\n\"It's the political leadership in member-states who have to help shape public opinion, and they have to see the situation clearly and call it as it is, not run from it. So Western leaders can't be so shy that they're intimidated by the bluster of a Vladimir Putin.\"\nOthers say Western leaders are being justifiably cautious.\nHow do you decide what constitutes an attack when the nature of warfare has changed: no longer state on state warfare, but little green men - Russian special forces in unmarked military uniform - crossing the border, and supporting separatists?\n\"The little green men are no different than the ploy that Hitler used to start World War II's attack against Poland where he dressed up German soldiers in Polish uniforms and had them attack a German radio station and kill a bunch of people, and claimed that was a provocation and used it for an attack.\n\"So there have always been tricks and ruses. These little green men are nothing more than Russian Special Forces people and the evidence is right in front of your face but we couldn't bring ourselves to admit it because we didn't want to admit the implications of direct Russian aggression.\"\n\"The crash of communism and the Soviet Union offered a new opportunity for Europeans to realise the dream of a Europe whole, free and at peace, so I think we did the right thing to try and include Russia in this vision. However, Russia didn't share that vision.\n\"I think we are now entering a new era that could be very much similar to the Cold War.\nHe says that the Baltic states are right to be worried about Russia's ambitions:\n\"Our Baltic friends and allies are concerned about the Russian behaviour, not least because one of the Russian doctrines is that Russia preserves the right to intervene in other countries, to protect what they consider the interests of Russian-speaking communities in other countries.\n\"And as we all know, particularly in Estonia and Latvia, we have significant Russian speaking minorities.\"\nAnd he argues Russia's provocations aren't just aimed at the Baltic states: they're also targeting Nato itself.\n\"Russia is constantly testing Nato resolve. We have seen a number of attempts to violate Nato airspace. We have seen very unfortunate incidents, for instance the capture of an Estonian military officer, the detention of a Lithuanian vessel, just to mention a couple of examples.\n\"We are now faced with this new hybrid warfare... so we have to adapt to improve our capability to address [it].\"\nDoes Russia's use of hybrid warfare make it harder, then, for Nato to decide what constitutes an attack on a member state?\n\"Yes it makes it more difficult, and that's also I think the single most important purpose of this Russian hybrid warfare to try to circumvent the activation of Nato's Article 5. But we are prepared for that and they won't succeed.\nSo how do you then define when an attack has happened which breaches Article 5?\n\"We never answer that question, because it is part of our deterrence that a potential aggressor never knows how and when an activation of Article 5 will be triggered.\"\nBut he says there's something else that Nato needs to make more obvious - and that's its resolve to respond once Article 5 has been triggered.\n\"We need to make it clearer. We have learned lessons from the Russian attack on Ukraine, we have seen that the Russians can act very fast. The single most important thing is to increase Nato presence in the east, and strengthen our collective defence so that the Russians know that if they were to attack a Nato ally they would cross a red line and they would meet not only troops from that specific country but from all Nato allies.\n\"The Russian aggression against Ukraine is a wake up call for everybody and Nato must adapt to that new situation.\"\nThe Inquiry is broadcast on the BBC World Service, Tuesdays from 13:05 GMT. Listen online or download the podcast.\nCORRECTION, 19 Feb 15: An earlier version of this piece referred incorrectly to \"applicant\" nations - that has now been corrected to read: \"Aspirant nations: Georgia, Bosnia, Macedonia, Montenegro\".", "url": "https://www.bbc.com/news/world-europe-31503859"}