{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:15:28", "date_modify": "2025-04-26 04:15:28", "date_publish": "2025-03-04 10:13:22", "description": "Bailiff Sir Timothy Le Cocq says his thoughts are with Mr Chinn's wife and family.", "filename": "news_articles_cvgelypd14wo_1745640928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f45b/live/bcfe1c10-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgelypd14wo_1745640928.html", "title": "Tributes paid to former States of Jersey Senator Tony Chinn", "title_page": "Tributes paid to former States of Jersey Senator Tony Chinn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "States members have been remembering former Jersey Senator Tony Chinn, who died aged 90.\nMr Chinn was first elected in 1990 to represent the island as a senator, serving a six-year term.\nHe was the chairman of the harbours and airport committee in 1995 when the Channiland ferry hit rocks near Corbière, and he later unveiled a sculpture commemorating the rescue of more than 300 people from the vessel.\nThe Bailiff, Sir Timothy Le Cocq, said his thoughts were with Mr Chinn's wife and family.\nAway from his role in the States Assembly, Mr Chinn worked at Hettich Jewellers, which was established by his grandfather in 1900.\nIn a statement, Hettich paid tribute to Mr Chinn, who \"was incredibly well respected as a businessman and politician, and he was also very well liked\".\nIt said: \"Tony's life ambition was to be successful in business, which he certainly achieved.\n\"He was able to retire knowing that Hettich was in the safe hands of his sons, Jeffrey and Nick, and he was able to witness the opening of their new flagship store in a building that he had always admired.\n\"His legacy will live on through his family and his contributions to Jersey life will be felt by generations of islanders to come.\"", "url": "https://www.bbc.co.uk/news/articles/cvgelypd14wo"}