{"authors": ["Anna Varle", "www.facebook.com"], "date_download": "2025-04-26 03:59:07", "date_modify": "2025-04-26 03:59:07", "date_publish": "2025-03-04 06:12:55", "description": "Trust says it addresses a shortage of clinical skills by recruiting people from around the world.", "filename": "news_articles_clyrgvym7d7o_1745639947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3041/live/83606f50-f81d-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrgvym7d7o_1745639947.html", "title": "Staff from 100 countries working at Devon hospital", "title_page": "Staff from 100 countries working at Devon hospital - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People from 100 different countries are working for a hospital trust in Devon.\nThe Royal Devon University Healthcare NHS Foundation Trust (RDUH) said it had a steady stream of international recruitment.\nChief People Officer Hannah Foster said: \"There's a shortage of a lot of clinical skills that we need in a lot of specialist areas.\n\"By recruiting people from around the world, they can help us address those long waits and meet those patient needs.\"\nInternational clinicians hired to roles in Devon include consultant cardiologist Ash Kotecha who has worked in the NHS since 2003 and at the Royal Devon and Exeter (RD&E) Hospital for 15 years.\nOriginally from India, he said: \"The journey hasn't been easy. As an international graduate, you work hard. There are prejudices and biases you have to overcome.\"\nBut he said many health care staff wanted to work in the NHS because it was based on clinical need, not on whether a person could afford it.\nHe said he had been in the UK for 22 years and had seen significant changes in the support that was offered in the NHS.\nBut he thought there was still a way to go: \"There is still room for changes in the mindset, the biases - conscious and unconscious - and the prejudices that we have.\"\nEddy Hernaez, an advanced ear, nose and throat (ENT) nurse at the RD&E is originally from the Philippines.\nHe said: \"Being different is sometimes challenging, but whatever obstacles you have experienced will make you stronger because you have value.\n\"Being able to work in a dynamic environment where there is good support and you are listened to makes a massive difference.\"\nWorkforce estimates from the Migration Observatory at the University of Oxford show the percentage of people working in direct care who were not born in the UK before the year 2000 was 5%, compared to 60% in 2022 onwards.\nManaging director of Southern Healthcare Geoffrey Cox said his company employed 70 international staff across four care homes in Devon who were mainly from India.\nHe said: \"They have been incredibly good; dedicated, hard working and integrated with the team.\"\nHowever, he added that Home Office requirements for foreign staff were very \"exacting\".\nHe said: \"If you have a sponsorship licence, you are liable to be inspected by them at any time and they are very thorough. That is quite disturbing.\n\"The rules seem to be tightening up to make it quite specific on what a person is doing, and any deviation or failure to notify them of some details - which may seem quite irrelevant or not particularly important - would be deemed as a non-compliance and you would risk your sponsorship licence and those people would lose their job.\"\nMr Cox said they had had to sub-contract their recruitment to a specialist firm in London to make sure they were compliant and \"that's very expensive\".", "url": "https://www.bbc.co.uk/news/articles/clyrgvym7d7o"}