{"authors": ["Matt Murray", "www.facebook.com"], "date_download": "2025-04-26 04:24:37", "date_modify": "2025-04-26 04:24:37", "date_publish": "2025-03-03 12:37:28", "description": "A 50-year-old man is sentenced to life imprisonment and will spend at least 20 years in jail.", "filename": "news_articles_c4gmr628l50o_1745641477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/413c/live/30000ef0-f85a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gmr628l50o_1745641477.html", "title": "Sophie Evans murderer Richard Jones jailed for life", "title_page": "Sophie Evans murderer Richard Jones jailed for life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been jailed for life for the murder of his son's partner after falsely believing she had scammed him.\nSophie Evans' body was found lying face down and naked on the kitchen floor of a house in Llanelli, Carmarthenshire, on 5 July 2024, after she was attacked and strangled.\nRichard Jones, 50, from Burry Port, Carmarthenshire, was found guilty of murder at Swansea Crown Court in January.\nJones was sentenced to life in prison and must serve a minimum of 20 years.\nJones believed Ms Evans was \"scamming\" him out of the deeds for his mother's house.\nHe visited her home shortly after she returned from taking her children to school, killed her and left the house.\nAt his trial, Jones admitted manslaughter with diminished responsibility but denied murder, saying he believed he was being financially taken advantage of by the victim and his son.\n\"Having heard all the evidence, including evidence from two psychiatrists, the jury rejected that claim [and] convicted him of murder,\" senior crown prosecutor Abul Hussain said in a statement following the sentencing.\n\"The evidence presented to the jury demonstrated that Richard Jones bore full responsibility for his callous actions.\"\nAt the trial, the jury saw an exchange between Jones and his former partner, Tracey Thompson, in which he called his son, Jamie Davies, and Ms Evans \"scamming thieves\" and said he had \"taken care of the problem\".\nConsultant psychiatrist Dr Dilum Jayawickrama, who interviewed the defendant, said Jones was \"100% certain in his beliefs\" he had been scammed.\nThe court heard Jones told officers he had been taken to a solicitor's office by Ms Evans to sign forms, leading him to believe he had signed over the deeds to his mother's house.\nDavid Elias, defending Jones, said his client's thoughts about being scammed were \"falsely held beliefs\" caused by a delusional disorder.\nMike Jones, prosecuting, said Jones \"was not experiencing significant emotional distress\" at the time of the murder and showed \"callous indifference\" to what he did to his victim.\nMr Jones also told the jury the defendant had \"by his own admission, a historic short fuse\", and on the day of the incident \"had lost his temper, attacked Sophie and strangled her, causing her death\".\nDuring Monday's hearing, Kerry Quinlan, Ms Evans' sister, read a victim statement on behalf of the family and said her death had \"changed our family forever\".\n\"She was the rock of our family and the best mum,\" she said, describing her murder as a \"cruel, senseless act\".\nShe added Ms Evans' two daughters \"cry to sleep every night asking for their mum, but they will never be able to see her again\".\nA personal statement from Jamie Davies, Ms Evans' partner, was also read to the court where he described her as \"the most beautiful person I could ask for\".\n\"What Richard did is truly unforgivable,\" he said.\nJudge Geraint Walters previously said the only sentence the courts could pass was life imprisonment, describing it as a \"frenzied attack on a woman in a towel in her own home\".\n\"The duration of the attack was short but it was frenzied and the force you used meant Sophie must have realised her life was in danger,\" he said.\n\"You left the property not making any calls to see if her life could have been saved.\n\"But instead you left the property calmly and went about your daily business of ordering a new bank card and buying pastries at a bakery. You didn't for a moment think about her. She laid dead for hours.\"", "url": "https://www.bbc.co.uk/news/articles/c4gmr628l50o"}