{"authors": ["Daisy Stephens", "www.facebook.com"], "date_download": "2025-04-26 04:40:35", "date_modify": "2025-04-26 04:40:35", "date_publish": "2025-03-02 07:20:23", "description": "Director Steve O'Connor said the River & Rowing Museum was facing a \"really difficult\" financial situation.", "filename": "news_articles_c2kgvjnkxl3o_1745642435.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2a41/live/a5a82220-f60a-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kgvjnkxl3o_1745642435.html", "title": "River & Rowing Museum in Henley could face closure", "title_page": "River & Rowing Museum in Henley could face closure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"beautiful and brilliant museum\" could face closure, its director has said.\nThe River & Rowing Museum in Henley on Thames, Oxfordshire, is facing a \"really difficult\" financial situation, according to Steve O'Connor, who said \"we're very, very open to all conversations\".\nThe museum is seeking ideas from the public on how it can change its operations in order to stay open.\nIt opened in 1998, and tells stories about the River Thames, its flora and fauna, rowing, and the culture and history of the local area.\nHe said the museum would be open as normal for most of 2025, but its long-term future was more uncertain: \"It's always been a challenge for this museum to operate sustainably but we've found the costs to maintain the building and the collection that we have is just outstripping any income.\"\nMr O'Connor said rising bills and national insurance contributions were partly to blame, but the maintenance of the 27-year-old building was the biggest problem.\n\"What we're looking for now is significantly change to what we do,\" he said.\n\"We don't necessarily know exactly what that looks like and that's part of the reason for us talking about this so widely, so we can start those conversations and get people coming forward.\"\nHe added: \"We shouldn't shy away from the fact that closure and loss of this amazing charity and museum is very much a real possibility.\n\"We hope that there would be a way forward for us not to do that.\"", "url": "https://www.bbc.co.uk/news/articles/c2kgvjnkxl3o"}