{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:55:30", "date_modify": "2025-04-26 07:55:30", "date_publish": "2025-02-25 12:52:05", "description": "A 15-year-old boy and 13-year-old girl are accused of killing Bhim Kohli at a park in Leicestershire.", "filename": "news_articles_cdel9kxkw53o_1745654130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b202/live/330e4910-f367-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdel9kxkw53o_1745654130.html", "title": "Bhim Kohli death: Man, 80, 'racially taunted' before fatal park attack", "title_page": "Bhim Kohli death: Man, 80, 'racially taunted' before fatal park attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 15-year-old boy kicked and punched an 80-year-old man to death in a park to \"let his anger out\" before falsely claiming he had threatened a girl with a knife, a court has heard.\nLeicester Crown Court was told the boy racially abused Bhim Kohli and slapped him in the face with a shoe while he was on his knees during the \"intense attack\", while a 13-year-old girl encouraged the violence and filmed it on her phone while laughing.\nMr Kohli died in hospital a day after the attack, which occurred yards from his home, in Franklin Park, Braunstone Town, Leicestershire, on 1 September last year.\nThe boy denies murder and manslaughter, while the girl denies manslaughter.\nProsecutor Harpreet Sandhu KC said: \"[Bhim Kohli] left his home on Bramble Way in Leicester. Having left his home, he walked a few yards to the entrance of Franklin Park, where he was going to take his dog for a walk.\n\"However, Mr Kohli would not get the opportunity to walk his dog for long and never would he return home. That is because in Franklin Park, Mr Kohli had the misfortune to encounter these two defendants.\"\nMr Kohli's cause of death was given as a neck injury causing spinal cord damage, and he had a number of other injuries including fractured ribs.\nMr Sandhu said: \"The prosecution say that as a result of causing those injuries, [the boy] is guilty of murdering Bhim Kohli and [the girl] who encouraged the causing of those injuries is guilty of manslaughter.\"\nMr Sandhu told the court the boy and girl had spent the afternoon together at Braunstone Park before going to the boy's home, where he changed his clothes and wore black sliders - a loose-fitting type of shoe similar in appearance to flip-flops - which the barrister said were used in the attack.\nHe said CCTV footage showed Mr Kohli walked with his dog Rocky to Franklin Park at about 18:18 BST, followed by the two defendants and three other children a few minutes later.\nThe 15-year-old boy could be seen carrying a balaclava, the prosecutor said, but it \"would not be long\" before he put it on.\nMr Kohli was spotted by the 13-year-old defendant, the court heard, who told the group that he had tried to hit one of the 15-year-old defendant's friends with a stick.\nThe prosecution said the defendants approached the victim but the other three children did not and two of them left the park.\nJurors were told that one of the friends who ran away told police they did so because they thought the 15-year-old boy was \"either going to start on him or be mean\".\nMr Sandhu said: \"[The girl] remained with [the boy]. She remained with him in order to support him in what was about to happen.\n\"Within four minutes and 40 seconds, he had put his balaclava on. He had put his balaclava on in preparation for the violence he was going to use against Mr Kohli.\"\nMr Sandhu told the court Mr Kohli was \"on his knees\" when the boy slapped him round the face with the slider shoe, which the girl filmed as she laughed.\nThe footage of the assault was shown to the jury.\nIn a message recovered from the boy's phone, the court heard he wrote: \"I watched him pull a knife out on a girl and hit her. I did not mean to batter him. My anger turned in.\"\nA friend of the boy told police the defendant said that he only meant to punch Mr Kohli once to his face \"to teach him not to do it again\", but instead he \"let his anger out\".\nMr Sandhu added: \"They had to think of a way to justify the violence which had been used.\n\"It was not Mr Kohli's habit to carry a knife, no knife was recovered from the clothing that Mr Kohli was wearing at the time, and no knife was recovered from Franklin Park.\"\nMr Sandhu told the court the boy knew the police would be looking for him, and messaged his mother and said he would not be home that night.\nThe next day, the boy searched for \"Franklin Park\" on Google the day after the attack and read a BBC News article about Mr Kohli, jurors heard.\nThe prosecution said he also created a Snapchat group with three other children who were at the park and asked which of them had been arrested.\nTwo of Mr Kohli's children arrived at the scene shortly after, the court was told.\nHis son found Mr Kohli \"on the ground and in obvious pain\", Mr Sandhu said.\n\"He told his son he had been hit, he pointed to his left side, and in particular the area of his ribs. He also pointed to the left side of his neck,\" he added.\nMr Kohli, the court heard, had told his daughter he had been punched in the face, kicked, and racially abused.\nIn a letter written by the boy, after he had been charged, to a professional who was working with him, he said: \"I am so nervous, well scared and worried. I accept I did it and I'm doing time, I'm just scared about how long I have to do.\"\nHe also said in the letter that his girlfriend had broken up with him and he had been \"struggling with that\", so he \"needed anger etc releasing\".\nWhen the professional told the boy that the contents of his letter would need to be disclosed, the boy said \"that's my manslaughter plea gone\", Mr Sandhu told the jury.\nThe trial, which is expected to last six to eight weeks, continues.", "url": "https://www.bbc.co.uk/news/articles/cdel9kxkw53o"}