{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:56", "date_modify": "2025-05-19 15:31:56", "date_publish": "2015-02-19 17:52:58", "description": "The Prime Minister announces a £1m funding boost for Norwich Castle Museum during a visit to the East of England.", "filename": "news_uk-england-31537958_1747668716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81113000/jpg/_81113136_81113135.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-31537958_1747668716.html", "title": "£1m Norwich Castle boost announced during PM's East of England visit", "title_page": "£1m Norwich Castle boost announced during PM's East of England visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich Castle Museum is to receive £1m to help fund a major restoration project, the Prime Minister has announced.\nThe funding will go towards improving the castle's Norman keep.\nMuseum curator Dr John Davies said the money would help to kick start a project to restore the structure, which was altered in the Victorian era.\nDuring a visit to the East of England, Mr Cameron also announced plans to improve transport links in the region.\nDr Davies said news of extra funding for the castle was \"stunning\" and showed the region was \"on the national map\".\n\"This is brilliant for Norwich and Norfolk,\" he said.\nSpeaking at the Port of Felixstowe, Mr Cameron also said the government would invest in the East of England's \"strong\" science industry.\nBut opposition politicians were critical of the prime minister's pledges.\nDavid Ellesmere, Labour leader of Ipswich Council, said: \"David Cameron likes to trumpet supposed economic success but the truth is workers in Ipswich and the rest of the East of England are now £1,900 a year worse off in real terms than they were when he came to power.\"", "url": "https://www.bbc.com/news/uk-england-31537958"}