{"authors": ["Max Matza and Christal Hayes", "www.facebook.com"], "date_download": "2025-04-26 06:17:46", "date_modify": "2025-04-26 06:17:46", "date_publish": "2025-03-01 18:17:11", "description": "It marks a potential political comeback after Cuomo resigned amid a barrage of sexual assault claims.", "filename": "news_articles_c0egl7l40z7o_1745648266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6d94/live/ba8d5300-f6cc-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0egl7l40z7o_1745648266.html", "title": "Andrew Cuomo: Former governor announces New York City mayor run", "title_page": "Andrew Cuomo: Former governor announces New York City mayor run - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Andrew Cuomo, who resigned four years ago as New York governor under a cloud of scandal, has declared he is running for mayor of New York City.\n\"Our city is in crisis,\" Cuomo posted in a 17-minute video on X, adding: \"We need government to work. We need effective leadership.\"\nIt heralds a potential political comeback in this year's election for the Democrat, who quit in 2021 amid sexual misconduct allegations and scrutiny of his handling of the Covid pandemic.\nAmerica's most populous city is in a state of political turmoil as current Mayor Eric Adams denies claims he struck a deal to help the Trump administration with migrant raids in exchange for dropping a federal corruption case against him.\nThe former governor joins an already crowded contest, which includes lawmakers, young newcomers and Mayor Adams himself, though it is Cuomo who has the most name recognition.\nThe three-term governor resigned after an investigation found he had sexually harassed 11 women, including state employees.\nThe state-led inquiry determined he had made sexual comments, inappropriately touched or groped the women and kissed them without consent.\nAt the time, President Joe Biden led calls from Democrats for the embattled Cuomo to step down, and state lawmakers raised the prospect of impeachment.\nWhen the governor left office, he denied harassing anyone, but said he wanted to \"deeply, deeply\" apologise to any women who might have been offended by his actions.\nCuomo's stunning downfall happened a year after he basked in the adulation of millions of Americans who had tuned in daily to his no-nonsense televised briefings on the coronavirus pandemic.\nBut a report in 2022 found that under his administration, the state hid at least 4,100 Covid-related nursing home deaths from the public.\nCuomo admitted to a \"delay\" in reporting, but denied allegations that his administration purposely misled New Yorkers.\nNew York Governor Andrew Cuomo resigns in wake of harassment report\nChris Cuomo: CNN fires presenter over help he gave politician brother\nAndrew Cuomo accuser: New York governor 'groped me'\nOpinion polling by New York media in recent weeks has projected that Cuomo would become frontrunner if he entered the mayoral race.\nDays before the campaign was launched, Cuomo received the surprise backing of congressman Ritchie Torres, who represents the Bronx.\n\"Andrew Cuomo has the competence to govern the city. He has the courage to stand up to extremist politics - both from the far left and far right,\" he told the New York Post.\n\"We don't need a Mr Nice Guy. We need a Mr Tough Guy.\"\nCuomo's supporters have also launched a political action committee called Fix the City, which states it aims to raise $15m (£12m) for his campaign war chest.\nOne of Cuomo's former aides who accused him of sexual harassment told the New York Post, external on Saturday that she fears women's rights will suffer if he wins election.\n\"New York City may elect a mayor who has been rightfully accused of sexual misconduct by several young women who worked for him in up-close positions,\" said Karen Hinton.\n\"As a movement, we women haven't done enough to toughen laws to protect women from such immoral, unethical, and what should be illegal behaviour by men in positions of power, such as Cuomo.\"\nThe Democratic primary vote will take place in June. The eventual winner is expected to defeat any Republican challenger during November's election and become the city's next mayor.\nThe latest: Judge pauses NYC mayor Eric Adams trial in corruption case\nGovernor Hochul will not remove NYC Mayor Adams from office\nForeign bribes, cheap flights: What is Eric Adams accused of?\nAdams has chosen to remain in the race, even while facing federal fraud, bribery and other charges.\nThe Trump administration is seeking to dismiss the charges, arguing that the charges have damaged the mayor's ability to aid the president's agenda and were politically motivated.\nThe attempt caused Manhattan's lead prosecutor and six other high-level federal prosecutors in New York to resign in protest, saying there was no legal justification for the White House directive to end the prosecution.\nMeanwhile, the judge in the case has cancelled the upcoming trial in April as he works to decide whether the case should be dropped or not.\nNew York Governor Kathy Hochul, who took over for Cuomo after he resigned, said last month that she was declining to use her authority to replace Adams, at least for now, and would instead move to limit his authority.\nAdams has denied making a \"quid pro quo\" with Trump's office to help in the removal of illegal migrants, last month calling the assertion \"silly\".\nAdams was indicted last year for allegedly accepting gifts totalling more than $100,000 from Turkish citizens in exchange for favours. He denies the charges.\nHis office has been plagued by staff departures and scandals, even before charges were pressed against him. A number of figures in his orbit have also been indicted as part of the investigation.", "url": "https://www.bbc.co.uk/news/articles/c0egl7l40z7o"}