{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 03:58:46", "date_modify": "2025-05-21 03:58:46", "date_publish": "2025-02-01 00:00:00", "description": "Asked by the BBC whether he would target the UK with tariffs, Donald Trump says \"it might happen\".", "filename": "news_live_cqjvg82lg4yt_1747799926.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cqjvg82lg4yt_1747799926.html", "title": "Trump says EU tariffs will happen and UK is 'out of line' but deal 'can be worked out'", "title_page": "Trump says EU tariffs will happen and UK is 'out of line' but deal 'can be worked out' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Keep an eye on car manufacturer stocks\nJoão da Silva\nBusiness reporter\nWith European markets set to open soon, it is worth keeping an eye on the stocks of major European car makers.\nCompanies like Volkswagen and Stellantis have operations in Mexico which leaves them exposed to the impact of Donald Trump's tariffs.\nThe stocks of Japanese car companies fell sharply during Asia trading hours. Nissan shares were down 5.5%, Toyota's fell 5% and Honda's plunged 7%.\nSeveral Japanese car manufacturers rely on factories in Mexico to supply the US and other markets.\nThe new tariffs are hitting car manufacturers at a time when many of them face slowing sales in key markets and growing competition from China's car industry.\nHow tariffs could affect Europe and UK\nNick Marsh\nBusiness reporter\nThe United States runs a trade deficit with the European Union, which means it imports more from European countries than it sells to them.\nLast year, the US ran a deficit of $213bn (£173bn) - which President Trump has just described as \"an atrocity\". To redress the balance, he says that tariffs on EU goods will \"definitely happen\". The president argues that the border taxes will help protect American jobs and products domestically.\nAmong the top European exports to America are pharmaceuticals, cars and other types of advanced machinery. The United States, meanwhile, sells oil, gas and financial services to Europe.\nDifferent countries will be affected in different ways by US tariffs. Ireland, for example, is by far the most reliant on the American market - nearly half of its exports outside the EU are destined for the US.\nCountries that buy a lot from the US include the Netherlands and Germany - although the latter exports a huge volume of cars in return.\nEven so, the EU says it will act as a collective and \"respond firmly\", if and when tariffs come in. That probably means retaliatory taxes.\nWhen it comes to the UK, things are slightly different. The US doesn't run as high a trade deficit with Britain - in fact at one point last year it ran a surplus - and government ministers hope that this will persuade the president to spare the UK from tariffs.\nAs President Trump put it, the UK is \"out of line\" but the EU is \"really out of line\".\nFormer chief economist warned tariffs 'could throw world into recession'\nJonathan Josephs\nBusiness reporter\nShortly after Donald Trump first announced these tariffs in November, the former chief economist of the International Monetary Fund told the BBC that they “could throw the world into recession”.\nMaurice Obstfeld, who was also an economic advisor to Barack Obama, said the US was in a better position to absorb the inflationary impact of tariffs than other economies but added: “Even the US, I believe, would be negatively affected.\n\"So this is not a great strategy for an economy where there are definite fragilities, which could be exacerbated by this type of policy.”\nEarlier this month the World Bank reiterated tariffs are major threat to global growth this year.\nViewers in the UK can see more of Maurice Obstfeld’s interview on Talking Business on BBC iPlayer.\nGermany's Scholz warns against global divisions caused by trade barriers\nEarlier on Sunday - before Trump's latest threat that tariffs on the EU \"will definitely happen\" - German Chancellor Olaf Scholz had cautioned against dividing the world with new trade barriers.\n\"Everyone benefits from globalisation,\" said Scholz, after a meeting with UK Prime Minister Keir Starmer at Chequers, Buckinghamshire.\nHe added that as a major economic power, the EU has \"scope for action\" to respond to any of Washington's potential sanctions.\nMember states will \"try to continue economic relations together with the perspective of cooperation and collaboration,\" he said.\nIn Trump's earlier threats to the EU, he had accused the bloc of \"treating [the US] very very badly\" and warned that \"they're going to be in for tariffs\".\nAsian markets slump could be start of chain reaction\nNick Marsh\nAsia business reporter\nToday could be the start of a chain reaction that economists fear will lead to a global economic slump.\nAfter the flurry of tariffs on the weekend, shares of companies listed in Tokyo, Seoul and Hong Kong all tumbled this Monday morning. When markets in the US and Europe open later today, stocks are expected to plunge there too.\nAs the leading economic power, what happens in the United States sets the tone for the rest of the globe— and therefore President Trump is taking a gamble with not just his own economy, but the whole world's.\nAlthough many senior Republicans have dismissed the argument that taxes on foreign goods will push up prices for ordinary consumers, even President Trump has accepted that Americans may feel \"some pain\".\nIf inflation does increase in the United States, then interest rates will probably also increase. This generally causes investors around the world to have less confidence (and cash) to invest in the stock market.\nAny global slump would be further exacerbated if and when more countries start retaliating with reciprocal tariffs on US goods — and suddenly we would have a world trade war on our hands.\nGetting the US-China balance with beans\nJonathan Josephs\nBusiness reporter\nThe US and China are the world’s two biggest economies and on Wednesday we’re set to find out whether the value of the trade relationship between them fell for a second consecutive year.\nThat’s because we’ll get the next set of US trade figures. From the US side it's about buying electronics such as laptops and smartphones as well as toys, machinery and furniture.\nOn the other side the stuff that China buys the most from America includes fuels, machinery, and agricultural produce such as the soy beans that drew a lot of attention in Trump’s first term.\nIn that first term the value of the relationship fell before rising and then falling again under Joe Biden’s watch.\nWith China promising countermeasures the goods that go both ways over the Pacific Ocean are set to get more expensive which is likely to lead to another fall in the year ahead.\nThis time Donald Trump has said he will tackle the fentanyl crisis in the US. But in the past one of his biggest problems with China has been that for years America has been buying a lot more goods from China than the other way round.\nHe sees that as costing the US substantial sums – and it remains to be seen whether he’ll repeat his efforts to pressure Beijing into trying to make it a more balanced relationship.\nPrice changes mean 'research just dies'\nNatalie Sherman\nNew York business reporter\nPharmala, a Canadian biotech company that makes pharmaceutical-grade MDMA, has been exploring shifting more of its manufacturing to Australia while scouting for a local US distributor.\nNick Kadysh, Pharmala's founding chief executive, said it has done this to shield its US customers from added costs. Its customers include universities and researchers who are tied to the US Department of Veterans Affairs investigating treatments for PTSD.\nHe says every single one of his US customers has asked for extra supply since Trump started threatening tariffs on Canadian goods, even though the shipments for medical research have historically been tariff-free.\nAs a global business, Kadysh says he is not worried about his own survival, rather he is concerned about the impact on research in the US.\n”When you have a dramatic change in price in that clinical trial period, what ends up happening is research just dies,” he says.\nDesire to mount fight against tariffs already building\nNadine Yousif\nReporting from Toronto\nWhile many economists project the tariffs will also drive up costs for Americans on everyday essentials, from petrol to groceries, Canada is the more exposed trade partner. If they last for months, the country could tip into a painful economic recession.\nAnger is building - and with it, a desire to mount a fight that has been echoed by political leaders in the country of 40 million.\nSome Canadians have already heeded the calls for solidarity. On social media, guides are circulating on how to avoid American-made products at the grocery store.\nThomas Juneau, a professor at the University of Ottawa with a focus on national security, told the BBC that Trump's tariffs \"undoubtedly represent an earthquake in Canada-US relations.\"\n\"This is extremely destabilising for Canada,\" Prof Juneau said. \"As a country, we have massively benefited from our extremely close trade and security partnership with the US for decades.\"\nMore: Canadian fans boo US anthem as tariffs spur 'buy local' pledge\nMitch McConnell criticises Trump's tariffs\nKentucky senator Mitch McConnell has disagreed with Trump's move to slap tariffs on the US' neighbours.\n\"It will drive the cost of everything up. In other words, it will be paid for by American consumers.\n\"I mean, why would you want to get in a fight with your allies over this?\" the former Senate minority leader said on CBS' 60 Minutes on Sunday night, external.\nThe 82-year-old is one of the few Republican politicians to speak out against the president's orders.\nHe was also one of three Republicans who voted against Pete Hegseth, who was narrowly confirmed as defence secretary last month.\nMayor of Canada border city says tariffs are 'lose-lose proposition'\nCanada's border cities - including Windsor, widely known as the country's car manufacturing capital - are bracing for the impact of Trump's tariffs.\nWindsor's mayor Drew Dilkens describes the US president's moves as a \"lose-lose proposition\", adding that there will be casualties on both sides of the border.\n\"One person described this as a circular firing squad... No one is going to win at the end of the day,\" he told the BBC's Carl Nasman in an interview.\nMayors of Canada's border cities have joined forces in the last few days, creating a new Border Mayors Alliance to jointly support workers and businesses in their cities in response to the tariffs.\nDilkens said tariffs are not the solution to the problems Trump cited, including illegal immigration and drugs.\n\"We have a shared goal to relieve those things and solve those problems together... It's hard to believe that's really the end goal [of Trump's tariffs],\" he said.\nWhy Beijing appears to be holding fire - for now\nLaura Bicker\nChina correspondent\nIf China is fuming over Donald Trump’s 10% tariff, it is hiding it. Unlike Canada and Mexico, Beijing has not yet detailed a plan to retaliate.\nInstead, it plans to take legal action and use the World Trade Organization to air its grievances. China did this in 2018 and won its case, but it also slapped its own tariffs on US goods.\nThis time Beijing is urging Washington to enter talks and “meet China halfway”. Trump's move is the latest in a series of tariffs imposed by the US in recent years.\nIt is still the Chinese New Year holiday until Wednesday, so it could be that more reaction will come. For now at least, Beijing appears to be holding its fire.\nSo why are there no flashes of anger? China may want to limit the damage and not provoke Washington as it tries to aid its own sluggish economy.\nPresident Xi may also hope he can do a deal with Donald Trump. In repeated statements from the Foreign Ministry and the Commerce Ministry, Beijing has urged the US to enter negotiations.\nAnd then of course there’s China’s bigger aim - to be at the centre of a new world order, one not led by the United States.\nAs Trump threatens Mexico, Canada and the EU with tariffs, China may hope to appear as a calm, stable and perhaps a more attractive global trade partner.\nUS consumers should 'absolutely' expect higher petrol prices, says analyst\nTrump's tariffs on Canadian energy exports will \"absolutely\" increase prices at the pump in the US, according to Mukesh Sahdev of Rystad Energy.\nHe told the BBC's Business Today programme that if America's tariff policy lasts ''beyond a quarter into the summer season'', then there will an impact on prices.\nIn the shorter term though, he believes supply chains will be able to adjust to any disruptions.\nCanada and Mexico are the two largest oil exporters to the United States, with the US importing four million barrels per day from its Northern neighbour.\nLevies on oil imports mean higher costs for making fuels like gasoline, much of which would likely to be passed along to US consumers.\nAmericans will feel 'a little pain' in the short term - Trump\nMore from Trump's comments to reporters: the US President also acknowledged that Americans will feel \"in the short term, a little pain\", but defended his imposition of the tariffs.\n\"People understand that,\" he said.\n\"The United States has been ripped off by virtually every country in the world.\n\"We have deficits with almost every country... and we’re going to change it. It’s been unfair,\" he said. \"We've been helping everybody for years. And to be honest I don’t think they appreciate it.\"\nSeparately, in an early morning Truth Social post, the president had argued that \"some pain\" will be worthwhile.\n\"We will make America great again, and it will be all worth the price that must be paid,\" he wrote.\nTrump says he will increase tariffs on Canada 'if they retaliate'\nWe're getting more of Trump's comments after landing at Joint Base Andrews from Florida now.\nSpeaking to reporters after getting off the plane, President Donald Trump says he will raise tariffs on Canada if they retaliate, accusing the US' northern neighbour of being \"very abusive of the United States for many years\".\n\"I love the people of Canada. I disagree with the leadership of Canada. And something's gonna happen there.\n\"But if they want to play the game, I don't mind. We can play the game all they want,\" he says.\nFor context: Canada's Prime Minister Justin Trudeau announced he would impose retaliatory sanctions of $155bn Canadian dollars' worth ($106.6bn; £86bn) of US goods following Trump's tariff announcements.\nStarmer has been 'very nice', says Trump\nNomia Iqbal\nNorth America correspondent\nMore now on those comments from President Trump about whether he is planning to impose tariffs on UK and EU trade.\nDiscussing whether any issues he has with the UK could be worked out, Trump says Prime Minister Sir Keir Starmer has “been very nice”.\n“We've had a couple of meetings. We've had numerous phone calls. We're getting along very well,” he says.", "url": "https://www.bbc.com/news/live/cqjvg82lg4yt"}