{"authors": ["Julie Flanagan", "www.facebook.com"], "date_download": "2025-04-26 04:35:36", "date_modify": "2025-04-26 04:35:36", "date_publish": "2025-02-28 12:21:44", "description": "A panel reviewing the plans makes 34 key findings and 20 recommendations.", "filename": "news_articles_cx2ggv9j8l0o_1745642136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1e40/live/00023890-f5c6-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2ggv9j8l0o_1745642136.html", "title": "'Lack of clarity' over new Jersey hospital plans says panel", "title_page": "'Lack of clarity' over new Jersey hospital plans says panel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Politicians analysing plans for Jersey's new hospital have said the island may not be able to afford to build and operate it.\nA review group set up to look at the plans, which the government approved last week, has highlighted \"a lack of clarity and transparency about the decision-making\" and \"an absence of strategic healthcare, workforce and procurement planning\".\nThe panel has made 34 key findings and 20 recommendations to tackle the issues raised as the business case for the project is developed.\nHealth Minister Tom Binet said he was confident they would \"be able to address all the key findings and recommendations and assuage any public misgivings\".\nThe review group said while the need for new healthcare facilities was urgent, more detail about decision making and costs would make the future phases of the project easier.\nTalking about the business case for the new hospital, Deputy Jonathan Renouf said: \"It is all very well wanting to 'get things done', but we need to know that what is being done is the right thing.\"\n\"This is the largest capital project the island has ever embarked on, and the panel has major concerns that there appears to be an ongoing lack of transparency which means that the Outline Business Case does not meet the expected standard to justify funding decisions of this scale.\"", "url": "https://www.bbc.co.uk/news/articles/cx2ggv9j8l0o"}