{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:25", "date_modify": "2025-05-19 14:26:25", "date_publish": "2015-03-19 17:38:41", "description": "An Afghan woman is lynched by a crowd in the Afghan capital Kabul after reportedly burning a copy of the Koran, police say.", "filename": "news_world-asia-31973742_1747664785.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81774000/jpg/_81774928_55375095.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31973742_1747664785.html", "title": "Afghan woman lynched in Kabul 'after burning Koran'", "title_page": "Afghan woman lynched in Kabul 'after burning Koran' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A mob in Afghanistan's capital Kabul has lynched a woman after she allegedly burned a copy of the Koran near a mosque, police say.\nLocal police commander Saleh Mohammad told the BBC she was killed when \"hundreds of locals and passersby attacked her with stones and sticks\".\nWitnesses say her body was then set on fire. Four suspects have been arrested but the woman has not been identified.\nThe killing is thought to be the first incident of its kind in Afghanistan.\nHowever, correspondents say it is fairly common in neighbouring Pakistan.\nOne eyewitness told the BBC how the lynching was carried out near the Shah-Du-Shamshaira mosque and shrine.\n\"I heard noise, I went and people said that a woman is burning Koran. When I went closer I saw angry people shouting they want to kill the woman.\n\"They beat her to death and then threw her on the river side and burned her. Firefighters later came and put out the fire and took the body.\"\nInterior ministry spokesman Sediq Seddiqi said officials were not sure exactly what caused the incident.\nAfghan's Tolo news agency said quoted the parents of the woman, named only as Farkhunda, as saying she had suffered from a mental illness for 16 years.", "url": "https://www.bbc.com/news/world-asia-31973742"}