{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 08:09:20", "date_modify": "2025-04-26 08:09:20", "date_publish": "2025-02-26 13:23:17", "description": "The Chamber of Commerce says while some measures are positive, business challenges still remain.", "filename": "news_articles_cp3ywprgxg9o_1745654960.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7685/live/4dc1d3c0-f43f-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3ywprgxg9o_1745654960.html", "title": "Isle of Man lobby group says budget could do more for businesses", "title_page": "Isle of Man lobby group says budget could do more for businesses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More could have been done to address the \"immediate challenges\" facing firms in the Isle of Man's budget for the year ahead, a lobby group had said.\nTreasury Minister Alex Allinson last week laid out the financial plan for 2025-26, which included a 1% decrease in the higher rate of personal income tax.\nThe Isle of Man Chamber of Commerce said while those measures were \"steps in the right direction\" some \"more radical reforms\" could have been considered.\nThe chamber, which is made up of more than 500 businesses, said the measures outlined were \"unlikely to stimulate any significant growth\" in the economy.\nThe financial plan includes a £250 rise in the personal allowance to £14,750 and no changes to the rate of employer National Insurance contributions.\nIt also saw a £10,000 rise in the child benefit thresholds, taking the maximum earnings to be eligible to claim to £90,000, along with an inflationary rise to the payments of 2.2%.\nWhen delivering his budget speech in Tynwald, Allinson said the plan aimed to \"put money back in people's pockets, to increase consumer confidence, to give business certainty and stability, and to enable continuing economic growth\".\nHowever, the chamber said \"key growth factors\" like wages, transport links, and energy costs had not been addressed in the plan, and it was \"disappointing\" that no major tax changes for businesses were included.\nThe chamber said the budget did not address the challenges of recruiting and retaining skilled employees, \"which businesses in many sectors are facing\".\nThe lobby group said a need still remained for measures to address the high housing, transport, and living costs, which \"continue to discourage young people from staying here and make it difficult for many businesses to attract key workers and skilled employees\".\nThe budget draws on a total of £110.6m of reserves, a figure set to reduce over the next five years to £49.7m in 2029-2030.\nBut the group said the \"continued drawdown\" on government reserves was a \"major concern\" and questions remained about long-term financial sustainability with withdrawals being forecast to continue over the next five years.\nWelcoming a cut in the higher rate of personal income tax and changes to personal allowances, National Insurance and child benefit as \"all steps in the right direction\", the chamber said there was \"more work to be done to address long-term issues\" facing Manx firms.\nOutlining the budget, Allinson said the plan for the year ahead tried to \"address the significant challenges we all face\" while aiming to \"seize the opportunities that are out there to create a fairer, more vibrant and sustainable island\".", "url": "https://www.bbc.co.uk/news/articles/cp3ywprgxg9o"}