{"authors": ["Elliot Ball", "www.facebook.com"], "date_download": "2025-04-26 06:19:37", "date_modify": "2025-04-26 06:19:37", "date_publish": "2025-03-01 07:09:56", "description": "Shelley Oliver says it was a \"full circle moment\" to come back as a qualified architect.", "filename": "news_articles_ce34v838pl4o_1745648377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0646/live/3975aa60-f5f5-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce34v838pl4o_1745648377.html", "title": "Alumni leads design of University of Plymouth refurbishment", "title_page": "Alumni leads design of University of Plymouth refurbishment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former student of the University of Plymouth who led the design of its £14.5m Fitzroy Building refurbishment has returned to see the newly-opened facility.\nThe building closed in 2023 and is now the new home of the university's Plymouth Business School, featuring teaching and office space.\nShelley Oliver was the architect who led the building's design after studying Architecture at the South West university.\n\"I had an amazing experience studying at Plymouth on a highly-rated architecture course and it was a real full circle moment to come back as a qualified architect and see everything again,\" she said.\n\"When I came to the university, the Roland Levinsky Building was relatively new and housed the architectural department in the top floors,\" she added.\n\"It was a striking and exciting building at the time so I knew there was form for bold and creative designs.\"\nRachel Goodsell, another alumna of the university, is the head of operations at the university's faculty of Arts, Humanities and Business.\nHer role was to ensure the building delivered what was needed for staff and students.\nMs Goodsell, who studied Personnel and Development, said: \"There has been an aspiration for many years now to have a new business school on campus and I am really proud to have been part of the team to finally make this happen.\n\"I really feel that we have managed to give the students and staff a professional business school building that they can be proud of.\"", "url": "https://www.bbc.co.uk/news/articles/ce34v838pl4o"}