{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:28:39", "date_modify": "2025-05-21 05:28:39", "date_publish": "2025-01-05 00:00:00", "description": "A yellow weather warning will be in place for parts of the region from midnight to midday on Monday.", "filename": "news_live_cdjgv9zg0g9t_1747805319.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cdjgv9zg0g9t_1747805319.html", "title": "As it happened: Snow falls in the East Midlands", "title_page": "As it happened: Snow falls in the East Midlands - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Power cut in South Normanton\nDan Martin\nBBC News\nHomes in South Normanton in Derbyshire have been left without electricity following a power cut.\nNational Grid says 177 properties in the area around Glebe Junior School have lost their supply.\nThe outage was reported at 10:24 GMT on Sunday.\nEngineers have been sent to try to fix the fault and National Grid said it hoped to resolve the issue by 13:30.\nTwo recycling centres closed in Derbyshire\nDan Martin\nBBC News\nDerbyshire County Council says it has closed two of its tips today because of the weather.\nThe Waterswallows site, in Buxton, has been shut for the day as has the Northwood site in Darley Dale.\nThe council also says access to the household waste recycling centre in Chesterfield is difficult at the moment and gritting teams are checking the route.\nThe authority has apologised for the inconvenience.\nWhat does the forecast for the East Midlands say?\nDan Martin\nBBC News\nThe amber weather warning is due to remain in place until midday on Sunday.\nThe Met Office says that means there is a good chance of power cuts and travel disruption, with some rural communities at risk of being cut off.\nFurther sleet and snow is likely on Sunday morning, followed by a spell of freezing rain in some places.\nThe Met Office says 3cm to 7cm of snow is likely for much of the region.\nIt says the overnight snow will turn to rain as milder air spreads north across all parts on Sunday, with icy patches likely, followed by a rapid thaw.\nChesterfield's match with Gillingham postponed\nBBC Sport\nChesterfield's home match with Gillingham has been called off, the club has confirmed.\nThe League Two fixture was due to kick off at 15:00 GMT, but the club said the match had been postponed following a pitch inspection.\nA new date for the match will be confirmed \"in due course\", the club said.", "url": "https://www.bbc.com/news/live/cdjgv9zg0g9t"}