{"authors": ["Gemma Dillon", "www.facebook.com"], "date_download": "2025-04-26 07:06:30", "date_modify": "2025-04-26 07:06:30", "date_publish": "2025-02-28 06:16:42", "description": "Medical start-ups in the city say the proposed hub is \"crucial\" to developing new technology", "filename": "news_articles_c4g039gxqxno_1745651190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6732/live/cc25e4f0-f5a1-11ef-add3-5bb50be972ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g039gxqxno_1745651190.html", "title": "Leeds Innovation Village to push ahead despite hospital delay", "title_page": "Leeds Innovation Village to push ahead despite hospital delay - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work on a new \"innovation village\" linked to Leeds General Infirmary is set to continue, despite a plan to rebuild the hospital being delayed until 2030.\nThe proposed hub, which is designed to link the city's two universities to the hospital, is \"crucial\" to developing new technology, medical start-ups say.\nWhen Guarav Chauhan was involved in a serious car crash he spent more than a year wearing casts and splints on his neck, arms and knees.\nLike many he was plagued by discomfort, itching, and odours as a result of the tight-fitting plaster.\nBut, working with fellow engineering graduate Ali Abdi, he used his experiences and knowledge of 3D printing to find a solution.\nTogether they developed a lightweight, waterproof splint with the help of Nexus Leeds, the collaboration and innovation hub of the University of Leeds, and launched Cast3D.\nMr Abdi said access to Nexus had given them the chance to collaborate with academics and the hospitals.\nHe said: \"Those collaborations and introductions really allowed us to do the clinical developments to come to the point where we're now doing clinical trials.\"\nHe said having a space in the city for technology to be \"developed, tested and introduced\" was \"very important\" and that developing the innovation village would \"mean the success of some of these technologies\".\nSince its launch in 2019, Nexus has worked with 191 companies. It said more than half of its member businesses were health tech innovators.\nLittle Journey is an app which helps prepare children for hospital treatment and is now used in around 100 hospitals worldwide.\nIt was founded in 2018 by anaesthetist Dr Chris Evans and Sophie Copley to help children and their families overcome their fears.\nMs Copley said the support they received through Nexus was vital.\n\"Two people alone can't make it happen [but we] got support with funding and were able to develop the product through a healthcare system,\" she said.\nBruno Scaglioni's team have also benefitted from being part of the healthcare innovation hub at Nexus.\nAtlas Endoscopy is working to improve access to colonoscopies through specialist robotic technology using magnetics.\nThe company has trialled the technique in America and is hoping to carry out a wider trial in the UK this year.\nHe said being part of a hub like the one in Leeds had been \"crucial, because we are next to the university, we are next to the hospital, we are in a place an ecosystem that attracts talent\".\n\"For high-tech companies like us, the team and the people who are part of the company are really the biggest asset you can have,\" he said.\n\"There is no way to attract talent if you don't have an ecosystem around you.\"\nJames Lewis, the leader of Leeds City Council, said the authority was \"absolutely committed\" to \"stimulating innovation and economic growth\", adding that the innovation village would \"further solidify Leeds' position as a global health-tech hub\".\nHowever, Alec Shelbrooke, Conservative MP for Wetherby and Easingwold, told the BBC he had \"'zero confidence\" the work would happen as \"nothing is being built\".\nIt is hoped the redevelopment of the Old Medical School will begin by the end of the year, with developers Scarborough Group International hopeful they will be able to complete the work by the middle of 2027.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c4g039gxqxno"}