{"authors": ["Alice Smith", "Matthew Pick", "www.facebook.com"], "date_download": "2025-04-26 03:58:21", "date_modify": "2025-04-26 03:58:21", "date_publish": "2025-03-04 13:06:34", "description": "The council plans to utilise community investment to fund green projects across the city.", "filename": "news_articles_c62zzp63ydqo_1745639901.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54db/live/d6b5cf50-f8f5-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzp63ydqo_1745639901.html", "title": "Bristol council's green investment scheme to fund climate action", "title_page": "Bristol council's green investment scheme to fund climate action - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new green scheme will allow residents to directly invest in a city's carbon neutral schemes.\nBristol City Council has launched the Bristol Climate Action Investment (BCAI) scheme alongside ethical investment platform Abundance Investment.\nIt aims to raise up to £1m in its initial phase, with further rounds over the next 18 months expected to bring the total to £2m.\nThe money will be used to install energy-saving measures in the city, including heat pumps, solar panels, and LED lighting on council-owned buildings.\nThe BCAI is designed to be accessible to everyone, with investments starting at £5 and no fixed upper limit.\nInvestors will receive a fixed return of 4.2% over a five-year term, with payments every six months.\nThe investment can also be held in an Innovative Finance ISA, meaning returns can be tax-free.\nCouncillor Martin Fodor, chair of the environment and sustainability committee, said he \"really hopes\" people see its potential.\n\"The fund is there to help make practical climate projects happen in the city that will save and switch to clean energy, making services run cleaner and more efficiently, and these will all pay back,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c62zzp63ydqo"}