{"authors": ["Henri Astier", "www.facebook.com"], "date_download": "2025-04-26 04:03:21", "date_modify": "2025-04-26 04:03:21", "date_publish": "2025-03-03 21:24:13", "description": "Trump has also criticised a UK-led European summit which pledged to boost Ukrainian defences.", "filename": "news_articles_cy0dkzrer18o_1745640201.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f179/live/396acb90-f87f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy0dkzrer18o_1745640201.html", "title": "Trump condemns Zelensky remarks that war's end is 'far away'", "title_page": "Trump condemns Zelensky remarks that war's end is 'far away' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A statement by Ukrainian President Volodymyr Zelensky saying a deal to end the war with Russia was \"very far away\" has drawn a furious response by Donald Trump.\n\"America will not put up with it for much longer,\" the US president said in a social media post, before accusing Zelensky of not wanting peace.\nA summit of mostly European leaders in London on Sunday agreed a four-point plan to guarantee Ukraine's defence in the event of a peace deal with Russia.\n\"Probably not a great statement to have been made in terms of a show of strength against Russia. What are they thinking?\" Trump said, apparently referring to the summit held two days after his fiery clash with Zelensky at the Oval Office.\nThe summit - hosted by UK Prime Minister Keir Starmer - was intended as a show of support for Ukraine and an attempt to reduce differences between Western countries over Ukraine.\nBritain and France said they were working on a European-led solution to the conflict.\nAfter the meeting, Zelensky said a deal to end the war between Ukraine and Russia was \"still very, very far away\".\nHe added that he expected the US to continue backing Ukraine despite his own fraught relations with Trump.\n\"I believe that Ukraine has a strong enough partnership with the United States of America,\" Zelensky said late on Sunday.\nBut on Monday, Trump responded by reiterating his view that Zelensky stood in the way of peace negotiations.\n\"This is the worst statement that could have been made by Zelensky, and America will not put up with it for much longer! It is what I was saying, this guy doesn't want there to be Peace as long as he has America's backing,\" he wrote on his Truth Social media network.\nDuring a news briefing later on Monday, Trump once again said that Zelensky \"should be more appreciative\" for the aid he has received from the US in the three years since Russia's full-scale invasion of Ukraine.\nDuring the confrontation in front of cameras at the White House, both Trump and US Vice-President JD Vance expressed anger at what they perceived as Zelensky's lack of gratitude.\n\"Just say thank you,\" Vance demanded at one point.", "url": "https://www.bbc.co.uk/news/articles/cy0dkzrer18o"}