{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:35:01", "date_modify": "2025-05-19 15:35:01", "date_publish": "2015-01-29 21:46:48", "description": "The US Senate passes a bill to approve the controversial Keystone XL pipeline, sending it to President Barack Obama's desk for a likely veto.", "filename": "news_world-us-canada-31046403_1747668901.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80663000/jpg/_80663717_80663716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31046403_1747668901.html", "title": "Keystone XL project approved by US Congress", "title_page": "Keystone XL project approved by US Congress - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The US Senate has passed a bill to approve the controversial Keystone XL pipeline, sending it to President Barack Obama's desk for a likely veto.\nThe 62-36 vote comes after weeks of debate and votes to amend the bill after the House approved it.\nThe 875-mile (1,400km) pipeline would carry tar sands oil from Alberta, Canada, to the US state of Nebraska where it joins pipes running to Texas.\nThe White House has previously said Mr Obama will veto the bill.\nSpokesman Josh Earnest said the legislation would undermine a \"well-established\" review process.\nCongress would need two-thirds of each chamber of Congress to overcome a presidential veto.\nThe project has pitted Republicans and other supporters, who say it will create much needed jobs, against many Democrats and environmentalists, who warn the pipeline will add to carbon emissions and contribute to global warming.\nSenate Majority leader Mitch McConnell called the bill \"an important accomplishment for the country\".\n\"We are hoping the president upon reflection will agree to sign on to a bill that the State Department said could create up to 42,000 jobs and the State Department said creates little to no impact on the environment.\"", "url": "https://www.bbc.com/news/world-us-canada-31046403"}