{"authors": ["Robert Peston", "www.facebook.com"], "date_download": "2025-05-19 14:45:32", "date_modify": "2025-05-19 14:45:32", "date_publish": "2015-02-19 16:47:15", "description": "Germany's insistence that Greece must repay its debts on the original terms could prove very expensive for German taxpayers", "filename": "news_business-31541920_1747665932.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81114000/jpg/_81114951_81114950.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31541920_1747665932.html", "title": "What will Germany pay for not compromising with Greece?", "title_page": "What will Germany pay for not compromising with Greece? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "You could argue that the very public nature of the disagreement between Germany and Greece, over the terms of the latest attempt by Greece to avoid financial collapse, is good for the reputation of the eurozone.\nIn that at least colossal sums of taxpayer's money aren't being committed via murky deals in the kind of hidden-away government rooms that used to be smoke-filled.\nThat said, confidence that the euro will endure till the end of days is hardly instilled by the conspicuous lack of trust between Germany and Greece.\nThe point is that Greece swallowed its pride and finally gave up its insistence that it must have a new bridging loan, only to be immediately accused by the German finance ministry of dishonesty - of merely pretending to adhere to bail out terms in requesting an extension of the existing €172bn rescue package (which is due to expire).\nSo much for famous European communautaire spirit.\nThere is a paradox in Germany's financial Puritanism: this theological commitment that all debts must be repaid on the originally specified terms could be much more expensive for it than cutting Greece some slack.\nIf Greece were to leave the euro, Germany's losses would be greater than any other country's, as Greece's biggest indirect creditor via bailout loans and European Central Bank support.\nAnd there would be a second big cost. If Greece goes, the eurozone would need to demonstrate greater financial solidarity between rich Northern European economies and overstretched southern ones.\nThat would be necessary to persuade investors and businesses not to withdraw vital funds from those economies thought most likely to follow Greece out of the eurozone.\nAnd of course as the biggest eurozone economy by far it would be Germany which would be expected to make the biggest contribution to any expanded bailout fund and to increasing the firepower of the European Central Bank.", "url": "https://www.bbc.com/news/business-31541920"}