{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:56", "date_modify": "2025-05-19 15:36:56", "date_publish": "2017-07-07 00:00:00", "description": "News, sport, weather and travel updates from across Kent on Friday 7 July 2017.", "filename": "news_live_uk-england-kent-40523246_1747669016.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-kent-40523246_1747669016.html", "title": "BBC Live: Kent - As it happened", "title_page": "BBC Live: Kent - As it happened on Friday 7 July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Good night from the BBC Live team\nBob Dale\nBBC Live reporter\nThat's all from us for another week, we'll be back on Monday morning, bright and early at 06:00 BST with more of the county's news, sport, travel and weather.\nIf you'd like to get hold of us in the meantime, you can do via Twitter, external, Facebook, external or by sending us an email.\nThanks for joining us, and have a lovely weekend.\nRare coins stolen during Maidstone burglary\nA collection of 2,500 rare coins has been stolen during a burglary in Maidstone.\nThe break-in was reported to have happened in Upper Fant Road between 14:30 - 19:00 BST on Monday.\nThe collection is believed to be worth several thousand pounds.\nIt includes a number of modern, but rare £2 and 50 pence pieces, as well as distinctive coins no longer on circulation.\nJewellery, including a gold ring with diamonds, was also taken.\nResidents, second-hand dealers and jewellers are urgent to be vigilant and should contact Kent Police if they have been offered, or have seen, a collection for sale.\nFaversham and Mid Kent MP receives death threat\nSue Nicholson\nBBC News\nThe Conservative MP for Faversham and Mid Kent has revealed that she has received a death threat.\nHelen Whately said there had been \"moments when I've felt under threat\".\n\"I have had to complain to the police about some of the comments and particularly a death threat that I received,\" she told BBC South East.\n\"Because of what happened to Jo Cox you do have to take threats seriously,\" the MP, who was elected in the 2015 general election, added.\nMs Whately was speaking after it had been revealed that she had to pull out of opening a summer music festival at Sheldwich Primary School, in Faversham, because of threats posted on social media.\n\"I was asked not to go because there'd been some unpleasant comments on Facebook, and particularly threats that some people were going to come along and, I think, throw eggs, and they didn't want a disturbance at the school.\n\"I went along afterwards rather than at the beginning,\" she said.\nHidden disabilities: Pain beneath the surface\nImagine having to inject yourself thousands of times over the course of your lifetime, but never talking about it to anyone.\nMany people live with hidden disabilities - conditions which don't have physical signs but are painful, exhausting and isolating. Sympathy and understanding from others can often be in short supply.\nBBC Radio Kent's Erika North explains what it's like to have a hidden disability.\nPolice: 'Stolen strawberries could make you ill'\nKathryn Langley\nBBC Live reporter\nPolice have issued a health warning over strawberries stolen from a farm in Kent that could make people ill.\nMore than 100kg of strawberries were stolen from Hill Farm in Ulcombe overnight on Friday.\nPolice believe the thieves hoped to sell them on but they'd recently been coated in a growth chemical that can poison the stomach.", "url": "https://www.bbc.com/news/live/uk-england-kent-40523246"}