{"authors": ["Lisa Young", "www.facebook.com"], "date_download": "2025-04-26 06:19:36", "date_modify": "2025-04-26 06:19:36", "date_publish": "2025-03-01 07:13:22", "description": "The Isle of Sark Shipping Company says the works on Corsaire de Sercq include an engine replacement.", "filename": "news_articles_cm2d36prv7eo_1745648376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3d75/live/7038c700-f468-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2d36prv7eo_1745648376.html", "title": "New engines for Sark ferry in two-month long refit", "title_page": "New engines for Sark ferry in two-month long refit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A passenger ferry that carries people between the islands of Sark and Guernsey is undergoing a refit.\nThe Isle of Sark Shipping Company said the works on Corsaire de Sercq included a complete engine replacement, a repaint and maintenance.\nA spokesperson for the company said the new FPT branded engines would be more efficient than the previous ones and would allow remote monitoring.\nThe works started in early February and it was hoped the passenger vessel would be back in service by early April, they added.\nThe spokesperson said the two-month refit would ensure residents and visitors would have a reliable and efficient service.\nThey said the vessel's previous engines had been approaching the end of their service life so the upgrade would help reduce downtime and unplanned maintenance.\n\"This comprehensive overhaul is being carried out by experienced shipyard engineers and technicians, working alongside our own team and under the oversight of the vessel's Master to help ensure everything remains on schedule,\" the spokesperson said.\nThe Corsaire de Sercq was bought by the Isle of Sark Shipping Company in 2020.\nThe ferry can carry a maximum of 157 passengers and cruises at 16 knots, making the crossing between Guernsey and Sark in about 35 minutes.", "url": "https://www.bbc.co.uk/news/articles/cm2d36prv7eo"}