{"authors": ["Paul Kirby & Mircea Barbu", "www.facebook.com"], "date_download": "2025-04-26 08:10:41", "date_modify": "2025-04-26 08:10:41", "date_publish": "2025-02-26 12:25:55", "description": "Prosecutors are investigating a series of alleged offences, after Georgescu came from nowhere to win the first round.", "filename": "news_articles_c70eky7l6pxo_1745655041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e072/live/dcc40890-f43a-11ef-837a-fdc1fd381948.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70eky7l6pxo_1745655041.html", "title": "Romanian far-right presidential hopeful Georgescu detained and indicted", "title_page": "Romanian far-right presidential hopeful Georgescu detained and indicted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Far-right populist Calin Georgescu, who came from nowhere to win the first round of last year's presidential election, has been detained by police and is facing criminal proceedings on a series of charges.\nGeorgescu was stopped in traffic in the capital, Bucharest, on his way to register as a candidate for new elections in May, after last December's second-round run-off was annulled by the constitutional court.\nProsecutors said one of the charges involved attempted \"incitement to actions against the constitutional order\".\nTwo right-wing populist parties said they were mobilising their supporters to head for the prosecutor's office, where Georgescu was taken for questioning.\nPolice were seen erecting barriers around the building and hundreds of demonstrators gathered to protest.\nProsecutors said Georgescu was also being investigated for giving \"false information, false statements\" and for setting up an organisation with \"fascist, racist or xenophobic characteristics\" as well as forming an antisemitic organisation.\nThe severity of the indictment could jeopardise Georgescu's bid to run in the presidential election on 4 and 18 May.\nHe has been placed under judicial control and told not to leave Romania, according to reports. As he left the prosecutor's office, Georgescu told supporters he would continue to fight and that there was \"no difference between the communist mentality and system [that collapsed in 1989] and now\".\nThe original presidential vote was cancelled before the second round last December, after the then president, Klaus Iohannis declassified intelligence documents that suggested that hundreds of TikTok accounts had been activated backing Georgescu.\nRomanian foreign intelligence said Russia had been behind the move, as well as thousands of cyber-attacks and other sabotage.\nIohannis had decided to stay in office until a successor was elected, but he resigned earlier this month ahead of an impeachment vote.\nOpposition politicians had at the time accused Iohannis of an undemocratic move, and Georgescu's communications team repeated the claim against prosecutors.\n\"Where is democracy now?\" they posted on X on Wednesday, tagging President Donald Trump, Elon Musk and US Vice-President JD Vance.\nEarlier this month, the US vice-president accused Romania of annulling the elections based on \"flimsy suspicions\" of Romanian intelligence and pressure from its neighbours.\nRomanian Foreign Minister Emil Hurezeanu accused Elon Musk of a \"form of interference\" in Romania's elections, after the billionaire posted several messages of support for Georgescu.\nGeorgescu's hopes of running for the presidency may end up at the constitutional court, which barred another far-right, pro-Russian candidate from running last year.\nThe decision to turn down Diana Sosoaca's candidacy because of her views was widely criticised in Romania.", "url": "https://www.bbc.co.uk/news/articles/c70eky7l6pxo"}