{"authors": ["Lauren Woodhead", "Rob Sissons", "www.facebook.com"], "date_download": "2025-04-26 03:44:42", "date_modify": "2025-04-26 03:44:42", "date_publish": "2025-03-05 06:55:20", "description": "Proportion of overseas NHS staff rises from 9% in 2009 to 20% last year.", "filename": "news_articles_cwyepe92210o_1745639082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/68e7/live/be6361d0-f9ac-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyepe92210o_1745639082.html", "title": "NHS over-reliant on overseas staff, health chiefs warn", "title_page": "NHS over-reliant on overseas staff, health chiefs warn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A fifth of current NHS staff were recruited from overseas, prompting fears about an overreliance on a non-British workforce.\nThe proportion of overseas NHS England staff has risen from 9% in 2009 to 20% in September last year.\nThe British Medical Association (BMA) said successive governments had neglected workforce planning.\nThe government said the NHS was committed to developing homegrown talent.\nNHS England statistics show 311,000 employees have a nationality other than British out of a total workforce of 1.5 million.\nThe current long-term plan aims for between nine and 11% of NHS staff to be overseas recruits.\nDr Latifa Patel, a chief officer at the BMA, said there was \"no point\" in targets without adequate funding.\nShe said: \"How many doctors do we have at the moment? How many medical school places do we have?\n\"Without the funding, we will always have a reliance on overseas doctors.\"\nInternational recruits have been important to the NHS since its introduction in 1948.\nHowever, the NHS Long-term Workforce Plan, external warned a growing reliance on overseas staff \"leaves the NHS exposed to future global shocks and fluctuations in international workforce supply\".\nPatricia Marquis, the executive director of the Royal College of Nursing in England, said investment in recruiting and retaining the UK workforce was \"absolutely critical\".\n\"People from overseas have been the bedrock of the NHS since its inception,\" she said.\n\"The downside is that we are probably at the point of having an over-reliance on people from overseas and not actually investing in our current workforce and systems to encourage people from the UK to become nurses themselves.\"\nDespite the concerns regarding long-term sustainability, Tracy Pilcher, chief nurse at Nottingham University Trust, said overseas recruits can bring skills, knowledge and passion to their roles.\nDr Patel agreed, saying that \"having that sort of international knowledge come into the UK is incredibly important\".\n\"Each doctor is shaped and framed by their experiences, the training they're receiving, environments and areas they've worked in and all doctors will bring that unique experience with them.\"\nThis was echoed by Benjamin Andoh, 28, a dietician who specialises in diabetics, who left home in Ghana and moved to Nottingham.\nHe came to the UK for a higher salary and training opportunities and works at Nottingham University Hospitals Trust (NUH).\n\"The UK gives a specialist dietician like me greater options,\" he said.\n\"I also want to do certain things like training, which is not available in Ghana.\n\"In terms of my professional development, it's really helped me.\"\nIt was a big move for Benjamin, who had not left Ghana before, but he said the hospital's pastoral team had been very helpful.\n\"They are my family here.\"\nIts pastoral care for international staff is award winning and has contributed to an unusually high retention rate, particularly for nursing staff.\nOnyinye Enwezor is the international recruitment pastoral lead.\nShe said moving to the UK can be \"quite disorientating\" but \"with the right support and guidance they can settle in\".\nSince she started in the role two years ago, she said no international nurses had left the trust.\n\"Currently, our retention rate is quite high because of the support that we offer.\"", "url": "https://www.bbc.co.uk/news/articles/cwyepe92210o"}