{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:35", "date_modify": "2025-05-19 15:29:35", "date_publish": "2015-02-13 14:03:19", "description": "Police patrol bases will be reinstated in two towns after the police and crime commissioner asked for a review.", "filename": "news_uk-england-hereford-worcester-31454139_1747668575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80988000/jpg/_80988543_longmore.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-hereford-worcester-31454139_1747668575.html", "title": "Ross-on-Wye and Malvern police bases to be reinstated", "title_page": "Ross-on-Wye and Malvern police bases to be reinstated - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Police patrol bases will be reinstated in two towns after a police and crime commissioner asked for a review.\nIn September 2013, a central patrol base was set up in Ledbury, also covering Ross-on-Wye, in Herefordshire, and Malvern, in Worcestershire.\nFrom 2 March, ten officers will remain in Ledbury but 15 will move to a base at Ross, with 20 in Malvern.\nWest Mercia PCC Bill Longmore said those two towns \"felt a bit isolated from Ledbury\".\nMr Longmore said it did not seem \"to be working as well\" with the officers all based in Ledbury but the solution would mean \"a better service for local residents and businesses\".\nWest Mercia Police said it did not \"fundamentally change\" how many officers served each area.\n\"It simply means that the officers who have always policed Malvern and Ross-on-Wye will operate out of local bases once again, ensuring more of a local presence,\" the force said.\nSupt Sue Thomas, policing commander for Herefordshire, said after monitoring the situation over 12 months, it was clear re-establishing the two patrol bases was \"the most appropriate way forward\".\nSupt Kevin Purcell, policing commander for south Worcestershire, said he was \"very supportive\" of the decision made.", "url": "https://www.bbc.com/news/uk-england-hereford-worcester-31454139"}