{"authors": ["Hannah Richardson", "www.facebook.com"], "date_download": "2025-05-19 14:25:49", "date_modify": "2025-05-19 14:25:49", "date_publish": "2015-03-19 13:30:29", "description": "A group of early-years experts and teachers oppose the introduction of tests for four-year-olds in England.", "filename": "news_education-31964225_1747664749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81762000/jpg/_81762048_pencils.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_education-31964225_1747664749.html", "title": "Experts oppose assessments for four-year-olds", "title_page": "Experts oppose assessments for four-year-olds - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Early years education experts and teachers are calling for plans for new baseline tests for four-year-olds in England's schools to be scrapped.\nIn an open letter, they warn they will be unreliable, harmful to children's wellbeing and learning, and disruptive in the crucial early days of Reception.\nThe Department for Education says the tests, to be introduced in September, are the best way to monitor progress.\nBut a government consultation found 57% of 1,063 respondents opposed them.\nAlthough the tests are described as optional, many see it as inevitable schools will sign up to one of the six commercial provider programmes they will be invited to choose from.\nThere is likely to be pressure for head teachers to adopt an approved test so they have a record of Reception children's levels of attainment on entry to the school for when they take national tests at 11.\nAnnouncing the tests last year, the then Education Secretary Michael Gove said children should be assessed when they entered primary school and again when they left at 11.\nHaving a \"baseline assessment\" would enable the government to see which schools were making progress with disadvantaged children, he said.\nBut Beatrice Merrick, chief executive of the British Association for Early Childhood Education (Early Education), said they would not contribute to school accountability because they were not designed to predict educational progress.\nThey would be a \"distraction\" and would not help teachers \"know their children better or plan for their learning\", she added.\nChild development and early years education expert Prof Cathy Nutbrown said the test would take teachers away from teaching and waste learning time.\n\"It is not in the interests of young children, whose learning and other developmental needs are better identified - over time - by well-qualified early years practitioners who observe and interact with young children as they play,\" she added.", "url": "https://www.bbc.com/news/education-31964225"}