{"authors": ["Jacob Panons", "Piers Hopkirk", "www.facebook.com"], "date_download": "2025-04-26 03:47:29", "date_modify": "2025-04-26 03:47:29", "date_publish": "2025-03-04 18:55:17", "description": "Tom Riva is hoping to raise £11,000 for dental treatment following the attack in Farningham.", "filename": "news_articles_c3e4nn115dlo_1745639249.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4f1e/live/d66ce1d0-f929-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e4nn115dlo_1745639249.html", "title": "Farningham man loses nine teeth in suspected catapult attack", "title_page": "Farningham man loses nine teeth in suspected catapult attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who lost nine teeth in a suspected catapult attack outside a village pub has said it is the \"most horrendous thing\" that has ever happened to him.\nThe incident happened at about 22:00 GMT in Farningham High Street on 21 February following an earlier \"verbal altercation\", Kent Police said.\nTom Riva, who disputes that there was an altercation, is now looking to raise £11,000 for his dental treatment as he was told he would need implants, as first reported by Kent Online, external.\nHe said: \"When something so bad like this happens it really does make you question humanity, but the kindness and the fast response of everyone has really restored my faith in humanity.\"\nThe carpenter said five of his teeth in the top row were shattered and four in the bottom row had to be removed.\n\"This is the most horrendous thing that has ever happened to me in my life, in such a quiet, quaint little village that I've lived in my whole life,\" Mr Riva said.\nThe 29-year-old said the incident had \"thrown my whole life upside down\".\n\"It's horrific, its horrendous, no one deserves it and it's disgusting\", he added.", "url": "https://www.bbc.co.uk/news/articles/c3e4nn115dlo"}