{"authors": ["Mayeni Jones in Pretoria & Khanyisile Ngcobo in Johannesburg", "www.facebook.com"], "date_download": "2025-04-26 06:55:31", "date_modify": "2025-04-26 06:55:31", "date_publish": "2025-02-28 15:27:00", "description": "The US axes vital HIV/Aids funding, which South Africa's health minister says is a \"wake-up call\".", "filename": "news_articles_c77887npl2mo_1745650531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4898/live/462075a0-f600-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c77887npl2mo_1745650531.html", "title": "US aid cuts send South Africa's HIV treatment 'off a cliff'", "title_page": "US aid cuts send South Africa's HIV treatment 'off a cliff' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US government's sudden decision to axe funding for HIV programmes is a \"wake-up call\" for South Africa, the country's health minister has told the BBC.\nDr Aaron Motsoaledi, responding to US termination notices issued late on Wednesday, said the cuts could lead to deaths, but he had instructed state-funded clinics to ensure no patient went without life-saving drugs.\nThere is chaos as many affected organisations scramble to find alternative help for some 900,000 HIV patients by the end of the day.\n\"Instead of a careful handover, we're being pushed off a cliff,\" said Kate Rees from the Anova Health Institute, one of the biggest recipients of special US funding to counter the spread of HIV.\nThese cuts to the US's HIV programme, known as the US President's Emergency Plan for Aids Relief (Pepfar), are part of wider cost-cutting drive to reduce American government spending.\nPepfar was launched in 2003 by then US President George W Bush and its funding is distributed via the US government's main overseas aid agency USAID.\nIt has been regarded as a ground-breaking scheme that has enabled some of the world's poorest people to access anti-retroviral drugs (ARVs) and has saved more than 25 million lives worldwide.\nA 90-day freeze on US foreign aid payments instituted by President Donald Trump on his first day in office last month has already upended the global aid system.\nIn reaction to the raft of cuts, the head of the Africa Centres for Disease Control and Prevention (Africa CDC) issued a stark warning on Friday.\n\"I have to say that the world is playing with fire,\" Dr Jean Kaseya told the BBC.\n\"I want to send a clear message to our partners from the US, the UK and all other Western countries that please don't come to blame Africa when there will be a pandemic coming from Africa because you decided to stop funding critical programme.\"\nSouth Africa is one of the biggest beneficiaries of Pepfar, which contributes about 17% to its HIV/Aids programme, in which about 5.5 million people out of eight million people living with HIV receive ARVs.\nLike all such US-funded organisations in South Africa, the Anova Health Institute was notified overnight on Wednesday about the decision by US President Donald Trump's administration to terminate tens of billions of dollars of aid contracts.\nDr Rees described the announcement as one of the \"worst days\" of her career, especially as there had been plans afoot to reduce the dependency of HIV programmes on donor aid.\nThis was to take place over the next five years, making it easier for the country's health department to take over, she said.\nHealth experts say Pepfar funding was also helping with research for a cure for HIV, and that the cuts would set that work back years.\nThe Desmond Tutu Health Foundation projects the US's move could result in as many as half a million deaths.\nSouth Africa's leading Aids lobby group, the Treatment Action Campaign (TAC), warned the country could see a return to when HIV patients struggled to access necessary services for their treatment.\n\"We can't afford to die, we can't afford to go back to those years where we were suffering with access to services, especially for people living with HIV treatment,\" said TAC chair Sibongile Tshabalala.\nShe was speaking during a digital news conference on Thursday, in which representatives from organisations that work with HIV patients described the chaos and despair caused by the termination of the funding.\nMs Tshabalala, who has HIV, became emotional as she questioned how she and others like her would survive in the wake of the funding cuts.\nDr Motsoaledi said he did not want South Africa, which has the largest ARV programme in the world, to be dependent on aid.\n\"It's only that you remember the era when Pepfar started, when people offer your money, you couldn't reject it. But I believe it was something that we should not have allowed to flourish,\" the health minister told the BBC.", "url": "https://www.bbc.co.uk/news/articles/c77887npl2mo"}