{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:49:39", "date_modify": "2025-04-26 03:49:39", "date_publish": "2025-03-05 13:29:35", "description": "Funds have been granted for a football and community hub in Middlesbrough.", "filename": "news_articles_cn04zn0n8x1o_1745639379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6def/live/05b1d490-f9b2-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04zn0n8x1o_1745639379.html", "title": "Chris Kamara says Middlesbrough hub will make 'mega difference'", "title_page": "Chris Kamara says Middlesbrough hub will make 'mega difference' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans for a new football and community hub in Chris Kamara's hometown have been granted funding.\nMiddlesbrough Football Club (MFC) Foundation was awarded a £100,000 grant from the Sky Bet EFL Building Foundations Fund for the development in the Park End area of Middlesbrough.\nFormer footballer and broadcaster Kamara said the Southlands Centre project, with its upgraded pitches and new community rooms, would make a \"mega difference\".\nActing Head of MFC Foundation Craig McManus added: \"We want it to feel like the biggest living room in the area where people feel like they can just come along and be part of it.\"\nNine EFL club charities were awarded a share of £520,000 to support community-focused initiatives.\nFormer Middlesbrough player Kamara told BBC Radio Tees he remembered playing football in the area as a youngster, using jumpers for goalposts.\nHe said: \"When I was growing up obviously people didn't have money, it was a deprived area and it's still, in certain parts of Park End, a deprived area today.\n\"Things like this can only make them happy.\"\nKamara added: \"Never forget where you're coming from and myself and Steve Gibson [the chairman and owner of Middlesbrough Football Club] never, ever forget that.\"", "url": "https://www.bbc.co.uk/news/articles/cn04zn0n8x1o"}