{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:51:30", "date_modify": "2025-05-19 14:51:30", "date_publish": "2015-03-02 00:00:00", "description": "Rolling coverage of political developments on Monday 2 March, including all the key points from programmes beginning with Today and Breakfast, through to Newsnight and Today in Parliament.", "filename": "news_live_uk-politics-31688520_1747666290.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-politics-31688520_1747666290.html", "title": "Politics Live - 2 March", "title_page": "Politics Live - 2 March - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Child exploitation\nBBC Newsnight\nBBC Two, 22:30\nNewsnight's chief correspondent Laura Kuenssberg says tomorrow David Cameron is holding a child protection summit in Downing Street where he will talk about making it a criminal offence for professionals not to report child abuse.\nTomorrow also sees the publication of the Serious Case Review, or investigation, in to child sexual exploitation in Oxfordshire.\nNo private deal\nMPs should be summoned to Westminster to meet for the first time on the Saturday after the general election to prevent a coalition deal being agreed in private between party leaders, a senior politician has said.\nLabour MP Graham Allen called for Parliament to meet on May 9 to consider the make-up of the next government. \"If the result of the May 7 general election is not clear-cut, the days immediately after it should not be characterised by a private fix by the party leaders, where newly elected Members of Parliament and their parties are bypassed,\" he said.\nHouse building\nBBC Newsnight\nBBC Two, 22:30\nEvan Davis asks the housing minister Brandon Lewis if he thinks house prices are \"too high\". He says it's different in different parts of the country, but agrees \"In London, prices are too high...we need more homes to be built to deal with that\".\nMr Lewis says the Conservative's Starter Homes policy will help more young people to own a home of their own. The Conservatives and Labour have been setting out their policies on house building today.\nDefence budget\nHouse of Commons\nParliament\nDefence Minister Mark Francois, closing the defence debate for the government says: \"The world simply does not stand still and events will not give us rest.\" He says the government inherited \"chaos\" from Labour in 2010 and \"the budget is now back in balance\".\nShadow defence minister Kevan Jones says a future Labour government would meet current defence spending commitments in 2015-16. He says Labour would hold \"a proper defence review\" examining \"our role in the world\".\nUkraine 'a wake-up call'\nSusan Hulme\nBBC parliamentary correspondent\nThe Defence Minister, Mark Francois, has said that recent events in Ukraine have been a \"wake-up call\". Speaking at the end of a Commons debate on the UK's defence, he said that the Strategic Defence and Security Review and the National Security Strategy needed to be updated in the light of that.\nThe comments come after the head of the US Army said that he was \"very concerned\" about the impact of spending cuts on the UK's armed forces.\nMore poster reaction\nChris Leslie MP, Labour's Shadow Chief Secretary to the Treasury, commenting on the new Tory election poster said: \"The recovery has failed to reach kitchen tables across Britain. While a few at the top have been given a huge tax cut, working people are £1,600 a year worse off under the Tories. Labour's better plan will boost living standards, save our NHS, back the next generation and balance the books fairly. The Tories have an extreme plan to cut spending back to 1930s levels, before there was an NHS, which would put our public services and our economy at risk. Working people can't afford five more years of the Tories.\"\nSpeaker sees 'merit' in card sanction on MPs\nCommons Speaker John Bercow has given a cautious welcome to the suggestion MPs face a rugby-style \"yellow-card\" temporary ban for bad behaviour in the Chamber. Answering questions at a Hansard Society event at Westminster, Mr Bercow said: \"I think there is merit in it, it's not for me to decide, it's for the House to decide.\"\nEarlier, the Shadow Leader of the Commons, Angela Eagle, had suggested a system of temporary one-hour suspensions as part of a package of reforms to be brought in by a Labour government. \"Sometimes,\" she said, \"MPs take it too far and it turns the public off. A Labour government will consult on new powers for the Speaker to curb the worst forms of repeated barracking.\"\nSNP hit back at Labour\nThe SNP has hit back at comments made by the former prime minister Gordon Brown in which he accused the party of focusing on political wrangling rather than what it could do for Scotland.\nThe party's deputy leader, Stewart Hosie, said: \"Given their toxic alliance with the Tories for the last two and a half years, people in Scotland would be forgiven for thinking that Labour's focus is not what they can do for Scotland - but what they can do for their Tory allies.\n\"And despite this transparent attempt to cover for the failures of Jim Murphy's leadership, Gordon Brown has the substance all wrong....The general election is Scotland's opportunity to hold real power at Westminster and to deliver on the priorities of the people who live here - ending austerity, protecting our public services and investing in jobs.\"\nBrown tackled on fees\nFormer Labour Prime Minister Gordon Brown has been challenged on his role in introducing university tuition fees in England by a school student. Mr Brown was making a speech in Glasgow in which he called for a united effort to fight for social justice. During questions afterwards, he was asked: \"You were the chancellor of the exchequer that introduced tuition fees, so how can you speak of empowering future generations when you introduced legislation which has encumbered future generations?\".\nMr Brown responded: \"When we introduced tuition fees, and I had my own views on this which I won't go into this evening, they were at £3000. In 2007 we also added protection for poorer students around the maintenance costs....What I can't agree with is that you introduce free tuition, which is what has happened in Scotland, and then you cut the grants for poorer students.\"\nTime to move House?\nThe Speaker John Bercow says the cost of repairs to the Houses of Parliament could be more than £3bn. In a lecture in Westminster, he also said while he did not want MPs to have to move elsewhere while the work was carried out, they might have to. He was \"very uneasy about the idea of decanting\" from the Palace of Westminster, he said, because \"once you are out it can be very difficult to get back\", but if MPs had to move out, they should consider \"all options including, almost certainly, a regional option\".\nBasic services in the building, like electricity, water and sanitation, are being kept functioning \"with increasing difficulty and growing risks\", according to a report from 2012. There are many leaks from the roof too, as seen in the BBC documentary Inside the Commons.", "url": "https://www.bbc.com/news/live/uk-politics-31688520"}