{"authors": ["Tom McArthur", "www.facebook.com"], "date_download": "2025-04-26 04:10:05", "date_modify": "2025-04-26 04:10:05", "date_publish": "2025-03-02 18:29:49", "description": "The Ukrainian president met the King at his Norfolk residence following a summit of European leaders in London.", "filename": "news_articles_ce98v8mnxm3o_1745640605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/13c2/live/41965120-f796-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce98v8mnxm3o_1745640605.html", "title": "Volodymyr Zelensky gets warm reception from King Charles at Sandringham", "title_page": "Volodymyr Zelensky gets warm reception from King Charles at Sandringham - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volodymyr Zelensky has met King Charles III at Sandringham, after attending a summit of European leaders on ending the war in Ukraine.\nAs the Ukrainian president arrived at the King's Norfolk residence, local residents, some holding Ukraine flags, gathered outside the estate to witness his entrance by helicopter.\nZelensky was in London over the weekend for the talks on European defence, after a fiery exchange with US President Donald Trump in the White House on Friday.\nUkraine's president was \"warmly received\", and the meeting lasted just under an hour, royal sources said. The pair were served tea in Sandringham's Saloon room.\nZelensky described it as \"a very good meeting\".\n\"I'm very grateful for this meeting and for how His Majesty helps Ukraine and supports us,\" he told reporters. \"He's met our warriors here, being trained in the UK, and we're very thankful to the Royal Family for their support.\"\nThe King has previously expressed support for Zelensky and Ukraine, saying the country had experienced \"indescribable aggression\" following Russia's \"unprovoked attack on their land\".\nThe Ukrainian people have shown \"truly remarkable courage and resilience in the face of such human tragedy\", the King said last year.\nThey first met at Buckingham Palace during Zelensky's surprise visit to the UK in 2023, and the same day the King visited Ukrainian troops being trained in Wiltshire.\nToday's meeting was requested by the Ukrainian president, with the agreement of the UK government.", "url": "https://www.bbc.co.uk/news/articles/ce98v8mnxm3o"}