{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 07:55:49", "date_modify": "2025-04-26 07:55:49", "date_publish": "2025-02-25 12:33:22", "description": "Laura Winham, 41, was found dead in her Woking flat by her mother and brother in May 2021.", "filename": "news_articles_cjevx91v988o_1745654149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c423/live/2c8e9ea0-f367-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevx91v988o_1745654149.html", "title": "'Huge opportunity missed' to help woman, family say", "title_page": "Laura Winham: 'Huge opportunity missed' to help woman, family say - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vulnerable woman with schizophrenia who lay dead in her flat for more than three years was \"left to fend for herself\", her family said.\nLaura Winham, 41, was found dead in a flat in Woking, Surrey, by her mother and brother, Marilyn and Roy Winham, in May 2021.\nIn a statement following the conclusion of an inquest into her death on Tuesday, Ms Winham's family said there was a \"huge opportunity missed\" to take action after police raised concerns that she had little food or money.\nThe inquest ruled her cause of death was \"unascertained\" and a time of death could not be pinpointed, but a calendar in Ms Winham's flat had dates crossed off until 1 November, 2017.\nIn a statement read by the family's solicitor, Iftikhar Manzoor, they added: \"Laura was clearly a person potentially at risk but she wasn't deemed worthy of visiting. She was left to fend herself.\n\"Laura was a much-loved, much-missed daughter and sister. Her family did everything in their power to support her as she battled her mental health struggles until it became apparent that she may harm herself unless they backed away.\"\nInitially held in October 2024, the inquest heard that Ms Winham's \"mummified and almost skeletal\" body had been found at her social housing property in Devonshire Avenue in May 2021.\nMs Winham's sister, Nicky Winham, told Surrey Coroner's Court in October that Laura had twice been sectioned and cut off contact with her family because she believed they were trying harm her.\nLuke Addams, director of practice, assurance and safeguarding at Surrey County Council, told the inquest that the authority \"could have done more\" for Ms Winham.\nCoroner Karen Henderson ruled there were \"lost opportunities\" for multiple agencies in the run-up to her death, including Woking Borough Council and its former contractor, New Vision Homes, the Department for Work and Pensions, and Surrey County Council's adult social care team.\nDr Henderson described the county council's adult social care team investigation as \"perfunctory in almost every way\" but added that it was not possible to conclude these lost opportunities \"materially contributed\" to Ms Winham's death.\nThe court previously heard that Ms Winham's family last saw her in person in 2009, and contact over social media had stopped in 2014 after she sent them a message on Facebook which read: \"It is best to have minimum/no contact. And communications with the family.\n\"It is totally out of my hands. There is nothing I can do. Everything I say will get repeated and relayed back. Be patient.\"\nThe family said they believed they were doing the right thing by respecting Ms Winham's wishes to have no contact with them. Her sister Nicky told the court: \"We knew that contact with us exacerbated her mental health difficulties.\"\nMs Winham's mother and brother found her remains after trying to make contact in January 2021 when her father's health was deteriorating.\nThe inquest previously heard that Ms Winham had written that she was \"starving\" in calendar entries.\nShe also expressed her fears about doing food shops, with a diary entry in October 2017 reading: \"Whole month since my last food shop. I can't believe I'm surviving this long.\"", "url": "https://www.bbc.co.uk/news/articles/cjevx91v988o"}