{"authors": ["Jim Reed", "www.facebook.com"], "date_download": "2025-04-26 04:33:54", "date_modify": "2025-04-26 04:33:54", "date_publish": "2025-03-03 02:49:51", "description": "Four weeks of hearings will look at the purchase of billions of pounds of medical equipment in the pandemic.", "filename": "news_articles_c86pp6gqd7vo_1745642034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/147f/live/a0bd3cc0-f5ef-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pp6gqd7vo_1745642034.html", "title": "Covid inquiry focuses on PPE deals and the use of a 'VIP' lane", "title_page": "Covid inquiry focuses on PPE deals and the use of a 'VIP' lane - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Covid public inquiry has started four weeks of hearings, looking into the purchase and distribution of billions of pounds' worth of medical equipment during the pandemic.\nIn total, it's thought £48bn was spent on personal protective equipment (PPE), the test-and-trace programme, hospital supplies and the vaccine rollout.\nNearly 10% of contracts were awarded to firms with a link to the Conservative government in power at the time, according to the organisation Transparency International.\nBereaved families have accused the inquiry of a \"potential whitewash\" after it emerged representatives of PPE suppliers will not be called upon to give evidence.\nThis fifth section of the inquiry will hear from 50 witnesses, expected to include law experts, civil servants, politicians and transparency campaigners.\nQuestioning will cover the value of contracts awarded to companies in the pandemic, spending controls, the prevalence of fraud and the steps taken to eliminate it.\nThe inquiry will also look in detail at the use of the so-called \"VIP lane\" – officially known as the high priority lane – to award government contracts.\nIntroduced in April 2020, the idea was to treat offers to supply PPE with greater urgency if they came with a recommendation from ministers, MPs, members of the House of Lords, or other senior officials.\nAt the time the government said there was a \"desperate need\" to protect health and social care staff, and it was argued swift action was required to secure PPE.\nA National Audit Office report, external later found that up to the end of July 2020, about one in 10 suppliers in the high priority lane was awarded a contract, while the figure was less than one in 100 for other suppliers.\nThe government ordered more than 30m masks, gowns and other items of PPE during Covid, with contracts totalling £14.6bn.\nThis part of the inquiry will also look at the purchase of ventilators to help patients breathe, as well as millions of lateral flow and PCR tests.\nBereaved families have accused the inquiry of \"protecting PPE suppliers from scrutiny\", after it emerged the inquiry would not seek evidence from commercial firms involved in the contracts.\nLobby Akinnola, whose father Femi died in April 2020, said individual suppliers need to be held to account.\n\"If people are not called to give evidence, then how are we ever going to know what went wrong?\" he asked.\n\"Covid cost the lives of nearly 250,000 people in the UK, and if we don't take every step we can to learn from mistakes, we are going to leave a weakness in our response.\"\nA spokesman for the Covid inquiry said it did not need to hear evidence directly from PPE firms as the focus \"is on how the government responded to suppliers' offers\".\n\"Our role is not to pursue criminal investigations into individuals or suppliers – that is a matter for law enforcement,\" he said.\nThe inquiry also ruled in January that any sensitive evidence about PPE Medpro, the supplier linked to Baroness Michelle Mone and her husband Doug Barrowman, would be held in private to avoid prejudicing any criminal investigation.\nThe inquiry's chair, Baroness Hallett, has already taken evidence on other subjects including pandemic planning and political decision-making, the impact on the NHS and the vaccine rollout.\nFuture phases later this year will cover the care sector, test-and-trace, the impact on children, and the economy.", "url": "https://www.bbc.co.uk/news/articles/c86pp6gqd7vo"}