{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 06:33:54", "date_modify": "2025-04-26 06:33:54", "date_publish": "2025-02-27 06:29:53", "description": "A planning application is submitted, while a public consultation garners 800 responses.", "filename": "news_articles_cy4l8zk47k8o_1745649234.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e74/live/8ea33150-f452-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4l8zk47k8o_1745649234.html", "title": "Consultation on new Northampton crematorium gets 800 responses", "title_page": "Consultation on new Northampton crematorium gets 800 responses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "About 800 responses have been sent to a consultation about plans for a new crematorium, local planners said.\nWest Northamptonshire Council wants to build the Wantage Park facility next to a school on the edge of Northampton.\nA planning application has now been submitted for the project, which the council says will reduce waiting times and provide a peaceful space for families.\nSome local residents in the Moulton area said noise from the school would disrupt funerals and the crematorium would create too much extra traffic.\nPlans were unveiled for the site in September in response to what the council described as an urgent need for cremation facilities.\nThe proposed location is in a field next to the new 1,200-place Northampton School, on the edge of a new housing development and close to Moulton.\nThe council said the crematorium would be \"designed with sustainability in mind [and would] include electric cremators, solar panels and green roofs\".\nThe surrounding area would \"feature green spaces and walking paths for the community to enjoy\".\nThe council said its consultation exercise, which included a public meeting, \"saw over 800 responses, reflecting the strong local interest in ensuring the facility meets the needs of the community\".\nMany people responding on social media have been sceptical about the proposal.\nOne said: \"If you think mourners want to hear a school playground on one side and a kids' play area on the other side, and that teenagers at school want to see an endless procession of coffins every single day... you've lost all grip on reality.\"\nAnother added: \"The traffic is bad there now and the school is not fully open! It would be horrendous with all the funeral traffic as well.\"\nThe council said it had worked with transport specialists to design a plan that minimised disruption.", "url": "https://www.bbc.co.uk/news/articles/cy4l8zk47k8o"}