{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 07:55:53", "date_modify": "2025-04-26 07:55:53", "date_publish": "2025-02-25 12:27:39", "description": "English Heritage says the tree presents a major safety issue after it was found to be diseased.", "filename": "news_articles_c2417733v10o_1745654153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37a7/live/1d5c9f60-f374-11ef-80a6-edca8054bafc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2417733v10o_1745654153.html", "title": "Framlingham Castle's copper beech tree to be felled", "title_page": "Framlingham Castle's copper beech tree to be felled - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A prominent tree that stands in front of a castle is due to be felled because of safety concerns.\nEnglish Heritage said the copper beech tree in front of Framlingham Castle in Suffolk was diagnosed with an untreatable fatal fungus infection.\nFramlingham Town Council described the tree as \"iconic\".\nEarlier this month, East Suffolk Council granted permission for the work, and English Heritage has two years to carry it out.\nEnglish Heritage said the tree had been found to have Kretzschmaria Deusta, commonly known as brittle cinder.\n\"There is no treatment for this and once it has infected its host it will cause the tree to die,\" it said in a statement.\n\"Whilst at present the tree visually looks healthy, the fungus can result in sudden breakage, posing a serious risk to the public, particularly as the tree is in a position where hundreds of people visit every day.\"\nEnglish Heritage said it had closely monitored the tree \"for a number of years\" and it conducted a survey of it in 2021.\n\"Felling the tree - a living part of that story - is something we do not undertake lightly and wouldn't consider if we weren't certain it was absolutely necessary,\" English Heritage's statement continued.\n\"As much as we wish to preserve the past, the safety of our visitors, the public and our staff and volunteers has to come first.\"\nNo other objections were made on the application and English Heritage said it would plant a new sapling on the existing site of the tree.\nA spokesperson for the town council said it initially opposed the felling, and hoped the tree could be fenced off to allow it to die naturally.\n\"But examination has confirmed that damage from fungal infection has progressed too far,\" they added.", "url": "https://www.bbc.co.uk/news/articles/c2417733v10o"}