{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:20", "date_modify": "2025-05-19 15:29:20", "date_publish": "2015-02-09 10:20:14", "description": "Harry Potter actor Sir Michael Gambon reveals he is no longer able to play roles on stage due to problems remembering lines.", "filename": "news_entertainment-arts-31113639_1747668560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80878000/jpg/_80878100_gambon1_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31113639_1747668560.html", "title": "Sir Michael Gambon 'can't do' stage roles due to memory loss", "title_page": "Sir Michael Gambon 'can't do' stage roles due to memory loss - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Veteran Harry Potter actor Sir Michael Gambon has revealed he is no longer able to play roles on stage due to problems remembering lines.\n\"It's a horrible thing to admit, but I can't do it,\" he told the Sunday Times.\n\"When the script's in front of me it takes me forever to learn it,\" the 74-year-old continued. \"It's frightening.\"\nSir Michael can currently be seen in Fortitude on Sky Atlantic and appears in BBC One's upcoming dramatisation of JK Rowling's The Casual Vacancy.\nHis agent was unable to comment further on the Sunday Times interview.\n\"You've got to go to work, haven't you?\" he told the newspaper's Matt Rudd, dismissing suggestions he might give up acting altogether.\nFellow actor Dame Judi Dench told BBC Radio 4's PM programme she has been taking a health supplement as a \"preventative\" to memory loss, but not as a cure, as suggested by some newspaper reports.\n\"It sounds like I started to take these when I started to not remember the lines, and that's not true. I was told about this in 2002 and I started to take them then because I was learning The Breath of Life by David Hare with Dame Maggie [Smith].\n\"She and I both took them. I've put everybody on them since, they're absolutely wonderful, they've done the job. So mine, I hope is a preventative,\" said Dame Judi.\nWhen asked by presenter Eddie Mair if they worked she said: \"Well, I'm touching wood, you can't believe what wood I'm touching, but so far so good. I think in 59 or 60 years I've been on the stage there is an occasional moment where you completely forget a line, but so far I'm able to retain them.\"\nDame Judi said as well as taking two tablets each morning, she tried to learn something new every day to keep her brain active.\n\"I try and learn just one fact every day. I'm a games player and I love things that involve words. I could do the whole of A Midsummer Night's Dream for you now or Twelfth Night... I can't put you through that!\"\nAccording to the Sunday Times, Gambon - best known for playing Professor Dumbledore in six of the eight Harry Potter films - suffered panic attacks in 2009 after forgetting lines during play rehearsals at the National Theatre.", "url": "https://www.bbc.com/news/entertainment-arts-31113639"}