{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:07:08", "date_modify": "2025-05-21 05:07:08", "date_publish": "2025-04-04 00:00:00", "description": "Donald Trump imposed a 25% tariff on foreign-made cars as part of his economic plan to \"supercharge\" the US economy.", "filename": "news_live_cvg52gjwg91t_1747804028.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cvg52gjwg91t_1747804028.html", "title": "President tells US to 'hang tough' over tariffs as Land Rover pauses shipments to country", "title_page": "President tells US to 'hang tough' over tariffs as Land Rover pauses shipments to country - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The largest day of anti-Trump protests since his White House return\nPeter Bowes\nNorth America correspondent\nProtestors were out in force around the United States.\nIt was the largest single day of demonstrations against Donald Trump since he returned to the White House, with opposition groups gathering in Washington and many other major cities.\nTheir goal was to highlight what they see as Trump's authoritarian style of government - such as decisions to sack federal workers and break up the Department of Education.\nHis foreign policy has also come in for criticism.\nSome protestors carried Ukrainian flags while others had \"Free Palestine\" signs.\nAnd then there's the sweeping tariffs on goods imported into the US, the most recent bombshell to affect not only Americans but the entire world.\n\"They're just, in my opinion and the opinion of a lot of people, going about it the wrong way. And it's going to cost - it's going to cost the farmers in the red states. It's going to cost people their jobs... people have lost tens of thousands of dollars,\" one protester said.\nAnother said \"I believe Donald Trump is trying to tear our country down. He’s ruining infrastructure, government departments, destroying our economy. We have to stand up and take our country back\".\nWith baseline 10% tariffs now in effect on all imports into the US, Trump started the weekend by warning Americans, in a social media message, that \"it won't be easy\", though he said his economic strategy would deliver \"historic\" results and would bring back jobs and businesses \"like never before\".\n\"Hang tough\", he wrote after a week which saw trillions of dollars wiped off the value of US stocks on Wall Street.\nWe are continuing our live coverage in our new page. You can also stay updated on the latest news below:\nTrump urges US to 'hang tough' as 10% tariffs come into effect\nAnti-Trump protests in cities across US declare 'hands off'\n'Sometimes you have to walk through fire': Tariffs get backing in Trump heartland\nProtests around the US as the fallout from Trump's new tariffs continues\nIt's been another dramatic day as some of President Trump's newly-unveiled tariffs begin and the effects of stock market falls in recent days are felt.\nLuxury car maker Jaguar Land Rover (JLR) confirmed today that it'll pause shipments to the US after the White House introduced a 25% tariff on all car imports.\nYesterday, Wall Street's three main indexes dropped by more than 5%.\nHere's a quick recap of the latest updates:\nTariffs 'baseline' tariffs kick in\nTrump's \"baseline\" 10% tariffs, for the UK and other countries, came into effect today.\nOther nations and trading partners, such as the EU, will face a higher level from the 9 April.\nConcerns expressed globally\nMany governments and businesses around the world have been speaking out today against Trump's move.\nThe UK and France said today a trade war is \"in nobody's interests\" but agreed \"nothing should be off the table\" with their response to tariffs.\nChina yesterday became the first nation to issue retaliatory tariffs on all US imports, introducing a 34% levy for US goods from next Thursday.\nWhat are Trump's latest comments?\n\"Hang tough, it won't be easy but the end result will be historic,\" the president posted on his Truth Social platform this morning.\nSince then, Trump has been playing golf as the tariff fallout continues and has now returned to his Mar-a-Lago estate.\nThe White House earlier called a \"lid\", which means we aren't going to see the president or hear from him in public today.\nProtests internationally\nCrowds have gathered in cities around the US and the world, including London and Washington DC, for anti-Trump demonstrations.\nFrom Berlin to London, protesters have hit out against the US president and billionaire Trump adviser, Elon Musk, calling for an \"end to the chaos\" and expressing support for Ukraine.\nThis is the first widespread, public anti-Trump protest that we've seen across the US since the president's second term started.\nMaryland Democratic Congressman Jamie Raskin spoke at a protest in Washington DC and railed against Trump for supporting policies that he said will only benefit billionaires.\n“If they think they're going to overthrow the heroes of American democracy, they don't know who they're dealing with,\" he said, before adding:\nQuote Message\nOur founders wrote a constitution that does not begin with 'We the dictators'. The preamble says 'We the people'.\"\nJamie Raskin, Democratic US congressman\nTrump will provide long-term tax certainty - US Treasury secretary\nWe've just seen a statement from US Treasury Secretary Scott Bessent about the Republicans' budget plan that was passed in the Senate overnight.\n\"Congress is taking smart action to strengthen America’s economy and repeal wasteful government spending,\" Bessent says of the outline, which includes tax cuts sought by Donald Trump.\nHe continues by saying: “by advancing this budget resolution, the Senate sends a strong signal to every small business and every working family\".\nBessent adds that \"President Trump’s economic agenda will provide long-term tax certainty\".\nThe budget plans must now head to the House. It was adopted in the early hours of Saturday morning 51-48 nearly along party lines, with two Republicans joining the Democrats to vote against it.\nThe so-called vote-a-rama (a series of several votes all in a row) held overnight also included decisions on measures such as government cuts made by Elon Musk's DOGE and on Medicaid. Senators rejected a Democratic proposal to rescind the recent tariffs if they cause food prices to go up.\n\"I look forward to working with House leadership to finish this crucial first step and unlock legislation that strengthens our economic and fiscal foundations,\" Bessent said.\nWashington DC protesters declare 'No kings'\nJenna Moon\nLive editor, in Washington DC\n\"No kings\".\nThat's the overriding sentiment of the day at Washington DC's \"hands off\" protest, one of several happening across the country. I've seen several protest signs carrying the slogan, an apparent reference to a February tweet from Trump declaring \"long live the king\".\nFrom my vantage point on a bench on the National Mall - the strip of green space and boulevards running from the Lincoln Memorial to the Capitol building - I can see hundreds of people still pouring out of a nearby metro station.\nOne attendee named Theresa tells me she's protesting today because she wants people to \"pay attention to the fact that we're losing our democratic rights\".\n\"I'm very concerned about the cuts they're making to the federal government. I have a disabled son and I want to make sure he has his social security and he has his education rights\", she adds.\nI ask her if she feels the White House is listening to concerns raised by protesters that have spread out across the country today.\n\"Well, let's see. [Trump has] been golfing just about every day\", she says.\nBut she's hopeful that the tides will change soon. \"Eventually, they'll have to listen.\"\nWhite House trade adviser downplays stock market falls\nTrump trade adviser Peter Navarro has been speaking to the media today and downplaying the stock market falls in recent days.\n“The market will find a bottom. It will be soon and from there we’re going to have a bullish boom,\" he told CNN.\nNavarro went on to predict that \"the Dow is going to hit 50,000 during Trump’s term\" and the S&P 500 is going to have a very broad-based recovery\".\nThe Dow Jones Industrial Average closed at 38,314 on Friday afternoon, down from an all-time high of more than 45,000 in December 2024.\n\"Wages are going to go up, profits are going to go up, and life is going to be beautiful here in America,” he added.\nUS markets closed yesterday with their worst two-day stretch since 2020, when the pandemic hit. The fall came after Trump's sweeping tariffs on imports from other countries.\nWhy is Trump a big fan of tariffs?\nTrump once said tariff was the most \"beautiful word in the dictionary\" and for decades he has argued that the US should use them to boost its economy.\nHe says tariffs will encourage US consumers to buy more American-made goods, increase the amount of tax raised and lead to huge levels of investment in the country.\nTrump wants to reduce the gap between the value of goods the US buys from other countries and the value of those it sells to them. He argues that America has been taken advantage of by \"cheaters\" and \"pillaged\" by foreigners.\nTrump has also made other demands alongside tariffs. The first announced during his current presidential term targeted key US trading partners China, Mexico and Canada. He said he wanted them to do more to stop migrants and drugs reaching the US.\nRead more: What are tariffs and why is Trump using them?\nThousands join protest against Trump in drizzly Boston\nRobin Levinson King\nReporting from Boston\nAs demonstrators gather in cities around the world, thousands have amassed in downtown Boston, Massachusetts to protest Donald Trump's actions over tariffs and other policies enacted during the start of the president's second term.\nLight rain drizzled on the marchers in Boston as the sounds of Revolutionary War-era fife and drum music played - a reminder of the city's pivotal roll in the American Revolution 250 years ago.\nOne protestor, who declined to give her name out of fear she could be targeted by the administration, tells the BBC that the country is in a \"scary\" place right now.\n\"I've lived 82 years in this country and it's a beautiful place,\" she says. \"He's what's wrong with it,\" she says, referring to Trump.\nOne of the issues on people's minds here today is the detention by immigration authorities of nearby Tuft's University Turkish international student Rumeysa Ozturk.\nProtesting law student Katie Smith says that now more than ever, academic institutions must protect students and faculty.\nSmith says she came to the protest today because \"you can stand up today or you can be taken later\".\n\"I'm not usually a protest girlie,\" she says.\nBut when she learned that her grandmother planned to go to a Hands Off rally in another state, Smith says she decided she would go too.\n\"It was really a shock to me that a woman who was 85 who protested in the 60s and 70s had to return to the streets. So I had to show up.\"\nWe need to have an even playing field, say Trump supporters\nMike Wendling\nReporting from Delta, Ohio\nThe small town of Delta in Ohio is Trump country - the Republican ticket easily won here in November's presidential election by a margin of almost two-to-one.\nAnd while the markets are in turmoil following Trump's unveiling of expansive global tariffs this week, plenty of people in Delta and hundreds of Midwestern towns like it still back the president's plans.\n\"I don't want people in other countries to suffer, I really don't,\" said Mary Miller, manager of the Delta Candy Emporium, which sits in the middle of the village's Main Street. \"But we need to have an even playing field.\"\nMiller is unfazed by the possibility of price increases, which many economists predict these new tariffs will bring.\n\"Sometimes you have to walk through fire to get to the other side,\" she said. \"If tariffs bring companies and business back to hard-working American people, like the ones who live here, then it's worth it.\"\nRead more: Tariffs get backing in Trump heartland\nElon Musk hopes for 'zero-tariff situation' between US and Europe\nWe can bring you the latest comments from Elon Musk, one of Trump's closest advisers, who says he hopes for a \"zero-tariff situation\" between the US and Europe.\n\"I hope it is agreed that both Europe and the United States should move ideally, in my view, to a zero-tariff situation, effectively creating a free-trade zone between Europe and North America,\" he says in a live discussion with Italy's hard-line deputy prime minister Matteo Salvini.\n\"And more freedom for people to move between Europe and North America, if they wish,\" he continued, adding, \"that has certainly been my advice to the president\".\nIt appears to be Musk's first remarks about the tariff rollout.\nIn his remarks, he also criticises Europe for its \"stifling\" regulations, which he says make it a bad place to start a new business.\nTrump returns to Mar-a-Lago after golf day\nBernd Debusmann Jr\nReporting from Florida, travelling with Trump\nIn the past 30 minutes, the White House has called a \"lid\". In the parlance of the White House press corps, this means that we aren't going to see the president or hear from him in public today.\nThe lid was called just moments after Trump returned to his Mar-a-Lago estate.\nThose of us travelling with him didn't see him in person today, although we've always been nearby. I just spent the last 20 minutes observing a group of iguanas basking in the sun near the estate.\nWe may, however, hear from Trump via his Truth Social account, and various White House-affiliated accounts and officials are likely to post updates here and there. We'll be keeping an eye on this for the rest of the day.\nTrump plays golf as tariff fallout continues\nBernd Debusmann Jr\nReporting from Florida\nGreetings from sunny Florida, where President Donald Trump just wrapped up playing golf at one of his courses in the town of Jupiter.\nSo far, there are no signs of protests here. At a nearby shopping complex where we waited, I spotted several people in red MAGA hats. Most locals just seemed curious about the massive police presence and the reporters in the travel \"pool\".\nSo far, we've not heard from the president or the White House about the protests.\nThe only update I've had from the White House today was to let us know that Trump won the second round of his matchup in a senior championship at the golf course.\nHe will play in the championship round tomorrow.\nHe does, however, seem to be paying close attention to news about the tariffs.\nThis morning, an AP photographer - excluded from the press pool - captured an image of him driving into the golf course with an issue of the New York Post in his hand, open to an article about China.\nI'll be keeping an eye on him and his movements today, so stick with us.\nNo sign of Trump backing down but could a backlash at home change that?\nPeter Bowes\nNorth America correspondent\nWith baseline 10% tariffs now in effect on all imports into the US, President Donald Trump took to social media to acknowledge that \"it won't be easy\".\n\"Hang tough\" he wrote, after his tariffs caused some of the largest losses on Wall Street for several years.\nBut, the US president insisted his economic strategy would deliver \"historic\" results, bringing back jobs and businesses \"like never before\".\nAs countries and businesses around the world continue to assess the president's 'no pain, no gain' strategy to boost the US economy, Ralph Goodale, the High Commissioner for Canada in the UK, said a backlash at home could prompt Trump to change course.\n\"The United States has to feel the pain, because ultimately it will be Americans who will persuade their governments they have to stop this foolishness,” he told BBC Radio 4's Today programme.\nWhile Trump has shown no signs of backing down, he has indicated that he's open to negotiations with America's trading partners.\nProtests against the president’s sweeping's policy changes on a range of issues - from the sacking of government workers to cuts in education - are taking place around the US today.\nThey're also likely to reflect growing fears that the newly-imposed tariffs are about to exacerbate an already painful cost of living crisis.\n'Everywhere I go, people feel America is against them'\nAs anti-Trump protests kick off around the world, hundreds are gathering in London’s Trafalgar Square to demonstrate against the tariffs announced by the White House.\nAlyssa, an American living in the UK, says the tariffs are causing \"everyone to [lose] money\", and accuses Trump and Elon Musk of \"dismantling American democracy and trying to do the same thing in Europe\".\nAlec Le Beut, who's studying in the UK but comes from Los Angeles, says it's more than just the tariffs, adding that the \"administration's actions towards its friends and allies has been scary\", and he worries for the future as a result.\nStudent Tyler Hofer, from St Louis, Missouri, accuses Trump's White House of \"turning on its allies\", saying: \"Everywhere I go, people feel that America is against them.\"", "url": "https://www.bbc.com/news/live/cvg52gjwg91t"}