{"authors": ["Shelagh Parkinson", "www.facebook.com"], "date_download": "2025-04-26 07:06:40", "date_modify": "2025-04-26 07:06:40", "date_publish": "2025-02-28 06:15:06", "description": "Jane Podmore, 57, says she believes her age is against her in her daily quest to find work.", "filename": "news_articles_ckg88yy266lo_1745651200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/85ef/live/391f9d30-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg88yy266lo_1745651200.html", "title": "Blackpool Jobs Fair: 'I've applied for more than 5,000 positions in four years'", "title_page": "Blackpool Jobs Fair: 'I've applied for more than 5,000 positions in four years' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who has been out of work since 2019 has said she has applied for more than 5,000 jobs in four years without success, but still remains optimistic of getting back into employment.\nJane Podmore was among thousands of hopefuls who filed into Blackpool Jobs Fair at the Winter Gardens in the hope of impressing some of the 100 employers there.\nThe 57-year-old said she believed her age was among the factors against her in her daily quest to find work.\n\"I apply for something every day,\" she said. \"What is disappointing is you don't get any feedback.\"\nMs Podmore, of Blackpool, ran her own business for 10 years but lost her employment in 2019 after being furloughed by Blackpool Council.\nShe told the Local Democracy Reporting Service: \"I have been looking for work since then and have applied for lots of jobs... and I got to the final selection stage but then didn't get anything.\n\"It is disheartening but I have my grandchildren to keep me busy, and until recently my dog.\"\nShe said she felt her age was \"a barrier\".\n\"I have 10 years before I get my pension and I want to work and I need the money for my security as I get older,\" she said.\n\"Which is why this event today has been so good because I have been able to meet potential employers face-to-face.\n\"I've talked to at least 10 different employers and each one has taken time to speak to me, so I have phone numbers and am very hopeful of finally getting something.\"\nThe unemployment rate in the seaside town is 7%, compared to the national rate of 4.4%, external.\nThe jobs fair was organised by Blackpool South Labour MP Chris Webb who said he wanted to break the cycle of low income in the town.", "url": "https://www.bbc.co.uk/news/articles/ckg88yy266lo"}