{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:32:19", "date_modify": "2025-04-26 04:32:19", "date_publish": "2025-03-03 05:35:30", "description": "Jeans Halls has a passion for animals and once sold a home so she could rescue two ponies.", "filename": "news_articles_cr422g7zp34o_1745641939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eb67/live/565e6570-f5d9-11ef-b21f-25997e41ca0d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr422g7zp34o_1745641939.html", "title": "Lowestoft care home resident, 92, surprised by pony visit", "title_page": "Lowestoft care home resident, 92, surprised by pony visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A care home resident with dementia was left overjoyed when she was surprised by a visit from a Shetland pony.\nJean Halls, 92, lives at Harleston House Care Home in Lowestoft, Suffolk, and was visited by Whizz from Pakefield Riding School.\nIt was part of the home's Dreams Come True initiative to help residents achieve goals and fulfil wishes.\nMs Hall's daughter, Nina Duncan, who lives in Norwich, said the care home team was \"absolutely amazing\".\n\"As soon as the Shetland pony arrived and she came through the side doors, and we had all gathered around, [my mother] opened her eyes and gave the biggest smile,\" Ms Duncan said.\n\"We put a carrot in her hand and that was it - she totally engaged with the pony. It was lovely to watch.\"\nMs Duncan said her mother could sometimes be disconnected from the world around her due to her dementia.\nHowever, she had always had a love of animals and studied at the Northamptonshire Institute of Agriculture.\nShe also often rescued animals, including two ponies called Sammy and Zola, when the family lived in Lowestoft.\nHer parents decided to sell their house to buy the one next door, but kept some of the land from their original house.\nThis was so they could move the ponies to the new house where her father built stables.\n\"So basically, they sold a house for the ponies,\" Ms Duncan added.", "url": "https://www.bbc.co.uk/news/articles/cr422g7zp34o"}