{"authors": ["Nadia Lincoln", "www.facebook.com"], "date_download": "2025-04-26 06:50:57", "date_modify": "2025-04-26 06:50:57", "date_publish": "2025-02-28 18:01:02", "description": "Campaigners say a council is not prepared to defend its decision to reject the project.", "filename": "news_articles_crmjjm92v3zo_1745650257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c9f3/live/0cbf7fa0-cdeb-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjjm92v3zo_1745650257.html", "title": "Concerns about A14 Thrapston solar farm before public inquiry", "title_page": "Concerns about A14 Thrapston solar farm before public inquiry - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners opposed to a solar farm have raised concerns a council will not back its objections, despite previously having its own issues with the plans.\nThe proposed site, which would span 145 acres (59 hectares) near the A14 at Thrapston, Northamptonshire, was designed to generate enough power for up to 15,000 homes, according to its applicant.\nNorth Northamptonshire Council turned down the plans in October, citing concerns over landscape impact and habitat loss, but the decision will be analysed at a public inquiry in May.\nCampaign group Staunch said the council did not plan to provide evidence to the inquiry, but the council was adamant it would \"support and co-operate fully\".\nThe Planning Inspectorate will hold the inquiry on 20 May, with the local authority required to defend its decision or have it overturned.\nHowever, Staunch said it intended to fight the appeal as a Rule 6 party, external, which is where a group other than the appellant and local authority has permission to take an active part and provide evidence, the Local Democracy Reporting Service said.\nCampaign chairman, Kevin Shapland, said: \"We found out the day before submissions that the council had written saying they weren't going to fight the appeal.\n\"We have therefore written to the council putting them on notice that if this proceeds the way it is, we will seek a judicial review.\"\nResponding to the allegations, Conservative leader of the council, Jason Smithers, said: \"The planning inspector will hear all views, evidence and facts before making a decision.\n\"The council will support and co-operate fully with the Planning Inspectorate, including working on a statement of common ground which will establish those matters which are agreed with the main parties and which will assist the planning inspector in their decision.\"\nHe added: \"We are aware of feelings in the community about the application and will work proactively with all involved parties, taking all reasonable steps to support the process and the Planning Inspectorate.\"", "url": "https://www.bbc.co.uk/news/articles/crmjjm92v3zo"}