{"authors": ["Elliot Ball", "www.facebook.com"], "date_download": "2025-04-26 04:40:40", "date_modify": "2025-04-26 04:40:40", "date_publish": "2025-03-02 07:15:24", "description": "Those involved in the Vraiqu'sie Project will receive £5,000 to further their work.", "filename": "news_articles_c2err9y8l10o_1745642440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50cc/live/96899cc0-f5c8-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2err9y8l10o_1745642440.html", "title": "Jersey artists studying island's seaweed links get grant", "title_page": "Jersey artists studying island's seaweed links get grant - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Five artists studying the link between seaweed and Jersey's cultural heritage have been awarded a grant of £5,000.\nThe Vraiqu'sie Project was announced as the winner of Société Jersiaise's Barreau Scholarship.\nIt is studying the role of seaweed in the island's history and focusing particularly on vraicing - the practice of gathering seaweed to fertilise land to produce Jersey Royal potatoes.\nKeren Le Roy Harris, from the collective, said receiving the scholarship was a \"significant opportunity\".\n\"This support allows us to fully immerse ourselves in the Vraiqu'sie Project, expanding our research and creative exploration in ways that would not have been possible individually.\n\"The scholarship reinforces the collaborative nature of our work, mirroring the communal practice of vraicing itself - rooted in shared effort, tradition and connection.\"\nThe artists will share the grant money to contribute to the project, which could include sculptures, songs and seaweed-themed costumes.\nA spokesperson for Société Jersiaise said: \"Their [the collective's] goal is to emotionally reconnect people with seaweed - Jersey's intangible cultural heritage - through art, offering a transformative experience that ties together community, land and nature.\"", "url": "https://www.bbc.co.uk/news/articles/c2err9y8l10o"}