{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:19", "date_modify": "2025-05-19 15:38:19", "date_publish": "2015-02-13 17:09:15", "description": "Dundee University is awarded £1.79m to develop a next-generation research data storage and sharing facility.", "filename": "news_uk-scotland-tayside-central-31462261_1747669099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/75263000/jpg/_75263924_dundeeuniversity.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-tayside-central-31462261_1747669099.html", "title": "Dundee University to lead research data storage project", "title_page": "Dundee University to lead research data storage project - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee University is to lead a major project to help scientists store and share research data.\nThe Biotechnology and Biological Sciences Research Council has announced £7.5m of funding for infrastructure to help scientists study large datasets.\nNew imaging techniques mean researchers have huge amounts of new information to work with, but datasets are so large they are difficult to share.\nThe university is to set up an advanced data storage and sharing facility.\nPart of the university's new Dundee Imaging Facility, the £1.79m repository will allow the storage and curation of huge sets of data, which will help scientists across the world pursue advances in areas such as health, agriculture and sustainable fuels.\nFocusing on life sciences, the Dundee project will be led by Prof Jason Swedlow and his team at the Open Microscopy Environment, alongside colleagues at the European Bioinformatics Institute and the University of Cambridge.\nProf Swedlow said: \"We are seeing things that we have never been able to see before, thanks to a new generation of imaging technology and techniques.\n\"But with these advances also come challenges. The new imaging techniques generate enormous amounts of complex data and so special tools are required to manage, share and analyse these data.\n\"At Dundee we have built several open software platforms that are used by scientists worldwide for accessing and managing these enormous datasets. This new project will take that work up another level.\"", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-31462261"}