{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 03:49:47", "date_modify": "2025-04-26 03:49:47", "date_publish": "2025-03-05 13:21:07", "description": "The West of England Combined Authority has been under close government monitoring for the past year.", "filename": "news_articles_cy9dxzyj5lpo_1745639387.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ffb5/live/d30f4a90-f9bb-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dxzyj5lpo_1745639387.html", "title": "West of England Combined Authority taken out of special measures", "title_page": "West of England Combined Authority taken out of special measures - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The West of England Combined Authority (WECA) is no longer under special measures, the government has confirmed.\nIt had been put on alert in March 2024 after external auditors warned of a \"sense of division\".\nSince then the authority, which covers Bristol, Bath and North East Somerset, and South Gloucestershire, has been monitored by the government and has followed a plan for improvement.\nLabour MP Dan Norris, who currently also serves as the WECA mayor, said the authority had \"rolled up its sleeves to get on with people's priorities\".\nNorris, who is set to step down from his mayoral role this spring, added that he was \"grateful to officers and partners for their ongoing hard work for residents and businesses across the West of England\".\nIn a letter published on Wednesday, the Ministry of Housing, Communities and Local Government (MHCLG) informed WECA chief executive, Stephen Peacock, that the improvement notice it issued a year ago was expiring and would not be renewed.\n\"Whilst we will not be renewing the notice, we expect to see the progress made by the combined authority and all constituent members fully embedded and sustained,\" the letter said.", "url": "https://www.bbc.co.uk/news/articles/cy9dxzyj5lpo"}