{"authors": ["Adina Campbell", "www.facebook.com"], "date_download": "2025-04-26 04:05:33", "date_modify": "2025-04-26 04:05:33", "date_publish": "2025-03-03 17:13:41", "description": "A court is shown footage of a man waving a zombie knife moments before Cher Maximen is stabbed.", "filename": "news_articles_ckg840g8n2eo_1745640333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6354/live/f7052ce0-f848-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg840g8n2eo_1745640333.html", "title": "Notting Hill Carnival murder trial shown zombie knife footage", "title_page": "Notting Hill Carnival murder trial shown zombie knife footage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police bodycam footage of a man waving a zombie knife moments before a woman was fatally stabbed in front of her three-year-old daughter has been shown at a trial for her murder.\nCher Maximen, 32, was stabbed in the groin at the Notting Hill Carnival on 25 August - the first day of the event and known as \"family day\".\nThe Old Bailey was shown footage of Ms Maximen becoming separated from her daughter after a fight broke out, and hurled to the ground where she was stabbed - she died six days later in hospital.\nShakeil Thibou, 20, from Kensington, west London, denies murder.\nMoments before the alleged attack, carnival goers were seen dancing and hugging each other in police video footage shown to the court.\nAfter a fight broke out on Golborne Road, North Kensington, the footage showed Ms Maximen becoming separated from her young daughter, pushed back and hurled to the ground.\nLead prosecutor Edward Brown KC told the court that one man, who had tried to avoid being stabbed with the zombie knife, had come into contact with Ms Maximen, who ended up falling to the floor.\nAs she tried to pull herself up to defend herself, the jury heard she had grabbed onto the coat of the man accused of killing her, who then allegedly deliberately thrust the knife into her groin.\nDet Con Kevin Newton from the Metropolitan Police told the court he had spent more than 100 hours examining and re-examining video footage of the attack.\nShakeil Thibou denies murder, the attempted murder of another man and possessing an offensive weapon.\nHis brothers Sheldon Thibou and Shaeim Thibou, both in their twenties, deny assaulting an emergency worker and violent disorder.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/ckg840g8n2eo"}