{"authors": ["Miles Davis", "www.facebook.com"], "date_download": "2025-04-26 04:19:24", "date_modify": "2025-04-26 04:19:24", "date_publish": "2025-03-04 06:17:13", "description": "Devon County Council wants to scrap a £450-a-year car user allowance for more than 800 staff.", "filename": "news_articles_cj67rpk9npyo_1745641164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/19e2/live/982ce2f0-f82d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj67rpk9npyo_1745641164.html", "title": "Council uses fire-and-rehire to change contracts", "title_page": "Council uses fire-and-rehire to change contracts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council is engaging in \"bully-boy tactics\" by using a controversial fire-and-rehire process to try to change working conditions for more than 800 staff, unions say.\nDevon County Council has told employees if they do not accept the new conditions by 23 March they will be dismissed on 31 March to be rehired under a new contract.\nStaff such as social workers currently get an allowance of £453 a year for using their own car on work business but the county council wants to scrap that allowance.\nDevon County Council said the move was \"fairer\" to all staff and would save taxpayers about £500,000.\nDevon County Council said the decision to end negotiations on the issue was \"mutually agreed between the council and unions\".\nBut Jake McLean, from the GMB union, said the council was \"threatening\" members when it should be treating them \"with dignity and respect\".\nHe said: \"It's time for Devon County Council to put their toys back in the pram, withdraw this threat and return to the negotiating table so we can solve this issue.\n\"Our members should have no doubt, we won't stand for these bully-boy tactics and we will do whatever is necessary to ensure their voices are heard.\"\nSteve Ryles, from the Unison union, said the county council's approach was \"reckless\" and \"creating unnecessary distress for hardworking staff\".\nHe said: \"Instead of threats, the council should respect its staff, withdraw this ultimatum and come back to the table for proper discussions.\n\"Fire-and-rehire is a disgraceful practice that has no place in a responsible employer's playbook.\"", "url": "https://www.bbc.co.uk/news/articles/cj67rpk9npyo"}