{"authors": ["Ruth Bradley", "www.facebook.com"], "date_download": "2025-04-26 04:21:35", "date_modify": "2025-04-26 04:21:35", "date_publish": "2025-03-03 14:38:27", "description": "Councillors scrap the plans after strong opposition from hundreds of residents and businesses.", "filename": "news_articles_cevx4plx1j9o_1745641295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e851/live/869c5710-f836-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevx4plx1j9o_1745641295.html", "title": "Somerset car park evening charges plan dropped", "title_page": "Somerset car park evening charges plan dropped - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to bring in evening and overnight charges at Somerset Council car parks have been dropped after hundreds of residents and businesses objected.\nBut the council still plans to introduce charges at car parks which are currently free, like Langport and Wiveliscombe, and to charge at all its car parks on Sundays.\nThe authority is proposing the changes, external because different rates currently apply across its car parks.\nIt said the aim of the proposal was to \"bring consistency\" to the county and ensure the service remained \"completely self-funded\".\nMore than 2,200 people signed a petition, started by Taunton businesswoman Susie Thomas, which said the proposals were being \"rushed through under cover of financial emergency and budget setting\" and had been subject to \"inadequate debate and scrutiny\".\nMs Thomas said there had been no prior consultation with businesses and the proposed changes were a \"very real risk\" to Taunton's nightlife, cultural scene and town centre economy.\nMembers of the council's scrutiny committee had also previously voted against the proposals saying they were \"premature\" and needed more work.\nBusiness owners and residents, including in Milverton, Wiveliscombe and Langport, have said they fear plans to scrap free parking could \"frighten away shoppers\", meaning the loss of footfall and income.\nAt Monday's executive meeting councillors agreed to provide free parking for up to 30 minutes in new on-street limited waiting bays.", "url": "https://www.bbc.co.uk/news/articles/cevx4plx1j9o"}