{"authors": ["Mary McCool", "www.facebook.com"], "date_download": "2025-04-26 04:27:59", "date_modify": "2025-04-26 04:27:59", "date_publish": "2025-03-02 10:52:50", "description": "The SNP say Donald Trump needs to be a steadfast ally of Ukraine after a fiery exchange with Zelensky on Friday.", "filename": "news_articles_cp3yqwd1kkko_1745641679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f21d/live/6251cda0-f74f-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yqwd1kkko_1745641679.html", "title": "Keir Starmer dismisses SNP call to axe Donald Trump state visit", "title_page": "Keir Starmer dismisses SNP call to axe Donald Trump state visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The prime minister has dismissed calls from the SNP to scrap an unprecedented second state visit for Donald Trump following a showdown with Ukraine's President Zelensky.\nTrump accused Zelensky of \"gambling with World War Three\" at the White House on Friday, in a fiery exchange described as \"deeply troubling\" by Scotland's first minister.\nJohn Swinney told the BBC he did not see how a state visit for the US president - offered by the King on Thursday - could go ahead unless he was \"absolutely full-square with us\" in protecting Ukraine.\nHowever Starmer, who hosted a summit of European leaders including Zelensky earlier, accused the SNP of using rhetoric and said he would not be distracted.\nIt followed a number of SNP MPs criticising the prime minister's relationship with Trump on social media, including the party's Westminster leader Stephen Flynn who said Starmer \"better get back up off his knees and revoke that offer of a state visit\".\nPrior to Zelensky's warm welcome at Downing Street on Saturday, the SNP's foreign affairs spokesperson Stephen Gethins accused the prime minister of being silent on the matter which he said was \"disappointing\".\nAfter the White House exchange, Starmer called both Trump and Zelensky and later reiterated the UK's support for Ukraine, saying \"we stand with Ukraine for as long as it may take\".\nSpeaking to on the Sunday with Laura Kuenssberg programme, Starmer said: \"I've seen people ramping up the rhetoric and taking to Twitter and saying what they would do – good for them, I'm not that interested in that.\n\"I'm interested in what are the practical steps, what are the bridge building that I can do, what are the relationships that I can mend and take forward to take us to lasting peace in Europe.\n\"I'm not going to be diverted by the SNP or others trying to ramp up the rhetoric without really appreciating what is the single most important thing at stake here – we're talking about peace in Europe.\"\nStarmer used his US visit to present Trump with a letter from the King, offering an initial meeting in Scotland - where Trump owns two golf courses - to discuss the logistics of a second state visit.\nSecond-term US presidents are traditionally not offered state visits and have instead been invited for tea or lunch with the monarch, usually at Windsor Castle.\nTaking a different tone from SNP MPs, John Swinney said he welcomed the role the prime minister was taking and that he supported him trying to find a way through a difficult situation.\nSpeaking to the BBC's Sunday Show, he said: \"I think the prime minister is absolutely right to try and find a way forward with the United States because the position that unfolded on Friday evening was... deeply troubling to watch.\n\"To see a courageous leader of a courageous country being berated in the fashion that President Zelensky was is completely unacceptable.\"\nBut he added that he could not see how a state visit could go ahead if Trump was \"not a steadfast ally of ours in protecting the future of Ukraine\".\nHe said: \"That seems to me an absolutely fundamental requirement of any offer of a state visit to the president of the United States – that he is absolutely full-square with us in protecting Ukraine and insuring its independence.\n\"If we don't do that then I think we are undermining the future of western democracy.\"\nJohn Swinney has previously said he would use Trump's affinity for Scotland in a bid to avoid tariffs being applied on imports to the US, particularly on Scotch whisky.\nHe had publicly backed Harris, the Democratic nominee, in the run up to the 2024 presidential election.\nZelensky had hoped for positive talks with Trump during his visit, including the signing of a minerals deal which would give the US a real stake in his country's future, if not an outright security guarantee.\nInstead he faced an extraordinary dressing down in front of the world's media, with Trump and his Vice-President JD Vance demanding that he show more gratitude for years of US support.\nThe Ukrainian president pushed back at suggestions from his more powerful partners that he should work harder to agree a ceasefire with Vladimir Putin. They responded that he was being \"disrespectful\".\nAfter his departure, Zelensky said Ukraine is \"ready to sign the minerals agreement\" but continued his call for US security guarantees.\nThe exchange prompted a series of responses from European leaders with French President Emmanuel Macron and German Chancellor Olaf Scholz among those reiterating their support for Ukraine.\nFollowing the summit with European leaders in London, Starmer unveiled a four-step plan to guarantee peace in Ukraine, which will be discussed with the US.\nFour points were agreed - to keep military aid flowing into Ukraine, to have Kyiv at the table for any peace talks, for European leaders to aim to deter any future Russian invasion of Ukraine and a \"coalition of the willing\" will be formed to defend Ukraine and guarantee peace.\nAdditionally, the UK will be giving Ukraine access to £1.6bn ($2.01bn) to buy new missiles.\nSir Keir Starmer and John Swinney differ on the question of a state visit for Donald Trump.\nBut that's about the only point of contention between them on this global issue.\nIt was striking that the first minister went out of his way to repeatedly welcome the approach of Sir Keir to the war in Ukraine, and to say he was \"absolutely right\" to keep seeking a deal with the US.\nIf Sir Keir and Mr Trump are very different characters, then the prime minister has far more in common with Mr Swinney.\nThey are both serious men, more interested at this point in outcomes than optics.\nMr Swinney stopped short of slapping down Stephen Flynn's sharply-worded social media post, but he was explicit in his backing for Sir Keir's efforts to build bridges between Western allies.\nWhile the SNP leader is always keen to capitalise on any domestic differences with his electoral rivals in Labour, he has made it clear that they are on the same team on the international stage.", "url": "https://www.bbc.co.uk/news/articles/cp3yqwd1kkko"}