{"authors": ["Carmelo Garcia", "www.facebook.com"], "date_download": "2025-04-26 06:55:21", "date_modify": "2025-04-26 06:55:21", "date_publish": "2025-02-28 15:31:29", "description": "Talks have been taking place for months to improve the parking situation in the Cotswolds village.", "filename": "news_articles_cly885vg2xyo_1745650521.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fc88/live/58feaea0-f5e0-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly885vg2xyo_1745650521.html", "title": "Cotswolds: Coach parking temporary solution could 'result in death'", "title_page": "Cotswolds: Coach parking temporary solution could 'result in death' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A care home manager has said a temporary solution to coach parking shortages in a Cotswold town \"could ultimately result in death\".\nFollowing the closure of a Bourton-on-the-Water coach parking site in 2023, a provisional plan has been drawn up to allow coaches to pick up and drop off passengers on Meadow Way.\nBut the manager of Jubilee Lodge care home wrote to the parish council, concerned that coaches might block emergency vehicles and people might die as a result.\nThe temporary solution split a parish council vote to support the proposal put forward by Gloucestershire County Council highways and county councillor Paul Hodgkinson - with five in favour, three against and one abstention.\nFor six months, a traffic regulation order will allow coaches to leave Meadow Way after a 10-minute drop-off period, turn right onto Station Road, then right onto the Fosse Way before reaching the industrial estate.\nThe Local Democracy Reporting Service reports that parking would be available to Pulhams Coaches at the industrial estate between 09:00 and 16:00 every day.\nJubilee Lodge care home's manager said the \"noise pollution\" of coaches and their passengers would \"not only be disruptive to our residents but also those visiting loved ones\".\n\"The pathway is very narrow and many of our visitors require the use of wheelchairs and other mobility aids, I feel that space will be extremely limited for those trying to access our homes,\" they said in their communication to the parish council.\n\"My biggest concern is that, due to a high volume of traffic and with such a narrow road to and from Jubilee Lodge, the emergency services will not be able to get through, which could ultimately result in death.\"", "url": "https://www.bbc.co.uk/news/articles/cly885vg2xyo"}