{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:40", "date_modify": "2025-05-19 14:45:40", "date_publish": "2015-02-15 17:29:06", "description": "The suspected gunman in the deadly Copenhagen attacks was a young Danish-born man known to authorities because of past violence, police say.", "filename": "news_world-europe-31480921_1747665940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81026000/jpg/_81026266_eip41ps2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31480921_1747665940.html", "title": "Copenhagen shootings: Danish gunman 'had violent past'", "title_page": "Copenhagen shootings: Danish gunman 'had violent past' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Danish police say a suspected gunman who attacked a free-speech debate and a Copenhagen synagogue was 22, born in Denmark and with a record of violence.\nThe alleged attacker was shot and killed early on Sunday by police who were monitoring an address in the Norrebro district of the city.\nDanish media have named the suspect as Omar El-Hussein.\nA film director and a synagogue guard were killed in separate attacks. Five police officers were also injured.\nPolice believe the gunman was acting alone but they have not confirmed his identity.\nThe suspect was known to them in connection with criminal gangs and had convictions for violent offences and dealing in weapons.\n\"It was the case that when the suspect was shot and killed during police action, he was armed with pistols,\" police commissioner Thorkild Fogde told a news conference.\nThe attacks began on Saturday, when the gunman fired shots at a cafe hosting a seminar on free speech. It was attended by cartoonist Lars Vilks, who has faced death threats over his caricatures of the Prophet Muhammad.\nThe gunman opened fire again in the early hours of Sunday outside a synagogue in Copenhagen.\nThe Danish intelligence service is investigating whether the gunman was copying the shootings in Paris last month, when 17 people were killed in attacks on the satirical magazine Charlie Hebdo and a kosher supermarket.\nEarlier, the head of the intelligence service told reporters the man had been known to them, and police were working to determine whether he had travelled to Syria or Iraq.\nPrime Minister Helle Thorning-Schmidt described the shootings as \"a cynical act of terror against Denmark\" and said her government would not compromise on its defence of free expression.\nMs Thorning-Schmidt later visited the synagogue and said Denmark would do everything to protect its Jewish community.\nDenmark prides itself on being one of the few European countries to have saved most of its Jewish population from the Nazi Holocaust in the 1940s.\n\"When you mercilessly fire deadly bullets at innocent people taking part in a debate, when you attack the Jewish community, you attack our democracy,\" Ms Thorning-Schmidt said on a visit to the synagogue on Sunday.\n\"We will do everything possible to protect our Jewish community.\"\nIsraeli Prime Minister Benjamin Netanyahu has urged Danish Jews to emigrate to Israel. Denmark's Chief Rabbi Jair Melchior said he was \"disappointed\" by Mr Netanyahu's stance, the Associated Press (AP) reported.\n\"If the way we deal with terror is to run somewhere else, we should all run to a deserted island,\"said Mr Melchior, according to AP.\nThere has been widespread international condemnation. The US State Department tweeted, external: \"We stand with the people of Denmark and all who defend the universal right of freedom of speech and stand against anti-semitism and bigotry.\"\nPatrick Pelloux, a Charlie Hebdo columnist, said \"we are all Danish tonight\".", "url": "https://www.bbc.com/news/world-europe-31480921"}