{"authors": ["Riyah Collins", "www.facebook.com"], "date_download": "2025-04-26 03:49:52", "date_modify": "2025-04-26 03:49:52", "date_publish": "2025-03-05 13:16:29", "description": "After the Ukraine invasion, Universal Music Group, which owns Offset's label, pulled out of Russia.", "filename": "news_articles_clyd8rvq28zo_1745639392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3642/live/f79523a0-f9c3-11ef-9e3a-ef9ebe93cf17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyd8rvq28zo_1745639392.html", "title": "Rapper Offset announces Russia gig despite label's boycott", "title_page": "Rapper Offset announces Russia gig despite label's boycott - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Offset has announced he'll be playing an arena gig in Russia next month.\nThe US-based rapper is set to perform at Moscow's MTC Live Hall on 18 April, confirming the show on his Instagram.\nReal name Kiari Cephus, Offset is signed to Motown Records, owned by Universal Music Group (UMG), one of a number of labels which announced it was suspending operations in Russia after it launched a full-scale invasion of Ukraine in 2022.\nBBC Newsbeat has contacted UMG and Offset's representatives for comment.\nDays after the Russian invasion, UMG released a statement, external saying it was \"suspending all operations in Russia and closing our offices there\".\n\"We urge an end to the violence in Ukraine as soon as possible,\" a spokesperson said.\n\"We are adhering to international sanctions and, along with our employees and artists, have been working with groups from a range of countries to support humanitarian relief efforts to bring urgent aid to refugees in the region.\"\nA number of other labels and promoters, including Live Nation, external, Warner Music Group, external and Sony Music, external took similar action.\nMany artists, including Green Day, Louis Tomlinson and Yungblud have cancelled planned gigs since the war started.\nHowever some have resumed shows there, most recently rapper DaBaby - signed to Interscope, also part of UMG - who posted updates on his Instagram from his Moscow gig last week.\nSome Russian musicians were also \"blacklisted\" over their anti-war views.\nOffset found fame as part of rap trio Migos with tracks like Stir Fry and Bad and Boujee, and has been releasing solo music since 2017.\nLast year he completed his first solo headlining tour, following the release of his 2023 album Set It Off.\nThe site selling tickets for his Moscow gig describes Offset, who used to be married to Cardi B, as \"a showman who turns a concert into a theatrical performance\".\nIt goes on to say the rapper is \"leaving the past behind and striving to become better - more confident, aware, and full of energy\".\nThe gig has not been confirmed by his label Motown Records and is not listed on his official website, but has been listed on a bespoke site for the event shared by Offset as well as the venue's site.\nTickets are priced between 5,000 - 45,000 Russian roubles - about £40 - £400.", "url": "https://www.bbc.co.uk/news/articles/clyd8rvq28zo"}