{"authors": ["Nikita Yadav", "www.facebook.com"], "date_download": "2025-04-26 03:54:08", "date_modify": "2025-04-26 03:54:08", "date_publish": "2025-03-03 07:18:52", "description": "They survived as the containers had enough oxygen to sustain them during a days-long rescue, said officials.", "filename": "news_articles_c8j0gm2de77o_1745639648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5273/live/f8df5d00-f7f9-11ef-a3d2-f5d94b774e86.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j0gm2de77o_1745639648.html", "title": "Dozens found alive in metal containers after India avalanche", "title_page": "Uttarakhand: Dozens found alive in metal containers after India avalanche - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dozens of construction workers have been pulled out alive from metal containers after they were buried by an avalanche in the Himalayas in India's Uttarakhand state.\nThey survived - some as long as nearly two days - as the containers in which they were living had enough oxygen to sustain them until rescuers could dig them out, Indian media reported quoting officials.\nOn Friday, 54 workers were buried when the avalanche hit a construction camp near Mana village. Eight were killed, while the other 46 were rescued.\nThe operation lasted almost 60 hours in sub-zero temperatures and concluded on Sunday.\nMost of the labourers, who were working on a highway expansion project, were able to \"withstand the wrecking avalanche\" because of the containers, rescuers told The Indian Express newspaper.\n\"These metal shelters saved most of them. They had just enough oxygen to hold on until we got them out,\" a senior rescue official told The Times of India.\nThe newspaper reported that the force of the avalanche had hurled eight metal containers and a shed down the mountain.\nUttarakhand state Chief Minister Pushkar Singh Dhami has thanked rescue teams for their efforts in challenging conditions.\nMembers of the Indian army, national and state disaster response forces and local administration had worked to free the workers, using helicopters and drones for the operation.\nMany of the rescued workers are receiving treatment at hospitals in the state's Joshimath town and Rishikesh city.\nSatyaprakash Yadav, a migrant worker from Uttar Pradesh who was among those rescued, said the \"avalanche hit our container like a landslide\", according to a video released by the army.\nHe added that the container he was in broke apart when the snow hit and it ended up near a river.\n\"We managed to get out on our own and reached a nearby army guest house, where we stayed overnight,\" he added.\nRajnish Kumar, a worker from Uttarkhand's Pithoragarh town, said most of them were sleeping when the avalanche struck.\n\"When the snow hit the container, it sank about 50 to 60 metres down [the mountain]. The Army arrived quickly and rescued us,\" he said, according to the army video.\nGaurav Kunwar, a former village council member of Mana, told the BBC on Friday the area where the avalanche hit was a \"migratory area\" and that it had no permanent residents.\n\"Only labourers working on border roads stay there in the winter,\" he said, adding that it had rained for two days prior to the avalanche.\nThe India Meteorological Department has warned of rainfall and snow in the northern states of Himachal Pradesh and Uttarakhand, as well as Jammu and Kashmir until Tuesday.\nAvalanches and landslides are common in the higher regions of the Himalayas, especially during winter.\nExperts say that climate change has made extreme weather more severe and less predictable. There has also been a rapid rise in deforestation and construction in Uttarakhand's hilly areas in recent years.\nIn 2021, nearly 100 people died in Uttarakhand after a piece of a Himalayan glacier fell into the river, triggering flash floods.\nFollow BBC News India on Instagram, external, YouTube,, externalTwitter, external and Facebook, external.", "url": "https://www.bbc.co.uk/news/articles/c8j0gm2de77o"}