{"authors": ["Jamie Waller", "www.facebook.com"], "date_download": "2025-04-26 03:51:46", "date_modify": "2025-04-26 03:51:46", "date_publish": "2025-03-05 11:30:36", "description": "Efforts will be made to revive the once-annual event, which has not been held since the Covid pandemic.", "filename": "news_articles_c5y2gwz178qo_1745639506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/79eb/live/6b469bf0-f9ae-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y2gwz178qo_1745639506.html", "title": "Lincoln councillors back return of Armed Forces Day event", "title_page": "Lincoln councillors back return of Armed Forces Day event - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A full Armed Forces Day event could return to Lincoln, the city council has said.\nCouncillors of all parties expressed their support for the event at a meeting on Tuesday to recognise serving members and veterans.\nA Conservative proposal to allocate a budget of £15,000 towards exploring the scheme was rejected, but the council's leadership said it wanted to plan the event properly.\nLincoln's previous Armed Forces Day event was cancelled due to the Covid-19 pandemic and has not been held since.\nAccording to the Local Democracy Reporting Service, councillors will meet with the organisers of the annual event in Cleethorpes, which is one of the largest in the country.\nCouncil leader Naomi Tweddle, who represents Labour, said: \"These are exceptionally dangerous, worrying times.\n\"There are not many people in Lincoln not touched by the RAF or other armed forces in some way.\"\nShe said she could not support the Conservative budget proposal because \"it doesn't have partnership support in its current space\".\nHowever, she added: \"If we are going to do it, we will do it properly. Watch this space.\"", "url": "https://www.bbc.co.uk/news/articles/c5y2gwz178qo"}