{"authors": ["Nick Beake", "Kostas Kallergis", "www.facebook.com"], "date_download": "2025-04-26 07:46:48", "date_modify": "2025-04-26 07:46:48", "date_publish": "2025-02-27 00:23:25", "description": "Hundreds are thought to have died when the Adriana sank in international waters two years ago.", "filename": "news_articles_c17qe11wy52o_1745653608.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3786/live/e6deade0-f457-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qe11wy52o_1745653608.html", "title": "Leaked recordings challenge Greek account of deadly shipwreck", "title_page": "Leaked recordings challenge Greek account of deadly shipwreck - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leaked audio instructions by Greek rescue co-ordinators have cast further doubt on Greece's official version of events in the hours before a migrant boat sank along with up to 650 people onboard.\nThe Adriana went down in the early hours of 14 June 2023 in international waters – but within Greece's rescue zone - after leaving Libya days earlier.\nSurvivors later told the BBC that coastguards had caused their overcrowded fishing boat to capsize in a botched attempt to tow it and then forced witnesses to stay silent.\nThe Greek coastguard denied these claims and maintains it did not try to rescue those onboard because they were not in danger and said they had voluntarily wanted to reach Italy, not Greece.\nBut in a phone call that's now emerged an unnamed man speaking from inside a Greek rescue coordination centre is heard instructing the captain of the migrant boat to tell an approaching ship that those onboard do not want to reach Greece.\nThe coastguard has not commented on the audio but said it had handed over all available evidence to a Naval Court which is investigating the disaster.\nThe sinking was one of the worst-ever disasters known to have happened in the Mediterranean Sea.\nIt is estimated the boat was carrying up to 750 migrants when it set off from the port of Tobruk in Libya nearly a week earlier.\nEighty-two bodies were recovered, but the United Nations believes an additional 500 people - including 100 women and children who were in the hold of the boat - may have died.\nAudio recordings obtained by Greek website News247.gr, external reveal phone calls involving the Joint Rescue Coordination Centre (JRCC) at the port of Piraeus, near the capital Athens.\nIn the first call, at 18:50 local time (15:50 GMT) on 13 June, an officer is heard explaining to the man piloting the migrant boat that a large red vessel will soon be approaching to give supplies and that he should explain that the migrants do not want to reach Greece.\nOfficer 1:\nThe boat proceeding to you in order to give you fuel, water and food. And in one hour we send you a second boat, OK?\nTell captain to big red ship \"We don't want to go Greece\". OK?\nThe replies of the man captaining the migrant boat are not heard.\nIn a second call, 90 minutes later, at 22:10, a seemingly different officer from the same coordination centre, speaks to the captain of the Lucky Sailor (the \"big red ship\").\nOfficer 2: OK, captain, sorry before I couldn't hear you. I couldn't understand what did you say to me. You told me you gave them food, water and they told you that they don't want to stay in Greece and they want to go to Italy, they don't want anything else?\nLucky Sailor captain: Yes because I asked them by megaphone \"Greece or Italia?\" and everybody there screaming Italia.\nOfficer 2: Aah, OK, OK everybody screaming that they don't want Greece and they want Italy?\nLucky Sailor captain: Yes, yes, yes.\nOfficer 2: OK\nLucky Sailor captain: They are all like crowded people, very crowded, full deck.\nOfficer 2: OK, captain. So you have finished with the supplies?\nLucky Sailor captain: Yes, sir, yes.\nOfficer 2: Captain, I want this, I want this to write it in your logbook. The bridge logbook.\nLucky Sailor captain: Yes OK, we will write it.\nOfficer 2: OK?\nLucky Sailor captain: Yes\nOfficer 2: I want you to write it about that they don't want to stay in Greece and they want to go to Italy. They want nothing from Greece and they want to go to Italy.\nLucky Sailor captain: OK, yes, yes.\nAnother vessel, the Faithful Warrior, also gave some supplies to the migrant boat but no further conversations between its captain and the Greek authorities have emerged.\nThe Greek coastguard did not comment on the contents of the conversations but told the BBC it had submitted \"all the material it had in its possession, including the audio recordings and the diaries of events\" to the Maritime Court Prosecutor's Office, which is investigating.\nIt said it had rescued more than a quarter of a million migrants in danger at sea in the last decade and arrested more than a thousand smugglers, and that its humanitarian work had been recognised internationally.", "url": "https://www.bbc.co.uk/news/articles/c17qe11wy52o"}