{"authors": ["Jeremy Britton", "www.facebook.com"], "date_download": "2025-04-26 08:04:12", "date_modify": "2025-04-26 08:04:12", "date_publish": "2025-02-26 15:59:29", "description": "David Walcott and Rammon Mali are convicted of murdering 22-year-old Rijkaard Siafa last April.", "filename": "news_articles_c4gm9q93326o_1745654652.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ca5/live/fce605c0-f457-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gm9q93326o_1745654652.html", "title": "Murderers went to pub after stabbing man to death", "title_page": "Murderers went to pub after stabbing man to death in Croydon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two killers who went to the pub for a pint after stabbing their victim to death in Croydon, south London, have been found guilty of murder.\nDavid Walcott, 35, and Rammon Mali, 33, were convicted following a five week trial at the Old Bailey, of stabbing 22-year-old Rijkaard Siafa to death in April last year.\nWalcott was also found guilty of having an article with a blade or point.\nThe court heard how the defendants chased Mr Siafa down an alleyway in front of a crowded marketplace and stabbed him at least 13 times. A third alleged attacker is still wanted by police.\nCCTV was played to the jury showing Walcott and Mali together with a third man searching the streets before the attack.\nThe group was then filmed heading towards a covered passageway called Fellmongers Yard where they come across their victim, Mr Siafa.\nProsecution barrister Anthony Orchard KC said Mr Siafa \"immediately turned and ran\", heading back in the direction he came from, with the two defendants and their companion giving chase.\nJust 20 seconds later the three were filmed running out of the yard in front of a crowd who had gathered in Surrey Street, where a fruit and vegetable market was being held.\nWalcott appeared to be holding a knife in his hand, the jury heard.\nAn eye witness gave evidence saying he had seen Mr Siafa on the ground trying to protect himself as one attacker stabbed him twice to the chest, before seeing the crowd and running off.\nThe eyewitness said the stabber appeared to be the tallest of the three attackers - the prosecution alleged this was Mali. He also said he tried to provide first aid to Mr Siafa until the emergency services arrived, but he died at the scene from his injuries.\nThe two defendants and the third man then headed to the Spread Eagle pub where they ordered pints of Guinness and rang for a cab, before leaving through the beer garden without finishing their drinks, the court heard.\nWhen Walcott was later arrested in south-west London he told police: \"I'm not a murderer bro, I didn't kill nobody.\"\nMali, who left the country, was arrested on his return at Gatwick airport.\nBoth defendants admitted being at the scene of the attack but denied being involved in the stabbing - with Walcott claiming he had only come across a knife in the passageway where the attack took place.\nWalcott, of Norbury, and Mali, of Croydon, will be sentenced later.\nThe alleged attacker still being sought by police has been named by Met officers as Jordan Vincent.\nThe force has offered a reward of up to £10,000 for information that leads to the arrest and charge of Mr Vincent.", "url": "https://www.bbc.co.uk/news/articles/c4gm9q93326o"}