{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:51", "date_modify": "2025-05-19 15:31:51", "date_publish": "2015-02-20 12:21:26", "description": "Staff at two power stations in North Lincolnshire will be redeployed if plans to close the facilities go ahead, MPs are assured.", "filename": "news_uk-england-humber-31548855_1747668711.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81125000/jpg/_81125112_brigg.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-humber-31548855_1747668711.html", "title": "At-risk North Lincolnshire power jobs redeployment 'likely'", "title_page": "At-risk North Lincolnshire power jobs redeployment 'likely' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Staff at two power stations in North Lincolnshire will be redeployed if plans to close the facilities go ahead, MPs have been assured.\nCleethorpes MP Martin Vickers and Brigg and Goole MP Andrew Percy met owners Centrica earlier to discuss plans.\nThe company, which announced a steep fall in profits on Thursday, said both stations are losing money, putting 58 jobs at risk.\nMr Percy said he was told efforts would be made to find new roles for staff.\nThe Killingholme plant employs 50 people, while there are eight workers at the Brigg site.\nA third site, the South Humber Bank power station where 69 people work, was for sale but will now stay open.\nMr Percy said Centrica had given assurances Brigg would continue operating until next year with Killingholme likely to shut this year.\nHe said: \"It was as positive as a meeting about job losses can be.\n\"The key thing was to establish what help there would be for the current workers and we were assured they hope to manage them in to other opportunities within Centrica or with partners elsewhere.\"\nMr Percy said a statutory 90 day consultation period was now under way.\n\"We have to get through this consultation period and go from there.\n\"These staff are highly skilled so we're hopeful they will be slotted into other roles.\"\nMike McDonald, from union Prospect, said it was speaking to employees about redundancy and retraining.", "url": "https://www.bbc.com/news/uk-england-humber-31548855"}