{"authors": ["Maria McCann", "www.facebook.com"], "date_download": "2025-04-26 04:05:19", "date_modify": "2025-04-26 04:05:19", "date_publish": "2025-03-03 17:41:12", "description": "An inquiry is told former staff, and leadership responsible for abuse at the facility still work in the sector.", "filename": "news_articles_cm2j6gd2g83o_1745640319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ad56/live/dc60afc0-f854-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2j6gd2g83o_1745640319.html", "title": "Muckamore families 'have little hope' of change", "title_page": "Muckamore families 'have little hope' of change - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families of patients at Muckamore Abbey Hospital say they have \"little hope\" the Department of Health is capable of implementing changes to prevent abuse.\nAction for Muckamore and the Society of Patients and Friends of Muckamore (SPFM) also say they have \"little confidence\" in leadership at the Belfast Trust and RQIA – the health regulator.\nThe comments were made as part of closing statements at the inquiry into abuse of vulnerable people at the facility near Antrim.\nA barrister for patient families said \"a lack of accountability is a fundamental reason why abuse is able to continue\".\nMonye Anyadike-Danes KC told the inquiry that former staff, management and leadership responsible for abuse at the facility are still working in the sector.\n\"Our clients gave accounts of staff who turn up at community placements, retraumatising them,\" the inquiry was told.\nThe inquiry later heard that families believe \"community placements are as bad\" now \"or in some circumstances worse\".\n\"Yet there is no understanding or awareness of what is going wrong or how to improve it,\" the inquiry heard.\nThe lawyer said that \"no-one at senior level has been sacked or resigned, despite widely reported systemic failures\".\n\"The hit has been taken exclusively by frontline staff.\"\nThe inquiry was told that families have described the abuse as \"horrendous, prolonged and widespread\".\nThey said that they believe the CCTV evidence uncovered in 2017 was \"merely the tip of the iceberg\".\nIt was put to the inquiry by the families' barrister that \"there has always been abuse at Muckamore, even if there was no CCTV to record it\".\nThe families said identifying it should have been factored into the government's systems and structures and that they have \"little confidence in the ability of the trust to correct its failings\".\nThey added that the Department of Health must also bear responsibility.\nDuring an afternoon session at the inquiry, a barrister representing another group of families questioned how a persistent culture of abuse could develop.\nConor Maguire KC said: \"What seemed appropriate at the top, masked what was festering at the bottom.\"\n\"Who in senior positions knew about the abuse and what measures did they take or fail to take to stop it?\" he asked.\n\"The abuse perpetrated on patients was widespread and in the open.\n\"How was an inadequate and deficient care system for people with learning disabilities permitted?\n\"How and why were so many opportunities missed?\n\"Who in senior positions knew about the abuse and what measures did they take or fail to take to stop it? Were they curious enough?\n\"We say the only conclusion based on the evidence is no.\"\nMr Maguire said that despite structures and processes at the Department of Health and Belfast Trust, it wasn't until CCTV in autumn 2017 that \"a culture of abuse in all its forms was uncovered\".\n\"But for CCTV, widespread abusive practices would have continued unabated at Muckamore,\" he said.\nHe called for redress for the patients and families affected by abuse at Muckamore.", "url": "https://www.bbc.co.uk/news/articles/cm2j6gd2g83o"}