{"authors": ["Brian Farmer", "Louise Parry", "www.facebook.com"], "date_download": "2025-04-26 04:24:41", "date_modify": "2025-04-26 04:24:41", "date_publish": "2025-03-03 12:35:11", "description": "Kyle Clifford previously admitted murdering Louise Hunt, her mum and sister, but denied her rape.", "filename": "news_articles_c2419n3e4e1o_1745641481.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f6a6/live/c0add0c0-f76c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2419n3e4e1o_1745641481.html", "title": "Bushey crossbow killer: Jury sworn in for rape trial", "title_page": "Bushey crossbow killer: Jury sworn in for rape trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A jury has been sworn in for the rape trial of a man who murdered his ex-girlfriend and her sister with a crossbow and their mother with a knife.\nKyle Clifford, 26, of Enfield in north London, has admitted murdering Carol Hunt, Hannah Hunt and Louise Hunt at their family home in Bushey, Hertfordshire, on 9 July 2024.\nHowever he has denied raping Louise, his former partner, on the same day.\nJudge Mr Justice Bennathan told jurors that Mr Clifford had not appeared at Cambridge Crown Court on Monday, and added: \"You must not assume the defendant is guilty because he is not here.\"\nThe defendant had previously admitted false imprisonment against Louise, and two counts of possession of offensive weapons - the crossbow and the knife.\nHer 61-year-old mother, Carol, the wife of BBC commentator John Hunt, sustained significant stab wounds to her knee, hands, back and torso following an attack by Clifford at the family home in the quiet cul-de-sac of Ashlyn Close.\nHannah, 28, was found in the main doorway of the house with a crossbow bolt to the chest and was still alive when police arrived at the property at around 19:10 on July 9.\nMr Hunt was among relatives who arrived at court for the trial on Monday.", "url": "https://www.bbc.co.uk/news/articles/c2419n3e4e1o"}