{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:06", "date_modify": "2025-05-19 15:38:06", "date_publish": "2015-01-30 10:48:54", "description": "Violent religious extremists are often tortured men with a history of using pornography, London Mayor Boris Johnson says.", "filename": "news_uk-politics-31056823_1747669086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80678000/jpg/_80678163_borislosers.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31056823_1747669086.html", "title": "London Mayor Boris Johnson: Extremists 'porn-driven'", "title_page": "London Mayor Boris Johnson: Extremists 'porn-driven' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boris Johnson has described men who join religious extremist groups such as Islamic State as \"losers\" who are likely to be users of pornography.\nThe Mayor of London told The Sun, external those turning to violence had low self-esteem and were unsuccessful with women.\nThe Tory politician cited an MI5 report into extremism that had compiled psychological profiles of jihadists.\nChancellor George Osborne said the mayor was \"right not to be nice about these people\".\nAccording to the newspaper, Mr Johnson said: \"If you look at all the psychological profiling about bombers, they typically will look at porn.\n\"They are tortured. They will be very badly adjusted in their relations with women, and that is a symptom of their feeling of being failures and that the world is against them.\n\"They are not making it with girls and so they turn to other forms of spiritual comfort - which of course is no comfort.\n\"They are just young men in desperate need of self-esteem who do not have a particular mission in life, who feel that they are losers and this thing makes them feel strong - like winners.\"\nMr Johnson said he believed Muslim communities should lead efforts to tackle extremism, but claimed clerics had not been \"persuasive in the right way with these people\".\nAsked about his remarks later, Mr Johnson said he did not believe \"anyone could seriously contest a word I said\".\nHe told BBC London: \"This is part of a wider problem, that is symptomatic of a feeling among young men.\"\nThey were \"led off into jihadist ideology\" because \"they aren't winners and the world is against them and there is nothing there for them\", he said.\n\"The answer is to get them into work.\"\nMr Osborne, speaking on a visit to Portsmouth, said the mayor was known for his \"colourful language\" but agreed with the sentiment of the remarks.\nConservative chairman Grant Shapps said: \"We are living in a world where there are brand-new threats in the 21st century...with these enormous terrorist attacks and what is going on with IS in Syria and Brits going there.\n\"I think any Brit who leaves and fights against this country's interests like that, I can attach all sorts of words to them. I'm clear that what this country needs to do is absolutely be rigorous about ensuring that people can't just swan back into the country having fought against our national interests.\n\"I think the mood has decisively shifted in favour of people saying 'This country will give all of us our education for free, it will give all of us our health for free, but don't expect to go off and fight against this country's interests and expect to swan back in'. I think Boris's comments will have been driven by that.\"", "url": "https://www.bbc.com/news/uk-politics-31056823"}