{"authors": ["Harry Low", "www.facebook.com"], "date_download": "2025-04-26 07:37:56", "date_modify": "2025-04-26 07:37:56", "date_publish": "2025-02-27 13:48:27", "description": "Susan Hamilton wins her case for unfair constructive dismissal against a south London NHS Trust.", "filename": "news_articles_cqjdd7zx4plo_1745653076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dce8/live/808c14b0-f51f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdd7zx4plo_1745653076.html", "title": "NHS nurse left out of tea round given £41,000 payout", "title_page": "NHS nurse left out of tea round given £41,000 payout - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"gifted\" NHS nurse who was deliberately left out of a tea round by a colleague who said \"I don't like you\" has won a claim for unfair constructive dismissal at an employment tribunal.\nDiabetes specialist Susan Hamilton joined Epsom and St Helier University Hospitals NHS Trust in 2012 but resigned in January 2022 \"as a direct consequence of the actions of, and poor management by, the trust\".\nShe cited \"cruel bullying behaviours\" by a colleague after a 2018 disagreement when she questioned his competency over a patient's treatment.\nHer claim stated that Abdool Nayeck's behaviour also included \"ignoring morning greetings from her and facing the other way when [she] was presenting in meetings\".\nAfter the 2018 incident over a patient who had collapsed at home, Ms Hamilton apologised to Mr Nayeck for her tone.\nMs Hamilton stated he later took her book, rubbed out her name and wrote his instead before storing it in a cupboard containing his own documents and books.\nThe NHS trust has not publicly commented but is understood to have subsequently strengthened support for staff and rolled out a new training programme for managers.\nIn a 2019 mediation session, Mr Nayeck agreed to \"follow advice regarding the tone of emails and not send every message as high priority\" and both agreed \"to communicate in a civil manner with each other at work\".\nMs Hamilton's submission stated: \"I tried very hard to build a better relationship with Abdool particularly following mediation.\n\"I have offered him tea or coffee, have tried to talk to him about, for example, how he enjoyed his Eid celebrations… I have not had any reciprocal treatment from Abdool.\n\"The only change that occurred from [Mr Nayeck's] side is that he no longer made drinks for the team in the morning so by extension I was no longer specifically excluded in that regard.\"\nIn 2021, a letter was sent to Ms Hamilton stating \"there was no evidence to show that you had shown bullying behaviour\" towards Mr Nayeck, who had lodged a complaint.", "url": "https://www.bbc.co.uk/news/articles/cqjdd7zx4plo"}