{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 03:50:56", "date_modify": "2025-04-26 03:50:56", "date_publish": "2025-03-05 12:15:21", "description": "The company said it was investing £100m in NI which would include opening at a third site.", "filename": "news_articles_cgl0z7gxpg2o_1745639456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fbcb/live/e799a9f0-f9bc-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl0z7gxpg2o_1745639456.html", "title": "Thales to open third facility in NI", "title_page": "Thales to open third facility in NI  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thales, the French-owned arms company, is to open a third facility in Northern Ireland, MLAs have been told.\nOn Sunday Prime Minister Keir Starmer announced that Thales would supply 5,000 of its lightweight multirole missiles (LMMs) to Ukraine in a deal worth up to £1.6bn\nThe company currently has a factory in east Belfast and a test facility in County Down.\nThales managing director Nigel MacVean said the company was investing £100m in NI which would include opening at a third site.\nThe company is also planning to recruit 200 additional staff over the next two years.\nSpeaking to a Stormont committee Mr MacVean said the LMMs were keeping Russian helicopters out of Ukraine and another Thales weapon, the Next generation Light Anti-tank Weapon (the NLAW), had kept Russian tanks out of Kyiv.\nThales began delivering LMMs to Ukraine at the end of 2024 as part of an initial £162m contract for 650 of the missiles. The new order is in addition to that.\nThe contract has been placed by the MoD's procurement arm Defence Equipment & Support on behalf of the Ukrainian Government.\nIt will be funded by a loan underwritten by United Kingdom Export Finance (UKEF) after a deal signed last year to allow Ukraine to draw on £3.5bn worth of support from UKEF to spend with UK industry.", "url": "https://www.bbc.co.uk/news/articles/cgl0z7gxpg2o"}