{"authors": ["Paul Burnell", "www.facebook.com"], "date_download": "2025-04-26 04:12:18", "date_modify": "2025-04-26 04:12:18", "date_publish": "2025-03-04 12:29:54", "description": "The British Olympic Association says Hickey was a hugely influential figure in the sport.", "filename": "news_articles_cy7x54j6888o_1745640738.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe03/live/eabd4840-f8e4-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7x54j6888o_1745640738.html", "title": "Tributes after 'iconic' Olympic boxing coach Kevin Hickey dies", "title_page": "Tributes after 'iconic' Olympic boxing coach Kevin Hickey dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tributes have been paid to the man who led Team GB's boxers in five Olympics, who has died aged 83.\nFighters said Kevin Hickey MBE, from Lancashire, whose funeral is taking place in Blackpool, set a coaching standard for amateur boxers which was emulated worldwide.\nThe British Olympic Association (BOA) said his work as a coach and wider administrator with Team GB, from 1972 until 1988, was \"highly influential\".\nRichie Woodhall, former Commonwealth Games boxing gold medallist and WBC super middleweight world champion, called his former coach \"iconic\".\nWoodhall, who was a member of the 1988 Olympic boxing team, said: \"Kevin Hickey will be remembered as an iconic figure in the sport of amateur boxing in the UK.\"\nThe fighter, who won a silver medal that year as well as Commonwealth gold two years later, added: \"His contribution to coach development/education with the Amateur Boxing Association (ABA) paved the way not only here, but countries worldwide looked to our coaching system to develop their own coaches and promote amateur boxing across the globe.\"\nThe Midlands-born boxer, who later turned professional and won his world title in 1998, is among those delivering eulogies in the service at St John Vianney Roman Catholic Church, Blackpool.\nA BOA spokeswoman said: \"The British Olympic Association was saddened to hear of the passing of Kevin Hickey, MBE.\n\"Kevin was a hugely influential figure of British sports administration.\n\"During his time at the BOA, where he was a technical director, he set up a number of ground-breaking support services for Olympic athletes, such as pre-Games Holding Camps, and served as a deputy Chef de Mission at three Summer and three Winter Olympic Games.\n\"We send our sincere condolences to his wife Kyra and his family.\"\nGB Boxing said on X, external that Hickey had \"played a large part in the development of Olympic-style boxing in Great Britain\".\nIt added: \"In 2009 Kevin returned to boxing where he spent a short period as Performance Director of GB Boxing.\"\n\"In this time, he was responsible for recruiting Rob McCracken and Richie Woodhall, to work with the squad initially as coaching consultants.\"\nThe statement said \"everyone at GB Boxing would like to express their sincere condolences\" to his family.", "url": "https://www.bbc.co.uk/news/articles/cy7x54j6888o"}