{"authors": ["Alexandra Bassingham", "Cathy Alexander", "www.facebook.com"], "date_download": "2025-04-26 07:07:10", "date_modify": "2025-04-26 07:07:10", "date_publish": "2025-02-28 06:06:22", "description": "Julian Mather, 42, fell into the canal in Bathampton as he went home along the towpath in 2022.", "filename": "news_articles_c20lejylvzyo_1745651230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b5e4/live/0a4296b0-f5d5-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20lejylvzyo_1745651230.html", "title": "Railings 'mean everything' to family of Somerset drowning victim", "title_page": "Railings 'mean everything' to family of Somerset drowning victim - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The sister of a man who died after falling into a canal on his way home at night said new railings put at the site meant \"everything\" to her family.\nJulian Mather, was the eldest of five children growing up in Bathampton, Somerset, and was near the family home when he died in January 2022, aged 41.\nHis sister, Jess Chesterton, 35, said the family began petitioning for safety measures along the towpath soon after he drowned because \"we don't want any other family going through what we've been through over the last three years\".\nThe Canal and River Trust has installed the railings alongside the canal under the bridge.\nA spokesperson for Canal & River Trust said their \"thoughts are with Julian's family after the recent anniversary of his death\".\n\"We're pleased to have been able to install some discreet railings under Candy's Bridge in consultation with Julian's family.\n\"Whilst Julian's death remains a tragic but rare incident, we will continue to monitor safety along the canal, as well as continuing with regular maintenance, education programmes and building awareness around staying safe by water,\" they said.\nMs Chesterton said: \"We don't know the ins and outs of how [Julian] fell, but two runners found him because a large branch was across the path and when they went to move it, they saw Julian.\"\nShe and her siblings had conversations \"many a time about that particular bridge\", Ms Chesterton said.\n\"It's very narrow and quite low and if you're cycling or you're taller, you do have to duck to get under there,\" she added.\nAfter receiving nearly 2,000 signatures backing their petition for safety measures to be added, and \"many back and forths\", planning permission was granted for the railings in April 2024.\nMs Chesterton said she \"can't even begin to explain\" what it means to her and her family to see the railings installed.\n\"We're so happy we've done something good out of something so tragic, but it's just really sad the railings weren't there for him,\" she said.\n\"It's been a really tough three years without Julian. He was so caring, loving and such a beautiful soul, life doesn't feel the same without him.\"\nShe said they hoped to see wildlife-friendly solar lighting added along the towpath in the future, to help prevent more accidents as it is a route people used \"constantly\".\n\"It's a place where if you were to fall in, you're going to really struggle to get out,\" she added.\nAs Ms Chesterton and her mother watched the railings being installed, she said a lot of people told them stories of near-misses and said they also wanted more safety measures there.", "url": "https://www.bbc.co.uk/news/articles/c20lejylvzyo"}