{"authors": ["Zoe Kleinman", "www.facebook.com"], "date_download": "2025-04-26 04:10:57", "date_modify": "2025-04-26 04:10:57", "date_publish": "2025-03-04 19:27:12", "description": "The tech giant is appealing a government order for access to customers' private data, the BBC understands.", "filename": "news_articles_c8rkpv50x01o_1745640657.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41a7/live/e0cd7320-f92d-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkpv50x01o_1745640657.html", "title": "Apple takes legal action in UK data privacy row", "title_page": "Apple takes legal action in UK data privacy row - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Apple is taking legal action to try to overturn a demand made by the UK government to view its customers' private data if required.\nThe BBC understands that the US technology giant has appealed to the Investigatory Powers Tribunal, an independent court with the power to investigate claims against the Security Service.\nIt is the latest development in an unprecedented row between one of the world's biggest tech firms and the UK government over data privacy.\nIn January, Apple was issued with a secret order by the Home Office to share encrypted data belonging to Apple users around the world with UK law enforcement in the event of a potential national security threat.\nData protected by Apple's standard level of encryption is still accessible by the company if a warrant is issued, but the firm cannot view or share data encrypted using its toughest privacy tool, Advanced Data Protection (ADP).\nADP is an opt-in feature and it is not known how many people use it.\nLast week, Apple chose to remove ADP from the UK market rather than comply with the notice, which would involve creating a \"backdoor\" in the tool to create access.\nApple said at the time that it would never compromise its security features and it was disappointed at having to take the action in the UK.\nThe UK's order also angered the US administration with President Donald Trump describing it to The Spectator as \"something that you hear about with China\".\nTulsi Gabbard, US head of intelligence, said she had not been informed in advance about the UK's demand.\nShe wrote in a letter that it was an \"egregious violation\" of US citizens' rights to privacy and added that she intended to find out whether it breached the terms of a legal data agreement between the US and the UK.\nThe FT, which first revealed Apple's legal action, reports that the tribunal case could be heard in the next few weeks, but may not be made public.\nThe Home Office refused to confirm or deny that the notice issued in January exists. Legally, this order cannot be made public.\nBut a spokesperson said: \"More broadly, the UK has a longstanding position of protecting our citizens from the very worst crimes, such as child sex abuse and terrorism, at the same time as protecting people's privacy.\n\"The UK has robust safeguards and independent oversight to protect privacy and privacy is only impacted on an exceptional basis, in relation to the most serious crimes and only when it is necessary and proportionate to do so.\"\nApple declined to comment.", "url": "https://www.bbc.co.uk/news/articles/c8rkpv50x01o"}