{"authors": ["Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 08:13:09", "date_modify": "2025-04-26 08:13:09", "date_publish": "2025-02-26 11:31:27", "description": "The indefinite strike will begin on 11 March, union bosses say, as a row over a pay-cut continues.", "filename": "news_articles_cg4k5pegynro_1745655189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/88ee/live/987d4270-f433-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4k5pegynro_1745655189.html", "title": "Birmingham bin workers to down tools in all-out strike", "title_page": "Birmingham bin workers to down tools in all-out strike - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bin strike in Birmingham is set to go all-out, union bosses have confirmed.\nMore than 350 city refuse workers will walk out indefinitely from 11 March after a series of one-day strikes began in January in a row over a pay cut, Unite said.\nA one-day walkout is under way, with further action on Wednesday and planned for 3, 4, 6, and 10 March before the indefinite action begins.\nBirmingham City Council said the escalation would mean greater disruption to residents, despite the \"fair and reasonable offer\" it had made to Unite.\nUnite said it had escalated the action because the council hired temporary labour to \"undermine\" walkouts.\nGeneral secretary Sharon Graham called the use of employment agencies \"disgraceful\" and added members played a \"vital frontline role\" in keeping the city clean.\n\"It is totally unacceptable that their pay has been slashed and they have been left fearful of further attacks on their jobs, pay and conditions,\" she said.\nIn response, the authority said it had offered alternatives, including LGV driver training and other equivalent roles, to workers whose wages were affected by changes to the service.\n\"No worker will lose the sums Unite are claiming,\" a spokesperson said.\nThey added residents deserved a better waste collection service and thanked them for their patience.\n\"Our door is still open, and we would encourage Unite to come back to the table,\" they added.\nJudith lives in Brookfields, near Winson Green and Hockley - an area where residents do not have wheelie bins due to the layout of the houses.\nThey put their black binbags out for collection and use crates for recycling.\nHowever, she said the situation since the strikes started had been \"a nightmare\", and recycling had not been collected for six weeks.\n\"I use a mobility scooter because I can't walk very far,\" she said.\n\"Because they didn't collect the ordinary rubbish for two weeks, which is in black bags, it was all over the pavement and I couldn't get past it... it meant I had to go on the road.\"\nShe said rubbish left behind by refuse workers included duvets and a chair.\n\"I still couldn't get past it, and it's really very frustrating,\" she said.\nSome residents have told the BBC they believed piled-up waste was attracting \"cat-sized\" rats.\nJudith explained she had sympathy for the bin workers, but was dreading how bad the problem could be if the action extended into the summer months.\n\"We do have a colony of seagulls,\" she said. \"You've got cats ripping the bags to shreds, the seagulls ripping the bags to shreds, and it's just a mess.\"", "url": "https://www.bbc.co.uk/news/articles/cg4k5pegynro"}