{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:04:55", "date_modify": "2025-04-26 08:04:55", "date_publish": "2025-02-26 15:24:17", "description": "The west coast ferry operator says it is being pushed \"to the limit\" by a shortage of vessels.", "filename": "news_articles_c1d4g1lp3n6o_1745654695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1734/live/aef1e2a0-f455-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4g1lp3n6o_1745654695.html", "title": "CalMac reshuffles fleet after 'exceptional' problems", "title_page": "CalMac reshuffles fleet after 'exceptional' problems - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ferry operator Caledonian MacBrayne has rejigged services and vessel deployment plans as it grapples with an \"exceptional\" series of problems with its fleet.\nDelays in repairs and new issues identified during annual maintenance mean the west coast operator is facing a shortage of ships.\nChief executive Duncan Mackison said a third of its large vessels were currently out of action or operating with reduced capacity.\nThe charter of the privately-owned catamaran Alfred - said to cost £1m a month - has now been extended to the end of May to maintain services, while the summer-only Ardrossan-Campbeltown service remains suspended for another year.\nMV Caledonian Isles, which operates on the Arran route has been out of action since last February with a series of issues including rust and twisted frames.\nThe ship was due back next month, but this has been pushed back, possibly to late April, after new issues were found with the tubes for its propeller shafts.\nMV Isle of Lewis, which operates to Barra, needs steelwork replaced during annual maintenance, and will not return to service until Sunday 23 March, almost a month later than expected.\nMV Clansman has also been slightly delayed in overhaul, while MV Isle of Mull is restricted to just 45 passengers.\nThis is due to problems with its emergency evacuation systems, which will not be fixed until mid May at the earliest.\nMr Mackison said the publicly-owned firm was \"dealing with an exceptional set of circumstances\".\n\"Challenges with several vessels in the fleet have converged at the same time, creating a significant capacity issue which leaves us with difficult choices to make in terms of service provision,\" he added.\n\"Given the age of our fleet and the need to overhaul all vessels outside of the busy summer season, our vessels are spending a record amount of time in overhaul this winter.\n\"This stretches our services and, when unplanned delays such as those we're experiencing with MV Isle of Lewis and MV Clansman are factored in, our resources to the limit\"", "url": "https://www.bbc.co.uk/news/articles/c1d4g1lp3n6o"}