{"authors": ["Adrian Zorzut", "www.facebook.com"], "date_download": "2025-04-26 06:44:51", "date_modify": "2025-04-26 06:44:51", "date_publish": "2025-03-01 16:25:12", "description": "A number of people have expressed concerns about the new club's 300-person capacity.", "filename": "news_articles_cvgdp5qnd1zo_1745649891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4465/live/a5e79f10-f6ad-11ef-acd4-091c140b24c6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgdp5qnd1zo_1745649891.html", "title": "Penthouse Magazine inspired strip club approved to open in Soho", "title_page": "Penthouse Magazine inspired strip club approved to open in Soho - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A strip club inspired by adult magazine Penthouse is set to open in Soho despite concerns it would attract more drug touts and pickpocketing gangs.\nThe Penthouse Club will offer Cirque de Soleil-style performances, fully-nude striptease in private VIP rooms and once-weekly shows by LGBTQI+ performers.\nWestminster Council said the club's owner, Soho Prime Entertainment Ltd, was a \"responsible, professional and experienced operator\" and it had agreed to robust and stringent conditions.\nCompany representative Caroline Kirkendoll also told councillors the club aimed to attract an older, and more female, demographic.\nDuring the meeting, councillors heard from objectors who expressed concerns about the new club's 300-person capacity.\nThey argued the area was \"saturated\" with adult entertainment venues which are said to be attracting drug touts and pickpocketing gangs.\nOne objector, who said he lives in a building which has a lap dance bar in its basement, said thieves targeted what he described as cash-loaded customers trying to enter late night venues.\n\"It will increase the pedicabs and street drug pushers,\" he said.\nThere were no objections from the Metropolitan Police.\nMs Kirkendoll also said Soho Prime's parent company, Kirkendoll Management, had managed clubs in crime hotspots across the world with \"zero instances of security issues with performers or guests\".\nEntry at their Soho location is set to cost £25 per person, according to the application form.\nA food and drink menu shows customers can purchase a bottle of Clase Azul Reposado tequila at £1,000, a 30g portion of Imperial Oscietra caviar at £100 and a 40oz Tomahawk steak at £188.\nSoho Prime Entertainment is expected to pay up to £8m to renovate the site, which it says will fund 75 full-time and part-time jobs once it's complete.\nAround 25 to 50 self-employed table-side performances are expected to be working on a typical night while the main stage will have between five and 10 performances.", "url": "https://www.bbc.co.uk/news/articles/cvgdp5qnd1zo"}