{"authors": ["Madeline Halpert and Brandon Drenon", "www.facebook.com"], "date_download": "2025-04-26 03:56:58", "date_modify": "2025-04-26 03:56:58", "date_publish": "2025-03-04 14:36:26", "description": "The newly elected Michigan senator accused the president of bringing chaos while failing to tackle the high prices Americans care about.", "filename": "news_articles_c798egw3jz8o_1745639818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7906/live/464dcde0-f987-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c798egw3jz8o_1745639818.html", "title": "Who is Elissa Slotkin, the Democrat who responded to Trump's speech?", "title_page": "Who is Elissa Slotkin, the Democrat who responded to Trump's speech? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Elissa Slotkin, a US Senate Democrat, gave her party's response to President Donald Trump's congressional address, taking the new Trump administration to task and describing it as \"chaotic\" and \"reckless\".\nEarly in her remarks, she attacked the White House on the economy and warned that if Trump was \"not careful, he could walk us right into a recession\".\nSlotkin also took a shot at the Department of Government Efficiency, the cost-cutting project led by Elon Musk, saying change is needed \"but doesn't need to be chaotic or make us less safe\".\nSpeaking from Michigan before a backdrop of US flags, Slotkin was much more concise and much less animated than the president, who regaled Republicans on the House floor for an hour and 40 minutes.\nShe made a quick reference to Democrats' stinging election defeat in November, but then quickly pivoted to Trump.\n\"Americans made it clear that prices are too high and that government needs to be more responsive to their needs. America wants change,\" she said.\n\"But there is a responsible way to make change, and a reckless way. And, we can make that change without forgetting who we are as a country, and as a democracy.\"\nThroughout the election, voters frequently said the economy was their number one concern, and Democrats' defeat was blamed on not addressing it sufficiently.\nWeeks into Trump's presidency, economic concerns remain high, as prices of a number of goods have not dropped, and prices on some items, like eggs, have risen.\n\"Grocery and home prices are going up, not down – and he hasn't laid out a credible plan to deal with either,\" she said.\nSlotkin also talked about immigration, another topic where Democrats poll worse than Republicans, highlighting a lack of empathy by the Trump administration toward undocumented immigrants.\n\"The border without actually fixing our broken immigration system is dealing with the symptom not the disease. America is a nation of immigrants,\" she said.\nShe cited the public berating of Ukrainian President Volodymyr Zelensky on Friday during a meeting withTrump and Vice-President JD Vance, too.\n\"That scene in the Oval Office wasn't just a bad episode of reality TV. It summed up Trump's whole approach to the world,\" she said.\n\"He believes in cozying up to dictators like Vladimir Putin and kicking our friends, like Canada, in the teeth.\"\nFor many, Tuesday night was their first time meeting Slotkin, who won the US Senate seat in the swing state of Michigan last year.\nA former Central Intelligence Agency (CIA) analyst, Slotkin became the youngest Democratic woman elected to the Senate at 48, when she won her seat in a state that former Vice-President Kamala Harris lost last November.\nSlotkin gave her speech after Trump's, which is not a traditional State of the Union address but was expected to serve the same purpose.\nSenate Democratic Leader Chuck Schumer called Slotkin a \"rising star\" in the party last week as he announced her as the pick to provide the Democratic Party's rebuttal. He said she was \"great on both economic and national security\" topics.\nSlotkin is new to the Senate, but she served in Congress as a member of Michigan's delegation to the House of Representatives. She was first elected in the Democrats' 2018 wave of success, flipping a Republican seat.\nPrior to her political career, she held a variety of government jobs. She held national security positions in Presidents George W Bush and Barack Obama's administrations.\nShe served in Bush's National Security Council, and, under Obama, she served as acting assistant secretary of defence for international security affairs and in the State Department.\nThe CIA recruited Slotkin, who is fluent in Arabic and Swahili, shortly after she earned a graduate degree in international affairs at Columbia University in New York City. She served three tours in Iraq as a CIA analyst.\nThe moderate Democrat focused her 2024 Senate campaign on lowering costs for Americans, a move that helped propel her to a narrow victory over former Congressman Mike Rogers, even as Trump won the state.\nSlotkin is a member of the committees on Armed Forces; Homeland Security and Governmental Affairs; Agriculture, Nutrition and Forestry; and Veterans Affairs.", "url": "https://www.bbc.co.uk/news/articles/c798egw3jz8o"}