{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:39:23", "date_modify": "2025-05-19 15:39:23", "date_publish": "2015-02-24 18:50:06", "description": "Labour-led Cardiff council is going to delay its plans to transfer control of play centres to community groups.", "filename": "news_uk-wales-south-east-wales-31588602_1747669163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80399000/jpg/_80399160_cardiffcityhall.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-south-east-wales-31588602_1747669163.html", "title": "Cardiff play centre shake-up plans put back", "title_page": "Cardiff play centre shake-up plans put back - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Labour-led Cardiff council's plans to transfer control of play centres to community groups could be delayed.\nThe controversial planned cut to the funding of play centres in poorer parts of the city has caused unhappiness among Labour backbenchers.\nThe change was earmarked for April but could now be delayed until September.\nBBC Wales understands around £300,000 has been found to fund staffing at the centres during the transition period.\nThe council's Labour cabinet approved its budget for 2015/16 last week but an amendment has since been drawn up.\nA full council vote on the plans will take place on Thursday.\nLabour backbenchers are also unhappy with planned funding cuts to day centres for the elderly and a council tax rise of 5%.\nOn Wednesday, opposition groups will publish details of their alternative budget.\nThe Labour party has warned potential rebels that voting against the budget could damage the party's general election prospects in the city, and would lead to disciplinary action.\nOn Monday, BBC Wales revealed that one of the city's Labour MPs, Stephen Doughty, sent an email to the council's leadership earlier this month describing its handling of the budget as \"appalling\".", "url": "https://www.bbc.com/news/uk-wales-south-east-wales-31588602"}