{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 06:39:56", "date_modify": "2025-04-26 06:39:56", "date_publish": "2025-03-02 15:10:19", "description": "Luis Piovesana was last captured on CCTV walking on foot through a retail park on Friday.", "filename": "news_articles_cj4n29ww00eo_1745649596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b14b/live/c3f476a0-f774-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n29ww00eo_1745649596.html", "title": "Judo Olympian pleads for help finding missing brother", "title_page": "Judo Olympian pleads for help finding missing brother in Bristol - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A judo Olympian has appealed for help to find her missing brother who disappeared from a retail park in the middle of the night.\nLuis Piovesana, 26, was last seen at about 03:00 GMT on Friday at Eastgate Retail Park in Bristol, having left a venue in nearby St Jude's and travelling there via taxi.\nHis sister Lubjana Piovesana, 28, who competed for Team GB before switching to the Austrian team, said the next hours were \"critical\" in the search for her brother.\nAvon and Somerset Police say they were \"extremely worried\" for Mr Piovesana, as it was \"out of character for him to be missing\".\nCCTV footage shows Mr Piovesana travelling on foot around the retail park in the early hours of Friday.\nHe was wearing black baggy jeans with a diamond patterned stitching on them, cream-coloured trainers, a black and grey Rapha gilet and a black Rapha cap, police said.\nMr Piovesana also had a cartoon-style tattoo of a man, a car and a cherub on his arm, and a Vespa motorbike on his stomach, they added.\nHe had links to Frenchay in South Gloucestershire, the force said.\nMs Piovesana, who defeated Team GB's Lucy Renshall in the women's -63kg judo event in Paris last year, wrote on Facebook: \"He has no phone, no money, no cards, so he will be in distress.\n\"Please check your sheds, garages, or if you have any building that he could enter.\n\"He could be injured, he could be trapped. Even if you think he could not be in there, please just double check in case he is stuck, as he may have been trying to hide or seek shelter from the cold.\n\"The next hours are critical and any help is appreciated.\"", "url": "https://www.bbc.co.uk/news/articles/cj4n29ww00eo"}