{"authors": ["Richard Evans", "Eleri Griffiths", "www.facebook.com"], "date_download": "2025-04-26 07:37:57", "date_modify": "2025-04-26 07:37:57", "date_publish": "2025-02-27 13:46:43", "description": "Busy hospital car parks cause patients to be late for their appointments.", "filename": "news_articles_c78ee7q3e7go_1745653077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5470/live/08fe0d00-f50a-11ef-8a81-19610c927464.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ee7q3e7go_1745653077.html", "title": "North Wales: Hospitals ask patients to avoid using car parks", "title_page": "North Wales: Hospitals ask patients to avoid using car parks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A health board is asking its patients to consider using public transport or have a family member drop them off due to busy car parks.\nBetsi Cadwaladr University Health Board is also asking those visiting loved ones at Ysbyty Gwynedd in Bangor, Ysbyty Glan Clwyd, and Wrexham Maelor Hospital to consider visiting at quieter times.\nParking at all NHS hospitals in Wales has been free since 2018, which could be one of the reasons for the overcrowding.\nBut Chris Evans, a councillor in Denbighshire, said: \"It is fundamentally wrong to expect ill, vulnerable, or upset people to walk to the hospital.\"\nOne patient said they were 25 minutes late to an appointment at Ysbyty Gwynedd earlier this month, despite arriving 20 minutes early, because of parking.\nHe said: \"Dozens of people were just driving around in circles, searching for a car parking space.\n\"I was late in the end.\n\"I had to park a considerable way outside of the hospital as there were double yellow lines on the nearest adjacent roads.\"\nMr Evans, who represents Tremeirchion, said he had been receiving medical treatment at Walton Centre in Liverpool.\nHe praised NHS staff at the hospital after they called ahead and advised him to leave an hour early, as the roads were busy due to Liverpool FC playing at Anfield.\nMr Evans questioned whether the north Wales health board could operate this system.\n\"In Glan Clwyd, we are seeing people turning up, and they can't park, so they are late for their appointments. So it has a knock-on effect for the patients and also the staff,\" he said.\n\"I have a relative with bladder cancer. He parks by the marble church and walks down because he can't find a parking space.\"\nBrian Jones, a councillor who represents Rhyl, said he had constituents receiving excellent treatment, but claimed the parking at Ysbyty Glan Clwyd was \"a nightmare\".\n\"Glan Clwyd does have a serious car parking problem. That goes without saying, and that is accepted by all parties concerned,\" Mr Jones said.\nMr Jones said although there is no on-site solution now, a park and ride car park from different locations across the county could be an option.", "url": "https://www.bbc.co.uk/news/articles/c78ee7q3e7go"}