{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 07:03:52", "date_modify": "2025-04-26 07:03:52", "date_publish": "2025-02-28 07:39:12", "description": "The Ferensway and Anlaby Road junction in Hull will be resurfaced overnight on Saturday.", "filename": "news_articles_cz9nn1w9v1no_1745651032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e928/live/0f4b9290-f5c8-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9nn1w9v1no_1745651032.html", "title": "More roadworks for junction of Ferensway and Anlaby Road in Hull", "title_page": "More roadworks for junction of Ferensway and Anlaby Road in Hull - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A major junction in Hull city centre will be partially closed overnight on Saturday to allow for further repair works, the council has confirmed.\nThe junction of Ferensway and Anlaby Road was resurfaced earlier this month after suffering damage from weathering and traffic.\nHull City Council said the junction will be closed from 20:00 GMT on Saturday until 06:00 on Sunday to allow teams to repaint road markings and install an anti-skid surface.\nTraffic turning into Anlaby Road from Ferensway on the northbound carriageway will be unaffected by the work but all other directions will be stopped.\nCouncillor Mark Ieronimo, cabinet portfolio holder for transportation, roads and highways, said: \"We have taken the necessary steps to invest and enhance the road surface on this key route in and out of Hull and, as a council, we are delighted with the quality of this repair.\n\"Adding the road markings back and installing the anti-skid surfacing will be the final activity we need to do at this location.\n\"We apologise for the short-term inconvenience that this work will have and would like to thank motorists and the travelling public for their patience and understanding.\"", "url": "https://www.bbc.co.uk/news/articles/cz9nn1w9v1no"}