{"authors": ["Paul Burnell", "www.facebook.com"], "date_download": "2025-04-26 06:56:33", "date_modify": "2025-04-26 06:56:33", "date_publish": "2025-02-28 14:47:38", "description": "The Rt Rev Ruth Worsley becomes interim Bishop of Liverpool after Dr John Perumbalath quit his post.", "filename": "news_articles_c98447gn41no_1745650593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/263f/live/443e5e10-f5d2-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c98447gn41no_1745650593.html", "title": "Interim Bishop of Liverpool replaces cleric facing assault claims", "title_page": "Interim Bishop of Liverpool replaces cleric facing assault claims - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An acting bishop is to be installed in a Church of England diocese where the previous bishop stepped down following allegations of sexual assault.\nThe current Bishop of Taunton Rt Rev Ruth Worsley is to be interim Bishop of Liverpool just under a month after the resignation of Dr John Perumbalath.\nThe bishop resigned at the end of January after an allegation of sexual assault against him was broadcast by Channel 4 News.\nDr Perumbalath denied the allegations, but said that he did not want the story to be \"a distraction for this incredible diocese and its people whom it has been an honour and joy to serve\".\nA commissioning service for Bishop Worsley is expected to take place after Easter.\nThe new temporary bishop said she was looking forward to working with the leadership team, clergy and laity of a \"vibrant and faithful community\".\nShe also said the church had to listen to the voices of those who raised safeguarding issues.\nBishop Worsley will serve for two years until the King appoints a permanent Bishop of Liverpool.\nTo take on this role, she has been appointed as suffragan bishop for the newly activated See of Wigan, which is part of the Diocese of Liverpool.\nUnder church rules she needs an official connection to the diocese to give her legal authorisation to act in the diocese and her appointment to the See of Wigan gives her this power.\nShe is currently the Bishop of Taunton but will begin begin meeting people in Liverpool and performing official legal duties while completing her ministry there, the Archbishop of York Stephen Cottrell, external says.\nHe added he was \"deeply grateful\" to the Diocese of Bath and Wells for \"releasing her to support Liverpool in this time of change\".", "url": "https://www.bbc.co.uk/news/articles/c98447gn41no"}