{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 07:54:16", "date_modify": "2025-04-26 07:54:16", "date_publish": "2025-02-25 13:38:47", "description": "A funeral service is held for the man who shot an intruder dead in his home, and wounded one other.", "filename": "news_articles_cy5n312q3glo_1745654056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c266/live/4fde09a0-f366-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy5n312q3glo_1745654056.html", "title": "Tony Martin: The man behind the homeowners' rights debate", "title_page": "Tony Martin: The man behind the homeowners' rights debate - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In the late 1990s, Martin lived on his own at a sprawling, semi-derelict farmhouse in Emneth Hungate near Wisbech on the Norfolk-Cambridgeshire border.\nOn the night of 20 August 1999, 16-year-old Fred Barras and 29-year-old Brendon Fearon travelled from Newark, Nottinghamshire, to raid the house where Martin stored antiques.\nOnce in the house, Martin heard them and came down from an upstairs bedroom before firing a pump-action shotgun.\nFred died from his injuries at the farm and Brendon was injured and treated in hospital.\nMartin was arrested and charged with murder of the boy, and claimed to have been acting in self-defence, but prosecutors argued he had anticipated the pair and lay in wait for them.\nHe was convicted and jailed for life in April 2000 with 10 years to run concurrently for a wounding offence and a further 12 months for possession of an illegal firearm.\nAfter his sentence, Fred's family spoke to reporters and said they \"cannot and do not condone\" the 16-year-old's actions.\nHowever, they added he was \"fun-loving and always happy\" and they urged people to \"please remember that he was just 16\".\nMartin's sentence was later downgraded to manslaughter on the grounds of diminished responsibility after a diagnosis of paranoid personality disorder and Martin was released in 2003.\nThe case immediately attracted huge public attention.\n\"Was he defending his home from intruders or simply a vigilante taking the law into his own hands?\" said Prof David Wilson, emeritus professor of criminology at Birmingham City University, who was speaking in 2019.\n\"I don't think any journalist missed the opportunity to frame that story in the way that suited their readership.\"\nFormer Daily Mirror reporter Aidan McGurran lived with Martin for two weeks after he was released from his three-year prison sentence.\n\"I never once heard Tony Martin in all the interviews I conducted with him ever, ever express any remorse,\" he said.\nMartin himself said several years later he did not \"have to excuse myself for anything\" and maintained he acted in self-defence.\nIn 2013, the Crime & Courts Act gave people a \"householder's defence\" if they used \"reasonable\" force against an intruder that was not \"grossly disproportionate\" - a change in the law that was influenced by Martin's trial and other similar cases.\nHowever, prior to his death, Martin still felt the law fell short.\nFor some time after the shooting, Martin refused to return to Bleak House and instead stayed with friends and within other properties he owned in west Norfolk.\nHis friend Malcolm Starr said Martin became \"quite depressed\" and also lived in cars, a barn and a rented house before his health declined.\nHe continued to hit the headlines including in 2013 when he said two men attempted to steal a pair of £90 batteries from his barn.\nIn 2017, Martin visited the grave of Fred in Newark and said he \"just stood there and looked at it\".\nMartin died on 2 February in hospital in Wisbech, Cambridgeshire, and was surrounded by friends. He had suffered a stroke.", "url": "https://www.bbc.co.uk/news/articles/cy5n312q3glo"}