{"authors": ["Emily Dalton", "www.facebook.com"], "date_download": "2025-04-26 04:15:05", "date_modify": "2025-04-26 04:15:05", "date_publish": "2025-03-04 10:48:52", "description": "The cash-strapped council will reduce some charges, increase most and charge blue badge holders.", "filename": "news_articles_c9deg5vxd2zo_1745640905.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f19a/live/c97b2550-f8d8-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deg5vxd2zo_1745640905.html", "title": "Woking approves change to car park charges", "title_page": "Woking approves change to car park charges - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Car parking charges, season tickets and permits are set to change in a Surrey town following a two-year freeze.\nBankrupt Woking Borough Council (WBC) said the shake up was an attempt to generate income and streamline tariffs.\nUnder the plans, four car parks will see a 30% decrease in three-hour tariffs but a 22% rise in hourly rates, according to the Local Democracy Reporting Service.\nThe move preceded the council's decision on Monday to increase its share of council tax by 2.99%.\nThe council said its car park income remained around £1m less than pre-2020 levels, although it had seen a £700k increase between 2022/23 and 2023/24.\nNew prices and daily tariffs will be coming to Victoria Place, Victoria Way, Brewery Road and Heathside.\nParking permit and season ticket charges will face the biggest overhaul.\nChanges include reducing permit options from 65 to 26, reducing some discounted permits and adding a £25 admin charge to processing blue badges for disabled parking.\nWBC said it will gradually transition the new prices over up to five years \"where increases are significant\" and over three years where they are \"less significant\".\nThe plans, which were agreed on 27 February, legally a have a 21-day notice of variation before introduction.\nA public consultation may be considered when launching the new charges, said WBC.", "url": "https://www.bbc.co.uk/news/articles/c9deg5vxd2zo"}