{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:02", "date_modify": "2025-05-19 15:31:02", "date_publish": "2015-02-20 12:35:46", "description": "A rapist who carried out a series of brutal attacks on four women in the south and west of Scotland is jailed for 10 years.", "filename": "news_uk-scotland-south-scotland-31552081_1747668662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81135000/jpg/_81135631_jamesgellately.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-south-scotland-31552081_1747668662.html", "title": "Rapist who attacked women in is jailed", "title_page": "Rapist who attacked women in is jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A rapist who carried out a series of brutal attacks on four women has been jailed for 10 years.\nJudge John Morris told James Gellately, 27, he was a \"real and present danger\" to the public, especially women.\nHe was found guilty of four rapes, an indecent assault and three assault offences.\nThe High Court in Edinburgh heard that Gellately attacked his first victim in 2006 and 2007 at houses in Dumfries, Ecclefechan, Annan and Eastriggs.\nDuring the ordeal, the woman had her head forced into a bath of water and her face was held under the surface.\nShe was pinned down, grabbed by the throat, repeatedly punched and bitten on the body.\nShe also had jewellery removed from her body with pliers and her hair cut off and Gellately brandished a screwdriver at her and threatened to kill her.\nGellately also blindfolded her and sexually assaulted her.\nHe raped his second victim in 2009 at a house in East Kilbride.\nThe woman was also subjected to assaults by Gellately, who kicked her on the head, pinned her down, seized her by the throat and cut her hair.\nHe also took a phone from her to stop her calling for help and made her take more than the recommended dose of a medication.\nGellately's third victim was raped at a house in Kilmarnock, in Ayrshire, and she was also physically attacked by him.", "url": "https://www.bbc.com/news/uk-scotland-south-scotland-31552081"}