{"authors": ["George King", "www.facebook.com"], "date_download": "2025-04-26 03:46:37", "date_modify": "2025-04-26 03:46:37", "date_publish": "2025-03-05 05:37:55", "description": "The BMW driver is also arrested and provided a blood sample to police in hospital.", "filename": "news_articles_c33755jynlzo_1745639197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9421/live/98f12f60-f914-11ef-a4d6-5dacf2efb9fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c33755jynlzo_1745639197.html", "title": "Driver trapped in sinking car saved by Suffolk Police officers", "title_page": "Driver trapped in sinking car saved by Suffolk Police officers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A driver left trapped in a sinking car after it crashed into a pond was \"undoubtedly\" saved by fast-acting police officers who pulled him to safety.\nSuffolk Police officers found a BMW X7 submerged off Long Lane in Heveningham at about 01:20 GMT on Sunday.\nThe vehicle's monitoring system had alerted them before the motorist, unable to get out and stuck in an air pocket in the boot, was able to tell the operator his car was filling with water.\nAfter locating the car, which by this point was \"almost fully submerged in water\", the five officers deployed a throw line before dragging the man to safety, and he was later arrested on suspicion of failing to provide breath test specimen.\nAmbulance and fire crews then arrived at the pitch-black pond and the man was taken to hospital and checked over before later being discharged.\nInsp Liz Casey, policing commander for Halesworth, said: \"This incident could've had a very different ending had it not been for the actions of these officers.\n\"Not only did they respond quickly to the 999 call, they managed to locate the submerged vehicle in the dark and took immediate action to rescue the driver.\n\"Time was very much of the essence and I would like to commend this fantastic team effort which I believe undoubtedly saved the man's life.\"\nAfter his arrest on suspicion of failing to provide a breath test, the driver later provided a blood sample in hospital.\nHe was released from custody and remained under investigation pending the outcome of the blood tests.", "url": "https://www.bbc.co.uk/news/articles/c33755jynlzo"}