{"authors": ["Mark Smith", "www.facebook.com"], "date_download": "2025-04-26 06:19:54", "date_modify": "2025-04-26 06:19:54", "date_publish": "2025-03-01 07:02:31", "description": "Our weekend picture round-up contains some beautiful glimpses of spring at last.", "filename": "news_articles_cvgely4p9qeo_1745648394.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a65/live/1d3d6670-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgely4p9qeo_1745648394.html", "title": "Gloucestershire in Pictures: Spring sunshine and stadium renaming", "title_page": "Gloucestershire in Pictures: Spring sunshine and stadium renaming - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This week's round-up of pictures shows signs Spring is on its way in Gloucestershire.\nAnd with a huge rugby game this weekend, Gloucester's famous stadium is renamed for only the second time in its history.\nOn Sunday, Gloucester-Hartpury host Bristol Bears Women in their PWR semi final. To mark the occasion Kingsholm has been rebranded Queensholm, as it was two years ago when Gloucester-Hartpury beat Exeter Chiefs Women in the final which was held in this stadium.\nA sure sign Spring is on the way is the arrival of lambs. About 120 have already been born at Cotswold Farm Park, with staff expecting more than 550 by the end of April.\nPrincess Anne visited Lydney, in the Forest of Dean, this week to meet people who had been affected by Storm Bert in November 2024.\nShe told residents and businessowners their response to the storm, which saw about 50 homes flooded, had been \"extraordinary\".\nThere have been celebrations at the independent Sherborne Cinema in the Kingsholm area of Gloucester. Mark Cunningham bought the building and spent more than two years painting it and adding 1950s style decoration. He has been presented with a Mayor's Medal and certificate for his \"outstanding service to the city\".", "url": "https://www.bbc.co.uk/news/articles/cvgely4p9qeo"}