{"authors": ["Kate Whannel", "www.facebook.com"], "date_download": "2025-04-26 07:29:39", "date_modify": "2025-04-26 07:29:39", "date_publish": "2025-02-27 18:12:02", "description": "Keir Starmer hands the US president an invitation letter as the pair meet at the White House.", "filename": "news_articles_c5yxxpxe5qko_1745652579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/33f0/live/c813bce0-f545-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxxpxe5qko_1745652579.html", "title": "Keir Starmer gives Donald Trump state visit invitation from the King", "title_page": "Keir Starmer gives Donald Trump state visit invitation from the King - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump has been invited to the UK for a second state visit by the King.\nPrime Minister Sir Keir Starmer used his trip to the White House to present Trump with the invitation letter from King Charles.\nSir Keir said the president's last state visit in 2019 had been a \"tremendous success\" and that the invite for a second visit was \"truly historic\" and \"unprecedented\".\nSpeaking to reporters in the Oval Office after reading the letter, Trump said he accepted the invite and that it would be an \"honour\" to visit the \"fantastic\" country.\nHe added that King Charles was a \"beautiful man, a wonderful man\".\nTraditionally second-term US presidents are not offered a state visit and have instead been invited for tea or lunch with the monarch at Windsor Castle.\nKing Charles' letter proposed a meeting to discuss details of the state visit at either Dumfries House or Balmoral, both in Scotland, a country to which Trump has connections.\nHis mother was born and brought up on the Hebridean island of Lewis. This year he is planning to open a new golf course in Aberdeenshire, to be named after his mother.\nThe letter, which Trump showed to the cameras, read: \"Quite apart from this presenting an opportunity to discuss a wide range of issues of mutual interest, it would also offer a valuable chance to plan a historic second state visit to the United Kingdom.\n\"As you will know this is unprecedented by a US president. That is why I would find it helpful for us to be able to discuss, together, a range of options for location and programme content.\n\"In so doing, working together, I know we will further enhance the special relationship between our two countries of which we are both so proud.\"\nTrump joked that he would have to check if the signature was real.\nAt a joint news conference later, Trump said a trade deal between the US and UK could happen \"very quickly\" and could see the UK avoiding the kind of tariffs the president has been threatening on other countries.\nSir Keir said the two countries would begin work on a new economic deal which would be centred on the potential of artificial intelligence.\nDuring his visit Sir Keir also hopes to influence Trump as he seeks to reach a peace deal between Ukraine and Russia.\nSpeaking on the plane to the US, Sir Keir told reporters that a deal would not stop Vladimir Putin from invading Ukraine again, unless the US were able to provide security guarantees.\nAsked if the US could offer such support, Trump said a proposed deal with Ukraine over access to critical minerals would provide \"a backstop\".\n\"We are a backstop because we will be over there, we will be working in the country,\" he said.\nSince becoming prime minister, Sir Keir, who had previously been critical of the president, has sought to build a close relationship with Trump.\nHowever, he did feel compelled to contradict the US president when he accused Volodymyr Zelensky of being a dictator.\nAsked about his dictator comments, Trump said: \"Did I say that? I can't believe I said that. Next question.\"\nPressed over whether he would approve the UK's potential deal to hand over the Chagos Islands to Mauritius, Trump said: \"We're going to have some discussions about that very soon, and I have a feeling it's going to work out very well.\n\"I think we'll be inclined to go along with your country,\"\nIn an interview after arriving in the US on Wednesday, Foreign Secretary David Lammy said the controversial deal would not go ahead unless the US supported it.\nUnder the proposal, the UK would cede sovereignty of the Chagos archipelago to Mauritius but would still be able to use one of the islands, Diego Garcia, which includes a UK-US military airbase.", "url": "https://www.bbc.co.uk/news/articles/c5yxxpxe5qko"}