{"authors": ["Jenny Coleman", "www.facebook.com"], "date_download": "2025-04-26 06:19:30", "date_modify": "2025-04-26 06:19:30", "date_publish": "2025-03-01 07:14:21", "description": "Warrington Wolves fans whose Las Vegas wedding was cancelled due to Covid will finally tie the knot.", "filename": "news_articles_cq5zz4n0pzgo_1745648370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8516/live/2be137b0-f5c4-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zz4n0pzgo_1745648370.html", "title": "Las Vegas is 'trip of a lifetime' for rugby fans set to marry", "title_page": "Las Vegas is 'trip of a lifetime' for rugby fans set to marry - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A couple who were forced to cancel their Las Vegas wedding plans five years ago due to the coronavirus pandemic will finally tie the knot this weekend thanks to a Rugby Super League fixture.\nWarrington Wolves fans Ged Upham and his partner Jean, both 65, said they were three weeks away from their dream wedding in 2020 \"when the world stopped\".\n\"We just didn't know what was going to happen, so we spent the money on a new kitchen instead,\" Ged said.\nThe couple, from Runcorn, said they put it out of their mind and had decided to marry in a registry office in the UK - until the Wigan v Warrington fixture in Las Vegas was announced.\n\"That was the catalyst,\" Ged said.\n\"That was the thing that swung us to say 'let's resurrect the Vegas trip'.\n\"We aren't getting any younger, let's do it.\"\nThe couple, who flew out on Friday will watch the game on Saturday before their big day on Sunday.\n\"It's very exciting,\" Jean said. \"We've never been to Vegas before so we are really looking forward to it.\"\nThe couple will be joined by Jean's daughter Katy, her sister Joanne, and her brother-in-law Matt.", "url": "https://www.bbc.co.uk/news/articles/cq5zz4n0pzgo"}