{"authors": ["Jeremy Britton", "www.facebook.com"], "date_download": "2025-04-26 07:53:27", "date_modify": "2025-04-26 07:53:27", "date_publish": "2025-02-25 14:00:42", "description": "Cher Maximen was attacked with a zombie knife on the first day of last year's Notting Hill Carnival.", "filename": "news_articles_cnvzqqdp353o_1745654007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d59/live/a47963e0-f44e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cnvzqqdp353o_1745654007.html", "title": "Notting Hill Carnival: Shakeil Thibou on trial in Cher Maximen murder case", "title_page": "Notting Hill Carnival: Shakeil Thibou on trial in Cher Maximen murder case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman was fatally stabbed in front of her three-year-old daughter after getting caught up in a fight between a group of men at the Notting Hill Carnival, a court has heard.\nCher Maximen, 32, was stabbed in the groin with a zombie knife on 25 August - the first day of the event and known as \"family day\" - the Old Bailey was told. She died in hospital six days later.\nShakeil Thibou, 20, from Kensington in west London, denies her murder, attempting to murder another 20-year-old man and possessing an offensive weapon.\nProsecutor Edward Brown KC said: \"It is a shocking weapon to have, let alone to use, but use it the defendant did and with devastating consequences.\"\nMr Thibou's brothers, Sheldon, 25 and Shaeim, 22, are also on trial charged with assaulting an emergency worker and violent disorder, which they deny.\nA disturbance involving the three defendants broke out on Golborne Road, North Kensington, at about 18:00 BST, while the carnival was \"in full swing\", the court heard.\nHundreds of people were nearby, among them Ms Maximen and her daughter.\n\"It is clear that she had simply got caught up in the events,\" Mr Brown said.\nWhile Sheldon and Shaeim Thibou fought with two men, Shakeil Thibou lunged at another, Adjei Isaac, with a weapon described by a witness as a zombie knife, Mr Brown told the court.\nAs Mr Isaacs tried to avoid being stabbed he came into contact with Ms Maximen, who fell to the ground, the jury was told.\nShe grabbed Shakeil Thibou's coat to lift herself back on to her feet, at which point she tried to defend herself by striking at him with her hand and then a leg.\n\"At this moment Shakeil Thibou raised the knife directly towards Cher Maximen and deliberately thrust it towards her, stabbing her in the groin,\" Mr Brown said.\n\"Cher Maximen suffered a terrible injury from which she died. It was a truly shocking attack - and regarded as such by those around it.\"", "url": "https://www.bbc.co.uk/news/articles/cnvzqqdp353o"}