{"authors": ["Caroline Gall", "Gurdip Thandi", "www.facebook.com"], "date_download": "2025-04-26 03:45:12", "date_modify": "2025-04-26 03:45:12", "date_publish": "2025-03-05 06:22:50", "description": "The deal is designed to stop a number of West Midlands bus services being cut, according to a report.", "filename": "news_articles_cjevlyx1ne8o_1745639112.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae60/live/ff8831d0-f98f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevlyx1ne8o_1745639112.html", "title": "West Midlands bus funding deal due ahead of franchising decision", "title_page": "West Midlands bus funding deal due ahead of franchising decision - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new funding deal to stop a number of West Midlands bus services being cut is expected to be agreed later this month.\nWest Midlands Combined Authority's (WMCA) board is expected to approve an extension of the Bus Network Support Grant which provides financial support to operators.\nA report to the committee said more than 30% of current commercially-operated routes would be put at risk without the funding, while fares would face bigger hikes.\nIf agreed, the deal would be extended from 1 April to 30 April before a new arrangement from 1 May to 31 December.\nPublic consultation events on plans to bring the region's bus services under public control are currently being held.\nUnder the model, Transport for West Midlands (TfWM) would set bus fares, timetables and routes, while awarding contracts to private bus operators to run those routes.\nWest Midlands mayor Richard Parker said the authority provided about £50m in grants a year to operators and under a franchise model it would cost £22.5m over three years. A decision is expected in May.\nLast month a WMCA report stated distances travelled by buses on the West Midlands network were decreasing, with the number of kilometres travelled over the past 14 years dropping from more than 173 million in 2010 to about 115 million last year.\nThe funding deal report said operators had been financially supported through national and local funding to maintain their commercial bus networks since the start of the coronavirus pandemic.\n\"Without this funding, operators have indicated that up to 33.6% of all commercially-operated local bus services could be at risk from 1 April 2025 and that fares would increase by between 20 and 25% giving rise for further cost pressures on some of the most vulnerable residents within the region.\n\"The business case for continued support of the bus network sets out that over 33% of commercial bus mileage remains at risk of de-registration.\n\"This is a reduction from 36% in June 2023.\"\nThe funding agreement was required to prevent operators from registering service reductions to take effect from 28 April and to continue to adhere to the index linked fares review mechanism in the West Midlands Enhanced Partnership, the report added.\n\"To do this the WMCA board is requested to approve the continued use of Network Support Grants for the period from 1 April to 31 December inclusive during which time the WMCA board will make further recommendations leading to a mayoral decision regarding Bus Franchising in May 2025.\"", "url": "https://www.bbc.co.uk/news/articles/cjevlyx1ne8o"}