{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:13", "date_modify": "2025-05-19 15:22:13", "date_publish": "2015-03-06 15:26:43", "description": "A UKIP general election candidate reworks Abba hit Chiquitita to mock David Cameron and the sitting MP she is challenging.", "filename": "news_uk-england-tees-31762536_1747668133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81444000/jpg/_81444969_81444968.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-tees-31762536_1747668133.html", "title": "UKIP Stockton candidate sings Abba to mock PM and MP", "title_page": "UKIP Stockton candidate sings Abba to mock PM and MP - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A UK Independence Party general election candidate has rewritten a hit by Swedish pop stars Abba to mock David Cameron and the MP she is challenging.\nMandy Boylett, 50, sings along to a backing track of Chiquitita in the YouTube video, external, wearing a dress in her party's colour purple.\nShe claims Mr Cameron is \"in love with the EU\" and says Stockton North Labour MP Alex Cunningham will soon be crying.\nMr Cunningham said he would not waste time listening to her \"silly songs\".\n\"What I want to do is see her on a platform somewhere where we can discuss policy,\" he said.\n\"When we get to that point, she will see that maybe she should stick to writing songs rather than standing in a general election.\"\nMrs Boylett, who studied statistics at Bath University and is a pilates instructor and aerobics teacher, almost breaks into a dance as the song picks up.\nIt is not the first time the mother of two has sung Abba on YouTube.\nEight years ago she uploaded a straight version of The Winner Takes It All showing her \"fulfilling her desire to replace Agnetha in the super group\".\nMr Cunningham, who won with a majority of 6,676 over the Conservatives in 2010, said he had not watched the latest production.\nStockton North Conservative candidate Chris Daniels said the \"stunt\" showed UKIP \"cannot be trusted to form a sensible, credible, alternative government\".\nNumber 10 has yet to comment.\nAnother song performed in support of UKIP, sung with a mock Caribbean accent by former BBC Radio 1 DJ Mike Read, was withdrawn from sale in October following complaints it was racist.\nRead apologised that the song \"unintentionally caused offence\".\nDavid Cameron, tell me what's wrong?\nYour MPs don't really want you\nIn their eyes\nYou're still in love with the EU\nOh that 1.7 billion\nThere is no way you won't pay it\nI can see that you think that we won't notice\nDavid Cameron, tell me the truth\nCos you can't keep on deceiving\nYour MPs\nThey will really keep on leaving\nYou were always sure of yourself\nNow I see you've lost your direction\nSaying, yes Angela, will lose you the election.\nAlex Cunningham, you and I know\nHow elections come and they go but this time you're leaving\nYou'll lose your safe Labour seat\nTo the UKIP girl\nYou will have no time for grieving\nAlex Cunningham you're gonna cry\nBecause Stockton North is turning purple around you\nOver 30 years neglect will come to an end\nAnd we'll celebrate the purple\nThirty years will come to an end\nAnd we'll celebrate the purple\nSo the walls came tumbling down\nYour campaign's a blown out candle\nAll is gone and it seems too hard to handle\nAlex Cunningham tell me the truth\nThere is no way you can deny it\nWith yet another smear to try to keep me quiet", "url": "https://www.bbc.com/news/uk-england-tees-31762536"}