{"authors": ["Lisa Young", "Ammar Ebrahim", "www.facebook.com"], "date_download": "2025-04-26 03:45:26", "date_modify": "2025-04-26 03:45:26", "date_publish": "2025-03-05 06:19:43", "description": "Expert from Jersey Law Commission shares the findings of a review into law passed in 2000.", "filename": "news_articles_c89yeylz9n4o_1745639126.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/437e/live/3adc7b30-f907-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89yeylz9n4o_1745639126.html", "title": "Law review finds Jersey lacks human rights culture", "title_page": "Law review finds Jersey lacks human rights culture - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A law expert has said Jersey lacks the human rights culture that legislation brought in 25 years ago was aimed at developing.\nProfessor Andrew Le Sueur of the Jersey Law Commission shared the findings of his review into the Human Rights (Jersey) Law 2000 (HRJL) at an event hosted by the Jersey Human Rights Group (JHRG) on Monday.\nHe said when Jersey signed up to the European Convention of Human Rights in 2000 the intention was for islanders to know what their rights were and know they were able to enforce them.\nThe Jersey Law Commission is currently consulting on 11 reform proposals to strengthen the operation of the Human Rights (Jersey) Law 2000.\nProfessor Le Sueur said: \"There's a bit of a risk that whilst the law has achieved some technical things really well, it hasn't built this shared understanding that we've all got rights that need to be respected.\"\nHe said in a typical year there were at least 20 cases where people cited human rights.\nSince the HRJL had been introduced there had been only 29 cases challenging public authorities and only four cases brought by women, and three of those had been brought with a male partner, he said.\n\"I think there is a lack of awareness of what the European Convention on Human Rights actually means for islanders,\" he added.\nThe professor's research pointed out efforts to inform the public about their rights have waned since the initial public education campaign when the HRJL was introduced.\nDeputy Montfort Tadier, JHRG chair, said: \"Early indications are there are perhaps some groups, for example women and those with lower incomes, who might find it difficult to enforce their human rights in Jersey or to even know how to go about it.\"\n\"I think you need to know how to enforce your human rights, you need to have access to lawyers and not everyone in Jersey can necessarily have that,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c89yeylz9n4o"}