{"authors": ["Martin Eastaugh", "www.facebook.com"], "date_download": "2025-04-26 04:05:30", "date_modify": "2025-04-26 04:05:30", "date_publish": "2025-03-03 17:23:08", "description": "Fred Doe is accused of trying to sell 20kg of gold from the toilet stolen at Blenheim Palace.", "filename": "news_articles_cvg170x26r5o_1745640330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e698/live/3294f740-f29f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg170x26r5o_1745640330.html", "title": "Gold toilet accused denies knowing gold was from palace heist", "title_page": "Gold toilet accused denies knowing gold was from palace heist - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has denied knowing gold he was trying to help someone sell came from a golden toilet stolen at Blenheim Palace.\nThe artwork, called America, was taken from the stately home in Oxfordshire in the early hours of 14 September 2019, two days after it went on display.\nFred Doe admitted putting James Sheen, who has previously pleaded guilty to stealing the toilet, in touch with gold dealer Bora Guccuk but said he would \"never in a million years\" have dealt with him if he had known it was stolen.\nMr Doe and Mr Guccuk both deny conspiracy to transfer criminal property. A third man, Michael Jones, 39, denies one count of burglary.\nThieves stole the fully-functioning toilet in an \"audacious raid\" which took just five minutes, Oxford Crown Court previously heard.\nIt weighed 98kg (216lbs) and was insured for $6m. Gold prices at the time would have seen the gold alone worth £2.8m, the court was told.\nProsecutor Julian Christopher KC said a series of messages, voice notes and screengrabs discovered on Mr Sheen, Mr Doe and Mr Guccuk's phones in the days after the burglary showed the trio negotiated a price of £25,632 per kilo for about 20kg (44lbs) of the stolen gold.\nIt was claimed Mr Guccuk, who ran the jewellers Pacha of London in Hatton Garden, would make a profit of about £3,000 for every kilo he sold on.\nMr Doe admitted using the code word \"cars\" to represent kilograms of gold in a series of messages with Sheen but told the court this was to protect his family over concerns thieves would target his home if they believed he had large quantities of money or valuables.\nHe said he was a keen collector of watches and claimed he had been using coded language since 2018 when someone had overheard him talking about valuable watches and \"put a tracker on my car\".\nMr Doe admitted knowing his fellow accused Mr Guccuk and said he had been buying and selling watches from him for since about 2013.\nBut he stressed the first time he heard of the golden toilet heist was when Mr Guccuk was arrested.\nWhen asked by his defence lawyer Crispin Aylett KC whether the amount of gold Sheen sought to sell, 20 kg, raised any concerns, Doe replied: \"I agree that was quite a lot of gold, but I will get some prices and try to move on.\n\"I didn't really pay attention to what he was talking about.\n\"To me, gold is gold. I don't know good gold from bad gold.\"", "url": "https://www.bbc.co.uk/news/articles/cvg170x26r5o"}