{"authors": ["Iain Watson", "www.facebook.com"], "date_download": "2025-04-26 06:53:13", "date_modify": "2025-04-26 06:53:13", "date_publish": "2025-02-28 16:37:33", "description": "Labour MPs have been disciplined in not publicly opposing policies which privately make them queasy, but that may change.", "filename": "news_articles_c62kz34nnyeo_1745650393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/39ff/live/61ee82d0-f5ed-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62kz34nnyeo_1745650393.html", "title": "Dodds exit signals Labour unease over Starmer's tough decisions", "title_page": "Dodds exit signals Labour unease over Starmer's tough decisions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Keir Starmer has lost four senior ministers since coming to power last July.\nAlthough she was not a high profile minister, the departure of Anneliese Dodds is the most significant so far.\nShe is the first to resign over policy.\nAlthough she says she will support the PM from the backbenches, her letter of resignation, external delivered a coruscating critique.\nShe - along with most Labour MPs – recognises defence spending needs to rise, but she disagrees with how it is being funded.\nShe suggests that Britain's reputation will be damaged - but she is also denting her leader's.\nIn effect, she is saying he is being misleading over the effect of the cuts, which will \"remove food and healthcare from desperate people\".\nAnd that while he has made a tactical decision – essentially, using a defence spending hike to grease the wheels of his meeting with President Trump - she maintains that the PM has made a strategic error which could bolster Russia and China's global influence.\nOne of the least dramatically-phrased - but potentially most significant - lines in Dodds's resignation letter is when she suggests how more defence spending could be paid for.\nShe called for a discussion on \"our fiscal rules and approach to taxation\" – in other words, a debate on tax and borrowing.\nLabour MPs have been remarkably disciplined in not publicly opposing policies which privately make them queasy, but there are fears of over forthcoming welfare cuts and there has been discontent over the winter fuel allowance, the two child benefit cap, and lack of compensation for Waspi women.\nSo will Anneliese Dodds's resignation loosen the tongues of other discontented MPs?\nWhile it was widely expected that Keir Starmer would move robustly away from the politics and poses of the Corbyn years, some of the current contingent of MPs are concerned that he is moving away from commitments made by his predecessors Tony Blair and Gordon Brown too.\nIt was Blair who announced the move to the aid target of 0.7% of GDP – a commitment subsequently delivered by David Cameron despite an era of austerity.\nIt was Brown who introduced a universal winter fuel payment for pensioners.\nFor those Labour MPs who have the phrase \"I didn't come into politics to do this\" nagging sotto voce at their conscience, then Tory leader Kemi Badenoch's strong praise, external for their leader's aid cuts won't have made life any easier.\nBut the prime minister has inherited a less benign economy than the last Labour government – and arguably a more malign world, with 'peace dividends' firmly thrown into the dustbin of history.\nIn Keir Starmer's letter responding to Anneliese Dodds's resignation, the PM states that he made \"a difficult and painful decision\" and not one he took lightly.\nBut it worth noting that it is a decision which is far from universally unpopular in Labour's ranks.\nPolling suggests that there is strong support amongst the wider electorate both for a rise in defence spending AND a cut in overseas aid.\nMany of the MPs in the so-called Red Wall - those seats lost to the Conservatives in the Midlands and Northern England in 2019 and regained in 2024 – have seen an increasing challenge from Nigel Farage's Reform UK.\nThey want to see a greater emphasis on patriotism and a tougher line on immigration.\nSo apparently putting Britain first – more spent on defence here, less spending overseas – will be seen by some as a way of inoculating themselves against the growing threat of Reform.\nBut with more tough decisions ahead, the remarkable coalition assembled by Labour at the last general election will come under increasing pressure.\nAnneliese Dodds was the first to walk away from the top table over policy.\nKeir Starmer knows it's possible she won't be the last.", "url": "https://www.bbc.co.uk/news/articles/c62kz34nnyeo"}