{"authors": ["Maia Davies", "www.facebook.com"], "date_download": "2025-04-26 08:01:40", "date_modify": "2025-04-26 08:01:40", "date_publish": "2025-02-26 17:24:17", "description": "Local media reported an avalanche fell while the men scaled a frozen waterfall on Friday.", "filename": "news_articles_cwygwzd4wggo_1745654500.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f7f1/live/4d189540-f45c-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwzd4wggo_1745654500.html", "title": "British man dies and one injured while climbing in Norway", "title_page": "British man dies and one injured while climbing in Norway - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A British man has died and another was left injured while climbing in Norway.\nNorwegian media reported an avalanche fell while the men scaled a frozen waterfall at Gaustatoppen mountain on Friday.\nRescuers reportedly failed to recover the man who died for several days due to poor weather conditions.\nThe Foreign Office said: \"We are supporting the family of a British man who has died in Norway, and a British man who has been injured, and are in contact with the local authorities.\"\nAn avalanche fell on the mountain in Norway's southern Telemark county early on Friday afternoon, Norwegian media reported.\nRescuers were said to have airlifted one of the climbers to hospital with non-fatal injuries on Saturday.\nEfforts to recover the second man were postponed several times due to bad weather, Norway's NRK reported.\n\"Prevailing weather conditions, avalanche danger and accessibility made it a very complicated and demanding task to get in and down to the climbers,\" local emergency manager Tor Einar Bakken told the broadcaster.\nFire and police officers reportedly recovered his body on Tuesday morning using ropes and by abseiling, as poor conditions meant it was not possible to use a helicopter.", "url": "https://www.bbc.co.uk/news/articles/cwygwzd4wggo"}