{"authors": ["Federica Bedendo", "www.facebook.com"], "date_download": "2025-04-26 03:46:12", "date_modify": "2025-04-26 03:46:12", "date_publish": "2025-03-05 06:06:07", "description": "The coroner concluded Geoffrey Kershaw was unlawfully killed after being assaulted by a fellow resident.", "filename": "news_articles_c204ww2pwl2o_1745639172.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e5c5/live/9e4f5250-f916-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c204ww2pwl2o_1745639172.html", "title": "Barrow care home resident killed with fire extinguisher", "title_page": "Barrow care home resident killed with fire extinguisher - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 90-year-old man died after being hit in the head with a fire extinguisher by a fellow resident at his care home, a coroner heard.\nGeoffrey Kershaw, 90, was being given palliative care at Ostley Home in Barrow, Cumbria, when he was assaulted by William Price, 63, in March 2024.\nMr Price, who has himself since died, told the care home manager when she arrived at the scene minutes after the assault, Mr Kershaw had asked him to kill him. But the manager told the coroner Mr Kershaw had been bedbound and struggled to communicate.\nAt an inquest held in Cockermouth on Tuesday, Dr Nicholas Shaw, assistant coroner for Cumbria, concluded Mr Kershaw had been unlawfully killed.\nThe inquest heard evidence from the care home manager, Helen Silver, who was alerted to the incident in the care home and attended the scene at approximately 09:00 on 17 March last year, following the assault\nA statement read out in court said Mr Kershaw was not actively bleeding when she arrived, but there was blood \"splashed around his pillow\", on the wall of his room, and on the carpet.\n\"He looked lifeless.\" she said. \"I recall being relieved when I realised he was breathing.\"\nWith emergency services en route, Ms Silver said she went to Mr Price's room, concerned that he might try to hurt himself.\nHe told her Mr Kershaw had shouted for him and that he had heard him shout for help.\nShe told the court: \"He said: 'He asked me to kill him, so I did; he asked me to do it.'\"\nAnother carer described the assault as \"surreal\".\nThe inquest heard Mr Kershaw had severe dementia, was visually impaired and struggled to communicate.\nHe was also bedbound and required help from staff for all his needs.\nMs Silver said, while Mr Kershaw may have occasionally shouted, his exclamations were often merely noises, rather than words.\nMr Kershaw was taken to Furness General Hospital, where he required 17 staples to close the wound in his head. He died of his injuries five days later.\nNotes from the care home said Mr Price had been a resident at the care home for about six months, having arrived there because he was deemed to be neglecting his own needs.\nThe inquest heard he had poor mental health, but had refused to interact with mental health services or take any medication.\nThe day before the assault on Mr Kershaw, he had received a visit from a family member who asked for doctors to be called as the visitor believed Mr Price was unwell.\nOn the phone to a mental health nurse, Mr Price had told her he wanted to kill himself. A referral was made to the crisis team, and it was recommended staff kept a close eye on him.\nLater the family member returned and was heard asking Mr Price about an issue relating to bailiffs turning up at his house, but there were no notes about any further issues.\nPolice arrested Mr Price after the assault and took him to the police station in Barrow.", "url": "https://www.bbc.co.uk/news/articles/c204ww2pwl2o"}