{"authors": ["George Sandeman", "www.facebook.com"], "date_download": "2025-04-26 04:28:02", "date_modify": "2025-04-26 04:28:02", "date_publish": "2025-03-02 10:43:47", "description": "It was launched by Firefly Aerospace in January with the mission of exploring the Sea of Crises.", "filename": "news_articles_cd9208qv1kzo_1745641682.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/855d/live/0304ca10-f74e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd9208qv1kzo_1745641682.html", "title": "Firefly's Blue Ghost becomes second private spacecraft with moon landing", "title_page": "Firefly's Blue Ghost becomes second private spacecraft with moon landing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A private spacecraft has landed on the Moon, becoming only the second commercial vehicle to reach the lunar surface.\nBlue Ghost left Earth on 15 January, after being launched by US firm Firefly Aerospace with the intention of exploring the Sea of Crises, a huge basin visible from Earth.\nThe project is the latest collaboration by US space agency Nasa and private companies.\nIntuitive Machines, another firm, is hoping to land its Athena spacecraft near the Moon's south pole in the next few days.\nIntuitive was the first private company to achieve a lunar landing. Its spacecraft Odysseus reached the Moon on 22 February last year.\nHowever, the mission was short-lived as the spacecraft landed on the slope of a crater, broke some landing gear and toppled over.\nBlue Ghost touched down smoothly, having been orbiting the Moon for the last two weeks.\nStaff at Firefly's headquarters in Texas broke out into cheering and applause when they were told their landing was successful.\nDr Simeon Barber, a planetary science researcher from the Open University, said Blue Ghost was essentially the first successful private venture to the Moon, as the vehicle was intact and responsive.\nHe told BBC Breakfast: \"[They've] demonstrated a technology for landing on the surface of the Moon, the kind that had been forgotten after the Apollo era when we had astronauts on the [lunar] surface.\"\nThe importance of the Moon to many private firms, said Dr Barber, was to use it as a launch pad for exploring the rest of space.\n\"By going to the Moon, we can learn how to run robotic instruments in space [and] in the really harsh environment of the Moon, which is at times hot and at times cold. It's very dusty, there's lots of radiation.\"\nHe said at some point it was likely humans would return to the lunar surface and explained it had been so long because of a lack of funding.\nThe last time humans set foot on the Moon was 19 December 1972, during the Apollo 17 mission.\n\"The Apollo missions were hugely successful,\" explained Dr Barber. \"But they were 'touch and go' missions.\"\nBack then, astronauts would be there for three days before having to leave again, as costs were running into the billions of dollars. \"That's not sustainable,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cd9208qv1kzo"}