{"authors": ["Jonah Fisher", "www.facebook.com"], "date_download": "2025-04-26 04:35:04", "date_modify": "2025-04-26 04:35:04", "date_publish": "2025-02-28 12:32:27", "description": "The decision follows years of trials but some farmers are concerned there could be negative impacts.", "filename": "news_articles_cj3nn4rlxz5o_1745642104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d8d5/live/f2478950-f5cd-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3nn4rlxz5o_1745642104.html", "title": "Wild beavers release approved for England", "title_page": "Wild beavers release approved for England - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Beavers will be released into the wild in England after the government approved their reintroduction.\nThe decision follows years of trials and will see beavers make an officially approved return to waterways.\nHunted to extinction in Britain four hundred years ago, beavers have in the last two decades been making a comeback.\nBut some farmers are concerned that without proper management the large rodents could have negative impacts on food production.\nIt's thought that about five hundred beavers already live in England, some in the wild and others in enclosures. Many more are in Scotland, where wild releases are already permitted.\nConservationists call beavers \"ecosystem engineers\" because of how they redesign where they live. The dams they build slow the flow of rivers and streams and create habitats where other creatures can thrive. They've also been credited with reducing flooding further downstream.\n\"This is an incredibly exciting moment, a real landmark for nature recovery in England,\" Tony Juniper, the head of Natural England, told me next to a beaver dam in Devon.\n\"We're bringing back a missing animal that's been absent for centuries, and an animal that we know will bring huge benefits for the rest of the wildlife that is already depleted across much of England,\" he says.\nThe beavers will be released under a licensing system overseen by Natural England.\nIt says long term plans will need to be in place to avoid impacts on farming, food production and infrastructure.\nThat's something the National Farmers Union say is vital. It wants culling beavers to be an option if they prove disruptive.\nNFU Deputy President David Exwood said that while beavers could provide certain benefits, \"we are concerned about the negative impacts beavers can have on productive farmland, as well as the management requirements, costs and risks involved\".\n\"Beavers can flood and waterlog fields, feed on agricultural crops like maize, as well as damage and fell trees such as cricket bat willow.\"\nWe met up with Tony Juniper of Natural England at the site of the pilot project for wild beaver release in England, the River Otter catchment in Devon. Beavers first appeared here more than a decade ago - it's not clear where they came from. They may have escaped from enclosures or have been illegally released, so called \"beaver bombing\".\nSince then the wild beavers have been allowed to stay, with their impact on the landscape and the way they interact with local farmland closely monitored.\n\"All of this open water is down to the beavers,\" Peter Burgess of the Devon Wildlife Trust tells me as we splash our way through the boggy land.\n\"They want this water because it makes them feel safe and secure. It means that they can transport their food as well.\"\nAlong the River Otter Mr Burgess tells me the beavers have created wetlands that now host species such as great white egrets and kingfishers. Dragonfly numbers have soared as have frogs and toads. Water voles now roam the network of channels, streams, and ponds the beavers use to navigate the flood plain.\nScotland is several years ahead of England and has already approved the release of beavers and it's thought there are now more than 1,500 living wild. In some areas the beavers have been so successful at breeding that they have had to be relocated or as a last resort culled.\nThe first wild release of beavers in England is now expected to take place in the next few days. Dr Roisin Campbell-Palmer from the Beaver Trust, which is managing the release, told the BBC the male and female had been taken from \"conflict sites\" in Scotland and were now undergoing medical checks ahead of being moved south.\nAdditional reporting by Kevin Church.", "url": "https://www.bbc.co.uk/news/articles/cj3nn4rlxz5o"}