{"authors": ["Tom McArthur", "www.facebook.com"], "date_download": "2025-04-26 06:46:39", "date_modify": "2025-04-26 06:46:39", "date_publish": "2025-03-01 13:16:22", "description": "A £2.26bn loan was signed during Zelensky's visit to London, which came ahead of a summit on ending the war in Ukraine.", "filename": "news_articles_cg4k137ezlgo_1745649999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b710/live/a92900e0-f6cd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4k137ezlgo_1745649999.html", "title": "Keir Starmer gives Volodymyr Zelensky 'full backing' in warm No 10 welcome", "title_page": "Keir Starmer gives Volodymyr Zelensky 'full backing' in warm No 10 welcome - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has told Volodymyr Zelensky he has \"full backing across the United Kingdom\" as the two met in Downing Street.\nThe Ukrainian president told the prime minister he was happy his country had \"such friends\" after arriving in the UK in the wake of a White House meeting with US President Donald Trump that descended into a row between the two leaders.\nZelensky and Sir Keir also signed a £2.26bn loan for Ukrainian military supplies, that will be repaid using profits from frozen Russian assets.\nThe prime minister will host a summit of European and Canadian leaders in London later as part of efforts to bring the Russia-Ukraine war to an end. Zelensky is then due to meet King Charles.\nThose meetings will now be overshadowed by events in Washington and concerns about a hardening of relations with the US.\nIn recent weeks, the prime minister has sought to cast himself as a bridge between the US and Europe as it adapts to the Trump administration's desire to be less involved in European defence, having a cordial meeting with Trump a day before Zelensky's.\nDuring that meeting, he hand-delivered a letter from the King, external inviting Trump - who is fond of the Royal Family - to an unprecedented second state visit, which SNP MPs called on the PM to withdraw following the Oval Office spat.\nSir Keir has also attempted to be a conduit for Ukraine as it seeks US security guarantees in any peace deal - contacting both Trump and Zelensky by phone on Friday evening in the aftermath of their row.\nThe visit to Downing Street on Saturday was an opportunity for the PM to demonstrate his continued support for Zelensky following the public falling-out with Trump.\nRemarking on cheers he heard outside, Sir Keir told the Ukrainian leader: \"That is the people of the United Kingdom coming out to demonstrate how much they support you, how much they support Ukraine.\"\nHe added: \"We stand with you and Ukraine for as long as it may take.\"\nZelensky replied: \"I saw a lot of people and I want to thank you, the people of the United Kingdom, [for] such big support from the very beginning of this war.\"\nHe said he was happy about meeting the King on Sunday, and was thankful for the European summit.\nIt is understood the meeting between Zelensky and the King was requested by the Ukrainian president, with the UK government agreeing to it.\nFollowing the Downing Street meeting, Zelensky praised the UK's \"tremendous\" support, noting in particular the £2.26bn loan paid for through Russian assets frozen since the war began.\nHe said the funds will be used to produce weapons in Ukraine, declaring: \"This is true justice - the one who started the war must be the one to pay.\"\nThe loan was first announced in October.\nFollowing the acrimonious White House visit, Zelensky has attempted to mend US ties.\nIn a statement, he said of Trump: \"Despite the tough dialogue, we remain strategic partners. But we need to be honest and direct with each other to truly understand our shared goals.\"\nWhen his plane landed at Stansted, the Ukrainian leader wrote in a string of social media posts: \"It's crucial for us to have President Trump's support. He wants to end the war, but no-one wants peace more than we do.\n\"We are the ones living this war in Ukraine. It's a fight for our freedom, for our very survival.\"\nSunday's summit in London is the latest round of top-level European meetings in response to Washington's new approach to ending the war in Ukraine, which began with Russia's full-scale invasion just over three years ago.\nThe Trump administration has so far excluded Europe from preliminary talks with Russia, while the US president has been accused of parroting Russian propaganda.\nTop of the agenda on Sunday will be increasing Europe's defence capabilities as Washington steps back as well as seeking security guarantees for Ukraine from the White House as part of any peace deal.\nAhead of the last leaders' summit in Paris, Sir Keir proposed deploying British troops to Ukraine as part of a European peacekeeping force - but said this would require a US security \"backstop\".\nTrump has consistently resisted fully committing direct military support to a Ukraine peace deal, but has offered closer economic ties including a minerals deal, which he said could act as a deterrent.\nSince Friday's row, media reports from the US suggest Trump is considering cutting off aid to Ukraine altogether.\nAt the same time, European leaders have recognised the need to increase defence spending - but experts have warned the UK's military is currently not ready to take on an expanded defence role.", "url": "https://www.bbc.co.uk/news/articles/cg4k137ezlgo"}