{"authors": ["Lyse Doucet", "www.facebook.com"], "date_download": "2025-04-26 04:20:15", "date_modify": "2025-04-26 04:20:15", "date_publish": "2025-03-03 15:51:05", "description": "Concern grows after Israel said it would block aid to Gaza unless Hamas accepted a new US proposal.", "filename": "news_articles_ckgz7p85mdgo_1745641215.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3ad8/live/b22b8bb0-f838-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz7p85mdgo_1745641215.html", "title": "Israel-Hamas standoff puts Gaza ceasefire in peril", "title_page": "Israel-Hamas standoff puts Gaza ceasefire in peril  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The testing second stage of Gaza's ceasefire was always in doubt; now it seems to be dead at the moment it was meant to start.\nConcern is mounting that war will return to this ravaged territory, deepening the profound suffering of Palestinians and threatening the lives of the remaining hostages held by Hamas.\nIsrael, backed by the United States, says there is a new deal now, after the agreement's first phase ended on Saturday. And it has halted all humanitarian aid to Gaza until Hamas accepts this new version too.\n\"A flagrant violation,\" was Cairo's strongly worded response. Egypt as well as Qatar, the two Arab mediators in this process along with the US, have also accused Israel of violating international humanitarian law by \"using food as a weapon of war\".\nUnder the terms of the agreement, 600 trucks carrying vital humanitarian aid are meant to enter Gaza daily - and huge numbers crossed through the 42 days of the first phase.\nThere has also been a loud chorus of criticism from other Arab states, as well as humanitarian leaders.\nUN Secretary General António Guterres, who has arrived in Cairo for Tuesday's emergency Arab summit on rebuilding Gaza, called for the \"immediate\" resumption of assistance. He urged \"all parties to make every effort to prevent a return to hostilities\".\nUnder the agreement, which came into effect on 19 January, this is the week when Israel should be pulling its troops from the Philadelphi corridor along the Egypt-Gaza border and negotiations should intensify to end the war, return all the remaining hostages, and release more Palestinian prisoners in exchange.\nBut Israel's Prime Minister, Benjamin Netanyahu, says US envoy Steve Witkoff has come up with a new plan.\nWitkoff has not yet announced his proposal, but Netanyahu said the first stage of the ceasefire would be extended for another 50 days, to cover the Islamic holy month of Ramadan and the Jewish holiday of Passover, and to continue negotiations.\nHamas, in exchange, would immediately release half of the remaining hostages, according to Netanyahu. Israel says 59 are still being held captive and \"up to 24\" are believed to be alive.\nOn Monday Hamas denounced this sudden shift as a \"a blatant attempt [by Israel] to evade the agreement and avoid entering into negotiations for the second phase\".\nThe group regards the hostages as its most important leverage and will make every effort to hold on to them until this current confrontation ends on terms it is willing to accept.\nA day earlier, Egypt's Foreign Minister Badr Abdelatty emphasised: \"There is no alternative to the faithful and full implementation by all parties of what was signed last January.\"\nIsraeli media have published reports of an Egyptian proposal for Hamas to release three living hostages and the remains of three others in exchange for a two-week extension of the ceasefire and an Israeli pullout from the Philadelphi corridor, as well as the main north-south Salah-al-Din road.\nBut an Arab diplomat with knowledge of the talks said they had not resumed yet in Cairo, although \"technical teams are in constant discussion\".\nThere was always going to be a dangerous standoff at this point.\nPrime Minister Netanyahu's primary aim has always been to \"destroy\" Hamas's military strength and political grip.\nTheir highly choreographed ceremonies and show of force during the hostage releases has angered Israelis and underlined that, while it has been significantly weakened, Hamas is still very much in charge in Gaza.\nArab diplomatic sources say that while Hamas has accepted it will not be involved in running Gaza once this war ends, it will not dismantle what is left of its sway.\nThat is unacceptable to Israel, and to its most important ally, the US.", "url": "https://www.bbc.co.uk/news/articles/ckgz7p85mdgo"}