{"authors": ["Chris Vallance", "www.facebook.com"], "date_download": "2025-04-26 07:39:02", "date_modify": "2025-04-26 07:39:02", "date_publish": "2025-02-27 13:29:51", "description": "The prototype chip it dubs Ocelot follows similar announcements by Microsoft and Google", "filename": "news_articles_cly331r4p48o_1745653142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c2c/live/da611f00-f50e-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly331r4p48o_1745653142.html", "title": "Amazon joins quantum race with 'cat-qubit' powered chip", "title_page": "Amazon joins quantum race with 'cat-qubit' powered chip - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Amazon has become the third tech giant in as many months to announce a breakthrough in quantum computing - a technology that promises vast processing power but is beset by technical difficulties.\nThe firm has unveiled Ocelot a prototype chip built on \"cat qubit\" technology - an approach that derives its name from the famous \"Schrödinger's cat\" thought experiment.\nThe chip seeks to address one of the biggest stumbling blocks to the development of quantum computers - making them error free.\nAmazon says, taken alongside other recent breakthroughs in the industry, its work means useful quantum computers are likely to be with us sooner than previously thought.\nBut how quickly these machines will be powerful enough to be practically useful for a range of commercial applications is a matter of debate among experts.\nOskar Painter of Amazon Web Services (AWS) Center for Quantum Computing at the California Institute of Technology, where the work was carried out, told the BBC that recent progress meant an \"aggressive date\" of a decade was now \"looking more and more realistic\".\n\"Five years ago I would have said maybe 20 or 30 years\", he said but added \"this timeline's come in quite a bit.\"\nUltimately AWS, which provides cloud computing services, would like to offer quantum computing services to its customers, but Mr Painter also said he believed the advanced machines could eventually help optimise the vast global logistics of Amazon's retail business.\n\"You know, a company like Amazon, you make a one percent improvement in that and you're talking large dollars right? Quantum computers could enable you to do that more effectively, more real time - and that's the real value there,\" he explained.\nCat qubits are one attempt at solving this problem by engineering error resistance into the design of the qubits it uses.\nQubits are the fundamental elements of quantum computers, the equivalent of bits in the computers most of us use today.\nCat qubits are named in honour of Erwin Schrödinger, whose cat-in-a-box question in 1935 helped illuminate some of the thinking behind quantum theory.\nAmazon believes the new chip, external, which has just five cat qubits out of a total of 14 key components, could reduce the costs of correcting quantum errors by up to 90%, compared to current approaches.\nThe technology of cat qubits isn't exclusive to Amazon, a French company named Alice & Bob, external carried out pioneering work on the tech and continues to evolve the technology.\nMazyar Mirrahimi director of research at the French national technology research institute, Inria said Ocelot was \"an important step forward towards hardware-efficient fault-tolerant quantum computation\".\nAmazon believes the new chip offers a path to scaling up to more powerful machines with this type of error proofing built in, but researchers admit there are many challenges ahead.\nMichael Cuthbert director of the UK's National Quantum Computing Centre welcomed the progress Amazon had made but told the BBC it remained to be seen the effect it would have on the speed with which the industry is able to develop really useful quantum computers:\n\"Error correction is a vital step necessary in the long-term development of quantum computing. It is the crucial step that turns quantum computing into a practical and commercial tool we can use to solve complex problems in chemistry, materials science, medicine, logistics and energy.\"\n\"Part of the challenge is how to scale the revolutionary technology efficiently – mechanisms that enable error correction without huge overheads in chip size, energy consumption and systems complexity are really welcome.\"\nAmazon researchers have published their findings in a research paper in the scientific journal Nature, external", "url": "https://www.bbc.co.uk/news/articles/cly331r4p48o"}