{"authors": ["Leigh Boobyer", "www.facebook.com"], "date_download": "2025-04-26 08:04:31", "date_modify": "2025-04-26 08:04:31", "date_publish": "2025-02-26 15:47:37", "description": "Bristol City Council said an independent investigation will take place.", "filename": "news_articles_ce8myd3v2eyo_1745654671.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2d8a/live/9b130bc0-f373-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8myd3v2eyo_1745654671.html", "title": "Bristol: Barton House evacuation a 'mass-traumatising event'", "title_page": "Bristol: Barton House evacuation a 'mass-traumatising event' - report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The evacuation of Bristol's oldest tower block over safety fears was a \"mass-traumatising event\" for residents, health professionals have said in a report.\nMore than 250 people had to leave Barton House in November 2023 after concerns about the safety of the building in the event of a fire or explosion.\nMedact, a health justice campaign group, has published a report on the evacuation and aftermath, calling on Bristol City Council to rehome residents who still feel unsafe, and describing it as an \"exceptional case of failure and neglect\".\nThe city council has apologised to residents and promised an independent investigation.\nOn 14 November 2023, Barton House residents were told by the council to leave their homes immediately after \"major structural faults\" were discovered, and a major incident was declared.\nThe council said \"essential work\" had to be carried out, and many residents were placed in hotels before being allowed to return on 23 February 2024.\nThe council said at the time that concrete had not been attached properly when the tower was built in 1958 and it had not been constructed according to design plans.\nHowever, a structural engineer said it was three flats out of 98 which were structurally compromised.\nCommunity union ACORN set up a Barton House branch in the aftermath of the evacuation.\nIn May 2024, Bristol City Council said it was exploring several options for the future of Barton House, including demolition.\nBarton House residents and Medact representatives presented the report to Bristol city councillors on Wednesday afternoon.\nThe report, produced by doctors and other medical professionals from the city, said residents' mental and physical health suffered as a result of the evacuation and by living conditions in temporary accommodation.\nIt claims residents have had letters highlighting their concerns provided by health, social care and education professionals not considered as \"serious enough to act on by the council\".\nMedact and ACORN produced the findings after attending community meetings, and interviewing residents between 8 - 23 November 2024.\nIn total, nine households were interviewed, ranging from three to six people in each. Two further drop-in sessions were held earlier this month.\nThe report said it did not \"speak for all residents, but certainly a significant number of them\".\nThe report said: \"For some households, living in Barton House will never feel safe again no matter how many internal repairs are carried out.\n\"Adults and children are triggered by the smallest reminder of the fragility of the building – cracks in the walls, fire alarms malfunctioning, broken lifts.\n\"Many households have spent years waiting for their turn to move through the council's banding system. They have asked the council time and time again to be rehoused, but they have been ignored.\n\"The result has been generations of people forced to live in a building that they feel is a constant threat to their lives.\"\nCouncillor Barry Parsons, chair of the council's homes and housing delivery committee, apologised to residents and said an independent investigation would take place.\n\"The pace of change seems to be glacially slow and I know how upsetting that is for everyone and how angry it makes people and I'm really sorry for that,\" he said.\n\"It's clear that we need to look at the circumstances that led to the evacuation of Barton House, the wider context of it, as well as the traumatic experiences of that day and the subsequent few weeks as well.\"\nMr Parsons said he had commissioned a review of rehousing options for people affected.\n\"I was at Barton House during the evening of the evacuation and visited families who had to leave their homes in the weeks afterwards, so I saw first-hand some of the shock and distress that residents felt,\" he said.\nThe authority's priority was ensuring the health and wellbeing of all residents in council housing was supported and \"we are living up to our promise to ensure they live in safe and decent homes\".\nThe council would consider the conclusions and recommendations over the coming weeks, he added, before issuing a formal response by the end of March and \"updating residents on the actions we will take\".", "url": "https://www.bbc.co.uk/news/articles/ce8myd3v2eyo"}