{"authors": ["Harry Low", "www.facebook.com"], "date_download": "2025-04-26 03:59:05", "date_modify": "2025-04-26 03:59:05", "date_publish": "2025-03-04 06:13:40", "description": "British backpacker Okemena Sule is in a coma following a \"horrific\" motorcycle crash in Thailand.", "filename": "news_articles_cy9d02z18weo_1745639945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29ff/live/02d24450-f83e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9d02z18weo_1745639945.html", "title": "Okemena Sule: British backpacker in coma after motorbike crash", "title_page": "Okemena Sule: British backpacker in coma after motorbike crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a British backpacker who is in a coma following a \"horrific\" motorcycle crash in Thailand say that not knowing whether he has travel insurance has left them covering the cost of his medical treatment.\nOkemena Sule, 31, from east London, was injured in Koh Samui on 2 February and needs constant care costing thousands of pounds a week.\nHis brother Ibs Sule, who flew to Thailand as soon as it happened, told the BBC the family had received more than £38,000 in donations since setting up a fundraiser.\nHe said: \"I won't be leaving my brother's side because that's my little brother and I'll do everything in my power to know he's got the support and to help bring him back home.\"\nThe 33-year-old added that his younger brother had started a \"backpacking adventure\" from Bali in December, \"ticking off a bucket list of his life\" and \"seeing the beauties of the world\", arriving in Thailand at the start of January.\nSince the crash, he has had surgery for a brain injury which required part of his skull to be removed.\nHe said: \"It's just difficult to just sit there and watch and feel helpless.\n\"The fact that we're all the way on the other side of the world makes it difficult, especially for those loved ones who aren't able to come out here and be able to give that support that's needed.\n\"Our next step is to raise as much funds as we can, so that we can repatriate him back home.\"\nMr Sule said his brother's situation would be more straightforward if there was a way to easily check whether people were insured.\nHe said: \"We do believe that he may have had insurance but tracking it down is the difficult part and we've been unable to track it down - unlike your car insurance, where you could literally look on a database to see if you are insured or not.\n\"When it comes to insuring yourself as a human being or a legal entity, it's not as easy to find those details.\n\"If we could locate his insurance, and if he did have his insurance, there would be a possibility that we would have been able to repatriate him quite a long time ago.\"\nMr Sule urged anyone travelling abroad to share crucial information before departing.\nHe said: \"Speak with your family members about important things like your travel, insurance documents, life insurance, health insurance.\n\"Be very open with your loved ones and people that you trust because we're all in this together.\n\"Should anything happen in this sort of magnitude, then they're going to be the ones by your side.\"\nTravel expert Simon Calder echoed these sentiments, and said \"it's an awful situation to be in\" for a family.\nHe said: \"Some countries make it a condition of entry to have travel insurance but there is no legal obligation to take it when you leave the UK.\n\"We're in a time when more people are travelling solo than ever before, which is marvellous because you can have the most enriching experiences when you're alone and open to taking up opportunities and meeting fellow travellers and local people.\n\"But you do need to have someone at home roughly who knows what your plans are and has details of your important documents, which typically include passport, bank cards and travel insurance.\n\"The only good that could come out of this is that people are aware of what might go wrong.\"\nMr Sule remains optimistic his younger brother will make it back to the UK.\nHe said: \"My belief and my faith in God is what keeps me confident that we will bring him back and he will survive this.\n\"Please pray for my brother to survive this because the more people that pray, the more they will be answered.\"", "url": "https://www.bbc.co.uk/news/articles/cy9d02z18weo"}