{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:29", "date_modify": "2025-05-19 14:45:29", "date_publish": "2015-03-04 14:58:35", "description": "A child who died in hospital after being badly burnt in a house fire told police his dad had started the blaze, a coroner's court hears.", "filename": "news_uk-england-south-yorkshire-31732241_1747665929.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81351000/jpg/_81351273_pauldarrenjacksykes.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-south-yorkshire-31732241_1747665929.html", "title": "Penistone fire death boy blamed dad for starting blaze", "title_page": "Penistone fire death boy blamed dad for starting blaze - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A father who killed himself and his sons in a deliberate house fire was identified by one of the boys as the culprit behind the blaze.\nDarren Sykes, 44, set fire to his home in Penistone, South Yorkshire after luring Jack, 12, and brother Paul, nine, there with new a train set.\nSheffield Coroner's Court heard Jack, who later died, told doctors and police his father had set the house on fire.\nBoth boys were unlawfully killed, coroner Christopher Dorries ruled.\nMr Sykes, who had been divorced for two weeks at the time of the fire, was caught on CCTV buying petrol in portable containers from a filling station near his home in Tennyson Close on the day of the blaze.\nHe died in the fire on October 22 along with Paul.\nMonday's inquest into his death recorded a verdict of suicide.\nBefore his death, Jack was heard to say \"he did it\" to doctors and police, the inquest heard.\nClaire Sykes, the boys' mum, told the court she still carries guilt for what happened.\nShe wished she had been home earlier from work, she said, and been able to stop Jack and Paul from going to see their father.\n\"I wasn't there when they really needed me as a mum,\" she added outside court.", "url": "https://www.bbc.com/news/uk-england-south-yorkshire-31732241"}