{"authors": ["Jennifer McKiernan", "www.facebook.com"], "date_download": "2025-04-26 04:09:21", "date_modify": "2025-04-26 04:09:21", "date_publish": "2025-03-02 19:08:54", "description": "The PM announced \"a number\" of allies had signed up to his plan following the Lancaster House summit.", "filename": "news_articles_cy4vevpv14vo_1745640561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b09/live/0c677250-f821-11ef-be1d-e7df6cf5ab80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vevpv14vo_1745640561.html", "title": "Starmer announces £1.6bn missile deal for Ukraine", "title_page": "Keir Starmer announces £1.6bn missile deal for Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has announced a £1.6bn missile deal for Ukraine, following a summit of European leaders in London.\nThe prime minister also announced \"a number\" of allies had signed up to a \"coalition of the willing\", alongside France's President Emmanuel Macron, prepared to commit troops to the Ukrainian frontline in the event of a peace deal.\nUkraine's President Volodymyr Zelensky attended the meeting, where 17 European leaders and Canadian premier Justin Trudeau discussed next steps in securing peace for Ukraine.\nThe Lancaster House summit in London comes after a televised press conference from the White House, where President Trump told Zelensky he was not grateful enough for US support.\n\"My support for Ukraine is unwavering,\" said Sir Keir, adding he felt a personal responsibility to end Russia's illegal war and guarantee Ukraine \"a lasting peace based on sovereignty and security\".\n\"I am also clear that national security is economic security,\" he said. \"As well as levelling up Ukraine's air defence, this loan will make working people here in the UK better off, boosting our economy and supporting jobs in Northern Ireland and beyond.\n\"By doubling down on our support, working closely with key partners, and ensuring Ukraine has a strong voice at the table, I believe we can achieve a strong, lasting deal that delivers a permanent peace in Ukraine.\"\nSir Keir will now discuss his four-step plan with Trump, aiming to persuade the US leader to provide a security guarantee for Ukraine.\nThe PM said his coalition \"will intensify planning now, with real urgency\" and reiterated that the \"UK is prepared to back this with boots on the ground and planes in the air\".\nHe said: \"Together with others, Europe must do the heavy-lifting but to support peace in our continent and to succeed, this effort must have strong US backing. We're working with the US on this point.\"\nSpeaking to journalists after the summit, the PM said he did \"not accept that the US is an unreliable ally\", and that the discussions formed a plan that would see the US as allies.\nThe deal will allow Ukraine to use £1.6bn of export finance to buy more than 5,000 air defence missiles, which will be made in Belfast.\nSir Keir added: \"This will be vital for protecting critical infrastructure now, and strengthen Ukraine in securing the peace when it comes, because we have to learn from the mistakes of the past.\"\nThe PM referred to the Minsk ceasefire deal, made a decade ago between Putin and the then-Ukrainian President Petro Poroshenko, and violated by Putin.\nSir Keir said Ukraine must be able to negotiate peace from a position of strength, and the advanced air defence missiles would enable that.\nThe deal will also create 200 jobs in Northern Ireland and directly support a further 700 jobs in the UK, the Ministry of Defence (MOD) said, through the manufacture of more than 5,000 lightweight-multirole missiles (LMM), which will treble production at Thales factory in Belfast.\nThe LMMs are intended to protect against Russian drone and missile attacks.\nUkrainian forces are already using LMMs with an initial order delivered late last year.\nEarlier this week, the government announced defence spending will rise to 2.5% of national income by 2027 and rise again to 3% \"in the next parliament\", giving a rough deadline of 2034.\nThe government said thousands of small businesses in the UK will receive new support to ensure they benefit from the decision to increase defence spending.\nOn Monday, the government launched a new hub to provide small and medium enterprises (SMEs) with better access to the defence supply chain.\nThe Ministry of Defence will also commit to set direct SME spending targets by June this year.", "url": "https://www.bbc.co.uk/news/articles/cy4vevpv14vo"}