{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 04:04:43", "date_modify": "2025-04-26 04:04:43", "date_publish": "2025-03-03 18:24:31", "description": "The victim managed to grab John Whitfield's phone before he fled the scene.", "filename": "news_articles_c1kjv1rgredo_1745640283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/090e/live/79eefa50-f858-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjv1rgredo_1745640283.html", "title": "Man tried to rape woman playing in park with son", "title_page": "Warrington: Man tried to rape woman playing in park with son - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A sex attacker who tried to rape a woman in front of her screaming young son was caught after she fought him off and grabbed his phone as she fled.\nJohn Whitfield, 37, grabbed the woman from behind at a park in Birchwood, Warrington, and forced her into a secluded wooded area where he sexually assaulted and tried to rape her.\nCheshire Police said the woman kicked and bit Whitfield and managed to get free.\nWhitfield later admitted attempted rape, sexual assault by penetration and sexual assault and was jailed for life with a minimum-term of four years and 137 days at Liverpool Crown Court.\nThe sentence means Whitfield can only be released after the minimum prison term expires if the Parole Board concludes he no longer poses a risk, and he will remain on licence for the rest of his life.\nThe Crown Prosecution Service (CPS) said the woman was playing with her son in the early afternoon when she noticed Whitfield, who at that point was with a friend.\nHe went out of sight but returned five minutes later when he subjected her to the \"terrifying ordeal\".\nThe CPS and police both praised her \"incredible presence of mind\" in picking up Whitfield's phone, which he had dropped on the ground in the struggle.\nWhitfield noticed the device was gone and shouted \"where's my phone?\" as she fled with her son, the CPS said.\nThe victim asked another woman in the park for help who comforted her and called the police.\nThe phone was later used by police, along with witness descriptions, to identify Whitfield and he was arrested at his home in Layton Close, Birchwood, within an hour of the attack.", "url": "https://www.bbc.co.uk/news/articles/c1kjv1rgredo"}