{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:47:48", "date_modify": "2025-04-26 06:47:48", "date_publish": "2025-03-01 12:00:08", "description": "The scheme is being run during March and is promoting walking, cycling, scooting or skateboarding.", "filename": "news_articles_c0jgn1y2242o_1745650068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f31d/live/42587420-f36e-11ef-add3-5160ab1f5b9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jgn1y2242o_1745650068.html", "title": "Plymouth travel project aims to get people active", "title_page": "Plymouth travel project aims to get people active - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People in part of Devon are being encouraged to leave their cars at home and use other modes of transport throughout March.\nPlymouth City Council and cycling and walking charity Sustrans launched the Big Plymouth Travel Challenge on Saturday which asks people to log their journeys in the city using an online tool, external.\nThe scheme runs for the whole of the month and urges people to walk, cycle, skateboard or scooter to carry out their journeys.\nThe council and charity said the project aimed to boost people's health and wellbeing by getting them to be more active while also helping the environment.\nCouncillor John Stephens, the council's cycling and walking champion, said the authority was committed to improving the city's infrastructure to help people travel in different ways.\nHe added the challenge was a great chance for people to learn about how others use transport links in the city.\n\"I get it that some people might feel nervous riding a bike on a road, which is fair enough,\" Mr Stephens said.\n\"But there's an opportunity for people to understand each other's travelling needs and sometimes there's a little bit of human support that's needed.\"", "url": "https://www.bbc.co.uk/news/articles/c0jgn1y2242o"}