{"authors": ["Calum McKay and Katie Hunter", "www.facebook.com"], "date_download": "2025-04-26 04:15:21", "date_modify": "2025-04-26 04:15:21", "date_publish": "2025-03-04 10:32:50", "description": "The 38-year-old's family say the remaining cases against him should now be dropped.", "filename": "news_articles_cq5z3zw7q8no_1745640921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/791c/live/36d28420-f8e5-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5z3zw7q8no_1745640921.html", "title": "Jagtar Singh Johal acquitted in India terror case", "title_page": "Jagtar Singh Johal acquitted in India terror case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Scottish Sikh man detained in India for seven years on terror charges has been cleared in one of nine cases against him.\nJagtar Singh Johal from Dumbarton was arrested in 2017 in the country's northern Punjab region weeks after his wedding there.\nHe has been held in prison ever since, on trial for his alleged role in a series of targeted killings of religious and political figures.\nNow a verdict in the District Court in Moga, Punjab, has acquitted him of conspiracy under the country's anti-terror law and of being a member of a \"terrorist gang\".\nHis legal team say the allegations against Mr Johal in all the cases, for which he faces the death penalty, are close to identical and that the other charges should now be dismissed.\nHis brother Gurpreet Singh Johal has called on the UK government to secure the 38-year-old's release.\nHe told BBC Scotland News: \"My brother has had seven years of his life wasted in jail. The UK government needs to bring him home.\"\nA spokesperson for the Foreign, Commonwealth and Development Office (FCDO) welcomed the progress in the case.\n\"The UK government remains committed to working for faster progress on Jagtar's case, and the FCDO continue to work to support Mr Johal and his family,\" it said.\nMr Johal was accused of being a member of a terror group, the Khalistan Liberation Force (KLF), which has carried out attacks in the Punjab region.\nThe charges against him stated that he travelled to Paris in 2013 and delivered £3,000 to other KLF figures, with the money then used to purchase weapons which were used in a series of murders and attacks against Hindu nationalist and other religious leaders across 2016 and 2017.\nHis supporters say that in early November 2017, shortly after his wedding, Mr Johal was snatched from the street and driven away by plain clothes officers of the Punjab Police.\nThey say that in the days following his arrest he was tortured and coerced into signing a false confession to participation in the killings.\nHis legal representatives also say that the prosecution against him is political due to his activism documenting crimes and atrocities against Sikhs in the Punjab region in the 1980s, and that he has been the victim of an unfair legal process.\nThe Indian government denies that Mr Johal was mistreated in the custody of the Punjab Police and has said due process has been followed in the case against him.\nIt has been contacted for its response to the verdict.\nMr Johal's case has taken seven years to reach this point and has been beset by delays.\nThe court verdict in Moga marks the most significant development since it began, with a judge ruling that, in one case at least, the charges should not stand and he should be released.\nEight other terror cases remain against Mr Johal.\nThese will be heard in the courts in Delhi and are brought by the Indian government's anti-terror branch, the National Investigation Agency.\nMr Johal's legal representatives say he should now be cleared of all the charges and freed to return to his family in the UK.\nHis brother said: \"The light at the end of the tunnel is now getting brighter.\"\nThe legal team also questioned the evidence presented against him so far.\nThey said no concrete evidence had been presented against him and that the case was built on the testimony of unreliable witnesses, some of whom have given statements against him only for them to be later recanted in court.\nThey said a number of witnesses against Mr Johal were declared \"hostile\" during the proceedings after refusing to stand by the statements they gave to the police, while the prosecution failed to produce other witnesses altogether.\nSince his arrest there has been a campaign for Mr Johal's release and his case has been the subject of diplomatic discussions between the UK and Indian governments.\nIn May 2022, a UN panel of human rights experts found that his detention was arbitrary, and called for his immediate release.\nThey concluded Mr Johal was discriminated against \"owing to his status as a human rights defender and based on his political activism, religious faith and opinions,\" something his family had asserted since his arrest.\nWest Dunbartonshire MP Douglas McAllister said the case presented a \"unique opportunity to secure a resolution with the Indian authorities\" and bring Mr Johal home.\n\"Without decisive diplomatic action, he faces being imprisoned for decades while the remaining trials drag on, despite the complete lack of credible evidence against him,\" he said.\nDan Dolan, from human rights campaign group Reprieve, added: \"For Jagtar to remain imprisoned and facing a death sentence after this acquittal would be a mockery of justice.\"", "url": "https://www.bbc.co.uk/news/articles/cq5z3zw7q8no"}