{"authors": ["Jonny Manning", "www.facebook.com"], "date_download": "2025-04-26 03:57:29", "date_modify": "2025-04-26 03:57:29", "date_publish": "2025-03-04 13:56:53", "description": "Berwick Academy is being rebuilt as north Northumberland moves to a two-tier school system.", "filename": "news_articles_cr7292gdk2xo_1745639849.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e9cc/live/abdd4c10-f8e9-11ef-808b-234dabc32b78.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr7292gdk2xo_1745639849.html", "title": "Designs for new Berwick Academy released by county council", "title_page": "Designs for new Berwick Academy released by county council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Designs for a £42m school, which is set to be rebuilt as part of a reorganisation of a county's education system, have been released by a local authority.\nNorthumberland County Council has published two designs of how the new Berwick Academy might look if plans are approved later this year.\nThe academy is being rebuilt as schools in the north of the county shift from a three-tier education system, involving first, middle and high schools, to a two-tier system.\nThree middle schools will close during the overhaul, with councillor Guy Renner-Thompson saying the council would be offering support to any anxious parents.\n\"This is an absolute focus for us as we move into the next stages of the transition, and I have instructed that extra support is made available for this on top of the support schools are already getting,\" he said.\nUnder the changes Berwick, Tweedmouth and Glendale Middle Schools will close, with the council spending £8.2m on converting the existing first schools to primary schools, as well as the creation of a family and community hub in Wooler.\nParents of pupils previously raised concerns the council lacked a clear plan for the school system changes. However, the council has insisted the changes are running to schedule.", "url": "https://www.bbc.co.uk/news/articles/cr7292gdk2xo"}