{"authors": ["Danielle Andrews", "Tom MacDougall", "www.facebook.com"], "date_download": "2025-04-26 07:31:50", "date_modify": "2025-04-26 07:31:50", "date_publish": "2025-02-27 16:56:11", "description": "Move expected to keep passengers and drivers in hackney carriages safer, says council.", "filename": "news_articles_cpv44kn9ej8o_1745652710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f491/live/facc4510-f529-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv44kn9ej8o_1745652710.html", "title": "Barnsley: CCTV to become mandatory in taxis", "title_page": "Barnsley: CCTV to become mandatory in taxis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "CCTV is expected to become mandatory in licensed taxis under new plans and approval for funding.\nBarnsley Council has announced the policy for all hackney carriages operating in the town following public consultation.\nHowever, there were only 26 responses from the public to the survey.\nCouncillor Wendy Cain, cabinet spokesperson for public health and communities, said the cameras would \"enhance safety for both drivers and passengers\".\n\"These changes also support our night-time economy by encouraging more drivers to work during later hours, so residents and visitors can enjoy Barnsley's nightlife with the confidence of a safe journey home,\" Cain said.\nAs part of the new policy, all hackney carriage vehicles must display prominent signs inside the vehicle to inform passengers that CCTV is in operation, according to the Local Democracy Reporting Service.\nThe owner will be responsible for maintaining and servicing the CCTV system to ensure it is in good working condition.\nThe cameras will record footage inside the vehicle and will be operational whenever the vehicle is in use for hire.\nThe footage will be owned by the council, which will also act as the data controller for privacy purposes.\nShaun Jeffers, chairman of Barnsley's Hackney Carriage Association, called it \"a good thing\".\n\"It's something we've been pushing for, for a few years,\" he said.\nThe policy is expected to be approved at the next cabinet meeting on 5 March .\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here., external", "url": "https://www.bbc.co.uk/news/articles/cpv44kn9ej8o"}