{"authors": ["Susie Rack", "www.facebook.com"], "date_download": "2025-04-26 03:54:33", "date_modify": "2025-04-26 03:54:33", "date_publish": "2025-03-04 17:18:30", "description": "Wendy Hill is due to publish her masters thesis on Alice Elgar in The Elgar Society Journal.", "filename": "news_articles_clynxxrdlkjo_1745639673.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8828/live/54cc1350-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynxxrdlkjo_1745639673.html", "title": "Ledbury widow, 81, finds 'focus' in masters degree", "title_page": "Ledbury widow, 81, finds 'focus' in masters degree  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An 81-year-old woman, who was repeatedly mistaken as a tutor, has graduated from a university course that gave her purpose after bereavement.\nWendy Hill, from Ledbury, completed a master of research degree about Alice Elgar, the wife of world-famed composer Edward Elgar, at the University of Worcester.\nShe said: \"I loved being a student again - it gave my life a focus and, as a widow, I needed that to ground me.\"\nHer thesis is due to be published in the Elgar Society Journal, external.\nMrs Hill, who is also the chair of the West Midlands branch of the Elgar Society, felt Alice Elgar \"deserved more acknowledgement and recognition\".\nThe poetry and fiction author married Edward Elgar in 1889 and lived with him in homes around Worcester and Hereford.\nSome of her poems were set to music by the composer, but only one \"small book\" has been written about her, Mrs Hill explained.\n\"I had always been interested in Alice as so little was known and written about her,\" she said.\n\"I feel that her contribution to his creative genius has not been acknowledged properly in common with many wives, sisters, daughters and partners of creative people.\"", "url": "https://www.bbc.co.uk/news/articles/clynxxrdlkjo"}