{"authors": ["Amy Holmes", "www.facebook.com"], "date_download": "2025-04-26 06:36:40", "date_modify": "2025-04-26 06:36:40", "date_publish": "2025-02-26 06:46:43", "description": "A city council wants to build two new waste centres, but residents fear one could be detrimental to the local area.", "filename": "news_articles_c4gezp4e84lo_1745649400.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/450e/live/338ec310-f3bc-11ef-8093-8707b98f6d80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gezp4e84lo_1745649400.html", "title": "Concern over plans for Milton Keynes recycling centres", "title_page": "Concern over plans for Milton Keynes recycling centres - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners living near the site of a proposed recycling centre have put together a 1,000 signature petition calling on the council to rethink its location.\nLabour-run Milton Keynes City Council wants to shut sites in Newport Pagnell, New Bradwell and Bleak Hall and build new facilities in Wolverton and Snelshall.\nResidents near the Snelshall site say they fear it could be detrimental to the local area.\nThe council's decision has been called in by Conservative opposition councillors and will be discussed again at a meeting on 5 March.\nThe Wolverton site would be built near an existing waste recovery facility which the authority plans to convert into an eco park, while the southern site at Snelshall is due to be a purpose-built centre.\nHowever, people living in Tattenhoe Park, near to that site, have told the BBC they think the authority would be building it in the wrong place.\nMick Bannister regularly cycles through the park and called it \"a unique little place\" with \"great crested newts, rare butterflies, foxes, deer and pied and grey wagtails\".\nHe said: \"The problem with having a tip here is that it is so close to the brook, so any toxic leakages are going to end up in the brook.\"\nRory Brick said he accepted a new centre was required but \"not in an area which is so close to local schools\".\nHe was concerned the development would mean \"additional traffic, additional road noise, and additional pollution\".\nAshley Joosten said he might not have bought a house in the area \"if this was something that had a great probability of going ahead\".\nHe said he had spoken to other young families in the area and \"very few people were even aware this was an issue\".\nLisa Slade Carter claimed the last consultation on these plans was carried out in 2020 when \"this area was not built on, so there were no residents to consult with\".\nShe added: \"I cannot stress to people how beautiful Tattonhoe Valley Park is and we are so concerned this council is going to spoil it.\"", "url": "https://www.bbc.co.uk/news/articles/c4gezp4e84lo"}