{"authors": ["Sonia Kataria", "www.facebook.com"], "date_download": "2025-04-26 04:19:57", "date_modify": "2025-04-26 04:19:57", "date_publish": "2025-03-03 16:12:28", "description": "The Insolvency Service says Wesley Grainger-Smith was not entitled to take the money.", "filename": "news_articles_c743qdgy9ldo_1745641197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd9d/live/fb2cb9b0-f84c-11ef-b5bf-275f2ed479cc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c743qdgy9ldo_1745641197.html", "title": "Boss fraudulently moved £700k into casino account", "title_page": "Winthorpe: Boss fraudulently moved £700k into casino account  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A construction boss has been jailed after fraudulently taking more than £700,000 from failing companies to fund his casino gambling.\nThe Insolvency Service said Wesley Grainger-Smith transferred £702,050 from four firms into his casino gaming account between 2014 and 2017.\nThe 66-year-old, of Gainsborough Road in Winthorpe, Nottinghamshire, was sentenced to two years and four months in prison at Lincoln Crown Court on Friday.\nGrainger-Smith had admitted five counts of fraudulently removing company property at an earlier hearing.\nGrainger-Smith was not the director of any of the companies but acted in that capacity, as a consultant, to exert influence over their official directors and withdraw money with their knowledge, The Insolvency Service said.\nHe removed £230,810 from the account of a company called Eagleport Ltd and £110,250 from the Smiths Constructions Ltd.\nHe also transferred £84,600 from the bank account of Smiths Construction Services Ltd and £276,390 from Smiths Construction Specialists Ltd.\nAll four companies stopped trading soon after the removal of the funds.\nThe Insolvency Service said it discovered about £570,000 in cash deposits were paid back to the companies, which investigators believe may correlate with Grainger-Smith's claim he later repaid most of the amount from his winnings.\nGrainger-Smith was previously declared bankrupt in March 2017 and was banned as a company director for five years as a result of his misconduct at Eagleport, according to the Insolvency Service.\nHe was disqualified for a further 10 years in June 2019 for his misconduct at Smiths Construction Specialists.\nMark Stephens, chief investigator at the Insolvency Service, said: \"Wesley Grainger-Smith cannot have thought he was entitled to recklessly gamble with company money, or that he was acting in the best interests of the four companies where he said he acted as a consultant.\"", "url": "https://www.bbc.co.uk/news/articles/c743qdgy9ldo"}