{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:20", "date_modify": "2025-05-19 15:38:20", "date_publish": "2015-02-20 09:37:11", "description": "UK government finances showed a surplus of £8.8bn in January, the Office for National Statistics (ONS) has said.", "filename": "news_business-31548170_1747669100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80440000/jpg/_80440246_ek5i2wgq.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31548170_1747669100.html", "title": "UK government finances £8.8bn in surplus in January", "title_page": "UK government finances £8.8bn in surplus in January - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "UK government finances showed a surplus of £8.8bn in January, the Office for National Statistics (ONS) has said.\nIt is the highest surplus for seven years and higher than the revised £6.5bn reported for January 2014.\nA better than expected rise in tax receipts means the government is on course to meet its borrowing target for this year.\nThe surplus means borrowing has fallen to £74bn in the financial year to date, external, a fall of £6bn compared with last year.\nThe government's borrowing target for the 2015 financial year is £91.3bn.\nJanuary's public sector finance data traditionally shows a surplus, as it includes tax receipts from those who submit self-assessment forms.\nOverground, underground, George Osborne toured London trying to spread the good news.\nFrom the Tube to an Edgware building site he went, clad in hard hat and fluorescent jacket, reporters in tow.\nHe told them about economic plans, a surplus in the month of January, and high employment.\nIt was almost enough to make voters forget his unmet pledge to balance the books by now, or the national debt: set at £1.4 trillion and rising.\nHe is hoping good news, and the fear it could turn sour, will keep the Tories in government.\nLabour is busy insisting the recovery spelt out in official statistics isn't felt by ordinary families.\nIf dressing up helps win their battle for voters' attention and trust, politicians will wear as many hard hats as it takes.\nTreasury officials had expected the rise in the number of people working for themselves would mean a bigger surplus this January.\nThey said that, as a result, the government would meet its borrowing target this year, despite appearing to be on course to overshoot that target for most of 2014.\n'Milestones'\nChancellor George Osborne said: \"In a week of economic milestones, today we learn that January saw the largest monthly surplus in the public finances since the crisis, putting us on track to meet our borrowing forecasts and halve the deficit as a share of GDP this year.\"\nLabour said the figures were distorted by bonuses at the top which were delayed from last year to this year to take advantage of the top rate tax cut.\n\"These figures show George Osborne has broken his promise to balance the books by this year. This government is now set to have borrowed over £200bn more than planned, said Chris Leslie, shadow chief secretary to the Treasury.\nThe ONS said self-assessed income tax receipts were £12.3bn in January, an increase of £1.7bn, or 15.6%, compared with January 2014.\nMeanwhile, Treasury revisions to government spending showed departments spent £1.5bn less in the year to date.\nAnd other revisions, which showed an increase of £0.5bn in VAT receipts and £0.4bn in other tax receipts, all helped to reduce government borrowing.\nA £2.9bn payment to the European Commission budget, which skewed last month's borrowing figures, was reduced by £1.2bn in January to £1.7bn as part of an accounting procedure agreed with the Europe Union (EU).\nThat agreement means the £2.9bn will eventually be reduced by existing refunds and rebates from the EU down to about £850m.\nTax receipts and spending both grew in line with expectations. In the year to date, total current receipts grew by 3.1%, as against the full-year forecast of 3%.\nThe fall in global oil prices reduced tax contributions from energy companies this year. If the price of oil stays low, reduced tax receipts from energy companies will hit total receipts in the next financial year, warns the Office for Budget Responsibility.\nThe figures come in the same week that official figures showed Consumer Price Index (CPI) inflation fell to a record low of 0.3% in January, while annual wage rises excluding bonuses grew 1.7% in the three months to December as unemployment fell to 1.86 milion.\nElsewhere, the ONS said UK retail sales fell 0.3% in January from the previous month. UK High Street shops have been reducing their prices in an effort to attract customers, the figures indicate.\nAverage store prices were 3.1% cheaper than last January. This was the largest year-on-year fall since consistent records began in 1997, the ONS added.", "url": "https://www.bbc.com/news/business-31548170"}