{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:30:20", "date_modify": "2025-04-26 06:30:20", "date_publish": "2025-02-27 10:39:03", "description": "Eastney Swimming Pool in Southsea has been shut since the first Covid-19 lockdown in March 2020.", "filename": "news_articles_cd7eeezj2r7o_1745649020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/78e9/live/d42e2510-f4fa-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7eeezj2r7o_1745649020.html", "title": "Cockleshell Heroes training pool to be demolished", "title_page": "Cockleshell Heroes training pool to be demolished - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A century-old swimming pool once used to train World War Two's Cockleshell Heroes is set to be demolished.\nEastney Swimming Pool in Southsea, Portsmouth, has been closed since the first Covid-19 lockdown on 23 March 2020.\nPortsmouth City Council said the pool needed to come down as it was unsafe and at the end of its life, and work is due to start on a new pool and gym 750m (2,500ft) away costing £23.4m.\nLeader of the council, Steve Pitt, has dismissed campaigners' claims it would be cheaper to refurbish the existing pool site.\nKevin Gardner, from the Eastney Pool Redevelopment, said the site of the planned replacement pool and gym would mean \"six sports courts, trees and a grass area would be lost\".\n\"It just doesn't make sense almost twice the money to end up with fewer sports facilities,\" he continued.\nMr Pitt said the group's claims were \"not true at all\".\nHe said: \"It doesn't take much common sense to realise that if you are proposing a facility mix that is going to cost £22m to deliver, putting the same facility mix in a different location is not going to cost half the price it's going to cost the same or more, so it's not a sensible argument.\n\"I always promised that we would not knock down the building until we had certainty and planning consent that the new leisure centre at Bransbury Park was going ahead.\"\nHe said with planning permission approved in December the \"dangerous building can now be knocked down\", adding: \"It is no longer fit to be used.\"\nThe council will make a decision on knocking down the pool on 5 March - with the ground set to be left a clear level site.", "url": "https://www.bbc.co.uk/news/articles/cd7eeezj2r7o"}