{"authors": ["Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 04:13:05", "date_modify": "2025-04-26 04:13:05", "date_publish": "2025-03-04 11:55:25", "description": "Nicholas Peel was based in Newbury when he worked for Thames Valley Police but he retired last year.", "filename": "news_articles_c70erer88nlo_1745640785.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a27b/live/9f186f80-f8e6-11ef-9628-add78e51db09.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70erer88nlo_1745640785.html", "title": "Police officer misused radio and IT systems", "title_page": "Thames Valley Police officer misused radio and IT systems - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Thames Valley Police (TVP) officer used his work-issued radio to tune into other forces' channels despite being on a final written warning, a misconduct hearing heard.\nNicholas Peel, who was a police constable and based in Newbury, Berkshire, worked for the force from November 1997 until he retired in December 2024.\nChief constable Jason Hogg was told Mr Peel used his radio improperly between December 2022 and April 2023, despite being given a final two-year written warning for an unrelated matter in February 2023.\nMr Hogg found Mr Peel committed gross misconduct and he would have been sacked had he not retired.\nThe hearing also heard Mr Peel improperly accessed TVP's IT systems and hugely exceeded the data limit on his work-issued mobile phone, both while on sick leave.\nEmma Chandler, from TVP, said Mr Peel was signed off due to ill health between October 2023 and May 2024.\nBut she said from December 2023 to February 2024 he accessed a TVP IT system 146 times and changed at least four entries.\nMr Peel was also found to have accessed another system 14 times and watched clips, including dashcam and body-worn footage, which related to offences including assault, dangerous driving and assaults on police officers.", "url": "https://www.bbc.co.uk/news/articles/c70erer88nlo"}