{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:30:07", "date_modify": "2025-04-26 07:30:07", "date_publish": "2025-02-27 17:55:40", "description": "Alan Vial and Nikita Burns both deny the murder of County Tyrone man Robert Wilkin on 25 June 2023.", "filename": "news_articles_clyjj9lv5qvo_1745652607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2801/live/f49e2e50-f52f-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyjj9lv5qvo_1745652607.html", "title": "Slieve League murder trial judge tells jury to 'proceed with caution'", "title_page": "Slieve League murder trial judge tells jury to 'proceed with caution' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jurors in the trial of two people accused of the murder of 66-year-old Robert Wilkin have been warned it could be dangerous to act on some of the testimony of one of the co-accused.\nAlan Vial, 39, of Drumanoo Head, Killybegs, County Donegal, and Nikita Burns, 23, from An Charraig, County Donegal, both deny the murder of Robert Wilkin, who was also known as Robin, on 25 June 2023.\nThe body of the County Tyrone man was found in the sea at the foot of Slieve League cliffs in County Donegal in the Republic of Ireland.\nOn Thursday, Mr Justice Paul McDermott urged the jury to \"proceed with caution\" in respect of Mr Vial's evidence \"in respect of his implication of Ms Burns.\"\nDuring the trial Mr Vial claimed it was his former lover and co-accused Ms Burns who beat Mr Wilkin to death with a rock and helped put his body over Ireland's tallest cliffs.\nHe insisted he was telling the truth when he said that Ms Burns caused Mr Wilkin's death by twice striking him on the back of the head with a rock and that he did not strike him at all.\nIt is the prosecution case that Mr Vial and Ms Burns were part of a joint enterprise to cause serious harm to Mr Wilkin before putting him over the cliffs.\nMr Justice McDermott told the jury at the Central Criminal Court in Dublin that Ms Burns' statements to Gardai or others outside court cannot be used as evidence against Mr Vial.\nHowever, Mr Vial's court testimony, which was subject to cross examination by Ms Burns' lawyers, can be used as evidence against her.\nThe judge added: \"You have to proceed with caution when considering his evidence in respect of his implication of Ms Burns, because there is a danger that a co-accused, in his position, on the same charge of murder, may fabricate evidence or falsely implicate their co-accused.\"\nWhile the jury can rely on Mr Vial's testimony if they accept it, Mr Justice McDermott said it is \"dangerous to act on it\" where it is uncorroborated by other evidence.\n\"You are not precluded from acting on it,\" he said, \"but you must bear in mind the warning I have given you in respect of doing so.\"\nJurors were told where the prosecution alleges a joint enterprise murder, it must prove that both accused entered a tacit or explicit agreement to kill or cause serious injury to Mr Wilkin.\nIf they both acted in pursuit of that joint goal, the prosecution does not have to establish which of the two inflicted the fatal blows.\nHowever, if the prosecution has failed to prove the joint enterprise beyond a reasonable doubt, jurors were told, they must consider each accused's individual responsibility.", "url": "https://www.bbc.co.uk/news/articles/clyjj9lv5qvo"}