{"authors": ["Holly Phillips", "www.facebook.com"], "date_download": "2025-04-26 04:38:46", "date_modify": "2025-04-26 04:38:46", "date_publish": "2025-02-28 10:07:30", "description": "The two community diagnostic centres, costing a combined total of nearly £30m, will open in March.", "filename": "news_articles_cwyddz1lzwgo_1745642326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0106/live/ac4e16b0-f5b1-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyddz1lzwgo_1745642326.html", "title": "NHS testing centres to open in Scunthorpe and Grimsby", "title_page": "NHS testing centres to open in Scunthorpe and Grimsby - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two community diagnostic centres will open in Scunthorpe and Grimsby in March.\nThe £19.4m centre on Lindum Street, Scunthorpe, will open on 3 March and the £10m unit in Grimsby's Freshney Place shopping centre will open on 10 March.\nThey will each offer an extra 150,000 diagnostic tests a year and will help detect cancer, heart disease and respiratory issues, North East Lincolnshire Council said.\nIvan McConnell, chief strategy and partnerships officer for NHS Humber Health Partnership Group, said the centres would make a \"significant difference\" to patients.\nThe community diagnostic centres (CDCs) will offer flexible appointments in mornings, evenings and at weekends.\nDue to their locations, they will provide better accessibility with many car parking options and public transport links nearby.\nNorth Lincolnshire Council council leader Rob Waltham said the CDCs would have a \"massive impact on residents' access to critical health services\".\nNorth East Lincolnshire Council leader Philip Jackson said the addition of a health centre in Grimsby's Freshney Place would make it a \"real multipurpose location\".\nThe CDC at Freshney Place shopping centre was originally due to open last summer.\nThe announcement of its opening comes after Raac was found at the shopping centre earlier this month.\nHowever, the council said the discovery would not affect the progress of the centre's £50m transformation.\nThe CDCs were developed by the Humber and North Yorkshire Collaboration of Acute Providers (CAP) which works with NHS trusts across the region.\nWendy Scott, CAP managing director, said the two new CDCs a part of a programme of eight across the region.", "url": "https://www.bbc.co.uk/news/articles/cwyddz1lzwgo"}