{"authors": ["Adam Postans", "www.facebook.com"], "date_download": "2025-04-26 04:39:44", "date_modify": "2025-04-26 04:39:44", "date_publish": "2025-02-28 09:00:20", "description": "Ashley Tucker, 33, dragged the woman on the ground while her hands were cuffed, which a tribunal deemed \"unnecessary\".", "filename": "news_articles_clydd50pgwqo_1745642384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b741/live/ffff3180-f5a8-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clydd50pgwqo_1745642384.html", "title": "Bristol police officer who threw drunk woman to ground keeps job", "title_page": "Bristol police officer who threw drunk woman to ground keeps job - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer who threw a vulnerable drunken woman to the ground during an arrest has been allowed to keep his job.\nPC Ashley Tucker, 33, was found to have committed gross misconduct and given a final written warning which will stay on his file for five years.\nThe woman's head hit the pavement during the incident in Bristol city centre in the early hours of 16 April 2023, a tribunal panel concluded.\nThe PC denied breaching behaviour standards but, delivering the panel's decision, chairman Adrian Phillips said: \"Tucker's actions were unnecessary, disproportionate and unreasonable.\"\nMr Tucker had also denied gross misconduct, claiming during the hearing that he took action because the woman, Miss A, had kicked a council bin, shouted and he feared she was a threat to the public.\nHowever, Mr Phillips said: \"Miss A wasn't posing a risk to anyone else and this would have been apparent to PC Tucker.\"\nMr Phillips said Mr Tucker dragged her on the ground while her hands were cuffed behind her back, which was \"unnecessary\".\nIt could not be determined if the bruising she suffered to her head was due to the incident or from an earlier fall while intoxicated.\nBarrister Mark Ley-Morgan, representing the force, said: \"It's more by luck than judgement that what the officer did didn't result in a serious injury.\"\nMr Ley-Morgan added that members of the public who were watching the incident were \"distinctly unimpressed\".\n\"It undermines confidence in the police service,\" he added.", "url": "https://www.bbc.co.uk/news/articles/clydd50pgwqo"}