{"authors": ["David Mercer", "www.facebook.com"], "date_download": "2025-04-26 06:48:15", "date_modify": "2025-04-26 06:48:15", "date_publish": "2025-03-01 11:36:13", "description": "The Ukrainian president thanks European leaders for their support after a flurry of messages on social media.", "filename": "news_articles_cz9n5jq42pdo_1745650095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7de4/live/014a0de0-f6a2-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9n5jq42pdo_1745650095.html", "title": "European leaders rally behind Zelensky after Trump clash", "title_page": "European leaders rally behind Zelensky after Trump clash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "European leaders have rallied behind Volodymyr Zelensky after Donald Trump's furious exchange with the Ukrainian president in the White House.\nThe leaders of Germany, France, Spain, Poland and the Netherlands were among those who posted social media messages backing Ukraine - with Zelensky responding directly to each one to thank them for their support.\nThe Ukrainian president has arrived in London to attend a summit hosted by UK Prime Minister Sir Keir Starmer who \"retains unwavering support for Ukraine\", Downing Street said.\nIt comes after extraordinary scenes in the Oval Office on Friday as US President Trump clashed with Zelensky, telling him to make a deal with Russia \"or we are out\".\nAt one point, Trump told Zelensky he was not thankful enough for US military and political support during Ukraine's fight against Russia's invasion, and that he was \"gambling with World War Three\".\nAs a flurry of supportive messages for Ukraine were posted by European leaders following the row - along with posts from the prime ministers of Canada, Australia and New Zealand - Zelensky replied to each one: \"Thank you for your support.\"\nFrench President Emmanuel Macron posted: \"There is an aggressor: Russia. There is a victim: Ukraine. We were right to help Ukraine and sanction Russia three years ago - and to keep doing so.\"\nDutch Prime Minister Dick Schoof said the Netherlands supports Ukraine \"now more than ever\", adding: \"We want a lasting peace and an end to the war of aggression started by Russia. For Ukraine and its people, and for Europe.\"\nGermany's outgoing Chancellor Olaf Scholz wrote that \"no one wants peace more than the citizens of Ukraine\", with his replacement-in-waiting Friedrich Merz adding that \"we stand with Ukraine\" and \"we must never confuse aggressor and victim in this terrible war\".\nGermany's foreign minister Annalena Baerbock said the \"unspeakable\" row resembled a \"bad dream\" and \"underlined that a new age of infamy has begun\".\nShe said she would \"wholeheartedly push\" for measures that could help Ukraine \"withstand Russia's aggression even if the US withdraws support, so that it can achieve a just peace and not a capitulation\".\nSpanish Prime Minister Pedro Sanchez said: \"Ukraine, Spain stands with you,\" while his Polish counterpart Donald Tusk wrote: \"Dear [Zelensky], dear Ukrainian friends, you are not alone.\"\nCanadian Prime Minister Justin Trudeau said Canada \"will continue to stand with Ukraine and Ukrainians in achieving a just and lasting peace\".\nAustralian Prime Minister Anthony Albanese posted that his country had \"proudly supported the brave people of Ukraine in their struggle to defend their sovereignty against the brutality of Russian aggression and in support of international law\".\nEuropean Union chiefs Antonio Costa and Ursula von der Leyen assured Zelensky in a joint statement that he was \"never alone\".\n\"We will continue working with you for a just and lasting peace,\" they said.\nThere were also supportive messages for Ukraine from political leaders in Austria, Belgium, Croatia, Denmark, Estonia, Finland, Ireland, Latvia, Lithuania, Luxembourg, Moldova, Romania, Sweden and Slovenia.\nHowever, Hungarian Prime Minister Viktor Orban voiced his support for Trump, writing: \"Strong men make peace, weak men make war. Today President @realDonaldTrump stood bravely for peace. Even if it was difficult for many to digest. Thank you, Mr President!\"\nOn Saturday, Nato Secretary General Mark Rutte told the BBC he had spoken with Zelensky twice following the White House meeting.\nHe said he was \"not at liberty to say what was discussed\" but shared that he told Zelensky \"we have to respect\" what Trump has done for Ukraine so far.\nHe said Zelensky must \"find a way\" to restore his relationship with his US counterpart.\nZelensky left the White House early following his row with Trump - but afterwards thanked the US president on social media for his support, saying: \"Ukraine needs just and lasting peace, and we are working exactly for that.\"\nWriting on messenger app Telegram on Saturday, Zelensky said it was \"very important for us that Ukraine is heard and that no one forgets about it, neither during the war nor after\".\n\"It is important for people in Ukraine to know that they are not alone, that their interests are represented in every country, in every corner of the world,\" he added.\nIn an interview with Fox News following his White House visit, Zelensky said his row with Trump was \"not good for both sides\" but he thought the relationship could be salvaged.\nThe pair interrupted each other repeatedly in front of the media during what was supposed to be a prelude to the two leaders signing an agreement that would give the US access to Ukraine's deposits of rare earth minerals.", "url": "https://www.bbc.co.uk/news/articles/cz9n5jq42pdo"}