{"authors": ["Mike Wendling", "www.facebook.com"], "date_download": "2025-04-26 03:38:24", "date_modify": "2025-04-26 03:38:24", "date_publish": "2025-03-04 23:28:31", "description": "BlackRock will buy two ports after Trump's interest in taking back control of the key shipping route.", "filename": "news_articles_clyzlk259g2o_1745638704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ec34/live/66a26480-f93b-11ef-95fb-d138264a2044.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyzlk259g2o_1745638704.html", "title": "Hong Kong billionaire to sell Panama Canal ports to US firm", "title_page": "Hong Kong billionaire to sell Panama Canal ports to US firm - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Hong Kong-based company has agreed to sell most of its stake in two key ports on the Panama Canal to a group led by US investment firm BlackRock.\nThe sale comes after weeks of complaining by President Donald Trump that the canal is under Chinese control and that the US should take control of the major shipping route.\nThrough a subsidiary, CK Hutchison Holding operates ports at the Atlantic Ocean and Pacific Ocean entrances to the canal.\nIt said Tuesday that it would sell its interests as part of a deal worth $22.8bn (£17.8bn).\nCK Hutchison, founded by Hong Kong billionaire Li Ka-shing, is not owned by the Chinese government. But its base in Hong Kong means it operates under Chinese financial laws. It has operated the ports since 1997.\nThe deal includes a total of 43 ports in 23 countries around the world, including the two canal terminals. It will require approval by the Panamanian government.\nThe 51-mile (82km) Panama Canal cuts across the central American nation and is the main link between the Atlantic and Pacific oceans.\nUp to 14,000 ships travel through it each year, including container ships carrying cars, natural gas and other goods, and military vessels.\nIt was built in the early 1900s. The US maintained control over the canal zone until 1977, when treaties gradually ceded the land back to Panama.\nAfter a period of joint control, Panama took sole control in 1999.\nTrump has made several arguments for retaking control of the canal and the surrounding area. He argued that Chinese influence is a national security threat, that the US investment in the initial building of the canal justifies taking back control, and that US ships are charged too much for using the waterway.\nIn a visit to Panama in February, US Secretary of State Marco Rubio demanded that the country make \"immediate changes\" to what he calls the \"influence and control\" of China over the canal.\nPanama rejected the US government claims and President Jose Raul Mulino has said the canal \"is and will remain\" in the central American country's hands.\nIn a statement announcing the business deal, Frank Sixt, co-managing director of CK Hutchison, said: \"I would like to stress that the transaction is purely commercial in nature and wholly unrelated to recent political news reports concerning the Panama Ports.\"\nBlackRock is one of the world's largest asset management companies. The group buying the ports also includes Terminal Investment Limited, a Swiss company.", "url": "https://www.bbc.co.uk/news/articles/clyzlk259g2o"}