{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:58:15", "date_modify": "2025-05-19 14:58:15", "date_publish": "2015-02-21 13:06:56", "description": "A 20-year-old north Belfast man who fell asleep on a bus he allegedly tried to steal is described as \"a danger to himself and others\".", "filename": "news_uk-northern-ireland-31566135_1747666695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81149000/jpg/_81149730_lagansidecourts.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31566135_1747666695.html", "title": "Belfast man Joseph McMahon 'passed out while trying to steal bus'", "title_page": "Belfast man Joseph McMahon 'passed out while trying to steal bus' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A 20-year-old north Belfast man who fell asleep on a bus he allegedly tried to steal has been refused bail.\nJoseph McMahon, from the Antrim Road, is charged with trying to steal a double decker bus.\nHe is also accused of stealing two mobile phones from a shop, causing criminal damage to a phone, and possessing cannabis.\nAll the alleged offences took place on 19 February.\nHe is further charged with disorderly behaviour at the Royal Victoria Hospital the following day.\nA detective constable told Belfast Magistrates Court that with 128 convictions, along with drink and drug addictions, Mr McMahon \"appears to have no concern for the consequences of his actions, so is a danger to both himself and others\".\n\"He passed out on the bus he attempted to steal, so given the circumstances, it's alarming to think about the consequences that may have ensued if he had managed to steal the bus,\" the detective said.\nHe also said Mr McMahon had numerous breaches of bail and court orders, adding that he was currently under two suspended jail terms for burglary and theft and was only released from custody last month.\nMr McMahon's solicitor said he had instructed her that he would abide by any bail conditions set by the court, but a judge told the solicitor it was \"very difficult for me to say that there's any chance of him keeping to conditions\".\nThe accused is due back before the court via videolink on 20 March.", "url": "https://www.bbc.com/news/uk-northern-ireland-31566135"}