{"authors": ["David Spereall", "Emma Glasbey", "www.facebook.com"], "date_download": "2025-04-26 03:52:25", "date_modify": "2025-04-26 03:52:25", "date_publish": "2025-03-03 10:22:15", "description": "Sharaz Ali is charged in connection with a house fire that left a mother and her three children dead.", "filename": "news_articles_c62zv60mnego_1745639545.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f8f1/live/cf8e4070-f816-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zv60mnego_1745639545.html", "title": "Third man charged with murder after Bradford house fire in 2024", "title_page": "Third man charged with murder after Bradford house fire in 2024 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A third man has appeared in court charged with murder following a house fire which killed a mother and her three children.\nBryonie Gawith, 29, Denisty Birtle, nine, Oscar Birtle, five, and 22-month-old Aubree Birtle died following the blaze at their home on Westbury Road, Bradford, on 21 August last year.\nSharaz Ali, 39, who was seriously injured in the same fire and subsequently spent time in a coma, has been charged with four counts of murder.\nMr Ali appeared before Bradford magistrates via video link from a hospital bed on Monday morning and about an hour later he appeared before Bradford Crown Court.\nThe court heard the chief medical officer at the hospital where Ali is being treated had said he \"would not be physically fit to sit in a courtroom at this present time\".\nIt was added, however, that there was a \"realistic expectation that physically he would be fit to take part in a trial process in the coming six to nine months\".\nA prosecutor had earlier told Bradford Magistrates' Court that Antonia Gawith had recently ended her seven-year relationship with the defendant and had been staying with her sister on Westbury Road.\nThe court heard that Sharaz Ali was pulled out of the house by the first police officer on the scene but no-one could be rescued from upstairs as the fire was at the foot of the stairwell.", "url": "https://www.bbc.co.uk/news/articles/c62zv60mnego"}