{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:30", "date_modify": "2025-05-19 15:17:30", "date_publish": "2015-03-03 13:49:54", "description": "Iran rejects as \"excessive and illogical\" a demand by US President Obama that it freeze sensitive nuclear activity for at least 10 years.", "filename": "news_world-middle-east-31713824_1747667850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81370000/jpg/_81370332_arak_ap.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31713824_1747667850.html", "title": "Iran rejects Obama nuclear call before Netanyahu speech", "title_page": "Iran rejects Obama nuclear call before Netanyahu speech - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iran has rejected as \"excessive and illogical\" a demand by US President Barack Obama that it freeze sensitive nuclear activity for at least 10 years.\nIranian Foreign Minister Javad Zarif was quoted saying Mr Obama spoke in \"unacceptable and threatening\" terms.\nMr Zarif said talks on Iran's nuclear programme, which are nearing a critical 31 March deadline, would continue.\nIsraeli Prime Minister Benjamin Netanyahu is expected to urge the US Congress on Tuesday to oppose a deal.\nHe was invited to speak at the US Capitol by Republican House Speaker John Boehner, angering Democrats.\nMr Netanyahu - who faces domestic elections in two weeks' time - will not meet Mr Obama during his visit to the US.\nIn his interview with Reuters news agency, external, the US president said disagreements over Iran would not be \"permanently destructive\" to the US-Israel relationship.\nBut Mr Netanyahu had been wrong on Iran before when he opposed an interim nuclear agreement struck last year, Mr Obama said.\nMr Obama also said Iran should agree to freeze sensitive nuclear activity if it wants to strike a deal with the US. However, he said, the odds were against talks with Iran ending in agreement.\nIn a response quoted by Iran's semi-official Fars news agency, Mr Zarif said his country would \"not accept excessive and illogical demands\".\nHe added that Mr Obama's comments were aimed at public opinion in the US, and intended as a counter to the \"propaganda\" of those who opposed the negotiations - including Israel's prime minister.\nUS Secretary of State John Kerry met Mr Zarif in Switzerland on Tuesday, as part of ongoing talks ahead of a 31 March deadline for a framework agreement. The aim is then to secure a final deal by 30 June.\nIn remarks to reporters after the meeting, Mr Zarif emphasised both sides were committed to reaching a deal.\n\"There is a seriousness that we need to move forward,\" he said. \"We need the necessary political will to understand that the only way to move forward is through negotiations.\"\nThe US, UK, France, Germany, Russia and China are seeking to reach agreement to curtail Iran's nuclear programme in exchange for sanctions relief.\nThey are trying to address concerns that Iran is seeking nuclear weapons technology, something Tehran denies.\nThe Israelis say any agreement that leaves Iran with the potential to use a peaceful civilian nuclear programme for military means, now or in the future, is unacceptable.\nThe leading Republican and Democrat on the House foreign relations committee have sent a letter to Mr Obama highlighting their concerns about a deal.\nThey said Congress must be convinced that any pathway Iran might have to developing a nuclear weapon is shut off before Congress considers easing sanctions.", "url": "https://www.bbc.com/news/world-middle-east-31713824"}