{"authors": ["Leonardo Rocha", "Jaroslav Lukiv", "www.facebook.com"], "date_download": "2025-04-26 06:13:25", "date_modify": "2025-04-26 06:13:25", "date_publish": "2025-03-02 05:04:04", "description": "Officials say several gang members have been killed in a major police operation in Port-au-Prince.", "filename": "news_articles_c78ejpvdlezo_1745648005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3b9c/live/e81d1d80-f719-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ejpvdlezo_1745648005.html", "title": "Haiti police raid gang leader Barbecue's stronghold in capital", "title_page": "Haiti police raid gang leader Barbecue's stronghold in capital - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The government of Haiti says police have launched a large-scale operation in a shantytown controlled by powerful gang leader Jimmy Chérizier, who is widely known as Barbecue.\nThe authorities say several gang members have been killed in the Lower Delmas area of the capital Port-au-Prince.\nLocal reports say military drones carrying explosives are being used in the operation.\nPrime Minister Alix Didier Fils-Aimé praised the assault. He said it was the work of a special task force created two days ago to tackle insecurity.\nChérizier, aged 47, is the feared leader of Viv Ansam (Live Together), a coalition of gangs that control much of the city.\nIt is not clear whether Kenyan police officers deployed in Haiti last year to help fight the gangs are involved in the security operation.\nLast week, a Kenyan police officer - who was on patrol with the Kenyan-led Multinational Security Support mission - was killed in a confrontation with gang members.\nThe men fighting gang leader Barbecue for power in Haiti\nOn patrol with Kenyan forces inside Haiti's gang warzone\nGang control in Port-au-Prince has led to an almost complete breakdown of law and order, the collapse of health services and emergence of a food security crisis.\nMore than 5,500 people were killed in gang-related violence in the Caribbean nation in 2024 and more than a million people have fled their homes.\nHaiti's transitional presidential council, the body created to re-establish democratic order, has made little progress towards organising long-delayed elections.", "url": "https://www.bbc.co.uk/news/articles/c78ejpvdlezo"}