{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:34:14", "date_modify": "2025-05-21 05:34:14", "date_publish": "2025-01-05 00:00:00", "description": "A review of what happened across the region on Monday after heavy weekend snow.", "filename": "news_live_cly7xpgn8nkt_1747805654.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cly7xpgn8nkt_1747805654.html", "title": "As it happened: Yorkshire hit by snow and ice", "title_page": "As it happened: Yorkshire hit by snow and ice - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We are ending our live coverage\nTim Dale\nBBC News, Yorkshire\nWe are closing our live page coverage for the day after the Met Office warning for snow and ice expired at midday.\nYorkshire saw heavy snowfall over the weekend causing widespread disruption, with Leeds Bradford Airport still warning of delays after its runway was closed for six hours on Sunday.\nThe weather also resulted in delays and cancellations to bus services across West and South Yorkshire and a large number of schools either closed or chose to open later.\nA number of flood warnings have also been issued in North, South and West Yorkshire - the latest information on flood warnings is available here, external.\nBBC weather forecast for Yorkshire - what's the latest?\nKeeley Donovan\nWeather presenter, BBC Look North\nMuch of the rain, sleet and snow that we saw this morning has eased, leaving behind a lot of cloud.\nThis cloud may lead to a few more wintry showers in places and it will become quite windy as the days goes on.\nThrough this evening and overnight we may see some further wintry showers, particularly across the Peak District.\nElsewhere there's a good deal of clear weather developing, but that means a widespread, and in places sharp, frost tomorrow morning.\nEarlier flood meant more problems for city staff\nRachel Russell\nBBC News, Yorkshire\nCouncil workers in York have been busy over the weekend - not just dealing with snow, but also dealing with the after effects of last week's localised flooding\nJames Gilchrist, director of Environment, Transport and Planning, at York City Council, said their recovery teams had spent the weekend responding to recent flooding, as well as gritting main routes, and clearing city centre footpaths.\nHe said flooding caused by Storm Darragh had left a layer of silt and mud behind, which had made riverside paths dangerous and prevented a lot of gritting operations.\nHe added: “We would like to thank our teams who are working hard to get the city moving again following the recent flooding and bad weather.”\nMeanwhile, the council said it is currently unable to clear Marygate in York until the Environment Agency remove their sandbags, which they added should be today.\nAnd St George’s Field Coach and Car Park also remain closed until silt can be moved.\nThe view from Leeds Bradford Airport\nThis is the view from Leeds Bradford Airport this morning.\nThe airport's runway was closed for six hours on Sunday following heavy snow.\nElla Sugden, who took the above photo, said she waited at the airport for nine hours yesterday.\nShe's hoping to board her flight to Faro later this morning.\nGritters rely on salt from beneath the North Sea\nNorth Yorkshire Council says it gritted all its priority routes across the weekend to try and keep the county moving.\nKeane Duncan, the councillor responsible for highways, says the area saw between 20 and 25cm (9.8in) of snow in some parts, principally in the west.\nThe salt used on the country's roads comes from only two places in England and one of those is the ICL Boulby Mine, near the seaside village of Staithes.\nA mile under the North Sea, they extract more than 350,000 tonnes of rock salt each year which is good news as about 215,000 tonnes of salt is used on average each winter on motorways and major A-roads, according to National Highways.\nYou can learn more about the work to extract that essential rock salt here.\nRoad warning in the Yorkshire Dales\nTim Dale\nBBC News, Yorkshire\nThe owner of tourist attraction Stump Cross Caverns, near Pateley Bridge,has warned people not to try and drive in the area.\nLisa Bowerman says people are turning around on the B6265 due to stranded vehicles.\n\"We’ve had loads of snow up here and whilst your car may be OK in the snow, it’s the vehicles that get into trouble that then block the road.\"\n\"I hope everyone stays safe out there it’s freezing and not good under foot,\" she adds.\nExotic birds escape damaged penguin enclosure\nEmily Johnson\nBBC News, Yorkshire\nExotic birds have escaped a penguin aviary in West Yorkshire, after it suffered damage in the snow.\nLotherton Hall, near Aberford, posted an urgent appeal on their social media page to find the Inca terns, which are generally found in the wild along South America's Pacific coast.\nA spokesperson said: \"Our penguin aviary suffered damage during last evening's snowfall and our beautiful Inca terns, who live with our penguins, decided it would be a good opportunity to explore the local area.\"\nThey asked anyone who spotted the creatures to get in touch, external.\nBus problems in South Yorkshire\nThere are widespread problems for bus users in South Yorkshire this morning.\nIt appears to be an evolving situation, so do check with your local operator for more detail.\nOperator Stagecoach appears to have suspended operations, external from depots in Barnsley, Rotherham and Sheffield due to ongoing problems with snow.\nYou can find more from Travel South Yorkshire on disruptions here, external.\nSchool closures in North Yorkshire\nTim Dale\nBBC News, Yorkshire\nNorth Yorkshire Council say a number of schools have informed it they are closing due to the weather conditions.\nThe authority adds it is the individual school which makes the decision to close and all have arrangements to ensure parents and carers are informed about a closure as soon as possible.\nCurrently the council is aware of 11 schools closing, the majority in the west of the county.\nA full list can be found on the council's website, external.\nMore than 100 schools close fully or partially in Bradford\nTim Dale\nBBC News, Yorkshire\nMore than 100 schools in Bradford will be closed or partially closed today.\nThe closures are due to the adverse weather conditions and to ensure the safety of staff and pupils.\nA number of schools have decided to open, but have delayed their start time to allow staff and children more time to make their way in.\nA list of schools affected is available on Bradford Council's website, external and the authority says parents should receive text updates from their child's school on any changes.\nStation closed due to flooding\nRotherham Central railway station is currently closed due to flooding.\nNorthern say they expect it to open sometime after 11:45 this morning.\nA spokesperson says services will run via a diversion line to avoid Rotherham station.\nThose wanting to travel to Rotherham should continue to Meadowhall where a rail replacement service will operate.\n\"This will be operated by a 16-seat vehicles from Elite Travel starting at 07:15. Journey times may be extended by up to 30 minutes whilst travelling by rail replacement transport,\" the spokesperson adds.", "url": "https://www.bbc.com/news/live/cly7xpgn8nkt"}