{"authors": ["Paul Pigott", "www.facebook.com"], "date_download": "2025-04-26 08:12:57", "date_modify": "2025-04-26 08:12:57", "date_publish": "2025-02-26 11:41:26", "description": "The prize-winning Dalmatian-cross is banned from Crufts over tail amputation due to excessive wagging.", "filename": "news_articles_cpwdxpvrpj1o_1745655177.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d716/live/388e48a0-f429-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpwdxpvrpj1o_1745655177.html", "title": "Crufts: Welsh show dog banned over medically docked tail", "title_page": "Crufts: Welsh show dog banned over medically docked tail - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A dog owner says she is \"gutted\" after her prized pooch made the Welsh team for Crufts 2025, but was then was banned from the competition because part of her tail had been removed for medical reasons.\nDalmatian vizsla cross Gwen, three, has happy tail syndrome, which means she wagged her tail so vigorously it caused breaks and a wound that would not heal.\nHer owner, nurse Sophie Scott-Thomas, 32, from Merthyr Tydfil, had Gwen's tail amputated on welfare grounds following advice from a veterinarian.\nBut the Kennel Club, which runs Crufts, said animal welfare rules mean even dogs with a \"medically docked tail\" cannot compete at events with admission fees.\n\"We were absolutely gutted, obviously there's so much work that goes into training,\" she told BBC Radio Wales Breakfast.\nCutting away part or all of the dog's tail or ears for cosmetic reasons is illegal in the UK, unless carried out by a vet for medical reasons.\nMs Scott-Thomas said the tail wagging started when Gwen was about one.\n\"She wagged her tail so vigorously if it hit anything it caused damage,\" she explained.\nShe broke two bones in her tail.\n\"Then she had a wound at the end of her tail that just wouldn't heal because she was continuously wagging so the wound just didn't have time to heal.\"\nThey tried bandages, she said, \"but it was futile. Nothing would heal\".\n\"We spent a long time back and forth to the vets until eventually she was in so much pain,\" she said.\n\"She'd cry, yelp… as soon as she made a fuss there'd be blood everywhere.\n\"The vet came to the conclusion that the best thing we could do for her welfare and quality of life would be to take the tail away.\"\nThat was when Gwen was two. Within a year she was taking top ribbons at dog shows in Wales, making the Welsh team set to compete at Crufts in Birmingham in March.\nBut then Ms Scott-Thomas got a call from the show saying Gwen could not compete because her tail was docked.\nShe argued that Gwen's tail was not docked, but legally amputated by a veterinarian.\nShe said she was told there are no exceptions under rules set out by Department for Environment Food and Rural Affairs (Defra).\nShe has since started a petition, external asking for an exemption that would allow dogs like Gwen, whose tails have been amputated for medical reasons, to compete.\n\"They should be assessed as an individual rather than a blanket ban, which it is at the moment,\" she said.\nThe Kennel Club said: \"We are aware of this situation, but in accordance with the Animal Welfare Act 2006, a dog with a medically docked tail cannot be shown at events in England and Wales where the public pay admission fees.", "url": "https://www.bbc.co.uk/news/articles/cpwdxpvrpj1o"}