{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:15:17", "date_modify": "2025-04-26 04:15:17", "date_publish": "2025-03-04 10:36:35", "description": "Councillors go against officer advice to oppose one of the biggest schemes ever proposed in the Borders.", "filename": "news_articles_c86p12jjd32o_1745640917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d410/live/f4f587c0-f83d-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86p12jjd32o_1745640917.html", "title": "Wind farm near Hawick heads to inquiry after council objects", "title_page": "Wind farm near Hawick heads to inquiry after council objects - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bid to construct one of the biggest wind farms ever built in the Borders will go to a public inquiry after councillors decided to oppose the plans.\nCouncil officials had recommended that the local authority did not object to Muirhall Energy's 52-turbine scheme near Hawick.\nHowever, Scottish Borders Council's planning committee voted by five to three to oppose the Teviot wind farm project.\nIt will trigger a public inquiry into the proposals before they can get the go ahead.\nOfficials made their recommendation after the company made \"significant changes\" - including reducing turbine numbers.\nThey said it should result in reduced visibility of the development.\nIf councillors had offered no objection to the application it would have gone straight to the Scottish government's Energy Consents Unit.\nNow it will be considered by a reporter via a public inquiry.\nConcerns were raised over the adverse visual impact of the turbines - with maximum tip heights of up to 240m (790ft) - particularly on Hermitage Castle.\nMarshall Douglas, who represents Tweeddale East for the SNP, said: \"The scale of this development is far bigger than anything we have at the moment.\n\"The scale of these turbines is absolutely incredible.\n\"I have great concerns and I would be minded to go against this application.\"\nHis view was echoed by Neil Richards, Conservative councillor for Hawick and Denholm, who described the application as \"vandalism in the hills\", the local democracy reporting service reports.\nThe developers said the wind farm would make a substantial contribution towards net zero energy targets.\nThey also said it could be worth millions of pounds each year to the local economy and provide up to 29 jobs in the region.\nKirstin Leckie, senior project manager with Muirhall Energy, said the company had \"worked closely\" with the community and planners to take their views on board in the design of the scheme.\n\"As a result of the feedback we received we have removed the planned solar element of the project and reduced the number of turbines by 10, significantly reducing the visual impacts of the project,\" she said.\n\"We are disappointed by the decision of the planning committee to object to the project, which goes against the recommendation of the planning officer, but retain confidence in our plans due to the significant efforts we have gone to to make these changes.\n\"This project will bring significant environmental, economic and community benefits to the local area, which now moves forward to the Scottish government for consideration.\"", "url": "https://www.bbc.co.uk/news/articles/c86p12jjd32o"}