{"authors": ["Shivani Chaudhari", "www.facebook.com"], "date_download": "2025-04-26 06:54:26", "date_modify": "2025-04-26 06:54:26", "date_publish": "2025-02-28 16:02:18", "description": "Joshua Lloyd is jailed for sex offences and also for drug dealing.", "filename": "news_articles_c8rkk61e5vko_1745650466.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bbdd/live/91f7af00-f5bc-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkk61e5vko_1745650466.html", "title": "Northampton drug dealer jailed for sexually abuse of girl, aged 13", "title_page": "Northampton drug dealer jailed for sexually abuse of girl, aged 13 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A drug dealer who has been jailed for sexually abusing a 13-year-old was found hiding behind a shower curtain at her home.\nJoshua Lloyd, 20, has been handed a three-and-a-half year jail term after admitting one count of being an adult engaged in penetrative sexual activity sex with a girl.\nLloyd, formerly of Fir Tree Walk, Northampton, also pleaded guilty to two counts of possession with intent to supply Class A drugs.\nHe has been put on the Sex Offenders' Register for life as well as being barred from working in regulated activity related to children.\nNorthamptonshire Police said the force started an investigation in 2023 after reports of sexual abuse.\nOfficers went to the 13-year-old girl's home where Lloyd was arrested after being found hiding behind a shower curtain.\nIn May 2024 while the investigation was ongoing, police said they found 11 wraps of heroin and 47 of crack cocaine, along with cash, after Lloyd was stopped on Goldings Road, Northampton.\nPolice said he told them he intending to sell them.\nSpeaking after the sentencing at Northampton Crown Court last month, Det Con Laura Beeby said: \"Joshua Lloyd was 19 when he met this child, and despite knowing her age, he pursued a sexual relationship with her.\n\"I'm glad that Lloyd at least admitted his guilt.\n\"Once he is released from prison Lloyd will be subject to stringent conditions and will be closely monitored for the rest of his life.\n\"If he breaks any of the conditions he has to abide by, he can expect a swift return to prison.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkk61e5vko"}