{"authors": ["Nick Robinson", "www.facebook.com"], "date_download": "2025-04-26 03:46:24", "date_modify": "2025-04-26 03:46:24", "date_publish": "2025-03-05 06:00:05", "description": "The former prime minister examines his time in Downing Street, with the BBC's Nick Robinson for Political Thinking.", "filename": "news_articles_cy9dxxgjx4do_1745639184.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b21/live/61649f90-f9a1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dxxgjx4do_1745639184.html", "title": "Stop the Boats slogan was too stark, Rishi Sunak tells BBC", "title_page": "Stop the Boats slogan was too stark, Rishi Sunak tells BBC - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There is one phrase, one slogan, one promise which is associated with former Prime Minister Rishi Sunak more than any other.\nIt is \"Stop the Boats\".\nYet, in his first wide-ranging interview since leaving Downing Street, the former prime minister says he regrets ever saying it because it was \"too stark..too binary\".\nAnd he concedes that it couldn't actually be delivered.\nThis is just one of the \"lessons from Downing Street\" which the man who presided over the worst ever election defeat for the Conservative Party says he's learned, in a conversation lasting more than two hours for my Political Thinking podcast.\nIt covers not only the mistakes he thinks he made, but also the disagreements about the right way to manage the economy that he had with Boris Johnson; the radical ideas he wishes he could've implemented; the lessons he learned from being chancellor during the Covid pandemic - and his attitudes to race and faith and Englishness as the first British Asian prime minister.\nSunak is in reflective mood talking about a job he was catapulted into, saying he didn't \"probably have the time to enjoy it in the moment or appreciate it in the moment because of the context in which I was doing it.\"\nThat context was not just an economic crisis but a political one.\nThe Tories were on their third leader in just 50 days, and there'd been no election of party members or the wider public.\n\"I didn't have a mandate,\" he says, and defends his approach of trying to bring warring factions together.\nTo do otherwise, he says, \"would have been a huge gamble because the thing just could have collapsed. And would that have been good for the country? I don't think so. I think what the country needed was stability.\"\nHe's not changed his mind about wanting to deport migrants who cross the channel to Rwanda, and says he now backs leaving the European Convention on Human Rights (ECHR), if it's not reformed.\nHe says the court has \"taken on new powers. There's been mission creep...It does need to reform or we should leave.\"\nWhen I asked him if he had taken his eye off the ball in regards to soaring levels of net migration, he concedes that although he \"took very strong action to bring the levels of legal migration down…I should have done them sooner\".\nSunak was in many ways an accidental prime minister. It was October 2022, and he learned that Liz Truss had survived in the job for less time than that famous lettuce, whilst having a meal with his two daughters at TGI's in Teesside after a game of bowling.\nFour days later, he walked into Number 10 as her successor.\nHe says he \"had very mixed feelings…given what had happened\" but was driven by Hindu belief in dharma which he says involves \"doing your duty\".\n\"You've just got to focus on doing your best, doing what you're there to do, and not worry about the rest,\" he says.\n\"It was a very helpful concept for me…I kept coming back to that. I said, 'look, this is my job. This is what I'm here to do. I'm well-placed to try and solve the economic challenge that our country is facing'.\"\nBringing the economy back under control after the markets panicked in the face of Truss's unfunded tax cuts – or what he calls \"fantasy economics\" - is the achievement he's clearly proudest of.\nHowever, he spells out for the first time the scale of the disagreements he had not just with Truss, but with Boris Johnson, who he served as Chancellor.\n\"He and I had quite different views on economic policy. I'm a small state conservative. I believe in prioritising, trying to restrain the growth of public spending, being careful with our borrowing so that we can cut people's taxes...he was less worried about those things.\"\nHe tells me that at their regular Sunday night dinners in Downing Street they argued over what could and could not be afforded.\nHe says his worries were inflation and interest rates rising, because \"when they go up it's going to have a big impact on our public finances, because we're going to have to pay more to service the debt that we've got\".\nHe adds: \"We cannot afford to keep spending and borrowing at this rate, and that means you have to prioritise. We can't do everything.\"\nSunak insisted that any plan to subsidise people's social care costs had to be paid for by higher taxes.\nNow he thinks \"we're having another review now...I tell you, the answer is, do we as a country think it's right to pay more taxes for a more generous social care policy? Yes or no? I personally think the answer is no.\"\nHe believed in slashing billions from welfare bills, a more \"radical restructuring of the state\" to pay for increased defence spending, and he says he told Johnson that the UK's net zero obligations were saddling the economy with cost.\nNow he argues for abandoning the legal commitment to deliver net zero, made law by another Tory leader Theresa May.\nDuring the Covid pandemic both Sunak and Johnson faced fixed term penalties for breaking lockdown rules.\nSunak tells me he thought long and hard about resigning after that but says he had a job to do and he clearly can still scarcely believe that he was fined for turning up at a work meeting early where a cake was produced for the prime minister's birthday.\nMuch more interesting is the lesson he draws from that period.\nWe should all have been treated more like grown-ups, he tells me, and the public should have told that \"even the scientists themselves are not united on this, or they don't 100% know that this is the right thing to do\".\nThe long-term negative consequences of lockdown measures should have been spelt out because, he says, \"we've seen the impact it's had on school kids everywhere and the impact it's had on their learning. And we probably didn't talk about that as much as we could have done at the time.\"\nSunak is proud to have been the first British Asian prime minister and talks movingly of the moment his grandfather – who'd been born poor in an Indian village – calling an old friend at home with tears in his eyes on his first visit to Westminster.\nHe's angry too with those like a popular podcaster who declared recently: \"He's a brown Hindu; how is he English.\"\n\"Of course I'm English, born here, brought up here,\" he says.\n\"On this definition, you can't be English even playing for England, let alone supporting them... I genuinely thought it was ridiculous.\"\nHere is a man proud of his roots and ready to admit mistakes, but who is wondering whether his rise to the top all happened before the country knew him, and could see beyond the super-wealthy Tory who was the fifth Tory leader in just six years.\n\"It's a lonely job,\" he says, \"because it is 100% only on you.\"\nMany were sure that he'd called the election early to head off to a new life in California.\nNonsense, he says, he lives here because it's home and indeed has just set up a charitable foundation – the Richmond Project – named after the constituency in Yorkshire, which he's still proud to represent in Parliament.", "url": "https://www.bbc.co.uk/news/articles/cy9dxxgjx4do"}