{"authors": ["Angela Ferguson", "www.facebook.com"], "date_download": "2025-04-26 03:49:32", "date_modify": "2025-04-26 03:49:32", "date_publish": "2025-03-05 13:36:30", "description": "The sulcata tortoises - the third largest species of tortoise in the world - outgrew their old home.", "filename": "news_articles_c86pgxqv3z2o_1745639372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a505/live/b59eb2f0-f9b8-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pgxqv3z2o_1745639372.html", "title": "Leeds: Tropical World welcomes arrival of five giant tortoises", "title_page": "Leeds: Tropical World welcomes arrival of five giant tortoises - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A zoo in Leeds has welcomed five giant tortoises after they outgrew their previous home.\nThe group of sulcata tortoises, also known as African spurred tortoises, has moved from the Blue Planet Aquarium in Ellesmere Port, Cheshire to Tropical World in Roundhay.\nThey are the third largest species of tortoise in the world, after the Galapagos tortoise and the Aldabra giant tortoise.\nAbigail Hardwick, animal officer at Tropical World, said the group were all settling in well.\nThey have been named Tank, Scoop, Dizzy, Roley and Muck.\n\"They all have coloured markings on their shells so we know who is who,\" said Ms Hardwick.\n\"Tank is the biggest male and the most boisterous, he can often be seen pushing the other boys out of the way to be first to the food bowls,\" she added.\nThe new arrival comes as Tropical World, which is run by Leeds City Council, received official accreditation by the British and Irish Association of Zoos and Aquariums (BIAZA), after being screened by experts earlier this year.\nA Tropical World spokesperson said the mark of excellence recognised the high quality of the zoo in the fields of animal welfare, conservation, education and research.\nMohammed Rafique, Leeds City Council's executive member for climate, energy, environment and green space, said: \"The tortoises are very impressive to look at, and we're glad to have been able to give them a new home at Tropical World.\n\"Receiving the accredited status from BIAZA is also a testament to the passion and hard work of all the staff members,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c86pgxqv3z2o"}