{"authors": ["Galya Dimitrova", "Cristina Parry", "www.facebook.com"], "date_download": "2025-04-26 04:30:48", "date_modify": "2025-04-26 04:30:48", "date_publish": "2025-03-03 06:18:54", "description": "Oxford Bus Company has confirmed it will hold additional Chatty Bus days and plans to grow the service.", "filename": "news_articles_cx2gqqedjw4o_1745641848.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/911a/live/3bc86310-f37b-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gqqedjw4o_1745641848.html", "title": "Oxford Chatty Bus initiative back to help reduce loneliness", "title_page": "Oxford Chatty Bus initiative back to help reduce loneliness - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bus initiative involving volunteers speaking to passengers in an effort to address loneliness has returned.\nOxford Bus Company (OBS) and Thames Travel Chatty Bus volunteers spoke to people onboard the X32 service between the John Radcliffe Hospital and Didcot.\nPassenger Chris said it was \"a lovely idea\" as \"people can get lonely very quickly\".\nThe company will hold additional Chatty Bus days on 14 May and 10 October.\nThe initiative launched in 2019.\nChatty Bus Champions in blue tops travel on buses to engage in meaningful conversations with those seeking companionship.\nPassengers can pick up a badge saying they are happy to chat or enjoy their journey quietly.\nThe volunteers can also provide information about local activities and social groups.\nLouise Lister, OBS marketing assistant manager, said the first two passengers they had met on Monday \"were so lovely and chatty\".\n\"It was just really nice to find out a little bit about their lives ... and just to share a smile with them,\" she said.\nElizabeth boarded the service on her way back from a hospital visit.\n\"It's nice that you give me your time, because people don't speak a lot,\" she said.\nAnother commuter, Ruth, was on her way to a pottery class, which she said she attended \"largely for the social life\".\nShe said she would normally use her time on bus for errands such as getting rid of messages on her phone.\n\"I'm open to chatting to people and I think it's mostly older people who would chat.\"\nPassenger Chris said: \"People can get lonely very quickly and if you have a service like this, just to have a chat, this is really good.\n\"And I think British people are very good at chatting.\"", "url": "https://www.bbc.co.uk/news/articles/cx2gqqedjw4o"}