{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:59:37", "date_modify": "2025-04-26 06:59:37", "date_publish": "2025-02-27 03:45:39", "description": "Rising stars of African journalism are encouraged to apply for the award, which is now in its 10th year.", "filename": "news_articles_c798d074wp2o_1745650777.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3a1e/live/c5088320-f45d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c798d074wp2o_1745650777.html", "title": "BBC Komla Dumor Award 2025 launched", "title_page": "BBC Komla Dumor Award 2025 launched - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The BBC is seeking a rising star of African journalism for the BBC News Komla Dumor Award, which is now in its 10th year.\nJournalists from across Africa are invited to apply for the award, which aims to uncover and promote fresh talent from the continent.\nThe winner will spend three months at the BBC headquarters in London, gaining skills and experience.\nApplications close on 20 March 2025 at 23:59 GMT.\nKomla Dumor's wide-ranging career\nKomla Dumor's colleagues pay tribute\nThe award honours the legacy of Komla Dumor, a distinguished Ghanaian broadcaster and former BBC World News presenter, who died suddenly aged 41 11 years ago.\nDumor's widow, Kwansema Dumor, said she was \"proud\" of her husband's impact at the BBC, and also said her family were \"thankful to the BBC for remembering him\" through the prize.\nThe BBC is encouraging journalists from across Africa to apply for the prize, which seeks to promote and celebrate outstanding journalistic talent on the continent.\nAs well as receiving training, the successful candidate will have the opportunity to travel to a country in Africa to report on a story that they have researched, with the report broadcast to the BBC's global audiences.\nKnown for championing robust, dynamic journalism, Dumor made a significant impact on Africa and the rest of the world.\nThe BBC is committed to continuing his legacy through the award by empowering journalists from Africa to tell original and nuanced African stories to international audiences.\nRukia Bulle from Kenya was last year's winner.\nDuring her placement, she travelled to a Senegalese village to report on the Baye Fall, an unorthodox Muslim minority who are often misunderstood by others in the wider faith.\nJonathan Munro, BBC News global director and deputy CEO, said: \"We are proud to launch this year's BBC News Komla Dumor award and the search for the next recipient.\n\"Marking its 10th anniversary is a testament to Komla Dumor's powerful legacy of reporting on African stories with depth, insight and integrity.\n\"Past winners of the award reflect the exceptional talent across the continent so I look forward to welcoming this year's winner and strongly encourage journalists to apply.\"\nDumor was the presenter of Focus on Africa, the BBC's first-ever dedicated daily TV news programme in English for African audiences. It was broadcast on BBC World News, which has now merged with the BBC News Channel to create a single 24-hour TV news service.\nHe was also one of the lead presenters for BBC World News' European morning segment.\nHe joined the BBC in 2007 after a decade of broadcast journalism in his native Ghana where he won the Ghana Journalist of the Year award.\nBetween 2007 and 2009 he hosted Network Africa on BBC World Service, before joining The World Today programme.\nIn 2009 Dumor became the first host of the African business news programme on BBC World News, Africa Business Report. He travelled across Africa, meeting Africa's top entrepreneurs and reporting on the latest business trends around the continent.\nIn 2013 Dumor featured in New African magazine's list of the 100 most influential Africans.", "url": "https://www.bbc.co.uk/news/articles/c798d074wp2o"}