{"authors": ["Georgina Barnes", "John Danks", "www.facebook.com"], "date_download": "2025-04-26 06:31:01", "date_modify": "2025-04-26 06:31:01", "date_publish": "2025-02-27 10:09:24", "description": "One fan says Maksym Talovierov will \"eat Haaland for breakfast\" if he's on the pitch.", "filename": "news_articles_cn044wwl81po_1745649061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/747f/live/c0b980a0-f4e7-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn044wwl81po_1745649061.html", "title": "Plymouth Argyle fans excited for Manchester City FA Cup match", "title_page": "Plymouth Argyle fans excited for Manchester City FA Cup match - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth Argyle's Green Army are hoping their team can give the defending Premier League champions a challenge in their FA Cup tie on Saturday.\nThe Devon side, who are near the bottom of the Championship table, beat Premier League leaders Liverpool 1-0 in a fourth-round victory at Home Park at the beginning of the month.\nTheir next opponents Manchester City remain near the top of the Premier League table and boast some of the world's best players, although striker Erling Haaland's return from injury was still uncertain.\nElburton postmistress Tina Debenham said she hoped City would be \"having a bad day\" to give the Pilgrims more of a chance to win.\nShe said: \"Of course we can do it.\n\"Maxi (Maksym Talovierov) will eat Haaland for breakfast if he's playing, but realistically it's our cup final.\n\"We've got the enjoy every minute of it.\"\nMs Debenham said \"we'll be the talk of England\" if Argyle win.\nAbout 8,000 fans are expected to travel to the Etihad Stadium in Manchester to support the Pilgrims in the fifth-round tie.\nLifelong Argyle supporter Jo Benwell will be one of them.\nShe said: \"There's always a real thrill as a lower league fan to go to these big stadiums and whenever Argyle fans travel in large numbers for big cup games it's always a great atmosphere.\n\"It's going to be a fantastic occasion for the club and one that the fans can really enjoy because there's no pressure on us to go there and win.\"\nPlymouth Argyle are currently in 22nd place out of 24 spots.\nMs Benwell said if the club won the FA Cup but were relegated in the same season she would \"take that\".\n\"We can get through it again but the chances of ever winning the FA Cup again in our lifetime is unlikely.\"", "url": "https://www.bbc.co.uk/news/articles/cn044wwl81po"}