{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:08", "date_modify": "2025-05-19 15:17:08", "date_publish": "2017-07-20 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across Cumbria on Thursday 20 July 2017", "filename": "news_live_uk-england-cumbria-40599206_1747667828.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-cumbria-40599206_1747667828.html", "title": "BBC Local Live: Cumbria", "title_page": "BBC Local Live: Cumbria for Thursday 20 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage throughout the day\nMartin Lewes\nReporter\nWe've now finished posting news, travel reports, a regular weather forecast and other things that might catch our eye, for today. Here's a reminder of what's happened:\nThe Barrow and Furness MP John Woodcock held the first of what will no doubt be many meetings, after the announcement by the pharmaceutical firm GSK that it would not build a new factory in Ulverston, and might sell the one it has there now;\nPlans to electrify the Lakes railway line from Oxenholme to Windermere were scrapped as ministers decided to go instead for a \"flex-train\" - one that would be able to run on electricity and diesel;\nAnd as the rain poured, film-makers creating a documentary on the famous South Cumbrian \"drainman\" Archie Workman, went looking for a flood to feature in their documentary about him. They didn't find one.\nWe'll do it all again tomorrow from 08:00.\nIf you can help with news you think we should know, or want to share a photo with the county, you can email them to us, send them using Twitter where we're @BBC_Cumbria, external or head to our Facebook page, external.\nHave a very good evening.\nTown 'will survive factory shock' says MP\nNeil Smith\nSouth Cumbria journalist, BBC Cumbria\nBarrow's Labour MP John Woodcock says Ulverston is still open for business, after GSK cancelled their expansion plans and cast doubt on the long-term future of their antibiotics plant.\nGSK has announced that it's scrapping plans for a new £325m factory at the Ulverston site, and may sell its existing works there.\nMr Woodcock, speaking after a meeting with managers and union representatives from GSK, said: \"We have to make the case crystal clear that Ulverston remains an amazing place for an investor to come in.\"\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nMP says watchdog report on ward must not be excuse for closure\nThe Westmorland and Lonsdale MP Tim Farron has urged health officials to increase staffing at a Kendal mental health ward after a critical report from the Care Quality Commission.\nThe report rated inpatient services run the the Cumbria Partnership Trust as requiring improvement, external; the Kentmere ward at the Westmorland General Hospital was threatened with closure a year ago after a previous report said it didn't meet modern standards.\nLib Dem Mr Farron says the reasons for the Kentmere ward needing improvement mainly related to staffing, so it should not be used as a reason to try to close the ward.\nThe trust said: “We know we still have more work to do to improve the areas highlighted in the report and will be continuing with the work already in place to address these issues.\"\nNew trains will use both electric and diesel power\nThe train operating company Northern has released more details about how new trains will be introduced on the Lakes Line from Oxenholme to Windermere.\nThey are designed to deal with the problem that rail lines in the Manchester area will soon be able to take only electric trains, which would mean direct services from the Lakes Line could only go as far as Preston.\nThe so-called \"flex trains\", which are being converted from diesel sets, can move seamlessly from electrical to diesel power.\nThey will be introduced from 2018, and enable direct services to Manchester Airport can be reintroduced.\nNorthern has also been asked to develop new trains that can run on alternative energy sources such as hydrogen, starting in 2021.\nPlans to electrify Lakes line is cancelled as new trains are promised\nPlans to electrify the Lakes railway line from Kendal to Windermere have been cancelled.\nThe news was part of a bundle of announcements, external, including reintroducing direct services from Windermere to Manchester Airport next year, and putting new trains on to the line in 2019.\nTransport Secretary Chris Grayling said this morning that he wanted the operating company, Northern, to pilot new trains that could run on either electric or diesel power.\nHe said it was these trains that meant some electrification schemes would no longer be necessary, and he added that this would mean the Lake District could be \"protected\" from electrification gantries.\nNow documentary cameras roll on drainman Archie\nThe story of a south Cumbrian man who became an unlikely celebrity after he shared his enthusiasm for draincovers with BBC Radio Cumbria is being made into a new film.\nArchie Workman works as a part-time lengthsman in Colton, near Ulverston, and produced a calendar showing the differing designs and makers of the drain covers he'd cleared.\nAndy Oxley, of Screen 3 Productions, said the documentary would be offered to film festivals and might then find a wider audience.\n\"Archie's got me hooked - we were here last night in the thunderstorm, looking for a drain that was blocked and we couldn't find one, and that's down to him,\" he said.", "url": "https://www.bbc.com/news/live/uk-england-cumbria-40599206"}