{"authors": ["Peter Harris", "www.facebook.com"], "date_download": "2025-04-26 06:33:44", "date_modify": "2025-04-26 06:33:44", "date_publish": "2025-02-27 06:36:12", "description": "It is the 40th anniversary of the divisive miners' strikes being called off.", "filename": "news_articles_c1kjmd30yrgo_1745649224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a6b/live/93d9b090-f46b-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjmd30yrgo_1745649224.html", "title": "Hard to forgive strike breakers, say North East ex-miners", "title_page": "Hard to forgive strike breakers, say North East ex-miners - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Miners who took part in one of the UK's most divisive strikes have said they still cannot forgive those who did not, 40 years after it ended.\nOn 3 March 1985, delegates from the National Union of Mineworkers voted to end industrial action - a year after it had begun.\nRonnie Peterson, who worked at Westoe colliery near South Shields and had taken part in the strikes, said he still refused to speak to those who went to work during the strikes.\n\"The scabs...no, never, ever spoke to them,\" he said. \"Never ever, and never, ever will.\"\nHeather Wood, one of the founders of Women Against Pit Closures who supported miners during the strike, said she also could not get over the hurt she felt about those who went to work, despite the year-long industrial action.\n\"I still look at somebody and I go 'I can't remember their name but she's a scab so... and I cannot get over that,\" she said.\n\"Whether I want to or not is a different matter but it's ingrained in you. It's there forever. Those people let us down.\"\nOn 5 March 1985, two days after the vote to return to work, miners formed behind their banners and marched back to collieries across Durham and Northumberland.\nAlan Mardghum, a former miner at Wearmouth colliery in Sunderland, said: \"The worst aspect of it was marching back to work and we were leaving sacked miners on the street. I certainly wasn't proud that day, if anything I was dejected.\"", "url": "https://www.bbc.co.uk/news/articles/c1kjmd30yrgo"}