{"authors": ["Andrew Dawkins", "www.facebook.com"], "date_download": "2025-04-26 03:47:58", "date_modify": "2025-04-26 03:47:58", "date_publish": "2025-03-05 15:20:46", "description": "Det Sgt Jonathan Cooper also sent memes offensive to people with disabilities, a hearing is told.", "filename": "news_articles_cqx02nlxe0jo_1745639278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e8c/live/1be02bb0-f9ce-11ef-ab31-673597444be7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx02nlxe0jo_1745639278.html", "title": "West Mercia Police racist-meme detective sacked", "title_page": "West Mercia Police racist-meme detective sacked  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer who sent memes from his personal mobile phone that were racist and offensive to people with disabilities has been sacked.\nThe actions of Det Sgt Jonathan Cooper, 54, amounted to gross misconduct and he would be prevented from working for any other UK police service, a West Mercia force misconduct hearing was told.\nDeputy Chief Constable Rachel Jones said the force expected \"the highest standards\" of its officers both on and off duty.\nThe outcome of the hearing was subject \"to the normal appeals process\", the hearing was told.\nDet Sgt Cooper, who was based in the economic crime unit at Hindlip in Worcestershire, was dismissed after the hearing chaired by Assistant Chief Constable Grant Wills.\nBetween 26 December 2019 and 9 December 2020 Det Sgt Cooper used the phone to send four memes to friends via WhatsApp that were racist and offensive to those with physical/mental disabilities, the hearing was told.\nActions of the officer seriously breached standards, including authority, respect and courtesy and equality and diversity, the hearing found.\nMs Jones said: \"It is vital people from all backgrounds have trust in the police to ensure crime is reported or our support sought when needed.\n\"The actions of officers like Jonathan Cooper undermine this trust, which is something we simply won't accept.\"\nDet Sgt Cooper would be added to the College of Policing Barred List, preventing him from working for a UK police service in the future, the force said.", "url": "https://www.bbc.co.uk/news/articles/cqx02nlxe0jo"}