{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:24:57", "date_modify": "2025-05-21 05:24:57", "date_publish": "2025-01-05 00:00:00", "description": "An amber weather warning remains in place across parts of the region on Sunday.", "filename": "news_live_cly0gzgwwpvt_1747805097.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cly0gzgwwpvt_1747805097.html", "title": "West Midlands: Weather warnings remain in place as snow hits region", "title_page": "West Midlands: Weather warnings remain in place as snow hits region - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's it from us\nWe'll be closing this live page shortly, thanks for joining us.\nYou'll be able to find further updates on your BBC News app throughout the rest of the day.\nWhat to expect in the coming days\nSteady and persistent rain is expected to spread across Birmingham and Staffordshire later today before the weather turns breezy and mild.\nForecasters predict there could be further showers on Monday, with some of them wintry.\nYellow warnings for snow and ice in the region run until midnight, with an amber warning for snow affecting Staffordshire until the same time.\nA yellow warning for outbreaks of heavy rain runs overnight until 06:00 GMT on Monday.\nMeanwhile, the Met Office is predicting snow and ice will continue to impact Shropshire and Staffordshire until midday on Monday.\nNo weather warnings have yet been put into place from Tuesday onwards.\nStaying warm on a budget\nWith medics warning people to stay warm as sub-zero temperatures hit, how can people on already squeezed budgets keep costs down?\nAdvice includes turning radiators off in unused rooms, improvising draught excluders and drawing curtains at dusk.\nOther tips include pushing furniture away from radiators and not overfilling the kettle.\nThe elderly and those with underlying health conditions are advised to keep the temperatures at 18C in their main room.\nRead more here.\nFear of floods in Staffordshire as snow starts to melt\nSimon Humphreys\nBBC Radio Stoke\nThe leader of Staffordshire County Council, Alan White, has told us he's concerned about flooding as snow on the ground melts and turns to slush.\n\"We are now moving on... to an amber warning for flooding because as that snow melts, the excess water starts to run off and we have got to keep an eye on how that water is managed,\" he said.\n\"We are hoping to see that water run off in a controlled manner but, as always with these things, we have just got to keep an eye out.\"\nCouncillor White said gritting teams had worked through the night and thanked local farmers for ploughing roads on the Leek Moorlands.\nElsewhere, children have been enjoying sledging in Brough Park in Leek - a \"legendary\" spot according to one participant.\nSnow thawing across Coventry and Warwickshire\nAlec Blackman\nBBC Coventry & Warwickshire\nCoventry and Warwickshire seems to have escaped the worst of the snow.\nEarlier predictions of up to 13cm (5in) of snow have proved to be over-cautious with most places reporting a light dusting instead of anything more significant.\nNo major problems have been reported on the area’s roads and slightly warmer temperatures are seeing what did settle overnight now melting away.\nHazardous rural roads and power cuts in Shropshire\nThomas Berrington\nBBC Radio Shropshire\nIn Shropshire there was some snow overnight but a lot of it has since melted away.\nHowever, callers to BBC Radio Shropshire have been telling us rural roads are still pretty bad.\nFor a time in the morning, 152 homes were without power in Easthope, near Church Stretton, but this is now down to 48.\nTen properties in Shifnal have had no power all morning – the National Grid originally said it should be back on by 11:00 GMT but that’s now been pushed back to 14:00.\nDespite conditions being worse further north, the train services between Shrewsbury and Crewe/ Manchester have had little to no delays.\nPower outages continue\nMore than two hundred households are without power in the West Midlands, according to the National Grid, external.\nIn Wolverhampton, 109 properties near New Cross Hospital are expected to be affected by outages until about 17:00 GMT, with a further 72 affected in the Birchills area of Walsall.\nResidents in parts of Birmingham, Easthope and Shifnal in Shropshire, Penkridge in Staffordshire and Hartshill and Bishops Tachbrook in Warwickshire are also impacted.\nHow to drive in snow in ice\nWith National Highways warning of ice on the roads, drivers are advised to check local forecasts before thinking about setting off.\nHere's a reminder of some tips, including using second gear to avoid wheel spin and not to splash boiling water onto iced-up windscreens.\nStopping distances can be up to 10 times greater in snow and ice, so leave more space than usual.\nLess disruption than expected in Birmingham\nLara Davies\nBBC Radio WM\nSnow and ice in Birmingham has not been as bad as expected, although about 5cm (2in) fell across Birmingham and the Black Country and up to 20cm (8in) in more hilly areas of the region.\nBirmingham Airport temporarily suspended operations for a few hours overnight but said it was on schedule for \"business as usual\" this morning.\nThe Met Office has reduced Birmingham and the Black Country's amber weather warning to a yellow one for snow and ice.\nA lot of what the weather office expected to fall as snow fell as rain instead, as the temperatures were milder than predicted.\nWhat do weather warnings mean for you?\nThere's an amber warning for snow in Staffordshire until midnight on Sunday.\nThis means the Met Office thinks there is a high likelihood of residents seeing more widespread power cuts, transport delays and cancellations.\nIt also means some rural communities are likely to be cut off.\nParts of Shropshire, Staffordshire, Stoke-on-Trent, Telford and Wrekin and Warwickshire are also under an amber warnings of snow and ice, meaning driving is likely to hazardous.\nA yellow warning of snow and ice means areas are less likely to be impacted by widespread disruption, but should still check the forecast and take necessary steps.\nDrivers advised to take extra care\nThere are no major delays to bring you yet this morning.\nHowever National Highways has warned motorists rain falling on frozen routes could lead to ice, particularly on high ground.\nStaffordshire Police advised drivers to take precautions, particularly in the Moorlands area, including allowing extra distance and braking time.\n\"Clear your car of ice and snow, including the windscreen, rear window, wing mirrors and roof, before driving,\" said Scott McGrath from the road crime team.\n\"Don’t start driving until the windscreen is fully defrosted and avoid driving altogether if weather conditions are extreme.\"\nSnow falls across the West Midlands\nYou’re waking up to a scattering of snow across the West Midlands.\nWeather warnings from the Met Office remain active in the region until midnight.\nAn amber warning forecasts snow and ice across parts of Shropshire, Staffordshire, Stoke-on-Trent, Telford and Wrekin and Warwickshire.\nHere, the Met Office is predicting 3cm to 7cm of snowfall, mixing with rain in lower-lying spots.\nElsewhere, a yellow weather warning is still in place for areas in Birmingham, Wolverhampton and the Black Country, Herefordshire and Worcestershire.\nForecasters say further sleet and snow is likely in these places, with some also getting a spell of freezing rain.\nBirmingham Airport aiming for 'business as usual' after closure\nBirmingham Airport has warned passengers to allow for extra travel time after it shut overnight.\nPosting on X, the airport said it closed for two hours, external to clear heavy snow off the runways.\nIt warned passengers on Sunday that while the start of the flight schedule remained normal, people travelling to the airport should allow plenty of time.\nA statement from the airport said: \"As a result of resilience teams working throughout the night, the start up to the schedule remains business as usual.\"", "url": "https://www.bbc.com/news/live/cly0gzgwwpvt"}