{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:42", "date_modify": "2025-05-19 14:45:42", "date_publish": "2015-02-03 13:47:37", "description": "Credit rating agency Standard & Poor's (S&P) agrees to pay $1.38bn settlement to US regulators over allegations it knowingly inflated its ratings of risky mortgage investments.", "filename": "news_business-31115174_1747665942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80757000/jpg/_80757083_80757082.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31115174_1747665942.html", "title": "S&P to pay $1.4bn to regulators in sub-prime debt case", "title_page": "S&P to pay $1.4bn to regulators in sub-prime debt case - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ratings agency Standard & Poor's (S&P) has agreed to pay a $1.38bn (£934m) settlement to US regulators over allegations it knowingly inflated its ratings of risky mortgage bonds.\nThe deal, external with the US Justice Department also resolves 19 other lawsuits.\nIn a statement, external, McGraw Hill - the parent company of S&P - said the \"settlement contains no findings of violations of law\".\nS&P is the first credit agency fined over financial crisis-era violations.\nThe settlement covers mortgage bond ratings between 2004 and 2007.\nThe bonds, which included sub-prime mortgages, were blamed for the collapse of the US property market and subsequent global financial crisis.\nThe US Justice Department filed civil fraud charges against S&P two years ago.\nIt accused the credit rating firm of giving top recommendations - known as triple-A ratings - to mortgage bonds that it knew contained sub-prime mortgage debt and were therefore not as safe an investment as the rating suggested.\nThe US government said that S&P's ratings encouraged financial institutions around the world to buy and sell what proved to be \"toxic\" financial products in their trillions.\nIt also accused S&P of failing to warn investors that the housing market was collapsing in 2006 because doing so would have hurt its business.\nAt the time, S&P said the US government's case was entirely without factual or legal merit.", "url": "https://www.bbc.com/news/business-31115174"}