{"authors": ["Andrea Pluck", "www.facebook.com"], "date_download": "2025-04-26 04:32:28", "date_modify": "2025-04-26 04:32:28", "date_publish": "2025-03-03 05:30:56", "description": "A council says the development would have had an \"unacceptable impact\" on road safety.", "filename": "news_articles_cjw22jvl202o_1745641948.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/af05/live/26e2bcc0-f5c9-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw22jvl202o_1745641948.html", "title": "Plans to turn Northampton offices into 10 flats refused", "title_page": "Plans to turn Northampton offices into 10 flats refused - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to turn a block of vacant offices into flats have been refused by a council because it would have had an \"unacceptable impact\" on road safety.\nRealty Northampton Ltd applied to convert the premises on Whitworth Road, Northampton, into 10 flats with three parking spaces.\nWest Northamptonshire Council (WNC) refused the proposals because it would have had a negative impact on nearby roads and the proposed flats did not comply with national space standards, among other reasons.\nSimon Ackerman, the director of Archi-tech, which designed the development, said turning the offices into accommodation would be \"more favourable\" for the area.\nThe proposals had attracted 23 public comments, of which all but one objected to the plans.\nResidents who objected had cited parking as the main cause of concern and spoke of fears around noise pollution and damage to the character of the area.\nZoe Smith, a Labour councillor on the authority, had raised concerns that the development would cause \"dangerous parking in an area already without parking capacity\".\n\"Parking is a concern, not just in terms of neighbours being able to park, but because of the impact it has on safety around that area,\" she said.\nIn its decision notice, WNC said \"insufficient information\" had been provided in the application to \"demonstrate safe site access\" and that it would impact highway safety and the local road network.\nWNC said the proposed flats \"do not comply with nationally described space standards\" and that the development would not have \"adequate lighting in all of the habitable rooms\".\nThe council also stated that there was insufficient information submitted to \"demonstrate the impacts of noise from commercial premises on the intended occupiers of the development\".\nIn 2023, proposals to turn the adjacent dancehall into seven flats were rejected by the council, with a lack of parking listed as one of the reasons.", "url": "https://www.bbc.co.uk/news/articles/cjw22jvl202o"}