{"authors": ["Zoe Applegate", "www.facebook.com"], "date_download": "2025-04-26 06:59:05", "date_modify": "2025-04-26 06:59:05", "date_publish": "2025-02-27 05:55:48", "description": "Ministers give permission for the redevelopemt of a \"bottleneck\" junction after several delays.", "filename": "news_articles_c9wp50gd14zo_1745650745.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3bb3/live/c90eb600-f445-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9wp50gd14zo_1745650745.html", "title": "Thickthorn Junction: £200m road scheme gets government approval", "title_page": "Thickthorn Junction: £200m road scheme gets government approval - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A multi-million pound road scheme, delayed by court action, has been given the go-ahead by the government.\nThe £200m project to overhaul the A47-A11 Thickthorn junction on the edge of Norwich aims to speed up journey times.\nThe government has said the scheme will also support a strategy for the area, external, called the Greater Norwich City Deal, to help build more than 44,000 homes and create 33,000 jobs.\n\"This scheme is finally getting the go-ahead it deserves, after years of expensive legal blocks,\" said Future of Roads Minister Lilian Greenwood.\n\"We are now able to unlock this vital scheme that Norwich has waited long for.\n\"We are determined to get Britain building again as this scheme is set to not only improve journeys but create thousands of new homes and jobs.\"\nRedevelopment of the Thickthorn junction, which connects the A47 with the A11 and brings in traffic from south of Norwich, was one of three major A47 projects blocked by court action.\nClimate activist Andrew Boswell had his crowd-funded legal challenge about carbon emissions rejected in the appeal court last year.\nThe other schemes were the new junctions and dualling of the road between Blofield and North Burlingham and between North Tuddenham and Easton.\nThe Department for Transport (DfT) said the court cases meant work on the Thickthorn scheme had been \"delayed by over a year\".\nOnce work is completed, drivers are predicted to save up to four minutes on their journeys at peak times on the eastbound A11 to A47, and up to three minutes along the A11, according to the DfT.\nIt has also estimated that up to 26 fatal or serious injury road crashes could be avoided over 60 years due to rerouted traffic and new pedestrian and cycle routes.\nTwo new slip roads linking the A47 and A11 will reroute traffic away from the junction and take it beneath new underpasses.\nGraham Plant, Norfolk County Council's Conservative cabinet member for highways, said the local authority was \"thrilled\" by the minister's announcement.\n\"Thickthorn junction has been a persistent bottleneck, and we've been pushing for these improvements for a number of years,\" he said.\n\"This scheme will unlock significant economic growth, helping to supercharge the vital connection between the A11 and the nationally significant businesses who have found a home in Norfolk.\"\nNova Fairbank, chief executive of Norfolk Chambers of Commerce, said the business community had \"long campaigned\" for the improvements along the A47 and the latest funding was \"much needed\".\nShe added: \"The ability to deliver further housing, jobs and new commercial opportunities, as a result of this junction upgrade, will make a significant difference.\"", "url": "https://www.bbc.co.uk/news/articles/c9wp50gd14zo"}