{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:49", "date_modify": "2025-05-19 14:47:49", "date_publish": "2015-02-24 17:49:21", "description": "An American woman working as a Christian missionary in central Nigeria has been abducted, the Free Methodist Church USA says.", "filename": "news_world-africa-31605963_1747666069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81214000/jpg/_81214787_81209471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31605963_1747666069.html", "title": "US missionary Phyllis Sortor abducted in Nigeria", "title_page": "US missionary Phyllis Sortor abducted in Nigeria - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A US woman working as a Christian missionary in Nigeria has been abducted by masked gunmen in what may be an effort to secure a ransom, police say.\nPhyllis Sortor was taken from the Hope Academy compound in the central state of Kogi, the Free Methodist Church USA said on its website.\nThe number of kidnappings has escalated in Nigeria in recent years.\nCorrespondents say it has become a strategy that earns kidnappers millions of dollars a year.\nScores of expatriates have been targeted in the south, centre and north of the country - some by Boko Haram Islamist militants.\nKogi state, however, is reported to have a low level of militant activity, security sources say.\n\"We are calling on the US church to join together in prayer for Phyllis' safety and speedy release,\" the Free Methodist Church USA, external said, adding that US authorities had been notified and were trying to find and rescue her.\nIt described her as a financial administrator who had formed a \"special friendship\" with the nomadic Fulani clan.\nThe US Department of State said it was aware of the kidnapping.\n\"In cases where US citizens are confirmed missing, the US embassy works closely with those involved, supporting local authorities in their search efforts, and provides all appropriate consular assistance,\" it said in a statement.", "url": "https://www.bbc.com/news/world-africa-31605963"}