{"authors": ["Lara King", "www.facebook.com"], "date_download": "2025-04-26 06:46:33", "date_modify": "2025-04-26 06:46:33", "date_publish": "2025-03-01 13:20:27", "description": "The work of 91-year-old Cymbria Whitley has gone on show for the first time at Cleethorpes Library.", "filename": "news_articles_ckg88g37rgxo_1745649993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d83c/live/fd6ef270-f5e4-11ef-a452-97c9e2e951dd.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg88g37rgxo_1745649993.html", "title": "North East Lincolnshire artist, 91, exhibits work for first time", "title_page": "North East Lincolnshire artist, 91, exhibits work for first time - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 91-year-old artist who has been painting for most of her life is displaying her work in an exhibition for the first time.\nThe work of Cymbria Whitley, who lives in Healing, near Grimsby, has gone on show at Cleethorpes Library.\nHer son, Tim Whitley, has said she never had the confidence to display her work until he discovered her collection of paintings and decided to exhibit them.\nMrs Whitley said: \"This [exhibition] has come right out of the blue. If it wasn't for Tim this wouldn't have happened, I'm so grateful for all the support. I've always loved painting but never expected anything like this to happen.\"\nMr Whitley said while he was aware his mother painted and had seen some of her pieces, he stumbled across the nonagenarian's collection for the first time while helping her sort out a bedroom last year.\nThe family were so impressed with her artwork they posted pictures of them on social media and had received \"an amazing response\" with people asking if they could buy them, which prompted them to showcase the collection in a physical gallery.\n\"Mum is 91 years old, she's painted all her life and this is the first time people get to see her work, which is incredible,\" said Mr Whitley.\n\"It's a really special moment and very emotional\".\nMr Whitley, a photographer, is also exhibiting his black and white photography alongside his mother's paintings.\nThe exhibition runs until 27 March.", "url": "https://www.bbc.co.uk/news/articles/ckg88g37rgxo"}