{"authors": ["Adam Postans", "www.facebook.com"], "date_download": "2025-04-26 07:40:39", "date_modify": "2025-04-26 07:40:39", "date_publish": "2025-02-27 12:04:08", "description": "Bristol City Council has agreed its annual budget, with a 4.99% increase in council tax.", "filename": "news_articles_cx2ee5nkrgpo_1745653239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d502/live/774bf940-f4f4-11ef-ab77-6b27a1316238.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2ee5nkrgpo_1745653239.html", "title": "Bristol council tax to rise and plans progressing for visitors' fee", "title_page": "Bristol council tax to rise and plans progressing for visitors' fee - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council tax charges are set to rise and plans for a new city visitor's fee are moving forward.\nBristol City Council has agreed its annual budget, with a 4.99% increase in council tax.\nCouncillor Tony Dyer, council leader, said a cost-cutting programme of \"efficiencies\" would save the authority £77m a year until 2030.\nHe added: \"We propose to spend over £400m in areas such as parks and green spaces, delivering new council housing, repairing aging highways infrastructure, bringing new transport options online and introducing new homes for children in care.\"\nIncreasing the city's Clean Air Zone charge was not debated at the budget meeting on Tuesday but was approved along with a raft of measures to raise income.\nCouncil officers will now seek permission from the government to increase it in line with inflation, which is currently 3%. This could see the daily price for a car rise to £9.27.\nThe budget comprises £1.7bn in spending across schools, council housing, the harbour estate and public health.\nThe Greens-led council dropped plans to slash funding for museums, libraries and lolipop patrols earlier this year.\nThe Lib Dem amendment to carry out a feasibility study into a visitor charge was also approved. This would see hotel guests paying £2 extra to stay each night.\nAnd the group's request to set up a donation fund for community organisations was passed unanimously.\nTwo of Labour's proposals, to reduce the cost of meals on wheels to 4.5% and to tackle fly-tipping, were both approved.\nLabour group leader Tom Renhard said the Greens had removed some of the \"worst ideas\" from the original proposals.\nHe added: \"Even though you've been bailed out of doing most of the unpalatable things, this is still a bad budget, devoid of political direction.\"\nLib Dem councillor Sarah Classick said her group would support the budget as amended and that although it was not perfect, it took a pragmatic approach to improving essential services.\nConservative group leader Mark Weston said his party was seriously worried about changes to transport, libraries and waste services, with an ongoing public consultation into reducing black bin collections to every three or four weeks.\nAlthough the original plan to halve the libraries budget was shelved a few weeks ago, the service will be subject to a taskforce of councillors to decide how its future should look.\nThis could result in some libraries closing in the future.", "url": "https://www.bbc.co.uk/news/articles/cx2ee5nkrgpo"}