{"authors": ["Joshua Askew", "www.facebook.com"], "date_download": "2025-04-26 07:33:16", "date_modify": "2025-04-26 07:33:16", "date_publish": "2025-02-27 16:14:58", "description": "A coroner says the public is being misled over what an NHS physician associate does.", "filename": "news_articles_c80yydvn52mo_1745652796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3377/live/21141840-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c80yydvn52mo_1745652796.html", "title": "Death sparks concern over non-medically qualified hospital staff", "title_page": "Death sparks concern over non-medically qualified hospital staff - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A coroner has said the public is being misled over what an NHS physician associate (PA) does after a woman died following hospital failings, including being misdiagnosed with a nosebleed.\nPamela Marking went to A&E at East Surrey Hospital in February 2024 after vomiting blood and having tenderness in her side.\nShe was told by a PA she had a nosebleed and was sent home, but the 77-year-old actually had a hernia and died four days later following complications with her care after being readmitted to hospital.\nA Surrey and Sussex Healthcare NHS Trust spokesperson said it would \"look carefully\" at the coroner's report to learn lessons on improving services and delivering the safest possible care.\n\"Our deepest sympathies remain with Ms Marking's family and loved ones at this very difficult time,\" they added.\n\"We wish to express our profound regret for their loss.\"\nAn NHS spokesperson said the NHS has \"always been clear that physician associates are not replacements for doctors and should only practice with appropriate medical supervision\".\n\"But there remain legitimate concerns about the roles,\" they added.\nThe coroner's prevention of future deaths report, sent to the Department of Health and Social Care and NHS England, said the PA did not understand the significance of Ms Marking's symptoms and had not examined her fully.\nDr Karen Henderson, assistant coroner for Surrey, called the term physician associate \"misleading\" and said there was a \"lack of public knowledge\" that they were not medically qualified.\nPAs are graduates - usually with a health or life sciences degree - who have undertaken two years of postgraduate training.", "url": "https://www.bbc.co.uk/news/articles/c80yydvn52mo"}