{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:05:43", "date_modify": "2025-04-26 07:05:43", "date_publish": "2025-02-28 06:24:24", "description": "Some NI GP practices face the risk of going under due to a hike in national insurance contributions.", "filename": "news_articles_cn044g4pjyzo_1745651143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c986/live/fd5f4dc0-f5b2-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn044g4pjyzo_1745651143.html", "title": "National Insurance Contributions: GPs to face potential closure, says body", "title_page": "National Insurance Contributions: GPs to face potential closure, says body - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The hike in national insurance contributions (NICs) set for April will see some Northern Ireland GP practices going under if the government does not provide a bail-out, according to a senior doctor.\nThe Royal College of GPs in Northern Ireland (RCGP) told Stormont's Public Accounts Committee the move could be \"catastrophic\".\nEmployers currently pay a rate of 13.8% on employees' earnings above a threshold of £9,100 a year.\nIn the Budget, Chancellor Rachel Reeves said this rate would increase to 15% in April 2025, and the threshold would be reduced to £5,000.\nDr Ursula Mason from the RCGP told the committee: \"There will be contract handbacks without a doubt because practices are already financially very precarious.\n\"Practices can't go over budget - we can't do that. There's nobody coming to bail out an independent contractor practice.\n\"The bail-out is that the contract goes back. You either suffer the financial risk and consequences of that, or that contract gets taken on by someone else.\n\"The national insurance contributions could be catastrophic if not met... it has the potential to destroy a lot of practices financially.\"", "url": "https://www.bbc.co.uk/news/articles/cn044g4pjyzo"}