{"authors": ["Nick Thorpe", "www.facebook.com"], "date_download": "2025-05-19 14:51:30", "date_modify": "2025-05-19 14:51:30", "date_publish": "2015-02-02 11:05:40", "description": "Germany's Chancellor Merkel and Hungary's PM Viktor Orban rule out sending arms to Ukraine and call for peace, Nick Thorpe reports.", "filename": "news_blogs-eu-31090085_1747666290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80732000/jpg/_80732296_merkelbothreut.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_blogs-eu-31090085_1747666290.html", "title": "Merkel condemns Ukraine fighting on Hungary visit", "title_page": "Merkel condemns Ukraine fighting on Hungary visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "German Chancellor Angela Merkel has urged a ceasefire in Ukraine, saying there can be no military solution to the conflict between the Kiev government and pro-Russian rebels.\n\"Germany will not support Ukraine with weapons,\" she said in Hungary.\n\"We try to solve or at least mitigate this conflict by using all possible diplomatic means and negotiations.\"\nIntense fighting continues in eastern Ukraine, with the rebels closing in on the government-held town of Debaltseve.\nMrs Merkel said \"this conflict cannot be solved militarily\".\nShe was speaking at a joint news conference with Hungary's Prime Minister Viktor Orban, who also ruled out sending weapons to Ukraine.\nMr Orban is opposed to the EU sanctions imposed on Russia over its support for the separatist rebels.\nRussian President Vladimir Putin will also visit Hungary on 17 February, followed by the Turkish, Georgian and Nato leaders soon after.\nDomestic critics of Hungary's conservative Fidesz government looked to Mrs Merkel to attack Viktor Orban for what they see as his narrow view of democracy, in which the winner takes all.\nShe fulfilled their wishes, carefully and elegantly. Asked by a reporter to comment on Mr Orban's 2014 espousal of \"illiberal democracy\", she replied that this was not a concept she could begin to understand.\nLater, addressing students at the German-speaking Andrassy University, she went further. Governments should treat a strong civil society - non-governmental organisations (NGOs) and an independent and free media - as a partner, not an enemy, she said.\nLast week a Budapest court ruled that a police raid, ordered by the government last September on the environmental NGO Okotars, was illegal.\nMr Orban has been widely criticised in the EU for his authoritarian policies.\nSeveral thousand opponents of Mr Orban rallied in Budapest on Sunday, and there were smaller numbers in many provincial towns.\nAmnesty International accused Mr Orban's government of an \"unprecedented crackdown\" on NGOs, \"including public smearing, criminal investigations, office raids and the seizure of equipment and a politically motivated audit\".\nA statement from the human rights group said the German chancellor should call on Mr Orban to stop \"practices coined in Russia [that] are gaining currency in an EU member state\".", "url": "https://www.bbc.com/news/blogs-eu-31090085"}