{"authors": ["Ken Banks and Ben Philip", "www.facebook.com"], "date_download": "2025-04-26 04:19:34", "date_modify": "2025-04-26 04:19:34", "date_publish": "2025-03-03 16:20:56", "description": "Steven Johnson - who died in Aberdeen in 2023 - was said to be a \"loving and amazing\" father.", "filename": "news_articles_cx2een1qg69o_1745641174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c0bc/live/61b24b80-f80e-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2een1qg69o_1745641174.html", "title": "Man guilty of killing father-of-seven in Aberdeen street attack", "title_page": "Man guilty of killing father-of-seven in Aberdeen street attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been found guilty of killing a \"loving\" father-of-seven after a street attack in Aberdeen.\nDerek Pearson, 47, denied attacking Steven Johnson in the city's Carmelite Lane in March 2023. Mr Johnson, 50, fell and struck his head and later died in hospital.\nCCTV showed the victim speaking to a woman - who was Pearson's partner at the time - in a bar. The three ended up outside, where the altercation happened.\nA jury found Pearson - who had lodged a special defence of self defence - guilty by a majority after a five-day trial at the High Court in Aberdeen.\nThe indictment stated that Pearson assaulted Mr Johnson on 12 March 2023 at Carmelite Lane and killed him.\nThe court heard how Pearson pushed him against a wall, pinned him to the wall with his elbow, repeatedly struggled with him, and repeatedly punched him on the head.\nThis caused Mr Johnson to fall and strike his head off a stationary vehicle and the road and became unconscious.\nHe was so severely injured that he died on 14 March 2023 in Aberdeen Royal Infirmary.\nPearson was also found guilty of assaulting his then partner on the night in question.", "url": "https://www.bbc.co.uk/news/articles/cx2een1qg69o"}