{"authors": ["Nadine Yousif", "www.facebook.com"], "date_download": "2025-04-26 03:57:17", "date_modify": "2025-04-26 03:57:17", "date_publish": "2025-03-04 14:10:36", "description": "Tuesday's address comes after the president implemented sweeping tariffs on his top trade partners and paused aid for Ukraine.", "filename": "news_articles_cd65gj95e8jo_1745639837.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/86ae/live/03beff20-f90b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65gj95e8jo_1745639837.html", "title": "Trump to deliver 'big' televised speech to US Congress", "title_page": "Trump to deliver 'big' televised speech to US Congress  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump will deliver a speech to Congress on Tuesday evening, in which he is expected to discuss new US trade tariffs and the war in Ukraine.\nThe speech, scheduled for 21:00 EST (02:00 GMT), will be Trump's first major address since his return to the White House, although it is not an official State of the Union talk.\nIts theme will be the \"Renewal of the American Dream\", Fox News reports, and it will have four sections: Trump's accomplishments, the economy, funding for border security and Trump's plans for global peace.\nIt comes after Trump imposed sweeping tariffs on Canada and Mexico, prompting a fall in stock markets, while pausing all US aid to Ukraine.\nTrump teased the speech in a post on his Truth Social network on Monday, writing: \"TOMORROW NIGHT WILL BE BIG. I WILL TELL IT LIKE IT IS.\"\nWhite House spokeswoman Karoline Leavitt said it would be \"must-see TV\".\nShe told Fox News that the address \"will celebrate his extraordinarily successful first month in office while outlining his bold, ambitious and common sense vision for the future\".\nSince returning to the White House in January, Trump has drastically upended US policy on key foreign policy and trade issues.\nHe has also created a Department of Government Efficiency (Doge), fronted by tech titan Elon Musk, to dramatically shrink the size of the federal government in a bid to cut costs and balance the books. Doge has since instructed controversial mass layoffs in the federal workforce across departments.\nDemocratic lawmakers have invited several workers who were fired as a result of Doge cuts to Tuesday's address.\nAmong them are a disabled veteran who was recently fired from her position at a veterans affairs office, a National Park Service ranger and Kyle Rahn, a disabled army veteran who was recently let go from the US Cybersecurity and Infrastructure Security Agency.\nDemocrats were also planning to invite several people who received life-saving treatment through Medicaid, the US government-funded health insurance programme for those on low incomes.\nThe White House said First Lady Melania Trump would be joined by several guests at the speech.\nThey include a teenager from Texas who was the victim of computer-generated deepfake videos; the widow and daughters of Corey Comperatore, the Pennsylvania firefighter who was killed by the gunman who shot President Trump in July 2024; and the mother and sister of Laken Riley, the nursing student whose murder inspired a law requiring the detention of illegal immigrants charged with certain crimes.\nAlso on the Trump guest list are community volunteers, a former high school athlete who campaigns against transgender women playing in female sports competitions, and Marc Fogel, a teacher who attempted to enter Russia with medical cannabis and was sentenced to 14 years in prison but was released in a prisoner exchange in February.\nTrump's speech will be followed by a rebuttal from Democrats, which will be delivered by newly-elected Michigan Senator Elissa Slotkin. Chuck Schumer, the Senate minority leader, said Slotkin would \"offer a bold vision of hope, unity, and a brighter future for everyone, not just the wealthy few at the top\".\nWhile Tuesday's speech appears to be like a traditional State of the Union (SOTU) address, it is expected to be slightly different.\nSOTU addresses are typically given by the president annually in late January or early February, and serve as an update on events of the previous year as well as future agendas.\nTuesday's remarks, however, are what is called a joint address to Congress - a formal speech to all US lawmakers that a president could deliver at any time to discuss matters of national importance.\nThe practice of calling for a joint address to Congress at the beginning of a presidential term was pioneered by Ronald Reagan, and has been carried out by every US president since.", "url": "https://www.bbc.co.uk/news/articles/cd65gj95e8jo"}