{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 04:23:46", "date_modify": "2025-04-26 04:23:46", "date_publish": "2025-03-03 13:04:19", "description": "Silt in Douglas Harbour coupled with low spring tides cause disruption to Manx ferry sailings.", "filename": "news_articles_cn7vz8x8zyyo_1745641426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dac5/live/7a960c60-f82f-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vz8x8zyyo_1745641426.html", "title": "Tidal conditions in Douglas Harbour lead to ferry disruption", "title_page": "Tidal conditions in Douglas Harbour lead to ferry disruption - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Changes have been made to the Isle of Man's ferry schedule after the Manxman became temporarily grounded in Douglas Harbour on Saturday evening.\nThe Isle of Man Steam Packet Company said high atmospheric pressure meant the tides were lower than expected, and the vessel became stuck while manoeuvring.\nFollowing checks of the vessel by divers, it resumed its services on Saturday with a two-hour delay to its evening sailing to Heysham.\nHowever, changes have been made to the timings of the vessel's evening and overnight sailings and cancelled two crossings on Tuesday.\nInfrastructure Minister Michelle Haywood said sediment had been washed into Douglas Harbour by the river, which \"tends to deposit\" in an area where the ferry turn, which had led it to be \"sucked into the mud\".\nShe said a large dredging programme to \"clear away the silt\" was needed and would be investigated, but in the meantime the Steam Packet would continue to amend its sailings to avoid a similar situation during the \"particularly high spring tides\".\nThe ferry firm confirmed the Manxman had become \"stuck on mud for a short time and was not able to continue its berthing operation until the tide came up sufficiently\".\nIt said there had been \"no danger to passengers, crew or the vessel, and throughout the delay those onboard were kept informed of the situation by the master\".\nManaging Director Brian Thompson said the operator would conduct a review of what happened and it would work with all parties including the infrastructure department's harbours division to \"ensure we don't see a repeat\".", "url": "https://www.bbc.co.uk/news/articles/cn7vz8x8zyyo"}