{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:36:53", "date_modify": "2025-04-26 06:36:53", "date_publish": "2025-02-26 06:41:23", "description": "Age UK says the struggle pensioners face heating their homes in the winter is \"deeply concerning\".", "filename": "news_articles_czje339rwz7o_1745649413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/25a4/live/661cdfb0-f37b-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czje339rwz7o_1745649413.html", "title": "Age UK calls on government to support elderly with heating costs", "title_page": "Age UK calls on government to support elderly with heating costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity that supports elderly people is calling on the government to do more to keep pensioners warm.\nCambridgeshire-based Age UK said three out of four pensioners admitted they were cold in their own homes throughout January.\nThis week a petition was handed in at Downing Street with 650,000 signatures - including more than 63,000 from the East of England - urging the government to help older people stay warm at home.\nMelanie Pittock, chief executive at Age UK Cambridgeshire & Peterborough, called the situation \"deeply concerning\", adding that \"no-one should have to choose between heating and other essentials\".\nThe charity highlighted pressures being felt by older people this winter with two in five (41%) pensioners saying they had recently had to cut back on heating or powering their home.\nThe charity said, for those pensioners on low to modest household incomes of £20,000 or less, a massive one in three (35%) said their home was too cold most or all of the time.\nEarlier, the charity strongly opposed the cut to the winter fuel payments and warned that at least 2.5 million older people would struggle without it.\nThis meant since last year, those not on pension credit or other means-tested benefits would no longer get the annual winter fuel payments, worth between £100 and £300.\nPreviously, the prime minister Sir Kier Starmer defended the decision to scrap universal winter fuel payments, saying it was needed to repair what he claims is a £22bn \"hole\" in the public finances.\nOn Tuesday, it was announced energy bills for a typical household could rise by more than £100 a year in April under regulator Ofgem's new cap - a higher-than-expected increase adding pressure on people's finances.\nCharities said the price increase would be a painful blow for billpayers.", "url": "https://www.bbc.co.uk/news/articles/czje339rwz7o"}