{"authors": ["Anne Soy", "www.facebook.com"], "date_download": "2025-04-26 04:34:02", "date_modify": "2025-04-26 04:34:02", "date_publish": "2025-03-03 01:55:20", "description": "DR Congo's prime minister tells the BBC her government will not sit down with the militants.", "filename": "news_articles_cnvz5g420mdo_1745642042.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9292/live/ab1c63e0-f6b6-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cnvz5g420mdo_1745642042.html", "title": "DR Congo conflict: Government continues to rule out direct talks with M23", "title_page": "DR Congo conflict: Government continues to rule out direct talks with M23 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Despite growing international pressure, the Democratic Republic of Congo is standing firm on its decision not to have direct talks with the M23 rebel group that has made major advances in the east of the country in recent months.\nLast week, the UK government added to calls for the group to be part of an \"inclusive dialogue\" to help find a political solution to the conflict.\nBut in an interview with the BBC, DR Congo Prime Minister Judith Suminwa Tuluka said her government wants to negotiate with neighbouring Rwanda, which it accuses of backing the M23.\nAt least 8,500 people have been killed since fighting escalated in January, according to the Congolese authorities.\nHundreds of thousands have also been forced from their homes amid the chaos triggered by the fighting, in which UN experts and others see Rwanda as having a key role.\n\"The fact remains that the aggressor of the territorial integrity and of the sovereignty of the Democratic Republic of Congo is Rwanda,\" Suminwa Tuluka said, citing a UN experts' report from last year that stated that between 3,000 and 4,000 Rwandan troops had crossed into Congolese territory and were fighting alongside the M23.\nPeace talks brokered by Angola hit a deadlock last December after Rwanda demanded that the Congolese government talk directly to the M23.\nThe rebel group then advanced swiftly, taking control of the cities of Goma and Bukavu in January and February.\nAt a joint East and Southern African mediation effort last month, regional leaders called for a ceasefire, the exit of \"uninvited foreign armed forces\" from Congolese territory and also urged for direct negotiations between \"state and non-state parties... including M23\".\nRwandan President Paul Kagame did not deny the presence of his troops in DR Congo when asked about it. \"I don't know,\" he said in a CNN interview.\nThe conflict across the border has seen his country, often viewed as a darling of the West, now lose favour fast across the board.\nPressure is mounting on it to withdraw its forces from Congolese soil.\n\"But it has not yet effectively done so,\" Suminwa Tuluka said.\nShe welcomed US sanctions imposed on Rwandan government minister James Kabarebe, saying they would help \"put pressure on the aggressors\". Rwanda, however, dismissed them as \"unjustified and ineffective in resolving the crisis\".\nThe European Commission for its part has suspended \"defence consultations\" and placed \"under review\" a memorandum of understanding it signed last year with Rwanda on raw materials.\nThe Congolese prime minister welcomed the EU Commission's decisions, saying that \"the illegal exploitation of resources - that is one of the causes of the conflict\".\nDR Congo accuses Rwanda of illegally exploiting its mineral deposits in the east of the country, which Rwanda denies.\nAdding to the chorus against Rwanda, the UK said last week that among other measures it would pause aid except the money meant for the poorest and most vulnerable groups, unless the country withdraws its troops, engages \"meaningfully\" in talks and a ceasefire is achieved.\nRwanda described the decision as \"punitive\", saying it was unreasonable to expect it to compromise its national security.\nThe Congolese prime minister said that Rwanda was ignoring all the calls to withdraw its troops.\n\"So, who is standing in the way of [resolving the conflict]? It is not the Congolese government,\" she argued.\nRwanda has previously acknowledged deploying its forces \"defensively and offensively\" during the ongoing conflict, claiming the right to defend its territory.\nIt has also repeatedly accused the Congolese government of harbouring and working with the militant group the Democratic Forces for the Liberation of Rwanda (FDLR), whose members include fighters from the 1994 Rwandan genocide.\nAsked about that, Suminwa Tuluka denied that the Congolese army works with FDLR rebels, but said her country would engage in a process of \"neutralising\" the militants.\nWhen it came to what would solve the problem if direct talks with the M23 were ruled out, the prime minister said that along with negotiating with Rwanda, the answer was simple for what would guarantee a ceasefire.\n\"Ensure that Rwandan troops withdraw from Congolese territory and that their M23 stop killing the Congolese populations,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cnvz5g420mdo"}