{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:53", "date_modify": "2025-05-19 14:25:53", "date_publish": "2015-03-13 12:24:08", "description": "An Angus metalwork firm is fined £7,000 after a worker suffered serious leg injuries when he was crushed under a half-tonne A-frame.", "filename": "news_uk-scotland-tayside-central-31872220_1747664753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81625000/jpg/_81625707_forfar.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-tayside-central-31872220_1747664753.html", "title": "Forfar firm fined after worker crushed by heavy metal", "title_page": "Forfar firm fined after worker crushed by heavy metal - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Forfar metalwork firm has been fined £7,000 after a worker was crushed under a half-tonne A-frame.\nRobert Ramsay suffered serious injuries after the construction slipped off a forklift truck and landed on his legs.\nThe 19-year-old agency worker, from Dundee, had been at Forfar Galvanisers Ltd for four months at the time of the incident on 20 November 2013.\nThe firm was fined £7,000 at Forfar Sheriff Court after admitting breaching health and safety regulations.\nMr Ramsay was helping move the large frame outdoors in the rain with a colleague when it slipped off the forklift and crushed his legs.\nHe suffered bruised bones, trapped nerves, muscle and tissue damage, and was off work for several months. He has since made a full recovery.\nA Health and Safety Executive investigation found the Carseview Road firm did not have a safe system of work in place for the task, as a procedure for moving ungainly loads introduced in 2007 following a similar incident had not been implemented.\nHSE inspector Niall Miller said Mr Ramsay's injuries \"could have been so easily prevented\".\nHe added: \"It was clear there was a risk of death or serious injury if the A-frame fell from the forklift truck, particularly as the company was aware of previous incidents of loads falling. Had the company acted on this and the advice of HSE, Mr Ramsey would not have been injured.\"", "url": "https://www.bbc.com/news/uk-scotland-tayside-central-31872220"}