{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 04:32:32", "date_modify": "2025-04-26 04:32:32", "date_publish": "2025-03-03 05:29:22", "description": "It's the biggest night in Hollywood - here are some of the top moments from Sunday night's show.", "filename": "news_articles_cwye725dj2xo_1745641952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/048f/live/36097ef0-f80d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwye725dj2xo_1745641952.html", "title": "Adrien Brody and Halle Berry's kiss, Mikey Madison's win, and Wicked stars defying gravity: Top Oscars moments", "title_page": "Adrien Brody and Halle Berry's kiss, Mikey Madison's win, and Wicked stars defying gravity: Top Oscars moments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There was an audible gasp from journalists in the winners' room when Mikey Madison was announced as the best actress winner.\nDemi Moore was the favourite for much of this campaign. Things did shift after Madison's Bafta win, but the race remained incredibly tight.\nIn the end, it was Madison's night. It marked an incredible moment for a 25-year-old actress who was relatively unknown before her role in Anora.\nThis is exactly the type of rags-to-riches story that awards ceremonies love – and the film itself celebrates.\nThe film tells the story of sex worker Anora, who has a whirlwind ill-fated romance with the spoilt son of a Russian oligarch.\nEdie Turquet, one of the young female dancers and strippers in the film , texted me to say it was \"insane\" that a film about sex workers could win best picture at the Oscars.\nShe added that she hoped it would \"shift or at least challenge\" perspectives of people towards her community.\nOn the red carpet, there was quite a moment when Halle Berry ran up to Adrien Brody and gave him a big kiss.\nIt recreated a moment at the 2003 Academy Awards, when Brody - having just won best actor for his performance in The Pianist - turned and kissed Berry, who had presented the award to him.\nShe told Variety, external: \"I had to pay him back\".\nSpeaking to Extra, external, she added that the only reason she did it was because Brody's girlfriend, Georgina Chapman, \"was fine\" with it.\nThe Oscars wrote on X, external with a clip of the kiss: \"A reunion 22 years in the making\".\nActor Adam Sandler was in on the ongoing jokes about his typically casual attire.\nEarly on in the night, host Conan O'Brien called him out, saying he was \"dressed like a guy playing video poker at 2am\".\n(For reference, Sandler was in the audience wearing a blue hoodie and shorts, an ensemble that looked more at home on the basketball court).\nFollowing a playful back and forth between the two, the actor walked into the aisle of the theatre and said he was \"leaving\" before going over to Timothée Chalamet and shouting his surname, in the way he previously did on Saturday Night Live.\nChalamet, ever good natured, laughed along.\nThis year's Oscars race has played out against the grim backdrop of devastating wildfires in Los Angeles, which killed 29 people.\nThe Grammys and Golden Globes both made the fires a central theme of the show.\nThe Academy Awards mentioned it only a handful of times, signalling Hollywood is moving on.\nThere was, however, one powerful moment, when O'Brien welcomed some of the firefighters who fought the blazes on stage. He called them \"heroes\", with the audience clapping and giving the emergency workers a standing ovation.\nO'Brien then said there are some jokes that even he isn't brave enough to tell - and asked some of the firefighters to read them out instead.\nLA Fire Captain Erik Scott read one joke off a teleprompter that said their hearts go out to everyone who lost their homes - including the makers of Joker 2.\nIt got a big laugh and O'Brien called it the best joke delivery of the night.\nIt was Zoe Saldaña's first Oscar, winning best supporting actress for Emilia Pérez - a musical about a transgender Mexican drug lord - and it marked one of the most powerful and emotional speeches of the night.\nShe broke down in tears immediately, crying out \"Mommy\", to her mother in the audience.\n\"I am floored by this honour,\" she wept, paying tribute to her fellow nominees for their \"loving and community\", saying \"I will pay it forward\".\nPraising the film's cast and crew, she got emotional as she talked about her family.\n\"Everything brave, outrageous and good I've ever done in my life is because of you,\" she said, praising her husband, his \"beautiful hair\" and their three sons.\n\"My grandmother came to this country in 1961 - I am a proud child of immigrant parents with dreams and dignity and hardworking hands.\n\"I'm the first American of Dominican origin to accept an Academy Award and I know I won't be the last.\n\"Getting an award where I got to sing and speak in Spanish - this is for my grandmother.\"\nAs ever, politics reared its head during Sunday night's ceremony.\nHost O'Brien made a quip about how Anora was \"having a good night\", before saying: \"I guess Americans are excited to see somebody finally stand up to a powerful Russian.\"\nO'Brien must have been writing his monologue up to the very last minute, because the joke appeared to be a nod to the White House spat between Ukrainian President Volodymyr Zelensky and US President Donald Trump.\nMeanwhile, the No Other Land documentary team descended on the red carpet wearing Palestinian scarves and Kufiya. Their film is set in the occupied West Bank. After they won for the film, the team took the stage and called out US policy in the region.\nKill Bill star Daryl Hannah also veered into politics while on stage. She referenced the war in Ukraine, saying \"Slava Ukraini\", the country's salute, as she presented an award.\nBut one person wasn't mentioned.\nHere in liberal Hollywood, you may have expected jokes and barbs toward Donald Trump - but his name didn't come up even once.", "url": "https://www.bbc.co.uk/news/articles/cwye725dj2xo"}