{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:06", "date_modify": "2025-05-19 15:17:06", "date_publish": "2017-07-17 00:00:00", "description": "Knife amnesty across Devon and Cornwall, and more", "filename": "news_live_uk-england-devon-40591970_1747667826.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-devon-40591970_1747667826.html", "title": "BBC Local Live: Devon & Cornwall on Monday 17 July 2017", "title_page": "BBC Local Live: Devon & Cornwall on Monday 17 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nLive updates for Devon and Cornwall have finished for the day, but we'll be back at 08:00 on Tuesday with the latest news, sport, travel and weather.\nDon't forget Spotlight on BBC One later. There will also be news through the night on your BBC Local Radio station.\nTeenager found dead at school asked 'What would you do if I killed myself?'\nThe boyfriend of a teenager found dead at school said she asked him \"What would you do if I killed myself?\" the night before her death, an inquest has heard.\nLewis Simpson said both he and 16-year-old Dagmara Przybysz had got upset about false rumours that they were going to split up.\nThey had a Facebook call about it and Dagmara said she was so angry she \"wanted to jump off a bridge\", the inquest heard.\nBut by the end of the call she seemed calmer, he said.\n\"She never said she was worried about racism or that it was an issue at school,\" he said.\nWhen asked about her death he told the court \"I can't explain it\".\nThe hearing will continue tomorrow.\nRough sleeping strategy to 'work with people before they are on the streets'\nTamsin Melville\nPolitical Reporter, BBC Radio Cornwall\nHelping people before they end up sleeping rough on the streets is a key part of a new strategy launched in Cornwall.\nMore than £1m is being invested in various agencies in tackling what's been a rising problem in the county.\nGovernment figures suggest 99 people were sleeping on the county's streets one night last November, but it's estimated the real number over a month is more like 130.\nDave Brown, from homeless charity St Petroc's, said such initiatives had to \"look at people who are likely to sleep rough, as well as rough sleepers\".\nOf the new initiative, he said: \"It's much more of a joined-up approach [with other agencies] than some of the approaches we've had in the past.\"\nConcerns over home life of girl found dead in school toilets, inquest heard\nSian Davies\nBBC News Online\nThere were concerns over the home life of a girl who was found dead in a school toilet, an inquest heard.\nSusan Kent, a pastoral support manager at Pool Academy, Redruth, had made a social care referral over the home life of Dagmara Przybysz, 16.\nMs Kent said that Dagmara had told her about an incident when her mother Ewelina Przybysz got \"very angry\" at her and her sister over a broken mobile phone.\nDagmara's mother threw their school things around the kitchen and told them to clean them up - and when they did not do it fast enough she threw their things around a bedroom and they were given lines to do, Ms Kent told the inquest in a statement.\nDagmara also told Ms Kent she had eaten soap before to hurt herself.\nIn another incident, Dagmara had come to school with a bruise on her head, which she said was because she had blacked out on the stairs at home.\nMs Kent had called her parents to suggest they should take Dagmara to the doctor, but they did not as she seemed fine, the court heard.\nDagmara told Ms Kent that her parents wanted her to do well in everything - and a grade C would not be good enough. She said she got a grade C in her Polish GCSE and they thought she should have got an A*.\nMs Kent said that before her death things had improved at home and Dagmara had got a place at Truro College to study photography, and seemed excited.\nThe inquest continues.\nSelf-build housing schemes get government support\nBBC Politics\nThe government says self-build housing schemes - like one in Cornwall - can help solve the housing crisis.\nThe comments came in response to North Cornwall Conservative MP Scott Mann, who's been praising a local initiative in the House of Commons.\nMr Mann pointed out that Cornwall had recently received £5m for \"community-led self-build housing\"\nHe asked Communities Secretary Sajid Javid if he supported neighbourhood plans instead of providing social landlord properties, \"so we can not only provide the ladder but also the spade, the spirit level and the trowel too\".\nCommunities Secretary Sajid Javid said he agreed that more must be done so that supply meets demand.\nGirl found hanged in school toilets 'seemed happy' and spoke about prom shortly before death\nSian Davies\nBBC News Online\nA girl who was found dead in a school toilet told her friend to go on to their next lesson as she didn't want to make her late shortly before her death, a inquest heard.\nMegan Drake said in a statement that she left maths class with Dagmara Przybysz, 16, on the day of her death.\nShe said Dagmara \"seemed happy\" during the lesson at Pool Academy, Redruth, as she had been accepted for a photoshoot with a big company, and the pair discussed what they would wear to the school prom.\nShe said that Dagmara \"did seem upset\" about an incident during her PE lesson the day before, when she had got frustrated with other pupils not taking a game of rounders seriously.\nWhen they left maths class, Dagmara said that she would be late for the next lesson.\nMegan offered to wait for her but Dagmara said she didn't want to make her late, and went into the toilet near their maths classroom, the inquest heard.\nMegan went on, but 25 minutes later Dagmara had still not arrived at their science lesson, the inquest heard.\nThe inquest continues.\nPlymouth Raiders takeover: 'We're fans,' new bosses say\nBBC Sport\nThe new bosses of the Plymouth Raiders basket ball team hope to appoint a new head coach by the end of the month, with the new season starting on 30 September.\nThe Basketball League side have been sold to businessmen Richard Mollard and Ross Mackenzie for an undisclosed sum.\nBoth Mollard, whose father Keith helped found the team in 1983, and Mackenzie are former Raiders players themselves.\n\"We're fans - we want to bring the club closer to the fans,\" Mackenzie told BBC Spotlight.\n\"If we can do that and we can move the club forward and break some good news for the fans, then I think really our job in some respects will be well under way.\"\nGirl who died in school toilet entered more than 90 minutes before being found\nSian Davies\nBBC News Online\nA girl who was found dead at school entered the toilet where she died an hour and a half before being found, CCTV showed.\nA summary of the CCTV footage was read out at the inquest into the death of Dagmara Przybysz, who died at Pool Academy, Redruth on 17 May last year.\nThe cause of death was hanging, the inquest heard.\nThe 16-year-old entered the toilets after leaving a maths lesson at 12.14 BST.\nThere were more than 20 movements of other pupils in and out of the toilets before two girls knocked on a nearby office door at 13.50 to alert a member of staff, the inquest heard.\nThe inquest continues.\nRaiders bought by Plymouth businessmen\nBBC Sport\nBritish Basketball League side Plymouth Raiders have been sold to businessmen Richard Mollard and Ross Mackenzie for an undisclosed sum.\nRaiders have missed out on the play-offs for the past four seasons, and head coach Johnny White left in May after his coaching CV was queried.\nThe pair have taken over from Bob Widdecombe, who was owner for 10 years.\n\"It's been a bit of a rollercoaster the last couple of years, but this is why Ross and I are putting the heads above the parapet, to actually do something about it,\" Mollard (pictured left) told BBC Spotlight.\nTeenager had 'told lies' before death\nA teenager found dead at a school in Cornwall had previously \"told lies\" as a way to get attention, an inquest has heard.\nDagmara Przybysz, 16, had lied about taking tablets and drinking alcohol on the morning of her death, her parents said.\nThey said she did not appear ill and did not smell of alcohol, and she went to school at Pool Academy, Redruth, as usual.\nThe school was not told about what had happened that morning, her parents told the inquest in Truro.\nThey said she had cut herself once after hearing pupils talking about it [cutting themselves], but it did not happen again after having a conversation with her mother Ewelina Przybysz.\nHer mother told her a better way to get attention would be to excel at school, the court heard.\nThe inquest continues.\nGirl found dead at school heard 'horrible' things about her, inquest hears\nSian Davies\nBBC News Online\nThe boyfriend of a girl found dead at a school said she had mentioned pupils making comments about her being Polish, an inquest has heard.\nLewis Simpson said he didn't know how much of the bullying towards his girlfriend Dagmara Przybysz, 16, was related to racism or jealousy because she was good looking.\nLewis attended Redruth School while Dagmara attended Pool Academy, where she was found dead in May 2016.\nHe said she had told him she heard girls in the changing rooms at school saying \"horrible\" things about her taking PE too seriously after a lesson the day before her death, the court heard.\nOf comments she made the night before her death about \"wanting to jump off a bridge\", Lewis said: \"I didn't think it was serious, I didn't think it was attention seeking, I think she was angry and she was just lashing out.\"", "url": "https://www.bbc.com/news/live/uk-england-devon-40591970"}