{"authors": ["Tim Dale", "www.facebook.com"], "date_download": "2025-04-26 03:55:33", "date_modify": "2025-04-26 03:55:33", "date_publish": "2025-03-04 16:03:07", "description": "James Dowson is jailed for sexual assaults in North and West Yorkshire.", "filename": "news_articles_ckgy5r3rgz6o_1745639733.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29c6/live/b2253090-f8dc-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgy5r3rgz6o_1745639733.html", "title": "Serial rapist jailed for life for string of offences", "title_page": "Serial rapist jailed for life for string of offences - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been given a life sentence for a string of sexual offences.\nJames Dowson, of no fixed address, was found guilty in November of two counts of rape against a girl under 16 and five counts of indecent assault against a girl under 14, both in North Yorkshire.\nHe was also separately convicted of 10 further offences including rape and sexual assault in the West Yorkshire area.\nAt a sentencing hearing at Bradford Crown Court on Monday, Dowson, 35, formerly of Harrogate, was told he must serve a minimum of 12 years and 247 days before he could apply for parole.\nDowson had targeted a girl in North Yorkshire when she was eight and abused her over a period of five years.\nThe victim, now an adult, said in her impact statement she remembered feeling \"confused\" and had \"lost respect for herself\".\n\"During the abuse at its worst when I was 13, I felt helpless. I knew it wasn't right, but I didn't know what to do,\" she said.\n\"It was an out-of-body experience. I didn't actually process what had happened and the severity of it until I was 15 or 16 years of age.\n\"I became angry. I struggled to sleep at night. Certain smells and certain mannerisms from others would cause flash backs.\"\nShe said Dowson's conviction and sentencing had been the \"final hurdle\" to closing this chapter of her life.\n\"I get to live my life now and watch my babies grow up and be present in the moment. I can wake up every day knowing that I have done the right thing,\" she said.\nDet Con Abigail Garford from North Yorkshire Police said it had been \"incredibly difficult\" for the victim to report the abuse.\n\"She bravely detailed the horrific abuse that Dowson inflicted on her that has now led to his conviction.\n\"I know that she now feels a weight has been lifted of her shoulders since he was found guilty.\"\nJudge Ahmed Nadim praised the woman and another victim who both gave evidence against Dowson.\n\"Without them giving evidence, a very dangerous offender would not have met justice and by taking the brave decision that they have and by giving evidence in the manner that they have, they have contributed to our society being a safer place.\n\"They are for that reason deserving of an enormous gratitude from this court on behalf of the society as a whole.\"\nDowson was also issued with indefinite restraining orders against the two victims and given a sexual harm prevention order.\nThe sentences include a total of two years for the offences in North Yorkshire and the remainder for the offences committed in West Yorkshire.", "url": "https://www.bbc.co.uk/news/articles/ckgy5r3rgz6o"}