{"authors": ["Anna Whittaker", "www.facebook.com"], "date_download": "2025-04-26 08:01:38", "date_modify": "2025-04-26 08:01:38", "date_publish": "2025-02-26 17:25:43", "description": "Sarah Coombes MP is calling for harsher punishments on drivers who use the plates to evade the law.", "filename": "news_articles_cwyepjz81j1o_1745654498.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bae4/live/dd6013f0-f45a-11ef-8420-bd21274f258f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyepjz81j1o_1745654498.html", "title": "West Bromwich MP calls for review into 'ghost' car number plates", "title_page": "West Bromwich MP calls for review into 'ghost' car number plates - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP is calling for a crackdown on \"ghost\" number plates she says some in the West Midlands are using to get away with dangerous driving.\nAlso known as stealth plates, the registrations have a reflective coating to ensure they cannot be read by police cameras.\nLabour MP for West Bromwich Sarah Coombes wants fines of up to £1,000 and six-point penalties for drivers who use them to evade the law.\nShe said: \"The drivers using these ghost plates have gone under the radar for too long, but now they've been rumbled and it's time to crack down on them.\"\nOn Wednesday, she introduced the issue under a Ten Minute Rule Bill, which allows backbench MPs to make their case for a new bill within the set timeframe.\nCoombes, who has been campaigning on road safety since her election in July 2024, said 1,000 people were killed or seriously injured on roads in the West Midlands each year.\n\"There are a select minority of people who think they are above the law and that by using a ghost plate they can get away with running red lights, drink-driving, speeding and much worse,\" Coombes said.\n\"It cannot be right that these drivers are not facing the consequences of their actions and are creating so much danger for everyone else.\"\nDuring the reading, she said the plates were \"widely known\" on social media and could be purchased for as little as £30.\nShe added the current fine of £100 for drivers caught using them was too lenient.\n\"That's less than you get for a speeding ticket,\" Ms Coombes said. \"So for those who want to drive recklessly around our roads or commit even worse crimes, why wouldn't you when the penalty is so small?\"", "url": "https://www.bbc.co.uk/news/articles/cwyepjz81j1o"}