{"authors": ["Alison Stephenson", "www.facebook.com"], "date_download": "2025-04-26 07:40:17", "date_modify": "2025-04-26 07:40:17", "date_publish": "2025-02-27 12:27:22", "description": "Barrett David Wilson Homes says opening the road sooner would have been an \"unnecessary health and safety risk\".", "filename": "news_articles_c14jjx42kk7o_1745653217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0f47/live/2ed36190-f4f3-11ef-be5b-6577f7dded4d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jjx42kk7o_1745653217.html", "title": "Developer given more time to finish Okehampton housing link road", "title_page": "Developer given more time to finish Okehampton housing link road - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A property developer has been given more time to complete a link road to ease traffic congestion around a new housing development.\nBarrett David Wilson Homes (BDWH) should have opened the road before the 100th home at Okement Park in Okehampton was occupied but said it was unsafe to do so.\nWest Devon Borough Council's development management and licencing committee agreed at a meeting on Tuesday to change the contract to give the developer more time.\nIt now has until the 200th home is occupied or by 30 September - which comes first.\nA BDWH spokesperson said \"heavy plant machinery\" needed to cross the road during the next phase of building the 775-property development and opening it earlier would cause \"a significant and unnecessary health and safety risk\".\nAs part of the new agreement, it will contribute £100,000 towards a footpath to create a safe route to a primary school - 40% of the total cost.\nCouncillor George Dexter, who has been campaigning for the footpath, said he considered the updated agreement an \"excellent compromise\".\nHowever, councillor Tony Leech said he was disappointed an experienced national housebuilder failed to predict the safety issues and said it was vital the road opened before the new Okehampton Interchange station opened in spring 2026.\nLeech said there was \"little option\" but to agree to the change and added: \"We must make very sure the developer keeps to the letter of the agreement at this time.\"\nThe development, to the east of Okehampton, includes a primary school, small shops and open space, as well as cycling and walking links to the town centre.\nDevon County Council, which is the highways authority for the area, did not object to the updated agreement.", "url": "https://www.bbc.co.uk/news/articles/c14jjx42kk7o"}