{"authors": ["Paul Moseley", "www.facebook.com"], "date_download": "2025-04-26 04:32:30", "date_modify": "2025-04-26 04:32:30", "date_publish": "2025-03-03 05:29:25", "description": "A student's union backs licensing changes to improve taxi safety, including CCTV cameras.", "filename": "news_articles_c0mwwm919gpo_1745641950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f66/live/b9c8e7e0-f5d7-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mwwm919gpo_1745641950.html", "title": "Union warns of student fears over taxi safety", "title_page": "Union warns of student fears over taxi safety in Norwich - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A students union said it welcomed the idea of improved safety measures in taxis, as a consultation on new licensing rules continued.\nNorwich City Council is looking at additional measures including the possibility of compulsory CCTV cameras in cars and more criminal record checks for drivers.\nA survey by the University of East Anglia Students Union (UEASU) found 24% of those taking part said they felt \"somewhat unsafe\" or \"very unsafe\" using cabs in Norwich after dark.\nCraig Dimbleby, chairman of the Norwich Black Cabs Association, said he supported the idea of new licensing rules, adding passenger safety was \"paramount\".\nNathan Wyatt, UEASU welfare officer, said the case of a minicab driver who sexually assaulted three women last year was still fresh in students' minds.\n\"There was a really horrible incident in Norwich and that scared a lot of people,\" he said.\nMr Wyatt, who revealed 73 students completed its survey, believed local taxis were \"regulated quite well, but equally I think there are safety measures that could be put in place to protect students and the drivers\".\nAlexandra Ashby said whenever she got into a cab she was \"vigilant and aware of a possible threat\".\nThe 23-year-old student said she had never experienced \"anything horrific\" in a taxi but remained cautious when using them.\n\"If there are things like extra training, more background checks and there's camera footage evidence – this is going to make me and lots of other women feel more comfortable,\" she said.\nMr Dimbleby said his association had been calling for stricter licensing rules for some time, and said safety was \"paramount\".\n\"There's no-one more important than the public,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c0mwwm919gpo"}