{"authors": ["Isaac Ashe", "www.facebook.com"], "date_download": "2025-04-26 06:18:31", "date_modify": "2025-04-26 06:18:31", "date_publish": "2025-03-01 07:26:18", "description": "A stockpile of medicine can pose a risk, Leicestershire Partnership NHS Trust has warned.", "filename": "news_articles_crlxdrd7381o_1745648311.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d12d/live/8e23aa80-f5e6-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlxdrd7381o_1745648311.html", "title": "Leicestershire NHS trust asks people to surrender unused and unwanted medicine", "title_page": "Leicestershire NHS trust asks people to surrender unused and unwanted medicine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An NHS trust is asking people to hand in unused or unwanted medication to reduce the risks that stockpiles can cause.\nLeicestershire Partnership NHS Trust is running its first medicines amnesty for Leicester, Leicestershire and Rutland throughout March, when drugs can be handed to pharmacies.\nHealth experts at the trust say removing medicines from homes reduces the risk to \"children, the confused, or people who are impulsive or temporarily distressed\".\nMat Williams, suicide prevention lead at the trust, said nationally, 23% of deaths from people taking their own lives were from overdoses, making it the second most common method.\nHe said: \"In 2023, there were 28 suicides in Leicester, Leicestershire or Rutland due to overdoses, and many other people will have caused themselves significant harm through overdoses which did not prove to be fatal.\n\"There are also risks of accidental overdoses. The risks of these events occurring is greatly reduced if no-one has a stockpile of medicines at home.\"\nMr Williams said out-of-date prescriptions could become ineffective, while some medicines might no longer be appropriate.\nHe added: \"You should only ever be using medicine which is prescribed for your current condition.\"\nFamilies, friends and carers are being asked to help patients return medicines, and to surrender medication prescribed for people who have died.\nPharmacies across Leicester, Leicestershire and Rutland will then ensure medicines handed in are disposed of safely, the trust added.", "url": "https://www.bbc.co.uk/news/articles/crlxdrd7381o"}