{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:04:41", "date_modify": "2025-04-26 04:04:41", "date_publish": "2025-03-03 18:25:06", "description": "Sir Keir Starmer has been criticised by SNP MPs over his relationship with US President Donald Trump.", "filename": "news_articles_czdnymemn39o_1745640281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/891c/live/31d45590-f861-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czdnymemn39o_1745640281.html", "title": "Starmer dismisses 'keyboard warriors' after Flynn criticism", "title_page": "Starmer dismisses 'keyboard warriors' after Flynn criticism  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prime Minister Sir Keir Starmer has dismissed criticism from \"keyboard warriors\" after SNP Westminster leader Stephen Flynn accused him of \"weak\" leadership.\nFlynn raised concerns about the Labour chief's relationship with US President Donald Trump after he took aim at Ukrainian leader Volodymyr Zelensky in an extraordinary White House meeting.\nStarmer, who had already rejected calls from the SNP to scrap an unprecedented second state visit for Trump, made the comment in the House of Commons.\nIt came after Flynn had commended him for hosting a summit of European and other Nato leaders to show support for Ukraine.\nScotland's First Minister John Swinney also praised Starmer for hosting the summit.\nIt was called following a heated exchange between Trump and Zelensky in the Oval Office on Friday. Trump accused the Ukrainian president of \"gambling with World War Three\".\nAs European leaders expressed their support for Zelensky, SNP MPs criticised Starmer over his relationship with Trump.\nPosting on X, external, Flynn described the prime minister's response as \"weak\", adding that he \"had better get back up off his knees and revoke\" an offer of a state visit.\nZelensky has since been welcomed to Downing Street by Starmer. The Ukrainian president attended the leaders' summit, where attendees unveiled a four-point plan to work with Ukraine to end the war.\nIn Parliament on Monday, Scottish Labour MP Gregor Poynton asked the prime minister about Flynn's social media posts, calling them \"juvenile and childish\".\nStarmer replied: \"Different people will respond in different ways. Some will take to the keyboard as warriors.\n\"I picked up the phone to world leaders to try and resolve the situation.\"", "url": "https://www.bbc.co.uk/news/articles/czdnymemn39o"}