{"authors": ["Katie Waple", "www.facebook.com"], "date_download": "2025-04-26 06:57:31", "date_modify": "2025-04-26 06:57:31", "date_publish": "2025-02-28 14:09:02", "description": "The disruption follows the decommissioning of a mast site in Wheatley before Christmas.", "filename": "news_articles_cd9221xw9jyo_1745650651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/70ae/live/b5d53b40-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd9221xw9jyo_1745650651.html", "title": "Henley and Thame MP disappointed over mobile service disruption", "title_page": "Henley and Thame MP disappointed over mobile service disruption - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP has expressed how \"disappointed\" he is over the ongoing disruption of mobile phone services in his area.\nFreddie van Mierlo, MP for Henley and Thame, said his constituents had been left without \"adequate\" network coverage for several months.\nThe mast in Wheatley, Oxfordshire, was removed in December 2024 at the request of the landower.\nA spokesperson for EE said it was \"aware of a signal issue that is affecting some customers\" and its engineers were \"looking for a new location\" for the mast.\nMr van Mierlo said many other constituents on different networks have heard nothing or simply been told there was not a problem.\nHe said: \"It is simply not good enough that operators can decommission a service before an alternative is in place or that they have no obligation to warn people that this might happen.\n\"Many people rely on their phones to carry out their business, feel safe or simply connect with family.\n\"Having a whole village cut off for weeks on end is not acceptable.\"\nThe MP is urging affected EE customers to contact the provider directly to explore options for compensation or alternative services.\nHe added: \"I am aware that some residents have been offered a reduction in their bills or early release from contracts to switch to another provider.\"\nA spokesperson for EE apologised for \"any inconvenience caused\".\nIn a statement, they said: \"Over the past month, our engineers have been working with the landowner to arrange a date to access the area and start building the equipment needed for the new mast.\n\"Barring any unforeseen delays, we expect to access the area and start building the equipment in the next few weeks and the mast to be on-air by the end of February.\"", "url": "https://www.bbc.co.uk/news/articles/cd9221xw9jyo"}