{"authors": ["Rory O'Reilly", "www.facebook.com"], "date_download": "2025-04-26 06:40:51", "date_modify": "2025-04-26 06:40:51", "date_publish": "2025-03-02 13:28:14", "description": "It happened at a block of flats on Roden Street off the Donegall Road on Thursday night.", "filename": "news_articles_c2er3ke2yjno_1745649651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c90/live/b3531010-f759-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2er3ke2yjno_1745649651.html", "title": "Family 'scared' after racist attack on new home", "title_page": "South Belfast: Family 'scared' after racist attack on new home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman and her daughter have been left badly shaken after the home they were due to move into in south Belfast was attacked and daubed in racist graffiti.\nIt happened at a block of flats on Roden Street off the Donegall Road on Thursday evening.\nThe family, who came to Northern Ireland in the past few years, were due to move into the property this weekend before their social housing provider contacted them to say it was not safe.\nMohamed Ahmed, from the Horn of Africa People's Aid Northern Ireland (HAPANI) said the family is \"devastated\".\nThe family, who are now back in their previous accommodation, are being supported by HAPANI.\nMr Ahmed, the group's chairperson, says the family now feel very vulnerable.\n\"They're really worried. They're scared, and to be honest, it's not something they were expecting,\" he said.\n\"They were hoping to settle down and be part of the community and now they're devastated.\"\n\"I'm worried about their mental health, they don't speak any English at all, so the language barrier is a big problem as well. I think they're in a really bad place,\" he added.\nIn recent years, there have been a number of racist attacks in south Belfast.\nPSNI Supt Finola Dornan described the incident as \"completely unacceptable\", adding that it did not \"reflect the local community and its people\".\n\"The heartbreaking reality behind this headline is a young mother and her child who were looking forward to moving into a new home, a place where they should have felt both safe and welcome,\" she said.\n\"They have understandably been left badly shaken and distressed.\"\nSupt Dornan emphasised that \"hate crime has no place in our society\".\n\"We will be proactive in our approach to ensure justice for victims,\" she said.\nSuleiman Abdulahi, the founder of HAPANI, believes the housing strategy in Northern Ireland needs to change so there is enough to cater for all those who need affordable housing.\n\"If there was no scarcity of resources or housing in Northern Ireland then we could accommodate everyone and those concerns can be stopped,\" he said.\n\"But whenever there is not enough houses and there's this housing crisis then the scapegoat is vulnerable families and it's happened multiple time.\"", "url": "https://www.bbc.co.uk/news/articles/c2er3ke2yjno"}