{"authors": ["James FitzGerald", "www.facebook.com"], "date_download": "2025-04-26 04:26:53", "date_modify": "2025-04-26 04:26:53", "date_publish": "2025-03-03 11:19:52", "description": "The reported directive from the defence secretary comes during an American push to end the war in Ukraine.", "filename": "news_articles_c2er34w0jgdo_1745641613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8919/live/4aaff730-f821-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2er34w0jgdo_1745641613.html", "title": "Hegseth orders pause in offensive US cyber operations against Russia", "title_page": "Hegseth orders pause in offensive US cyber operations against Russia - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump's administration is pausing its offensive cyber operations against Russia, officials say, as a diplomatic push continues to end the war in Ukraine.\nThe reasoning for the instruction has not been publicly stated, and it is not clear how long the halt might last. The defence department has declined to comment.\nThe directive reportedly came before Trump ended up in a televised row with Ukrainian President Volodymyr Zelensky at the White House on Friday.\nSince returning to office, Trump has markedly softened the American position towards Moscow in eagerness to reach a deal to end the war - following Russia's full-scale invasion more than three years ago.\nHe appeared to echo Moscow's justification for starting the war and announced plans to meet his counterpart President Vladimir Putin. The US has also sided with Russia during recent votes at the United Nations related to the war.\nAt the same time, Trump has labelled Zelensky a dictator, and accused the other man of \"gambling with World War Three\" during Friday's blow-up in the Oval Office.\nThe halt of American cyber operations against Russia came from Defence Secretary Pete Hegseth in new guidance to US Cyber Command, officials told the BBC's US partner CBS News.\nIt leaves questions over the strength of the US fightback in the cyber arena against alleged Russian hacking, election interference and sabotage efforts that have targeted the Western nations which have sided with Ukraine during the war.\nHundreds or thousands of personnel could be affected by Hegseth's order, according to The Record, a cybersecurity publication which first reported the news, external. Operations aimed at strengthening Ukraine's digital defences are likely to be among those affected.\nIn a statement, a senior defence department official said they would not comment on the issue due to operation concerns, but added: \"There is no greater priority to Secretary Hegseth than the safety of the Warfighter in all operations, to include the cyber domain.\"\nNational Security Adviser Mike Waltz denied that a policy change had been discussed, but acknowledged in an interview on CNN that there would be \"all kinds of carrots and sticks to get this war to an end\".\nSenior members of Trump's team - who last month met their Russian counterparts in Saudi Arabia, with the Ukrainians excluded - have recently defended their change of approach to Moscow more broadly.\nSecretary of State Marco Rubio told ABC: \"You're not going to bring [the Russians] to the table if you're calling them names, if you're being antagonistic. That's just the president's instincts from years and years and years of putting together deals.\"\nIn a statement to the New York Times, senior Democrat Chuck Schumer, the Senate minority leader, said the move was \"a critical strategic mistake\".\nTrump seemed to be giving Putin \"a free pass as Russia continues to launch cyberoperations and ransomware attacks against critical American infrastructure\", Schumer added.", "url": "https://www.bbc.co.uk/news/articles/c2er34w0jgdo"}