{"authors": ["Christian Fuller", "www.facebook.com"], "date_download": "2025-04-26 06:47:15", "date_modify": "2025-04-26 06:47:15", "date_publish": "2025-03-01 12:29:03", "description": "A warning has been issued by police after nine people in Kent lost a combined £1m in a scam.", "filename": "news_articles_c23401jnvkvo_1745650035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b46/live/d1595f70-f695-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c23401jnvkvo_1745650035.html", "title": "Kent Police issue fraud warning after £1m lost in crypto scam", "title_page": "Kent Police issue fraud warning after £1m lost in crypto scam - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A warning has been issued by police after nine people in Kent lost a combined £1m in a cryptocurrency scam.\nThe victims' personal details were shared online after a data leak and their information was used to generate \"fake Action Fraud reports\", police said.\nAction Fraud is the UK's national reporting centre for fraud and cyber crime.\nDet Sgt Darryll Paulson said: \"Don't be embarrassed about reporting a scam, it only takes a second to be distracted and fall victim.\"\nSomeone claiming to be a police officer contacted individuals and reassured them an investigation had been launched, police said.\nThe fake officer told victims to \"expect a call from the crypto wallet host\".\nThey then received a second call from a person who said they were \"a security officer\" and asked for their seed phrase -12 or 24 words that allows users to manage their cryptocurrency wallets.\nThe fraudsters then used that information to steal funds and transfer money, police said.\nDet Sgt Paulson urged anyone contacted by someone claiming to be from a \"crypto host\", or from the police, not to give out personal details.\n\"Scammers are becoming increasingly more calculating in their methods to defraud their victims... and will often create urgency in the situation, such as telling them they need to act now to stop their funds from being stolen,\" Det Sgt Paulson said.", "url": "https://www.bbc.co.uk/news/articles/c23401jnvkvo"}