{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 03:56:14", "date_modify": "2025-04-26 03:56:14", "date_publish": "2025-03-04 15:14:38", "description": "Council agrees renovating or demolishing the Ocean Room in Gorleston are not financially viable.", "filename": "news_articles_c8rkp5147m8o_1745639774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2460/live/bed55000-f908-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkp5147m8o_1745639774.html", "title": "Selling Gorleston's Ocean Room is best plan, council says", "title_page": "Selling Gorleston's Ocean Room is best plan, council says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has voted to sell off a former nightclub and entertainment venue because the cost of doing anything else has been deemed too risky and expensive.\nGreat Yarmouth Borough Council (GYBC) said it was owed £47,100 in unpaid rent by Ocean Room Ltd, which went into administration in March 2024.\nA report to the council's cabinet dismissed proposals to renovate, demolish or redevelop the Ocean Room in Gorleston on financial grounds.\nCouncil portfolio holder for property and assets, Graham Plant, said: \"Given its location, the building has suffered a level of degradation.\"\nIn a paper presented to the council's cabinet, it said the cost of demolishing the building - to make way for redevelopment - would cost an estimated £500,000.\nIt also suggested the cost of repairs would be £800,000 based on a non-invasive survey, but that costs could increase if additional problems were found.\nThe council said it had marketed the building for lease, but only one formal offer was submitted.\nThe report said: \"Should the council lease the building in its current condition, any rent-free period is likely to be substantial, to enable a future operator to recover the cost of remediation.\"\nThe final option, which was recommended, said: \"Disposal of the site - this is the lowest risk option to the council but will remove the potential revenue stream from the building for the future.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkp5147m8o"}