{"authors": ["Michelle Fleury & Natalie Sherman", "www.facebook.com"], "date_download": "2025-04-26 07:42:21", "date_modify": "2025-04-26 07:42:21", "date_publish": "2025-02-26 20:54:39", "description": "\"The EU was formed to screw the United States,\" Trump says.", "filename": "news_articles_c05ml3q2gn7o_1745653341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/14da/live/2cf783d0-f47e-11ef-96b5-cb16e833b61d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05ml3q2gn7o_1745653341.html", "title": "Trump says 25% tariffs on EU will be announced soon", "title_page": "Trump says 25% tariffs on EU will be announced soon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump has said he is planning to hit goods made in the European Union with tariffs of 25%,claiming the bloc was created to \"screw the United States\".\n\"We'll be announcing it very soon,\" he told reporters at an appearance with members of his cabinet. \"It'll be 25% generally speaking and that will be on cars and all other things.\"\nThe European Union said it would react \"firmly and immediately against unjustified tariffs\".\nTrump's appearance sparked questions about his trade plans, as he also appeared to raise the possibility that looming tariffs on imports from Mexico and Canada, set to come into force on 4 March, might be postponed again.\nAn administration official later said the deadline remained in place, with the president planning to review Mexico and Canada actions related to border security over the coming days.\nTrump made clear on Wednesday that trade with Europe also remained in his sights, repeating his criticism of European policies, which he said put American exporters of food products and cars at a disadvantage.\n\"The European Union was formed to screw the United States - that's the purpose of it and they've done a good job of it,\" he said. \"But now I'm president.\"\nThe EU rejected the president's claims, saying the creation of a regional market had made doing business in Europe easier for American firms.\n\"It has been a boon for the United States,\" a spokesperson for the commission said. \"We're ready to partner if you play by the rules. But we will also protect our consumers and businesses at every turn. They expect no less from us.\"\nTariffs are a tax on imports that is collected by the government and paid for by the companies bringing in the goods.\nTrump has vowed to use the levies to boost US manufacturing, raise money and push other countries to change policies he opposes.\nBut there are concerns such measures could fuel inflation, with warnings that Americans could face higher prices for goods as businesses may choose to pass on some or all of the cost of tariffs to customers.\nSince taking office, he has raised tariffs of 10% on goods from China and taken steps to hit other imports with duties, including directing his staff to develop recommendations for custom \"reciprocal\" tariffs for each country.\nBut he has also suspended some of those plans, leaving many businesses and analysts guessing as to whether he is prepared to carry out his threats.\n\"The 25% threat that he threw out today is in line with the high end of the range that he previously indicated,\" said Tobin Marcus, head of US policy and politics at Wolfe Research.\n\"It's a number that's concerning - certainly should be concerning - for the trans-Atlantic trade relationship, but not totally out of the blue.\"\nAntonin Finkelnburg, of the Federation of German Wholesale, Foreign Trade and Services which represents businesses, told the BBC that a 25% tariff on EU goods entering the US would created a \"difficult\" but \"not an impossible\" situation for Germany's economy.\n\"We are worried but we shouldn't be afraid,\" he told the BBC's Today programme.\nGermany's car industry's products are popular in the US.\nMr Finkelnburg said many German car manufacturers were \"already producing in the American market, so they wouldn't be directly affected by the tariffs\", but said tariffs would still drive up prices.\n\"The car parts that are manufactured in to those cars are crossing the borders of Mexico and Canada several times so that already is driving the prices up,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c05ml3q2gn7o"}