{"authors": ["Chris Goreham", "Laura Devlin", "www.facebook.com"], "date_download": "2025-04-26 06:20:42", "date_modify": "2025-04-26 06:20:42", "date_publish": "2025-03-01 06:30:46", "description": "Megan McCley, 31, has an aggressive cancer and in January was told she had three months to live.", "filename": "news_articles_cdell10z8d4o_1745648442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c156/live/a6c503a0-f5e5-11ef-86a6-15c2bb2c0119.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdell10z8d4o_1745648442.html", "title": "Wymondham woman with terminal cancer given help for wedding", "title_page": "Wymondham woman with terminal cancer given help for wedding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 31-year-old woman with terminal cancer said it was \"overwhelming in the best way\" that her wedding was being planned by a charity in just two weeks.\nMegan McCley, of Wymondham, Norfolk, has ocular melanoma - an aggressive type of cancer in her eye - and in January was told she had three months to live.\nShe and fiance Dimitar Kashchive are due to tie the knot on 14 March, with Norfolk businesses stepping in to help.\n\"This has come together incredibly quickly - we are arranging a wedding in the span of around two weeks and the kindness is insane,\" said Miss McCley.\nWhile enjoying the \"fun parts\" such as choosing flowers, she and Mr Kashchive can focus on spending time together and with their families, she added.\n\"It's now come to a point where time is very precious to us, and marriage is very important,\" she said.\n\"The important aspects are making sure that the people who we want to be there are there, that everybody is comfortable and that it's a good experience where we're able to be present with everybody.\"\nGift of a Wedding plans nuptials in a matter of days for people with terminal or life-shortening illnesses, and reaches out to anyone willing to help.\n\"It's overwhelming in the best way - it's exciting, it's something to look forward to,\" added Ms McCley.\n\"There are so many different medical appointments and things to attend to, and I do feel quite poorly a lot.\n\"Every day we'll see, 'oh the cake is confirmed, the photographer is confirmed,' and that's one more person that has dedicated their time and energy to help, so it's a massive lift.\"\nHer husband-to-be agreed.\n\"It's an incredible opportunity for us at a time when we thought we didn't have the time to do this,\" he said.\n\"It takes away some of the practical nitty-gritty of everyday life so I can focus on quality time with Megan and our families.\"", "url": "https://www.bbc.co.uk/news/articles/cdell10z8d4o"}