{"authors": ["Ed Barnes", "Rumeana Jahangir", "www.facebook.com"], "date_download": "2025-04-26 04:08:01", "date_modify": "2025-04-26 04:08:01", "date_publish": "2025-03-02 20:22:44", "description": "They hope to create a cultural and hospitality hub which can bring investment and people to Birkenhead.", "filename": "news_articles_c1kjv4rk483o_1745640481.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a0e4/live/9714fad0-f79f-11ef-be25-e92e4d3ccfe0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjv4rk483o_1745640481.html", "title": "Birkenhead businesses reveal independent cultural quarter vision", "title_page": "Birkenhead businesses reveal independent cultural quarter vision - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Businesses in part of Birkenhead said they wanted to turn their area into something that emulates the success of Liverpool's Baltic Triangle.\nThey hope to create an independent quarter - including bars and restaurants as well as creative, arts and music spaces - in Argyle Street and Market Street, with funding from the government and local authorities.\nSpeaking at the Argyle Independent Quarter project's launch, they said they wanted to build on what is already in the area and to fill as many empty retail unit as possible.\nThe once-thriving area declined after World War Two. Now, though, some locals said it was on the up, with several businesses being attracted.\nThe Baltic Triangle, a former industrial area around Liverpool's Jamaica Street, is now home to independent creative and digital businesses.\nThe Argyle Independent Quarter is being spearheaded by five local businesses.\nWirral Council has invested £44,000 to boost the area's visual appeal and to allow shops to improve their look.\nRuth Rundle, who founded Wish Upon a Party in 2022, said her party-organising company had painted its premises pink after receiving £5,000 from the local authority.\n\"It's not a huge amount of money,\" she acknowledged. \"But the difference it's made to brighten up that whole side of the street is huge and it's now a visible business to people. People want to come to use it because we look exciting.\"\nBut Chris Lee, who runs business hub Start Yard, said that while the Argyle Quarter had much potential, Liverpool was still a huge rival because of its night-life, bars and restaurants.\n\"We want people to identify there is something happening here,\" he said.\n\"That people think 'I should move my business here'.\n\"If we want to attract and keep employers and get them living on the Wirral, we need to help Birkenhead deliver that.", "url": "https://www.bbc.co.uk/news/articles/c1kjv4rk483o"}