{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 06:57:18", "date_modify": "2025-04-26 06:57:18", "date_publish": "2025-02-28 14:24:50", "description": "Barnsley Council has struggled to reduce backlog of bin collections since cold snap in January.", "filename": "news_articles_ce8vv99m661o_1745650638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a6a/live/98fdeb90-f5dd-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vv99m661o_1745650638.html", "title": "Barnsley green bin collection delayed to tackle backlog", "title_page": "Barnsley green bin collection delayed to tackle backlog - council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Garden waste collection has been postponed by a month amid widespread disruption to bin collections in Barnsley.\nResidents across the borough have been plagued by delays to services since December, with Barnsley Metropolitan citing snow and freezing temperatures as reasons for the backlog earlier this year.\nIn an update issued this week, the authority apologised and said catching up on delayed collections had \"taken longer than we'd hoped\" but said grey and brown bin collections were now back on track.\nThe council said it had decided to delay the spring relaunch of the green bin service until April.\nIt is usually offered from March.\nThe council said rumours that the disruption was down to a new manager introducing new rules were \"incorrect and misleading\".\nIt said in addition to catching up with collections, crews were currently undertaking training as part of the safety and quality programme launched last year.\nWhile the council acknowledged it made crews work slower, it meant they were working more safely and avoidable accidents had reduced.\nMatt O'Neill, executive director for growth and sustainability, said: \"Our focus is to make sure our crews protect their health and safety and go home to their families at the end of the day.\n\"The waste collection industry is one of the most dangerous industries in the UK and has seen too many people lose their lives, so we won't be complacent or risk the welfare of our employees or the public.\"\nResidents are asked to continue to put their grey, blue and brown bins out on their normal scheduled day, and to leave any delayed bins out.\nGarden waste can be taken to the council's household waste recycling centres.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/ce8vv99m661o"}