{"authors": ["Soutik Biswas", "www.facebook.com"], "date_download": "2025-04-26 04:02:47", "date_modify": "2025-04-26 04:02:47", "date_publish": "2025-03-03 22:45:27", "description": "India faces a crucial choice in modernising its air force. But is a cutting-edge US fighter jet the answer?", "filename": "news_articles_cdjyyd7nw1zo_1745640167.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b637/live/71964360-f806-11ef-91b8-0d570da7afdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyyd7nw1zo_1745640167.html", "title": "F-35 or Su-57: India's billion-dollar fighter jet face-off", "title_page": "F-35 or Su-57: India's billion-dollar fighter jet face-off - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "India faces a crucial choice in modernising its air force - but is a cutting-edge American fighter jet the answer?\nDuring his Washington visit last month, Prime Minister Narendra Modi met US President Donald Trump, who announced they were \"paving the way\", external for India to acquire F-35s, a jet primarily sold to close allies and partners.\nThe F-35 is a \"fifth-generation\" multi-role fighter jet with advanced sensors, AI-driven combat systems and seamless data-sharing capabilities. Built to evade radar, it's the most sophisticated jet in the skies - but at $80m a pop, also one of the most expensive. (Stealth is a key characteristic of a \"fifth-generation\" fighter.)\nMany believe that with its fighter squadrons dwindling and China's military growing, India faces a high-stakes choice: splurge on the state-of-the-art but costly F-35 from the US or strengthen defence ties with Russia through local production of its most advanced stealth fighter jet Sukhoi Su-57.\nExperts believe the reality is more nuanced, with the US-Russia \"dogfight\" largely a media hype – fuelled more recently by the appearance of both jets at Asia's biggest air show, Aero India, in the southern city of Bengaluru last month.\nTrump's F-35 offer seems more \"symbolic\" than practical, driven by his push to sell US weapons, according to Ashley J Tellis, a senior fellow at the Carnegie Endowment for International Peace.\nIntegrating a \"fifth generation\" aircraft into the India air force (IAF) plans - centred on the homegrown Advanced Medium Combat Aircraft (AMCA) and more Rafales - would be challenging, especially without co-production rights. Being developed by India's Defence Research and Development Organisation (DRDO), the AMCA is India's own stealth fighter.\n\"It is unlikely that the F-35 will be offered for co-production to India - any acquisition will likely be a straightforward sale. This is unlikely, among other things, to sit well with Modi's emphasis on making in India and the significant end-user monitoring in the event of an F-35 sale will likely not be welcomed by India either,\" Mr Tellis told me.\nIndia's challenges with the F-35 are its steep cost, heavy maintenance and operational issues - the jet's availability is around 51% for the US Air Force, according to security expert Stephen Bryen, author of a Substack column, Weapons and Strategy, external. \"The question is whether India is willing to invest billions of rupees in the F-35, knowing it could do better buying the Russian jet.\"\nBut many dismiss the Su-57 as a real contender, noting that India exited the decade-long programme to co-produce the jet with Russia in 2018 over disputes on technology transfer, cost-sharing and specifications.\nTo be sure, India's air force is ageing and short on fighter jets.\nIt operates 31 fighter and combat squadrons - mostly Russian and Soviet-era aircraft - far below the sanctioned 42. A key challenge is finding a long-term replacement for the Sukhoi-30, the IAF's versatile workhorse from Russia.\nChristopher Clary, a political scientist at the University of Albany, recently pointed to unsettling data from the ISS Military Balance for India: between 2014 and 2024, China added 435 fighter and ground attack aircraft, Pakistan gained 31, while India's fleet shrank by 151.\nIndia's planned fighter jet expansion is largely homegrown, with plans to acquire over 500 jets, external, mostly light combat aircraft.\nOrders for 83 Tejas Mark 1A - an agile multirole homegrown fighter - are confirmed, with another 97 expected to be ordered shortly. Meanwhile, the heavier, more advanced Mark 2 is in development. The homegrown stealth jet remains at least a decade away.\nIndia also has plans to buy 114 multirole fighter jets under the IAF's $20bn Multi-Role Fighter Aircraft (MRFA) programme requiring foreign jets to be built in India under a transfer of technology deal - its biggest hurdle.\nStalled since 2019, the Indian government is looking at a transparent and non-controversial procurement process after it faced criticism over the acquisition of 36 Rafales in a government-to-government deal. Five jets are in contention, with Rafale leading as it is already in service with the IAF.\nExperts say India's air force modernisation faces three key hurdles: funding, delays and dependence on foreign jets.\nDefence spending has shrunk in real terms, external. The foreign fighter jets programme risks a drawn-out fate. While India prioritises home-made, DRDO's delays force stopgap foreign purchases, creating a repeating cycle. Breaking it requires delivering a capable homegrown jet on time. Deliveries are also delayed due to a holdup in supplies of General Electric's F-404 engines for the jets.\nA key challenge is the mismatch between the defence ministry's vision and the IAF's needs, says Rahul Bhatia, an analyst at Eurasia Group, a geopolitical risk consulting firm.\nThe Tejas Mark 1 faced early scepticism from the air force, leading to upgrades like the Mark 1A and Mark 2. \"But the decades-long development cycles frustrate the armed forces, especially as their requirements keep evolving as newer technologies become available, which in turn contributes to further delays,\" Mr Bhatia told me.\nEven the Indian Air Force chief AP Singh has made no secret of his frustration, external over delays.\n\"I can take a vow that I will not buy anything from outside or I will wait for whatever is developed in India, but it may not be possible if it does not come at that pace [on time],\" Air Marshall Singh told a seminar recently.\n\"At the moment, we all know that we are very badly off when it comes to numbers [of fighters]. And the numbers which were promised are also coming a little slow. So, there will be a requirement to go and look for something which can quickly fill up these voids,\" he said, referring to the delayed Tejas Mark 1A deliveries, which were supposed to begin last February but have yet to start.\nIndia's clear priority is a homegrown stealth fighter, with more than $1bn already committed to its development. \"A foreign stealth jet would only be considered if India's immediate threat perception shifts,\" says Mr Bhatia. China has two so-called stealth fighters - the J-20 and J-35 - but they likely fall short of US standards.\nMost experts believe India will choose neither the American nor Russian fighters. \"In the short term, as seen in past conflicts, emergency buys may fill gaps. The medium-term focus is co-production, but the long game is clear - building its own,\" says Mr Bhatia.\nFor India, the future of airpower isn't just about buying jets - it's about building them, ideally with a strong Western partner. But for that vision to succeed, India must deliver its homegrown fighters on time.", "url": "https://www.bbc.co.uk/news/articles/cdjyyd7nw1zo"}