{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:04:39", "date_modify": "2025-04-26 07:04:39", "date_publish": "2025-02-28 06:42:28", "description": "The grant thresholds, which depend on household income in Jersey, will increase by 5.2%.", "filename": "news_articles_cr7220prn9do_1745651079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fc04/live/e6b78380-f52b-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr7220prn9do_1745651079.html", "title": "Increases made to higher education grants for Jersey students", "title_page": "Increases made to higher education grants for Jersey students - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Higher education grants for Jersey students have been increased.\nA ministerial order was approved and signed by the minister for education and lifelong learning Deputy Rob Ward will come into effect from 1 September.\nThe amount a student can receive typically depends on household income thresholds and these have increased by 5.2%, while maintenance and tuition fee grants have gone up 2.5% and 3.2% respectively.\nMr Ward said it was important to review the support available for students to continue their education post the age of 18.\nHe said: \"These changes ensure we are in line with increases to the cost of living and will help to reduce any cost-based barriers that may prevent our young people from continuing their studies, particularly when the majority of our young adults study in the UK and so living at home to reduce those costs isn't an option.\"\nCurrently, full maintenance grants can be claimed by families that earn less than £50,000 a year but this will be increased to £52,600.\nThe thresholds for other grants have also changed:\nThe maximum tuition grant will increase from £110,000 to £115,720\nThe clinical component grant will increase from £100,000 to £105,200\nA grant to attend an interview will increase from £50,000 to £52,600\nA grant for specialist equipment for a student with a disability will increase from £90,000 to £94,680\nIn addition, the maximum maintenance grant will increase from £8,915 to £9,138 and the maximum tuition grant will increase from £9,250 to £9,535.", "url": "https://www.bbc.co.uk/news/articles/cr7220prn9do"}