{"authors": ["Yasmin Rufo", "www.facebook.com"], "date_download": "2025-04-26 06:46:25", "date_modify": "2025-04-26 06:46:25", "date_publish": "2025-03-01 13:57:16", "description": "The garden will show how carbon helps to sustain life on Earth and the scale of the climate crisis.", "filename": "news_articles_cn89v3de683o_1745649985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a090/live/5d814190-f685-11ef-95cd-af6d5ff721ba.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn89v3de683o_1745649985.html", "title": "Kew Gardens to open Carbon Garden that focuses on climate crisis", "title_page": "Kew Gardens to open Carbon Garden that focuses on climate crisis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kew Gardens will open a new \"ground-breaking\" garden in July that explores the urgent need to tackle climate change.\nThe Carbon Garden will show how carbon helps to sustain life on Earth, the scale of \"the climate crisis\" and how nature can be used to combat it.\nIt aims to inspire visitors to take actions in their everyday lives to support the planet.\nIt will also educate visitors on how plants and fungi act as \"natural allies in climate repair\" as they capture carbon and restore balance.\nThe garden, approved by Richmond Council last year, will have a striking display of plants reflecting the dramatic rise in average global temperatures over time.\nA feature showing layers of soil, a rocky outcrop and a layer of coal in the earth's crust with fossilised plants will then reveal the hidden world of carbon underground.\nThere will also be a dry garden with drought-resistant plants to show how nature can be used to adapt to climate change and a rain garden which will highlight ways to manage water flow, prevent soil erosion, reduce flooding and put moisture back into soil.\nA fungi-inspired pavilion will be built in the centre of the garden using sustainable materials. It will have a sloping canopy directing rainwater into the rain garden, along with sheltered space to host school visits and community activities.", "url": "https://www.bbc.co.uk/news/articles/cn89v3de683o"}