{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:35:45", "date_modify": "2025-04-26 07:35:45", "date_publish": "2025-02-27 15:05:33", "description": "Ten local authorities with a combined population of more than a million people set their tax rates.", "filename": "news_articles_cpdeezw4z92o_1745652945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4f52/live/fdd4f330-f513-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpdeezw4z92o_1745652945.html", "title": "More Scottish councils agree tax increases up to 13%", "title_page": "More Scottish councils agree tax increases up to 13% - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councils with a combined population of more than a million people have agreed council tax rises of up to 13% following the lifting of a nationwide freeze.\nCouncillors in Stirling, Renfrewshire, East Ayrshire, South Ayrshire, Dundee, Argyll and Bute, Aberdeenshire, Angus, Clackmannanshire and Dumfries and Galloway have been meeting to confirm their plans.\nThe biggest agreed percentage increase of the day came in the smallest authority with Clackmannanshire councillors voting for a 13% rise.\nTax rates have been frozen or capped for much of the past two decades but with no such restrictions in place many areas have already seen rises well above the latest inflation rate of 3%.\nProtesters gathered outside some of the meetings to make known their concerns about potential cuts or spending proposals in their areas.\nThe 13% rise came in Clackmannanshire and was agreed by 11 votes to six.\nIt will see the charge on a band D property go from £1,410.96 to £1,594.38.\nIt could still be surpassed by proposals in Orkney for a 15% rise.\nAnother big increase came in Angus with 11% agreed taking the band D level to £1,461.52 which the council highlighted was still one of the lowest in the country.\nCouncillors in Aberdeenshire also backed a double-figure percentage rise of 10%.\nThe motion was passed 43 votes to 21 for a rival proposal, with one no vote and takes the annual bill for a band D premises to £1,532.76.\nThe council also approved indicative increases of 8% for both 2026/27, and 2027/28.\nArgyll and Bute Council agreed a 9.9% rise to £1,625.64 on a band D home.\nLeader Jim Lynch said: \"Setting the council's budget has been extremely difficult.\n\"We all use council services every day, but every year council budgets face multi-million pound gaps.\n\"Decisions made today protect the council services we all rely on from drastic budget cuts, and make investment possible in services that we know matter to local people.\"\nIn Renfrewshire, a 9.5% rise was agreed (taking band D properties to £1,572,61 for 2025/26) while Stirling Council voted 12 to 11 for an 8.8% rise (£1,611.87 on band D from £1,481.50).\nThe increase in East Ayrshire was set at 8% (£1,606.44 on band D) with the same percentage rise in South Ayrshire (£1,569.41) and Dundee (£1,605.34).\nAfter a lengthy meeting, Dumfries and Galloway councillors voted through spending plans which will see a 9% rise (£1,454.91).\nLocal authorities say the increases are necessary, despite an improved Scottish government settlement, in order to safeguard services after many years of restricted funding.\nIn the current financial year, the government subsidised a nationwide council tax freeze but that ends in April.\nOther than 2023-24 - when many councils raised rates by about 5% - this is the first time for almost 20 years when a big increase has really been possible.\nThe Scottish government says it is dealing with \"enormous financial pressures\" but is \"investing in, and supporting, local authorities\".\nIt said there was an extra £1bn of funding for councils in its 2025/26 budget - taking the total government grant to about £15bn.\nLast week, tax rises up to 10% were confirmed for another group of councils with a combined population of about two million.\nThe latest round means that the majority of the 32 Scottish authorities have now agreed increases which range from 6% in South Lanarkshire up to a proposed 15% in Orkney.", "url": "https://www.bbc.co.uk/news/articles/cpdeezw4z92o"}