{"authors": ["Grace Wood", "Mick Lunney", "www.facebook.com"], "date_download": "2025-04-26 04:28:05", "date_modify": "2025-04-26 04:28:05", "date_publish": "2025-03-02 10:31:12", "description": "Loud bangs heard in Sheffield on Sunday were part of a planned chimney demolition, police say.", "filename": "news_articles_cz03d4r88k5o_1745641685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b4a4/live/7057c470-f74c-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz03d4r88k5o_1745641685.html", "title": "Clay Wheels Lane explosion was controlled demolition", "title_page": "Clay Wheels Lane explosion was controlled demolition - police - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Loud explosions heard in Sheffield on Sunday morning were part of a planned chimney demolition, South Yorkshire Police has confirmed.\nSeveral chimneys at a site on Clay Wheels Lane were demolished at about 08:00 GMT and the noises were \"nothing to worry about,\" a force spokesperson said.\nOne resident, who did not know the demolition was due to take place, said her \"whole house was literally shaking\" and the sound was \"worrying\".\nStannington councillor Penny Baker said she understood many residents had not been informed of the plans to demolish the towers.\nRachel Gordon, from Oughtibridge, said she had heard an \"enormous loud explosion followed by a few others\".\nShe said she feared her house would fall down and her neighbour had run outside fearful that his house had also been damaged.\n\"Now that we know what it is I'm relieved,\" she said.\nA Middlewood resident, who asked not to be named, said she heard an \"industrial type alarm and a small bang\" followed by \"two huge explosions\".\nShe said: \"It shook the house and rattled the windows and I saw all the birds fly out of the trees.\n\"It was frightening, both my children who had been asleep came running in, my daughter thought it was a gas explosion at someone's house.\n\"We went into the street with other residents but no one knew what was going on.\"", "url": "https://www.bbc.co.uk/news/articles/cz03d4r88k5o"}