{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:47", "date_modify": "2025-05-19 14:47:47", "date_publish": "2015-02-07 22:14:15", "description": "The electoral commission in Nigeria delays the 14 February presidential election by six weeks in a move criticised by the opposition.", "filename": "news_world-africa-31221545_1747666067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80861000/jpg/_80861408_80861407.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31221545_1747666067.html", "title": "Nigeria postpones presidential vote over security", "title_page": "Nigeria postpones presidential vote over security - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nigeria has postponed its 14 February presidential election by six weeks because of security fears.\nElection commission chief Attahiru Jega said the delay until 28 March was necessary because of a lack of troops available to protect voters.\nNigeria's military has been battling an insurgency by Boko Haram militants in the north-east of the country.\nThe opposition described the delay as a \"setback for Nigerian democracy\".\nFormer military ruler Muhammadu Buhari, from the All Progressives Congress (APC) is challenging incumbent President Goodluck Jonathan, who heads the People's Democratic Party (PDP).\nCorrespondents say it looks set to be a tight race between the two.\n\"The commission cannot lightly wave off the advice of the nation's security chiefs,\" said Mr Jega.\n\"Calling people to exercise their democratic rights in a situation where their security cannot be guaranteed is a most onerous responsibility.\"\nHowever, officials from the APC accuse the military of forcing the electoral commission into the delay to help the sitting president's campaign.\nAPC chairman John Odigie-Oyegun said the \"highly provocative\" move was a \"major setback for Nigerian democracy\".\nMeanwhile, US Secretary of State John Kerry said the US was \"deeply disappointed\".\n\"Political interference with the Independent National Electoral Commission is unacceptable, and it is critical that the government not use security concerns as a pretext for impeding the democratic process,\" he said.\nThe ruling PDP party praised the postponement, and said the commission was facing \"numerous logistical problems and numerous internal challenges\", AP news agency reported.", "url": "https://www.bbc.com/news/world-africa-31221545"}