{"authors": ["Lyse Doucet", "Wael Hussein", "www.facebook.com"], "date_download": "2025-04-26 03:56:31", "date_modify": "2025-04-26 03:56:31", "date_publish": "2025-03-04 15:08:32", "description": "Egypt puts forward a counterproposal to the president's vision for a US takeover of post-war Gaza.", "filename": "news_articles_cjd32xyjg4eo_1745639791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0857/live/8c2d7960-f913-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjd32xyjg4eo_1745639791.html", "title": "Gaza: Arab leaders approve $53bn alternative to Trump's reconstruction plan", "title_page": "Gaza: Arab leaders approve $53bn alternative to Trump's reconstruction plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A $53bn (£41.4 billion) reconstruction plan to rival President Donald Trump's idea for the US to \"take over Gaza\" and move out more than two million Palestinians has been approved by Arab leaders at an emergency summit in the Egyptian capital Cairo.\n\"The Egypt plan is now an Arab plan,\" announced the secretary general of the Arab League Ahmed Aboul Gheit at the end of this hours-long gathering.\nWithout referring specifically to President Trump's ideas, he underlined that \"the Arab stance is to reject any displacement, whether it is voluntary or forced\".\nEgypt had produced a detailed blueprint, with a 91-page glossy document including images of leafy neighbourhoods and grand public buildings, to counter a US scheme labelled as a \"Middle East Riviera\" which shocked the Arab world and beyond.\nWhat sets this new plan apart is it is not just about property development; its banners are politics and the rights of Palestinians.\nIn his opening remarks, Egypt's President Abdul Fattah al-Sisi also called for a parallel plan alongside the physical reconstruction to move towards what is known as the two state solution – a Palestinian state alongside Israel. This is widely seen by Arab states, and many others, as the only lasting solution to this perpetual conflict, but it is firmly ruled out by Israel's Prime Minister Benjamin Netanyahu and his allies.\nThis new plan proposes that Gaza would be run, temporarily, by a \"Gaza management committee under the umbrella of the Palestinian government\" comprised of qualified technocrats.\nIt glosses over the issue of what role, if any, Hamas, will play. There is a vague reference to the \"obstacle\" of militant groups and said this issue would be resolved if the causes of the conflict with Israel were removed.\nSome Arab states are known to be calling for the complete dismantling of Hamas; others believe those decisions should be left up to the Palestinians. Hamas is said to have accepted it will not play a role in running Gaza but has made it clear that disarming is a red line.\nIsrael's Prime Minister Benjamin Netanyahu, who has described President Trump's plan as \"visionary\", has repeatedly ruled out any future role for Hamas, but also for the Palestinian Authority.\nThe other sensitive issue of security was dealt with by calling on the UN Security Council to deploy international peacekeepers.\nAnd a major international conference will be held next month to raise the huge sums of money necessary for this rebuilding project.\nWealthy Gulf states appear willing to foot some of the colossal bill. But no one is ready to invest unless they are absolutely convinced buildings won't come crashing down in another war.\nA fragile ceasefire which now seems to be on the brink of collapse will only amplify that hesitation.\nThis new Arab plan to rebuild Gaza would unfold in three phases including an initial period of about six months, called the early recovery stage, to start clearing the massive amounts of rubble as well as unexploded ordinance. Two subsequent stages would last several years.\nDuring this time displaced Palestinians, said to number 1.5 million, would be housed in temporary containers. Photographs in the glossy brochure present them as well-built and designed housing units set in pretty landscaped areas.\nPresident Trump continues to wonder aloud \"Why wouldn't they want to move?\" His description of Gaza as a \"demolition site\" underlines how the territory lies in utter ruin. The UN says 90% of homes are damaged or destroyed.\nAll the basics of a life worth living, from schools and hospitals to sewage systems and electricity lines, are shredded.", "url": "https://www.bbc.co.uk/news/articles/cjd32xyjg4eo"}