{"authors": ["Mark Savage", "www.facebook.com"], "date_download": "2025-05-19 15:28:49", "date_modify": "2025-05-19 15:28:49", "date_publish": "2015-02-05 01:28:40", "description": "The directors and writers of Shaun the Sheep: The Movie discuss the character's origins and how he's become Aardman Animations' biggest property.", "filename": "news_entertainment-arts-31127694_1747668529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80786000/jpg/_80786105_redcarpet_aw_shaun-the-sheep-2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31127694_1747668529.html", "title": "Shaun the Sheep: Bleating the competition", "title_page": "Shaun the Sheep: Bleating the competition - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A humble ram with no eyebrows, Shaun The Sheep is hard to animate but easy to love. As he makes his big screen debut, the film's directors explain how Shaun became Aardman Animations' biggest property.\nShaun The Sheep is heavier than you think.\nStanding seven inches tall (18cm), the clay model is surprisingly solid in the palm of your hand, with roughly the weight and heft of a mango.\nBut then, he needs to be robust.\nTo make his first movie, Shaun was posed, poked and prodded thousands of times, all under the burning heat of the studio lights.\nHis fleece even had to be stiffened with PVA glue to stop it from catching fire.\nLike other movie stars, he had stand-ins - 21 of them, to be exact - allowing directors Mark Burton and Richard \"Golly\" Starzak to film dozens of stop-motion scenes simultaneously. Otherwise, Shaun The Sheep: The Movie would have taken nine years to complete.\nBut there are downsides to filming so much at once. Burton admits to \"hiding in the toilet\" to escape the mayhem.\n\"It's basically like being a cabinet minister,\" he explains. \"Every minute of your day is already pre-ordained.\n\"We were constantly having to move forward, make decisions. You need to walk into a unit and immediately know where you are in the story, what's wrong, what needs to be done and then move onto the next thing.\n\"It doesn't matter if you've got a headache or if you're hungry or even if you need the loo!\"\nStarzak adds: \"Even if you do go to the loo there's someone outside the door going, 'yes, he'll be with you in a minute. I think it's a number one.'\"\nNonetheless, he adds: \"It was quite astonishing to see how it started to spread.\"\nPart of the appeal is that, like Mr Bean or Pingu, none of the characters speak, beyond the odd bleat.\n\"We chose the non-dialogue thing for practical reasons,\" says Starzak, \"because lip-sync is quite expensive to produce for a TV show.\"\nThe directors agreed to stick with the silent movie template for Shaun's big screen outing - a decision that initially caused a few sleepless nights.\n\"There was a fear,\" admits Burton. \"But, actually, what it did was discipline us in terms of how we tell a story.\n\"We always start off with the idea that if you make a good film you can watch it with the sound down. So we had to stick to that track - which was very hard, no question about it. It was not an easy process.\"\nStarzak chips in: \"There were little contingency plans at the back of our heads, like people coming out from behind trees with banjos telling you the story.\"\nThe directors were only convinced they'd made the right decision when they sat down to watch an \"animatic\" of the movie - essentially a moving storyboard with temporary music and sound effects.\n\"Our shoulders visibly relaxed that night,\" says Burton. \"It was like, 'this can work'. I got a good night's sleep that night.\"\nThe directors say the plot was inspired by Ferris Bueller's urban adventures, while the first reel of Pixar's Wall-E gave them confidence that audiences would sit through a movie with no dialogue.\nThey also cite Toy Story 3 - in particular the heart-wrenching climax, where Woody and Buzz come perilously close to perishing in a furnace.\n\"I was driving my kids back from the cinema fighting back the tears,\" recalls Starzak.\n\"It's a good PhD question, actually. Does a film have to traumatise you in some way to be a good film?\n\"It made us wonder about the ending in our film,\" adds Burton. \"It's quite dark. But hopefully it's good jeopardy, in that it all works out fine. So you get that kind of catharsis.\"\n\"It's real peril for the film-makers because if you get it wrong you don't get any money!\"\nFunding has been a difficult topic for Aardman over the years. Their five-movie partnership with Dreamworks Animation came to a premature end after Flushed Away and Wallace And Gromit: The Curse of the Were-Rabbit under-performed.\nA second deal, with Sony, also ended after two films; while Shaun The Sheep has been financed by a one-off deal with France's Studio Canal.\nBurton is philosophical about the Bristol-based studio's travails.\n\"Getting funding together usually takes several partners, like any film,\" he says. \"And it's a long game in animation. It takes a long time to get your money back.\"\nHe notes there's been a downturn in the appetite for \"very big CGI films\" in the last two years, with Dreamworks in particular struggling to sell movies like Turbo, Mr Peabody & Sherman and Penguins of Madagascar.\nBurton, who co-wrote the first Madagascar film, says: \"There's a danger generally that Hollywood is taking its audience for granted and charging high prices.\n\"Film has got to be affordable, accessible, enjoyable. If it becomes product and people get the sense they're trying to make money out of it, that's negative.\"\nAnd he's defiant about the future of stop-frame, saying: \"Stop-frame is alive and well. Aardman are committed to stop-frame. Nick Park's working on a new film which is a stop-frame film. We're making another series with Shaun.\"\nStarzak adds: \"I remember Mark Kermode reviewing two films, an Aardman film and a Tim Burton one.\n\"He referred to it as the 'dying art of stop-frame' - the paradox being that he went on to review two stop-frame films that did very well that year.\n\"There's more stop-frame production now than there ever has been. I don't think of it as a dying art. It's just another way of storytelling.\"\nShaun the Sheep is out on Friday 6 February.", "url": "https://www.bbc.com/news/entertainment-arts-31127694"}