{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 06:55:03", "date_modify": "2025-04-26 06:55:03", "date_publish": "2025-02-28 15:52:01", "description": "It has been one year since the pub's owners were ordered to rebuild it.", "filename": "news_articles_cx2r0l8m2d2o_1745650503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e543/live/2d298bd0-f5e8-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2r0l8m2d2o_1745650503.html", "title": "Crooked House campaigners want to 'get things moving'", "title_page": "Crooked House campaigners want to 'get things moving' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners want to \"get things moving\", a year after the owners of a pub destroyed in a suspected arson attack were ordered to rebuild it.\nOn Friday they met with local MP Mike Wood at the site of the Crooked House, known as Britain's wonkiest pub.\nSave the Crooked House campaigner Ian Sandall said: \"The purpose of today's meeting is to start prompting people with a big and sharp stick.\n\"This is massive thing for the heart of the Black Country. We have a long heritage and the Crooked House is a part of that. It has to be rebuilt.\"\nHe added: \"We can't afford to let this settle and be forgotten.\"\nThe Crooked House was well-known in the Black Country for its sloping walls and floor, caused by mining subsidence in the area.\nATE Farms bought the 18th Century pub from Marstons in July 2023, nine days before the fire.\nIt was destroyed in a suspected arson attack on 5 August 2023 and was demolished two days later.\nSouth Staffordshire Council served the enforcement order on its owners in February 2024.\nAn appeal will look into whether the owners should heed South Staffordshire Council's enforcement notice to rebuild the pub within three years.\nA public inquiry, requested by ATE, was set to begin on 11 March.\nBut Mr Sandall said it had been postponed while criminal damages for arson were being dealt with.", "url": "https://www.bbc.co.uk/news/articles/cx2r0l8m2d2o"}