{"authors": ["Madeline Halpert", "www.facebook.com"], "date_download": "2025-04-26 06:49:54", "date_modify": "2025-04-26 06:49:54", "date_publish": "2025-03-01 08:33:30", "description": "Local health experts wish US Health Secretary Robert Kennedy would emphasize the importance of vaccines.", "filename": "news_articles_cvgeq3y1825o_1745650194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/198b/live/56e21490-f5fe-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgeq3y1825o_1745650194.html", "title": "RFK measles response under scrutiny as deadly outbreak frightens Texas parents", "title_page": "RFK measles response under scrutiny as deadly outbreak frightens Texas parents - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In her hometown of Lubbock, Texas, Leah, a pregnant mother, has been avoiding stores and other public spaces for the last two weeks.\nOn Wednesday, the city saw a six-year-old child who was not vaccinated against the virus die – the first US death from the measles in nearly a decade.\nWith a baby on the way, Leah could be putting her foetus at risk of health complications if she contracted the virus, despite her own vaccination. Her paediatrician also advised her to move up her older son's second shot of the vaccine - the full course for the immunisation - as the risk to his health grows.\n\"Mentally, it's taking a toll on me, thinking about not just myself and my child, but also about the people that I have to be around,\" said Leah, who declined to share her last name for privacy reasons.\nThe US declared measles \"eliminated\" from the country in 2000, but in recent years, as anti-vaccine sentiments rose, the country has seen several outbreaks of the virus.\nThe Texas outbreak began in a small Mennonite community near Lubbock, home to 260,000, and has since spread. To date, there have been over 130 cases across Texas and New Mexico, with 18 patients hospitalised, local health officials said.\nOn Wednesday, Robert F Kennedy Jr, the nation's newly confirmed top health official, called the Texas outbreak \"not unusual\", a claim disputed by doctors and local residents.\nPublic health experts and Lubbock residents said the health secretary's past remarks about childhood vaccines - as well as actions he's taken related to them since entering office - could fuel an outbreak that is worrying parents across Texas and nearby states.\n\"We just want people to be healthy, and it's definitely hard to do that when we have voices in our ears from leadership who don't share those same factual opinions,\" Leah said.\nThe Department of Health and Human Services did not respond to a request for comment from the BBC.\nSince the beginning of the outbreak, Katherine Wells, the director of the Lubbock Public Health Department, has not had a day off.\nShe has hosted vaccine clinics to encourage people to get shots, contacted those whose children may have been exposed, and worked to educate the community about the virus.\n\"It's as stressful, if not more stressful, than it was at the beginning of the COVID pandemic,\" she told the BBC.\nMs Wells worries most about those who are not able to get vaccinated against the highly contagious disease, which spreads easily in the air and on surfaces, and when an infected person breathes, coughs or sneezes. The virus - which can cause a fever, red rash, cough and other symptoms - also is associated with a host of complications, including pneumonia, brain swelling and death.\nPeople who are immunocompromised, children under the age of one and pregnant people cannot be inoculated against the measles.\nThat includes the new baby Lubbock resident Kyle Rable is expecting. His wife is nine months pregnant and plans to deliver in the same hospital where the patient died of the measles.\nMr Rable is terrified for his son's first year of life.\n\"With it spreading essentially like wildfire out here, do we just not leave our house for a year? We can't do that,\" he said.\nTo achieve herd immunity - when enough of a group is immune to a disease, limiting its spread and protecting the unvaccinated - around 95% of the population must have the shots, said Alefiyah Malbari, the chief of ambulatory pediatrics at University of Texas Dell Medical School in Austin.\nBut several western Texas communities are well below that figure, including Gaines County where the outbreak began and where only 82% of kindergartners are vaccinated.\n\"When you have that many children that are unvaccinated, measles will spread very, very easily within the community,\" said Jill Weatherhead, a professor of infectious diseases at Baylor College of Medicine.\nNow, doctors say, parents far from western Texas are starting to worry too. Dr Malbari is getting more calls from parents anxious about protecting their children when not everyone will get the vaccine.\n\"I share that concern with them,\" said Dr Malbari.\nBefore Kennedy's confirmation as the top US health official, public health experts sounded alarms about the vaccine sceptic's ability to manage outbreaks, like the one the US is seeing now.\nHe has repeated widely debunked claims about vaccines, including unsubstantiated theories that the shots can cause autism.\nDuring his Senate confirmation hearing, Kennedy said he supported the measles vaccination. He pledged not to discourage people from vaccinations and to \"do nothing as HHS secretary that makes it difficult\" to get vaccines.\nBut since taking office just weeks ago, he has announced a number of plans related to vaccines, including an investigation into whether the childhood vaccination schedule - including measles vaccinations - has contributed to a rise in chronic illnesses.\nHe also delayed the first meeting of a CDC advisory panel that helps the agency make recommendations on what vaccines - including childhood immunisations - insurers should cover.\nKennedy told the CDC to halt promotions of several immunisations, including a seasonal flu vaccine campaign, instead promoting the idea of \"informed consent\" in vaccine decision-making, Stat News reported, external last week.\nThe moves have the potential to disrupt how the federal government ensures Americans have access to safe vaccines, including childhood immunisations, said Dr Peter Lurie, a former US Food and Drug Administration official.\nBut, Dr Lurie added, most troubling about Kennedy's response to the measles outbreak, is \"what he didn't say, which is that the way to contain this outbreak is with vaccination\".\nOn Wednesday, during his first public appearance as health secretary, Kennedy made claims about the measles outbreak that local health officials have since disputed.\nIn addition to calling the Texas outbreak \"not unusual\", he claimed children with measles went to hospitals only to be quarantined. Hospital officials said they were taken there because of the severity of their illnesses.\nRon Cook, a family physician and Lubbock health official who is helping doctors respond to the outbreak, said the community has not seen measles cases like this in decades.\n\"It's a devastating disease,\" he said. \"And it's completely preventable.\"\nFor some expectant parents in Lubbock, Kennedy's minimisation of the outbreak has been difficult to watch.\nLeah said she knows many local parents who won't vaccinate their children because of misinformation about safety. She said news of the death has not changed their minds.\n\"If anything, it's just made them double down on their beliefs,\" she said.\nBut Ms Wells has seen at least a few encouraging signs. After the death was announced on Wednesday, around 18 people came to a vaccination clinic following many slow days.\nStill, she said, when she tells parents their children may have been exposed, some still do not want to vaccinate, including doses of the shot that can protect them after potential exposure.\n\"In Texas, vaccines are very much a choice,\" she said.\nLocal health officials are working overtime to build trust and show that the vaccine is safe and effective, Dr Cook said.\n\"We're seeing some success, but we would like to see significantly more,\" he said. \"It would be nice to have some confidence coming out of the powers that be - at the national level - to show that this is a good vaccine.\"", "url": "https://www.bbc.co.uk/news/articles/cvgeq3y1825o"}