{"authors": ["Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 06:20:50", "date_modify": "2025-04-26 06:20:50", "date_publish": "2025-03-01 06:26:38", "description": "DJs, singers and entertainers are due to bring Southend-on-Sea to life during a day of celebration.", "filename": "news_articles_c5y44n7yd63o_1745648450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ebc5/live/35cb0b00-f5cb-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y44n7yd63o_1745648450.html", "title": "Southend City Day celebrations to mark three years of city status", "title_page": "Southend City Day celebrations to mark three years of city status - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A seafront city is preparing to be lit up by live performances during a day of celebration.\nSouthend City Day is planned for Saturday, three years to the date since the area was granted city status by Queen Elizabeth II in 2022.\nBeing held for the first time, the all-day event is being headlined by actress and presenter Denise Van Outen.\nBut what is Southend City Day and how is it being marked?\nThere will be two stages offering live shows throughout the day - the Southend City Stage and the Southend City Songwriters Stage.\nCommunity choirs, amateur dramatic groups and bands will perform on the city stage from 11:00 GMT to 17:50.\nBasildon-born Van Outen will kick off the \"Disco City\" party from 18:05, with other DJs performing under a 2m (6.5ft) disco ball until 22:00.\nLocal songwriters have been booked to sing their original songs on the songwriters stage between 11:00 and 17:50.\nMore than 30 artists are also planning to transform the city centre when they paint street art throughout the day.\nA live outdoor painting event, led by local artist Andy Downes, is also part of the schedule, and people with street-facing windows have been encouraged to decorate them for the day.\nThroughout Saturday, performers will roam the High Street alongside food vendors, a brass band and various demonstrations.\nFree activities, workshops and support from community and faith groups will be on offer at both the Victoria Centre and The Royals Shopping Centre.\nBBC Essex will be broadcasting live from the event between 10:00 and 14:00.\nSouthend-on-Sea is instantly recognisable to many, largely thanks to its 1.34 mile-long (2km) pleasure pier - the world's longest.\nInformally dubbed \"London's beach\" due to its proximity to the capital's East End, the Essex resort is popular with people looking to enjoy some sea air.\nIt became England's 52nd city when the King - then the Prince of Wales - delivered a letters patent from the Queen.", "url": "https://www.bbc.co.uk/news/articles/c5y44n7yd63o"}