{"authors": ["Danielle Andrews", "www.facebook.com"], "date_download": "2025-04-26 08:04:06", "date_modify": "2025-04-26 08:04:06", "date_publish": "2025-02-26 16:04:52", "description": "Tenants will instead be offered five-year leases designed to free up stock as family needs change.", "filename": "news_articles_cq5zgx09234o_1745654646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c89d/live/b0b64ef0-f455-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zgx09234o_1745654646.html", "title": "Barnsley: End of lifetime tenancies for larger council houses", "title_page": "Barnsley: End of lifetime tenancies for larger council houses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council is ending lifetime tenancies for some of its social housing and introducing a more flexible system.\nTenants in Barnsley will now be offered five-year leases so that they can move between more suitable properties as family sizes change.\nThe new tenancies will apply to homes that have four or more bedrooms so that housing stock can be freed up more easily.\nA report to the Barnsley Council's Cabinet said: \"The demand for social housing continues to outstrip supply. There is a clear need to make best use of the housing stock for those that need it most.\"\nAccording to the Local Democracy Reporting Service, most people will still be offered secure or assured tenancies but the flexible tenancies will help tackle the limited supply and growing demand.\nFamilies in larger homes may be offered extensions to their tenancies if they still need the extra space, or if their property is specially adapted for a person with disabilities.\nThe flexible tenancies will generally be offered for five years, with a minimum term of two years for specific circumstances, such as care leavers.\nThey may also be offered to tenants who might otherwise be excluded from the register due to serious or prolonged breaches of tenancy conditions and those in receipt of short-term support.\nIn November 2024, there were more than 5,500 residents on the waiting list for a property.\nBerneslai Homes, which manages 18,000 council properties on behalf of the council, receives 5,000 applications a year.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cq5zgx09234o"}