{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:32", "date_modify": "2025-04-26 04:02:32", "date_publish": "2025-03-04 01:11:00", "description": "The latest comments from world leaders over the war in Ukraine dominate the front pages on Tuesday.", "filename": "news_articles_cvgen228qjjo_1745640152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5801/live/dd1274f0-f893-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgen228qjjo_1745640152.html", "title": "'US rift with Ukraine grows' and 'UK hunts new allies'", "title_page": "Newspaper headlines: 'US rift with Ukraine grows' and 'UK hunts new allies' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The news that the United States is to pause military aid for Ukraine broke too late for the first editions of this morning's papers, but there has been plenty of reaction on their websites.\n\"Trump squeezes Zelensky\", external is the Daily Mail's headline. It says the US president has stunned Nato allies with his decision after \"losing his patience\" with the Ukrainian leader. The Daily Telegraph calls the move a \"crippling blow, external\" to Ukraine's war effort. In its analysis, The Times declares that freezing military aid could be a \"risky move\" by Trump, but that he is not prepared to lose face, and wants Zelensky to apologise for the \"blowout\" in the Oval Office on Friday....\nLooking at some of the American news websites, Politico says the suspension is designed to be a \"show of force\", external with the aim of putting pressure on President Zelensky to return to the negotiating table. The New York Times, external writes that the \"immediate beneficiary\" is Vladimir Putin. The paper goes on to say that if the suspension is lengthy, the Russian president could \"use the time to press for further territorial gains\".\nBack here, the papers mark the ongoing diplomatic efforts by the UK. The Daily Express says MPs from across the political spectrum have given their backing to Sir Keir Starmer and his staunch support of Ukraine - after his recent flurry of meetings on the matter at home and abroad. The paper's headline quotes the prime minister -- who said yesterday that the UK had to \"lead from the front\" when it came to protecting Ukraine and standing up to Russia. The I paper reports that Britain is looking beyond Nato, , externalat countries such as Jordan, Bahran and Saudi Arabia, to help enforce a ceasefire in Ukraine.\nThe Guardian reports that the government is preparing to \"overhaul\" special educational needs provision in schools in England, as councils raise the alarm about costs. It is understood ministers are to set out more details in the spring, with one insider telling the paper it will be a \"complete recalibration\". A Department for Education spokesperson is quoted as saying the current system has long been failing to meet the needs of children and families, and they are determined to make improvements.\nComments made by the Duchess of Sussex ahead of the release of her new Netflix show have been picked up by some of the papers. The Times focuses on the Duchess saying that developing her lifestyle programme, called With Love, Meghan, allowed her to show her children the realities of being a working mum. The Telegraph reports that the Duchess has insisted she is not an \"influencer\" and sees herself more as a female entrepreneur.", "url": "https://www.bbc.co.uk/news/articles/cvgen228qjjo"}