{"authors": ["Grace Wood", "www.facebook.com"], "date_download": "2025-04-26 06:48:25", "date_modify": "2025-04-26 06:48:25", "date_publish": "2025-03-01 11:21:45", "description": "Huddersfield hosting major competition for brass bands, which have a strong history in the region.", "filename": "news_articles_c99nne8233ko_1745650105.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5240/live/ef644d40-f5d2-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99nne8233ko_1745650105.html", "title": "How brass bands bring people from all walks of life together", "title_page": "How brass bands bring people from all walks of life together - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For 125 years brass bands from across Great Britain and Northern Ireland have been competing to take home the Challenge Trophy.\nMany of the biggest names in the competition are from Yorkshire, so the regional competition - in Huddersfield on Saturday – is the \"blue riband\" event of the calendar, says Brass Band England CEO Kenny Crookston.\n\"There's been more champion bands from Yorkshire than anywhere else throughout the history of brass band contests and Black Dyke has been the most successful band,\" he says.\n\"In terms of football teams, Black Dyke would be Manchester United or Liverpool, but also Brighouse and Rastrick, Grimethorpe Colliery, they have been super successful over many years.\n\"So when it gets to the finals, and other big competitions, these are the ones that have been among the most successful.\"\nThe National Brass Band Championships of Great Britain began in 1900 at the Crystal Palace in London and in 1945 it moved to the Royal Albert Hall, where it has remained since.\nAccording to Crookston, thousands of people would travel to the competition from across Britain and Europe.\n\"Brass bands have always played the music of the people, going way back to the 1850s when brass band contests started,\" he says.\n\"The very first special railway excursions were to brass band contests at places like Bellevue in Manchester and Crystal Palace.\n\"Venues in Leeds and Bradford would host major band events and entire villages would go and support their bands.\"\nJacob Hickson, 21, from Saddleworth, is a student with the University of Huddersfield Brass Band and will be competing on Saturday with Hammonds Band.\nHe recently won the Best Soloist award at the UniBrass competition in Cardiff for the second year running and was the first player to win in consecutive years.\nHe plays euphonium and trombone but began his brass career playing cornet.\n\"I wanted to play a trumpet because my sister started playing flute, so I thought I'd do something more interesting.\n\"I started playing cornet when I was about six. I played that until I was 18 and then I found I couldn't get on with it and it was messing with my mental health and I didn't know what I wanted to do, so I swapped onto euphonium and I loved it ever since.\"\nMr Hickson's journey with bands began aged 14 when his now brother-in-law invited him to join his brass band. He was one of three teenagers in the band.\nHe says it taught him confidence and helped him perform better at school.\n\"They way I've been able to build my mental health over the past three years is incredible, because I was one of the worst students at school when I was in sixth form.\n\"Finding something I really enjoyed in euphonium just helped me massively and it gave me some goals to set for myself and allowed me to progress and become who I am now, a confident person.\n\"It's something anyone can do. There's plenty of them. You don't have to be the world's best musician.\n\"Anyone can get involved and progress like me. In three years I've gone from being not very good to where I am now.\"\nHelen Minshall, youth development brass specialist at Brass Bands England, encourages young people to get into banding.\nShe says there are two routes in – family legacy and \"first generation banders\".\n\"First generation banders have had a go at brass at their primary school, and they've come to see what all the noise is about. You get one or two who come down out of curiosity and then they tell their friends.\n\"The best advocates for getting kids to join a band is the kids who are already there. Once you get a steady stream of them coming down, you're on to a winner and they get hooked.\n\"They enjoy meeting their friends there. They get to go on fantastic tours where they have great fun, they make music and meet lifelong friends.\n\"It gives them confidence for everything they're going to be doing in life.\"\nBut Mr Hickson says many bands are struggling, and to get the Huddersfield University band to the national championships they had to fundraise for transport.\n\"Many people are struggling. Brass bands are taking a big hit with dwindling numbers. Fewer people are paying subs.\n\"They still get good audiences, but obviously you need people to pay more to be able to afford to do the kind of stuff you want to do.\"\nMr Crockston says one of the priorities of Brass Band England is \"making sure the next generations are secure\".\nHe says brass bands are \"under-represented in the public psyche\".\n\"People have a particular view of what we do and it's about playing march competitions. It's come from the film Brassed Off. But it's a love story that's not really based on reality.\n\"If people really knew what brass bands can do, the standard of music making that can be achieved, but more than more than that, the experience it can give young people and get involved in something that is a fantastic, creative hobby.\n\"Even if it's not doing music, the camaraderie and confidence it brings you. I know people who are still playing in their 90s and very good and enjoying every minute.\"\nMs Minshall says the benefits of brass banding go beyond musical education, enjoyment and friendships.\n\"You walk into a brass band and you see a headteacher sitting next to someone who works in Tesco, sitting next to an undertaker, sitting next to a solicitor, sitting next to a schoolboy, and it teaches them to relate to people from all walks of life. Once they walk into the band room, they're all equal.\n\"That's a wonderful thing about it. If you ever need some building work doing or your plumbing is gone, you just get down to band rehearsal, there'll be somebody there who can sort it out for you.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c99nne8233ko"}