{"authors": ["Jessica Lawrence", "www.facebook.com"], "date_download": "2025-04-26 06:20:05", "date_modify": "2025-04-26 06:20:05", "date_publish": "2025-03-01 06:42:18", "description": "Some residents in Glengormley and Carryduff express their frustration after Glider plans were scaled back.", "filename": "news_articles_cjw245eg0g7o_1745648405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d006/live/2f19fd10-f5db-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw245eg0g7o_1745648405.html", "title": "Glider: Carryduff and Glengormley residents have their say on latest plans", "title_page": "Glider: Carryduff and Glengormley residents have their say on latest plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some residents have expressed their disappointment after it was announced that plans to extend Belfast's Glider bus service were to be scaled back.\nThe current Glider service, a fleet of purple-coloured articulated buses, links east and west Belfast.\nOn Tuesday, Infrastructure Minister Liz Kimmins announced the long-awaited north-south Glider, known as Belfast Rapid Transit 2, external (BRT2), would go ahead.\nHowever, plans to extend the service to Glengormley in the north and Carryduff to the south of the city cannot progress as they are not \"economically viable\" or feasible at this time.\nBordering Belfast's south is Carryduff, a small town with about 7,000 residents.\nBut it's a growing hub, Karen McKenna said, who is \"very disappointed\" by the news.\n\"I feel very strongly that the area's growing,\" she told BBC News NI.\n\"There's increased housing and pressure on the roads, and it makes the journey nearly impossible into town in the morning.\n\"I have two daughters living in Carryduff, and certainly they inform their future decision on continuing to live in this part of the town.\"\nThe area's growth is also mentioned by Roy Fallis.\nHe said Carryduff is currently without a bank, which means many older people may be looking for more frequent bus services into the city centre.\n\"It's a moot point with me but if I was dependent on the buses, I think it would be a terrible disaster for the pensioners and all of the people of Carryduff,\" Mr Fallis added.\nCarryduff does not have a Metro service, and often users will rely on Ulsterbus services travelling from Ballynahinch or Downpatrick.\nKarla Sweetlove, who has lived in the town on-and-off since the 1980s, says services have never been regular.\n\"The buses come at 20 past and 40 past the hour... that's sort of the bus service we have here,\" she added.\nBut Francesca McCamley, who gets the bus about once a month and has teenagers who often use public transport to travel to Forestside Shopping Centre, said the current arrangements are fine.\nShe said bus services were \"pretty reliable\" and \"there's a late bus down until about 11 o'clock home so I don't have any issue with it\".\nRory McGrath, a Carryduff native, said if a more frequent service, like the Glider, was available he would be open to using it.\n\"You look at the number of houses that are going up in Carryduff and that's going to congest the roads for a start, so if you were to throw in a couple of extra bus services or times on the schedule you're going to fill that and hopefully take cars off the road.\"\nAbout six miles north of Belfast is Glengormley, an area which has seen a spike in major retailers in recent years.\nThe proposed Glider route for north Belfast would run along the Antrim Road, but now will stop just short of Glengormley.\nPaula Toner said she thinks many elderly people in the area will feel let down.\n\"My family come from west Belfast and they have experienced [the Glider] for the last few years, so definitely I think it would have been a good thing,\" she said.\nWhile she does not use the bus herself, \"I'm disappointed for other people.\"\nUnlike Carryduff, Glengormley does see Translink's Metro buses service the area.\nFor Gerald McGarva these could be more reliable.\nHe claimed that services have been cancelled at the last minute and can often be too full to stop, due to school children.\n\"You can't even get a bus on a Sunday to the Abbey Centre for some odd reason,\" he added.\nDespite scaled-back plans for the Glider's second phase Sustrans NI's Anne Madden is feeling positive.\n\"In the first year it was introduced, there was a 70% increase in passengers and it's just gone from strength to strength,\" the policy and communications manager told BBC News NI.\n\"Having a north-south route would really help complete the picture for the whole city so we're really excited.\"\nMs Madden said that the public in both Carryduff and Glengormley are keen for the Glider route to be extended, and hopes funding issues to provide the service can be sorted.\n\"I think those two commuter belts really would benefit from having a Glider service as we've seen between Dundonald and Andersonstown, so hopefully it's just a blip because of financial constraints.\"\nShe said the minister's announcement on BRT2 is a \"step forward in the right direction\".\n\"We now will see the start of provision for a Glider route north to south, and hopefully in time we'll get the rest of the funding to continue it as it should be out to Carryduff and Glengormley.\"", "url": "https://www.bbc.co.uk/news/articles/cjw245eg0g7o"}