{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 06:41:59", "date_modify": "2025-04-26 06:41:59", "date_publish": "2025-03-02 12:01:58", "description": "Wild Planet Trust says the wetland habitats, common around Torbay, support marine biodiversity.", "filename": "news_articles_crlxdrl0493o_1745649719.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c1d/live/7b1d5ca0-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlxdrl0493o_1745649719.html", "title": "Torbay project launched to protect seagrass meadows", "title_page": "Torbay project launched to protect seagrass meadows - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A scheme has been launched to protect under-threat seagrass meadows in Devon.\nTorbay has about 52 hectares of the wetland habitat, external which is at risk due to leisure crafts causing damage while anchoring, the Wild Planet Trust said.\nIt has set up the Seagrass Champions project to raise awareness of the meadows and wants businesses to get involved.\nThe charity said seagrass meadows store more carbon per area than tropical rainforests, provide nursery grounds for commercial fish species, help prevent coastal erosion and support marine biodiversity.\nWild Planet Trust, which runs Paignton and Newquay Zoos, said though seagrass meadows are common around Torbay, they are under threat around the UK coast in general.\nDr Andrew Bowkett, conservation projects and partnerships manager at the charity, said: \"A surprising number of people have no idea that Torbay is home to meadows of seagrass.\"\nFreedom Boat Club Torquay said it was proud to sign up as the first partners of the project.\nClub manager Oliver Patterson said: \"As a local business we are deeply passionate about protecting Torbay's natural habitats and marine life whilst members enjoy having fun and making memories out on the water.\"", "url": "https://www.bbc.co.uk/news/articles/crlxdrl0493o"}