{"authors": ["Danielle Andrews", "www.facebook.com"], "date_download": "2025-04-26 03:48:55", "date_modify": "2025-04-26 03:48:55", "date_publish": "2025-03-05 14:07:46", "description": "Barnsley Council says the town centre sculptures will be an integral part of regeneration efforts.", "filename": "news_articles_c201plgd115o_1745639335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e2fd/live/dbf09540-f9c7-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c201plgd115o_1745639335.html", "title": "Funding approved for Barnsley's Yorkshire Rose statues", "title_page": "Funding approved for Barnsley's Yorkshire Rose statues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Funding of £2.5m has been approved by Barnsley Council for three new Yorkshire Rose sculptures in the town centre.\nThe sculptures, standing between 12m (40ft) and 15m (50ft), will feature integrated lighting and audio elements, creating an immersive experience for visitors.\nThey are designed to serve as a visual gateway to the Seam Digital Campus, part of a wider £11.97m regeneration effort to promote Barnsley as a digital hub.\nApproving the funds, councillors said the sculptures were a key part of a wider plan to bring forward development in the Upper Seam area and to enhance the town's identity.\nRobin Franklin, cabinet member for regeneration and culture, told a council meeting the sculptures aimed to transform the area into an \"iconic attraction\".\nHe said it would help \"promote the town centre, and act as the catalyst for the next phase of the project, which will include the DMC [Digital Media Centre] three, and the national centre for digital technology\".\nHe said it was also hoped the work would help to generate investment to attract a \"premium hotel\".\nThe report acknowledged the potential risks of negative publicity due to the cost of the sculptures and outlined a communications strategy which would focus on promoting the long-term advantages.", "url": "https://www.bbc.co.uk/news/articles/c201plgd115o"}