{"authors": ["Laura Devlin", "www.facebook.com"], "date_download": "2025-04-26 07:34:52", "date_modify": "2025-04-26 07:34:52", "date_publish": "2025-02-27 15:21:34", "description": "He is \"forever grateful\" an off-duty community first responder leapt to his aid.", "filename": "news_articles_cjd33z17ye3o_1745652892.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41eb/live/b63aa1d0-f4f7-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjd33z17ye3o_1745652892.html", "title": "Rower, 80, reunited with man who saved his life", "title_page": "Rower, 80, reunited with man who saved his life in Cambridge - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rower whose heart stopped for more than 30 minutes after an outing on the river has been reunited with the off-duty community first responder who helped save his life.\nHoward Tracey, known as Ted, had just returned to the Cambridge Rowing Association clubhouse with other rowers on New Year's Eve when he collapsed and went into cardiac arrest.\nGary O'Shea, of the East of England Ambulance Service (EEAS), happened to be rowing on the River Cam and carried out CPR on Mr Tracey, before the arrival of an ambulance crew.\n\"I am forever grateful to still be here today with my family and friends,\" said Mr Tracey, who is now recovering at home near Bury St Edmunds, Suffolk.\nVolunteer Mr O'Shea and the attending medics were able to restart Mr Tracey's heart after 33 minutes of CPR, EEAS said.\nMr Tracey was taken to the Royal Papworth Hospital, where he was put into an induced coma and kept on life support for more than a week.\nHaving initially been given a less than 10% chance of survival, he had a pacemaker fitted and has been well enough to meet Mr O'Shea.\n\"I cannot remember anything, until about the second or third week in January – nor any thing before it on that fateful day,\" said Mr Tracey.\n\"Everything that happened has gradually been put together by those who responded, including Gary and Roz [Fitzgerald, a cox who assisted Mr O'Shea].\n\"I want to thank everyone involved – they saved my life.\n\"No-one ever gave up on me, and I was rushed to the world-class care of Papworth Hospital and the NHS.\"", "url": "https://www.bbc.co.uk/news/articles/cjd33z17ye3o"}