{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 08:02:53", "date_modify": "2025-04-26 08:02:53", "date_publish": "2025-02-26 16:43:32", "description": "Arron Bailey, 28, is jailed for taking part in the disorder in Manvers, Rotherham, in August.", "filename": "news_articles_czdnleg5jjeo_1745654573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f3a3/live/c4c4ec70-f447-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czdnleg5jjeo_1745654573.html", "title": "Role in Manvers hotel riot 'ruined my life'", "title_page": "Role in Manvers hotel riot 'ruined my life' - arsonist - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rioter who helped fuel a fire outside a hotel housing asylum seekers believed his actions that day had \"ruined\" his life, a court has heard.\nArron Bailey, 28, also sprayed a fire extinguisher at police, pushed a shopping trolley at officers and threw a rock at a police van at the Holiday Inn Express in Manvers, Rotherham, on 4 August.\nAt Sheffield Crown Court on Wednesday, Bailey, who had pleaded guilty to violent disorder and arson with intent to endanger life, was jailed for eight years with an extended licence period of three years.\nMeanwhile, a 17-year-old boy, who cannot be named due to his age, pleaded guilty at Sheffield Youth Court on Wednesday to violent disorder during the riot.\nBefore Bailey's sentencing, Sheffield Crown Court heard that the father-of-two with no previous convictions was seen \"to the fore of many of the various pockets of disorder\" on the day of the riot.\nHe was seen wearing a camouflage balaclava in much of the footage taken at the scene.\nClips played in court showed the former construction worker adding large planks and cardboard boxes to a bin that had been set on fire outside the doors of the hotel.\nA judge heard Bailey was part of a group chanting \"Yorkshire, Yorkshire\" as they descended on a police van, and he was seen arming himself with a large rock and throwing it at the vehicle.\nBailey was also seen commandeering a shopping trolley from a nearby Aldi supermarket and pushing it at the police line.\nIn the footage shown to the court, he was seen at one point spraying a fire extinguisher at the police line, forcing officers to retreat, before he threw the empty device at officers.\nIn mitigation, the court heard Bailey had struggled to get work after the Covid lockdown, and had told a probation officer he had \"ruined his life through this one day\".\nA judge heard 14 references for Bailey had been submitted by family members and friends who \"struggle to come to terms with exactly what he has done\".\nThe court heard that before the day of the riot, he was \"essentially a family man who had a good relationship with family and friends\".\nThe Recorder of Sheffield, Judge Jeremy Richardson KC, said that despite the number of rioters he had now sentenced, \"it never ceases to amaze me that young men such as yourself have, in consequence of what they did that day, ruined their lives and ruined the lives of their families\".\nAt Sheffield Youth Court on Wednesday, a teenage boy pleaded guilty to violent disorder at Manvers on 4 August.\nDistrict Judge Tim Spruce was told the 17-year-old was seen breaking up a slab of concrete to then throw at police, while on another occasion he was seen pulling off fence panels from residential properties which he then used to throw at officers.\nKaidee Brown, representing the boy, said he had gone to the protest with friends because they were \"intrigued\" by social media posts and wanted to \"have a nosy\".\nShe said the boy, who was 16 at the time, did not go with the intention of using violence or causing distress, but when he arrived at the scene, he went \"along with everyone else\".\nMs Brown said the teen described himself as \"a class clown\" who held police in high regard and did not have any racist views.\nJudge Spruce told the boy he would be sentenced at the same court on 26 March.\nAdditional reporting by PA Media\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/czdnleg5jjeo"}