{"authors": ["Luke Mintz", "Sue Mitchell", "www.facebook.com"], "date_download": "2025-04-26 07:46:58", "date_modify": "2025-04-26 07:46:58", "date_publish": "2025-02-27 00:00:20", "description": "A major study has found first cousin-parentage may have wider consequences than previously thought.", "filename": "news_articles_c241pn09qqjo_1745653618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/881e/live/e969b7e0-f38e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c241pn09qqjo_1745653618.html", "title": "Cousin marriage: The new evidence about children's ill health", "title_page": "Cousin marriage: The new evidence about children's ill health - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Listen to Sue read this article\nIn a busy, terraced house in Bradford, three sisters are animatedly chatting. It's a big day at their home: a beautician sits on their sofa, styling their hair and makeup. The room is warm with fun and laughter. It feels like a scene from a Jane Austen novel: three women in their late 20s, each of them bursting with personality, swapping stories.\nAnd like most Austen novels, the conversation often turns to marriage.\nThe sisters are preparing for a family wedding at the weekend - where the bride and groom are first cousins. Many people might find this unusual, but in their family and in some parts of Bradford, it's fairly common.\nAyesha, who at 29 is the oldest of the three sisters, also married her first cousin in 2017. She has two children with her husband and their marriage is happy, she says. It felt perfectly normal at the time to marry her cousin. Their mother, a Pakistani migrant, assumed it was what all three of her daughters would do.\nBut 26-year-old Salina, the youngest of the three, tells us she broke the mould by having what they call a \"love\" marriage, choosing a partner from outside the family. Salina tells us she is outgoing and ambitious; marrying a cousin simply did not appeal to her. Then there's Mallika, who at 27 is the middle of the three. She's still single and has already decided not to marry within her family.\n\"I said to my mum that I wouldn't judge my sisters but I wasn't going to do it,\" Mallika tells us. She says having an education has created opportunities for her. \"Before, even if you had an education, you wouldn't be expected to carry on with it. You would be thinking of marriage. Now the mindset is so different.\"\nResearchers at the city's university are entering their 18th year of the Born in Bradford study. It's one of the biggest medical trials of its kind: between 2007 and 2010, researchers recruited more than 13,000 babies in the city and then followed them closely from childhood into adolescence and now into early adulthood. More than one in six children in the study have parents who are first cousins, mostly from Bradford's Pakistani community, making it among the world's most valuable studies of the health impacts of cousin marriage.\nAnd in data published in the last few months - and analysed in an upcoming episode of BBC Radio 4's Born in Bradford series - the researchers found that first cousin-parentage may have wider consequences than previously thought.\nThe most obvious way that a pair of blood-related parents might increase health risks for a child is through a recessive disorder, like cystic fibrosis or sickle cell disease. According to the classic theory of genetics laid out by the biologist Gregor Mendel, if both parents carry a recessive gene then there's a one in four chance that their child will inherit the condition. And when parents are cousins, they're more likely to both be carriers. A child of first cousins carries a 6% chance of inheriting a recessive disorder, compared to 3% for the general population.\nBut the Bradford study took a much broader view - and sheds fresh light. The researchers weren't just looking at whether a child had been diagnosed with a specific recessive disorder. Instead they studied dozens of data points, observing everything from the children's speech and language development to their frequency of healthcare to their performance at school. Then they used a mathematical model to try to eliminate the impacts of poverty and parental education - so they could focus squarely on the impact on \"consanguinity\", the scientific word for having parents who are related.\nThey found that even after factors like poverty were controlled for, a child of first cousins in Bradford had an 11% probability of being diagnosed with a speech and language problem, versus 7% for children whose parents are not related.\nThey also found a child of first cousins has a 54% chance of reaching a \"good stage of development\" (a government assessment given to all five year-olds in England), versus 64% for children whose parents are not related.\nWe get further insight into their poorer health through the number of visits to the GP. Children of first cousins have a third more primary care appointments than children whose parents are not related - an average of four instead of three a year.\nWhat is notable is that even once you account for the children in that group who already have a diagnosed recessive disorder, the figures suggest consanguinity may be affecting even those children who don't have a diagnosable recessive disorder.\nNeil Small, emeritus professor at the University of Bradford and the author of the study, says that even if all of the children with recessive disorders visited their GP more than average, \"this does not explain the much wider distribution of excess health care usage in the consanguineous children\".\nThe study, he says, is \"exciting because it gives the opportunity for a much more accurate development of a response, targeting interventions and treatments\".\nIn the UK, the Conservative MP Richard Holden has introduced a private members' bill to outlaw the practice, adding it to the list of illegal marriages (alongside parents, child, siblings, and grandparents). But the Labour government says there are \"no plans\" to impose a ban. At present, the UK is still following the policy of \"genetic counselling\", in which first cousin-couples are educated about the risks of having children, and encouraged to get extra screening in pregnancy.\nBut amid concern about child health and strains on the NHS, some academics are asking whether a beefed-up approach to counselling is needed, with more funding and laser-focused intervention. And there are those who think it's time to follow the Scandinavian example and impose something bound to be difficult and controversial: an outright ban on cousin marriage.\nFor most in the UK, the prospect of marrying a cousin is largely alien. But it wasn't always so unusual. The father of evolution Charles Darwin married his first cousin, Emma Wedgwood. Their son, the Victorian scientist Sir George Darwin, went on to estimate that cousin marriages accounted for almost one in 20 aristocratic unions in 19th Century Britain. One of them was Queen Victoria, who married her first cousin, Prince Albert. The novel Wuthering Heights is full of fictional examples.\nBut crucially, Prof Oddie thinks the main risk to genetic health in Bradford is not cousin marriage, but a similar issue known as endogamy, in which people marry members of their close community. In a tight-knit ethnic group, people are more likely to share common ancestors and genes - whether or not they are first cousins, he says.\nEndogamy is not unique to Pakistani communities in the UK. It is an issue too in the UK's Jewish community and globally among the Amish and also French Canadians.\n\"It's often the case that the exact familial tie can't be traced, but the gene occurs more commonly within a certain group, and for that reason, both parents carry the affected gene,\" Prof Oddie says. \"It's an oversimplification to say that cousin marriage is the root of all excess recessive disorders in Bradford or in Pakistani communities. Endogamy is an important feature.\"\nAnd in Bradford at least, some are taking the message on board. Back at the sisters' house, all three women we interview say that ideas around cousin marriage are slowly changing, in part due to an increased awareness of health risks. They live in the deprived, post-industrial Manningham area of the city. There's a distinct feeling of neighbourliness here. All of the front doors open directly onto the street, which is full of children playing. Occasionally the sounds of their laughter drift inside.\n\"It has to be something that happens gradually - it's slow, you can't rush it,\" says Salina, the sister who chose to have a love marriage. \"My mum was very young when she came [to the UK from Pakistan]. She had certain views but those changed because she loves us. I just explained to her, 'Mum, how does it benefit you to push cousin marriage?'.\"\nMallika, her older sister, agrees. \"It's also to do with social media and being exposed to different people,\" she says. \"You have new connections... contact with people outside our parents' eyes.\"\nEven Ayesha, the oldest sister who is in a cousin marriage, said she doesn't imagine either of her two children will marry their cousins.\nAt the time she married her cousin, she says, \"I didn't know any different. My parents were strong in their culture. As the generations move on, the culture is disappearing a bit.\"\nShe was aware of the genetic risks when she had her two children. Neither of them have a genetic illness.\n\"We did take that on board,\" she says, on the topic of genetic health. \"But I always feel like if it's going to happen, it's going to happen. If the child is going to be born with a disability then it will happen if you are married to a cousin or not.\"\nIndeed, in Bradford at least, the practice is in decline. The share of new mothers from across the Born in Bradford study who were first cousins with the father of their baby fell from 39% in the late 2000s to 27% in the late 2010s.\nThis is no coincidence, according to Professor John Wright, chief investigator on the Born in Bradford project. He points out that it is only recently that his team published evidence around the risks of cousin marriage in the UK.\n\"When we talked to the families 10 years ago it was very clear that people weren't aware of the risks but like all parents they want to do their best for their children. They want to have healthy children,\" he says.\n\"Education is the starting point and we've shown in Born in Bradford how powerful that is.\"\nAside from health concerns, there's another reason some people want to see cousin marriage banned: its impact on social cohesion. This is what's largely driving the debate in Scandinavia. In Norway, where cousin marriage was banned last year, lawmakers said the practice was linked to forced marriage, with some South Asian immigrant women coerced into unions with relatives.\nThey also looked at the link with so-called \"honour\" violence, according to Tonje Egedius, a journalist who covered the story for a Norwegian newspaper.\n\"[Police] claim that cousin marriage makes it easier for perpetrators to maintain honour in families,\" she says, \"and that marrying within the family is a contributing cause of honour-related violence and abuse\".\nJasmina Holten, a senior Norwegian police officer, said in an interview with Norwegian broadcaster NRK last year that some women coerced into cousin marriage found themselves trapped, with financial dependence on relatives. In those cases, divorce often means ostracism. A ban on cousin marriage could break down that abusive chain, she said.\nLikewise, Sweden's justice secretary Gunnar Strömmer said his own country's ban on cousin marriage will liberate women from \"oppressive standards of honour\".\nThis cultural argument is becoming increasingly prominent. Proponents of a ban broadly see cousin marriage as an instrument of segregation, siphoning people off from the rest of society. Nash, from the Pharos Foundation, says that a ban on cousin marriage would help reduce ethnic segregation in places like Bradford.\nOthers are sceptical of the idea that you can force people to integrate through the sharp stick of legislation. They say that even if a ban goes ahead, some couples would continue to marry their cousins through illegal, unregistered unions - and that women in those marriages may feel they no longer have the protection of the state if the relationship goes sour.\nFor some, the idea of an outright ban raises the ugly image of certain minorities being targeted over others. Karma Nirvana, a charity that works to end honour-based abuse, described the backbench attempt to ban cousin marriage as \"a tool of political point-scoring, inciting hate and driving a wedge between communities\".\nRichard Holden's bill is awaiting its second reading in the House of Commons. Without government support it has never been likely to pass but its very existence and events in Scandinavia have resulted in cousin marriage being talked about far beyond the communities where it is prevalent.\nOf course, for those Britons in a cousin marriage, life goes on much as before.\nBack at the Bradford house, the beautician is putting her finishing touches to the hair of the three sisters, ahead of their big wedding at the weekend. Ayesha, the sister who is in a cousin marriage, is reflective and thoughtful about her own near decade-long relationship. \"There are difficulties - we've been through lots together, we have sacrificed a lot,\" she says about her husband. \"But we are happy together.\"\n\"I think even with love marriages you're going to have problems. They'll just be different ones.\"\nTop image credit: Getty Images", "url": "https://www.bbc.co.uk/news/articles/c241pn09qqjo"}