{"authors": ["Jennifer Meierhans", "www.facebook.com"], "date_download": "2025-04-26 03:51:30", "date_modify": "2025-04-26 03:51:30", "date_publish": "2025-03-05 11:50:48", "description": "The grocer admits breaching an order aimed at giving shoppers choice and access to the cheapest prices.", "filename": "news_articles_c5y2gwwnd0wo_1745639490.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4df9/live/b3c69790-f9b8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y2gwwnd0wo_1745639490.html", "title": "Co-op admits unlawfully blocking rival store openings", "title_page": "Co-op admits unlawfully blocking rival store openings - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Co-op has admitted breaching rules to prevent rival supermarkets from opening nearby more than 100 times.\nThe UK's competition watchdog found Co-op had breached an order which limits supermarkets' ability to prevent nearby land being used by rival retailers across England, Scotland and Wales.\nBlocking other grocers from opening nearby hits competition between supermarkets and means shoppers have less choice when trying to get cheaper prices, the Competition and Markets Authority (CMA) said.\nA spokesperson for Co-op said: \"This is a matter we take very seriously, and we have taken all necessary action to ensure this issue is resolved and does not happen again.\"\nThe Co-op admitted 107 breaches of the Groceries Market Investigation (Controlled Land) Order 2010. It has re-written 104 agreements and agreed to resolve three others, the CMA said.\nIt released a list of the 107 locations, external and in an open letter to the Co-op, the CMA said it was \"concerned by the very large number of breaches\".\nThe Co-op's spokesperson added: \"As a business that is committed to operating fairly, we recognise this is extremely disappointing.\"\nThe Co-op owns almost 2,400 stores across the UK and holds a 5.2% market share in the UK's £190.9bn supermarket industry, according to the CMA.\nThe chain said the number of breaches amounted to \"less than 2% of transactions\" across its property portfolio, which includes its supermarkets and funeral directors.\nMany of the UK's biggest supermarkets have also breached the land order in recent years, but not to the extent that Co-op was found to in the CMA's latest action.\nLast year Morrison's had the highest number of breaches of the order at 55.\nTesco 23 breaches in 2020\nWaitrose 7 breaches in 2022\nSainsbury's 18 breaches in 2023\nAsda 14 breaches in 2023\nMorrisons 55 breaches in 2023\nMarks and Spencer 10 breaches in 2023\nThe order bans new restrictive covenants which prohibit land being used for a supermarket.\nIt also bans exclusivity arrangements which prevent landlords from allowing stores to compete with an existing supermarket which were over five years long.\nDaniel Turnbull, senior director of markets at the CMA said: \"Restrictive agreements by our leading retailers affect competition between supermarkets and impact shoppers trying to get the best deals.\"\nLee Tiso, 57, from Scotland said the lack of choice where he lives means he struggles to shop around to save money.\nHe said: \"I live in Lochgilphead, which is a remote area of the Argyll. Co-op and Tesco have small stores here.\n\"The nearest Aldi and Lidl are 40 miles away in Oban and the nearest Poundland or Home Bargains is on the outskirts of Glasgow and 68 miles away.\n\"We are forced to pay whatever Co-op charges.\"\nIt's a similar issue for Maureen Loftus who moved to the Isle of Skye in Scotland. She said the only stores nearby are a Co-op supermarket, a Co-op convenience store and a Spar.\n\"I don't know why other supermarkets aren't here considering the consumer demand?\" she said.\nShe added Tesco, Asda and Morrisons make daily deliveries to a small number of click and collect points on the island - but the \"slots are so in demand\" that to get an easy slot she has to travel to another village.\n\"About 10,000 people live permanently on Skye and the number of visitors to the island is huge,\" she added.\n\"Many are in campervans, self catering accommodation or camping which means the Co-op regularly runs out of fresh foods by 16:00 during the holiday season.\"\nRising food prices have put pressure on household budgets in recent years.\nLast month, on average, the cost of buying groceries was still 3.3% more expensive than it was a year ago.\nCampaigners argue it is ever more important for consumers to have the ability to choose between a number of retailers to get the best deals.\nPeople who cannot travel to large supermarkets rely on convenience stores and can end up paying far more. This is because some retailers charge higher prices in smaller stores for the convenience of being able to buy them locally.\nAdditional reporting by Rozina Sini.", "url": "https://www.bbc.co.uk/news/articles/c5y2gwwnd0wo"}