{"authors": ["Mallory Moench", "www.facebook.com"], "date_download": "2025-04-26 07:57:33", "date_modify": "2025-04-26 07:57:33", "date_publish": "2025-02-25 12:17:56", "description": "Holmes was sentenced to more than 11 years in prison for defrauding investors in her blood-testing company.", "filename": "news_articles_c1jpg0069wgo_1745654253.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ffc3/live/53395180-f385-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpg0069wgo_1745654253.html", "title": "Theranos founder Elizabeth Holmes loses fraud appeal", "title_page": "Theranos founder Elizabeth Holmes loses fraud appeal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Theranos founder and former chief executive Elizabeth Holmes has lost an appeal against her conviction for defrauding investors in her blood-testing company.\nHolmes was sentenced to more than 11 years in prison.\nIn her appeal, she challenged trial evidence and testimony and argued that statements by her ex-business and romantic partner Ramesh \"Sunny\" Balwani about his level of responsibility for Theranos' financial model should have been included. He was jailed for more than 12 years.\nThe Ninth Circuit Court of Appeals rejected the arguments.\nJudge Jacqueline H Nguyen wrote that Theranos's claim of being able to run blood tests with a drop from a finger prick instead of a needle in a vein was \"nothing more than a mirage\".\n\"The grandiose achievements touted by Holmes and Balwani were half-truths and outright lies,\" Nguyen wrote in the opinion on behalf of a three-judge panel published on Monday.\nHolmes was convicted in 2022 of conspiracy and multiple charges of wire fraud for misleading investors over the company's financial health and the effectiveness of its technology.\nBalwani, who was tried separately and additionally convicted of defrauding patients in 2022, also lost his appeal.\nIn the appeal, both challenged a court order to pay $452m (£358m) in restitution to victims, which the court upheld.\nIn Holmes's appeal, she argued that statements from Balwani where he said he \"owned\" the company's financial model should have been included in the trial.\nThe appeal also argued that former Theranos employees offered improper expert testimony and a government inspection report should not have been included as evidence - all arguments the court dismissed.\nSilicon Valley start-up Theranos was once valued at $9bn (£7bn).\nBut in late 2015, news reporting revealed internal struggles at the company and exposed the limitations of its technology. After a two-and-a-half-year investigation, a grand jury indicted Holmes and Balwani, leading to their convictions and sentencings.\nHolmes entered prison in Texas in 2023.", "url": "https://www.bbc.co.uk/news/articles/c1jpg0069wgo"}