{"authors": ["Matt Barlow", "www.facebook.com"], "date_download": "2025-04-26 04:30:20", "date_modify": "2025-04-26 04:30:20", "date_publish": "2025-03-03 06:22:51", "description": "Tim Baker has painted the Royal Shrovetide balls since 1991, including one for the future King.", "filename": "news_articles_ce8vvr9g62jo_1745641820.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/605a/live/510f71d0-f5e4-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vvr9g62jo_1745641820.html", "title": "The Shrovetide painter whose work is fit for a King", "title_page": "The Shrovetide painter whose work is fit for a King - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"All the nerves we had that day just melted away because he was such a great person to be with.\"\nTim Baker recalls the moment that he presented the future King with the Royal Shrovetide football that he had painstakingly painted.\nIt was 2003, and King Charles III - who was Prince of Wales at the time - was starting the game or \"turning the ball up\", and like all those who are given this honour, the ball had been carefully painted with images that represented his life.\nMr Baker, 52, had been painting balls for the game since 1991 when he was asked by the game's secretary - who was also his milkman - to paint one for the future King.\nThe Royal Shrovetide Football game in Ashbourne, Derbyshire, is traditionally played on Shrove Tuesday and Ash Wednesday and has been held nearly every year since at least 1667.\nThe game sees thousands of players - in teams called the Up'Ards and Down'Ards - compete to move the ball to opposite ends of the town.\nNormally, Mr Baker said he would meet up for a chat with the person due to \"turn the ball up\" - but this was not possible with a senior member of the Royal Family - so he submitted drawings that were given the go-ahead.\n\"The current King is an accomplished artist, and one thing he asked was how we painted on a sphere,\" Mr Baker said.\nTo begin with, he starts by measuring the ball, which is bigger than a normal football and heavier because it is filled with cork chippings.\nBuildings are particularly tricky to paint on a round surface, he says, and everything needs to line up because the balls are hung up on display.\nRoyal Shrovetide is played over two days, and Mr Baker always paints the Wednesday ball - and this year it is for the farmer Brian Pegg and features a bull's head and a horse.\nHe said that some of the fine detailing could cause a headache, and each ball involved at least 50 hours of work. Within two hours of play, all this paintwork is gone.\n\"It's awful,\" he added. \"People will grab me by the collar or give me a nudge to say 'your paint has come off quick this year'.\n\"They'll tell you that, but there is nothing you can do.\"", "url": "https://www.bbc.co.uk/news/articles/ce8vvr9g62jo"}