{"authors": ["Ethan Davies", "www.facebook.com"], "date_download": "2025-04-26 07:29:33", "date_modify": "2025-04-26 07:29:33", "date_publish": "2025-02-27 18:20:02", "description": "The council says it will \"accelerate\" works in Albert Square so Christmas events can return.", "filename": "news_articles_c3rnnvl9qqqo_1745652573.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/96f8/live/ecb70170-f52b-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnnvl9qqqo_1745652573.html", "title": "Manchester's Albert Square will host Christmas events in 2025", "title_page": "Manchester's Albert Square will host Christmas events in 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Christmas events will return to Manchester's Albert Square in 2025 after years of exile due to a £430m refurbishment.\nAlbert Square was historically the centrepiece of Manchester's Christmas Markets, watched over by a giant Father Christmas, known as Zippy, that sat in front of the town hall.\nBut both Zippy and the markets left the area after the 2019 event, when the ongoing refurbishment forced festivities away from the area.\nHowever, the work is due to be complete in 2026 and Manchester City Council has said it would \"accelerate\" works to Albert Square, which will be enlarged and fully pedestrianised, so Christmas events can take place sooner than expected this year.\nSpeaking to BBC Radio Manchester, Mayor of Greater Manchester Andy Burnham said the reopening would be a \"real celebration\" for the city.\n\"I don't think it could be the full market that we remember from a few years ago,\" he said.\n\"I'm sure there'll be loads of good things, it'll be a real celebration when the square's open\"\nInitially, it was hoped the restoration would be complete by 2024, but delays and the discovery of a multitude of problems inside the Grade I listed Gothic gem mean work is now expected to finish in August 2026 - and cost £76m more.\n\"We know Mancunians and visitors alike are looking forward to having their town hall and their civic square back and better than ever and it's great that we can now look ahead to that,\" said deputy council leader Garry Bridges.\nWhile Bridges confirmed a \"festive attraction\" would be in place for winter 2025, exact details are set to be announced later in the year.\nHowever, the Local Democracy Reporting Service understands market stalls are being considered as part of the events.\n\"We are developing a civic square to rival the best in Europe and it will be exciting to see it pilot Christmas events this year ahead of a full permanent opening next year,\" Bridges said.\nIt was also confirmed today the council is planning a formal reopening ceremony of the town hall and square to \"run up to and including September 2027\", to \"mark the 150th anniversary of the building's original opening\".", "url": "https://www.bbc.co.uk/news/articles/c3rnnvl9qqqo"}