{"authors": ["Neve Gordon-Farleigh", "www.facebook.com"], "date_download": "2025-04-26 04:32:36", "date_modify": "2025-04-26 04:32:36", "date_publish": "2025-03-03 05:22:47", "description": "The centre is the first major new academic department at Cambridge to be established this century.", "filename": "news_articles_c14jj3k56j2o_1745641956.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/30bd/live/329cdf40-f5fc-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jj3k56j2o_1745641956.html", "title": "Cambridge university centre to explore how AI can help business", "title_page": "Cambridge university centre to explore how AI can help business - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new department due to open at the University of Cambridge later this year will look at how artificial intelligence (AI) can boost the economy.\nThe university said The Bennett School of Public Policy would be the first major new academic department at Cambridge to be established this century.\nResearch priorities will include examining how to use AI in both the private and public sectors.\nProf Deborah Prentice, University of Cambridge vice-chancellor, said: \"The new school will harness Cambridge expertise from across the social, physical and medical sciences to take on the most urgent policy challenges of our age.\"\nIn 2023, the university set out to enable researchers to better understand the \"double-edged sword\" of AI.\nDame Diane Coyle, Bennett professor of public policy at the university, said: \"The era of making policy in silos, where an issue is either just an education or an economy problem, for example, needs to be put behind us.\n\"Today's challenges, from effective uses of AI to reviving towns and regions, demand solutions that reflect expertise across disciplines and sectors.\"\nShe said the United Kingdom and European Union needed to \"skill-up a generation of policymakers to be smart data consumers who understand data governance\".", "url": "https://www.bbc.co.uk/news/articles/c14jj3k56j2o"}