{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:36:43", "date_modify": "2025-04-26 04:36:43", "date_publish": "2025-02-28 11:44:49", "description": "An NHS care board says it agrees that the practice needs to close.", "filename": "news_articles_cjevvdlp383o_1745642203.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/815f/live/8642c8d0-f52a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevvdlp383o_1745642203.html", "title": "GP surgery to close over safety concerns", "title_page": "Boxford village GP surgery to close over safety concerns - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A village GP surgery will close in four months over safety concerns, an NHS care board said.\nHadleigh Boxford Group Practice applied to permanently close the Boxford Mill Surgery in Boxford, Suffolk.\nThe NHS Suffolk and North East Essex Integrated Care Board (ICB) approved the application on Thursday due to \"patient and staff safety\" and to focus on services at the group's branch in Hadleigh.\nBoxford resident Colin Parr said it meant patients would carry out \"several hundred more journeys a month\" by road.\n\"There's a huge cost to the community and that's if you can actually do it, given that if you don't have transport of your own and can't drive, you are reliant on a bus service which at the moment we have to fight year on year to keep - it's not guaranteed.\"\nThe ICB said the decision had been difficult for GP partners.\nIt said the practice had considered expanding the site, but it was not possible due to space limitations.\nSafety concerns for staff and patients included:\nA lack of wheelchair access\nBlocked drains\nSewage smells\nRewiring needed\nA need for improved infection control facilities\nA report to Suffolk County Council in January concluded the Boxford building was run down.\nThe practice said that 87% of appointments for residents living in the village, and surrounding the village, were already carried out at its Hadleigh branch.\nLess than 40% of Boxford appointments were booked by the villagers, it added.\nThe practice, supported by the ICB, will prepare a detailed plan to address some of the issues raised by residents before a scheduled closure in June.", "url": "https://www.bbc.co.uk/news/articles/cjevvdlp383o"}