{"authors": ["Mark Savage", "www.facebook.com"], "date_download": "2025-04-26 04:28:52", "date_modify": "2025-04-26 04:28:52", "date_publish": "2025-03-02 09:00:07", "description": "The star's family says speculation over his death last year caused 'indescribable, lasting damage'.", "filename": "news_articles_czrnv5g6lkjo_1745641732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a42a/live/e7a1f5e0-f720-11ef-873e-a3c40463214e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czrnv5g6lkjo_1745641732.html", "title": "Liam Payne's family criticises media for 'indescribable damage'", "title_page": "Liam Payne's family criticises media for 'indescribable damage' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of pop star Liam Payne have criticised the media for causing \"indescribable, lasting damage\" through its coverage of his death.\nIn a statement released on Sunday morning, the family said that persistent \"attention and speculation\" in the press had exacerbated their suffering, and that of Payne's young son, Bear, in particular.\n\"The family has always wished for privacy to grieve and asks that they be given the space and time to do so,\" they added.\nPayne died last October after falling from a balcony at the CasaSur Palermo Hotel in Buenos Aires, the capital of Argentina. He was 31 years old.\nOn Saturday, the Brit Awards paid tribute to the star, with an emotional segment led by Jack Whitehall, who was one of Payne's friends.\n\"He achieved so much in the short time that he was on this earth, and was not only a supremely gifted musician but an incredibly kind soul who touched the lives of everyone he came into contact with,\" said the comedian.\n\"We have so many amazing memories of Liam here at the Brits, so tonight we celebrate his legacy and look back and remember the remarkable Liam Payne.\"\nThe screens then cut to a moving montage of the singer, comprising sound-bites, portraits and performances - set to the One Direction song Little Things.\nIn their statement, the star's family said they had \"joined in\" with the celebration of his life.", "url": "https://www.bbc.co.uk/news/articles/czrnv5g6lkjo"}