{"authors": ["Ruth Bradley", "Alice Smith", "www.facebook.com"], "date_download": "2025-04-26 06:56:50", "date_modify": "2025-04-26 06:56:50", "date_publish": "2025-02-28 14:35:23", "description": "NHS Somerset is recruiting dentists, with services potentially starting between May and November.", "filename": "news_articles_cewkked52eno_1745650610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/957c/live/09469760-f5bd-11ef-8c2a-43d22b661d81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkked52eno_1745650610.html", "title": "Somerset: Two new NHS dental practices set to open amid 'crisis'", "title_page": "Somerset: Two new NHS dental practices set to open amid 'crisis' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two new NHS dental practices are set to open in Chard and Crewkerne as part of efforts to improve access to NHS dentistry in Somerset, a new report has revealed., external\nNHS Somerset is recruiting dentists to run the practices, with services potentially starting between late May and November.\nNHS Somerset has committed to funding 400,000 units of dental activity (UDA) annually across the two sites, worth up to £1.4m.\nHowever the report, by NHS Somerset Integrated Care Board - which was presented to Somerset Council's scrutiny committee on Thursday to seek its support - warned that NHS dentistry in the county remained in \"crisis\".\nThe report urged Somerset Council's scrutiny committee to \"recognise the pressing need for reform within the NHS dental contract and support efforts to advocate for meaningful change\".\nThe plans mark the first large-scale procurement of NHS dental services in Somerset since local NHS commissioners took over responsibility for dentistry from NHS England in April 2023.\nThey come before the Labour government sets out its 10-year plan to reform the NHS in England, set to be published in the spring, aiming to tackle its current challenges and secure future sustainability.\nNHS Somerset has also committed to providing a new dental surgery in Wellington but this has been delayed as it has been unable to find a suitable premises for it.\nThe new practices will offer a mix of NHS and private dentistry for adults and children, targeting areas that have seen reductions in NHS services in recent years.\nThe report said the new services in Chard and Crewkerne were a \"step forward, but there is still significant unmet demand for NHS dental care\".\nThe report also highlighted specific concerns about the previous Conservative government's Dental Recruitment Incentive Scheme (DRIS), announced in February 2024.\nThe plan included a £20,000 \"golden hello\" scheme to encourage dentists to work in areas with severe shortages.\nHowever, this has not resulted in a new NHS dentist being appointed in Somerset.\n\"Despite NHS Somerset's efforts to incentivise up to 15 dentists, no dentists have been appointed through the DRIS in Somerset,\" the report said.\n\"This has led to ongoing difficulties in addressing workforce shortages in the county.\"\nThe DRIS was part of the Conservative's Dental Recovery Plan, which also proposed mobile dental vans offering services in rural and deprived areas, but these have not materialised.\n\"The failure to roll out mobile dental vans has been a missed opportunity to address the needs of rural and underserved communities,\" the report states.\nSomerset's Conservatives have been approached for comment about the report's concerns.", "url": "https://www.bbc.co.uk/news/articles/cewkked52eno"}