{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:46:34", "date_modify": "2025-05-19 14:46:34", "date_publish": "2015-03-06 16:57:07", "description": "Relatives of three UK schoolgirls believed to be in Syria criticise police for not passing on \"vital\" information before they disappeared.", "filename": "news_uk-31766328_1747665994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81462000/jpg/_81462406_threewomen.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31766328_1747665994.html", "title": "Missing Syria girls' families criticise police over letter", "title_page": "Missing Syria girls' families criticise police over letter - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Relatives of three London schoolgirls believed to be in Syria have criticised police for not passing on \"vital\" information before they disappeared.\nThey say they might have been able to intervene if they had known one of the girls' friends was in Syria and that police had spoken to the trio about it.\nShamima Begum and Amira Abase, both 15, and Kadiza Sultana, 16, were each given a letter for their parents, but hid it.\nThe Metropolitan Police said the girls had not been seen as a flight risk.\nThe Bethnal Green Academy pupils are thought to have joined Islamic State in Syria last month, having initially flown to Turkey from London on 17 February.\nPolice spoke to Shamima, Amira and Kadiza after a close friend of theirs from the academy - a 15-year-old girl who has not been named - ran away to the region of Syria controlled by IS in December.\nOfficers spoke to them again at the beginning of last month and gave them letters to take home to their parents asking permission for counter-terrorism detectives to take handwritten statements about their friend's lifestyle and beliefs.\nThe girls disappeared three weeks later, having never shown the letters to their parents.\nTheir families found them hidden in the girls' bedrooms.\nRelatives have criticised detectives for not going to them directly with what they believe was vital information.\nKadiza's cousin, Fahmida Aziz, said: \"I think it's absolutely crazy for an authority like a school or the police not to inform the parents.\n\"They kept us in the dark.\"\nHalima Khanon, Kadiza's sister, added: \"If we had known what was going on, we would have definitely looked into this... taken precautions with my sister.\"\nBBC Newsnight understands that teachers at Bethnal Green Academy say they were not informed that the girl who went missing in December was feared to be with IS in Syria.\nThey say if they had been warned they could have looked out for warning signs in her friends, including the three who have disappeared.\nThe letter from Scotland Yard, first published by Vice News, external, was dated 2 February.\nIt was handed to the three girls three days later and said: \"I understand your daughter may have known [the missing 15-year-old] as a friend.\n\"It is my role to understand [the missing girl] better and the reasons why she has decided to leave this country.\n\"I am trying to gather information which may help to find her and reunite her with her family.\nThe Met said: \"There was nothing to suggest at the time that the girls themselves were at risk and indeed their disappearance has come as a great surprise, not least to their own families.\n\"The girls were spoken to in December 2014 as part of the routine inquiry by officers investigating the disappearance of their friend.\n\"We continue to liaise with the school and local education authority in connection with this ongoing investigation.\"\nHowever, Scotland Yard added that, with hindsight, more could have been done to have given the letters directly to the girls' families.", "url": "https://www.bbc.com/news/uk-31766328"}