{"authors": ["Glenn Campbell", "www.facebook.com"], "date_download": "2025-04-26 03:47:39", "date_modify": "2025-04-26 03:47:39", "date_publish": "2025-03-04 18:09:32", "description": "Donald Trump's outbursts against Volodymyr Zelensky have posed difficult questions for leaders at Westminster and Holyrood.", "filename": "news_articles_cj0qmy8gq5po_1745639259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e823/live/0b29d240-f91e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0qmy8gq5po_1745639259.html", "title": "Swinney and Starmer navigate delicate balancing act on Ukraine", "title_page": "Swinney and Starmer navigate delicate balancing act on Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As President Donald Trump reshapes the world order on live TV, it has enormous potential to impact on domestic politics.\nThat is already happening.\nAt Holyrood, First Minister John Swinney has welcomed Prime Minister Sir Keir Starmer's efforts to build a \"coalition of the willing\" to provide security guarantees to Ukraine in the event of a ceasefire deal.\nHe has also backed the UK government's £1.6bn missile deal for Ukraine.\nThe offer of support from an SNP leader is particularly notable given the party's history of caution on UK military interventions abroad.\nIn a statement to MSPs, the first minister also suggested the US decision to pause its military aid to Ukraine runs the risk of emboldening Russia, which he described as \"the aggressor\".\nThese guarded remarks probably still go further than UK ministers in questioning America's position.\nSwinney was careful to acknowledge the \"delicate balance of diplomacy\" the PM has to navigate.\nThe first minister's statement was a rejection of comments by the SNP's Westminster leader Stephen Flynn who suggested Sir Keir was \"weak\", external.\nThere is not complete unity between the Scottish and UK governments on the emerging international situation.\nThe first minister has repeated his opposition to a second state visit to the UK for President Trump in the current circumstances.\nThat is of no great consequence as the visit is not imminent and the SNP leader also envisages circumstances in which it could be acceptable.\nThe King has also suggested a preparatory meeting with President Trump at either Balmoral or Dumfries House both of which are close to Trump golf resorts in Scotland.\nThe Conservatives pointed out that it was not for Swinney to set terms.\nDefence and foreign affairs are under Westminster control although Holyrood politicians are entitled to express their views.\nThe more substantial point of disagreement between the governments is on nuclear weapons.\nThe UK has repeatedly committed to renewing and maintaining the Clyde-based Trident nuclear weapons system in order to deter Russia from deploying its own nuclear arsenal.\nThe SNP - long opposed to nuclear weapons in principle - argues that the money would be better spent on conventional weapons to help Ukraine defend itself against Russia.\nSir Keir has said that position was \"wrong-headed\" and in need of review.\nThe UK and other European countries have supplied considerable quantities of conventional weapons to Ukraine since Russia's invasion three years ago.\nThe United States has contributed even more but President Trump's decision to pause that assistance and reclaim previous spending through a minerals deal with Ukraine has dramatically changed the conversation.\nThe minerals deal remains unsigned following last week's jaw-dropping bust-up between President Trump and Ukraine's President Volodymyr Zelensky.\nIn the days since then, the prime minister has been making determined efforts to offer UK leadership where the US is stepping back.\nOn Ukraine, everything is moving at enormous speed towards a destination that is far from certain.\nThe UK and some other European countries seem prepared to commit soldiers and air crews in Ukraine to supervise a peace deal with Russia, if one can be achieved.\nThe trouble is they want the United States to offer security guarantees, a military backstop to underwrite their engagement.\nThese guarantees have not been made explicit but almost certainly involve the US being prepared to step in to support Nato allies if they were attacked by Russia while monitoring the peace.\nThat is the basis of the Nato alliance - which President Trump has said he continues to support - the principle that an attack on one member is an attack on all.\nBefore his visit to Washington, the prime minister announced plans to increase UK defence spending by billions of pounds over the next couple of years.\nIt seems that much of this cash will be diverted from overseas development spending.\nThat is a worry to those who advocate for aid as life-changing investment that boosts the UK's standing in the world.\nIt may also be of concern to the civil servants who work to deliver these programmes for the Foreign Commonwealth and Development Office - many of them based in East Kilbride.\nIf defence spending continues to rise in the coming years that would put pressure on other budgets and potentially squeeze funding for essential public services.\nIn addition to announcing a new missile supply deal, Sir Keir also met small and medium-sized firms working in the defence sector to help them gain better access to the supply chain.\nThe rearmament of Europe was probably not foremost in the Labour leader's mind when he prioritised economic growth in last year's election campaign.\nThere will be those who are extremely uncomfortable with talk of some kind of defence dividend for UK businesses now.\nThe prime minister's leadership on Ukraine received cross-party backing in the Commons on Monday and at Holyrood on Tuesday.\nWith his political opponents at least, Sir Keir stock has risen after a difficult start to his premiership.\nIt's not clear if that will help to improve the prime minister's dire opinion poll ratings and when dealing with someone as unpredictable as President Trump, there is plenty of scope for things to go wrong.", "url": "https://www.bbc.co.uk/news/articles/cj0qmy8gq5po"}