{"authors": ["Jason Lewis", "www.facebook.com"], "date_download": "2025-04-26 03:59:39", "date_modify": "2025-04-26 03:59:39", "date_publish": "2025-03-04 06:07:50", "description": "Two separate petitions call for the bus gate scheme in Portswood, Southampton, to be scrapped.", "filename": "news_articles_cewkd7xn079o_1745639979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/78d6/live/472f2a50-f820-11ef-be1d-e7df6cf5ab80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkd7xn079o_1745639979.html", "title": "Southampton council under growing pressure over traffic scheme", "title_page": "Southampton council under growing pressure over traffic scheme - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council leaders are facing growing pressure over a controversial bus gate trial, with opposition politicians leading calls for a resignation.\nTwo separate petitions have attracted hundreds of signatures calling for the scheme in Portswood, Southampton, to be scrapped.\nThe six-month trial, which started in January, means only buses, taxis and cyclists are permitted to travel at certain hours on stretches of Portswood Road.\nSouthampton City Council's Conservative group have called on the Labour council's transport chief to resign over the scheme.\nA petition launched on the council's website demanding the scheme be axed has been signed by more than 1,000 people.\nMeanwhile, the Southampton Liberal Democrats have set up their own campaign, which has almost 800 supporters, according to the Local Democracy Reporting Service.\nLib Dem councillor Thomas Gravatt said there was no clear benefit to the bus gate, with traffic being pushed onto smaller surrounding roads.\n\"Every problem that has arisen was predicted,\" Gravatt said.\n\"There is no big pot of money to put improvements in, it is best to cut our losses and scrap it.\"\nGravatt said the Liberal Democrats were generally supportive of measures to make the community better for pedestrians and cyclists, but added said the Portswood scheme did not \"help the community\" and was \"being made without public support\".\nAt a full council meeting, Conservative group leader Peter Baillie said the handling of the bus gate had been the \"highest degree of ineptitude\".\nHe called on the council's Cabinet Member for Environment and Transport Eamon Keogh to resign, or face a no confidence vote.\nIn response, Keogh said an independent audit into the scheme was underway, and would be \"completed in the coming weeks\".\n\"The audit will inform if any adjustments are needed to the measures currently in operation at this location,\" he said.\nKeogh added that the trial was thoroughly monitored and feedback was being taken on board.", "url": "https://www.bbc.co.uk/news/articles/cewkd7xn079o"}