{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:35:41", "date_modify": "2025-04-26 07:35:41", "date_publish": "2025-02-27 15:08:45", "description": "NI Water says the severity of wastewater and drainage development constraints will increase as a result.", "filename": "news_articles_c15qqlv79gqo_1745652941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cfc5/live/23e388c0-f514-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qqlv79gqo_1745652941.html", "title": "Funds not available for Belfast water infrastructure plans", "title_page": "Funds not available for Belfast water infrastructure plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There is not enough funding available to deliver a number of major infrastructure projects, NI Water has said.\nIt says the severity of wastewater and drainage development constraints will increase as a result.\nThe company plans to set out the implications of deferring the Living With Water Plan (LWWP) for Belfast, a £1.9bn programme, next month.\nThe decision means work to upgrade sewage works at Sydenham, Whitehouse and Kinnegar cannot proceed, and works planned at Glenmachan, Greenisland, Carrickfergus and on the sea outfalls will not start.\nNI Water says it will begin a programme of maintenance this spring to \"ensure the existing facility operates as effectively as possible\".\nLast year, the former Infrastructure Minister John O'Dowd said an estimated 50% increase in the cost of the plan was not affordable.\nWhen LWWP was published in 2015, it set out three objectives:\nProtect against flooding\nEnhance the environment\nProvide the capacity to allow further development such as house building\nThe lack of wastewater infrastructure has been a longstanding concern of developers who said it was preventing economic growth in the city.\nDrainage in Belfast was originally designed by Victorian engineers as a combined system, with both sewage and storm water flowing through the same pipes.\nThat was due to the shape of the city, sitting at the bottom of hills at near-sea level.\nA spokesperson for the Department for Infrastructure (DfI) said that within two years of the plan being developed, NI Water \"revealed that its projected costs had increased by over 50%\".\nThis increased the overall cost of the plan from £1.4bn to £2.1bn, the department said.\n\"As a consequence, NI Water has chosen to defer delivery of the major upgrades needed to its wastewater infrastructure around Belfast Lough,\" a spokesperson added.\n\"NI Water will, however, focus on additional maintenance to ensure that these assets can continue to operate until such times as budget is available to undertake more substantial upgrades. \"\nDfI said it has allocated £500 million to NI Water within the last financial year.\nIn a statement, NI Water said in late 2024, the DfI had carried out a review of the LWWP and concluded the original 12-year scale is \"no longer achievable\".\nIt added that the delivery cannot be taken through a formal programme, but will instead need to be carried out by individual partners, such as NI Water, at a \"scale and pace achievable within available budgets\".\n\"The projects included within the Living With Water in Belfast Plan... are major infrastructure upgrades which require significant and sustained investment over a number of years which is currently not available to NI Water,\" it added.\n\"Therefore, the projects have been paused indefinitely.\"\nBelfast City Councillor Anthony Flynn described Thursday's announcement as \"not a shock at all\".\n\"It's something that we've known about for decades,\" he told BBC Radio Ulster's Evening Extra programme.\nThe Green Party representative said the government has done \"nothing\" to address the concerns around wastewater infrastructure, which have cropped up over the years.\n\"That is unacceptable and right now we are seeing over 20 million tonnes of untreated sewage spilling into our waters,\" he added.\n\"Every single lake, every single river, every single coastal waterway in Northern Ireland does not meet good environmental quality standards.\"\nFlynn said the issues surrounding water infrastructure were causing delays to new housing being built in the city.\n\"We have a housing waiting list across Northern Ireland, but particularly in Belfast, that is tens of thousands of households long,\" he said.\n\"This could have been dealt with many years ago. The fact is, decisions were not made 20 years ago to deal with this issue.\"\nAlliance assembly member Peter McReynolds, who is the party's infrastructure spokesperson, said the rising cost of the project meant it was \"challenging\" to deliver it.\n\"Unfortunately in Northern Ireland people aren't willing to have those conversations about how we actually manage our water,\" he told Evening Extra.\n\"These are major, resource-heavy, capital investment-heavy projects. These things require long-term strategic and consistent investment, and strategic planning.\"", "url": "https://www.bbc.co.uk/news/articles/c15qqlv79gqo"}