{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 12:57:03", "date_modify": "2025-05-20 12:57:03", "date_publish": "2023-08-07 00:00:00", "description": "Updates from across the African continent.", "filename": "news_live_world-africa-66073092_1747745823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1821A/production/_130724889_mediaitem130724888.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-africa-66073092_1747745823.html", "title": "Africa Live this week: 7-13 August 2023", "title_page": "Africa Live this week: 7-13 August 2023 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nigerian mosque collapses killing at least seven\nMollie Perella\nBBC World Service Newsroom\nA mosque in the Nigerian city of Zaria has collapsed during Friday prayers, killing at least seven people.\nSeveral others have been hurt. A local official said hundreds of worshippers were in the building at the time.\nRescue teams have been searching the rubble.\nThe Emir of Zaria told local media that a crack had been discovered in one of the walls on Thursday.\nWest Africa defence meeting on Niger postponed\nGrant Ferrett\nBBC World Service\nA planned meeting by West African chiefs of defence staff to discuss the coup in Niger has been postponed at short notice.\nThe talks - called by the regional bloc, Ecowas - had been expected to take place in the Ghanaian capital, Accra, on Saturday.\nNo reason was given for the delay. On Thursday, West African leaders ordered a standby military force to be activated in readiness to restore civilian rule in Niger.\nLarge crowds of supporters of last month's coup gathered near a French military base in Niamey on Friday to denounce Ecowas and France.\nUS Secretary of State Antony Blinken has expressed grave concern for the family of deposed president of Niger, who he said were being held under worsening conditions.\nSouth Sudan opposition boycotts budget session\nNicola Mandil\nBBC News, Juba\nThe approval of South Sudan's 2023-2024 national budget has come to a halt after opposition MPs walked out of the session in the capital, Juba, over a proposed salary increase for civil servants on Friday.\nThe country is in its second month of the new financial year without an approved national budget as cabinet and the parliament disagree on the nature of the budget.\nMPs from the main opposition political party, the Sudan People’s Liberation Movement in Opposition (SPLM-IO) of First Vice President, Riek Machar, want a 600% salary increment for civil servants in order to meet the high cost of living.\nMeanwhile, the Minister of Finance and Planning, Bak Barnaba Chol, insisted that the MPs should pass the budget with a proposed 400% increment.\nThis rift led to the walking out of the opposition MPs.\nA prominent civil society group, the Community Empowerment for Progress Organisation (CEPO), says it was disheartened and disturbed by the failure of the MPs to pass the budget during the third reading.\nEdmund Yakani, Executive Director of CEPO, says failure to pass the national budget will have negative implications on the \"political transition process\" the country is undergoing.\nSouth Sudan is planning to hold elections in December 2024. The polls will be the first in the world’s newest country, which seceded from Sudan 12 years ago.\nKenya's Nviiri: ‘You might end up in one of my tracks'\nDJ Edu\nPresenter of This Is Africa on BBC World Service\nKenyan singer, songwriter and guitarist Nviiri Sande is an artist who has a love for storytelling, so much so that he has warned people to be “careful” when telling him stories as they “might end up in one of my tracks”.\nHe wants his audience to focus just as much on what he is saying as the way he sings.\n“I live in my head a little bit more than usual,” he says. “I can create scenarios out of thin air.”\nNviiri studied mechanical engineering in Kenya, then spent a bit of time teaching IT before turning his hand to video production and editing.\nAnd that’s what got him his lucky break – because through that work he met Kenyan Afropop super group Sauti Sol.\nThey worked together to create their 2018 comeback hit Melanin - featuring Nigerian Patoranking. And then they signed him to their label the Sol Generation Records.\nHe had his first big solo hit in 2019 with Pombe Sigara. In English that means alcohol and cigarettes - but the song is about being addicted to love.\nFor a couple of years, Nviiri the Storyteller did mostly love songs – becoming, he says, “the principal of the School of Heartbreak” in Kenya.\nBut in 2021 he mixed up his style, releasing his track Nikita, and reinventing himself as Bwana Sherehe – a rockstar man of the party. He grew his dreadlocks long and became more vocal, pushing for changes and improvements in the Kenyan music industry.\nHe has just released his second album, Inside Out. The 15 tracks are a mix of different genres – Amapiano, RnB, Afrobeats and Kenya’s own Gengetone, which evolved from Genge-rap, and blends rap, Reggaeton and Dancehall.\nIt includes a collaboration with Nigerian Afrobeats star, and former This is Africa guest, Chike.\nThe songs are proving popular not just in Kenya, other African countries, and the UK, but also in places like Russia and Croatia.\n“Thanks to the internet, your music can go anywhere now – as long as it hits the right person, the right ear, and the right emotion.”\nTo hear the full interview with Nviiri , listen to This is Africa on BBC World Service radio and partner stations across Africa, and online here.", "url": "https://www.bbc.com/news/live/world-africa-66073092"}