{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:31:44", "date_modify": "2025-04-26 04:31:44", "date_publish": "2025-03-03 06:09:39", "description": "The area of land near Ullapool, in the north west Highlands, is larger than the city of Dundee.", "filename": "news_articles_cr42n0dqqzno_1745641904.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1a5d/live/c10633a0-f5f0-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr42n0dqqzno_1745641904.html", "title": "Scottish Wildlife Trust buys Inverbroom Estate near Ullapool", "title_page": "Scottish Wildlife Trust buys Inverbroom Estate near Ullapool - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A conservation charity has bought an 18,824-acre (7,618ha) Highland estate for £17.5m after receiving a large private donation.\nScottish Wildlife Trust (SWT) plans to regenerate native woodland, restore peatland and carry out nature-friendly farming on Inverbroom Estate.\nThe area of land near Ullapool, in the north west Highlands, is larger than the city of Dundee.\nThe donation that made the purchase possible was the largest in the trust's 60-year history.\nThe land is mostly made up of peatland, woodland, farmland and lochs, including 2.5-mile (4km) long Loch a' Bhraoin.\nThe wildlife includes otters and pine martens.\nThere are two bridges on the estate designed by Sir John Fowler, chief engineer on the construction of the Forth Road Bridge and a former owner of the estate.\nSWT chief executive Jo Pike said: \"The site includes some of Scotland's most iconic species and habitats, so we are delighted to have been able to secure it for the benefit of Scotland's wildlife and people, especially as there was also interest from overseas buyers.\n\"It has all been made possible by the incredible generosity of a private donor who is passionate about the part that Inverbroom can play in restoring our precious ecosystems, while delivering benefits for local people.\"\nScott Renwick's family have farmed at Inverbroom for three generations.\nHe said: \"We as a family are delighted to have the opportunity to work alongside the Scottish Wildlife Trust.\n\"Our grandfather moved to Inverbroom in 1933, so the family have had a knowledge of the land for 92 years.\n\"There is an incredible diversity of wildlife on the estate, from sea-level to 3,300ft, from seals on the shore to ptarmigan on the tops.\"", "url": "https://www.bbc.co.uk/news/articles/cr42n0dqqzno"}