{"authors": ["Steve Rosenberg", "www.facebook.com"], "date_download": "2025-04-26 06:48:50", "date_modify": "2025-04-26 06:48:50", "date_publish": "2025-03-01 10:30:02", "description": "A breakdown in relations between Ukraine and the US is potentially very serious for Kyiv, but very positive for Moscow.", "filename": "news_articles_czjenv29jgdo_1745650130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/40b1/live/1c151710-f69c-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czjenv29jgdo_1745650130.html", "title": "Steve Rosenberg: Vladimir Putin can afford to sit back and watch events unfold", "title_page": "Steve Rosenberg: Vladimir Putin can afford to sit back and watch events unfold - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Friday's drama in the Oval Office sparked a swift reaction from many world leaders.\nBut not from Vladimir Putin. There's been no comment so far from the Kremlin leader.\nThen again, he doesn't really need to say anything. President Putin can afford to sit back and watch events unfold.\nDonald Trump predicted that the very public spat with President Zelensky was \"going to be great television\".\nThere's little doubt that Vladimir Putin will have enjoyed the \"show\", the dramatic spectacle of Volodymyr Zelensky, leader of the country President Putin invaded, being berated by the president and vice-president of the United States in front of the world's media.\nSome Russian officials have commented, though, on events in Washington.\nIn a post on social media, former president Dmitry Medvedev, now deputy head of the Russian security council, wrote that President Zelensky had received \"a slap down in the Oval Office\". He called on the US to stop military assistance to Ukraine.\nHow Moscow would welcome that.\nWriting on Telegram, foreign ministry spokesperson Maria Zakharova praised Trump and JD Vance for their \"miracle of restraint\" at not hitting Ukraine's president.", "url": "https://www.bbc.co.uk/news/articles/czjenv29jgdo"}