{"authors": ["Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:58:11", "date_modify": "2025-04-26 07:58:11", "date_publish": "2025-02-25 11:56:19", "description": "Plans to extend Belfast's Glider bus service to the north and south of the city are being scaled back because they are \"not economically viable\".", "filename": "news_articles_cgq900y03nlo_1745654291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a4f2/live/708c1c30-f36d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgq900y03nlo_1745654291.html", "title": "Glider: Belfast north-south plans scaled back", "title_page": "Glider: Belfast north-south plans scaled back - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to extend Belfast's Glider bus service to the north and south of the city are being scaled back because they are \"not economically viable\".\nStormont's infrastructure minister, Liz Kimmins, told the Northern Ireland Assembly that proposals to extend the plans to Glengormley in the north and Carryduff in the south cannot progress at this time.\nThe north-south Glider is estimated to cost up to £148m, but just £35m has been secured through Belfast Region City Deal funding.\nMembers of the DUP, SDLP and Alliance party have criticised the decision, including the leader of the assembly's opposition Matthew O'Toole who described it as \"shameful\".\nThe Department for Infrastructure (DfI) has previously estimated the route could be operational by 2030.\nThe Glider service involves a fleet of purple-coloured articulated buses, which are based on a tram design.\nIts first phase was launched in 2018, with services running between east and west Belfast.\nThe second phase, known as Belfast Rapid Transit 2 , external(BRT2), aims to extend the service to the north and south of the city.\nIn 2022, it was announced the preferred route was along the Antrim Road in the north, and the Ormeau and Saintfield roads in the south.\nSpeaking in the assembly on Tuesday, Kimmins said \"full funding for the delivery of this scheme is not available at present\".\nBut she said her department has \"developed options to maximise the benefits from the available funding in advance of the delivery of the full scheme\".\nThe Sinn Féin minister said any extension of the Glider service towards Carryduff was \"not economically viable at this time\" and for Glengormley it was \"not feasible at this time\".\nShe said she proposes in this early phase of BRT2 to deliver a full proposed extension to the G2 service, providing links to Queen's University and the City Hospital.\nKimmins told members of the legislative assembly (MLAs) she remains \"fully committed to progressing the entirety of the scheme\".\nO'Toole, said it was a \"deeply disappointing day\" for people in north and south Belfast.\n\"People were made promises, they've been let down,\" the MLA for Belfast South said.\n\"It is shameful to see Ministers and other Executive party representatives trumpet this announcement as 'progress' when it is exactly the opposite.\"\nKimmins said she understood frustrations people may have, but said she had to work with funding already provided to her department.\nChris McCracken, Managing Director of Linen Quarter BID, has welcomed the announcement.\n\"This is a positive for the thousands of people who work in, and enjoy, the area every day, and supports our vision for the Linen Quarter as a sustainable district,\" he said.\n\"However, we appreciate that this is only the first step of the journey and ask that the NI Executive ensures the remaining £100m capital investment is prioritised to facilitate the completion of the scheme.\"", "url": "https://www.bbc.co.uk/news/articles/cgq900y03nlo"}