{"authors": ["Bea Swallow", "Ben Prater", "www.facebook.com"], "date_download": "2025-04-26 06:36:38", "date_modify": "2025-04-26 06:36:38", "date_publish": "2025-02-26 06:47:32", "description": "The collection belonged to the late BBC sports presenter David Coleman, who died in 2013.", "filename": "news_articles_cn52725r26xo_1745649398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6dbf/live/0365e940-f392-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn52725r26xo_1745649398.html", "title": "David Coleman's career keepsakes sold at auction in Wiltshire", "title_page": "David Coleman's career keepsakes sold at auction in Wiltshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vintage typewriter and career keepsakes belonging to the late BBC sports presenter David Coleman are among his personal items sold at auction.\nColeman worked for the BBC for 46 years, providing commentary for Fifa world cups, and playing host for the BBC's primetime sporting quiz show A Question of Sport for 18 years.\nColeman passed away in 2013 at the age of 87, leaving behind a rich collection of typewritten scripts, photographs and personal mementos.\nThe \"rare and unique\" items sold for more than £1,000 at RWB Auctions in Royal Wootton Bassett, Wiltshire, on Wednesday.\nColeman was the veteran broadcaster of 11 Olympic Games, six Fifa world cups and eight Commonwealth Games, as part of a career spanning more than 40 years in the industry.\nHe also presented BBC Sports Personality of the Year from 1961 to 1983, as well as Match of the Day and Sportsnight from 1968 to 1973.\nIn 1992, his contributions to sports journalism earned him an OBE in the New Year's Honours from Queen Elizabeth II.\nHighlights from the collection to be auctioned include his production notes for the Grandstand coverage of the Grand Nationals from 1978 to 1983, containing interviews with now King Charles and the Princess Royal.\nIn addition, his OBE certificate signed by HM Queen Elizabeth II and Prince Philip, and a Royal Television Society Hall of Fame certificate awarded in 1996 are also up for sale.\nHis family say they have entered the items for auction to provide a unique opportunity to own a piece of his works from notable events in his career.\nAlso on offer is a treasure trove of items related to his public and personal life - including photographs, sports patches, a golfing trophy, and a caricature sketch.", "url": "https://www.bbc.co.uk/news/articles/cn52725r26xo"}