{"authors": ["Kirsteen O'Sullivan & Charlotte Andrews", "www.facebook.com"], "date_download": "2025-04-26 06:36:01", "date_modify": "2025-04-26 06:36:01", "date_publish": "2025-02-27 06:05:02", "description": "Frippy, who lives in Wimborne, got lost in the woods but the not-for-profit helped find him.", "filename": "news_articles_c8x4qzvlj89o_1745649361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/80d5/live/b5237e30-f483-11ef-96b5-cb16e833b61d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x4qzvlj89o_1745649361.html", "title": "Veteran using experience to help find lost dogs", "title_page": "Wimborne: Veteran using experience to help find lost dogs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who served in Iraq is now using his military experience for an entirely different mission – rescuing lost dogs.\nDave Rimmer, from Wimborne, Dorset, founded Eye in the Sky Drones, a not-for-profit organisation dedicated to reuniting owners with their pets, free of charge.\nThe team, which Mr Rimmer leads, uses advanced thermal imagery drones to methodically scour large areas.\nHe said: \"In the military we were always taught to not tell the past but to predict the future based on what we know. I use that in these situations.\"\nHe continued: \"Just knowing that I'm helping, that I'm giving hope to a dog owner, is literally all we get from it.\n\"Just the fact that maybe we can bring a pet home.\"\nMr Rimmer, who served three tours in Iraq in the RAF Intelligence Corps, recently led a four-day search operation in Bournemouth to find Frippy, a three-year-old Patterdale crossbreed.\nThe dog was startled while on a walk in the woods and vanished without a trace.\nHis owner, Julie Fripp, described the support as a \"lifeline\".\n\"I can't believe that this service exists,\" she said.\n\"They've given their own time up to look for my dog.\n\"They've never met me before and it just feels like I'm not on my own.\n\"It's like looking for a needle in a haystack trying to find a dog.\n\"The support is just fantastic.\"\nFrippy was later found by a resident in a nearby shed and is now back home.\nMr Rimmer said when a dog is found the feeling is indescribable.\n\"I can't even begin to tell you the feeling, when you've been looking for a dog and you find the dog on the drone or on foot, or whatever it is,\" he said.\n\"It is the best feeling in the world.\"", "url": "https://www.bbc.co.uk/news/articles/c8x4qzvlj89o"}