{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:52", "date_modify": "2025-05-19 15:37:52", "date_publish": "2015-02-09 18:13:32", "description": "Internet movie and television streaming service Netflix launches in Cuba, as diplomatic relations between the US and Cuba thaw.", "filename": "news_business-31322002_1747669072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80895000/jpg/_80895063_455249664.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31322002_1747669072.html", "title": "Netflix launches in Cuba as diplomatic relations thaw", "title_page": "Netflix launches in Cuba as diplomatic relations thaw - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Internet movie and television streaming service Netflix has launched in Cuba, as diplomatic relations between the US and Cuba continue to thaw.\nNetflix said its content, such as series House of Cards and Orange is the New Black, will be available to anyone with international payment cards.\nOn 15 January, the US announced new rules that ease long-running sanctions against Cuba.\nA trade embargo has been in place since 1962.\nUS credit card firms MasterCard and American Express have both said they will launch operations in Cuba soon.\nLast month, Netflix said its international expansion was proceeding ahead of schedule.\nThe company said it plans to expand to 200 countries in the next two years, and to earn \"material profits\" from its operations overseas by 2017.\n\"We are delighted to finally be able to offer Netflix to the people of Cuba, connecting them with stories they will love from all over the world,\" said Netflix co-founder and chief executive Reed Hastings in a statement, external.\n\"Cuba has great filmmakers and a robust arts culture and one day we hope to be able to bring their work to our global audience of over 57 million members.\"", "url": "https://www.bbc.com/news/business-31322002"}