{"authors": ["Kirk England", "www.facebook.com"], "date_download": "2025-04-26 04:13:16", "date_modify": "2025-04-26 04:13:16", "date_publish": "2025-03-04 11:43:26", "description": "Plans are under way for a wild beaver release in Cornwall this year, a wildlife charity says.", "filename": "news_articles_cx2xjgzp3d3o_1745640796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f363/live/68696490-f859-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xjgzp3d3o_1745640796.html", "title": "Plans under way for wild beaver release in Cornwall says trust", "title_page": "Plans under way for wild beaver release in Cornwall says trust - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More beavers could be released into the wild in the south west of England \"within a year\" as part of plans to improve nature, according to a wildlife trust.\nCornwall Wildlife Trust said plans for the reintroduction of the large rodent in the catchment area of the Par and Fowey rivers were well advanced.\nCheryl Marriott, director of nature and people at the trust, said the animals could have a \"transformational\" impact on water environments, adding: \"Nature is on its knees and beavers can help.\"\nThe National Farmers Union said it was concerned over the \"negative impacts beavers can have on productive farmland\".\nIn February the government announced it would allow the reintroduction of beavers into the wild after centuries of absence.\nThe trust said it planned to apply for a licence to reintroduce beavers into the wild, after wanting to do so for more than 10 years.\nIt follows a \"fenced trial\" run in partnership with a local farmer, which saw beavers released within an enclosure.\nMs Marriott said: \"We learnt from that what these animals can do.\n\"They build dams on small streams, they coppice trees and let more light in, they create pools.\n\"When you bring beavers back, other wildlife follows.\n\"It's going to blow our minds what these animals are going to do for us.\"\nThe charity said studies had also shown how beavers could help reduce flooding and improve water quality.\n\"It's transformational,\" said Ms Marriott.\n\"The water flowing out of beaver dams is cleaner than that going in, so they can even help with pollution because the soil and the sediment settles out in those pools.\n\"Now the government has opened up for applications, we can now go bigger and get these benefits at a bigger scale.\"\nDevon Wildlife Trust, which led England's first wild beaver reintroduction project, said the animals could bring \"real benefits to people and wildlife\".\nThe county has a population of about 100 beavers along the River Otter after extensive trials.", "url": "https://www.bbc.co.uk/news/articles/cx2xjgzp3d3o"}