{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:39:28", "date_modify": "2025-05-19 15:39:28", "date_publish": "2015-03-03 17:38:26", "description": "Families who fought for the investigation into baby deaths at Furness General Hospital said they feel vindicated after failures were exposed.", "filename": "news_uk-england-cumbria-31716895_1747669168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81375000/jpg/_81375330_390a4d61-57dc-4178-8783-5deb7fd6c616.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-cumbria-31716895_1747669168.html", "title": "Furness Hospital baby deaths: Kirkup Report 'vindicates' families", "title_page": "Furness Hospital baby deaths: Kirkup Report 'vindicates' families - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Families who fought for the investigation into baby deaths at Furness General Hospital said they feel vindicated after failures were exposed.\nThey said it had been a six year battle for the truth.\nThe newly-published Kirkup report identified 20 failures that led to the deaths of 11 babies and a mother between 2004 and 2013.\nJames Titcombe said his son Joshua would still be alive now if issues had been dealt with.\nJoshua died in 2008, nine days after being born at the hospital run by the Morecambe Bay NHS Foundation Trust.\nMr Titcombe said the report, which called the deaths unnecessary, prompted mixed feelings.\nInvestigators identified 20 cases where families were failed, 19 involving deaths.\nIn 12 cases the deaths could have been avoided with better care, in the others poor care may have contributed to their deaths, the inquiry said.\nIn 2004 newborn Elleanor Bennett died from the effects of a shortage of oxygen due to a mismanaged labour.\nThe investigation carried out was \"rudimentary\" and protective of the midwife involved.\nBetween 2006 and 2008 there was a series of further incidents, each was investigated, but so inadequately that the underlying problems went unnoticed.\nIn 2008, there was a cluster of five serious incidents.\nA baby suffered complications shortly after pre-term delivery following poor assessment and care, while a mother died in pregnancy because of the effect of high blood pressure that had been inadequately monitored.\nAnother mother - Nittaya Hendrickson - died following a series of poor decisions and her baby Chester subsequently died from the effects of shortage of oxygen.\nAlex Davey-Brady was stillborn because of a shortage of oxygen in labour, then in October Joshua Titcombe died from an infection after \"inadequate\" treatment.\nAfter 2008, there were another 10 deaths where there were significant or major failures of care - six could have expected to be prevented with better care.\nNick Triggle, BBC News health correspondent", "url": "https://www.bbc.com/news/uk-england-cumbria-31716895"}