{"authors": ["Ian Youngs", "www.facebook.com"], "date_download": "2025-04-26 03:52:07", "date_modify": "2025-04-26 03:52:07", "date_publish": "2025-03-05 11:14:17", "description": "The star wrote and directed a film about two cousins who travel to Poland to honour their grandmother.", "filename": "news_articles_c2kg17p2102o_1745639527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/44c7/live/a633e080-f9b1-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kg17p2102o_1745639527.html", "title": "Jesse Eisenberg gets Polish citizenship after directing A Real Pain", "title_page": "Jesse Eisenberg gets Polish citizenship after directing A Real Pain - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US actor Jesse Eisenberg has been awarded Polish citizenship by President Andrzej Duda, after telling the story of the Jewish population during World War Two in his Oscar-winning film A Real Pain.\nEisenberg wrote, directed and starred in the film, about two American cousins who travel to Poland to honour their grandmother, a Holocaust survivor, who was based on Eisenberg's own great aunt.\nHe told the citizenship ceremony: \"While we were filming this movie in Poland, and I was walking the streets and starting to get a little more comfortable in the country, something so obvious occurred to me, which is that my family had lived in this place for far longer than we lived in New York.\n\"And of course, the history ended so tragically.\"\nHe continued: \"In addition to that tragedy of history is also the tragedy that my family didn't feel any connection any more to Poland, and that saddened me and confirmed for me that I really wanted to try to reconnect as much as possible.\n\"And I really hope that tonight in this ceremony and this amazing honour is the first step of me, and on behalf of my family, reconnecting to this beautiful country.\"\nEisenberg was inspired to make A Real Pain after the death of his great aunt Doris at the age of 106 in 2019. She grew up in Poland but fled to the US in 1938. Other family members who remained in Poland were killed during the Holocaust.\nPresident Duda said: \"I am delighted that people from across the ocean acknowledge their heritage, recognise that their ancestors hail from the Republic [of Poland] and seek to forge a connection with our country.\"\nEisenberg was nominated for an Oscar for writing the film, while his co-star Kieran Culkin won the award for best supporting actor.", "url": "https://www.bbc.co.uk/news/articles/c2kg17p2102o"}