{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 08:10:38", "date_modify": "2025-04-26 08:10:38", "date_publish": "2025-02-26 12:29:15", "description": "Brighton & Hove City Council says the A259 will partially reopen on Monday after the Brighton Half.", "filename": "news_articles_cn9v34y045do_1745655038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ce6/live/04397690-f43a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn9v34y045do_1745655038.html", "title": "Brighton: A259 to reopen after the Brighton Half Marathon", "title_page": "Brighton: A259 to reopen after the Brighton Half Marathon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The A259 will reopen on Monday and will be ready in time for the Brighton Half Marathon, the council has said.\nGrand Junction Road has been closed for six days after warnings that the Royal Albion Hotel was at risk of \"catastrophic collapse\" prompted safety concerns and traffic about the road.\nA spokesperson for Brighton & Hove City Council said the southern part of the road would reopen on 3 March with a contraflow after demolition works at the end of this week.\nOrganisers of the Brighton Half Marathon also confirmed the event would go ahead on Sunday as planned after fears it would be affected.\nSpeaking to BBC Sussex, Brighton & Hove Council's transport lead Trevor Muten said the westbound carriageway of the A259 was expected to be handed back to the council by the weekend.\nHe added: \"I'm satisfied the work taking place will mean the Brighton Half Marathon can go ahead as planned and that we can get the A259 open to traffic again early on Monday morning.\n\"We are very aware of the impact this is having. We are very unhappy with that.\"\nMuten said an 80 tonne crane was being transported from Cambridge to Brighton and would arrive on Thursday.\nThe crane would then be used to take down any hazardous structure and scaffolding in the hotel.\nHe added that the rest of the road would be opened \"as soon as possible\" subject to work by Britannia Hotels and their contractors.\nThe closure of the A259 has caused traffic chaos in the city centre, with businesses and residents in despair about the situation.\nOne business said it had taken a delivery driver an hour to travel around 250 yards (228.6m).\nThe Royal Albion was partially destroyed after a fire broke out in the building, believed to have been caused by a discarded cigarette.\nBrighton & Hove City Council previously said it had asked for additional signage to reduce traffic around the road closures.", "url": "https://www.bbc.co.uk/news/articles/cn9v34y045do"}