{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:18", "date_modify": "2025-05-19 15:29:18", "date_publish": "2015-02-04 20:31:43", "description": "Hospitals in Devon and Cornwall are facing their \"worst shortage yet\" of nurses, says the profession's union, with about 800 vacancies according to NHS figures.", "filename": "news_uk-england-devon-31136174_1747668558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/65746000/jpg/_65746418_nurse2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-devon-31136174_1747668558.html", "title": "Devon and Cornwall shortage of nurses 'worst yet'", "title_page": "Devon and Cornwall shortage of nurses 'worst yet' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hospitals in Devon and Cornwall are facing their \"worst shortage yet\" of nurses, says the profession's union.\nRequests for information by the BBC revealed there were about 800 vacancies in Devon and Cornwall health trusts at the end of January.\nThe Royal College of Nursing (RCN) blamed a lack of training places.\nHospital trusts said they were working closely with trainers such as Plymouth University and looking across Europe for staff.\nThe shortages include more than 200 at Derriford Hospital in Plymouth, 80 at the Royal Devon and Exeter Hospital (RD&E) and more than 100 at the Royal Cornwall Hospital.\nThe total number of vacancies is nearly 6% of the total 14,300 nursing posts in the counties.\nSarah Zanoni of the RCN in the South West said: \"We are facing a bit of a demographic time-bomb as nurses are getting older, many are nearing retirement age.\n\"We have been watching this for quite a while and we are now in a position where trusts are having to spend an increasing amount of money bringing agency staff in.\"\nRetired Devon GP Dr James Vann said: \"There should have been some warning bells ringing two years ago when there should have been more nurses being trained.\n\"If that had been the case then we probably wouldn't be in the situation we are in at the moment.\"\nThe public inquiry report into Mid Staffordshire Foundation Trust, written by Robert Francis QC and published in February 2013, highlighted the importance of having the right staffing numbers and skills mix on wards.\nAccording to the Department of Health, an extra 2,400 hospital nurses have been hired since the Francis report, with over 3,300 more nurses working on NHS hospital wards and 6,000 more clinical staff overall since May 2010.\nThe Royal Cornwall Hospitals Trust said the number of nursing vacancies regularly changed.\nIt said: \"We have had good recent success recruiting nurses who have trained locally in the South West and we have also run a national recruitment advertising campaign through journals and online.\"\nPlymouth Hospitals NHS Trust said as well as its \"continuous recruitment\" it was working closely with universities to attract graduates and recruit nurses from abroad.\nRoyal Devon and Exeter NHS Foundation Trust said: \"Nurse recruitment is challenging but we are actively recruiting nurses both locally and nationally and in addition we are recruiting from abroad - mainly Spain and Italy - to cover vacancies.\n\"In addition the RD&E has invested £3.5m in its nursing staff in the past two years.\"\nDarryn Allcorn, director of workforce and development at Northern Devon Healthcare NHS Trust, said: \"There is a national shortage of registered nurses and recruitment is a challenge for all trusts.\n\"In trying to fill vacancies, community hospitals have to compete with acute hospitals and other centres and nurses can often overlook the rewarding nature of a career working in a community hospital.\n\"We continue to work proactively and creatively to fill our nursing vacancies across the trust, with a significant focus on community hospitals.\"\nRecruitment open days are taking place at Seaton Hospital on 10 February, Axminster Hospital on 14 February, North Devon District Hospital on 16 March and Tiverton and District Hospital on 23 March.", "url": "https://www.bbc.com/news/uk-england-devon-31136174"}