{"authors": ["Angela Ferguson", "www.facebook.com"], "date_download": "2025-04-26 04:18:09", "date_modify": "2025-04-26 04:18:09", "date_publish": "2025-03-04 06:41:12", "description": "The \"extremely hardy\" animals are brought in to sustainably graze on a Calderdale nature reserve.", "filename": "news_articles_c77815e0k3go_1745641089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3690/live/fd973cf0-f83f-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c77815e0k3go_1745641089.html", "title": "Exmoor ponies play key role in Brighouse conservation project", "title_page": "Exmoor ponies play key role in Brighouse conservation project - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A herd of Exmoor ponies has been brought into a nature reserve in the hope they can play a \"crucial role\" in a grasslands conservation project.\nThe four ponies have been introduced to Cromwell Bottom Nature Reserve, near Brighouse, as part of the Reviving Calderdale's Grasslands project.\nScott Patient, from Calderdale Council, said the scheme would support habitats for wildlife including butterflies, moths, birds and mammals, as well as improving soil health and boosting natural carbon storage.\nThe way the ponies grazed \"makes them brilliant for grassland conservation and their efforts should encourage more wildlife and plant life at the nature reserve\", he said.\nCalderdale Council declared an \"ecological emergency\" in 2021, warning that wildlife and wild spaces were under threat and faced major challenges, many linked to habitat loss and the impacts of climate change.\nThe Reviving Calderdale's Grasslands project, which aims to reintroduce conservation grazing at sites across the borough, is being run by the council in partnership with the National Trust and with support from Natural England.\nA council spokesperson said: \"The Exmoor breed is able to play a crucial role in the project by sustainably grazing the grasslands, maintaining pasture and naturally supporting processes such as seed germination and enhancing biodiversity.\"\nThe ponies were \"extremely hardy, with a double winter coat, and are intelligent and adaptable, making them perfectly suited for the Yorkshire climate\".\nBenefits of such conservation efforts could include reducing flooding by slowing water flow during heavy rain, they added.\nThe ponies, which are able to thrive on poor grazing, have been introduced as a natural substitute for their wild ancestors such as red deer and wild horses which would have grazed on the land in the past, the council said.\nRosie Holdsworth, from the National Trust in West Yorkshire, said: \"As a hardy native breed, Exmoors are really well suited to conservation grazing and thrive on Calderdale's species-rich pastures.\"\nThe Exmoor ponies are expected to remain at Cromwell Bottom until spring.", "url": "https://www.bbc.co.uk/news/articles/c77815e0k3go"}