{"authors": ["Daniel Mumby", "www.facebook.com"], "date_download": "2025-04-26 03:53:21", "date_modify": "2025-04-26 03:53:21", "date_publish": "2025-03-03 08:50:24", "description": "A \"decaying\" community hall will be replaced with \"a comfortable and welcoming venue for all\".", "filename": "news_articles_cd6540qjjdeo_1745639601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47d5/live/c725d800-f364-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd6540qjjdeo_1745639601.html", "title": "Town to get 'welcoming' new community hall", "title_page": "Town to get 'welcoming' new community hall - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"decaying\" community hall will be replaced with \"a comfortable and welcoming venue for all\" after planning permission was granted.\nMorland Hall at Highbridge in Somerset, currently provides a focal point for the Morland estate following the recent loss of the local library and social club.\nThe Sedgemoor Community Partnership put forward plans in October 2024 to demolish the current structure and replace it with a more modern facility.\nSomerset Council has now given these proposals the green light, meaning demolition work could begin before the end of the year, according to the Local Democracy Reporting Service.\nThe hall is on Pearce Drive to the north of Newtown Lake, a short distance from the Morland Community Centre on Trowbridge Close.\nThe Burnham and Highbridge Community Plan describes the current facilities as \"inadequate\" for the community's needs, especially with the closure of other facilities within easy reach of the Morland estate.\nThe new building is designed to be sub-divided, so that multiple different community groups and organisations can utilise the space at the same time.\nThe main hall will be created nearest to Pearce Drive, with a workshop area close by and a dedicated space to allow for counselling or mental health support services.", "url": "https://www.bbc.co.uk/news/articles/cd6540qjjdeo"}