{"authors": ["Myroslava Petsa and Daniel Wittenberg", "www.facebook.com"], "date_download": "2025-04-26 06:25:54", "date_modify": "2025-04-26 06:25:54", "date_publish": "2025-02-28 21:19:39", "description": "BBC reporters witnessed the extraordinary exchange between Donald Trump and Volodymyr Zelensky firsthand.", "filename": "news_articles_c2019j0w9glo_1745648754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a1e9/live/83e0ae50-f619-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2019j0w9glo_1745648754.html", "title": "Trump-Zelensky: What it was like in the room during shouting match", "title_page": "Trump-Zelensky: What it was like in the room during shouting match - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The day began with the same cordial routine the White House reserves for visiting foreign dignitaries.\nUkrainian President Volodymyr Zelensky was welcomed by US President Donald Trump at the door of the West Wing with an honour guard, and the leaders shook hands politely.\nWe were in the Oval Office as part of Ukrainian media pool, witnessing the well-rehearsed formalities and about half an hour of polite talk.\nZelensky presented Trump with the championship belt of Ukrainian boxer Oleksandr Usyk.\nTrump complimented Zelensky's clothing.\nSo far, so diplomatic.\nBut minutes later, what erupted was unprecedented to say the least. The genial tone devolved into acrimony and chaos. Voices were raised, eyes rolled, aspersions cast - and all in front of the world's TV cameras.\nThe US president and vice-president berated the visiting leader, accusing Zelensky of not being grateful enough for US support that has sustained Ukraine's war effort.\nTensions flared when Vice-President JD Vance told Zelensky that the war had to be ended through diplomacy.\nWhat kind of diplomacy, Zelensky replied.\nTalking over the Ukrainian president, Vance told the visiting leader it was \"disrespectful\" for him to come to the Oval Office and make his case in front of the American media and demanded that he thank Trump for his leadership.\nJournalists in the room watched with gaping mouths as an extraordinary exchange followed.\n\"You've done enough talking. You're not winning this,\" Trump told him at one point. \"You gotta be thankful. You don't have the cards.\"\n\"I'm not playing cards,\" Zelensky replied. \"I'm very serious, Mr President. I'm the president in a war.\"\n\"You're gambling with World War Three,\" Trump responded. \"And what you're doing is very disrespectful to the country, this country, that's backed you far more than a lot of people said they should have.\"\nVance retorted: \"Have you said 'thank you' once this entire meeting? No.\"\nUkraine's ambassador to the US watched with her head in her hands.\nThe atmosphere had shifted entirely - and all out in the open.\nOur American colleagues remarked that they had never seen anything like it. \"A scene like this was simply unimaginable in the White House,\" one told me.\nAs reporters exited the Oval Office, many stood still in a state of shock. In the White House briefing room, where the exchange was replayed shortly afterwards, the rest of the media who hadn't been in the room watched in disbelief.\nConfusion ensued. There were immediate questions about whether the planned news conference would go ahead – or if the much-anticipated deal between the US and Ukraine over mineral resources would even be signed.\nMinutes later, Trump wrote on Truth Social that Zelensky could \"come back when he is ready for peace\".\nThe news conference and deal-signing ceremony - set to take place in the East Room of the White House - was officially cancelled.\nSoon after Zelensky strode out and into a waiting SUV, as his ambassador trailed behind him.\nThey pulled away as the world was only beginning to digest an extraordinary moment.\nDespite the full-blown argument, there may still be a minerals deal sooner or later.\nBut one thing is certain: this visit by Zelensky will be remembered for entirely different reasons.\nThe world saw first-hand how negotiations between the US and Ukraine are unfolding: they are difficult, emotional, and tense.\nIt was clear that this was a tough negotiation for both parties.\nThe gift of Ukrainian boxer Oleksandr Usyk's belt certainly didn't save the situation. And after this bout at the White House, the real question now is what this means for the war in Ukraine - and Zelensky's own future.", "url": "https://www.bbc.co.uk/news/articles/c2019j0w9glo"}