{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:28", "date_modify": "2025-05-19 15:30:28", "date_publish": "2015-01-29 15:49:24", "description": "Changes to Scotland's school exam appeal system favour privately-educated youngsters over state school pupils, Labour claims.", "filename": "news_uk-scotland-scotland-politics-31043215_1747668628.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80654000/jpg/_80654356_80654355.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-politics-31043215_1747668628.html", "title": "Exam appeal changes favour private school pupils, says Labour", "title_page": "Exam appeal changes favour private school pupils, says Labour - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Changes to Scotland's school exam appeal system favour privately-educated youngsters over state school pupils, Labour has claimed.\nState schools and local authorities now pay administrative charges of up to £30 for appeals which fail.\nBut Labour said private schools were giving parents the option to pay the fee themselves.\nThe charges were brought in to help deter schools from putting in purely speculative appeals.\nThere has since been a large drop in the number of appeals to the Scottish exams agency.\nDeputy Scottish Labour leader Kezia Dugdale said Higher results could be the difference between getting a place at university or losing out, adding: \"For disadvantaged kids, in particular, this can be a deal breaker.\"\nSchool potential\nSpeaking during first minister's questions in the Scottish Parliament, Ms Dugdale said: \"Parents of private-school pupils can buy their kids a second chance, parents of private-school pupils can put their hands in their pocket to help their kids, but state school pupils can't.\"\nHowever, First Minister Nicola Sturgeon said that in 2014 there was a record number of Higher exam passes in Scotland, almost 4,000 more compared to the previous year.\nAnd she told MSPs that 18-year-olds from the poorest backgrounds were now more likely to be accepted to university.\nThe first minister said: \"We have put in place a system that is right and proportionate in terms of appeals to give young people the best opportunity of fulfilling their potential at school.\"\nThe appeals process allows schools and colleges to challenge borderline results.", "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-31043215"}