{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:19:04", "date_modify": "2025-04-26 04:19:04", "date_publish": "2025-03-04 06:22:41", "description": "Successful pilot sees funds allocated for Guernsey social prescribing scheme to continue.", "filename": "news_articles_c1kjvy3rz78o_1745641144.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3574/live/d1cca5a0-f840-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjvy3rz78o_1745641144.html", "title": "£270k funds for social prescribing scheme in Guernsey", "title_page": "£270k funds for social prescribing scheme in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A scheme that links people in Guernsey with activities to boost their wellbeing has been given additional government funding of £270,000.\nMore than 1,000 people have been referred by Bailiwick Social Prescribing (BSP) with 96% of doctors using it since it started.\nThe scheme was launched in 2021 as a four-year pilot with link workers providing personalised support through a range of options from physical activity and art to singing and green volunteering.\nThe Health Improvement Commission has been given the funding by the Committee for Health and Social Care after evaluation of the pilot scheme.\nAccording to the BSP, 61% of people who used the scheme had fewer GP appointments in the following year.\nThe project also offers help with issues such as housing, financial worries and bereavement.\nThe new funding will mean the scheme can recruit an extra link worker.\nDr Simon Sebire, the Health Improvement Commission chief executive, said: \"Social prescribing recognises the importance of the social causes of our health and the valuable contribution that non-medical community-based activities and support can make to improving personal, social and community well-being, and the challenges the Bailiwick faces in terms of an ageing population and increasing demand on health services.\"\nDeputy Marc Leadbeater, vice-president of the Committee for Health and Social Care, said the partnership with the charitable sector \"is helping transform how we manage health and wellbeing from a focus on ill health to a wider consideration of what constitutes better health for islanders\".", "url": "https://www.bbc.co.uk/news/articles/c1kjvy3rz78o"}