{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:49", "date_modify": "2025-04-26 04:02:49", "date_publish": "2025-03-03 22:42:52", "description": "Toilets at Edinburgh libraries are open to the public but those at other council properties are restricted.", "filename": "news_articles_cvgw9zn0ld0o_1745640169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d602/live/fd73e330-f84f-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgw9zn0ld0o_1745640169.html", "title": "Edinburgh council venues could open toilets to public", "title_page": "Edinburgh council venues could open toilets to public - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Toilets at Edinburgh's council-owned venues and sports centres could be opened to the public in a bid to tackle a lack of facilities in the capital.\nA bid to open toilets at council arms-length body Edinburgh Leisure facilities, the Edinburgh International Conference Centre and other local authority-owned companies to the public will be discussed by councillors next week.\nGreen councillor Dan Heap, who put forward the proposal, said there were areas of the city with no public toilets.\nHe also said research should be carried out on how to better advertise public toilets in the council, such as through an online map.\nThe council publishes a list of public toilets and their opening times, as well as a map showing the locations of changing places - fully accessible toilet facilities - in the city.\nHowever, it said toilets in some council buildings, such as schools, should remain closed to the public for safeguarding reasons.\nMr Heap, who represents Edinburgh's Sighthill/Gorgie ward, said: \"There are areas of the city where we don't have any public toilets.\n\"This came through my own experience with Gorgie. We don't have any public toilets, so you have to go to Saughton Park or Princes Street.\n\"But in the area, we do have Gorgie Farm, we have an Edinburgh Leisure pool, where people could use those – but Edinburgh Leisure's policy is that you can't use their toilets if you're not a member.\n\"We're trying to make sure that any council building that's appropriate with public toilets has a default right of access.\"", "url": "https://www.bbc.co.uk/news/articles/cvgw9zn0ld0o"}