{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:02:43", "date_modify": "2025-04-26 08:02:43", "date_publish": "2025-02-26 16:54:25", "description": "Greater Manchester Police told the police watchdog it had \"concerns\" over its original investigation.", "filename": "news_articles_cvgpey152rvo_1745654563.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a3d/live/9dd59c60-f45e-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgpey152rvo_1745654563.html", "title": "Walkden fire: Police watchdog considers new investigation", "title_page": "Walkden fire: Police watchdog considers new investigation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The police watchdog is considering a new investigation into officers' contact with a mother before an arson attack which claimed her life and the lives of her four children, a court has heard.\nDemi Pearson, 15, her brother Brandon, eight, and sisters Lacie, seven, and Lia, three, died in a petrol bomb attack on their home in Walkden, Greater Manchester, in December 2017.\nTheir mother Michelle Pearson, 37, who suffered 68% burns to her body, died almost two years later.\nA pre-inquest review hearing was told Greater Manchester Police (GMP) had \"some concerns\" around the Independent Office for Police Conduct's (IOPC) original investigation, putting the full inquest set for June in doubt.\nThe IOPC investigated the family's contact with GMP involving incidents and threats from their killers, and a report was completed in 2019, but not made public.\nGlynis Craig, representing the IOPC, told the hearing at Bolton Coroner's Court that the watchdog had been notified by GMP of \"some concerns\" around the IOPC original investigation and had asked it to review it.\nThe IOPC was now deciding, following the review, whether it needed to conduct a new investigation, Ms Craig said.\nTimothy Brennand, senior coroner for Greater Manchester West, told Ms Craig that if ever there was a case that merited more resources to prevent further delay, \"this is the case\".\nMr Brennand said the Pearson family wished to know whether any possible failures by the police or other local authorities put the family at risk.\nHe added: \"The family have raised serious misgivings of missed opportunities for state agencies to have adequately assessed the risk to life and take appropriate action.\n\"The family contend the deaths to be wholly preventable and were not sufficiently involved in the subsequent investigations, have no confidence in findings, some of which are not within the public domain as yet.\"\nZak Bolland and David Worrall were both given four life sentences and told they would serve a minimum of 40 and 37 years respectively for the murders at the Pearson family home on Jackson Street.\nBolland's girlfriend Courtney Brierley, 20, was also jailed for 21 years for four counts of manslaughter after the trial at Manchester Crown Court in 2018.\nA major safeguarding review was launched into how authorities, including the council, police and health officials, handled contact with the family before the fatal attack.\nThis review has also not been made public.\nThe trial heard how Mrs Pearson's home was previously attacked, its windows and doors smashed, graffiti sprayed on the walls and her wheelie bin set on fire.\nShe saw at least six different officers, statements were made, risk referral forms completed, fire service personnel carried out two \"safe and well\" visits, the family social worker was informed and social services were alerted.\nMrs Pearson told her housing provider, City West, she did not feel safe at home with her children and wanted out, jurors were told.\nCity West said it never received any request for a move, believed to have been handled by Salford City Council.\nOfficers from GMP took a statement from Mrs Pearson on the night of the fire, having been called out after Bolland had been round \"kicking off\".\nIt is not clear if officers immediately actively sought out Bolland, who lived not far from Mrs Pearson and was at home at the time the officers called.\nHours later he and Worrall returned to the Pearsons' home armed with two petrol bombs.\nA further pre-inquest hearing will be held on 4 April.", "url": "https://www.bbc.co.uk/news/articles/cvgpey152rvo"}