{"authors": ["Toby Paine", "www.facebook.com"], "date_download": "2025-04-26 06:57:49", "date_modify": "2025-04-26 06:57:49", "date_publish": "2025-02-28 13:52:57", "description": "Portsmouth City Council grants planning permission to convert Venture Tower into student flats.", "filename": "news_articles_c2err8y4xzlo_1745650669.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/697d/live/ff040170-f5d0-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2err8y4xzlo_1745650669.html", "title": "Portsmouth abandoned tower plans approved, despite controversy", "title_page": "Portsmouth abandoned tower plans approved, despite controversy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Controversial plans to convert an abandoned tower into student accommodation have been approved.\nPortsmouth City Council has granted planning permission to convert Venture Tower into student flats.\nThe development will transform the abandoned Fratton building into a 100-bedroom student residence, featuring extensions, new cladding, and communal facilities.\nThe decision comes despite concerns raised by local residents, including around parking and community impact.\nHe also raised concerns about potential anti-social behaviour, noise disturbances, and the effect on the well-established local community.\n\"Long-standing residents have built a cohesive and engaged community, and this development threatens to undermine that sense of stability and belonging,\" he added.\nThe project includes a mix of fully accessible rooms, studio apartments, and self-contained units, as well as study rooms, a leisure room, a cinema, and a gym.\nGerald Vernon-Jackson, chair of the council's planning committee, said: \"I've known this empty building for 25 years, and having an empty building in such a prominent location for that long is not good for the city.\"\nRegarding concerns that the property could be used to accommodate groups other than students, Mi Casa Developments said: \"We've designed the building in a modular fashion so that if, in the future, there's no longer any need for student accommodation, we can convert it into an apartment building with minimal work to meet whatever need arises.\"\nMr Vernon-Jackson emphasised that the council could not dictate the specific use of private developments.", "url": "https://www.bbc.co.uk/news/articles/c2err8y4xzlo"}