{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:59:55", "date_modify": "2025-05-19 14:59:55", "date_publish": "2017-07-04 00:00:00", "description": "The European Parliament reviews Malta's EU presidency, gives initial backing to new tax transparency rules and formally approves Bulgaria's new commissioner.", "filename": "news_live_uk-politics-parliaments-40482493_1747666795.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-politics-parliaments-40482493_1747666795.html", "title": "MEPs endorse EU tax transparency rules", "title_page": "MEPs endorse EU tax transparency rules - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodnight & Coming up tomorrow\nWith that, tonight's sitting comes to an end.\nMEPs will be back tomorrow at 08.00 BST, when they will be debating this week's G20 summit in Hamburg.\nEuropean Council President Donald Tusk and European Commission President Jean-Claude Juncker have pulled out to attend the funeral of former MEP Simone Veil.\nEstonian Prime Minister Jüri Ratas will join MEPs to preview his country's EU presidency, which begins this month.\nMEPs will set out their legislative wish-list for 2018 at a vote at lunchtime.\nMEPs debate new powers to prosecute fraud\nFinally tonight, MEPs are debating legislation that would introduce new definitions for offences against the EU budget.\nThe rule change is intended to make it easier to bring prosecutions against people who misuse EU funds or commit fraud.\nThe law, which will be put to a final vote tomorrow, will create new powers to be used by a new EU body to be set up by 16 member states.\nThe creation of a European Public Prosecutor's Office (EPPO) had gridlocked for years due to opposition from national governments including the UK.\nHowever, an EPPO will now be set up under an EU procedure, external which allows willing countries to seek greater ties.\nMEPs debate use of cultural ties in diplomacy\nNext up tonight, MEPs are debating a motion from two parliamentary committees calling for the EU to make better use of culture in its diplomatic relations.\nThe report, whose recommendations are only advisory, advocates the creation of a cultural visa programme to allow certain non-EU nationals to travel to Europe.\nIt also calls for a section of the EU budget to be dedicated to “supporting international cultural relations”.\nMogherini: Rights 'integral' to EU-Cuba agreement\nEuropean Parliament\nStrasbourg\nEU foreign policy chief Federica Mogherini says that relations between the EU and Cuba have seen a \"step change\" in recent years.\nAs well as facilitating more investment and building social ties, she says the new agreement will give rights groups in the country a \"channel for dialogue and co-operation\".\nShe seeks to assure MEPs that expectations on political rights are an \"integral part\" of the agreement.\nMEP: EU should make Cuba 'open up'\nDebate on EU-Cuba agreement\nEuropean Parliament\nStrasbourg\nCentre-right Estonian MEP Tunne Kelam says that, as a large trading partner, the EU is in a position to pressure Cuba into \"opening up\".\nHe says EU relations with non-democratic countries need to be based on a balance between boosting economic ties and improving rights - but this is \"not yet there\" in the case of Cuba.\nHe says that, despite in increase in exports, the situation regarding political rights in Cuba has not improved.\nRight groups expect the EU to \"take the side of the Cuban people\", rather than the government, he says.\nMEPs debate EU-Cuba agreement\nMEPs are now debating EU relations with Cuba ahead of tomorrow’s vote on whether to ratify a co-operation agreement with the island.\nThe agreement, signed in late last year, has created a new legal framework for diplomatic relations but will not create a free trade zone or cover investment protection.\nThe EU had suspended its relations with Cuba after scores of dissidents were imprisoned in 2003 – although some EU nations such as Spain and France never severed ties.\nCuba agreed to normalise relations with the United States in 2014.\nMEPs debate Saudi Arabia role on women's group\nEuropean Parliament\nStrasbourg\nHumanitarian Aid Commissioner Christos Stylianides has joined MEPs to debate the recent election of Saudi Arabia to the UN Commission on the Status of Women.\nThe appointment of Saudi Arabia, in a secret ballot, has drawn criticism because of the country’s gender rights record.\nThe country strictly enforces a policy of gender segregation between unrelated men and women.\nIts term is due to begin next year and last until 2022. It comes after the country was recently re-elected to the UN’s human rights council.\nHow is the EU budget set?\nThe EU budget for each year must be within the limits specified by the long-term budget, the Multiannual Financial Framework (MFF), which runs over a seven-year period.\nSome have suggested that this should be reduced to five years to make it easier to reflect political priorities in how money is spent.\nThe European Parliament must approve the annual budgets before they can come into force.\nThe long process over setting the budget normally begins each spring, when the European Commission publishes its initial draft proposals.\nThe national governments then take an initial position, normally in the summer, before the Parliament adopts its stance in the autumn.\nIf there is a difference between the positions, then “conciliation” talks begin, where the various participants thrash out their differences behind closed doors.\nNational authorities should cut out EU 'middle man' - MEP\nDebate on 2018 EU budget\nEuropean Parliament\nStrasbourg\nUKIP's Jonathan Arnott says the EU budget is \"much too high\" and criticises money spent on \"political\" EU information campaigns and grants to candidate countries.\nHe says MEPs should ask whether money might be spent more effectively by \"cutting out the middle man\" and keeping the cash in the hands of national authorities to spend directly.\nMore should be done to assess those spending projects which have \"actually added value\" by being done at an EU level, he adds.\nMEP: Across-the-board cuts 'clearly irresponsible'\nDebate on 2018 EU budget\nEuropean Parliament\nStrasbourg\nCentre-right Romanian MEP Siegfried Mursesan, who is Parliament's lead negotiator for this year's talks says he would oppose the practice of making \"automatic cuts to all budgetary lines\".\nHe says this has been suggested by national governments consistently in recent years, but is \"clearly irresponsible\" and does not reflect that spending should show political priorities.\nHe says the European Parliament will have two priorities in the forthcoming talks: more investment to boost employment, and more spending on security.\nMEPs debate next year's EU budget\nBudgetary matters will remain on the menu this afternoon for a little while longer, as MEPs debate next year’s annual budget.\nTomorrow MEPs will vote on a motion to set out their initial position on spending for 2018, ahead of the start of negotiations with national ministers and the EU Commission.\nGovernments are expected to take their position later this summer.\nThe European Commission suggested in May that the budget should be set at €161bn for new budgetary commitments, with payments made during the year to total €145bn.\nDon't 'rob Peter to pay Paul' - MEP\nDebate on the future of the EU budget\nEuropean Parliament\nStrasbourg\nIrish Fine Gael MEP Mairead McGuinness says she is glad that the Commission's paper is \"not all pessimistic\".\nShe says that adopting an attitude of \"robbing Peter to pay Paul\" would be unhelpful - and says money should not be taken from agriculture spending to make up for shortfalls elsewhere.\nCatalan MEP: EU budget 'should be more autonomous'\nDebate on the future of the EU budget\nEuropean Parliament\nStrasbourg\nCatalan nationalist Jordi Sole says that Brexit should be seen as an opportunity to create an EU budget that is \"more autonomous\" of contributions from member states.\nHe suggests this could be done by boosting ways for the EU to raise more of its own revenue.\nThe DUP's leader in the assembly, Diane Dodds, says if the Commission goes down a \"predictable path\" of creating new spending priorities after Brexit, the budget shortfall could balloon to €25bn.\nThe budget needs to serve taxpayers as well as the \"federalist ambitions of some\", she adds.\nCommissioner: 'Logical' to get rid of all rebates after Brexit\nDebate on future of EU budget\nEuropean Parliament\nStrasbourg\nBudget commissioner Gunther Oettinger says that \"initial choices\" for the future of the budget will be outlined in Jean-Claude Juncker's next \"state of the union\" speech in September.\nFirmer plans will be launched in the first three months of next year, he continues.\nHe adds that the legal and financial implications of Brexit will have to be known before the EU can adopt a new framework for its long-term budget, known as the MFF, external.\nHe says there is a \"logical incentive\" to get rid of the various national rebates after Brexit, as he says these only came about because of the one applied to the UK. He goes on to say:\nQuote Message\nThis is the mother of all rebates - maybe we should lose the children.\"\nMEPs debate future of EU budget\nMEPs are now debating another paper from the European Commission, this time on the future of the EU’s budget.\nLaunching the paper last week, the budget commissioner said the UK's departure from the EU will leave a budget shortfall of at least €10bn.\nGünther Oettinger said the bloc must either spend less or find new money to fill the gap, equivalent to an estimated 16% of the entire budget.\nAmong the options on the table could be less generous payments to farmers or a tax on financial transactions.\nUK should 'stay plugged in' to EU plans after Brexit\nDebate on EU defence fund\nEuropean Parliament\nStrasbourg\nConservative MEP Charles Tannock, who sits on the foreign affairs committee, says he hopes the UK can stay \"as plugged in as possible\" to the EU's common defence and foreign policies after Brexit.\nGerman social democrat Knut Fleckenstein says that the debate over the 2% of GDP Nato defence target should be separate from what is in the EU document.\nHe adds that the ideas floated by the European Commission are not about increasing military intervention but more support for \"civil peacekeeping means\".\nMogherini: EU can help 'efficiency' of national military spending\nDebate on EU defence fund\nEuropean Parliament\nStrasbourg\nResponding for the European Commission, EU foreign policy chief Federica Mogherini says that greater security comes out as a public priority in Eurobarometer, external surveys.\nShe says the Commission's plans will \"not lead to militarisation of the European Union\" - nor an EU army.\nShe tells MEPs that greater defence spending is a matter for national governments, not the EU institutions - but that the EU can help countries \"spend better\" and \"more efficiently\", adding:\nQuote Message\nthis is not about militarising, this is about rationalising\"", "url": "https://www.bbc.com/news/live/uk-politics-parliaments-40482493"}