{"authors": ["Andy Mitchell", "www.facebook.com"], "date_download": "2025-04-26 03:56:43", "date_modify": "2025-04-26 03:56:43", "date_publish": "2025-03-04 14:55:59", "description": "Warwickshire council's cabinet will be asked to vote for leader Izzi Seccombe to submit the plan.", "filename": "news_articles_c3w14d9d414o_1745639803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5987/live/9b1ac3f0-f905-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w14d9d414o_1745639803.html", "title": "Warwickshire councillors to discuss local authority merger plan", "title_page": "Warwickshire councillors to discuss local authority merger plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors are set to discuss plans to create a single county-wide authority in Warwickshire, with proposals including halving the number of councillors, saving £21m a year as a result\nWarwickshire County Council's cabinet will discuss a 26-page draft rationale on Thursday that makes the case for a new unitary authority, with discussions also including a proposal to join West Midlands Combined Authority (WMCA).\nWarwickshire is currently covered by one county council and five smaller district and borough councils, with services split over these two levels.\nThe government announced proposals last year for a major redesign of local authorities, which includes merging areas that have two tiers.\nThe six current councils have combined savings targets of £30.1m per year, rising to £97.8m in five years. The county's early estimates suggest £21m per year could be saved by one council, or £7m if there are two unitary authorities.\nWarwickshire applied in January to be part of the first wave of the scheme, but it did not make it into a shortlist of six areas selected for fast-track devolution.\nThe rationale document supports the option of one county-wide body, but acknowledges counter-proposals for two bodies – one covering Warwick and Stratford districts, and the other covering Rugby, North Warwickshire, and Nuneaton and Bedworth.\nIt is argued that keeping services together in one authority would be more cost-effective.\nAn initial submission must be sent to the government by 21 March, with detailed proposals to be fleshed out by November.", "url": "https://www.bbc.co.uk/news/articles/c3w14d9d414o"}