{"authors": ["Emma Baugh", "Andrew Woodger", "www.facebook.com"], "date_download": "2025-04-26 03:46:46", "date_modify": "2025-04-26 03:46:46", "date_publish": "2025-03-05 05:32:14", "description": "The grave goods of a child, a solid stone coffin and other burials reveal a \"unique\" cemetery.", "filename": "news_articles_cx2g0ggdd33o_1745639206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/257e/live/a4f08420-ef76-11ef-8654-d5f14cdeffe8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2g0ggdd33o_1745639206.html", "title": "Roman cemetery found at Peterborough roadworks site 'unique'", "title_page": "Roman cemetery found at Peterborough roadworks site 'unique' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Archaeologists who excavated a Roman cemetery say it is \"unique\" due to the range of different types of burial and grave goods, including bracelets buried with young child.\nThe dig team has been showing the BBC some of the jewellery discovered at the site at Wansford, near Peterborough, where the A47 is being dualled.\nThe personal treasures of those buried have been provisionally dated to the late Roman Britain period (3rd-4th Centuries), and include a solid stone coffin containing a corpse set in gypsum.\nHeadland Archaeology's Jessica Lowther said further investigation of the artefacts would help \"answer questions about those that lived here\".\nOne of the significant finds is jewellery found in the grave of the child, who was believed to have been about five years old, giving a possible indication of their wealth and high status.\nThe team said it was still unclear what community the cemetery served, as no evidence of other settlement buildings had been found in the immediate area.\nDr Sara Machin, senior specialist at Headland, said the team had been studying the finds at their base at Silsoe in Bedfordshire.\n\"It's a collection of bracelets all found with the same child. What it tells us is what people thought about them and what they thought was appropriate to go into the grave,\" she said.\n\"It's a little picture of the community and how they were burying their people.\n\"The collection in the child's grave is similar to another grave and suggests a connection.\"\nThe solid stone coffin, or sarchophagus, weighed the same as a small caravan, and featured in the latest series of the BBC's Digging for Britain programme.\nIt was made of Ancaster stone, so the team said it might have been transported 30 miles south from the Lincolnshire village that gives its name to that type of stone, indicating the high status of the person buried in it.\nMs Lowther said its lid was made using Barnack stone, which is local to the Peterborough area, therefore it was possible the original lid may have been broken and this was a replacement.\n\"This is how we tell stories about people that lived everyday lives. We don't [always] have history books written about us, but archaeology can tell us those stories,\" she said.\nMs Machin said it was \"early stages\" in piecing together information about how long the site was in use for burials, its place in the surrounding landscape and the stories of the individuals laid to rest there.\n\"What we have got now are all clues. Now we have a huge list of questions and we're moving on to the next stage to see how many answers we can get,\" she said.\nNone of the items are currently available for the public to see, and Headland said it was too early in the process for any decisions to be made about putting things on display.\nFull reports of all the archaeology found will be uploaded to Peterborough's Historic Environment Record, external, the team said.", "url": "https://www.bbc.co.uk/news/articles/cx2g0ggdd33o"}