{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:45:30", "date_modify": "2025-04-26 03:45:30", "date_publish": "2025-03-05 06:18:33", "description": "The dramatic starling murmuration was caught on camera over a \"built up urban area\" in Chester.", "filename": "news_articles_c8d464407p2o_1745639130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d6dd/live/c266de50-f9d0-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d464407p2o_1745639130.html", "title": "Falcon attack on starling mumuration in Chester 'incredible'", "title_page": "Falcon attack on starling mumuration in Chester 'incredible' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"breathtaking\" attack by what was believed to be a peregrine falcon on a murmuration of thousands of starlings has been captured on video.\nAlex Cunningham managed to film the \"incredible\" spectacle above a \"built up urban area\" in Upton, Cheshire, close to Chester Zoo in February.\nThe wildlife expert, who is the zoo's schools engagement officer, went with colleague Mayukh Chatterjee in the hope of seeing the display after hearing about it.\nHe said it was a stunning sight on an \"everyday street\", adding: \"The cherry on the cake was the sky [as] it was a stunning canvas of pink and blue illuminating the spectacular.\"\nSarah Vickers who lives on Caughall Road said she has lived in Upton almost all of her life and does not recall ever seeing a murmuration so close.\nThe 59-year-old said she was thrilled to see the display from her doorstep on 22 February.\n\"I never expected to see that here, so near surburbia,\" she added.\n\"I was so pleased.\n\"It is amazing how the birds don't collide.\"\nMr Cunningham said it was fantastic to see \"one of nature's amazing spectacles right in front of your eyes\".\nHe said he was thrilled to capture the footage and intended to show it to the students he works with to \"demonstrate that amazing wildlife can be found right on your doorstep\".\n\"It's very accessible - and we captured it on a mobile phone,\" he said.\nHe added that the only downside was that many locals had their vehicles covered in bird \"poo\".", "url": "https://www.bbc.co.uk/news/articles/c8d464407p2o"}