{"authors": ["James Grant", "www.facebook.com"], "date_download": "2025-04-26 06:59:00", "date_modify": "2025-04-26 06:59:00", "date_publish": "2025-02-27 05:59:39", "description": "The show dramatises the real-life legal battle families waged over birth defects in a steel town.", "filename": "news_articles_ckg7pvl59wxo_1745650740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/38c1/live/fc1aa670-e564-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg7pvl59wxo_1745650740.html", "title": "Toxic Town: Netflix's drama about Corby steel waste", "title_page": "Toxic Town: Netflix's drama about Corby steel waste - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Netflix drama based on a town's toxic waste scandal is now available to stream.\nToxic Town, external depicts the real-life battle of families in Corby whose children were born with defects in what Netflix described as \"one of the UK's biggest environmental scandals\".\nHere is everything you need to know about the show and the real events in the Northamptonshire town that inspired it.\nNetflix said Toxic Town focused on mothers who fought a \"David and Goliath battle for justice\".\nIn 1979, about 10,000 people worked at Corby's steelworks, but, with Britain experiencing a decline in heavy industry, steel production became uncompetitive, leading to the site's closure in 1980.\nThousands were left unemployed, prompting the local council to launch a regeneration project.\nThe British Steel Corporation demolished the works, and using government and European grants, the council began reclaiming the land.\nThe project involved moving millions of tonnes of contaminated waste to Deene Quarry, on the outskirts of the town.\nYears later, concerns arose when mothers living near the reclamation site gave birth to children with upper limb deformities.\nA 1999 Northamptonshire Health Authority study found no unusual cluster of birth defects.\nHowever, solicitor Des Collins, after reading about the cases, conducted his own investigation, revealing birth defects in Corby were three times higher than in the surrounding area.\nMr Collins assembled a team of experts, including toxicologists and pollution specialists, to argue that the council's mismanagement of toxic waste had spread contaminated dust throughout the town.\nThe heavy metal cadmium was identified on the former steel site, and a medical expert cited research linking it to birth defects in animals.\nAfter a three-month civil court hearing, Justice Akenhead ruled in favour of the claimants, marking the first time a UK court recognised airborne pollutants harming unborn babies.\nCorby Borough Council disputed the verdict and prepared an appeal, but reached a private settlement with the families in 2010.\nThe local authority no longer exists, having been replaced by the North Northamptonshire unitary council in April 2021.\nThe case remains a landmark ruling in environmental justice.\nThe four-part series features an ensemble cast led by former Doctor Who star Jodie Whittaker as Susan McIntyre.\nShe is joined by Sex Education's Aimee Lou Wood as Tracey Taylor and Bridgerton's Claudia Jessie as Maggie Mahon - all real mothers who fought the court case.\nThe Diplomat's Rory Kinnear plays solicitor Des Collins, who took on the case and appeared in the BBC documentary from 2020, similarly called Toxic Town: The Corby Poisonings.\nThe Full Monty's Robert Carlyle plays Sam Hagen, a then-Corby Borough Councillor and Downton Abbey's Brendan Coyle, who is from Corby originally, stars as Roy Thomas, a fictional amalgams of several people from the authority.\nThe Netflix series is written by Jack Thorne, known for His Dark Materials and Harry Potter and the Cursed Child.\nSpeaking to BBC Radio Northampton, Thorne said: \"It felt like this incredibly and shameful thing happened and I had no idea it happened.\n\"Bringing attention to that, not just for Corby, but the implication for every single one of us, felt an important thing for TV to do.\"\nHe said the \"hardest bit\" was deciding which mothers to focus on in the drama as all \"deserve attention\".\nBBC Radio Northampton has produced an eight-part documentary series called In Detail: The Toxic Waste Scandal, which will be available for download in March.\nThe documentary is presented by 32-year old George Taylor, who was born in 1992 with a unilateral upper limb defect.\nHis parents Brian and Fiona had run the King's Arms pub in Weldon, near the clean-up site, and the court heard dusty workers from the reclamation team had spread contaminants throughout their bar.\n\"I've never had the chance to really understand what happened in Corby that left us kids the way we are,\" said George\n\"Even if people know this story – I think they'll be surprised by what we found. It's been an eye-opener.\"", "url": "https://www.bbc.co.uk/news/articles/ckg7pvl59wxo"}