{"authors": ["Mary McCool", "www.facebook.com"], "date_download": "2025-04-26 06:45:19", "date_modify": "2025-04-26 06:45:19", "date_publish": "2025-03-01 15:48:45", "description": "Footage shows the man being flipped over the police car bonnet before he gets up and strides towards an officer.", "filename": "news_articles_cevxd8dgmkjo_1745649919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b6a/live/3a517310-f6b3-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevxd8dgmkjo_1745649919.html", "title": "Police car hits knife-wielding man who 'stabbed dog'", "title_page": "Police car hits knife-wielding man who 'stabbed dog' in Aberdeen - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man reported to police for wandering around Aberdeen with a knife was repeatedly struck by a police car as officers tried to disarm him.\nFootage of the dramatic collision in the Seaforth Road area on Friday afternoon shows the man flipping over the car bonnet before getting up and striding towards another officer.\nEventually police close in on the man, using a car and a police dog to cut him off - the dog was reportedly stabbed in the incident and was taken to a vet.\nThe man, 27, was taken to hospital for treatment and has been charged with various offences including one under the Animal Welfare Act. The matter has been reported to the Police Investigations and Review Commissioner (Pirc).\nSeaforth Road was closed at the junction with Park Road and police remain in the area while inquiries continue.\nMembers of the public with any concerns can speak to these officers.\nSupt Ross Kelly said: \"We believe this was an isolated incident and there is no ongoing risk to the public. Thankfully no officers were injured.\n\"Our thoughts are with PD Zeus and his handler and we are hoping for a speedy recovery.\n\"Police dogs are an important and valuable resource and attacks on them will not be tolerated. Our dog branch plays a crucial role in keeping people safe and we cannot overstate the value that these highly skilled animals bring to policing.\"\nAnyone with information on the incident has been urged to contact Police Scotland on 101.", "url": "https://www.bbc.co.uk/news/articles/cevxd8dgmkjo"}