{"authors": ["Tom Espiner", "www.facebook.com"], "date_download": "2025-04-26 07:46:46", "date_modify": "2025-04-26 07:46:46", "date_publish": "2025-02-27 00:33:02", "description": "Public urged to respond to commission on fixing system in England and Wales - but chairman rules out nationalisation.", "filename": "news_articles_c4g097mpl79o_1745653606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e4b2/live/711429b0-f4a6-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g097mpl79o_1745653606.html", "title": "Water industry: Public asked for ideas on fixing the sector as bills soar", "title_page": "Water industry: Public asked for ideas on fixing the sector as bills soar - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The public, environment groups and investors are being asked for their views about how the water sector can be changed by a body set up by the UK government.\nThe head of a new independent commission will invite ideas on how to fix England and Wales' troubled water industry.\nSir Jon Cunliffe, a former deputy governor of the Bank of England, will launch his call for evidence in Manchester on Thursday morning.\nThere has been growing public anger about water company performance amid massive sewage leaks and soaring bills, and the commission is looking for views on reform.\nEnvironment Secretary Steve Reed has said the water sector in England and Wales \"urgently needs fixing\".\nReed has ruled out nationalisation, saying it would cost up to £100bn, and that waterways would continue to be polluted while private ownership structures were unpicked.\nInstead, the government wants private investment to upgrade the sewerage system and reservoirs.\nTo get that, regulator Ofwat has allowed the water industry to raise bills, which will go up by an average of £123 a year from April.\nThere were 3.6 million hours of sewage spills into England's lakes, rivers and seas by water companies in 2023, which is more than double the amount of the previous year.\nSir Jon said there were \"serious\" and \"interlocking concerns\" with the sector which need \"ambitious changes\", and acknowledged that \"trust in the system\" had \"broken down on all sides\".\nHe said there had been \"poor decisions and poor performance by companies, regulatory gaps, policy instability and a history of ad-hoc changes that have left an increasingly complex system that is no longer working well for anyone\".\nBut he said these problems were not the \"inevitable\" consequence of privatisation.\nThe government established the independent water commission promising the biggest shake up of the sector since privatisation 35 years ago.\nSir Jon is expected to recognise the widespread dissatisfaction at multiple failings and will seek submissions from regulators, investors, industry leaders and the public on potential reforms.\nHe will acknowledge the tensions between different regulators, the increasing demands place on the system by climate and population growth, and making the sector attractive to private investors.\nSir Jon told the BBC the commission's report would be \"as radical as we need to be to reset the system\".\nThe plight of Thames Water has been one of the most high-profile issues in the sector, with the company struggling with about £19bn of debt.\nIt recently won a crucial High Court battle to secure a £3bn rescue loan, staving off the prospect of the company coming under government control.\nSir Jon's review comes as six companies - including Thames - are appealing against decisions by Ofwat to limit bill increases over the next five years.\nThe commission's report, expected in June, will not affect that process.\nSir Jon said regulation of the water sector would be a \"key area\" that the commission will examine.\n\"Regulation needs to balance the cost to the bill payers with the needs of investment, not just to ensure that we've got supply of clean water for the future, but also investment to protect the environment.\n\"There is probably a bigger role for government, both at the national and at the local level, for giving guidelines for how those priorities should be managed,\" he added.\nTo try to make companies more accountable, the government has brought in a law which gives regulators the power to ban bonuses for water company bosses.\nIn addition, executives who fail to co-operate or obstruct investigators could face prison sentences of up to two years.", "url": "https://www.bbc.co.uk/news/articles/c4g097mpl79o"}