{"authors": ["Nadia Lincoln", "www.facebook.com"], "date_download": "2025-04-26 06:20:11", "date_modify": "2025-04-26 06:20:11", "date_publish": "2025-03-01 06:33:05", "description": "Plans are submitted to raze part of a derelict bus depot to make way for housing.", "filename": "news_articles_c1lpm459488o_1745648411.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c97a/live/3df514d0-f5f1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1lpm459488o_1745648411.html", "title": "Demolition plans for vacant Northampton bus depot submitted", "title_page": "Demolition plans for vacant Northampton bus depot submitted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans have been submitted for the demolition of part of a derelict bus depot to make way for housing.\nWest Northamptonshire Council received £1.368m from the government's Brownfield Land Release Fund (BLRF) to restore the St James Bus Depot, fronting the A4500 in Northampton.\nThe authority has now submitted a prior notification of its intention to raze the 1930s bus garage.\nBut the Grade II-listed Transport Office at the front of St James' Road will not form part of the demolition.\nAccording to the submission, the asbestos will be removed from the site, along with other fittings and fixtures in the tram shed.\nThe plans include the retention of the original tram facades, with \"tramshed terraces\" in between and new-build maisonettes and townhouses across the rest of the site.\nThe authority previously stated that up to 91 homes could be provided, as well as new public space.\nNow-defunct Northampton Borough Council sold St James Bus Depot in 2014 to a shoe firm which planned to move there, but West Northamptonshire Council bought it back nearly a decade later.\nAccording to planning documents, demolition work on the bus stop was expected to start as early as May, with a predicted completion date of 31 July.\nThe council will be able to seek a development partner for the housing scheme once remedial works have finished.", "url": "https://www.bbc.co.uk/news/articles/c1lpm459488o"}