{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:12", "date_modify": "2025-04-26 03:55:12", "date_publish": "2025-03-04 16:34:06", "description": "Christopher Paul O'Kane, 52, denies charges under the Terrorism Act linked to a PSNI data breach.", "filename": "news_articles_c4gedd7kmjko_1745639712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b91/live/2a78ba10-f911-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gedd7kmjko_1745639712.html", "title": "PSNI data breach: Christopher Paul O'Kane denies terrorism charges", "title_page": "PSNI data breach: Christopher Paul O'Kane denies terrorism charges - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Londonderry man has denied terrorism offences linked to a major data breach by the Police Service of Northern Ireland (PSNI).\nChristopher Paul O'Kane, 52, of Iniscarn Road in Derry, appeared at Belfast Crown Court on Tuesday to be arraigned on four charges under the Terrorism Act.\nHe pleaded not guilty to preparation of terrorism acts and possessing articles in the use of terrorism, namely two mobile phones, an encrypted USB device and a laptop. He also denied possessing two spreadsheets containing details of serving PSNI officers and staff.\nThe offences are alleged to have been committed on dates between 7 August 2023 and 19 August 2023.\nThe data breach happened in August 2023, when the PSNI released the names of thousands of staff and officers by mistake, under a Freedom of Information (FoI) request.\nThe list included the surname and first initial of every employee. It also included their rank or grade, where they are based and the unit in which they work.\nThe accused twice refused to stand during proceedings on Tuesday and Mr Justice Fowler told the court clerk to proceed with the arraignment as Mr O'Kane sat in the dock.\nA lawyer for Mr O'Kane asked the court for three weeks to lodge a defence statement.\nHe also told the judge there would be \"very significant early witness agreement in the case'' and that he would forward that to the prosecution in due course.\nHe said an independent expert is to be retained to examine two mobile phones which were allegedly found in Mr O'Kane's bedroom during a police search.\nNo date for the non-jury trial was set and Mr Justice Fowler said he would review the case in April.", "url": "https://www.bbc.co.uk/news/articles/c4gedd7kmjko"}