{"authors": ["David Spereall", "www.facebook.com"], "date_download": "2025-04-26 07:55:35", "date_modify": "2025-04-26 07:55:35", "date_publish": "2025-02-25 12:51:45", "description": "The authority's deputy leader says new measures are \"the right budget for difficult times\".", "filename": "news_articles_cj3ne0k6em0o_1745654135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5ad8/live/25d4fed0-f36f-11ef-add3-5160ab1f5b9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3ne0k6em0o_1745654135.html", "title": "Calderdale council tax bills to rise by 4.99%", "title_page": "Calderdale council tax bills to rise by 4.99%  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council tax bills for households in Calderdale are set to rise by nearly 5% after a new budget was agreed by the local authority.\nThe 4.99% increase - the maximum allowed without having to hold a referendum - will affect households from the beginning of April.\nAs part of the authority's efforts to save money, the price of garden and bulky waste collections will rise, while parking charges are also to increase sharply, with fees set to rise by 400% in Brighouse.\nSpeaking at a council budget meeting on Monday, Scott Patient, the Labour-run council's deputy leader, described the changes as a \"careful and prudent budget\".\nDuring the meeting, Patient referred to the 30 local authorities across the country which had received exceptional financial support from the government last week - with many of those councils facing bankruptcy without intervention.\nPatient told opposition parties that Calderdale's new budget was \"aimed at avoiding exactly that possibility\".\n\"It's a tough budget, we'll level with you on that. But it's the right budget for these difficult times,\" he said.\nCalderdale's council tax rise includes a 2.99% hike in base council tax bills and a 2% hike in the social care precept.\nOther changes agreed as part of the authority's budget included a cut in the number of social care assessments being carried out by the council, which the administration said was in recognition of the fact more would soon be carried out by the NHS.\nSteven Leigh, leader of the opposition Conservative group, labelled the increase in parking charges \"outrageous\", though he said there were elements of Labour's plans his party agreed with.\nConservative proposals, which included a smaller council tax rise of 3.5% and plans to make some council posts redundant as staff left of their own accord, were not passed during the budget meeting.\nLeigh said: \"Productivity at the council needs to improve. You can only do that by tackling the really hard decisions, looking the expenditure and seeing how you can save some money on it.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cj3ne0k6em0o"}