{"authors": ["Marie Indge", "Ben Marvell", "www.facebook.com"], "date_download": "2025-04-26 07:54:31", "date_modify": "2025-04-26 07:54:31", "date_publish": "2025-02-25 13:08:52", "description": "The 17-year-old tells BBC Radio Wiltshire about winning British Indoor Athletics Championships gold.", "filename": "news_articles_cgj56w7x0l7o_1745654071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0b81/live/ea325890-f29d-11ef-a3b6-f159204ba42b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj56w7x0l7o_1745654071.html", "title": "Teen wins 'crazy' high jump gold after call-up four days earlier", "title_page": "Teen wins 'crazy' high jump gold after call-up four days earlier - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 17-year-old high jumper who won gold at the British Indoor Athletics Championships in Birmingham on Sunday - having only been invited four days earlier - has described his victory as \"crazy\".\nOtis Poole from Chippenham, Wiltshire, smashed his previous personal best of 2.09m, recording a height of 2.20m to take the title.\nThe teenager, who competes for the Yate & District Athletic Club in Gloucestershire, won the England U20 title earlier in the year and is now ranked second in the world in the U20 category.\nHaving qualified for this summer's European U20 Championships in Finland, he is looking further ahead at potentially competing outdoors and gaining a college scholarship abroad.\nSpeaking to BBC Radio Wiltshire after winning gold, Otis said it had barely sunk in.\n\"It felt crazy, I didn't really process it because I was so tired but, after a long sleep, I've kind of processed it. I'm not really sure how I've done it.\n\"I've ticked off one of my goals for the season, so now it's time to look further.\"\nOtis only started competing in the discipline three years ago and has made rapid progress in the even.\n\"When I cleared 1.95m a year and a half ago, I saw myself in the top spot for my age group, but now I'm trying to compete against the whole country, all ages. It opens up this sort of much wider spectrum.\"\nThe 17-year-old currently trains under Joy Bray at the Yate club and is full of praise for her and the club's ethos.\n\"She's a very, very good coach. I'm also surrounded by good athletes in the group, and she personalises her training for each athlete.\n\"I think seeing their belief, and I think the other training partners, seeing them trying, it kind of pushes you to try and do better than them, but also do well as well.\"\nWith a career as a professional athlete looming, Otis is already considering his next steps.\n\"I think I need to sit with my coach and talk about where I want to go for outdoors.\n\"After A-Levels, I'm looking at going through the American scholarship route.\n\"I've jumped the heights that they'll want me at, and it will make everything very cheap. Because America is very big on their sports, it drives you to do better.\"", "url": "https://www.bbc.co.uk/news/articles/cgj56w7x0l7o"}