{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:52:02", "date_modify": "2025-04-26 03:52:02", "date_publish": "2025-03-05 11:17:16", "description": "A briefing for First Minister John Swinney raises the prospect of alcohol sales resuming for the first time since 1981.", "filename": "news_articles_cvgwnlyzzgeo_1745639522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a27c/live/faa36520-f9af-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwnlyzzgeo_1745639522.html", "title": "Pilot projects could lift alcohol ban at football", "title_page": "Pilot projects could lift alcohol ban at football - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pilot projects to allow the sale of alcohol at Scottish football matches would be considered by the Scottish government and Police Scotland.\nA briefing for First Minister John Swinney ahead of his attendance at a Scotland v Croatia game in November stated \"a limited number of pilot projects\" to gather evidence on the effect of selling alcohol to fans would be possible.\nAccording to the briefing \"Police Scotland are open to discussions on this\", although the Scottish government has \"no plans\" to review legislation yet.\nAlcohol has been banned in Scottish football since 1981 as a response to rioting at the previous year's Scottish Cup final.\nDocuments released through Freedom of Information, external revealed the topic was also discussed at an Enhancing Scottish Football round table event held in December last year.\nThe briefing for the first minister said Maree Todd, the minister for social care, mental wellbeing and sport, had discussed the topic with the SPFL and said the \"door was not closed on the issue\".\nHowever, it then added proposals would need to \"recognise the significant impact of alcohol on public health in Scotland\".\nThe report continued: \"It is, however, recognised that in many if not most cases it is possible to have alcohol at football stadia at present anyway, either in approved fan zones or hospitality suites.\n\"Extending this to concourses in a limited number of pilot projects would be the proposed course of action, with evidence gathered to understand the results and impacts.\n\"We understand from the SPFL that Police Scotland are open to discussions on this.\"\nBut the briefing stated that \"there are no plans at this time to remove the existing general restrictions on alcohol at football matches in Scotland.\"\nThe first minister told BBC Scotland News that he was \"not supportive\" of any changes to the legislation.\nHe said: \"I've not seen anything in the evidence that would suggest to me that we need to change our stance on this issue, but I acknowledge it's an issue that will be the subject of debate and consideration by a range of interested parties.\"\nThe ban on alcohol at football matches has regularly been raised in recent years, particularly ahead of the Euro 2020 tournament, where Hampden Park hosted four matches.\nOn 4 December the topic was raised by Calum Beattie, the chief operating officer of the SPFL, who suggested that as Police Scotland already categorise some matches as \"lower risk\" this could be used as a way to let alcohol be sold in the ground.\nHe added that it was \"counterproductive\" to treat all fans the same, even with \"legitimate concerns\" over a small number of supporters.\nComparisons with rugby - where fans are allowed to drink - were also raised and Todd agreed, saying big rugby fixtures at Murrayfield see much less of a rush to enter the stadium, as fans can drink inside rather than staying in nearby pubs until close to kick-off.", "url": "https://www.bbc.co.uk/news/articles/cvgwnlyzzgeo"}