{"authors": ["Graham Barnard", "Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:27:10", "date_modify": "2025-04-26 04:27:10", "date_publish": "2025-03-03 10:58:56", "description": "The Suffolk man's band attempt to represent Germany during this year's event.", "filename": "news_articles_cx2eqldgzkpo_1745641630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d45a/live/92d646a0-f816-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eqldgzkpo_1745641630.html", "title": "Suffolk musician loses out on performing at Eurovision 2025", "title_page": "Suffolk musician loses out on performing at Eurovision 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Suffolk musician who missed out on a chance to represent Germany at the Eurovision Song Contest has spoken of the \"amazing experience\" despite the loss.\nOllie Trevers and his band The Great Leslie, which has a German guitarist, had been taking part in the Chefsache ESC 2025 competition and made it to the final five at the weekend.\nThe winner would be chosen to perform as Germany's entry at this year's Eurovision, which is being held in Basel, Switzerland, in May.\nMr Trevers, who is from Framlingham, said despite the band not winning the public vote, he was proud of their efforts.\n\"It was an amazing experience,\" he told to BBC Radio Suffolk.\n\"We did so well and I'm really proud of the whole band. We were there for the entire month and we had a great time.\n\"We met some amazing people and I'm sure it's going to lead to bigger and better things.\"\nThe Great Leslie were initially part of 24 acts chosen to audition for Germany's Eurovision selection competition, having been picked from a pool of about 3,000 entrants.\nDuring the weekend's competition, they performed their song These Days, but ultimately lost out to Abor & Tynna with their song Baller, which received 34.9% of the votes during the event in Hürth.", "url": "https://www.bbc.co.uk/news/articles/cx2eqldgzkpo"}