{"authors": ["Owen Sennitt", "Laura Devlin", "www.facebook.com"], "date_download": "2025-04-26 06:51:08", "date_modify": "2025-04-26 06:51:08", "date_publish": "2025-02-28 17:52:03", "description": "A council says the home - due to be given to a prize winner this month - does not conform to plans.", "filename": "news_articles_cj3nnz0r4r3o_1745650268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74d6/live/da1e1a60-f541-11ef-ae0b-6f48bf49ce47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3nnz0r4r3o_1745650268.html", "title": "Omaze £6m mansion in Blakeney in planning law breach", "title_page": "Omaze £6m mansion in Blakeney in planning law breach - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A mansion worth at least £6m and offered as a prize in a raffle organised by Omaze breached planning rules, a council has said.\nOfficials at North Norfolk District Council said the Larkfields property in Blakeney, within an Area of Outstanding Natural Beauty, was not built to approved plans.\nCouncil officers will meet next week to decide what action to take, including whether it should force changes to the property.\nOmaze said the winner of the three-bedroomed house would not face any potential costs related to planning issues.\nEntries for the prize draw are now closed and the winner is expected to be announced live on BBC One on Red Nose Day on 21 March., external\nOmaze has said that \"a minimum £1m donation\" would be made to Comic Relief following the raffle, which was advertised heavily on TV and online.\nThe council began investigating the property after an anonymous member of the public raised concerns earlier this month, saying it had not been built to the approved designs.\nOmaze published photographs and floor plans of the home in its marketing material, which appear to be different to the designs approved by the council in 2020, according to the Local Democracy Reporting Service.\nThere are additional outbuildings, a tennis court and a swimming pool, which do not appear to have been subject to any planning application.\nAndrew Brown, the council's Liberal Democrat cabinet member for planning and enforcement, said: \"An investigation has been carried out internally and externally by the enforcement team.\n\"This has found breaches which are under consideration.\"\nBrown added: \"The next steps will be for the council's enforcement board to discuss the findings.\n\"They will look at the breaches to identify which are active and which are not.\"\nWhen contacted by the BBC, the council would not be drawn on the nature of the alleged breaches.\nIt confirmed it would contact the owner once it had concluded its investigation and decided what, if any, the next steps might be.\nSome of the planning irregularities may be immune from any enforcement action due to the so-called four-year rule, which means retrospective permission could be sought.\nBrown added: \"It is all about the timing of when the alterations were made.\"", "url": "https://www.bbc.co.uk/news/articles/cj3nnz0r4r3o"}