{"authors": ["Lewis Adams", "Leigh Milner", "www.facebook.com"], "date_download": "2025-04-26 07:07:36", "date_modify": "2025-04-26 07:07:36", "date_publish": "2025-02-28 06:03:15", "description": "Bethany Turner has to crawl around the family home due to her genetic disorder.", "filename": "news_articles_cqx0022590ro_1745651256.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d48/live/8edc9c50-f50c-11ef-a276-596f7e6218f8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx0022590ro_1745651256.html", "title": "Harlow mum of daughter with H-ABC is 'helpless' without treatment", "title_page": "Harlow mum of daughter with H-ABC is 'helpless' without treatment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The mother of a woman with a rare genetic disorder fears she is \"helpless\" in watching her daughter's condition decline without treatment.\nDebbie Crowson has been fighting for 24-year-old Bethany Turner, who has H-ABC, to keep living at the family home in Harlow, Essex.\nThere is no cure for the extremely rare condition, which affects the brain and causes mobility in patients to deteriorate.\nMs Crowson said her daughter could only crawl around the home and was \"very frustrated\" with life.\nOnly 200 people worldwide have ever been diagnosed with H-ABC, according to 2019 figures from Foundation to Fight H-ABC, external.\nDoctors misdiagnosed Ms Turner's condition until she was 17, when a physiotherapist raised concerns that her motor skills were worsening.\nThe impact of H-ABC left Ms Turner unable to eat or use a toilet without difficulty, and she must sleep at a dedicated centre away from home each night.\nMs Crowson has fought to keep her daughter living at home, despite saying that social workers suggested she should be \"put into an institution\".\nOn the diagnosis, she said: \"We felt helpless, I didn't know what would happen in the future because there was nothing known about it.\n\"We felt really lonely and I kept looking on Facebook to see if I could find any support groups.\"\nMs Crowson said her daughter was \"very frustrated\" at being unable to do simple tasks for herself.\n\"She crawls around, but even the crawling now has got to the point where she just shuffles and she gets frustrated with that,\" she said.\nThe family have been hoping for a treatment that would slow the progress of H-ABC in patients.\nMs Crowson added: \"I'm not thinking it'll make her better, but it might just stop her from getting worse.\"\nSynaptixBio was one of the biotech companies developing a treatment for H-ABC, using a technique called \"gene silencing\".\nDr Dan Williams, its chief executive, told the BBC: \"Eighty percent of rare diseases are genetic and a large proportion of those are either due to the gene being toxic or there's too much of that gene being expressed.\n\"Gene silencing offers a way to decrease the amount being expressed or decrease the amount of toxic genes that are there, thus alleviating the symptoms for patients with those diseases.\"\nThe Department of Health and Social Care said it was aware that those living with rare diseases and their families faced \"immense everyday challenges\".\n\"Through our Rare Diseases Action Plan we aim to centre their voices to address the difficulties they face,\" a spokesperson said.\n\"We have committed to three new actions to improve co-ordination of care, access to specialised treatments and bolster research into innovative therapies for these rare conditions.\n\"More widely, our Plan for Change will transform the NHS by driving down waiting lists and investing in quality facilities to ensure all patients – including those with rare diseases - receive the care and treatment they deserve.\"", "url": "https://www.bbc.co.uk/news/articles/cqx0022590ro"}