{"authors": ["Carmelo Garcia", "www.facebook.com"], "date_download": "2025-04-26 03:45:34", "date_modify": "2025-04-26 03:45:34", "date_publish": "2025-03-05 06:17:38", "description": "The gates will help enforce a no-traffic rule on the street which is popular for its nightlife.", "filename": "news_articles_cx2949pdg6no_1745639134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cacb/live/e9b02e10-f9e1-11ef-aa92-5f009e8149ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2949pdg6no_1745639134.html", "title": "Crests stolen from new Gloucester's Eastgate Street gates", "title_page": "Crests stolen from new Gloucester's Eastgate Street gates - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The crest has already been stolen from gates newly installed on a city centre street popular for its nightlife.\nThe black bi-folding gates on Eastgate Street in Gloucester replaced the aging bollards that shut the sheet to traffic on Friday and Saturday nights and bank holidays.\nBusinessman Justin Hudson, who helped fundraise for the gates, said they were \"tens of thousands of pounds cheaper\" than drilling bollards into the road.\nBut one is already in need of repair after a plaque bearing Gloucester City Council's coat of arms was taken as \"a trophy\".\nMr Hudson is the owner of Butlers Bar on Eastgate Street.\nButlers staff took over the responsibility of the opening and closing of the road each weekend more than six years ago.\nMr Hudson, a former Gloucester City Council cabinet member, said local businesses had been working with the city council to make the installation of the gates a reality.\n\"Knowing the bollards in the road were coming to the end of their commercial life, we have as a collective, been 'bidding' for and working together to create a pot of money to replace those ageing bollards,\" he told the Local Democracy Reporting Service.\n\"And let's be honest, Gloucester as a city is famous for its gates\".\nBut he said that workmen installing the gates had run out of rivets by the time they reached the coat of arms adorning each gate and had glued them on instead.\n\"It was extremely cold so the glue might not have set properly so someone has got (the crest) as a trophy already - but we are getting it replaced,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cx2949pdg6no"}