{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:03:31", "date_modify": "2025-04-26 04:03:31", "date_publish": "2025-03-03 20:23:55", "description": "Suspected cannabis, cocaine and ketamine is seized found after searches of premises in Mallusk earlier.", "filename": "news_articles_c78e70gv83vo_1745640211.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c663/live/303e0be0-f866-11ef-b178-ef4d5e65c5ca.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78e70gv83vo_1745640211.html", "title": "Mallusk: Police seize £6.5m worth of drugs in food packaging", "title_page": "Mallusk: Police seize £6.5m worth of drugs in food packaging - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been arrested after a cross-border policing operation seized an estimated £6.5m (€7.8m) of suspected drugs in County Antrim.\nPolice discovered suspected cannabis, cocaine and ketamine in food packaging after searching a premises in Mallusk near Newtownabbey on Monday morning.\nThe seizure comes after a Joint Agency Task Force operation between the Police Service of Northern Ireland (PSNI) and Garda Síochána (Irish police force).\nA 28-year-old man was arrested at the scene on suspicion of supplying Class A and Class B controlled drugs.\nPSNI Det Insp Conor Sweeney said it is believed the drugs were to be supplied to various markets across the UK.\n\"It is not difficult to imagine the harm that would have been caused by this volume of drugs being dealt on street corners within our communities to vulnerable people, children and those with addictions issues,\" he said.\n\"Nor is it difficult to imagine the mayhem that the organised criminals behind this would have wreaked with the millions of pounds of profit they potentially stood to make.\nDet Insp Sweeney said he is \"delighted\" the seizure will mean the drugs are removed from circulation and those responsible will be denied an income stream.\n\"However, we recognise there is still much work to be done to tackle such serious and organised criminality.\"", "url": "https://www.bbc.co.uk/news/articles/c78e70gv83vo"}