{"authors": ["Katy Prickett", "www.facebook.com"], "date_download": "2025-04-26 06:13:17", "date_modify": "2025-04-26 06:13:17", "date_publish": "2025-03-02 06:16:27", "description": "IWM at Duxford appeals for memories and photographs \"to preserve this history before it's lost\".", "filename": "news_articles_c0kgv184jljo_1745647997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50dc/live/c0d0c990-f370-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kgv184jljo_1745647997.html", "title": "Duxford museum project reveals 'forgotten' WW2 US Red Cross women", "title_page": "Duxford museum project reveals 'forgotten' WW2 US Red Cross women - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Research into the lives of American Red Cross servicewomen in Britain during World War Two is already uncovering \"largely forgotten\" stories within weeks of starting.\nThousands of women came to the UK to run clubs for the US forces, yet \"we really hadn't delved into their lives and personal stories,\" said historian Hattie Hearn.\nThe Imperial War Museum project began in January with the names of 100 women and has added more than 400 to that list so far.\nDr Hearn, from the museum at Duxford, Cambridgeshire, hopes families will contribute memories, photographs and memorabilia, external \"to preserve this history before it's lost\".\n\"Their stories have largely been forgotten, so the aim is to bring them to life, to learn more about these women and the impact they had, not only on the morale of the Americans based here, but also on the local British people who came in contact with them,\" she added.\n\"We particularly hadn't done any research around the lives of the black American women who served with the American Red Cross.\"\nThe American Red Cross was a civilian organisation set up in the 19th Century which became involved in supporting the welfare of service personnel.\nDuring World War One, it was sent to the UK to set up service clubs for US forces and performed the same role during World War Two.\nEast Anglia, with its airfields, was a particular hub, with clubs at Norwich, Ipswich and Sudbury in Suffolk, as well as smaller towns like Royston, Hertfordshire.\nDr Hearn, who is the curator of the American Air Museum, said: \"Hundreds of thousands of Americans poured into the region to fly from these airfields - at its peak 500,000 Americans were serving here - and the American Red Cross expanded at an equally fast rate.\"\nUS society was divided by racial segregation - black people were denied equal rights under the \"Jim Crow\" laws, external, which remained in place in the southern states until the 1960s.\nWhile the organisation did not have an official policy of segregation, unlike the US forces, in practice \"only black Americans went to black clubs\", said Dr Hearn.\n\"The American Red Cross employed British women, including Elizabeth Berwick, whose parents were from the Caribbean,\" she said, about one of the first stories unearthed by the project's four volunteers.\n\"Her marriage to York Batley, a supply sergeant from a segregated Engineer Aviation Battalion, external, made the news in the US and she is believed to be the first British woman to marry a black American in the UK.\"\nAmerican military policy was to uphold segregation and forbid the marriages of black Americans and white British women - but as Elizabeth Berwick was black, \"that made the marriage more acceptable\".\nAnother rediscovered story was that of Hazel Dixon Payne, who was studying for her PhD when she became an early recruit to the American Red Cross.\nShe was the first black woman to travel to Alaska with the organisation, where the Army Corps of Engineers was sent to build the Alcan Highway in 1942, external, said Dr Hearn.\nOn arrival in London in July 1944, she became a field director, but died on 11 October after minor surgery, \"becoming the first black American Red Cross volunteer to die in overseas service\".\n\"She was buried in England with full military honours, there was an outpouring of grief at the time and Lady Nancy Astor [the American-born first woman MP], external even sent a letter of commendation to Hazel's mother,\" said Dr Hearn.\nMrs Dixon Payne's name will now be added to the museum's roll of honour.\nClarice Brooks was the crew captain, alongside Pericles McDuffie and Camille Jones.\nMiss Jones later became the director of a club in Basingstoke, Hampshire, but resigned from the organisation after she witnessed a black American soldier being attacked by three white Americans while escorting a British woman home.\n\"The victim, Lt Jeffers, was charged with assault - Camille said, 'I see us fighting fascists but not fascist principles, for in our midst we continue to harbour doctrines of racial supremacy which belie the cause for which we are fighting',\" said Dr Hearn.\nShe added that the stories revealed so far were \"just the tip of the iceberg\" in a project expected to last into next year. It hopes to attract more volunteers, including from the United States.", "url": "https://www.bbc.co.uk/news/articles/c0kgv184jljo"}