{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:52", "date_modify": "2025-04-26 04:02:52", "date_publish": "2025-03-03 22:19:14", "description": "The first lady said it was \"heartbreaking\" that young teens were subjected to malicious online content.", "filename": "news_articles_c8d41zv4ng2o_1745640172.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e5a9/live/4d2ea9d0-f884-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d41zv4ng2o_1745640172.html", "title": "Melania Trump urges lawmakers to sign bill combatting revenge-porn", "title_page": "Melania Trump urges lawmakers to sign bill combatting revenge-porn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Melania Trump was on Capitol Hill Monday to urge lawmakers to vote for a bill with bipartisan support that would make so-called \"revenge-porn\" a federal crime.\nThe Take It Down bill would make it a crime to post \"intimate images\" - real or AI-generated - online without an individual's consent and would require technology companies to remove the content within 48 hours.\n\"It's heartbreaking to witness young teens, especially girls, grappling with the overwhelming challenges posed by malicious online content, like deepfakes,\" the first lady said, in her first public solo appearance of the new administration.\nThe bill already has passed the Senate with bipartisan support, but still needs to pass the House of Representatives.\n\"In an era where digital interaction are integral to daily life, it is imperative that we safeguard children from mean-spirited and hurtful online behaviour,\" Trump said during a roundtable on Monday.\nThe Senate version of the Take It Down bill was sponsored by Republican Ted Cruz of Texas and Democrat Amy Klobuchar of Minnesota.\nHouse Energy and Commerce Chair Brett Guthrie has said his panel would schedule a hearing on the bill in the next few weeks, according to Politico.\nThe first lady focused on online initiatives during her husband's first term, when she launched the \"Be Best\" campaign to promote child well-being and online safety.\nThe Take It Down bill appears to be a part of Trump's efforts to continue the Be Best campaign.\nThe first lady has made few public appearances since her husband took over the White House on 20 January. She was rarely on the campaign trail during his run last year.\nShe is expected to attend the president's joint session before Congress on Tuesday.", "url": "https://www.bbc.co.uk/news/articles/c8d41zv4ng2o"}