{"authors": ["Jessica Moriarty", "www.facebook.com"], "date_download": "2025-04-26 06:45:38", "date_modify": "2025-04-26 06:45:38", "date_publish": "2025-03-01 15:07:25", "description": "The public art installation aims to encourage visitors to explore the site's natural landmarks.", "filename": "news_articles_ce30qwl96r6o_1745649938.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d633/live/8d025cf0-f69f-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce30qwl96r6o_1745649938.html", "title": "'Celestial alignment' sculptures to be installed", "title_page": "'Celestial alignment' sculptures to be installed in Warminster - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Huge sculptures which \"echo the celestial alignments\" of the night sky will be installed as part of a development of up to 1,000 new homes.\nDeveloper Persimmon Homes was obliged to present a project for a public art installation as part of the West Warminster Urban Extension (WWUE) scheme in Wiltshire.\nWiltshire Council has granted planning permission for the two huge leaf sculptures to be placed on either side of the site, reports the Local Democracy Reporting Service.\nOne will be rendered in knapped flint to pay homage to the flintstone embedded across the local landscape and the nearby Cley Hill landmark.\nUnder proposals for urban extension on the western outskirts of the town, 1,000 new homes, schools, and children's play areas will also be built.\nThe first installation, to be located near the Victoria Road Junction, will be a four- metre (13ft) tall stone megalith carved in the shape of an oak leaf with two round eye holes.\nAccording to artist Simon Periton, it will be positioned so that Cley Hill and potentially the setting of Procyon - the eighth-brightest star - will be visible through the holes.\nProcyon lies 11.4 light-years from Earth, and appears in the night sky as a bright yellow-white subgiant.", "url": "https://www.bbc.co.uk/news/articles/ce30qwl96r6o"}