{"authors": ["Sophie Cridland", "www.facebook.com"], "date_download": "2025-04-26 03:59:02", "date_modify": "2025-04-26 03:59:02", "date_publish": "2025-03-04 06:15:10", "description": "A Reform UK voter speaks to the BBC about why he joined last year's anti-immigration protests.", "filename": "news_articles_ckg1710zy22o_1745639942.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/38f6/live/84927ea0-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg1710zy22o_1745639942.html", "title": "Dorset Reform UK voter: 'Immigration has to be controlled'", "title_page": "Dorset Reform UK voter: 'Immigration has to be controlled' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Streets of empty shops, homelessness and crime rates are just some of the things casting a shadow over the seaside town of Bournemouth.\nKnown as a holidaymaker's haven, the Dorset town last year also became the venue of a number of anti-immigration demonstrations and counter protests.\nBuilder Paul Haigh is one of the people who took part in the anti-immigration protests, as he believes illegal immigration is causing a strain on the NHS, schools and housing.\nAs part of the BBC's immigration week, we have been seeking a variety of views from people on the issue.\n\"Wanting controlled immigration does not make me a racist,\" Mr Haigh said.\n\"A lot of people say controlled immigration is good for the country, it is, and in all honesty I don't care if you are black, white, pink or whatever, it's all the same to me.\n\"But immigration has to be controlled like anything has got to be controlled.\"\nIn August, Mr Haigh joined 200 protesters from anti-immigration group Taking Back Our Country outside Bournemouth's town hall.\nMr Haigh feels the protests were driven by feelings of frustration due to the protestors' concerns about immigration not being listened to.\nHe said: \"I think nobody is listening to us and when you are not heard it evolves in to anger.\n\"They feel that taxpayers' money is being squandered and the standard of life isn't fantastic for people.\n\"Again, I agree social security should be there for people who need it and a workable benefit but if it's all being squandered, how is that good for the country? All the services have now got to suffer.\"\nThe demonstration was one of the many in towns and cities across the country in 2024.\nAbout 250 people from counter groups, such as Stand Up To Racism, also attended.\nFor Mr Haigh attending the protests wasn't about being far-right, but \"about justice and fairness\".\nHe said: \"If we have the best of everything and we can afford to be a bit more charitable then great but we can't, so we really need people to contribute to the wealth of the country which helps people who genuinely need our help.\"\nOne of the reasons he went was because he wanted to change the English immigration system to a points-based system like in Australia.\n\"You can't really call the whole of Australia racist,\" he said.\nThe Pacific country grants work visas by allocation points based on age, skills and qualifications, along with checking criminal records, external.\nFor the UK, a passport or identity document, external is needed to enter the country legally, as well as a visa in many cases. EU citizens must have settled or pre-settled status.\nIf they have neither of these, the migrant has entered the UK illegally and they face being arrested by Immigration Enforcement.\nOnce registered with the government, it is then possible to seek asylum.\nAbout 95% of illegal migrants applied for asylum in 2024. While applications are being assessed, they are able to apply for benefits, external like housing or cash support.\nMr Haigh feels it is not fair for the British taxpayer to foot the government's bill for illegal immigration.\nHe said: \"I do feel that they come to England for the benefits - people say they are fleeing war torn countries, well France isn't a war-torn country but they get on the boats in France and come over here.\"\n\"Why do I have to pay in to something for many, many years and then someone comes along and doesn't contribute to the country and then gets full benefits?\"\nAccording to the Home Office, anyone who has started the asylum process can claim £49 a week and somewhere to live but they cannot choose the type of accomodation.\nFor comparison, British citizens who out of work are entitled to £90 a week, or £71 if they are under 25.\nMr Haigh decided to vote for Reform UK in 2024's general election, having previously voted Conservative.\nThe party has seen a rise in the number of voters since it was set up as a limited company called The Brexit Party in November 2018.\nIn the 2024 general election they won almost 17% of the vote in Bournemouth West. In the previous election in 2019, no candidate stood there.\nThe party's main core pledge is to stop uncontrolled immigration which it claims will boost wages, protect public services, end the housing crisis and cut crime.", "url": "https://www.bbc.co.uk/news/articles/ckg1710zy22o"}