{"authors": ["Natalie Sherman", "www.facebook.com"], "date_download": "2025-04-26 07:46:52", "date_modify": "2025-04-26 07:46:52", "date_publish": "2025-02-27 00:09:57", "description": "Boss Jensen Huang responds to concerns about an AI bubble sparked by Chinese firm DeepSeek.", "filename": "news_articles_c17qqgwdk78o_1745653612.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d05a/live/11f09630-f49c-11ef-b032-dfb1ee74e0d2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qqgwdk78o_1745653612.html", "title": "Nvidia says AI chip sales strong despite DeepSeek fears", "title_page": "Nvidia says AI chip sales strong despite DeepSeek fears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nvidia, the chip giant at the heart of the artificial intelligence (AI) boom, said its business remained strong, despite fears of a bubble stirred by the emergence of Chinese AI firm DeepSeek last month.\nSales of the firm's chips hit more than $39bn (£30.7bn) over the three months ended 27 January, up 74% year-on-year.\nNvidia has seen a surge of demand, as big tech companies turn to the firm for chips that can handle the large amounts of data used to train AI models.\nBut DeepSeek said it had trained its chatbot using less advanced, and less expensive chips.\nIts launch prompted a sharp sell-off in Nvidia shares earlier this month, a hit felt throughout the market.\nInvestors calmed after big companies such as Facebook owner Meta said they expected to continue their current AI investment strategies.\nNvidia boss Jensen Huang said he was not worried that demand would suddenly shift, saying that software in the future would be created by machine learning that needs chips with different architecture than the \"hand-coding\" of the past.\n\"We know fundamentally software has changed,\" he said, adding that it was also still \"early days\" for the use of AI to spread.\nNvidia currently dominates the market in advanced chips, making it central to the boom in AI investment at companies such as Microsoft.\nIts shares have surged more than 400% over the last two years, giving the company a market value of more than $3tn.\nNvidia said it was focused on rapidly building out production of its latest chips, known as Blackwell, which helped to drive a surge in the firm's revenue.\nThe company's finance chief Collette Kress said its AI data centre business was strongest in the US, but the firm was also seeing demand grow in other parts of the world, pointing to investments by France and the European Union.\nShe said demand in China - where US trade controls have blocked the firm from exporting certain chips - remained lower and that the firm expected shipments to remain roughly at the current level.", "url": "https://www.bbc.co.uk/news/articles/c17qqgwdk78o"}