{"authors": ["Ammar Ebrahim", "www.facebook.com"], "date_download": "2025-04-26 08:09:51", "date_modify": "2025-04-26 08:09:51", "date_publish": "2025-02-26 12:48:20", "description": "A consumers group says prices would rise in the short-term but decrease in the long-term.", "filename": "news_articles_cddy9ln4nn1o_1745654991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/61d7/live/bd81c8c0-f438-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy9ln4nn1o_1745654991.html", "title": "Freight flat rate 'could help Jersey's consumers'", "title_page": "Freight flat rate 'could help Jersey's consumers' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new flat rate of freight into Jersey could help consumers with costs in the long-term, the head of a group representing consumers says.\nJersey's government requested that new ferry provider DFDS introduced a flat rate of freight, meaning every freight provider pays the same per meter of space they take up on a ship for goods they bring in.\nThe flat rate will come in when DFDS takes over ferry services at the end of March.\nCarl Walker, from the Jersey Consumer Council, said while prices would go up in the short-term, in the long-term they could come down.\nCurrent ferry operator Condor will run ferry services until the end of March and, under it, bigger shipping companies had been able to negotiate better rates because of the amount of business they brought in.\nMr Walker said: \"A flat rate means every freight provider will now pay the same per meter of space they take up on the boat for the goods they bring in.\n\"Until now, the more you brought in, the better deal you could strike with Condor.\n\"DFDS have been told they must charge the same for everybody - big or small.\n\"For too long there has been a cloud of mystery of how much things cost to bring in and, finally, now we can see that and there will be a complete level playing field.\"\nMr Walker said there would be an impact on the cost of food.\nHe said: \"In the long-term, things would become cheaper.\n\"But, initially, we are expecting a price rise; the government are predicting a 0.4% increase in price rises.\n\"Some retailers have said to me privately they think it might be more. It all depends on how much... freight providers pass on.\"", "url": "https://www.bbc.co.uk/news/articles/cddy9ln4nn1o"}