{"authors": ["Tom Oakley", "www.facebook.com"], "date_download": "2025-04-26 07:28:06", "date_modify": "2025-04-26 07:28:06", "date_publish": "2025-02-27 19:33:42", "description": "Sophie Goode's family say she was a \"happy, beautiful and talented girl\".", "filename": "news_articles_ckgdd4gg9qeo_1745652486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9979/live/7a0801d0-f53d-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgdd4gg9qeo_1745652486.html", "title": "Tribute to Nottingham student who died in e-bike incident", "title_page": "Tribute to Nottingham student who died in e-bike incident - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of an 18-year-old student who died in a road traffic incident have paid tribute to the \"happy, beautiful and talented girl\".\nSophie Goode, who had been riding an electric bicycle, was fatally injured while on the University of Nottingham's Park Campus in the early hours of Tuesday.\nThe sport and exercise science student was taken to hospital but pronounced dead a short time later.\nNottinghamshire Police said an investigation into her death was continuing.\nA statement issued on behalf of the family read: \"Sophie was a happy, beautiful and talented girl who was loved by everyone who knew her.\n\"When she wasn't singing or dancing, she was planning which live music concerts to go to with her younger sister.\n\"She really was the life and soul everywhere she went.\n\"She just loved life, loved people and was surrounded by her soulmates at university, where she had quickly established herself as part of the Nottingham women's cricket family.\n\"She was determined to do whatever her mind was set on and was taken from us too soon.\"\nEarlier this week, a University of Nottingham spokesperson said it was a \"deeply upsetting time\", and added: \"We will continue to provide support to our community as we process the weight of this loss.\"", "url": "https://www.bbc.co.uk/news/articles/ckgdd4gg9qeo"}