{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 03:39:36", "date_modify": "2025-04-26 03:39:36", "date_publish": "2025-03-04 20:07:45", "description": "The Metrolink worker was accused of the manslaughter of a young father who died after being restrained.", "filename": "news_articles_cn8966w96yxo_1745638776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7dda/live/7750abe0-f920-11ef-8893-abdeb609a7eb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8966w96yxo_1745638776.html", "title": "Tram worker will not face retrial over man's death", "title_page": "Tram worker will not face retrial over man's death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A tram worker accused of the manslaughter of a young father who died after being restrained in Manchester will not face a retrial after a jury failed to reach a verdict.\nJack Barnes, 29, suffered a cardiac arrest after being held down for about 90 seconds on 11 October 2016 and died in hospital just under two months later.\nThree men had already been found not guilty of manslaughter but there were no verdicts returned for Metrolink security contractor Stephen Rowlands, 67, after a four-week trial in Liverpool Crown Court.\nMr Barnes' mother Patricia Gerrard said she was \"devastated\" and felt \"empty\" after the Crown Prosecution Service (CPS) told her of its decision.\nThe CPS said in light of the verdicts against the other three Metrolink contractors it did not believe there was a realistic prospect of conviction against former police officer Mr Rowlands.\nIts lawyers had twice declined to bring charges against any of the men until an inquest into Mr Barnes' death in February 2021 ended with a conclusion of unlawful killing.\nThe court heard Mr Barnes, originally from Hull, East Yorkshire, had recently moved to Manchester and was on a day out with friends riding the city's Metrolink tram network.\nHe had become embroiled in a row with a group of customer service representatives deployed to monitor anti-social behaviour on the network, who accused the group of smoking illegal drugs.\nThe row ended with Mr Barnes swinging a draw-string bag towards the group before fleeing with another man.", "url": "https://www.bbc.co.uk/news/articles/cn8966w96yxo"}