{"authors": ["Gurdip Thandi", "www.facebook.com"], "date_download": "2025-04-26 04:23:56", "date_modify": "2025-04-26 04:23:56", "date_publish": "2025-03-03 12:53:06", "description": "YouthPath has been set up by charity Movement to Work and the West Midlands Combined Authority.", "filename": "news_articles_cy87d1l8g82o_1745641436.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/00aa/live/15dd1520-f82a-11ef-92bb-03e8a8ae1fee.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy87d1l8g82o_1745641436.html", "title": "Project aims to combat youth unemployment", "title_page": "Project aims to combat youth unemployment in the West Midlands - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A project to help tackle the high level of youth unemployment in the West Midlands has been launched.\nYouthPath has been set up by charity Movement to Work and the West Midlands Combined Authority (WMCA) to help create career opportunities for young people not in education, employment or training (NEET).\nFigures show more than 987,000 young people in the UK are classed as NEET, with Birmingham, Wolverhampton and Walsall having rates double the national average.\nWest Midlands Mayor Richard Parker said he wanted to create 20,000 training, work experience and apprenticeship placements in the next few years.\n\"I left school at 16 and went straight into work but was lucky enough to get the support and encouragement I needed to start out on a new career path,\" Mr Parker, said at the launch event in Birmingham on Wednesday.\n\"I want every young person to have the same opportunity I had so they can get ahead in life.\"\nHe added: \"We've already created 5,000 [placements] but there is still more to do and I'm calling on employers to work with me to help drive down youth unemployment.\"\nDuring October to December 2024, an estimated 14.4% of all male 16 to 24-year-olds were NEET, with 12.3% of all females in the same age group, the latest Office for National Statistics (ONS) figures showed.\nSareena Bains, chief executive of Movement to Work, said she hoped the project opened doors and helped businesses become \"more inclusive and fit for the future\".\n\"We have over 10 years of experience in supporting businesses with their youth employment strategies – and as a charity, we do it all free of charge,\" she said.\n\"By joining YouthPath, West Midlands business leaders can help shape a brighter future for our region's young people.\"\nKatie Stansbie, who was in the NEET category before building a career with retailer M&S, said: \"I'm so grateful to have completed the Marks and Start programme, it has given me full time employment, financial independence and a new sense of purpose and self-confidence.\"\nEngagement sessions will take place over the coming weeks, with businesses and organisations invited to pledge support to the scheme.", "url": "https://www.bbc.co.uk/news/articles/cy87d1l8g82o"}