{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:07:27", "date_modify": "2025-04-26 07:07:27", "date_publish": "2025-02-28 06:05:53", "description": "People living in red tents at St Peter's Square have relocated to another area of Manchester.", "filename": "news_articles_cy833kyddezo_1745651247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/691d/live/e6372130-f531-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy833kyddezo_1745651247.html", "title": "Greater Manchester Mayor Andy Burnham urges homeless camp 'work with us'", "title_page": "Greater Manchester Mayor Andy Burnham urges homeless camp 'work with us' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People living in tents in a city centre have been urged by the region's mayor to accept the council's help, after the camp was ordered to move but has since reappeared nearby.\nManchester City Council secured a \"possession order\" against those living in red tents in St Peter's Square next to the town hall, effectively evicting them.\nOccupants were handed plastic bags and told to leave the area on Wednesday morning but some have just set up their tents again on nearby Mosley Street.\nThe authority said temporary accommodation had been offered to \"everyone who we owed a statutory duty\" and Greater Manchester Mayor Andy Burnham agreed there was \"not a need for people to just stay there\".\nThe \"red tent camp\" sprang up last spring, initially as a protest, but soon morphed into a long-term spot for homeless people to stay.\nBut Burnham told BBC Radio Manchester that \"it's not the right place for the people to be in a situation like that\".\n\"I just think this is not good for the people in the tents, it's not good for the city.\"\nHe said he supported the council's actions, adding: \"Many of the people in the tents are being offered homes and everyone's being offered support.\"\n\"There's not a need for people to just stay there, there's an offer of help.\"\nA legal challenge from the Greater Manchester Law Centre to stop the council's bid to take possession of the land failed earlier this month.\nThe law centre formally represented one asylum seeker, who saw the council's claim against him withdrawn, but the case also involved dozens more of unrepresented refugees.\nOne of them told the court they had no choice and they were \"going through hell\".\nBut the judge ruled the tents must be removed.\nThe council previously said there had been issues keeping the area, along a set of archways near Manchester Town Hall, \"safe, secure and clean\".\nBurnham said the council had not been \"callous\" in its decision making.\n\"That's the way we work,\" he said.\n\"While it's difficult it's been done carefully, it's been done fairly.\"\nThe council said those who were \"vulnerable and in priority need\" were offered temporary homes, while others were offered advice and support.\nBurnham urged anyone living in the relocated camp to take that help.", "url": "https://www.bbc.co.uk/news/articles/cy833kyddezo"}