{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:31:02", "date_modify": "2025-04-26 04:31:02", "date_publish": "2025-03-03 06:14:46", "description": "The facility is due to open in 2027 and be run by the Guernsey Institute, an education leader says.", "filename": "news_articles_c3rnpw913j8o_1745641862.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e4ad/live/5d7e6840-f77e-11ef-b744-2fe4be9f666c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnpw913j8o_1745641862.html", "title": "Les Ozouets: Work on new post-16 campus in Guernsey to begin soon", "title_page": "Les Ozouets: Work on new post-16 campus in Guernsey to begin soon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Construction work is set to \"begin imminently\" on Guernsey's new post-16 campus, the government has said.\nDemolition work on Les Ozouets campus in St Peter Port began last year, and is part of a programme agreed by the States to redevelop the site.\nRok Limited has been appointed as the lead construction contractor for the project after a tender process in the summer of 2024.\nStates Director of Education Nick Hynes said he would be \"sharing regular updates with the community so that they can see our exciting journey\".\nHe added it was set to open in 2027 and would be run by the Guernsey Institute.\nDeputy Andrea Dudley-Owen, President of the Committee for Education, Sport & Culture, said: \"Finally, we're getting under way with delivering fit-for-purpose, modern facilities.\n\"For too long some of our young students, particularly those in vocational and technical education, have been taught in facilities that are well past their best.\"\nLes Ozouets was home to St Peter Port School until it shut it 2009 after about 40 years of being open.\nIt was then used by the College of Further Education from 2011 to 2022.", "url": "https://www.bbc.co.uk/news/articles/c3rnpw913j8o"}