{"authors": ["Yalda Hakim", "www.facebook.com"], "date_download": "2025-05-19 14:23:26", "date_modify": "2025-05-19 14:23:26", "date_publish": "2015-03-13 11:45:27", "description": "For the first time in nearly a decade, the BBC has been allowed to film inside Eritrea, one of the world's most secretive states but which has made progress in healthcare, as Yalda Hakim reports.", "filename": "news_world-africa-31851587_1747664606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81624000/jpg/_81624281_81624280.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31851587_1747664606.html", "title": "Inside the secretive state of Eritrea", "title_page": "Inside the secretive state of Eritrea - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eritrea is considered one of the most repressive and secretive states on earth. The UN says forced labour and detention without trial are common.\nThere have been no elections in the country since independence in 1993 and President Isaias Afewerki has been in power for almost 22 years.\nPolitical opponents and journalists have been imprisoned for voicing dissent.\nBBC News hasn't been allowed to film in the country for around a decade. But now, my team and I have been allowed in to look at improvements in Eritrea's healthcare.\nIt may be one of the poorest countries on earth but the nation of roughly six million people is on track to meet three of its Millennium Development Goals, external - targets set by the United Nations in 2000 to tackle poverty.\nUnder-five mortality has dropped by two-thirds, deaths in childbirth have decreased to a quarter of what they were 30 years ago and levels of HIV/Aids and malaria have plummeted.\nGetting into Eritrea wasn't easy. It took months of negotiation with the central government. After a 10-hour flight, via Turkey and Saudi Arabia, we arrived in the capital, Asmara at 04:00 bleary-eyed.\nA government official was there to meet us and cheerfully told us to be ready in four hours because they had prepared a busy schedule for us.\nIt is difficult to ignore the beauty of Eritrea's capital city, with its leafy boulevards and Modernist buildings, a reminder of its Italian colonial past. But beneath the elegance, lies something more sinister.\nEritrea is still recovering from 30 years of war with its far larger southern neighbour, Ethiopia. The fighting ended in 1991 and it became an independent nation two years later.\nBut that peace didn't last and, after another war, the two countries are in a state of \"no war, no peace\". There is a strong sense that the struggle needs to continue and all Eritreans need to do what it takes not only to protect their country but also to rebuild it.\nAccompanying us on our journey was a government minder. He was with us everywhere we went, listening and taking notes during all our interviews. About a half-hour drive outside the capital is the Embaderho health clinic.\nSocial workers from here go into villages and people's homes to train and advise pregnant women and new mothers on what's best for them and their babies' health.\nOur minder watched over us as one health worker told me: \"Mothers were dying from unsafe delivery helped by local neighbours but now mothers are giving birth in hospitals.\n\"Because of the raised awareness, children have started to receive vaccinations on time and that is saving them from dying of chickenpox and other diseases. Really, we have seen a big change.\"\nYemane Ghebreab, friend and political adviser to the president, says it is all about priorities, telling me that \"as a small country with limited resources, we can only thrive and compete if we can build our human resources\".\nThough the UN has criticised Eritrea's human rights record, it has commended its health achievements.\nChristine Umutoni, the Eritrean representative for the UN Development Programme, says the lack of corruption around healthcare has helped the country reach its development targets.\n\"We've seen value for money and accountability. You know, you invest a little and you get a lot,\" she says.\nWe were taken to hospitals where we were introduced to women needing surgery who, we were told, were allowed to stay for as long as they needed - weeks or even months - at no cost.\n\"To defend ourselves, we have to depend on our people. That means young people have been compelled to be in national service for longer periods of time and it's difficult for them.\"\nMr Yemane told us the government wants to end indefinite service, but he seemed less sure about giving his people democracy.\nWhen asked when the country might have elections, he replied: \"When the time comes we will do it, but this fixation on elections is wrong and I think it's creating problems for Africa.\"\nIt seems clear the government isn't about to loosen its grip. It is state control which has forced through improvements in healthcare.\nBut every night, as the centre of Asmara came alive with young and old spending time in the many bars and cafes, I was aware that at that moment dozens, maybe hundreds, of others were risking their lives to leave the country.\nThe full documentary Inside Eritrea will be broadcast on the BBC World News \"Our World\" programme on Friday 13 March at 20:30 GMT, Saturday 11:30 GMT Sunday 17:30 GMT and 22:30 GMT.\nAnd in the UK on the BBC News Channel at 21:30 GMT on Saturday and Sunday and on the BBC iPlayer.", "url": "https://www.bbc.com/news/world-africa-31851587"}