{"authors": ["George Scotland", "Josh Sandiford", "www.facebook.com"], "date_download": "2025-04-26 06:36:30", "date_modify": "2025-04-26 06:36:30", "date_publish": "2025-02-27 06:02:54", "description": "Concerns raised include staff allegedly displaying \"bullying\" behaviour and children being put in isolation.", "filename": "news_articles_clyze5lky7ko_1745649390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5cba/live/fe9b9fc0-f52d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyze5lky7ko_1745649390.html", "title": "Solihull school investigation for allegations of teacher bullying", "title_page": "Solihull school investigation for allegations of teacher bullying - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An academy trust is launching an independent investigation at a Solihull school for children with additional needs after the BBC contacted them about allegations of \"bullying by teachers\".\nThe Heights Academy, in Smith's Wood, opened in September 2023, promising a \"unique educational approach\" tailored to pupils who are autistic or have mental health needs.\nBut some parents have expressed concern about the school's culture, with one accusing bosses of \"mis-selling them a dream\".\nThe Forward Education Trust, which runs the school, said it was aware of concerns raised about the special educational needs and disabilities (SEND) provision and would commission a \"thorough and transparent\" investigation.\nOne mother, Amy, told the BBC she had taken her son Cooper, who is autistic and has dyspraxia and anxiety, out of the school after just one year.\nShe alleged the 12-year-old had been \"relentlessly targeted\" by a teacher over a number of months, claiming the case \"wasn't investigated\" by trust bosses.\nWhen asked if accusations of bullying by teachers would be included in the investigation, the Trust said it would be \"inappropriate\" to comment further.\nAmy, a full-time carer with a degree in education, said her son has now been out of education since October 2024.\n\"We went to open evenings and did our due diligence,\" Amy said.\n\"I would like them to understand the damage they have done to my child.\n\"School is a place where children should feel safe, thrive and create memories, not come home petrified about going the next day.\"\nThe BBC understands that a WhatsApp group with more than a dozen concerned parents has been set up.\nLabour councillor Hazel Dawkins said she had personally spoken to the parents of seven different children.\nConcerns raised to her include claims of staff members displaying \"bullying\" behaviour, children being placed in isolation for becoming emotional, and at least one case of a pupil escaping.\n\"Some of the parents have mentioned that teachers just don't know how to handle [a child] having a meltdown,\" Dawkins said.\n\"A room should be available for them to go into, calm down and go back into the lesson.\nSolihull Council said: \"We are aware of concerns raised by some parents of children attending The Heights Academy.\n\"It is the responsibility of the multi-academy trust to investigate these concerns and we have sought assurance from the Trust that this is in train and will work closely with them where appropriate.\"", "url": "https://www.bbc.co.uk/news/articles/clyze5lky7ko"}