{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 07:05:34", "date_modify": "2025-04-26 07:05:34", "date_publish": "2025-02-28 06:26:49", "description": "New figures on fly-tipping show a rise in reported incidents in Worcestershire and a fall in Herefordshire.", "filename": "news_articles_cx2eenx52p1o_1745651134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d4da/live/700487a0-f518-11ef-a276-596f7e6218f8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eenx52p1o_1745651134.html", "title": "Fly tipping rise due to cost of living, says Redditch councillor", "title_page": "Fly tipping rise due to cost of living, says Redditch councillor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The number of fly-tipping incidents in Herefordshire has fallen in the last year, but cases rose in Worcestershire, according to the latest figures.\nThere were 726 reported incidents in Herefordshire in 2023/24 compared to just over 1,000 in 2022/23, Department for Environment, Food and Rural Affairs (Defra) figures showed., external\nIn Worcestershire, there was an increase of almost 2,000 to more than 6,700 over the same period of time.\nSharon Harvey, deputy leader of Redditch Borough Council, said she believed the cost of living crisis was contributing to the town's problems, but the authority was taking steps to address the issue.\nAcross England, local authorities dealt with 1.15m incidents, which was an increase of 6% in 2022/23.\nUp to 60% of fly-tips in England involved household waste, with the most common place to dump it was on highways, Defra said.\nIn Worcestershire, Redditch saw a rise with 2,340 reported incidents between 2023/24, which compared to 1,555 in the previous year.\nDespite the increase of almost 800 incidents, there were no fixed penalty notices issued, the figures showed.\nMs Harvey said: \"For the last six months we've had Worcester regulatory services on board, and they're investigating when we have fly tipping and that's really difficult.\n\"We'd really like to get to the point of some fixed penalties, but it takes time to collect the evidence, and we have to make sure that it will stand up if challenged.\n\"You might often find a mattress, and that's something you can't often fit into a car, same with things like a sofa... and you might even have a car to transport it to the tip yourself, so I think a real big thing we need to do is education,\" she said.\n\"So those people living in those areas, they need to know how to ask the council how to remove their waste and how to dispose of it properly.\"\nOther councils in Worcestershire, Wyre Forest District Council and Worcester City Council, said fly tipping was a priority, while Wychavon District Council said it planned to invest an extra £10,000 to tackle the problem in the next financial year.", "url": "https://www.bbc.co.uk/news/articles/cx2eenx52p1o"}