{"authors": ["André Rhoden-Paul", "www.facebook.com"], "date_download": "2025-04-26 07:51:19", "date_modify": "2025-04-26 07:51:19", "date_publish": "2025-02-25 15:22:22", "description": "Maximillian Bourne stabbed and strangled the housekeeper at his family's luxury home in west London.", "filename": "news_articles_crmj77v8y7do_1745653879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c38/live/99d5f1b0-f390-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmj77v8y7do_1745653879.html", "title": "Chelsea: Son of art collector sentenced for attacking housekeeper", "title_page": "Chelsea: Son of art collector sentenced for attacking housekeeper - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The son of an art collector who \"viciously and brutally\" stabbed and strangled a housekeeper at his family's multimillion-pound home in west London has been sentenced to a hospital order.\nMaximillian Bourne attacked Joselia Pereira Do Nascimento at the luxury home in Justice Walk, Chelsea, in February last year, before calling 999 and telling the operator he stabbed a \"demon woman\" and was a \"nice boy from Chelsea\".\nThe 26-year-old was charged with attempted murder but was deemed unfit to stand trial due to his mental health. A jury at Southwark Crown Court on Monday determined he was responsible for the attack.\nJudge Gregory Perrins said Bourne would stay in a secure hospital \"indefinitely\".\nJudge Perrins said live-in housekeeper Ms Nascimento had been watching TV in her room when Bourne knocked on her door and told her to come out on the evening of 25 February 2024.\n\"He then viciously and brutally attacked her, stabbing her repeatedly with a kitchen knife to her head and her body,\" the judge said.\n\"She was attacked without warning and without provocation in the home in which she lived and worked. It is only through sheer good fortune that she survived the attack.\"\nThe court heard Ms Nascimento managed to get free and lock herself in a bathroom, before finding her phone and contacting a friend.\nIn a written statement previously read in court, the housekeeper said: \"I told him I have a daughter and I pleaded with him to stop.\n\"He told me that it was because I was evil, but we had never had an argument or a disagreement.\"\nJudge Perrins told the court Ms Nascimento had permanent scars causing her \"intense\" pain and she suffered with mental health issues including post-traumatic stress disorder and panic attacks.", "url": "https://www.bbc.co.uk/news/articles/crmj77v8y7do"}