{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 04:03:22", "date_modify": "2025-04-26 04:03:22", "date_publish": "2025-03-03 21:23:57", "description": "A woman says she did not tell nurses what was happening since she thought the men were her friends.", "filename": "news_articles_c70wnl0ljjzo_1745640202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0877/live/50c06cd0-f868-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70wnl0ljjzo_1745640202.html", "title": "Girl, 13, saw her alleged Rochdale abusers as 'friends', court told", "title_page": "Girl, 13, saw her alleged Rochdale abusers as 'friends', court told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who was allegedly used as a \"sex slave\" when she was a teenager has told jurors she used to believe it was \"normal\" to have had sex with at least 30 men by the age of 13.\nWhen she regularly attended a sexual health clinic, she said she did not tell staff what was happening to her because she saw the men as her \"friends\".\nEight men are on trial at Manchester Minshull Street Crown Court, accused of sexual offences - including rape and indecent assaults - against two girls as young as 13 in Rochdale between 2001 and 2006.\nThe prosecution has argued the men plied the girls with alcohol, drugs and cigarettes and then demanded to have sex with them whenever they wanted.\nEarlier, prosecutor Rossano Scamardella KC said both girls were sexually abused because their troubled backgrounds had made them vulnerable.\n\"They were children passed around for sex, abused, degraded and then discarded,\" Mr Scamardella said.\n\"They became sex slaves.\"\nOne alleged victim, known in court as Girl A, was cross-examined by Lisa Wilding KC, representing one of the defendants, Mohammed Zahid.\nThe 64-year-old, who was known as \"Bossman\", was accused of giving both girls underwear from his lingerie stall on Rochdale market as well as alcohol, food and money in exchange for sex.", "url": "https://www.bbc.co.uk/news/articles/c70wnl0ljjzo"}