{"authors": ["Alex Moss", "www.facebook.com"], "date_download": "2025-04-26 03:54:05", "date_modify": "2025-04-26 03:54:05", "date_publish": "2025-03-03 07:23:01", "description": "After a lengthy dispute, the miners' strike ended on 3 March 1985 with a vote to return to work.", "filename": "news_articles_c9de5w9e7qzo_1745639645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/52ee/live/84bcf380-f527-11ef-84d6-e76b54ed9e13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9de5w9e7qzo_1745639645.html", "title": "Miners mark 40th anniversary of year-long strike", "title_page": "Miners mark 40th anniversary of year-long strike - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Forty years ago, the bitter year-long miners' strike came to an end when thousands of men came off the picket lines and returned to work.\nMore than 140,000 workers had walked out in March 1984 in protest over the then prime minister Margaret Thatcher's plans to shut 20 pits.\nIt ended 12 months later in a decisive victory for the Conservative government when the National Union of Mineworkers narrowly voted to stop the dispute without a settlement on 3 March 1985.\nAfter a long and acrimonious fight, which divided communities and left families on the breadline, miners went back to the pits two days later.\nIn Grimethorpe, near Barnsley, thousands of men gathered in the centre of the village behind the colliery brass band to march back to the pit gates.\nDefeated but not broken, they were clapped and cheered amid shouts of \"keep your heads up\".\nMany children had been brought out from the classrooms to watch on and support their fathers.\nSpeaking to the BBC at the time, Grimethorpe branch secretary Bill Fearon said: \"My feelings this morning are certainly one of unity. We all came out together and I'm delighted we're all going back together.\"\nIn the weeks and months before the vote it was clear that times were changing and remaining on strike was no longer an option.\nMiners and their families had faced increasing financial hardship, so much so some had made the difficult decision to go against the NUM and return to work\nThe pickets had failed to stop or even restrict power supplies to the nation and so the united front was beginning to disintegrate.\nA striking miner, Jim Duffy who worked at Brodsworth, in Doncaster, remembers it was time of mixed emotions as they walked back to the colliery site.\n\"My wife and son who was in a pushchair walked alongside me. The lads were all subdued and overwhelmed really,\" he said.\nThe 65-year-old recalled how on the day he how wrote down his feelings of going back to work and sealed the paper in an envelope.\nIt was only last year he decided to read his reflections back.\nHe said: \"There were two pages about how I was feeling. I'd written a lot about my wife and how she had supported me throughout it all.\"\nMr Duffy, who spent 16 years working at Brodsworth, remembered the excitement of receiving his first full wage packet.\n\"I felt like a millionaire, but we were conditioned to be quite frugal so we didn't go on a spending spree or anything like that.\"\nKen Warnes, a miner who had worked at Westthorpe Colliery in Killamarsh near Rotherham and Worsop in Nottinghamshire, had been surviving on about £2 a day while on strike.\n\"We all knew it was coming to an end and that we were losing,\" he said.\nDespite counting himself as one of the lucky ones, as he did not have children to support, going back to work meant he could start earning \"a decent wage\" again.\n\"It was very arduous but I didn't have family,\" he said.\n\"Many of the miners that did, it was heart-breaking especially coming up to Christmas when they couldn't buy their kids anything.\"\nMr Warnes was one of the thousand of miners who were arrested during the strike for picketing.\nBut, unlike many who lost their jobs, when he returned he was allowed to go back to role as a colliery winder.\nMeanwhile, the financial strains of that year were widespread and reverberated through the communities which relied on working miners.\nLes Smith, who ran a grocery store in Brampton, Rotherham, spoke to BBC Radio Sheffield in the days after the strike had ended.\nHis business relied on the pay packets of those miners from nearby Cortonwood Colliery.\nHe had reduced his prices on staple items such as bread and washing powder to get by.\nForty years on, Mr Duffy is keen to keep the story of experiences like his alive and attends commemorative events.\n\"Mining was in my blood I guess, because my dad was a miner and we moved down from Scotland for him to work at Brodsworth and then I eventually got a job there.\n\"There were a lot of good memories there for me.\"\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North", "url": "https://www.bbc.co.uk/news/articles/c9de5w9e7qzo"}