{"authors": ["Jasmine Lowe", "www.facebook.com"], "date_download": "2025-04-26 06:50:30", "date_modify": "2025-04-26 06:50:30", "date_publish": "2025-03-01 07:54:07", "description": "Campaigners are calling for the role of a driving instructor to become a position of trust.", "filename": "news_articles_c8d4j361ey8o_1745650230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e1bd/live/d3adbb50-f5c7-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d4j361ey8o_1745650230.html", "title": "Calls to make driving instructors a position of trust", "title_page": "Calls to make driving instructors a position of trust - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman says she was left feeling \"awkward\" after her driving instructor asked her if she was a virgin.\nRose, from East Yorkshire, who was 17 at the time and is now in her 20s, claimed her instructor also cancelled her test two days before it was due after she refused to have a meal with him.\nShe is one of a number of women who have shared examples of inappropriate behaviour from their instructors, as campaigners call for the role to be made a position of trust.\nThe Driver and Vehicle Standards Agency (DVSA) said: \"All complaints against approved driving instructors are fully investigated, involving the police if necessary and pupils are encouraged to report all incidents to the DVSA.\"\nRose said she began to feel uncomfortable when her instructor would talk about his wife saying they \"don't have a laugh like we do\".\nShe said: \"That's when I started to think, is he flirting with me? But then he used to text me messages like 'outside beautiful' and stuff like that.\"\nWhen her instructor asked her if she was \"clean\" and a \"virgin\", Rose claimed she said no to avoid the conversation.\nShe said: \"The way he said clean was so rude. Even if I had lost my virginity, I was still clean.\"\nRose said she stuck with this instructor due to being close to her test date, but when that came around she claimed he wanted to give her a free motorway lesson and then go for food and drink.\nAfter she said no, she said he cancelled her test with two days to go.\n\"I felt confused and it was awkward, I think he was mad at me for rejecting him,\" she said.\nA BBC Freedom of Information request in December revealed there had been 131 complaints of inappropriate or sexual behaviour by instructors to the DVSA in 2023, up from 100 in 2020.\nThe most recent figures show that there were 41,453 approved driving instructors on the DVSA's register as of September 2024.\nMost of the women said their experiences happened when they were 17.\nAlice, not her real name, claimed her instructor made her cover her eyes with a Covid mask after driving to a back road and also told her he would \"bite her ear if she sped\".\n\"God knows what he was doing when I was blindfolded,\" she said. \"We weren't driving, he just made me do the pedal work. I couldn't see what he was doing.\"\nAlice added she did not make a complaint at the time: \"I wouldn't know where to start, who would I go to? It was just very daunting.\"\nMartina, from West Yorkshire, who was 19 at the time, claimed during lessons her instructor made sexual remarks, touched her legs and thighs and on one occasion, \"put his arm across my chest where my breasts were, which made me feel very uncomfortable\".\nJodi, from Hull, said she felt \"so embarrassed and quite trapped\" on her first lesson when her instructor got out of his car and urinated in front of her.\n\"He said he needed the toilet but to my horror he just got out of the car and had a wee right there,\" she said. \"Now that I'm older and wiser, I would have left after the first few lessons.\"\nA position of trust is a legal term associated with roles where adults have a duty of care over a young person, such as in education and social care.\nCalls for driving instructors to join the list have been going on for years.\nIn 2017, Conservative MP Richard Graham called for instructors to be covered by the same rules as teachers, with then prime minister Theresa May saying she would look into the issue.\nIn 2022, the government changed the law and extended the definition to include faith group leaders and sports coaches, but driving instructors were not included.\nFearFree, a charity that supports people affected by domestic abuse, sexual violence and stalking, has launched a campaign called Emergency Stop, which calls for that to be changed.\nDebbie Beadle, CEO, said: \"Driving instructors know where you live, they have your phone number and they're alone with children.\n\"So, if they want too, it gives them the opportunity to spark up a relationship, take advantage of their position and groom children, so it's important we act on this.\"\nDavid McClenaghan, a solicitor who deals with workplace injury and abuse claims, said there was \"no sensible argument for driving instructors being excluded\".\nHe said: \"Any adult that has been given authority over a young person should in law be treated as being in a position of trust. I would have grave concerns in respect of anyone who disagreed with this.\"\nHowever, not everyone feels a change in the law is needed.\nOne instructor, from East Yorkshire, said the job was \"so rewarding\" but was not convinced the role was the same as others in a position of trust.\n\"I'm not sure it's the same. Instructing a person to drive is so different to placing your whole-hearted trust in someone, such as a doctor.\n\"But driving instructors, in my opinion, should not be allowed to have relationships with any students. Instructors that place themselves in this position, should be struck off.\"\nThe authority which licenses instructors, the DVSA, said instructors \"must be suitably qualified, undergo pre-registration checks, follow a strict code of practice and have regular standards checks\".", "url": "https://www.bbc.co.uk/news/articles/c8d4j361ey8o"}