{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:45:28", "date_modify": "2025-04-26 06:45:28", "date_publish": "2025-03-01 15:28:00", "description": "Sharon Price says she is glad she went for a clinical trial, after being diagnosed with the cancer.", "filename": "news_articles_c5y04q2ev3ro_1745649928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/867c/live/4e48aa40-f6a0-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y04q2ev3ro_1745649928.html", "title": "Rectal cancer trial finds patients can avoid life-changing surgery", "title_page": "Rectal cancer trial finds patients can avoid life-changing surgery  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman diagnosed with rectal cancer who was faced with the possibility of having a stoma for the rest of her life has said she is \"so glad\" she went for a clinical trial.\nSharon Price, 51, from Newcastle-under-Lyme, was 45 and recently married when she found out she had an early-stage form of the cancer.\nExperts at the NHS Clatterbridge Cancer Centre on the Wirral treated her with a type of internal radiotherapy, meaning she avoided invasive surgery.\nMrs Price said the trial meant she could enjoy \"a normal, healthy life\".\n\"It has had no lasting impact on my life - and I wonder if that would have been the case if I had not joined the research,\" she said.\nShe said the alternative would have meant surgery and a stoma - an opening on the abdomen which connects to the digestive system and allows waste to be diverted into a bag.\n\"That was devastating - I was just too young to have to go through that and live with the consequences,\" she said.\n\"Many people do live with a stoma but for me, there would be no reversal of it, and I found it very difficult to contemplate that.\"\nShe added that she still had the option of surgery, if the new technique failed.", "url": "https://www.bbc.co.uk/news/articles/c5y04q2ev3ro"}