{"authors": ["Basillioh Rukanga", "www.facebook.com"], "date_download": "2025-04-26 08:12:39", "date_modify": "2025-04-26 08:12:39", "date_publish": "2025-02-26 11:54:00", "description": "The Antonov aircraft crashed after take-off from a military base in Omdurman city.", "filename": "news_articles_clyn914g249o_1745655159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b089/live/96e1f710-f435-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyn914g249o_1745655159.html", "title": "Sudan military plane crashes in Omdurman killing more than 40", "title_page": "Sudan military plane crashes in Omdurman killing more than 40 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least 46 people have been killed and 10 others injured after a Sudanese military plane crashed in a residential neighbourhood in Omdurman, the twin city of the capital Khartoum, state media says.\nThe Antonov aircraft came down after take-off from the military's Wadi Seidna air base on Tuesday evening, killing military officers and civilians.\nThe cause of the crash is unclear, but military sources have been quoted as saying that it was likely to have been a technical malfunction.\nThe crash came a day after the paramilitary Rapid Support Forces (RSF) - which is at war with the army - said it had downed a fighter jet in South Darfur.\nThe conflict has devastated large parts of Sudan - including Khartoum and Omdurman - with thousands of people killed and about 12 million displaced.\nThe health ministry said that emergency teams rushed injured civilians, including children, to a nearby hospital following Tuesday's plane crash.\nA senior army commander in Khartoum was among those killed, Reuters news agency quoted unnamed military sources as saying.\nWitnesses said there was a loud explosion and several homes were damaged when the plane came down, the AFP news agency reports.\nThe crash also caused power outages in nearby neighbourhoods, it added.\nSudan has been hit by a civil war since April 2023, when the army and the RSF became involved in a vicious power struggle.\nThe war has split the country, with the army controlling the north and the east while the RSF holds most of the Darfur region in the west and parts of the south.\nIn recent weeks, the army has retaken parts of Khartoum and surrounding areas from the RSF.", "url": "https://www.bbc.co.uk/news/articles/clyn914g249o"}