{"authors": ["Chloe Parkman", "www.facebook.com"], "date_download": "2025-04-26 07:53:33", "date_modify": "2025-04-26 07:53:33", "date_publish": "2025-02-25 13:53:37", "description": "Bob De La Haye and John Howell will be transporting the donated ambulances in mid-March.", "filename": "news_articles_clyj4vg5jjwo_1745654013.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a43a/live/471a8ce0-f36a-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj4vg5jjwo_1745654013.html", "title": "Jersey volunteers prepare to take retired ambulances to Ukraine", "title_page": "Jersey volunteers prepare to take retired ambulances to Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two retired Jersey ambulances will be transported overseas by volunteers to save lives in the Ukraine.\nBob De La Haye, 73, John Howell, 74, will be taking the retired Jersey Ambulance Service vehicles to the Ukraine in mid-March.\nMr De La Haye, who delivered a retired ambulance to the Ukraine in November, said the vehicles had been donated by the States of Jersey.\n\"We would welcome other items because, not only do we take the ambulance, last time we managed to fill it up with warm clothing, generators, tools, other bits and pieces, which they very much need,\" he told BBC Radio Jersey.\nHe added that \"a lot of baby things, nappies and medical supplies\" were also \"very well received\".\nMr De La Haye said the previous ambulance delivery in November was \"hugely successful and quite moving\".\nHe said the most moving part of the journey was visiting the military cemetery of the Field of Mars.\nMr De La Haye said the group was set to meet with Pick-Ups For Peace for the delivery, a charity which had shipped more than 525 vehicles to the Ukraine.\nHe said the charity suggested about 10 people were saved by every vehicle which had been delivered into the Ukraine.\nMr Howell said: \"Our journey is going to be so exciting. We're going to go through France, we're going to go through Germany and then into Poland before we get into Ukraine.\n\"I think once we get into Ukraine I'm going to feel very humbled.\n\"The suffering, the sacrifices the Ukrainians have made, I think it's going to be a very emotional but very happy time.\"\nMr Howell said the group would be meeting Pick-Ups For Peace in Poland, 300 miles (480km) from the border, and would drive in convoy to the Ukraine.\nHe said: \"It might be up to 24 vehicles.\n\"Once we get to Ukraine... there is a police convoy from the border to the town where we're going to deliver the ambulances.\"", "url": "https://www.bbc.co.uk/news/articles/clyj4vg5jjwo"}