{"authors": ["Natalia Forero", "www.facebook.com"], "date_download": "2025-04-26 06:58:54", "date_modify": "2025-04-26 06:58:54", "date_publish": "2025-02-27 06:00:34", "description": "The bridge in Havant was built in 1947 and is reaching the \"end of its structural life\"", "filename": "news_articles_cy4vmjw2nelo_1745650734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8599/live/25434aa0-f476-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vmjw2nelo_1745650734.html", "title": "Havant Station footbridge to be replaced in £11.5m project", "title_page": "Havant Station footbridge to be replaced in £11.5m project - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A £11.5m scheme to replace a dilapidated station footbridge could begin at the end of 2026.\nHampshire County Council is set to approve the appraisal and enter into contractual agreements to replace the bridge in Havant, Hampshire.\nLocated between Elmleigh Road and North Street, the bridge was built in 1947 and is owned and maintained by the county council.\nHowever, the structure is reaching the \"end of its structural life\", according to Havant Borough Council.\nHavant station is the fourth busiest in Hampshire, serving more than 1.8m passengers a year, according to the Local Democracy Reporting Service.\nA pedestrian survey carried out by the county council recorded more than 1,650 people using the station daily.\nThe footbridge crosses the railway to the west of Havant station, providing a pedestrian route and connecting the Civic Centre Campus, Havant College, and the nearby housing area of Leigh Park, in the north to Havant town centre, bus station, and Havant Park in the south.\nBut the council said there was currently a \"conflict\" between pedestrians and those using scooters, wheelchairs, or pushing strollers, due to the narrow layout of the existing footbridge, which is 1.85m (6.1ft) wide.\nThe deteriorating bridge will be replaced with one that is 4m (13.1ft) across the main span and 3.5m (11.5ft) on the ramps, which will connect directly with the cycle route along Elmleigh Road.\nIt is subject to planning approval and requires permission from Network Rail to take temporary control of a section of railway.\nThe new footbridge and ramps will be fabricated off-site, transported in sections, and then craned into position.\nThe route is expected to be closed for nine to 12 months on both sides.\nThe scheme will be funded from Department for Transport (DfT) highways maintenance funding, the borough council community infrastructure levy and housing developers.\nHampshire County Council's cabinet member for universal services will make the final decision on 3 March.", "url": "https://www.bbc.co.uk/news/articles/cy4vmjw2nelo"}