{"authors": ["Jonny Manning", "James Robinson", "www.facebook.com"], "date_download": "2025-04-26 04:20:21", "date_modify": "2025-04-26 04:20:21", "date_publish": "2025-03-03 15:44:17", "description": "Northumberland councillors will be voting on whether to allow a data centre to be built in Cambois.", "filename": "news_articles_c70e65463jzo_1745641221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11e0/live/0266a380-f839-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70e65463jzo_1745641221.html", "title": "Cambois data centre: The history of site pegged as new tech hub", "title_page": "Cambois data centre: The history of site pegged as new tech hub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The future of a failed gigafactory site will be decided when plans for a £10bn artificial intelligence (AI) and cloud computing data centre go before councillors.\nIt has long been hoped the land in Cambois, Northumberland, would be used to boost the local economy, but previous plans to build an electric car battery plant ultimately fell through.\nBritishvolt had vowed to create 3,000 jobs at the gigafactory but went bust before it could make good on its promise.\nHopes were renewed last year when investment firm Blackstone bought the site to create a massive data centre, which local leaders are confident will create an economic boom in the county.\nBritishvolt's original plans to create a £3.8bn factory had been hailed as a \"levelling up\" opportunity by the previous Conservative government, and was seen as part of the country's long-term plans to boost electric car manufacturing.\nBut in 2022 the company was hit by a number of major setbacks, which it said included \"rampant inflation and interest rates\" and rising energy bills.\nIt meant the already-delayed production of its batteries was pushed back until mid-2025.\nThe company's financial pressures led to it searching for a new owner to keep it afloat, but in January 2023 Britishvolt collapsed into administration.\nAustralian firm Recharge Industries stepped in and bought Britishvolt out of administration but in April last year plans to build the factory were finally abandoned.\nThe land was eventually bought by Blackstone in May 2024.\nThe firm has promised to invest £10bn to build a series of data centres - large warehouses containing servers able to provide huge amounts of computing power.\nBlackstone wants the Northumberland centre to be used by the growing artificial intelligence sector and cloud computing companies.\nIf approved, the project is expected to create about 1,600 direct jobs, including 1,200 in construction.\nIt is hoped a further 2,700 jobs will be created by tech firms moving to the county to take advantage of the new facilities.\nAs part of the deal, Northumberland County Council has also received £110m from Blackstone in exchange for removing a buy-back clause on the Cambois site, which had required the land to be used to build a gigafactory.\nQTS, a data company which is a subsidiary of Blackstone, has said it aims to begin construction in 2026.\nThe project has been met with mixed views from the public, with those objecting concerned about how noise and dust created by the construction work will impact residents.\nAnother objection has suggested the building might lead to a loss of natural light due to the data centre overshadowing nearby properties.\nThose in favour have hailed the development of the brownfield site as an opportunity for economic growth.\nNorthumberland County Council's deputy leader, Richard Wearmouth, is among those supporting the plans and has described them as \"game-changing\", according to the Local Democracy Reporting Service.\n\"Obviously I cannot prejudge the views of the planning committee on March 4, but this project is simply colossal investment in Northumberland and the UK more generally,\" he said.\n\"It would be the biggest artificial intelligence data centre in western Europe, with a build cost of £10bn and the end user, a company such as Facebook or Microsoft, likely to invest a further £5-10bn.\"\nHe has been joined in his support by local Labour leader Scott Dickinson, who said it should be viewed as an \"exciting development\".\n\"I hope that the site's history with Britishvolt and unfulfilled promises does not foster excessive scepticism among residents,\" he said.\n\"There is no doubt this is an opportunity for Northumberland to emerge as a leader in technology.\"", "url": "https://www.bbc.co.uk/news/articles/c70e65463jzo"}