{"authors": ["Sarah Spina-Matthews", "Joe Gerrard", "www.facebook.com"], "date_download": "2025-04-26 03:55:57", "date_modify": "2025-04-26 03:55:57", "date_publish": "2025-03-04 15:34:10", "description": "Teachers say the program helps students get to school on time and ensure they are ready to learn.", "filename": "news_articles_c93k9406y24o_1745639757.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1166/live/2d34cdd0-f906-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93k9406y24o_1745639757.html", "title": "York council free meals program extended with breakfast club", "title_page": "York council free meals program extended with breakfast club - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council-run free school meals trial, which is funded by donations, has been expanded with the launch of a breakfast club.\nThe York City Council Hungry Minds programme was rolled out at Fishergate Primary school last week.\nHead teacher Tina Clarke said the school had previously offered cereals to students who came to school hungry but it came from funds which could have been used elsewhere in school.\nThe Labour-run council said it hoped to extend the scheme to other schools in the city if the funding allowed.\nMs Clarke told BBC Radio York: \"I'm really grateful that our school was chosen because I know the levels of need some of our families have.\n\"It's something that as a school, with funding as it is at the moment, we wouldn't have been able to offer.\"\nMs Clarke said in addition to getting breakfast, students were also given a chance to socialise before lessons.\nTeaching assistant Claire Stenson, who runs the scheme, said: \"We've had good feedback from some of the teachers that these children have been a lot more settled first thing in the morning.\"\nShe added: \"They're a lot more able to learn.\"", "url": "https://www.bbc.co.uk/news/articles/c93k9406y24o"}