{"authors": ["David Gritten", "George Wright", "www.facebook.com"], "date_download": "2025-04-26 07:46:39", "date_modify": "2025-04-26 07:46:39", "date_publish": "2025-02-27 02:49:47", "description": "It was the last exchange of the Gaza ceasefire deal's first phase, leaving questions over what happens next.", "filename": "news_articles_c4gdx1rpel6o_1745653599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/113d/live/8fac1660-f4c1-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdx1rpel6o_1745653599.html", "title": "Israel confirms Hamas handed over hostages' bodies as Palestinian prisoners released", "title_page": "Israel confirms Hamas handed over hostages' bodies as Palestinian prisoners released - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Israel has completed forensic tests confirming the identities of four dead Israeli hostages whose bodies were handed over by Hamas in exchange for the release of Palestinian prisoners.\nOn Wednesday night, Hamas passed four coffins to the Red Cross from Gaza. Israel's prime minister confirmed on Thursday that they contained the remains of Shlomo Mansour, 86, Ohad Yahalomi, 50, Tsachi Idan, 50, and Itzik Elgarat, 69, and said all four men had been murdered.\nThe handover cleared the way for the delayed release of more than 600 Palestinian prisoners and detainees.\nIt was the last exchange of the six-week-long first phase of the Gaza ceasefire deal, leaving questions over what happens next.\nHamas has said it is ready to start delayed indirect negotiations on the second phase, which aims to end the war and secure the release of the remaining Israeli hostages.\nThe office of Israeli Prime Minister Benjamin Netanyahu - who faces pressures from his political allies to resume fighting and crush Hamas - said he had instructed negotiators to depart for Cairo on Thursday for talks.\nThe Israeli military launched a campaign to destroy the Palestinian armed group in response to its unprecedented attack on Israel on 7 October 2023, in which about 1,200 people were killed and 251 were taken hostage.\nAt least 48,365 people have been killed in Gaza since then, according to the territory's Hamas-run health ministry.\nMost of Gaza's population of 2.1 million has been displaced multiple times. Almost 70% of buildings are estimated to be damaged or destroyed. The healthcare, water, sanitation, and hygiene systems have collapsed, and there are severe shortages of food, fuel, medicine, and shelter.\nHamas handed over the four men's bodies late on Wednesday night, with no public ceremony, unlike in previous exchanges during the current ceasefire.\nIsraeli authorities carried out initial forensic testing close to the Israel-Gaza border before transferring the remains to the Abu Kabir Institute of Forensic Medicine in Tel Aviv.\nIt came after the body of a Palestinian woman from Gaza was handed over by Hamas to Israel instead of the body of hostage Shiri Bibas last week, prompting fury in Israel. Hamas said it was a mistake and transferred Bibas's body the following day.\nFollowing the identification of the bodies received overnight, the Israeli prime minister's office announced that military officials had informed the Mansour, Yahalomi, Idan and Elgarat families that their loved ones \"were murdered and have been returned for burial in Israel\".\n\"Pursuant to the intelligence and all of the information at our disposal, Ohad Yahalomi, Tsachi Idan and Itzik Elgarat were murdered while held hostage in Gaza,\" it added.\n\"Shlomo Mansour was murdered in the 7 October 2023 massacre and his body had been held in the Gaza Strip.\"\nThere was no immediate response to the allegations from Hamas.\nTsachi Idan was taken by Hamas gunmen from his home in Nahal Oz, a kibbutz near the Gaza border on 7 October 2023. His eldest child, Maayan - who had just turned 18 - was shot and killed in front of her siblings and parents.\nHis family said that \"the unbearable journey to bring back our beloved and dear Tsachi from the inferno in Gaza has ended with the identification of his body\".\nItzik Elgarat was kidnapped from Nir Oz, another kibbutz, and reportedly shot in the hand during the attack.\nOhad Yahalomi, a French-Israeli dual national, was abducted from Nir Oz, along with his 12-year-old son, Eitan, who was released during a week-long ceasefire in November 2023.\nIraq-born Shlomo Mansour was killed by Hamas at Kibbutz Kissufim on 7 October 2023 and his body was taken to Gaza as a hostage.\nHis sister, Hadassah Lazar, told Israel's Channel 12 that \"we've reached an absurd situation where we take comfort in receiving a body to bury\". But, she added: \"The circle is not yet closed. We will continue fighting until the last hostage returns home.\"\nPresident Isaac Herzog said: \"Together with the entire nation, we share in the immense grief and sorrow of the bereaved families and [their] communities.\n\"The return of our brothers' bodies from captivity underscores our moral obligation to do everything in our power to bring back all the hostages - the living to their loving families, and the fallen to be late to rest.\"\nThe Hostages and Missing Families Forum, which represents the hostages' families, insisted that Ohad Yahalomi, Tsachi Idan and Itzik Elgarat could have returned alive if the Israeli government had agreed to the ceasefire deal sooner.\n\"[They] endured a prolonged period in Hamas captivity in Gaza. They should have returned alive; they could have been saved and brought back through an agreement.\"\nIt urged Israel's leaders to ensure the return of the 59 hostages remaining in captivity - 35 of whom are presumed dead - by the start of next week, warning that they \"have no time left\".\nNetanyahu promised Israeli authorities would \"act relentlessly until we bring everyone back\".\nFollowing the handover of the hostages' bodies, buses carrying Palestinian prisoners were seen leaving Ofer prison in the north of the occupied West Bank and then arriving in Ramallah, where a large crowd gathered to celebrate their release.\n\"We have been taken out of suffering as if we have been dug out from our own graves. No prisoner has had the experience of having their own release delayed twice,\" one of the prisoners, Yahya Shrida, told reporters.\n\"What we have been through is a situation that the mountains can't carry. It is very hard to explain.\"\nLater, dozens more Palestinians were seen getting off buses outside the European Gaza hospital in Khan Younis, southern Gaza.\nMany of them said they had endured harsh conditions while in detention.\n\"During the first period in jail, we were handcuffed and blindfolded for 90 days, you see no-one and no-one sees us. And we used to sit on our knees or on our buttocks for 18 or 20 hours,\" Eyad al-Saudi said.\nHe added: \"We left behind young detainees, and our joy will not be complete until the remaining detained prisoners are released from prison.\"\nThe Israeli military and prison service have previously said that detainees and prisoners are treated in accordance with the law.\nThe Palestinian Prisoners Media Office said a total of 642 Palestinians in Israeli jails were supposed to be released in the exchange.\nAmong them were 445 Gazans who were detained by Israeli forces without charge during the war and 46 women and children, it said. The 151 prisoners include dozens convicted of carrying out deadly attacks on Israelis who are being sent abroad.\nIsrael had delayed the releases since last Saturday in protest at what it said were \"Hamas's repeated violations, including the ceremonies that humiliate our hostages and the cynical exploitation of our hostages for propaganda purposes\".\nHamas said Israel's decision was a \"blatant\" violation and said indirect talks about further steps in the ceasefire deal were conditional on the prisoners being released.\nAfter days of impasse, Egyptian mediators secured the new exchange, with the Israeli prime minister's office saying the hostages' bodies would be handed over \"in an agreed-upon procedure and without Hamas ceremonies\".\nA Hamas official meanwhile said the handover would take place \"without public presence to prevent the occupation from finding any pretext for delay or obstruction\".\nIt remains unclear whether the truce will be extended or progress to a planned second phase, which would see the release of all remaining living hostages in Gaza in exchange for more Palestinian prisoners.\nIndirect negotiations for the second phase were due to start earlier this month but they have not yet got under way.\nHamas affirmed the group's \"full commitment to the ceasefire agreement\" on Thursday and its \"readiness to enter into negotiations for the second phase\".\nLater, the Israeli prime minister's office said he had \"instructed the negotiation delegation to depart for Cairo today to continue the talks\", without giving any details.\n\"Our delegation will go to Cairo and see whether we have a common ground to negotiate,\" Foreign Minister Gideon Saar told reporters.\n\"We said we are ready to make the framework longer in return to release more hostages. If it is possible we'll do that.\"", "url": "https://www.bbc.co.uk/news/articles/c4gdx1rpel6o"}