{"authors": ["Ben Parker", "Joao Santos", "www.facebook.com"], "date_download": "2025-04-26 04:12:09", "date_modify": "2025-04-26 04:12:09", "date_publish": "2025-03-04 12:33:39", "description": "Suffolk County Council is due to take back control of the service, but the plan has met opposition.", "filename": "news_articles_cn0jgpwrweyo_1745640729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bc9/live/3cd8e020-f846-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn0jgpwrweyo_1745640729.html", "title": "5,000 sign petition against planned Suffolk libraries change", "title_page": "5,000 sign petition against planned Suffolk libraries change - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A petition against a council taking back control of a library service has reached 5,000 signatures.\nSuffolk County Council announced the move after it failed to agree terms with its private contractor.\nSuffolk Libraries, a charity, has run the service since 2012 and now operates in 45 places.\nThe council recently posted a video on social media asking people not to sign the petition.\nThe Local Democracy Reporting Service has been looking at contrasting statements from both organisations.\nThe council said its takeover would guarantee that all 45 sites across Suffolk remained open and would keep their current opening hours.\nSuffolk Libraries said no closures of any of the sites were planned, but reducing opening hours was the only way to meet rising costs and ensure the long-term future of the service.\nThe charity said that even if opening hours were maintained under a return to council control, the services on offer could be reduced. This is because contracts being run with other bodies would not transfer to the council and services including prison libraries and literacy projects could be lost.\nThe council responded by saying it would apply for the same grants to keep non-core library services open, with the potential of some contracts being replaced.\nThe county council said Suffolk Libraries spent a third of its annual bill on its head office, including senior managers.\nBut Suffolk Libraries stated all the management costs were less than 5%.\nIt described these claims as \"particularly misleading\" and said five senior managers who earned more than £50,000 a year were \"responsible for generating well over £1m in commercial income, grants and fundraised income every year\".\nOnly its chief executive earned more than £61,000 a year.\nIn terms of the potential of job losses, the council promised it would protect frontline staff roles but said it was fair to assume some others would go if it took back control of the service.", "url": "https://www.bbc.co.uk/news/articles/cn0jgpwrweyo"}