{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 03:45:04", "date_modify": "2025-04-26 03:45:04", "date_publish": "2025-03-05 06:26:06", "description": "Warmer temperatures mean the swans no longer need to travel as far to reach ice-free wetlands.", "filename": "news_articles_cwyge75vyxeo_1745639104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/09c1/live/bb611830-f905-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyge75vyxeo_1745639104.html", "title": "Fewer swans migrating to UK wetlands, says charity", "title_page": "Slimbridge: Fewer swans migrating to UK wetlands, says charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Warmer temperatures due to climate change mean fewer wild swans are returning to the UK in winter, a charity says.\nStaff at the Wildfowl and Wetlands Trust (WWT) near Slimbridge, Gloucestershire, say their population of Bewick's swans has declined by 86% over the past almost 50 years.\nEvery year, thousands of these birds migrate from breeding grounds in northern Russia to the UK to avoid getting caught in the ice and snow of the arctic winter.\nHowever, they no longer need to travel as far to reach ice-free wetlands, with only 87 Bewick's swans returning to the reserve this year, without any cygnets in tow.\nThe Bewick's have been studied at WWT Slimbridge for about 50 years with more than 10,000 swans being recorded - making it one of the longest single-species studies ever researched.\nHowever, warmer temperatures in Europe mean the swans are now cutting their 2174-mile (3,500km) journeys short in comfortable climates along the way.\nEarly figures suggest more than 7,000 Bewick's \"short-stopped\" their migration this winter, in parts of Denmark, Germany and the Netherlands, according to WWT.\nReserve manager at WWT Slimbridge, Martin McGill, said their absence at the reserve this year had been \"concerning\".\n\"Bewick's swans are hugely important to our history here at WWT, and it's almost impossible to imagine Slimbridge without them,\" he said.\n\"We love welcoming them back each winter so it's terribly sad to see so few of them this year and without any cygnets.\"\nMr McGill explained that Bewick's swans also faced dangers on their migration route from toxic lead poisoning and illegal shooting.", "url": "https://www.bbc.co.uk/news/articles/cwyge75vyxeo"}