{"authors": ["Jon Wright", "www.facebook.com"], "date_download": "2025-04-26 03:48:02", "date_modify": "2025-04-26 03:48:02", "date_publish": "2025-03-05 15:17:41", "description": "Award-winning BSC Multicultural Services wants to support more minority communities in the county.", "filename": "news_articles_c0mw8re30zlo_1745639282.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e97/live/882f1c40-f90b-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw8re30zlo_1745639282.html", "title": "Multicultural support charity looking to help rural Suffolk", "title_page": "Multicultural support charity looking to help rural Suffolk - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity that supports people from minority communities says changing demographics mean its services are needed in more rural areas.\nBSC Multicultural Services (BSCMS) was started by volunteers in 1998 to help the Bangladeshi community in Ipswich.\nThe award-winning charity now has people from 65 different nationalities accessing its services.\nFunding and development manager, Mojlum Khan, said: \"Increasingly Suffolk is a diverse county. It's not always possible to go to Newmarket or Lowestoft regularly, so that can lead to social isolation or marginalisation.\"\nMr Khan said that although minority ethnic communities were smaller in towns outside of Ipswich, it was important BSCMS provided support for them.\n\"We've got two choices here - either we engage with them and get them on board and work proactively with them, or they go into their shells and then we have a bigger problem and investing more money to resolve those issues.\n\"So we, as a community, have to decide which direction.\"\nAccording to the UK census, external, this is how people across Suffolk identify their nationality:\nIpswich had a population of 139,600 in 2021\n12.5% declared a non-UK identity (8.1% in 2011)\nEast Suffolk had a population of 246,100 in 2021\n3.2% declared a non-UK identity (2.6% in 2011)\nWest Suffolk had a population of 179,900 in 2021\n12.8% declared a non-UK identity (10.7% in 2011)\nBabergh had a population of 92,300 in 2021\n2.9% declared a non-UK identity (2.4% in 2011)\nMid Suffolk had a population of 102,700 in 2021\n2.9% declared a non-UK identity (2.1% in 2011)\nOne organisation which is looking to expand its partnership with BSCMS is the Level Two Youth Project, based in Felixstowe.\nProject manager Shez Hopkins said: \"We've done quite a lot with them over the years, but more in the background facilitating opportunities to get their young carers and adult carers out in the community for trips.\n\"Now we really want to be encouraging them to come up and use our services as well.\n\"I think there is lots to learn on both sides about different cultures and how we can work together respectfully and collaboratively so it's a benefit to both.\"", "url": "https://www.bbc.co.uk/news/articles/c0mw8re30zlo"}