{"authors": ["Ruth Bradley", "www.facebook.com"], "date_download": "2025-04-26 04:18:16", "date_modify": "2025-04-26 04:18:16", "date_publish": "2025-03-04 06:38:35", "description": "The authority has had to spend its property sale proceeds on services rather than loan repayments.", "filename": "news_articles_cwyd3gg4lyzo_1745641096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a137/live/34488fe0-f81f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyd3gg4lyzo_1745641096.html", "title": "Council has £300m property debt despite sell-off", "title_page": "Somerset Council has £300m property debt despite sell-off - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A local authority has to pay off nearly £300m of loans with interest despite selling the properties bought with the money.\nSomerset Council is in the process of selling the shops and offices in its commercial property portfolio, which it inherited, along with the loan debt, from former district councils.\nBut it has had to spend the proceeds on services such as adult social care, following its warnings that it could go effectively bankrupt.\nA council spokesperson said it was \"clearly in the taxpayers' interest\" to sell the properties rather than borrow more money.\nThe district councils that were replaced by Somerset Council in 2023 along with the county council bought the properties with £298m in loans, external as part of an investment strategy taken by a number of English local authorities.\nThe £298m sum included fees and stamp duty as well as the cost of the properties.\nThe councils hoped to rent out the properties and use the money to run local public services.\nHowever, just months after Somerset Council was created, it declared a \"financial emergency\" and said it would sell off 48 properties.\nIt was given special permission by the government to spend the proceeds on running day-to-day services like adult social care and children's services.\nBut the portfolio has significantly lost value due to falling market prices in recent years.", "url": "https://www.bbc.co.uk/news/articles/cwyd3gg4lyzo"}