{"authors": ["Maia Davies", "www.facebook.com"], "date_download": "2025-04-26 06:27:03", "date_modify": "2025-04-26 06:27:03", "date_publish": "2025-02-28 19:14:14", "description": "The tropical cyclone left more than 180,000 homes without power and 170,000 without running water.", "filename": "news_articles_c3w1xq87l8qo_1745648823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1cf/live/f019c780-f607-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w1xq87l8qo_1745648823.html", "title": "Cyclone Garance kills three as it sweeps through Reunion island", "title_page": "Cyclone Garance kills three as it sweeps through Reunion island - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three people have died in Reunion after Cyclone Garance swept through the French Indian Ocean territory with gusts of up to 234km/h (145mph).\nThe tropical cyclone left more than 180,000 homes without power and 170,000 without running water after making landfall on Friday morning.\nThe remote island's entire population - including emergency services and police - were ordered to stay indoors as the maximum alert level was imposed.\nHeavy storm rains were expected to continue on Friday evening, with Prime Minister Francois Bayrou warning on X, external that the cyclone remained a threat.\nThe \"brutal and violent\" conditions were worse than Cyclone Belal, which killed four people on the island in January 2024, Prefect Patrice Latron said.\nGarance made landfall in the north of Reunion at 10:00 local time (06:00 GMT), before sweeping south and exiting the island by late afternoon, according to weather agency Meteo France.\nLocal authorities reduced the alert level by midday to allow emergency services and police to leave their shelters.\nThe top wind speed of 234km/h had not been recorded on the island since Cyclone Hollanda in February 1994.\nVincent Clain, 45, a resident of the island's northern coast, told news agency AFP: \"This is the first time I've seen a cyclone this powerful, and also the first time I've been afraid.\"\nSome 100 troops and firefighters were on standby to be dispatched from the French territory of Mayotte nearly 1,500km (930 miles) away when conditions eased, as well as 100 from mainland France.\nMeanwhile, a 55-year-old man went missing in nearby Mauritius on Wednesday after going swimming in rough seas.\nFrance's Interior Minister Bruno Retailleau said Friday that Garance was of a \"rare intensity\", while Defence Minister Sebastien Lecornu said armed forces stood ready to provide assistance.", "url": "https://www.bbc.co.uk/news/articles/c3w1xq87l8qo"}