{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:58", "date_modify": "2025-05-19 15:37:58", "date_publish": "2015-02-20 09:57:56", "description": "A senior consultant who specialises in foetal medicine has accused SDLP leader Alasdair McDonnell of undermining her profession.", "filename": "news_uk-northern-ireland-31549339_1747669078.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80692000/jpg/_80692009_alasdairmcdonnelloffice.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31549339_1747669078.html", "title": "Alasdair McDonnell foetus comments criticised by Dr Samina Dornan", "title_page": "Alasdair McDonnell foetus comments criticised by Dr Samina Dornan - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A senior consultant who specialises in foetal medicine has accused SDLP leader Alasdair McDonnell of undermining her profession.\nLast month, Dr McDonnell, a GP, said doctors cannot predict when a foetus has a lethal abnormality.\nMr McDonnell made his comments as he stated his party's opposition to abortion in cases of lethal foetal abnormality or rape.\nDr Samina Dornan said he \"undermined our professional integrity.\"\n\"He instilled a lack of confidence in the public about our ability to do our job,\" Dr Dornan, a consultant at Belfast's Royal Victoria Hospital said on Radio Ulster's Nolan Show.\n\"It's amazing that he, as a member of the UK parliament, is coming out with statements like this - and he's a doctor.\n\"He's telling the world that our professionals are not up to their job.\"\nThe Department of Justice (DoJ) recently ran a public consultation on proposals to change Northern Ireland's abortion law, which differs from the rest of the UK.\nCurrently, a termination is only legal in Northern Ireland if a woman's life is at risk or if there is a risk of permanent and serious damage to her mental or physical health.\nThe DoJ recommended allowing abortion in lethal abnormality cases.", "url": "https://www.bbc.com/news/uk-northern-ireland-31549339"}