{"authors": ["Sophie Parker", "www.facebook.com"], "date_download": "2025-04-26 07:04:34", "date_modify": "2025-04-26 07:04:34", "date_publish": "2025-02-28 07:05:31", "description": "Salisbury Cathedral acquired the bible which was created and illustrated there by a medieval master.", "filename": "news_articles_c4gmmjn78d4o_1745651074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/12f9/live/2f0f6840-f537-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gmmjn78d4o_1745651074.html", "title": "Salisbury Cathedral displays 700-year-old bible for first time", "title_page": "Salisbury Cathedral displays 700-year-old bible for first time - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A treasured bible illustrated by a medieval master around 775 years ago has gone on public display for the first time – in the city where it was created.\nThe Sarum Master Bible can now be seen at Salisbury Cathedral, which managed to acquire it after a charity raised £90,000 to buy it.\nHandwritten Latin text is squeezed onto its 17cm-high pages, and the first letter of each book of the bible is lavishly decorated.\nThe Sarum Master – whose real name is unknown – is considered \"one of the finest English artists of the period\", said cathedral librarian Dr Anne Dutton.\nIt is believed the bible was created in Salisbury between 1240 and 1250.\nAfter going on display, the 13th Century manuscript will be carefully kept in the cathedral's 600-year-old library, behind a gate that the public are not allowed through.\nDr Dutton said: \"I can honestly say that it was the most spectacular Christmas present I have ever received – of course, not for me personally.\"\nThe writing is tiny – which means the decoration and colour on letters and illustrations are too, with none more than 2.5cm high.\nDr Dutton said: \"It is virtually impossible to see the details without some kind of magnification.\"\nShe said lenses may have been used in the 1200s to magnify and create the illustrations and text.", "url": "https://www.bbc.co.uk/news/articles/c4gmmjn78d4o"}