{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:35:37", "date_modify": "2025-04-26 06:35:37", "date_publish": "2025-02-27 06:14:27", "description": "Nurses working with call handlers at East Midlands Ambulance Service are helping to ease pressure.", "filename": "news_articles_cd0njxe4ljko_1745649337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/db32/live/8088d9e0-f42e-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0njxe4ljko_1745649337.html", "title": "Inside East Midlands Ambulance Service emergency call centre", "title_page": "Inside East Midlands Ambulance Service emergency call centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is lunchtime and already 1,292 calls have flooded into the emergency call centre.\n\"We never know from one minute to the next what we're going to be dealing with,\" says Sue Cousland, divisional director for Lincolnshire.\n\"We've had people who've had heart attacks, people who might have had a stroke that we've had to respond to quite quickly, and we've also had a range of minor issues that seem minor to us, but are not minor to those people who are phoning in.\"\nGiven the shear volume of calls, it is clear the role of nurses working alongside the call handlers is crucial.\nSince its launch in September, 70% of patients in Lincolnshire assessed by the nurses have been directed to alternative care.\n\"It's a great collaboration,'' Ms Cousland tells me. ''Not everybody calling 999 needs an ambulance.\"\nAs well as Lincolnshire, EMAS covers Nottinghamshire, Derbyshire, Leicestershire, Rutland and Northamptonshire.\nThe eight hospitals EMAS can use in the region are listed on a digital screen on the wall.\nAn eye is always on handover times.\nIn December, staff lost 25,000 hours in queues outside hospitals waiting to hand patients over - the second highest month on record.\nOn the screens, alongside the number of ambulances at each hospital is the average time they are waiting outside to hand over patients.\nAt Lincoln County Hospital, the average time today is 29 minutes, with the longest being over an hour.\nNatalie Favill, a trainee advanced clinical practitioner, is one of the nurses supporting call handlers in prioritising patients and offering alternatives to hospital admissions.\n\"We come here to support the ambulance service,\" she says.\n\"We pick up the lower acuity calls, generally the category three calls. They tend to be patients that we can support in urgent care, offering alternative pathways rather than sending an ambulance.\n\"A lot of patients do not require an ambulance, and our pathways in urgent care are more appropriate for their needs.\"\nCalls are categorised based on urgency from one to five. Categories one and two are for those people requiring immediate emergency treatment, such as cardiac arrest, patients unconscious and stroke symptoms.\nCategory three calls and below, which is where the nurses come in, still require an emergency response, but they are, as Ms Favill explains, \"for less acute medical problems\".\n\"This morning, I had a patient who was on the floor, unable to get up. They had just a small graze to the leg, no acute injuries, so I referred that to our urgent community response team.\n\"They attended to assist the patient off the floor, did a full assessment, and looked at whether they needed ongoing support, rather than it just being a lift up and go. They do get follow-up care.\"\nAlternative care options include a community response team for urgent home assessments, patients being booked directly into an urgent treatment centre, a referral to a district nurse, clinical advice over the phone and, in some cases, remote prescriptions issued.\nMs Favill says that while some callers initially expect an ambulance, they are often open to alternatives once they understand the benefits.\n\"Once they realise that actually there's a better option, which will be quicker and not involve going to hospital, then people tend to be a lot more receptive.\"", "url": "https://www.bbc.co.uk/news/articles/cd0njxe4ljko"}