{"authors": ["Joe Skirkowski", "www.facebook.com"], "date_download": "2025-04-26 03:45:44", "date_modify": "2025-04-26 03:45:44", "date_publish": "2025-03-05 06:13:49", "description": "Plans for young people to turn a former brownfield site into a wildlife reserve are under way.", "filename": "news_articles_cgj58035l0po_1745639144.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1079/live/5b5b0aa0-f850-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj58035l0po_1745639144.html", "title": "Brownfield site to be turned into nature reserve", "title_page": "Brownfield site to be turned into nature reserve - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Young people are taking a leading role in turning a brownfield site into a community nature reserve over the next three years.\nGrow Wilder is a five-acre urban nature reserve on the edge of Bristol and is part of Avon Wildlife Trust's Intergenerational Action for Climate and Nature programme.\nThe programme recently received £870,000 from the National Lottery Community Fund and organisers hope that young people can help use that funding to transform the space.\nYouth office Connor Meadows said the group of 13 to 18 years olds creating the space were \"really engaged with nature\".\nHe added: \"They're also going to be working with the local community to learn the history of the land and what it meant to people and wildlife in the past and use that information to decide what it's future looks like.\"\nThe project is also a chance for young people to learn about growing their own food both on the new site and Grow Wilder's main site just next door.\n\"I think young people aren't often given the space to be able to do these things and connect with nature in an urban area,\" said Mr Meadows.\n\"It's really great to be able to bring out the enthusiasm and engagement from these young people and help them develop their personalities and skills.\"\nGrow Wilder is also keen for the local community to have a stake in the new site and have invited them in for tours and discussions through community open days.", "url": "https://www.bbc.co.uk/news/articles/cgj58035l0po"}