{"authors": ["Richard Moss", "www.facebook.com"], "date_download": "2025-04-26 03:50:22", "date_modify": "2025-04-26 03:50:22", "date_publish": "2025-03-05 12:47:13", "description": "Teachers and academics in the shadow of Hadrian's Wall hit back against the axing of Latin funding.", "filename": "news_articles_c3d813v7ylxo_1745639422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d3f4/live/24eb85b0-f9b0-11ef-b257-2b725ccbdd87.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d813v7ylxo_1745639422.html", "title": "Northern academics condemn axing of state sector Latin funding", "title_page": "Northern academics condemn axing of state sector Latin funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Academics from leading universities have condemned the decision to pull a scheme aimed at expanding the teaching of Latin in the state sector.\nThe £4m, four-year project was introduced by the Conservative government in 2022, but that was ditched by Labour in February with immediate effect.\nCritics of the programme said its success was limited, but some academics and MPs have described it as a \"tragedy\" for young people from less privileged backgrounds.\nThe government said it inherited a deficit which meant \"tough decisions were needed\", but Latin GCSE pupils sitting exams in summer would get support.\nThere are some state schools that still offer pupils the chance to learn a language some describe as dead.\nAt Keswick School in Cumbria, the subject is studied after hours as an extra option.\nFor the last 10 years it has been taught to GCSE level by Marcella Jackson who said it is not just for the academic elite.\n\"We offer Latin to pupil premium students, to children from different sets, abilities and backgrounds,\" Ms Jackson said.\n\"They all like languages, they like history and it's nice to give them an opportunity they wouldn't get anywhere else.\"\nSome of her former GCSE students say they have benefited from their insight into the ancient language.\nMarianne, who is now in the sixth form, said: \"I want to become a vet and in medicine it's a kind of universal language for all sorts of things, so it's really useful.\"\nClassmate Richard said: \"I really enjoyed learning where the words have come that we use in modern English, and so many European languages are all derived from Latin.\"\nDurham Johnston School is another that offers the language to GCSE level, but as part of the main school day.\nWhen I visited they had a Latin VIP in their lesson.\nProf Arlene Holmes-Henderson leads a department at Durham University dedicated to promoting the study of Latin and the Classics.\nShe had a stark statistic to pass on to the Latin learners: \"In the state sector, you have four times more chance of being able to study a classical subject in London and the South East than you do in the North East.\"\nShe said that means many pupils studying in the shadow of Hadrian's Wall are missing out on the benefits of Latin.\nDuring a seven-year research project, Prof Holmes-Henderson discovered Latin study made the most difference to children from disadvantaged backgrounds.\nShe found there were \"three groups of pupils who benefited most - young people with special educational needs and disabilities, students who speak English as an additional language and those who qualify for free school meals\".\n\"All three groups, who face barriers to their learning, unlocked significant benefits in English literacy.\"\nDurham Johnston School's Latin teacher Cathy Bothwell said helping the disadvantaged is the reason the school has persevered with the subject.\nShe said: \"Despite the cost of offering the subject, it is that social justice aspect.\n\"We have a very varied demographic and providing everyone with access to demanding academic subjects like Latin is a key part of that.\"\nThere is another divide too.\nA British Society study in 2020 found that while only 3% of state schools offered Latin at Key Stage 3, that figure rose to 49% in the fee-paying sector.\nOnly two of the region's schools - Polam Hall in Darlington, and Queen Elizabeth Grammar in Hexham - had taken advantage of the 2022 government Latin programme, but one of a group of MPs working to promote the study of the classics is determined the current government does not give up on Latin in state schools.\nYork Central's Rachael Maskell, who is a Labour member of the All Party Parliamentary Classics Group, said it would be a tragedy if the subject does end up purely in the private sector.\nShe said: \"Giving young people from less privileged backgrounds access is really important.\n\"We cannot have the whole classics agenda being in the hands of the few, so let's not throw the baby out with the bathwater and [instead] ensure there is something there for the benefit of classical education across the UK.\"\nA Department for Education spokesperson said: \"The £22bn black hole we inherited means tough decisions are needed across the public sector.\"\nThe department said it had \"worked with Classics for All and the Classical Association so teachers at the 39 schools on the Latin Excellence Programme can continue to benefit from high quality teacher training, and so that the small number of pupils in those schools who are due to sit their Latin GCSE this summer get the support they need\".\nProf Holmes-Henderson's message was \"nil desperandum\" - do not despair.\nShe said there were alternative sources of funding for a subject that is still part of the national curriculum and the region can still be at the heart of Latin's revival.\n\"Durham University has the only research centre in the world dedicated to classics education research, engaging multiple stakeholders on how we can widen access to the teaching of the subject in our schools and communities.\n\"We are pioneers in this region and we want to share the message with as many people as possible that Latin is for everyone and there is funding available to make that happen.\"", "url": "https://www.bbc.co.uk/news/articles/c3d813v7ylxo"}