{"authors": ["Emily Sinclair", "www.facebook.com"], "date_download": "2025-04-26 04:34:51", "date_modify": "2025-04-26 04:34:51", "date_publish": "2025-02-28 12:45:12", "description": "The Royal Albion Hotel in Brighton was badly damaged by a fire in 2023.", "filename": "news_articles_cn0jj4vyrvlo_1745642091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c327/live/3181ccf0-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn0jj4vyrvlo_1745642091.html", "title": "Brighton: Further demolition work continues at Royal Albion Hotel", "title_page": "Brighton: Further demolition work continues at Royal Albion Hotel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Further demolition work on a fire-damaged hotel in Brighton has begun.\nA section of the A259 has been closed for a week after warnings that the Royal Albion Hotel was at risk of \"catastrophic collapse\" prompted safety concerns.\nParts of the 200-year-old building were demolished in July 2023 after a fire broke out.\nCraig Douglas, construction manager of The Bloomsbury Group, who are completing the current work, said: \"The site remains secure, with controlled access, and the removal works are progressing as planned.\"\n\"This phase involves the demolition of dangerous structures on-site, including the safe removal of asbestos-containing materials,\" he said.\nParts of the A259 Kings Road were closed in both directions on 21 February over concerns that the hotel and its scaffolding may collapse.\nBrighton & Hove City Council said the road would remain fully closed until Sunday, while the southern part of the road was set to reopen on Monday.\nThe council said it would work with Britannia Hotels and the contractors to get the rest of the road reopened \"as soon as possible\".\nCouncillor Trevor Muten said: \"Public safety is our number one priority, but I understand this has caused a lot of disruption and again I'd like to thank people for their patience.\"\nThe council said the Brighton Half Marathon, due to take place on Sunday, will go ahead as planned.", "url": "https://www.bbc.co.uk/news/articles/cn0jj4vyrvlo"}