{"authors": ["David Mercer", "www.facebook.com"], "date_download": "2025-04-26 06:49:58", "date_modify": "2025-04-26 06:49:58", "date_publish": "2025-03-01 08:15:21", "description": "The PKK calls for the release of its jailed leader Abdullah Ocalan to lead a process of disarmament.", "filename": "news_articles_cgkmg3kmmero_1745650198.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/72a0/live/b670eb60-f668-11ef-90f3-cd2828e858c7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmg3kmmero_1745650198.html", "title": "Kurdish group PKK declares ceasefire with Turkey", "title_page": "Kurdish group PKK declares ceasefire with Turkey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Outlawed Kurdish group the PKK has declared a ceasefire with Turkey after its jailed leader Abdullah Ocalan called on the movement to lay down its arms and dissolve.\nIn Saturday's statement, the PKK said it hoped Turkey would release Ocalan, who has been imprisoned in solitary confinement since 1999, so he could lead a process of disarmament.\nIt follows his call this week aimed at ending four decades of armed struggle in south-eastern Turkey in which tens of thousands of people have been killed.\nHis announcement came months after Devlet Bahceli, the leader of Turkey's ultra-nationalist MHP party and an ally of the Turkish government, launched an initiative to bring an end to the conflict.\nThe PKK - which stands for the Kurdistan Workers' Party - has waged an insurgency since 1984, with the initial aim of carving out an independent homeland for Kurds, who account for about 20% of Turkey's 85 million people.\nThe group has since moved away from its separatist goals, and is now pushing for more autonomy and greater Kurdish rights.\nIt is banned as a terrorist group in Turkey, the EU, UK and US.\nWho are the Kurds?\nOcalan - affectionately referred to as Apo by Kurdish nationalists - met MPs from a pro-Kurdish party this week on Imrali, an island in the Sea of Marmara, south-west of Istanbul, where he is imprisoned.\n\"In order to pave the way for the implementation of leader Apo's call for peace and democratic society, we are declaring a ceasefire effective from today,\" the PKK executive committee said in a statement on Saturday, quoted by the pro-PKK ANF news agency.\n\"None of our forces will take armed action unless attacked,\" it added.\nTurkey's President Recep Tayyip Erdogan said later on Saturday that military operations would resume against the PKK if \"promises given [by the group] are not kept\" and the disarmament process stalled.\nThe PKK said Ocalan's prison conditions must be eased, adding he \"must be able to live and work in physical freedom and be able to establish unhindered relationships with anyone he wants, including his friends\".\nCalling for disarmament, Ocalan had appealed to members of the PKK in a letter read out by Dem party members Ahmet Turk and Pervin Buldan in both Kurdish and Turkish.\nHe said \"all groups must lay down their arms and the PKK must dissolve itself\", adding that his movement was formed primarily because \"the channels of democratic politics were closed\".\nHowever, Bahceli, backed by positive signals from Erdogan and other political parties, had created the right environment for the PKK to lay down its arms, Ocalan added.\nKurdish leaders largely welcomed the development. Local reports said thousands of people gathered to watch the statement on big screens in the cities of Diyarbakir and Van in the predominantly Kurdish south-east.", "url": "https://www.bbc.co.uk/news/articles/cgkmg3kmmero"}