{"authors": ["Brendan Hughes, Jayne McCormack and Gráinne Connolly", "www.facebook.com"], "date_download": "2025-04-26 06:33:49", "date_modify": "2025-04-26 06:33:49", "date_publish": "2025-02-27 06:32:20", "description": "Ministers agree on the programme one day after a decision on the finalised document was postponed.", "filename": "news_articles_c5y4eneqpkgo_1745649229.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5ca0/live/6c2c9180-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y4eneqpkgo_1745649229.html", "title": "Stormont's programme for government a milestone", "title_page": "Stormont's programme for government a milestone - O'Neill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The agreement of a long-awaited programme for government by Northern Ireland's ministers is an important milestone, First Minister Michelle O'Neill has said.\nThe programme was agreed after a virtual meeting of ministers that lasted about 40 minutes on Thursday morning, a day after plans to agree the document were withdrawn at the last minute.\nThe document will have to be delivered to the assembly first on Monday before it can be published to the wider public.\nSpeaking at a press conference, O'Neill said the agreed programme will \"set out the foundations to help build a prosperous and sustainable future for generations to come\".\n\"That includes focusing on priorities such as delivering improvements on childcare, cutting waiting lists, ending violence against women and girls, growing our economy and protecting the environment.\"\nThe programme for government is a document that sets out the shared priorities of all parties that make up Northern Ireland's power-sharing government and target's that the Executive hopes to achieve during its mandate.\nDeputy First Minister Emma Little-Pengelly said the \"unanimous agreement\" from ministers was \"an important step in bringing about an ambitious agenda of delivery\".\nShe said ministers were \"determined to build on our reputation here as a great place to live, work and invest\" and that \"good progress\" had already been made in many of the priority issues.\nLeader of the assembly's opposition Matthew O'Toole called \"for a clear plan\".\n\"It is firstly an absurd situation for executive ministers to be giving press conferences asking for praise without actually publishing a PfG document,\" he said.\n\"This is supposed to be a plan for government, not an Oscar acceptance speech,\" he added.\n\"People in Northern Ireland, whether they are waiting for a consultant appointment or need support with the cost of childcare or any of the other pressing challenges, deserve real delivery.\"\nThe programme for government comes just over a year since the Northern Ireland Executive reformed in February 2024.\nA draft version of the programme, an 88-page document entitled Our Plan: Doing What Matters Most, was unveiled last September before an eight-week public consultation.\nMore than 1,400 responses were received in the consultation process for the draft programme for government, the first and deputy first ministers said.\nO'Neill said there was \"broad support\" for the proposals put forward, but they have also \"listened to the views of the public\".\nLittle-Pengelly said that as a result they have added \"commitments to address poverty and to support our ageing population\".\nThe Secretary of State for Northern Ireland, Hilary Benn, welcomed the executive's agreement on the plan.\nHe described it as \"an important moment for the people of Northern Ireland\" and said the programme \"recognises the scale of the challenges facing public services, and a long-term strategic vision, together with political stability, is crucial\".\nHe added that the UK government \"is committed to being an active partner\" to the executive in implementing the plans.\nO'Neill described as a \"process issue\" a last-minute postponement of the executive meeting to agree the programme for government.\nA scheduled meeting was pulled on Wednesday after Alliance Party minister Andrew Muir said he wanted more time to review the final document.\nHe characterised it as a \"storm in a teacup\", but the Social Democratic and Labour Party (SDLP) described the further delay as a \"farce\".\nSpeaking to reporters about the postponement, O'Neill said: \"We had a process issue which we needed to work our way through, and we've got through that, and now we have unanimous agreement.\n\"I think the public at home would be more interested to know what our priorities are, and how realistic they are, and how we're going to deliver upon them.\"\nLittle-Pengelly said there are \"many different views\" across a four-party coalition and they have tried to work in a way that \"maximizes consensus\".\nCiaran Molloy, a member of Unite the Union's retired members branch, said ministers need to put \"something into effect\" to tackle poverty and to support older people, adding that some older people are \"really struggling\".\n\"All of this is just talk unless they come up with figures and we've heard this before from local politicians,\" he told the BBC at the Belfast protest.\n\"Their priorities should be people in poor positions, especially older people who have contributed for decades towards public finances.\n\"We'll be making sure we'll be putting a serious amount of pressure on them to come up with realistic proposals to deal with these issues.\"\nIt has been some time since a Stormont executive agreed a finalised programme for government.\nThe last time an executive managed to get one over the line was during the assembly's fourth term between 2011 and 2015.\nHere's a timeline of events since then:\nNovember 2011: Executive led by Peter Robinson and Martin McGuinness publishes a draft programme for government for consultation\nMarch 2012: Programme for government agreed by the executive and endorsed by the assembly\nMay 2016: Following an assembly election, a new executive is formed, led by Arlene Foster and Martin McGuinness\nMay 2016: The executive publishes a draft framework for the programme for government\nJanuary 2017: Deputy First Minister Martin McGuinness resigns, triggering the collapse of the executive before a programme for government was formally agreed\nJanuary 2017 - January 2020: Northern Ireland's power-sharing institutions suspended\nJanuary 2020: New executive formed, led by Arlene Foster and Michelle O'Neill\nFebruary 2020: Arrival of Covid-19 pandemic delays work on a programme for government\nJanuary 2021: Public consultation period opens on new draft programme for government\nFebruary 2022: Paul Givan, now first minister, resigns in protest over post-Brexit trading agreements, once again bringing down the Executive\nFebruary 2024: Executive restored, led by Michelle O'Neill and Emma Little-Pengelly\nSeptember 2024: Draft programme for government published\nFebruary 2025: Executive endorses programme for government", "url": "https://www.bbc.co.uk/news/articles/c5y4eneqpkgo"}