{"authors": ["Rumeana Jahangir", "Ian Shoesmith", "www.facebook.com"], "date_download": "2025-04-26 06:39:22", "date_modify": "2025-04-26 06:39:22", "date_publish": "2025-03-02 15:53:21", "description": "A 44-year-old woman has been arrested on suspicion of arson with intent to endanger life, say police.", "filename": "news_articles_c5y02ekxg95o_1745649562.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8ee4/live/a9868b20-f786-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y02ekxg95o_1745649562.html", "title": "Girl, 4, dies after suspected arson attack", "title_page": "Girl, 4, dies after suspected arson attack at house - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A four-year-old girl has died following a suspected arson attack at a house in Manchester, police have said.\nThe child was found seriously injured by firefighters who brought her out of the property in the Rusholme area of the city at about 12:30 GMT.\nShe was taken to hospital where she was later pronounced dead, Greater Manchester Police (GMP) said.\nA 44-year-old woman, who police said was known to the child, has since been arrested on suspicion of arson with intent to endanger life.\nDet Ch Insp Charlotte Whalley said: \"This awful incident has seen the tragic death of a young girl, and I would like to send my condolences to her friends and family.\n\"A woman has been arrested and I can confirm that she is known to the child.\n\"There is no wider threat to the community and no-one else is currently being sought in connection with the investigation.\"\nShe said the emergency services \"did their utmost best\" to save the little girl after the fire on Gateshead Close.\nFirefighters were able to quickly extinguish the blaze, police said.\nInvestigators will now \"leave no stone unturned\" as they try to establish what happened, Det Ch Insp Whalley added.\nGMP has appealed for anyone with information to contact them.\nBen Levy, area manager at Greater Manchester Fire and Rescue Service (GMFRS), said crews from four stations had attended the scene.\n\"I want to pass on the condolences of everyone at Greater Manchester Fire and Rescue Service to the family and friends of the young girl who tragically lost her life following this incident,\" he said.\n\"Our thoughts are with them during this sad and difficult time.\"\nMr Levy said GMFRS would now work closely with police on the investigation.", "url": "https://www.bbc.co.uk/news/articles/c5y02ekxg95o"}