{"authors": ["Lucy Wallis", "www.facebook.com"], "date_download": "2025-04-26 06:14:32", "date_modify": "2025-04-26 06:14:32", "date_publish": "2025-03-02 01:02:23", "description": "Jo Ward, of West Midlands Police, has helped solve more than 50 murders, but one suspect is still to be caught.", "filename": "news_articles_cgj55vz317lo_1745648072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d501/live/2d138360-f496-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj55vz317lo_1745648072.html", "title": "Brothel murder: 'Why I'm determined to crack my only unsolved case'", "title_page": "Brothel murder: 'Why I'm determined to crack my only unsolved case' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The crime scene was a bloodbath. The victim, stabbed multiple times, had tried to defend himself. In the process, the suspect is also thought to have lost blood.\nThe attacker is still at large.\n\"It's quite a frustrating case,\" says Jo Ward, crime scene coordinator at West Midlands Police, \"because I don't actually think I've had a case that has not been solved in my 27 years, so it doesn't sit right with me.\"\nJo has dealt with more than 50 murders, and is determined to track down the killer of her only unsolved case - an investigation featured in the new BBC series of Forensics: The Real CSI.\nOn 9 February 2022, Jo was called to investigate the murder of a Chinese national, Jinming Zhang, 41, in a flat in Digbeth, Birmingham.\nIt quickly became apparent that the flat was being used as a brothel and the only witness to the brutal murder was a young Chinese woman who had hidden from the killer.\nOriginally the motive was thought to have been robbery - drawers on a bedside table had been pulled out and the property searched. But this could not be confirmed.\nAs crime scene coordinator, Jo was first on the scene, combing the property for evidence. Throughout the investigation, she worked alongside other specialists, such as blood pattern analysts and CCTV coordinators to try to piece together everything that happened that night.\nPolice believe the murder suspect may have sustained a hand injury in the frenzied attack.\nBlood pattern analysis, a technique used to interpret the bloodstains at the crime scene, helped to determine which of the blood spots in the flat may have belonged to the victim and which could have been the killer's.\nA blood trail was detected leading away from the property, and hours of CCTV footage was analysed to track the killer's escape route.\nThe suspect was a black man, between 5ft 2in (1.6m) and 5ft 5in (1.7m) tall and of slim build. CCTV also revealed he had an unusual way of walking.\nAlthough a DNA sample of the suspect was found, there were no matches on the national DNA database - which holds the DNA profiles of about 5.9 million people who have been arrested and cautioned, or convicted of a crime.\nThe case is still ongoing and no-one has yet been charged with the murder.\nThis would have been the end of the road 10 years ago, says Jo, but developments in forensics have meant familial DNA searches could also be used to try to identify potential biological relatives of the suspect who might also be on the national database.\n\"In the 27 years I've been in [the police], I've never carried out that kind of search before,\" says Jo.\nThe use of familial DNA search is not the only advancement in forensics, says Jo, the sample size needed to get a full DNA profile has also changed dramatically.\n\"Years ago we used to have to have quite a large amount of blood, or any other cellular material, to then actually get a DNA profile from it,\" she says. \"Nowadays, we literally need a pinprick size amount of blood or any other cellular material to be able to get a full profile.\"\nPreviously, as well as blood, the main DNA sources would have been cigarettes. But now, anything that has been in contact with the lips and saliva can also be swabbed to provide a DNA profile, says Jo, such as cans, bottles of drinks and, increasingly, vapes.\nCellular DNA can also be found when someone has simply touched an item, says Jo.\n\"Obviously when we have murders or sexual assaults, we're always looking at [whether] the item of clothing [has] been gripped by the offender at all during the assault. It's about targeting those areas to then see if you can obtain the DNA from that.\"\nBut while techniques have improved, getting answers is not always as fast as Jo would like.\n\"It's not like your CSI Miami,\" says Jo, \"where they get a DNA and literally within an hour they get results.\"\nShe is hopeful the identification process will speed up in the future.\n\"Obviously fingerprints have always been around and we recover them with powder and send them in,\" says Jo. \"I think digitally there will be something that comes up in the future where it's a simple, take a photo, scan straightway, and it'll be a quicker turnaround on identification.\"\nWalking into so many murder scenes over the years has had an impact on Jo. She gets the same feelings of apprehension approaching every scene, with butterflies in her stomach.\n\"Sometimes I feel sick after I've come out and not wanting to eat, but I've really got a mindset now where I think: 'Ok I can't change what's happened but what I can do is my utmost to then identify the person responsible and get justice for the victim and the family.'\"\nJo suffered with PTSD after a murder investigation in the past, which she says taught her a lot. To avoid a recurrence, she tries not to get emotionally attached.\n\"I think that's the mistake I made when I had my PTSD, that I was looking at all the family photographs,\" says Jo.\n\"It's a tough job but it's also a very rewarding job when you get that result and you identify the suspect and they get charged.\"\nWhen it comes to her only unsolved case, Jo is hoping someone will come forward after watching the programme and remember something that could lead to the identification of the suspect.\nShe also has a message for the killer: \"We need to get justice for the victim and the family. Do the right thing and come forward.\"\nForensics: The Real CSI - Murder in a Brothel is on Sunday 2 March at 21:00 GMT on BBC Two and from 06:00 GMT on BBC iPlayer\nDetails of help and support for victims of crime are available in the UK at BBC Action Line", "url": "https://www.bbc.co.uk/news/articles/cgj55vz317lo"}