{"authors": ["Alexandra Bassingham", "Joe Sims", "www.facebook.com"], "date_download": "2025-04-26 07:35:48", "date_modify": "2025-04-26 07:35:48", "date_publish": "2025-02-27 15:04:39", "description": "Mamas Bristol took home the 2024 community award for their work helping families reduce child costs.", "filename": "news_articles_c2417q9585ro_1745652948.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6576/live/3e21afd0-f390-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2417q9585ro_1745652948.html", "title": "Mamas Bristol 'absolutely floored' to win community award", "title_page": "Mamas Bristol 'absolutely floored' to win community award - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volunteers at a charity said they were 'absolutely floored' to win a BBC community award last year for helping families manage child costs.\nKelsey Booy, CEO of Mamas Bristol, was encouraging members of the public to vote for someone special in the BBC Make a Difference Awards this year.\nShe said: \"You're almost giving back to them by nominating them… it's not only the right thing but it's a great thing.\"\nNominations are now open for the awards and close on the 31 March at 17:00 BST.\nMs Booy said it was an amazing event to be a part of.\n\"We're a network supporting families to lower the cost of caring for their children, reducing household waste, costs, and try to create community spirit and cohesion.\n\"So to be given such an amazing award, was really special, she said.\n\"Just to hear you're nominated, regardless of whether you win the award or not, is so validating,\" she said.\n\"And to hear [our win] announced on a big screen… the smiles on our faces... just brilliant.\n\"It gives you such confidence and pride for the organisation that you're volunteering for and to hear the words of others, it's so wholesome, [and] heart-warming.\"\nShe asked anyone to take a couple of minutes to vote for an organisation that they believed in, or somebody who you can see does that bit more work.\n\"Because by taking the time to do that, you're validating them,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c2417q9585ro"}