{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 03:50:26", "date_modify": "2025-04-26 03:50:26", "date_publish": "2025-03-05 12:46:07", "description": "The events will bring \"an explosion of creativity and curiosity\" to Hull from 13 to 16 March.", "filename": "news_articles_c17qwywrdllo_1745639426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b2dd/live/d1fd85b0-00bc-11f0-8b2a-c7cde80a6cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qwywrdllo_1745639426.html", "title": "Colliderfest Hull - all you need to know about family festival", "title_page": "Colliderfest Hull - all you need to know about family festival - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull's first dedicated science and arts festival will feature light and sound shows, experiments and activities.\nColliderfest will be held in various locations in the city centre from 13 to 16 March and will include more than 80 events, according to organisers.\nAmong the highlights will be a large-scale light and sound installation in the city centre, a street-theatre show featuring a 13ft-tall sea creature puppet, and an appearance by Maddie Moate, who is known for her children's TV science shows.\nProf Mark Lorch, the festival director, described it as \"an explosion of creativity and curiosity, right in the heart of Hull\".\nIt has been dubbed a \"four-day extravaganza\" by the organisers and starts with two days of educational events for schools, followed by a weekend of science and arts-based activities, workshops and shows.\nOn the evenings of 14 and 15 March, a large-scale light and sound installation, called After Dark, will be staged in Queen Victoria Square, Whitefriargate, Beverley Gate and Trinity Square, between 18:30 and 21:30 GMT.\nA theatre performance, called Out of the Deep Blue, will feature a 13ft-tall sea giant puppet, which \"rises from the deep ocean and encounters a courageous little girl\". It will be staged at various times on Saturday and Sunday.\nOther events will include workshops, experiments involving exotic animals, state-of-the-art robotics, and activities looking at the environment and climate change.\nThe festival is being organised by Hull City Council, the Hull Maritime project, Hull Museums and Gallery, and the University of Hull.\nEvents will take place across several so-called Discovery Zones. The majority of venues are in the city centre and include Hull Minster, Ferens Art Gallery, Hull Truck Theatre, the Wilberforce Institute and the Streetlife Museum.\nSome of the events, such as the light installations and theatre shows, will take place in the streets. There will also be things to see and do at The Deep and in Humber Street.\nThe University of Hull is heavily involved, with talks and workshops taking place on Cottingham Road campus.", "url": "https://www.bbc.co.uk/news/articles/c17qwywrdllo"}