{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 04:21:25", "date_modify": "2025-04-26 04:21:25", "date_publish": "2025-03-03 14:48:07", "description": "Amy Hilton said she was devastated after seven-year-old Archie died in an incident near Benenden.", "filename": "news_articles_cqx0epv30vro_1745641285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fdb6/live/abacd960-f83d-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx0epv30vro_1745641285.html", "title": "Calls for caution after horse dies in tractor crash", "title_page": "Benenden: Calls for caution after horse dies in tractor crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A horse rider is urging road users to be more careful around animals after her stallion had to be put down after an incident involving a tractor.\nAmy Hilton said she wanted people to be better educated on how to approach horses on the road after her seven-year-old horse, Archie, died after a crash involving a tractor trailer in Iden Green, near Benenden, on 18 February.\nShe called the loss of Archie, who she had ridden since he was two, \"devastating\".\nMore than 170 dangerous traffic incidents involving horses were reported in Kent in 2024, according to The British Horse Society.\nMs Hilton said: \"Archie didn't do anything wrong, and for him to be injured like that, I felt like I had let him down.\n\"It has been really, really tough. He was my best friend and I lost him.\"\nShe added: \"I want people to know that when they see a horse and rider on the road then they should slow down.\"\nMs Hilton said she was riding Archie down a country lane when she heard a tractor approaching from behind.\nAfter realising the tractor was not slowing down, she dismounted and took Archie to the side of the road to try and avoid the vehicle.\nMs Hilton said Archie's back leg was struck by the tractor, which failed to stop at the scene.\nAfter taking Archie back to the stables and calling a vet, she was told that his leg was too badly injured to operate on and he would have to be put down.\nKent Police said officers were flagged down at the scene of the incident and enquiries were ongoing.\nThe number of dangerous traffic incidents involving horses in Kent increased by 10% in 2024, with more than 170 reported, according to The British Horse Society.", "url": "https://www.bbc.co.uk/news/articles/cqx0epv30vro"}