{"authors": ["Steven McKenzie", "www.facebook.com"], "date_download": "2025-05-19 15:20:44", "date_modify": "2025-05-19 15:20:44", "date_publish": "2015-02-17 01:07:30", "description": "A spooky weather effect, which in the past was thought to be a supernatural creature, is photographed in the Scottish mountains but what is the story behind it?", "filename": "news_uk-scotland-highlands-islands-31447148_1747668044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81052000/jpg/_81052725_imgp4020.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-31447148_1747668044.html", "title": "Shades of grey: What is the brocken spectre?", "title_page": "Shades of grey: What is the brocken spectre? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A spooky weather effect, which in the past was thought to be a supernatural creature, has been photographed in the Scottish mountains. But what is the story behind the brocken spectre?\nThe myth describes him as a Scottish Big Foot, said to loom large in shifting grey cloud on the UK's second highest mountain.\nThe Big Grey Man of Ben Macdui first came to prominence in the 1920s during a dinner speech at an annual gathering of the Cairngorm Club in Aberdeen.\nIts honorary president, the highly respected mountaineer Prof John Norman Collie, told of a frightening experience on Ben Macdui in the Cairngorms 35 years earlier.\nProf Collie was climbing alone in snow and mist when he heard crunching sounds, as if he was being followed by something large and ominous. Prof Collie turned and fled.\nAnother climber A M Kellas, a lecturer and veteran of Himalayan ascents, later told Prof Collie of similar terrifying experience on the Scottish peak.\nOther mountaineers came forward to say they had not just heard but seen the Big Grey Man.\nThe sightings have a scientific explanation called the brocken spectre.\nThe spectre can often appear larger than the person observing it, giving the impression of some kind of giant grey creature.\nThe term brocken spectre originates in Germany. The Brocken is the highest peak in the Harz Mountains.\nThere was a listening post on the summit during the Cold War when the mountain formed part of East Germany.\nThe Brocken is cloud or mist-covered for 300 days a year, according to travel website Germany is Wunderbar, and wrapped in old superstitions and fairytales involving witches.", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-31447148"}