{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:42", "date_modify": "2025-05-19 15:30:42", "date_publish": "2015-02-13 19:26:55", "description": "A mother killed herself and young son while gripped with \"paranoia\" her ex-boyfriend was \"hunting\" her down, an inquest hears.", "filename": "news_uk-england-lancashire-31462634_1747668642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/76953000/jpg/_76953780_angelhudson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-lancashire-31462634_1747668642.html", "title": "'Paranoid' mum killed herself and son in Euxton home", "title_page": "'Paranoid' mum killed herself and son in Euxton home - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A mother killed herself and her 22-month-old son while gripped with \"paranoia\" her ex-boyfriend was \"hunting\" her, an inquest has heard.\nAngel Hudson, 26, and Arthur Hudson-Cardy were found in a car at their home in Euxton, Chorley, Lancashire.\nPreston Coroner's Court heard both died from carbon monoxide poisoning.\nThe inquest heard a suicide note said she feared for her safety because of ex Wayne Cardy but he said he was just trying to find out where they were.\nThe mother and son were found in the back seat of her car in their garage last August, months after going missing in Devon.\nMs Hudson had repeatedly moved around the country and changed her mobile phone each month in the belief her ex-boyfriend was trying to find her.\nBut Mr Cardy told the inquest of his former partner's \"increasingly odd\" behaviour before they split up, three weeks after their son was born.\nThe court heard there was no evidence Mr Cardy had threatened or harmed either mother or son.\nMiss Hudson, who had changed her name by deed poll from Katie Howe, moved from the family home in Basingstoke to live with her father in Teignmouth, Devon, in November 2012.\nShe then left to live in Norfolk, before moving to Euxton in January of last year, using a different name, Sam Stone, before she was found dead with her son on 13 August.\nMr Cardy had reported them missing months earlier to police, which the inquest heard was \"entirely appropriate\", and had also tried to contact his ex through the courts 13 times to get access to his son.", "url": "https://www.bbc.com/news/uk-england-lancashire-31462634"}