{"authors": ["Jacqueline Howard", "Sarah Rainsford", "www.facebook.com"], "date_download": "2025-04-26 03:47:22", "date_modify": "2025-04-26 03:47:22", "date_publish": "2025-03-04 19:02:54", "description": "The Vatican said Pope Francis spent the night on \"non-invasive mechanical ventilation\".", "filename": "news_articles_cly28dj107qo_1745639242.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8c08/live/b2d423b0-f928-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly28dj107qo_1745639242.html", "title": "Pope well-rested after respiratory failure, Vatican says", "title_page": "Pope 'well-rested' after respiratory failure, Vatican says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pope Francis was well-rested and woke up just after 08:00 local time (07:00 GMT) on Wednesday, the Vatican said.\nThe Vatican said the Pontiff - who has been in hospital since February to receive treatment for pneumonia - spent the night on \"non-invasive mechanical ventilation\" and is now back on a high-flow oxygen mask.\nHe is free from fever, \"always alert, co-operative with therapies and well-oriented\", the Vatican said in a statement. On Tuesday evening, they had said the Pope was stable after suffering two episodes of respiratory failure the day before.\nMeanwhile, the Pope's traditional Wednesday audience with Catholics has been cancelled for the third week.\nThe Vatican has published a text instead, but it contains no current references and appears to have been written some time ago.\nThe Pope will also be unable to participate in events planned to mark Ash Wednesday which is the first day of Lent, the six-week period that leads up to Easter.\nIn Rome, Catholics will take part in a procession to the Santa Sabina Basilica where the Pope would normally attend and say mass. This year the service will be taken instead by one of the Cardinals.\nHe does not have any planned visitors and there is no mention of him doing any work in hospital, even reading, as there was previously.\nAfter Monday's episodes, the Pope had begun using an oxygen mask and ventilator to assist his breathing.\nIt was the second time the mechanical intervention had been used, after spending two days on the ventilator following an \"isolated\" breathing crisis involving vomiting on Friday, the Vatican said.\nIn Tuesday's update, the Holy See said Pope Francis had switched back to high-flow oxygen therapy.\nDuring the day, he alternated prayer and rest. On Tuesday morning, he received the Eucharist, it added.\nHe has been unable to deliver his traditional Angelus prayer in person on each of the last three Sundays.\nThe 88-year-old was admitted to hospital on 14 February after experiencing breathing difficulties for several days.\nHe was first treated for bronchitis before being diagnosed with pneumonia in both lungs.\nThe pontiff is particularly susceptible to pneumonia, an infection of the lungs that can be caused by bacteria, viruses or fungi, after he contracted pleurisy – an inflammation of the lungs – as a young man and had a partial lung removal.\nVatican sources stress, as they have all along, that the Pope's condition remains complex – his doctors remain cautious - and he is not out of danger.", "url": "https://www.bbc.co.uk/news/articles/cly28dj107qo"}