{"authors": ["Beth Cruse", "www.facebook.com"], "date_download": "2025-04-26 08:02:41", "date_modify": "2025-04-26 08:02:41", "date_publish": "2025-02-26 16:54:29", "description": "Graham Trinder, 57, was killed by armed police in 2020 following a drunken row with a neighbour.", "filename": "news_articles_c9q4j9rrrnzo_1745654561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3eb1/live/4f135800-f455-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q4j9rrrnzo_1745654561.html", "title": "Swindon man was holding air rifle when shot by police", "title_page": "Swindon man was holding air rifle when shot by police - inquest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who was killed by armed police following a drunken row with a neighbour had fetched an air rifle before he was shot, an inquest has heard.\nGraham Trinder, 57, sustained a single gunshot wound to the chest in the early hours of 8 November, 2020 on Summers Street in Swindon.\nHe had been drinking with neighbours when a dispute broke out shortly before 02:00 GMT between him and Martin Stewart, which resulted in Mr Trinder fetching an air rifle from his home, an inquest jury has been told.\nWiltshire and Swindon Coroner's Court heard Mr Trinder, known as Tommy, was challenged twice by police to put down his weapon before he was shot.\nHe was pronounced dead at the scene, the court heard.\nThe court heard an unmarked Wiltshire Police car was first to arrive on the scene.\nAn officer, known only as AL/1 left the vehicle and told Mr Tinder to put down the .22 weapon.\nIn a series of written statements read to the court, neighbours of Mr Trinder described events leading up to and after the shooting.\n\"The police officer got out of his car, at which point Graham was outside his house with the air rifle pointing down,\" neighbour Matthew Mills said.\n\"The police officer was stood near the bonnet of his car and he removed his gun and then said 'armed police, please put your weapon down'. \"\nMr Mills said Mr Trinder then swore at the officer, who responded by repeating the request to put the gun down.\n\"There was no talking to Graham and the police officer only gave him two options,\" Mr Mills said.\n\"He told him who he was, and then told him who he was again, and by the time the police officer finished his sentence he fired his gun.\"", "url": "https://www.bbc.co.uk/news/articles/c9q4j9rrrnzo"}