{"authors": ["Emily Coady-Stemp", "Huw Oxburgh", "www.facebook.com"], "date_download": "2025-04-26 06:36:31", "date_modify": "2025-04-26 06:36:31", "date_publish": "2025-02-27 06:02:37", "description": "Southern Housing has informed residents about its plans to refurbish Four Courts in St Leonards.", "filename": "news_articles_c5y267v6vv4o_1745649391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29d2/live/4a1b38b0-f4e9-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y267v6vv4o_1745649391.html", "title": "St Leonards: Plans to demolish and redevelop social housing site", "title_page": "St Leonards: Plans to demolish and redevelop social housing site - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A housing provider has announced plans to demolish and redevelop social housing properties in East Sussex.\nSouthern Housing has informed St Leonards residents about its plans to refurbish Four Courts in Stonehouse Drive – a 1960s social housing scheme comprising Bevin Court, Roosevelt Court, Kennedy Court and Churchill Court.\nResidents in the high-rise flats say they have \"nowhere to go\" and are calling on Southern Housing to find them suitable accommodation.\nSouthern Housing said the current design and layout of the apartments did not meet modern mobility standards, and redevelopment would mean it could \"better serve the needs of current and future residents\".\nCarol Prowse, a resident at Bevin Court, said she was \"in limbo\".\n\"We agree it's not fit for purpose, but I would like them to come up with a list of properties that are vacant and tell us where we can go,\" she said.\n\"If they can't meet our needs, they can pull the block apart around me.\"\nSouthern Housing said it planned to relocate residents over the next few years.\nThe company said those living in Bevin Court would be moved first and expected to be living in new social housing by March 2026, according to the Local Democracy Reporting Service.\nSimon Lee, a Bevin Court resident and secretary of the Hastings Area Southern Housing Tenants Association, said: \"People who have been here for a long time are rightly anxious.\n\"More could be done to make this less painful. Southern Housing have come at it like a bull in a China shop.\"", "url": "https://www.bbc.co.uk/news/articles/c5y267v6vv4o"}