{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:02:15", "date_modify": "2025-05-19 15:02:15", "date_publish": "2015-02-03 10:22:18", "description": "A railway line, closed by a landslip between Warwickshire and Oxfordshire, is expected to stay shut for \"several weeks\", Network Rail say.", "filename": "news_uk-england-31109281_1747666935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80732000/jpg/_80732912_landslide3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-31109281_1747666935.html", "title": "Landslip on Chiltern Line: Rail route 'shut for weeks'", "title_page": "Landslip on Chiltern Line: Rail route 'shut for weeks' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A railway line closed by a landslip between Warwickshire and Oxfordshire is expected to stay shut for several weeks, Network Rail has said.\nAn estimated 350,000 tonnes of earth slipped at Harbury Tunnel on Saturday, closing the Chiltern Line between Leamington Spa and Banbury.\nIt affects Chiltern services between London and the West Midlands.\nNetwork Rail said the landslide was still moving and repairs could only be carried out once the area is safe.\nIt said engineers were on site and remote sensors had been set up to monitor the earthworks.\nMark Carne, chief executive of Network Rail, said: \"This is a very deep cutting built back in Brunel's day, which we have been repairing for some time.\"\nHarbury Tunnel was the scene of a similar landslip last year.\nRail campaigner Hugh Jaeger, a former London Underground worker, said he believed that in opting to monitor the land rather than close the line and carry out extensive repairs in 2014, Network Rail had \"postponed the inevitable\".\nHe said the geology in the area was \"inherently nasty\".\nNetwork Rail said stabilisation work had been under way at the site when the latest landslip occurred.", "url": "https://www.bbc.com/news/uk-england-31109281"}