{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:18:41", "date_modify": "2025-04-26 06:18:41", "date_publish": "2025-03-01 07:22:27", "description": "The charity is calling for recruits to patrol beaches in Portsmouth over the summer.", "filename": "news_articles_cvgeq5mq01eo_1745648321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2216/live/64f124f0-f670-11ef-a0b8-b99c31813411.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgeq5mq01eo_1745648321.html", "title": "RNLI on the lookout for new Portsmouth lifeguards", "title_page": "RNLI on the lookout for new Portsmouth lifeguards - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Royal National Lifeboat Institution (RNLI) wants to recruit lifeguards to patrol beaches in Portsmouth over the summer.\nApplicants should be able to swim 400m in under seven and a half minutes, run 200m on a beach under 40 seconds and swim 25m in 50 seconds, it said.\nThe charity said Southsea Beach was particularly popular with locals and tourists, attracting windsurfers, paddleboarders and open water swimmers year-round.\nTom Ward, lead lifeguard supervisor, said the lifeguards were \"at the forefront\" of the RNLI's lifesaving work.\nAnyone applying needs to be aged 16 or over on the day of their assessment and hold a National Vocational Beach Lifeguard Qualification.\nThe roles last for the summer season but many lifeguards use the comprehensive training as a springboard to a career in emergency or public services or to find jobs abroad, said the charity.\nMr Ward said it was a \"rewarding and varied job\", adding: \"No two days are the same.\n\"There is so much opportunity for progression in the role and you make a huge difference in your community by preventing potentially life-threatening situations.\n\"We are looking for people willing to learn and put their training into action to make the right decision if someone's life is in danger.\"", "url": "https://www.bbc.co.uk/news/articles/cvgeq5mq01eo"}