{"authors": ["David Deans", "www.facebook.com"], "date_download": "2025-04-26 07:50:41", "date_modify": "2025-04-26 07:50:41", "date_publish": "2025-02-25 15:37:55", "description": "Cutting Britain's spending on aid to fund defence could be a strategic error, Plaid Cymru said.", "filename": "news_articles_cy7xgxmg0jdo_1745653841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/05df/live/13f07e30-f386-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xgxmg0jdo_1745653841.html", "title": "Cutting aid for defence moral mistake", "title_page": "Cutting aid for defence moral mistake - Plaid - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cutting Britain's spending on international aid to fund defence could be a strategic error, Plaid Cymru has said.\nOn Tuesday Prime Minister Sir Keir Starmer set out plans to increase defence spending to 2.5% of national income by 2027.\nLiz Saville Roberts, Plaid's Westminster leader, raised fears it could allow China to step in and boost its own global dominance.\nSir Keir said it was \"not a decision I wanted to make\" but his government's first duty was to \"keep the country safe\".\nThe move has been welcomed by the Conservatives, while the Liberal Democrats called for talks to spend 3% of gross domestic product (GDP) on defence as soon as possible.\nUS President Trump has been urging European countries to spend more on defence amid a push to end the war in Ukraine.\nSir Keir said the boost in defence spending could only be funded through \"extremely difficult and painful choices\".\nThe aid budget would be reduced from 0.5% to 0.3% of GDP by 2027, with the UK spending £13.4bn more on defence every year from 2027.\nIn the Commons Liz Saville Roberts, who leads Plaid's four MPs in the UK Parliament, said her party stood firm \"with the need to safeguard Ukraine sovereignty\".\nRecalling comments from David Lammy to the Guardian that US cuts to foreign aid could allow China to boost its influence, the MP added: \"Given the importance that overseas aid plays in preventing conflict, building democracy and curbing warmongering tyrants - and to paraphrase his foreign secretary - surely this too is a massive strategic and moral mistake?\"\nSir Keir replied that it was a moment \"where we have to step up\".\n\"Everybody in this house would wish that wasn't the situation. We've had a peace dividend for many years - that has come to an end.\"\n\"Our first duty is to keep the country safe,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cy7xgxmg0jdo"}