{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:48", "date_modify": "2025-05-19 15:37:48", "date_publish": "2015-02-13 12:11:33", "description": "Adele and Coldplay collaborator Paul Epworth is named producer of the year by the Music Producers Guild, automatically winning a Brit Award in the process.", "filename": "news_entertainment-arts-31451886_1747669068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80985000/jpg/_80985526_mpg_epworth.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31451886_1747669068.html", "title": "Producer Paul Epworth wins third Brit Award", "title_page": "Producer Paul Epworth wins third Brit Award - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paul Epworth, who has worked with stars from Paul McCartney to Adele, has been named producer of the year by the Music Producers Guild for a third time.\nHis win meant he automatically received the Brit Award for best producer, which was also presented at the guild's ceremony in London on Thursday.\nMeanwhile, ex-Eurythmic Dave Stewart was honoured with an outstanding contribution to music award.\nDisco legend Giorgio Moroder and Blur's Damon Albarn also received prizes.\nBut the top award went to Epworth, who has produced tracks for the likes of Coldplay, U2, Primal Scream, Bloc Party and Plan B.\nHe first won the accolade in 2010 following the release of Florence and the Machine's Lungs. In 2013, he won for his work on Adele's Bond theme Skyfall, among other hits.\nThe past year has seen him work with Lana Del Ray and FKA Twigs as well as Coldplay and U2.\nThe other nominees were Goldrapp's Alison Goldfrapp and Will Gregory; Flood, who collaborated with Foals and Depeche Mode; and Jake Gosling, who worked on Ed's Sheeran's million-selling X.\nEpworth told the BBC he felt \"a bit lucky\" to win again.\n\"It feels slightly weird to have won it for a third time and I definitely don't feel justified this year because the Goldfrapp record is incredible, Flood is someone I have looked up to for 25 years and Jake Gosling is someone who has had an incredibly successful year making hits both here and around the world,\" he said.\nIn other categories, former Blur frontman Damon Albarn received the award for inspiration, while Giorgio Moroder won the innovation prize.", "url": "https://www.bbc.com/news/entertainment-arts-31451886"}