{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:08:03", "date_modify": "2025-05-19 15:08:03", "date_publish": "2015-02-12 18:49:23", "description": "The chief constable of South Yorkshire Police at the time of Hillsborough said if anyone was to blame for the disaster it was \"drunken ticketless\" fans, the inquests are told.", "filename": "news_uk-england-merseyside-31445513_1747667283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80520000/jpg/_80520350_77198528.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-merseyside-31445513_1747667283.html", "title": "Hillsborough inquests: Police chief criticised 'drunken ticketless' fans", "title_page": "Hillsborough inquests: Police chief criticised 'drunken ticketless' fans - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The chief constable of South Yorkshire Police at the time of the Hillsborough disaster told officers if anyone was to blame it was \"drunken ticketless\" fans.\nThe comments by Peter Wright were revealed in minutes from a South Yorkshire Police Federation meeting, held four days after the 1989 tragedy.\nThey were read to the inquests jury during evidence from Paul Middup, who was then the federation's secretary.\nNinety-six Liverpool fans died after the FA Cup semi-final terrace crush.\nMr Middup was quoted in several newspapers in the days following the 15 April 1989 disaster, claiming some supporters at the Liverpool versus Nottingham Forest match had been \"tanked up\".\nHe was also quoted in an edition of The Sun, headlined The Truth, which claimed some fans had picked the pockets of the dead and urinated on police officers.\nMr Middup denied having a \"co-ordinated strategy with senior officers\" so that he would give briefings to allow them to distance themselves from the allegations.\nHe told the court he was just repeating what distressed officers had told him in the hours after the disaster.\nAnd he stood by his claims that a contributory cause of the disaster was a minority of fans, some of whom he said did not have tickets and turned up late.\nThe jury heard a meeting of the Police Federation took place at the Pickwick restaurant in Sheffield on 19 April. Much time was spent discussing what had happened four days earlier.\nThe minutes recorded that Mr Wright had joined the meeting part of the way through.\nThe jury heard the chief constable told officers the force was preparing a defence.\n\"We have got to prepare a rock solid story,\" he was quoted as saying.\n\"Centrally, we are working tremendously hard on the history and saga of Hillsborough.\n\"Once we have the history we can then produce the facts.\"", "url": "https://www.bbc.com/news/uk-england-merseyside-31445513"}