{"authors": ["Simon Thake", "www.facebook.com"], "date_download": "2025-04-26 03:59:12", "date_modify": "2025-04-26 03:59:12", "date_publish": "2025-03-04 06:12:35", "description": "Sheffield Hallam sees a 36% drop in international student numbers over three years.", "filename": "news_articles_c3rnp2vd717o_1745639952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c74b/live/9afeccd0-f81b-11ef-8698-4bc02966d858.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnp2vd717o_1745639952.html", "title": "Sheffield international students fall a 'worrying trend', say firms", "title_page": "Sheffield international students fall a 'worrying trend', say firms - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Business owners in Sheffield say the falling number of international students in the city is a \"worrying trend\".\nUniversity of Sheffield figures show it has seen a 25% drop in international students over the last three years, while Sheffield Hallam has seen a 36% fall.\nCurrent international students have told the BBC they feel \"uncertain\" about their long-term future in the UK.\nJerry Cheung, managing director of property firm New Era Development, says he is \"deeply concerned\" about how \"friends and colleagues\" are affected by the latest figures.\nRao Yan, Sheffield operations manager for international delivery company Hungry Panda, says she has seen a revenue fall of about 40% as most of their customers are Chinese and Malaysian students.\n\"It's greater here than other cities where the drop for the company is just 20%,\" she says.\n\"It's a worrying trend. A lot of Chinese restaurants could close.\"\nKelvin Quik, owner of China Red Restaurant and the bubble tea café ALS Gongcha says he has felt a \"deep impact\".\n\"We just don't see international students around now. I've had to make changes with more corporate events to keep going,\" he says.\nMr Quik, who has targeted his businesses towards East Asian students, says he will not be expanding further.\nAccording to the University of Sheffield, international students from the 2022/23 cohort brought a net economic benefit of £771m across all parliamentary constituencies in Sheffield, and £914m in South Yorkshire.\nIn the current academic year 2024/25, there are 4,000 international students enrolled at Sheffield Hallam University.\nThat compares with 4,805 in 2023/24 and 6,272 in 2022/23.\nThe University of Sheffield has seen a similar drop in numbers.\nIn 2022/23 there were 10,101 international students enrolled. That figure fell to 10,010 in 2023/24.\nThis year there are currently 7,546 international students enrolled.\nStudents have told the BBC there are a range of reasons for the fall.\nKiara Delgado, from Peru, studies international relations at the University of Sheffield.\n\"We are looking for educational excellence, when the University (of Sheffield) fell out of the top 100 in the world ranking, suddenly it's less an attractive option,\" she says.\nHajar Amrhar is from Morocco but grew up in Saudi Arabia.\n\"As an international student you are welcomed for the money but I don't feel welcome to stay,\" she says.\n\"There are constant changes with the policies and that is extremely stressful.\n\"I invested £24,000 in fees but I might have to go back home.\"\nIn 2023 the previous government announced foreign postgraduate students on non-research courses would no longer be able to bring family members to the UK, under new immigration curbs.\nHares Jamil, from Pakistan, is studying childhood education.\nHe says: \"We've seen riots against immigrants in the last year and international students have been caught up in that.\n\"It's really uncertain times.\"\nDespite the fall in numbers, local leaders have reiterated their support for international students in South Yorkshire.\nA statement, coordinated by Sheffield Hallam University and the University of Sheffield, has been signed by both university vice-chancellors, the mayor of South Yorkshire and Sheffield MPs, as well as leaders from the NHS, council and businesses.\nIt says: \"We are proud that, each year, students from more than 150 countries choose to study at our city's two universities and colleges and make our region their home.\n\"We are grateful for the impact international students have on our communities, from supporting our local economy, to volunteering for our region's charities and causes.\n\"Not only do they work in our hospitals, schools and businesses, they enrich everyone's lives through sharing their global perspectives, cultures and ideas.\"\nFor some Sheffield business owners the downfall has meant a rethink in their target audience.\nDong Jen Lee owns a storage company, a North Chinese BBQ restaurant and a Hong Kong café. He admits that he \"used to be busy\".\n\"One year ago I got quite nervous so I made a decision to look for local people and not just international students.\"\nMr Lee says he is \"amending\" his menu accordingly.\n\"My restaurant is full of spicy food so I'm changing the taste, less spice and more sweet and sour.\"", "url": "https://www.bbc.co.uk/news/articles/c3rnp2vd717o"}