{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:19:09", "date_modify": "2025-04-26 04:19:09", "date_publish": "2025-03-04 06:21:28", "description": "The £60,000 is for Bright Beginnings, which runs a children's centre and literacy programmes.", "filename": "news_articles_cp8vydky28go_1745641149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f000/live/969111a0-f84b-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8vydky28go_1745641149.html", "title": "Cash boost for development of Guernsey's children's services", "title_page": "Cash boost for development of Guernsey's children's services  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity has received a £60,000 government grant to help fund the future of children's services in Guernsey.\nBright Beginnings, based in St Sampson's, runs a children's centre for families and a nursery, preschool and literacy programme for children up to age four.\nThe States said the cash injection would ensure the charity's \"financial sustainability\".\nDeputy Marc Leadbeater, Vice-President of the Committee Health & Social Care (HSC) said the grant would \"support the charity in the crucial work that they do.\"\nThe funding also marked the start of a new partnership between HSC and the third sector to help develop future children's services on the island, officials said.\nBright Beginnings works to support families with free antenatal classes, support groups and therapeutic work.\nStaff also receive referrals from other providers, including health visitors, midwives, doctors and social workers.\nDeputy Heidi Soulsby, political lead for Guernsey's charity sector, said the charity was well placed to help the States develop future children's services.\nShe said: \"We now have an opportunity to consider what we want services to look like going forward so that they can best support our children and families.\n\"This is a discussion we need to have with organisations like Bright Beginnings, on a co-design basis, given their expertise and passion for the work they do.\"\nThe next stage would then be to look and whether \"there's an opportunity to commission some of these services to meet the needs of our community in the most efficient and impactful way\", she said.\nWelcoming the funding, Bright Beginnings' chair of board of directors Rachel Copeland said staff were \"looking forward to working in partnership with the States of Guernsey to explore the further development of services\".", "url": "https://www.bbc.co.uk/news/articles/cp8vydky28go"}