{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:27", "date_modify": "2025-05-19 15:36:27", "date_publish": "2015-02-09 18:47:35", "description": "The solicitor for one of three men wrongly convicted of killing a Cardiff prostitute said Home Secretary Theresa May is to order an investigation into the collapse of the UK's biggest police corruption trial.", "filename": "news_uk-wales-31319660_1747668987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/57063000/jpg/_57063426__57056884_4ezqbs5r-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-31319660_1747668987.html", "title": "Lynette White: Corruption trial collapse investigation", "title_page": "Lynette White: Corruption trial collapse investigation - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Just why the UK's biggest police corruption trial collapsed will be the focus of an investigation ordered by the Home Secretary, says the solicitor for one of the men wrongly convicted of killing a Cardiff prostitute.\nLynette White was stabbed more than 50 times in 1988 in the Cardiff docklands flat where she worked.\nThe quashed convictions later led to the £30m corruption case in 2011.\nThe Home Office said it would make an announcement shortly.\nLynette, 20, was murdered on St Valentine's Day 1988 at the flat in Butetown, where she took clients.\nTony Paris, Yusef Abdullahi and Stephen Miller - who became known as the Cardiff Three - were wrongly jailed for life in 1990 for the murder and freed in 1992 after their convictions were quashed.\nIn 2003 new DNA technology led South Wales Police to Ms White's real killer - Jeffrey Gafoor. He confessed to stabbing her in a row over £30.\nTwelve former South Wales Police officers were charged with perverting the course of justice - but the trial of eight of them collapsed in 2011.", "url": "https://www.bbc.com/news/uk-wales-31319660"}