{"authors": ["Galya Dimitrova", "Carla Buckingham", "www.facebook.com"], "date_download": "2025-04-26 06:18:49", "date_modify": "2025-04-26 06:18:49", "date_publish": "2025-03-01 07:17:57", "description": "The Hockey Writers' Club have given Nick Irvine the Graham Wilson Award for helping to popularise the sport.", "filename": "news_articles_c4gp7wv0njjo_1745648329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e267/live/19119b20-f367-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gp7wv0njjo_1745648329.html", "title": "Bloxham hockey commentator honoured for services to media", "title_page": "Bloxham hockey commentator honoured for services to media - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A TV commentator says he is \"absolutely delighted\" to receive an award for his long-standing hockey media coverage.\nThe Hockey Writers' Club (HWC) presented Nick Irvine, 72, who lives in Bloxham, Oxfordshire, with the Graham Wilson Award.\nThe award, named after the late hockey journalist, is presented annually to an individual who had demonstrated \"exceptional\" skills and dedication in the field of hockey media.\nMr Irvine said that while he wanted to be a voice for hockey \"the game belongs to the players\".\nHe began as a volunteer ahead of the 1986 World Cup in London, after which he put his name forward as a regional TV commentator for a domestic league game following Team GB winning gold in Seoul in 1988.\nMr Irvine has since covered Commonwealth Games, Olympic Games and World Cups.\nHWC said his \"distinctive commentary style has not only enhanced the viewing experience but has also played a crucial role in popularising hockey across Europe and beyond\".\nMr Irvine said he was \"absolutely delighted\" to receive the accolade that bears the name of Graham Wilson.\n\"He was a good friend of mine, a very fine journalist and an even better man who did great things getting hockey into the national media,\" he said.\nMr Irvine called it \"the family sport\".\n\"You can play it all through your life, ... we also have walking hockey for those who find mobility being an issue.\n\"It really is a cradle-to-grave operation and it's something we're very proud of within the sport.\"\nHe cited launching the National Hockey League for men as one of his proudest moments.\nAlthough Mr Irvine is known as \"the voice of hockey\", he admitted he \"absolutely hates it\".\n\"I want to be a voice for hockey for sure, but the game belongs to the players,\" he said.\n\"Whatever I've done for hockey pales in significance against what hockey's done for me.\n\"I'm fully aware that my time in the commentary seat is beginning to come to an end.\n\"But while people keep saying nice things about me and this accolade is certainly one of those, then I'm tempted just to keep going a little bit longer.\"", "url": "https://www.bbc.co.uk/news/articles/c4gp7wv0njjo"}