{"authors": ["Peter Hoskins and Kelly Ng", "www.facebook.com"], "date_download": "2025-04-26 03:38:57", "date_modify": "2025-04-26 03:38:57", "date_publish": "2025-03-04 22:13:05", "description": "A key meeting has begun to revive China's lagging economy, which is now facing a trade war with the US.", "filename": "news_articles_c8x4vj8rj9wo_1745638737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b908/live/1a0c1b80-f96c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x4vj8rj9wo_1745638737.html", "title": "China sets growth target of \"around 5%\" as it reels from Trump tariffs", "title_page": "China sets growth target of \"around 5%\" as it reels from Trump tariffs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "China has set an economic growth target for this year of \"around 5%\" and pledged to pump billions of dollars into its ailing economy, which is now facing a trade war with the US.\nIts leaders unveiled the plan as thousands of delegates attend the National People's Congress, a rubber-stamp parliament, which passes decisions already made behind closed doors.\nBut the week-long gathering is closely watched for clues on Beijing's policy changes - and this year is more significant than most.\nPresident Xi Jinping had already been battling persistently low consumption, a property crisis and unemployment, before Donald Trump's new 10% levy on Chinese imports came into effect on Tuesday.\nThis follows the 10% tariff imposed in early February, taking the total US levy to 20%. And it hits what has been a rare bright spot for the Chinese economy: exports.\nBeijing hit back almost immediately on Tuesday, just as it did last month. It announced retaliatory action that included 10%-15% tariffs on certain agriculture imports from the US. This is key because China is the biggest market for these goods, such as American corn, wheat and soybeans.\nAt the opening of this week's meeting, known as Two Sessions, China vowed to make domestic demand the \"main engine and anchor\" of its economic growth.\nBeijing was able to meet its 5% target for the last two years but growth was driven by strong exports, which resulted in a nearly trillion-dollar record trade surplus.\nRepeating that is going to be much harder this year.\n\"If the tariffs linger, Chinese exports to the US could drop by a quarter to a third,\" said Harry Murphy Cruise, head of China economics at Moody's Analytics.\nBeijing is going to have to rely more than ever on domestic spending to achieve 5% growth - but that has been one of its biggest challenges.\nOn Wednesday, Chinese Premier Li Qiang said consumption has been sluggish and pledged to \"vigorously boost\" household demand.\n\"Domestically, the foundation for China's sustained economic recovery and growth is not strong enough.\"\n\"Internationally, changes unseen in a century are unfolding across the world at a faster pace,\" Li said, as he noted the rise of protectionism around the world.\nBeijing has already rolled out schemes to encourage its people to spend more, including allowing them to trade in and replace consumer goods like kitchen appliances, cars, phones and electronic devices.\nThe government now aims to put more money into ordinary Chinese people's pockets and help cut the country's reliance on exports and investment.\nBeijing's plans include issuing 1.3 trillion yuan ($179bn; £140bn) in special treasury bonds this year to help fund its stimulus measures. Local governments will also be allowed to increase the amount of money they borrow to 4.4 trillion yuan, up from 3.9 trillion yuan, according to the annual \"Work Report\".\nIn a rare move, Beijing raised its fiscal deficit - the difference between the government's spending and revenue - by one percentage point to 4% of gross domestic product (GDP), the highest level in decades.\nThe hike signals Beijing's commitment to increase spending to shore up growth. It has long sought to keep the deficit at or below 3% of GDP to demonstrate fiscal discipline.\nIt also announced plans to create more than 12 million jobs in cities, setting a target for urban unemployment at around 5.5% for 2025. The figure stood at 5.1% last year.\nThe government also pledged to provide more support to high-tech industries, restore stability in the property market, and expand elderly care programmes for its ageing population.\nWhether these measures will be enough to boost consumption is the key question.\nHarsh pandemic-era restrictions along with a prolonged real estate crisis and a government crackdown on tech and finance companies have fuelled pessimism among Chinese people. And a weak social safety net means savings have become especially crucial in case of unexpected out-of-pocket expenses.\nBut China's leadership is optimistic. CPCC spokesman Liu Jieyi told reporters ahead of the session that while the economy was facing challenges such as low demand, it was \"important to recognise that China's economic fundamentals are stable, there are many advantages, resilience is strong, and potential is significant\".", "url": "https://www.bbc.co.uk/news/articles/c8x4vj8rj9wo"}