{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 03:40:03", "date_modify": "2025-04-26 03:40:03", "date_publish": "2025-03-05 10:31:57", "description": "Thanet District Council said plans for the venue include a rooftop bar, drama school and nursery.", "filename": "news_articles_ce307epr2wyo_1745638803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b972/live/33188d80-f9a2-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce307epr2wyo_1745638803.html", "title": "Kent: Contractor found for Margate Winter Gardens restoration", "title_page": "Kent: Contractor found for Margate Winter Gardens restoration - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to restore a Grade-II listed theatre and entertainment venue have moved a step closer after a company was identified to take on the project.\nMargate's Winter Gardens, which has been closed since August 2022, is set to become a \"sustainable and profitable multi-use space\", with a rooftop bar, a drama school, learning centre and nursery.\nThanet District Council (TDC) said Westwood One Theatre, which previously renovated the Granville Theatre in Ramsgate, is set to carry out the refurbishment.\nRuth Duckworth, TDC cabinet member for regeneration, said it was a \"positive step\" towards bringing the site back into use.\nMs Duckworth added: \"We have always understood that local people are passionate about the role of the Winter Gardens as a cultural landmark in Margate and the wider district.\"\nCarved into a cliffside, the Winter Gardens opened in 1911 and in its heyday it hosted major acts such as The Beatles and Laurel and Hardy.\nThe building closed in August 2022 when former management firm Your Leisure handed back its lease to the council following financial losses.\nA search for a new operator for the venue began in November 2023.\nTDC cabinet members will consider the plans, which also propose giving £80,000 to Westwood One Theatre to support works, at a meeting on 20 March.\nThe council added that, following further preparatory works and due diligence checks, it would consider a £4 million grant for refurbishment works.\nA spokesperson for Westwood One Theatre said the project \"has the potential to be a very exciting new chapter for the Winter Gardens and for Margate\".", "url": "https://www.bbc.co.uk/news/articles/ce307epr2wyo"}