{"authors": ["Allan Watkiss", "www.facebook.com"], "date_download": "2025-04-26 03:45:09", "date_modify": "2025-04-26 03:45:09", "date_publish": "2025-03-05 06:23:19", "description": "The Hull and East Yorkshire Combined Authority will be led by an elected mayor.", "filename": "news_articles_crewn95y8d4o_1745639109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1d91/live/a8fbb120-f903-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crewn95y8d4o_1745639109.html", "title": "Historic first meeting for new Hull and East Yorkshire authority", "title_page": "Historic first meeting for new Hull and East Yorkshire authority - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Hull and East Yorkshire Combined Authority is due to hold its first meeting on Wednesday.\nThe authority has been created after Hull City Council and East Riding of Yorkshire Council agreed a devolution deal with the government.\nIt will be led by an elected mayor, oversee a £400m investment fund, and take on powers from the government for transport.\nThe meeting starts at 09:30 GMT at the Ergo Centre, Bridgehead Business Park, Hessle. It will be open to attend and streamed online.\nVoters will go to the polls to elect the mayor on 1 May and elections will then take place every four years.\nSix candidates have so far put themselves forward to become the first elected mayor.\nUnder the devolution deal, Hull and East Yorkshire will be given an additional £13m a year from the government.\nIt will become the Local Transport Authority for the area, allowing it to develop a single strategic transport plan for the north bank of the Humber.\nThe inaugural meeting will be attended by board members as well as key officers from Hull City Council and East Riding of Yorkshire Council.\nThe agenda, external includes adopting the constitution, appointing officers and scheduling future meetings.\nBoth Hull City Council and East Riding of Yorkshire Council will continue their work as normal, independent of the combined authority.\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/crewn95y8d4o"}