{"authors": ["Chris Buckler and Jessica Lawrence", "www.facebook.com"], "date_download": "2025-04-26 07:04:49", "date_modify": "2025-04-26 07:04:49", "date_publish": "2025-02-28 06:36:26", "description": "Young Spencer is the alter-ego of Gareth Spence, and raps about drugs, paramilitaries and identity.", "filename": "news_articles_c3w1153zq94o_1745651089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df1d/live/47d9b8d0-f5c8-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w1153zq94o_1745651089.html", "title": "Is Young Spencer the Shankill's answer to Kneecap?", "title_page": "Is Young Spencer the Shankill's answer to Kneecap? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On the other side of west Belfast's peace wall, Young Spencer is rapping about subjects similar to Kneecap.\nLike them, he references drugs, paramilitaries and identity.\nBut - it's told from a totally different perspective to the famous (and infamous) Irish language hip-hop trio.\nWhile Kneecap wrap themselves in the Irish tricolour, in one of his songs Young Spencer continually talks about the red, white and blue of the Union flag.\nYet recently they shared a stage in the city and thousands of Kneecap's fans sang along with a man who describes himself as proud to be British.\nSpeaking to BBC Radio Ulster's Good Morning Ulster programme, the rapper said his appearance in front of the sold-out SSE Arena crowd was about bringing communities together based on more than just their religion.\n\"At the end of the day, to me that was more so about the unification of the city,\" he said.\n\"Yes, you're from the Falls and I'm from the Shankill, but it's more so about this city that we come from.\"\nHe said when the west Belfast rap trio first reached out about performing at their show in December there were nerves.\n\"There's just as much reason to say no as to say yes, and people would go 'why is that? It's the biggest opportunity of your life',\" he added.\n\"You are still driven with fear as much as you are driven with love, and you're still worried that people aren't receptive to where you're from and when you're talking about greatness and moving the city forward and the country forward as a whole.\n\"Maybe some people won't understand Kneecap and Young Spencer on the same stage until 20, 30 years' time, but that's ok because what's supposed to be understood will be understood.\"\nYoung Spencer is the alter-ego of Gareth Spence, who during the day works in a school in Belfast.\nHe was raised on the Shankill Road, which he admits saw guns, drugs, paramilitaries and division during many troubled years in Northern Ireland.\nBut living there has been in his own words \"a gift\" as well as a curse.\nNow 30 years old, he got into rapping as a teenager after getting therapy, and said personal traumas have influenced his music.\n\"We're all reporters... we have a responsibility to speak on these issues and be a voice for the voiceless and we will always be a voice for the city.\n\"Real change happens and I feel like that's what the show represented more than anything.\"\nGareth said we can't be shy of acknowledging that there is always likely to be division.\nYet he believes more is shared across Belfast's working-class areas.\n\"A lot of people have this sort of warped opinion of the communities that we're from too, whether it be the Shankill or the Falls, anywhere in Belfast because they go back to this troublesome period from 30 years ago and they still stay stuck in that.\n\"But you'll find unification in so many ways and so many different forms now in the city than you ever have.\"\nThe rapper said we're \"a lot closer to peace now than we've ever been\".\n\"There will always be division of some extent, we will never get away from that completely because that's life and not everybody likes each other and that's just plain and simple,\" he told Good Morning Ulster.\n\"But everybody has the right to be identified as who they identify as.\n\"My thing is that being a proud Protestant, being from Belfast, being from the Shankill, doesn't take away from them being proud Catholics and being from west Belfast and being from the Falls Road, why can't we unite?\"\nSo what's next for the Shankill's son?\n\"Inspire to inspire, motivate to motivate. Persisting with my passion when they chose to hate,\" he said.\n\"Respect is earned, resilience is where I was raised, opportunity comes, overcome and make your name. Determined and dedicated to making a change and that's P.R.O.D.\"\nYou can listen to the full interview with Young Spencer on Good Morning Ulster on Friday..", "url": "https://www.bbc.co.uk/news/articles/c3w1153zq94o"}