{"authors": ["David Spereall", "www.facebook.com"], "date_download": "2025-04-26 07:36:25", "date_modify": "2025-04-26 07:36:25", "date_publish": "2025-02-27 14:34:08", "description": "Vietnamese nationals Cong van Dinh, Hoa-Xuan Lau and Tien Nguyen admit Class B drug production.", "filename": "news_articles_c8d446dmvpdo_1745652985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/63c7/live/88c5ab40-f5bb-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d446dmvpdo_1745652985.html", "title": "Vietnamese nationals jailed for role in Huddersfield cannabis factory", "title_page": "Vietnamese nationals jailed for role in Huddersfield cannabis factory - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three men have been jailed for maintaining a cannabis factory described by a judge as the \"largest I've ever seen\" in his judicial career.\nVietnamese nationals Cong van Dinh, Hoa-Xuan Lau and Tien Nguyen were all paid to work at the factory, which was based at a warehouse in Huddersfield.\nPolice found more than 1,500 plants at the site when it was raided on 27 August last year, which had a collective street value of nearly £1m.\nAt Leeds Crown Court on Thursday, van Dinh was jailed for 22 months, Lau for 27 months and Nguyen for 32 months after they earlier admitted production of a Class B drug.\nEleven rooms in the building were dedicated to cultivating the drug, the court heard.\nThe court was told that the three men had a \"lesser role\" in keeping the factory running and were working \"on behalf of others\".\nIt was said that a while the operation did not amount to \"modern slavery\", a guard was placed outside the premises while the trio worked.\nMitigating for Lau, John Batchelor said that the 34-year-old had a live asylum application which would be affected by his conviction.\n\"In hindsight, he would never have taken the route he decided to take for his family and he pays the price for that,\" Mr Batchelor added.\nRepresenting 54-year-old Nguyen, Eleanor Mitten said the father-of-two had moved to the UK to pay off a debt he had accrued in Vietnam.\nHe had three previous convictions for drug-related offences.", "url": "https://www.bbc.co.uk/news/articles/c8d446dmvpdo"}