{"authors": ["Hugh Casswell", "www.facebook.com"], "date_download": "2025-04-26 03:56:13", "date_modify": "2025-04-26 03:56:13", "date_publish": "2025-03-04 15:16:13", "description": "The authority's share of bills will go up by 4.99% from April.", "filename": "news_articles_crkn6xnrr5vo_1745639773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b9e/live/fb6bd160-f903-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crkn6xnrr5vo_1745639773.html", "title": "Nottingham City Council confirms tax rise and budget cuts", "title_page": "Nottingham City Council confirms tax rise and budget cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nottingham City Council has confirmed a maximum council tax rise and a series of cuts.\nCouncillors met on Monday evening to confirm the authority's budget for the next financial year.\nIt will see the council's share of bills increase by 4.99% from April - the largest increase allowed by government without holding a local referendum.\nCouncil leader Neghat Khan said the authority was \"getting its house in order\" after years of financial problems.\nAmong the £18m of savings for 2025/26 are reviews of several adult social care services, such as direct payments, \"high-cost\" care packages, and eligibility for transport.\nThe largest savings, however, will be made through changes to some back-office functions, which the council said involved \"new ways of working and operational efficiencies\".\nIt also said it received a better-than-expected financial settlement from central government.\nKhan said the budget \"shows the council is now financially stable and that we are working towards becoming financially sustainable\".\n\"We know that the people of Nottingham want a council that gets the basics right and delivers the best local services we can afford, whilst also looking ahead so that the city can reach its full potential,\" she said.\nIn order to set a balanced budget, however, the council has used more than £20million of \"Exceptional Financial Support\" (EFS) - a process through which it uses the sale of assets to fund day-to-day spending, which councils are not usually allowed to do.\nKhan told the BBC she hopes the council will be able to balance its books without the need for EFS in two years' time.", "url": "https://www.bbc.co.uk/news/articles/crkn6xnrr5vo"}