{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:35:28", "date_modify": "2025-05-19 15:35:28", "date_publish": "2015-02-20 02:37:33", "description": "The UK and European diplomats are accused by peers of a \"catastrophic misreading\" of the mood in the Kremlin in the run-up to Ukraine crisis.", "filename": "news_uk-31545744_1747668928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81121000/jpg/_81121354_81121353.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31545744_1747668928.html", "title": "Ukraine: UK and EU 'badly misread' Russia", "title_page": "Ukraine: UK and EU 'badly misread' Russia - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The UK and the EU have been accused of a \"catastrophic misreading\" of the mood in the Kremlin in the run-up to the crisis in Ukraine.\nThe House of Lords EU committee claimed Europe \"sleepwalked\" into the crisis.\nThe EU had not realised the depth of Russian hostility to its plans for closer relations with Ukraine, it said.\nIt comes as French President Francois Hollande and German Chancellor Angela Merkel spoke about the crisis at a joint news conference in Paris.\nPrime Minister David Cameron said blame for what had happened in Ukraine \"lies absolutely squarely with Vladimir Putin and Russia\".\nThe committee's report, external said Britain had not been \"active or visible enough\" in dealing with the situation in Ukraine.\nIt blamed Foreign Office cuts, which it said led to fewer Russian experts working there, and less emphasis on analysis.\nA similar decline in EU foreign ministries had left them ill-equipped to formulate an \"authoritative response\" to the crisis, it said.\nThe report claimed that for too long the EU's relationship with Moscow had been based on the \"optimistic premise\" that Russia was on a trajectory to becoming a democratic country.\nThe result, it said, was a failure to appreciate the depth of Russian hostility when the EU opened talks aimed at establishing an \"association agreement\" with Ukraine in 2013.\nMr Cameron rejected claims Britain \"sleepwalked\" into the crisis in Ukraine.\nHe said: \"What we need to do now is deliver the strongest possible message to Putin and to Russia that what has happened is unacceptable.\n\"These ceasefires need to hold and if they don't, there'll be more consequences, more sanctions, more measures.\"\nMeanwhile Angela Merkel and Francois Hollande said the Minsk agreements should be implemented and the ceasefire observed between Ukrainian forces and pro-Russian rebels.\nMr Hollande said: \"With the [German] Chancellor we have never stopped speaking since the [September 2014] Minsk agreements and we are more convinced than ever that they must be applied - all the agreements, nothing but the agreements.\"\nMrs Merkel said the EU \"could raise the issue of sanctions\" if needed.\nThe report also follows comments from Defence Secretary Michael Fallon, who has warned Russian President Vladimir Putin poses a \"real and present danger\" to three Baltic states.\nHe was speaking after RAF jets were scrambled to escort two Russian military aircraft seen off the Cornwall coast on Wednesday.\nElsewhere, shelling was reported in several parts of eastern Ukraine on Thursday, including around the rebel-held city of Donetsk.\nThe Ukraine crisis began in November 2013 when pro-Moscow President Viktor Yanukovych's government abandoned the EU agreement in favour of stronger ties with Russia - prompting mass protests that eventually led to his downfall.\nSubsequent unrest in Ukraine's peninsula of Crimea led to its annexation by Russia - which is accused by the West of stoking further conflict between pro-Russian separatists and Ukrainian forces in the east of the country.\nCommittee chairman Lord Tugendhat said: \"The lack of robust analytical capacity, in both the UK and the EU, effectively led to a catastrophic misreading of the mood in the run-up to the crisis.\"\nThe UK had a particular responsibility to Ukraine because it was one of four signatories to the 1994 Budapest Memorandum which pledged to respect Ukraine's territorial integrity, the committee said.\nNeither Britain nor the EU had a strategic response on how to handle Russia for the long term, it added.\nA Foreign Office spokeswoman said no-one could have predicted the scale of the \"unjustifiable and illegal\" Russian intervention and it was for the people of Ukraine to decide on its relationship with the EU.\nIt said both leaders had agreed European member states must review the EU's response to the crisis, and should make clear to Russia that pro-Russian rebels must abide by the ceasefire.\nThe European Council is made up of the heads of the 28 EU member states and it sets the EU's overall political direction and priorities.\nThe US has also said it is \"deeply troubled\" by reports of continued fighting in eastern Ukraine.\nThe streets of Debaltseve were mostly deserted as we entered the city for the first time since intense fighting ended.\nThose civilians still holed up in the city, who have been without water, gas and electricity since early January, were slowly emerging from shelters to see what was left of their homes.\nBut there were more rebels than civilians, with convoys of victorious separatists returning from the recent clashes.\nEvidence of the fighting was littered across the roads and we spotted the bodies of two Ukrainian solders that had been lying in the cold for three days.\nPoroshenko bruised by army retreat", "url": "https://www.bbc.com/news/uk-31545744"}