{"authors": ["Graham Fraser", "www.facebook.com"], "date_download": "2025-05-19 15:30:24", "date_modify": "2025-05-19 15:30:24", "date_publish": "2015-02-05 17:36:38", "description": "Former stars of Rangers and Celtic get ready to play a charity match for \"inspirational\" West Lothian teenager Jak Trueman.", "filename": "news_uk-scotland-edinburgh-east-fife-31154565_1747668624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80734000/jpg/_80734747_jak-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-edinburgh-east-fife-31154565_1747668624.html", "title": "Ex-Rangers and Celtic stars to play in Jak Trueman game", "title_page": "Ex-Rangers and Celtic stars to play in Jak Trueman game - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former stars of Rangers and Celtic are getting ready to play in a charity match for \"inspirational\" teenager Jak Trueman.\nHearts goalkeeper Neil Alexander, a former player at Rangers, is helping to organise the game in Livingston on Sunday.\nNacho Novo, Marvin Andrews, Frank McAvennie and Mark Burchill will play.\nRangers fan Jak, 15, who suffered from a rare form of blood cancer, died on Monday.\nHe passed away a few days after attending a prom with his girlfriend Hannah Boyd that was organised for them by classmates.\nThe Mid Calder teenager, with the help of his mother Allison, sister Aimie and his girlfriend, documented his illness and treatment on a Facebook page called Jak's Journey, external.\nThe page has attracted nearly 40,000 Likes as people from around West Lothian and beyond were captivated by the teenager's fight against gamma delta T-cell lymphoma.\nMr Alexander, who featured in some posts on the website, said: \"What a brave and courageous boy, for someone who was faced with such an uncertain future.\n\"It was inspiring for me to see this boy of 15, his attitude and determination to try and beat this illness. What a lovely boy, and a lovely family. I am honoured to have known him. Hopefully he will be looking down with a smile on his face.\"\nThe Hearts goalkeeper visited Jak several times since he found out about his illness last August.\nThe game - for the Jak Trueman Challenge Cup - will take place at 14:00 on Sunday, 8 February at the Energy Assets Arena, home of Livingston FC.\nThe match will be between teachers from Jak's school - West Calder High - and the U-16s Mid Calder Colts, the team Jak played in goal for.\nThe money raised at the match will go to CLIC Sargent, the Edinburgh Sick Kids Foundation and Leukaemia & Lymphoma Research.\nAll three charities were close to Jak and his family throughout his fight against cancer.\nIn the past two weeks, Jak's supporters have raised over £54,000 for Leukaemia & Lymphoma Research, external alone.\nHis family have announced a celebration of Jak's life will take place on Tuesday, 10 February, at the Kirk of Calder church in Mid Calder. At Jak's request, those in attendance are urged to wear Rangers scarves.", "url": "https://www.bbc.com/news/uk-scotland-edinburgh-east-fife-31154565"}