{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:44:30", "date_modify": "2025-04-26 06:44:30", "date_publish": "2025-03-01 17:17:26", "description": "The man was found injured in Islington on Thursday and died the following day in hospital.", "filename": "news_articles_c1d4r6qkd24o_1745649870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2ea0/live/e27895a0-f6bd-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4r6qkd24o_1745649870.html", "title": "Islington: Three teenage girls charged over death of pensioner Fredi Rivero", "title_page": "Islington: Three teenage girls charged over death of pensioner Fredi Rivero - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three teenage girls have been charged with manslaughter over the death of a 75-year-old man.\nThe victim - identified as Fredi Rivero, 75 - was attacked on Seven Sisters Road, Islington, north London, at about 23:35 GMT on Thursday and died the following day in hospital.\nThe girls, aged 14, 16, and 17, were initially arrested on Thursday on suspicion of GBH by the Metropolitan Police.\nPolice added Mr Rivero's family were being supported by officers.\nA post-mortem examination will be arranged in due course.\nThe girls, who cannot be named because of their ages, are due to appear at Highbury Magistrates' Court on Monday.\nPolice previously said the victim was thought to be Bolivian.\nSupt Annmarie Cowley earlier said she knew the death would cause \"shock and very real concern\" in Holloway and the wider Islington area.\n\"I share those concerns, and I want to assure local people that a thorough police investigation is under way,\" she added.\nShe said there were additional police patrols in the area over the weekend and urged residents to speak to officers if they had information or concerns.", "url": "https://www.bbc.co.uk/news/articles/c1d4r6qkd24o"}