{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:10:56", "date_modify": "2025-04-26 04:10:56", "date_publish": "2025-03-04 19:28:01", "description": "An alleged \"sex slave\" of a group of men in Rochdale denies fabricating claims for a compensation bid.", "filename": "news_articles_cy5nwplww51o_1745640656.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5f27/live/5fede2b0-f920-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy5nwplww51o_1745640656.html", "title": "Alleged rape victim denies making up abuse claims", "title_page": "Rochdale: Alleged rape victim denies making up abuse claims  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An alleged \"sex slave\" of a group of men in Greater Manchester has denied she made up abuse allegations to \"bolster\" a compensation claim.\nThe complainant said she was raped on multiple occasions in Rochdale by former market trader Mohammed Zahid when she was aged 14 and 15.\nMr Zahid, 64, known on Rochdale Market as \"Bossman\", is said to have given her free underwear from his lingerie stall and also money, food and alcohol in the expectation of sex, Manchester's Minshull Street Crown Court heard.\nJurors heard the complainant, referred to as Girl A, was awarded a total of £27,500 from the Criminal Injuries Compensation Authority in the summer of 2018 after two men - not involved in the present trial - admitted sexually abusing her.\nMr Zahid, 64, of Station Road, Crumpsall, Manchester, denies multiple rapes of Girl A, along with multiple rapes of a second complainant, Girl B, when she was aged 13.\nGirl A, giving evidence from behind a screen, said police advised her to make a second claim involving a further 50 men she said had committed sexual offences against her as a child.\nShe told the court she rejected an offer of £22,000 on that claim.\nLisa Wilding QC, cross-examining, said: \"You have said, in effect, that's not enough.\"\nGirl A replied: \"Do you think £22,000 is enough for the abuse I have gone through, the heartache?\"\nMs Wilding said: \"Is this right, in your eyes because you got £27,500 for the two men that you should have a multiple of that for 50 men?\"\nThe complainant said she thought she would buy a car, a house, move away and live happily ever after.\nShe said the sum was \"not exactly living in the lap of luxury. I am not going to get much for £22,000\".\n\"I can't walk the streets where I live,\" she said.\n\"I'm doing this because they abused me. Nothing to do with money. It's to do with them abusing a child, a lot of them.\"\nMs Wilding said: \"On behalf of Mohammed Zahid, I suggest the account of things you say he has done to you is not accurate or truthful.\"\nGirl A denied this, and also rejected a suggestion that the idea for the allegations she made against Zahid had come from claims made by another girl against the defendant in 2007.\nMs Wilding put it to the complainant that she decided to \"add him in the mix\" when she outlined the details of her abuse claims to police in 2015 and 2016.\nGirl A said: \"I put him on the list because he abused me.\"\nAlso on trial for various sexual offences against both or either of the complainants are Naheem Akram, 48, of Manley, Road, Rochdale; Mohammed Shahzad, 43, of Beswicke Royds Street, Rochdale; Nisar Hussain, 43, of Newfield Close, Rochdale; Roheez Khan, 39, of Athole Street, Rochdale; Arfan Khan, 40, of Grouse Street, Rochdale; Mushtaq Ahmed, 66, of Corona Avenue, Oldham; and Kasir Bashir, 50, of Napier Street East, Oldham.\nThey are alleged to have plied the girls with alcohol, drugs and cigarettes they were expected to have sex with them and others whenever and wherever they wanted.", "url": "https://www.bbc.co.uk/news/articles/cy5nwplww51o"}