{"authors": ["Andrew Spence", "www.facebook.com"], "date_download": "2025-04-26 08:15:38", "date_modify": "2025-04-26 08:15:38", "date_publish": "2025-02-26 10:37:30", "description": "Hull City Council has authorised the use of a CPO if no agreement with land owners can be reached.", "filename": "news_articles_c5ymvj9vge2o_1745655338.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a83d/live/9a506580-f417-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymvj9vge2o_1745655338.html", "title": "Compulsory purchase for Hull regeneration project given go-ahead", "title_page": "Compulsory purchase for Hull regeneration project given go-ahead - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Land for a major new housing development on the bank of the River Hull will be compulsorily purchased if necessary, council leaders have said.\nThe East Bank Urban Village will see up to 850 homes and a promenade built on the eastern bank of the river.\nHull City Council owns about half the land set aside for the project and is seeking ownership of the rest.\nThe council's cabinet has authorised the use of a compulsory purchase order (CPO) if an agreement with landowners cannot be reached.\nSome of the land is privately owned and some belongs to Homes England.\nAccording to the Local Democracy Reporting Service, the cabinet has also consented to the start of early site work.\nThe money will come from the government's Levelling Up Fund.\nPaul Drake-Davis, portfolio holder for regeneration and housing, said he was \"very happy to get the ball rolling\" and added that it would be \"one of the biggest transformation schemes in Hull's history\".\nCouncil leader Mike Ross said the development would help Hull reach the new housing targets set by the government.\nEarlier this month, the council set out its plans to sign a 15-year deal with ECF – a partnership between Muse, Legal & General and Homes England – to be the lead developer for the project.\nECF chair Sir Michael Lyons said: \"East Bank Urban Village is an ambitious plan to deliver a dynamic and vibrant new neighbourhood.\n\"We'll work closely with communities as we progress to ensure the benefits of regeneration are felt at every level.\"", "url": "https://www.bbc.co.uk/news/articles/c5ymvj9vge2o"}