{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:07", "date_modify": "2025-05-19 15:34:07", "date_publish": "2015-01-29 21:36:28", "description": "A man admits falling asleep at the wheel seconds before his car crashed into another on the A92, killing the driver.", "filename": "news_uk-scotland-edinburgh-east-fife-31051270_1747668847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80662000/jpg/_80662609_dochertyadam1ldonald_edited-2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-edinburgh-east-fife-31051270_1747668847.html", "title": "Sleeping driver Adam Docherty caused fatal crash", "title_page": "Sleeping driver Adam Docherty caused fatal crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A man fell asleep at the wheel seconds before his car crashed into another, killing the driver.\nGeorge Izatt, 54, had been driving back from a fishing trip with friends at about 05:35 on 22 August 2010 when he was killed.\nAt the High Court in Edinburgh, Adam Docherty, 28, admitted causing death by careless driving on the A92 Glenrothes to Dundee road.\nSentence was deferred for background reports.\nThe crash also caused severe injury to passengers in both cars.\nThe court heard that Docherty had been \"seriously sleep deprived\" at the time of the crash.\nHe fell asleep while driving his car and crossed the central hazard lines colliding with the oncoming car driven by Mr Izatt, who was from Methil in Fife.\nA passenger in the other car had tried to warn its driver by saying: \"Look out George, that car's on the wrong side of the road.\"\nAfter the collision Docherty, from Kennoway in Fife, told police: \"I have no recollection of it. All I remember is leaving work, drop my mate off in Glenrothes.\n\"I went to Methil to pick up my cousin, then went to Asda in Glenrothes. The last thing I mind was leaving Asda in Glenrothes.\"\nThe court heard that Docherty was \"a hardworking and positive member of society\" but his work ethic had played a part in the offence.\nThe apprentice joiner also held down a part-time post as a bar supervisor at a nightclub and was involved with Army cadets.\nHe had been at the Barry Buddon camp in Angus that weekend and had done a shift at the club into the early hours of 22 August.\nHis cousin Patrick Docherty, who was in the car, said he remembered waking up and realising that the car was on the wrong side of the road.", "url": "https://www.bbc.com/news/uk-scotland-edinburgh-east-fife-31051270"}