{"authors": ["Andrea Pluck", "www.facebook.com"], "date_download": "2025-04-26 07:55:38", "date_modify": "2025-04-26 07:55:38", "date_publish": "2025-02-25 12:46:37", "description": "A 31-year-old is sent back to prison after he breaches a Sexual Harm Prevention Order (SHPO).", "filename": "news_articles_c93kg65dd5eo_1745654138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0fcd/live/bd172060-f2d5-11ef-9c1f-0b4ee7c29264.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kg65dd5eo_1745654138.html", "title": "Northampton sex offender jailed after using cleaning software", "title_page": "Northampton sex offender jailed after using cleaning software - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A sex offender was sent back to prison for 12 months after he breached his Sexual Harm Prevention Order (SHPO).\nJames Coombes, 31, of Northampton, was convicted in 2016 of causing/inciting a girl under 13 to engage in sexual activity and making indecent images of children.\nCoombes was placed on the Sex Offenders' Register, issued with a SHPO and subjected to unannounced visits from Northamptonshire Police\nOfficers visited his address on 10 February and found that he had used electronic cleaning software on his computer, which is prohibited under the SHPO, and had removed 4.3gb of data.\nHe was arrested and charged with breaching the SHPO, but Coombes said he had used the software to clear gaming files.\nThe 31-year-old later pleaded guilty at Northampton Magistrates' Court on 11 February and was sentenced to one year behind bars.\nDet Insp Hayley Thurston said: \"A year in prison may seem like a lot for using cleaning software but a breach is a breach, and we will always seek prison time when one occurs.\n\"I hope this result provides some reassurance to our communities as to how closely registered sex offenders are managed and monitored when they are released from prison.\"", "url": "https://www.bbc.co.uk/news/articles/c93kg65dd5eo"}