{"authors": ["Claire Savage", "www.facebook.com"], "date_download": "2025-05-19 15:30:51", "date_modify": "2025-05-19 15:30:51", "date_publish": "2015-02-22 01:23:59", "description": "Thousands of allegations of abuse and neglect of elderly people were made in England last year, the BBC learns.", "filename": "news_uk-31557790_1747668651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81141000/jpg/_81141537_012257837-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31557790_1747668651.html", "title": "Thousands of complaints made about elderly care in England", "title_page": "Thousands of complaints made about elderly care in England - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thousands of allegations of abuse and neglect of elderly people were made in England last year, the BBC has learned.\nSome 14,888 claims about the welfare of care home residents aged 65 and over in 2013-14 were reported to 74 councils, 5 live Investigates has found.\nRelatives say the system designed to handle such complaints is flawed and they often go unheeded.\nThe body representing senior social services managers says there needs to be more investment in care staff.\nAnyone is entitled to raise suspicions about a person's care, and local authorities are obliged to look at the claims.\nIf necessary, they launch what is known as a formal safeguarding investigation to decide what action should be taken.\nBut some families who have raised safeguarding concerns say the system is not working.\nIn West Sussex, 19 people died after suffering \"sub-optimal care\" at the Orchid View care home in Copthorne.\nThe problems at Orchid View came to light following a police investigation that started in 2011 - but in a two-year period before that, families and health workers had been raising concerns about the care in the home.\nA serious case review into the Orchid View scandal revealed there had been 20 separate safeguarding referrals. The home has since closed.\nA number of those concerns were substantiated but it was not until the police inquiry started that the decision was taken to shut the home.\nFamilies want to know why action was not taken sooner given that so many safeguarding investigations had taken place.\nLesley Lincoln said she complained constantly about the care given to her late mother, Enid Trodden.\nShe says she wrote letters raising concerns to health professionals, the Care Quality Commission and the council's safeguarding team but she says no-one saw it as a safeguarding issue.\n\"I felt I was tearing my hair out and nobody was listening,\" she said.\n\"It was only treated as a safeguarding alert after I raised the roof when she went into hospital,\" she says.\n\"It was only after my mother's death and the inquest, I realised there had been so many (safeguarding) referrals at Orchid View.\"\nIn a statement, West Sussex County Council said: \"We take all safeguarding concerns extremely seriously. We are working hard to reduce the likelihood of a repeat ever happening again and this includes work to implement all the recommendations of the serious case review.\"\nThe Local Government Ombudsman has also investigated cases where families have felt the safeguarding system has not worked.\nIn one case, the ombudsman found a council was at fault after its safeguarding team asked the home at the centre of an allegation of poor care to conduct its own safeguarding investigation.\nIn other cases the ombudsman found delays in launching safeguarding inquiries, poor investigations and that families had not been given information.\nSeventy-four councils out of 152 responded to the request by 5 live Investigates to state the number of safeguarding referrals they had received for people aged 65 and over in care homes - the first investigation of its kind.\nBetween them they reported that they had received 14,888 referrals. Of those, 4,523 - about one third - were substantiated. If all the councils approached had provided data, the overall figure would obviously be higher.\nDavid Pearson, president of the Association of Directors of Adult Social Services, said: \"Needs are rising as resources are falling. Adult social services have sustained a 26% reduction in funding since 2010.\n\"Prevention is better than cure and we need to ensure there is sufficient training and investment in care staff.\n\"It is crucial that we have sufficient social workers working with other professionals to carry out investigations.\"\nThe Department of Health called the abuse and neglect of vulnerable people \"deplorable\".\nA spokesman said the new Care Act which comes into law in April will give the Care Quality Commission greater powers to prosecute providers and company directors for unacceptable care and introduce new, tougher standards for inspecting care homes.\nThis report will be broadcast on Sunday, 22 February 2015 at 11:00 GMT on BBC Radio 5 live.\nYou can listen to other editions of 5 live Investigates on the BBC iPlayer.\nYou can contact 5 live Investigates by emailing goldberg@bbc.co.uk or comment on this story to @BBC5Live on Twitter, external.", "url": "https://www.bbc.com/news/uk-31557790"}