{"authors": ["Madeline Halpert", "www.facebook.com"], "date_download": "2025-04-26 07:42:27", "date_modify": "2025-04-26 07:42:27", "date_publish": "2025-02-26 20:13:24", "description": "Trump say wealthy investors will buy the visas and create jobs in the US, while helping pay off US debt.", "filename": "news_articles_cq5zgvdz2z0o_1745653347.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c27/live/6839a680-f47e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zgvdz2z0o_1745653347.html", "title": "Trump says $5m 'gold card' immigration idea will 'sell like crazy'", "title_page": "Trump says $5m 'gold card' immigration idea will 'sell like crazy' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "President Donald Trump has unveiled plans for selling a \"gold card\" visa for $5m (£3.9m) that will offer wealthy buyers permanent residency in the US and a path to citizenship.\nAt the first cabinet meeting of his current term, Trump told reporters that the visas would function similarly to green cards, which allow immigrants of varying incomes to live and work permanently in the US, but would go to \"high-level people\".\n\"The people that can pay $5m, they're going to create jobs,\" Trump said. \"It's going to sell like crazy. It's a bargain.\"\nCommerce Secretary Howard Lutnick, also at the meeting, said the gold visas would replace the current visa programme for foreign investors, but offered few details.\nDozens of countries around the world offer some sort of citizenship by investment programme, including several in Europe, like Portugal, which gives \"golden visas\", or permanent residency for foreigners who invest €500,000 ($524,000) into a qualifying fund.\nTrump said companies would use the golden visa programme to hire non-citizens to work for them in the US.\n\"We have to be able to get people in the country, and we want people that are productive people,\" Trump said.\nTypically, green card holders in the US can apply for citizenship after five years.\nTrump suggested revenue from the high-priced visas could be used to pay off US debt.\nLutnick said that the initiative will replace the EB-5 visa, which gives permanent residency to some foreigners who invest around $1m and create at least 10 full-time jobs in the US.\nSaying the EB-5 programme was \"poorly overseen and poorly executed\", Lutnick said the golden visas would be an improvement.\n\"We're going to make sure they're wonderful world-class global citizens,\" Lutnick said of future gold card applicants.\nIt was not immediately clear how the government would select recipients, if there were exclusions, or if there would be any cap on how many are issued.\nDuring the fiscal year of 2024, the State Department issued over 12,000 EB-5 visas, a record high for the programme.", "url": "https://www.bbc.co.uk/news/articles/cq5zgvdz2z0o"}