{"authors": ["Simon Thake", "www.facebook.com"], "date_download": "2025-04-26 03:45:17", "date_modify": "2025-04-26 03:45:17", "date_publish": "2025-03-05 06:21:11", "description": "Staff at St Leonard's Nursery in Norwood say they are \"shocked\" they will have to leave.", "filename": "news_articles_c4ge8kl14l2o_1745639117.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/55e3/live/c8bbf000-f904-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ge8kl14l2o_1745639117.html", "title": "Sheffield nursery faces closure after church eviction notice", "title_page": "Sheffield nursery faces closure after church eviction notice - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A long-standing Sheffield nursery faces closure, with staff saying they were being \"forced out\" by their church landlords.\nStaff at St Leonard's Nursery, at St Leonard's Church in Norwood, received an eviction notice on 10 February confirming they had 30 days to leave the premises.\nLynne Cottam, who has been the manager for 30 years, said: \"We're just hoping we can carry on, we are open to negotiation, we don't want this to be the end.\"\nThe Diocese of Sheffield said the parochial church council (PCC) \"remains open to further facilitated negotiation with the nursery owner\" with a meeting arranged for Wednesday 12 March to discuss the matter further.\nThe nursery first opened in 1995 and looks after 43 children aged between two and five.\nNichola Tomkins, assistant manager of the nursery, said the letter had caused a huge amount of \"shock\" and \"upset\".\n\"Staff are not sleeping, we can't believe we're being forced out,\" she said.\n\"This could cause massive upheaval to our children especially those with special educational needs, they need stability and structure.\"\nThe Diocese of Sheffield said: \"Over the years, the PCC has made significant efforts to accommodate the nursery, absorbing substantial costs for utilities, services and repairs that would typically be covered under a formal rental agreement.\n\"In 2016, and again in autumn 2024, the PCC sought to establish a formal agreement to ensure fair and sustainable arrangements, including necessary rent adjustments due to rising costs.\n\"Unfortunately, these efforts were not successfully progressed.\"\nMore than £1,000 has been raised through crowdfunding to help the nursery with legal costs to fight the decision.\nOn 23 February, Ms Cottam wrote to the Members of St Leonard's Church PCC appealing for them to reconsider the decision.\nShe said: \"I am reaching out as an employer of nearly 30 years to hopefully open communication and begin to unravel this difficult and highly upsetting situation.\"", "url": "https://www.bbc.co.uk/news/articles/c4ge8kl14l2o"}