{"authors": ["Trudi Harris", "www.facebook.com"], "date_download": "2025-04-26 06:34:25", "date_modify": "2025-04-26 06:34:25", "date_publish": "2025-02-27 06:28:27", "description": "The government said an additional £75m would be available from April.", "filename": "news_articles_cd0njml71k3o_1745649265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3d9b/live/d2a93b60-f44d-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0njml71k3o_1745649265.html", "title": "South West hospices to benefit from share of £25m funding boost", "title_page": "South West hospices to benefit from share of £25m funding boost - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hospices across the country are to benefit from £25m of government funding.\nThe cash, which will be given to at least 10 hospices in the West of England, can be spent on improving buildings, facilities and IT systems but not on staffing.\nWayne de Leeuw, from Dorothy House near Bradford on Avon in Wiltshire, said he was \"genuinely grateful\" but that its staffing costs would amount to £957,000 this year and it was being given only £297,000 as part of the funding.\nThe government said an additional £75m would be available from April.\nHospice care providers say the funding is welcome but nowhere near enough to cover rising costs and increasing demands on their services.\nMr de Leeuw said: \"We looked after 4,000 people last year and didn't charge for that, it's free... but [due to demand] we need to increase the amount of people we care for by 25% by 2048.\"\nHe said that without long-term funding, the £25m boost would not have the impact the government hopes for.\nDavid Slack, from St Margaret's Hospice in Somerset, said: \"We're delighted, but it costs us £15m a year to run our services in Yeovil, Taunton and in the community.\n\"We will be spending it on things like new IT equipment, replacing hot water tanks, and upgrading some of the facilities.\"", "url": "https://www.bbc.co.uk/news/articles/cd0njml71k3o"}