{"authors": ["Huw Thomas", "www.facebook.com"], "date_download": "2025-04-26 03:48:23", "date_modify": "2025-04-26 03:48:23", "date_publish": "2025-03-05 14:50:42", "description": "The company has failed to file its accounts on time and has started a \"consultation\" with staff.", "filename": "news_articles_c3rn9527n37o_1745639303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94f2/live/5b0fe3a0-f9cb-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rn9527n37o_1745639303.html", "title": "Griffiths: Financial review 'worrying' for construction workers", "title_page": "Griffiths: Financial review 'worrying' for construction workers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Welsh construction firm responsible for dualling the Heads of the Valleys road and building the 2010 Ryder Cup golf course in Newport says it is \"consulting\" staff following a financial review.\nAbergavenny-based Griffiths has failed to file its latest accounts on time and previously recorded four years of losses.\nIn a statement to Construction News, external, Griffiths, which is part of the Tarmac group, said a review of \"market conditions and financial performance\" had led it to discuss \"proposed changes\" with staff.\nThe Welsh government said the consultation was \"worrying news\" for workers and the local community.\nEstablished in 1968 by Alun Griffiths, the company is one of the best-known civil engineering and rail contractors in Wales and the west of England.\nThe business was sold to the Tarmac group in 2018 but continues to trade under the Griffiths brand. The latest available accounts from 2022 showed it employed around 900 people.\nA spokesperson for Griffiths said: \"We have carried out a comprehensive strategic review of the business in response to recent challenges faced by Griffiths, including market conditions and financial performance.\n\"Following this review, a consultation process has begun with employees. This will work through proposed changes with our employees and hear their feedback before any final decisions are made.\n\"We're committed to continuing to deliver for our customers and suppliers in line with our contractual obligations.\"", "url": "https://www.bbc.co.uk/news/articles/c3rn9527n37o"}