{"authors": ["Paul O'Gorman", "www.facebook.com"], "date_download": "2025-04-26 07:38:00", "date_modify": "2025-04-26 07:38:00", "date_publish": "2025-02-27 13:46:27", "description": "Chorley's council wants to make the town a top visitor attraction by 2030.", "filename": "news_articles_cx200x30pr1o_1745653080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b4cc/live/34422780-f50f-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx200x30pr1o_1745653080.html", "title": "'Chorley is the best of Lancashire in one place'", "title_page": "'Chorley is the best of Lancashire in one place' - council leader - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chorley has the best of Lancashire all in one place, the local council has said as it seeks to make the town a top visitor attraction by 2030.\nBosses have drawn up what they call a \"destination management plan\" for the town and the surrounding areas of countryside.\nCouncil leader Alistair Bradley said the authority would be working with local people and businesses to achieve its aim, adding: \"We need to speak up for Chorley\".\n\"Those of us who live here know how great it is, and other people come here plenty, but we want to see more of them,\" he said.\nBradley said Chorley already welcomed three million visitors a year, with 2,000 jobs relying on those people spending nearly £2m, but \"we think we can do more than that\".\n\"We're just happy if people come for a day, two days, spend a bit of time here in Chorley,\" he said.\n\"The number of people who go up Rivington alone is thousands in the summer.\n\"Chorley has a bit of everything that Lancashire has, whether it's hills and mountain biking and walking, quaint villages with nice pubs and paces to eat, shopping in the town centre, it's a great place.\"\nOne visitor from Wigan told BBC Radio Lancashire: \"It's only 20 minutes from Wigan and there's a nice shopping centre and the market's nice, but holidays? No I don't think so.\"\nBut Chorley resident, Barbara Snaylam, said: \"We've got everything now in Chorley, we've lovely markets and shops.\n\"They come from all over now, Burnley, Blackburn, all over, because the markets are really good.\"\nThe 78-year-old added: \"If you like countryside you could go up Rivington, Anglezark and all round there is lovely.\"", "url": "https://www.bbc.co.uk/news/articles/cx200x30pr1o"}