{"authors": ["Ben Marvell", "www.facebook.com"], "date_download": "2025-04-26 06:36:57", "date_modify": "2025-04-26 06:36:57", "date_publish": "2025-02-26 06:38:39", "description": "Cheltenham Paint Festival said the the loss of a site used by it was partly to blame for the move.", "filename": "news_articles_cq5zl7dqwweo_1745649417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c9ac/live/631495e0-f2c4-11ef-8f01-fb4843bea627.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zl7dqwweo_1745649417.html", "title": "Art Festival skips year ahead of 10th anniversary", "title_page": "Cheltenham Art Festival skips year ahead of 10th anniversary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The organiser of an acclaimed local street-art festival has announced that it won't be going ahead this year.\nIn a Facebook post, Cheltenham Paint Festival organiser Andy Dice Davies said that the cancellation was partly due to the dismantling of one of the festival's main sites.\nIt was announced in August last year that North Place car park would be demolished to make way for a new housing development just north of the town centre.\nBut Mr Dice Davies said that he he intends to bring the festival back for its 10th anniversary next year, but on a smaller scale.\nIn the social media post, he wrote that the location \"had been crucial to the festival's success and holds some great memories for myself and the team\".\n\"It's a huge loss to the Cheltenham Paint Festival and I'm currently working on something to replace it for future events,\" he said.\nHe added that \"due to the loss of this amazing spot and with our 10 year anniversary next year, I have decided to concentrate on next year's event and to not hold the festival this year\".\n\"I am intending on going back to our roots and hold a smaller jam though.\"", "url": "https://www.bbc.co.uk/news/articles/cq5zl7dqwweo"}