{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:54:12", "date_modify": "2025-04-26 07:54:12", "date_publish": "2025-02-25 13:41:13", "description": "York's historic walls are lit in blue and orange in tribute to confectioner Joseph Rowntree.", "filename": "news_articles_crrd09w2l0lo_1745654052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16e8/live/accda950-f374-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd09w2l0lo_1745654052.html", "title": "York city walls light tribute to philanthropist Joseph Rowntree", "title_page": "York city walls light tribute to philanthropist Joseph Rowntree - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "York's city walls have been lit up in blue and orange in tribute to philanthropist Joseph Rowntree on the 100th anniversary of his death.\nA successful confectionery businessman, Rowntree built the village of New Earswick in York to create affordable housing, donated Rowntree Park to the city and established the Joseph Rowntree Foundation to better understand the causes of social problems.\nThe display on Monday marked Rowntree's \"lasting impact\" on the place of his birth, City of York Council said.\nMichael Pavlovic, the council's executive member for housing, planning and safer communities, said: \"The lighting of the walls reminds us of his remarkable legacy and the values he instilled in York.\"\nUnder Rowntree's stewardship, his confectionery company's products became famous all over the world.\nBy 1923, it employed more than 7,000 people in York, according to The Rowntree Society, an educational charity based in York.\nHowever, the society - whose work is enabled by grant funding from the Joseph Rowntree Foundation, the Joseph Rowntree Charitable Trust, and the Joseph Rowntree Reform Trust - has acknowledged how the firm had earlier benefited from slavery and forced labour in its global supply chains.\nNick Smith, the society's executive director, said: \"The impact Joseph Rowntree had, particularly on York, is still felt today - both through the tangible assets he provided for us which still exist and with the example he gave in making life better for so many people.\"", "url": "https://www.bbc.co.uk/news/articles/crrd09w2l0lo"}