{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:43:46", "date_modify": "2025-04-26 03:43:46", "date_publish": "2025-03-05 08:17:04", "description": "The dogs appear to have been left at different times on a slope near a motorway bridge, the charity says.", "filename": "news_articles_c2lje24wlk9o_1745639026.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02c3/live/29357850-f998-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2lje24wlk9o_1745639026.html", "title": "Five dead dogs dumped on Lancashire country lane near M55 bridge", "title_page": "Five dead dogs dumped on Lancashire country lane near M55 bridge - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Five dead dogs, who were dumped on a country lane in Lancashire near a motorway bridge, \"were quite visible from the road\", a charity has said.\nA white Jack Russell terrier, a black Spaniel and a black and white puppy, were discovered lying in undergrowth not far from a bridge that goes over the M55 at Greenhalgh, Fylde, on 19 February by a member of the public who contacted the RSPCA.\nThe skeletal remains of two more dogs, whose breeds were not known, were discovered nearby by Animal Rescue Officer, Adam Wormwell.\nHe said the dogs were lying about three metres down a slope just past some wooden fencing, adding: \"It was a distressing sight to come across.\"\n\"Five deceased dogs found at the same location over a period of time is obviously a cause for concern and we're keen to find out how and why these animals came to be found like this,\" Mr Wormwell added.\nThe charity said it believed a male Jack Russell, called Chase according to his microchip, was dumped at the site on on Bradshaw Lane five to seven days before he was found.\nHis chip was registered to someone in Darlington but he had been rehomed by them, the RSPCA said.\nThe black Spaniel and the puppy, which was believed to be another Jack Russell, had both been at the scene longer.\nThe Spaniel was also microchipped but the details had not been registered.\nThe charity said none of the dogs had any obvious signs of injury and it was not known at this stage how they died.\nAnyone with information about the incident is asked to contact the RSPCA.", "url": "https://www.bbc.co.uk/news/articles/c2lje24wlk9o"}