{"authors": ["Imogen Foulkes", "www.facebook.com"], "date_download": "2025-04-26 04:07:29", "date_modify": "2025-04-26 04:07:29", "date_publish": "2025-03-03 00:03:49", "description": "Switzerland's already upmarket tourism sector is trying to attract more high rollers.", "filename": "news_articles_cq8yy09we1eo_1745640449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a0f/live/195a7090-f4ff-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq8yy09we1eo_1745640449.html", "title": "Switzerland targets rich tourists but at what cost?", "title_page": "Switzerland targets rich tourists but at what cost? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The world is a very insecure place right now - conflict, climate change, and fears of recession dominate the headlines. But for some people, things are going rather well - the wealthy.\nDespite the global turmoil, the number of billionaires in the world is growing and the personal wealth of each of them is increasing too.\nSo what to do with all that money? The growing trend for the ultimate luxury experience is a clue as to what the very rich are doing with their cash. For the tourist industry in particular, it's an opportunity.\nIn Switzerland, which has long cultivated a reputation for understated luxury, the number of five-star hotels is increasing faster than any other category. Many of them were built in the early 20th century - grand belle epoque palaces serving a then emerging class of privileged, primarily English tourists.\nToday, renovated to the highest standards, those hotels leave no guest's wish unmet. There are luxury spas, gourmet restaurants, and designer suites with panoramic views of the alps. Some offer \"ski butlers\" to ferry guests to and from the slopes, carry the skis, and even help put on their boots.\nKey markets are the US, the Gulf states, China and South East Asia. American guests in particular, Swiss hoteliers say, expect the full five-star treatment, including 24-hour room service, so that they can order food in the middle of the night.\nMeanwhile, China and India are emerging markets, where the first groups to travel from those two countries are among the wealthiest. Switzerland is very keen to get in at the start of that trend.\nBut the five-star offer comes with a hefty price tag, so where does that leave those who are not billionaires? Markus Berger of Switzerland Tourism says the strategy is not to focus solely on high-end guests, but to take a hard-headed look at the figures.\nStays at Swiss five-star hotels make up around 8% of all overnights, but the guests in them contribute at least 25% of Switzerland's total revenue from tourism.\n\"The numbers speak for themselves,\" says Mr Berger. \"The high economic significance justifies a commitment to luxury guests.\"\nWhat's more, he adds, Switzerland, with its high-wage, high-price economy, cannot compete with less expensive neighbours, particularly now that the Swiss franc is so strong.\n\"Switzerland has never tried to compete over prices,\" Mr Berger explains. \"There is always somewhere cheaper.\"\nInstead, the focus is on quality, service, and added value, like those ski butlers. In exchange, guests who come to five-star hotels also contribute a good deal to the rest of the economy, spending lavishly in the Michelin-starred restaurants and boutique shops that are also becoming a feature in a number of Swiss alpine resorts.\nBut it's not an entirely win-win situation. In some of Switzerland's most famous up-market resorts, like St Moritz or Zermatt, there are long-standing concerns that the focus on luxury is pricing locals out of the market.\nA common challenge is finding accommodation for the hundreds of hotel and restaurant staff needed to provide the five-star service.\nThey sometimes find themselves commuting, late at night when the cocktail bars and restaurants have finally closed, long journeys to other villages where the accommodation is affordable on a waiter's salary.\nMonika Bandi, who leads the Tourism Research Unit at Bern University's Centre for Regional Development, sees Switzerland's pitch to high-end guests as a fine balancing act. It's about \"quantity versus quality\", she says.\nMore tourists aren't necessarily better, she believes. Instead, higher spending by existing numbers can be positive.\nAnd, she adds, Switzerland needs to watch out for the \"tipping point, where the destinations really lose their character\".\nQuestions about a tipping point are currently being asked in the resort of Wengen, world famous for its Lauberhorn ski race, and its decades long connection with British skiers – the much-loved \"Down Hill Only\" ski club celebrated its 100th anniversary this year.\nAnd also this year, Wengen is opening its first ever five-star hotel, and there are plans too for a five-star complex of serviced \"hotel apartments\". They will be sold to wealthy tourists who want a luxury holiday home in the Alps, and they can also be rented out when the owners are absent.\nBy calling the project a hotel, it exploits a loophole in Switzerland's strict laws against the \"cold beds\" of holiday homes. In theory, the law limits them to no more than 20% of a resort's accommodation.\nThe Swiss Heritage Society has formally objected to the Wengen plans, because, claims spokesman Simon Weiss, the project is not really a hotel. \"It looks like a typical holiday home complex… there is no integration into the community.\"\nThe required public spaces that a hotel would have – a restaurant and a spa – are planned, but they will all be underground. The design priority, Mr Weiss fears, is for private luxury apartments that may be occupied for only a few weeks a year. \"The design is unacceptable,\" he adds.\nSome Wengen locals also have their doubts. \"It's not St Moritz here,\" one told Swiss media, adding \"Wengen is not posh\".\nWengen's tourism director Rolf Wegmüller agrees with that assessment, but says the trend towards luxury accommodation won't change the resort's character. \"We're not going to have guests walking around in fur coats all of a sudden,\" he says.\nWengen, he points out, is only accessible by train, so, unlike St Moritz, there will be no Bentleys or Rolls-Royces taking up parking spaces. Even if they could ostentatiously display their wealth, Mr Wegmüller believes \"our guests won't want to show off what they have\".\nThe resort also has visitors who come back year after year, contributing to the integration Mr Weiss worries about losing. \"Some families have been coming for generations,' says Mr Wegmüller. 'The locals know them, and that's good.\"\nAmong them are Brian Bollen, keen member of the Down Hill Only Club, who has been coming to Wengen for more than 50 years. He loves it, but does worry that some of \"the charm has gone from the place… it's over built\".\nBut most in Wengen, like Switzerland Tourism, see the investment in the alpine resorts as positive. These villages were, not much more than a century ago, very poor. A 19th English guide to the Swiss alps wrote that \"most of the children are beggars\".\nIn more recent years, the global trade rules limiting agricultural subsidies have forced many small alpine dairy farms to close. Tourism, winter and summer, is enormously important for the Swiss economy, especially for the mountain communities.\nAnd, as Mr Berger of Switzerland Tourism points out, while the five-star sector is growing, three-star hotels are still the biggest category. \"We have one to five-star [in Wengen],\" adds Mr Wegmüller. \"That's a good thing in a resort.\"\nAnd while the people with unlimited money to spend on luxury travel may still be in a tiny minority, their numbers, and their wealth, are growing. Switzerland's approach – not cheaper, but better, not more people, just richer – seems to be paying off.", "url": "https://www.bbc.co.uk/news/articles/cq8yy09we1eo"}