{"authors": ["Joe Campbell", "www.facebook.com"], "date_download": "2025-04-26 06:35:56", "date_modify": "2025-04-26 06:35:56", "date_publish": "2025-02-27 06:06:31", "description": "Unison warns plans to close three day centres could cost West Berkshire Council more in the long-term.", "filename": "news_articles_cr72eg4k9zmo_1745649356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7775/live/55715890-f474-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr72eg4k9zmo_1745649356.html", "title": "Berkshire day centre closures 'could cost more than it saves'", "title_page": "Berkshire day centre closures 'could cost more than it saves' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to close three day centres are likely to cost a council more money in the long-term, according to users and the union representing staff who work there.\nWest Berkshire Council has described the decision as a difficult one.\nIt blamed plans to shut sites in Calcot, Newbury and Hungerford as the result of \"exceptional circumstances\" and it would support those affected.\nBut Steve Barnes who became a quadriplegic, because of a neurological condition, said closing the sites was \"short-sighted.\"\nMr Barnes attends Greenfield House Resource Centre in Calcot one day a week.\nThe six hours he spends there is virtually his only break from the specially adapted room in the house he shares with his wife Jane.\n\"It does him the world of good and it does me the world of good,\" she explained.\n\"Without the centre, I'm socially isolated,\" said Mr Barnes.\n\"It brings together lots of different people, from different backgrounds, with different problems.\"\nHe said he worried that without the centre, the condition of many of those who join him there each week would deteriorate, having an impact on their mental health.\n\"They'll end up going to the NHS or social care. There will be displacement of costs to other areas,\" he added.\nUnison, the union representing staff at the three centres, said not only were its members worried for their own future, but also that of the people they cared for.\nSouth East Regional Official, Kieran Pearson, said the closures did not make sense: \"If these day centres are closed, we don't think the council will save much money at all and they will be throwing experienced and passionate staff out onto the streets.\"\nHe added that the timing was also wrong, coming just weeks before West Berkshire has to submit plans to Whitehall for a merger with neighbouring councils.\n\"There's a possibility that the corner is about to be turned for finance in local government and this is absolutely the wrong time to be closing services that are never likely to be brought back,\" he said.\nWest Berkshire Council said it would talk to those who use the centres and their families to help it prepare alternative plans for the future.\n\"Throughout this process we are committed to ensuring continuity of support for all individuals, and we will also provide the necessary support to our staff during this transition,\" a spokesperson said.", "url": "https://www.bbc.co.uk/news/articles/cr72eg4k9zmo"}