{"authors": ["Tristan Pascoe", "www.facebook.com"], "date_download": "2025-04-26 07:06:59", "date_modify": "2025-04-26 07:06:59", "date_publish": "2025-02-28 06:08:33", "description": "Lib Dem Vikki Slade says the \"wall of noise\" can be particularly intimidating for women MPs.", "filename": "news_articles_cy833k2mg28o_1745651219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b52b/live/c7531150-f50b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy833k2mg28o_1745651219.html", "title": "Dorset MP: Prime Minister's Questions too rowdy and intimidating", "title_page": "Dorset MP: Prime Minister's Questions too rowdy and intimidating - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Dorset MP elected in 2024 has said she prefers to stay away from Prime Minister's Questions in the House of Commons because it is too noisy and badly behaved.\nVikki Slade, Lib Dem MP for Mid Dorset and North Poole, said the \"wall of noise\" could be particularly intimidating for women MPs.\nShe said if she did not have a question for the PM, she would rather watch from her office than be in the chamber itself.\nIt comes as the MP's Commons Modernisation Committee is considering ways to crack down on rowdy behaviour in Parliament.\n\"The boo-yah I just find a bit crazy,\" Ms Slade said.\n\"Sometimes the atmosphere in there can be really quite unpleasant not really conducive to getting the outcomes that you want.\n\"You want answers to your questions, you want to hold people to account, you want to hear what's being delivered. Sometimes that's just not possible.\n\"It was daunting coming in the first time. It remains daunting and it remains overwhelming.\n\"For me, turn down the boisterousness, tone down the braying - that's not for me at all.\n\"I want to achieve stuff up here. I don't want to be boo-yah. That's not my thing.\"\nJessica Toale was elected as Labour MP for Bournemouth West last July, having previously served for several years on Westminster Council.\n\"I think it's important as elected representatives that we model the behaviour we'd like to see in society,\" she said.\n\"The chamber itself - I'd love to see it be a bit more respectful - supporting our colleagues.\n\"We've got something unique here. It's really unusual to have the opportunity to ask questions directly of the prime minister.\n\"And yes, bringing the tone down and making sure that answers are heard, making sure we are supportive of colleagues and not necessarily boisterous would definitely not only help to improve people's experience of it, but also ours in the chamber as well.\"", "url": "https://www.bbc.co.uk/news/articles/cy833k2mg28o"}