{"authors": ["David Humphreys", "www.facebook.com"], "date_download": "2025-04-26 08:08:37", "date_modify": "2025-04-26 08:08:37", "date_publish": "2025-02-26 13:31:33", "description": "Carl Bellis carried out unauthorised work on a protected beech tree outside his Liverpool home.", "filename": "news_articles_cly2n7vvgpno_1745654917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4bc8/live/e509e550-f440-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly2n7vvgpno_1745654917.html", "title": "Liverpool: West Derby man fined for cutting down tree worth £114,000", "title_page": "Liverpool: West Derby man fined for cutting down tree worth £114,000 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A father who said he chopped down a tree in his garden because a falling branch had narrowly missed his daughter has been fined for \"taking matters into his own hands\".\nCarl Bellis said the mature beech tree, worth more than £114,000, in West Derby, Liverpool, had also lifted paving flags creating a trip hazard and branches had damaged his car and guttering.\nBellis, of Sandfield Close, appeared at Liverpool Magistrates' Court after being charged with wilful destruction of a tree and was fined £1,100.\nHe was also ordered to pay a victim surcharge of £440 and costs of more than £1,000 were awarded to Liverpool City Council.\nThe case was brought by Liverpool City Council who alleged he was in contravention of a tree preservation order, which requires permission to make any amendments to protected trees from the local authority.\nThe court heard how in April 2024, Bellis, through a tree surgeon, contacted the city council for permission to remove a mature beech tree from outside his home as it had created a hazard for his family.\nHe claimed the tree had lifted paving flags outside his home creating a trip hazard, a branch had fallen in winds and damaged guttering, a branch had fallen damaging his car and another had fallen, narrowly missing his daughter.\nThese were rejected by the council on the basis of \"insufficient evidence\" and the authority said concerns could be addressed without destruction or removal of the tree.\nAfter being turned down, Bellis took it upon himself to cut the tree back to an eight metre stump, the court heard.\nThe court heard the capital asset value of the tree was put at more than £114,000.\nA previous application for the tree to be removed entirely had been rejected six months earlier.\nThe city council received complaints that unauthorised tree works had been carried out and when officers visited the site they found the tree had been reduced.\nBellis accepted in May 2024 he had carried out the unauthorised work on the tree.\nThe court heard the tree was unlikely to recover.\nA spokesperson for the local authority said it welcomed the sentence.", "url": "https://www.bbc.co.uk/news/articles/cly2n7vvgpno"}