{"authors": ["Nathan Briant & PA Media", "www.facebook.com"], "date_download": "2025-04-26 07:06:57", "date_modify": "2025-04-26 07:06:57", "date_publish": "2025-02-28 06:09:41", "description": "Chef Heston Blumenthal says being sectioned was the \"best thing\" as he dealt with bipolar symptoms.", "filename": "news_articles_clyzz7qq1kpo_1745651217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7885/live/b3121c60-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyzz7qq1kpo_1745651217.html", "title": "Heston Blumenthal on bipolar: 'I thought TV was talking to me'", "title_page": "Heston Blumenthal on bipolar: 'I thought TV was talking to me' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "TV chef and restaurateur Heston Blumenthal said being sectioned was the \"best thing\" to have happened as he opened up about his bipolar symptoms.\nThe 58-year-old, who was diagnosed with the condition in 2023 after being admitted to hospital, told BBC Breakfast how he once \"hallucinated a gun on the table\".\n\"This wasn't all the time, but it was getting greater and greater, and being sectioned was the best thing that could happen to me,\" he said.\nBlumenthal, who runs several award-winning restaurants, including the three Michelin starred The Fat Duck in Bray, Berkshire, has now become an official ambassador for Bipolar UK, external.\nAccording to the charity, the mental health condition is an episodic disorder, external characterised by sometimes extreme changes in mood and energy which has the highest risk of suicide of any mental health condition.\n\"I laughed out loud after receiving a message from a woman who told me that during a manic episode she thought the TV was talking to her,\" Blumenthal, who also has ADHD, said.\n\"The reason I laughed out loud was because I experienced the same thing.\"\nThe chef said it was \"really difficult\" for his wife, French businesswoman Melanie Ceysson, who he married in 2023.\n\"She had to decide how I would take it [being sectioned] and ... my response was, I embraced it, but I never thought I was going to be diagnosed as being bipolar, I thought at the time, the highs and the lows were normal, but they weren't.\n\"And they weren't right for me, and they weren't right for the people around me that ... cared for me.\"\nThe NHS says a person can be detained, also known as sectioning, under the Mental Health Act and can be treated without their agreement if they \"need urgent treatment for a mental health disorder and are at risk of harm to themselves or others\".\nFamous for his experimental dishes such as snail porridge and bacon and egg ice cream, Blumenthal said medication initially dulled his culinary imagination.\n\"I was zombified - I had no energy at all.\n\"As my medications have been changed and my levels of self-confidence and self-awareness have gone up I realise my imagination and creativity is still there,\" he said.\n\"It was at levels that were so extreme before... looking back I can remember during my manic highs I was interrupting myself with ideas.\"\nHe said someone recently asked him \"if there was a button I could press to turn off my bipolar - would I press it?\", to which he replied, \"no, I wouldn't, because it's part of me\".\nHe has since returned to the kitchen and said he was \"thinking more clearly\".\nBipolar UK estimates more than one million adults in the UK have the disorder, about 30% more than the number of people with dementia.\nBut it is estimated at least 500,000 people are undiagnosed.\n\"It's an honour to have Heston onboard as an ambassador,\" Simon Kitchen, chief executive of Bipolar UK, said.\n\"We hope that his experience will encourage more people to seek help if they are struggling with their own diagnosis or are in the process of seeking one.\"", "url": "https://www.bbc.co.uk/news/articles/clyzz7qq1kpo"}