{"authors": ["Andrew Sinclair", "www.facebook.com"], "date_download": "2025-04-26 06:13:06", "date_modify": "2025-04-26 06:13:06", "date_publish": "2025-03-02 06:28:28", "description": "Employers say government measures make it harder for them to find the workers they need.", "filename": "news_articles_cy877l2j9p2o_1745647986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8116/live/f3e691c0-f569-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy877l2j9p2o_1745647986.html", "title": "Immigration rules hinder recruitment, say employers", "title_page": "Immigration rules hinder recruitment, say employers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Employers say attempts to reduce legal migration to the UK are deterring people from coming to work in Norfolk and making it hard for them to recruit the right staff.\nA year after the last government stopped overseas healthcare workers bringing dependents with them, immigration numbers are starting to come down, but a care home owner in Norfolk says that has come at a price.\nAnd 10 years after overseas workers were made to pay up front to use the NHS, two world-leading laboratories warn the move is deterring people from applying for jobs and increasing their costs.\nOver the last 10 years, successive governments have tried to reduce the numbers of people coming to the UK, with little success.\nAccording to the Home Office, 1.2 million people arrived in the UK last year, more than 90% of them legally after applying for permission to work or study.\nThe 2023 figure was about 1.2 million, while the 2022 figure was one million., external\nAccording to information service Norfolk Insight, 5,300 migrants came to Norfolk in 2019., external\nWith the numbers coming to Britain doubling over the last five years, the Conservatives introduced various measures to curb legal immigration, including an NHS surcharge in 2015 and a ban on students and care workers bringing their dependents with them.\nDamien Caubriere, 30, from Cherbourg in France, has just arrived at the Sainsbury Laboratory in Norwich to coordinate research into plant health.\nBut before he could start, he made two attempts to apply for a visa at a total cost of £1,323.\nHe also paid £154 for an English test, £283 to have his diploma translated and validated and £3,240 to use the NHS for the three years that he is here.\nThe total bill came to £5,000 and the process took him five months.\n\"It's a costly process and a long process,\" he says.\n\"A lot of my colleague are mostly moving to Germany or to other institutes in Europe because it's way easier.\n\"Thanks to Schengen [the European Union free border agreement] if you get a job in somewhere like Germany you can move the day before you start and it costs zero Euros.\"\nFive years ago, the Sainsbury Laboratory spent £12,000 reimbursing the costs of its new recruits. Last year, it spent £105,000.\nNextdoor is the Earlham Institute, which carries out life sciences research.\nDr Carolina Grandellis, from Argentina, is head of biofoundry and says the centre has struggled to recruit to some senior posts.\nShe has colleagues who have decided to return home rather than renew their visas.\n\"Because of the high visa costs and the NHS surcharge, I think there is now a feeling that it's unwelcoming to come to the UK and we've seen a decline in international people coming to work here,\" she says.\n\"We do recruit some British scientists but we need to be able to fill the gap with international talent or else there is a strong chance we stop being competitive.\"\nRaj Sehgal runs six care homes in Norfolk. He says that despite trying to recruit local people, 70% of his staff come from overseas.\nHe has to pay £239 (£530 from April) for a certificate of sponsorship for every person he recruits from abroad, and a skills immigration surcharge of £364 for every year they are here.\nBut he says the ban on dependents has been the most damaging.\n\"The good calibre people that we were recruiting from hospitals and nursing colleges overseas now don't want to come to the United Kingdom,\" he says.\n\"Instead, they will go to other more welcome nations where they can take their families.\n\"What we're asking people to do is to come here to work and not have the right to a family life.\n\"They may have a husband or a wife back home with children, and they're not allowed to see them. How is that not tantamount to modern day slavery?\n\"If we want growth, we need people. All around the world developed nations are dependent on a migrant workforce to grow their economy and we are no different.\"\nBut former Conservative minister and ex-Corby MP Tom Pursglove, who oversaw some of the rule changes, said the public wanted to see a cut in the number of people coming into the country.\n\"I announced the plan to bring the numbers down,\" he said.\n\"The numbers were coming down month on month.\"\nThe Home Office has been approached for comment, but the new immigration minister suggested Labour would stick with the policies of the last government.\nDame Angela Eagle told the BBC that under the last government, net migration quadrupled in four years\n\"We are going to get it down by tightening up visas and ensuring labour shortages are provided for with skills training for people who are already here,\" she said.\n\"We are getting a grip on the chaos we inherited.\"", "url": "https://www.bbc.co.uk/news/articles/cy877l2j9p2o"}