{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 07:54:10", "date_modify": "2025-04-26 07:54:10", "date_publish": "2025-02-25 13:45:49", "description": "Renovation work is being carried out after a survey found the existing roof was at the end of its life.", "filename": "news_articles_cly4nnn9yzzo_1745654050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/404a/live/e4b113d0-f378-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly4nnn9yzzo_1745654050.html", "title": "New roof to protect 'much-loved' Plowright Theatre in Scunthorpe", "title_page": "New roof to protect 'much-loved' Plowright Theatre in Scunthorpe - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work to replace the roof of a theatre is expected to finish in March, officials have said.\nThe Plowright Theatre, Scunthorpe, was built in 1958, but a recent survey found the existing roof had reached the end of its lifespan.\nNorth Lincolnshire Council, which owns the building, said it could no longer continue with patchwork repairs due to the risk of leaks damaging the auditorium, performance equipment and other parts of the interior.\nThe £160,000 funding for the project has come from the government's Shared Prosperity Fund.\nThe venue, which is named in honour of the late actress Dame Joan Plowright, has been described by the council as an \"essential part of Scunthorpe's entertainment scene\".\nCouncillor John Davison, cabinet member for culture, heritage and arts, said: \"This investment is fantastic news for the Plowright Theatre and for the local community.\n\"By replacing part of the roof now, we are protecting this much-loved venue and ensuring it remains a vibrant space for live performances in North Lincolnshire.\"\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cly4nnn9yzzo"}