{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:25:55", "date_modify": "2025-05-21 05:25:55", "date_publish": "2025-01-14 00:00:00", "description": "The Labour MP had referred herself to the prime minister's standards adviser after being named in an anti-corruption investigation in Bangladesh.", "filename": "news_live_crmnjjm9j12t_1747805155.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_crmnjjm9j12t_1747805155.html", "title": "Tulip Siddiq resigns as Treasury minister", "title_page": "Tulip Siddiq resigns as Treasury minister - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Treasury minister resigns after embezzlement probe\nMalu Cursino\nLive reporter\nTulip Siddiq's decision to step down from office came after the MP for Hampstead and Highgate was named in an investigation into claims her family had embezzled up to £3.9m in Bangladesh.\nSiddiq, whose aunt is the south Asian country's former prime minister, has repeatedly denied any wrongdoing - a claim Prime Minister Keir Starmer's standards adviser Laurie Magnus seems to support.\nBut in her letter to the prime minister, Siddiq said that while Magnus found she had not breached ministerial rules, continuing in her role \"is likely to be a distraction from the work of government\".\nIn acknowledging Siddiq's resignation, Starmer told his former minister he wants \"to be clear that the door remains open for you going forward\".\nFor shadow home secretary Chris Philp, the PM was \"far too slow to act in this case\", while Conservative leader Kemi Badenoch says Starmer \"dithered and delayed\" in trying to protect Siddiq.\nThat's it from us, but our political team has all the latest updates on this story for you.\nA quick look at the role of economic secretary to the Treasury\nTulip Siddiq will remain as a Labour MP but has stepped down from her government job as economic secretary to the Treasury - so what does that job actually entail?\nWell, it includes a number of responsibilities such as overseeing banking and consumer credit, financial inclusion and capability, and personal savings policy (ISAs, savings, tax, etc).\nAlso under Siddiq's remit was tackling corruption in UK financial markets - it was this element of the role which prompted particular criticism after she was named in an investigation into claims her family embezzled up to £3.9bn from infrastructure spending in Bangladesh.\nSiddiq had held the job since July 2024, when Labour got into power, having previously served as shadow minister to the Treasury while in opposition. As we reported earlier, Wycombe MP Emma Reynolds has been selected as Siddiq's replacement.\nCorruption probe difficult for government to move past\nChris Mason\nPolitical editor\nFor all of the complexities and subtleties of this story, the inescapable crux of it was something even the most polished public relations executive would struggle to add much gloss to - the minister responsible for the government’s anti-corruption drive was named in a corruption investigation.\nThe MP for Hampstead and Highgate in north London referred herself to the independent adviser on ministerial standards and insisted she had done nothing wrong, but awkward questions continued for her and Keir Starmer.\nAt last week's Prime Minister's Questions, Starmer said: \"Mr Speaker, the Cities Minister acted appropriately by referring herself to the independent advisor. We brought in our new ministerial code to allow ministers to ask to establish the facts and I’m not going to give a running commentary on that.\"\nToday, the adviser, Laurie Magnus, told the prime minister Tulip Siddiq had not broken the Ministerial Code and he had not identified evidence of improprieties. But he added: \"I have not been able to obtain comprehensive comfort in relation to all the UK property related matters.\"\nMagnus said she was now exposed to \"allegations of misconduct by association\" and \"it was regrettable that she was not more alert to the reputational risks\".\nThe prime minister and Siddiq spoke by phone today. We are told it was her decision to resign.\nAnd in a warm exchange of letters, Starmer said he accepted her resignation with sadness and \"the door remains open to you going forward.\"\nA personal and political blow for Starmer\nDamian Grammaticas\nPolitical correspondent\nFor Keir Starmer, this is as much a personal as it is a political blow. Tulip Siddiq was an ally and close friend.\nBoth entered parliament as Labour MPs in May 2015. They occupied neighbouring constituencies in London. And they knew each other even before being elected.\nIn recent days, as the questions swirled about her ownership and use of properties in London, he stood by his friend and pick for minister.\nHis spokesperson told reporters just yesterday he had “full confidence” in her.\nSir Keir’s advisor found no evidence of “improprieties” on her part.\nBut his opponents are already questioning his judgement in appointing her to be his anti-corruption minister and keeping her in her role until now.\nSiddiq was 'unaware of origins of her London flat' - ethics adviser\nMore now from independent standards adviser Laurie Magnus's letter to Keir Starmer about his probe into Siddiq's affairs.\nReports in recent days have suggested she had lived in London properties linked to allies of Siddiq's aunt Sheikh Hasina, who was ousted last year as Bangladesh's prime minister.\nMagnus tells the PM that Siddiq was \"unaware of the origins of her ownership of her flat in Kings Cross, despite having signed a Land Registry transfer form, relating to the gift at the time\".\nHe writes that the former treasury minister \"remained under the impression that her parents had given the flat to her, having purchased it from the previous owner\".\nOpponents of Sheikh Hasina in Bangladesh have also accused Siddiq of helping broker a deal with Russia in 2013 that overinflated the price of a nuclear power plant in the country so the money could be distributed to her family.\nReferring to a trip to Moscow in 2013 - where Siddiq was pictured alongside Russian President Vladimir Putin and her aunt, Sheikh Hasina - Magnus says the MP \"is clear that she had no involvement in any inter-governmental discussions between Bangladesh and Russia or any form of official role\".\nHe adds he accepted this \"at face value\".\n'Door remains open to you,' Starmer tells Siddiq\nIn response to Tulip Siddiq's resignation letter below, Prime Minister Keir Starmer tells his former minister he wants \"to be clear that the door remains open for you going forward\".\nIn a letter responding to Siddiq, Starmer says he accepts her resignation \"with sadness\" and thanks her for her \"commitment\" during her time as economic secretary to the Treasury.\n\"In accepting your resignation, I also wish to be clear that Sir Laurie Magnus as independent adviser has assured me he found no breach of the Ministerial Code and no evidence of financial improprieties on your part,\" he writes.\nHe goes on to thank her for referring herself to the independent adviser, adding: \"I appreciate that to end ongoing distraction from delivering our agenda to change Britain, you have made a difficult decision and want to be clear that the door remains open for you going forward.\"\nSiddiq's resignation letter - in full\n\"Dear Prime Minister,\n\"Thank you for the confidence you have shown in me in recent weeks.\n\"I am grateful to your Independent Adviser on Ministerial Standards Sir Laurie Magnus for acting with speed and thoroughness in response to my self-referral, and for giving me the opportunity to share the full details of my finances and living arrangements, both present and historic.\n\"As you know, having conducted an in-depth review of the matter at my request, Sir Laurie has confirmed that I have not breached the Ministerial Code. As he notes, there is no evidence to suggest that I have acted improperly in relation to the properties I have owned or lived in, nor to suggest that any of my assets 'derive from anything other than legitimate means'.\n\"My family connections are a matter of public record, and when I became a Minister I provided the full details of my relationships and private interests to the Government. After extensive consultation with officials, I was advised to state in my declaration of interests that my aunt is the former Prime Minister of Bangladesh and to recuse myself from matters relating to Bangladesh to avoid any perception of a conflict of interest. I want to assure you that I acted and have continued to act with full transparency and on the advice of officials on these matters.\n\"However, it is clear that continuing in my role as Economic Secretary to the Treasury is likely to be a distraction from the work of the Government. My loyalty is and always will be to this Labour Government and the programme of national renewal and transformation it has embarked upon. I have therefore decided to resign from my Ministerial position.\n\"I would like to thank you for the privilege of serving in your Government, which I will continue to support in any way I can from the backbenches.\n\"Best wishes, Tulip Siddiq MP\"", "url": "https://www.bbc.com/news/live/crmnjjm9j12t"}