{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:16", "date_modify": "2025-05-19 14:25:16", "date_publish": "2015-03-23 15:17:10", "description": "Calls for a Greater Manchester referendum on devolution, to avoid \"a massive democratic deficit\", are rejected by council leaders.", "filename": "news_uk-england-manchester-32022932_1747664716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81812000/jpg/_81812486_81812485.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-manchester-32022932_1747664716.html", "title": "Greater Manchester devolution referendum rejected", "title_page": "Greater Manchester devolution referendum rejected - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Calls for a Greater Manchester referendum on devolution, to avoid \"a massive democratic deficit\", have been rejected by council leaders.\nWake Up Wigan (WUW) wants an area-wide vote on whether an elected mayor and other devolved powers are wanted.\nA deal for devolution to Greater Manchester was announced in November.\nBut a spokesman for the Greater Manchester Combined Authority (GMCA) rejected WUW's idea, saying devolution is \"democratically accountable\".\nHe said: \"The underlying principle of devolution is that, wherever possible, decisions about Greater Manchester should be taken here in Greater Manchester rather than by Whitehall civil servants and Westminster politicians.\n\"This is what's happening. It means decisions can be taken based on local knowledge and an understanding of local priorities, challenges and opportunities.\n\"The elected mayor will work closely with GMCA's political leadership, which is made up of the 10 elected leaders of Greater Manchester councils. It is a democratically accountable model.\"\nStephen Hall, president of the Association of Greater Manchester Trade Unions Councils, is from the WUW campaign.\nHe had called for the referendum, saying it was \"hard to fathom how something which is supposed to empower the people shouldn't involve them\".\n\"People should be involved in a discussion about what devolution should look like, rather than being told 'This is what you're having, whether you like it or not',\" he said.\nIt was revealed in January that the region would have an interim mayor from June, who would be chosen from existing council leaders or someone who already holds an elected post in Greater Manchester, such as a senior councillor, MP or Police and Crime Commissioner. Elections for a regional mayor will be held in 2017.\nDevolution will give additional powers on areas including health, transport, planning, housing as well as skills and business support", "url": "https://www.bbc.com/news/uk-england-manchester-32022932"}