{"authors": ["Lee Trewhela", "Julia Gregory", "www.facebook.com"], "date_download": "2025-04-26 06:56:09", "date_modify": "2025-04-26 06:56:09", "date_publish": "2025-02-28 15:12:08", "description": "Signs have gone up on land owned by the council saying street trading has been banned in the area.", "filename": "news_articles_c5y00nek8neo_1745650569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba51/live/4b3894e0-f5c0-11ef-97ab-abb74cabf06c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y00nek8neo_1745650569.html", "title": "Perranporth's street trading ban to be discussed", "title_page": "Perranporth's street trading ban to be discussed  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A ban on street traders in a seaside town is due to be discussed at a council meeting on Monday.\nPerranzabuloe Parish Council said it had prohibited street trading on the approach to Perranporth's beach to ensure \"a fair and competitive business environment\".\nIt follows an incident last summer when the parish council discovered it had no powers to remove a Cornwall Council licensed street trader selling T-shirts with what the council described as \"a very offensive slogan\" as it did not have a street trader policy, the Local Democracy Reporting Service said.\nSigns have gone up on land owned by the council saying street trading has been banned in the area.\nSeveral businesses in Perranporth have offered space on their land for traders.\nJulian Price, of Stoked Surf School, said street trading \"feels like it's part of what Perranporth is\".\nHe said he wanted to show \"a bit of community spirit\" if traders were \"struggling\".\nDan Waind, the landlord of the Steiners Arms, said street trading was \"a kind of English Riviera seaside tradition\".\nHe said he offered space at the pub car park as \"we do not want to lose them.\"", "url": "https://www.bbc.co.uk/news/articles/c5y00nek8neo"}