{"authors": ["Clare Worden", "www.facebook.com"], "date_download": "2025-04-26 04:32:34", "date_modify": "2025-04-26 04:32:34", "date_publish": "2025-03-03 05:27:01", "description": "It is the fifth time the business has been affected by gas supply issues.", "filename": "news_articles_clynnzx831jo_1745641954.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1edd/live/96ef0bd0-f4f8-11ef-a2a8-e1b826ae43ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynnzx831jo_1745641954.html", "title": "Gas supply problems cost Upwell fish and chip shop £4k", "title_page": "Gas supply problems cost Upwell fish and chip shop £4k - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A fish and chip shop owner said the latest problem with energy supplies had cost it £4,000 in lost takings.\nRav's Fish & Chips in Upwell, Norfolk, has experienced issues with LPG deliveries from Calor Gas on five occasions.\nOwner Rav Singh, who lives on site, said the issue in January meant she was unable to open her shop or heat her home for four days.\nCalor Gas apologised and said it was experiencing \"regional pressures\" following \"technical issues at certain oil refineries\" which had had an impact on its delivery schedule in the East of England.\nMs Singh has been running the fish and chip shop, in the village near Wisbech on the Cambridgeshire border, for nine years.\nThe shop ran out of gas at the end of January and she said turning customers away had been really difficult.\n\"Not only were we facing the cold, I was having to stand outside the shop and to basically tell customers to go away,\" she said.\n\"I was having to explain the situation. It ruins people's plans. I was really upset for customers who had come out on a Friday just be turned away.\"\nThe business and home runs on LPG gas stored in a tank at the rear of the property.\nMs Singh said she has been offered a \"few hundred pounds of compensation\".\nIn a statement, Calor Gas said: \"We would like to apologise to Ms Singh for the late delivery of the gas.\n\"Due to current high demand and product availability at certain UK refineries, a small proportion of our customers have been impacted by late deliveries.\n\"We expect these pressures to ease in the coming days.\"", "url": "https://www.bbc.co.uk/news/articles/clynnzx831jo"}