{"authors": ["Paul Burnell", "www.facebook.com"], "date_download": "2025-04-26 07:40:37", "date_modify": "2025-04-26 07:40:37", "date_publish": "2025-02-27 12:05:33", "description": "Cheshire MP Mike Amesbury, convicted of a street assault, was originally sent straight to jail.", "filename": "news_articles_ce8yy0116y8o_1745653237.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d6ba/live/0ab2a360-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yy0116y8o_1745653237.html", "title": "Mike Amesbury: MP's prison term suspended on appeal", "title_page": "Mike Amesbury: MP's prison term suspended on appeal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "MP Mike Amesbury, who admitted repeatedly punching a constituent in the street, has had his 10-week prison sentence suspended following an appeal.\nThe Runcorn and Helsby MP assaulted Paul Fellows, 45, following a row in Frodsham, Cheshire, last year and was jailed by magistrates on Monday.\nAmesbury, who had the Labour whip removed in October, launched an appeal and a judge said that while the length of the sentence had been \"spot on\", it should be suspended for two years.\nJudge Steven Everett, sitting with two magistrates at Chester Crown Court, also ordered Amesbury to carry out 200 hours of unpaid work.\nAmesbury must also undertake an alcohol monitoring programme, go on an anger management course, and carry out 20 days of rehabilitation work.\nHis sentence still leaves the 55-year-old MP, who now sits as an independent, at risk of being ousted.\nIf at least 10% of his constituents back a recall petition, a by-election will take place.\nLeaving court, Amesbury refused to answer questions from the waiting media about whether he would resign as an MP.\nBut he said: \"I'd like to reiterate that I sincerely apologise once again to Mr Fellows and his family.\n\"I'm now going to go and see my family, and go home, and I'll give a statement at a later stage.\"\nVideo footage of the assault, which happened near a taxi rank in the early hours of 26 October, which was played in court.\nIt showed Amesbury punching Mr Fellows in the head, knocking him to the ground.\nThe politician then hit him at least five more times and swore at him.\nAmesbury was then heard saying: \"You won't threaten your MP again, will you?\"\nJudge Everett told Amesbury the facts showed him \"in a truly unfavourable light\" and, as an MP, he \"should be showing an example\".\nWhile acknowledging it would be wrong to sentence him differently because he was an MP, the judge added: \"That doesn't mean we can't take into account that your behaviour as an MP was simply disgraceful.\"\nHe said he also could not ignore Amesbury's \"heavy drinking and fighting\".\nThe former Labour politician had arrived at court in a prison van and wore handcuffs as he was led into the building.\nThe court heard that, in a prepared statement given in a police interview, Amesbury claimed he had been approached by a man \"shouting and screaming\" about local and national matters.\nThe MP said that, because he was terrified and the other man's \"arms were swinging\", he felt he had no option but to \"defend\" himself.\nBut the judge told him the CCTV pictures revealed a very different story.\n\"In reality, you told the police a pack of lies. Nothing more, nothing less,\" he said.\nJudge Everett questioned why a charge of affray - which can carry a longer sentence - had not been brought by the prosecution.\nDaniel Travers, defending Amesbury, told the court: \"He's now had three nights in prison which is an experience he will never forget, certainly.\"\nHe said the \"public shaming\" and \"embarrassment\" had had a huge impact on his client.\n\"This is a man who will certainly rehabilitate,\" said Mr Travers. \"He will learn a very painful lesson.\"\nThe confirmation of Amesbury's prison sentence, even though it has now been suspended, could still result in him being ousted from the Commons.\nThe long-time Labour politician has been sitting as an independent MP for the last four months, following his suspension by party bosses.\nUnder parliamentary rules, if an MP receives a custodial sentence a \"recall petition\" is triggered.\nAfter hearing from Chester Crown Court, the Speaker of the House of Commons will contact the returning officer for Amesbury's Runcorn and Helsby constituency.\nConstituents will then have six weeks to ask for their MP's removal by registering at 10 nominated places.\nIf at least 10% of them vote to remove Amesbury, a by-election will be called.\nIt would be the first by-election since Labour came to power following the July 2024 general election.\nHaving first been elected as a Labour MP in the Cheshire constituency of Weaver Vale in 2017, Amesbury comfortably won the Runcorn and Helsby seat which was created following boundary changes.\nHe secured 53% of the vote and enjoyed a majority of more than 14,000.\nReform UK beat the Conservatives (16%) into second place.", "url": "https://www.bbc.co.uk/news/articles/ce8yy0116y8o"}