{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:15", "date_modify": "2025-05-19 15:22:15", "date_publish": "2015-03-03 19:47:59", "description": "The US Justice Department has found evidence of racial bias at the Ferguson police department, US media report.", "filename": "news_world-us-canada-31720166_1747668135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81380000/jpg/_81380774_81380773.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31720166_1747668135.html", "title": "Ferguson police racially biased says US Justice Department", "title_page": "Ferguson police racially biased says US Justice Department - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The US Justice Department has found evidence of racial bias at Ferguson police in Missouri, US media report.\nThe agency is expected to accuse the department of conducting stops without reasonable suspicion and making arrests without probable cause.\nIt began a civil rights investigation following the August shooting of Michael Brown.\nA white police officer killed the unarmed black 18-year-old, sparking protests in Ferguson and nationwide.\nA separate report is expected to clear the officer, Darren Wilson, of any civil rights violations in the shooting of Mr Brown.\nOfficials announced the findings of the investigation into the police department by speaking anonymously to various US media.\nAn official announcement is expected on Wednesday.\nAttempts to seek comment from the police department and city government were not successful.\nA spokesman for the Missouri governor said: \"We haven't seen the report to be able to comment on it.\"\nIt is believed the report will accuse the police of using excessive force against blacks and present evidence that black motorists are stopped and searched without reason.\nWhile African Americans make up 67% of the population in Ferguson, they accounted for 93% of arrests between 2012 and 2014, according to the Washington Post, external.\nThe report will also present evidence that the courts also engage in racial bias - blacks are 68% less likely to have their cases dismissed by a judge.\nInvestigators also found that officials used money from fines to help balance the city's budget, the New York Times reported, external.", "url": "https://www.bbc.com/news/world-us-canada-31720166"}