{"authors": ["Jonathan Sutton", "www.facebook.com"], "date_download": "2025-04-26 07:40:19", "date_modify": "2025-04-26 07:40:19", "date_publish": "2025-02-27 12:27:05", "description": "The owner confirms the residential home, which houses nine people, will close in March.", "filename": "news_articles_c5y2251e1n0o_1745653219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b428/live/bbf20420-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y2251e1n0o_1745653219.html", "title": "Stoke-on-Trent care home's closure blamed on lack of funding", "title_page": "Stoke-on-Trent care home's closure blamed on lack of funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A care home housing nine residents will be closing next month due to a lack of funding, its owner has confirmed.\nThe Priory Group said Collinson Court in Trentham, Stoke-on-Trent, would be shutting its doors permanently in March.\nThe company and residents' families have blamed Stoke-on-Trent City Council and Staffordshire County Council for not providing enough funding to cover the care home's costs.\nBoth authorities said they were working to ensure the care home's residents were safely relocated.\nA spokesperson for Collinson Court said: \"Closing a care home is not something any provider wants to do but, in the case of Collinson Court, the service is simply not sustainable under current funding arrangements.\n\"As has been the case with multiple care home closures across Staffordshire in recent years, funding provided to us by the local authority did not match the costs of providing the specialist care required, and the service has been running at a significant deficit.\"\nThe spokesperson said that despite working with the councils, which both provide funding for residents, a resolution had not been found.\nIn a statement, a number of residents' families said it was a \"complex situation\" due to some being funded by one council and some by the other.\n\"Since December, parents and families have been endeavouring to challenge the local authority and determine why Collinson Court is no longer financially viable,\" they added.\n\"We steadfastly believe that this is due to a refusal by the local authority to build in annual uplifts of fees.\"", "url": "https://www.bbc.co.uk/news/articles/c5y2251e1n0o"}