{"authors": ["Emma Petrie", "www.facebook.com"], "date_download": "2025-04-26 06:42:06", "date_modify": "2025-04-26 06:42:06", "date_publish": "2025-03-02 11:49:16", "description": "Men in Hull and Scunthorpe are diagnosed with prostate cancer at a later stage than in other areas.", "filename": "news_articles_cx28q5wnl39o_1745649726.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ca64/live/76e6b350-f75b-11ef-a766-bffe669032d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28q5wnl39o_1745649726.html", "title": "Hull and Scunthorpe pub beer mats to offer cancer check link", "title_page": "Hull and Scunthorpe pub beer mats to offer cancer check link - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Men will be encouraged to check whether they are at risk of developing prostate cancer while enjoying a pint in a pub as part of a targeted awareness campaign running through March.\nDozens of beer mats highlighting the disease are to be distributed to about 30 pubs in Hull and Scunthorpe.\nPeople in both those locations are diagnosed much later with prostate cancer than other areas in the region, according to the Humber and North Yorkshire Cancer Alliance.\nThe beer mats feature a QR code that takes customers to a website, where they can check their risk of developing the disease in 30 seconds.\nProstate cancer is the UK's most common cancer in men, mainly affecting people aged 50 and over, with the risk increasing with age.\nRob Sharpe, owner of The Avenue pub in Hull, is taking part in the awareness campaign as part of prostate cancer awareness month.\nMr Sharpe, who lost his father to cancer, said the beer mats might encourage conversations about the disease.\n\"Men can sometimes find it hard to talk about their bodies, but in the pub with their mates, they might be more receptive to checking the risks and symptoms of prostate cancer,\" he said.\nMr Rogers said: \"It's important to know what is normal for you and your body, so you can spot signs of prostate cancer as early as possible\".\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cx28q5wnl39o"}