{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:59:52", "date_modify": "2025-04-26 07:59:52", "date_publish": "2025-02-25 11:13:09", "description": "About 30 people gathered in Strathpeffer to express concerns about SSEN Transmission's plans.", "filename": "news_articles_cg4k5lr60n3o_1745654392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a1ef/live/6bbb2670-f35d-11ef-a4a4-ed784e2ede58.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4k5lr60n3o_1745654392.html", "title": "Strathpeffer protest against route of upgraded powerline", "title_page": "Strathpeffer protest against route of upgraded powerline - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A protest has been held against the planned route of an upgraded electricity power line in the Highlands.\nAbout 30 people held a demonstration during a consultation event in Strathpeffer by energy firm SSEN Transmission on Monday.\nSSEN Transmission said the upgrade was needed for connecting power generated by renewable schemes in the north of Scotland with consumers across the UK.\nBut campaign group Strathpeffer and Contin Better Cable Route claimed the firm had not listened to its concerns.\nSSEN Transmission plans to upgrade an overhead line near Spittal in Caithness to near Beauly, external, about 12 miles (19km) west of Inverness.\nThe total length of the line is about 106 miles (170km) and it would be carried by steel towers of an average height of about 57m (187ft).\nThe campaign's Dan Bailey said the proposed route would take the line through woodland at Contin and near the historic village of Strathpeffer.\nHe said: \"We have been trying to engage constructively with this company as a community for the last two years to come up with a solution to routing in an area that would be acceptable to more people.\n\"It seems that has fallen on deaf ears.\n\"They could hardly have chosen a worse route.\"", "url": "https://www.bbc.co.uk/news/articles/cg4k5lr60n3o"}