{"authors": ["Leigh Boobyer", "www.facebook.com"], "date_download": "2025-04-26 03:44:46", "date_modify": "2025-04-26 03:44:46", "date_publish": "2025-03-05 06:44:00", "description": "An internal investigation by the trust found the money was missing from its books, the charity says.", "filename": "news_articles_c86pg36qw8do_1745639086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a213/live/3c634960-f9a3-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pg36qw8do_1745639086.html", "title": "Avon Valley Railway says 'fraud' behind missing £50,000", "title_page": "Avon Valley Railway says 'fraud' behind missing £50,000 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity heritage railway has launched a fundraiser after it says £50,000 went missing following what is believes was fraudulent behaviour.\nThe Avon Valley Railway Heritage Trust, in Bitton, near Bristol, said it had first seen financial irregularities at the start of 2024 and, months later, bailiffs demanded £6,000.\nAfter an internal investigation, it found £50,000 had been lost from the books of the railway, which has about 80,000 visitors each year and it is run by volunteers.\nRoger Eynon, chairman of the trust, said trustees had to be \"very, very careful about what we can spend at the moment\".\nHe said some staff had been personally and financially hit by the discovery.\nThe missing money meant the trust's ability to work on restoring the heritage railway had also been impacted over the winter, he said.\nMr Eynon told the BBC the discovery had \"set them back considerably\", but it would \"not kill them\".\n\"We need to recoup the money in order that we can keep going.\"\nThe chairman added: \"We can keep our volunteers together, and get on and progress, because our ultimate vision is to restore the line into Bath where it once was.\n\"So this is a means whereby we can ask the public to donate money into the appeal fund to recoup the £50,000. So every penny is gratefully received.\"\nThe BBC understands police have received a report regarding the missing money.", "url": "https://www.bbc.co.uk/news/articles/c86pg36qw8do"}