{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:23:35", "date_modify": "2025-04-26 04:23:35", "date_publish": "2025-03-03 13:10:18", "description": "Poison Cake, written by Emma Gale from Weymouth, will feature in the 2025 Eurovision Song Contest.", "filename": "news_articles_cqx0elr19jlo_1745641415.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7502/live/5fdfd7a0-f81d-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx0elr19jlo_1745641415.html", "title": "Dorset songwriter celebrates Croatia Eurovision contest victory", "title_page": "Dorset songwriter celebrates Croatia Eurovision contest victory - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There will be some divided loyalties at the Eurovision Song Contest this year after a song by a Dorset songwriter was chosen to represent Croatia.\nCroatian pop star Marko Bosnjak was declared winner of Dora 2025, the country's Eurovision selection competition, with Poison Cake, written by Emma Gale.\nMs Gale, from Weymouth, was in Opatija for Sunday's final, where the winner was chosen by a jury and public votes.\nShe said 2025 had been \"crazy\" after three of her songs had been the running for Eurovision in three separate countries.\nMs Gale began writing songs for Eurovision two years ago, after meeting a publisher with an interest in the contest.\nShe said: \"To have one [song] would have been amazing but to have three is pretty unheard of.\"\nSulale, sung by Nora Jabri, came sixth in the Norwegian competition, Melodi Grand Prix.\nA third song had been a favourite in the Latvian contest but the singer was unable to perform due to illness.\nDuring the Covid lockdown Ms Gale recorded a track, Let's see what the Earth has to say, that went viral on Facebook.\n\"People went crazy for it,\" she said.\n\"A lot of people did creative things during that time. For me, it's been amazing - it's changed my life.\"\nThe Eurovision Song Contest will be held in Basel, Switzerland, from 13 to 17 May.", "url": "https://www.bbc.co.uk/news/articles/cqx0elr19jlo"}