{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 04:27:54", "date_modify": "2025-04-26 04:27:54", "date_publish": "2025-03-03 10:40:49", "description": "The local council says it has dropped plans to sell the field following \"feedback from residents\".", "filename": "news_articles_cqjd79znewyo_1745641674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c2b/live/5aa94570-f811-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjd79znewyo_1745641674.html", "title": "Campaigners celebrate U-turn on Daventry playing field sale", "title_page": "Campaigners celebrate U-turn on Daventry playing field sale - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners are celebrating news that a plan to sell off a popular open space for housing has been scrapped.\nWest Northamptonshire Council has said the proposal to fund town centre improvements by selling the Eastern Way playing field will not be included in the latest Daventry Masterplan, external.\nThe authority said the change of heart was in response to \"valuable feedback from residents\".\nOne of the founders of a campaign to save the field said she was \"absolutely delighted\" by the decision.\nThe playing field was once attached to Daventry's Grammar School but is now used for events like the weekly parkrun and touring circuses.\nIt is also popular with dog walkers, exercise lovers and people who just want some fresh air.\nWhen the latest Daventry Masterplan, external was made public last year, two women who lived nearby were so horrified by plans to sell the field off to fund town centre improvements that they started a campaign to save it.\nMore than 2,000 people signed a petition, which was presented to the council in September 2024 by the Liberal Democrat member Alan Knape, and more than 1,000 attended a rally on the field during the same month.\nDan Lister, the Conservative-controlled council's cabinet member for local economy, culture and leisure, said: \"Having listened to the feedback we've received from Daventry residents, Eastern Way is a cherished recreational space and residents do not want to see new housing on the site.\n\"We will explore other ways to help secure the investment needed.\"\nLiz Scott, one of the founders of the campaign, said she was \"absolutely delighted\".\nShe added: \"We're just so grateful to everyone who's helped us.\"\nThe campaign's co-founder, Judith Morris, said: \"Our supporters have been very vocal - they all emailed their councillors, wrote to their MP, signed the petition, and that's ultimately what's made an impact.\"", "url": "https://www.bbc.co.uk/news/articles/cqjd79znewyo"}