{"authors": ["Ben Parker", "www.facebook.com"], "date_download": "2025-04-26 04:00:01", "date_modify": "2025-04-26 04:00:01", "date_publish": "2025-03-04 05:30:32", "description": "It is hoped a derelict site where 1,000 people worked can be used for new commercial ventures.", "filename": "news_articles_c0q1gyqv3gzo_1745640001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b463/live/af858510-f850-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1gyqv3gzo_1745640001.html", "title": "Former Delphi factory in Sudbury to be fully demolished", "title_page": "Former Delphi factory in Sudbury to be fully demolished - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A derelict vehicle components factory is to be fully demolished to make room for new buildings.\nThe former Delphi Diesel Systems plant in Sudbury, Suffolk has stood empty since 2020.\nA fire in 2024 caused significant damage to the site on Newton Road and a 14-year old boy was sentenced to a 12-month referral order and fined after admitting arson.\nThe site owner told the BBC the entire building would be brought down during demolition, which has now started.\nA spokesperson for Future Properties Holding said: \"The site is currently the subject of a marketing campaign which seeks to understand the demand for viable employment uses.\n\"The campaign is coming to an end after which we will be in a position to commence design work and engage with the local community.\"\nAn online advertisement is offering \"new build industrial/warehouse units\" ranging in size from 750 to 300,000 square feet, although it says \"interest from other employment generating uses will be considered\".\nDelphi Diesel Systems, which made components for the motor industry, closed its site in 2020, resulting in hundreds of jobs losses.\nThere had been hopes the site would be repurposed for other industrial uses but the fire is thought to have damaged 40% of the building, while the court hearings were told repair work would have cost over £1m.\nJames Cartlidge, South Suffolk's Conservative MP, said: \"I understand that the demolition of the Delphi building will be an emotional moment for many, given the history of the site and its social and economic importance to the town over the years.\"\nHe said he believed the redeveloped site would see mixed-use, rather than purely industrial use.\n\"We now need to see this step crystallising the kind of progress with the site which means it can start to emerge from its current sorry state of dilapidation,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c0q1gyqv3gzo"}