{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:18", "date_modify": "2025-05-19 14:47:18", "date_publish": "2015-02-26 03:37:01", "description": "South Korea's top court revokes a 60-year-old adultery law under which cheating spouses could be jailed, saying it is unconstitutional.", "filename": "news_world-asia-31635747_1747666038.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81249000/jpg/_81249790_81249789.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31635747_1747666038.html", "title": "South Korean court decriminalises adultery", "title_page": "South Korean court decriminalises adultery - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Korea's top court has ruled that adultery is no longer a crime, revoking a 1953 law under which cheating spouses could be jailed for up to two years.\nSouth Korea was one of only three Asian countries to criminalise infidelity - about 5,500 people have been convicted since 2008.\nBut out of the nine-judge panel, seven deemed the law unconstitutional.\nPresiding judge Park Han-Chul said public conceptions of individuals' sexual rights had changed.\n\"Even if adultery should be condemned as immoral, state power should not intervene in individuals' private lives,\" he said.\nIn recent years, while hundreds of people have been convicted under the law, very few have actually gone to prison.\n\"Recently, it was extremely rare for a person to serve a prison term for adultery,\" Lim Ji-bong, a law professor at Sogang University in Seoul, told the Associated Press. \"The number of indictments has decreased as charges are frequently dropped.\"\nThe law has previously been reviewed four times by the court and upheld.\nThe most recent was in 2008, when actress OK So-ri petitioned the court after being given an eight-month suspended sentence for adultery.\nAlthough she was unsuccessful, it was a narrow loss. Five of the judges deemed the law to be unconstitutional, saying that adultery could be condemned on moral grounds but not as a criminal act. Six judges needed to oppose the law for it to be revoked.\nThe Constitutional Court said on Thursday that anyone convicted since 2008 could have their case reconsidered.\nBut some in South Korea have defended the law, saying its loss would encourage sexual depravity.\nJustice Ahn Chang-Ho, who read the dissenting opinion at the constitutional court, said that the statute was a key protector of family morals and warned that its abolition would \"spark a surge in debauchery\".", "url": "https://www.bbc.com/news/world-asia-31635747"}