{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 06:35:49", "date_modify": "2025-04-26 06:35:49", "date_publish": "2025-02-27 06:07:49", "description": "Her rent consisted of a crate of wine and a supply of festival tickets says Historic England.", "filename": "news_articles_cx28p6q8q0po_1745649349.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ec62/live/b1cbf190-f43d-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28p6q8q0po_1745649349.html", "title": "Composer Imogen Holst's Aldeburgh home given listed status", "title_page": "Composer Imogen Holst's Aldeburgh home given listed status - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The former home of a renowned composer and conductor has been protected with Grade II listed status.\nImogen Holst lived at 9 Church Walk in Aldeburgh, Suffolk, from 1964 until her death in 1984, and described the bungalow as \"the loveliest house in the world\".\nShe was the daughter of renowned composer Gustav Holst - known for his seven-movement orchestral suite The Planets.\nThe Department for Culture, Media and Sport, with the advice of Historic England, listed the home due to its architectural and historical significance.\nHolst became Benjamin Britten's musical assistant - who was also from Suffolk - and in 1952 she was invited to help him as he worked on the opera Gloriana marking the coronation of Queen Elizabeth II.\nShe later became the artistic director of the Aldeburgh Festival.\nWhen thanking the Cadbury-Brown's for the house, she wrote: \"My immense and perpetual gratitude for the loveliest house in the world.\"\nThe property included some of her personal items such as her writing desk as well as her father's oak music cupboard where she stored his manuscripts.\nThe house is owned by Britten Pears Arts and is available as a holiday rental. It is also open to the public every year for Heritage Open Days., external", "url": "https://www.bbc.co.uk/news/articles/cx28p6q8q0po"}