{"authors": ["Liam Barnes", "www.facebook.com"], "date_download": "2025-04-26 08:07:45", "date_modify": "2025-04-26 08:07:45", "date_publish": "2025-02-26 14:05:22", "description": "Alan Webster, 82, started abusing the boy when he was 12, police said.", "filename": "news_articles_c4g0wel8zy1o_1745654865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b908/live/175ffc40-f3a3-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g0wel8zy1o_1745654865.html", "title": "'Predatory' teacher jailed for sex abuse of Nottinghamshire schoolboy", "title_page": "'Predatory' teacher jailed for sex abuse of Nottinghamshire schoolboy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teacher who abused a schoolboy in the 1980s has been jailed for eight years.\nAlan Webster committed the offences at Glaisdale Comprehensive School in Bilborough, Nottingham, with the abuse starting when his victim - Richard Crown, who reported the crimes in 2021 but died a year later - was 12.\nWebster, 82, of Longfield Lane in Ilkeston, Derbyshire, was found guilty of three counts of indecent assault and one count of gross indecency with a child.\nHe was sentenced at Nottingham Crown Court on Tuesday and the family of Mr Crown said they wanted to \"offer a voice to other victims who may still be suffering in silence from abuse\".\nPolice said Webster abused the boy in a storeroom at the school, which closed in 2001, as well as molesting him in his car after grooming the schoolboy and persuading him to deliver Christian Aid leaflets.\nHe also found him part-time jobs and took him to watch football matches to allow him to carry on the abuse.\nMr Crown's family said their \"sense of relief\" at justice being served was coloured by a \"profound sadness\" he could not live to see his abuser jailed.\n\"For nearly 40 years, he lived with a pain that was both unimaginable and indescribable,\" they said in a statement.\n\"Richard, the person he could have been, was stolen from us long before he died.\n\"We mourn not only the child who was robbed of his innocence but the adult who struggled with scars that were never visible to most.\"\nDet Con Steve Dunn, from Nottinghamshire Police, paid tribute to the \"courage\" of Mr Crown in reporting the abuse, describing Webster as \"a predatory sex offender who used his privileged position as a school teacher to abuse a schoolboy\".\n\"[He] may now be behind bars, but if there are others who have been affected by him, we urge them to come forward,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c4g0wel8zy1o"}