{"authors": ["Dan Hunt", "www.facebook.com"], "date_download": "2025-04-26 03:56:51", "date_modify": "2025-04-26 03:56:51", "date_publish": "2025-03-04 14:50:51", "description": "Tim Farron says average house prices are about 20 times the average income in parts of Cumbria.", "filename": "news_articles_c0egpl1qj82o_1745639811.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/73b0/live/9dc248d0-f8fb-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0egpl1qj82o_1745639811.html", "title": "MP demands social housing to tackle high prices", "title_page": "Lake District MP demands social housing to tackle high prices - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP has called for social housing powers to be given to councils over concerns some \"house prices are 20 times the average income\".\nWestmorland and Furness Council said parts of South Cumbria and the Cumbrian Dales had some of the \"least affordable\" housing outside the South East of England.\nMP Tim Farron asked the government to enforce \"a specific and unappealable designation of social housing-only developments\" that local councils could enforce.\nHousing and planning minister Matthew Pennycook said he was \"more than happy\" to \"discuss short-term lets as well as this issue\".\nSpeaking in Parliament, the MP for Westmorland and Lonsdale Mr Farron said: \"In the Lake District and the Dales of Cumbria, average house prices are around 20 times average household incomes.\n\"Will the minister try to tackle this issue by making sure that there is a specific and unappealable designation of social housing-only developments that national park authorities and local councils can enforce?\"\nThe council's housing strategy said affordability was \"exacerbated\" by the low wage economy in the area, the Local Democracy Reporting Service said.\nAccording to data from Experian, an income is required of £71,011 to purchase a property of average property value on the open market in Westmorland and Furness - however only 13% of households have an annual income of more than £70,000.", "url": "https://www.bbc.co.uk/news/articles/c0egpl1qj82o"}