{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:27:11", "date_modify": "2025-04-26 06:27:11", "date_publish": "2025-02-28 19:01:13", "description": "Officers conducted the strip-search on the 15-year-old girl suspecting she had drugs on her.", "filename": "news_articles_c7983zw7n2qo_1745648831.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/494b/live/c6ffd570-f601-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7983zw7n2qo_1745648831.html", "title": "Child Q: Three Met officers face misconduct hearing over search", "title_page": "Child Q: Three Met officers face misconduct hearing over search - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three Met Police officers will face a misconduct hearing later this year after allegedly exposing \"intimate parts\" of a 15-year-old girl during a strip-search at her school.\nTrainee detective constable Kristina Linge and police constables Victoria Wray and Rafal Szmydynski conducted the search on 3 December 2020 of the girl, previously referred to as Child Q, suspecting she had cannabis on her.\nThe Independent Office for Police Conduct (IOPC) previously said the school was in Hackney and no drugs were found in the girl's bags or outer clothing.\nIt is alleged PCs Linge and Szmydynski performed a search when it was \"disproportionate in all the circumstances\".\nPCs Linge and Wray also performed or allowed the search in a manner which was \"unjustified, inappropriate, disproportionate, humiliating and degrading\", it is alleged.\nThe search was allegedly conducted without authorisation, in the absence of an appropriate adult, and with no adequate concern being given to Child Q's age, sex, or the need to treat her as a child.\nIt is also alleged that PCs Szmydynski and Linge both gave a misleading record of the search afterwards.\nBreaches of the Met's standards of professional behaviour amount to gross misconduct. If the allegations against the three officers are proven it could lead to their dismissal.\nThe IOPC first announced three officers would face a misconduct hearing for the incident in September 2023, after an investigation into the incident began in May 2021.\nThe officers, all from the force's Central East Command Unit, will face the hearing at Palestra House in London from 2-27 June.", "url": "https://www.bbc.co.uk/news/articles/c7983zw7n2qo"}