{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:20:55", "date_modify": "2025-05-21 06:20:55", "date_publish": "2025-03-31 00:00:00", "description": "Updates as emergency services have cordoned off a number of streets in Loughborough town centre.", "filename": "news_live_c14x8lvkll1t_1747808455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9f4c/live/cc9b1220-0e51-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c14x8lvkll1t_1747808455.html", "title": "Man arrested as Loughborough town centre reopens after evacuation", "title_page": "Man arrested as Loughborough town centre reopens after evacuation - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage has concluded\nGavin Bevis\nBBC News, East Midlands\nWe're going to bring our live updates of the disruption in Loughborough town centre to a close.\nThank you for joining us and please keep an eye on the BBC News website for any further developments.\n'Huge impact'\nBen Mellor\nBBC News, Loughborough\nElaine Round, 63, who works at Forage grocers, said they were just outside the cordon, but still faced disruption.\n\"We weren't able to deliver anything from one o'clock today, so my husband is out now delivering to all the people we weren't able to get to,\" she told the BBC.\n\"Thankfully they were understanding.\n\"It's had a huge impact, there are a lot of independent businesses in Market Street who have to fight for the first and last penny.\n\"A lot of people have lost of a lot of money today.\"\nIncident scaled back\nBen Mellor\nBBC News, Loughborough\nAll that remains on the scene now are two police vans and a few police cars.\nIt would appear as though all the previous cordons around the town have now been taken down.\nThere are no more fire engines to be seen near the site of the incident either.\nIt's really winding down now.\n'Serious threat to life'\nElise Chamberlain\nBBC News, East Midlands\nIan Lister, who owns Cafe-Ambience in Market Street, said: \"Police arrived just after one o'clock and shouted into the cafe that everyone must evacuate, so obviously we complied and switched everything off.\n\"Literally every business was being evacuated out of Market Street down the end towards Market Square.\n\"It was made very clear it was a serious threat-to-life incident.\"\nArrest made after Loughborough disturbance\nGavin Bevis\nBBC News, East Midlands\nLeicestershire Police has just provided us with this statement: \"An area in Loughborough town centre has been cordoned off after a report was received around midday today [Monday 31 March] regarding concerns for the behaviour of a man.\n\"The man was seen on a flat roof adjacent to some flats in Market Street. Concerns were raised in relation to his behaviour.\n\"In the interests of public safety, a cordon has been put in place in the Frederick Street/Packe Street and Granby Street area.\n\"People are being advised to avoid the area while the emergency services deal with the incident.\n\"A man has since been arrested on suspicion of being a public nuisance and is in custody.\"", "url": "https://www.bbc.com/news/live/c14x8lvkll1t"}