{"authors": ["Natalie Sherman", "www.facebook.com"], "date_download": "2025-04-26 04:16:37", "date_modify": "2025-04-26 04:16:37", "date_publish": "2025-03-04 08:33:23", "description": "Trump tariffs have left toymakers stunned, scrambling and warning of higher prices.", "filename": "news_articles_cg701mgz2d4o_1745640997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dcc2/live/cab45080-f8f7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg701mgz2d4o_1745640997.html", "title": "Toymakers brace for Trump tariffs: 'It's killing our mojo'", "title_page": "Toymakers brace for Trump tariffs: 'It's killing our mojo' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The business of the North American Toy Fair, an annual showcase of the latest in silly putty, monster trucks and board games, is fun. But this year at the convention center in New York City, tariffs were killing the vibe.\nIn February, US President Donald Trump raised tariffs on products made in China by 10%. Then last week, with little warning, he announced an additional 10% border tax, which has now come into force on Tuesday, along with tariffs on Mexico and Canada.\nIn the toy industry, which estimates that about 80% of toys sold in the US are made in China, the rapid-fire announcements have stunned businesses, leaving them scrambling to figure out how to swallow a sudden 20% rise in cost.\nThe moves are the first of what Trump has threatened will be far wider action, making it a preview of the upheaval that could be coming for companies around the world.\n\"It's the first thing we talk about and the last thing we talk about,\" toymaker Jay Foreman said this weekend from his booth at the trade show, where classic hits such as Lincoln Logs, Tonka Trucks and K'Nex were on display.\nHis business, Basic Fun!, makes 90% of its products in China and had been planning to counter the cost of the initial 10% tariff with a mix of higher prices for customers and lower profits, both for his firm and for his manufacturing partners.\nHe presented the strategy to his board on Wednesday, ahead of the toy show, only to have to rip it up the next day, after Trump's later announcement.\nHe will have to shoulder the tariff costs for products headed to stores this spring, he said, but is now expecting to raise prices for many items by at least 10% later in the year.\n\"The reality is that tariffs will raise the cost of toys for consumers,\" he said. \"If a customer says, 'Then I can't buy it', then I can't sell it, because I can't produce to lose money.\"\nTariffs are a tax on imports collected by the government at the border and paid for by the companies bringing in the goods.\nDuring Trump's first term, China was the main target of the measures, with more than $360bn worth of products sent to the US getting hit by the measures.\nAt the time, toys and many other consumer products were spared.\nBut Trump has now applied the duties across the board, hitting almost 15% of the imports into the US each year.\nHis actions have been overshadowed by tariffs on products made in Mexico and Canada - America's top two trade partners, which have long operated under a free trade agreement with the US.\nAnd they fall short of the \"up to 60%\" tariff that Trump called for on the campaign trail last year.\nBut with the latest move, businesses say the costs are getting too big to ignore.\nThe average effective tariff rate on imports from China now stands at roughly 34%, with recent actions amounting to a rise roughly twice as large as the increase during Trump's first four-year term as president, according to estimates by Goldman Sachs.\n\"10% - it's something we can somehow live with. 20% is a different ball game,\" said Yaron Barlev, chief operating officer of Clixo, a Brooklyn-based maker of magnetic building toys which started about five years ago and signed a deal last year to start selling its toys at Target later in 2025.\nWith manufacturing in China now under way to satisfy that order, his firm, which employs 18 people in the US, is expecting to have to shoulder the costs of the border duties, scrambling its plans for profits.\nHe said he hoped Trump would offer some kind of reprieve for toys but was not feeling especially optimistic.\n\"It's much less predictable now than he used to be so I really don't know.\"\nThe Toy Fair is his organisation's marquee event, drawing businesses from around the world who line New York's convention center with cheerful displays of blocks, high-contrast baby books and spiky coloured balls. But worry about tariffs pulsed through the gathering this year.\n\"It's killing our mojo,\" said Mr Ahearn, noting that it was his members' top concern.\nFrom their booths, toymakers greeted questions about Trump's moves with head shakes, grimaces and disbelief.\n\"20% is a lot,\" said Ada Luo, sales director for Wonderful Party, a manufacturer in Shenzhen, China, which makes Christmas light necklaces, leis and New Year's hats. \"10% maybe... between the supplier and the buyer we can share, but 20%? We don't have a clue.\"", "url": "https://www.bbc.co.uk/news/articles/cg701mgz2d4o"}