{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:29:10", "date_modify": "2025-04-26 06:29:10", "date_publish": "2025-02-27 11:09:10", "description": "Opposition parties unite against new bid to give government-supporting politicians extra Dáil time.", "filename": "news_articles_c0kggxm6gevo_1745648950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cf19/live/526512a0-f527-11ef-84d6-e76b54ed9e13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kggxm6gevo_1745648950.html", "title": "Dáil speaking rights protest 'childish' says Irish deputy PM", "title_page": "Dáil speaking rights protest 'childish' says Irish deputy PM - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Irish opposition parties have been branded \"childish\" by the tánaiste (Irish deputy prime minister) after they announced protest action over a long-running row on speaking rights at the Irish parliament.\nThe issue, sparked in January when Ireland's newly-formed coalition government attempted to be formally elected, centres on independent members of the government getting dedicated time in parliament to hold ministers to account.\nOn Thursday, a Dáil (Irish parliament) reform committee voted to allow new speaking slots for those independent members who support the government.\nHowever, opposition parties labelled the meeting as \"disgraceful\".\nThe parties - including Sinn Féin, Labour, the Social Democrats, People Before Profit and Independent Ireland - have announced they will withdraw from pairing arrangements in protest.\nThe speaking rights plan has to be voted through the Dáil before it can proceed but will have sufficient support thanks to the government majority.\nPairing is a process where a parliament member of a party abstains from a vote if the member of an opposition party cannot attend.\nThe withdrawal of pairing would negatively affect government business in March when most ministers travel abroad for St Patrick's Day engagements.\nAlmost 40 ministers, junior ministers and other state officials have trips organised to destinations including the US, Australia, Japan, India, Mexico and Thailand, external.\nTánaiste Simon Harris told the Dáil it has never been more important for ministers to travel abroad for discussions, but the withdrawal of pairings will now prevent this.\nHe also defended the government's speaking rights plan, arguing that all Dáil members should be allowed ask questions on behalf of their constituents.\nBut he faced pointed questions from opposition members about what kind of deal the government had done with independents in order to secure their support.\nThe government is seeking to push through a plan to introduce extra speaking time slots in the Dáil for independents who want to question the country's leaders.\nSome of those independents supported and even helped to negotiate the current programme for government.\nHowever, they now want dedicated Dáil time to hold ministers to account, something that opposition parties argue would undermine democracy.\nThe row has been rumbling since January, when loud protests from opposition parties led to turbulent scenes in the Dáil, which had to be repeatedly adjourned.\nThe protests resulted in a one-day delay to the re-election of Micheál Martin as taoiseach (Irish prime minister).\nIn early February, the Ceann Comhairle (parliament speaker) ruled the initial plan - which would have seen those independents treated as part of the opposition for the purposes of speaking time - could not proceed.\nOn Wednesday, the Dáil Reform Committee voted to approve a plan that would see the creation of new question time slots for independent members.\nIrish national broadcaster RTÉ reported that the government defended the plan in a two-page document circulated to the Dáil Reform Committee, which started a \"modern parliament is not necessarily made up of 'government' and 'opposition' members\".\nIt added \"there are members who can't readily be categorised as such,\" referring to independents who support the government but do not have ministerial posts.\nIt has also said the plan would mean independents have their own speaking time that would not take away from opposition speaking time rights.\nIf voted through, the plan would mean about 60 Dáil members would be allowed to question the taoiseach and the tánaiste on a weekly basis.\nHarris argued on Thursday that all TDs (Irish parliament members) should be allowed to ask questions on behalf of their constituents and he vowed to defend that right.\nHowever opposition parties have been highly critical - in a joint statement they said it was \"another cynical attempt to manipulate speaking time in order to grant special privileges to TDs who were part of negotiating the programme for government and clearly and unambiguously support the government\".\nSinn Féin's Matt Carthy said the government was plunging the Dáil into chaos while Labour TD Duncan Smith said the government were \"defending the indefensible\".\nMartin's Fianna Fáil party won the most seats in November's general election but not enough to form a government on their own.\nIt entered a coalition with Fine Gael and several independents to gain a majority, but some of those independents sought to form a \"technical group\" that would have seen them afforded speaking time and other rights from the opposition benches.", "url": "https://www.bbc.co.uk/news/articles/c0kggxm6gevo"}