{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:58", "date_modify": "2025-05-19 15:36:58", "date_publish": "2017-08-21 00:00:00", "description": "The latest news, sport, travel and weather for Coventry and Warwickshire.", "filename": "news_live_uk-england-coventry-warwickshire-40973948_1747669018.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-coventry-warwickshire-40973948_1747669018.html", "title": "BBC Local Live: Coventry & Warwickshire", "title_page": "BBC Local Live: Coventry & Warwickshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hundreds of jobs to go as city car firm closes\nCaroline Gall\nBBC News Online\nUp to 500 jobs are to go at an automotive firm that supplies Jaguar Land Rover (JLR) from the car giant's former home on Brown's Lane.\nLawrence Automotive bought the site from JLR in 2010 and began supplying wood trim panelling for various models.\nBut according to Des Quinn, regional officer for the Unite union, promised investment in key areas by the Chinese owners never happened, placing the firm in \"terminal decline\".\nHe says the premises will close in November.\nQuote Message\nWe have commenced the consultation process with our employees which we are legally obliged to do and currently we do not know what the outcome of that process will be. We are fully committed to the consultation process.\"\nSally Williams, UK HR Director, Lawrence Automotive\nWeather Watchers capture clear start to the day\nBBC Weather Watchers\nAtmospheric shots taken by two of our Weather Watchers today show we had a clear start in the county.\nWeatherWatcherWill was out early to capture this picture in Long Itchington.\nAnd PaulaMaria snapped this beautiful image in Hillmorton just after dawn.\nThe sunshine has given way to cloud now, which is expected to last most of the day.\nShopping centre transformation plans on table\nAlec Blackman\nBBC Coventry & Warwickshire\nCoventry's run-down Riley Square Shopping Centre is set to be transformed if councillors give regeneration plans the go-ahead later.\nThe city council's cabinet is recommended to approve plans to overhaul the site with new shop units and affordable housing.\nSome of the area's high-rise blocks would be knocked down as part of the project.\nA report , externalto councillors says: \"The shopping centre has an outdated design and suffers from a lack of significant investment and is in a poor physical condition.\"", "url": "https://www.bbc.com/news/live/uk-england-coventry-warwickshire-40973948"}