{"authors": ["James Delaney", "www.facebook.com"], "date_download": "2025-04-26 07:25:31", "date_modify": "2025-04-26 07:25:31", "date_publish": "2025-02-28 00:18:12", "description": "The US president is invited to a royal estate in Scotland to discuss the logistics of a second state visit.", "filename": "news_articles_cly4403gjxdo_1745652331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6211/live/b52ae440-f55f-11ef-9dd3-3538510401a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly4403gjxdo_1745652331.html", "title": "Donald Trump could meet King Charles in Scotland to plan state visit", "title_page": "Donald Trump could meet King Charles in Scotland to plan state visit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US president Donald Trump has been invited to meet King Charles in Scotland to discuss an unprecedented second state visit to the UK.\nPrime Minister Sir Keir Starmer used a trip to the White House on Thursday to present the president with an official letter from the monarch offering a meeting at either Dumfries House or Balmoral Castle to discuss the logistics.\nA meeting in Scotland would be Trump's first return to the country, where he has family and business connections, since 2023.\nThe Scottish government said First Minister John Swinney, who endorsed rival Kamala Harris in last year's election, would work to \"strengthen\" ties between the two countries.\nTrump was hosted by the late Queen Elizabeth for a three-day state visit during his first presidential term in 2019.\nSecond-term US presidents are traditionally not offered state visits and have instead been invited for tea or lunch with the monarch, usually at Windsor Castle.\nBut King Charles' letter proposed a meeting in Scotland, where Trump owns two golf courses, to discuss arrangements for a second state visit.\nThe letter suggested meeting at either Dumfries House in Ayrshire, which the King's Foundation has owned since 2007, or Balmoral Castle in Aberdeenshire.\nTrump appeared taken aback by the letter, but after taking a minute to read it he said he accepted the invite and that it would be an \"honour\" to visit the \"fantastic\" country.\nJohn Swinney has previously said he would use Trump's affinity for Scotland in a bid to avoid tariffs being applied on imports to the US, particularly on Scotch whisky.\nSwinney had publicly backed Harris, the Democratic nominee, in the run up to the 2024 presidential election.\nBut he had a phone conversation with the new president in December and said afterwards Trump had been keen to \"express his enthusiasm for Scotland\".\nA Scottish government spokesperson: said: \"The first minister will continue to ensure Scotland has a constructive relationship with the United States and will do all he can to strengthen the social, cultural, and economic ties between the two countries.\"\nThe prime minister said it was a \"privilege and an honour\" to deliver the King's letter to Trump, adding he \"looked forward to welcoming\" the president to the UK.\nMeanwhile the Scottish Greens have said Donald Trump is not welcome in Scotland, with co-leader Patrick Harvie forecasting \"protests and a great deal of anger\" around the visit.\nHarvie said Trump was a \"dangerous, misogynistic, racist climate-change denier\".\nHe told BBC Scotland's Lunchtime Live programme: \"Rolling out the red carpet in this way and showing this cringe-worthy deference is just sickening.\n\"It's just a few days since John Swinney said to all political parties and to civil society leaders in Scotland that he wanted to bring us together for a summit to unite against the far right. I don't think he can do that on one day and shake Donald Trump's hand the next.\"\nScottish ministers controversially granted planning permission for the course, overriding local councillors who denied the application.\nBut it ran into considerable opposition, not least from those who live nearby after Trump repeatedly demanded they move so the project could be completed.\nTrump accused local farmer and salmon fisherman Michael Forbes of living in a \"pig like atmosphere\".\nThe countryside agency NatureScot said after construction that sand dunes in the area no longer merited being retained as a Site of Special Scientific Interest (SSSI).\nQuestions have also been raised over the promised investment after it emerged the course had racked up £13.3m in losses since it opened, as of March 2024.\nThe original proposal included approval for a 450-room hotel, 950 holiday apartments, 36 golf villas and 500 houses.\nNone of those have materialised, and the course had an employee roll of just 81 as of March last year.\nWe had broadly expected to see Donald Trump pop up in Scotland at some point. The president owns two golf courses here, and his mother famously hails from the Isle of Lewis.\nBut his trip has taken on a whole different level of pomp now, with the prime minister hand-delivering an invitation from the King to visit a royal estate.\nIt was part of a charm offensive - which included the gift of a golf cap in Trump's family tartan - which seems to have paid off for Sir Keir Starmer, at least in the form of warm words.\nThe invite was calculated to play to the president's ego - Mr Trump always loves the idea of being the first in history to get something, and Sir Keir repeatedly underlined that this is the first time a president has been offered a second state visit rather than a lunch at Windsor Castle.\nThe prime minister has to break bread with the US president regardless of how well their views and values might mesh, and that attitude is mirrored by First Minister John Swinney.\nHe may have backed Mr Trump's rival Kamala Harris during the election, but he took a call from the president-elect following his win.\nAnd he's hinted that he could try to use Mr Trump's roots to try to avoid the prospect of tariffs being imposed on Scottish goods being imported to the US - which after all is a big market for things like whisky.", "url": "https://www.bbc.co.uk/news/articles/cly4403gjxdo"}