{"authors": ["Smitha Mundasad", "www.facebook.com"], "date_download": "2025-04-26 06:28:11", "date_modify": "2025-04-26 06:28:11", "date_publish": "2025-02-27 11:36:43", "description": "A different strain of the winter vomiting virus is now on the rise, UK health experts say.", "filename": "news_articles_cqlyy2e5w4vo_1745648891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7f51/live/f3470390-f4ff-11ef-b291-5f578a7db71a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqlyy2e5w4vo_1745648891.html", "title": "Health chiefs warn of potential second norovirus wave", "title_page": "Health chiefs warn of potential second norovirus wave - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People who have already had norovirus, the winter vomiting bug, could be at risk of catching it again this season, experts from the the UK's Health Security Agency say.\nData shows a different strain of the virus is on the rise and having had one strain doesn't necessarily protect you from catching another, they advise.\nNorovirus can be particularly severe for young children, older adults and people with weakened immune systems.\nCases are currently still \"exceptionally high\" with numbers at more than double the five-season-average for this time of year, latest figure show.\nAmy Douglas, Lead Epidemiologist at the UKHSA, said the biggest impact was being seen in hospitals and care homes.\n\"With multiple genotypes spreading at the same time, people could end up getting infected more than once this season,\" she added.\nCases have been higher than expected partly because of the emergence of a recent strain of the virus called GII.17, but also because of improved ways of testing for the virus.\nData now shows that a different, but more commonly seen strain, is on the rise.\nThis means people who have already had the bug could catch it again as having one version of the virus does not fully protect you against the other.\nThere is no suggestion that either strain leads to more severe illness than expected, however.\nNorovirus cases usually starts to decline as the weather warms up, but the UKHSA says it is too soon to work out whether cases have peaked.\nThe total remains close to its record high, with an average of 1,134 patients a day in hospital with norovirus last week – down slightly on the previous week (1,160), but still nearly two and a half times that seen in the same period last year.", "url": "https://www.bbc.co.uk/news/articles/cqlyy2e5w4vo"}