{"authors": ["Giles Taylor", "www.facebook.com"], "date_download": "2025-04-26 04:04:33", "date_modify": "2025-04-26 04:04:33", "date_publish": "2025-03-03 18:45:46", "description": "A total of eight people have now been arrested, and weapons have been seized, police say.", "filename": "news_articles_c2ljkq5v0ydo_1745640273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8804/live/ce6da4b0-f857-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ljkq5v0ydo_1745640273.html", "title": "More arrests after stabbing of boy near Nottingham Castle", "title_page": "More arrests after stabbing of boy near Nottingham Castle - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police have said three more people have been arrested and six weapons seized aftera boy was stabbed near Nottingham Castle.\nEmergency services were called to Hounds Gate in Nottingham city centre at 23:42 GMT on Friday and a 17-year-old boy was taken to hospital with serious injuries, police said.\nNottinghamshire Police said a second boy, 17, and a 16-year-old girl were also injured at an incident believed to have happened during a birthday party at a bed and breakfast.\nOn Monday, the force confirmed the number of arrests had risen to eight - five shortly the stabbing - and then a further three since.\nAn 18-year-old man and four 17-year-old boys who were arrested on suspicion of affray on Friday remain in custody, the force added, and three more people have since been detained.\nAssistant Chief Constable Suk Verma said the attack had been an isolated incident and that detectives were working \"round the clock\" as an investigation continues.\nHe said: \"We understand that it was a birthday party, and we understand and believe that there are connections between the individuals who were there.\n\"It was an Airbnb.\n\"It wasn't in a licensed premises, and the reality is that we are just unpicking through those at the moment.\n\"It is believed that they were connected and known.\"", "url": "https://www.bbc.co.uk/news/articles/c2ljkq5v0ydo"}