{"authors": ["Steve Jones", "www.facebook.com"], "date_download": "2025-04-26 08:09:54", "date_modify": "2025-04-26 08:09:54", "date_publish": "2025-02-26 12:44:16", "description": "Pair used van with false plates to travel from Bradford to Cumbria to target CEX shops.", "filename": "news_articles_cm2d3r7nezxo_1745654994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/98a4/live/e5a5de90-f43d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2d3r7nezxo_1745654994.html", "title": "Bradford burglars cycled to shop raids on e-bikes", "title_page": "Bradford burglars cycled to shop raids on e-bikes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two \"professional burglars\" from Bradford have been jailed after stealing almost £60,000 worth of goods from a high-street retailer.\nStewart Walton, 43, and his 40-year-old accomplice Liam Brogden were sentenced at Carlisle Crown Court on Monday.\nThe court heard they travelled to Cumbria from West Yorkshire on 23 July and 26 July last year and stole £57,000 worth of items from two CEX shops in Carlisle and Workington.\nSentencing, Judge Michael Fanning said each burglary \"required a high degree of planning and significant organisation\".\nProsecutor Brendan Burke described the men as \"professional burglars\" who had travelled from West Yorkshire in a Fiat van fitted with false number plates to commit their crimes in the dead of night last summer.\nThe duo parked the van away from their shops they targeted, cycling to them on electric bikes.\nCCTV footage on 23 July captured them carrying a heavy drain cover, metal security fence base and a stone before breaking the window of Carlisle's CEX store on Scotch Street.\nOnce inside, they snatched mobile phones valued at £27,000 before fleeing.\nWalton and Brogden were back in Cumbria three nights later when a car jack was used in an attempt to force open the shutters on the CEX shop on Pow Street, Workington.\nAfter eventually gaining access, they were said to have made off with £30,000 worth of goods which included mobile phones, laptops, iPads and a keyboard.\nRoadside cameras caught the pair making their way back to the Bradford area after both raids.\nNether the loot nor their van was ever recovered, the court heard.\nIn a victim impact statement, the franchisee of the Workington store said he lost two members of staff due to the \"stress\" caused by the burglary.\nHaving to close the shop for a day cost £3,000, they added.\nFather-of-five Walton, of Percy Street, Keighley, and Brogden, of Dawson Mount, Bradford, both pleaded guilty to two commercial burglary charges.\nWalton, who the court heard had previous convictions for similar offences, was jailed for five years.\nBrogden was said by his barrister to be \"extremely remorseful\", recognising the impact his offending was having on immediate family members.\nHe was jailed for three years and seven months.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cm2d3r7nezxo"}