{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 03:45:36", "date_modify": "2025-04-26 03:45:36", "date_publish": "2025-03-05 06:17:31", "description": "The Walton Well Drinking Fountain, in Oxford, was installed on the site of a natural spring in 1885.", "filename": "news_articles_cvgwnpp34kjo_1745639136.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c63/live/ff27c290-f8f0-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwnpp34kjo_1745639136.html", "title": "Victorian drinking fountain in Oxford to be fully restored", "title_page": "Victorian drinking fountain in Oxford to be fully restored - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 19th Century drinking fountain is set to become fully functional as part of a project to restore it to its \"former glory\".\nThe Walton Well Drinking Fountain, in Oxford, was installed on the site of a natural spring in 1885.\nIn the ensuing years the structure has decayed and is now in \"urgent need of restoration\", according to the Oxford Preservation Trust (OPT).\nThe group has secured enough funds to begin the work to return the \"historically significant\" fountain to full working order.\nAnna Eavis, chief executive of OPT, said: \"Oxford Preservation Trust is delighted to be restoring the Walton Well drinking fountain so it can once again provide fresh drinking water for the local community.\"\nThe trust launched its fundraising campaign to restore the fountain in October last year, with the work set to begin this summer.\nThe work includes repairing the stone fountain, replacing the lost stone finial, the reinstatement of a safe drinking water supply and the installation of a bench.\nAn accompanying information panel explaining the fountain's role in Jericho's history will also be installed.", "url": "https://www.bbc.co.uk/news/articles/cvgwnpp34kjo"}