{"authors": ["Peter Hoskins", "www.facebook.com"], "date_download": "2025-04-26 06:35:47", "date_modify": "2025-04-26 06:35:47", "date_publish": "2025-02-27 06:10:24", "description": "Kwek Leng Beng, the chairman of property giant CDL, has accused his son of plotting a boardroom coup.", "filename": "news_articles_cy4llggnvvdo_1745649347.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02b1/live/69bcd760-f4bb-11ef-8ae9-c53e74c70a6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4llggnvvdo_1745649347.html", "title": "Succession-like feud engulfs one of Singapore's richest families", "title_page": "Succession-like feud engulfs one of Singapore's richest families - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Succession-like feud has engulfed one of Singapore's richest families as property tycoon Kwek Leng Beng accused his son of plotting a boardroom takeover.\nMr Kwek says he has filed court papers accusing his son Sherman of trying to take control of their real estate firm City Developments Limited (CDL). Sherman Kwek has denied the allegation.\nKwek Leng Beng, who is CDL's executive chairman, is also seeking to fire his son, who is the chief executive.\nCDL, Singapore's biggest listed property developer, has halted trading in its shares on the financial hub's stock exchange.\nThe feud has sparked comparisons with the HBO television series Succession, in which the fictional Roy family fight for control of the global media firm Waystar RoyCo.\n\"We intend to change the chief executive officer at the appropriate time,\" Kwek Leng Beng said in a statement.\n\"As a father, firing my son was certainly not an easy decision.\"\nBut the octogenarian added: \"This is necessary to deal with this attempted coup at the board level and restore corporate integrity.\"\nIf Sherman Kwek is removed as chief executive, his father said he plans to replace him on an interim basis with his cousin Kwek Eik Sheng.\nThe dispute centres on an email sent by CDL's corporate secretary nominating two additional independent directors on the night of 28 January, the eve of the Lunar New Year - which marks the start of a major holiday in Singapore.\nThe row has attracted public attention in a part of the world in which battles over family businesses are not uncommon and have been known to end up in court.\nAfter Wednesday's court hearing, Kwek Leng Beng said the two new directors had agreed to not exercise any powers until further notice.\nThe company has said Sherman Kwek would remain in the role until the issue was resolved.\nSherman Kwek said he and the majority of CDL's board were disappointed by what he described as extreme actions taken by his father \"regarding this disagreement around the size and make-up of the CDL board.\"\n“To reiterate, this has never been about ousting our esteemed chairman. These steps to strengthen our board have purely been to ensure CDL has the highest standards of governance to which it has become known,\" he said in a statement to the BBC.\nKwek Leng Beng, along with his father and brother, took control of then-loss-making CDL in 1971. He became the firm's executive chairman after his father's death in 1995.\nIt now has more than 160 hotel, residential and commercial properties around the world and forms part of a multi-billion dollar family empire.", "url": "https://www.bbc.co.uk/news/articles/cy4llggnvvdo"}