{"authors": ["Christine Sexton", "Mariam Issimdar", "www.facebook.com"], "date_download": "2025-04-26 08:08:39", "date_modify": "2025-04-26 08:08:39", "date_publish": "2025-02-26 13:27:05", "description": "Andrew Jefferies says he is \"passing on the baton\" as the local authority works on devolution plan.", "filename": "news_articles_clyj48p7xqwo_1745654919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ca3/live/87635810-f43a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj48p7xqwo_1745654919.html", "title": "Leader of Conservative group at Thurrock Council leaves role", "title_page": "Leader of Conservative group at Thurrock Council leaves role - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of a Conservative group at a cash-strapped council has resigned from the role.\nAndrew Jefferies said: \"After nearly two years leading the Conservatives locally, and having had the absolute honour to lead the council from 2023 to 2024, I have taken the decision to step back.\"\nHis resignation comes as local government changes are set to see the creation of larger unitary authorities, with the likelihood of a directly elected mayor post for greater Essex in 2026.\nMr Jefferies, who will continue as a councillor for Ockendon, said \"now was the time to pass on the baton\".\nHe added: \"This is a time of tremendous change in Thurrock as we embark on local government reorganisation and explore a devolution arrangement.\n\"I have decided that it is time for the Conservatives to have fresh leadership and am pleased to announce that councillor George Coxshall will take over while the process to elect a new leader takes place.\"\nMr Coxshall said his focus was on the council's budget meeting on Wednesday.\n\"It's one of the most important council meetings of the year so the priority is getting through the budget, then we'll have the conversations on what we want to do and who we want to elect as leader and deputy leader.\"\nThurrock Council went bankrupt after the discovery in 2022 of failed investments made between 2017 and 2020, which left the authority with a £1.3bn debt.\nFollowing elections in May 2024, Thurrock Council is now led by Labour's John Kent.\nIn January, Thurrock agreed with Southend Council - another unitary council - to work together on local government reform.\nThe government wants fewer councils in England and for each region to have its own mayor.\nDevolution plans could result in the number of local authorities in Essex being trimmed down from 15 to as few as two, and a new mayor for the county could be voted into office in 2026.", "url": "https://www.bbc.co.uk/news/articles/clyj48p7xqwo"}