{"authors": ["Lucy Clarke-Billings", "www.facebook.com"], "date_download": "2025-04-26 07:27:17", "date_modify": "2025-04-26 07:27:17", "date_publish": "2025-02-27 20:11:54", "description": "The UK has offered Trump an effective veto on the deal because of its implications for US security.", "filename": "news_articles_c5yxxjr8v2vo_1745652437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f9a7/live/8eaf5ae0-f545-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxxjr8v2vo_1745652437.html", "title": "Trump 'inclined' to back UK's Chagos Islands deal", "title_page": "Donald Trump 'inclined' to back UK's Chagos Islands deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump has indicated he would be prepared to back Prime Minister Sir Keir Starmer's deal to hand over sovereignty of the Chagos Islands to Mauritius.\nThe agreement includes a plan to lease back the strategically important US-UK military base on Diego Garcia at British taxpayers' expense.\nThe UK has offered Trump an effective veto on the deal because of its implications for US security, and allies of the president have criticised the plan.\nHowever the US president, speaking in the Oval Office alongside Sir Keir, said: \"We're going to have some discussions about that very soon, and I have a feeling it's going to work out very well.\"\nHe continued: \"They're talking about a very long-term, powerful lease, a very strong lease, about 140 years actually.\n\"That's a long time, and I think we'll be inclined to go along with your country.\"\nUnder the Chagos plan, the UK is expected to lease Diego Garcia for 99 years, with an option for a 40-year extension.\nHowever, progress has been delayed to allow the new US administration to look at details of the deal.\nForeign Secretary David Lammy had suggested on ITV's Peston programme the agreement could be off if it did not get the president's backing \"because we have a shared military and intelligence interest with the United States and of course they've got to be happy with the deal\".\nEarlier this month, Mauritian Prime Minister Navin Ramgoolam said US representatives would be present in negotiations over the islands.\nThe plan to cede sovereignty of the archipelago, known officially as the British Indian Ocean Territory, was announced in October 2024 after a deal was reached with former Mauritian leader Pravind Jugnauth.\nHowever, Jugnauth conceded defeat in a parliamentary election a month later, and Ramgoolam has criticised the deal negotiated by his predecessor.\nThe agreement has been mired in uncertainty after Trump's re-election as US president, given several US Republicans have argued it could deliver a potential security boost to China.\nSir Keir has also faced questions over whether the money to pay Mauritius for leasing back the military base would come out of the increase in defence spending announced earlier this week.\nMauritius, a former British colony, has long argued it was illegally forced to give the Chagos Islands away in return for its own independence in 1968.\nThe UK has come under increasing international pressure to hand over control of the archipelago after various United Nations bodies, including its top court and general assembly, sided with Mauritian sovereignty claims in recent years.\nThe previous Conservative government opened negotiations over their legal status in late 2022, but the party has attacked the agreement struck by Labour.\nSpeaking to the BBC's Today programme, shadow culture minister Stuart Andrew said the deal was \"not within British interests\".", "url": "https://www.bbc.co.uk/news/articles/c5yxxjr8v2vo"}