{"authors": ["Caitlin Wilson", "www.facebook.com"], "date_download": "2025-04-26 06:53:11", "date_modify": "2025-04-26 06:53:11", "date_publish": "2025-02-28 16:40:24", "description": "The United States has never had an official language since it was founded nearly 250 years ago.", "filename": "news_articles_cn9v1l80350o_1745650391.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1627/live/e61ae790-f5ea-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn9v1l80350o_1745650391.html", "title": "Trump to order English as US official language", "title_page": "Trump to order English as US official language - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump will sign an executive order on Friday making English the official language of the United States, according to White House officials.\nThe US president is also expected to scrap requirements that federal agencies provide language services to non-English speakers.\nThe US has never had an official language in the nearly 250 years since the country was founded.\nThe order is intended to improve government efficiency and promote national unity, according to White House officials.\nNearly 68 million of the country's 340 million residents speak a language other than English, according to the US Census Bureau, which includes more than 160 Native American tongues.\nFriday's executive order will roll back a policy from 2000 signed by former President Bill Clinton requiring government agencies and federal funding recipients to \"ensure that their programs and activities normally provided in English are accessible to LEP (low-English proficiency) persons\".\nAgencies will still be allowed to provide that language access to non-English speakers, according to White House officials.\nRepublicans have led efforts in the past to label English as the country's official language, with members of the House as recently as 2021 introducing legislation on it that failed.\nThose who opposed those efforts say that the country does not need an official language, pointing to the high numbers of people who speak it and to the country never having one, while also saying establishing one could promote discrimination against non-English speakers.\nDuring his presidential campaign last year, Trump included non-English languages in his statements calling for stricter immigration policies.\n\"We have languages coming into our country. We don't have one instructor in our entire nation that can speak that language,\" he told a crowd of supporters in February 2024.\n\"It's the craziest thing - they have languages that nobody in this country has ever heard of. It's a very horrible thing,\" he said.\nAnd during the 2016 campaign he said, \"This is a country where we speak English. It's English. You have to speak English!\"\nWhen the US was founded, most residents spoke English and those writing the country's constitution did not feel it was necessary to enshrine it as the official language and also did not want to alienate fellow new citizens who spoke German or other languages, according to most scholars.\nThe languages currently spoken the most in the US after English are Spanish, various Chinese languages, Tagolog, Vietnamese and Arabic, according to the Census Bureau.\nA further approximately one million people use American Sign Language, according to experts.\nApproximately 180 countries around the world designate official national languages, and most countries recognise multiple official languages.\nHowever, several countries besides the US do not have an official language, including the United Kingdom.\nThere are more than 30 US states which have designated English as the official language, while Alaska and Hawaii have also bestowed official status on several native languages.", "url": "https://www.bbc.co.uk/news/articles/cn9v1l80350o"}