{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:44:08", "date_modify": "2025-04-26 03:44:08", "date_publish": "2025-03-05 07:41:37", "description": "The four-mile run or walk will raise money for a statue to honour Hull's Headscarf Revolutionaries.", "filename": "news_articles_c17qwnx817yo_1745639048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4371/live/29e66120-f93d-11ef-95fb-d138264a2044.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qwnx817yo_1745639048.html", "title": "Headscarf Hustle returns to Humber Bridge", "title_page": "Headscarf Hustle returns to Humber Bridge - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A four-mile run or walk across the Humber Bridge is taking place for the second time to raise money for a statue to honour Hull's Headscarf Revolutionaries.\nThe Headscarf Hustle will take place on Sunday 9 March and participants will be offered a headscarf on entry.\nThe event will be hosted by local charity and athletics club Fitmums & Friends along with Curly's Athletes.\nThe Headscarf Revolutionaries were four women from Hull who fought to improve safety at sea after the Triple Trawler Disaster of 1968.\n58 men lost their lives at sea when the St Romans, Kingston Peridot and Ross Cleveland trawlers from Hull sank in what became known as The Triple Trawler Disaster.\nOnly one man, Harry Eddom, survived.\nA campaign was then set up by Lillian Bilocca, Christine Smallbone, Mary Denness and Yvonne Blenkinsop, who became known as the Headscarf Revolutionaries.\nThey established The Fisherman's Charter, a demand for better safety standards in the fishing industry, including a radio operator on every ship.\nThe Headscarf Hustle will start at 10:00 GMT at Humber Bridge Country Park in Hessle.\nIan Cuthbert of Headscarf Pride - a dedicated Facebook page to the Triple Trawler Disaster - said proceeds would support Fitmums & Friends and the campaign for a statue.\nSam Barlow BEM, chief officer and founder of Fitmums & Friends, said: \"We're excited to see local people coming together to be active and to walk or run a mile in honour of each of the four Headscarf Revolutionaries.\"\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c17qwnx817yo"}