{"authors": ["Jeremy Ball", "www.facebook.com"], "date_download": "2025-04-26 04:19:18", "date_modify": "2025-04-26 04:19:18", "date_publish": "2025-03-04 06:19:04", "description": "Ilhomjon Khudoyberdiev is from Tajikistan, but his job is based in Nottinghamshire.", "filename": "news_articles_cgkmmgle72xo_1745641158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/070e/live/1d162f20-f4f6-11ef-ab77-6b27a1316238.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmmgle72xo_1745641158.html", "title": "'I work away from home for months growing cabbages'", "title_page": "'I work away from home for months growing cabbages' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ilhomjon Khudoyberdiev used to have a comfortable job selling heating systems in Tajikistan.\nNow he spends several months of the year thousands of miles away from his family, growing cabbages for British supermarkets in a field in Ravenshead, Nottinghamshire.\nHe is one of 36 Tajik workers spending the winter at Hammond Produce on six-month seasonal worker visas.\nJon Hammond, the firm's managing director, said the cost of shopping bills would \"sky-rocket\" without workers like Mr Khudoyberdiev and his colleagues.\nMr Khudoyberdiev says he lost his old job in 2021 after the war in Ukraine stopped supplies of the equipment he was selling in Tajikistan.\n\"Everybody needs work and money,\" he said. \"I needed a job, that's why I came to the UK, and I like it.\"\nMr Khudoyberdiev says he could only make around $1,000, the equivalent to about £800, per month in Tajikistan.\nSeasonal workers at Hammond Produce earn at least the minimum wage, known officially as National Living Wage, which is currently £11.44 an hour for over 21s.\nHe said: \"I earn money here, [then go back] home and spend six months with my family.\"\nThis is Mr Khudoyberdiev's third winter working away from his wife and children, who he keeps in touch with via WhatsApp and email.\nHe faced a difficult moment last winter when he missed the birth of his baby son.\n\"I was happy, but I wanted to go home and see him,\" Mr Khudoyberdiev said, adding his wife told him to stay and finish his work.\nMr Hammond said it was \"fantastic\" to see Mr Khudoyberdiev's elation at the birth of his son \"despite him being thousands of miles from home\" at the time.\nHis company farms two-and-a-half thousand acres in Nottinghamshire and says the entire UK food industry is reliant on overseas workers.\nHe said: \"It's extremely difficult to find UK nationals prepared to do this kind of work for the remuneration that we can offer.\n\"Everyone is on the minimum wage or above, but it's tough work, very physically demanding.\"\nMr Hammond added: \"Without any shadow of a doubt, the cost of our weekly shop would go through the roof. It would sky-rocket.\"\nThe government's seasonal agricultural worker scheme will see 43,000 visas be made available to the horticultural industry in 2025.", "url": "https://www.bbc.co.uk/news/articles/cgkmmgle72xo"}