{"authors": ["Jake Wallace", "www.facebook.com"], "date_download": "2025-04-26 04:31:39", "date_modify": "2025-04-26 04:31:39", "date_publish": "2025-03-03 06:11:02", "description": "The hub is one of seven funded by the government to tackle NHS net-zero challenges.", "filename": "news_articles_cewkkk84ez2o_1745641899.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0b7/live/87d754e0-f511-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkkk84ez2o_1745641899.html", "title": "Exeter University leads £6.5m hub to cut NHS carbon footprint", "title_page": "Exeter University leads £6.5m hub to cut NHS carbon footprint - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A £6.5m hub that will research ways to help the NHS reduce its carbon footprint will be led by the University of Exeter.\nThe centre is one of seven funded by £42m government investment across the UK, each tackling different net-zero challenges.\nThe Exeter hub will work with various UK partners to identify ways to make the NHS environmentally sustainable and meet its net-zero target by 2045. , external\nThe centre's director Prof Ed Wilson said: \"We'll be looking at a patient's journey through the NHS and social care, finding where the carbon hotspots are and seeing what we can do to make them carbon neutral.\"\nThe NHS said it had already reduced its carbon footprint and was on course for an 80% reduction on 1990 levels of emissions directly in their control by 2030.\nHowever, emissions have increased from travel, waste and from companies who make drugs, devices and supplies used by hospitals and care facilities.\n\"This isn't just about reducing travel and unnecessary waste but about helping the NHS' suppliers - the companies who make our drugs, medical devices and everyday items like swabs, sheets and hospital gowns - to redesign their processes to reduce carbon emissions,\" said Prof Wilson.", "url": "https://www.bbc.co.uk/news/articles/cewkkk84ez2o"}