{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:34", "date_modify": "2025-05-19 15:29:34", "date_publish": "2015-01-30 06:26:28", "description": "The chief electoral officer says a primary school in County Tyrone will no longer be used as a polling station after loyalist protesters demonstrated outside it during last year's elections.", "filename": "news_uk-northern-ireland-31051806_1747668574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80685000/jpg/_80685765_howardprimaryschoolinmoygashel1(2).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31051806_1747668574.html", "title": "Howard Primary School dropped as polling station after loyalist protest", "title_page": "Howard Primary School dropped as polling station after loyalist protest - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A primary school will no longer be used as a polling station after loyalist protesters demonstrated outside the school during last year's elections.\nAlternative arrangements are being made for people who have, until now, cast their vote at Howard Primary School in Moygashel, County Tyrone.\nThe decision was made by the chief electoral officer Graham Shields.\nHe said it would help to ensure all voters can exercise their right to vote in a \"peaceful and safe environment\".\nDuring the European and council elections in May 2014, a group of loyalists held a protest outside Howard primary school.\nObservers from the Electoral Commission were at the school and raised concerns about what they described as a hostile environment.\nThe Electoral Office has now published details of what polling stations will be used in Northern Ireland until 2019. Howard Primary School is not on the list.\nVoters who previously used the school will now be assigned to polling stations in Dungannon and Eglish.\nThe MP for Fermanagh South Tyrone, Sinn Féin's Michelle Gildernew, has welcomed the decision to close Moygashel polling station. The move has been criticised by the DUP's Lord Morrow.\nMs Gildernew said that the presence of a large number of hostile flag protestors outside the polling station in Moygashel on election day for the European election deterred many people from voting and exercising their democratic right.\nShe said she had expressed \"serious concerns\" to the commission following last year's loyalist protest.\nIn a statement, Mr Shields said: 'It is regrettable that electors from the Moygashel and Coolhill wards will be inconvenienced by having to travel further to cast their vote on polling day.\n\"However, my priority is to ensure that all voters, regardless of their background, have the opportunity to exercise their democratic right to vote in a peaceful and safe environment.", "url": "https://www.bbc.com/news/uk-northern-ireland-31051806"}