{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:13:24", "date_modify": "2025-04-26 04:13:24", "date_publish": "2025-03-04 11:41:21", "description": "Former PCs Neil Churchley and Michael Salmon are sentenced for perverting the course of justice.", "filename": "news_articles_c70wxw9x950o_1745640804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f310/live/3392a5f0-f8e6-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70wxw9x950o_1745640804.html", "title": "Met PCs sentenced for lying over Hayes police pursuit", "title_page": "Met PCs sentenced for lying over Hayes police pursuit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two former Metropolitan Police officers have been sentenced for perverting the course of justice after lying about the circumstances surrounding a police pursuit.\nNeil Churchley, 40, and Michael Salmon, 50, were on patrol in a police car in Hayes, west London, on 5 July 2023 when they started to pursue a motorcycle that had failed to stop.\nThe chase ended with the motorbike passenger injuring her leg. Both officers misled colleagues about who was driving and former PC Salmon destroyed body-worn video cameras belonging to both officers.\nThe former officers had admitted the offence and were given suspended sentences of six and eight months respectively at Southwark Crown Court on Friday.\n\"They let their colleagues and the public down,\" Supt Martin Kirby said after the sentencing.\n\"This is not the type of behaviour we expect or will tolerate from our officers and appropriate action has been taken.\"\nPartial remains of the cameras, which may have contained evidence of the pursuit, were recovered from Salmon's garden.\nSome hours later, Churchley reported the matter to his line manager, who in turn referred it to the Directorate of Professional Standards.\nSalmon was arrested at his home address on 6 July 2023 for perverting the course of justice and theft. He was interviewed under caution at a police station and was suspended from duty on the same day. He remained suspended until his retirement in September 2023.\nFormer PC Churchley was interviewed under caution on 9 July 2023. He was placed on restricted duties until he resigned in November 2024.\nAn accelerated misconduct hearing on 31 January found both officers, who were attached to Met Operations, would have been dismissed without notice had they been serving.", "url": "https://www.bbc.co.uk/news/articles/c70wxw9x950o"}