{"authors": ["Aimee Dexter", "www.facebook.com"], "date_download": "2025-04-26 07:04:12", "date_modify": "2025-04-26 07:04:12", "date_publish": "2025-02-28 07:33:58", "description": "The Reverend Canon Dave Bull is consecrated as the new Bishop of Buckingham.", "filename": "news_articles_c7899mye8vlo_1745651052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1389/live/dbfb05a0-f51e-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7899mye8vlo_1745651052.html", "title": "Former atheist now the new Bishop of Buckingham", "title_page": "Former atheist now the new Bishop of Buckingham - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former atheist has been consecrated as a bishop during a service led by the Archbishop of York.\nThe Reverend Canon Dave Bull was announced as the new Bishop of Buckingham during a service on Thursday.\nIn an interview with BBC Three Counties Radio in December, the Bishop of Buckingham, Bishop Bull said he was an atheist until his mid-20s.\nHe described the task ahead as an \"exciting prospect\".\nThe service was held at Canterbury Cathedral, where two reverends were consecrated, meaning they were formally dedicated to religious service.\nHis appointment follows the unexpected death of the Right Reverend Dr Alan Wilson in February last year, who had served in the role for more than 20 years.\nDuring an interview on BBC Three Counties Radio on Thursday, he said: \"It feels like an enormous privilege to be invited to lead the whole county.\n\"It feels a bit daunting, I will be honest with you, it is quite a big step to take.\"\nHe added: \"One thing I think I bring is that I have, until today, been a vicar in a small town, in touch, if you'd like, with local communities.\"\nBishop Bull said he realised in his mid-20s that \"there was something missing\" in his life.\n\"I believe that everyone at some point in their life explores spiritual questions and faith,\" he added.\nBull studied at Worcester College, Oxford, and trained for ministry at Wycliffe Hall in the city.\nIn 2009 he was ordained as a priest and was appointed area dean of Wycombe in 2016.", "url": "https://www.bbc.co.uk/news/articles/c7899mye8vlo"}