{"authors": ["Wendy Hurrell", "www.facebook.com"], "date_download": "2025-04-26 03:46:03", "date_modify": "2025-04-26 03:46:03", "date_publish": "2025-03-05 06:07:04", "description": "Some say high fees and visa costs outweigh positives of diverse culture and high earning potential.", "filename": "news_articles_cpv4kw7pr0eo_1745639163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe9a/live/739c9690-f9ba-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4kw7pr0eo_1745639163.html", "title": "Immigration: How will decline in international students impact London?", "title_page": "Immigration: How will decline in international students impact London? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A reduction in the number of international students would hurt university finances and damage the wider London economy, an education organisation has warned.\nLondon Higher said one cohort of international students generated £9.6bn for the capital's economy.\nHome Office statistics indicate there was a drop of 14% in student visa applications in the 2023/24 year compared to the previous 12 months.\nSo why are students finding London less attractive than they used to?\nAt the Docklands campus at the University of East London (UEL), groups of young people relax in the crisp spring sunshine. Ten thousand international students attend the three sites in Newham, representing 160 different nationalities.\nStudying in London often represents a substantial investment for their families, and international students typically pay far higher fees than UK students.\nSome said high fees and the cost of visas outweigh the positives of London's diverse culture and high earning potential.\nIn London, study-related visas account for nearly 40% of all immigrants, with the highest proportion of international students come from China, India and Nigeria.\nJoanna Fayemi is from Nigeria and in her final term at UEL. She said she and some of her fellow students are paying fives times more than they would in their home country to get these degrees, \"so it's definitely not an easy process\".\nShe said it's worth it \"because it's great to have an international degree to my name because back in my home country, international degrees are well-respected.\"\nInternational students are entitled to apply for a two-year graduate visa after they finish their course. The cost can run into thousands of pounds.\nAkanksha Kumar stayed in London after her course at City St Georges, part of the University of London.\nShe is now an account manager for a marketing company, but she said job-hunting had been \"disheartening\" because offers would be retracted once employers found that she needed a sponsored visa.\nMs Kumar said: \"A lot of companies have specific quotas for sponsoring visas, which is completely disproportionate to the number of international students who do come into the country.\"\nNet migration - the number of people coming to the UK long term, minus those leaving, includes international students.\nIn an effort to reduce immigration numbers, the government reformed student family visas at the start of the year.\nNow, most students are not permitted to bring family members with them to the UK and Home Office figures show student family visa applications fell by 85% from 2023 to 2024.\nAnother alumnus of City St George's, Samson Folarin, returned to Lagos after his Masters degree, to take a job as an editor at a popular Nigerian newspaper.\nHe described himself as \"a passionate Nigerian\".\n\"I'm passionate about my country, I'm passionate about my journalism job - all I needed to do was to acquire the knowledge, the skills, get the right tools to be able to hold my own government accountable as well.\"\nHe said the new rules about student family visas make studying in Britain more difficult.\n\"For most international students, coming into the UK for a Masters, they do their studying while the dependents work to raise funds to support them.\n\"When the UK decides that we don't want dependents, we just want the students, you are taking away the support system.\"\nIn addition, fewer international students may mean a reduction in trade connections to entrepreneurial countries with young populations, such as India and Nigeria.\nMs Varvas said, those that return to their home countries \"become ambassadors for the university\", which can generate future business, trade and investment.\nThe mayor of London's growth plan states: \"London's universities are critical in providing a pipeline of world-class talent.\n\"We will back them to continue to attract international students, as well as supporting a stabilisation in their funding.\"\nMeanwhile the government is under continued pressure to reduce net migration.", "url": "https://www.bbc.co.uk/news/articles/cpv4kw7pr0eo"}