{"authors": ["Shivani Chaudhari", "www.facebook.com"], "date_download": "2025-04-26 03:51:15", "date_modify": "2025-04-26 03:51:15", "date_publish": "2025-03-05 12:00:41", "description": "Mark Donovan is given a life sentence for murdering mother-of-two Elise Mason at his home.", "filename": "news_articles_cm2jzgrey35o_1745639475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/93d0/live/14267210-f9b7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzgrey35o_1745639475.html", "title": "Great Baddow man who murdered estranged wife is jailed", "title_page": "Great Baddow man who murdered estranged wife is jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who strangled and beat his estranged wife to death has been handed a life sentence.\nElise Mason's body was found with more than 70 injuries at Mark Donovan's home in Great Baddow near Chelmsford in April 2023.\nDonovan had a drink at his local pub after killing the 37-year-old mother-of-two, before handing himself in at a police station in east London.\nThe 40-year-old, of Rothmans Avenue, Great Baddow, was given a minimum 18-year sentence at Chelmsford Crown Court.\nHe refused to enter the dock for the hearing.\nJurors at Donovan's trial were told their relationship broke down in 2022, but that he suspected she had found a new lover.\n\"This was a brutal attack on a defenceless woman; on a woman who was attempting to leave the house,\" said Judge Chris Morgan.\n\"You killed her in a jealous rage because she sent a message to her boyfriend.\"\nHe added: \"You attempted to destroy her newfound happiness.\"\nThe trial was told Ms Mason left her mother's house at 15:50 BST on 25 April and was seen on CCTV approaching Donovan's home at 16:09.\nHe said he invited her to the home - that they previously shared - and was giving her a present ahead of her 38th birthday.\nShe texted her new partner \"you OK babe?\" at 16:42, but his reply - \"course babe\" - was never marked as read.\nThe court heard Donovan threatened to harm her and her boyfriend in February 2023, and that he was serving a suspended sentence at the time for an assault charge, and had broken his restraining order.\nAfter strangling her and inflicting more than 70 injuries, including striking her with a table lamp, he had a drink in the nearby Blue Lion pub.\nThe 40-year-old handed himself in at a police station in Ilford in the early hours of the morning, having bought a Chinese takeaway.", "url": "https://www.bbc.co.uk/news/articles/cm2jzgrey35o"}