{"authors": ["Martin Eastaugh", "www.facebook.com"], "date_download": "2025-04-26 06:57:26", "date_modify": "2025-04-26 06:57:26", "date_publish": "2025-02-28 14:17:30", "description": "Three men are standing trial over the theft of the gold toilet which had been part of an exhibition.", "filename": "news_articles_crknnyjljm7o_1745650646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e698/live/3294f740-f29f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crknnyjljm7o_1745650646.html", "title": "Gold toilet was used by theft-accused before heist, court hears", "title_page": "Gold toilet was used by theft-accused before heist, court hears  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man accused of stealing a £4.8m golden toilet used it on a visit to Blenheim Palace the day before the heist, describing it as \"splendid\", a court has heard.\nThe artwork, called America, was taken from the stately home in Oxfordshire in the early hours of 14 September 2019, two days after it went on display.\nMichael Jones, 39, from Oxford, denies one count of burglary. Frederick Doe, 36, from Windsor and 41-year-old Bora Guccuk, from west London, both deny conspiring to transfer criminal property.\nGiving evidence, Mr Jones said he had visited the exhibition the day before and been \"at home in bed\" when the toilet was stolen.\nThe 18-carat gold, fully-functional toilet was part of an exhibition by the Italian conceptual artist Maurizio Cattelan.\nThe court previously heard Mr Jones had visited the palace twice before the theft.\nProsecution barrister Julian Christopher KC asked Mr Jones why he had taken a half-day off work on the Friday to visit the palace, rather than waiting until the weekend.\nMr Jones admitted he did not often book half-days off work to go to museums and exhibitions but it was because he \"was interested to go and see it\".\nMembers of the public booked slots to use the toilet in its cubicle as part of the exhibition.\nPhotos he had taken were again listed to the jury and Jones said he took many of them because they were \"interesting\" views or pieces of art.\nOne was of the window later broken to steal the gold toilet, jurors were told.\nA lock on the cubicle to the toilet was also photographed.\nJones said it was because he thought it was \"quite funny that you could actually lock yourself in the toilet\".\nQuestioned if he \"took advantage of\" the gold toilet's \"facilities\", he told the court that he did make use of it.\nCrispin Aylett KC, defence counsel for Mr Doe, asked Mr Jones \"what was it like?\" and Mr Jones replied \"splendid\".", "url": "https://www.bbc.co.uk/news/articles/crknnyjljm7o"}