{"authors": ["Soutik Biswas", "www.facebook.com"], "date_download": "2025-04-26 07:49:30", "date_modify": "2025-04-26 07:49:30", "date_publish": "2025-02-26 22:32:33", "description": "Tamil Nadu’s iron artefacts may predate Turkey's Anatolia, reshaping early Iron Age history.", "filename": "news_articles_c62e36jm4jro_1745653770.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9e03/live/a54c8640-e7b4-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62e36jm4jro_1745653770.html", "title": "Earliest iron use found in India? Tamil Nadu digs spark debate", "title_page": "Earliest iron use found in India? Tamil Nadu digs spark debate - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For over 20 years, archaeologists in India's southern state of Tamil Nadu have been unearthing clues to the region's ancient past.\nTheir digs have uncovered early scripts that rewrite literacy timelines, external, mapped maritime trade routes, external connecting India to the world and revealed advanced urban settlements, external - reinforcing the state's role as a cradle of early civilisation and global commerce.\nNow they've also uncovered something even older - evidence of what could be the earliest making and use of iron. Present-day Turkey is one of the earliest known regions where iron was mined, extracted and forged on a significant scale around the 13th Century BC.\nArchaeologists have discovered iron objects at six sites in Tamil Nadu, dating back to 2,953–3,345 BCE, or between 5,000 to 5,400 years old. This suggests that the process of extracting, smelting, forging and shaping iron to create tools, weapons and other objects may have developed independently in the Indian subcontinent.\n\"The discovery is of such a great importance that it will take some more time before its implications sink in,\" says Dilip Kumar Chakrabarti, a professor of South Asian archaeology at Cambridge University.\nThe latest findings from Adichchanallur, Sivagalai, Mayiladumparai, Kilnamandi, Mangadu and Thelunganur sites have made local headlines such as \"Did the Iron Age Begin in Tamil Nadu?\" The age marks a period when societies began using and producing iron widely, making tools, weapons and infrastructure.\nParth R Chauhan, a professor of archaeology at the Indian Institute of Science Education and Research (ISSER), urges caution before drawing broad conclusions. He believes that iron technology likely emerged \"independently in multiple regions\".\nAlso, the \"earliest evidence remains uncertain because many regions of the world have not been properly researched or archaeological evidence is known but has not been dated properly\".\nIf the Tamil Nadu discovery is further validated through rigorous academic study, \"it would certainly rank amongst the world's earliest records\", Mr Chauhan says. Oishi Roy, an archaeologist at ISSER, adds that the find \"suggests parallel developments [in iron production] across different parts of the world\".\nEarly iron came in two forms - meteoritic and smelted. Smelted iron, extracted from ore, marked the true beginning of iron technology with mass production. The earliest known iron artefacts - nine tubular beads - were made from meteoritic iron, which comes from fallen meteorites.\nIdentifying iron-bearing rocks is the first challenge. Once located, these ores must be smelted in a furnace at extremely high temperatures to extract the metal. Without this process, raw iron remains locked within the rock. After extraction, skilled ironsmiths shape the metal into tools and implements, marking a crucial step in early ironworking.\nMost sites in Tamil Nadu where iron has been found are ancient habitation areas near present-day villages. Archaeologists K Rajan and R Sivanantham say that excavators have so far explored a fraction of over 3,000 identified Iron Age graves containing sarcophagi (stone coffins) and a wealth of iron artefacts. In the process, they uncovered hoe-spades, spears, knives, arrowheads, chisels, axes and swords made of iron.\nAt burials excavated at one site, over 85 iron objects - knives, arrowhead, rings, chisels, axes and swords - were found inside and outside burial urns. More than 20 key samples were robustly dated in five labs worldwide, confirming their antiquity.\nSome finds are particularly striking.\nHistorian Osmund Bopearachchi of the Paris-based French National Centre for Scientific Research highlights a key discovery - an iron sword from a burial site, made of ultra-high-carbon steel and dating to 13th–15th Century BC.\nThis advanced steel, a direct evolution of Iron Age metallurgy, required sophisticated knowledge and precise high-temperature processes.\n\"We know that the first signs of real steel production date back to the 13th Century BC in present-day Turkey. The radiometric dates, external seem to prove that the Tamil Nadu samples are earlier,\" he said. Ms Roy adds that the early steel in Tamil Nadu indicates the people there \"were iron makers, not just users - a technologically advanced community evolving over time\".\nAlso, in a site called Kodumanal, excavators found a furnace, pointing to an advanced iron-making community.\nThe furnace area stood out with its white discolouration, likely from extreme heat. Nearby, excavators found iron slag - some of it fused to the furnace wall - hinting at advanced metalworking techniques. Clearly the people at the site were not just using iron, but actively producing and processing it.\nTo be sure, the Tamil Nadu excavations are not the first in India to uncover iron. At least 27 sites across eight states have revealed evidence of early iron use, external, some dating back 4,200 years. The latest Tamil Nadu digs pushes back the antiquity of Indian iron by another 400 years,\" archaeologist Rajan, who has co-authored a paper on the subject, told me.\n\"The Iron Age is a technological shift, not a single-origin event - it develops in multiple places independently,\" says Ms Roy, noting earlier discoveries in eastern, western and northern India.\n\"What's clear now,\" she adds, \"is that indigenous iron technology developed early in the Indian subcontinent.\"", "url": "https://www.bbc.co.uk/news/articles/c62e36jm4jro"}