{"authors": ["Yasmin Rufo", "www.facebook.com"], "date_download": "2025-04-26 06:47:34", "date_modify": "2025-04-26 06:47:34", "date_publish": "2025-03-01 12:08:19", "description": "Members of the public used a defibrillator when Paul Benson went into cardiac arrest on the Tube.", "filename": "news_articles_c743n94j7djo_1745650054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/01f2/live/58c1a460-f68a-11ef-9dad-2d98b18c0719.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c743n94j7djo_1745650054.html", "title": "Man who survived cardiac arrest on Tube reunites with paramedics", "title_page": "Man who survived cardiac arrest on Tube reunites with paramedics - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Tube passenger who went into cardiac arrest has been reunited with the paramedics who saved his life.\nPaul Benson, 67, collapsed in the pedestrian tunnel at Liverpool Street station as he and his wife Lorraine, 59, were on their way to catch the Elizabeth Line.\nMembers of the public stopped to perform chest compressions and used the station's defibrillator before ambulance clinicians arrived on scene.\nMr Benson has also thanked the \"good Samaritans\" who kept him alive until the paramedics arrived.\n\"It's important that Londoners aren't frightened to stop and help. It's very easy to walk past but those who step in can save lives.\n\"They can't make it any worse but they can certainly make it better. Thanks to their help I've been able to carry on with my life.\"\nAn off-duty nurse, doctor and pharmacist were nearby and started chest compressions immediately while someone ran to find the defibrillator at the station.\nMr Benson was then taken by paramedics to the nearest Heart Attack Centre at St Bartholomew's Hospital where he had bypass surgery.\nParamedic Jackson Day, one of the ambulance crews who treated Paul on scene, said: \"It was great to meet Paul and see such a positive outcome for him.\n\"I've worked at London Ambulance Service for nearly seven years and this was my first time meeting someone I've treated who suffered a cardiac arrest. It was a really special moment.\"", "url": "https://www.bbc.co.uk/news/articles/c743n94j7djo"}