{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 07:40:34", "date_modify": "2025-04-26 07:40:34", "date_publish": "2025-02-27 12:05:04", "description": "Kent Police and Crime Commissioner Matthew Scott was in the BBC Radio Kent hot seat on Friday.", "filename": "news_articles_c9deeq4g67no_1745653234.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5619/live/57a80910-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deeq4g67no_1745653234.html", "title": "Kent Police and Crime Commissioner announces £1.5m funding boost", "title_page": "Kent Police and Crime Commissioner announces £1.5m funding boost - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kent will receive a £1.5m boost to provide more policing in crime hotspots, the county's Police and Crime Commissioner (PCC) has revealed.\nMatthew Scott said Kent Police would receive new funding from the government to \"put more visible policing out in your streets\" and \"make you feel safer\".\nThe PCC added that there were still \"difficult decisions to be made\" on finances, adding there would be job cuts within the force.\nMr Scott made the announcement on BBC Radio Kent's hot seat with Dominic King on Thursday, when he also spoke about \"disgraceful\" court backlogs, council tax rises and cannabis issues.\nHe said: \"It's new money from central government. We are going to try and make that money go further and see what more we can do to make our community safer.\"\nAnswering listeners' questions about policing in Kent, Mr Scott also said an upcoming increase in council tax would allow the force to reduce its savings gap.\nListen: Kent PCC Matthew Scott's hotseat interview\nHe added that Kent Police \"understands the cost of living pressures people have\" but was balancing this with the level of service provided and \"balancing the books\".\nMr Scott conceded that the force would lose some non-front line policing jobs, however.", "url": "https://www.bbc.co.uk/news/articles/c9deeq4g67no"}