{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:48:26", "date_modify": "2025-05-21 07:48:26", "date_publish": "2025-03-28 00:00:00", "description": "A rescue team in Mandalay, the city closest to the earthquake's epicentre, tells the BBC they \"are digging people out with our bare hands\".", "filename": "news_live_c4gex01m7n5t_1747813706.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a2a/live/ef8e7760-0cc4-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c4gex01m7n5t_1747813706.html", "title": "Death toll passes 1,600 after Myanmar-Thailand earthquake as hundreds remain trapped under rubble", "title_page": "Death toll passes 1,600 after Myanmar-Thailand earthquake as hundreds remain trapped under rubble - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Second night of searches under way as pause in military operations announced\nJamie Whitehead\nLive reporter\nIt's been over 24 hours since an earthquake hit Myanmar so severely it caused a high-rise under construction 1,000km (621 miles) away in Bangkok to collapse.\nSo far we know that 1,644 people have been killed in Myanmar, the country's internationally-sanctioned military government said earlier on Saturday. In addition to this, 3,408 people are missing and 139 are missing.\nIn Bangkok, the latest official figures say that 11 people have died, 32 are injured and 83 missing, but Fire and Rescue Thailand have posted on Facebook saying another body has been recovered from the collapsed building in the capital.\nAs the search for survivors continues for a second night in both countries, friends and relatives are waiting anxiously for news of their loved ones, perhaps given a faint glimmer of hope after a woman was pulled from rubble in Mandalay after 30 hours.\nBut as rescue efforts continued in Myanmar, so did the violence. Air strikes by the military were reported in areas declared states of emergency.\nThe National Unity Government of Myanmar has announced that the People's Defence Force (PDF) will implement a two-week pause in offensive military operations, except for defensive actions, in earthquake-affected areas starting tomorrow.\nWe're going to pause our live coverage now but our colleagues in Singapore will be resuming when the sun rises over Thailand and Myanmar.\nUntil then, there's plenty across the BBC for you.\nMyanmar quake toll passes 1,600 as people dig for survivors with bare hands\nWatch the moment rescuers pull woman alive from the rubble\nPanisa Aemocha writes about the desperate search for survivors in rubble of 30-storey building\nAnd the major earthquake adds to war-torn Myanmar's troubles, writes Yvette Tan\nWhat caused the earthquake?\nThe earth's upper layer is split into different sections, called tectonic plates, which are all moving constantly. Some move alongside each other, whilst others are above and below each other.\nIt is this movement that causes earthquakes and volcanoes.\nMyanmar is considered to be one of the most geologically \"active\" areas in the world because it sits on top of the convergence of four of these tectonic plates - the Eurasian plate, the Indian plate, the Sunda plate and the Burma microplate.\nThere is a major fault called the Sagaing fault, which cuts right through Myanmar north to south and is more than 1,200km (746 miles) long.\nEarly data suggests that the movement that caused Friday's 7.7-magnitude earthquake was a \"strike-slip\" - where two blocks move horizontally along each other.\nThis aligns with the movement typical of the Sagaing fault.\nWe have a full explainer on what caused the earthquake and why it caused just one building in Bangkok to collapse\n'It just happened in a two-minute window' - construction worker at collapsed building\nIn Bangkok, we've been reporting on the collapse of an unfinished high-rise in the city's Chatuchak area following the earthquake.\nOur BBC Burmese colleagues in Bangkok spoke to construction worker Ko Myint Kyaw, who managed to escape the site by jumping from the third floor.\n\"When the quake hit, I was on the third floor scaffolding the building. When I felt it stronger, I just jumped and I escaped. When I touched the ground, I heard a loud bang and the building collapsed,\" he says.\n\"It just happened in a two-minute window if I was not mistaken. The building collapsed after two minutes when the quake started.\n\"I feel deeply sorry for my friends who are still missing and I am waiting here for them,\" Ko Myint Kyaw adds.\n'Even if we bring them to hospital, they can't treat them,' says rescuer in Myanmar\nKristina Volk\nBBC World Service\nA man from the Mandalay area I've been speaking to since yesterday is still trying to rescue people trapped under the rubble.\nHe and other residents don’t have any machines or rescue gear. He told me earlier: \"People are using their hands to remove the debris.\"\nFearing repercussions from the military junta, he wants to stay anonymous.\nThis morning, the rescuers found a child under the rubble who asked for water.\n\"I gave the child a straw so the water can reach through the debris. Sometimes I can hear voices that are calling for help,\" he says.\n\"We are trying to save the lives of the people trapped. But even if we manage to get them out and bring them to the hospital, they cannot treat them. There is no electricity or water.\"\nHe adds that a fuel shortage is making things harder, as they need it for water pumps and to transport the injured.\nNormally, many young people would help in situations like this, he says, but since the conscription law came in back in February 2024, many have fled or joined resistance groups.\n\"If they come back to the cities they will be arrested. So there are not too many young helping hands.\"\nTo learn more about the fighting between the military junta and resistance groups, take a look at our earlier explainer\nArmed wing of Myanmar's opposition says it will stop fighting for two weeks\nToday, we've been bringing you updates on military air strikes in areas of Myanmar declared states of emergency.\nWe can now report that the armed wing of Myanmar's National Unity Government (NUG) - formed by groups that oppose the military junta in power since 2021 - says it will not engage further and instead implement a two-week ceasefire so that much-needed aid can get into areas affected by yesterday's earthquake.\nThe People's Defence Force (PDF) says that in areas under its control, they will work with the UN and international aid agencies \"to ensure security, transportation, and the establishment of temporary rescue and medical camps\".\nAs a reminder, it's now more than 24 hours after a 7.7 magnitude earthquake struck Myanmar and it's understood that many areas remain cut off to aid.\nHere's an earlier post explaining who the NUG are and the complex political landscape in Myanmar since a military coup in February 2021\nMyanmar military air strikes 'outrageous' - UN human rights monitor\nRebecca Henschke\nBBC Eye reporter and former Asia editor\nThe UN has described the ongoing military air strikes as “completely outrageous and unacceptable”.\nTom Andrews, UN Special Rapporteur on Human Rights, told the BBC that it was \"nothing short of incredible” that the military was continuing to “drop bombs when you are trying to rescue people” in the wake of the devastating earthquake.\nHe called on the military regime - which seized power in a coup nearly four years ago - to stop all military operations. “Anyone who has influence on the military needs to step up the pressure and make it very clear that this is not acceptable,” he said.\nHe also warned that Myanmar’s military has a longstanding practice of denying aid to areas where resistance groups are active.\nIn the past relief efforts, he said the military have blocked aid and arrested aid workers.\n“I'm afraid I'm fully expecting that that will be the case with this disaster,\" he said.\n\"The junta does not reveal the truth it also has a habit of blocking humanitarian aid from getting to where it is most needed. They weaponise this aid. They send it to those areas that they have control of, and they deny it to areas that they do not.”\nMany buildings in Thailand built before 2007 not earthquake-proof - expert\nVicky Wong\nBBC News\nA structural engineering expert has told the BBC that fewer than 10% of buildings in Bangkok are quake-resistant.\nAmorn Pimarnmas, president of the Structural Engineers Association of Thailand, says a 2007 law requiring earthquake-resistant design only applies to new buildings. That means any built before 2007 \"are likely not to be designed for earthquakes\".\nHe says some buildings are designed to handle wind load – the force of wind on a structure – and may have some ability to resist quakes, but it's not guaranteed they'll hold up.\nHe also warns that ground shaking in Bangkok could be three to four times stronger because the city is built on soft soil.\n\"Thus, the structure can collapse,\" he says.\nThe difficulties of reporting from Myanmar\nOliver Slow\nLive reporter\nIt has been more than 24 hours since the earthquake struck Myanmar and it remains difficult to build an accurate picture of what the situation is there, particularly in the areas worst affected.\nWe are working closely with our BBC Burmese colleagues (not all who are based in Myanmar due to the difficulties faced by journalists there), while also trying to speak to officials, residents and journalists that are operating on the ground.\nI was a journalist in Myanmar before the 2021 military coup, and it was a challenging place to work from then, but has only grown more so since amid widespread conflict, economic turmoil and a crack down on media and dissenting voices.\nInternet is heavily restricted, with internet speeds slow even before the earthquake destroyed much of the country’s infrastructure – the scale of which is still not clear.\nThe military - headed by Senior General Min Aung Hlaing - who is facing an International Criminal Court arrest warrant – has also been accused of weaponising internet shut downs to stifle what is widespread resistance to military rule.\nJournalist safety is also an issue, with reporters facing the risk of torture, arrest or murder, according to Reporters Without Borders.\nAt least four journalists have been killed by the military since the coup, according to RSF, while 58 reporters are currently imprisoned.", "url": "https://www.bbc.com/news/live/c4gex01m7n5t"}