{"authors": ["James Landale", "www.facebook.com"], "date_download": "2025-04-26 04:03:26", "date_modify": "2025-04-26 04:03:26", "date_publish": "2025-03-03 20:51:46", "description": "BBC diplomatic correspondent James Landale considers the idea suggested by the French president.", "filename": "news_articles_ckg1r4g08kwo_1745640206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/119c/live/12acbf20-f85e-11ef-b809-97b36d89f5f9.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg1r4g08kwo_1745640206.html", "title": "Trump-Zelensky: Would one-month Ukraine truce work?", "title_page": "Trump-Zelensky: Would one-month Ukraine truce work? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Could a partial month-long truce between Russia and Ukraine be the key to unlocking a lasting peace between the two sides?\nPresident Emmanuel Macron of France believes so and he floated the idea during Sunday's summit of European leaders in London.\nIn an interview with Le Figaro newspaper, he proposed a four-week truce \"in the air, at sea and on energy infrastructure\". It would not cover ground fighting along the front line in the east.\n\"In the event of a ceasefire, it would be very difficult to verify [a truce] along the front was being respected,\" Macron told the newspaper.\nIn a separate interview, French Foreign Minister Jean-Noel Barrot said: \"Such a truce on air, sea and energy infrastructure would allow us to determine whether Russian President Vladimir Putin is acting in good faith when he commits to a truce. And that's when real peace negotiations could start.\"\nThis so far appears more of an idea than a fully worked-out plan and hard details are scarce. But the essence of the hypothesis would seem to divide the process of ending the fighting.\nAn initial short-term truce - something less permanent than a formal ceasefire - would provide a moment to test Russia's willingness to negotiate a peace. It would also potentially give an early political win for President Trump.\nIt would not involve any ceding of territory. And it could create the political space to allow serious talks to begin about a lasting peace.\nUnder the French proposal, a European \"assurance force\" would deploy to Ukraine to deter future Russian aggression only after any lasting ceasefire had been agreed.\nBritain's Ambassador in Washington, Lord Mandelson, appeared to give credence to the idea on Sunday in an interview with ABC News when he said: \"Ukraine should be first to commit to a ceasefire and defy the Russians to follow.\"\nBut on Monday UK government officials and ministers were cool about the French truce idea and emphasised it was not yet an agreed proposal. Armed Forces Minister Luke Pollard told the BBC's Today programme: \"A number of options that are being discussed at the moment. None of them have been agreed at this stage\".\nThe prime minister's spokesman said: \"There are clearly a number of options on the table. I'm just not getting into a running commentary on the options.\"\nItalian Deputy Prime Minister and Foreign Minister Antonio Tajani was more blunt, saying the idea was \"premature\", according to the Italian news agency Ansa.\n\"I believe that everything must be done together, Europe and United States, sitting at a table with Ukraine and Russia to reach a fair and especially a long-lasting peace,\" Tajani said. \"Therefore, it is still premature to see what to do, how to do it.\"\nThere are clearly difficulties with the idea. How would one measure a violation by an anonymous drone attack on a Ukrainian power plant? Why would Ukraine want to give Russian forces a free month to regroup and rearm?\nBut for all that, Western diplomats said the idea of a partial truce was not entirely \"blue-skies thinking\" by President Macron - a man known for floating ideas at international summits.\nThey said it could be part of the European ceasefire plans that are being worked on before being put to the Americans.\nClearly some fresh thinking may be needed to try to unlock the current impasse with the US and Ukraine still at odds and the Europeans struggling to find ways of repairing the diplomatic breach.\nEverything of course depends on what Ukraine and Russia think. On Sunday night Ukrainian President Volodymyr Zelensky was asked if he was aware of the French truce plan and said simply: \"I'm aware of everything.\"\nSo far there is no evidence the Russians would be willing to agree to a partial truce. As Zelensky said: \"Anyone who wants to negotiate does not deliberately hit people with ballistic missiles.\"", "url": "https://www.bbc.co.uk/news/articles/ckg1r4g08kwo"}