{"authors": ["Wayne Bavin", "Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 03:52:09", "date_modify": "2025-04-26 03:52:09", "date_publish": "2025-03-05 11:11:59", "description": "It hopes to revive speedway at Mildenhall Stadium after it sat out last year's season.", "filename": "news_articles_cn4y1nn8nzpo_1745639529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c8b/live/8fcd8010-f9ae-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4y1nn8nzpo_1745639529.html", "title": "Mildenhall Fen Tigers needs £40k for new safety barrier", "title_page": "Mildenhall Fen Tigers needs £40k for new safety barrier - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A speedway club said it needed to find an extra £40,000 for a new safety barrier to revive racing at its stadium.\nThe Mildenhall Fen Tigers, based at West Row, Suffolk, has been working to bring back racing after sitting out last year's season.\nIt has adopted a supporters' trust business model and had initially raised £10,000 for the revival.\nHowever Steve Ribbons, the man behind the plan, revealed the track needed new and bespoke foam-block safety barriers following an inspection.\nHe said the owner of Mildenhall Stadium decided to make improvements to benefit stock car racing at the site, which the speedway club had \"no problem with\".\nBut the Speedway Control Board needed to inspect the track to ensure it was also safe for speedway.\n\"It was found the solid stock car fence was more solid than we anticipated and there were concerns over the ability of existing air fence... that wouldn't be good enough to help the rider survive an impact with the fence,\" he said.\nMr Ribbons explained the club had applied for funding from Sport England and speedway organisations for the foam blocks, and would look to set up a fundraising page.\n\"The more we can raise from the wider speedway community and the fans, the less we have to borrow,\" he added.\nThe club initially wanted to be back racing by 3 May and, despite the setback, Mr Ribbons was confident speedway racing would still return in May.\n\"If we can stick to our revised schedule, subject to the manufacturers delivering on time, we only anticipated shifting it back to the end of May, possibly the beginning of June.\n\"That's the current state of play... let's see how this next couple of weeks pans out.\"", "url": "https://www.bbc.co.uk/news/articles/cn4y1nn8nzpo"}