{"authors": ["Ben Woolvin", "www.facebook.com"], "date_download": "2025-04-26 06:35:30", "date_modify": "2025-04-26 06:35:30", "date_publish": "2025-02-27 06:15:12", "description": "Work to bring people together in Plymouth is \"more needed than ever\", an organisation says.", "filename": "news_articles_c1jpgxegeeko_1745649330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/17eb/live/a419e530-f392-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpgxegeeko_1745649330.html", "title": "Migrant numbers are key to improving cohesion", "title_page": "Migrant numbers are key to improving cohesion - community leader - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work to bring people together in Plymouth is \"more needed than ever\" six months after violent immigration-related protests, a local community group leader says.\nDavid Feindouno is the founder of Plymouth Hope, external, a charity which runs events to strengthen bonds between people from different cultures.\nIt is one of 42 organisations awarded funding from Plymouth City Council's community recovery fund, external set-up to \"address the public disorder that happened last summer\".\nMr Feindouno said he hoped more information about who was coming to the country, and why, would help reduce tensions.\nHome Office figures show there are far fewer asylum seekers being supported in the south-west of England than in other parts of the UK.\nIn the year ending September 2024, Cornwall, Devon, Dorset and Somerset supported 1,177 asylum seekers, compared with the UK figure of 106,181.\nIt represents a rate of 42 per 100,000 people in the region, compared with 155 per 100,000 people across the UK.\nOxford University's Migration Observatory, external said figures from the Office of National Statistics (ONS) showed in the year to June 2024 about 40% of migrants from non-EU countries to the UK held a work visa, or were with their partner.\nDr Ben Brindle, a researcher at the observatory said that, in addition, many migrants on non-work visas could still work in the UK.\n\"International students can work for up to 20 hours a week and Ukrainians and other groups that have come on humanitarian visas can work as well\", he said.\nMany employers in the social care and hospitality sectors in the South West have said they remain dependent on migrant labour since Brexit.\n\"The health and care sector has been ever more important in the reasons that people are coming from overseas... as a result of high vacancies in the sector\", Dr Brindle said.\nThe 2021 UK census showed the overall population of the South West grew in 20 years, but less than the England average, at 11% compared with 15%.\nThe proportion of people living in the south west who were born outside the UK also rose in that time, but again less than across England.\nIt rose from 4% in 2001 to 7% in 2021 in the South West, compared with 9% in 2001 and 17% in 2021 in England.", "url": "https://www.bbc.co.uk/news/articles/c1jpgxegeeko"}