{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:15:42", "date_modify": "2025-04-26 08:15:42", "date_publish": "2025-02-26 10:36:10", "description": "A look at what stories are trending across the West of England on 26 February 2025", "filename": "news_articles_ckg17pvx5lno_1745655342.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/324e/live/ec75cab0-f423-11ef-9822-d3d66c578726.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg17pvx5lno_1745655342.html", "title": "Chaotic camera work at Cheltenham and hypnosis surgery study", "title_page": "Chaotic camera work at Cheltenham and hypnosis surgery study - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There has been a large number of responses on social media to the next phase of a \"cycle spine\" running between Bishop's Cleeve and Stroud in Gloucestershire is being implemented by the county council. You can read about the latest phase of this project here, external, reported by Gloucestershire Live.\nA rescue tiger named Aqua has come to Noah's Ark Zoo Farm – and the site is asking for help to raise £175,000 to build a new tiger habitat., external\nThe Strand in Cheltenham town centre has been resurfaced, external – which, as Gloucestershire Live reports, has \"raised eyebrows\". But as the paper says, the work hasn't been finished yet.\nAnd a mural in Old George Mall in Salisbury is almost done, external – which began in a \"dingy\" passageway in September 2023, says the Journal. It has been done by teacher and artist Samantha Redmill and is due to be finished in April.\nThere is a chaotic but entertaining bit of footage posted by Cheltenham Town on X after a fan picked up a pitch side camera during their late comeback draw , externallast night with Walsall\nA clinical nurse researcher at Musgrove Park Hospital is looking at whether hypnosis can help patients during surgery, external. Somerset NHS Foundation Trust says early results suggest they can experience less pain.\nAn appeal to find the person who assaulted a bus driver in December, external in Bristol has been posted on the Avon & Somerset Police X page. This has been widely shared on Facebook.\nAnd the Grand Pier in Weston-super-Mare is advertising a card for free entry , externalfor locals, following the historic site doubling their entry fees (read our version of that story here).", "url": "https://www.bbc.co.uk/news/articles/ckg17pvx5lno"}