{"authors": ["Olivia Fraser", "www.facebook.com"], "date_download": "2025-04-26 03:58:17", "date_modify": "2025-04-26 03:58:17", "date_publish": "2025-03-04 13:14:47", "description": "Cataract patients have turned to private healthcare to get their surgeries done quicker.", "filename": "news_articles_cn8rznlgld4o_1745639897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/62c8/live/7c281f40-f849-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8rznlgld4o_1745639897.html", "title": "Guernsey woman felt dumped waiting for cataract surgery", "title_page": "Guernsey woman felt dumped waiting for cataract surgery - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cataract patients in Guernsey have turned to off-island, private healthcare to get their surgeries done quicker.\nSusan Adam had been waiting more than a year to get her operations before being invited to take part in an off-island treatment plan.\nBut after HSC decided to end the initiative before she had her second eye done, Mrs Adam said she was left feeling \"dumped\".\nDeputy Marc Leadbeater, Vice-President of Health and Social Care (HSC), apologised for anyone feeling that way and said that generally feedback had been positive.\nMrs Adam had one eye successfully operated on in the UK though Newmedica.\nShe did not get the second one booked in before receiving a letter to say she would now be handed back to the Medical Specialist Group, which is contracted to provide secondary healthcare for islanders.\n\"The aim was to have your surgery done in eight to 10 weeks,\" Mrs Adam said.\nInstead of waiting, she decided to pay to stay with Newmedica for her second operation.\n\"You only have one set of eyes. I thought I'd go private and have it done with people I know, that I can trust and I was given an appointment there and then.\"\nPhillip Pattimore was told in November that he had an 18-month wait for his cataract surgery to be carried out locally.\nHe decided to have a private consultation in the UK.\nMr Pattimore said during it he was told his vision \"didn't have 18 months\" before it deteriorated too much for him to be able to drive.\n\"I retire in a couple month's time and I want to be able to do the bits and pieces I've been looking forward to,\" he said.\nHe is now due to get his surgery done in the UK in the next few weeks.", "url": "https://www.bbc.co.uk/news/articles/cn8rznlgld4o"}