{"authors": ["Riyah Collins", "www.facebook.com"], "date_download": "2025-04-26 07:51:59", "date_modify": "2025-04-26 07:51:59", "date_publish": "2025-02-25 14:40:49", "description": "Go Back To Where You Came From saw six Brits follow routes taken by refugees to reach the UK.", "filename": "news_articles_cq5zg266ly7o_1745653919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e811/live/5140b270-f35c-11ef-a4a4-ed784e2ede58.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zg266ly7o_1745653919.html", "title": "Go Back To Where You Came From: Has it changed anyone's mind?", "title_page": "Go Back To Where You Came From: Has it changed anyone's mind? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"In 10 years' time, Britain is going to be full of people wearing burqas.\n\"Islam will have taken over.\"\nChloe Dobbs' first words on Channel 4 reality show Go Back To Where You Came From didn't leave much room for doubt.\nThe 24-year-old YouTuber and conservative political commentator from Cornwall knows her opinions were \"controversial\".\nSo was the programme. Some charities accused it of platforming \"toxic views\" and giving a distorted idea of what refugees really go through.\nBut after being thrown in with five other Brits - all with differing views on immigration - has it altered anyone's thinking?\nIn the four-part series, filmed in May and June 2024, participants were split into two groups - one travelling from Syria, one from Somalia.\nThey spent weeks, accompanied by security teams, following the same routes refugees from Somalia and Syria use to reach the UK.\nRecent figures from the government, external suggest that more than 5,000 Syrians applied for asylum in the UK in the year ending September 2024, with 940 applications from Somalians.\nIn the same time period, 3,385 people arriving from Syria came on small boats - the third most common nationality to come to the UK this way.\nThe charity Freedom From Torture criticised the show as \"dehumanising and downright dangerous\", external.\nIt said genuine refugees would not have the same resources and the programme could \"never truly convey the unpredictability and the danger of what that journey actually feels like\".\nChloe travelled back to the UK from Syria, where the UN estimates 14 million people were forced to flee their homes after the outbreak of civil war in 2011.\nIn the series, she was seen clashing with fellow Brit Bushra Shaikh, who had a more sympathetic attitude towards migrants and refugees.\nSince returning to the UK Chloe says she's able to see the crisis more from her point of view.\n\"Purgatory is the word that I would use to describe the situation that so many people are in,\" says Chloe, having now seen the crisis close-up.\n\"We saw a lot of really heartbreaking stuff.\"\nMeanwhile, Mathilda Mallinson travelled to Somalia.\nThe 29-year-old journalist from London has previous experience working in refugee camps and tells Newsbeat she \"wasn't expecting to have my views on immigration drastically changed\".\nBut by spending so much time with the other participants, she says she has learned to be more understanding of different points of view.\n\"I really don't think that polarised, heated, angry debate gets anyone closer to the middle ground,\" she says.\n\"A key part of the journey for me was just listening to the reasons that people feel different ways.\n\"I was never going to be the person who helped them see... that was going to come from meeting refugees themselves.\"\nBoth Chloe and Mathilda agree that more needs to be done to build a better understanding of the migrant crisis in the UK.\n\"The bit that the media focuses on generally is the crossing from France to Britain,\" says Chloe.\n\"It's very easy to think, if you just watch the news in the UK, that all of the displaced people in the world, they're all coming to Britain.\n\"When actually there are millions and millions of people elsewhere in the world.\"\nMathilda agrees, saying she was taken aback by the scale of the problem away from Europe, which she rarely sees reported.\n\"It was so overwhelming to see the scale of the displacement crisis,\" she says of when they visited Dadaab in Kenya, formerly the world's largest refugee camp.\n\"This is what we need to see more of in our storytelling in our coverage of the refugee crisis, because it really helps to put into proportion what we are dealing with in the UK and and in Europe.\"\nNow back in the UK, Chloe says she received \"hateful messages\" when the show aired but her experience has definitely changed her views \"on a lot of things\".\nShe says she hasn't done a \"full 180\" from where she started and still advocates for \"very strong vetting processes\" for migrants who want to come to the UK legally.\nBut, she says: \"I started to really see these people, rather than just as criminals, as human beings who are in absolutely heartbreaking situation.\"\n\"It definitely gave me a heck of a lot more empathy for what people are going through.\"\nA Channel 4 spokesperson told Newsbeat it \"was important that the series represented a range of strong views on immigration in the UK\"\n\"In order to be able to challenge those views we needed to be able to air them,\" they said.\n\"The object of the programme is to enlighten and open minds to different perspectives.\n\"The contributors start with views, but those views are challenged and develop over the course of the series.\"\nResponding to criticism from charities like Freedom From Torture, Channel 4 said it had worked closely with \"a number of refugee charities... in order to ensure that lived experiences were accurately reflected as far as possible\".\n\"We acknowledge that the series cannot fully replicate the danger of undertaking the refugee journey for real,\" they added, but the \"exceptionally tight security protocol\" was put in place during filming \"as a duty of care to our contributors\".", "url": "https://www.bbc.co.uk/news/articles/cq5zg266ly7o"}