{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:56:19", "date_modify": "2025-04-26 03:56:19", "date_publish": "2025-03-04 15:12:17", "description": "Loganair opens a new base in Southampton that it says will create new local job opportunities.", "filename": "news_articles_c8x4v8evxy8o_1745639779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/66aa/live/73f0fc60-f8ef-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x4v8evxy8o_1745639779.html", "title": "Southampton: Loganair opens base a creates job opportunities", "title_page": "Southampton: Loganair opens base a creates job opportunities  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A regional airline says it will create local job opportunities as it announces its 10th regional base.\nLoganair will create the facility at Southampton Airport, generating new jobs for pilots, cabin crew and engineers.\nThe airline also plans to launch two new routes as well as increasing capacity for one of its existing flights.\nChief executive officer Luke Farajallah said: \"We are delighted to be announcing a new base which is a logical and important strategic step for the UK's largest regional airline.\"\nFrom the 26 October new routes from Southampton to Manchester and Manchester to Exeter have been added to the airline's timetable.\nCapacity has also increased from 49 to 72 passengers on the Southampton to Edinburgh route.\nNew routes via Manchester to Inverness and Aberdeen will also become available.\nKam Jandu, chief executive of AGS Airports that operates Southampton, said: \"Manchester is the most sought-after route by businesses across the region and was previously used by more than 200,000 passengers per year.\n\"The re-introduction of this route will further strengthen the economic ties between the two cities.\"\nMr Farajallah said: \"Southampton offers a unique location and we believe the markets, local people and businesses will respond well to our presence in this thriving part of the UK.\n\"We are also looking forward to welcoming our new team members who will be recruited from the local areas.\"", "url": "https://www.bbc.co.uk/news/articles/c8x4v8evxy8o"}