{"authors": ["Richard Evans", "www.facebook.com"], "date_download": "2025-04-26 04:12:05", "date_modify": "2025-04-26 04:12:05", "date_publish": "2025-03-04 12:36:24", "description": "Kashmiri Goats were gifted by Queen Victoria to Lord Mostyn, a prominent local landowner.", "filename": "news_articles_cgj5gl8zw3wo_1745640725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8ac5/live/acd21d40-f8f2-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj5gl8zw3wo_1745640725.html", "title": "Great Orme: 'World famous' goats rising in seaside town", "title_page": "Great Orme: 'World famous' goats rising in seaside town - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Despite a contraceptive programme aimed at managing their numbers, hundreds of baby goats continue to roam a north Wales peninsula, where the animals were gifted by Queen Victoria more than a century ago.\nFemale Great Orme Kashmiri Goats are rounded up every other year and given contraceptives to control their numbers.\nBut a count in 2023 revealed there were around 150 goats in the area, with the figure estimated to have now reached 180 – although an exact number will not be determined until a count is made this summer.\nThe goats gained global recognition during the Covid pandemic, and one resident said although they can be an annoyance in people's gardens, \"we love them really\".\nLlandudno councillor Louise Emery said breeding of the goats is allowed to \"make sure the line continues\", but that it has to be \"very carefully managed\".\nShe added that it was unlikely the contraceptive programme would take place this year, describing it as \"quite a task\", involving the female goats being rounded up into temporary fencing areas and injected with the contraceptive.\nMs Emery added that management did not take place during the Covid pandemic, with numbers reaching over 200.\n\"You did feel there was too many, and if you have too many it is not fair on them because the Orme is a small place,\" she said.\nOriginating in the mountains of northern India, the goats have roamed the Great Orme in a wild state for more than 100 years, since they were gifted to Lord Mostyn, a prominent local landowner, by Queen Victoria.\nThe goats used to be owned by the Mostyn estate but are now classed as wild animals.\n\"They do need to be carefully managed because we brought them here,\" Ms Emery said.\n\"They are not a native species, so we need to manage their numbers, otherwise, there will simply not be enough food for them.\"\nShe added that the goats gained \"worldwide recognition\" during the Covid pandemic.\n\"They have become synonymous with the town. The people on the Orme, we hate them when they are in our gardens, but we love them really.\"", "url": "https://www.bbc.co.uk/news/articles/cgj5gl8zw3wo"}