{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:23", "date_modify": "2025-05-19 15:30:23", "date_publish": "2017-07-17 00:00:00", "description": "The latest news, sport, travel and weather updates in Norfolk, Suffolk and Essex.", "filename": "news_live_uk-england-40612201_1747668623.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-40612201_1747668623.html", "title": "BBC Local Live: In Norfolk, Suffolk and Essex", "title_page": "BBC Local Live: In Norfolk, Suffolk and Essex - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage for the day:\nCaroline Kingdon\nBBC Local Live\nThat's all from the Norfolk Live team for the day... and for the week.\nThe stories making the news today include a family's tribute to the man who died following an assault at a supermarket and the attempted abduction into an RAF Marham airman is no longer an active police investigation.\nScroll down to take a look at these and the other news we've brought you today.\nWhatever you're doing this weekend, we hope you have a great time.\nWe'll be back at 08:00 on Monday.\nThe latest regional weather forecast\nJulie Reinger\nBBC Look East weather\nOutbreaks of rain will move eastwards this evening and overnight, heavy at times and accompanied by gusty winds.\nIt may stay dry in the extreme east until the early hours of tomorrow.\nTemperatures falling to 12C (54F).\nA wet start to tomorrow for many eastern areas, but drier and brighter in the west for a time.\nEventually widespread showers will develop, and some of these could be heavy and thundery. Onshore winds could prevent these showers towards the coast, and there will be spells of sunshine.\nTemperatures reaching 22C (72F).\nSunday will see sunny spells and scattered showers, which could be heavy and thundery.\nTake a look at BBC Weather for a more detailed forecast for where you are.\nYour help is needed in a 'bioblitz' race against time\nFrom the smallest insects to the largest mammals, nature conservation teams are coming together this weekend to help identify and record as many species of wildlife as possible.\nThe 24-hour bioblitz, external will stretch from Holme-Next-The-Sea to Salthouse... and your help is needed.\nRachael Wright, of the Norfolk Wildlife Trust, external, says they're encouraging people to join in with identifying the plants and animals... and no prior knowledge is needed.\n\"With the help of nature experts and volunteers we hope to discover as many species as possible,\" she said.\nThe coastline, which is designated an Area of Outstanding Natural Beauty, is home to a diverse mix of wildlife.\nThe National Trust held bioblitz surveys at Brancaster and Blakeney in 2015, which recorded high species counts and also a handful of wildlife firsts for the Norfolk coast.\nThese included the first ever recorded sightings of Balearic shearwaters at Blakeney and the Moss Carder bee at Brancaster.\nAjay Tegala, coastal ranger for the National Trust, say it's hoped this blitz will uncover many more wildlife treasures that have been previously unknown.\nAll wildlife discovered during the bioblitz will be recorded and submitted to local wildlife record centres and the National Biodiversity Network, external to help understand how wildlife along the coast is changing.\nClick here to find out, external how you can be involved.\nThousands rescued by armada of 'Little Ships'\nNic Rigby\nBBC News\nThe historic fishing boat from Essex which features in the new Dunkirk film first went over to Dunkirk in May 1940.\nThe Leigh-on-Sea boat the Endeavour (pictured above in the 1940s) answered the call for boats and volunteer crews to help rescue more than 300,000 British and French soldiers from the beaches (pictured below) above after the German invasion of France saw the army cut off.\nSkipper PO Halls and crews including James Stroud and Norman Ewing took part in Operation Dynamo on 31 May.\nThe boat, which was built in 1926, joined over 800 craft, dubbed the \"Little Ships\", which helped bring 338,000 soldiers to Britain.\nCharity the Endeavour Trust, external was set up in 2001 in order to restore and maintain the fishing boat and bring it back to its former glory.\nMurder victim's family paid tribute\nA man who was killed during an outbreak of violence in a supermarket in Wymondham has been described as a \"warm and caring soul\".\nSue Rogers, the mother of 26-year-old Nick Rogers, says \"words cannot describe the overwhelming gut-wrenching sadness and anger\" the family is feeling at his loss.\n\"We had a strong bond and while Nick didn't always get things right, he so desperately wanted to change his life for the better.\nPaying tribute to her son, she added: \"I hope that by donating your organs, the lives of others have been saved and you will live on with them.\n\"We hope they all lead a full life, something which was cruelly taken so suddenly from you. Night night, my beautiful special boy.\"\nNick's brother and sister, Cameron and Hope Steadman, also paid tribute to their brother.\n\"I miss you so much, wish you were still here,” said Cameron. \"I regret not saying how much I appreciated and loved you.\n\"It’s so sad to see you go at a time you started to take the reins on your life and steer on a good course. I’ll continue to remember the good time and make you proud.”\nHope said: \"It’s tough to know you won’t be around, to never see me get married, be an uncle and see my children grow up.\n\"It’s hard to believe it’s real – I still expect to see you come walking in the house and ask if I’m alright. Love and miss you so much, please watch over me and keep me safe.\"\nNick's stepfather Andrew Steadman said words could not describe the \"pain and heartbreak\" the family were going through.\n\"Behind the typical young lad bravado, Nick was a warm and caring soul and would always help others where and when he could. His loss will leave a huge void in our lives.\"\nTwo men from Wymondham have been charged with murder and of affray. They appeared at Norwich Crown Court this morning and were remanded in custody ahead of their next appearance.\nThey have yet to enter pleas.\nTransport in Chelmsford: 'We cannot continue upgrading junctions and roads'\nNic Rigby\nBBC News\nPeople in Chelmsford are being urged to have their say on plans for a major revamp of transport in the city.\nEssex County Council has launched a six-week consultation into a series of proposals on upgrading road, bus, cycle and walking infrastructure.\nDeputy leader Kevin Bentley says they're investing millions to make improvements, so it's vital people give them their views.\nHe said: \"Chelmsford roads are almost at capacity and we need to completely rethink how we travel.\n\"We cannot just continue to build new roads and upgrade junctions. That is why we have worked with our transport experts and local feedback to help create 30 solutions we believe can help keep Essex moving and support economic growth for residents and businesses.\n\"Please take five minutes out of your day check out the plans either online, external or at our consultation events and then give us your views on if they work for you.\n\"We are keen to ensure that we can deliver value for money on this £15m investment to help improve transport for everyone.\"\nSafety message to beach visitors\nThis weekend marks a year since a swimmer died after getting caught in a rip current at Sea Palling.\nLeszek Puchala, 52, who lived in Poland, was on holiday in Norfolk visiting family. He and another family member were pulled unconscious from the water. Beachgoers initially thought the men were enjoying themselves and shouting out in Polish, but rushed in to help when they realised they were in danger.\nEarlier this week the council announced it would be using social media to make people aware of the dangers of the sea - they'll be written in Polish as well as English.\n\"One tragedy is always one tragedy too many,\" said council leader Tom Fitzpatrick.\n\"No matter how safe we think we are, there's always room for improvement.\n\"We're pushing messages on social media, making sure people can go on our beaches and be safe, asking them to swim between the red and yellow flags and obey the signs.\"\nQuote Message\nOur coast looks benign, the water always looks inviting, but with strong rip tides the water can change... it's asking people to think, have a good time but know what to do if they get into difficulty.\"\nTom Fitzpatrick, Leader, North Norfolk District Council\nMore than 60 drivers caught using phones at the wheel\nMore than 60 tickets were issued in a week-long campaign to catch motorists who use their mobiles when at the wheel.\nOperation Ringtone saw police officers on patrol in marked and unmarked vehicles, all fitted with cameras to get evidence. In total 67 tickets were issued.\nDriving while using a mobile phone is one of the \"fatal four\" offences, alongside speeding, drink/drug driving and not wearing a seatbelt.\nNorfolk Police used the campaign to highlight that members of the public can submit dashcam footage to help in the fight against those breaking the law.\nCh Insp Kris Barnard says they hope having extra eyes on the road will help prevent offences and make people think twice about touching their mobile devices.\n'Moving film' Dunkirk features Essex fish boat\nRichard Smith\nBBC Essex\nA member of a charity which helped restore an historic fishing boat from Essex, which was involved in helping rescue British troops at Dunkirk, has spoken of the craft's involvement in a new film about the evacuation of hundreds of thousands of troops from the beaches of north east France.\nPaul Gilson (pictured above), of the Endeavour Trust, was one of three members who took the boat, the Endeavour (pictured bottom), to Dunkirk for the filming of scenes in the new Christopher Nolan film - called Dunkirk.\n\"It was an amazing experience and quite moving at times going on to the beach with the noise going on around,\" he said.\nMr Gilson said the film (pictured above) is \"pretty moving. I shed a couple of tears. It is hard-hitting and very different from any other film I have ever seen\".\nHannah Martin on target for England again\nGraeme Mac\nBBC Radio Suffolk sport\nWith exactly a year to go until the Women's Hockey World Cup, external in London, Suffolk's Hannah Martin (far left) appears to be doing her chances of making the England squad no harm at all.\nThe 22-year-old, who made her senior international debut earlier this year, was on the scoresheet again for England last night in a 1-1 draw with the USA at the World League Semi Final , externalin South Africa.\nThe Americans went on to to win the shoot-out which followed, meaning England will have to settle for a third placed play-off with Argentina on Sunday.\nMartin has mainly featured as a substitute at this event in Johannesburg, and has caught the eye with a series of impressive displays.\nOn Tuesday, she came off the bench to both score and create a goal, as England comfortably beat India 4-1.\nWhen it comes to talk of featuring at a home World Cup though, the former Ipswich Schoolgirl is not getting too carried away.\n\"It's at the forefront of my mind certainly, and it would be amazing to play in front of a big crowd with all the England games already sold out,\" Martin told us.\n\"But I have to get selected first. If I do the best that I can do on the pitch and train as hard as I can, then I put myself in with the best possible chance of making the squad.\"\nKing and Schlein target pairs glory for Ipswich\nGraeme Mac\nBBC Radio Suffolk sport\nIpswich Witches lifted their last piece of silverware two years ago, when Danny King and Rohan Tungate won the Premier League pairs title at Somerset.\nTonight, King (left) will represent the club once again at the Oak Tree Arena, and will team up with Australian rider Rory Schlein (right) on behalf of the Suffolk side.\nBoth riders have been in impressive form this season, and played their part last night in another big win for the Witches, that put them back on top of Speedway's Championship table, external.\n\"Things are going well,\" King told us.\n\"We're feeling good and I think we will win every meeting at home between now and the end of the campaign.\n\"I'm really confident going into tonight and Rory is as well. It's a track we both enjoy and we ride well together.\"\nKing and Schlein will be among the favourites for the pairs title, and will compete against riders from Glasgow, Peterborough, Workington and Scunthorpe in Group A.\nLittle things are key for 'efficient' Bury Rugby Club\nGraeme Mac\nBBC Radio Suffolk sport\nOllie Smith (pictured) has praised the set-up at Bury St Edmunds Rugby Club and says he is looking forward to taking charge of the team ahead of the Wolfpack's third campaign in National League Two South.\nThe former British and Irish Lion and England international was at the Haberden yesterday following his appointment earlier in the week, external.\nAlthough Bury have made a series of signings already this summer, the 34-year-old has hinted that there could be more, and he has also been telling us about the style of rugby he would like to see Bury adopt.\n\"One that wins and keeps a coach in the job!\" he joked.\n\"I like things done simply, but things done well.\n\"You really have to be mindful of the teams you are playing against and the pitches you are playing on. Conditions change throughout the season, so the players will need to be quick to adapt.\"\n\"I will take this group and build it in accordance with what it is capable of doing, but there is always a basis for where you start that, and that is good core skills and the ability to stay fit.\"", "url": "https://www.bbc.com/news/live/uk-england-40612201"}