{"authors": ["Alexandra Bassingham", "www.facebook.com"], "date_download": "2025-04-26 06:37:10", "date_modify": "2025-04-26 06:37:10", "date_publish": "2025-02-26 06:35:45", "description": "The multi-sensory hub, named in honour of boy who died in 2019, will open in the summer.", "filename": "news_articles_cly37mm1jklo_1745649430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/322b/live/78b47820-f36e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly37mm1jklo_1745649430.html", "title": "Family share son's 'light' with multi-sensory centre", "title_page": "Family share son's 'light' with multi-sensory centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A multi-sensory centre offering children and families with complex needs a space to \"laugh, play, and feel supported\" is due to open in the Forest of Dean.\nBrody's Sensory Hub will be based at the former Joys Green Primary School site, in Lydbrook, Gloucestershire.\nNikki and Mike Baggott have named the centre after their son who died in 2019 aged 10.\nThey are now calling on local businesses and volunteers to help prepare the sensory hub, which they hope to open in the summer.\nMs Baggott, chair of charity Brody's Trust, said: \"Brody's smile lit up every room [and] we want to share that light with others.\"\n\"Creating this space that Brody would have loved is both important and sad,\" Ms Baggott said, because there was nothing like it for them.\n\"We couldn't get carers because Brody was medically complex and they were too scared – and we would have to go to Worcester for the closest sensory play.\"\nHowever, she said if they took the hour trip, with all the equipment they needed, he would have had seizures and end up in hospital.\n\"You're getting three hours sleep a night because of the medical requirements and the only people you meet are in hospital,\" Ms Baggott said.", "url": "https://www.bbc.co.uk/news/articles/cly37mm1jklo"}