{"authors": ["Jean Mackenzie", "www.facebook.com"], "date_download": "2025-04-26 06:24:32", "date_modify": "2025-04-26 06:24:32", "date_publish": "2025-02-28 23:07:55", "description": "Travellers enter a mini capitalist enclave far from Pyongyang, on a tightly controlled visit.", "filename": "news_articles_c0jggdnej0do_1745648672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ed9c/live/7b5b3540-f67b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jggdnej0do_1745648672.html", "title": "First British tourists allowed back into North Korea tell BBC what they saw", "title_page": "First British tourists allowed back into North Korea tell BBC what they saw - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Don't insult the leaders. Don't insult the ideology. And don't judge.\nThese are the rules tour guides read out to Western tourists as they prepare to drive across the border into North Korea, arguably the most secretive and repressive country in the world.\nThen there is the practical information. No phone signal, no internet, no cash machines.\n\"The North Koreans aren't robots. They have opinions, goals, and a sense of humour. And in our briefing we encourage people to listen to and understand them,\" says Rowan Beard, who runs Young Pioneer Tours, one of two Western companies which resumed trips to the country last week, after a five-year hiatus.\nNorth Korea sealed its borders at the outset of the pandemic, shutting out diplomats, aid workers and travellers, and making it nearly impossible to know what was happening there.\nSince then, it has further isolated itself from most of the world, relying on support from Russia and China. Many doubted whether Westerners would ever be allowed back.\nBut after years of cajoling and several false starts, Rowan and some other tour leaders were given the green light to restart operations. He pulled together a group of eager travellers in just five hours, desperate to not miss the opportunity. Most were vloggers and travel addicts, some wanting to tick the final country off their list, along with the odd North Korea enthusiast.\nLast Thursday the tourists, from the UK, France, Germany and Australia, drove over the border from China into the remote area of Rason for a four-night trip.\nAmong them was 28-year-old British YouTuber Mike O'Kennedy. Even with its reputation, he was startled by the extreme level of control. As with all trips to North Korea, the tourists were escorted by local guides, who followed a strict, pre-approved schedule. It included carefully choreographed trips to a beer factory, a school, and a new, fully stocked pharmacy.\nBen Weston, one of the tour leaders from Suffolk, likened visiting North Korea to \"being on a school trip\". \"You can't leave the hotel without the guides,\" he said.\n\"A couple of times I even had to let them know when I wanted to use the bathroom,\" said Mike. \"I've never had to do that anywhere in the world.\"\nDespite the chaperoning, Mike was able to spot snippets of real life. \"Everyone was working, it didn't feel like anyone was just hanging out. That was kind of bleak to see.\"\nOn his trip to the school, a group of eight-year-olds performed a dance to animations of ballistic missiles hitting targets. A video of the spectacle shows girls and boys with red neckties, singing, while explosions flare on a screen behind them.\nFor now, tourists are being kept well away from the capital Pyongyang. Greg Vaczi from Koryo Tours, the other tour company allowed back in, admits the current itinerary lacks the \"big-hitting monuments\" of Pyongyang. He suspects authorities have chosen Rason as their guinea pig because the area is relatively contained and easy to control.\nSet up as a special economic zone, to trial new financial policies, it operates as a mini capitalist enclave inside an otherwise socialist state. Chinese businesspeople run joint enterprises with North Koreans, and can travel in and out fairly freely.\nJoe Smith, a seasoned North Korea traveller and former writer for the specialist North Korea platform NK News, was there on his third trip. \"I feel like the more times you visit the less you know. Each time you get a little peek behind the curtain, which just leaves you with more questions,\" he said.\nJoe's highlight was a surprise off-agenda visit to a luxury goods market, where people were selling jeans and perfumes, along with fake Louis Vuitton handbags and Japanese washing machines, probably imported from China. Here, the tourists were not allowed to take photos - an attempt to hide this consumer bubble from the rest of the country, they suspected.\n\"This was the only place people weren't expecting us,\" Joe said. \"It felt messy and real; a place North Koreans actually go. I loved it.\"\nBut according to the experienced tour leaders, the group's movements were more restricted than on previous trips, with fewer opportunities to wander the streets, pop into a barbershop or supermarket, and talk to locals.\nCovid was often cited as the reason, said Greg from Koryo Tours. \"On the surface they are still concerned. Our luggage was disinfected at the border, our temperatures were taken, and about 50% of people are still wearing masks.\" Greg cannot work out whether the fear is genuine, or an excuse to control people.\nIt is thought Covid hit North Korea hard, though it is difficult to know the extent of the suffering.\nLocal guides repeated the government line that the virus entered the country in a balloon sent over from South Korea, and was swiftly eradicated in 90 days. But Rowan, who has been to North Korea more than 100 times, sensed that Rason had been impacted by the tough Covid regulations. A lot of Chinese businesses had closed, he said, and their workers had left.\nEven Joe, the experienced North Korea traveller, commented on how dilapidated the buildings were. \"Places were dimly lit and there was no heating, apart from in our hotel rooms,\" he said, noting a trip to a cold, dark and deserted art gallery. \"It felt like they opened the doors just for us.\"\nThe regime's photographs might make North Korea look clean and shiny, Joe said, but in person you realise \"the roads are awful, the pavements are wobbly, and the buildings are weirdly constructed\". His hotel room was old-fashioned and filthy, he said, resembling \"his grandma's living room\". The whole window was cracked.\n\"They've had five years to fix things. North Koreans are so sensitive about what they show tourists. If this is the best they can show, I dread to think what else is out there\", he said. Most of the country is kept well hidden, with more than four in 10 people believed to be undernourished and needing help.\nMike admits there were times this made him nervous. On a trip to a North Korea-Russia Friendship House, he was invited to write in the visitors' book. \"I went blank and wrote something like 'I wish the world peace.' Afterwards my guide told me that was an inappropriate thing to write. That made me paranoid,\" he said.\n\"Generally, the guides did a great job of making us feel safe. There were just a couple of moments when I thought, this is bizarre.\"\nFor Greg from Koryo Tours, these interactions bring a deeper purpose to North Korea tourism: \"North Koreans get the chance to engage with foreigners. This allows them to come up with new ideas, which, in a country this closed, is so important.\"\nBut tourism to North Korea is contentious, especially as travellers have been allowed back before aid workers and most Western diplomats, including the UK's. Critics, including Joanna Hosaniak from the Citizens Alliance for North Korean Human Rights, argue these trips mainly benefit the regime.\n\"This is not like tourism in other poor countries, where local people benefit from the extra income. The vast majority of the population don't know these tourists exist. Their money goes to the state and ultimately towards its military,\" she said.\nOne conversation has stuck in YouTuber Mike's head. During his trip to the school, he was surprised when a girl, after meeting him, said she hoped to visit the UK one day. \"I didn't have the heart to tell her that her chances were very, very slim,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c0jggdnej0do"}