{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:33:50", "date_modify": "2025-04-26 06:33:50", "date_publish": "2025-02-27 06:31:23", "description": "A number of road closures will be in place as work continues to transform the major commuter route.", "filename": "news_articles_c4ge370zjv8o_1745649230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e82d/live/abdc0c60-f42f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ge370zjv8o_1745649230.html", "title": "A417 Missing Link: What's happening with the roadworks?", "title_page": "A417 Missing Link: What's happening with the roadworks? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A number of road closures will be in place as construction continues to transform the layout of a major commuter route.\nNational Highways is constructing four miles (6.4km) of new dual carriageway between Brockworth bypass with the existing A417 dual carriageway south of Cowley.\nThe authority said the revamped route was needed after \"frequent and unpredictable\" congestion and serious crashes.\nNext week, overnight closures will be in place between Wednesday and Friday on the A417 between the Air Balloon Roundabout and Burford Road Junction, from 21:00 until 06:00 GMT.\nNational Highways said so far, more than 420,000 cubic metres of earth has been moved in the £460m project, which is due to open to traffic in spring 2027.\nThe earthworks mean the foundations for the new bridges have now been laid.\nNational Highways have also started piling works at numerous areas, using a specialist drilling rig to install foundations, posts and walls.\nWorks have also begun on building a new section of the A417 at Cowley Junction.\nIn the meantime, the Cowley Roundabout contraflow system will be in place until 2027.", "url": "https://www.bbc.co.uk/news/articles/c4ge370zjv8o"}