{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:45:29", "date_modify": "2025-04-26 03:45:29", "date_publish": "2025-03-05 06:18:46", "description": "The coroner found Joshua Leatham-Prosser's ketamine use had locked him into a \"vicious cycle\".", "filename": "news_articles_crlxjpj36e0o_1745639129.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f92/live/21ed0d60-f99d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlxjpj36e0o_1745639129.html", "title": "Weymouth ketamine addict's death sparks coroner warning", "title_page": "Weymouth ketamine addict's death sparks coroner warning - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Concerns about young people's use of ketamine after a 25-year-old man died has led to a coroner writing to the home secretary.\nJoshua Leatham-Prosser was found dead at his Weymouth home on 5 June 2024, having used the drug since 2019.\nRichard Middleton, Dorset's assistant coroner, said Mr Leatham-Prosser \"did not perceive\" the Class B drug \"to be any more harmful than cannabis\".\nBut Mr Middleton said the impact on his bladder was \"akin to acid attacks on the skin\" and ketamine cystitis was an \"emerging epidemic\" amongst young people.\nThe latest government figures showed the drug's usage amongst 16 to 24-year-olds in England had tripled since 2016.\nMr Leatham-Prosser was in a \"vicious cycle\" where the only way to relieve symptoms was to take more ketamine, which meant the urinary problems caused by his addiction deteriorated, Mr Middleton added.\nDorset Coroner's Court heard Mr Leatham-Prosser, a welder who lived in St Leonard's Road, had been offered treatment in October 2024 for his bladder problems, which caused him \"significant pain\".\nMr Middleton said he had concerns about the \"highly addictive and harmful nature\" of ketamine and \"the increasing number of young people presenting with potentially fatal health problems linked to its use\".\nHe concluded Mr Leatham-Prosser's causes of death were urinary sepsis, chronic cystitis and pyelonephritis and chronic ketamine use.\n\"Patients seen by urologists are abusing the drug to the extent required to damage the urinary tract to the point of requiring major reconstructive surgery,\" Mr Middleton added, in a report that will be sent to home secretary Yvette Cooper.", "url": "https://www.bbc.co.uk/news/articles/crlxjpj36e0o"}