{"authors": ["Tom Bateman & Bernd Debusmann Jr", "www.facebook.com"], "date_download": "2025-04-26 06:24:27", "date_modify": "2025-04-26 06:24:27", "date_publish": "2025-02-28 23:58:52", "description": "There were major flashpoints throughout their meeting - here are four of the most animated.", "filename": "news_articles_c2erwgwy8vgo_1745648667.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8f04/live/c2aadeb0-f6bb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2erwgwy8vgo_1745648667.html", "title": "How the Trump-Zelensky talks collapsed in 10 fiery minutes", "title_page": "How the Trump-Zelensky talks collapsed in 10 fiery minutes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukraine's president had been hoping to leave the White House on Friday after positive talks with Donald Trump, capped with the signing of a minerals deal giving the US a real stake in his country's future, if not an outright security guarantee.\nInstead Volodymyr Zelensky faced an extraordinary dressing down in front of the world's media, after President Trump and his Vice-President JD Vance demanded that he show more gratitude for years of US support.\nThe Ukrainian president pushed back at suggestions from his more powerful partners that he should work harder to agree a ceasefire with Vladimir Putin. They responded that he was being \"disrespectful\".\nZelensky was eventually told to leave the White House early before he and Trump could even take the stage for a scheduled news conference.\nAnd the minerals deal, which had been trailed and praised by both sides this week, was left unsigned. \"Come back when you're ready for peace,\" Trump wrote on social media shortly before Zelensky's car pulled away.\nThere were several major flashpoints in the meeting. Here are four of the most fiery - and the politics and feeling that lies behind them.\nWhile there was half an hour of cordial talks and formalities at the start, tensions began to boil over in the Oval Office when Vance said the \"path to peace and the path to prosperity is maybe engaging in diplomacy\".\n\"That's what President Trump is doing,\" he said.\nZelensky interjected, referencing Russia's aggression in the years before its full-scale invasion three years ago including a failed ceasefire in 2019. \"Nobody stopped him,\" he said of Russian President Vladimir Putin.\n\"What kind of diplomacy, JD, are you talking about? What do you mean?\" he said.\nThe exchange then became visibly tense, with Vance replying: \"the kind that will end the destruction of your country.\"\nThe vice-president then accused Zelensky of being disrespectful and \"litigating\" the situation in front of the American media.\nIt was Vance's defence of Trump's approach to ending the war - by opening communications with Putin and pushing for a quick ceasefire - that first escalated tensions with the Ukrainian leader.\nAfter Vance challenged the Ukrainian president over problems he's had with the military and conscription, Zelensky replied: \"During the war, everybody has problems, even you. But you have a nice ocean and don't feel [it] now, but you will feel it in the future.\"\nThat comment rankled Trump and drew him into the clash that up until this point had been limited to Zelensky and the vice-president.\nHere was the Ukrainian leader suggesting Trump had failed to grasp the moral hazard of dealing with the war's aggressor.\nZelensky's message cut to the heart of what critics say is Trump's fundamental miscalculation in dealing with Russia. That by ending Moscow's isolation and seeking a quick ceasefire he risks emboldening Putin, weakening Europe and leaving Ukraine open to being devoured.\nTrump tends to characterise the war as a kind of binary conflict between two sides who should both take their share of burden or blame for the fighting and its causes.\nBut Zelensky was trying to warn of catastrophic consequences of this thinking. This was the Ukrainian leader directly telling Trump in the Oval Office: Appease Russia, and the war will come to you.\nIt triggered Trump's biggest backlash. \"Don't tell us what we're going to feel. You're in no position to dictate that,\" he said, his voice getting louder.\n\"You don't have the cards right now,\" he told him. \"You're gambling with millions of lives.\"\nThis exchange may win Zelensky plaudits among those who wanted to see him to stand up to Trump; but this moment could also decide an era of war and peace in Europe.\nAt one point later in the conversation, Zelensky said: \"From the very beginning of the war, we have been alone and we are thankful.\"\nThis angered Trump, who has repeatedly framed the war as a drain on American taxpayers.\n\"You haven't been alone,\" he said. \"You haven't been alone. We gave you - through this stupid president - $350bn,\" Trump said, a reference to Biden.\nVance then asked whether Zelensky had thanked the US during the meeting and accused him of campaigning \"for the opposition\" - the Democrats - during the US election last year.\nThe comment was a reference to a visit Zelensky made to a munitions factory in Scranton, Pennsylvania - Joe Biden's hometown - just weeks before Americans headed to the polls in the November election.\nRepublicans were outraged at the visit, accusing Zelensky of turning the tour into a partisan campaign event on Kamala Harris's behalf in a battleground state.\nHere was all the bitter division of America's own polarised internal politics pouring into the room at a critical moment for future of global security.\n\"Please, you think that if you will speak very loudly about the war,\" Zelensky began saying, only for Trump to cut him off.\n\"He's not speaking loudly,\" Trump shot back, visibly irritated. \"Your country's in big trouble.\"\n\"You're not winning, you're not winning this,\" Trump said. \"You have a damn good chance of coming out OK because of us.\"\n\"It's going to be a very hard thing to do business like this,\" said Trump. \"It's going to be a tough deal to make because the attitudes have to change.\"\nThe president and vice-president reprimanded Zelensky, appearing most angered by what they perceived as his \"attitude\".\n\"Just say thank you,\" Vance demanded at one point.\nZelensky's responses - which were to fact check the two far more powerful men and argue his corner - seemed driven by the existential nature of this moment.\nHe has spent three years defending his country from invasion, while also trying to hold together a society and its political leadership that Putin has tried to drive apart.\nBut out of the main camera shot was another sight in the room. Zelensky's ambassador to Washington, Oksana Markarova, who was spotted with her head in her hands as the arguments escalated.\nIt is an image that sums up the diplomatic position for Zelensky and his relationship with - until now at least - his superpower sponsor in trying to repel Russia.\nStanding up to Trump like he did on Friday could, ultimately, mean losing to Putin.", "url": "https://www.bbc.co.uk/news/articles/c2erwgwy8vgo"}