{"authors": ["James Davies", "www.facebook.com"], "date_download": "2025-04-26 04:32:37", "date_modify": "2025-04-26 04:32:37", "date_publish": "2025-03-03 05:26:06", "description": "The New Labour leader can be found dressed in combat attire, lined up near a Hugh Laurie waxwork.", "filename": "news_articles_cqjdvnd8x8ro_1745641957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/84f8/live/2284fdb0-f465-11ef-8dd5-1d47b25c094a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdvnd8x8ro_1745641957.html", "title": "Tony Blair waxwork in soldier uniform gives ex-secretary a tickle", "title_page": "Tony Blair waxwork in soldier uniform gives ex-secretary a tickle - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Tony Blair has been no stranger to public appearances since resigning as prime minister in 2007.\nFew appearances, however, are as unusual as his permanent residence in Essex.\nSince 2000, Chelmsford Museum has owned a waxwork model of the New Labour leader, but dressed in the uniform of an Essex Regiment soldier from 1959.\nThe model came as news to John McTernan, Sir Tony's former political secretary, who when contacted by the BBC said: \"This had me chuckling over my morning coffee.\"\nSir Tony's model is wearing the attire of a soldier of the 1st Battalion, 3rd East Anglian Regiment of 1959, while on jungle patrol.\nThe waxworks - including that of Laurie - were sold to the museum by now defunct company GEMS Display Figurines, which acquired and marketed second-hand models.\nGEMS typically sold dummies that previously belonged to Madame Tussauds.\nChelmsford City Council said it could not confirm whether the two models ever graced the halls of any Madame Tussauds attractions.\n\"New Labour always backed our armed forces so there's a poetic justice about the waxwork's final tour of duty,\" said McTernan, who served in Sir Tony's government between 2005 and 2007.", "url": "https://www.bbc.co.uk/news/articles/cqjdvnd8x8ro"}