{"authors": ["Andrew Picken", "www.facebook.com"], "date_download": "2025-04-26 04:25:04", "date_modify": "2025-04-26 04:25:04", "date_publish": "2025-03-03 12:21:47", "description": "The opening of Edinburgh's children's hospital has been examined by the Scottish Hospitals Inquiry.", "filename": "news_articles_c2kgq8xvz82o_1745641504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/138e/live/9848b0b0-f81f-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kgq8xvz82o_1745641504.html", "title": "Unclear NHS design delayed opening of Sick Kids hospital", "title_page": "Unclear NHS design delayed opening of Sick Kids hospital - report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The opening of Edinburgh's sick kids hospital was delayed after NHS Lothian failed to give clear ventilation requirements for the building, an inquiry has found.\nHuman error in a spreadsheet meant air changes in critical care wards were designed at half the recommended safety standards.\nThe opening in July 2019 has been examined by the Scottish Hospitals Inquiry. The £150m building finally opened in 2021 after a £16m upgrade.\nThe interim report also criticised the health board for leaving families in the dark about why the hospital did not open as planned.\nNHS Lothian apologised for the failures in its design brief highlighted in the report.\nIt also said sorry to families let down at a time when they were \"already worried and vulnerable\".\nLord Brodie, who chaired the inquiry, said: \"There is a group of young patients who are very seriously ill and spend a significant portion of their time, sometimes much of their lives, in hospital.\n\"The hospital becomes, for them, their second home.\n\"The impact of unclear or poor communication on the wellbeing of patients and their families during what may already be a very difficult, emotional, and uncertain period in their lives, is significant.\"\nLord Brodie also said NHS Lothian was too reliant on external technical advisors and the involvement of infection prevention specialists was not sufficient to identify problems.\nThe report found that the health board \"inadvertently\" agreed to the wards not meeting safety standards with the potential to put patients at risk.\nEvidence highlighted a number of missed opportunities to deal with the issues that delayed the opening of the Royal Hospital for Children and Young People\nA \"human error\" in a 2012 spreadsheet with the specifications for air flow in critical care rooms was not spotted for years.\nThe spreadsheet was part of the tendering process for firms bidding to build the hospital.\nIt was only when the hospital had been handed over to NHS Lothian, and £1.4m monthly repayments on the deal had started, that independent checks found the rooms were operating with the wrong air flow and the opening was stopped.\nIn his report, Lord Brodie said: \"Determining the output parameters of a ventilation system should not left be to the judgment of the project company and its subcontractors during the design phase.\nHe added: \"In relation to this project, it is my conclusion that NHS Lothian did not present its requirements for the output specifications of the ventilation system with sufficient clarity and precision.\"\nHowever, the report found that no patients were directly harmed by the delayed opening of the building.\nLord Brodie said: \"The Inquiry has not heard or seen evidence to suggest a direct link between the delay and any significant detrimental impact on medical treatment, at least not to the knowledge of the witnesses.\"\nThe inquiry previously heard how NHS Lothian accepted the handover of the hospital despite some works being outstanding in order to stop contractor IHSL going bust.\nIf IHSL went bust then NHS Lothian faced paying out at least £150m to get the project finished.\nRemedial work worth £16m was then carried out and the new building started hosting outpatient appointments in July 2021.\nThe hospital cost about £150m to build but its full price tag over 25 years, including maintenance and facilities management fees, will be £432m.", "url": "https://www.bbc.co.uk/news/articles/c2kgq8xvz82o"}