{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:30:32", "date_modify": "2025-04-26 07:30:32", "date_publish": "2025-02-27 17:28:24", "description": "Children's cancer services for south London and the South East region will move from autumn 2026.", "filename": "news_articles_ckg1122xgw4o_1745652632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c211/live/9dc6ab60-f526-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg1122xgw4o_1745652632.html", "title": "Evelina London Hospital chosen for children's cancer care", "title_page": "Evelina London Hospital chosen for children's cancer care - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Children's cancer services for south London and the South East will move to the Evelina London Children's Hospital in autumn 2026, the government has confirmed.\nAs well as specialist cancer services for children transferring to Evelina London Children's Hospital in Lambeth, radiotherapy will be at University College Hospital.\nAt the moment cancer treatment for patients under 15 in south London, Brighton and Hove, East Sussex, Kent and Medway and most of Surrey is provided by The Royal Marsden Hospital, Sutton and St George's Hospital, Tooting.\nNHS England ran a 12-week consultation in 2023 on the proposed move prompting a mixed response, with concerns raised further travel to access care.\nIn 2021, new service rules set out very specialist cancer treatment services for children must be on the same site as a level three children's intensive care unit, but The Royal Marsden does not have one.\nLast summer Secretary of State for Health and Social Care Wes Streeting analysed the planned change to NHS services and whether to proceed with the proposal, modify it, or take other action.\nThe Secretary of State has now announced that the plans will not change.\nEvelina London Children's Hospital is a specialist children's hospital which treats 120,000 children a year.\nNHS England said the move is not expected to happen before October 2026 and there will be no sudden changes to children's cancer care in the meantime.\nNHS England, London medical director Dr Chris Streather, said: \"This is a positive step forward for children's cancer care – at the new location, children who need intensive care will be able to get it on site and the future centre will stand ready to give cutting-edge treatments that require intensive care on site, like other major centres worldwide.\n\"Service reconfiguration is rarely easy, but the decision taken today will ensure that children with cancer in south London and much of the south east will continue to receive the best possible care now and into the future.\"", "url": "https://www.bbc.co.uk/news/articles/ckg1122xgw4o"}