{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:22", "date_modify": "2025-05-19 15:29:22", "date_publish": "2015-02-09 17:10:06", "description": "Suspected militants from Nigerian group Boko Haram hijack a bus in Cameroon and kidnap at least 20 people, residents say.", "filename": "news_world-africa-31313590_1747668562.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80874000/jpg/_80874127_80873871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31313590_1747668562.html", "title": "Nigeria's Boko Haram 'kidnaps 20' in Cameroon bus hijacking", "title_page": "Nigeria's Boko Haram 'kidnaps 20' in Cameroon bus hijacking - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Suspected militants from Nigerian Islamist group Boko Haram have hijacked a bus in northern Cameroon, abducting at least 20 people, residents say.\nMilitants reportedly seized a bus carrying market-goers and drove it toward the border with Nigeria.\nSome reports put the total number kidnapped in Cameroon as high as 30.\nBoko Haram has escalated its attacks outside Nigeria in recent weeks, targeting neighbouring Cameroon and Niger.\nThe insurgency has forced a postponement of Nigeria's presidential and parliamentary elections from 14 February to 28 March.\nThe bus was seized near the border area of Koza and driven towards the Nigerian border 18km (11 miles) away, a resident told the Associated Press news agency.\nThe attacks in Cameroon follow a series of assaults on the border towns of Bosso and Diffa in Niger.\nBoko Haram militants targeted a prison in Diffa on Monday but were repelled by soldiers from Niger and Chad.\nDiffa was also targeted by a car bomb which exploded near a market, news agencies reported, citing residents and military sources. A local journalist in Diffa told AFP he counted one dead and 15 injured.\nNiger's parliament is due to vote on Monday on contributing 700 troops to a regional force battling to regain territory from Boko Haram ahead of Nigeria's rescheduled elections.\nAbbo Moro, Nigeria's interior minister, told the BBC he believes the fight against the militant group will be successful enough for the elections to go ahead.\nElections for state governors and assemblies slated for 28 February have also been moved to 11 April.\nBBC Nigeria correspondent Will Ross says many observers in the country see the delay as a political move aimed at helping the incumbent President Goodluck Jonathan.\nUncertainty over the election is also having economic repercussions, our reporter says, with Nigeria's currency the naira falling to a record low on Monday.\nThe Boko Haram insurgency has caused more than 1.5 million people to flee their homes.\nOn Saturday, Nigeria and the governments of Cameroon, Chad, Niger and Benin agreed to establish a force of 8,700 troops, police and civilians to fight the group.", "url": "https://www.bbc.com/news/world-africa-31313590"}