{"authors": ["Nikki Mitchell", "www.facebook.com"], "date_download": "2025-04-26 04:31:43", "date_modify": "2025-04-26 04:31:43", "date_publish": "2025-03-03 06:10:39", "description": "More money is needed for children who have fled their countries alone, the government is told.", "filename": "news_articles_cy7xx51r48eo_1745641903.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e469/live/48c4a020-f5eb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xx51r48eo_1745641903.html", "title": "Asylum-seeking children causing council overspends across south", "title_page": "Asylum-seeking children causing council overspends across south - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The number of lone asylum-seeking children being cared for in parts of the south is causing huge overspends for many local councils.\nOn average across England, one in every 10 children in council care in 2024 had fled desperate situations abroad, according to Department for Education data.\nIn Wokingham borough, it was one in every four children in care and in Hampshire County Council's area last month it was one in five.\nThe Home Office said it was working with local authorities to support them but the Local Government Association (LGA) has said more \"vital\" funding was needed.\nAhmad Othman fled Syria when he was 16. His father had been jailed by the Assad regime and was thought to have died in prison.\nEfforts to confirm his death have so far failed and Ahmad believes his father's body lies, unidentified, in one of thousands of mass graves.\n\"It was scary in my country,\" he said. \"The war, they killed people. Leaving my family was hard but I would be dead if I stayed.\"\nAhmad has been looked after by West Berkshire Council and a youth homelessness charity called Step by Step.\n\"I want to say thanks a lot for supporting me. I will be supporting this country in the future,\" he said.\nThe number of people claiming asylum in the UK in 2024 reached its highest level since records began in 1979, according to Home Office figures.\nAmong them were 7,380 children who arrived alone in England, up from 5,080 in 2020.\nThe government's National Transfer Scheme, external (NTS) aims to ensure a \"fairer, more equitable distribution\" of children arriving in the UK alone, across all local councils in England.\nWokingham Borough Council said it had \"disproportionately high\" numbers because of its \"preventative\" work to keep local children with their families and the NTS places children from abroad \"based on local population sizes\".\nHampshire County Council said government grants did not cover the significantly higher cost of looking after separated children once they turned 18, despite their \"greater needs\".\nAs a result, it is facing a £4.2m shortfall in its children's services budget in the financial year ending in March 2025.\nThe LGA said the cost of supporting lone asylum-seeking children often exceeded the grants councils received from the Home Office.\nThe vast majority of separated children applying for asylum are boys but one in every 25 are girls, like Shula, who is living with a host family in Newbury, Berkshire.\nShula - not her real name - was 16 when she fled her Muslim family to avoid being forced into a marriage she did not want.\nShe had renounced her faith and feared her \"really strict\" family would find her and hurt her, or force her to return, after she escaped on a plane with a sister.\n\"Our country is so strict, we thought people might stop us because we were girls alone,\" she added.\nShula is the seventh teenager Beverley and Mark Landreth-Smith have welcomed into their home through a hosting programme run by Step by Step.\nMr Landreth-Smith said some of the children they looked after had been subjected to \"racist\" and \"unkind\" comments.\n\"A lot of people were really nice to me,\" said Shula. \"But also there were people that were racist. I don't want them to feel like I'm a bad person.\"", "url": "https://www.bbc.co.uk/news/articles/cy7xx51r48eo"}