{"authors": ["Charles Heslett", "www.facebook.com"], "date_download": "2025-04-26 07:28:37", "date_modify": "2025-04-26 07:28:37", "date_publish": "2025-02-27 18:37:31", "description": "New operator Trafalgar Entertainment says the team are \"well placed to do a good job for Bradford\".", "filename": "news_articles_c62zzvnlrn3o_1745652517.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/42fd/live/e3ac1740-f536-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzvnlrn3o_1745652517.html", "title": "Bradford Live operator to spend £3m on fit-out before opening", "title_page": "Bradford Live operator to spend £3m on fit-out before opening - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The new operator of Bradford Live is to spend £3m fitting out the venue before it opens in the autumn.\nLast September, after months of speculation, original operator NEC Group and Bradford Council confirmed they had parted ways.\nEarlier this month Surrey-based Trafalgar Entertainment was revealed as the successful bidder to run the 3,800-seat city centre venue.\nThe company has already installed thousands of seats in what was a former cinema and is working towards an opening date in early September.\nHelen Enright, chief executive of Trafalgar Entertainment's Venues division as well as the group's chief operating officer, said: \"I know that it's been painful, for the people of Bradford, getting to this stage.\n\"I would like us to be judged now on what we do and the acts that we bring.\n\"I think we're very well placed and will do a good job for Bradford.\"\nThe group is the second largest theatre operator in the UK with 21 venues across England, Scotland and Wales, and one in Australia.\nMs Enright said 55% of the 4,000 events the company staged every year were music and comedy based.\nShe said: \"We've hosted Paloma Faith, Paul Weller, Jimmy Carr, Michael McIntyre... Those sort of nationally-known music and comedy acts.\n\"The official opening (of Bradford Live) will be end of August, beginning of September.\n\"We're aiming to have probably a weekend of really quite exciting artists to get as many people through the doors... as we possibly can.\"\nMs Enright would not confirm who those acts might be as negotiations were \"ongoing\".\nBut she added that tickets for the opening programme were expected to go on sale in the next four weeks.\nTrafalgar Entertainment has signed a 25-year lease agreement with Bradford Council.\nMs Enright said this would mean a \"six-figure\" sum in rent going into the public coffers every year.\nShe added: \"There's millions of pounds worth (of investment) that we're putting into this venue as well to get it to a stage where we are opening the doors.\"\nThe executive said it would be \"about £3m in capital fit-out costs\".\nShe said: \"Speaking for myself and the team at Trafalgar, I'd like to say just how excited we are to be running Bradford Live.\n\"But we are also aware of our responsibility to bring this venue to life and to be something that the people of Bradford will be proud of in the future.\"\nBradford Live was a key part of plans for Bradford's City of Culture year in 2025, and was originally due to open last November.\nBoth the council and NEC repeatedly refused to provide details on the venue's future last year, citing commercial confidentiality, until confirming they had split.\nThe refurbishment reached its final stages last July, albeit more than 100% over budget.\nInitially forecast to cost between £22m and £25m, the venue has been funded by almost £44m from Bradford Council, with the rest coming from the West Yorkshire Combined Authority, the government and the Heritage Lottery Fund.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c62zzvnlrn3o"}