{"authors": ["Sanchia Berg and Levi Jouavel", "www.facebook.com"], "date_download": "2025-04-26 06:29:21", "date_modify": "2025-04-26 06:29:21", "date_publish": "2025-02-27 11:05:50", "description": "The 14-year-old from London brought a case against his parents after being sent to school in Ghana.", "filename": "news_articles_cdryre7y4n0o_1745648961.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3e3a/live/26595570-f4ed-11ef-ae0a-4bca4f518eb0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdryre7y4n0o_1745648961.html", "title": "Son loses High Court case against parents over move to Africa", "title_page": "Son loses High Court case against parents over move to Africa - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In a written statement to the court, he said: \"I feel like I am living in hell. I really do not think I deserve this and I want to come home, back to England, as soon as possible.\"\nIn his judgment, external, High Court judge Mr Justice Hayden said he recognised that \"this is, in many ways, both a sobering and rather depressing conclusion.\"\nHe said that he was satisfied that the parents' wish for their son to move to Ghana was \"driven by their deep, obvious and unconditional love\".\nThe boy was at risk of suffering greater harm returning to the UK, he said.\nHe said that the boy's parents believe \"and in my judgement with reason\" that their son has \"at very least peripheral involvement with gang culture and has exhibited an unhealthy interest in knives\".\nThe boy's father told the judge the couple did not want their son to be \"yet another black teenager stabbed to death in the streets of London.\"\nThe boy, who had lived in the UK since birth, said he was \"mocked\" and \"never settled in\" at the school in Ghana.\nHe said he \"could also barely understand what was going on and I would get into fights\".\nThe boy wrote that he was \"so scared and desperate\" that he emailed the British High Commission in Accra as well as contacting the charity Children and Family Across Borders, who it is believed put him in touch with lawyers at the International Family Law Group.\n\"I am from London, England, and I want to go back home,\" he wrote.\nHe said he had been \"mistreated\" at the school, adding: \"I'm begging to go back to my old school.\"\nHowever the High Court heard that the boy's parents had sent him because they feared for his safety in London.\nIn a statement, his mother said sending him to Africa was \"not a punishment but a measure to protect him\".\nShe referred to the murder of Kelyan Bokassa, the 14-year-old boy who was stabbed to death on a bus in Woolwich in January. That was \"every parent's worst nightmare\", she said.\nShe said she did not believe her son would survive in the UK and did not want to be part of her son's \"destruction\".\nRebecca Foulkes, representing the boy's father, said the boy met 11 of the points on a checklist produced by the children's charity NSPCC to indicate whether a child might have joined a gang or was being criminally exploited.\nThat included being absent from school, having unexplained money, buying new things, and carrying weapons.\nShe said it was not only the parents who were worried.\nHis school claimed it had \"suspicions about him engaging in criminal activities\" and had observed him in expensive clothes and with mobile phones.\nThe boy said he had never been part of a gang, nor \"involved in gangs in any way\". He said he \"does not know anyone involved in a gang\" and he does not carry a knife.\nHe acknowledged in his statements that \"my behaviour wasn't the best\" and said he thought that was the reason his parents sent him to Africa.\nThe case centred on the question of parental responsibility, and whether the parents acted unlawfully by sending their son to boarding school without his consent.\nIn a statement issued after the judgement, his parents said: \"This has been a really difficult time for us all.\"\nThey added: \"Our priority has always been protecting our son and our focus now is on moving forward as a family.\"\nJames Netto from the International Family Law Group, who represented the boy, said the court judgment had been a \"real shock\" to the teenager.\n\"He was obviously incredibly disappointed, incredibly upset and is considering his next steps carefully.\"", "url": "https://www.bbc.co.uk/news/articles/cdryre7y4n0o"}