{"authors": ["Laura Gozzi", "www.facebook.com"], "date_download": "2025-04-26 03:54:13", "date_modify": "2025-04-26 03:54:13", "date_publish": "2025-03-04 17:49:34", "description": "Thirty-two people were shipwrecked on a rig in the Mediterranean with no food or water, an NGO has said.", "filename": "news_articles_c743znzplgqo_1745639653.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6f55/live/c0be9680-f915-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c743znzplgqo_1745639653.html", "title": "Migrants rescued after several days stranded on oil platform", "title_page": "Migrants rescued after several days stranded on oil platform - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thirty-two migrants attempting to cross the Mediterranean have been rescued by an NGO ship after spending several days stranded on an oil platform off the coast of Tunisia.\n\"Women, men and children\" were shipwrecked with no food or water, according to Mediterranea, a migrant rescue charity. One person on the platform had died, the charity said.\nNGO Sea Watch said it had managed to rescue all 32 people from the gas platform on Tuesday afternoon, and that they were being looked after aboard the Aurora ship.\nHowever, the Aurora's final destination was unclear as no country nearby had yet assigned the ship a port of safety, Sea Watch said.\nIt added that no European country had intervened \"despite the imminent emergency\" and the fact that the people were stranded in international waters on the border of the Tunisian and Maltese search and rescue (SAR) zones.\nNGO monitoring aircraft Seabird reportedly spotted an empty rubber dinghy near the platform on 1 March.\nThe shipwrecked people then managed to contact Alarm Phone - an emergency hotline for migrants in trouble at sea. In the call, they said they had been without food for days and that their condition was critical. They also reported the death of one person, Sea Watch said.\nIn a video apparently filmed by one of the people on the platform and shared by NGOs on social media, a young man in a white t-shirt could be heard saying that he and the others were \"suffering from hunger and dying of cold\".\nSpeaking in Tigrinya - a language spoken in Ethiopia and Eritrea - the man said they left Libya five days ago and that the dinghy they were travelling on capsized.\n\"Those who made it here and didn't die at sea are dying of hunger and exhaustion, if in the few hours nobody does anything we will obviously die... We have only little chance [to survive],\" he said.\nBehind him were several people apparently shivering from the cold as the waves crashed against the oil platform's pillars.\nOver 210,000 people tried to cross the Central Mediterranean in 2023, according to data shared by the UN. More than 60,000 were intercepted and sent back to African shores, and nearly 2000 lost their lives at sea.", "url": "https://www.bbc.co.uk/news/articles/c743znzplgqo"}