{"authors": ["Elliot Ball", "www.facebook.com"], "date_download": "2025-04-26 03:59:11", "date_modify": "2025-04-26 03:59:11", "date_publish": "2025-03-04 06:11:47", "description": "Galleries have been 'revitalised' during two month closure of museum.", "filename": "news_articles_cp3yqx8dvk8o_1745639951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b8a3/live/73a52160-f862-11ef-b75c-0ba717285eef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yqx8dvk8o_1745639951.html", "title": "Truro landmark museum art gallery reopens after refurbishment", "title_page": "Truro landmark museum art gallery reopens after refurbishment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The doors of a Truro landmark reopened on Saturday, following a £2.3m refurbishment.\nCornwall Museum and Art Gallery (formerly Royal Cornwall Museum) was closed in January 2025 for two months while work was carried out.\nThe Nature Gallery is just one area that has been redesigned for interactive learning and showcases the county's wildlife and landscapes.\nCouncillor Louis Gardener said: \"With its revitalised galleries and engaging exhibits, this transformation not only strengthens Cornwall's cultural offering but also enhances our appeal as a visitor destination, driving footfall and supporting the local economy.\"\nThe portfolio holder for economy at Cornwall Council said the investment was part of a wider £17.2m package for funding arts and culture.\nMuseum co-director Bryony Robins added: \"There are so many different stories to explore through the museum's collections and we've worked hard with our communities to reimagine and redisplay some amazing and surprising objects, along with providing fun and interactive activities.\n\"Our ambitions for the museum are really bold and we see ourselves as playing an important role for our local communities, as well as a place for visitors from further afield to get to know Cornwall more deeply.\"", "url": "https://www.bbc.co.uk/news/articles/cp3yqx8dvk8o"}