{"authors": ["John Wimperis", "www.facebook.com"], "date_download": "2025-04-26 07:34:38", "date_modify": "2025-04-26 07:34:38", "date_publish": "2025-02-27 15:38:21", "description": "An average Band D household is expected to pay £86 more per year from April.", "filename": "news_articles_ce8yy0d57w8o_1745652878.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d0aa/live/a0de3ab0-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yy0d57w8o_1745652878.html", "title": "Council tax to increase to maximum after 'significant' care bill", "title_page": "Council tax to increase to maximum after 'significant' care bill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents will pay the maximum amount of council tax as an authority deals with what it says is a \"significant and unpredictable\" social care bill.\nFrom April, council tax bills in Bath and North East Somerset (BANES) will increase by 4.99%, which is equivalent to £86.64 a year for a typical band D property.\nThe increase the most council tax can rise without special permission from the government, or a local referendum.\nMark Elliott, BANES Council's Liberal Democrat cabinet member for resources, said it had overspent on social care in every quarter in 2024.\nAccording to the Local Democracy Reporting Service, Mr Elliott said as he presented the budget plans to the council on 25 February: \"Many councils and residents of other authorities would be extremely envious of our position.\n\"We have healthy reserves, we are not at any significant risk of finding ourselves in financial difficulty.\n\"We are not, as other councils are, unable to balance the books or making swingeing cuts to services. We are not having to apply to central government for permission to make exceptional council tax rises.\"\n2.99% of the rise will be for general use, while two will be ring fenced for spending on adult social care.", "url": "https://www.bbc.co.uk/news/articles/ce8yy0d57w8o"}