{"authors": ["Clara Bullock", "Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 04:38:25", "date_modify": "2025-04-26 04:38:25", "date_publish": "2025-02-28 10:41:01", "description": "The woman, 19, died when the animal attacked her in a flat in south Bristol on Wednesday evening.", "filename": "news_articles_cn7vvn1mpz5o_1745642305.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/799b/live/3f5f50d0-f5bd-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vvn1mpz5o_1745642305.html", "title": "Bristol dog attack: Two bailed after teen killed by suspected XL bully", "title_page": "Bristol dog attack: Two bailed after teen killed by suspected XL bully - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two people have been released on bail following a dog attack that killed a 19-year-old woman.\nThe incident occurred at about 19:00 GMT on Wednesday at a flat in Cobhorn Drive, south Bristol. Officers confirmed the dog had now been put down.\nA man and a woman, both in their 20s, were arrested on suspicion of being in charge of a dog dangerously out of control causing injury resulting in death.\nThey were also arrested on suspicion of possession of a prohibited breed of dog. Initial reports suggested it may be an XL bully, but police said it was too early to confirm the breed.\nThe woman's family was informed following the attack and they are being supported by a specially trained officer.\nOn Thursday, a neighbour who lives close to the scene said the woman had only lived in the property a few weeks.\nShe described being \"shocked\" at having seen the woman after the attack.\n\"The moment she walked out the door I could hear her, and I ran over to her and said, 'Are you okay?',\" the neighbour described.\n\"She couldn't talk or say a word. It was like she wasn't there because of the shock.\"", "url": "https://www.bbc.co.uk/news/articles/cn7vvn1mpz5o"}