{"authors": ["Evie Lake", "www.facebook.com"], "date_download": "2025-04-26 06:33:37", "date_modify": "2025-04-26 06:33:37", "date_publish": "2025-02-27 06:40:13", "description": "Councillor Dave Geddis says the concern comes from a \"lack of communication\".", "filename": "news_articles_c93kgwxl7r7o_1745649217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/28ca/live/301fa1a0-f438-11ef-8b93-e929161a3c61.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kgwxl7r7o_1745649217.html", "title": "Easington Lane children's home withdrawn after community backlash", "title_page": "Easington Lane children's home withdrawn after community backlash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity has withdrawn plans to open a home for vulnerable children, following a backlash from residents unhappy some of them would be unaccompanied refugees.\nSafe Haven - A Ray of Hope submitted plans for Manor House in Easington Lane, near Sunderland, but the charity said it backed out last week after a recent fire at the property and \"outrage\" from the public.\nCharity founder Blessing Olalemi said it removed refugee children from its plans but it did not allay the community's fears.\nCouncillor Dave Geddis, chairman of Hetton Town Council's planning committee, said the concern came from a \"lack of communication\" and \"people's minds raced all over the place\".\nMs Olalemi said they tried engaging the community \"to understand why\" it was opposed to the plans.\n\"The community were very strong and sensitive about the refugee and asylum seeker bit so we decided we could remove that part,\" she said.\n\"But we knew the anger was so much more than that.\"\nSafe Haven's plans for the Easington Lane site were hampered further when there was a fire at the building on 23 January, which Geddis said left it in a \"dreadful and dangerous state\".\nIn 2018, a man was killed in an arson attack at the property, which was then being used as a hostel and the building has been vacant ever since.\nMs Olalemi said the plans had been progressing but \"in the process there was an outrage\".\nGeddis said the concern came from \"the lack of knowledge, the lack of communication and I think people's minds raced all over the place\".\n\"People were worried,\" he said.\nSafe Haven acknowledged approaching the community more quickly with the plans could have improved communication.\nTwo public meetings were held and Geddis said the main issues raised were concerns for safeguarding and the building's condition.\n\"The safeguarding issue was an internal issue as to how Safe Haven was going to keep the three different groups of vulnerable people secure and safe,\" he said.\nCommenting on the planning application, Northumbria Police said it was concerned the varying lifestyles and vulnerabilities of the service users \"differs significantly and could cause internal conflict and tension\".\nEasington Lane was a \"very tight-knit\" community which was \"accepting of people from various backgrounds\", Geddis said.\nThe independent councillor added he did not think the inclusion of refugee children was the \"overwhelming issue of it\".\n\"I'm not saying it didn't play a part,\" he said, \"but I do believe people were wary.\n\"People are proud to be here, they don't want any negativity and that was the fear.\"\nAfter the second meeting, Safe Haven announced it was withdrawing its intent of service.\nMs Olalemi said she was \"very disappointed\" because of the time and money put into the project by the charity, but said she \"didn't want to push things\".\n\"The community clearly objects,\" she said.\n\"We've told Easington Lane we respect them as a community.\"", "url": "https://www.bbc.co.uk/news/articles/c93kgwxl7r7o"}