{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:00", "date_modify": "2025-05-19 15:38:00", "date_publish": "2015-01-28 00:45:58", "description": "A new taskforce set up to support jobs in the Scottish energy sector meets for the first time to discuss opportunities for hundreds of people facing redundancy.", "filename": "news_uk-scotland-scotland-business-31007606_1747669080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80267000/jpg/_80267949_oil_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-business-31007606_1747669080.html", "title": "Energy taskforce holds first meeting", "title_page": "Energy taskforce holds first meeting - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new taskforce set up to support jobs in the Scottish energy sector has met for the first time to discuss opportunities for hundreds of people facing redundancy.\nFirst Minister Nicola Sturgeon set up the new body earlier this month.\nExecutives from the likes of BP, Taqa, Petrofac and the Wood Group took part in the meeting, along with union officials and politicians.\nLast week, 300 job cuts were announced at Talisman Sinopec's north east base.\nBP and other companies have already announced similar job losses, pay cuts and freezes as the low price of oil continues to hit the industry.\nThe taskforce is planning an event in Aberdeen to provide advice and further training for those facing redundancy.\nScottish Enterprise chief executive Lena Wilson, who chairs the taskforce, said: \"There was an overwhelming sense of determination and collaboration from the members of the taskforce at today's first meeting.\n\"Whilst there's recognition that the industry both at home and internationally has major challenges ahead, the group has absolute confidence in the strength and resilience of the sector and is acutely aware of the future opportunities this industry will provide.\n\"There were some great ideas shared at today's meeting and there will be swift progress in turning these into tangible actions.\n\"We have a helpline available for those facing redundancy, will be launching an online presence and will be delivering a large employability event Aberdeen in the near future.\"\nAnyone facing redundancy in the industry can call the PACE helpline on 0800 917 8000.", "url": "https://www.bbc.com/news/uk-scotland-scotland-business-31007606"}