{"authors": ["Nadia Lincoln", "www.facebook.com"], "date_download": "2025-04-26 06:50:43", "date_modify": "2025-04-26 06:50:43", "date_publish": "2025-02-28 18:09:48", "description": "Figures show more than 6,000 people are on a waiting list for homes in parts of a county.", "filename": "news_articles_ckg11g5dwwdo_1745650243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74f2/live/b3b3d760-f5dd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg11g5dwwdo_1745650243.html", "title": "Northamptonshire council pledges to tackle social housing gap", "title_page": "Northamptonshire council pledges to tackle social housing gap - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council said it was committed to tackling its housing shortage after a report showed more than 6,000 people were waiting for social housing at any one time.\nFigures published by North Northamptonshire Council (NNC) showed only 1,319 homes became available over a 12-month period in 2023-24.\nThe authority's five-year housing strategy, which is currently under consultation, external, stated that the \"need is not being met\" due to the high number of people on its Keyways Housing Allocations Scheme.\nNNC said its Keyways team remained \"dedicated to assessing new housing applications as expediently as possible\" and that it was working with house builders to ensure that affordable housing targets were met.\nAt a scrutiny meeting, external discussing the strategy on Tuesday, Conservative member for Raunds, Lee Wilkes, said: \"I bet that waiting list is going up faster than we're managing to reduce it. There is no way any council can resolve it - we can't even put a dent in it.\"\nAccording to the housing strategy document, there are more than 6,500 households in North Northamptonshire waiting for a social home – a third of which had been identified as \"priority need\", the Local Democracy Reporting Service said.\nMr Wilkes said he hoped the council's new housing strategy would help build a \"much stronger\" planning policy, giving the authority more power to instruct developers to provide what was needed in the area.\nJason Smithers, Conservative leader of NNC, said: \"As with many local authorities, the current demand for social housing outstrips the supply of council-registered properties available for rent.\n\"The council is committed to regular reviews of the housing register to ensure it is up to date and reflective of current housing need.\n\"Our Keyways team remains dedicated to assessing new housing applications as expediently as possible.\"", "url": "https://www.bbc.co.uk/news/articles/ckg11g5dwwdo"}