{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:38", "date_modify": "2025-05-19 15:31:38", "date_publish": "2015-02-10 04:12:37", "description": "Christians in Iraq \"do not have much time left\" without direct military action on the ground, the Archbishop of Irbil tells UK peers and MPs.", "filename": "news_uk-31303952_1747668698.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80896000/jpg/_80896921_78037296.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31303952_1747668698.html", "title": "Military action needed in Iraq to help Christians, archbishop says", "title_page": "Military action needed in Iraq to help Christians, archbishop says - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Christians in Iraq \"do not have much time left\" without direct military action on the ground, the Archbishop of Irbil has told UK peers and MPs.\nArchbishop Bashar Warda said air strikes were \"not enough\" to defeat Islamic State militants and \"begged\" for Western troops to be deployed.\nHe said Iraq's Christian population was declining and that he would speak to the UK government about further action.\nThe government has said efforts to defeat IS were \"comprehensive\".\nDuring a visit to London, Archbishop Warda, of the Catholic Chaldean Church, told the Westminster gathering Iraq's Christian communities had fallen \"dramatically\" over the last decade - from 1.4 million during the rule of Saddam Hussein.\nTens of thousands of Iraqi Christians and Yazidis fled their homes in the summer of 2014 following warnings from IS militants to renounce their faith or face death.\n\"We don't have much time left as Christians in this region,\" the archbishop told a gathering of cross-party MPs and peers.\n\"As a Catholic I find it hard to say, but I want military action, there is no other way now.\"\nHe is due to address the Church of England's ruling General Synod on Tuesday.\nHis speech comes after the Prince of Wales spoke of his \"deep concern\" for the suffering of Christian churches in the Middle East.\nArchbishop Warda called for the deployment of British troops on the ground to drive IS - known as Daesh in Arabic speaking countries - from the Christian villages of the Nineveh Plain, adding: \"I beg you to focus on the need for military action.\n\"What we are seeing is worse for the world than what happened in Afghanistan, with more and more young people going to fight with Daesh. Military action is needed - powerful force - to get them out of our villages.\"\nHe said Iraqi bishops from across the Christian denominations were in \"continuous talks\" with each other and with Christian politicians in Baghdad.\nHe said they shared his view that the west should take military action - describing it as \"an unfortunate solution\", but one which was needed.\nArchbishop Warda said he was struggling to persuade Christian families not to leave the area.\nConservative Former Cabinet minister John Gummer, now Lord Deben, said the archbishop's speech was an example of the \"desperate dilemma the Christian community of Iraq are now in\".\n\"Having been subjected to war, they are now calling for it as a last resort,\" he told the BBC.\nHowever, Syrian Anglican, the Rev Nadim Nassar, told the meeting that \"bullets will not solve the problem\".\nIt comes after a recent report by the Defence Select Committee, external said the UK's role in fighting IS extremists was \"strikingly modest\" and should be stepped up.\nThe group of MPs said it was \"surprised and deeply concerned\" the UK was not doing more.\nIn response to the report, a government spokesman said the international coalition was taking a \"comprehensive approach\" against IS, through air strikes and by tackling its sources of money and foreign fighters.\nThe UK had carried out the second highest number of air strikes among coalition partners and helped to train Iraqi security forces and Peshmerga forces, the spokesman added.", "url": "https://www.bbc.com/news/uk-31303952"}