{"authors": ["Paulin Kola", "www.facebook.com"], "date_download": "2025-04-26 06:29:01", "date_modify": "2025-04-26 06:29:01", "date_publish": "2025-02-27 11:19:39", "description": "The decision goes against a lower court judge's ruling that the government had to pay aid contractors.", "filename": "news_articles_cvgwwp2gd3jo_1745648941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/292b/live/135dedf0-f501-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwwp2gd3jo_1745648941.html", "title": "Trump foreign aid freeze to stay for now, US Supreme Court chief rules", "title_page": "Trump foreign aid freeze to stay for now, US Supreme Court chief rules - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The top judge in the United States has given temporary backing to the Trump administration's freeze on foreign aid payments.\nSupreme Court Chief Justice John Roberts' intervention came as the administration faced a midnight deadline (05:00 GMT on Thursday) to pay contractors.\nOfficials had argued that they could not process the payments within the timeframe set by a lower court judge.\nSince coming to power in January, US President Donald Trump has taken quick action to end many aid programmes, largely run by the US Agency for International Development, USAID, and placed most of its staff on administrative leave or sacked them.\nUS District Judge Amir Ali had ordered the US State Department and USAID to pay about $2bn-worth of bills (£1.6bn) to contractors by midnight on Wednesday.\nIt is one of many interventions by judges trying to stop or pause a wave of Trump administration orders.\nAs the deadline approached, the Trump administration went to the Supreme Court, arguing it was impossible to process claims in an orderly fashion in such a short period of time.\nThe US federal government freeze comes as the administration carries out a review of foreign aid funding.\nActing Solicitor General Sarah Harris said Judge Ali's order \"has thrown what should be an orderly review by the government into chaos\".", "url": "https://www.bbc.co.uk/news/articles/cvgwwp2gd3jo"}