{"authors": ["Paul Moseley", "www.facebook.com"], "date_download": "2025-04-26 03:51:36", "date_modify": "2025-04-26 03:51:36", "date_publish": "2025-03-05 11:41:52", "description": "A transport minister says Norfolk County Council \"failed constituents\" over the Norwich Western Link.", "filename": "news_articles_cdjyx0zyy4lo_1745639496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eb08/live/1c92af70-f9a5-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyx0zyy4lo_1745639496.html", "title": "Norfolk council 'wasted resources' on Norwich Western Link road", "title_page": "Norfolk council 'wasted resources' on Norwich Western Link road - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Norfolk County Council \"wasted valuable resources\" with its plans for a £274m link road, a government minister has said.\nFuture of Roads Minister Lilian Greenwood also accused the authority of \"failing its constituents\" over the Norwich Western Link (NWL), after it withdrew its planning application for the scheme.\nThe council did that as it had little hope of permission being given because of rules from Natural England protecting Barbastelle bats.\nGraham Plant, the Conservative councillor responsible for transport, said he thought the minister \"may have been misinformed\".\nThe council has spent £56m on the project and Greenwood's comments came in a letter sent to senior Labour figures in Norfolk.\nFollowing the withdrawal of the planning application, she wrote: \"It is clear to me that Norfolk County Council have failed your constituents, wasted valuable resources and left local residents vulnerable to rat-running.\"\nThe comments suggest the chances of the road ever being built are low, but Plant said the council still hoped to \"achieve a good outcome for Norfolk related to the Norwich Western Link\".\nIn response to the minister's letter, he said the council was still \"working closely\" with the government on an alternative solution but he thought she \"may have been misinformed\":\n\"I would be happy to meet with her to explain the situation and the enormous amount of hard work that has gone into developing this important infrastructure project,\" he added.\nThe council also said it received a letter from the transport secretary Heidi Alexander about its dispute with Natural England over the NWL.\nShe wrote that, while her department could not intervene in such decisions, she could \"understand the council's frustrations\".\nAlexander said her officials would talk to the Department for the Environment, Food and Rural Affairs (DEFRA) about how Natural England \"engages with scheme promoters\".\nThe council did receive better news earlier this week, with the government confirming it will not ask for £33m which it provided for the NWL to be repaid.\nA Department for Transport spokesperson said it was \"committed to improving transport across Norwich to power local growth, jobs and opportunity\".", "url": "https://www.bbc.co.uk/news/articles/cdjyx0zyy4lo"}