{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 06:28:13", "date_modify": "2025-04-26 06:28:13", "date_publish": "2025-02-27 11:34:10", "description": "The Isle of Man Steam Packet Company says the agreement with DFDS will come into force on 24 March.", "filename": "news_articles_cwynnj58414o_1745648893.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c101/live/137d7d80-f4f9-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynnj58414o_1745648893.html", "title": "Isle of Man's MV Arrow chartered to Channel Islands for a year", "title_page": "Isle of Man's MV Arrow chartered to Channel Islands for a year - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manx back-up freight vessel MV Arrow will operate a year-long charter in the Channel Islands, the government-owned ferry firm has confirmed.\nIsle of Man Steam Packet Company said the agreement would come into force on 24 March, after the return of the Ben-my-Chree from dry dock.\nThe Steam Packet said the vessel would undergo port trials and pilotage training before entering service.\nDanish ferry operator DFDS confirmed the MV Arrow would act as the firm's main freight vessel for the Jersey to Portsmouth route from 28 March.\nCurrently based in Douglas, the MV Arrow can carry 66 14m (46ft) trailers and accommodate 12 passengers.\nIt was bought by the Steam Packet for about £8m in 2022 as a back-up freight vessel for the island's then flagship ferry, the Ben-my-Chree.\nWhile it has remained an option for the firm since the arrival of the Manxman in July 2023, under the company's sea services agreement with the Manx government the former flagship ferry must be retained for back-up passenger and freight services.\nJersey's government signed a contract with DFDS to operate ferry services in the Channel Islands in December.\nOn March 28 the Danish firm is set to take over the contract from previous provider Condor Ferries, which had also used the MV Arrow to increase freight capacity.\nIt will travel to Teeside for its own dry-docking before its charter with DFDS following the return of the Ben-my-Chree to Manx waters next month.\nSteam Packet managing director Brian Thomson said the year-long charter would take place while the firm \"future fleet strategy\" was agreed, he said.\nA committee of Manx politicians recently recommended a new sea services framework should be developed for the Isle of Man by the end of 2025.\nA spokesman for DFDS said the MV Arrow would be the main freight vessel for the Portsmouth route, alongside its RoPax vessel Stena Vinga, which would provide freight and passenger capacity.\nThe Danish firm said it was making a \"considerable investment\" into its fleet to provide \"modern and comfortable accommodation\" through a refurbishment of the fast ferry Levante Jet, which would service the Jersey to Poole route from April.", "url": "https://www.bbc.co.uk/news/articles/cwynnj58414o"}