{"authors": ["Elly Fiorentini", "www.facebook.com"], "date_download": "2025-04-26 07:38:53", "date_modify": "2025-04-26 07:38:53", "date_publish": "2025-02-27 13:40:35", "description": "Claudia Lawrence's mother Joan says the new lead officer needs to be \"open-minded\".", "filename": "news_articles_c9q44x0jw9zo_1745653133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/735f/live/40ba92c0-f507-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q44x0jw9zo_1745653133.html", "title": "Claudia Lawrence: New investigation leader appointed in search for missing York chef", "title_page": "Claudia Lawrence: New investigation leader appointed in search for missing York chef - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new officer is to lead the long-running investigation into the disappearance of Claudia Lawrence.\nA North Yorkshire Police spokesperson confirmed Det Supt Jon Sygrove had taken over from Ch Supt Wayne Fox as senior officer for the investigation.\nThe mother of the York chef, who would have celebrated her 51st birthday on Thursday, called for the new investigation leader to be \"open-minded\".\nJoan Lawrence said: \"I think whoever has the job must be very human and kind, I think these are qualities which are needed in a case like this.\"\nClaudia was 35 when she failed to arrive for work at the University of York on 18 March 2009.\nPolice believe she was murdered, although her body has never been found and no charges have ever been brought.\nCh Supt Fox took over the investigation in 2020.\nThe following year police carried out a two-week search of Sand Hutton gravel pits, about eight miles from York.\nThe searches involved draining the smaller of the two lakes and combing through extensive woodland that surrounds both lakes.\nPolice said items were found as part of the operation and were to be assessed.", "url": "https://www.bbc.co.uk/news/articles/c9q44x0jw9zo"}