{"authors": ["Caroline Gall", "Tom Edwards", "www.facebook.com"], "date_download": "2025-04-26 06:34:30", "date_modify": "2025-04-26 06:34:30", "date_publish": "2025-02-27 06:26:03", "description": "George Simpson has run his firm for 40 years and hopes to be there into his 90s.", "filename": "news_articles_c86p3xvd0y6o_1745649270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6dd4/live/b7d94900-f47b-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86p3xvd0y6o_1745649270.html", "title": "Pershore transport boss, 84, has no plans to retire", "title_page": "Pershore transport boss, 84, has no plans to retire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An 84-year-old owner of a transport firm has said he wants to carry on for \"many more years to come\".\nGeorge Simpson decided to invest his savings into purchasing Marshall's Transport, a logistics firm in Pershore, Worcestershire, in 1985.\nThe company was losing money at the time, but now employs more than 80 people, with Mr Simpson still working there three-and-a-half days a week.\n\"My friends tell me 'why aren't you playing golf?' They think I should be on a cruise somewhere, in the Caribbean, but I enjoy being here. I love it,\" he said.\n\"It keeps my brain going. I enjoy being with the lads here, and looking after the business, it keeps me fit and it keeps me going.\n\"I enjoy a pint, I like to go to the pub for a drink to unwind – but this is where I like to be.\"\nMr Simpson works with his 59-year-old son Brian, running day-to-day matters as commercial director.\nHis son said he was proud of his father for having the energy to come in and run the business, which included daily inspections of the firm's whole site.\n\"We've had our moments, that's for sure, but most of the time it seems to go back to an even keel - we get on well,\" he said.\n\"He could be sat at home, drinking tea, going bonkers, but this keeps him on the straight and narrow. At the end of the day everybody needs something to get out of bed for, and for him it's this.\"", "url": "https://www.bbc.co.uk/news/articles/c86p3xvd0y6o"}