{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:47:55", "date_modify": "2025-04-26 03:47:55", "date_publish": "2025-03-05 15:24:10", "description": "The project offers businesses zero-emission deliveries to destinations within Oxford's ring road.", "filename": "news_articles_c9q4xzrv7z9o_1745639275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f0a/live/9f2e6bd0-f9d3-11ef-8be4-3bf54461d42e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q4xzrv7z9o_1745639275.html", "title": "Oxford electric cargo-bike delivery scheme extended", "title_page": "Oxford electric cargo-bike delivery scheme extended - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A partnership that offers electric cargo bike deliveries for businesses is being extended for a further year.\nOxford City Council initially launched the scheme with Velocity Cycle Couriers in March 2024.\nThe project offers businesses same or next-day zero-emission deliveries by electric cargo-bike to destinations within the city's ring road.\nAn initial 12-week trial was twice extended, with the scheme now running until at least February 2026 after the council approved a further extension.\nOxford City Council subsidises 50% of each delivery, with participating businesses paying the remaining cost.\nDeputy leader of the council Anna Railton said she was \"delighted\" the partnership was being extended, allowing the authority to \"continue to support local businesses, reduce carbon emissions and improve air quality\".\n\"We encourage more businesses to join us in this journey towards a greener, cleaner Oxford,\" she added.\nFunding for the extended partnership comes from the authority's air quality grant, with 27 businesses currently using the scheme.\nThe subsidy has allowed the partnership to continue for as long as possible, enabling businesses to explore zero emission deliveries for longer, the council said.\nJake Swinhoe, director of Velocity Cycle Couriers, said the scheme had helped reduce carbon emissions and traffic congestion, as well as contributing to \"better conditions in the city centre for pedestrians and cyclists\".\nHe added: \"We're looking to bring more businesses into the scheme to offer them fast, reliable and sustainable deliveries while improving air quality and reducing pollution across our city.\"", "url": "https://www.bbc.co.uk/news/articles/c9q4xzrv7z9o"}