{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:42", "date_modify": "2025-05-19 15:31:42", "date_publish": "2015-02-11 18:41:26", "description": "Equality campaigners warn about the \"breakneck speed\" at which some welfare powers are being devolved to Scotland.", "filename": "news_uk-scotland-scotland-politics-31429405_1747668702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80944000/jpg/_80944612_scotsmoney.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-politics-31429405_1747668702.html", "title": "Concern over 'breakneck speed' of welfare devolution plans", "title_page": "Concern over 'breakneck speed' of welfare devolution plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Equality campaigners have warned about the \"breakneck speed\" at which some welfare powers are being devolved to Scotland.\nThe organisations said they were concerned it did not allow time for full public consultation.\nThe concerns were raised as Scottish and UK ministers met for the first time to discuss welfare proposals by the Smith Commission.\nThey said the meeting to discuss the transition of power was \"very useful\".\nSome benefits, including Disability Living Allowance, Attendance Allowance and Carer's Allowance, are to be devolved under the Smith plans.\nThe joint ministerial working group on welfare was set up to help implement the changes.\nDeputy First Minister John Swinney and Social Justice Secretary Alex Neil held talks with UK government ministers, including Scotland Office minister David Mundell, Minister for Disabled People Mark Harper and Priti Patel, the Exchequer Secretary to the Treasury.\nBut groups including Engender, the Electoral Reform Society Scotland adn the Scottish Council for Voluntary Organisations, as well as the Scottish Refugee Council and Scottish Women's Aid, warned they had \"serious concerns about the current process for further devolution of welfare to Scotland.\"\nIn a joint statement to the working group, they said: \"The breakneck speed of negotiations is precluding the possibility of democratic civic participation and the chance to create a better system that meets the needs of women in Scotland.\n\"Given the complexity of welfare provision in particular, this cannot be achieved in the timetable set down by your governments.\"\nThe groups, which also include NUS Scotland Women's Campaign, Rape Crisis Scotland, Women's Support Project, YWCA Scotland and Zero Tolerance, said the devolution of some welfare powers was a \"clear opportunity to support women\".", "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-31429405"}