{"authors": ["Joe Skirkowski", "www.facebook.com"], "date_download": "2025-04-26 06:38:04", "date_modify": "2025-04-26 06:38:04", "date_publish": "2025-02-26 06:22:59", "description": "Waste company's reuse shop rehomes 250,000 items", "filename": "news_articles_cd650llvn7xo_1745649484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b936/live/ca2f8a40-f2cf-11ef-ac99-91c4861fe93d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd650llvn7xo_1745649484.html", "title": "Waste company's reuse shop rehomes 250,000 items", "title_page": "Waste company's reuse shop rehomes 250,000 items - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Staff at a reuse shop are celebrating after distributing more than 250,000 items.\nThe products are sold at affordable prices or donated by Bristol Waste Company as part of a wider mission to reduce the amount it discards.\nEverything from electronics to furniture have been re-homed from three sites at Avonmouth, Hartcliffe and St Phillips since the scheme started in 2020.\n\"This success reflects Bristol Waste's commitment to sustainability and the hard work of our Reuse Shop team and volunteers,\" said Jak Boydon, Bristol Waste's Reuse Growth Manager.\nThe shops sell usable items on to the general public at affordable prices.\nSome of the proceeds generated go towards local charities, with St Peter's Hospice so far receiving around £40,000.\n\"We hear stories every day from our customers about how affordable our prices are and how we've helped them\" said Judith Gordon, Shop Manager at the Avonmouth Reuse Shop.\n\"I had a mother tell me that she was able to completely redo her son's room with furniture and items from the shop.\"\n\"Another local told us that with her purchases she was able to completely refurbish her bathroom, from the shelves to the toilet and the sink.\"\n\"We're currently selling between 7,000 and 8,000 items every month and it's only getting bigger as awareness of the Reuse Shops keeps growing,\" said Ms Boydon.\nBristol Waste says it re-homed 80,000 items in 2024 alone.\nIt went on to say that its reuse shops have become a model that other councils across the country are wanting to replicate and are seeking advice from them on.", "url": "https://www.bbc.co.uk/news/articles/cd650llvn7xo"}