{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:43:47", "date_modify": "2025-04-26 07:43:47", "date_publish": "2025-02-26 18:24:01", "description": "The 46-year-old's defence counsel said his wife \"had an agenda\" against her husband.", "filename": "news_articles_cd92q4zqypwo_1745653427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6be8/live/382936b0-f454-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92q4zqypwo_1745653427.html", "title": "Charles Hanson: TV auctioneer's WhatsApp messages set of confessions", "title_page": "Charles Hanson: TV auctioneer's WhatsApp messages set of confessions - court - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Messages sent by celebrity auctioneer Charles Hanson to his wife amount to a \"set of confessions\" to the charges against him, a prosecutor said.\nIn his closing speech to jurors at Derby Crown Court on Wednesday, Stephen Kemp said the WhatsApp correspondence - including one in which Hanson promised to never again \"lay a finger\" on his wife, Rebecca Hanson - show the true nature of the couple's relationship.\nThe 46-year-old presenter, of Ashbourne Road in Mackworth, denies charges of controlling or coercive behaviour over a 10-year period, assault occasioning actual bodily harm and assault by beating.\nSasha Wass KC, defending, said the defendant's wife \"had an agenda\" against her husband as their marriage \"imploded\" into divorce proceedings.\nMr Kemp read a series of messages to the jury, including one in which Mr Hanson said he would change or he would \"have to walk\", and another in which he offered to attend an anger management course.\nA message sent by Mrs Hanson said she was fed up with her husband grabbing her, with others adding \"I have had enough\" and saying she \"shouldn't be scared of my husband\".\n\"You are going to have to work out where the truth lies,\" Mr Kemp said.\n\"If Mr Hanson has lied, I suggest it is pretty obvious why he would do so.\n\"If Rebecca Hanson has lied to you and to the police, I suggest it's rather difficult to understand why she would do so.\"\nMr Kemp said Mr Hanson made a \"rather belated\" and \"desperate\" assertion that Mrs Hanson was looking for a divorce, when she was trying to save her marriage as recently as June 2023 by pursuing counselling through Relate.\nHe said there was \"an awful lot\" of messages that \"reveal an awful lot about what was going on at the time\", describing Mr Hanson as \"a man who realised he had no excuse or justification for what he had done\".\n\"They were sent without anyone thinking that years later they might be used in a trial like this,\" he said.\n\"There really could not be a clearer set of confessions.\"", "url": "https://www.bbc.co.uk/news/articles/cd92q4zqypwo"}