{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:53:44", "date_modify": "2025-05-21 04:53:44", "date_publish": "2025-04-04 00:00:00", "description": "Businessman Yang Tengbo was banned from the UK over concerns he may have been trying to exert influence on the Duke of York.", "filename": "news_live_c5yr5jw8jdwt_1747803224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/08b7/live/336801c0-1177-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c5yr5jw8jdwt_1747803224.html", "title": "Prince Andrew sent yearly birthday cards to China's president, royal aide says in court documents", "title_page": "Prince Andrew sent yearly birthday cards to China's president, royal aide says in court documents - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Birthday cards, leaks and that Newsnight interview - what we learned\nJust over two hours ago, the BBC gained access to new documents relating to the case of an alleged Chinese spy Yang Tengbo, which we and other media outlets had pushed to be released by the courts.\nAmong these was a witness statement from one of Prince Andrew's top aides, Dominic Hampshire, which shed light on the prince's relationship to Yang and China.\nHere's some of the key detail from Hampshire's statement:\nPrince Andrew's involvement with Yang came at a time Hampshire and other royals believed his reputation was \"irrecoverable\", following his infamous Newsnight interview in 2019\nThe prince had a \"communication channel\" with China's President Xi Jinping - including sending an annual birthday letter\nThe communication with Xi was largely used to promote his Pitch@Palace start-up business initiative in China\nBut the witness statement insisted there was \"nothing to hide\" in these exchanges – and they were full of \"top-level nothingness\"\nHe said that because of \"cultural differences\", Mr Yang helped him draft letters to Xi, including in relation to plans for the Eurasia Fund, an investment vehicle which Andrew was seeking to raise funds for\nLeaks to the press took place \"everywhere\" and \"at all sorts of levels\" within the Royal Household\nIn comments released today, Hampshire said he wanted this witness statement kept out of the public eye to \"protect the confidential interactions\" he had with both Buckingham Palace and intelligence services.\nWe're ending our live coverage here, but you can get more in our main story.\nWho is Yang Tengbo?\nWhile we continue to bring you more detail from the documents, here's a reminder of how we got here.\nIn December, Yang Tengbo was identified as the 50-year-old Chinese businessman and alleged spy banned from the UK.\nUK authorities have alleged he formed an \"unusual degree of trust\" with Prince Andrew and developed relationships with politicians to be \"leveraged\" by China.\nYang, a businessman who had lived in the UK since 2002, became a key figure in Prince Andrew’s money-making Pitch@Palace scheme that linked entrepreneurs and investors, including at major events in China.\nDetails of the allegations against him came to light when a Special Immigration Appeals Commission (Siac) upheld a Home Office order banning him from the UK on national security grounds following a long-running legal battle.\nYang had previously only been identified as H6 - at his own request the order suppressing his identity was lifted.\nIn January, Yang's appeal against being banned from the UK was rejected, after an intelligence assessment that he could be secretly working for the Chinese state.\nHe has maintained throughout that the allegation he is a spy is \"entirely untrue\" and denies all wrongdoing.\nRead more about Yang Tengbo\nHampshire witness statement: 'I like and genuinely trust Yang'\nSean Coughlan\nRoyal correspondent\nThere was clearly a friendly and trusting relationship between Prince Andrew’s adviser Dominic Hampshire and Chinese businessman Yang Tengbo. In his witness statement, Hampshire refers to him by the Anglicised name of Chris.\n\"I like Chris and it would be fair to say I genuinely trust him,\" said Hampshire’s statement.\nBut that seems to be despite doubts about his previous dealings with China.\n\"To be honest, as you may be aware, I have had a couple of dealings with businesses in China and quite frankly, they were not good experiences. It is also the main reason why I do not have a Chinese member in my golf club,\" said Hampshire.\nHe mentions problems with not getting payment from a golf club in China. He added: \"The other reason that I do not have a Chinese member of my club is that Chinese golfers do not have a particularly good golf etiquette.\"\nBirthday invitation sent to stroke Yang's ego - witness statement\nElsewhere in his witness statement, Hampshire addresses an invitation to a 60th birthday dinner sent to Yang Tengbo on behalf of Prince Andrew.\nIn the invitation itself, Hampshire stressed that he hoped Yang could appreciate what his invitation meant - as it was \"not an engagement or an exclusive dinner\".\n\"This was strictly his [Prince Andrew] and his family's personal life that very, very few people have the privilege to ever be part of\".\nSpeaking about the invitation in his witness statement, Hampshire said: \"There was significant artistic license in 'blowing smoke' and stroking his ego to maintain Chris's [Yang Tengbo] support for the Duke\".\nHampshire went on to clarify that he did not recall being directly involved with the birthday invitations and \"it would almost certainly have been done via the Duchess\".\nHampshire statement says royal leaks 'everywhere'\nSean Coughlan\nRoyal correspondent\nThe witness statement also warns about the scale of leaks surrounding the Royal Family.\n\"What I have learned over the whole period of working within the Royal Household is that there are leaks everywhere at all sorts of levels. If anything is circulated, it ends up in the press, whether it is in relation to China, Bahrain or Norfolk,\" Hampshire said.\nHe also complains about the hostility of the press.\n\"Every time the Duke does anything, the media attempts to destroy or very least, malign him, often via individuals who leak documents or intel to the press,\" he said.\nDuke’s position was irrecoverable after Newsnight interview, witness statement says\nSean Coughlan\nRoyal correspondent\nWe can bring you some more details now from Dominic Hampshire's witness statement, which is among the documents just released.\nThese comments refer to the period after Prince Andrew’s disastrous BBC Newsnight interview.\n\"It was clear that the Duke’s position was irrecoverable,\" said Hampshire, who was a senior adviser to the Duke of York.\n“This was a common feeling within the Royal Household (despite what the Duke thought may happen),” said Hampshire, suggesting the bleakness of the situation for Prince Andrew.\nHampshire added that the link with Yang Tengbo was a reflection that the Pitch@Palace project, particularly in China, was “arguably the only light at the end of the tunnel for him”.\nThis need to keep up good relations with Yang Tengbo meant “blowing smoke” and “stroking his ego”, according to the witness statement.\nBut the statement from Hampshire emphasises how much the adviser trusted and liked Yang Tengbo, later alleged to have been a spy acting on behalf of the Chinese government.\nPrince Andrew had 'communication channel' with China - witness statement\nSean Coughlan\nRoyal correspondent\nThe newly-disclosed document shows that Prince Andrew had a “communication channel” with the president of China.\nAccording to Dominic Hampshire, Prince Andrew’s adviser, this was largely used to promote his Pitch@Palace start-up business competition in China.\nHe says that because of “cultural differences” Yang Tengbo helped him draft letters to the president and that they also sometimes related to plans for an investment fund for China, the “Eurasia Fund”.\nBut the witness statement insisted there was “nothing to hide” in these exchanges – and they were full of “top-level nothingness”, such as birthday wishes.\nHampshire says that the late Queen Elizabeth II knew about this connection. “It was an open channel that was useful to have,” said Hampshire.\nDuke 'fully complied' when told to cease contact with Tengbo - Hampshire\nAs we're looking through the newly released documents, we've just got these comments in from Dominic Hampshire.\nAs we reported earlier, Hampshire's witness statement about the relationship between Prince Andrew and Yang Tengbo is among the documents released to us.\nIn a press statement released now, Hampshire says his desire to keep his witness statement out of the media was to \"protect the confidential interactions\" he had with both Buckingham Palace and intelligence services.\nHe says that the Palace was \"kept informed of all my commercial endeavours\" on behalf of the Duke, and that \"at all times\" he sought to \"protect the best interests of the Royal Family\".\n\"For the record,\" he continues, \"as soon as the Duke of York was advised to cease all contact with Mr Yang, he fully complied\".\n\"He did not receive a penny in funding or support, directly or indirectly, from any Chinese individual or entity,\" Hampshire adds.\n\"In my personal business capacity, I continued dealings with the Hampton Group in China – which is not sanctioned - and, in accordance with current UK policy, doing business in China and with Chinese individuals is entirely legitimate.\"\nWhat are the documents about?\nDominic Casciani\nHome and Legal correspondent\nThe previously confidential documents - which were blacked out or missing pages in the court file until now - have just been disclosed to us. So we have a lot of reading to do.\nSome relate to Mr Yang’s dealings with Prince Andrew and his plans for a China-focused investment fund. Some related to the businessman’s other commercial interests acting as a consultant.\nThe document we’re going to read first is Dominic Hampshire’s witness statement - Prince Andrew’s closest aide in the wake of his 2019 Newsnight interview.\nHampshire told the Special Immigration Appeals Commission that he would never have written it had he known it could become public.\n\"I wrote what I did in the statement with such candour... in the expectation it was for the private attention of one of the most senior ministries of state on a grave matter,\" he said.\nThe tribunal ordered the document’s release to the media under the \"open justice\" principle - saying the public have a right to know his account of these very serious events.", "url": "https://www.bbc.com/news/live/c5yr5jw8jdwt"}