{"authors": ["Erin Black", "www.facebook.com"], "date_download": "2025-04-26 06:28:50", "date_modify": "2025-04-26 06:28:50", "date_publish": "2025-02-27 11:27:11", "description": "Six lots by the acclaimed painter went under the hammer depicting life in Jersey.", "filename": "news_articles_c201190jr29o_1745648930.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e725/live/c3cb7230-f500-11ef-9808-4d9b058d1a40.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c201190jr29o_1745648930.html", "title": "Edmund Blampied paintings sell at auction for more than £37k", "title_page": "Edmund Blampied paintings sell at auction for more than £37k - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rare collection of paintings by Jersey artist, Edmund Blampied, have been sold at auction for more than £37,000.\nSix individual lots went under the hammer at Dawsons Auctioneers in Jersey, with the most expensive painting, \"Seaweed Harvesting, Jersey\" selling for £13,000.\nThe collection was previously on display at Government House when Admiral Sir Randolph Stewart Gresham Nicholson served as Jersey's Lieutenant-Governor.\nJonathan Pratt, managing director of Dawsons Auctioneers, said it was \"a privilege to bring such a special collection to auction.\"\nThe auction house said Edmund Blampied, who died in 1966, was widely regarded as Jersey's \"most renowned artist\" and was celebrated for his ability to \"capture the essence of island life with charm, character, and a deep sense of place.\"\nThe artworks for sale included some of Mr Blampied's \"most evocative depictions of Jersey life\", it said.\nLot 10, a watercolour titled \"Peeling Potatoes\" was sold along with a letter from the artist to its previous owner for £5,500.\nThe letter read: \"Dear Lady Nicholson, the old lady peeling potatoes must be, I am sure, feeling so greatly honoured at being in Government House – but at the same time wishing most desperately that she had on a cleaner apron and the hat especially reserved for Sundays which is fitted with black grapes, ribbon and a kingfisher…\"\nSome of the other works in the sale included \"Surf Riders\" and \"Vraicking, Jersey; Study of Flowers (verso)\", which sold for £11,000 and £7,500 respectively.", "url": "https://www.bbc.co.uk/news/articles/c201190jr29o"}