{"authors": ["Piers Edwards", "www.facebook.com"], "date_download": "2025-05-19 15:29:19", "date_modify": "2025-05-19 15:29:19", "date_publish": "2015-02-09 13:38:45", "description": "As Ivory Coast seal victory against Ghana in this year's Africa Cup of Nations, Piers Edwards rounds up the five lessons from the tournament.", "filename": "news_world-africa-31296299_1747668559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80883000/jpg/_80883096_80883095.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31296299_1747668559.html", "title": "Afcon 2015: Five lessons from the Africa Cup of Nations", "title_page": "Afcon 2015: Five lessons from the Africa Cup of Nations - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 2015 Africa Cup of Nations came to a dramatic end on Sunday night when Ivory Coast sealed a thrilling 9-8 victory over Ghana on penalties.\nThe win brought to an end a 22-year drought for Ivory Coast, and capped a tournament that was moved at the last minute and almost overshadowed by violence.\nBut what did we learn? Here are five key lessons from this year's competition.\nAfter losing in the 2006 and 2012 finals (and limited displays at the past three World Cups), Ivory Coast had been accused of lacking mettle.\nBut anyone who saw how they responded to adversity in Sunday's final - converting five penalties when a miss at any stage would have lost the cup - may reconsider.\nGhana did little wrong in the final but this was a fully-deserved success for the Elephants, who have finally won again despite the departure of several members of their \"golden generation\" - including Didier Drogba, Didier Zokora, and Emmanuel Eboue.\nMany of the old guard were on the field in Bata - with Kolo Toure, Tiake Siene and goalkeeper-turned hero Boubacar Barr all appearing at a seventh Nations Cup.\nThe parallels with their sole previous success, in 1992, were uncanny. As on Sunday, the Ivorians played Ghana, the game ended 0-0, there was a marathon shoot-out (22 on Sunday, 24 in 1992) and the goalkeeper was the hero (in 1992, Alain Gouamene was also at a seventh Nations Cup).\nThe Confederation of African Football (Caf) had spent nearly three years preparing for a 2015 Nations Cup in Morocco when the North Africans effectively pulled the plug in November over fears Ebola would spread to the country.\nThat left little over two months to find a new host. With few forthcoming because of continuing Ebola concerns, Caf asked Equatorial Guinea, who had co-hosted in 2012, to step in.\nThey duly obliged and despite widespread doubts - especially once the condition of the new venues Ebebiyin and Mongomo first came to light - somehow managed to pull it off.\nThere were some problems, with teams lamenting the poor accommodation - some hotels flooded, others with dangerous wiring - but by and large, Equatorial Guinea turned the finals into an improbable success.\nHicham El Amrani, general secretary of Caf, called the turnaround \"miraculous - nothing short of that\".\nSurprised?\nThursday's semi-final between hosts Equatorial Guinea and Ghana, at the Estadio de Malabo, was marred by violence from the home fans. Ghana supporters were attacked with various missiles and had to shelter on the pitch.\nOne of the crowd control ideas in particular left a great deal to be desired.\nA helicopter was flown just 10 metres above fans, but failed to disperse them. In fact, they simply whooped and cheered.\nHis performances belied his failure to make an impact at Everton, where he is on loan from parent club Chelsea.\nIvory Coast's Gervinho knows what it is like to underwhelm in the Premier League but he was a joy to watch, constantly zooming past players as he relentlessly drove forward when in possession.\nThere were several big performances from his colleagues: Kolo Toure marshalling an inexperienced defence superbly, Serey Die excellent in his defensive midfield role, Max Gradel also shining before fading in the final.\nPerhaps the most unexpected performance though came from Equatorial Guinea goalkeeper Felipe Ovono, who was a beacon of unflappable calm throughout his team's surprise run - despite being only 21.", "url": "https://www.bbc.com/news/world-africa-31296299"}