{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:17", "date_modify": "2025-05-19 15:22:17", "date_publish": "2015-02-24 16:08:14", "description": "The FTSE 100 share index closes at a new high, surpassing the previous record set in December 1999.", "filename": "news_business-31611261_1747668137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79670000/jpg/_79670032_lse1_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31611261_1747668137.html", "title": "FTSE 100 closes at record level", "title_page": "FTSE 100 closes at record level - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The FTSE 100 share index has hit a new high, passing through the previous record set on 30 December 1999.\nIt closed at a new peak of 6,949.63. The previous record close was 6,930.2, set at the height of the dotcom boom.\nEarlier, the index also set a new intra-day high of 6,958.89, surpassing the previous figure of 6,950.6, also set on 30 December 1999.\nShares rose after eurozone finance ministers approved reform proposals submitted by Greece.\nThe proposals were a condition for a four-month extension of Greece's bailout.\nStock markets around the world have been buoyed by economic stimulus programmes put in place by central banks after the global financial crisis that hit in 2008.\n\"Equity investors have been riding the wave of cheap money, fuelled by unconventional monetary policies pursued by the world's central banks which have allowed this bull market to extend well beyond the duration of your average length of a bull market,\" said Angus Campbell, senior analyst at online currency broker FxPro.\nThe FTSE 100's rise has been slower than those of stock markets in the US and Germany.\n\"It is hardly impressive that, more than 15 years later, the FTSE 100 has finally breached its previous record close, said Samuel Tombs, said senior UK Economist at Capital Economics.\n\"Both the S&P 500 and Dax 30 exceeded their millennial year peaks in 2007 and they are now about 45% and 65% higher respectively,\" he said.", "url": "https://www.bbc.com/news/business-31611261"}