{"authors": ["Louise Parry", "www.facebook.com"], "date_download": "2025-04-26 06:13:21", "date_modify": "2025-04-26 06:13:21", "date_publish": "2025-03-02 06:10:18", "description": "Abi Spendlove says she is \"fascinated\" by the River Lea in Luton.", "filename": "news_articles_cj0qqm3e801o_1745648001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/212f/live/dde8b9b0-f5bf-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0qqm3e801o_1745648001.html", "title": "Luton's River Lea 'should be celebrated' in photo competition", "title_page": "Luton's River Lea 'should be celebrated' in photo competition - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For many years it has been a neglected river where industrial waste and shopping trollies were dumped, but a photography project is hoping to shed new light on Luton's overlooked River Lea.\nArtist Abi Spendlove has launched a competition to encourage more people to \"connect\" with the chalk stream.\n\"The river's foundational to our town, it's the reason Luton exists,\" she said. \"I'm totally fascinated by it.\"\nMs Spendlove added: \"Luton gets its name from there: Lea Town. I've been making artwork about the River Lea since I moved here about 15 years ago.\n\"One of the things I've learned from spending time at the river, is it changes all the time. I wanted to offer that experience to other people as well.\n\"In order to take part, people would have to physically go to the river themselves, and connect and engage with it.\"\nThe River Lea rises in Leagrave, Lewsey and Houghton Regis, external, flowing through Luton into Hertfordshire and onto London where it joins the River Thames.\nMs Spendlove said parts of the Luton section were in bad shape.\n\"There's an incredible amount of rubbish in the river even now. It's getting blown in but also dumped there, which is so sad,\" she said.\nThe artist said people's relationship with the river had \"really changed over the years\".\n\"When Luton was a thriving town full of industry, a lot of factories backed onto it and threw their waste into it – dye works and glue works.\n\"It's not surprising that it was culverted (covered over): it was a smelly inconvenience.\"\nShe said recent campaigns had championed the river and enabled parts to be opened up, such as in the Hat Gardens.\n\"We're starting to see the river as a linear park running through town. There's hope more and more sections will be open.\"", "url": "https://www.bbc.co.uk/news/articles/cj0qqm3e801o"}