{"authors": ["Andrew Spence", "www.facebook.com"], "date_download": "2025-04-26 07:07:11", "date_modify": "2025-04-26 07:07:11", "date_publish": "2025-02-28 06:06:04", "description": "Politicians say they are disappointed National Highways will no longer provide £1m of funds.", "filename": "news_articles_cp3yyllx8xgo_1745651231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd62/live/7800db70-985c-11ef-82c3-45a801b7330b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yyllx8xgo_1745651231.html", "title": "Hull's South Blockhouse project 'at risk' after funding shortfall", "title_page": "Hull's South Blockhouse project 'at risk' after funding shortfall - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A planned visitor attraction showcasing Hull's Tudor history has been put \"at risk\" because of a funding shortfall, an MP has said.\nConstruction work on the South Blockhouse was expected to begin in the summer. The project was due to receive £1m from National Highways, but the government agency disclosed the money had never been officially allocated, according to the Local Democracy Reporting Service.\nMP for Hull East, Karl Turner, and Mike Ross, the leader of Hull City Council, have both expressed their disappointment.\nHowever, National Highways said that while it had previously supported the initial stages of the project, it had been \"unable to progress with further funding\".\nProposals for the attraction, near The Deep, included a reconstruction of parts of a castle built for Henry VIII near the mouth of the River Hull.\nIt would also feature wire and mesh structures to give visitors a sense of the scale of the 16th Century fortress without damaging the surviving ruins.\nIn a letter to National Highways, seen by the LDRS, Turner said the decision had put the project \"at risk\".\n\"The South Blockhouse is a site of immense cultural and historical importance. Its preservation and development as a visitor attraction would provide invaluable insights into our nation's maritime heritage and fortifications,\" he said.\nIn his letter, Turner claimed the money had already been allocated but National Highways said this was \"inaccurate\".", "url": "https://www.bbc.co.uk/news/articles/cp3yyllx8xgo"}