{"authors": ["Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:22:53", "date_modify": "2025-04-26 04:22:53", "date_publish": "2025-03-03 13:27:18", "description": "The event is held by 1st and Bowery, which provides spiking test strips and a reporting system.", "filename": "news_articles_cx2re1yzdpjo_1745641373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a66b/live/837709f0-f830-11ef-a8b4-b37546a32a57.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2re1yzdpjo_1745641373.html", "title": "Anti-drink spiking workshop held for businesses", "title_page": "Shropshire: Anti-drink spiking workshop held for businesses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An event is being held in Shropshire to advise education professionals, plus bars and other venues, on how to better protect against drink-spiking.\nThe event, at Albert's Shed in Telford on Monday, is being run by 1st and Bowery, a company which distributes spiked drink testing kits.\nIt is in collaboration with West Mercia Police, and those invited include licensed premises, schools and colleges, the NHS and councillors.\n\"We can talk about where spiking takes place, what it does to the body, how you can protect yourself and how venues can work to make their premises a little bit safer,\" said Vince Dovey, from 1st and Bowery.\nHe told the BBC that it was hard to tell how much spiking was going on.\n\"There's a lot of anecdotal evidence that spiking takes place, a lot of people know someone who has been spiked or has been spiked themselves, but the police find it very, very difficult to get reliable information,\" he said.\n\"We not only offer test strips where members of the public can get their drinks tested, but we have a reporting system as well so we can get a better idea of where it's taking place, when it's taking place, who's affected, and then we give that information to the police and they can apply resources as and where required,\" he said.\nThe test strips take about 90 seconds and test for about 650 drugs.\n\"It's not just rohypnol or ketamine, there are so many different drugs that people put in other people's drinks, it can be stuff from medicine cabinets, it can be illegal drugs they've bought on the streets... it can be a whole manner of things,\" he added.\n\"We work with venues, so if there is a positive result not only do they look after the individual, they also protect the drink as evidence, and it gives the police a much better opportunity to try and progress a criminal case against someone.\"", "url": "https://www.bbc.co.uk/news/articles/cx2re1yzdpjo"}