{"authors": ["Mansur Abubakar", "www.facebook.com"], "date_download": "2025-04-26 03:48:17", "date_modify": "2025-04-26 03:48:17", "date_publish": "2025-03-05 15:00:46", "description": "A senator accused Godswill Akpabio of harassing her - allegations he denied.", "filename": "news_articles_cr52vyepp8lo_1745639297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2d93/live/5b4dacc0-f9c7-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr52vyepp8lo_1745639297.html", "title": "Godswill Akpabio: Sexual harassment petition against Nigeria’s senate president dismissed", "title_page": "Godswill Akpabio: Sexual harassment petition against Nigeria’s senate president dismissed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The petition filed by a Nigerian senator alleging sexual harassment by the senate president has been dismissed.\nGodswill Akpabio, one of the country’s most senior politicians, on Wednesday denied the allegations made against him by Natasha Akpoti-Uduaghan.\nThe ethics committee which was mandated to look at the petition cited procedural violations and legal constraints at a hearing afterwards.\n\"The petition runs contrary to Senate rules and cannot be entertained,\" said chairman of the ethics committee senator Neda Imasuen.\nHe added that Uduaghan had personally signed the petition instead of having it endorsed by another individual, violating an order of the senate.\nIn an interview with Arise Television on Friday, Senator Uduaghan alleged that Akpabio had made inappropriate advances towards her during a visit to his residence in southern Akwa Ibom state, on 8 December 2023.\nShe further alleged that Akpabio had, on a separate occasion, insinuated that she should \"take care of him\" if she wanted her motions to receive favourable consideration in the senate.\nThe senator alleged that Akpabio was behaving like a university lecturer who consistently failed his student who had refused to sleep with him.\nBut this was denied by Akpabio.\n\"At no time did I ever harass any woman. I was raised very well by my late single mother, and I have always upheld respect for women. I was even awarded the most gender-friendly governor in Nigeria,\" he noted.\nThe issue has generated huge debate in Nigeria with many calling for an independent investigation.\nIn a social media post, one of Akpabio's predecessors as senate president, Bukola Saraki, said the issues raised were too serious to be simply brushed aside.\nEarlier on Wednesday, two groups of protesters gathered at the assembly ground in the capital, Abuja - one backing Akpabio and the other in support of his colleague, chanting ''Akpabio must go.''\nSenator Uduaghan used Wednesday's plenary session to submit the petition calling for an investigation into Akpabio's behaviour.\nAs the president, it was Akpabio who allowed Uduaghan to submit the petition.\nBefore becoming senate president less than two years ago, Akpabio was governor of the oil-rich Akwa Ibom state for eight years and also minister of Niger Delta affairs under former President Muhammadu Buhari.", "url": "https://www.bbc.co.uk/news/articles/cr52vyepp8lo"}