{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:21", "date_modify": "2025-05-19 15:36:21", "date_publish": "2015-02-19 12:03:18", "description": "A new law to end the collection of historic poll tax debt is backed by MSPs at Holyrood.", "filename": "news_uk-scotland-scotland-politics-31533524_1747668981.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81102000/gif/_81102291_polltaxbbc.gif", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-politics-31533524_1747668981.html", "title": "MSPs vote to end poll tax debt collections", "title_page": "MSPs vote to end poll tax debt collections - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new law to end the collection of historic poll tax debt has been backed by MSPs at Holyrood.\nThe Community Charge Debt (Scotland) Bill, external has now completed its parliamentary hurdles.\nThe new law will effectively write off £425m of unpaid bills relating to the controversial household tax which was introduced by the 1989 Tory government.\nThe Scottish Conservatives were against the move but the Scottish government said it was the right thing to do.\nThe proposal to end the debt collection was brought forward last year by former first minister Alex Salmond after several councils said they would use the details of people who registered to vote in September's independence referendum to recover outstanding payments.\nDeputy First Minister and Finance Secretary John Swinney said ahead of the final debate and vote: \"The poll tax was a deeply unfair, regressive levy which should never have been introduced in the first place.\n\"A Tory government, which Scotland had rejected, imposed the tax on Scotland, and - as was recently confirmed in documents released under the 30-year rule - they were determined that Scotland be a guinea pig for their disastrous tax experiment.\n\"Although the poll tax is now defunct, its bitter legacy is still with us. It cannot be right that people fear being on the electoral registers because of decades-old debt relating to a discredited and unjust tax. Nor is it right that some of the few people paying off poll tax debt are the poorest in society.\"", "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-31533524"}