{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:40:07", "date_modify": "2025-04-26 07:40:07", "date_publish": "2025-02-27 12:40:26", "description": "Police release recordings of the Bangor woman as part of an appeal 20 years on from her disappearance.", "filename": "news_articles_c757zg7vd04o_1745653207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4343/live/470f7920-f506-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c757zg7vd04o_1745653207.html", "title": "Lisa Dorrian: CCTV of missing woman released for first time", "title_page": "Lisa Dorrian: CCTV of missing woman released for first time - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For the first time, police have released CCTV footage of the missing woman Lisa Dorrian which was filmed just days before she disappeared 20 years ago.\nMs Dorrian, who is believed to have been murdered, has not been seen since she went to a party in Ballyhalbert, County Down, at the end of February 2005.\nPolice said on Thursday that the CCTV recording is \"the last known footage of Lisa\".\nHer family have joined police to reissue their appeal for information, saying: \"Twenty years of secrecy could be ended with a single phone call.\"\nAhead of the anniversary of the Bangor woman's disappearance, a reward of £20,000 has been offered to anyone who has information leading to a conviction for her murder or to the recovery of her body.\nMs Dorrian, who was 25 and from Bangor, was last seen at 05:00 GMT on 28 February 2005, having attended a house party at a caravan park in Ballyhalbert.\nHer handbag and belongings were discovered at the party.\nNo one has ever been convicted over her disappearance and, despite many land and sea searches, her body has never been found.\nThe Police Service of Northern Ireland (PSNI) began treating the case as a murder inquiry almost immediately after her disappearance.\nDet Ch Insp Kerrie Foreman said she hoped releasing the CCTV footage would \"jog memories and to encourage anyone with information to speak up\".\n\"Twenty years have now passed. That's 20 long years of unimaginable torment for a loving family,\" she said.\n\"Yet, despite their pain, they've never given up their search for answers and, likewise, our determination has remained steadfast.\"\nThe officer said those responsible for her murder \"have not yet been held to account\" and she appealed to witnesses to \"do the right thing\".\nThe Dorrian family, including her younger sister Joanne, have led a high-profile campaign in a bid to find Lisa's body and bring her killers to justice.\nAt Thursday's press conference, Joanne Dorrian said: \"Lisa lost her life at the hands of people she knew and trusted.\"\nShe said she would have \"laughed and joked with these people\" on the night she went missing and would \"never have imagined\" they would have caused her harm.\n\"Our family has never been the same since the day we got the news that Lisa went missing,\" Joanne added.\n\"Our mum went to her grave never knowing what happened to her beautiful first-born daughter.\"\nShe said her family's grief and pain has been \"all consuming\" and her \"absence in all of our lives has grown over the years\".\nThe Dorrians are now stepping up their appeal with a new digital billboard and bus shelter poster campaign.\nJoanne Dorrian told reporters that her older sister had been \"denied all of her hopes and dreams\" but the family \"hope to see Lisa's murderers in court one day soon\".\nIn a direct appeal to those who know the killers, she said: \"Twenty years of secrecy could end with a phone call, a letter, a message.\n\"Please tell us where Lisa is.\"", "url": "https://www.bbc.co.uk/news/articles/c757zg7vd04o"}