{"authors": ["Daisy Stephens", "www.facebook.com"], "date_download": "2025-04-26 06:50:34", "date_modify": "2025-04-26 06:50:34", "date_publish": "2025-03-01 07:45:34", "description": "Carol Anne Doyle said she needed to bring a lot of stuff when going to hospital for treatment.", "filename": "news_articles_c93nnz4nnqko_1745650234.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c7d/live/182e6810-f5cd-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93nnz4nnqko_1745650234.html", "title": "Berkshire charity Bags of Hope nominated for local award", "title_page": "Berkshire charity Bags of Hope nominated for local award - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the founders of a charity that makes bags for cancer patients has said their products show people they are \"not alone\".\nLindsey Lucas and Carol Anne Doyle started Bags of Hope in autumn 2024, and have so far distributed 350 bags across Berkshire.\nMs Doyle, who herself has been treated for cancer, said the bags were designed to carry everything people needed for receiving cancer treatment.\nMs Lucas said they were \"made with love and hope\", and were a way of offering people practical support.\n\"It's sometimes very difficult to say to a person who's got cancer 'I want to be there for you' without seeming gushing or too over emotional,\" she said.\n\"Give a bag and say 'I want to support you with this and this is a gift for you just to help you a little bit on that road so that you know you're not on your own'.\"\nMs Doyle was diagnosed with endometrial and ovarian cancer in 2019.\n\"I took every single treatment that they threw at me - chemotherapy, radiotherapy, all sorts of things - and it was a real journey,\" she said.\nShe found she needed \"a tonne of stuff\" for her treatment, and made herself a bag to carry it all in - and then wanted to do the same for others.\nThe charity recommends a number of things that could go in the bag, including scarves, items needed for cold caps, snacks, earphones, a magazine, a notebook to write down what the nurses or doctors tell you, and information booklets.", "url": "https://www.bbc.co.uk/news/articles/c93nnz4nnqko"}