{"authors": ["Christal Hayes", "www.facebook.com"], "date_download": "2025-04-26 03:53:56", "date_modify": "2025-04-26 03:53:56", "date_publish": "2025-03-03 07:33:39", "description": "The relatively minor quake struck at around 22:00 local time as stars gathered at the Vanity Fair afterparty.", "filename": "news_articles_cd0nlk3vg1lo_1745639636.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d4b7/live/189b4b90-f7fa-11ef-a3d2-f5d94b774e86.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0nlk3vg1lo_1745639636.html", "title": "Earthquake hits Hollywood as stars gather for Oscars afterparty", "title_page": "Earthquake hits Hollywood as stars gather for Oscars afterparty - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A magnitude 3.9 earthquake has hit Hollywood as some of the globe's top stars began celebrating after the Oscars.\nThe earthquake's epicentre was measured in North Hollywood, just miles from where the awards ceremony was hosted at the Dolby Theatre.\nThere were no immediate reports of damage or injuries. The quake struck shortly after 22:00 local time as celebrities were gathering at the popular Vanity Fair afterparty.\nThose in the area reported a sudden jolt of energy, with some screaming and seeing high-rise buildings wobbling like jelly.\nThe Los Angeles Fire Department said that the earthquake was felt across downtown Los Angeles but the agency was not entering into \"Earthquake Mode\" over the incident.\nFor stronger earthquakes, first responders and officials do assessments of the area to ensure there is no structural damage to buildings and infrastructure.\nThe quake is among about 40 that have hit Southern California since the start of March - though nearly all of these were magnitude 1 earthquakes that aren't typically felt by residents, according to USGS data reviewed by the BBC.\nLast month, there was a magnitude 3.7 earthquake that struck the nearby Malibu area. In December, a strong magnitude 7 earthquake jolted northern California and caused a short tsunami alert for those in northern California and southern Oregon.\nBBC correspondents covering the Academy Awards in the heart of Hollywood reported fierce shaking and even some screams as the sudden jolt scared visitors. To some, it sounded like a bomb went off with the rumble.\nOne resident called it the biggest earthquake she'd felt and was surprised it was only a magnitude 3.9. \"I felt that in my bones,\" she remarked.\nThe BBC's Emma Vardy said she was retouching her makeup for some final Oscars filming when the quake struck. Her rhinestone chandelier earrings wobbled in the mirror and she realised the high-rise she was in was shaking.\n\"I have felt a lot of quakes over the past two years in Los Angeles but currently, I am on the 15th floor of our media centre in Hollywood,\" she remarked. \"Feeling a building of that size move around like jelly is quite an experience.\"\nSam Granville and Emma Vardy contributed to this report.", "url": "https://www.bbc.co.uk/news/articles/cd0nlk3vg1lo"}