{"authors": ["Jess Warren", "www.facebook.com"], "date_download": "2025-04-26 06:35:55", "date_modify": "2025-04-26 06:35:55", "date_publish": "2025-02-27 06:07:07", "description": "The London Assembly is investigating the impact of violence against women and girls on young people.", "filename": "news_articles_cgm1ypvm0gro_1745649355.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fb4b/live/6583fb00-f43f-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1ypvm0gro_1745649355.html", "title": "Violence against women and girls 'endemic'", "title_page": "Violence against women and girls 'endemic', London Assembly told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Violence against women and girls is an \"endemic\" problem in the capital, the London Assembly has heard.\n\"It's a really serious issue,\" Janaya Walker, head of public affairs at the End Violence Against Women coalition told the Assembly.\nOn Tuesday the London Assembly Police and Crime Committee announced that it would begin an investigation into violence against women and girls (VAWG).\nIt will focus on the impact of such violence on young people in London.\nEllie Softley, head of education at charity Everyone's Invited, told the Assembly that \"something is going fundamentally wrong\" within safeguarding approaches at schools.\n\"Rape culture is thriving in our society, but it really takes root in schools,\" she said.\n\"For a lot of young people, safeguarding is not fit for purpose.\n\"Loads of young people that we speak to say that the actual process of reporting and going to a safeguarding leader at school is more traumatising than the actual assault that happened to them.\"\nMs Walker called for a strategic needs assessment across London that covers all violence against women and girls.\n\"We know that the experience of sexual harassment tends to be experienced more disproportionately by younger age groups,\" she said.\n\"It feels as though lots of services are really struggling and young women and girls are struggling in terms of getting access to support. It is bleak in many ways.\n\"In terms of the picture of VAWG in London, it remains the case that it is endemic.\"\nShe added: \"It's quite difficult to conclude whether things are getting better or things are getting worse because the data is quite poor.\"", "url": "https://www.bbc.co.uk/news/articles/cgm1ypvm0gro"}