{"authors": ["Emily Ford", "www.facebook.com"], "date_download": "2025-04-26 06:36:05", "date_modify": "2025-04-26 06:36:05", "date_publish": "2025-02-27 06:04:14", "description": "Wilson has been playing golf since he was one, and his parents say he is \"obsessed\" with the sport.", "filename": "news_articles_ckg170p9871o_1745649365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fa63/live/26506d50-f454-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg170p9871o_1745649365.html", "title": "Golf helps Bournemouth three-year-old boy with speech delay", "title_page": "Golf helps Bournemouth three-year-old boy with speech delay - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "While some babies were holding their favourite cuddly toy to help them sleep, three-year-old Wilson was holding a golf ball.\nThe toddler is \"obsessed\" with the sport, his mum Rebecca said, and they go to the driving range in Bournemouth, Dorset, at least four times a week.\nShe said his love started at an early age, remembering he would find his dad's golf balls around the house and at the age of one he would take them to bed with him.\nThe toddler has since become a familiar face on golf courses near his home, learning how to play by watching others.\nRebecca said: \"We don't teach him anything, he watches people at the driving range in the bays next to him and he watches their feet and then afterwards he does it.\"\nShe said the sport was \"always on his mind\", whether he was using his fork to putt peas around his plate, or picking up the kitchen broom to practice his swing.\nEven the word golf was the first that Wilson said out loud.\n\"He's loved it his whole life,\" Rebecca continued.\n\"Every time I see him playing, I just think he is so lucky to have found something he loves so early on.\n\"He has such a knowledge of who he is, it's really sweet.\"", "url": "https://www.bbc.co.uk/news/articles/ckg170p9871o"}