{"authors": ["Marcus White", "www.facebook.com"], "date_download": "2025-04-26 07:37:27", "date_modify": "2025-04-26 07:37:27", "date_publish": "2025-02-27 14:20:53", "description": "The authority said it would freeze parking fees, invest in coastal protection and combat flooding.", "filename": "news_articles_cj3nnjp02vlo_1745653047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/272b/live/46b41910-f50e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3nnjp02vlo_1745653047.html", "title": "Council approves 5% tax rise and savings plan", "title_page": "Isle of Wight Council approves 5% tax rise and savings plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Isle of Wight Council has approved a 5% council tax rise from April, together with £1.5m in savings.\nOnly two councillors - Conservative Matthew Price and Independent Labour member Geoff Brodie - voted against the Alliance administration's budget package at Wednesday's full council meeting.\nPreviously, the authority said it would freeze parking charges, invest in coastal protection and combat flooding.\nA decision on whether to close five island primary schools is due to be taken next week.\nThe council said the budget-setting process was \"as challenging as ever\" in the face of rising costs.\nIts budget report, external said an extra £15.8m was needed in 2025/26 to avoid cuts to adult social care and children's services.\nHowever, extra government help for social care only amounted to £5.3m, the report said.\nTo help balance the books, the authority said it would use \"one-off\" pots of money, including a council tax and business rate surplus.\nHowever, this would leave a \"structural deficit\" that would affect the budget in future years, it added.\nCouncil reserves, which were drained to close to minimum levels this year, would be slightly replenished in 2025/26, the report said.\nPreviously the authority said the £1.5m savings would be met through \"efficiencies and income generation... without cutting services\".\nCouncil leader Phil Jordan said: \"We are dedicated to ensuring our community continues to thrive, even in the face of economic pressures.\"\nCouncil elections on the Isle of Wight have been postponed until 2026, while the government considers an application by the island and its Hampshire partners for a combined Solent mayoral authority.", "url": "https://www.bbc.co.uk/news/articles/cj3nnjp02vlo"}