{"authors": ["Julia Bryson", "www.facebook.com"], "date_download": "2025-04-26 06:28:10", "date_modify": "2025-04-26 06:28:10", "date_publish": "2025-02-27 11:36:47", "description": "The plain clothes female police officer is being treated for serious facial injuries, police say.", "filename": "news_articles_c1kjjvpy1n4o_1745648890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/defa/live/42f16660-f4fb-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjjvpy1n4o_1745648890.html", "title": "Leeds police officer injured as brick thrown at car", "title_page": "Leeds police officer injured as brick thrown at car - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer has been left with serious facial injuries after a brick was thrown through the window of an unmarked car she was in in Leeds.\nWest Yorkshire Police said two officers in plain clothes were in the Halton Moor area on Monday evening when they were attacked.\nThey were in a car in Coronation Parade when a brick was thrown through the driver's side window, hitting the female officer who then needed hospital treatment.\nCCTV images have been released of a man who police want to speak to in connection with the incident.\nPolice said the suspect, who was wearing dark clothing and a face covering, had been the passenger on a bike ridden by another male who had shouted abuse at the officers.\nThey then followed them as they drove off.\nOfficers are keen to hear from anyone who witnessed the incident or who has any information that could assist the investigation, particularly anyone with relevant CCTV or dashcam footage.\nDet Supt Sarah Lambert, Leeds District Head of Crime and Safeguarding, said: \"This is a shocking incident where a police officer was attacked whilst doing her job and working to protect the public.\n\"Assaults on officers are completely unacceptable and we are committed to finding those involved.\n\"Welfare support is being offered to the injured officer and our enquiries remain ongoing.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c1kjjvpy1n4o"}