{"authors": ["Bethany Bell", "www.facebook.com"], "date_download": "2025-04-26 07:37:36", "date_modify": "2025-04-26 07:37:36", "date_publish": "2025-02-27 14:07:08", "description": "Three parties reach an agreement to form a coalition, 151 days after elections were held in September.", "filename": "news_articles_c0q1188p1n2o_1745653056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7c65/live/beb824d0-f507-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1188p1n2o_1745653056.html", "title": "Austrian centrists agree government deal sidelining far right", "title_page": "Austrian centrists agree government deal sidelining far right - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Five months after the far-right Freedom Party won Austria's general election, a three-way coalition looks set to exclude it from power.\nThe conservative People's Party (ÖVP), the Social Democrats (SPÖ), and the liberal Neos say they have successfully completed negotiations to form a new administration - a record 151 days since the election was held in September.\nThe leader of the Eurosceptic, Russia-friendly Freedom Party (FPÖ), Herbert Kickl, called the tie-up a coalition of \"losers\" and called for a snap election.\nThursday's announcement follows the longest period of coalition negotiations in Austria's recent history, after two previous attempts to form a government failed.\nThe three-party government, which would be the first since the late 1940s, is due to take office next week, if all the parties approve the deal. The biggest hurdle is a vote at a Neos party meeting on Sunday, where a two-thirds majority is needed.\nThe new chancellor will be Christian Stocker of the ÖVP.\nAs he presented the new government programme with the leader of the SPÖ, Andreas Babler, and the Neos, Beate Meinl-Reisinger, Stocker said the negotiations had been \"perhaps the most difficult in the history of our country\".\nBut he said they had achieved \"a breakthrough\" that wasn't \"a minimal compromise\".\nThe three parties set out plans to avoid facing a European Union procedure for running an excess budget deficit, with measures including an increased levy on banks.\nThe programme also includes tougher asylum measures, including a temporary stop for family reunifications.\nStocker said there would be \"an integration year for refugees\" from day one of their arrival in Austria.\nThe three parties also said they reserved the right to impose an asylum freeze, if numbers of applications increased. They are also planning a headscarf ban for girls under 15.\nThe programme also emphasised that the government was \"committed to a strong and better European Union\".\nIn a post on social media, Kickl said: \"I don't think this has ever happened before: a so-called 'government programme' before a government has even been formed.\"\nDespite the FPÖ's unprecedented victory, topping the polls for the first time, Austria's President Alexander Van der Bellen first gave the ÖVP the mandate to form a government.\nAt the time, the leaders of all of the other parties ruled out making an alliance with Herbert Kickl.\nHowever, the ÖVP's first attempt to forge a coalition with the Social Democrats and Neos failed at the beginning of January.\nOn 6 January, Van der Bellen gave Kickl the mandate to form a government.\nBut a few weeks later, the Freedom Party's talks with the conservatives also broke down, partly due to disputes over minister posts.\nPolitical analyst Thomas Hofer told the BBC that there had been \"no base of trust\" between the two parties.\nThe ÖVP, the Social Democrats and Neos then started a second round of negotiations, which culminated in an agreement.\nThomas Hofer says their new alliance faces challenges.\n\"This is of course an emergency cabinet. It had to be built quickly and one can see that looking at the programme, The main message is that they are not Herbert Kickl, but that message will not last very long. They will have to negotiate more along the way.\"\nHofer says the parties \"even have to guarantee inner party stability\", and that their popularity could grow if they tackle \"the massive problems ahead, but those problems are also a chance for the FPÖ\", which he said had flourished in opposition.\nAccording to opinion polls, a new election would see further gains for the Freedom Party.", "url": "https://www.bbc.co.uk/news/articles/c0q1188p1n2o"}