{"authors": ["Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 03:51:57", "date_modify": "2025-04-26 03:51:57", "date_publish": "2025-03-05 11:21:12", "description": "Kate Cassidy says she sometimes finds it \"hard to get out of bed\" following Payne's death last year.", "filename": "news_articles_cqjdqx8xjngo_1745639517.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b4f7/live/7ce6db10-f9ac-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdqx8xjngo_1745639517.html", "title": "Liam Payne's girlfriend Kate Cassidy still finds his death 'really hard to accept'", "title_page": "Liam Payne's girlfriend Kate Cassidy still finds his death 'really hard to accept' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liam Payne's girlfriend Kate Cassidy has said she finds it \"really hard\" to accept he's gone, almost five months after his death.\nThe One Direction singer died last October at the age of 31, after falling from a hotel balcony in Argentina.\nIn an emotional interview on ITV's Lorraine, Cassidy said she sometimes finds it \"hard to get out of bed\" and still refers to him in the present tense.\n\"It's hard for me to refer to him in the past tense, and when I do refer to him in the past tense it almost stings that little bit more because it just... it's more official,\" she said.\n\"I find myself talking about him so much in the present tense, and it's something where I don't even feel the need to correct myself, because that's part of my healing journey that I'm still working on accepting the fact he's not here any more.\n\"I never thought I would be talking about him in the past tense, so it's definitely really hard to accept.\"\nCassidy was speaking as she helped launch the programme's March4March campaign, which encourages viewers to walk outdoors for an extra 10,000 steps per week to help their mental health.\nCassidy told host Lorraine Kelly that Payne \"was so open about his mental health\" and she was supporting the campaign because \"he no longer can help people\".\n\"I genuinely believe Liam, in a way, guided me to this campaign and wanted me to be involved in this, and to help other people.\"\nShe continued: \"It really can make such a difference, I've always enjoyed walking... but now I'm going through this healing journey, sometimes it's hard for me to get out of bed in the morning and something I don't want to do.\n\"But I have this responsibility and this obligation that I am almost, in a way... I have no choice. I have to get out of bed for [my dog] Nala, whether it's a five-minute walk or 20-minute walk first thing in the morning.\n\"Either way, it just wakes me up and refreshes my mind instead of laying in bed all day just scrolling through social media or old photos. It gets me out of bed and really, really helps my mindset and my mental health.\"\nCassidy also said she has \"harder days, but I'm surrounded by such a great support system that I cannot thank enough\".", "url": "https://www.bbc.co.uk/news/articles/cqjdqx8xjngo"}