{"authors": ["Pamela Tickell", "www.facebook.com"], "date_download": "2025-04-26 06:33:27", "date_modify": "2025-04-26 06:33:27", "date_publish": "2025-02-27 06:50:57", "description": "Hartlepool charity Miles for Men says it is cancelling this year's annual fun run.", "filename": "news_articles_crew84154jqo_1745649207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3016/live/6a234bb0-f44a-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crew84154jqo_1745649207.html", "title": "Hartlepool charity 'gutted' as sponsored runners fail to pay", "title_page": "Hartlepool charity 'gutted' as sponsored runners fail to pay - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An annual charity fun run has been cancelled after sponsored runners failed to pay in their donations.\nMicky Day, from Miles for Men, a Hartlepool-based charity for those affected by cancer, said it had cancelled its 5km (3.1 mile) fun run this year due to it \"no longer being financially viable\".\nThe team had seen people on social media announcing they had raised funds for the organisation, but when they went to cross-reference their names, they found nothing had been donated, Mr Day said.\n\"It's absolutely gut-wrenching to think people would do this to our charity, or any charity,\" he added.\nMr Day said the charity had noticed it had been happening for multiple years.\n\"We've grafted, like, full-blown for years and years, it's a full-time job and more,\" he said\n\"We just thought, 'You know what, it's time to let people know what's actually been going on.'\"\nIn a post on social media, Mr Day said last year \"only a handful of individuals and groups handed in their collected sponsor money\".\nMr Day said: \"We understand people are struggling and we understand what's going on in the world.\"\nHe said in 2012 and 2013 the charity received more than £80,000 in sponsorship money.\nBut in the last three years they got less than £18,000 in total, despite having one of their best turnouts for the Hartlepool run last year.\nMr Day said the race day took eight months to organise and cost more than £14,000 \"with prices increasing all the time\".\n\"What's the point in having to work for eight months and we're not getting anything for the community out of it,\" he said.\n\"That is absolutely brutal.\"", "url": "https://www.bbc.co.uk/news/articles/crew84154jqo"}