{"authors": ["Mariko Oi and Mel Ramsay", "www.facebook.com"], "date_download": "2025-04-26 07:49:23", "date_modify": "2025-04-26 07:49:23", "date_publish": "2025-02-26 22:39:42", "description": "CEO Tsunekazu Ishihara speaks to the BBC about the future of the world's most valuable media franchise.", "filename": "news_articles_c5y0v3gd5e5o_1745653763.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/759e/live/ecec62d0-f43a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0v3gd5e5o_1745653763.html", "title": "Pokémon Day: CEO believes series can last another 50 years", "title_page": "Pokémon Day: CEO believes series can last another 50 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The boss of The Pokémon Company believes the series can last for at least another 50 years if it continues to innovate.\nFirst launched on Nintendo's Game Boy in 1996, the video game has expanded into films, TV and toys to become one of the world's highest-grossing media franchise.\nMost recently, the trading card game based on the cute creatures at the centre of its universe has seen a surge in popularity - but it has also brought scalpers and frauds to the hobby.\nCEO Tsunekazu Ishihara, who has been in charge of the company since 1998, spoke to BBC News ahead of its yearly update about the secret of its success, tackling challenges, and the series' future.\nPokémon Day is an annual livestream showcasing upcoming releases, upgrades and events.\nFans got an extended look at upcoming Nintendo Switch title Pokémon Legends: Z-A, and learned it would be released later this year.\nThere was also a first glimpse of Pokémon Champions - an upcoming mobile game that appeared to be inspired by the Stadium series focused on battles.\nAnd the company also showed off additions to the digital and physical versions of its trading card game.\nMr Ishihara wasn't giving away too much ahead of the event but says the company's long-term goal is to \"enrich both the real world and the virtual world\".\nPokémon GO - the company's successful mobile phone app that works with a device's GPS to place monsters in the real world - is an example of this.\n\"This is what I think is the biggest strength of Pokémon, and it's important for us to come up with this kind of idea,\" he says.\n\"So that's how I think of what we want to achieve next.\"\nOne of the hottest topics among long-term Pokémon fans today is scalpers.\nThe resurgence of the collectible card game has caught the attention of resellers who buy up new packs in the hope of landing rare, valuable cards.\nYouTuber Logan Paul switched a lot of people on to the potential profits of the hobby when he paid $5.3m (£3.9m) for the most expensive Pokémon card ever., external\nGaming companies have long had an issue with the second-hand market, and Mr Ishihara says it \"prevents new products from being sold\".\n\"When the second hand market becomes more valuable because of rarity, that is problematic because our business is affected.\"\nFans have suggested The Pokémon Company could produce a greater volume of hard-to-find or limited-run items but Mr Ishihara says it cannot do much to control the resale market.\n\"Those items are seen to be valuable because they're rare or seen as vintage – and it's not our place to say that they're not,\" he says.\nOn the topic of counterfeit products Mr Ishihara is more direct, and says the company's legal teams have fought \"rigorously\" against clones and fakes since the beginning.\nIt recently won a long legal battle, external against the Chinese company behind a copycat mobile app.\nAnd earlier this year it joined Nintendo to sue the makers of Palworld - an online multiplayer survival game described as \"Pokémon with guns\".\nIt alleges developer Pocketpair infringed patents, which it has denied.\nPokémon has continued to bring new fans to the franchise by expanding into anime, card games, movies and toys alongside its video game titles.\nMr Ishihara says fans now \"span several generations\" and believes \"the biggest reason behind their success is the fact that Pokémon became a tool of communication\".\nLast weekend, about 13,000 Pokémon fans headed to the European leg of the International Championships at London's Excel Centre.\nIt demonstrates Mr Ishihara's point that people have found their way into the series through various means.\nFans Justin, 25, and Marina, 28, who turned up to the event in Team Rocket costumes, tell BBC News they got into Pokémon by watching the animated TV show as children.\n\"I just loved all the designs, all the different characters,\" says Justin.\n\"They were just really really cute.\"\nMarina says in-person events have become a chance for her to meet fellow fans.\n\"I always used to want to go to conventions and these sorts of events.\n\"So being able to be here and network and make friends has been such a blessing,\" she says.\nAt the end of 2023, longtime hero Ash Ketchum and his best pal Pikachu bowed out of the animated Pokémon series.\nThe series has continued without the well-loved duo, but one of the \"hardest questions\" Mr Ishihara gets asked is what they're up to now.\n\"Even though the TV camera may not be following them, Ash's journey is continuing and his partner Pikachu is right next to him.\"\nWith the franchise set to mark its 30th anniversary next year, rumours are already beginning to swirl about special plans for the occasion.\nRemakes or re-releases of the original Game Boy games are high on many fans' wishlists.\nMr Ishihara doesn't have much to say on that at the moment, but wants to maintain a focus on \"connecting the real and virtual worlds\".\n\"If we continue focusing on our mission, Pokémon can probably continue to its 50th or 100th anniversary,\" he says.\n\"But if we become complacent and go with the flow, that's when Pokémon will go downhill.\"", "url": "https://www.bbc.co.uk/news/articles/c5y0v3gd5e5o"}