{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:50", "date_modify": "2025-05-19 14:47:50", "date_publish": "2015-02-11 02:02:15", "description": "The 79-year-old King Salman has taken the Saudi throne, promising security and stability. Four experts explain how the country may change under his reign.", "filename": "news_world-middle-east-31358994_1747666070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80902000/jpg/_80902715_kingsalman_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31358994_1747666070.html", "title": "How will the new King Salman change Saudi Arabia?", "title_page": "How will the new King Salman change Saudi Arabia? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When the 79-year-old King Salman took over the Saudi throne in January, he promised security and stability. \"We will adhere to the path this nation has followed since it was established,\" he said.\nBut where will that path take the kingdom? Onwards towards further limited reform or a retreat into greater conservativism?\nAnd with the high-profile case of Saudi blogger Raif Badawi - sentenced to 10 years in prison and 1,000 lashes for \"insulting Islam\" - once again drawing attention to the country's record on human rights, four expert witnesses offer their insight into what the future might hold.\n\"He was like the gatekeeper, he would solve the problems, do a few things and discuss, advise and guide them. He sees to it that nobody strays across boundaries that they should not,\" he says.\nBut it's as governor of Riyadh, a post he held for 50 years, where Prince Salman had the most impact, transforming a desert town into a sprawling city of seven million with skyscrapers and fast-food chains.\n\"Making Riyadh into a major city, building schools and colleges, pushing around development, also initiating social development by focusing on hospitals and other issues... shows a man who is deeply concerned about his people,\" Khaled Almaeena says.\nAnd he says that as governor, King Salman was supportive of women in public life.\n\"Riyadh has now become the hub of so many meetings,\" he says.\n\"A few years ago, you would not find any female in these meetings or in these symposiums.\n\"One could see the changes where the participation of women was becoming more and more profound.\"\nAnd Khaled Almaeena thinks it's unlikely that King Salman will reverse the late King Abdullah's modest reforms.\nHe says: \"There were so many things that were taboo before in this country.\n\"Now, the newspapers and the media by and large focus on issues like corruption, child abuse, so many other things.\n\"Prince Salman is as I said astute and observes what's going on around, he is a very well-travelled man. So there will be no going back.\"\nHe points to the sweeping changes made by King Salman in his first 10 days.\nIn a smattering of royal decrees, ministers were sacked, others appointed and councils abolished. The king has concentrated power within the region of Najd, seen as the monarchy's natural constituency.\n\"So loyalty and trust is the name of the game here,\" Ali Al-Ahmed says.\n\"He would make sure to keep the family happy.\n\"That's why you will see more members of the family getting greater share of the pie, the political, economic pie, at the expense of the people.\"\nAli Al-Ahmad says history offers a stark warning if the family is not happy.\n\"Starting in 1932 onward, the Saudi ruling family had had a problem with infighting,\" he says.\n\"King Saud, the son of Abdulaziz, was overthrown and deposed by his half-brothers... King Salman was part of that operation.\n\"The Saudi ruling family is now larger than ever, and naturally there will be tension.\"\nKing Salman also abolished the 14 supreme councils that covered various different areas such as media, Islamic affairs, health and so on, with the responsibility and authority of these councils being rolled into just two, one run by his son and the other by his nephew Mohammad bin Nayef.\nThe controversial minister of the interior, Mohammad bin Nayef, is now second in line to the throne.\nAli Al-Ahmad says he has a \"really dark record\" on human rights.\n\"The fact that he has imprisoned even woman drivers, that has never happened in the country's history, and established a terrorism court... you will see that... the new king now is really concerned about security,\" he says.\nMany also hold Mohammad bin Nayef responsible for the killing of protesters by security forces.\nAli Al-Ahmad argues his nephew's promotion suggests King Salman will take Saudi Arabia in a different direction to his predecessor:\n\"I think he will change it in some ways,\" he says.\n\"He also will become much more conservative in terms of social policies and will be harsher in terms of security and political policies.\"\n\"I've met Salman a half dozen or so times, often in larger meetings,\" he says.\n\"[He] always came across as a very serious person, a person who valued the relationship with the United States but also understood that there were limits on what a conservative kingdom like Saudi Arabia can do with America, which has very, very different values and very different lifestyle than the kingdom.\"\nBut Mr Riedel believes that relationship, forged 70 years ago on an American cruiser in the Suez Canal, is unlikely to change.\n\"King Salman has been at the core of Saudi decision making for more than a half century,\" he says.\n\"So I don't think he's about to do anything fundamentally different.\n\"I think we're going to see a lot of continuity here.\n\"President Obama's early trip to Riyadh right after the passing of King Abdullah set a good tone for the relationship.\"\nBut since King Salman came to power last month, allegations have surfaced that senior Saudi royals funded al-Qaeda throughout the late 90s.\nThe Saudi embassy has dismissed the claims, but they could nonetheless damage relations between the two countries.\n\"King Salman... was given responsibility for raising private Saudi funds to support the Afghan mujahideen against the Soviet Union,\" says Bruce Riedel.\n\"Of course the US and other countries were covertly providing support to the Afghan mujahideen.\n\"The private Saudi money kept the mujahideen going.\n\"And of course, in addition to private money, there were also volunteers who went to fight with the Afghan mujahideen, most famously Osama Bin Laden. [Then] Prince Salman was involved in all of those things.\"\nSo the key question for the US is when did that relationship between Saudi Arabia and Osama Bin Laden end?\nBruce Riedel says it began to deteriorate in the mid-1990s.\n\"Whether indirect contacts continued on for a few years is a subject of much speculation,\" he says.\n\"The 9/11 Commission came to the conclusion, though, that there was no Saudi role in the planning of the attacks of 11 September 2001.\n\"What's more important is that today the kingdom is one of the most valuable allies that we have in the intelligence war, the covert war, against al-Qaeda, and against the Islamic State.\"\nBut what could be much more problematic is the issue of human rights, as highlighted by Raif Badawi's case.\n\"For most of the US-Saudi relationship,\" argues Bruce Riedel, \"just like for most of the UK-Saudi relationship, human rights issues were really not on the plate. I think they're more on the plate now than they've ever been before.\n\"In the halls of government, both in London and in Washington, I think they're still regarded as too problematic to raise in heads of states meetings. But they will be raised in lower level meetings; they already are. And they're bound over time to become a question of friction in the relationship.\"\nAnd once again, the controversial minister of the interior is centre stage.\n\"Muhammad bin Nayef... has done more to fight al-Qaeda in the Arabian Peninsula than anyone else,\" Mr Riedel says.\n\"But he also has very hard-line views about any kind of dissent.\"\nSo King Salman's decision to promote him could put Saudi Arabia on a collision course with its major ally.\n\"Inevitably, as the Middle East and the Arab world is trying to find ways to have reform and better governance, we're going to have a problem between the West and the most conservative, even reactionary, counter-revolutionary state in the region, which is Saudi Arabia,\" Mr Riedel says.\nThe protesters demanded the release of political prisoners and more economic and political rights for the Shia minority.\n\"[The protests] were massive initially and people weren't covering their faces,\" Safa Al-Ahmad says.\n\"Everybody felt that there was a moment in 2011 of hope, like genuine hope, that peaceful protests would bring change.\n\"I think this was an inspiring moment.\"\nBut these hopes came to nothing.\n\"They realised this was not going to be the response of the Saudi government,\" Safa Al-Ahmad says.\n\"I ended [my film] in the cemetery, where they had a special plot for what they called the martyrs of the movement.\n\"The government has quite successfully silenced most of the protests.\"\nAbout 20 protesters were killed while hundreds were injured or jailed.\nSafa Al-Ahmad has herself been warned not to return. She is left fearful for her country's future:\n\"I think the crux of what 2011 in the whole Arab world and specifically in Saudi Arabia revealed [was] the huge schism between our governments and the people, and the inability of the two to communicate in a way that's conducive of genuine deep reform in the country,\" she says.\n\"The government has left very little space for peaceful protest and reform.\n\"That is the real danger of continuing to clamp down on activists and putting them in jail - you are leaving no middle ground for people to reform.\n\"And so the more estranged the young feel, both Sunni and Shia in Saudi Arabia, across the board, you are pushing them towards something that is truly frightening.\"\nThe Inquiry is broadcast on the BBC World Service, Tuesdays from 13:05 GMT. Listen online or download the podcast.", "url": "https://www.bbc.com/news/world-middle-east-31358994"}