{"authors": ["Gemma Daubeney", "www.facebook.com"], "date_download": "2025-04-26 04:30:45", "date_modify": "2025-04-26 04:30:45", "date_publish": "2025-03-03 06:19:30", "description": "Visit Jersey says its website has seen more traffic because of the success of the TV series.", "filename": "news_articles_cd0n2z22ejpo_1745641845.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1d0a/live/1e46efa0-f5f6-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0n2z22ejpo_1745641845.html", "title": "Bergerac TV reboot 'improves tourism' in Jersey", "title_page": "Bergerac TV reboot 'improves tourism' in Jersey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The impact of the new Bergerac TV series has been \"enormous\" and \"better than we ever expected\", Jersey's tourism board has said.\nCEO of Visit Jersey Tricia Warwick said the number of people visiting the organisation's website increased in February by 70% on the previous month.\nThe number of people then going on to book hotels and trips to the island also rose significantly, she said.\nShe said the challenge was sustaining the \"Bergerac effect\" and the board would work with business partners on the island to capitalise on the 'set-jetting' trend and promote filming locations.\nMs Warwick said: \"We're making sure our partners are ramping that up so that when you come here, you cannot avoid Bergerac.\"\nThe original BBC detective drama, created by Robert Banks Stewart, ran for nine series between 1981 and 1991 and was filmed in Jersey.\nThe reboot is a reimagining of the series and filming took place on the island last summer.\nVisit Jersey put a lot of its budget into publicising the series, said Ms Warwick, describing it as a \"big commitment\".\n\"There was quite a few naysayers saying, 'are you sure this is the right thing to do', and so it was a risk.\n\"[But] I believed it was a risk worth taking because we now realise that it's paying off.\"\nMs Warwick said she hoped the success would continue but it would rely on investment in the visitor economy to keep Jersey \"loud and proud on the world stage for travel\".", "url": "https://www.bbc.co.uk/news/articles/cd0n2z22ejpo"}