{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:18:04", "date_modify": "2025-04-26 04:18:04", "date_publish": "2025-03-04 06:46:29", "description": "Heavy rain in January last year caused \"significant damage\" to the lido, which first opened in 1817.", "filename": "news_articles_cd652eqq2nlo_1745641084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7f11/live/0ae3eb50-f83c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd652eqq2nlo_1745641084.html", "title": "UK's oldest lido remains closed after flooding", "title_page": "Cleveland Pools: UK's oldest lido remains closed after flooding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity that runs what is believed to be the UK's oldest lido has said it will remain shut while work continues to repair damage caused by a flood.\nHeavy rain in January last year caused \"significant damage\" to Bath's Cleveland Pools, which have flooded twice since reopening in 2023.\nThe pools first opened in 1817 and were used for public swimming for more than 160 years but closed in 1984 and faced the threat of demolition in 2003.\nThe Cleveland Pools Trust said its plant room and machinery had suffered damage, and investigations were ongoing.\nChair Paul Simons said he was grateful to volunteers who continued to help, adding the team was trying reopen the venue as soon as it could.\nMr Simons said: \"The trust, with the assistance of its professional advisers, is looking at all its available options for recovering the cost of remedying the damage to allow the pools to reopen.\n\"Unfortunately, at this present time, the trust is unable to put a timescale on this.\n\"The trust shares the frustration of the public that the pools remain closed.\"\nHowever, he said he wanted to reassure the public that as a registered charity run by volunteers, it was using its \"best endeavours to find a solution to allow the pools to be brought back into use as soon as is practically and viably possible\".", "url": "https://www.bbc.co.uk/news/articles/cd652eqq2nlo"}