{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 04:40:38", "date_modify": "2025-04-26 04:40:38", "date_publish": "2025-03-02 07:15:41", "description": "A union encourages farmers to display signs highlighting the Countryside Code during lambing season.", "filename": "news_articles_c70ee0y67wjo_1745642438.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b06c/live/021990f0-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70ee0y67wjo_1745642438.html", "title": "Signage reminds walkers to respect the Manx countryside", "title_page": "Signage reminds walkers to respect the Manx countryside - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People have been reminded to act responsibly while enjoying the countryside on the Isle of Man as lambing season continued.\nThe Manx National Farmers' Union has created signs to highlight the Countryside Code, which includes advice to leave gates as you find them and keep dogs on leads.\nUnion secretary Sarah Comish said the rules existed to \"protect livestock and farmland\" and the signage aimed to provide a greater understanding of them.\nFollowing the guidance would be an \"immense help to people who are farming and taking care of the lambs\", she said.\nThe posters remind residents and visitors to stick to established footpaths, to take any litter home, not to feed livestock and to give them space.\nThey also encourage those who see an animal in distress to contact the farmer or landowner, rather than try to step in to help.\nThe union has urged those who find lambs on their own not to remove them, as they often shelter or rest while their is grazing nearby and therefore \"had not been abandoned\".\nMs Comish said it was \"really important to protect the natural order\" as separating a lamb from its mother broke the bond between the pair.\nShe said the \"vast majority\" of people who went out in the Manx countryside and used the footpaths \"don't go out with the intention to cause harm\".\nIt was hoped the signage would help to develop \"respect for people who have a livelihood on the land and for the animals that are living out there\".\nMembers of the farming community have been encouraged to contact the union for a free sign to display on their gates, to promote the details of the code.", "url": "https://www.bbc.co.uk/news/articles/c70ee0y67wjo"}