{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 03:55:21", "date_modify": "2025-04-26 03:55:21", "date_publish": "2025-03-04 16:12:11", "description": "Kainos says it made the decision to reduce its workforce in response to the \"current market environment\".", "filename": "news_articles_cdrx33k3836o_1745639721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c35a/live/bc1946d0-f914-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrx33k3836o_1745639721.html", "title": "Kainos: Belfast IT firm to make 190 staff redundant", "title_page": "Kainos: Belfast IT firm to make 190 staff redundant - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kainos, the Belfast-based IT firm, is making 190 of its staff redundant.\nIt currently employs about 3,000 people, mostly in Northern Ireland.\nIn December, the company replaced its recently-installed chief executive after warning shareholders that full year sales would be below market expectations.\nThe warning said the business was experiencing a tougher trading environment as clients delayed decisions on projects.\nIn a statement on Tuesday, the firm said it had made the \"difficult decision\" to reduce its workforce in response to the \"current market environment\".\nThis is affecting approximately 7% of its global team, it added.\n\"This decision was made with careful consideration and a focus on the long-term growth opportunities of our business.\n\"While our business fundamentals remain strong, this step allows us to manage costs responsibly while continuing to support our customers.\n\"We recognise that this means saying goodbye to talented colleagues who have made valuable contributions to Kainos. They leave with our deep gratitude, and we are committed to supporting them in their transition to new opportunities.\"", "url": "https://www.bbc.co.uk/news/articles/cdrx33k3836o"}