{"authors": ["Thomas Mackintosh", "www.facebook.com"], "date_download": "2025-04-26 04:37:00", "date_modify": "2025-04-26 04:37:00", "date_publish": "2025-02-28 11:27:09", "description": "Around 880 workers - including weather forecasters - are reported to have lost their jobs.", "filename": "news_articles_cdell8n14x2o_1745642220.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eb72/live/49c45880-f5cd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdell8n14x2o_1745642220.html", "title": "Hundreds in US climate agency NOAA fired in latest cuts", "title_page": "Hundreds in US climate agency NOAA fired in latest cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hundreds of National Oceanic and Atmospheric Administration (NOAA) staff have been laid off in the latest development in the Trump's administration's efforts to slash the federal workforce.\nAround 880 workers - including weather forecasters - have had their jobs terminated on Thursday, the BBC's US partner CBS News reported.\nThe cuts come as Elon Musk, as the head of the so-called Department of Government Efficiency (Doge), continues a push to reduce spending through funding cuts and firings.\nAn NOAA spokesman said the agency would not comment on internal personnel matters.\nPrior to Thursday's cuts, the NOAA had about 12,000 staffers across the world, including 6,773 who are scientists and engineers, according to the agency's website.\n\"We continue to provide weather information, forecasts and warnings pursuant to our public safety mission,\" the NOAA spokesman added.\nNOAA staffers took to social media to announce they had been swept up by the cuts.\n\"I was fired from my dream of working at NOAA. I'm so sorry to everyone also affected,\" climate scientist Zack Labe wrote on X. He said that he had worked on strengthening the agency's machine learning and AI tools.\nCalifornian Democratic Congressman Jared Huffman said people across the US \"depend on NOAA for free, accurate forecasts, severe weather alerts, and emergency information\".\nNOAA weather data is used by meteorologists, media organisations, commerical forecasting services and other companies to inform the US public about the weather. The agency produces the latest information on temperature, precipitation, air quality, UV index, humidity and more.\nThis data is used extensively in the private sector to fuel popular weather services and websites.\n\"Most or all private weather companies in US (including forecasts that you see on TV or your favorite app) are built directly atop backbone of taxpayer-funded instrumentation, data, predictive modeling, & forecasts provided by NOAA,\" Daniel Swain, a climate scientist at the University of California, Los Angeles wrote on X.\nThe agency has proved essential during periods of extreme weather conditions as well. The National Hurricane Center and the National Weather Service - housed under NOAA - create models and notify millions of Americans when and how to respond to severe weather events, such as hurricanes and tornadoes.\nHuffman lamented the loss of \"hundreds of scientists and experts at NOAA\" who helped collect infromation that kept the public safe during dangerous weather events.\n\"Musk's sham mission is bringing vital programs to a screeching halt. Purging the government of scientists, experts, and career civil servants and slashing fundamental programs will cost lives,\" the congressman said.\nMiyoko Sakashita, the Center for Biological Diversity's oceans director, said gutting NOAA will \"hamstring essential lifesaving\" programmes.\nThe latest developments come days after US government workers faced widespread confusion following conflicting advice over compliance with a Musk-backed order to list their last week's work in an email or face termination.\nThe message sent to millions of federal employees last Saturday evening came after Musk posted on his social media platform X that government staff would \"shortly receive an email requesting to understand what they got done last week\".\nOn Sunday, Musk said in some cases \"we believe non-existent people or the identities of dead people are being used to collect paychecks\".\nIn a copy of the email obtained by the BBC, employees were asked to respond explaining their accomplishments from the past week in five bullet points - without disclosing classified information.", "url": "https://www.bbc.co.uk/news/articles/cdell8n14x2o"}