{"authors": ["Charlotte Edwards", "www.facebook.com"], "date_download": "2025-04-26 04:25:12", "date_modify": "2025-04-26 04:25:12", "date_publish": "2025-03-03 12:12:19", "description": "Those currently earning less than £123 a week are currently not eligible for sick pay.", "filename": "news_articles_cx28qw46p6yo_1745641512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4696/live/08890700-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28qw46p6yo_1745641512.html", "title": "Sick pay: Low paid workers to get 80% of salary when ill", "title_page": "Sick pay: Low paid workers to get 80% of salary when ill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than one million low-paid workers in the UK are to be entitled to 80% of their weekly salary as sick pay from the first day of illness, under government plans.\nCurrently, to qualify for statutory sick pay, you must have been ill for more than three days in a row and earn an average of at least £123 a week.\n\"No one should ever have to choose between their health and earning a living, which is why we are making this landmark change,\" said Work and Pensions Secretary Liz Kendall.\nThe British Chambers of Commerce called the 80% rate a \"fair compromise\", but warned allowing sick pay from day one could lead to higher staff absenteeism that smaller firms could struggle to cope with.\n\"Employers often struggle to find shift cover at short notice, leading to disruption for customers,\" said Jane Gratton, deputy director of public policy at the BCC.\n\"The government's impact assessment did not produce compelling evidence on the day-one rights issue, so there may yet be unforeseen consequences.\"\nThe government says the changes will mean about 1.3 million people on low wages who fall ill will receive either 80% of their average weekly earnings or statutory sick pay - which is currently £116.75 per week – whichever is lowest.\n\"The new rate is good for workers and fair on businesses as part our plan to boost rights and make work pay, while delivering our plan for change,\" Kendall said.\nHowever, some groups are asking the government to set sick pay for the lowest paid workers at no less than 95% of their weekly pay.\nTUC general secretary Paul Nowak said: \"This shouldn't be the end of the story.\n\"We urge ministers in future to raise the replacement rate for the lowest earners beyond 80% and undertake a wider review of the statutory sick pay rate.\"", "url": "https://www.bbc.co.uk/news/articles/cx28qw46p6yo"}