{"authors": ["Aurelia Foster", "www.facebook.com"], "date_download": "2025-04-26 04:33:55", "date_modify": "2025-04-26 04:33:55", "date_publish": "2025-03-03 02:47:12", "description": "Charity report finds seven-month average wait for families of children with cancer to access benefits.", "filename": "news_articles_cr422y4evx0o_1745642035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/653c/live/04638850-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr422y4evx0o_1745642035.html", "title": "Cancer family 'financially broken' by wait for benefits", "title_page": "Cancer family 'financially broken' by wait for benefits - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families of children and young people with cancer are struggling financially for several months waiting for benefits to help cover extra costs caused by the illness, according to a charity.\nYoung Lives vs Cancer says families need \"immediate\" help with additional living costs, which amount to £700 a month on average - and is calling for quicker access to the funds.\nOne family has said they were left \"financially broken\" by the extra living costs after their 16-year-old son Oliver's leg had to be amputated because he had a rare type of cancer.\nThe government says it is committed to giving people access to benefits in a \"timely manner\", but acknowledges that \"waits are too high\".\nKerry Bolton, from Solihull, said she had to wait five months before a decision was made on her benefits application after her son Oliver was diagnosed with cancer, aged 16.\n\"The hospital is an hour away from us and I don't drive. It was costing us £48 a day for us to travel in taxis there and back.\"\nOliver later underwent a leg amputation, meaning his family had to buy new clothes to fit him.\nThey also faced higher electricity bills to charge his prosthetic leg, Ms Bolton said.\n\"Ollie's leg needs electricity...if I don't have electricity, he can't walk.\"\nMs Bolton said she also had to use more energy to heat her home to keep Oliver warm, because of his immunosuppression treatment.\nDuring a child's cancer treatment, families may need to travel to distant appointments, buy special food, use more electricity and heating, pay for childcare for siblings, and stay in hotels.\nUnder UK law, cancer patients may be entitled to benefits to help with costs.\nHowever, patients are not eligible for financial support until they have been ill for three months.\nThey then face a further wait of four months on average for their application to be assessed, according to Young Lives vs Cancer, which has interviewed hundreds of patients and put out a new report.\nThe charity is calling for families to qualify for benefits immediately following a diagnosis.\nDanielle Roberts, from North Wales, told the BBC that she experienced financial \"strain\" as soon as her nine-year-old daughter Jasmine was diagnosed with cancer last year, but she did not receive any benefits for eight months.\n\"We were just thrown into this world where...our child's got cancer and we don't know if she's going to survive, along with dealing with the financial impact.\n\"You've still got all these bills to pay on top of going back and forward to hospital, which was an hour and 15 minutes away, extra food, accommodation\".\nMs Roberts said having to take long periods off work added to the financial strain.\n\"My income was dramatically reduced because it's hard to work when your child is in hospital... and you don't want to work, you should be able to spend time with your child when they're poorly.\"\n\"What we're seeing is heartbreaking,\" Young People vs Cancer's chief executive Rachel Kirby-Rider told the BBC.\n\"People don't have that disposable income, they don't have that money in savings.\n\"Having to wait seven months for disability benefits is driving a lot of families into debt and impacting families at a time they just want to concentrate on getting their child well.\"\nThe charity is also concerned about the application process, as the 50-page forms were \"tricky, long and complex\", asking families for detailed descriptions about their child's needs.\nThe process should be made \"simple and efficient\", it says, by using medical evidence alone to make applications.\nMs Roberts said she struggled to find the \"head space\" to complete the application form when her daughter Jasmine was ill.\n\"They asked so many questions and you've got to send added proof... you don't want to have to think about that really as well as 'is my child going to be OK?'.\n\"It's something that shouldn't have to be done when you're going through that traumatic time.\"\nA Department for Work and Pensions spokesperson said: \"We are committed to ensuring people can access financial support through Personal Independence Payment and Disability Living Allowance for children in a timely manner.\n\"But we recognise waits are too high, and we have increased the number of staff to respond to the increase in claim volumes.\"", "url": "https://www.bbc.co.uk/news/articles/cr422y4evx0o"}