{"authors": ["Julian Paszkiewicz", "www.facebook.com"], "date_download": "2025-04-26 04:32:44", "date_modify": "2025-04-26 04:32:44", "date_publish": "2025-03-03 05:19:24", "description": "Thousands of pounds were stolen after EDF gave his mobile number to scammers, says Stephen.", "filename": "news_articles_ckg885lxd3jo_1745641964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/540b/live/5a0e7090-f807-11ef-91b8-0d570da7afdc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg885lxd3jo_1745641964.html", "title": "Fraudsters stole £40k from Hertfordshire man via phone scam", "title_page": "Fraudsters stole £40k from Hertfordshire man via phone scam - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man targeted by fraudsters who got his mobile phone number from an energy company said he often woke up in the night thinking \"what next?\".\nStephen, from Hertfordshire, had more than £40,000 taken from a savings account after his name and email address was used to get the information from EDF.\nWithin 48 hours of his mobile phone number being divulged, his accounts with O2, Nationwide Building Society and Virgin Media had all been compromised.\nEDF said such incidents were rare but it took them seriously and added: \"We are sorry for the difficulties this fraudulent caller has caused Stephen.\"\nThe man, who is being identified only as Stephen, told BBC Radio 4's You and Yours programme he was alerted to the criminal action on 3 February.\nHe received a text from O2 confirming he had changed his password.\nAfter telling O2 he had not changed his password, the firm said he must have been a victim of a Sim swap scam, which sees his mobile number used and transferred to a new Sim card.\nThe next morning, EDF emailed him asking for feedback on his recent contact with the company, despite him not having made that call.\nHe was told its fraud department would get in touch but a week later had heard nothing.\nMeanwhile, O2 confirmed his new Sim card was on its way, but it was connected to a different mobile phone number.\nIts shop staff told him to check his emails and he discovered from his email provider Virgin Media that someone had changed his password.\nAs he was trying to fix that, criminals raided his accounts.\nOn 5 February, he could not access his Nationwide credit card. The building society then upped his security.\nAfter more than a week, EDF finally responded about the call it thought Stephen made at 11:00 GMT on 3 February.\nEDF explained the fraudster had his name and email address and had asked EDF to give them his mobile number, which the company did.\n\"I said, 'Why would you do that?' They said the person had gone through security. 'With a name and email address', I asked?,\" he said.\n\"EDF said, 'Yes' - and then offered me a £50 goodwill gesture to close the case.\n\"I was just amazed and I thought: 'How can they do this and does that mean all my other bank and building society accounts are compromised as well?'.\"\nThe call from the fraudster to EDF happened three hours before O2 received a request to move his number in the Sim-swap scam.\nCriminals do it to bypass two-factor authentication to change passwords and access anything else you need a code from a text message for.\nStephen reported the fraud to Hertfordshire Police and it was passed it on to Action Fraud as the crime was believed to have been committed outside the county.\nIn 2024, Action Fraud, the UK's reporting centre for fraud and cyber crime, external, received more than 2,000 reports of Sim swapping. This was close to double what had been reported the previous year.\nStephen believed poor customer service helps criminals by giving them more time.\n\"Some nights I just wake up in the night thinking, what next? It's been very difficult really,\" he said.\nNational Savings and Investments said it had refunded him the money taken from his account.\nNationwide Building Society said the fraudulent purchases were blocked, adding that as well as meeting its legal obligations, it needed to balance security with customer service.\nO2 Virgin Media confirmed the scammer telephoned its call centre requesting a new Sim and had hacked Stephen's emails.\nA spokesperson said he had been offered \"£125 as a gesture of goodwill\".\nEDF, which has nearly six million UK customers, said: \"The security procedures were followed. We subsequently recognise this was fraud.\n\"These incidents are rare, but we take them seriously and are reviewing our processes. We have also discussed this incident with the Information Commissioner's Office, external.\"", "url": "https://www.bbc.co.uk/news/articles/ckg885lxd3jo"}