{"authors": ["Paul Adams", "www.facebook.com"], "date_download": "2025-04-26 06:47:10", "date_modify": "2025-04-26 06:47:10", "date_publish": "2025-03-01 12:46:25", "description": "Talks on phase two of the agreement to release all hostages and the withdrawal of Israeli troops have barely begun.", "filename": "news_articles_c74kzjvypgeo_1745650030.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a037/live/63e46250-f690-11ef-9dad-2d98b18c0719.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c74kzjvypgeo_1745650030.html", "title": "Gaza ceasefire deal hits critical moment", "title_page": "Gaza ceasefire deal hits critical moment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Where next? The first six-week phase of the Gaza ceasefire ends on Saturday.\nThe 42 days since 19 January have seen their fair share of uncertainty, hope, grief and anger, but everything that should have happened in that time has.\nIsraeli hostages - the living and the dead - have been released. Palestinian prisoners set free.\nBut negotiations on phase two, including the release of all remaining living hostages and the withdrawal of Israeli troops from Gaza, have barely begun.\nTalks opened in Cairo on Friday but Israel's delegation returned home in the evening.\nReports suggested that negotiations would continue \"at a distance\" and that Israel's Prime Minister Benjamin Netanyahu was due to hold late-night consultations with the delegation, senior ministers and intelligence chiefs.\nFor such a meeting to take place late on the sabbath was highly unusual. No statements emerged from the consultations, with reports suggesting they would continue on Saturday night.\nIsrael appears to be looking to extend the current phase for another six weeks, to get more hostages back and release more Palestinian prisoners but without withdrawing its troops.\nThe government here is adamant that Hamas, the group responsible for the massacres of 7 October 2023 and the taking of 251 hostages, has to lay down its arms and relinquish any form of authority in the Gaza Strip.\nIsrael also says it is not yet ready to leave the Philadelphi corridor along the Egypt-Gaza border - a process that should have begun on Saturday.\n\"We will not allow the Hamas murderers to again roam our borders with pickup trucks and guns, and we will not allow them to rearm through smuggling,\" an unnamed Israeli official said in a statement sent to reporters on Friday.\nSuch anonymous quotes are often believed to come directly from the prime minister's office.\nLast summer, efforts to secure a ceasefire in Gaza faltered when Netanyahu insisted on keeping Israeli troops stationed along the Philadelphi corridor.\nOn Friday night, Hamas said it would not agree to any extension of phase one without guarantees from American, Qatari and Egyptian mediators that phase two would eventually take place.\nHamas seems determined to remain a force in Gaza, even if it might be willing to hand over day-to-day governance to other Palestinian actors, including the West Bank-based Palestinian Authority.\nEgypt has been working on a reconstruction plan for Gaza, as an alternative to Donald Trump's proposal to take the area over and evacuate its entire civilian population.\nBut Western diplomats are not optimistic that the plan, due to be unveiled at an Arab League summit in Cairo next Tuesday, has the sort of robust security and governance arrangements that will be needed to meet Israeli demands.\nThis is a critical moment.\nFor all the emotional turmoil of the last few weeks, Israelis have come to expect the gradual release of hostages. There are believed to be 24 alive, still waiting to be freed, with another 39 presumed to be dead.\nIsraelis desperately want them all back, without the sort of propaganda displays that have disgusted and infuriated the entire country.\nIf the whole process now grinds to a halt, public anger – at Hamas and their own government - will mount. Further street protests are planned, including one on Saturday night in the place in Tel Aviv that all Israelis now know as Hostages Square.\n\"We demand the return of all 59 remaining hostages by day 50 of the agreement,\" reads the invitation from the Hostages and Missing Families Forum HQ.\n\"Now is our only window of opportunity – we won't get another.\"\nUN Secretary General António Guterres has weighed in, urging the parties \"to spare no effort to avoid a breakdown of this deal\".\nOn Saturday evening, Israelis were once again horrified by the sight of hostages being paraded in front of the cameras, in a video released by Hamas.\nIn the latest in a long line of cruel, harrowing videos released over the past 16 months, five Israeli hostages are seen, two of them with their faces blurred.\nTwo of the hostages, Iair Horn and Sagui Dekel Chen, were released two weeks ago.\nIn the video, Iair is seen embracing and saying goodbye to his younger brother, Eitan, suggesting the scene was filmed shortly before Iair and Sagui were released.\nThe emotions are raw and the scene deeply distressing, with both brothers in tears and Eitan pleading to Benjamin Netanyahu to stick with the ceasefire deal and release all remaining hostages.\nThe video is clearly designed, once again, to play on the frayed emotions of the Israeli public and heap pressure on the Israeli prime minister.\nIn a statement released by his office, Netanyahu accused Hamas of producing \"another cruel propaganda video in which our hostages are forced to engage in psychological warfare.\"\nIsrael, the statement said, would not be deterred by Hamas propaganda.\n\"We will continue to act relentlessly for the return of all of our hostages and until all objectives of the war are met.\"\nThere's a widespread belief that, sooner or later, the war will begin again.\nIt's a bleak prospect, for the hostages and for two million Palestinians in Gaza who are trying to put their lives back together in the current, fragile peace.\nIn a place where families are still digging bodies from the rubble, sometimes with their bare hands, the thought of a resumption of a conflict which has already claimed tens of thousands of lives is chilling.\nAreas in the middle of the Gaza Strip that have so far escaped the worst of the conflict would likely suffer badly from any return to war, making it even harder to sustain life in this ravaged strip of land.", "url": "https://www.bbc.co.uk/news/articles/c74kzjvypgeo"}