{"authors": ["Mike Wendling", "www.facebook.com"], "date_download": "2025-04-26 07:50:26", "date_modify": "2025-04-26 07:50:26", "date_publish": "2025-02-26 22:05:04", "description": "Justices appeared sympathetic to a woman who claims she was denied jobs because she is heterosexual.", "filename": "news_articles_c5yxvywr015o_1745653826.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5727/live/3783bff0-f4f9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxvywr015o_1745653826.html", "title": "US Supreme Court hears arguments in 'straight discrimination' case", "title_page": "US Supreme Court hears arguments in 'straight discrimination' case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US Supreme Court justices indicated during a hearing on Wednesday that they would side with a woman who alleged she was discriminated against at her job because she is heterosexual.\nMarlean Ames worked for the Ohio Department of Youth Services for more than 20 years.\nShe claims she was passed over for a promotion, then demoted, because she is straight. The job she hoped to get and the one she held when demoted, were both given to gay colleagues, according to the lawsuit.\nOhio state officials have denied the discrimination, and Ms Ames has so far been unsuccessful in court.\nIn oral arguments in front of the Supreme Court - split 6-3 in favour of conservative judges - justices on both sides ideologically appeared sympathetic to Ms Ames's case.\nA 1964 US law forbids discrimination in the workplace, and in 2020, the Supreme Court ruled that protection extends to sexual orientation, however lower courts have dismissed Ms Ames's case.\nUS court precedent covering some states, including Ohio, requires that members of majority groups - such as white people or heterosexuals - show a higher level of evidence when making discrimination claims.\nPlaintiffs in those cases – sometimes called \"reverse discrimination\" – are required to show additional \"background circumstances\" to prove their case, for instance evidence that LGBTQ people made decisions affecting the person discriminated against, or evidence showing a pattern of discrimination.\nAccording to the lawsuit, Ms Ames had positive performance evaluations, but in 2019 she and two other heterosexual employees were passed over for a promotion that was eventually given to a lesbian.\nShe was later demoted, according to the lawsuit, and her job was given to a gay man.\nIn addition to ruling that Ms Ames did not show a pattern of discrimination or \"background circumstances\", a lower court also previously found that managers at the youth services department had \"legitimate, nondiscriminatory business reasons\" for their decisions.\nDuring arguments on Wednesday, Supreme Court Justice Brett Kavanaugh, one of the court's conservative members, said: \"Discrimination on the basis of sexual orientation, whether you are gay or straight, is prohibited. The rules are the same whichever way it goes.\"\nAccording to the transcript of the hearing, another conservative justice, Amy Coney Barrett, said that \"it doesn't matter if she was gay or whether she was straight\", the legal burden should be the same.\nAnd several of the court's liberal justices seemed to agree. Neil Gorsuch indicated that he thought allowing Ms Ames' lawsuit to proceed would be a \"wise course\".\nWhile talking about the facts of the case, Justice Sonia Sotomayor said \"something's suspicious\" which \"certainly can give rise to an inference of discrimination.\"\nOhio officials were represented in court by the state Solicitor General T Elliot Gaiser, a former lawyer for Trump.\nGaiser told the justices \"everyone here agrees that everyone should be treated equally\", but argued that the officials who made the job decisions did not know Ames' sexual orientation and thus could not have used it to discriminate against her.\nLawyers for the state also argue that those making the employment decisions were heterosexual and had legitimate concerns about Ms Ames's vision for the youth services department.\nThe Supreme Court could order lower courts to re-examine the case and allow the lawsuit to go ahead.", "url": "https://www.bbc.co.uk/news/articles/c5yxvywr015o"}