{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:16:02", "date_modify": "2025-05-21 05:16:02", "date_publish": "2025-01-05 00:00:00", "description": "More than 1,700 flights have been cancelled and at least six people have died, according to local reports.", "filename": "news_live_c1mr4pn811xt_1747804562.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1mr4pn811xt_1747804562.html", "title": "Winter US storm: Heavy snow and travel disruption hits US with at least six people dead", "title_page": "Winter US storm: Heavy snow and travel disruption hits US with at least six people dead - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Death toll rises as winter storm freezes US states\nBrandon Livesay\nReporting from New York\nA deadly winter storm has caused chaos across several US states, causing dangerous driving conditions, shutting down airports and cutting power for hundreds of thousands of people.\nAt least six deaths have been recorded, most were related to icy roads. One man's body was found outside a bus shelter in Houston, Texas, with authorities saying he died because of the cold weather.\nPower outages are still affecting nearly a quarter of a million customers across six states, according to Poweroutages.us.\nBut the polar vortex conditions appear to be easing. In Kansas City, the international airport has recently opened back up for flights. The city was hit with some of its heaviest snowfall in more than 30 years. The airport had more than 11 inches of snow.\nWhile the snowfall has slowed in some areas, the conditions remain below freezing. And the danger for many people is not over.\nWe're pausing our live coverage, but you can read the latest by clicking the news story below:\nMultiple dead as huge winter storm grips swathe of US\nMore snow headed to Washington DC later this week\nBernd Debusmann Jr\nReporting from Washington\nWashington DC is still reeling from today's snow, which brought traffic to a standstill and caused chaos at the city's airports.\nBut more may be yet to come.\nLocal meteorologists predict that cold weather will mean the snow is unlikely to melt this week, and that the roads may be frozen and potentially hazardous.\nExperts have also forecast another winter storm to strike the US Capitol late on Friday and going into Saturday - one that could potentially leave even more snow than what we experienced earlier today.\nWhile rare, the city being struck by two winter storms in under a week is not unheard of.\nIn 2010, for example, nearly 18 inches of snow fell in early February, followed two days later by another 10 inches.\nA snowy day for lawmakers on Capitol Hill\nBernd Debusmann Jr\nReporting from Washington\nToday's massive snowfall in Washington DC came on a big day for the city - the anniversary of the 6 January 2021 riots at the US Capitol, and Congress' certification of Donald Trump's victory in the 2024 election.\nThis morning's heavy snows - about 5 inches (13cm) of snow covered the Capitol - snarled traffic to a halt in the area and forced employees of the Architect of the Capitol to sweep the building's steps ahead of the certification process.\nDespite the snow and anniversary of the chaotic, violent riots, the day went smoothly. Vice-president and one-time presidential hopeful Kamala Harris stood at the front of the US House chamber with a sombre expression on her face as lawmakers read out each state's election results.\nAhead of the certification, some observers had speculated that the event would be delayed by the weather, prompting House Speaker Mike Johnson to vow that it would still go ahead.\n\"Whether we're in a blizzard or not, we're going to be in that chamber making sure this is done,\" he told Fox News.\nRead more about the certification and anniversary of the Capitol Hill riots here.\nIs climate change to blame?\nSimon King\nBBC weather presenter and meteorologist\nIt is pretty unusual to see such a large winter storm across the US and having temperatures so far below the average, so far south.\nEven for some states in the Central Plains over the weekend there was 12 to 15 inches of snow, the heaviest in a decade.\nThe very cold air across the US has been caused by a weakening of the Polar Vortex – a fast wind high in the atmosphere that normally keeps the cold air in place across the Poles.\nWhile we have overall global warming, there are some areas like the Arctic regions that are warming faster than the rest of the globe.\nResearch suggests that the differing in temperature change is likely to weaken the Polar Vortex further and therefore result in more disruptions allowing cold Arctic air to get displaced to lower latitudes.\nSo while many may think that in a warming world there won’t be winter storms, that is not necessarily the case. While average temperatures will generally rise across the US, there will still be these short but potentially severe wintery spells.\nThe first serious snow in two years, resident says\nDevin Hartnett, a mother of three in Reston, Virginia, is a cross-country skier who is thrilled with the rising snow totals.\nAfter returning from a New Year's Eve trip to snowy West Virginia on Sunday, she's back on her skis again on Monday as she explores the trails near her home in the suburbs of Washington DC.\nSkiing on top of six inches of fresh snow, she saw a family of deer also out in her neighbourhood, she tells the BBC.\n\"It hasn't snowed here in two years so this was a real treat,\" she said.\nAfter showing her kids their first snowstorm in West Virginia - including their \"first taste of ski touring in a whiteout and skiing through the trees\" - today she elected to leave the kids at home.\n\"This was mama's morning,\" says Hartnett.\nWoman killed in icy North Carolina car crash\nPolice in Winston-Salem, North Carolina, say that a fatal car crash that happened early on Monday morning is related to the ongoing winter storm.\nPolice say a 46-year-old woman was found dead after her 2009 Kia went off the road near a highway overpass, crashing into trees.\nInvestigators called to the scene reported slick roadways. Another passenger inside the vehicle was taken to hospital with non-life threatening injuries.\nThis is the sixth death attributed to the winter storm. Traffic fatalities have been reported in Kansas and Virginia, while deaths have also been reported in Texas and Missouri.\n'A Nordic Nirvana' at West Virginia cross-country ski area\nMax Matza\nBBC News\nIt may be a Monday, but in West Virginia - one of more than half a dozen states under a state of emergency - the party at the White Grass Ski Touring Center, external is going strong with schools out and locals taking to the ski trails.\n\"I mean it is like a dream come true. It's like creamy powder and it keeps snowing,\" says White Grass owner Chip Chase from the lodge in Tucker County, about three hours drive from Washington DC.\n\"It's a powder paradise. A Nordic Nirvana,\" he marvels.\nThe snow doesn't often stick around for long this far south, says Chase, meaning the locals know they have to get it before it melts.\n\"Whenever you get a lot of good snow south of the Mason-Dixon line, nobody takes it for granted. There's more excitement here when it snows than anywhere else in the ski world,\" he tells BBC News.\nWashington DC airport closes all runways\nReagan National Airport, which services Washington DC, has announced it is closing down all of its runways because of the ongoing weather emergency.\nThe airport said in a post about an hour ago that all of its runways will close down on Monday evening, so \"crews can focus on snow removal and prevent refreezing on the airfield\".\nThe airport posted a photo of snow clearing operations earlier with the caption: \"Our snow team is hard at work, keeping the runways clear.\n\"If you are flying out tonight, check with your airline for flight status before you come to the airport. It's been a snowy day!\"\nAvalanche warning due to high winds in New Hampshire mountains\nNew Hampshire's Mount Washington Avalanche Center - the only recreational avalanche forecasting operation on the US East Coast - warns that the extreme winds the region is famous for could bring a greater danger than the snow.\nIn an avalanche bulletin, external issued on Monday for the Presidential Range of the White Mountains, forecasters say the less than three inches of \"light-density snow\" from the last several days, combined with \"increasingly strong winds\" could create the danger of a slab avalanche.\nA slab avalanche is caused by the release of a cohesive layer of snow (a slab), which is formed by wind-drifted snow. It is among the most deadly types of avalanches.\nThe bulletin warns of winds tonight between 50-70mph, with even stronger winds coming in the days ahead.\nAs a reminder, always check the local avalanche bulletin, external before you head into steep snowy backcountry terrain.\nPandas at DC zoo play in the snow\nA pair of pandas at the Smithsonian National Zoological Park rolled and tumbled through piles of snow inside their outdoor habitat on Monday, a video posted, external on X shows.\nWinter Storm Blair brought roughly five inches to the area, the zoo said, making it \"paws-itively the panda *snowment* of our dreams\".\nThe bears, named Bao Li and Qing Bao, are due to make their first public debut on 24 January.\nThey arrived in the US in October, having been loaned to the US from China as part of a decades-long tradition.\nThousands affected by flight delays and cancellations\nMore than 23,000 flights have been delayed in the US on Monday, according to flight tracker flightaware.com.\nAnother 2,048 flights have been cancelled.\nThe majority of the traveller headaches have stemmed from the Washington DC area, with 543 flights cancelled between the three main local airports (Washington Dulles International, Reagan National, and Baltimore/Washington International).\nThose same three airports also lead the list for most flights cancelled by destination airport, meaning flights cancelled elsewhere that were scheduled to fly into DC.\nOne man told the Washington Post he had been stuck in Washington DC since Sunday after his flight that evening was cancelled and said he had no hope that his flight rescheduled for Monday evening would actually take off.\n\"I'm not expecting much,\" Davis Schaefer told the Post.\nBody found outside a bus shelter as death toll rises from winter storm\nThe death toll from the severe winter conditions impacting parts of the US has risen to at least five people.\nA man was found dead on Monday morning outside of a bus stop in the Houston, Texas area \"due to cold weather\", a spokesperson for the city's metro system confirmed to the BBC.\n\"The body was found directly in front of a bus shelter,\" Lester Gretsch, the Harris County Metropolitan Transit Authority's director of media relations, said.\nThis latest tragic death adds to the fatalities believed to be caused by Winter Storm Blair, which has brought inches of snow and sub-freezing temperatures to much of the US.\nEarlier, we reported that there was at least one fatality in Missouri as the storm passed through. The state's highway patrol said a pedestrian was killed after a lorry, which had stopped to let a passenger out, began to slide on the roadway.\nMissouri State Highway Patrol responded to calls for over 350 crashes and more than 1,000 stranded motorists as the winter storm barreled through.\nTwo people have died in a car crash in Kansas due to adverse weather, as well as a person in Virginia.\nPolice say a 32-year-old man died about midnight in Wakefield, Virginia, after his truck skidded off the road and hit a tree. Officials say he was driving too fast for roadway conditions and not wearing a seatbelt, and alcohol may have been a factor.\nSnow starts to coat New York City\nMadeline Halpert\nReporting from New York\nHere in Brooklyn, it's been snowing for the past three hours, collecting on the ground and city fire escapes.\nWe don't get many days of snow here in the city - and the light blanket does not rival the over six feet of snow that some parts of northern New York are experiencing.\nWind chill temperatures here have also been freezing for several days, with many New Yorkers bundling up in several layers and thick coats to brace for the winter weather.", "url": "https://www.bbc.com/news/live/c1mr4pn811xt"}