{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:14:32", "date_modify": "2025-05-21 04:14:32", "date_publish": "2025-04-06 00:00:00", "description": "Treasury minister Darren Jones says the government believes a deal can be reached and talks are ongoing with the US.", "filename": "news_live_cgen9rxeyelt_1747800872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9831/live/375f0400-12c0-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cgen9rxeyelt_1747800872.html", "title": "Globalisation has 'come to an end' in wake of Trump tariffs, minister says", "title_page": "Sunday with Laura Kuenssberg live: Globalisation has 'come to an end' in wake of Trump tariffs, minister says - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The key lines from this week's show\nThe show is over for another week, which means it's almost time for us to bid you farewell.\nBut before we go, we'll leave you with a quick digest of the key lines:\nFirst to face Laura was the chief secretary to the Treasury, Darren Jones, who told her globalisation had \"come to an end\" in the face of Donald Trump's sweeping tariffs\nHe said the government was focused on negotiating a trade deal with the White House, but refused to be drawn on whether the UK might get out of the 10% levy on its exports\nNext came Tory leader Kemi Badenoch, who said \"there is a place\" for tariffs - but warned that retaliatory measures would only make life more expensive for UK consumers\nWe heard lots of insightful commentary from the panel on several of the day's top stories, too\nA strongly-worded intervention came from Labour's Emily Thornberry - chair of the Foreign Affairs Committee - who said Israel had been \"badly advised\" after denying entry to two of her party colleagues\nA moving and powerful interview with Esther Ghey - the mother of the killed teenager Brianna Ghey - concluded the show. She criticised the Labour government over its handling of online safety in dealing with the Trump administration\nThank you for sticking with us and goodbye - at least until next Sunday.\nWatch: Esther Ghey on her friendship with the mother of her daughter's killer\nEarlier, Esther Ghey spoke to Laura Kuenssberg about her friendship with the mother of the teenage girl who murdered her daughter, Brianna, in 2023.\n\"She is just a normal mother,\" Ghey says. \"She had no idea what her child was accessing [online].\"\n\"We're both navigating something that's extremely difficult,\" she adds.\nIsrael 'badly advised' over denying Labour MPs entry, says Thornberry\nKuenssberg now turns to the panel.\nLabour MP Emily Thornberry says Israel has been \"badly advised\" after denying entry to two of her party colleagues who were detained on arrival.\nShe says Abtisam Mohamed and Yuan Yang are highly respected parliamentarians, and that Israel \"really needs to start making friends as opposed to alienating people in this way\".\nThornberry says she can't believe Kemi Badenoch would \"take on the face of it what it is that the Israelis say\".\nShe adds that \"if Israel has something to hide then that would be a terrible thing\".\nUS 'one of our strongest allies' no matter who's in power - Tory leader\nKuenssberg asks Badenoch if the US is a reliable partner under Trump.\nAll sorts of things are happening, Badenoch says.\nWe need to make sure what we're doing is in our national interest, she adds.\nThe US is \"one of our strongest allies\" no matter who is in power, she says, adding that she will not speculate on whether they are or are not reliable.\nOnline Safety Act not negotiable, the treasury minister says\nBack to trade, Kuenssberg asks if the government is planning to weaken protections in the Online Safety Act to secure a trade deal with Trump.\nJones says the \"basic protections\" in the Online Safety Act are \"not up for negotiation\".\nIf something is illegal offline, it must be illegal online, he says.\nKuenssberg presses again: is the Act part of the negotiations or not?\nJones repeats that the protections in the Act are not negotiable.\nHe says social media platforms must be built to protect children.\n\"We won't be walking away from that,\" he says.\nAnd that's where the interview with Darren Jones wraps up.\nFor context, talks on US-UK tariff deals included suggestions about changing online safety rules, but government sources have said this is \"not happening\"", "url": "https://www.bbc.com/news/live/cgen9rxeyelt"}