{"authors": ["Huw Oxburgh", "www.facebook.com"], "date_download": "2025-04-26 04:12:17", "date_modify": "2025-04-26 04:12:17", "date_publish": "2025-03-04 12:28:43", "description": "Developers propose to convert the seven-storey Queensbury House into a modern co-living space.", "filename": "news_articles_c0mw8w373wpo_1745640737.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e97b/live/ed0a20a0-f8f3-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw8w373wpo_1745640737.html", "title": "Hastings: Plans submitted to turn disused building into 80 homes", "title_page": "Hastings: Plans submitted to turn disused building into 80 homes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans have been submitted to convert a disused office building in Hastings into 80 apartments.\nDale Real Estate proposes to convert Queensbury House, a seven-storey building in Havelock Road, into a \"co-living\" space, according to the Local Democracy Reporting Service.\nA spokesperson for the company says the design is \"centred around fostering a sense of community and offering a mix of private and communal facilities tailored to modern urban lifestyles\".\nJohn Bownas from Loving Hastings said there were \"unanswered questions\" from the developer, namely who manages the building, rent prices and what happens if not enough suitable tenants are found.\n\"There is a risk this well-meaning proposal could become just another emergency temporary accommodation option for single vulnerable people, but without the levels of social support which the client group needs,\" he added.\n\"We welcome a discussion with the building owners to discuss the needs for affordable living in the town centre so that a realistic long-term plan can be implemented for this potentially landmark building.\"\nDale Real Estate's architects, Front Architecture, confirmed there would be a management team for the building.\n\"Rental costs would be comparable to other shared dwellings and this covers all utilities,\" it added.", "url": "https://www.bbc.co.uk/news/articles/c0mw8w373wpo"}