{"authors": ["Keiron Tourish", "www.facebook.com"], "date_download": "2025-04-26 07:05:50", "date_modify": "2025-04-26 07:05:50", "date_publish": "2025-02-28 06:20:52", "description": "Charles Dooher was at home when a masked gang beat him with iron bars and other weapons on 20 January.", "filename": "news_articles_cge11q4xwr3o_1745651150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2dfe/live/e5384010-f537-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge11q4xwr3o_1745651150.html", "title": "Lifford attack victim Charles Dooher 'cannot breathe for himself'", "title_page": "Lifford attack victim Charles Dooher 'cannot breathe for himself' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The girlfriend of a man, who is fighting for his life in hospital after being savagely beaten, says he cannot walk, talk or breathe for himself and will never be the same again.\nCharles Dooher, a 26-year-old farmer from Lifford in County Donegal, was at home when a masked gang beat him with iron bars and other weapons on 20 January.\nCharlotte Gallen said it is heartbreaking to see her partner clinging to life.\nThey had dreams of getting married and having children but now, she says, the future looks uncertain.\nHis girlfriend of five years, Ms Gallen, described it as a \"a brutal and vicious attack\".\n\"I feel that it was targeted and organised and they entered the home armed with weapons. They beat him on the back of the head.\n\"They actually cable tied his sister and threw her in her bedroom. And they also beat his father too and left him with injuries.\"\nWarning: Contains distressing details\nShe told BBC News NI her boyfriend has a severe traumatic brain injury.\n\"He actually has one of the worst head injuries that the top neurosurgeons and doctors in the Royal had ever seen,\" she said.\n\"He's left without half of his skull and he has life-changing injuries that are going to affect him for the rest of his life,\" she added.\n\"Can you imagine seeing man of his build who has always been strong and capable of doing anything he has put his mind to laying in a bed having to be peg fed (using a feeding tube) because he can't swallow and is not able to walk, he can't talk, he can't do anything, he can't even breathe for himself.\n\"You are seeing a man that's so strong and provides you with safety and comfort laying in such a vulnerable position.\"\nShe wants people to think about how they would feel in this situation if it was one of their loved ones.\n\"Somebody, somewhere knows something,\" she said.\nShe urged anyone with any information to consider sharing it.\nThe Dooher family was critical of the Garda (Irish police) investigation into the attack at their home outside Lifford.\nThey claim they had been subjected to various threats over the years and robust action was not taken.\nA spokesperson for the Gardai said: \"An Garda Siochána does not comment on the detail of interactions with families. And Garda Siochána will continue to liaise with the family.\"\nA family statement, from solicitor Ciaran Shiels, said the family was \"a close, hard-working, law abiding family with respect for the law\".\nCharles Dooher's sister Deborah, a nurse, says those responsible should be ashamed of themselves.\nShe believes there has been an \"an exchange of money\" involved in the attack.\n\"They went to Charles' room as he was getting ready to go to the gym and delivered several deadly blows to the back of his skull fracturing it, to the extent that you drop a porcelain plate on the floor.\"\nShe said that, even as a medical professional, the extent of his injuries have been shocking.\nDeborah said her brother is in \"constant severe pain\".\n\"I think somebody would have to absolutely hate my brother and want him dead to cause that extent of injury.\n\"As a nurse I've seen a lot of people in a lot of pain. I've seen people fight cancer. I've seen families in a lot of pain.\n\"Usually it's because someone has been sick and usually it's because of a normal or somewhat normal circumstance.\"\nCharlotte Gallen says she and Charles had planned on getting married and having children but those dreams now appear to be shattered by this horrendous attack, she believes.\n\"The plans we'd made they seem so far away. We may never get to do the things that we dreamed of doing together.\"\nMs Gallen has been by his bedside since the attack.\n\"I've been praying endlessly for him to make a full recovery physically and psychologically. It's just been traumatising and I don't think any of us will recover from this.\"\nShe said that the perpetrators are \"callous and evil\".\n\"He's an innocent man. He's an honest working man. I think they have a lot to think about when they go to sleep at night.\"\nGardaí said their investigation is continuing and renewed their appeal for any witnesses to come forward.\nOfficers are especially keen for anyone who may have dash cam footage of a silver or grey Peugeot 3008 car seen in the Coneyburrow Road area of Lifford between 10:00 and 11:00 local time on 20 January to contact them, a Garda spokesperson said.", "url": "https://www.bbc.co.uk/news/articles/cge11q4xwr3o"}