{"authors": ["Steve Jones", "www.facebook.com"], "date_download": "2025-04-26 04:29:15", "date_modify": "2025-04-26 04:29:15", "date_publish": "2025-03-02 07:38:59", "description": "Courtney Evans is one of the few 'living donors' in the UK and her liver will regenerate itself.", "filename": "news_articles_c0rzqe7vg07o_1745641755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/61f9/live/2977eef0-f5bb-11ef-8c2a-43d22b661d81.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rzqe7vg07o_1745641755.html", "title": "Pontefract rugby player donates liver to save baby's life", "title_page": "Pontefract rugby player donates liver to save baby's life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rugby player who donated part of her liver to save a baby's life has spoken about the \"absolutely crazy\" experience.\nCourtney Evans, 25, volunteered for the surgery to help a child she has never met.\nShe is hoping to play for Wakefield Trinity in their first match of the season on 23 March, five months after her gruelling 10-hour operation.\n\"It's a great feeling to know that you have been through a big thing and I have still got my life,\" she said.\nA living donor liver transplant involves removing a section of liver from the donor and transplanting it into the recipient.\nAccording to the NHS, because the liver can regenerate itself, both the transplanted section and the remaining section of the donor's organ are able to regrow into a normal-sized liver.\nFull-back Miss Evans, from Pontefract in West Yorkshire, told the BBC she was partly inspired to donate her liver by her day job working in CT radiology for the Mid Yorkshire Teaching Hospitals NHS Trust.\n\"Working where I work we see patients who need a transplant and people who have had one, the difference in their lives is massive.\n\"Seeing that first half, you know what difference you are making.\"\nHowever, her main inspiration has been her father Gary.\n\"My dad is diabetic so we have always semi-cared for him. I have always had a caring background looking after him then going into the hospital.\n\"Taking somebody else's trauma and helping them, I want to do that.\"\nMiss Evans, who now lives in Royston, South Yorkshire, said she only found out a living person could donate their liver in March 2024 before putting herself forward for the procedure.\nAccording to the NHS, liver transplants have been successfully performed in the UK since 1995.\nA spokesperson for NHS Blood and Transplant said there were 1,130 liver donors in the UK between April 2023 and March 2024, but just 31 of these were living donors.\n\"Unfortunately, there are simply not enough livers donated by people who have died for those who are waiting to receive a transplant,\" they added.\nMiss Evans underwent the surgery at St James's Hospital in Leeds just two days after playing in a semi-final with former club Halifax Panthers.\n\"Liver donation is something that's not really spoken about and that's the bit that baffles me,\" she said.\nShe described the process as \"quite smooth\", but admitted: \"I quite like the gory stuff\".\n\"I play rugby, so having scars on my legs from studs and knocks here and there, having one on my sternum doesn't faze me.\"\nHer recovery had gone \"really, really well\", she added.\nShe had to miss the rugby union season and was unable to ride her horse or walk her dogs.\nDue to patient confidentiality, Miss Evans does not know any details about the baby her liver was given to, though she is given updates on its progress.\nHer gesture has also seen her nominated for the Inspirational Individual of the Year prize in the 2025 Yorkshire Choice Awards.\n\"I'm feeling overwhelmed and joyful and glad that I got the opportunity to do this,\" she added.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c0rzqe7vg07o"}