{"authors": ["Chris Young", "www.facebook.com"], "date_download": "2025-04-26 03:53:52", "date_modify": "2025-04-26 03:53:52", "date_publish": "2025-03-03 07:34:13", "description": "Valley View, a former children's care home in Bradford, sells for nearly £900,000.", "filename": "news_articles_clyn2g7mkwjo_1745639632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fd99/live/530495a0-f5e5-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyn2g7mkwjo_1745639632.html", "title": "Bradford former care home sold off as council raises funds", "title_page": "Bradford former care home sold off as council raises funds - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former care home has sold for almost £900,000 at auction, as Bradford Council seeks to raise funds to balance its books.\nValley View, a former children's care home off Lister Lane, was one of 150 assets sold off by the council, and raised 20% more than its guide price.\nThe home was closed in 2022 by the council, which said it did not provide a physical environment that was \"consistent with the care of children\".\nOther properties sold include a petrol filling station on Halifax Road and a parade of shops in Bingley. Details of the buyers were not disclosed.\nOne lot - a plot of land off Woodside Road in Wyke, which the listing described as being blighted with Japanese Knotweed - had a guide price of £5,000 but sold for £85,000, according to the Local Democracy Reporting Service.\nAs part of its request to the government for \"exceptional financial support\", Bradford Council was given permission to use money from the sale of assets to fund council services.\nCouncils can normally only use money from such sales for capital projects, such as new developments.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/clyn2g7mkwjo"}