{"authors": ["Katya Adler", "www.facebook.com"], "date_download": "2025-04-26 03:38:22", "date_modify": "2025-04-26 03:38:22", "date_publish": "2025-03-05 00:01:17", "description": "Europe is scrambling to react to the relentless pace of change in Washington, but can it unite around a plan?", "filename": "news_articles_czxnekw9lyjo_1745638702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0515/live/fa288080-f946-11ef-ab6a-cb409d79bd4e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czxnekw9lyjo_1745638702.html", "title": "Ukraine war: Can Europe provide a credible answer on ceasefire and defence?", "title_page": "Ukraine war: Can Europe provide a credible answer on ceasefire and defence? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's certainly one way of focusing our minds — and wallets! Donald Trump is doing us a favour, if we choose to think about it that way. And we may as well look on the bright side. Otherwise these times are too dark.\"\nThe words of a diplomat from a major European country, speaking after Donald Trump turned off the military aid tap to Ukraine on Monday. He asked not to be named, so he can share his thoughts more freely.\nThe relentlessness, and pace, of change in Washington, can be dizzying. Not only for consumers of news but politicians as well.\nEurope is scrambling to react effectively.\nThere has been a frenzy of diplomatic activity: bilateral, late-night leader phone calls, European huddles in London and in Paris, meetings of Nato defence ministers in Brussels. An emergency security summit of EU leaders is also scheduled this Thursday.\nIt is a huge moment in European history.\nMost European countries believe the security of all of Europe, not only the sovereignty of Ukraine, is at stake — with Russia looking to dismantle the western-facing balance of power, in place since the end of the Cold War.\nWashington, which has had Europe's back in terms of security and defence since World War Two, now appears \"not to care about the fate of Europe\", according to the man poised to be the next leader of the continent's biggest economy, Friedrich Merz of Germany.\nBut what are all the big-name European meetings and summits actually achieving?\nJust a few hours prior to Washington halting military aid to Kyiv, UK Prime Minister Sir Keir Starmer, who is taking a lead in Europe over Ukraine, announced it was time for \"action not words\". The European Commission President Ursula von der Leyen, meanwhile, said Europe must turn Ukraine into a \"steel porcupine\", with urgent, extra arms deliveries.\nCan the continent really act as one, though? Europe is a sum total of different countries with different-sized budgets and diverse domestic politics and priorities.\nEurope's aim in taking this defence action is two-fold:\nFirst, to show Donald Trump that — in the words of the UK prime minister — Europe will now do the \"heavy lifting\" to defend itself. Europe hopes to persuade Trump to restart his military support of Ukraine, and to keep in place the current US security back-up for Europe as a whole, if he believes they are no longer \"freeloading\" off the United States.\nBut also, Europe's leaders will need to urgently boost their own defences and support for Kyiv anyway, if Donald Trump turns away from Ukraine, and further down the line, from Europe more broadly in security terms.\nIt's not only to Washington that Europe feels it has a point to prove.\nRussia is watching too.\nThe various high-profile, big-pledging European emergency meetings must now produce speedy, impressive, practical results, otherwise in the Kremlin's eyes, Europe looks weak and vulnerable.\nMoscow has already gloated about the \"splits\" it sees in Western unity.\nDonald Trump says he trusts Vladimir Putin but he's been scathing about Nato allies and he called Ukraine's president a dictator.\nRussia knows that, for all Europe's talk about now determinedly defending itself, any security expert you speak to admits that — at least in the short-to-medium term — Europe still needs the US.\nThat is why last week in Washington, we saw the French president and the UK prime minister, separately, wooing Donald Trump.\nThe US has filled the yawning gaps in European defence, left by years of chronic under-investment after the end of the Cold War.\nThe number of troops in Europe diminished with the end of conscription in most European countries. The US has roughly 100,000 troops and nuclear weapons in various parts of Europe under Nato's nuclear sharing policy. Many of them are in non-nuclear, major European power Germany, which fears being severely exposed to Russia should Donald Trump withdraw support.\nIf the UK and France manage to assemble what they call a \"coalition of the willing\" — European countries that accept to send even a modest number of peacekeeping troops into Ukraine once a ceasefire is agreed — that could stretch European armies and expose gaps in Nato defences.\nThat is why Poland is unwilling to commit troops to that \"coalition\". It says it needs to keep soldiers at home, to defend itself against Russia. It also fervently hopes the US won't be pulling its troops out of Eastern Europe.\nBut Europe also relies on the US for military capabilities that ensure the smooth running of operations. These are known as \"enablers\".\nUkraine leans heavily on US intelligence, for example, to maintain a strong hand against Russia.\nBut on Wednesday, the Financial Times reported that the US had cut off intelligence-sharing with Kyiv, in a move that could seriously affect the Ukrainian military's ability to target Russian forces.\nAny European peacekeeping or \"reassurance\" force in Ukraine would need US support to establish an air shield over Ukraine. Europe lacks air-to air refuelling capabilities, as well as munitions that could take out air defences in Russia if necessary.\nThese enablers \"can't be bought in a hurry at the local cash-and-carry\", as one European politician put it to me.\nThis is why the UK, France and others in Europe are so very keen to keep the US on board for as long and as much as possible.\n\"Some of my esteemed European colleagues should probably hold back from tweeting in anger,\" one frustrated diplomat from a high-profile nation told me.\nWe were discussing European outrage at the treatment of Ukraine's president by the US president and vice-president at the Oval Office on Friday.\n\"Real leadership is not about letting off steam online. It's about finding the right words to constructively move forward, however complicated the situation.\n\"Do we need continued US support in Ukraine and Europe? Do we have more in common with the US than with China? Those are the fundamental questions we need to keep in mind.\"\nAnother fundamental question for Europe is, of course, how much cash is needed and how fast to credibly boost defence.\nOn Ukraine, Europe could arguably quite easily replace current US support, if it put its mind to it.\nGermany is the largest donor of military aid to Ukraine after the US. If other European powers followed its lead, it says, Ukraine defence would be covered for the foreseeable future.\nBerlin and other northern European countries express resentment against France, for example, which they say, talks big about defending Ukraine – and is strong in leadership and strategy - but has in fact donated relatively little.\nAs for broader defence spending, the EU Commission Chief Ursula von der Leyen declared on Tuesday that \"Europe is in an era of re-armament\".\nShe suggested the EU alone could mobilise a total of 800bn euros for defence spending by:\nUsing its joint budget more creatively\nProviding 150bn euros in loans to benefit the defence of the EU as a whole — so, for example, in air and missile defence, anti-drone systems, and military mobility\nSuspending EU fiscal rules to allow individual EU countries to spend more on defence\nEU leaders will debate her proposals and others at their summit on Thursday – including whether frozen Russian assets in Europe could be used in funding for Ukraine.\nBut potential and very public European splits loom large. Many fuelled by member states' domestic politics.\nHungary, close to Russia and Donald Trump's administration, is a spoke in the wheel of pretty much every EU debate to help Ukraine. Brussels fears Slovakia is going the same way.\nCountries near Russia's borders do not need to explain to voters why defence spending needs to be high. Tiny, exposed Baltic nations Estonia and Lithuania already spend over 3% of GDP on defence. They want to raise that to 5% in the near future.\nMeanwhile, big European economies Italy and Spain, geographically much further from Russia, fail to spend the Nato minimum requirement of 2% of GDP on defence.\nIn Germany, France and the UK, according to a study by the London-based Focaldata research group, most voters want to maintain or reduce defence spending, preferring their government to focus on other voter priorities.\nBut Nato Secretary General Mark Rutte is warning Europeans to wake up and smell the coffee brewing in Washington and Moscow.\nEuropean nations need to spend more than 3% of GDP now to effectively wean the continent off its deep reliance on the US, he says.\nIf Donald Trump pulls out of Europe altogether, never mind Ukraine, that would mean spending 4-6% of GDP, according to defence experts: a political, social and economic earthquake Europe's leaders hope they will not have to face.", "url": "https://www.bbc.co.uk/news/articles/czxnekw9lyjo"}