{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 04:06:23", "date_modify": "2025-04-26 04:06:23", "date_publish": "2025-03-03 16:42:57", "description": "Police release new CCTV in a search for Luis Piovesana, 26, who disappeared in Bristol on Friday.", "filename": "news_articles_c1mngymxmpro_1745640383.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b422/live/eec33900-f848-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mngymxmpro_1745640383.html", "title": "Missing Bristol man Luis Piovesana called 999 from taxi", "title_page": "Missing Bristol man Luis Piovesana called 999 from taxi - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who went missing after a night out called 999 from a taxi after leaving a nightclub, police have said.\nLuis Piovesana, 26, was last seen in the early hours of 28 February after leaving The Jam Jar in St Jude's, Bristol at 02:55 GMT.\nIn a press conference Avon and Somerset Police said he left the club in a taxi and called both his partner and 999 in the minutes after his departure, the 999 call lasting 34 seconds.\nThe last confirmed sighting of Mr Piovesana was at Eastgate Retail Park, where he was seen on CCTV between 03:15 and 03:30 GMT.\nPolice said the 999 call made to them by Mr Piovesana ended after 34 seconds, and attempts had been made to call and text him back to confirm his safety but had gone unanswered.\nIn a press conference on Monday afternoon, Det Insp Pete Walker said more than a 100 police officers and staff had been involved in the search, joined by many more volunteers.\nHe urged anyone in the St Werburgh's, St Agnes, Eastville and Fishponds areas with any CCTV, doorbell or dashcam footage covering the period from 03:00 until 07:00 on Friday to send it to police as it \"could be vital\" in helping officers trace his movements.", "url": "https://www.bbc.co.uk/news/articles/c1mngymxmpro"}