{"authors": ["Kaleigh Watterson", "www.facebook.com"], "date_download": "2025-04-26 07:05:51", "date_modify": "2025-04-26 07:05:51", "date_publish": "2025-02-28 06:22:33", "description": "The prison sentence of MP Mike Amesbury has been suspended - but what's next for him?", "filename": "news_articles_cp8llwkp6z6o_1745651151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2567/live/c0886740-f523-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8llwkp6z6o_1745651151.html", "title": "Mike Amesbury: What happens now for the conviction MP?", "title_page": "Mike Amesbury: What happens now for the conviction MP? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "MP Mike Amesbury has been given a custodial sentence, which paves the way for a by-election to happen in his constituency of Runcorn and Helsby.\nBut what is the process - and does he have to stand down?\nIf an MP receives a prison sentence, that triggers what is called a recall petition. This happens whether the sentence is an immediate custodial sentence or a suspended sentence.\nA recall petition is not immediately triggered on the day an MP receives a sentence, instead it is when the appeals process is completed.\nIn this case, Mike Amesbury was given an immediate custodial sentence on 24 February, and although three days later this was reduced on appeal to a suspended sentence, a recall petition will now still happen.\nA recall petition is a process where a sitting MP can lose their seat in the House of Commons. It can be signed by anyone in the area who is entitled to vote in an election.\nIt calls for the MP to lose their seat and for a by-election to take place for constituents to elect a new one.\nThere are three ways for the petition to be triggered:\nIf an MP is convicted of an offence in the UK and receives a custodial sentence (including a suspended sentence) or is ordered to be detained, other than solely under mental health legislation\nIf an MP is suspended from the House of Commons for 10 sitting days or 14 calendar days\nIf an MP is convicted of providing false or misleading information for allowance claims under the Parliamentary Standards Act 2009.\nIn the case of a conviction, the recall petition will only be triggered after the appeal period.\nIt would not be opened if the last possible date for a general election is within six weeks, or if the MP's seat was already vacant (ie, if an MP resigns).\nIf 10% of the electorate sign that petition, the MP will lose their seat and a by-election will take place.\nOnce the court proceedings and appeals process is completed, the court will notify the Speaker of the House of Commons that the MP has been given a custodial sentence.\nThe Speaker will then contact the local returning officer, which is the person in charge of elections.\nIn Runcorn and Helsby, that would be the returning officer at Halton Council.\nDuring this process, they are known as the petitions officer.\nThe Speaker must give notice that one of the conditions for triggering a recall petition has been met to the petitions officer \"as soon as reasonably practicable\".\nOnce that notice has been received, the petitions officer must name up to ten places where the petition may be signed once it has been opened.\nThe receipt of notice is deemed as the day after the Speaker has given notice to the petitions officer.\nOn the 10th working day after the receipt of notice, the recall petition would open.\nThat petition will then remain open for six weeks.\nOnce the signing period has been completed, the signatures must be counted as soon as possible - no later than one day after the end of the period.\nIf the petition is successful - if it has been signed by 10% of eligible registered voters - the petition officer must notify the Speaker.\nThe MP's seat becomes vacant on the giving of that notice - and the public can only be notified after the Speaker has been told.\nBut even if an MP loses their seat in a recall petition, there is no legislation stopping them from standing in the subsequent by-election.\nUnder electoral law, the media are not allowed to publish any statement that would indicate if a person has signed the petition or not.\nThe media cannot also forecast the result of the petition or publish any exit polls before the end of the final day of the signing period.\nAnyone who makes any statement on turnout or about individuals who sign a petition would be guilty of an offence.", "url": "https://www.bbc.co.uk/news/articles/cp8llwkp6z6o"}