{"authors": ["Justin Dealey", "Helen Burchell", "www.facebook.com"], "date_download": "2025-04-26 04:32:26", "date_modify": "2025-04-26 04:32:26", "date_publish": "2025-03-03 05:31:33", "description": "The man representing families over birth defects in a steel town says a full inquiry is in order.", "filename": "news_articles_cn52xw4rk7wo_1745641946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9cd0/live/8e07a1c0-f60c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn52xw4rk7wo_1745641946.html", "title": "Netflix Toxic Town: Solicitor calls for full apology", "title_page": "Netflix Toxic Town: Solicitor calls for full apology - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A solicitor who represented families affected by a town's toxic waste scandal has called for a public inquiry and a \"full apology\".\nYears after Corby's steelworks were closed in 1980, mothers living near a reclamation site gave birth to children with upper limb deformities.\nSolicitor Des Collins, from Watford, began conducting his own investigation, revealing birth defects in Corby were three times higher than in the surrounding area.\nA Netflix drama based on the Northamptonshire town's toxic waste scandal is now available to stream and Mr Collins said it was time for affected families to receive a full explanation.\nSpeaking to the BBC's Justin Dealey, in light of the new production, Mr Collins said: \"Back in the day... we tried on a number of occasions to get a public inquiry into this issue and it was always rejected.\n\"I think there will be calls again for a public inquiry because a lot of the story has come out - a lot of it hasn't come out - and the bit that hasn't come out is important because of the learning process.\"\nMr Collins, who is portrayed in the Netflix production by actor Rory Kinnear, said he would be prepared to support the families as he had previously done.\n\"This needs to be brought before the public in a more complete way, and I'm not criticising the Netflix production at all, but I think it really does require - in the light of this - that there should be further examination of the issues,\" he said.\nHe added: \"A full apology would represent a huge amount [to the families].\"\nThe local authority no longer exists, having been replaced by the North Northamptonshire unitary council in April 2021.\nThe case remains a landmark ruling in environmental justice.", "url": "https://www.bbc.co.uk/news/articles/cn52xw4rk7wo"}