{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:05:52", "date_modify": "2025-04-26 08:05:52", "date_publish": "2025-02-26 15:19:38", "description": "Former Arsenal and Everton striker Kevin Campbell died aged 54 after treatment for a heart infection.", "filename": "news_articles_cp3yw0z9klko_1745654752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0b37/live/96898290-f450-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yw0z9klko_1745654752.html", "title": "Family raise concerns over football star's death", "title_page": "Kevin Campbell: Family raise concerns over football star's death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of retired Premier League footballer Kevin Campbell have questions over the care he received before his death, a coroner's court heard.\nThe former Everton and Arsenal striker died aged 54 at Manchester Royal Infirmary (MRI) on 15 June.\nA provisional cause of death was given as multi-organ failure due to a heart infection known as infective endocarditis.\nManchester Coroner's Court heard he had several stays in hospital before his final admission to the MRI in May 2024, including a six-and-a-half week period where no underlying cause for his declining health was identified.\nMr Campbell, who also played for Nottingham Forest and Trabzonspor in Turkey, had been fit and well until about January 2024.\nThe pre-inquest review hearing was told that the MRI later declared a Level 5 patient safety incident, the most serious category, regarding aspects of his care.\nThe court was also told that was later downgraded to Level 2 as a subsequent mortality review by the hospital had concluded his death was \"possibly avoidable but not very likely\".\nSebastian Naughton, representing Mr Campbell's family, said the MRI's own investigation had identified \"some shortcomings\" in treatment, with reference to a delay in diagnosis during his final spell at the hospital.\nHe said the family, who were not present at the hearing, wanted to know more about his earlier stay there.\n\"The family have questions about the first admission,\" he said.\n\"In broad terms there was a six-and-a-half week admission and no clear cause was identified and whether there was an an earlier opportunity.\"\nZak Golombek, area coroner for Manchester, adjourned proceedings ahead of a full inquest hearing on a date yet to be decided.", "url": "https://www.bbc.co.uk/news/articles/cp3yw0z9klko"}