{"authors": ["Claire Hamilton", "www.facebook.com"], "date_download": "2025-04-26 06:34:49", "date_modify": "2025-04-26 06:34:49", "date_publish": "2025-02-27 06:20:52", "description": "Councillor Liam Robinson says \"compromises\" can be reached after a major rift with businesses.", "filename": "news_articles_c2ergedpvg2o_1745649289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b3e/live/1fd21e70-f480-11ef-96b5-cb16e833b61d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ergedpvg2o_1745649289.html", "title": "Everton Stadium parking zone 'will be tweaked'", "title_page": "Everton Stadium parking zone 'will be tweaked' - council leader - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of Liverpool City Council has said parking rules around the new Everton stadium will be \"tweaked\" after businesses claimed trade was already suffering.\nBusiness owners said plans to restrict parking in the roads around Bramley-Moore Dock were initially described to them as \"match day parking\" – but in reality, restrictions are proposed for 365 days a year.\nCouncillor Liam Robinson told BBC Radio Merseyside the council would make \"tweaks, alterations or changes\" to the parking zone amid mounting pressure.\nPaul Blair, owner of Hot Water Comedy Club and Blackstock Market, called the station during a phone-in and said bookings were 47% down since the rules had been publicised.\nHowever he said bookings plummeted and said a community fun day event on weekends was down 60%, which he said was because \"80% of the people coming are driving\".\n\"On those particular days Blackstock Street will be completely empty apart from people coming to our events and that will be a large part of the season,\" he added.\nRobinson said he was \"genuinely sorry\" for the impact.\nHe suggested there could end up being \"compromises\" on both sides to reach an agreement.\nLast week, 10,000 fans attended the first of three trial games at the £500m waterfront stadium.\nRobinson acknowledged there had been some traffic problems linked to road closures and had taken on board concerns about poor street lighting.", "url": "https://www.bbc.co.uk/news/articles/c2ergedpvg2o"}