{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:41:14", "date_modify": "2025-04-26 07:41:14", "date_publish": "2025-02-27 11:55:48", "description": "Craig Curry attacked Neil Selkirk in Gateshead following a row over a phone charger, a court hears.", "filename": "news_articles_crmjjk42x2vo_1745653274.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c995/live/ecac08f0-f4ff-11ef-b291-5f578a7db71a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjjk42x2vo_1745653274.html", "title": "Gateshead murderer who left homeless man dying in park jailed", "title_page": "Gateshead murderer who left homeless man dying in park jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A murderer who beat and kicked a homeless man to death in a park has been jailed for at least 19 years.\nCraig Curry, 33, attacked Neil Selkirk, 54, in Gateshead and left him to die with his trousers pulled down to cause extra humiliation, Newcastle Crown Court heard.\nMr Selkirk's family said they were \"devastated\" by his death and he was in the process of rebuilding his life when he was brutally killed.\nCurry had denied murder but was found guilty by jurors. He was jailed for life with a minimum term.\nMr Selkirk had been living in a small park off Prince Consort Road since 2 August after the breakdown of his relationship with his partner of almost 10 years, the court heard.\nHe was given a tent by another rough sleeper, Judge Nathan Adams said, adding Mr Selkirk \"caused no problems for anyone\" and was \"liked by the local residents, some of whom gave him food and bedding\".\nOn 23 August, Curry arrived and pitched his tent, with the men initially getting on, the court heard.\nJudge Adams said Curry was much bigger in stature than Mr Selkirk and was \"louder and opiniated\".\nBut they fell out over a phone charger and on the night of 24 August, Curry viciously attacked Mr Selkirk, repeatedly punching him in the face before kicking and stamping on him after he fell to the ground.\nJudge Adams said Curry and another man, who was cleared of both murder and manslaughter, left the park and made no efforts to help Mr Selkirk, who was left lying unconscious near a footpath.", "url": "https://www.bbc.co.uk/news/articles/crmjjk42x2vo"}