{"authors": ["Danny Fullbrook", "www.facebook.com"], "date_download": "2025-04-26 03:52:49", "date_modify": "2025-04-26 03:52:49", "date_publish": "2025-03-03 09:54:20", "description": "Police believe eight men were involved and have arrested five.", "filename": "news_articles_cp3yqz97v0eo_1745639569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/082b/live/15352d70-f80b-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yqz97v0eo_1745639569.html", "title": "Two stabbed and one hit by car in High Wycombe incident", "title_page": "Two stabbed and one hit by car in High Wycombe incident - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two people were stabbed and another was hit by a car following a fight that saw five men arrested.\nThames Valley Police said the incident took place at about 17:20 GMT on Saturday, near Rutland Avenue and Spearing Road, in High Wycombe, Buckinghamshire.\nFive men from the town were arrested on suspicion of affray.\nThis included two 26-year-old men who were stabbed and taken to hospital with what police described as \"serious but not life-threatening stab wounds\".\nA 28-year-old was also arrested and taken to hospital with a leg injury believed to have been caused by being hit by a car.\nA 19-year-old and a 30-year-old were also arrested and released on police bail.\nThe force put a Section 60 order in place until 19:00 on Monday, which allowed officers to stop and search anybody in the area and carry out increased patrols.\nPolice believed eight men were involved in the disorder.\nDet Insp Luke Pratt said: \"We understand this disorder may be concerning for the community but we believe those involved were known to each other and we do not believe there is any threat to the wider public.\"\nWitnesses have been asked to contact the police with more information.", "url": "https://www.bbc.co.uk/news/articles/cp3yqz97v0eo"}