{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 07:44:02", "date_modify": "2025-04-26 07:44:02", "date_publish": "2025-02-26 18:06:41", "description": "Eight other fires could be linked to the recent suspected arsons in Sheffield, police believe.", "filename": "news_articles_cx2g58pexeeo_1745653442.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94cc/live/c98c83a0-f468-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2g58pexeeo_1745653442.html", "title": "Man arrested over suspected Sheffield arson attacks", "title_page": "Man arrested over suspected Sheffield arson attacks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been arrested in connection with a series of suspected arson attacks in Sheffield.\nThe 42-year-old was held earlier on suspicion of arson/criminal damage with intent to endanger life, South Yorkshire Police said.\nIt was now believed that three fires reported in Tynker Avenue, Bramshill Close and Meadow Gate Avenue on Sunday and Tuesday could be linked to eight other incidents which had taken place this year, a force spokesperson said.\nAdditional patrols, including plain-clothed officers, had been deployed to the Beighton area and anyone with information about the incidents was asked to get in touch, they added.\nThe blaze in Tynker Avenue on Sunday involved a bin fire that spread to a property, while a caravan was set alight in Bramshill Close on the same day, with the fire spreading to an adjacent property, police said previously.\nMeanwhile, a third blaze was reported in Meadow Gate Avenue on Tuesday and involved a wheelie bin fire spreading to two cars, a Land Rover Defender and a Porsche Taycan, as well as to a nearby property.\nNo one was injured in any of these incidents, according to South Yorkshire Police.\nNeighbourhood Inspector Katie Hammond said: \"We understand the concern these incidents have caused in and around Beighton, and would like to thank those who live, work, and travel in the area for their patient support so far.\n\"If you want to share your concerns with us, please contact the Neighbourhood Policing Team.\n\"We are here to keep you and your community safe and are always happy to reassure you in any way we can.\"\nThe arrested man remained in custody, South Yorkshire Police said.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cx2g58pexeeo"}