{"authors": ["Shivani Chaudhari", "www.facebook.com"], "date_download": "2025-04-26 06:55:24", "date_modify": "2025-04-26 06:55:24", "date_publish": "2025-02-28 15:33:41", "description": "Mark Donovan is due to be sentenced on Wednesday.", "filename": "news_articles_c30mmgj4y0eo_1745650524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2132/live/83e670f0-f5e8-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c30mmgj4y0eo_1745650524.html", "title": "Great Baddow murder: Man found guilty of killing Elise Mason", "title_page": "Great Baddow murder: Man found guilty of killing Elise Mason - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been found guilty of murdering his estranged wife after he strangled her in his home.\nMark Donovan, 40, had been on trial for the murder of Elise Mason, in Great Baddow, near Chelmsford, Essex, on 25 April 2023.\nMs Mason was wearing her coat and shoes when her body was found by police near the front door after the killing. She had also suffered more than 70 separate injuries.\nDonovan is due to be sentenced on Wednesday.\nThe trial heard how Donovan, of Rothmans Avenue, Great Baddow, denied murdering the 37-year-old at the home they previously shared.\nThe pair had been teenage friends and began a romance in 2010, living together until their relationship fell apart in 2022.\nEarlier in the trial, prosecutor Andrew Jackson KC told Chelmsford Crown Court she was last seen alive at 16:09 BST and was filmed on CCTV approaching the defendant's house.\nJurors heard the visit was a few days before her birthday and she was texting a new partner.\n\"It wasn't until two hours later that the defendant eventually left that house, leaving Elise's lifeless body inside, taking with him her phone and bank card,\" Mr Jackson said.\nDonovan was later seen drinking at The Blue Lion pub in Great Baddow. He was in the toilets for three minutes and dumped his former partner's phone in the toilet cistern, Mr Jackson said.\nHe then had two drinks before heading to two massage parlours, one in Chelmsford and a second in Romford.\nHe was arrested after walking into a police station, while eating noodles from a Chinese takeaway, and telling officers he had done \"the worst thing\", the prosecutor said.", "url": "https://www.bbc.co.uk/news/articles/c30mmgj4y0eo"}