{"authors": ["Sean Coughlan", "www.facebook.com"], "date_download": "2025-04-26 04:16:24", "date_modify": "2025-04-26 04:16:24", "date_publish": "2025-03-04 09:27:03", "description": "The Duchess of Sussex releases a lifestyle TV show about cooking and gardening.", "filename": "news_articles_cddy9e0ll76o_1745640984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/58a4/live/709f32f0-f8e7-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy9e0ll76o_1745640984.html", "title": "All smiles in Meghan's upbeat Netflix TV series With Love, Meghan", "title_page": "All smiles in Meghan's upbeat Netflix TV series With Love, Meghan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Blue skies, picture-perfect flowers, intricately-prepared cakes and Californian sunshine streams through the windows. Oh, and another celeb turns up in the kitchen.\nIs that like your home too? Of course not. And that's the point really. The new Netflix series, With Love, Meghan is about escapism and aspiration, it's a glass of something sparkling on a grey day.\nWe see her standing in a kitchen, albeit not in her own home in Montecito, gathering fruit and herbs in the garden and chatting with friends as she makes food such as focaccia, doughnuts and Korean fried chicken.\nIt's also putting on show food products that are being launched by Meghan's new brand - so there's a lot of raspberry jam on display (on sale with \"keepsake packaging\").\nWhat you won't see are references to her former life as a working royal, her children Archie and Lilibet aren't on camera and there's only a fleeting glimpse of Prince Harry.\n\"I love feeding people, it's probably my love language,\" says Meghan, as she shows her culinary skills.\nShe makes different types of pasta, crudités, focaccia, frittata, baked fish. And with advice on how to make guests feel extra special, she shows how to arrange flowers and make DIY bath salts.\nThere are occasional sprinkles of references to her famous connections. We don't get to see Prince Harry until the final episode, but we hear he enjoys bacon and likes a lot of salt.\n\"Well I have a family, a husband, who no matter what meal is put in front of him before he tastes it puts salt on,\" Meghan explains. \"So I try to under salt.\"\nFriends drop in. There's the movie star Mindy Kaling, who jokes about the weight of Le Creuset saucepans. Celebrity chef Roy Choi is there. There's designer Tracy Robbins and Victoria Jackson who ran a cosmetics business.\nIt's an eight-part ode to optimism, relentlessly upbeat and feelgood, where parents, rather than clinging to glasses of Friday night white, are standing proudly behind a huge fruit platter beautifully presented in a rainbow design.\nIt's all presented in lush colours, with dramatic shots of the beautiful California coast and mountains.\nWhether you love or hate the TV series will almost certainly depend on what you think about Meghan. And there will be strong opinions on both sides.\nIt's in an entirely different genre from the previous Netflix documentary from Meghan and Prince Harry, which raked over their angry departure from royal life.\nInstead we're into a zone of gleaming smiles in polished kitchens, with a soundtrack of positive music pulsing away. \"Love is in the detail, gang,\" she says. And \"it's time to pop a bottle\" for a glass of champagne.\nMeghan dominates every moment of the 33-minute episodes of this lifestyle TV series, whether it's cooking, gardening, chatting, dancing. Or, as the series begins, beekeeping, as we see Meghan out harvesting honey, dressed in a beekeepers' outfit.\nAnd of course there's jam. That was trailed as the first product of her lifestyle brand that has been renamed As Ever. In the show a guest says \"Oh my God\" as he tries the raspberry jam, with the jam appearing through the series.\nIt's also appearing for sale as \"raspberry spread\" in the As Ever food range, which so far doesn't have prices published alongside.\nMeghan is shown picking blackberries from rows of bushes: \"This is sort of what inspired my jam and preserve making,\" with picking fruit a \"daily task\".\nThe hard work of those bees also seems to be heading for the shops, with \"Wildflower honey with honeycomb\" going on sale.\nWe see a range of teas in the show and As Ever is releasing hibiscus, peppermint and lemon ginger varieties. Shortbread cookies, a crepe mix and flower \"sprinkles\" are also part of the new range.\nMindy Kaling jokes about way the jams were first promoted, where celebrities were sent numbered jars by Meghan.\n\"When I received that in the mail, a box of your preserves it was probably one of the most glamorous moments of my life,\" said Kaling.\n\"But then I looked at the label, and it said they were something like 50. And then I of course, as a very hierarchical person, was like 'who are these other 50? Does having a lower number make me more special...\"'\nMeghan reveals she saved the number one jar for her mother, Doria Ragland as \"it felt like the right thing to do\".\nWe learn about Meghan's fashion style. She likes \"high low\" fashion, mixing up high street fashions with expensive designers.\nThere's also clarification that her name is Sussex now and not Markle, when she challenges Mindy Kaling over using her maiden name.\n\"I didn't know how meaningful it would be to me, but it just means so much to go 'this is our family name, our little family name',\" says Meghan.\nThere are occasional glimpses of another life. She mentions: \"I was a latchkey kid, so I grew up with a lot of fast food and TV tray meals.\" Even a domestic goddess had to grow up somewhere.\nShe's shown wrapping a gift and says: \"I used to teach a gift-wrapping class when I was an auditioning actress.\"\nAs a viewer, you want to pause and find out more about that. But the show rushes on. There's a toughness here.\nIn the final episode we see Prince Harry briefly, congratulating her on launching her As Ever business. And she raises a toast to this \"new chapter\" which is \"part of that creativity that I've missed so much\".\nDoes this series also mark a final departure from any prospect of a return to palace life? The whole breezy, commercial charm of the show is a world away from the royals. This feels like looking forwards to a new future, without any more haggling over the past.\nEverything that Meghan does gets intense attention. That's partly because of how she polarises opinion. People who think she's wonderful and people who can't stand her are all interested in watching more.\nThis series will inevitably get attention because of Meghan's involvement. But will there be enough for either her fans or her detractors to get their teeth into? How strongly can you feel about a cake with a few raspberries on top? Opinions will be divided. As Ever.", "url": "https://www.bbc.co.uk/news/articles/cddy9e0ll76o"}