{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 13:10:59", "date_modify": "2025-05-20 13:10:59", "date_publish": "2023-08-01 00:00:00", "description": "\"Moscow is rapidly getting used to a full-fledged war,\" claims Ukrainian adviser Mykhailo Podolyak.", "filename": "news_live_world-66367658_1747746659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/27EC/production/_130602201_moscow_drone_attack.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-66367658_1747746659.html", "title": "More drones coming, Ukraine tells Russia after skyscraper hit", "title_page": "Ukraine war latest: More drones coming, Ukraine tells Russia after skyscraper hit - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for joining us\nThat's it from us. Thank you for joining our live coverage, as we reported on the latest developments and analysis from Russia and Ukraine on the 524th day of the war.\nIf you would like to stay up to date with the latest developments, you can read more here.\nAnd the BBC's Verify team analysed what we know so far about the latest drone blasts in Moscow, which you can read here.\nToday's page was edited by James Harness, Malu Cursino and Alexandra Fouché. Our writers were Kathryn Armstrong, Emily McGarvey, Ali Abbas Ahmadi, Jacqueline Howard, Gem O'Reilly and Beth Timmins.\nMoscow residents: 'We don't know what will hit us and where'\nFollowing recent drone attacks on the Russian capital in the last few days - one on Sunday and another today - Muscovites say they have mixed feelings about their safety.\nAlexander, who lives nearby said: \"This is a disgusting situation when something flies into the capital and explodes somewhere.\n\"No one is safe in this situation,\" he said, adding that there is growing uncertainty about \"what will hit us and where\".\nHowever, other residents say they still feel safe in the area - despite still sharing some of Alexander's concerns.\n\"I feel worried, but I'm not scared,\" Igor, another local resident told Reuters news agency.\nAfter today's blast, he said he is considering buying a protective film for his windows, \"so that debris doesn't fly into my apartment\".\nMeanwhile, Kirill explained why he is not alarmed by the latest blast. \"I feel safe. I'm originally from Donetsk, so I consider this a minor incident,\" he added.\n'Mosquito warfare' unlikely to change course of war - defence expert\nAli Abbas Ahmadi\nLive reporter\nDrones are unlikely to change the course of the war between Ukraine and Russia, says Mathieu Boulègue, a consulting fellow at Chatham House who focuses on Russian foreign policy and military affairs.\nAs we've been reporting, a drone strike hit a skyscraper in Russia's business district earlier today - the second attack on the building in three days.\nUkraine has not taken responsibility, but Russia claims Kyiv was behind the attack.\nIt is difficult to say where the drone was launched from, but it is possible that it was launched from within Russia - perhaps even from the outskirts of Moscow, says Boulègue. If that were the case, it could mean Kyiv is using intelligence personnel inside Russia to strike at important targets, Boulègue adds.\nAt the same time, it is “not entirely unrealistic” to think the Kremlin ordered the attack to justify its all-out war against Ukraine.\nBoulègue goes on to call the use of drones \"mosquito warfare\"; a \"psychological reminder\" to the enemy that their skies are not safe.\nNew spate of arson attacks at Russian military recruitment centres - reports\nRussian media sites have reported on a new spike in alleged arson attacks at military registration and enlistment offices in different regions of the country.\nBBC Russian has counted at least 15 such cases since the start of the weekend, in places including St Petersburg and the annexed region of Crimea.\nThese events were reported on by various Russian media outlets, including the Moscow Times, external and the online news site Baza., external\nSome of the alleged arsonists are said to be elderly, according to eyewitness reports and posts shared on Telegram, BBC Monitoring says.\nWhile the motives behind the attacks are unclear, reports suggest some of those involved may have mental health issues. Others have said they were pressured by phone scammers.\nIt’s thought to be the largest spike in such attacks since Russia announced it was calling up thousands of extra troops to fight in Ukraine nearly a year ago.\nMore recently, Russia said it would raise the maximum age men could be recruited from 27 to 30.\nWATCH: Kharkiv blaze after drone strikes\nLet's now briefly turn back to Ukraine, where a drone strike in the north-eastern city of Kharkiv has sparked a blaze that resulted in a firefighting operation, the country's state emergency service has said.\nOne of the drone strikes hit an empty college dormitory, destroying two of its floors and part of the roof.\nThe dormitory blast was the result of several Russian drone strikes hitting civilian areas in Kharkiv overnight on Tuesday, Ukrainian authorities have said.\nWhat are drone ships?\nEarlier today we reported on the Russian defence ministry saying it had repelled an overnight attack against two of its warships by Ukrainian drone ships.\nKnown also as drone boats or unmanned surface vessels (USV), these are ships that operate without a crew.\nThey come in all shapes and sizes and are used for a variety of military tasks, like clearing mines or detonating near targets.\nSince the start of the war, they’ve been reportedly used several times to attack Russian ships and Russia’s main naval base in Crimea.\nSo far, Ukraine has only claimed responsibility for one such attack – back in May.\nAs for the latest incident, Russia has yet to provide any visual evidence to support their claim, and the attack reportedly took place hundreds of miles southwest of the Russia-annexed Crimea, in the middle of the Black Sea, making it difficult to verify the statement.\nIt also remains unclear how many drone ships Ukraine has. But some analysts say Ukraine’s extensive deployment of these drones, at relatively low cost, marks a new era for naval warfare – and poses an increasing risk to Russia.\nCracks in Putin rule are widening - Russia watcher\nNina Khrushcheva, a long-time watcher of Russian President Vladimir Putin who is currently in Moscow, has told BBC Radio 4's World at One programme the drone strikes in the city came amid “cracks in this regime”.\n“His authority has been weakened because remember, there was supposed to be victory in five minutes or less,” said Khrushcheva, who is professor of international affairs at The New School in New York. “So that didn't happen after 24 February 2022.”\n“We see the cracks in this regime and they're getting wider and wider and wider and then many more forces around that can get very upset about Putin, but that gelling into a position of the elites hasn't happened yet.”\n“The despair is getting more prevalent, and I think it's going to be very hard, much harder now to pretend, at least in Moscow that the war is too, too far away,” adds Khrushcheva, who is the great-granddaughter of former Soviet leader Nikita Khrushchev.\nLISTEN: Ukrainecast on Moscow drone strikes\nAli Abbas Ahmadi\nLive reporter\nI have just been listening to Lucy Hockings and Vitaly Shevchenko record the latest Ukrainecast episode.\nRepeated drone strikes in Moscow - at the Kremlin, in an elite neighbourhood, and now in the city's equivalent of Canary Wharf or Wall Street - are a message to Russia's political elite, says BBC security correspondent Frank Gardner.\n\"The fact that Ukraine can penetrate Russia's air defences should be a worry,\" he says. Even though these strikes are \"minuscule\" compared to Russia's bombardment of Ukraine, they are a reminder to Russians that the war is coming home.\n\"Unfortunately, this is our new reality,\" says Masha, a civilian from Moscow. People in the city just want to live in peace, she says, although she adds she feels safe in Moscow and Muscovites are still going about their daily lives without fear.\nFrank Gardner touches on this too, recalling an anecdote from Zaporizhzhia in south-eastern Ukraine. Gardner says he is amazed that people continue to go to the beach or celebrate weddings even though they hear nightly explosions and know people who have been killed.\nIt's human to carry on with life, he says.\nThe presenters go on to discuss drone warfare, as both Ukraine and Russia are frequently using drones to penetrate enemy lines. It is difficult to estimate how many drones either Kyiv or Moscow possess.\nYou can listen to the full episode when it goes live on BBC Sounds.\nSmall drones could be sidestepping Russian air defences - military expert\nIt's surprising to many that drones can potentially make their way from Ukrainian territory to Moscow, which sits 300 miles (483 km) behind the Russian border, says Professor Justin Bronk, a fellow at the Royal United Services Institute.\nBronk says the use of small drones in warfare means these UAVs (unmanned aerial vehicles) are low-powered and have low fuel consumption engines, which means they can travel far, but slowly, with a light payload - sometimes travelling hundreds or thousands of kilometres.\nHe highlights the difficulties for a lot of air defences designed to counter fast threats like ballistic missiles because their radars tend not to be calibrated to display slow-moving objects - which is how they filter out things like clouds and birds.\n\"For a lot of that flight path, it's very difficult to track those drones in real time and predict where they're going across the border, so it's difficult to defend against,\" he tells BBC Radio 4's World at One programme.\nRussian state TV reports openly on Moscow drone attacks\nLet's now turn to how Russian media are covering the latest events in Moscow.\nRussia's three main TV channels all reported on the drone attacks that hit Moscow in today's early hours, after Russian media had ignored a similar attack on the capital two days earlier, says BBC Monitoring.\nIn its reports, Russian TV channels quoted the Russian defence ministry as saying it had downed two drones over the Moscow region and thwarted an attack by a third - which hit a building in a business district of the capital.\nMeanwhile, an independent Telegram channel said state TV channels had \"stopped hushing up\" the attacks, though it said they previously ignored that a drone had hit a building containing government offices.\nThe same Telegram channel claimed that one state channel had \"censored\" a Telegram post by the Moscow mayor to remove a reference to the previous attack, BBC Monitoring notes.\nUkraine drones 'used in Russia'\nAt least three Ukrainian-made drones have been used inside Russia during the war so far, according to analysis by the New York Times., external\nThe drones have been identified as the Bober, the UJ-22 Airborne and a third model with an undetermined name.\nThe newspaper also says the frequency of these drone attacks have been increasing.\nIt used a range of sources including flight footage analysis of wreckage found on the ground, as well as conducting interviews with experts, to come to its conclusions.\nKyiv has either not commented on or denied any involvement in such attacks, including the latest in Moscow.\nWhat we know about the drone that hit a Russian skyscraper\nPavel Aksenov\nBBC Russian defence reporter\nDetails about the specifications of the drone that attacked the Moscow skyscraper are limited.\nJudging by its size and shape, it was likely initially designed for reconnaissance purposes and later modified into a kamikaze drone, or it might have been developed solely for carrying out attacks deep inside enemy territory.\nIts key characteristic is the radius of up to 1,000km (620 miles), which is more than enough to fly from Ukrainian-controlled territory to Moscow.\nAs of now, there is no clear evidence to indicate where these drones were launched from, but in any case, it spells trouble for the Russian authorities.\nIf launched from behind the front line, it implies the weakness of Russian air defences. If the drones were launched within Russian territory, it suggests that the security services lack control over their own country - launching such a large device is not an easy task and shouldn’t have gone unnoticed.\nStopping these drones is hard: they fly at low altitudes, are made of carbon fibre, and are not easily detected on radar screens.\nThe most effective ways to combat them are rapid-fire anti-aircraft guns, small missiles, or electronic warfare systems. However, surface-to-air missile systems have limited radius, and if the target is in a big city, shooting down a drone may result with debris falling onto residential buildings.\nWhodunnit? It's all a bit murky\nJames Waterhouse\nBBC Ukraine correspondent, reporting from Kyiv\nFrom the perspective of cities like Kyiv, there is an irony about two drone strikes in Russia dominating today’s headlines.\nFor Ukraine, they are a daily reality. For example, as we have reported, a college dormitory in the eastern city of Kharkiv was directly hit overnight.\nThe apparent sight of explosions in Russia’s capital are nevertheless dramatic. Moscow’s claim of its naval fleet again being targeted is also significant.\nSo, whodunnit?\nRussia always blames Ukraine, which rarely claims responsibility.\nKyiv’s appeared to be behind them before, but Moscow is no stranger to a false flag operation, where it stages events to justify future actions.\nRussia’s also recently had to deal with a failed armed mutiny.\nAll a bit murky.\nSkyscraper attack reminds Muscovites their country is at war\nPavel Aksenov\nBBC Russian defence reporter\nThis is not the first time a drone has hit a skyscraper in Moscow’s business district – in fact, this is the second such attack in recent days and at the same target.\nWhile Kyiv does not acknowledge organising these and other drone attacks on Moscow, few observers doubt that these drones were of Ukrainian origin.\nLast September, Ukrainian Armed Forces Chief of Staff Valeriy Zaluzhny said the only way to achieve a turning point in the war is to obtain a means of striking targets deep within the Russian territory. According to him, this is necessary to intensify the feelings of war among Russian citizens.\nUkraine’s President Zelensky made a similar statement after the first strike on Moscow, saying: \"Gradually, the war is returning to the territory of Russia - its symbolic centres and military bases, and this is an inevitable, natural, and absolutely fair process.\"\nTherefore, when a Ukrainian drone reaches Moscow, it has already fulfilled its goal – even if it is shot down by air defence systems, the sound of guns will remind Muscovites that their country is at war.\n'Ukraine has not, and will not, attack civilian vessels' - official\nWe've just heard Ukraine's first response to Moscow's claims that it thwarted a \"terrorist attack\" by Ukrainian drones on Russian civilian transport vessels overnight in the Black Sea.\nAs a reminder, Russia accuses Ukraine of using sea drones to attack both civilian and naval vessels.\nA senior Ukrainian presidential adviser said Kyiv did not attack and will not attack civilian vessels or any other civilian objects in the Black Sea.\n\"Undoubtedly, such statements by Russian officials are fictitious and do not contain even a shred of truth,\" Mykhailo Podolyak, adviser to President Zelensky, told Reuters news agency.\nPodolyak's statement did not deny targeting naval vessels.\nDrone attacks add to Kremlin's paranoia\nFrank Gardner\nSecurity Correspondent\nDrone attacks on the Russian capital, regardless of who launched them and from where, are the most graphic reminder yet to Russians that President Putin’s war is reaping the exact opposite to what it was intended to achieve.\nBack in February 2022, when the invasion was presented as a \"special military operation\", the Kremlin announced it was essential in order to make the homeland safer. That is now patently untrue.\nThe drone attacks hitting Moscow are still miniscule in comparison to the daily bombardments heaped on Ukraine with a lethal combination of Russian and Iranian drones, missiles and glide bombs.\nYet they come on the back of a palpable shift in the strategic chessboard on Russia’s borders. Finland, historically neutral, has joined Nato, Sweden will be next and eventually quite possibly Ukraine.\nPoland, which shares a border with the Russian exclave of Kaliningrad, has embarked on a massive expansion of its armed forces, while Nato is looking to bolster its rapid reaction units in the Baltic states.\nNato is adamant that its actions are precautionary and defensive, that it has no intention of attacking Russia or its ally, Belarus. Yet the net effect of 18 months of attritional war in Ukraine will be to only increase the Kremlin’s paranoia.", "url": "https://www.bbc.com/news/live/world-66367658"}