{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:38", "date_modify": "2025-04-26 03:51:38", "date_publish": "2025-03-05 11:40:50", "description": "The family group of burglars travelled to the North East to target high-value homes, a court hears.", "filename": "news_articles_cjrylve553lo_1745639498.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a85e/live/e6c41600-f9b2-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjrylve553lo_1745639498.html", "title": "'Professional' thieves raided Alexander Isak's home", "title_page": "'Professional' thieves raided Alexander Isak's home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"professional\" gang of burglars stole jewellery and cash worth almost £80,000 from the home of Newcastle United striker Alexander Isak, a court has heard.\nFour members of the same family travelled to the North East to burgle high-value homes last spring, with the Swedish international's home the third to be targeted, Newcastle Crown Court heard.\nThree people who live in Italy have admitted their involvement but Valentino Nikolov, 32, denies burglary.\nThe court heard they had been repeatedly captured on CCTV both at the crime scenes and on the way to and from the burglaries.\nThe gang had already stolen valuables, including a CBE medal worth £1m, from a home in Jesmond, Newcastle, and designer shoes, handbags and jewellery worth £100,000 from a house in Whitburn, South Tyneside, before targeting Mr Isak, prosecutor Dan Cordey said.\n\"This was a professional group of travelling burglars,\" he said, with two members of the three-man team which went into the houses having pleaded guilty.\n\"There is no other candidate for the final man other than [Mr Nikolov],\" Mr Cordey said.\nThe group had been captured on CCTV at various service stations in the North East, including Durham and Scotch Corner, before and after the break-ins, the court heard.\nOn 4 April, the gang returned to the North East from the Birmingham area and broke into the 25-year-old footballer's home in Darras Hall, Ponteland, at about 20:00 BST, the court heard.\nThe house was unoccupied at the time and the striker discovered the burglary when he returned home at about 22:00, Mr Cordey said.\nA glass door had been smashed and an \"untidy search\" of his home carried out, with up to £10,000 in cash and jewellery worth £68,000 stolen, the court heard.\nThe haul included bespoke men's bracelets, necklaces and rings from Frost of London, while the star's Audi RS6 estate car was taken and later found abandoned.\nThe gang also took a safe that had been left by a previous occupant but it was empty, the trial was told.\nCCTV footage from inside the home captured three people in the house, one of whom, Mr Nikolov's brother Giacomo, was seen wearing distinctive tracksuit bottoms with a Paris Saint Germain badge.\nThe car used by the gang was traced to Walsall, with officers finding the number plate had been swapped for one stolen in Chester-le-Street, the court heard.\nGloves and headtorches used in the burglaries were found in the car and Giacomo Nikolov was wearing a Rolex which had been stolen in one of the raids, Mr Cordey said.\nValentino Nikolov, of Tew Park Road, Birmingham, is representing himself at the trial and requires an Italian interpreter.", "url": "https://www.bbc.co.uk/news/articles/cjrylve553lo"}