{"authors": ["Tom Symonds", "www.facebook.com"], "date_download": "2025-04-26 06:26:39", "date_modify": "2025-04-26 06:26:39", "date_publish": "2025-02-28 20:39:11", "description": "Police say they want to say more about cases when accusations of a cover-up could result in violence.", "filename": "news_articles_c4gd8l1945eo_1745648799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e140/live/a1b5a480-f605-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gd8l1945eo_1745648799.html", "title": "Police want power to release more details on some cases", "title_page": "Police want power to release more details on some cases to prevent misinformation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police want the freedom to release more details of some investigations in an effort to prevent misinformation that could result in threats to public safety or national security.\nIn a submission to a review of contempt of court laws, three national policing bodies have said that they should be allowed to say more when a \"tipping point\" is reached and accusations of a cover-up could result in violence.\nIt follows the Southport knife attack in July, when misinformation about the attacker snowballed on social media, which Merseyside Police did not initially counter, leading to riots across the UK.\nCurrent laws prevent certain details in ongoing criminal cases being published before a trial, so that it does not prejudice the jury.\nMerseyside Police was criticised for not giving early details of Axel Rudakubana, the man later convicted of the murders of three young girls in Southport, when posts on social media falsely suggested he was an asylum seeker and potentially an Islamist extremist.\nThe early police communications strategy was based on advice from prosecutors, the force's chief previously said.\nNow, there is a review in England and Wales examining the strict laws on what can be published during an ongoing criminal investigation and how the justice system should respond to breaches.\nIn its submission to the review, the National Police Chiefs' Council, College of Policing and Counter Terrorism Policing said the criminal justice system should reach a \"collective view\" of how to balance the need for a defendant to get a fair trial and the need to maintain public order.\n\"We would welcome recognition of the role unchecked misinformation and disinformation about high profile criminal incidents, that rightly concern the public, can have in creating a febrile environment where the risks of disorder breaking out is higher,\" the submissions stated.\n\"We would like the legal framework to acknowledge that this risk exists.\n\"We do believe there is room to offer stronger reassurance in cases where a tipping point has been reached and where releasing information that could help counter misinformation and disinformation to address public safety risks would be helpful.\n\"Flexibility is required to mitigate the clear risks to public safety.\"\nThe police submission points out that in other countries more information is made public.\nIn August 2024, Austrian police disrupted a plot to attack a Taylor Swift concert in Vienna.\nThey made public:\nDetails of chemical substances and devices found in the main suspect's home\nDetails of the suspects' nationalities\nDetails of the suspects' employment\nDetails of the arrest and that one of the suspects did not resist arrest\nA summary of what the suspects had said when interviewed by police, including discussing their plans to kill and that they had uploaded to the internet an oath of allegiance to ISIS\nDetails of the authorities' views on the suspects' mindset and ideology that had inspired them\n\"When the public in the UK look at media reporting of cases like this and see that the Austrian public is being given information that policing in this country would say cannot be shared at that stage in order not to prejudice a trial - they have every right to wonder if this is true,\" the submission said.\nIn the Southport case, when the killer was arrested, very little information was given.\nFalse online rumours spread online hours after the attack that the perpetrator had been an asylum seeker and potentially an Islamist extremist, and a violent protest took place close to the scene the following day.\nRiots, in which mosques and hotels housing migrants were attacked, soon spread around the country.\nIn a press statement at 17:25 on 29 July 2024, the day of the murders, the police said only that a \"17-year-old male from Banks\" had been arrested in connection with the murders.\nThe Merseyside Chief Constable Serena Kennedy wanted to reveal the suspect's religion to counter suggestions that what had happened had been a terrorist attack by an Islamic extremist.\nShe told the Home Affairs Select Committee on Tuesday that she explained to the deputy regional prosecutor for the Crown Prosecution Service: \"I need to help my colleagues out, my fellow chief constables. Some of the streets of the UK are on fire and I need to help them as much as I can.\"\nBut she said the CPS were concerned that including the detail about the suspect's religion could interfere with a future criminal case.\nLater the national CPS said it was happy to include the religion detail, but it was too late.\nMs Kennedy told MPs: \"By that time, we were downstairs and we were preparing for the press conference so that was not seen by ourselves.\"\nThe police submission to the Law Commission review also calls for a tougher line to be taken with \"individuals with significant public profiles, some in elected office\" who use their platform to \"fuel narratives of conspiracy and cover-up\".\nCorrection 10 April 2025: This article previously stated that the review would examine Britain's contempt of court laws. This has now been amended to make clear that the review impacts only England and Wales.", "url": "https://www.bbc.co.uk/news/articles/c4gd8l1945eo"}