{"authors": ["James Landale", "www.facebook.com"], "date_download": "2025-04-26 06:17:34", "date_modify": "2025-04-26 06:17:34", "date_publish": "2025-03-01 18:30:48", "description": "Is the US vice-president doing Trump's bidding or looking to the future?", "filename": "news_articles_cewkg71d8rlo_1745648254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3594/live/1dd22500-f6cb-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkg71d8rlo_1745648254.html", "title": "Vance took the lead attacking Zelensky. Why?", "title_page": "Vance took the lead attacking Zelensky. Why? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "JD Vance's remarkable dressing down of Volodymyr Zelensky in the Oval Office on Friday showed the US vice-president unafraid to take centre stage as an attack dog, rather than serve like some of his predecessors as a self-effacing political understudy.\nIt was Vance who led the attack on Zelensky before Donald Trump joined the fray at the White House in a meeting that had been cordial until the vice-president spoke up to laud the president for seeking what he described as a diplomatic solution to the Ukraine-Russia war.\n\"What kind of diplomacy, JD, you are speaking about?\" said Zelensky, who has been critical of direct talks between Washington and Moscow. \"What do you mean?\"\n\"I'm talking about the kind of diplomacy that's going to end the destruction of your country,\" Vance responded, tearing into the stunned Ukrainian leader.\n\"Mr President, with respect, I think it's disrespectful for you to come into the Oval Office to try to litigate this in front of the American media.\"\nHe also accused Zelensky of having campaigned on behalf of Democrats during the 2024 presidential election. The Ukrainian leader visited a munitions factory in the critical swing state of Pennsylvania last September and met Trump's rival, Kamala Harris, at the White House.\nVance's upbraiding of Zelensky drew broad support among Republicans.\n\"I was very proud of JD Vance standing up for our country,\" said South Carolina Senator Lindsey Graham, a longtime advocate for Ukraine and a foreign policy hawk. He suggested Zelensky should resign.\nAlabama Senator Tommy Tuberville referred to Zelensky as \"that Ukrainian weasel\".\nCongressman Mike Lawler of New York was more measured, saying the meeting was \"a missed opportunity for both the United States and Ukraine\".\nVance's remarkable attack on a visiting head of state is not typical for a US vice-president.\nTheir job is often - but not always - to help get the president elected and then sit quietly at their boss's side. To be a loyal lieutenant representing the president on foreign trips - standing by, one heartbeat, so they say, from the presidency.\nThe contrast with Trump's first VP, the much more mild-mannered Mike Pence, could not be greater.\nBut Vance - who is widely seen as serving to articulate the rationale behind Trump's foreign policy gut instincts - has long been outspokenly sceptical of US aid to Ukraine.\nWhen he was running for the Ohio Senate in 2022, Vance told a podcast: \"I've got to be honest with you. I don't really care what happens to Ukraine one way or the other.\"\nThe vice-president derided Trump as an idiot eight years ago, before a political evolution that culminated in him becoming heir apparent to the president's Make America Great Again movement.\nDespite Vance's popularity among conservative voters, Trump recently said in a Fox News interview that it was \"too early\" to tell whether the vice-president would be next-in-line to run for president in 2028.\nUndeterred, Vance seems to be developing a role as a political brawler for Trump, going even further than the president in his outspoken criticism of the administration's foes.\nOne common thread is that many victims of Vance's tongue-lashing are America's allies.\nIt began at the Munich Security Conference last month, a regular port of call for a US vice-president. Kamala Harris would frequently make unmemorable speeches there.\nBut Vance used the occasion to launch a blistering assault on the state of European democracy, accusing continental leaders of censoring free speech and failing to control immigration.\n\"If you're running in fear of your own voters, there is nothing America can do for you,\" he said.\nThe audience of politicians, generals and diplomats was horrified.\nThis was not the usual - and now widely accepted - argument that Europe should do more to pay for its own defence and security.\nThis was a full-blown ideological assault - a sign that the US under Mr Trump is not just pivoting away from Europe, shifting its security focus to China, but is also seeking to promote its own Trump-style populism on the European continent.\nNot for nothing did Vance have dinner after his speech with the leadership of Germany's far-right AfD party.\nHis speech provoked a backlash from European leaders, writers and academics.\nYet Vance chose to take them on online, engaging in detailed exchanges on X with several, including the historian, Niall Ferguson.\nVance accused him of \"moralistic garbage\", \"historical illiteracy\" and - worst of all - of being a \"globalist\".\nAnd if that was not enough, Vance even chose to have a go at the UK prime minister in the Oval Office himself earlier this week.\nOut of nowhere, he told Sir Keir Starmer that \"there have been infringements on free speech that actually affect not just the British - of course what the British do in their own country is up to them - but also affect American technology companies and, by extension, American citizens\".\nThe prime minister pushed back firmly, saying \"in relation to free speech in the UK, I'm very proud of our history there… We've had free speech for a very, very long time in the United Kingdom and it will last for a very, very long time\".\nThis was an echo of the criticism Vance made in Munich, railing against European regulations on artificial intelligence and social media platforms.\nThe aim is to tackle disinformation and hate speech that can foment unrest and radicalise people. Vance sees it as a threat to political fellow travellers and US commercial interests, especially in big tech.\nSeveral questions present themselves. Was Vance's attack on Zelensky premeditated, as some diplomats believe?\nWhite House sources have told US papers it was not.\nIs Vance's new role emerging at Trump's behest, sharing the load with Elon Musk to dish out punishment to the president's opponents?\nOr is Vance freelancing, already sketching out a role that will form the basis of an election campaign in three years' time when Trump will not be able to stand again?\nWhatever the answers to those questions, Vance is emerging as more than just Trump's number two.", "url": "https://www.bbc.co.uk/news/articles/cewkg71d8rlo"}