{"authors": ["Helen Burchell", "www.facebook.com"], "date_download": "2025-04-26 06:36:37", "date_modify": "2025-04-26 06:36:37", "date_publish": "2025-02-26 06:49:23", "description": "A man fed up with the state of a road says the large hole has been there for months.", "filename": "news_articles_c234vr5nn57o_1745649397.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/507f/live/84b61b30-f3b2-11ef-9963-97f48f5bf5d5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c234vr5nn57o_1745649397.html", "title": "Fake legs used as a pointer for Cambridgeshire pothole", "title_page": "Fake legs used as a pointer for Cambridgeshire pothole - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man fed up with the state of a road near his village has poked fun at a large pothole, by putting a pair of fake legs in the huge puddle it has created.\nIt is one of several that have formed on Haverhill Road in the Cambridgeshire village of Castle Camps, close to the Suffolk border.\nJames Coxall said the crater had been there for eight months and although it was not a busy road, if there were oncoming vehicles you would \"have to either stop, or hit the pothole\".\nCambridgeshire County Council said one of its highways officers would inspect the road and \"repairs will be made as required\".\nOn Sunday, the family turned some old clothes and rags into a pair of legs, clothed in jeans and colourful shoes.\n\"The shoes were going to charity anyway, so we thought we'd give them an outing first,\" said Mr Coxall.\n\"We stuffed the jeans with old rags and I used some wood to keep the legs sturdy and upright.\"\nHe placed the creation in the puddle, with the feet sticking out at the top, and weighed it all down with a brick.\nMr Coxall posted a photo of it on the Facebook group Odd Things Around Cambridge, external and another local Haverhill group.\n\"It's just a bit of fun, and I've had lots of messages about it,\" he said.\n\"People seem to like it around here, but then, I am known as a bit of a joker.\"\nThe county council urged people to use its online pothole reporting tool, external.", "url": "https://www.bbc.co.uk/news/articles/c234vr5nn57o"}