{"authors": ["Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 04:41:29", "date_modify": "2025-04-26 04:41:29", "date_publish": "2025-03-02 07:08:03", "description": "Michael Fleet says his books were inspired by an article he read about a \"champion\" police dog.", "filename": "news_articles_cg700d7xz10o_1745642489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ff47/live/4108e9e0-f604-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg700d7xz10o_1745642489.html", "title": "Author hopes to raise money to support 'wonderful' police dogs", "title_page": "Author hopes to raise money to support 'wonderful' police dogs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new series of children's books is helping raise money for retired police dogs across the West of England.\nAuthor Michael Fleet said he was inspired to write \"The Adventures of Bruin\" after wondering what happened to prospective police dogs if they \"don't make the grade\".\nThe titular character of his series was bred to be a police dog but is \"too kind and gentle\" so is adopted.\nA donation from each book goes to W.A.G.s Retired Police Dogs, a charity that supports retired dogs from from Wiltshire, Avon and Somerset, and Gloucestershire police forces.\nAlthough Bruin, a German Shepherd, is brought home by a family, he still has the instincts of a police dog.\nMr Fleet, who lives in Cornwall, was inspired to write the series after reading a newspaper article.\n\"A champion police dog in Germany had won all sorts of awards but then it became too gentle and kind to do its police work and was put up for adoption,\" he said.\nBut Bruin shares some characteristics with a dog even closer to Mr Fleet's heart than police dogs - his cavapoo named Maisie - as they both love going to the beach.\n\"One of the books actually concerns the problem of fly tipping; the children in that book investigate a nasty case in a lane on the way down to the beach.\n\"It leads them to all sorts of dangers and adventures.\"\nMr Fleet chose to help W.A.G.s as it is \"the closest charity\" to him that supports \"wonderful\" police dogs.\n\"W.A.G.s helps retired, or in the case of Bruin, failed police dogs, ones which don't make the grade,\" he said.\n\"They help out with finding new families for them and then helping the families, particularly with vet bills.\"\nThe books have been published in a font that is more accessible to readers with dyslexia, which was created by teacher and specialist Alice Frendo, who felt other fonts were considered \"babyish\" by some readers and isolated those with dyslexia.\nWiltshire artist Claire S Bicknell illustrated and designed the books with pastel tinted pages, so the series is \"as accessible as possible\", she said.", "url": "https://www.bbc.co.uk/news/articles/cg700d7xz10o"}