{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:38:49", "date_modify": "2025-04-26 06:38:49", "date_publish": "2025-03-02 17:05:45", "description": "The world records achieved to celebrate St David's Day", "filename": "news_articles_c70e685z4gno_1745649529.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c9a/live/63ce96e0-f781-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70e685z4gno_1745649529.html", "title": "St David's Day: Flurry of Welsh Guinness World Records broken", "title_page": "St David's Day: Flurry of Welsh Guinness World Records broken  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From pulling a steam train 20 meters to typing Wales' longest place name with one finger, a flurry of Guinness World Records were broken on Saturday to mark St David's Day.\nSue Taylor-Franklin and Sam Taylor, from Aberdare, Rhondda Cynon Taf, set the female record for the fastest time to pull a narrow-gauge steam train 20m.\nAfter being allowed a second attempt, the married couple completed the feat in a record-breaking 40.53 seconds.\n\"We're so very proud our achievement but it was cold day out\", said Sue, 56.\nSue and Sam attempted the record in Llanberis, Gwynedd, competing against two other couples of women.\n\"We went last and because we got it closest were allowed to compete again,\" said Sue.\nShe said that the achievement proves that you do not have to be young to get started in the gym.\n\"We didn't start lifting until quite late, I started when I was 50 and Sam started in her 40s, so it just shows its never too late,\" she said.\nElsewhere, RuPaul's Drag Race UK star Marmalade set the record for the most amount of flowers on one dress.\nThe dress, adorned with daffodils, had a total of 1,862 real flowers.\nPosting on Instagram, Marmalade thanked Blas y Tir, who supplied the flowers for the dress.\n\"Thrilled to say that I have officially set the Guinness World Record for the most flowers on a dress with a total of 1,862 flowers!\"", "url": "https://www.bbc.co.uk/news/articles/c70e685z4gno"}