{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:27:11", "date_modify": "2025-04-26 07:27:11", "date_publish": "2025-02-27 20:35:56", "description": "A 40-year-old man has been found guilty of the murder of a mother-of-two in her home in Dublin in May 2022.", "filename": "news_articles_cy833v895e1o_1745652431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e22d/live/6afdfdf0-f53f-11ef-938c-4727a1e64ce2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy833v895e1o_1745652431.html", "title": "Man found guilty of murder of woman in Dublin", "title_page": "Lisa Thompson: Man found guilty of murder of woman in Dublin  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 40-year-old man has been found guilty of the murder of a mother-of two in her home in Ballymun in Dublin in May 2022.\nBrian McHugh of Cairn Court, Poppintree in Ballymun, had pleaded not guilty to murdering Lisa Thompson, 52, at the house in Sandyhill Gardens, in Dublin.\nShe had been stabbed 11 times in the chest and strangled with a blind cord.\nA forensic scientist told the Central Criminal Court trial that McHugh's DNA was found on the cord.\nWhen asked about the presence of his DNA on the cord, McHugh told gardai that he had been \"in and out\" of Ms Thompson's house \"for the last three years\".\nThe trial also heard evidence that Ms Thompson had been dealing prescription drugs from her home and that she had been in a brief relationship with McHugh.\nThe prosecution argued that McHugh was seen on CCTV in the early hours of the morning of 9 May near Ms Thompson's house.\nDefence counsel for McHugh submitted that this was not \"the neat case wrapped up in a bow\" which the prosecution had presented to the jury.\nThe 12 jurors took three hours and 24 minutes to unanimously reject McHugh's defence.\nThe judge, Ms Justice Karen O'Connor, offered her \"sincere condolences\" to the Thompson family and thanked them for their dignity throughout the case.\n\"I cannot imagine your pain and what you have suffered in terms of your grief,\" she said.\nMcHugh will be sentenced to the mandatory term of life in prison on 10 March.\nOn that date, the Thompson family will have an opportunity to make a statement to the court about the impact Lisa's death has had on their lives.", "url": "https://www.bbc.co.uk/news/articles/cy833v895e1o"}