{"authors": ["Ian Shoesmith", "www.facebook.com"], "date_download": "2025-04-26 04:41:50", "date_modify": "2025-04-26 04:41:50", "date_publish": "2025-03-02 06:58:58", "description": "Developers believe hosting golf's most high-profile team event would benefit Bolton's economy for years.", "filename": "news_articles_c5y6yl1xe32o_1745642510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22dd/live/ffdef010-ed28-11ef-b008-3d63fe428927.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y6yl1xe32o_1745642510.html", "title": "Ryder Cup 2035: Can Bolton really host golf's biggest team event?", "title_page": "Ryder Cup 2035: Can Bolton really host golf's biggest team event? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"If you build it, he will come.\"\nThose famous whispered words inspired Kevin Costner's farmer character in the film Field of Dreams to turn a cornfield in rural Iowa into a baseball field.\nBut can a similar dream come true in Bolton, where there are ambitious plans to host one of golf's most prestigious events, the Ryder Cup?\nThe Ryder Cup, held every two years, is the biggest team prize in a sport dominated by individualism.\nOver the course of three days, it has the best golfers from Europe taking on the cream of the United States crop.\nThe two continents take it in turns to host the event, with highly partisan fans making the atmosphere more like what you would encounter at a football World Cup.\nWhile crowds do flock to major golf tournaments like The Open, they rarely capture the public imagination as much as the Ryder Cup does.\nMaybe it is easier to support a team rather than an individual. Deafening chants of \"U-S-A\" and \"Olé, Olé, Olé\" would suggest so.\nSome golfing traditionalists may bristle at rowdy crowds cheering whenever an opposing team's golfer misses a simple putt or slices a tee shot into the water.\nBut it certainly makes for captivating television.\nIt is why the 1991 Ryder Cup, held at Kiawah Island in South Carolina, will forever be known as The War on the Shore.\nGolfers, so used to competing only for themselves, are honoured to represent their country or continent.\nFor a few days at least, they are turned into team-mates.\nFriendships are forged, sporting reputations are enhanced or destroyed.\nIt all began with a golf-mad seed merchant from St Albans in Hertfordshire.\nAttending a qualifying tournament before the 1926 Open Championship, Samuel Ryder was dismayed to see American and British golfers standing apart from each other.\nIn an attempt to inject a touch of friendly rivalry, he set up a competition between the two factions.\nA prize fund of £5 (worth £259 in today's money) for the winning team was offered, along with a post-tournament buffet of champagne and chicken sandwiches.\nPossibly encouraged by Britain's victory, Scotsman George Duncan suggested making it a regular event... and so it began.\nThe first official Ryder Cup was played in 1927, in Worcester, Massachusetts.\nPossibly still recovering from their week-long passage across the Atlantic, the Great Britain and Ireland team, led by Ted Ray, were thrashed by their American hosts, who were captained by Walter Hagen.\nDecades of US domination ensued.\nOne-sided sporting competitions are not a great way to tempt the crowds, though, and so Team Great Britain and Ireland became Team Europe in 1979.\nIn the years that followed, the Ryder Cup became a real contest.\nFans on both sides of the Atlantic were increasingly hooked as great European players like Spain's Seve Ballesteros and German Bernhard Langer became household names.\nBolton wants to transform currently undeveloped parkland on the outskirts of the town into a world-class golf course capable of hosting the Ryder Cup when it is next played in England.\nIts bid for the 2035 event has been put together by developers Peel Land and supported by both Bolton Council and the Greater Manchester Combined Authority.\nPeel Land has planning permission for the £240m project to build a golf complex and more than 1,000 new homes on mainly green belt land at Hulton Park, near Westhoughton.\nThe park forms part of an estate owned for more than 700 years by the Hulton dynasty. After falling into neglect, it was bought by Peel in 2010.\nIt believes its plans would ultimately benefit the region’s economy by £1.6bn and create an international venue capable of hosting a wide range of events.\nPeel argues hundreds of jobs would be generated.\nBolton Council initially approved development plans for Hulton Park in 2018, despite hundreds of objections.\nIn 2020, the government said it could go ahead if the proposed golf course won a bid to host the Ryder Cup in either 2031 or 2035.\nWith a Spanish resort landing the former event, Bolton's hopes now rest upon 2035.\nWhile the Ryder Cup was historically played in England every four years, the country has not hosted it since 2002, when golf fans flocked to The Belfry in the West Midlands.\nSubsequent European editions have taken place at courses across the continent.\nThere is a strong expectation in the golfing community a course in England will be granted the honour of hosting the 2035 Ryder Cup.\nRichard Knight, on behalf of Peel Land, said a decision about who would host the 2035 Ryder Cup was not expected \"until next year at the very earliest\".\nAt a recent council planning meeting, he said: \"We remain shortlisted by UK Sport and Ryder Cup Europe, and an update... from UK Sport officials confirms that the selection process in now moving forward again.\"\nAccording to Golf Monthly magazine, external, the Ryder Cup is jointly administered by the PGA of America and Ryder Cup Europe, with each organisation taking it in turns to pick host venues.\nThe magazine said Ryder Cup Europe was 60% owned by the PGA European Tour, with the PGA of Great Britain & Ireland and the PGAs of Europe each having a 20% stake.\nWhen it comes to choosing host venues, Golf Monthly said five main factors were considered:\nIf the venue is a world-class golf facility\nIf the venue has requisite infrastructure suitable for staging an international event\nIf the host country has demonstrable support from its government, golfing community and private sector\nAvailable commercial opportunities\nThe country's contribution made to the development of golf\nLeaving aside the possibility of bids from across the continent, Bolton's domestic rivals are thought to include the London Golf Club, external and the Luton Hoo resort in Bedfordshire.\nPerhaps Bolton needs to reverse that Field of Dreams quote.\nWe will build it, but only if they come...\nAdditional reporting by Chris Gee, Local Democracy Reporting Service", "url": "https://www.bbc.co.uk/news/articles/c5y6yl1xe32o"}