{"authors": ["Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 07:42:37", "date_modify": "2025-04-26 07:42:37", "date_publish": "2025-02-26 19:31:28", "description": "Gary Lineker, Anita Rani, Riz Ahmed and Miriam Margolyes are among the signatories on the open letter.", "filename": "news_articles_c3374xm65mvo_1745653357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a100/live/1c2af1c0-f467-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3374xm65mvo_1745653357.html", "title": "BBC criticised by 500 media figures for pulling Gaza documentary", "title_page": "BBC criticised by 500 media figures for pulling Gaza documentary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gary Lineker, Anita Rani, Riz Ahmed and Miriam Margolyes are among more than 500 media figures who have criticised the BBC's decision to pull a documentary about children's lives in Gaza.\nThe BBC has said it removed Gaza: How to Survive a War Zone from iPlayer while it carried out \"further due diligence\" after discovering its 13-year-old narrator was the son of a Hamas official.\nThe open letter, published by Artists for Palestine UK, criticised what the signatories said was a \"racist\" and \"dehumanising\" campaign targeting the documentary.\nIt called on the BBC to \"reject attempts to have the documentary permanently removed or subjected to undue disavowals\".\nThe corporation said it had not been informed of the teenager's family connection in advance by the film's production company.\nThe BBC's board is expected to discuss the film on Thursday.\nThe issue was also raised in the Commons by the Conservative shadow culture secretary Stuart Andrew, who accused the BBC of falling \"far short\" of its usual editorial standards and asked whether Hamas had benefitted financially from the film.\nResponding, Culture Secretary Lisa Nandy said she had held discussions with the BBC's director-general Tim Davie about the broadcast.\n\"I also sought cast iron assurances that no money paid has fallen into the hands of Hamas and that the utmost care was taken to ensure that was the case,\" she said.\n\"I expect to be kept informed about the findings of the internal BBC investigation, and I will be happy to update [Andrew] and colleagues across the House on its progress.\"\nThe letter, sent to Mr Davie, BBC board chair Samir Shah, chief content officer Charlotte Moore, and CEO of BBC News Deborah Turness, said the film offered an \"all-too-rare perspective on the lived experiences of Palestinian children\".\nIt reads: \"Beneath this political football are children who are in the most dire circumstances of their young lives. This is what must remain at the heart of this discussion.\n\"As programme-makers, we are extremely alarmed by the intervention of partisan political actors on this issue, and what this means for the future of broadcasting in this country.\"\nThe letter's other signatories include directors Ken Loach and Mike Leigh, actors Khalid Abdalla and Ruth Negga, musician Nitin Sawhney and Sarah Agha, who presented the BBC documentary series The Holy Land And Us: Our Untold Stories.\nA BBC spokesperson said: \"Gaza: How to Survive a Warzone features important stories we think should be told - those of the experiences of children in Gaza.\n\"There have been continuing questions raised about the programme and in the light of these, we are conducting further due diligence with the production company. The programme will not be available on iPlayer while this is taking place.\"", "url": "https://www.bbc.co.uk/news/articles/c3374xm65mvo"}