{"authors": ["Rachel Russell", "www.facebook.com"], "date_download": "2025-04-26 04:21:42", "date_modify": "2025-04-26 04:21:42", "date_publish": "2025-03-03 14:24:54", "description": "Jonathan Evison knew something was wrong when he needed to go to the toilet multiple times a night.", "filename": "news_articles_c8e76j9x1pdo_1745641302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b36a/live/446c4780-f825-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e76j9x1pdo_1745641302.html", "title": "Humberside police boss shares cancer story to raise awareness", "title_page": "Humberside police boss shares cancer story to raise awareness - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police and crime commissioner (PCC) has shared his experience of having prostate cancer to help other men spot symptoms before its too late.\nJonathan Evison said he was diagnosed in the summer of 2023 after realising something was wrong when he needed to go to the toilet multiple times a night and had blood in his urine.\nHumberside Police said about 11,300 men in East Yorkshire and northern Lincolnshire were living with or after prostate cancer, with over 1,100 new diagnoses each year.\nMr Evision, the PCC for Humberside, said he had 20 rounds of external beam radiation last year and was declared cancer-free in December.\n\"Being diagnosed with prostate cancer was a life-changing moment for me,\" he said.\n\"My father had an enlarged prostate so I was aware of the symptoms and what to look out for.\n\"I started noticing something may be wrong when I was getting up multiple times during the night to go to the toilet, and once noticed blood in my urine.\n\"I now want to share my story and highlight the importance of early detection and encourage men to get checked.\"\nProstate cancer is the most common cancer in England, with 1 in 8 men diagnosed with it in their lifetime, according to Prostate Cancer UK., external", "url": "https://www.bbc.co.uk/news/articles/c8e76j9x1pdo"}