{"authors": ["Adam Laver", "www.facebook.com"], "date_download": "2025-04-26 08:13:47", "date_modify": "2025-04-26 08:13:47", "date_publish": "2025-02-26 11:14:31", "description": "Pick-up was parked at base when it had winch and blue lights removed by thieves.", "filename": "news_articles_ckgz0ez4z5do_1745655227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/925f/live/ec18f6f0-f41e-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz0ez4z5do_1745655227.html", "title": "Calder Valley: Mountain rescue team's 4x4 stripped of parts", "title_page": "Calder Valley: Mountain rescue team's 4x4 stripped of parts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vehicle belonging to a mountain rescue team has been stripped of its parts by thieves.\nCalder Valley Search & Rescue (CVSRT) said \"essential components\" such as a winch, blue lights and underbody protection had been removed from the emergency response ambulance at one of their bases.\nThe incident happened on 14 February and the team shared images of damage to the Toyota Hilux pick-up.\nIn a statement, CVSRT said: \"This unfortunate incident has temporarily affected our operational readiness, but we remain committed to ensuring that our lifesaving service continues without interruption.\"\nThe 4x4 was being stored securely at the time, the team added.\nThe statement continued: \"The affected vehicle plays a crucial role in our ability to respond rapidly to those in need, often in the most challenging and life-threatening conditions.\n\"While we are working hard to repair and replace the stolen parts, we are grateful for the resilience and adaptability of our team, who remain fully prepared to respond to emergencies.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/ckgz0ez4z5do"}