{"authors": ["Mike McBride", "www.facebook.com"], "date_download": "2025-04-26 04:18:26", "date_modify": "2025-04-26 04:18:26", "date_publish": "2025-03-04 06:33:16", "description": "Funding of £20m each for Coleraine and Derry follows a previous commitment that had been suspended.", "filename": "news_articles_c3rnpezp3exo_1745641106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e91/live/0eba1fd0-f86c-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnpezp3exo_1745641106.html", "title": "Londonderry and Coleraine to get £40m in neighbourhood funding", "title_page": "Londonderry and Coleraine to get £40m in neighbourhood funding    - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Londonderry and Coleraine are to receive £40m between them as part of the government's Plan for Neighbourhoods, which follows on from a previous commitment made last year.\nIn April 2024, it was announced as part of the Conservative government's budget that they would each receive £20m over 10 years, as part of the Towns Fund.\nThe funding earmarked for the regeneration of both areas was then suspended by the newly elected Labour government last year.\nHowever, the government has now confirmed that both Coleraine and Derry will receive £20m each, along with 75 other areas across the UK.\nIn a statement, the Ministry of Housing, Communities and Local Government in the UK said that the funding would \"help tackle deprivation and turbocharge growth for each area\".\nThey added that this announcement \"is in contrast to unfunded pledges from the previous government\".\nFunding will be released from April 2025 with delivery investment commencing in 2026, according to the department.\nAngela Rayner, the Secretary of State for Housing, Communities and Local Government and deputy prime minister, said too many neighbourhoods have been \"starved of investment, despite their potential to thrive and grow\".\n\"Communities across the UK have so much to offer – rich cultural capital, unique heritage, but most of all, an understanding of their own neighbourhood,\" Rayner said.\n\"We will do things differently, our fully funded Plan for Neighbourhoods puts local people in the driving seat of their potential, having control of where the Whitehall cash goes – what issues they want to tackle, where they want to regenerate and what growth they want turbocharge.\"\nThe Secretary of State for Northern Ireland, Hilary Benn MP, said the funding will be a \"welcome boost\" for those communities.\n\"This government is committed to supporting growth and public service transformation in Northern Ireland, and through the Budget we are delivering the largest real-terms funding settlement for Northern Ireland since devolution.\n\"In each area, the government will support the establishment of a new 'Neighbourhood Board', bringing together residents, local businesses, and grassroots campaigners to draw up and implement a new vision for their neighbourhood.\n\"The government's Plan for Neighbourhoods' ultimate aim is to create thriving places, strengthen communities, and empower local people to take back control in towns across the country.\"\nWhen the new government came in and in the run up to the Budget, they were looking at various spending pledges that the Conservatives had made and said it looked like some of them did not have the money to back them up – the Towns Fund came under that.\nThe government has decided to slightly refocus what the Towns Fund does and also give that a new name: the Plan for Neighbourhoods.\nThe amount of money is the same, the aim is much the same, which is to fund reasonably small neighbourhood-level interventions.\nIt is not big infrastructure projects like the City Deal. It is things like traffic-calming measures, CCTV, or sprucing up a run down shopping street.\nThe way they will be governed is much the same as well: a board appointed who will decide what projects they would like to pursue and then they will be agreed with government.\nThe way Labour say this has changed is that the scope of projects which you can fund from this money is wider and also they want there to be a wider range of consultation, a wider range of people sitting on the board.\nBut the general thrust of it is the same, £20m to spend over 10 years on fairly small-scale projects.", "url": "https://www.bbc.co.uk/news/articles/c3rnpezp3exo"}