{"authors": ["Nicholas Bourne", "www.facebook.com"], "date_download": "2025-04-26 06:40:50", "date_modify": "2025-04-26 06:40:50", "date_publish": "2025-03-02 13:30:31", "description": "\"Politics in the decision-making\" led to different in rules in Wales and England, says Simon Hart.", "filename": "news_articles_cdjy9e28p7ko_1745649650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/173a/live/b9bb1800-f752-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjy9e28p7ko_1745649650.html", "title": "Covid rules should have been same across UK, Simon Hart says", "title_page": "Covid rules should have been same across UK, Simon Hart says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rules to try to limit the spread of Covid during the pandemic should have been the same across the UK, a former cabinet minister has said.\nSimon Hart has claimed \"politics in the decision-making\" led to different restrictions on things like wearing face masks in Wales and England after being agreed by their respective governments.\n\"I just didn't feel that decisions were being made purely on the basis of disease control and risk management,\" said the former Welsh secretary and MP.\nA Welsh government spokesperson said: \"All decisions by Welsh ministers related to Covid-19 were based on evidence and always made in the best interests of Wales.\"\n\"I do think the UK wide consistency would have been much, much simpler from the point of view of trying to impart a very clear but important message to residents of the UK,\" he said.\nHart was the secretary of state for Wales from December 2019 to July 2022 and a Conservative MP for Carmarthen West and South Pembrokeshire from 2010 to 2024.\nHe also served as parliamentary secretary to the Treasury [chief whip] between October 2022 and July 2024 and has just published his book, Ungovernable: The Political Diaries of a Chief Whip.\nHart told BBC Radio Wales' Sunday Supplement it included a \"rather depressing reminder of some of the difficulties that we all encountered\" during the pandemic and \"if we ever have to do that kind of thing again, is there a better way of doing it?\"\nHe said it was \"made much more complicated by the fact that there were different rules in different places\".\nRestrictions were drawn up by a Conservative government at Westminster and in Wales the rules were set by a Labour government in the Senedd.\nRestrictions were imposed for more than two years after lockdown began in March 2020.\nBy January 2022, a lecturer in psychology said people were suffering \"fatigue\" and \"uncertainty\" over the varying Covid rules.\nAt that point, nightclubs were closed in Wales, with limits on hospitality, sports events and who people could meet, but in England restrictions were much less severe.", "url": "https://www.bbc.co.uk/news/articles/cdjy9e28p7ko"}