{"authors": ["Clare Ainsworth", "www.facebook.com"], "date_download": "2025-04-26 07:04:51", "date_modify": "2025-04-26 07:04:51", "date_publish": "2025-02-28 06:33:57", "description": "The captain of the UK team says the Invictus Games were key to restoring his mental health.", "filename": "news_articles_crmjjk2zw2xo_1745651091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a6bd/live/09f5af70-f536-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjjk2zw2xo_1745651091.html", "title": "'Invictus Games saved my life after PTSD'", "title_page": "'Invictus Games saved my life after PTSD' says RAF veteran - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A veteran who suffered from Post Traumatic Stress Disorder (PTSD) has told how taking part in the Invictus Games saved his life.\nRAF veteran Steve Hooper, from Sherford in Devon, was diagnosed with PTSD after he witnessed horrific scenes while working as an ambulance driver in Iraq.\nThe 41-year-old has just returned from the Invictus Games in Canada where he captained the UK team and competed in four different events, winning a medal and gaining personal bests.\nHe said the games were key to restoring his mental health. \"Saving lives is part of the slogan for the games and it has certainly saved mine,\" he said.\nMr Hooper said his recovery only began when a friend suggested he apply for Team UK at the Invictus Games following his medical discharge from the forces in 2021.\nAfter competing in sitting volleyball and powerlifting at the games in Düsseldorf in 2023, he was chosen as captain of the UK team which has just returned from competing in Canada, cheered on by Prince Harry.\nThe seventh edition of the games included more than 500 competitors from 23 nations and the UK team finished second on the leader board after the USA.\nMr Hooper said the confidence he rediscovered while training and competing at Invictus had been transformative, not just for himself but also for his wife Jennifer and family.\n\"The Invictus journey pushes you to limits that you didn't know you were capable of,\" he said.\n\"I went from not being able to be in a room with 10 people to being up front and centre in a stadium of 5,000. It stretches you in so many ways that it helps your resilience and recovery.\n\"It has given me an opportunity to show my children you can be knocked down, but it doesn't matter, you can get back up again. You just keep moving forward.\"\nMr Hooper was diagnosed with PTSD in 2019 after serving in Iraq.\n\"I joined the RAF to be a mechanical transport driver. I just thought I was going to be driving vehicles and servicing aircraft,\" he said\n\"I then got deployed to Iraq for the first time and I ended up being a paramedic driver. I saw all kinds of injuries – losing limbs, severe wounds, fatalities. It's beyond scary and coming home was very difficult.\"\nHe said he was able to self-manage his symptoms but they reached their peak during the Covid-19 lockdowns and he became reclusive.\n\"I was struggling to sleep and having flashbacks,\" he said. \"I would sit in the garage with the door shut - hiding away was an escape.\"\nMr Hooper had already been diagnosed with PTSD when he met his future wife Jennifer in 2010.\n\"Everything I've been through, my wife and kids have been through it too,\" he said.\n\"My wife has been fully supportive, helped me through it and given me a kick up the bum when I needed it,\" he said.", "url": "https://www.bbc.co.uk/news/articles/crmjjk2zw2xo"}