{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:18:07", "date_modify": "2025-05-19 15:18:07", "date_publish": "2017-07-17 00:00:00", "description": "Updates from around the North West of England on Friday 21 July", "filename": "news_live_uk-england-manchester-40614684_1747667887.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-manchester-40614684_1747667887.html", "title": "BBC Local Live: North West of England", "title_page": "BBC Local Live: North West of England on Friday 21 July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nThat's it from us until 08:00 on Monday, when we'll be back with more news, sport, travel, and weather from across the region.\nUntil then, this page will be updated automatically with content from across the BBC.\nHave a great weekend.\nChinatown developers to 'vigorously' oppose legal proceedings\nA company that Liverpool City Council is taking legal action against has said it will \"vigorously\" defend itself against the proceedings.\nChinatown Development Company Ltd had planned to build 790 new homes, a hotel, and shops on a derelict site near the Anglican Cathedral, but the £200m project stalled.\nThe council has demanded CDC forfeits two leases on the site and pays £950,000 by 10 August.\nThe relationship between CDC and the council \"has broken down\" and the company will \"vigorously\" defend itself against the proceedings, a company statement said.\nBoy, 12, charged with racist attack in Manchester park\nA 12-year-old boy has been charged after a racially aggravated assault on another boy in a park.\nA 13-year-old boy was attacked in Plant Hill Park in Blackley on 24 June, Greater Manchester Police said.\nThe youth, who cannot be named for legal reasons, was charged with threatening a person with an offensive weapon in a public place.\nHe was also charged with racially aggravated assault, two counts of criminal damage and affray.\nHe has been remanded in custody and will appear at Manchester Youth Court later.\nRacing at Haydock abandoned after serious injury\nRacing at Haydock has been abandoned after a stalls handler was seriously injured.\nThe injured man was taken to hospital by air ambulance after being run over by the mobile starting stalls.\n\"He's been been flown to hospital off site in an air ambulance, so we've abandoned racing,\" said clerk of the course Kirkland Tellwright.\nThe incident involving the stalls, from which horses begin races, happened before the race due off at 15:30 BST.\nChester student shaken by \"scary\" Kos earthquake\nA Chester student has described being caught up in the Kos earthquake as a \"scary situation\".\nLauren Duffy, 20, was forced to spend the night outside her hotel after the 6.7-magnitude quake hit close to the Greek island, injuring 115 people,12 of them seriously.\nShe said broken marble statues were among the debris strewn at the Atlantis Hotel in Lambi.\nThe University of Chester broadcast production student who is on holiday with her mother and sister, is due to leave the island on 23 July.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nQuote Message\nWe were woken up by really aggressive shaking. We didn't know what it was. You couldn't find your balance. It was just a scary situation.\nQuote Message\nI think if the option came up to fly home early I think we would accept it at this stage.\nLauren Duffy, Student\nCouncil takes legal action over Chinatown regeneration\nLiverpool City Council has begun legal action against the company involved in the stalled Chinatown development.\nThe authority is demanding the Chinatown Development Company Limited forfeits two leases on the site.\nIt's also issued a legal notice for an outstanding payment of £950,000 from the firm.\nThe £200m project to build hundreds of new homes, shops and a hotel was promised two years ago - but work hasn't yet started.\nIn the summer of 2016, the sales agent was accused of fraud, a council statement said.\nHMP Liverpool staff member arrested in corruption probe\nA member of staff at HMP Liverpool has been arrested after allegedly helping to smuggle a mobile phone into the jail for a prisoner, the BBC understands.\nThe 25-year-old woman was held on suspicion of misconduct in a public office and intentionally encouraging or assisting the commission of an offence.\nShe was questioned before being released while inquiries continue, Merseyside Police said.\nFuneral date set for youngest victim of Manchester attack\nThe funeral of an eight-year-old girl who was the youngest victim to be killed in the Manchester Arena attack is to be held next week at Manchester Cathedral.\nSaffie Roussos from Leyland will be the last of the 22 people killed in the blast to be laid to rest.\nIn a statement, her family said anyone who had been touched by her death was invited to attend the \"celebration of [Saffie's] life\".\nThe service will take place at the cathedral on 26 July.\nThree men charged in Colne death probe\nThree men have been charged over the death of a man in Lancashire.\nThe 50-year-old was found unconscious in Venables Avenue, Colne, on Tuesday and taken to hospital in a critical condition.\nLancashire Police said three men, aged 40, 41 and 64, have been charged with wounding.\nThey are due to appear at Burnley Magistrates' Court later.\nWeather: Windy and rain likely\nBBC Weather\nWindy especially along the coast and over higher ground.\nHeavy outbreaks of rain will continue for much of tonight. Towards dawn we will see some dry spells in the south, but with further rain in the north and east.\nHighs of 19C. More from BBC Weather.\nEx-council leader Mike Connolly suspended in safeguarding row\nEx-Bury Council leader Mike Connolly has been suspended by Labour amid claims officials did not follow child protection rules for political reasons.\nThe move follows reports which found council officers failed to act quickly enough after claims were made against a councillor before elections in 2015.\nSimon Carter later admitted 16 charges of making indecent images of children.\nMr Connolly has previously said he was wrong to have given Carter a written reference on council-headed paper ahead of his sentencing, describing the former Labour councillor as \"trustworthy, honest and reliable\".\nQuote Message\nI have nothing to hide and want to be open and transparent. That is why I have referred myself to the standards committee. I have co-operated fully with the independent review and I will co-operate fully with this investigation\nMike Connolly, Former leader, Bury Council\nSummer getaway M6 journey times 'could triple today'\nBBC News England\nJourneys on the M6 through Staffordshire and Cheshire could take more than three times as long as usual today as families head off on their summer holidays.\nTraffic information company Inrix said it usually takes around 50 minutes to go from junction 11 north to 20 but today it could be as long as 150 minutes.\nThey add that going southbound over the same stretch could also take longer, from 50 minutes to around 90 minutes.\nThe company said the busiest period is likely to be between 11:00 and 18:30.\nMurder probe after man stabbed in neck\nA young father has died after being stabbed in the neck during a street row.\nPolice were called to Royton Avenue in Sale, Greater Manchester at 23:10 BST on Thursday after reports of a scuffle involving a group of men.\nThe 34-year-old victim was treated at the scene and taken to hospital where he later died.\nDetectives believe he was beckoned into the road by three men before he was fatally stabbed. A murder investigation has been launched.\nAir traffic controllers warn of over-crowded skies\nAir traffic controllers are warning that UK skies are running out of room amid a record number of flights.\nToday is likely to be the busiest day of the year, with air traffic controllers expecting to handle more than 8,800 flights, which is likely to be a record number.\nThey have called for a drastic modernisation in the way aircraft are guided across UK airspace.\nIt comes as the government launches a discussion to shape the UK's aviation industry for the next 30 years and the start of a £1bn investment programme to double the size of Manchester Airport's Terminal 2.\nFuneral service for Arena bomb victim\nThe funeral of Manchester terror attack victim Kelly Brewster is due to take place later.\nMs Brewster, 32, from Sheffield, was among 22 people who died in the suicide bomb attack at an Ariana Grande concert at Manchester Arena in May.\nShe had gone to the gig with her sister and niece, both of whom were injured in the explosion.\nThe service will feature a number of Ms Brewster's favourite songs along with tributes from family and friends.\nMs Brewster was a former City School pupil who worked for Irwin Mitchell Solicitors and insurance company Aviva.", "url": "https://www.bbc.com/news/live/uk-england-manchester-40614684"}