{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 04:20:02", "date_modify": "2025-04-26 04:20:02", "date_publish": "2025-03-03 16:05:40", "description": "Graham Marshall, 39, is jailed at Sheffield Crown Court after pleading guilty to 12 sex offences.", "filename": "news_articles_c3rnp17znzlo_1745641202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f25b/live/f3716ab0-f83b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnp17znzlo_1745641202.html", "title": "'Perverted' Sheffield dog owner jailed over bestiality", "title_page": "'Perverted' Sheffield dog owner jailed over bestiality - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 39-year-old man has been jailed after pleading guilty to a total of 12 sex offences, including bestiality.\nGraham Marshall coerced his partner Paige Reaney, 33, into acting out his \"perverted\" sexual fantasies, Sheffield Crown Court heard.\nMarshall, of no fixed abode, was jailed on Monday for five and a half years, with an extended licence period of four years.\nAt the same hearing, Reaney, formerly of Bowman Drive, Sheffield, was given a nine-month sentence, suspended for two years, after admitting bestiality and animal cruelty offences.\nMarshall was also placed on the sexual offenders register for life, while Reaney was told to carry out 30 requirement activity days and placed on the sex offenders register for 10 years.\nMeanwhile, Marshall and Reaney were both banned from keeping animals.\nWarning: This story contains details readers might find distressing\nJudge Jeremy Richardson KC told the court the offending first came to light in August 2021 when police had seized devices from the couple's home after receiving information about the possession of illegal images of children.\nThe devices contained bestiality content which had been carried out by both defendants over a three-year period and involved their pet dog.\nMarshall's devices also contained voyeuristic material and indecent images of children and he had also taken an indecent image of a child, the court was told.\nWhen Reaney was arrested in January 2023, she told officers she had been forced to sexually abuse their dog as part of Marshall's \"fantasy\", and in a later interview, she told officers he had previously sent her sexual images of dogs.\nReaney denied knowledge of Marshall's other offences.\nJudge Richardson accepted Reaney had been \"under a level of coercion\", but said she \"went along with what happened\" and had \"played your role to the full\".", "url": "https://www.bbc.co.uk/news/articles/c3rnp17znzlo"}