{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 04:10:17", "date_modify": "2025-04-26 04:10:17", "date_publish": "2025-03-02 18:00:44", "description": "This week also sees the release of Split Fiction, R-Patz's new film Mickey-17 and Meghan's delayed TV show.", "filename": "news_articles_clyj4vvel81o_1745640617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/19b0/live/e113dcb0-f424-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj4vvel81o_1745640617.html", "title": "Lady Gaga is back, and Jennie's debut solo album is here: What to stream this week", "title_page": "Lady Gaga is back, and Jennie's debut solo album is here: What to stream this week - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This week, Lady Gaga is back - she's making her big return to pop music with hotly anticipated album Mayhem.\nBut that's not all the week has in store.\nBlackpink star Jennie's debut solo album is coming out, R-Patz's new film Mickey-17 hits the big screen, Split Fiction is being released, and Meghan's delayed TV show is here at last.\nRead on for this week's biggest releases...\nIt's been a hot minute since we've seen Lady Gaga in full pop mode - but her seventh album Mayhem promises a full return to the brash electro-pop sounds of The Fame Monster and Born This Way.\nAccording to Gaga, we have her fiancé Michael Polansky to thank for this rebirth. \"He was like, 'Babe, I love you. You need to make pop music',\" she told Vogue last year, external.\nThe early signs are encouraging. Abracadabra is the distilled essence of Gaga, crammed with nonsense words and speaker-rattling synth bass. Die With A Smile, her 1970s-styled duet with Bruno Mars, is her biggest hit since Shallow.\nIn the videos, she's playing multiple versions of herself, suggesting the album is both a celebration and a reckoning with her past.\nSpeaking to the LA Times, external, Gaga added that the album \"leaps around genre in a way that's almost corrupt… And it ends with love.\"\nFans who heard the record at a listening party in New York last week were ecstatic, calling Mayhem \"a culmination of all her eras\".\nThe rest of us have to wait until Friday to find out what Gaga has to say on songs like the tantalisingly-titled Perfect Celebrity.\nIt's a good time to be a Blackpink fan. The South Korean girlband have just announced their comeback tour - complete with two nights at London's Wembley Stadium. But before that, all four members are busy releasing solo projects.\nRosé's APT was one of the defining hits of late 2024, while Lisa's barnstorming Alter Ego album coincides with her role in the latest series of White Lotus. Jisoo - the band's quietest member - is starring in the Korean zombie romance (don't ask) Newtopia, and recently released the bubblegum pop EP, Amortage.\nJennie's album is last to arrive. It's called Ruby, after her middle name, hinting at the difficulty she faced in establishing a musical identity outside of Blackpink, where she's considered the \"face\" of the band, as well as its lead singer.\n\"I struggled a lot in the beginning,\" she recently told Billboard, external. \"A few months, I would say, was just me throwing myself out there, walking into rooms filled with new people. I just had to keep knocking on the door, like, 'Is this it?', 'Is this it?'\"\nThe sound she landed on isn't going to scare off Blackpink's existing fanbase, but it's more personal, more sensual, more expansive than the band's armour-plated K-Pop sound.\nLead single, Mantra, is a cheeky riff on the \"independent woman\" genre, that incorporates her love of burgers and pyjamas over a Miami Bass beat. More recently, she released the love-em-and-leave-em anthem Love Hangover, whose video is an absolute riot, external.\nThe rest of the album contains collaborations with Childish Gambino, Dua Lipa, Kali Uchis and rapper-of-the-moment Doechii.\nThe real question, though, is whether all this creative freedom will seep into Blackpink's new music when it arrives this spring?\nBritish heartthrob R-Patz (aka Robert Pattinson) is starring in dark sci-fi film Mickey 17, which is released in UK cinemas this Friday.\nIt tells the story of a financially destitute man who signs up to be an \"expendable\" crew member on a dangerous mission to colonise an ice world.\nOf course, anything R-Patz does draws in a loyal audience of primarily young female fans (and I say this as a huge Twilight fan).\nBut for film buffs, perhaps more interesting is the fact this is Bong Joon Ho's first film since his Oscar-winning black comedy Parasite.\nParasite, which came out in 2019, is considered by many to be one of the greatest best picture winners of this century so far, and there has been huge anticipation to see how Bong could possibly follow it up.\nWhen I met him at the premiere, he told me the film's message was a simple one. \"Whether it's the future, or going into outer space, humans must live genuinely human lives,\" he said.\nThe Duchess of Sussex's new Netflix series, With Love, Meghan, was due to drop in January - but was postponed due to the LA wildfires.\nOn Tuesday, it will finally hit our screens.\nIn the trailer, Meghan was seen baking cakes, slicing veggies and harvesting honey. It was the picture of domestic bliss.\nAnd everyone had an opinion on it. Thousands of column inches were dedicated to analysing every single detail of every frame.\nSo what will the series itself bring? I'm personally interested in how much Prince Harry appears. And might we get a rare glimpse of their two children, Archie and Lilibet, too?\nIt's an eight-part series, so there will be plenty to chew over - for fans and detractors alike.", "url": "https://www.bbc.co.uk/news/articles/clyj4vvel81o"}