{"authors": ["Tanya Gupta", "www.facebook.com"], "date_download": "2025-04-26 03:40:12", "date_modify": "2025-04-26 03:40:12", "date_publish": "2025-03-05 10:25:10", "description": "The charity Maona Art wants to reopen the Kinokulture site and is raising funds to make it happen.", "filename": "news_articles_c62x89723gzo_1745638812.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/84ae/live/14130460-f9a7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62x89723gzo_1745638812.html", "title": "Oswestry community cinema on course to open by summer", "title_page": "Oswestry community cinema on course to open by summer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than £26,000 has been raised to reopen a community cinema in Oswestry after it closed last year.\nCharity Maona Art wants to reopen the Kinokulture site, and is working on raising more than £54,000 to make it happen.\nIf all goes to plan, the venue could start showing films again by the summer.\nTatenda Jamera, director of Maona Art, said a programme was currently being put together and tickets would go on sale soon.\n\"The interest from the public has been very, very, very positive,\" the film-maker and curator said.\n\"They are really keen on this happening and they want to see a cinema being opened in their town because there is no cinema at the moment.\"\nHe added that individual donations of more than £2,000 demonstrated how enthusiastic people were for a cinema in the town, with one person describing it as \"literally a lifeline\".\nMr Jamera said he was confident of hitting the fundraising target in the next couple of months.\n\"Some people are saying cinema is dead,\" he said. \"Cinema is never going to die. Cinema is getting stronger. It's more than watching a film.\"\nHe said it was part of the social life of the community.\nKinokulture, in the converted old Kingswell Chapel in Arthur Street, closed last year when the owners retired.\nBirmingham-based Maona Art launched its fundraising campaign to reopen the cinema and create a community hub this year.", "url": "https://www.bbc.co.uk/news/articles/c62x89723gzo"}