{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:54", "date_modify": "2025-05-19 15:30:54", "date_publish": "2015-02-27 12:09:14", "description": "An \"outright refusal\" of weekend social care visit for a woman who went on to kill her baby daughter cannot be justified, a coroner says.", "filename": "news_uk-england-nottinghamshire-31656722_1747668654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/73394000/jpg/_73394124_69643634.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-nottinghamshire-31656722_1747668654.html", "title": "Zoe Black inquest: 'Refusal' to visit killer mother 'unjustifiable'", "title_page": "Zoe Black inquest: 'Refusal' to visit killer mother 'unjustifiable' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A \"refusal\" of a request for a weekend social care visit for a woman who went on to kill her baby daughter could not be justified, a coroner has said.\nSeven-month-old Zoe Black was killed by her mother Amy Black in Nottingham in September 2013.\nDuring an inquest into her death, social worker Rohan Griffiths denied police claims that they asked for an urgent visit the day before Zoe died.\nAssistant coroner Dr Elizabeth Didcock gave a verdict of unlawful killing.\nBaby Zoe was found dead in undergrowth in Bestwood by neighbours on Sunday 1 September, 2013.\nThe previous day she was taken to London by her mother who told a police officer in Ealing that she wanted to travel to Holland but had no passport, Nottingham Coroners' Court heard.\nPolice agreed to take her home and, later on, Sgt Ruby Burrow of Nottinghamshire Police spoke to Mr Griffiths who was on duty in the social services' emergency duty team.\nShe told the court that as there was \"not a lot more the police could do\" she asked him, twice, for a home visit to be arranged.\nBut, she claimed, on both occasions Mr Griffiths refused, saying there was not a social worker on duty. Mr Griffiths denied any request for an urgent visit was made.\nDr Didcock rejected his evidence and said that \"as a minimum\" he should have discussed the case with a mental health practitioner.\nWhile a visit would not have prevented Zoe's death, she said: \"I cannot and I do not find that the outright refusal by social care to intervene or to take any action whatsoever on that evening can be justified\".\nShe expressed concern there was \"no clear guidance as to how social care and police should jointly respond out-of-hours to a situation such as this\".\nDr Didcock said there is an urgent need for a protocol to \"address the roles, responsibilities and duties of professionals involved in this service\".\nThat one had not yet been implemented was \"not only surprising to the court, but deeply disappointing,\" she said.\nA draft agreement has now been set up.\nIndependent chairman of the Nottingham City Safeguarding Children Board, Paul Burnett, said a serious case review was also under way \"to identify action that could be taken to further improve services based on learning from the case.\".\n\"At the time, she presented as a loving and attentive mother with no indication that she would intentionally harm her baby,\" he said.\nHe said the emergency duty team is available out of hours and \"had this been the case here, appropriate action would have been taken\".", "url": "https://www.bbc.com/news/uk-england-nottinghamshire-31656722"}