{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:04:52", "date_modify": "2025-05-19 15:04:52", "date_publish": "2015-02-07 12:15:58", "description": "At least 34 people are killed in three bomb attacks in Baghdad, security officials say, hours before a long-standing night-time curfew is to be lifted.", "filename": "news_world-middle-east-31191814_1747667092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80850000/jpg/_80850315_80849158.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31191814_1747667092.html", "title": "Iraq: Baghdad bomb blasts kill more than 30", "title_page": "Iraq: Baghdad bomb blasts kill more than 30 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At least 34 people have been killed in three bomb attacks in the Iraqi capital Baghdad, police say.\nThe explosions came just hours before a long-standing overnight curfew was to be lifted.\nIn the first attack, a suicide bomber blew himself up in a restaurant in the predominantly Shia New Baghdad area, killing 22 and wounding at least 50.\nMore people were killed in attacks on two separate markets, one in the centre and one in the southwest of Baghdad.\nInterior ministry spokesman Brigadier General Saad Maan said he did not believe that the blasts were linked to the decision to lift the curfew.\nOn Thursday, the government announced that the curfew would end at midnight on Saturday (2100 GMT). The Iraqi capital has had some form of curfew in place since the US-led invasion to topple Saddam Hussein in 2003.\nThe latest version, which restricts movement from midnight to 0500 (2100-0200 GMT), has been in force for seven years.\nPrime Minister Haider al-Abadi ordered the lifting of restrictions to normalise life and to demonstrate that Baghdad no longer faces a threat from Islamic State, the militant group which had gained control of areas of northern and western Iraq last year.\nIn one such area on Saturday - the Zumar district in northern Iraq - the excavation of a mass grave revealed the remains of at least 16 members of the Yazidi religious minority who came under attack from IS last year, the Reuters news agency reported.\nIt is the second such grave found this week.", "url": "https://www.bbc.com/news/world-middle-east-31191814"}