{"authors": ["Andrew McNair", "John Campbell", "www.facebook.com"], "date_download": "2025-04-26 03:56:18", "date_modify": "2025-04-26 03:56:18", "date_publish": "2025-03-04 15:13:27", "description": "The former Europa Buscentre in Belfast is to be converted into a street food market.", "filename": "news_articles_cgq979z33qyo_1745639778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9d96/live/09d4a8b0-f901-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgq979z33qyo_1745639778.html", "title": "Belfast food market: Traders 'cannot wait' for Europa Buscentre transformation", "title_page": "Belfast food market: Traders 'cannot wait' for Europa Buscentre transformation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Traders at the former Europa Buscentre mall have lost about 13,000 customers since the opening of Grand Central station last year, a bakery manager has said.\nBusinesses told BBC News NI that a new food market planned for the old bus centre \"cannot come quick enough\".\nThe old transport centre closed its doors in the Autumn.\nThe market is part of a wider regeneration plan for the area, but businesses that currently still operate in the mall attached to the old bus centre worry that any delays in delivery would impact their ability to continue trading.\n\"If it's delayed, we should be OK but that can't go on forever,\" she said.\nStaff \"knew there would be a challenge\" when the bus station relocated but they \"made the call\" not to close the shop and to \"push through\" instead.\nThe mall went from having \"around 16,000 customers a day to around 3,000 customers,\" she added.\n\"So we're really looking forward to the market opening.\"\nNica Nica cafe owner Giuseppe Micciche said he opened a unit after the bus centre was moved to the new Grand Central Station last year, on the promise of the market opening later in 2025.\n\"This is why we put our money and our energy here, because we're waiting for the new food market,\" he told BBC News NI.\n\"This is really, really important for us, for all the businesses here in the mall.\"\nThe former bus centre will be converted into a street food market as part of the wider regeneration of the area around the new Grand Central Station.\nThe market will be a meanwhile or temporary project ahead of the redevelopment of the building.\nThe Europa Buscentre closed in 2024 when services moved to the Grand Central.\nThe wider area around Grand Central is to redeveloped over the next 20 years in a project called Weavers Cross.", "url": "https://www.bbc.co.uk/news/articles/cgq979z33qyo"}