{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:32:59", "date_modify": "2025-04-26 07:32:59", "date_publish": "2025-02-27 16:34:28", "description": "Barristers in the murder trial of George Ness are giving their closing speeches to jurors.", "filename": "news_articles_clyrr41g8j5o_1745652779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07ec/live/808c0500-ef8a-11ef-80a2-3b5266fd5b33.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrr41g8j5o_1745652779.html", "title": "Wallsend murder accused's self-defence claim a 'nonsense'", "title_page": "Wallsend murder accused's self-defence claim a 'nonsense' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man's claim he was acting in self-defence when he battered to death a good Samaritan who had intervened in a burglary is a \"nonsense\", prosecutors have said.\nJohn Smyth, 63, was repeatedly struck with a wooden plank after trying to stop George Ness, 41, smashing his way into a woman's home in Wallsend, Newcastle Crown Court has heard.\nIn his closing speech to jurors at Newcastle Crown Court, prosecutor Peter Glenser KC said Mr Ness had repeatedly lied about his actions and had \"battered\" Mr Smyth to death.\nToby Hedworth KC, representing Mr Ness, said Mr Smyth's life had been \"needlessly lost\" but Mr Ness had believed he was \"fighting\" for his own.\nThe court has heard Mr Smyth was staying at his neighbour Bridi Nye's home on Holly Avenue on the night of 21 September 2024.\nAt about 05:00 BST on 22 September, Mr Ness arrived claiming he wanted to buy crack cocaine from Ms Nye, who has denied being a drug dealer, but became angry about her \"ripping\" him off, the court heard.\nHe tried to smash his way in through a kitchen window, prompting Mr Smyth to run into the backyard and confront him while armed with a Stanley knife, the court heard.\nMr Ness accepts picking up a wooden plank and striking Mr Smyth, but claimed he only hit him twice in self-defence, with the victim falling and hitting his head on a wall.\nMr Glenser said a post-mortem examination revealed Mr Smyth had been struck between five and eight times with the plank and suffered multiple skull fractures, as well as being stamped on.\nHe said Mr Ness had tried to break into Ms Nye's flat for money or drugs and had met \"more resistance\" than he was expecting.\n\"This is Mr Smyth fending off a would-be attacker trying to get into [Ms Nye's] flat and trying to stop him,\" Mr Glenser said, adding Mr Ness was the \"assailant from start to finish\".\nMr Glenser said the attack on Mr Smyth was ferocious, with Mr Ness continuing to rain blows on him even after he was lying on the ground seriously injured, \"not being a threat to anyone\".\nThe prosecutor said it was \"simply a nonsense\" for Mr Ness to claim self-defence, adding: \"He was in a rage, lost it, spat his dummy out.\n\"[Mr Ness] battered him to death.\"\nAs Mr Smyth lay dead or dying, Mr Ness rifled through his pockets and stole his mobile phone, Mr Glenser said, and when challenged by a witness told a \"cold, cynical, calculating lie\" that Mr Smyth had owed him money.\nThe \"ransacking\" of Mr Smyth's clothing was \"one of the more chilling aspects of the case\", Mr Glenser said.\nThe prosecutor said Mr Ness had \"lied throughout\", first to police, then to jurors, and when his lies did not fit the evidence, he tried to \"win over [the jury's] sympathy\" by claiming he could not remember what happened.\nMr Hedworth said Mr Ness \"took the life of John Smyth in that backyard\" and it was a \"life that had been needlessly lost\", but there were \"degrees of uncertainty\" about what happened.\nHe said jurors might not like Mr Ness's lifestyle or \"some of the things he does\" but they had a duty to try him fairly based on the evidence, adding: \"The gravest of crimes deserved the most careful consideration.\"\nMr Hedworth called the prosecution's case a \"false narrative\", adding prosecutors had painted Mr Ness as a \"lowlife\" and \"druggy\" who had committed multiple crimes, but jurors needed to question the \"reliability\" of witnesses such as Ms Nye.\nHe said jurors were considering the case in a \"brightly lit courtroom\" where they felt \"comfortable and safe\", but they should imagine themselves in the dark backyard.", "url": "https://www.bbc.co.uk/news/articles/clyrr41g8j5o"}