{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 06:19:53", "date_modify": "2025-04-26 06:19:53", "date_publish": "2025-03-01 07:03:45", "description": "The Runcorn and Helsby MP saw his reputation shattered when footage emerged of a shocking assault.", "filename": "news_articles_ce8mgv866e0o_1745648393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43c6/live/8d58c750-f610-11ef-8bd4-79fbcae3264e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8mgv866e0o_1745648393.html", "title": "Mike Amesbury: He did some good but he must stand down, constituents say", "title_page": "Mike Amesbury: He did some good but he must stand down, constituents say - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"We were absolutely shocked, astonished.\"\nThat was the reaction from Frodsham residents to the violent CCTV footage that appears to have sunk the political career of Runcorn and Helsby MP Mike Amesbury.\nMany of the people who voted Amesbury into parliament last year - with a healthy majority of more than 14,000 - seem bewildered and appalled after his assault conviction for repeatedly punching 45-year-old Paul Fellows on a Frodsham street on 26 October last year.\nSome constituents expressed sympathy and surprise that Amesbury was initially sent to prison for a first offence after he had pleaded guilty to assault - but most agreed his political career should be over.\nThe 55-year-old, who was suspended by the Labour Party in October, was described by several constituents as someone who had \"done a lot of good\" and who you could pass the time of day with.\nThe vast majority of that goodwill though appears to have evaporated after they watched the true extent of the attack on Mr Fellows captured on CCTV and widely shared online.\nMarried couple Bob and Dorothy Cummings, originally from Scotland, have lived in Frodsham for 16 years and said they had bumped into their MP in the town centre on several occasions.\n\"We see him round town a lot, he seems like quite a nice guy\", said Mr Cummings.\n\"We see him in Costa Coffee a lot, he chats to people, yeah astonished.\"\nMs Cummings added: \"He's done a lot of good for Frodsham, for the area.\"\nThey both agreed Amesbury's behaviour was \"wrong\", but said they felt the immediate 10-week prison sentence, handed down at Chester Magistrates' Court, was harsh and they welcomed Thursday's judgment to suspend the sentence on appeal.\nMr Cummings said: \"I just thought it was daft because they're releasing prisoners because there's no room in jails.\n\"It was a first offence and it's highly unlikely he'll do it again.\"\nNan Haworth, another Frodsham constituent, was \"horrified\" by the video footage of the attack, but glad to see Amesbury released on appeal.\n\"He really laid into him didn't he? - a second time and a third time,\" she said.\n\"I was surprised because he's got a good reputation that guy... but I think he's got his just desserts.\"\nAsked if she would like to see Amesbury step down, she said: \"Possibly, yes.\"\nOthers across the constituency were less forgiving.\nChris Howard, owner of the Curiosity Bookshop in Runcorn Old Town, also described Amesbury as having \"done a lot of good\".\nBut he was appalled by the extent of Amesbury's violence in the early hours of the morning.\n\"To see anybody doing that would be a terrible thing,\" he said.\n\"It was a sustained attack, it wasn't just a one off, he carried on and he had to be pulled off.\"\nMr Howard highlighted the words of Chester's deputy chief magistrate Tan Ikram, who told Amesbury he had seen examples of punches to the head ending in fatality.\n\"It could have easily gone a lot worse,\" Mr Howard said.\n\"I can't see how he can carry on afterwards, not seeing what people have seen - it shouldn't be allowed that he carries on.\"\nDelivery driver Paul Rowlands, from the village of Mickle Trafford between Frodsham and Chester, said Amesbury's sentence being suspended on appeal was \"not a fair result\".\nHe said: \"The video footage of him striking that man, I think, was quite disgusting for anybody, let alone an MP.\n\"So I think it's a fair sentence and I think he should really carry out that sentence, especially with this the position he has.\"\nHe called on Amesbury to step down immediately to avoid \"controversy dragging on longer and longer\".\nFor Runcorn butcher Danny Shaw, Amesbury's behaviour meant there was no question of carrying on as the local MP.\n\"He needs to stand down now,\" he said.\nMr Shaw added: \"I think we need to start afresh again because the thing is, now he's done what he's done and he is all over the news for what he has done.\"\nAmesbury was ordered to carry out 200 hours of unpaid work, undertake an alcohol monitoring programme, go on an anger management course, and carry out 20 days of rehabilitation work.\nLeaving Chester Crown Court on Thursday, he refused to answer questions from the waiting media about whether he would resign as an MP.\nBut he said: \"I'd like to reiterate that I sincerely apologise once again to Mr Fellows and his family.\n\"I'm now going to go and see my family, and go home, and I'll give a statement at a later stage.\"\nAs it stands, his constituents could get the power to force him out if they so choose.\nAny prison sentence, whether immediate or suspended, triggers a recall petition.\nIf 10% of voters sign on the dotted line, then a by-election is triggered.\nThere would be nothing to stop Amesbury standing in that election if he wished, as only prison sentences of more than 12 months result in disqualification from holding office.\nBut for many constituents, that process should be unnecessary.\nMr Shaw said: \"I don't think there'll be any trust there at all, so I think the right thing would be to stand down now and let somebody else take over.\"", "url": "https://www.bbc.co.uk/news/articles/ce8mgv866e0o"}