{"authors": ["Jason Arunn Murugesu", "www.facebook.com"], "date_download": "2025-04-26 08:04:08", "date_modify": "2025-04-26 08:04:08", "date_publish": "2025-02-26 16:01:56", "description": "Three other Cumbrian English Heritage sites will also have their hours cut, the charity says.", "filename": "news_articles_c8x4q2gnqvpo_1745654648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1cf/live/7fae7e70-e322-11ef-9ade-9557f4eb91de.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x4q2gnqvpo_1745654648.html", "title": "Plans to shut Furness Abbey every winter confirmed", "title_page": "Plans to shut Furness Abbey every winter confirmed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to permanently shut an ancient monastery during the winter have been confirmed.\nFurness Abbey, on the outskirts of Barrow, Cumbria, was founded about 900 years ago and was the first of England's \"greater monasteries\" to be dissolved during Henry VIII's religious reforms.\nEnglish Heritage, which runs the site, has now confirmed it will be shut to the public from mid-November to the end of March as part of cost cuts.\nGill Jepson, a volunteer at the abbey, said the charity had taken the \"easy way out\".\nShe said the charity had not done enough to publicise Furness Abbey to visitors and this was partly why it had so few visitors in the winter.\n\"We're right next to the Lake District,\" said Ms Jepson. \"We should be getting dozens and dozens of visitors down.\n\"We could have events in the autumn - there's just no imagination or creativity. They're doing their own staff a disservice.\"\nThe charity's territory director Andrea Selley said the body marketed Furness Abbey through its website, its members' handbook and press coverage.\n\"Tourism is very seasonal and the simple fact is that people do not visit certain sites during the winter months,\" she said.\nThe confirmation of the cuts comes after the charity had said it was still consulting with unions about the plans.\nIt said it could now confirm three other sites in Cumbria would also have their opening hours cut.\nThis includes Brougham Castle, near Penrith, and Lanercost Priory, which will be permanently shut to the public in the winter.\nIt also said Stott Park Bobbin Mill, in Windermere, would be closed throughout the year, except for special events which could include guided tours and temporary exhibitions.\nThe sites would all continue to open during the winter for pre-booked school groups, it added.\nMs Jepson said it was a \"disgrace\" Stott Park was having its hours so dramatically cut.\nIt was the last remaining working bobbin mill in the country, she said.", "url": "https://www.bbc.co.uk/news/articles/c8x4q2gnqvpo"}