{"authors": ["Louise Parry", "www.facebook.com"], "date_download": "2025-04-26 03:46:48", "date_modify": "2025-04-26 03:46:48", "date_publish": "2025-03-05 05:29:11", "description": "Sir Oliver Dowden blames Labour's VAT charge on private school fees for the closures.", "filename": "news_articles_cvgenm4ny27o_1745639208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43cb/live/945a6a40-f845-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgenm4ny27o_1745639208.html", "title": "Hertsmere MP 'extremely concerned' about school closure reports", "title_page": "Hertsmere MP 'extremely concerned' about school closure reports - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Conservative MP has criticised the government's policy of charging VAT on private school fees, claiming it was leading to the closure of at least two local schools.\nHertsmere MP Sir Oliver Dowden said he was \"extremely concerned\" at reports that St Hilda's prep school in Bushey \"may close\".\n\"This is the second casualty of Labour's schools tax in Bushey alone,\" said Sir Oliver, who previously highlighted the closure of a Jewish faith school, Immanuel Prep.\nThe Department for Education was contacted for comment.\nSt Hilda's school told the BBC: \"The possible closure of St Hilda's remains subject to consultation with the staff, which is underway.\"\nFees at the UK's 2,500 private schools became liable for 20% VAT from 1 January.\nThe government said it expected to raise £1.725bn, external from the tax which would \"go towards the public finances and help improve education and outcomes for young people\".\nBut Sir Oliver, who attended a local state school, called the policy \"deeply misguided\".\n\"It's very difficult to say there's not a linkage between the two, when you slap an extra 20% on the fees. It seems strangely coincidental that two schools in my constituency are facing closure within weeks of Labour introducing this policy,\" he told the BBC.\nHe said school places in Hertfordshire were \"already in exceptionally short supply\" and private schools closing would add \"unsustainable pressure on local state schools\".\nThe government said there was \"lots of evidence to suggest that there are more than enough state school places for pupils who may move from a private school\".\nSir Oliver claimed the extra VAT payment was creating \"anxiety for families\".\n\"I know people who have worked very hard to send their children to these schools\n\"In this part of Hertfordshire, you've got a very diverse array of different schools. Many of the Hindu community work hard in sending their children there, as well as a large Jewish community. It's a very mixed cohort\".", "url": "https://www.bbc.co.uk/news/articles/cvgenm4ny27o"}