{"authors": ["Bernd Debusmann Jr", "www.facebook.com"], "date_download": "2025-04-26 07:41:29", "date_modify": "2025-04-26 07:41:29", "date_publish": "2025-02-26 21:46:11", "description": "Trump covered a wide range of topics, ranging from efforts to cut government spending to immigration, the economy and Ukraine.", "filename": "news_articles_c62x7p4465no_1745653289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/021c/live/81cb42b0-f4e3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62x7p4465no_1745653289.html", "title": "Elon Musk, tariffs and tensions", "title_page": "Elon Musk, tariffs and tensions - takeaways from Trump's cabinet meeting - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump held his first cabinet meeting at the White House on Wednesday, turning the occasion into an extended question-and-answer session that lasted for more than an hour.\nSpeaking alongside his cabinet - and billionaire Elon Musk, who wore a \"tech support\" T-shirt - Trump covered a wide range of topics, from the so-called Department Department of Government Efficiency's (Doge) efforts to cut government spending to immigration, the economy and the war in Ukraine.\nHere are six takeaways from the meeting.\nTrump was asked by reporters which government department - and, by extension, which cabinet members - were most resistant to his policy changes.\n\"So far, I'm happy with all of those choices,\" he said.\nHe added, however, that \"some groups are much easier than others\", specifically praising the work of Elon Musk - who is not a cabinet member - and Secretary of State Marco Rubio.\nHis administration is focusing on \"cutting down the size of government, we have to\", he added.\n\"We want to have a balanced budget within a reasonably short period of time... meaning maybe by next year or maybe the year after,\" Trump said.\nTrump publicly - and repeatedly - backed the work of Elon Musk and Doge, which has been tasked with slashing government spending and the federal workforce.\nThe president sought to dampen any speculation of tension between Musk and the rest of his team.\n\"They have a lot of respect for Elon and that he's doing this, and some disagree a little bit,\" Trump said. \"But I will tell you for the most part I think everyone's not only happy, they're thrilled.\"\n\"If they aren't, I want them to speak up,\" he added.\nAt one point, Trump was asked whether any cabinet members had expressed dissatisfaction with Musk and turned to the room to ask them. None spoke.\nMusk also defended Doge, calling it a \"support function\" for government agencies to rid themselves of fraud.\nHe acknowledged, however, that it will make mistakes, and noted that it had accidentally cancelled Ebola prevention efforts before reinstating them.\n\"But when we make mistakes we'll fix it very quickly,\" Musk said.\nThe president also addressed Musk's email to federal employees asking them to list five things they had done in the last week or risk losing their jobs, saying the cabinet is \"very much behind\" the initiative.\nTrump speculated without evidence that some of the approximately one million federal workers who haven't responded to the email maybe \"don't exist\".\n\"Maybe they're going to be gone,\" he added.\n\"We're trying to figure out who those people are who haven't responded,\" Trump added. \"We're being a little more surgical in situations where people are doing classified stuff.\"\nTrump also said he was encouraging cabinet members to \"do their own Doge\" at their respective agencies.\nHe also suggested that the Environmental Protection Agency, which is led by Lee Zeldin, could lose as much as 65% of its workforce.\nLater in the day, a memo was sent to federal agencies asking them to submit plans for \"a significant reduction\" in their staff by 13 March.\nIt asks agencies to provide a list of employees who are deemed not essential. The memo also requests that future hiring be limited to one position for every four people who are let go.\nThese layoffs would be in addition to those already undertaken by Doge of mainly probationary workers. Multiple US outlets have reported that nearly 10,000 federal workers were let go across several agencies earlier this month.\nThat figure was in addition to the estimated 75,000 workers who have accepted an offer from the White House to leave voluntarily in the autumn.\nWednesday's memo represents another step in Doge's efforts to further cut down the size of the US government.\nExempt from this action, however, are positions in law enforcement, border security, immigration enforcement and military.\nTrump confirmed that Ukrainian President Volodomyr Zelensky will visit the White House on Friday - something that had previously been suggested.\nTrump said the visit would see the US and Ukraine sign an expansive minerals deal, although the contours of that agreement remain unclear.\nHe said the deal would allow the US to \"get our money back\" for the assistance that Ukraine has been given in the three years since it was invaded by Russia.\n\"We're going to get a lot of money in the future, and I think that's appropriate, because we have taxpayers that shouldn't be footing the bill,\" he said. \"It's all been worked out.\"\nZelensky has described the bilateral deal as preliminary, and said he wants further agreements which include US security guarantees to deter renewed Russian aggression.\nAsked about security guarantees for Ukraine in the future, Trump said that the US would not provide any, arguing that the burden should fall to Europe.\nTrump said he is planning to hit goods made in the European Union with tariffs of 25%.\n\"We'll be announcing it very soon,\" he told gathered reporters. \"It'll be 25% generally speaking and that will be on cars and all other things.\"\n\"They've really taken advantage of us,\" Trump said of the EU. \"They don't accept our cars. They don't accept essentially our farm products. They use all sorts of reasons why not.\"\nTrump was also asked if he still plans on implementing tariffs on Canada and Mexico despite the significant drop in detentions of illegal migrants at the southern border and Canada's plan to enhance border protection.\nOn 4 February, Trump abruptly agreed to hold off imposing 25% tariffs on both countries for 30 days, pulling the three countries back from the brink of a potentially damaging trade war.\nThe date Trump cited appeared to be an extension of that timeframe.\n\"April 2, the tariffs go on,\" he said. \"Not all of them but a lot of them. And I think that's gonna be amazing.\"", "url": "https://www.bbc.co.uk/news/articles/c62x7p4465no"}