{"authors": ["Esme Stallard", "Victoria Gill", "www.facebook.com"], "date_download": "2025-04-26 04:02:28", "date_modify": "2025-04-26 04:02:28", "date_publish": "2025-03-04 01:42:32", "description": "The world's most prestigious science institution has been considering whether to remove Musk as a fellow.", "filename": "news_articles_c3e44ge0xnwo_1745640148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/db7f/live/d48b4b10-f82d-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e44ge0xnwo_1745640148.html", "title": "Elon Musk sparks crisis at Royal Society but remains a member", "title_page": "Elon Musk sparks crisis at Royal Society but remains a member - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Members of the UK's Royal Society have urged the elite scientific academy to \"step up its efforts to advocate for science and scientists\" amid a row over one of its fellows - Elon Musk.\nOver the last nine months, many scientists have raised concerns about the controversial billionaire's behaviour, which has been called a \"threat to science\".\nA meeting on Monday evening did not result in Mr Musk's expulsion, but it has drawn the world's oldest scientific academy into a divisive, political row.\nThe campaign to revoke Mr Musk's membership centres on suggestions, from a growing number of fellows, that the billionaire's actions are \"incompatible\" with the society's own code of conduct.\nMr Musk has overseen unprecedented funding cuts to scientific research in the US, in his senior role in President Trump's Department of Government Efficiency (or Doge).\nMr Musk has also been accused of sharing misinformation on his social media platform, X.\nIn a statement after the meeting, the Royal Society addressed those issues, saying that members who attended were particularly concerned about the fate of scientists in the US, \"amid threats of radical cutbacks in research funding\".\nThe society agreed to \"look at potential further actions\" to \"counter the misinformation and ideologically motivated attacks on both science and scientists\".\nThe BBC understands that a letter will be sent to Mr Musk from the Royal Society.\nIt is 250 years since a member of the Royal Society was ejected: German scientist and writer Rudolf Erich Raspe, who was accused of theft and fraud.\nSo the rift among the membership, caused by Mr Musk and his public pronouncements, could be a historic turning point for this most elite of scientific academies.\nTwo eminent scientists have resigned their fellowships in protest - Dr Dorothy Bishop of Oxford University and Prof Andrew Millar from University of Edinburgh.\nMore than than 3,300 scientists also put their names to a letter, written by Prof Stephen Curry, emeritus professor of structural biology at Imperial College London, who is not a fellow, that expressed \"deep concern\" about the billionaire's fellowship and the society's \"continued silence and apparent inaction\" with regard to the controversy.\nProf Curry told the BBC he was glad that the society had gathered fellows to discuss these concerns.\nBut, he added that he was \"disappointed that they have so far given only a very short statement summarising the meeting\".\n\"It makes no mention of the one [member] whose actions contrary to their code of conduct have prompted it\".\nDr Dorothy Bishop, emeritus professor of development neuropsychology at Oxford University and the first fellow to resign over the issue, told BBC News she had complained to the Royal Society twice last year.\n\"On both occasions they consulted lawyers, and it may well be the case that the lawyers are concerned about the prospect of legal action,\" she said.\nThere are more than 1,700 fellows of the Royal Society and more than 60 of them have signed Prof Curry's letter. Many more have expressed their concern about Mr Musk's behaviour.\nBut there are many academics, researchers and Royal Society fellows who do not wish to see the divisive billionaire have his membership revoked.\nNobel prize-winner Prof Sir Andre Geim from Manchester University said: \"Musk is certainly an eccentric, but his achievements beat those of any of his critics in the Royal Society. Very few can say that they achieved similar in their lives.\"\nOther scientists who spoke to the BBC pointed out that an attempt to remove Mr Musk's fellowship could be seen as political interference and a curtailment of freedom of expression.\nBut Prof George Efstathiou, from the University of Cambridge, dismissed that argument.\nMembers, he said, \"should at least have respect for the truth\".\n\"If somebody has a disregard for the truth and says things that are blatantly false, then that speaks to their ethical standards,\" he added. \"That's not political.\"", "url": "https://www.bbc.co.uk/news/articles/c3e44ge0xnwo"}