{"authors": ["Mary McCool & Calum Watson", "www.facebook.com"], "date_download": "2025-04-26 04:29:46", "date_modify": "2025-04-26 04:29:46", "date_publish": "2025-03-03 06:47:34", "description": "The first of the fleet, MV Isle of Islay, will not be finished until the end of June at the earliest.", "filename": "news_articles_crknx1lp80mo_1745641786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b8e2/live/687e0ce0-f6cb-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crknx1lp80mo_1745641786.html", "title": "Fresh delays to Turkish-built CalMac ferries", "title_page": "Fresh delays to Turkish-built CalMac ferries - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Delivery dates for a fleet of CalMac ferries being built by a shipyard in Turkey have been pushed back again due to problems with labour shortages.\nAccording to a letter from the government-owned ferries procurement company CMAL, the first of the fleet will not be finished until the end of June at the earliest when it was originally expected in October.\nIt comes at a trying time for CalMac - the west coast operator is facing a shortage of ships and has been grappling with an \"exceptional\" series of problems with its fleet.\nTransport Scotland said the latest delay was \"disappointing\" but had been caused by global issues \"outwith the yard's control\".\nProblems with the delivery of the ferries from the Cemre yard in Turkey were confirmed in a letter from CMAL to the net zero, energy and transport committee on Friday.\nThe letter has not yet been published on the Scottish government website, but was shared on social media by the Islay Community Council.\nIt said: \"We are facing serious issues with labour, particularly the availability of specialist commissioning sub-contractors.\n\"This continues to set the project and delivery back.\"\nIt said while the yard builds the vessels and installs machinery, manufacturers need their own specialists to commission the systems to ensure warranties are secured.\n\"The lack of commissioning engineers is an issue affecting the global shipbuilding industry, and is causing months-long delays in some cases,\" it added.\nThe letter said snow and cold weather had also delayed the docking of the Isle of Islay to check underwater parts and complete painting.\nThe first of the Turkish ferries, MV Isle of Islay, was launched a year ago by Morag McNeill, the chairwoman of CMAL, in a ceremony at the Cemre shipyard.\nThe second ship, MV Loch Indaal, was launched three months later by the wife of CMAL's vessel's director Jim Anderson.\nA freedom of information request from BBC News revealed that a total of 10 CMAL staff and their guests attended the Loch Indaal launch ceremony, with flight and accommodation costs totalling nearly £10,000.\nIsle of Islay - destined for the Islay route - was pushed from October to mid-February and will now be delivered \"no earlier than the end of Q2 in 2025\".\nCMAL said it expected the other three vessels to \"follow a delivery schedule of six-month intervals from the delivery of MV Isle of Islay\".\nThis would mean that Loch Indaal, also for the the Islay route, would not be completed until the end of the year at the earliest, when it was due for June.\nThe latter smaller vessels, MV Lochmor and MV Claymore are due to be deployed on the Little Minch routes between Skye, Harris and North Uist.\nThe CMAL letter added: \"The contract has anticipated intervals of four months, but it is prudent we take our current understanding of the situation into consideration.\"\nA Transport Scotland spokesperson said that shipyards across the world have been impacted by external supply chain and internal resourcing challenges.\nThey said: \"Cemre are working actively to outfit, test, trial, survey and complete the vessels as early as possible.\n\"We continue to make clear our strong expectation to CMAL and CalMac to closely monitor progress on delivery and deployment timescales.\n\"Following planned sea trials and commissioning work, a clearer indication on delivery, and that of the three sister vessels, will be provided by CMAL.\n\"The quality of the workmanship and construction of the vessel is fully meeting CMAL expectations and we look forward to the vessels joining the fleet and serving island communities for years to come.\"\nCalMac recently laid out how it had re-jigged services to cope with pressure due to repair delays and new issues identified during annual maintenance.\nChief Executive Duncan Mackison said a third of its large vessels were currently out of action or operating with reduced capacity.\nThe charter of the privately-owned catamaran Alfred - said to cost £1m a month - has now been extended to the end of May to maintain services. The summer-only Ardrossan-Campbeltown service remains suspended for another year.\nMV Caledonian Isles, which operates on the Arran route, has been out of action since last February with a series of issues including rust and twisted frames.\nThe ship was due back next month, but this has been pushed back, possibly to late April, after new issues were found with the tubes for its propeller shafts.\nMV Isle of Lewis, which operates to Barra, needs steelwork replaced during annual maintenance, and will not return to service until Sunday 23 March, almost a month later than expected.\nMV Clansman has also been slightly delayed in overhaul, while MV Isle of Mull is restricted to just 45 passengers.\nThis is due to problems with its emergency evacuation systems, which will not be fixed until mid-May at the earliest.\nThe new Ferguson-built ferry Glen Sannox joined the fleet earlier this year and its sister ship Glen Rosa is due for delivery in autumn.\nGlen Sannox is serving the Arran route but is currently too big to berth at the Ardrossan harbour, sailing instead from Troon.\nScottish Conservative transport spokeswoman Sue Webber said: \"This is yet another blow to Scotland's betrayed island communities, who are sick to the back teeth of delays to upgrading their decrepit ferry fleet.\n\"The buck stops with SNP ministers who are responsible for this national scandal. Islanders must wince every time they hear of an update from CMAL or CalMac because it's always more bad news.\n\"This latest delay couldn't be worse timed, with the summer schedule already scaled back because so many ageing ferries require repairs.\n\"It defies belief that no SNP minister has resigned or been fired for inflicting this chaos on the country.\"\nScottish Liberal Democrat economy spokesman Willie Rennie said: \"This is more bad news for islanders.\n\"No matter where the ferries are coming from there seem to be delays.\n\"Ministers should set out whether taxpayers get any money back if there are delays to the delivery of these boats.\"", "url": "https://www.bbc.co.uk/news/articles/crknx1lp80mo"}