{"authors": ["Joshua Nevett", "www.facebook.com"], "date_download": "2025-04-26 04:26:54", "date_modify": "2025-04-26 04:26:54", "date_publish": "2025-03-03 11:19:22", "description": "As the PM was speaking, Trump attacked European leaders' Ukraine stance, asking \"what are they thinking?\"", "filename": "news_articles_c9deq4ypx57o_1745641614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c229/live/1622ef90-f85d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deq4ypx57o_1745641614.html", "title": "Donald Trump's commitment to peace in Ukraine is sincere, says PM", "title_page": "Donald Trump's commitment to peace in Ukraine is sincere, says PM - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has told MPs that US President Donald Trump's commitment to achieving peace in Ukraine is \"sincere\".\nThe prime minister said Europe would have to do \"the heavy lifting\" as part of a peace deal but reiterated that a peacekeeping force would need \"strong US backing\".\nAs Sir Keir was speaking in the House of Commons, Trump posted on social media: \"Europe... stated flatly that they cannot do the job without the US – probably not a great statement to have been made in terms of a show of strength against Russia. What are they thinking?\"\nHe also accused Ukraine President Volodymyr Zelensky of not wanting peace adding: \"America will not put up with it for much longer.\"\nFollowing a summit of western leaders over the weekend, the UK and France said they would produce a plan to stop the fighting, which would then be discussed with the US.\nAddressing MPs, Sir Keir said Britain would \"play a leading role\" in any agreed deal including, if necessary, deploying British troops in Ukraine to deter Russia from further attacks.\nTrump has so far not agreed to provide any security guarantees and has instead focused on a deal to open up Ukrainian minerals to US companies.\nHe has argued that the presence of American workers in the country would help discourage Russia from trying to encroach on Ukraine territory.\nAsked by Reform UK leader Nigel Farage if the minerals deal would provide \"enough of a security guarantee\", Sir Keir said the deal \"is not enough on its own\".\nThe prime minister received widespread backing from MPs across different parties, with Conservative former Foreign Secretary James Cleverly saying he had \"not put a foot wrong\" over the weekend.\nConservative leader Kemi Badenoch said she backed the PM's decision to fund an increase in defence spending by cutting the aid budget and added that she would support him to make further \"difficult choices - including on welfare\".\nSpeaking about the deployment of British troops, the prime minister said he did not take any such move \"lightly\" and promised MPs a vote if that happened.\nHe argued that backing Ukraine was not only \"the right thing to do\" but was also in British interests.\n\"If we do not achieve a lasting peace then the instability and insecurity that hits living standards of working people in Britain, that will only get worse and Putin's appetite for conflict and chaos, that will only grow.\"\nHe later said \"success was not guaranteed but I am not going to let up\".\nRussia has flatly rejected the idea of western troops being sent to Ukraine as part of any peace deal.\nSunday's summit in London came after an explosive spat between Trump and Zelensky at the White House last week.\nSpeaking in the House of Commons, Liberal Democrat leader Sir Ed Davey said Trump was \"no longer a reliable ally with respect to Russia\" and that it was time the UK reviewed its dependency on the US.\n\"I don't agree with him,\" replied Sir Keir, adding: \"The US and UK have the closest of relationships - our defence, security and intelligence are completely intertwined.\n\"A huge mistake at a time like this would be to suggest any weakening of that link is the way forward.\"\nLabour MP - and chairwoman of the Foreign Affairs Committee - Emily Thornberry questioned Sir Keir's decision to cut aid in order to bolster defence spending.\nShe said it was \"hard to believe\" there would be enough left in the budget to \"provide meaningful support\" and it could \"hobble\" the prime minister's attempt to show global leadership.", "url": "https://www.bbc.co.uk/news/articles/c9deq4ypx57o"}