{"authors": ["Sean Coughlan", "Ben King", "www.facebook.com"], "date_download": "2025-04-26 06:49:52", "date_modify": "2025-04-26 06:49:52", "date_publish": "2025-03-01 08:34:32", "description": "A financial lifeline for Prince Andrew from the sale of Pitch@Palace seems unlikely to go ahead.", "filename": "news_articles_c62k6zkd3g5o_1745650192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3c76/live/b2178010-f46a-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62k6zkd3g5o_1745650192.html", "title": "Prince Andrew's Pitch@Palace financial deal likely to collapse", "title_page": "Prince Andrew's Pitch@Palace financial deal likely to collapse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A deal to take over the Duke of York's former start-up business network now seems to be in doubt, sources close to the negotiations have told the BBC.\nDutch company Startupbootcamp (SBC) had held talks about buying Prince Andrew's Pitch@Palace network, a sale that could have provided him with a multi-million pound financial lifeline.\nBut sources close to SBC say despite an announcement of an intended takeover, and talk of possible funding from Bahrain, nothing has been signed and no transactions have been carried out.\nIt comes as Prince Andrew's finances have been under intense scrutiny, with questions about how he can afford to live in his Royal Lodge mansion after he was cut off financially by King Charles.\nA lucrative source of income had appeared to be on the horizon, with SBC widely reported in the UK press to be in the process of buying the contacts and network of the Pitch@Palace project.\nIn February SBC announced its plans: \"International investment group set to take over former Pitch@Palace global network.\"\nPitch@Palace had been a Dragons' Den-style pitching competition for new business ideas, set up Prince Andrew in 2014 and run by him before he stepped down from royal duties in 2019.\nSBC had said it was attracted by Pitch@Palace's legacy of contacts, with 80,000 applications from 3,000 entrepreneurial companies in more than 60 countries.\nThe Dutch firm, which has been running since 2010, helps to mentor and grow start-up businesses, particularly in the technology sector, with investments in 1,700 early-stage companies and running schemes in 27 countries.\nA takeover of the Pitch@Palace network had seemed imminent with SBC saying the partnership would be a \"fantastic opportunity\" and that it wanted to make use of a \"great, but dormant\" network of entrepreneurs. Jointly branded events had already been held.\nBut sources close to SBC now say that despite a meeting at Buckingham Palace and a positive sounding press release about seeing \"immense value in the network\", nothing was concluded.\nNo deal with Prince Andrew was ever signed or closed, and no transactions were made, whether in Europe, the Middle East or China, according to SBC's side of negotiations. Prince Andrew has been approached for comment.", "url": "https://www.bbc.co.uk/news/articles/c62k6zkd3g5o"}