{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 07:07:55", "date_modify": "2025-04-26 07:07:55", "date_publish": "2025-02-28 05:56:48", "description": "The Gillingham-born actress is best known for playing Suki Panesar-Unwin in EastEnders.", "filename": "news_articles_cgj55gy45yjo_1745651275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/818b/live/7a4ed3c0-f5ca-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj55gy45yjo_1745651275.html", "title": "EastEnders actress Balvinder Sopal guest edits BBC Radio Kent", "title_page": "EastEnders actress Balvinder Sopal guest edits BBC Radio Kent - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "EastEnders star Balvinder Sopal has taken over the BBC Radio Kent airwaves as guest editor.\nThe actress, best known for her role as Suki Panesar-Unwin, became the latest to take control of the show when she sat in the hot seat on Friday morning.\nMs Sopal, who has also featured in Coronation Street, Emmerdale and Hollyoaks, was born in Chatham and raised in Gillingham.\nDuring her time on the show she spoke about issues including literacy in Kent and ovarian cancer as well as her career in acting.\nThe 46-year-old has spent more than two decades on television screens after making her acting debut in 2001.\nSpeaking about the issue of literacy, she said: \"I think telling stories is a really important way of knowing who you are and where you come from and creating an identity for yourself.\n\"We pass on culture and information and knowledge through are stories and its very important of our communities.\"\nWhile on the show, Ms Sopal also tackled the \"silent killer\" of ovarian cancer after revealing that her mother had passed away from the disease in February 2024.\nIn an emotional segment of the show, she added: \"She had all the symptoms and we were investigating quite a bit. Before we knew it we were having to say goodbye.\n\"The reason I want to speak about OC is because the symptoms are very similar to having an upset stomach and there is absolutely the potential of misdiagnosing a patient.\"\nMs Sopal made numerous appearances in soap operas from 2009 to 2018 before being cast as Suki Panesar in 2019.\nHer most notable storyline included her on-off affair with Eve Unwin, played by Heather Peace, which won several awards.\nMs Sopal is also known for voicing Simran Kaur in the BBC Asian Network radio soap opera Silver Street.\nShe is one of a series of guest editors of BBC Radio Kent.", "url": "https://www.bbc.co.uk/news/articles/cgj55gy45yjo"}