{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:27", "date_modify": "2025-05-19 14:23:27", "date_publish": "2015-04-07 21:07:14", "description": "Fifteen police officers have been killed and five others wounded after an ambush in the Mexican state of Jalisco, prosecutors say.", "filename": "news_world-latin-america-32211367_1747664607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82172000/jpg/_82172105_police.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-latin-america-32211367_1747664607.html", "title": "Mexican police killed during ambush in Jalisco", "title_page": "Mexican police killed during ambush in Jalisco - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fifteen police officers have been killed and five others wounded in an ambush in the Mexican state of Jalisco, prosecutors have said.\nGunmen targeted the police convoy as it travelled along a highway towards the state capital of Guadalajara on Monday.\nSecurity Commissioner Alejandro Solorio called it a \"cowardly attack\".\nThe area is home to a drug cartel known as Jalisco New Generation, but Mr Solorio would not say if the gang was behind the ambush.\nIt is considered one of the most powerful cartels in Mexico and is involved in large-scale drug trafficking along the Pacific Coast.\nRaul Benitez, a security expert at Mexico's National Autonomous University, described the afternoon attack as well planned and orchestrated.\n\"A lot of gunmen were involved. They blocked the highway to surround them [police] and attacked with military superiority,' he told the Associated Press.\nThe ambush is the latest in a series of killings in the region over the past two weeks.\nOn 19 March gunmen shot dead five police officers during an attack in Jalisco. The police chief of the town of Zacoalco de Torres was also killed on Monday.", "url": "https://www.bbc.com/news/world-latin-america-32211367"}