{"authors": ["Clare Worden", "www.facebook.com"], "date_download": "2025-04-26 03:47:27", "date_modify": "2025-04-26 03:47:27", "date_publish": "2025-03-04 18:57:06", "description": "A developer has until 6 April to finalise the last agreement before the West Winch plan is approved.", "filename": "news_articles_cx29494y53no_1745639247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e443/live/d03c24e0-f8e0-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx29494y53no_1745639247.html", "title": "Progress on West Winch homes plan over legal agreements", "title_page": "Progress on West Winch homes plan over legal agreements - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Progress is being made to sign off legal agreements regarding plans to build 1,100 new homes in a Norfolk village.\nKing's Lynn and West Norfolk Borough Council approved the Hopkins Homes scheme for West Winch in August 2024.\nThe developer and council must agree on the amount of Section 106 money - which supports infrastructure - the authority will provide, addressing issues such as affordable housing provision, road improvements and school places.\nThe legal issues should have been resolved by January 2025.\nCouncillors discussed the ongoing delays during their planning committee meeting on Tuesday without members of the public present.\nThey agreed to extend the deadline for concluding the legal agreements, which they were told were \"making good progress\".\nThe council confirmed said there were three legal agreements relating to the West Winch development that needed to be agreed with Hopkins Homes.\nOne, to secure the land for a road connected the project, was signed on 27 February.\nA council spokesperson told the BBC: \"We are expecting to sign off the second agreement, which is for the wider strategic infrastructure, within a day or two.\n\"We will use the extension time to conclude the third and final agreement, which deals with site-specific aspects of the application.\"\nA spokesperson for Hopkins Homes said: \"We are aware of today's internal committee meeting regarding the West Winch development and remain fully committed to working with all parties to advance the project.\"\nThe developer has been given until 6 April to finalise the agreements after which planning permission can be granted.", "url": "https://www.bbc.co.uk/news/articles/cx29494y53no"}