{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:15:54", "date_modify": "2025-05-21 05:15:54", "date_publish": "2025-01-14 00:00:00", "description": "Yoon Suk Yeol faces insurrection charges and an impeachment trial after trying to impose martial law last month.", "filename": "news_live_c4g317rj49zt_1747804554.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c4g317rj49zt_1747804554.html", "title": "Authorities arrest president Yoon Suk Yeol after dramatic hours-long standoff", "title_page": "Authorities arrest president Yoon Suk Yeol after dramatic hours-long standoff - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for joining us\nIt has been a whirlwind few hours, as South Korean president Yoon Suk Yeol has become the country's first sitting president to be arrested.\nWe're ending our live coverage now, but here's a look at what happened in Seoul today:\nYoon had fortified his residence with barbed wire and buses ahead of today's arrest attempt, but investigators showed up with wire cutters and ladders and made their way in\nEmotions ran high as protesters gathered outside. Yoon supporters sobbed and lay on the ground upon news of his arrest, while anti-Yoon protesters cheered\nYoon is now being questioned by investigators, though the CIO has said he has exercised his right to remain silent\nWoon can now be held for 48 hours, but may be released unless investigators obtain a fresh detention warrant to detain him for 20 days. He will stay the night in Seoul Detention Centre\nAnd though Yoon may be arrested, South Korea's political crisis is far from over\nThank you for staying with us - today's live coverage was brought to you by Ayeshea Perera, Gavin Butler, Yvette Tan, Koh Ewe, Kelly Ng, Fan Wang and Tessa Wong in Singapore, Shaimaa Khalil, Rachel Lee, Leehyun Choi, Jungmin Choi and Woongbee Lee in Seoul and Sam Hancock and Aoife Walsh in London.\nYoon refuses to talk - investigators\nYoon is still being questioned by investigators at the CIO. He was first questioned this morning at around 11:00 local time, and will again be questioned this afternoon. The CIO has said that Yoon has exercised his right to remain silent.\nHe will remain detained over the night at the Seoul Detention Centre.\nWhen former presidents Park Geun-hye and Lee Myung-bak were arrested in 2017 and 2018, they were assigned solitary cells that were larger than the standard single cells, which measured 6.56 square metres (71 square feet).\nThis will likely be the arrangement for Yoon as well.\nWhat's going to happen to Yoon in the next 48 hours?\nAs we reported earlier, investigators can now hold Yoon for up to 48 hours.\nHe may be questioned, but has the right to remain silent. Yoon, who has decried the arrest as illegal, is likely to exercise this right.\nDuring this 48 hours, investigators may also request a detention warrant, which would allow Yoon to be detained and questioned for up to 20 days. This warrant has to be approved by the court.\nSome Chinese supported Yoon's impeachment - PPP lawmakers\nWhile South Korea remains locked in political turmoil, Chinese residents in the country have found themselves a talking point among Yoon's allies.\nThe ruling People Power Party lawmakers have claimed that ethnic Chinese people are supporting Yoon's impeachment and attending anti-Yoon rallies.\nIn response, China has decried these claims and warned its citizens in South Korea to stay away from political gatherings.\n\"Some politicians from the ruling party are inflating Chinese involvement to deflect domestic attention and pressure from President Yoon's impeachment,\" said Chinese state newspaper the Global Times.\nSouth Korean politics has long been divided in its attitudes towards communist powers\nThe PPP is seen to take a more hawkish stance on communist powers like China and North Korea , while the Democratic Party is said to take a more pragmatic approach of balancing Chinese and US influence.\nHow did investigators get to Yoon?\nFollowing investigators' failed arrest attempt on 3 Jan, Yoon's security service fortified his compound using barbed wire and buses as barricades.\nBut investigators and police showed up this morning with the tools to overcome these obstacles: wire cutters and ladders.\nThey bypassed the parked buses by climbing over them, and cut through barbed wire.\nWhile dozens of ruling party lawmakers formed a human wall in front of the compound to block investigators from reaching Yoon, some managed to get access to the presidential residence through a nearby hiking trail, local media reported.\nAnti-corruption agency to question Yoon on insurrection charges\nWith President Yoon Suk Yeol now under arrest, all eyes are on the country’s anti-corruption agency.\nThe Corruption Investigation Office for High-ranking Officials (CIO) will question the embattled president on charges of insurrection and abuse of power, stemming from his controversial martial law decree last month.\nDespite the CIO's historic arrest of a sitting president, however, questions remain about what they will gain from this unprecedented action.\nLawyers representing Yoon previously criticised the execution of arrest warrants issued by the CIO, calling it illegal and invalid. Some have also suggested that Yoon, the former prosecution chief of the country who knows the system well, plans to exercise his right to remain silent during the CIO's questioning.\nFollowing questioning today, Yoon is expected to be detained at the Seoul Detention Centre in Uiwang, Gyeonggi Province, approximately 5 kilometres from the CIO’s office.\nIf a court doesn't issue a detention warrant within 48 hours of Yoon's arrest, however, he will be released, and free to return to the presidential residence.\nWatch President Yoon's statement following his arrest\nIn a pre-recorded video message released by Yoon's aides this morning, the suspended president said he stopped holding out against investigators' attempts to arrest him in order to prevent a violent escalation.\nHe also maintained that the arrest was illegitimate, though.\n\"Today, when I saw them invading the security perimeter with fire equipment, I decided to appear before the CIO, even though it is an illegal investigation, in order to prevent any unsavoury bloodshed,\" Yoon said.\nHow Yoon's martial law order got him here\nFor weeks, Yoon and his allies have been grappling with the fallout from his shock martial law declaration on 3 Dec.\nYoon has repeatedly defended the short-lived order, arguing that he was attempting to protect the country's democracy from North Korea sympathisers. But opposition lawmakers say it was an act of insurrection.\nSeveral top officials have already been arrested over their roles in the martial law order, including military chiefs and ex-defence minister Kim Yong-hyun.\nThen, on 14 Dec, the opposition-dominated parliament voted to impeach Yoon - he will be removed from office if the impeachment is upheld by the constitutional court.\nUntil today, Yoon was defiant in the face of investigations and calls for his resignation. He avoided a first arrest attempt on 3 Jan by holing up in his residence, behind his security service.\nYoon's replacement as acting president, Han Duck-soo, was also impeached by parliament after refusing to accede to the opposition's demands.\nHan told the National Assembly this morning that while he felt \"sorry\" for not preventing the martial law order, the legality of Yoon's move should be judged by the court.\nRead more about the thinking behind Yoon's martial law order.\nWhat's next for Yoon?\nFrom the moment of the arrest, the clock started ticking for investigators.\nThey can now hold Yoon for up to 48 hours, or obtain a detention warrant within this period to detain him while he is investigated. If the court refuses to issue another warrant, Yoon will be released.\nIn the case of a detention warrant, Yoon can be detained for up to 20 days before being brought to trial.\nOnce indicted, prosecutors may request that Yoon be tried under detention, which can last up to 6 months.\nA nation gripped by uncertainty\nRachel Lee\nReporting from Seoul\nSouth Korea’s politics, long marked by stark divisions between conservatives and progressives, have descended further into chaos following the recent impeachment and arrest of former President Yoon Suk Yeol.\nYoon is now at the Gwacheon Government Complex where the Corruption Investigation Office (CIO) is located, after a successful second attempt to execute an arrest warrant.\nThe arrest comes amid allegations of insurrection against Yoon, who declared martial law on 3 Dec.\nThe ensuing political crisis has intensified tensions between the former president's supporters, who protested against the CIO's actions, and his opponents, who celebrated when authorities successfully carried out the arrest.\nThe contrasting scenes reflected the deepening polarisation in South Korea. While Yoon’s opponents cheered his detention, his supporters vowed to continue their fight, insisting that the arrest marked only the beginning of a protracted struggle.\nAs the former president faces questioning over the charges, the nation remains gripped by uncertainty, with no clear resolution to the widening political divide.\nThis is not the end of the political crisis\nShaimaa Khalil\nreporting from Seoul\nI’m standing in the middle of two very different crowds.\nThe anti-Yoon crowd blasted out a \"congratulations and celebrations\" song at the announcing of Yoon’s arrest. There are cheers and claps now at what they see as a success for law enforcement.\nThe atmosphere is completely different on the other side.\n“We are very upset and angry - the rule of law has broken down,\" a Yoon supporter tells us, echoing what the president said in his video message.\nInvestigators and police say they’ve arrested the president, while he and his team are framing it as a voluntarily appearance for questioning.\nWhichever way you look at it, this is a remarkable day in South Korean politics. For the first time in the country’s history, a sitting president has been arrested.\nThis, however, doesn’t end the crisis. Rather, it is just another phase in this unfolding political drama.\nYoon: 'This is an illegal investigation but I will comply'\nIn a video statement, newly arrested president Yoon Suk Yeol says he has agreed to appear before the Corruption Investigation Office, which is leading the case against him.\n\"I decided to appear before the CIO, even though it is an illegal investigation, in order to prevent any unsavoury bloodshed,\" he says.\n\"However, this does not mean that I approve of their investigation.\"\nIn the short video - coming in just under 3 minutes - he said that the rule of law in the country had broken down, and that neither the agencies investigating him, nor the courts issuing them arrest warrants, had the power to do so.\nHe ended by saying \"although these are dark days... the future of this country is hopeful\".\n\"To my fellow citizens, I wish you all the best and stay strong. Thank you.\"", "url": "https://www.bbc.com/news/live/c4g317rj49zt"}