{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 03:56:12", "date_modify": "2025-05-21 03:56:12", "date_publish": "2025-01-15 00:00:00", "description": "The Conservative leader says the government has launched an \"unprecedented borrowing spree\".", "filename": "news_live_c1lvg65q765t_1747799772.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1lvg65q765t_1747799772.html", "title": "Keir Starmer and Kemi Badenoch clash over UK economy at PMQs", "title_page": "Keir Starmer and Kemi Badenoch clash over UK economy at PMQs - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Starmer pressed on economy, minister's resignation and political judgement\nAsya Robins\nLive reporter\nKeir Starmer faced Prime Minister's Questions today under pressure on several fronts, including the economy and his handling of the resignation of Treasury minister Tulip Siddiq.\nOpposition leader Kemi Badenoch pressed him repeatedly on both of these issues, accusing Labour of going on an \"unprecedented spending spree\" with its October Budget, which she said had raised borrowing costs and taxes for businesses.\nStarmer insisted his government was taking the difficult decisions needed to bring growth and stability, and hit out at the Conservatives' record in government, calling them \"economic vandals and fantasists\".\nBadenoch also questioned Starmer over Siddiq, who resigned as a Treasury minister after an ethics investigation into Siddiq's links to an anti-corruption probe in Bangladesh, which we explained a little earlier.\nThe Conservative leader asked the prime minister if he would offer Bangladesh the support of the UK's crime agency in their ongoing investigation, which Starmer did not directly answer. He did however say that his independent standards adviser had concluded there was no breach of the ministerial code and no wrongdoing by Siddiq.\nSo, a big week for the Treasury, which our political editor Chris Mason looks at in this pithy analysis. For now, though, that's it from us - join us for another PMQs next week.\nTrump has right to consider Chagos deal, says No 10\nWe've an update now on something that was raised by Tory leader Kemi Badenoch at Prime Minister's Questions - the future of the Chagos Islands.\nThe UK's planned handover of the Chagos Islands to Mauritius should be considered by incoming US President Donald Trump before it goes ahead, Downing Street says.\nAt a briefing this afternoon, Keir Starmer's official spokesman tells reporters No 10 \"will only agree to a deal that is in the UK's best interests\" - and that it's \"obviously now right\" Trump's government is given the time to discuss the deal.\nUnder the terms of the original agreement, which was announced in October, the UK would relinquish sovereignty to Mauritius over the archipelago but maintain a 99-year lease for Diego Garcia, home to a major UK-US military airbase.\n\"We are committed to working with the Mauritius government,\" the spokesman adds.\nWhat's Tulip Siddiq alleged to have done?\nBy Anthony Reuben\nAt PMQs, Keir Starmer stressed that his independent standards adviser had concluded \"there was no breach of the [ministerial] code... there was no wrongdoing\" by former Treasury minister Tulip Siddiq.\nSiddiq resigned nonetheless, while insisting she had done nothing wrong, saying that continuing in her role would be \"a distraction from the work of the government\".\nLaurie Magnus, the independent adviser on ministerial standards, said in his report to the prime minister it was \"regrettable that she was not more alert to the potential reputational risks\" from her family’s political role in Bangladesh.\nHer aunt was ousted last year as the country’s prime minister and Siddiq has been named in a corruption investigation into the aunt by Bangladesh's Anti-Corruption Commission.\nA spokesperson for Siddiq said: \"No evidence has been presented for these allegations. Tulip Siddiq has not been contacted by anyone on the matter and totally denies the claims.\"\nMagnus also said there was an \"unfortunate misunderstanding\" about who had bought Siddiq a flat in Kings Cross, which had led to the public being \"inadvertently misled\".\nWhile he concluded that she had not breached the ministerial code, he also suggested Starmer would \"want to consider her ongoing responsibilities\".\nAre higher borrowing costs a 'global' problem?\nBy Ben Chu, BBC Verify policy and analysis correspondent\nChallenged on the rise in UK borrowing costs since the Budget, Keir Starmer said: \"The global economy is experiencing higher borrowing costs.\"\nIt’s correct that borrowing costs are up across most developed countries over the last month, not just the UK.\nAnalysts say this likely reflects a sell-off in US government bonds in anticipation of Donald Trump’s potentially inflationary economic policies. The US market moves are, in effect, driving moves in other national markets.\nHowever, UK borrowing costs have risen by slightly more than those of other countries over the last month.\nIn the UK, 10-year borrowing costs have risen by 38 basis points since 15 December 2024. That’s more than in the US (36 basis points), Germany (37 basis points) and Japan (21 basis points).\nAnalysts say that relative weakness for the UK could reflect that UK government bonds are seen as less desirable to investors, perhaps due to the UK government’s relatively high levels of borrowing from abroad and the economic outlook.\nNHS problems will keep happening until social care fixed, warns Davey\nLib Dem leader Sir Ed Davey is on his feet now.\nHe says patients are suffering through the \"worst NHS winter crisis on record\", adding 54,000 people waited for more than 12 hours in A&E.\nHe says health leaders say this will keep happening until social care is fixed.\nWill the PM scrap the three-year timetable he's given in the Casey Commission so that we can fix social care, he asks - pointing out he asked the same question last week, and was disappointed with the answer.\nStarmer says the Tories left the NHS on its knees - \"there's no point groaning\", he says to the opposite benches. He then says Labour is trying to turn that around - but avoids the question about social care.\nThe tussle for economic credibility is on\nChris Mason\nPolitical editor\nThe economic landscape - perhaps unsurprisingly - was the backdrop to the exchanges between the prime minister and the Conservative leader.\nIt will be the backdrop to our politics for years to come.\nThe arguments were familiar - Sir Keir Starmer focused on \"kickstarting economic growth\" and Kemi Badenoch talking about the government’s \"unprecedented borrowing spree\".\nYet again, Starmer pointed towards the likelihood of the government spending less than it had intended if the cost of borrowing remains high.\nThe government, he said, has an \"iron-clad commitment to our fiscal rules\" and the country can’t \"tax our way out of problems\".\nHe branded the Conservatives \"economic vandals and fantasists\".\nBut Badenoch could point out that the country is spending more on debt interest than on schools and universities.\nThe tussle for economic credibility is on, with the scrutiny now primarily focused on Labour after years of it being primarily on the Tories.\nCan the country afford four more years of Labour?\nBadenoch says Starmer failed to answer her question about the Bangladesh investigation. And for her final question she moves onto former Sinn Féin president Gerry Adams, calling the saga shameful.\nBadenoch goes on to say the Tories left him the fastest growing economy in the G7 and says jobs and growth are down, mortgage rates up and business confidence down. She asks if the country can afford four more years of Starmer's \"terrible\" judgement.\nStarmer calls the question a \"barrage of complete nonsense\" and says the Tories \"crashed the economy\" - but he answers the part on Adams, saying it relates to the Legacy Act and Labour is working on replacement legislation.\nFor context: Adams is in line for \"a pay day from the taxpayer\" under plans to repeal the Legacy Act, a report backed by several peers has stated.\n'Reeves will be chancellor for many, many years'\nBadenoch sticks to the Chagos Islands topic, saying \"there's no one he can blame for this dud deal\" before moving on to - once again - question Reeves's record as chancellor.\nAfter a brief interruption from the Speaker of the House, the Tory leader challenges the chancellor's attempt to defend her Budget, as Reeves did yesterday.\nShe asks Starmer whether he's ready to support Reeves going forward and demands reassurances that there'll be \"only one Budget this year\".\nThe prime minister says he believes the chancellor will be in place for \"for many, many years to come\", adding Labour is committed to \"strong fiscal rules\" - unlike the Conservatives.\nFor context: Reeves has faced criticism over her Autumn Budget, with economists and retailers arguing measures introduced, such as the increase in employers' National Insurance contributions, will spur inflation.\nStarmer now asked about 'surrendering' Chagos Islands\nBadenoch responds, saying borrowing costs were last week at a 27-year-high for 30-year gilts.\nUK government bonds - known as \"gilts\" - are normally considered very safe, with little risk the money will not be repaid. They are mainly bought by financial institutions, such as pension funds. Interest rates - known as the yield - on government bonds have been going up since around August.\nShe then switches to the issue of British territory the Chagos Islands and asks if the PM thinks the British people should pay to \"surrender something that is already ours\".\nStarmer says Labour inherited a tricky situation but the new deal ensures continued operation of the base.\nFor context: Under an agreement announced in October, the UK would hand sovereignty over the Chagos islands to Mauritius, but maintain a 99-year lease over the UK-US military airbase on the largest island, Diego Garcia. Get up to speed with the details of that story here.\nWill Starmer rule out tax rises?\nBadenoch's second question focuses on the British Retail Consortium saying today that two thirds of businesses will have to raise prices to cope with the government's tax hike.\nShe then accuses the Chancellor Rachel Reeves of an \"unprecedented borrowing spree\".\nThe Conservative leader says businesses will raise prices, energy policies will drive up bills, while the UK is spending more on debt interest than on schools and universities.\nShe asks if Starmer will rule out tax rises this year\nStarmer says Labour took \"right and difficult decisions\", which the Tories failed to and that there are limits to what he can say now at the despatch box.\nHe repeats that Labour's committed to its Budget promises and growing the economy - something he says the Tories failed to do", "url": "https://www.bbc.com/news/live/c1lvg65q765t"}