{"authors": ["Jim Reed", "www.facebook.com"], "date_download": "2025-04-26 03:38:13", "date_modify": "2025-04-26 03:38:13", "date_publish": "2025-03-05 01:44:08", "description": "Testing for PSA protein can indicate whether a man is at risk of prostate cancer.", "filename": "news_articles_cgl00gn15y8o_1745638693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a739/live/2e7aac70-f5b2-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl00gn15y8o_1745638693.html", "title": "Prostate cancer: Rapid at-home PSA tests spark concerns", "title_page": "Prostate cancer: Rapid at-home PSA tests spark concerns  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At-home tests for men worried about prostate cancer can give inconsistent and inaccurate results, BBC News has found.\nThe tests, which resemble a Covid lateral flow strip, turn positive if a high level of a protein called PSA is detected in a drop of blood.\nOf five rapid tests analysed by the BBC, one did not work, three were negative or all-clear, but one returned a false positive result - all from the same blood sample.\nProstate Cancer UK said it had significant concerns about the sale of the tests given their \"questionable accuracy\" and the absence of a doctor to interpret the results.\nThere is no national prostate cancer screening programme in the UK, unlike for breast, bowel and cervical cancer.\nInstead, the onus is on men to request a blood test from their GP once they are over 50 years old, external, or from 45 for higher risk groups.\nThat NHS test, which is processed in a laboratory, measures the level of PSA released by the prostate, a small gland involved in the production of semen.\nA high PSA level does not mean you have cancer but is a warning sign which can then lead to further scans and tests to rule out the disease.\nPSA levels can be high for a number of other reasons - including an infection, recent vigorous exercise or sex - or in some rare cases remain normal despite cancer.\nGoogle search data suggests interest in testing has risen sharply since the Olympic cyclist Sir Chris Hoy went public with his own diagnosis in October 2024.\nDozens of companies now sell self-testing kits designed to measure PSA levels.\nThey are available online and from some pharmacies and convenience stores with prices from £6 to £95.\nThey come in two main types:\ntests in which a blood sample is taken at home and posted to a private laboratory for analysis\nrapid tests which give a result in minutes and display a dark line if PSA is detected above a certain level\nThe BBC analysed five rapid tests all bought online from different companies, using a blood sample taken on the same day.\nThe UK medicines regulator, the MHRA, says in its guidance that over-the-counter PSA kits are \"not a reliable indicator of prostate cancer\" and must not \"claim to detect cancer\".\nInstead, some at-home tests are marketed online as a way to \"screen\" for the disease, language the regulator says would be acceptable under the current rules.\nOthers are sold to \"monitor prostate health\" or identify \"potential prostate issues early\".\nOne of the home tests ordered by the BBC also arrived in packaging and with instructions clearly marked \"for professional use only\".\nFor someone with no medical experience, the kits can be difficult to use.\nA disposable lancet must pierce the skin, before drops of blood can be sucked into a pipette, mixed with a chemical and placed in the test cassette.\nOf the five kits analysed by the BBC, one did not produce a readable result; three came back all clear; but one did show a solid dark line, indicating a PSA level above 4.0 ug/l.\nA private blood test taken the same day and sent to a laboratory showed a much lower reading of 0.27 ug/l.\n\"As your experience shows, these rapid tests appear to have questionable accuracy,\" says Amy Rylance, assistant director of health improvement at Prostate Cancer UK.\n\"That's a big problem because they can falsely reassure people who really do have elevated levels of PSA and should seek further testing, or they can cause undue worry among people who are absolutely fine.\"\nOnline reviews appear to bear that out.\nIn one, a customer posted that he was \"really scared\" after two rapid home tests indicated a high PSA level. A later NHS test showed his reading was normal.\nIn another one-star review, a woman wrote that her husband took two home tests for \"peace of mind\" and both were negative. An NHS blood test then showed high levels of PSA and he was diagnosed with stage four prostate cancer.\nThe British In Vitro Diagnostics Association, which represents the blood testing industry, says that while home tests are appropriate in many circumstances, \"this particular type of [PSA] test may not give an accurate indication of prostate health when taken outside the NHS\".\nInstead it says men concerned they may have cancer should see their GP.\nProstate Cancer UK describes the growth of home testing as \"the symptom of a wider problem\".\n\"Too many men still don't realise they can access tests through a GP and the guidelines for doctors are dangerously outdated,\" says Amy Rylance from the charity.\nSir Chris Hoy has been calling for the age to be lowered at which those at higher risk, such as black men or those with a family history, can ask their GP for PSA testing.\nThe government says current guidelines should not stop doctors from offering a test under the age of 50, but critics say the rules are unclear and there are huge variations in diagnosis rates between GP surgeries.\nProstate Cancer UK has also been calling for a change to allow medics to proactively talk to higher risk patients about the pros and cons of testing instead of waiting for them to come forward.\nA spokesman for the Department of Health says it has asked the UK National Screening Committee, which advises the NHS, to review the evidence on testing, with a response expected later this year.\n\"Prostate cancer patients are waiting too long for diagnosis and treatment but through our National Cancer Plan we will transform the way we treat cancer,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cgl00gn15y8o"}