{"authors": ["Charlotte Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 03:46:02", "date_modify": "2025-04-26 03:46:02", "date_publish": "2025-03-05 06:07:40", "description": "If approved, Raver Tots would be held as part of a weekend of events in Old Deer Park in August.", "filename": "news_articles_c15qqvwz998o_1745639162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/395a/live/798869d0-f4f6-11ef-ab77-6b27a1316238.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qqvwz998o_1745639162.html", "title": "Richmond: Family friendly festival planned for Old Deer Park", "title_page": "Richmond: Family friendly festival planned for Old Deer Park - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A family-friendly music festival could be coming annually to a park in south-west London.\nThe event called Raver Tots would be held as part of a weekend of events in Old Deer Park in August, and return in future years, if the plans proposed are approved by Richmond Council.\nAgent Edward Chaplin told the council's licensing committee the events would provide a \"family-friendly setting that wouldn't be available anywhere else\".\nResidents have raised concerns that granting a permanent licence could cause problems in the future.\nOrganiser Park Live Events wants to hold a film-themed event with a live orchestra to kick off the weekend on 29 August.\nThe next day's event, on 30 August, would see a variety of singers and bands performing.\nThe festival would take place as the headline event on 31 August, featuring an open-air dancefloor, DJs, free funfair rides, stalls, street food and games for families.\nThe event, that goes by the brand name Raver Tots, is also taking place in Barnet, Bexleyheath in London as well as Bristol and Brighton.\nMr Chaplin told the licensing committee on 24 February the company wanted to hold the events annually to benefit local families, according to the Local Democracy Reporting Service.\nMr Chaplin said: \"It's an opportunity for families and children to enjoy this type of entertainment at a lower scale than you'd normally see at an event or concert.\nHe added: \"This tried-and-tested event will be and is well managed, and is a safe and successful cultural and entertainment facility for the residents and families of Richmond and surrounding areas.\"\nOld Deer Park Working Group, which represents five residents' associations, said in a letter that it would be \"inappropriate\" to grant a permanent licence for the events.\nPeter Willan, representing the working group, told the committee that members supported the events but wanted to minimise risks.\n\"While Park Live may be very respectable and continue as they have set out today, things can change,\" he said.\nRichmond Council will publish its decision on the plans in due course.", "url": "https://www.bbc.co.uk/news/articles/c15qqvwz998o"}