{"authors": ["Shelagh Parkinson", "www.facebook.com"], "date_download": "2025-04-26 03:45:48", "date_modify": "2025-04-26 03:45:48", "date_publish": "2025-03-05 06:12:41", "description": "More than 500 false claims for council tax discounts have been discovered since 2023 in Blackpool.", "filename": "news_articles_cj3nry77d08o_1745639148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e269/live/18d58d90-f93b-11ef-9335-49fc611b7783.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3nry77d08o_1745639148.html", "title": "Council tax fraud claims worth £290k uncovered", "title_page": "Blackpool Council tax fraud claims worth £290k uncovered - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fraud investigators have clawed back £290,000 in false claims for council tax discounts, with the money set to be invested back into public services.\nThe money has been returned to Blackpool Council budgets after staff uncovered hundreds of false claims by comparing data records.\nThe council took part in a national campaign to catch people who wrongly claim the discounts usually by falsely claiming to live alone or by claiming they qualify for lower bills due to a low income.\nNow residents are being warned there will be a \"zero tolerance\" approach to this type of fraud in the future.\nThe project, a Cabinet Office anti-fraud exercise, works by comparing data held by the local authority with other information such as the electoral register or credit reference data.\nSince April 2023 the fraud team found 539 incorrect claims for single person discount and/or council tax reduction totalling £284,372.\nCouncillor Bradley Mitchell, chairman of the authority's audit committee, said such fraudulent activity puts strain on budgets.\n\"It limits the council's ability to provide frontline services to our residents who are doing the right thing, especially for those who need it most,\" he said.\n\"Blackpool Council has a zero-tolerance approach when dealing with fraud. The corporate fraud and investigations team will continue to undertake these exercises to prevent and detect fraud within Blackpool.\"", "url": "https://www.bbc.co.uk/news/articles/cj3nry77d08o"}