{"authors": ["Jess Warren", "www.facebook.com"], "date_download": "2025-04-26 07:07:43", "date_modify": "2025-04-26 07:07:43", "date_publish": "2025-02-28 06:00:23", "description": "Sir Sadiq Khan hopes pedestrianising Oxford Street will increase visitor numbers and create jobs.", "filename": "news_articles_c2ljjk89qy1o_1745651263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/69cf/live/2832d5c0-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ljjk89qy1o_1745651263.html", "title": "Oxford Street: Pedestrianisation consultation launched", "title_page": "Oxford Street: Pedestrianisation consultation launched - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Londoners are being asked for their views on the potential pedestrianisation of Oxford Street.\nSir Sadiq Khan hopes that altering the famous shopping street will increase visitor numbers, create jobs, and boost growth for London.\nThe consultation is the mayor's latest attempt to change the street; his attempt in 2018 was blocked by the then Conservative-run local authority.\nLast year following the general election, the Labour government gave the mayor planning powers to create a Mayoral Development Corporation (MDC) around Oxford Street, allowing him to take control of the area away from Westminster City Council.\nThe exact boundaries of the proposed area have not yet been announced as the MDC's formation is part of the consultation.\nSir Sadiq said: \"Oxford Street has been known as the nation's high street but the area has suffered in recent years.\n\"My proposals are designed to unlock the true potential of Oxford Street and deliver a world-class, accessible, clean, avenue.\n\"These proposals would help to restore this famous part of the capital and support good businesses, while creating new jobs and boosting growth.\"\nKarim Fatehi, CEO of the London Chamber of Commerce and Industry, urged businesses to participate in the consultation.\nAdam Hug, leader of Westminster Council, said: \"Subject to the outcome of the mayor's consultation, our role is to ensure that the mayor's proposed Oxford Street transformation delivers for local communities, as well as for London.\n\"We have already fought hard to secure numerous improvements from the mayor of London to ensure that any plans for Oxford Street are deliverable and meet the needs of local residents, businesses, and wider London.\"", "url": "https://www.bbc.co.uk/news/articles/c2ljjk89qy1o"}