{"authors": ["Lisa Young", "www.facebook.com"], "date_download": "2025-04-26 06:34:53", "date_modify": "2025-04-26 06:34:53", "date_publish": "2025-02-27 06:18:53", "description": "The Guernsey Farmers' Association says the funds will help protect the dairy industry.", "filename": "news_articles_c0mw173710wo_1745649293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/220a/live/4f79a1a0-f45a-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw173710wo_1745649293.html", "title": "Dairy farmers in Guernsey welcome States funding promise", "title_page": "Dairy farmers in Guernsey welcome States funding promise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Guernsey's dairy farmers have welcomed a planned funding boost from the States.\nThe Committee for Environment and Infrastructure (E&I) has agreed to bring forward proposals to increase the dairy farm support scheme budget from about £1m to £2.35m by 2026.\nGuernsey Farmers' Association president Michael Bray said the investment would \"help to protect the industry for the next generation\".\nDairy farmer Josh Dorey said rising costs in recent years had driven profitability down \"so it's really important we've got this increase in subsidy\".\nThe 31-year-old farms 200 cows and about 100 young stock at La Petite Croute Farm in the Castel - the largest dairy farm in Guernsey.\nHe said: \"The funding makes me feel more optimistic about the future of Guernsey farming, especially for me as a younger farmer.\n\"The strong support we've had from the States Assembly makes me feel quite positive for the future.\"\nMr Bray thanked deputies for their recognition of farmers' work \"protecting our island's heritage, local breed and countryside environment\".\nHe said the funding would allow farmers to carry out the government's environmental policies.", "url": "https://www.bbc.co.uk/news/articles/c0mw173710wo"}