{"authors": ["Basillioh Rukanga", "www.facebook.com"], "date_download": "2025-04-26 03:53:29", "date_modify": "2025-04-26 03:53:29", "date_publish": "2025-03-03 08:26:21", "description": "President Umaro Sissoco Embalo has not responded to accusations that he threatened to expel the Ecowas team.", "filename": "news_articles_c7781k8kdeko_1745639609.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c7d/live/8b305bc0-f802-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7781k8kdeko_1745639609.html", "title": "Guinea-Bissau election row: Ecowas mission leaves over President Umaro Sissoco Embalo 'threats'", "title_page": "Guinea-Bissau election row: Ecowas mission leaves over President Umaro Sissoco Embalo 'threats' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The West African regional bloc, Ecowas, says a mission deployed to Guinea-Bissau to help resolve an election dispute has left the country after the president threatened to expel it.\nThe team was sent in last month to help reach a \"political consensus\" on how to hold elections this year.\nGuinea-Bissau's general elections had been scheduled for last November but President Umaro Sissoco Embalo postponed them. He has since announced 30 November this year as the new date.\nThe opposition has opposed the delay and said Embalo's term should have expired last week, although a Supreme Court ruling recently extended his term in office to September.\nIn a statement on Sunday, Ecowas said its team had met Embalo, other politicians and civil society groups to try to reach a consensus on when the elections should be held.\nEcowas said its team, together with the UN Office for West Africa and the Sahel (Unowas), had been deployed to the country from 21-28 February.\nIt said it had \"prepared a draft agreement on a roadmap for elections in 2025 and had started presenting it to the stakeholders for their consent\".\nThe team however \"departed Bissau in the early morning of 1st March, following threats by [President] Umaro Sissoco Embalo to expel it\", it said.\nThe president has not responded to the bloc's accusation.\nThe bloc says it will now present its report to the Ecowas president, including a proposal for an agreement leading to \"inclusive and peaceful elections\".\nEmbalo was elected for a five-year term in December 2019, and the standoff over when it should end has heightened tensions in a country that has experienced several military coups since independence in 1974.\nThere have been two attempts to overthrow Embalo, the latest in December 2023.\nThis led him to dissolve the opposition-dominated parliament.\nThe opposition on Thursday called for a nationwide strike, on the day they said the president's term was expiring, with the government deploying security forces across the capital.\nA day earlier, Embalo visited Moscow for talks with Russian President Vladimir Putin.", "url": "https://www.bbc.co.uk/news/articles/c7781k8kdeko"}