{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:07:23", "date_modify": "2025-04-26 08:07:23", "date_publish": "2025-02-26 14:21:08", "description": "Diana Warner is convicted of obstruction after stopping a freight train outside Drax power station.", "filename": "news_articles_c871dnyv1yvo_1745654843.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5d04/live/5d403bf0-f44b-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c871dnyv1yvo_1745654843.html", "title": "Drax climate protest GP guilty of obstructing power station railway", "title_page": "Drax climate protest GP guilty of obstructing power station railway - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A retired GP who stopped a train heading for the UK's biggest power station has been found guilty of obstructing the railway.\nClimate protester Dr Diana Warner was walking down the line outside Drax power station near Selby waving an orange flag when a freight train stopped on 14 December 2021, Leeds Crown Court heard.\nWarner had told the jury how she went to the line to protest about Drax's contribution to the climate emergency and deforestation.\nWarner, 65, of Filton Avenue in Filton near Bristol, was convicted by a jury on Wednesday. She was bailed to be sentenced on 25 March.\nDuring deliberations on Tuesday afternoon, the jury asked Judge Guy Kearl KC, the Recorder of Leeds, for advice, saying \"as a matter of conscience we are finding it difficult to come to a verdict\".\nJudge Kearl told jurors: \"You have all taken an oath or affirmation to try this case on the evidence, not your conscience.\"\nThey returned a unanimous guilty verdict to the single charge of obstructing an engine or carriage using a railway, contrary to the Malicious Damage Act 1861.\nWarner said that on the day of the incident she had been due to attend the High Court for allegedly breaking an injunction by joining an earlier protest on the M25 by campaign group Insulate Britain.\nShe said she had hoped to draw \"attention\" to wood-burning practices at Drax, as well as the wider climate emergency, by stopping the train on a day she was due in court.", "url": "https://www.bbc.co.uk/news/articles/c871dnyv1yvo"}