{"authors": ["Vincent Dowd", "www.facebook.com"], "date_download": "2025-05-19 15:36:25", "date_modify": "2025-05-19 15:36:25", "date_publish": "2015-02-20 11:10:46", "description": "British screenwriter Justin Webb speaks for the first time to give his side of the story after criticisms from director Ava DuVernay", "filename": "news_entertainment-arts-31539526_1747668985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81115000/jpg/_81115974_tomwilkinsondavidoyelowo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31539526_1747668985.html", "title": "Oscars: Selma writer tells his side of row with director", "title_page": "Oscars: Selma writer tells his side of row with director - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For years British screenwriter Paul Webb had tried to persuade Hollywood that a film about Dr Martin Luther King, President Lyndon B Johnson (LBJ) and the fight for black rights in 1960s America would be a hit. This weekend his film Selma is one of eight movies nominated at the Oscars in the best picture category.\nThe story focuses on the 1965 marches from the town of Selma in Alabama to the state capital Montgomery, protesting at the effective disenfranchisement of African Americans in the Deep South at that time.\nThe film shows how crucial Dr King was to those marches and to the passing of the 1965 Voting Rights Act - legislation which President Johnson had thought could wait.\nThe film's credits list Mr Webb as sole screenwriter but the director Ava DuVernay has been openly critical of the script she inherited and has said she rewrote the film extensively., external\nSpeaking out for the first time, Mr Webb has given the BBC his side of the story.\nI wrote a draft of the film Lincoln for Steven Spielberg. The consultant was the American historian Doris Kearns Goodwin and I and my wife got to know her and her husband Dick.\nMany years before, Dick Goodwin had worked for President Johnson's administration and is famous for having written LBJ's famous speech on voting rights in 1965. Dick wrote it overnight when LBJ made a snap decision to call a joint session of Congress.\nHe said he needed it to convince Congress the country needed the bill enacted very soon. And then Dick told me a story about Alabama's right-wing Governor George Wallace coming to lobby the president and how Johnson was a real force of nature with him.\nSo I decided here was the story I wanted to tell. I started reading about the era and about Johnson.\nBut I soon realised that the man who had made it necessary to pass the legislation so urgently was Martin Luther King. The story which needed telling was the Selma voting rights campaign, in which he was central.\nI read everything I could get my hands on about Martin Luther King but I knew I wanted to avoid making him a conventional, almost sublime heroic figure.\nBecause Johnson was real and visceral and in a drama he would have wiped the floor with a character like that. King was flawed and he was complex and magnificent.\nFinally the thing which really captivated me about Dr King was the sheer moral and physical courage of the man. That man knew every time he got out of a car that someone could kill him.\nAs I started to get into it, King took over. He took centre stage and dominated with Johnson now pushed more to one side.\nDr King has about 650 lines in my original script and Johnson has just over 400. That gives you some idea: it's Dr King's story.\nJohnson did say after the triumph of his speech to Congress that people will say Martin Luther King wrote that speech on the streets of Selma. And in my script he adds 'And they'd be right'. LBJ had the political nous and the realism to grasp that.\nNot at the time - but maybe it's become an issue now. When I started working on this with my producer Christian Colson, we were both relatively naive.\nBut our naivety produced a script which Michael Mann wanted to be on board - and at different times Stephen Frears and Paul Haggis and Spike Lee.\nEvery one of them hoped their reputation and enthusiasm would generate enough belief from the financiers but one by one they had to drop away. It went on for years.\nThose claims are highly exaggerated. Ava is someone I spent some time with and I like and admire her: she's a very talented woman.\nShe has told the story very well though it's not quite the story she was given. There has been a controversy in the States regarding the depiction of President Johnson so I'll restrict my comments to that issue alone, as it's an issue we can be relatively objective about.\nVery. I feel Ava reduced Johnson in her depiction to a racist. And dramatically he's a bit of a punch-bag. The relationship that occurred between those two men was much, much more dynamic than that.\nThe problem is with turning Johnson into someone who was against voting rights and against the Selma campaign. Certainly Johnson found the Selma campaign very difficult to handle - it made life uncomfortable for him and he wanted to deal with voting rights the following year (1966).\nHe had a lot of social reforms on his desk which he wanted to get moving first and which were less contentious.\nNow Dr King wasn't in a position to oblige him: he was obligated to his own constituency. So these guys who'd been partners the year before on the 1964 Civil Rights act, which ended segregation, then came into conflict over Selma.\nBut that is not to say Johnson was against the very idea of civil rights. He was passionate about voting rights.\nNo, because that isn't what happened. I know Ava has said she didn't want a white saviour movie but it never was a white saviour movie.\nIt was about the courage and genius and leadership of Martin Luther King driving the most powerful man in the world into a corner.\nAnd Johnson just had to say, okay you win. It was Johnson's finest moment and King had driven him to that height.\nThe movie kind of throws that away now.", "url": "https://www.bbc.com/news/entertainment-arts-31539526"}