{"authors": ["Phil Cunliffe", "Shyamantha Asokan", "www.facebook.com"], "date_download": "2025-04-26 07:34:42", "date_modify": "2025-04-26 07:34:42", "date_publish": "2025-02-27 15:30:46", "description": "Richard Burrows is on trial over allegations of abuse between the late 1960s and mid-1990s.", "filename": "news_articles_cqjdvjy918po_1745652882.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f074/live/caee0610-f481-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdvjy918po_1745652882.html", "title": "Former Cheshire scout leader admits to being paedophile at trial", "title_page": "Former Cheshire scout leader admits to being paedophile at trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former boarding school housemaster and scout leader has admitted to being a paedophile during a cross-examination at his trial.\nRichard Burrows is on trial over allegations that he abused boys between the late 1960s and mid-1990s, while working at a school in Cheshire and later as a scout leader in the West Midlands.\nMr Burrows has previously admitted 43 out of 105 charges, the prosecution has not offered evidence for eight counts and he denied the remaining 54.\nWhen prosecution barrister Mark Connor suggested to Mr Burrows that admitting to those charges meant he was a paedophile, he replied: \"Yes, if you say so.\"\nMr Burrows, now aged 80, wore a grey prison tracksuit and walked with the aid of a stick as he took the stand at Chester Crown Court on Wednesday.\nHe was arrested at Heathrow Airport last year after almost three decades on the run, having failed to appear at his trial over alleged child sex offences at the same court in 1997.\nThe allegations against Mr Burrows partly relate to his time as a housemaster at Danesford School in Congleton, Cheshire, between 1969 and 1971.\nThe alleged incidents during his time with scout groups are said to have taken place in Sutton Coldfield and Streetly and on trips to Wales, Ross-on-Wye, the Cotswolds and London.\nOn Wednesday, the defence put evidence of abuse by his accusers to Mr Burrows.\nOn every occasion he either said he could not remember or denied what was put to him, saying: \"That's not true\".\nWhenever it was alleged he had committed the more serious offence of rape, he said: \"No, that's degrading and disgusting.\"\nThe 50 counts he has denied include indecency with a child, indecent assault and an offence type now regarded as rape.\nMr Burrows, who previously lived in Birmingham, was asked by the prosecution why he had gone on the run and relocated to Thailand for several years.\nHe said this was because \"the number of charges weren't me – I hadn't done them\", and he had chosen Thailand because he could go sailing.\nHe added that he wanted to come home after 27 years because he had run out of money.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/cqjdvjy918po"}