{"authors": ["David McKenna", "www.facebook.com"], "date_download": "2025-04-26 03:43:29", "date_modify": "2025-04-26 03:43:29", "date_publish": "2025-03-05 08:52:03", "description": "About £880,000 will be spent on a number of schemes, including Grantham Museum and the Market Place.", "filename": "news_articles_c5y2ggq844qo_1745639009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/079d/live/ba7a98b0-f919-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y2ggq844qo_1745639009.html", "title": "Cash for Grantham town centre improvements announced", "title_page": "Cash for Grantham town centre improvements announced - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans have been announced for an £880,000 town centre improvement scheme in a Lincolnshire market town.\nSouth Kesteven District Council has approved plans for a number of projects in Grantham including the installation of power to Market Place and Westgate along with planters, benches and cycle parking.\nWork to mitigate damp and improve environmental conditions for exhibits at Grantham Museum has also been agreed.\nOfficials said the scheme would be funded using money left over from other projects funded through the government's Future High Streets Fund.\nOther proposals include new signs for the railway station and other points of interest along with improvements to the public space and the conservation area of the cultural quarter.\nAt a meeting of the council's cabinet, council leader Ashley Baxter said: \"The prospect of even more investment in Grantham town centre is great news for residents, businesses and visitors.\n\"These projects will be funded from a windfall resulting from an underspend against the budget for the recent Market Place and Station Approach improvement works,\" he added.\nWork was completed in the market area in September last year after complaints of traffic chaos caused by multiple roadworks in the centre of the town.\nLast week, the council offered businesses a free spot in the market as part of a four-week trial.\nCouncil officials said the project would give traders \"a feel for trading on Grantham Market\" before deciding whether to sign up for a regular spot.\nThe new projects must be contractually committed by the council by 31 March and be completed by the same date next year under the terms of the fund.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c5y2ggq844qo"}