{"authors": ["Martin Fletcher", "www.facebook.com"], "date_download": "2025-05-19 15:28:47", "date_modify": "2025-05-19 15:28:47", "date_publish": "2015-02-05 00:35:02", "description": "Many people have never heard of the pangolin, but it is the world's most-trafficked mammal - and the only one covered in scales.", "filename": "news_magazine-30833685_1747668527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80798000/jpg/_80798171_pangolin_andchild_ap624b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_magazine-30833685_1747668527.html", "title": "The world's most-trafficked mammal - and the scaliest", "title_page": "The world's most-trafficked mammal - and the scaliest - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The gentle, solitary pangolin has a tongue as long as its body and curls into a ball when threatened. It is also the world's most trafficked mammal, and threatened with extinction.\nIn front of a drab government building near Vietnam's northern border with China, a young conservationist named Nguyen Van Thai prises open a flimsy wooden crate with a machete.\nHe lifts out four plastic sacks and places them on the ground. From each sack he pulls out a brownish-black ball with a scaly exterior, roughly the size and weight of an curling stone.\nGradually - and very, very cautiously - one of those balls begins to uncurl, revealing two blackcurrant eyes, a long snout, an even longer tail and a soft pink belly. It's a pangolin, one of the world's more remarkable creatures.\nThe pangolin is the only mammal wholly covered in scales, and it simply curls itself into an impregnable ball when threatened by predators.\nIt eats seven million ants and termites a year using a tongue that's almost as long as its body. It has no teeth, so it stores stones in its stomach to grind up its food.\nThe reason many of us have never heard of pangolins is because they seldom survive in captivity. Only six zoos in the world - and only one in Europe, Leipzig - have any.\nPangolins enjoy one other unfortunate distinction - they are the world's most trafficked mammal.\nWhile the media focuses on the plight of the elephant and the rhinoceros, the celebrities of the natural world, roughly 100,000 pangolins a year are being snatched from the wild and sent to China and Vietnam.\nAs Prince William recently remarked: \"The pangolin runs the risk of becoming extinct before most people have even heard of them.\"\nThe four pangolins in the crate opened by Nguyen Van Thai had been confiscated by Vietnam's Forest Protection Department from two traffickers caught riding motorbikes into China along a forest track at dawn.\nNguyen, who heads an NGO called Save Vietnam's Wildlife, planned to take them back to a rescue centre that he runs in Cuc Phuong national park south of Hanoi.\nAs we drove south, he explained how pangolins - so common in his childhood - had all but vanished from Vietnam's forests and were now smuggled in by boat or truck from countries like Indonesia or Malaysia.\nThey come in loads weighing several tons, dead and alive, fresh and frozen, gutted and skinned.\nLive ones are the most valuable. Before selling them traffickers often pump their stomachs full of gravel or rice starch to increase their weight.\nAt the rescue centre we watched some of the pangolins emerge from their burrows at night, and I began to understand why those who work with them find them so endearing.\nThey resemble artichokes on legs. They are gentle, solitary creatures with an almost comic rolling gait. They carry their young on their tails and curl round them to protect them. They use those prehensile tails to hang from branches, or to stretch out almost horizontally to reach ants' nests.\nNguyen said the authorities sometimes caught the traffickers, but only because rivals had snitched on them. But they did practically nothing to stop retailers selling pangolin products.\nThe next day he took me to Hanoi to show me what he meant.\nIn the space of an hour we visited four randomly chosen traditional medicine shops in the city's bustling old quarter. Three produced pangolin scales, touting them as a cure for everything from cancer or acne, to poor lactation in mothers.\nThey asked up to $1,500 (£1,000) a kilo. Asked why they were so expensive, one woman replied with no apparent shame: \"Because they're rare and illegal.\"\nMonique Pool first fell in love with sloths when she took in an orphan from a rescue centre. Since then many sloths have spent time in her home on their way back to the forest - but even she found it hard to cope when she had to rescue 200 at once. Soon sloths were hanging everywhere - from the trees in her back garden, from the bars on the living room window, and anything else they could hold on to. \"Two female adults sat on the TV stand and the babies would climb on the matriarchs,\" she says.\nThis was when she invented the term \"slothified\" as a description for her home and life.\nThe woman who got 'slothified'\nHow to listen to From Our Own Correspondent, external:\nBBC Radio 4: Saturdays at 11:30\nListen online or download the podcast.\nBBC World Service: At weekends - see World Service programme schedule.\nSubscribe to the BBC News Magazine's email newsletter to get articles sent to your inbox.", "url": "https://www.bbc.com/news/magazine-30833685"}