{"authors": ["Stephen Fairclough", "www.facebook.com"], "date_download": "2025-04-26 04:21:00", "date_modify": "2025-04-26 04:21:00", "date_publish": "2025-03-03 15:11:50", "description": "CCTV captures the moment Kurtis Dwyer hits Casey Wilson as she rides along the pavement.", "filename": "news_articles_c8j0g2ykejlo_1745641260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9429/live/b4993380-f83c-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j0g2ykejlo_1745641260.html", "title": "Driver Kurtis Dwyer jailed for hitting five-year-old on scooter", "title_page": "Driver Kurtis Dwyer jailed for hitting five-year-old on scooter - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The mother of a five-year-old girl struck while scootering on the pavement by a hit-and-run driver has said she thought her daughter had been killed.\nCCTV footage shows Kurtis Dwyer, 35, hit Casey Wilson near her school in Cardiff in March 2024.\nShe escaped serious injury, but her mum Rachel Bancroft said her daughter continues to have nightmares about the crash.\nDwyer, of Clare Road, Cardiff, pleaded guilty to dangerous driving and was given a 14-month prison sentence on Monday.\n\"I was coming out of the park with my kids and an out-of-control car came out from the junction and pounded into my little girl\", Ms Bancroft told BBC after the sentencing hearing.\n\"I thought she was dead that day.\n\"The impact has been traumatising for the whole family... physically and mentally draining.\n\"She's had nightmares, bed wetting, sweats. It's been horrendous.\"\nJudge Simon Mills told Dwyer he had shown \"cowardice\" by driving away and abandoning his vehicle after driving into Casey on Sloper Road.\nMs Bancroft told the court there was an \"angel looking down on her\".\nShe called the sentence \"nowhere near long enough\".\n\"He'll be out in a minute, looking at me again and laughing at me again,\" she said.\n\"I've got to relive this now for the rest of my kids' lives and my own life.\"\nOn 24 March 2024, Casey had been riding her scooter on the pavement just ahead of her mum and brother.\nProsecutor Mari Watkins said Ms Bancroft saw Dwyer mount the kerb and knock her daughter over before driving away, adding it was \"miraculous\" that Casey was only left with bruising and a limp and not \"far worse injuries\".\nDwyer, who was driving without a licence, insurance or permission to drive the vehicle, abandoned the car a few streets away.\nHe called Casey's father a few days later saying \"I didn't know I hit your kid\" and claimed to have \"lost control\" after dropping a cigarette.\nDwyer then handed himself into police.\nIn a victim personal statement, Ms Bancroft said her daughter \"has been living with PTSD since the incident and is in daily fear of any cars, crossings or the road in general\".\nShe has now gone from a lively child to one who is \"glued to my hip constantly\".\n\"She is short tempered and has numerous outbursts of anger and frustration,\" Ms Bancroft added.\nJudge Simon Mills said that for a child \"one of life's little joys\" is to ride a scooter and this had been \"destroyed\" for Casey due to Dwyer's decision to \"drive a large vehicle in a completely ridiculous manner\".\nDwyer hit Casey after trying \"a dangerous overtaking manoeuvre\" and the judge said her \"comparatively minor physical injuries\" could have been \"very serious injuries or she could have been killed\".\nJudge Mills said Casey \"should be playing with friends and instead she is going to counselling\".\nDwyer will also be disqualified from driving for three years after he serves his prison sentence.", "url": "https://www.bbc.co.uk/news/articles/c8j0g2ykejlo"}