{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:28", "date_modify": "2025-05-19 15:29:28", "date_publish": "2015-02-09 23:06:28", "description": "A huge search operation is under way to find the shark that killed a Japanese surfer off the New South Wales coast.", "filename": "news_world-australia-31329212_1747668568.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80897000/jpg/_80897658_80897657.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-australia-31329212_1747668568.html", "title": "Huge search for shark that killed New South Wales surfer", "title_page": "Huge search for shark that killed New South Wales surfer - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A huge search operation is under way to find the shark that killed a Japanese surfer off the New South Wales coast.\nTadashi Nakahara, 41, died after suffering severe leg injuries in the attack. Police have hailed the \"brave\" efforts of his friends to revive him.\nA shark expert is now working to determine which species was responsible for the attack and whether it still poses a threat, police say.\nReports that Mr Nakahara's legs were bitten off have not been confirmed.\nBut police quoted by the Sydney Morning Herald, external say that they believe a \"very large\" shark was responsible.\nBallina Shire mayor David Wright is also quoted by the paper as saying that rescuers believed it was a great white shark.\n\"For a shark to take the board and the person sitting on it, it's got to be very big,\" he said.\nDozens of rescue crews are scouring the northern New South Wales coast for the shark, the Herald reported, with lifeguards using jet-skis, rescue boats and a helicopter.\nHeavy rain in the north of the state may account for Monday's attack and another attack in the same area over the weekend, shark expert Daryl McPhee told The Australian, external.\nHe said that the rainfall may have led to rivers in the area flowing faster, which in turn would provide more food for sharks.\nDr McPhee said it was unlikely that the same shark carried out both attacks, especially given the conflicting reports about their ­sizes.\n\"While a shark can swim 30km (18 miles) overnight, it's not terribly likely that one would come into shore, take a bite out of someone, then swim for 30km and come into shore to take a bite out of another person,\" he told the newspaper.\nMeanwhile police have paid tribute to the efforts of friends of Mr Nakahara to save him in \"bloodstained surf\" at a Ballina beach.\n\"I think their actions are commendable. Here we have a situation where [there's] a significant amount of blood in the water, they took to rescue this surfer, bring him in on shore,\" Detective Inspector Cameron Lindsay was quoted by the Northern Star , externalnewspaper as saying.\n\"They did their best and unfortunately they couldn't stop the blood loss.\"\nMr Nakahara is reported to have worked at a local hotel and was well known in the local surfing community.\nThe beach where the attack took place - and others in the area - have been temporarily closed down, officials say.\nThere have been several shark attacks off Australia's beaches in recent years.\nConcern has grown over shark attacks recently. A 50-year-old Briton was killed by a shark in Byron Bay in September 2014.\nWestern Australia has also seen a series of attacks but attempts by its government to introduce a shark cull were dropped last year.", "url": "https://www.bbc.com/news/world-australia-31329212"}