{"authors": ["Chloe Harcombe", "www.facebook.com"], "date_download": "2025-04-26 04:41:41", "date_modify": "2025-04-26 04:41:41", "date_publish": "2025-03-02 07:06:47", "description": "Police are appealing for witnesses one year on from the disappearance of Jack O'Sullivan on a night out in Bristol.", "filename": "news_articles_cjryyx93yxjo_1745642501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f612/live/d2654250-f5b2-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjryyx93yxjo_1745642501.html", "title": "Jack O'Sullivan: Family vow not to give up hope one year on", "title_page": "Jack O'Sullivan: Family vow not to give up hope one year on - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a missing man have said they \"will not give up\" the search for him one year after he disappeared after a night out in Bristol.\nJack O'Sullivan, who was 22 at the time of his disappearance, was last seen in the early hours of 2 March after he attended a house party in the Hotwells area of Bristol.\nOne year on, his family said his disappearance remains a \"complete mystery\".\nAvon and Somerset Police are appealing for the public to think back to where they were a year ago and to recall if they saw anything which could help their investigation.\nPolice launched an \"extensive\" investigation the day that Mr O'Sullivan went missing, with more than 30 different teams and organisations helping with the search over the following weeks and months.\nDive teams have searched the river from Avonmouth through to Conham River Park and officers - including those with the mounted team, dog unit and drone unit - have searched the wider area where Mr O'Sullivan was last seen, including the Hotwells, Ashton and North Somerset areas.\nPolice said the last likely sighting of the 22-year-old was at 03:38 GMT when he was walking along Bennett Way slip road, heading towards the city centre.\nOn the night he went missing, Mr O'Sullivan had attended a birthday party in the Hotwells area of Bristol.\nHe had assured his mother, Catherine, that he would take an Uber home after leaving the party.\nAt 03:24 GMT, Mr O'Sullivan attempted to phone a friend who was still at the party.\nHe was not able to reach them and when the friend called back 10 minutes later, they only managed to say \"hello\" before the phone line went dead, police said.\nHowever, Mr O'Sullivan's phone remained active on the Find My Friends App until 06:44 GMT.\nIn a statement, his family said: \"His disappearance remains a complete mystery and despite a considerable campaign to find him involving private investigators, search and rescue teams, community searches, as well forensic IT searches we remain in the dark as to what happened that night.\n\"We are still, with support, searching for Jack and will not give up.\n\"We urge anyone who knows anything about what may have happened to him or where he is now to come forward and provide us with the information they have.\"\nAssistant Chief Constable Joanne Hall, from Avon and Somerset Police, said the force and the family have a \"shared aim\" of finding Mr O'Sullivan.\n\"I don't think any of us can truly feel what the family are going through.\n\"I can only imagine it must be the most harrowing thing... I wouldn't give up the search if I was in their position,\" she said.\nShe explained that the search remains an \"absolute priority\" for the force, which has already explored several lines of inquiry with an \"open mind\".\nA year on from Mr O'Sullivan's disappearance, ACC Hall is renewing the appeal to the public.\n\"Anniversaries provide an important opportunity to look back and reflect.\n\"A lot can happen in a year and things which may not have looked significant at the time may look different with the passage of time,\" ACC Hall added.\nShe urged people to think back to the \"cold, snowy day\" when Mr O'Sullivan went missing.\nShe also noted that Bristol City lost 1-0 to Cardiff City.\n\"You may recall seeing something which, on the surface, seemed unimportant, but may be an important piece of information for us to know,\" she said.\nACC Hall added that it is \"uncommon\" for people to be missing after a year, but the time does not affect the status of the investigation.\nIf all lines of inquiry are exhausted, the case may move to a different stage of investigation, but it will still remain open.\nShe said: \"There's people's loved ones at the end of this and we will always continue our search for them, as long as there's avenues that we can follow.\"", "url": "https://www.bbc.co.uk/news/articles/cjryyx93yxjo"}