{"authors": ["James Gregory", "www.facebook.com"], "date_download": "2025-04-26 07:41:36", "date_modify": "2025-04-26 07:41:36", "date_publish": "2025-02-26 21:28:07", "description": "President Trump says the pair are poised to sign a \"very big agreement\", which Zelensky described as a \"framework\".", "filename": "news_articles_cn7vg0nvzkko_1745653296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/59a1/live/35f1f4d0-f4d7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vg0nvzkko_1745653296.html", "title": "Zelensky to meet Trump in Washington to sign minerals deal", "title_page": "Zelensky to meet Trump in Washington to sign minerals deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukrainian President Volodymyr Zelensky will meet US President Donald Trump in Washington on Friday to sign an agreement on sharing his country's mineral resources, Trump has said.\nZelensky has described the bilateral deal as preliminary, and said he wants further agreements which include US security guarantees to deter renewed Russian aggression.\nBut Trump said the US would not provide guarantees \"beyond... very much\", saying the responsibility should instead fall to Europe.\nTrump also seemingly ruled out the prospect of Ukraine becoming a Nato member - one of Zelensky's long-held ambitions.\nSpeaking at a meeting of his cabinet on Wednesday, Trump said the presence of American workers extracting rare earth metals on Ukrainian soil would provide \"automatic security\" for Ukraine.\nHe said Kyiv should \"forget about\" joining Nato and repeated Russia's claims that the issue was one of the driving factors behind the war.\nThe US president suggested a ceasefire between Ukraine and Russia was not far off, telling reporters: \"We're going to make a deal with Russia and Ukraine to stop killing people.\"\nBut Zelensky said without security guarantees \"we won't have a ceasefire, nothing will work, nothing\".\n\"I want to find a Nato path or something similar,\" he said.\nRussia has consistently opposed the idea of Ukraine becoming a member, fearing it would bring Nato forces too close to its borders.\nIn 2008, the alliance had said that Ukraine could eventually join.\nTrump has suggested European peacekeeping troops could be stationed in Ukraine as part of a ceasefire deal, but Russia says it is against this.\nEuropean representatives, however, were not included in Washington's initial talks with Russia.\nSpeaking to the BBC on Wednesday, Kaja Kallas, the EU High Representative for Foreign Affairs and Security Policy, said \"for any kind of deal to work on European soil, you need the Europeans to also agree to it\".\nShe said the mineral resources deal was up to Ukraine, but any peace agreement would \"need the Europeans on board\".\nMs Kallas' scheduled meeting with Secretary of State Marco Rubio on Wednesday was abruptly cancelled, with both sides citing scheduling issues.\nZelensky said the success of the minerals deal, which was formally backed by his government on Wednesday evening, would depend on the outcome of his meeting with Trump this week.\nKey details have not yet been made public, but Ukrainian Prime Minister Denys Shmyhal said it envisages an \"investment fund\" for Ukraine's reconstruction.\nThe prospect of a deal was first proposed by Zelensky last year as a way to offer the US a tangible reason to continue supporting Ukraine.\nBut disagreements over its substance exacerbated tensions between Trump and Zelensky in recent weeks.\nThe Ukrainian president had rejected an initial request from the US for $500bn (£395bn) in mineral wealth, but media reports suggest this demand has now been dropped.\nThere are also differences in how both sides are now describing the deal. Trump has lauded the \"very big agreement\" as an opportunity for the US to get its \"money back\" after funding aid to Ukraine.\nBut Zelensky has instead referred to it as a \"framework agreement\" upon which he hopes further deals can be made.\nTrump has said he wants a quick end to the war in Ukraine and has sought to reset relations with Russia. After a phone call with Russian President Vladimir Putin, the two leaders sent delegations to Saudi Arabia in bilateral talks which excluded Ukraine.\nIn response, Zelensky accused the US of helping Putin \"break out of years of isolation\" and Trump of living in a \"Russian disinformation space\".\nUkraine is a country rich in natural resources. Kyiv estimates that about 5% of the world's \"critical raw materials\" are there. But accessing some of these resources will not be completely straightforward.\nSome of the mineral deposits have been seized by Russia. According to Yulia Svyrydenko, Ukraine's economy minister, resources worth $350bn (£277bn) remain in occupied territories today.\nThere are warnings too that Ukraine first needs to addresses its problem with unexploded mines before striking a deal with the US.\nA quarter of Ukraine's landmass is estimated to be contaminated with landmines, mainly concentrated in the war-torn east of the country.\nPutin has also said he is open to offering the US access to rare minerals, including from Russian-occupied Ukraine.\nUK Prime Minister Sir Keir Starmer will also be meeting both Trump and Zelensky separately this week to discuss the war in Ukraine.\nHe is due to arrive in Washington later on Wednesday.", "url": "https://www.bbc.co.uk/news/articles/cn7vg0nvzkko"}