{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:02", "date_modify": "2025-04-26 04:02:02", "date_publish": "2025-03-04 02:22:21", "description": "Angela Eagle says the ads will expose the \"dangerous lies\" spread by \"ruthless criminal gangs\".", "filename": "news_articles_c9vygwe0rv4o_1745640122.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0e73/live/91276d70-f87f-11ef-91ae-3fa943d282b1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vygwe0rv4o_1745640122.html", "title": "Home Office launches ads in Iraq to deter small boat crossings", "title_page": "Home Office launches ads in Iraq to deter small boat crossings  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Home Office is launching an advertising campaign in Iraq to try to deter people from crossing the English Channel in small boats.\nSimilar campaigns were launched in Albania and Vietnam by the previous Conservative government in 2023 and 2024.\nOn Sunday, 592 migrants in 11 boats crossed the Channel, according to figures from the Home Office. That represents the highest total for a day in March on record.\nHome Office minister Dame Angela Eagle said: \"Ruthless criminal gangs spread dangerous lies on social media to exploit people for money, and we are exposing them using the real stories of their victims.\"\nHowever, the Refugee Council said someone desperate to flee persecution in their homeland would be unlikely to change their mind because of a social media campaign.\nOne advert shows an image of a destroyed dinghy floating in the water and testimony from a man saying \"the boat was too crowded\" and \"people disappeared into the sea\".\nAnother features an account of one woman who says: \"I was promised a well-paid job. Instead I was a slave.\"\nSo far this year 2,716 people have made the crossing - an increase of 20% on the same period last year, although numbers are down on the year before that.\nIn 2024 as a whole, 36,816 people were detected making the crossing, and more than 2,000 of those came from Iraq.\nThe Border Security Commander, Martin Hewitt, visited the country last week in an effort to increase international co-operation to tackle the criminal gangs organising the journeys.\nHewitt said: \"Our international campaign is sending a clear message to prospective migrants that these criminals cannot be trusted.\"\nThe advertisements - initially focused on the semi-autonomous Kurdistan Region of Iraq - will be displayed on social media, apps and news websites.\nSeparately, the Home Office says that UK ministers are set to sign a joint communique with the Vietnamese government agreeing to \"build on our joint work to prevent the exploitation of irregular migrants, disrupt criminal gang operations, strengthen intelligence sharing and return those with no right to be in the UK\".", "url": "https://www.bbc.co.uk/news/articles/c9vygwe0rv4o"}