{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:40", "date_modify": "2025-04-26 03:55:40", "date_publish": "2025-03-04 15:52:08", "description": "John Smyth, 63, was battered to death as he tried to stop a drug addict attacking a woman's flat.", "filename": "news_articles_cx28qj9ndlgo_1745639740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07ec/live/808c0500-ef8a-11ef-80a2-3b5266fd5b33.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28qj9ndlgo_1745639740.html", "title": "Wallsend man guilty of murdering break-in intervention 'hero'", "title_page": "Wallsend man guilty of murdering break-in intervention 'hero' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been found guilty of murdering a \"hero\" who tried to intervene during a violent break-in.\nJohn Smyth, 63, was battered to death in a backyard in Wallsend as he tried to stop George Ness from smashing his way into a woman's flat.\nNess, 41, from North Shields, had claimed self-defence but prosecutors described those claims as \"nonsense\".\nJurors at Newcastle Crown Court found him guilty of murder. He will be sentenced at a later date.\nMr Smyth had recently moved to Wallsend from the East Midlands, and had spent the night of 21 September with his neighbour, Bridi Nye, at Ms Nye's home on Holly Avenue, the jury heard.\nShortly before 05:00 GMT on 22 September, Ness went to Ms Nye's home where he had smashed the kitchen window to have a confrontation with her, the court heard.\nMr Smyth, a father of one, ran into the backyard to challenge Ness, the court heard.\nHe was struck at least five times in the head with a heavy wooden plank and then stamped on. Defensive injuries on his hands also suggested the attacker had tried to stab him, the court heard.\nAs Mr Smyth lay dead, or dying from unsurvivable head injuries, Ness went through his pockets and stole his mobile phone.\nConcluding her evidence to jurors, Ms Nye said of Mr Smyth: \"That man was a hero.\"", "url": "https://www.bbc.co.uk/news/articles/cx28qj9ndlgo"}