{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 06:52:17", "date_modify": "2025-04-26 06:52:17", "date_publish": "2025-02-28 17:11:24", "description": "The filmmaker said he chose to not follow \"the gutless rules\" laid down by the industry in Megalopolis.", "filename": "news_articles_cd7ev3wygl4o_1745650337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0852/live/90a1c8e0-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ev3wygl4o_1745650337.html", "title": "Razzie Awards 2025: Francis Ford Coppola named worst director", "title_page": "Razzie Awards 2025: Francis Ford Coppola named worst director - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Francis Ford Coppola, one of Hollywood's greatest filmmakers, has been named worst director for his self-financed project Megalopolis in this year's Razzies.\nAnnounced two days before the Oscars reward Hollywood's finest, the Razzie Awards name and shame the year's worst films.\nIn an Instagram post,, external Coppola said he was \"thrilled\" to accept the award, \"at a time when so few have the courage to go against the prevailing trends of contemporary movie-making\".\nMadame Web picked up the award for worst picture, screenplay and actress for its star Dakota Johnson, while Joker: Folie à Deux also collected two awards.\nThe organisers have described their awards as the \"ugly cousin to the Oscars\".\nMegalopolis, an epic fantasy starring Adam Driver, Shia LaBeouf, Aubrey Plaza and Nathalie Emmanuel, cost Coppola a reported $120m (£95m).\nIt also faced controversy after the trailer was withdrawn by studio Lionsgate, because the clip included fabricated quotes from real film critics about the filmmaker's previous works.\n\"Even a cinematic maestro occasionally musters up a misfire,\" the Razzies said, in a press release announcing Coppola's win.\nIt comes almost exactly 50 years after Coppola won a best director Oscar for The Godfather part II.\nIn his Instagram post, Coppola said: \"In this wreck of a world today, where art is given scores as if it were professional wrestling, I chose to not follow the gutless rules laid down by an industry so terrified of risk that despite the enormous pool of young talent at its disposal, may not create pictures that will be relevant and alive 50 years from now.\"\nHe concluded his post by thanking everyone who worked on the film, adding: \"Box office is only about money, and like war, stupidity and politics has no true place in our future.\"", "url": "https://www.bbc.co.uk/news/articles/cd7ev3wygl4o"}