{"authors": ["Chris McHugh & Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 06:36:08", "date_modify": "2025-04-26 06:36:08", "date_publish": "2025-02-27 06:03:02", "description": "Part of Botley Road has been closed in the city centre since April 2023 and should reopen next year.", "filename": "news_articles_cjw24j7yl2po_1745649368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/014d/live/47188e30-f474-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw24j7yl2po_1745649368.html", "title": "Botley Road closure: Network Rail 'out of comfort zone' with work", "title_page": "Botley Road closure: Network Rail 'out of comfort zone' with work - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Network Rail has been \"out of its comfort zone\" managing a major road and rail project which has shut off a major Oxford route since April 2023, a director has said.\nBotley Road has been closed under its rail bridge for almost two years because of a £161m scheme to expand and improve Oxford station.\nThe infrastructure manager said it hopes to reopen it by August 2026 and held the first of a series of monthly meetings for residents on Wednesday.\nFrancis McGarry, a Network Rail investment director, said it needs to \"effectively rebuild\" the affected part of the road.\nA Victorian brick arch was found in the summer of 2023.\nOxfordshire County Council, contractors Kier and Thames Water were invited to the meeting at the King's Centre but did not attend.\nMr McGarry said they hoped to attend others in the future.\nSue Spencer-Longhurst, who lives in Abbey Road, said she was hopeful there will be some action taken as Network Rail realise the anger created by the overrunning work.\nBut she said even if work is completed on time next year, other maintenance will continue in side streets close to the station, including in Roger Dudman Way and Cripley Road.\n\"We will have had a huge amount of building work and noise and disruption and dirt too,\" she added.", "url": "https://www.bbc.co.uk/news/articles/cjw24j7yl2po"}