{"authors": ["Christine Butler", "www.facebook.com"], "date_download": "2025-04-26 03:45:55", "date_modify": "2025-04-26 03:45:55", "date_publish": "2025-03-05 06:09:43", "description": "Kat Mills was subjected to months of abuse before her ex-boyfriend set fire to her home in December.", "filename": "news_articles_c87111z8ngdo_1745639155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bd12/live/7e3279a0-f4e5-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c87111z8ngdo_1745639155.html", "title": "Cornwall woman speaks out about abuser who set fire to her home", "title_page": "Cornwall woman speaks out about abuser who set fire to her home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman from Cornwall has described her terror after her ex-boyfriend set fire to her home and subjected her to months of abuse.\nKat Wills, 44, and her son lost everything when her converted mobile home was destroyed on 29 December.\nMs Wills said she had endured 10 months of abuse leading up to the arson, saying: \"Every time he said he loved me and he was sorry and he didn't mean to do what he did and he'd never do it again.\"\nOn Friday Shaun McCormick, 54, was jailed for six years at Truro Crown Court after admitting a string of offences against her and her property.\nStanding beside the burned-out wreckage of her home, Ms Wills said she had been left shaken by what she had been through.\n\"It's been quite a horrific 10 months to be fair,\" she said.\nShe first met McCormick at a nightclub in Newquay many years ago, but started a relationship with him in November 2023 after seeing him playing pool at a pub in Goonhavern.\nMs Wills said at first she thought McCormick was \"everything I ever thought I would ever want in a man\".\n\"Then little cracks of alcohol, becoming drunk more often and then becoming verbally abusive, escalated to physical abuse in the end,\" she said.\nIn one incident the court heard she was chased naked through the countryside and thought she was going to be killed by her drunken boyfriend but managed to evade him.\nMcCormick had told her he had served in the armed forces and suffered trauma when his friend was blown up, but she now believes that was a lie.\n\"I always thought maybe his reasons for the way he was behaving was due to what he had been through. But only recently through his mum, I found out he was never in the army,\" said Ms Wills.\n\"Every time he said he loved me and he was sorry and he didn't mean to do what he did and he'd never do it again, he just lied.\n\"But in the end I couldn't put up with his behaviour and when we split up that's when he got really nasty.\"\nIn December 2024, McCormick sent Ms Wills threatening messages, so she and her son moved to her mother's home.\nTwo days later, McCormick set her converted mobile home on fire.\nIt had just been decorated and recarpeted, and had a conservatory with additional buildings.\n\"Everything I've ever worked for was in that caravan, all my son's toys, birth certificates, passports, my mum's wedding rings, a whole list of things that could never be replaced,\" Ms Wills said.\nShe said her son was devastated after losing all his toys, including a large collection of Christmas presents he had only just received.\nShe added her focus now was on rebuilding her life and career - she has been a registered nurse since 2008, and is now a clinical lead.", "url": "https://www.bbc.co.uk/news/articles/c87111z8ngdo"}