{"authors": ["Kelly Morgan", "www.facebook.com"], "date_download": "2025-04-26 07:44:14", "date_modify": "2025-04-26 07:44:14", "date_publish": "2025-02-26 17:45:49", "description": "The rise was agreed following a marathon eight-hour debate at County Hall in Trowbridge.", "filename": "news_articles_c625exzg8gzo_1745653454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea68/live/10c37590-f454-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c625exzg8gzo_1745653454.html", "title": "Wiltshire local authority's share of council tax to rise by 4.5%", "title_page": "Wiltshire local authority's share of council tax to rise by 4.5%  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wiltshire Council's share of overall council tax in the county is set to rise by a less-than-expected 4.5%.\nThe local authority has also been given the go-ahead to increase spending on essential services by £37m in its budget for the year ahead.\nFollowing a marathon eight-hour debate at County Hall in Trowbridge, the Conservative council's budget was passed with 58 votes for, with 22 against and three abstentions.\nOpposition Liberal Democrats described it as \"cynical\", accusing the Tory administration of holding off on future increases in council tax and parking charges because of the upcoming local elections.\nThe upper limit for an increase in a local authority's share of overall council tax - not including other charges from the police, fire service, and parish councils - is 4.99%.\nThe 4.5% increase for 2025/6 does not take into account the rise in the Wiltshire Police precept of £1.16 per month, or any rises in Wiltshire town council or parish rates.\nSpeaking ahead of the council vote, council leader Richard Clewer said: \"Unlike pretty much every council surrounding us, I'm coming in today with a budget that is balanced.\n\"I'm proposing a 4.5% [increase] - I wish it could be lower but that's what I need to deliver the critical services we need to deliver.\"\nThe £37m increase in spending means that the council's overall budget will rise from £490m last year to £527m.\nBut the council says it has been impacted by already announced cuts and changes to grant schemes, which have resulted in the authority receiving £7m less than expected in central government funds.\nDespite the passage of the budget, the leader of the opposition Liberal Democrats, councillor Ian Thorn, voiced his scepticism as to the budget's success: \"Tremendously worrying news around potential debts that we face.\n\"Tens of millions of pounds on issues around young children and learning disabilities, massive pressures around adults and social care - there are real pressures that this council faces.\n\"It's quite a cynical budget, council tax isn't going up the full amount this year but is due to go up by the full amount next year, car parking charges not going up this year but will be going up next year.\n\"There must be something important happening this year – it could be the election of course.\"\nThe Liberal Democrats were criticised by other councillors for presenting no amendments, something Thorn justified by saying they would likely have been rejected by the Conservative administration, and were therefore \"a waste of time\".", "url": "https://www.bbc.co.uk/news/articles/c625exzg8gzo"}