{"authors": ["Sarah Turnnidge", "Jeremy Stern", "www.facebook.com"], "date_download": "2025-04-26 06:19:47", "date_modify": "2025-04-26 06:19:47", "date_publish": "2025-03-01 07:05:21", "description": "Families in the village are calling for a safe pedestrian crossing and reduced speed limit.", "filename": "news_articles_cd7ee201jr9o_1745648387.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dab1/live/a4b2d730-f5be-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ee201jr9o_1745648387.html", "title": "A36: 'Terrifying' road must change, Limpley Stoke residents say", "title_page": "A36: 'Terrifying' road must change, Limpley Stoke residents say - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families have called for a lower speed limit on a \"terrifying\" major road running through their village.\nResidents of Limpley Stoke, Wiltshire, want the limit to be cut from 40mph to 30mph on the A36 into Bath, a key route into the city.\nThey have also called for a safe crossing to be installed on the road, which was reopened on 1 March after being shut in August 2024 due to large cracks in the roadside footpath.\nNational Highways said it was \"aware of aspirations\" for a pedestrian crossing and had \"worked with parish councils on developing options for the future\".\nResident Sam Fairley said there had been a \"huge opportunity missed\" to improve road safety through the village while the A36 was closed.\nMs Fairley, who has two young boys, said: \"It's terrifying. Every day we wonder if we're going to be able to get across, how long it's going to take to get across.\n\"We are concerned that it will take an accident for something to happen here.\n\"We are not willing for one of our children to be a pawn, basically, for something to be improved here.\"\nResidents said that while they were extremely concerned about road safety, they were keen for the road to reopen as it is a vital route.\nBut John Roberts, 86, described crossing the road \"like driving dodgems at the fair\", adding: \"I think there will be an accident – whether it's fatal or not – but it's asking for it.\"\nResidents have repeatedly called on National Highways to consider lowering the speed limit to 30mph, in line with restrictions in other neighbouring villages.", "url": "https://www.bbc.co.uk/news/articles/cd7ee201jr9o"}