{"authors": ["Mallory Moench", "www.facebook.com"], "date_download": "2025-04-26 04:26:04", "date_modify": "2025-04-26 04:26:04", "date_publish": "2025-03-03 11:41:38", "description": "Police said someone cut off power to a water pump on the island of Gotland in the Baltic Sea.", "filename": "news_articles_cm2nk82j2g7o_1745641564.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4746/live/a20db030-f821-11ef-8e9e-47bc43726032.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2nk82j2g7o_1745641564.html", "title": "Swedish police investigate suspected water pump sabotage", "title_page": "Swedish police investigate suspected water pump sabotage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Swedish police are investigating a suspected sabotage incident on a water pump on the island of Gotland in the Baltic Sea.\nPolice told the BBC that the local government's water unit received an alarm for a water pump on Sunday at 17:30 local time (16:30 GMT).\n\"Technicians found that someone has opened an electrical cabinet, pulled out a cable and thereby cut off the power to the pump,\" police said. The technician put the cable back and reset the alarm at 21:30 local time, and the pump is now working.\nPolice have not said who they suspect could be responsible. The incident comes after the suspected sabotage of an undersea telecoms cable connecting Germany and Finland last month.\nThere has been an increase in damage to infrastructure in the Baltic Sea in recent months, largely caused by ships dragging their anchors across cables. European leaders have suspected Russian involvement.\nHowever, poor weather, inadequate equipment and human error have been found to be responsible for some damages.\nFollowing the discovery of the suspected sabotage on Gotland on Sunday, Patrik Johansson, who heads the local water and sanitation department, said: \"We can see that it is human influence that caused the damage.\"\nThere has been no impact on the drinking water, the statement added.\nSusanne Bjergegaard-Pettersson, Gotland's head of water and sewage, earlier on Monday told Aftonbladet, which first reported the incident, that the water pumps drew from a lake that supplies large parts of the island.\nBjergegaard-Pettersson later told the BBC she could not provide information about how many people got their water supply from the pump.\nGotland is a large island in the Baltic Sea that sits to the east of mainland Sweden and west of Latvia, Lithuania and Estonia.", "url": "https://www.bbc.co.uk/news/articles/cm2nk82j2g7o"}