{"authors": ["Oliver Slow", "www.facebook.com"], "date_download": "2025-04-26 07:27:19", "date_modify": "2025-04-26 07:27:19", "date_publish": "2025-02-27 20:09:43", "description": "Critics of the Article 4 regulation say it will negatively impact house prices and the economy.", "filename": "news_articles_c9844nddjz8o_1745652439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4700/live/ab17e340-f546-11ef-a9c6-c7f9594861df.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9844nddjz8o_1745652439.html", "title": "Second home campaigners granted right for policy review", "title_page": "Second home campaigners granted right for policy review - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Critics of new rules requiring people to get planning permission for second homes have been told they can take their case to a judicial review.\nCyngor Gwynedd was the first local authority to introduce the regulation, known as an Article 4 Direction, which was granted by the Welsh government in October 2022.\nBut a High Court judge has ruled that a hearing should take place to consider a claim made by a complainant that the council \"misunderstood the changes to the planning regime\" and failed to take into account \"the potential for new holiday homes\".\nThe council introduced the measure to try and tackle a \"huge housing crisis\", but opponents say it will have a negative impact on house prices, as well as tourism and the economy.\nIn the ruling, Mr Justice Pepperall granted permission for the complainant to apply for a judicial review on one of the claims made, but rejected it on four other grounds.\nA judicial review is a High Court case in which a judge is asked to examine whether a minister, official or public body broke the law in how they took a decision.\nA spokesperson for Cyngor Gwynedd said the Article 4 measure was introduced \"in an attempt to control the use of houses as second homes and holiday accommodation\" in areas under its control.\n\"We will consider this development and our next steps, while noting the judge's decision gives permission for a hearing on a single ground, and is not a final ruling,\" they added.\nLast month, the Eryri National Park Authority became the first park to introduce the rule, arguing that half of the population of Eryri – also known as Snowdonia – have been priced out of the housing market.\nWhile the move has been supported by some in Eryri as a step to limiting the number of second homes and holiday accommodation, critics said local businesses were already struggling and that it risked making visitors feel unwelcome.", "url": "https://www.bbc.co.uk/news/articles/c9844nddjz8o"}