{"authors": ["Davy Wilson", "www.facebook.com"], "date_download": "2025-04-26 07:37:20", "date_modify": "2025-04-26 07:37:20", "date_publish": "2025-02-27 14:30:04", "description": "The Department for Economy says the purchase of Timber Quay is key to boosting students in Derry.", "filename": "news_articles_ce8vvzeny04o_1745653040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/80ee/live/b1285a50-f508-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vvzeny04o_1745653040.html", "title": "Londonderry: Ulster University 'now has land needed for expansion'", "title_page": "Londonderry: Ulster University 'now has land needed for expansion' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ulster University now has the land it needs to increase student numbers at its campus in Londonderry to 10,0000, Northern Ireland's economy minister has said.\nDuring a visit to the campus on Thursday, Economy Minster Dr Caoimhe Archibald announced the purchase of the Timber Quay office block, which follows the recent acquisition of a number of sites along the city's riverfront.\nThe most recent purchase comes after a report on boosting student numbers at the campus, which was formerly known as Magee, was published last year.\nThe report said the increase to 10,000 students by 2032 would help address regional imbalance and be \"transformative\" for the north west region.\nHowever, the report, which was overseen by a taskforce established by former Minister Conor Murphy, also noted the quantity of privately-rented accommodation and purpose-built student accommodation must be increased to meet expansion targets.\nSpeaking on Thursday, Dr Archibald, who took over the role as minister from her party colleague earlier this year, said acquiring the Timber Quay property \" is a significant and positive announcement\".\n\"It is one that shows the commitment from me as economy minister, from my department, the executive and also from the university in terms of delivering the 10,000 student target.\"\nFive sites, which were previously owned by businessman Garvan O'Doherty, were purchased in December last year as part of expansion plans.\nThe university currently has about 5,335 students enrolled in its Derry campus this academic year.\nVice-chancellor of Ulster University Prof Paul Bartholomew said the total number of students will surpass 6,000 in the 2025/26 academic year.\nHe said the current campus in Derry is at capacity and the Timber Quay building will be utilised almost immediately.\n\"We have got more growth coming in September, and we desperately needed additional accommodation,\" he said.\nHe added: \"The floor at Timber Quay most ready to go is really amenable to being a computer lab, we'll move some computer labs over there. It is immediately accessible and frees up space here.\n\"The next big piece after that is the finishing of the shared island building which gives us additional capacity at least up to 7,000… hopefully by the time we get to 2029, if all the capital funds flow we will have a campus compatible with 10,000 students.\"\nChair of the Magee Taskforce Stephen Kelly said Thursday's announcement \"ensures that momentum is maintained to deliver on the 10,000 minimum target agreed in the Programme for Government\".\nHe told BBC News NI: \"The centre of gravity for the university is shifting towards the river and towards the city centre.\n\"The purchase of Timber Quay and the development lands on Queen's Quay it means we have a mile of education from the bottom of Clarendon Street…. finishing at the North West Regional College training centre - nowhere else on these islands has that education corridor, where you can arrive with no qualifications and leave with a PhD.\"", "url": "https://www.bbc.co.uk/news/articles/ce8vvzeny04o"}