{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:10:48", "date_modify": "2025-04-26 08:10:48", "date_publish": "2025-02-26 12:20:39", "description": "The States says services at St Ann's Hospital in Dorset meet the needs of patients in Jersey.", "filename": "news_articles_cjd3egyj0pzo_1745655048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2ccd/live/ee2adda0-f437-11ef-8b93-e929161a3c61.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjd3egyj0pzo_1745655048.html", "title": "UK hospital service approved for Jersey psychiatric patients", "title_page": "UK hospital service approved for Jersey psychiatric patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hospital in Dorset providing a specialised psychiatric service does meet the needs of patients in Jersey, the States has said.\nThe Minister for Health and Social Services has designated St Ann's Hospital in Dorset as an \"approved establishment\" for islanders to receive the specialised service which cannot be provided locally.\nThe approval means patients initially transferred to the Psychiatric Intensive Care Unit (PICU) can be transferred to other wards if clinically appropriate.\nThe service will be subject to monitoring by the Jersey adult mental health services, the States said.\nIt said: \"The minister has responsibility to approve establishments or premises for the purpose of care and treatment of patients.\n\"Governance checks have confirmed that the service is appropriate and adequate to meet the needs of service users who require this service, which cannot be provided locally in Jersey due to the specialised nature of the service and the PICU environment.\"\nThe decision also affects patients transferred to UK hospitals through the criminal justice system, as any hospital must be designated \"an approved establishment\" under Jersey's mental health law.\nThe most recent Care Quality Commission report rated the trust's acute wards for adults of working age and psychiatric intensive care units as good.", "url": "https://www.bbc.co.uk/news/articles/cjd3egyj0pzo"}