{"authors": ["Chris Young", "www.facebook.com"], "date_download": "2025-04-26 06:48:57", "date_modify": "2025-04-26 06:48:57", "date_publish": "2025-03-01 10:08:22", "description": "Zebra crossings are due to be installed as part of a push to make a housing estate safer.", "filename": "news_articles_c1jpxzzprd7o_1745650137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a632/live/fd0ef4b0-f67f-11ef-b148-3189738b7be7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpxzzprd7o_1745650137.html", "title": "Bradford: Zebra crossings to slow traffic in Holme Wood", "title_page": "Bradford: Zebra crossings to slow traffic in Holme Wood - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A series of zebra crossings are due to be installed as part of a push to make a housing estate safer for pedestrians.\nThree crossings will be installed in Holme Wood in Bradford to force vehicles to slow down when they get to junctions, according to the council.\nThe crossings would be placed on Broadstone Way near the junctions with Horsham Road, Kesteven Road and Sterling Crescent, and on Holme Wood Road.\nThe measures are part of the Broadstone Way Active Travel Route – a £415,000 package of government-funded work to improve walking and cycling routes on the estate.\nBradford Council launched a public consultation on the proposals on Friday, which will run until 21 March.\nEarlier this month a consultation began on another part of the work – the installation of road humps at the junction of Broadstone Way and several side roads.\nThree \"priority chicanes\" will also be created on Broadstone Way in a bid to tackle speeding vehicles, according to the Local Democracy Reporting Service.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c1jpxzzprd7o"}