{"authors": ["Jacob Panons", "www.facebook.com"], "date_download": "2025-04-26 04:36:56", "date_modify": "2025-04-26 04:36:56", "date_publish": "2025-02-28 11:31:49", "description": "Surrey Police say the vandalism is being treated as \"racially aggravated criminal damage\".", "filename": "news_articles_c789dz4gneyo_1745642216.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b7c/live/1c58ee50-f1f0-11ef-a23f-176f9b2ceec9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c789dz4gneyo_1745642216.html", "title": "Swastika on Surrey golf course is 'blatant act of hate'", "title_page": "Swastika on Surrey golf course is 'blatant act of hate' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A swastika which was carved into a golf course in Surrey is being treated as a hate crime by police.\nThames Ditton and Esher Golf Club said it had been hit by a spate of vandalism, with the most recent incident leaving members \"shocked and distressed\".\nRabbi Alex Goldberg, from Guildford Synagogue, said he was \"deeply concerned\" about the incident - which Surrey Police labelled as \"racially aggravated criminal damage\".\nAlthough the symbol has been used by Hindus, Buddhists and Jains, it is also associated with the Nazi party.\nSurrey Police said it visited the site on 18 February and all lines of enquiry were being explored.\nThe force is also appealing for anyone with information about the incident to get in contact.\nLynette Nusbacher, who is a lay reader at the North West Surrey Synagogue in Weybridge, says it is \"shocking that people have got this much hatred\".\nShe says she is \"glad that people are damaging grass and not hurting people\".\nRabbi Goldberg said: \"The carving of a swastika is a blatant act of hate, one that carries painful historical weight for Jewish communities and for all those who stand against antisemitism and intolerance.\n\"This is not just an attack on a golf club, it's an attack on the values of our society.\"\nHe has encouraged the community to \"work together to challenge and condemn such actions\".\nRabbi Lev Taylor, from Kingston Liberal Synagogue in Thames Ditton, said he believed it was an isolated incident and that the local Jewish community felt \"safe and integrated\".", "url": "https://www.bbc.co.uk/news/articles/c789dz4gneyo"}