{"authors": ["Sophie Parker", "www.facebook.com"], "date_download": "2025-04-26 06:37:41", "date_modify": "2025-04-26 06:37:41", "date_publish": "2025-02-26 06:33:06", "description": "An art exhibition in Wiltshire next month will display work by domestic abuse survivors.", "filename": "news_articles_c9vm4jrrp99o_1745649461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/01fe/live/f13940d0-e7db-11ef-8295-1f3717f0b004.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vm4jrrp99o_1745649461.html", "title": "Wiltshire exhibition to display art by domestic abuse survivors", "title_page": "Wiltshire exhibition to display art by domestic abuse survivors - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Art created by domestic abuse survivors in Wiltshire will go on display next month in an exhibition called The Next Chapter.\n\"I was able to feel a sense of relief from the pain I suffered at the hands of a monster,\" one contributor said.\nThe exhibition will include paintings, drawings and poems, with smartphones and headphones to listen to stories behind them.\nOrganisations FearFree, external, GreenSquareAccord, Julian House, external, The Nelson Trust, external and Collaborate Digital have worked with the Wiltshire Council for the event.\nThe survivors who have contributed have been through domestic abuse support in Wiltshire - the art and creativity contributed towards therapy and recovery.\nOne woman who produced art for the exhibition said: \"With the art I created, I expressed my emotions and I was able to feel a sense of relief from the pain I suffered at the hands of a monster.\n\"I put the brush in the black paint, it just happened from there, I did not know what I was painting.\n\"It came from the heart. I want people to see my work and understand that domestic abuse is a serious matter.\n\"I am looking forward to [people] seeing the art and get them to imagine what life is like in an abusive relationship.\"", "url": "https://www.bbc.co.uk/news/articles/c9vm4jrrp99o"}