{"authors": ["Zac Sherratt", "www.facebook.com"], "date_download": "2025-04-26 03:47:34", "date_modify": "2025-04-26 03:47:34", "date_publish": "2025-03-04 18:49:11", "description": "Westvale Park still does not have a GP surgery - 10 years after plans were approved.", "filename": "news_articles_c337101x3j8o_1745639254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/70b6/live/93813020-f928-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c337101x3j8o_1745639254.html", "title": "MP asks government to help deliver surgery at Westvale Park", "title_page": "MP asks government to help deliver surgery at Westvale Park - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Surrey MP is asking the government to help deliver a GP surgery for a housing development that was approved 10 years ago.\nWhen plans for 1,500 new homes in Westvale Park, near Horley, were agreed in 2015, they included a new surgery for the area.\nThousands of people now live in Westvale Park, but Surrey Heartlands Integrated Care Board (ICB) has chosen not to provide a GP to run the surgery there because it believes residents can already be served by other practices nearby.\nInstead, Reigate & Banstead Borough Council has found a doctor to run a consulting service in Westvale Park's neighbourhood hall, though the agreement is yet to be finalised.\nSpeaking in the Commons on Monday, the Liberal Democrat MP for Dorking and Horley, Chris Coghlan, asked for a meeting with housing secretary Angela Rayner to discuss how they can provide the surgery Westvale Park was promised.\nRayner said the government would \"robustly\" hold developers to account to ensure they provide agreed infrastructure on new housing developments.\nShe agreed to meet Coghlan and discuss the issue at Westvale Park.\nA spokesperson for the consortium of developers behind Westvale Park said it understood the importance of providing a medical facility on site.\n\"This is ultimately a decision for local NHS commissioners and, frustratingly, Surrey Heartlands and Sussex Integrated Care Board have not identified a GP to operate from this facility,\" the spokesperson said.\nSurrey Heartlands has spoken with the council about running the surgery but said operating a stand-alone facility for Westvale Park would not be viable.\n\"We understand residents may be keen to see additional facilities on site but as it is a relatively small population and there are existing GP services located nearby that will meet people's needs, we are unable to support a new GP practice at this time,\" a spokesperson said.\nOne of Sussex ICB's practices in West Sussex has a branch across the Surrey border, in Horley, so has agreed to run the facility in the community hall.\nA spokesperson for the council said it hoped the consulting service would be begin later this year in the village hall - though the building is still being built.\nSome residents said they doubt they will ever see a full GP service run from the surgery.\nKeith Barlow, chairman of the Westvale Park Residents' Association, said: \"It's been a nightmare.\n\"There's been no take up [to run it]. Having a GP service would be fantastic but I don't think it's going to happen.\"", "url": "https://www.bbc.co.uk/news/articles/c337101x3j8o"}