{"authors": ["Jonathan Sutton", "www.facebook.com"], "date_download": "2025-04-26 06:40:05", "date_modify": "2025-04-26 06:40:05", "date_publish": "2025-03-02 14:54:32", "description": "The proposed 141-acre site could have generated enough power for more than 11,000 homes.", "filename": "news_articles_c9deqpld8jno_1745649605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4878/live/3360e5b0-f774-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deqpld8jno_1745649605.html", "title": "Plans for 'colossal' solar farm rejected", "title_page": "Staffordshire: Plans for 'colossal' solar farm rejected by council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans for a \"colossal\" solar farm have been rejected by a council, amid more than 300 objections.\nThe proposed 141-acre site on Rownall Road in Wetley Rocks, Staffordshire, aimed to generate enough power for more than 11,000 homes.\nBut opponents of the scheme argued the development was \"ridiculous\" and \"ill-thought out\" and would transform the rural countryside into an industrial area.\nCouncillors at Staffordshire Moorlands District Council were united against the proposal and refused the plans at a recent meeting.\nLocal resident Peter Slinn said the site, equivalent to the size of 140 football pitches, would \"have a massive detrimental effect\" on his family and would dominate their \"lovely views of the countryside\".\n\"It will not just affect those residing in Wetley Rocks, Werrington and Bagnall, but due to the colossal size of this development positioned on a hill side rising up to the high trig point it will be visible for miles,\" he added.\n\"There is no amount of landscape screening that will hide this development.\"\nAnother objector, Joshua Clarke, also argued environmental concerns, suggesting the development would threaten local ecology and disrupt local species and habitats.\nDespite opposition, 36 residents had also supported the proposal, citing the need for more renewable energy and noting the solar farm's 40-year lifespan.\nPlanning agent Nick Beddoe told the planning committee the development would provide power to 11,600 homes, which he said was \"substantial\" as it was about a quarter of the 44,539 households within the district.\nHowever, Staffordshire councillor Keith Flunder said: \"Putting a solar farm like this on a hill has been a bit ridiculous to be honest, particularly in the greenbelt. We can see it from miles away.\"\nCouncillor Adam Parkes added the development was an \"ill-thought out\" application.\n\"For me it's just too big, it's too high and personally I think it negatively impacts more than the 11,000 homes that it is supposed to provide electricity for,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c9deqpld8jno"}