{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:57:58", "date_modify": "2025-05-19 14:57:58", "date_publish": "2015-02-02 12:12:11", "description": "Novelist Neil Gaiman and Lord of The Rings star, Sir Ian McKellen, are among those honoured at the BBC Audio Drama Awards.", "filename": "news_entertainment-arts-31089934_1747666678.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80723000/jpg/_80723517_624-gaiman.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31089934_1747666678.html", "title": "Ian McKellen, Neil Gaiman win at BBC Audio Drama Awards", "title_page": "Ian McKellen, Neil Gaiman win at BBC Audio Drama Awards - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Novelist Neil Gaiman and Lord of The Rings star Sir Ian McKellen are among those honoured at the BBC Audio Drama Awards.\nGaiman won the outstanding contribution award for the BBC Radio 4 adaptations of his work, Good Omens and Neverwhere.\nSir Ian picked up best actor for his role in the adaptation of Honore de Balzac's 1833 novel Eugenie Grandet.\nOther winners include veteran Scottish comic Stanley Baxter, who was given a lifetime achievement award.\nThe 88-year-old, who celebrates his 75th year in radio, started his career as a child actor on Children's Hour.\nHe appeared regularly on TV in the 1960s and 1970s, before returning to drama on Radio 4. His recent and ongoing Radio 4 series include The Stanley Baxter Playhouse and Two-Pipe Problems.\nNow in their third year, the awards are a celebration of audio drama, on air and online, giving recognition to the actors, writers, producers, sound designers, and others who work in the genre.\nThe event was hosted by actor Lenny Henry and director of BBC Radio, Helen Boaden, in the Radio Theatre at BBC Broadcasting House.\nPicking up his award, Gaiman said he has \"honoured, overwhelmed and thrilled\" and that radio had always been a passion of his from an early age.\n\"You can do amazing things inside someone's head with radio and radio drama,\" he said.\n\"I don't remember a time that I didn't care about radio drama... it can become part of the fabric of one's life, exercising the imagination, making the listener into a collaborator with the actors and the writer and the director.\n\"It's faster and more fun and cheaper to make than a feature film, and sometimes a hundred times more effective.\"\nGood Omens, the 1990 by Gaiman and Terry Pratchett was adapted for Radio 4 by Dirk Maggs, director of the radio and stage version of Hitchhiker's Guide to the Galaxy, and aired over Christmas.\nThe awards were handed out by stars including Olivia Colman, Jeremy Front, Ruth Jones, Neil Dudgeon, Barbara Flynn and Nina Wadia.\nHelen Boaden said: \"These awards celebrate the very best of British audio drama and showcase some of the finest actors, writers and producers in the world.\n\"I am incredibly proud of the role BBC radio plays in the genre and it has been brilliant to have been a part of another exciting event.\"\nPrevious winners include David Tennant and Andrew Scott for best actor, writer Katie Hims for best audio drama and Doctor Who: Dark Eyes for best online or non-broadcast audio drama.\nFull list of winners:\nBest original audio drama (Single play)\nEverything, Nothing, Harvey Keitel written and produced by Pejk Malinovski, a Falling Tree production for Radio 3\nBest audio drama (Series or Serial):\nAmbiguous Loss, written by Michael Butt, produced by Toby Swift, a BBC Radio Drama London production for Radio 4\nBest audio drama (Adaptation):\nCome to Grief, written and dramatized by Hannah Vincent and produced by Gordon House, a Sweet Talk production for Radio 4\nBest actor in an audio drama:\nIan McKellen in Eugenie Grandet, dramatised by Rose Tremain and produced by Gordon House, a Goldhawk Essential production for Radio 4\nBest actress in an audio drama:\nAisling Loftus in Educator, written by Hayley Squires and produced by Helen Perry, a BBC Radio Drama London production for Radio 3\nBest supporting actor or actress in an audio drama:\nMichelle Terry in Educator, written by Hayley Squires and produced by Helen Perry, a BBC Radio Drama London production for Radio 3\nOutstanding contribution award:\nNeil Gaiman\nLifetime achievement Award:\nStanley Baxter\nBest debut performance in an audio drama:\nJade Matthew in A Kidnapping, written by Andy Mulligan and produced by John Dryden and Nadir Khan, a Goldhawk Essential production for Radio 4\nBest use of sound in an audio drama:\nThe Boy at the Back, sound by Steve Bond, written by Juan Mayorga and produced by Nicolas Jackson, an Afonica Sound production for Radio 3\nBest scripted comedy drama:\nLunch, written by Jon Canter, produced by Sally Avens, a BBC Radio Drama London production for Radio 4\nBest scripted comedy with a studio audience: John Finnemore's Souvenir Programme, written by John Finnemore, produced by Ed Morrish, a BBC Radio Comedy for Radio 4\nBest online or non-broadcast audio drama: Hood - The Scribe of Sherwood, written by Iain Meadows, produced by Spiteful Puppet Entertainment\nImison Award for best script by a new writer:\nHow to Say Goodbye Properly by EV Crowe\nTinniswood Radio Drama Award for best radio drama script:\nGoodbye by Morwenna Banks", "url": "https://www.bbc.com/news/entertainment-arts-31089934"}