{"authors": ["Laura Devlin", "www.facebook.com"], "date_download": "2025-04-26 04:37:23", "date_modify": "2025-04-26 04:37:23", "date_publish": "2025-02-28 11:26:33", "description": "The solicitor general says it is a \"stark warning to those who commit violent acts against women\".", "filename": "news_articles_cq8yynj3gy9o_1745642243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba0e/live/4579de90-f5c2-11ef-97ab-abb74cabf06c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq8yynj3gy9o_1745642243.html", "title": "Stuart Worby's jail term increased in Norfolk abortion pills case", "title_page": "Stuart Worby's jail term increased in Norfolk abortion pills case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who sexually assaulted a pregnant woman and gave her medication which caused her to miscarry has had his jail sentence increased.\nStuart Worby, 40, from Dereham, Norfolk, will now serve 17 years instead of 12 after the case was referred to the Court of Appeal by the solicitor general under the unduly lenient sentence scheme.\nHis trial at Norwich Crown Court last year heard he administered the drugs in orange juice when the victim was blindfolded.\n\"This is a stark warning to those who commit violent acts against women – you will face very serious consequences,\" said the Solicitor General Lucy Rigby.\n\"I was disgusted by this offender's appalling crimes and I welcome the court's decision to increase his sentence following my referral.\"\nOn Thursday, the Court of Appeal heard Worby obtained the drugs in 2022, using an associate who rang a clinic while posing as a pregnant woman looking to terminate her pregnancy.\nThe first dose was dissolved into the victim's drink, with a second dose physically inserted into the victim when she was blindfolded during what the prosecution had described as a \"kinky sex\".\nShe suffered immediately from the drugs and Worby refused to seek medical help, even asking his associate for more drugs as he thought they had not worked.\nThe next day the victim suffered a miscarriage and is now unable to have children.\nThe woman initially thought she had miscarried naturally but contacted the police after discovering messages on Worby's phone to his friend saying, \"it's working\" and \"there is a lot of blood\".\nWorby accepted he had obtained the medication unlawfully but denied he ever gave it to the woman.\nOn 6 December, he was found guilty of one count of administering a poison with intent to procure a miscarriage and one count of assault by penetration and was jailed for 12 years.", "url": "https://www.bbc.co.uk/news/articles/cq8yynj3gy9o"}