{"authors": ["Grace Wood", "www.facebook.com"], "date_download": "2025-04-26 06:49:42", "date_modify": "2025-04-26 06:49:42", "date_publish": "2025-03-01 09:10:14", "description": "Gary Devonport hopes to raise cash in South Yorkshire for homeless ex-members of the armed forces.", "filename": "news_articles_c4g0w10jjwpo_1745650182.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fadd/live/4f25a840-f4e9-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g0w10jjwpo_1745650182.html", "title": "Doncaster firefighter's rough-sleep month for homeless veterans", "title_page": "Doncaster firefighter's rough-sleep month for homeless veterans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A firefighter plans to sleep outside for the whole of March in an effort to raise money for homeless veterans.\nSouth Yorkshire Fire and Rescue station manager Gary Devonport, 40, said he hoped to raise £3,000 for the Royal British Legion Industries charity, while also raising awareness of the problems veterans faced when they left the Army.\nMr Devonport said his experiences in the armed forces and supporting the veteran community in the fire service had inspired the challenge.\n\"The original plan was for one night, but I thought to raise as much money as I could it had to be some sort of a challenge. So I decided to do it for a month - and with no tent as well,\" he explained.\nMr Devonport said his challenge was part of The Great Tommy Sleep Out, a national fundraising challenge designed to support homeless veterans experiencing homelessness in the UK.\nHe said he would spend most nights in March in a sleeping bag under tarpaulin in his garden.\n\"I will use an old school military basha, which is essentially a bit like a tarpaulin that you normally span from a couple of trees, but it might be a garden fence,\" he said.\nMr Devonport served in the armed forces for six years between 2001 and 2007 before becoming a firefighter.\n\"I loved my time in the military. It just kind of came to a natural end and I needed something for me that was similar in terms of discipline, structure and meaning,\" he said.\n\"I think it's quite important to be a part of something. So, for me, leaving the military, I was always going to try to be in a uniform service because I saw the natural similarities between them both.\"\nMr Devonport, who works with South Yorkshire Fire and Rescue's Armed Forces Network supporting other veterans, said soldiers were \"notoriously terrible at asking for help\".\n\"That's why some find their way on to the streets, because it's not normally first nature to ask people for support,\" he said.\n\"We've seen a boom in general homelessness anyway, in the last sort of 10 years. You only have to go to London and look in most alleyways to see there's quite a lot of homelessness.\"\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c4g0w10jjwpo"}