{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 08:08:34", "date_modify": "2025-04-26 08:08:34", "date_publish": "2025-02-26 13:38:53", "description": "A council says demolishing its seafront building, that hosted Blur and Pink Floyd, is not an option.", "filename": "news_articles_cdrxy5g6jezo_1745654914.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b9d4/live/04102010-f39f-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrxy5g6jezo_1745654914.html", "title": "Gorleston's Ocean Room to be put up for sale a year after closure", "title_page": "Gorleston's Ocean Room to be put up for sale a year after closure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A historic dance venue on the Norfolk coast is due to be put up for sale because the costs of repairing or demolishing it are too expensive.\nGreat Yarmouth Borough Council said surveys estimated about £800,000 would be needed to bring the Ocean Room in Gorleston-on-Sea back into commercial use.\nThe venue, whose recent shows included hip-hop blues musician Rag'n'Bone Man just before the Covid lockdown in 2020, closed in 2024 as the previous operator - who leased the building from the council - went into administration.\nGraham Plant, deputy leader at the Conservative-run council, said: ''There are significant financial risks for the council in it taking on work at the Ocean Room. But doing nothing is not an option and no-one wants to see the building deteriorate.''\nThe 1939 building has a history that includes Pink Floyd, Blur and \"grab-a-granny\" discos.\nThe council said the building was returned in a poor state and a number of surveys had been carried out to work out the costs of bringing the building back into use.\nAn independent report looked at demolition and redevelopment for leisure, residential, hotel, senior living or care home options.\nDemolition and redevelopment by the council has been ruled out at this stage, and instead it is recommended the local authority marketed the freehold for three months, and reconsidered options if it failed to attract a buyer.\nThe council said it had received an offer to lease the Ocean Room but the costs involved meant that was not a viable solution.", "url": "https://www.bbc.co.uk/news/articles/cdrxy5g6jezo"}