{"authors": ["Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:38:22", "date_modify": "2025-04-26 04:38:22", "date_publish": "2025-02-28 10:43:54", "description": "It follows complaints over rows of vehicles being able to mount a footpath because of a lapse in legislation.", "filename": "news_articles_cgq99vjke51o_1745642302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae4b/live/a448b4e0-f528-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgq99vjke51o_1745642302.html", "title": "Belfast: Bedford Street pavement parking 'legal loophole' to be closed", "title_page": "Belfast: Bedford Street pavement parking 'legal loophole' to be closed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stormont is closing a \"legal loophole\" that meant pavement parking was permitted along one of Belfast city centre's busiest streets.\nRows of traffic cones have been placed on a footpath on Bedford Street ahead of new restrictions taking effect on Monday.\nIt follows complaints over vehicles being able to mount the pavement because of a lapse in legislation.\nA Department for Infrastructure (DfI) spokesperson said enforcement would begin once new signage had been put up and road markings had been refreshed.\nCampaigners criticised delays in renewing the parking laws, which the DfI had blamed on \"Covid and other work pressures\".\nRows of traffic cones strung together with fluorescent tape were placed along the footpath on Friday.\nAn \"experimental traffic control scheme\" will apply for six months, the Stormont department said on its website., external\n\"The department will consider in due course whether the provisions of the scheme should continue indefinitely,\" it added.\nBedford Street is one of the main routes into Belfast city centre, with landmarks including Invest NI's headquarters and the Ulster Hall.\nVehicles have been parking on a footpath that was widened in 2018 as part of a project aimed at improving the area for pedestrians.\nThe \"Better Bedford Street\" scheme cost more than £67,000, with funding split between DfI, the Department for Communities and Belfast City Council.\nIn November, the DfI said a previous experimental order for the extended footway and double-yellow lines on the street had lapsed.\n\"Unfortunately, due to Covid and other work pressures the permanent legislation has not been taken forward,\" it added.\nBusiness groups and campaigners had urged the DfI to resolve the issues quickly.\nAnne Madden, from the walking and cycling charity Sustrans, welcomed the move to close the \"legal loophole\".\nShe said it had enabled \"rampant pavement parking\" which \"made a mockery of the original intention of the Better Bedford Street scheme\".\n\"The obstacle course of cars parked on the pavement is a terrible advertisement for Belfast,\" she added.\n\"We urge DfI to make this a permanent change and increase enforcement to ensure Bedford Street really is a welcoming place for people working, shopping and living in the city centre.\"\nChris McCracken, managing director of Linen Quarter Business Improvement District (BID), also welcomed the move.\n\"We are also keen to work alongside DfI on broader challenges, such as effective cycling infrastructure and the creation of low traffic neighbourhoods, to ensure Belfast can reach its full potential as a sustainable city,\" he added.\nIn a statement a DfI spokesperson said: \"The legislation (in the form of an Experimental Traffic Control Scheme - ETCS) for Bedford Street is due to become operational w/c Monday 3 March 2025 and works are also underway to erect signage and refresh the road markings.\n\"Once these measures have been put in place enforcement will commence.\"\nWhere parking restrictions are marked on the road, such as yellow lines, those restrictions also apply to the pavement - meaning parking tickets can be issued.\nVehicles parked on a footpath that are causing an obstruction can be dealt with by police, according to the NI Direct website, external.\nIn 2023, the DfI introduced a ban on pavement parking in some specific locations, external, such as footpaths beside bus or cycle lanes.\nIt has described \"inconsiderate pavement parking\" as an ongoing issue across Northern Ireland.\n\"The department routinely reminds drivers to 'think before you park' and continues to take action against vehicles that are in contravention of legislated parking restrictions, including those that apply to footways,\" it added.\nIt added that officials were \"exploring potential next steps\" following a consultation to help with future policies on pavement parking.", "url": "https://www.bbc.co.uk/news/articles/cgq99vjke51o"}