{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:34:48", "date_modify": "2025-04-26 06:34:48", "date_publish": "2025-02-27 06:20:57", "description": "The sub-panel will assess changes to Jersey's employment law which took place in 2018 and 2020.", "filename": "news_articles_c15qzj9vjxwo_1745649288.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9206/live/8358b330-f464-11ef-8dd5-1d47b25c094a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qzj9vjxwo_1745649288.html", "title": "Family experiences wanted for Jersey scrutiny panel", "title_page": "Family experiences wanted for Jersey scrutiny panel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families and employers have been encouraged to share their experiences of family-friendly legislation as part of a States of Jersey scrutiny sub-panel.\nThe sub-panel will assess changes to Jersey's employment law from 2018 and 2020, which included increasing the length of paid parental leave and introducing the right for mothers to request breastfeeding breaks.\nA survey to review the changes carried out last year by the Minister for Social Security, found actions such as increasing awareness of the changes and a further look at parental allowance rules were needed.\nThe States said the sub-panel will investigate the progress of the actions and assess the effectiveness of the 2024 survey.\nDeputy Louise Doublet, who will chair the sub-panel, said the employment law amendments were seen \"as a progressive and positive step forward\" at the time.\n\"But the post-implementation survey suggests the changes were not sufficiently communicated to both parents and employers,\" she added.\n\"We, as a panel, want to ensure the current legislation and policy is sufficient to provide children with the best start in life, and that the minister has addressed the concerns raised in that post-implementation survey.\"\nThe States said the panel also wanted to speak to organisations which support families locally or help businesses to enact change.\nA public hearing will be held to question the Minister for Social Security about the process.", "url": "https://www.bbc.co.uk/news/articles/c15qzj9vjxwo"}