{"authors": ["Khanyisile Ngcobo", "www.facebook.com"], "date_download": "2025-04-26 03:52:23", "date_modify": "2025-04-26 03:52:23", "date_publish": "2025-03-03 10:26:15", "description": "Joshlin Smith has been missing for over a year after she disappeared outside her home in Saldanha Bay", "filename": "news_articles_cm2dy4446d7o_1745639543.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c2d/live/bda4c120-f809-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2dy4446d7o_1745639543.html", "title": "Joshlin Smith disappearance: South African mother goes on trial for kidnapping", "title_page": "Joshlin Smith disappearance: South African mother goes on trial for kidnapping - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The mother of a six-year-old girl who disappeared more than a year ago in South Africa has gone on trial accused of organising her kidnapping.\nKelly Smith, her boyfriend Jacquen Appollis and their friend Steveno van Rhyn were arrested after Smith's daughter, Joshlin, went missing from outside her home in Saldanha Bay, near Cape Town, in February last year.\nJoshlin's disappearance sent shockwaves across South Africa and despite a highly publicised search for her, she is yet to be found.\nAll three have pleaded not guilty to charges of human trafficking and kidnapping.\nAn intense and widespread search then ensued for the young girl but attention soon turned to Ms Smith after her friend and former co-accused, Lorentia Lombaard, turned state witness, according to South Africa's Daily Maverick news site.\nHer search even attracted the interest of Sports Minister Gayton McKenzie, who offered a reward of one million rand (£42,500; $54,000) for her safe return.\nThe trial will run from 3-28 March at the Saldanha multi-purpose centre, which has been repurposed into a high court specifically for the case.\nA judge presiding over the case earlier this year explained that the location was selected to \"ensure the community has access\" to proceedings throughout the marathon trial.", "url": "https://www.bbc.co.uk/news/articles/cm2dy4446d7o"}