{"authors": ["Don Mort", "www.facebook.com"], "date_download": "2025-04-26 04:39:39", "date_modify": "2025-04-26 04:39:39", "date_publish": "2025-02-28 09:10:43", "description": "The fast food giant says its outlet in Headingley would be in keeping with the surrounding area.", "filename": "news_articles_c4g007qgll8o_1745642379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9175/live/59a3cdb0-f52f-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g007qgll8o_1745642379.html", "title": "McDonald's on Otley Run pub crawl route set for approval", "title_page": "McDonald's on Otley Run pub crawl route set for approval - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to open a new fast food outlet on the route of a popular pub crawl have been recommended for approval.\nMcDonald's applied to Leeds City Council to open a new branch at the site of the former Wilko store at Headingley Central on Otley Road.\nThe plan had attracted some criticism, with Leeds Central and Headingley Labour MP Alex Sobel saying it would \"exacerbate anti-social behaviour, noise and littering problems\" associated with the pub crawl known as the Otley Run.\nBut a council report said the objections received were outside the scope of the planning application, and recommended approval with conditions.\nThe report to be scrutinised by councillors said: \"Overall, it is considered that the proposal complies with the aims and intentions of both national and local planning policy.\"\nHowever, in January, Sobel said the plans were \"completely out of keeping with the area\".\nThe proposed restaurant was the \"equivalent\" of the chain's largest existing restaurant in the city, located on Briggate, he said.\nOpening an outlet of the same size in Headingley would be a \"complete disaster\", Sobel said, adding: \"Residents and local businesses would clearly suffer through diminished property values and in terms of their day-to-day quality of life.\"\nA McDonald's spokesperson said it would strive to be \"a good neighbour\" and wanted to work with the local community to \"address any concerns they may have\".\nLeeds City Council received 20 letters of concern from people living nearby and from ward councillors over planned alterations, including a new shop front, according to the Local Democracy Reporting Service.", "url": "https://www.bbc.co.uk/news/articles/c4g007qgll8o"}