{"authors": ["Ali Abbas Ahmadi", "www.facebook.com"], "date_download": "2025-04-26 03:46:53", "date_modify": "2025-04-26 03:46:53", "date_publish": "2025-03-05 03:01:08", "description": "Green is a fierce critic of Donald Trump and previously called for his impeachment.", "filename": "news_articles_c5y07glyge3o_1745639213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/462e/live/960db680-f96c-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y07glyge3o_1745639213.html", "title": "US Representative Al Green is removed from chamber during Trump address", "title_page": "US Representative Al Green is removed from chamber during Trump address - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Representative Al Green was ejected from the House chamber for heckling President Donald Trump during his joint address to Congress on Tuesday night.\nGreen, a Democratic lawmaker from Houston in Texas, stood up and shouted 'Mr President, you don't have a mandate!' just minutes into Trump's address, referring to Medicaid cuts.\nHe was immediately drowned out by Republicans shouting \"U-S-A!,\" before House Speaker Mike Johnson ordered his removal from the chamber.\nGreen is a fierce critic of President Trump, and called for the impeachment of the president during his first term in office.\nSpeaking to reporters after he left the chamber, Green said he is willing to accept whatever punishment he is given for his actions.\nHe doubled down on his message, saying Trump \"has no mandate to cut Medicaid\", and that he is preparing articles to impeach the president.\n\"This is the richest country in the world, and we have people who don't have good health care. We've got to do better and now we're about to cut Medicaid, which is for [the] poor,\" he said.\nMedicaid is the programme that helps cover medical costs for those with limited income and resources. It has become one of the biggest issues for Democrats concerned that about reductions to the programme.\nTrump has said Medicaid won't be affected, but achieving the widespread cuts Republicans promise could be difficult without cutting major social services.\nSeveral prominent Democrats such as House Minority Leader Hakeem Jeffries and Senate Minority Leader Chuck Schumer invited Medicaid beneficiaries as guests to the joint address.\nNew York Representative Alexandria Ocasio-Cortez went on Instagram Live after Trump's address, warning that Trump and the Republicans \"are coming for Medicaid\".\nGreen was not the only Democrat who protested in the chamber.\nSeveral Democratic women were seen wearing pink dresses in protest of President Trump's policies, saying that rising costs are disproportionately affecting women.\nOthers were seen wearing yellow and blue ties, to show their support for Ukraine, representing the colours of the country's flag.\nTrump said Monday that he is pausing all military aid to Ukraine, a few days after his spat with Ukrainian counterpart Volodymyr Zelensky in the Oval Office.\nThe Democrats largely remained seated and quiet throughout Trump's address, but some flashed placards with the word 'false' on them in response to some of the president's claims.\nThis is in contrast to Republican lawmakers, who loudly applauded throughout Trump's speech and occasionally burst into 'U-S-A' chants during his speech.", "url": "https://www.bbc.co.uk/news/articles/c5y07glyge3o"}