{"authors": ["Paul Hastie", "www.facebook.com"], "date_download": "2025-04-26 03:43:48", "date_modify": "2025-04-26 03:43:48", "date_publish": "2025-03-05 08:15:39", "description": "Both Scotland's finance secretary and transport secretary have confimed they will stand down in 2026.", "filename": "news_articles_cjw2nppn12qo_1745639028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6e41/live/707a1d70-fa55-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw2nppn12qo_1745639028.html", "title": "Shona Robison and Fiona Hyslop to stand down as MSPs", "title_page": "Shona Robison and Fiona Hyslop to stand down as MSPs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Finance secretary Shona Robison has announced she will stand down at the next Holyrood election after 27 years as an MSP.\nRobison, the MSP for Dundee City East, has held several roles in SNP governments including health secretary and social justice secretary.\nShe became deputy first minister under Humza Yousaf in 2023, but was replaced by Kate Forbes in John Swinney's government last year.\nShortly after her announcement, Transport Secretary Fiona Hyslop also confirmed she would stand down from her Linlithgow seat in 2026.\nRobison said the time was right to \"take on some new challenges\" and make a different contribution to public life.\nShe said: \"After careful consideration and reflection, I have decided that I will not seek re-election.\n\"I am deeply proud of my ministerial contributions and achievements.\"\nShe added: \"The best moments over my time at Holyrood have come from representing and supporting my constituents.\n\"I will forever be grateful to them for giving me the opportunity to serve them.\"\nPaying tribute, First Minister John Swinney said she had made a \"formidable contribution\" to the parliament and SNP.\nHe said: \"She has been a great friend, colleague and ally to me and I am sorry she will stand down at the election.\n\"I send my warmest wishes to her for all that lies ahead.\"\nBorn in Redcar in Yorkshire, Robison worked in Glasgow City Council's social work department before being elected to Holyrood in 1999.\nShe became an SNP list member for the north east Scotland region, before winning the Dundee East seat in 2003.\nShe has held the constituency at every Holyrood election since.\nWhen the SNP first entered government in 2007 Robison was made public health minister.\nShe next took on a sports brief, overseeing preparations for the 2014 Glasgow Commonwealth Games and Ryder Cup at Gleneagles.\nRobison was promoted to cabinet by First Minister Alex Salmond in 2014, in the role now known as social justice secretary.\nShe was given a further promotion within the year, as health secretary under new first minister Nicola Sturgeon.\nShe has been a close friend of Sturgeon throughout their political careers, since the pair were part of the SNP youth wing together.\nRobison's tenure as health secretary saw increased government spending and the NHS Scotland workforce hitting a record high - but she faced mounting pressures over NHS performance.\nThis pressure grew following a series of financial issues at the health board in her own constituency, NHS Tayside.\nMeanwhile, Fiona Hyslop said it had been an \"enormous honour\" to serve as an SNP MP.\nShe said she would not seek re-election in 2026 in order to spend more time with her family.\nHyslop said: \"The decision to retire is entirely personal and I do it for positive reasons.\n\"I came into politics to change things for the better. It has meant a great deal to me to have had the opportunity to serve in government.\n\"There is still a great deal of work to be done to elect an SNP government in 2026, and I remain passionate about securing a better future for Scotland as an independent nation.\"", "url": "https://www.bbc.co.uk/news/articles/cjw2nppn12qo"}