{"authors": ["Georgia Stone", "www.facebook.com"], "date_download": "2025-04-26 03:39:51", "date_modify": "2025-04-26 03:39:51", "date_publish": "2025-03-05 10:55:02", "description": "A netball team is campaigning against having to move to a new site for a third time.", "filename": "news_articles_crewwqyee8po_1745638791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/15ef/live/b37c4410-f837-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crewwqyee8po_1745638791.html", "title": "Bristol netball team 'devastated' at loss of Easton court", "title_page": "Bristol netball team 'devastated' at loss of Easton court - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A netball team is campaigning to keep a full-sized netball court at a council-run leisure centre that is being redeveloped.\nThe Back to Netball team from Easton, Bristol, says it will no longer be able to play at Easton Leisure Centre, which is run by Everyone Active on behalf of Bristol City Council., because it will no longer have a full-sized court.\nSusan Anderson, 62, from Hartcliffe, has been running the training sessions for 14 years and said the team was \"devastated\" as it had already had to relocate twice before.\nCity councillor Stephen Williams, chair of the public health and communities committee, said he understood the disappointment but a small court would still be available.\nThe Back to Netball sessions, run by Netball England, are designed to encourage women back to the sport.\nMore than 20 women attend the sessions in Bristol – including women from diverse communities and backgrounds.\nThe team says it was not consulted in the decision to redevelop the court.\nMs Anderson said: \"There is a real community spirit amongst these girls.\n\"They just keep moving us and, everywhere we go, they keep taking the courts away.\n\"They offered us another venue, but we want to stay here.\"\nJanie Randell, 42, from Fishponds, has played at the club since it started and said she would \"fight\" for the club because they were \"such a great family\".\n\"Even on my lowest days, I come here and I feel so much better knowing I am around people and doing something good for myself,\" she said.\nThe team says it will have to find a new court to play on from 21 April.\nIt says the Easton Leisure centre court worked well because it was completely private, which it says also enabled Muslim women to play in a women-only environment.", "url": "https://www.bbc.co.uk/news/articles/crewwqyee8po"}