{"authors": ["Wedaeli Chibelushi", "www.facebook.com"], "date_download": "2025-04-26 08:09:45", "date_modify": "2025-04-26 08:09:45", "date_publish": "2025-02-26 12:51:01", "description": "The UK says it is halting aid to Rwanda as a result of its support for the M23, a notorious rebel group.", "filename": "news_articles_ce8y5j49xgyo_1745654985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2438/live/6264c200-f431-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8y5j49xgyo_1745654985.html", "title": "Rwanda: UK suspension of aid over DR Congo war is 'punitive'", "title_page": "Rwanda: UK suspension of aid over DR Congo war is 'punitive' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK's decision to suspend some aid to Rwanda is \"punitive\", authorities in the East African country have said.\nIn a statement, the UK said it was against Rwanda's support for the M23, a rebel group that has captured swathes of eastern Democratic Republic of Congo in a deadly uprising.\nRwanda used to deny backing the M23, but recently it has adopted a more defensive line, saying fighting near the border between DR Congo and Rwanda is a threat to its security.\nMore than 7,000 people have died and hundreds of thousands have fled their homes since the conflict escalated in January, DR Congo's government says.\nThe UK said the humanitarian situation in DR Congo was \"critical\" and that it would halt bilateral aid to Rwanda, \"excluding support to the poorest and most vulnerable\".\nEarlier this month, UK Foreign Secretary David Lammy said Rwanda receives about £32m ($40m) of bilateral aid from the UK every year.\nAlong with the suspension of aid, the UK will impose other measures, such as looking into potential sanctions and suspending \"future defence training assistance\", the statement said.\nThese measures will last until \"significant progress\" is made in ceasing hostilities and withdrawing Rwandan military personnel from DR Congo, it added.\nUN experts have previously estimated that between 3,000 and 4,000 Rwandan troops are in eastern DR Congo.\nRwanda's foreign ministry said the \"punitive measures\" announced by the UK government \"in response to the conflict in eastern DRC - where the UK has now clearly chosen a side - are regrettable\".\n\"The measures do nothing to help the Democratic Republic of Congo, nor do they contribute to achieving a sustainable political solution to the conflict in eastern DRC.\"\nThe UK has previously enjoyed good relations with Rwanda. In 2022, the two countries signed a multi-million pound deal, in which some asylum seekers arriving on British soil would be deported to Rwanda.\nThe deal faced legal challenges and was scrapped last year after a change in the UK's government.\nDR Congo's government has been campaigning for international powers to suspend aid and impose sanctions on Rwanda.\nLast week, the US Treasury Department said it had imposed sanctions on Rwanda's Minister of State for Regional Integration, James Kabarebe.\nThe US accused Kabarebe, a former army chief, of being central to Rwanda's support for M23.\nAlso sanctioned was Lawrence Kanyuka, the M23's spokesman, as well as two companies he controlled in France and the UK, the US Treasury said.\nResponding to the US move, Rwanda's foreign ministry said the sanctions were \"unjustified\".\nThe M23 says it is fighting to achieve better rights for the Tutsis, an ethnic minority group in DR Congo, and to bring order to a failed state.\nThe rebels have captured eastern DR Congo's two biggest cities, Goma and Bukavu.", "url": "https://www.bbc.co.uk/news/articles/ce8y5j49xgyo"}