{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:34:24", "date_modify": "2025-04-26 06:34:24", "date_publish": "2025-02-27 06:28:48", "description": "Maz, 69, wants to empower others from the LGBT+ community to sit in court.", "filename": "news_articles_ce30nnl0g74o_1745649264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/385e/live/82426870-f378-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce30nnl0g74o_1745649264.html", "title": "Weston trans magistrate urges LGBTQ+ members to volunteer", "title_page": "Weston trans magistrate urges LGBTQ+ members to volunteer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the UK's first transgender magistrates is calling for other people within the LGBTQ+ community to volunteer.\nMaz Edwards, 69, who has been a magistrate in Weston-super-Mare in North Somerset since 2002, said there is \"great camaraderie\" in court.\n\"It's not about being male or female, it's about being judicial,\" she said.\n\"In court I am me, I sit in the chair in the middle and I control the court.\"\nMs Edwards is a wheelchair user and sits in North Somerset Magistrates' Court, which has wheelchair access.\n\"I have never had a problem in court. I have had one advocate misgender me but I corrected him.\n\"I was the first in my area - I have spoken to a couple of trans judges but there are not many and we are less than 1% of the population anyway.\n\"Any conviction changes a life. Having something serious in court is sobering, but at the end of the day I have delivered justice,\" she said.\nThe challenges and responsibilities of the role are matched by the rewards, she added.\n\"There is such camaraderie among magistrates - we are not special, we have just stepped up.\n\"But anybody can do it, adjustments can be made.\n\"As long as you have good character and are prepared to do the training, it could be you next,\" she added.", "url": "https://www.bbc.co.uk/news/articles/ce30nnl0g74o"}