{"authors": ["Sima Kotecha", "www.facebook.com"], "date_download": "2025-04-26 07:25:39", "date_modify": "2025-04-26 07:25:39", "date_publish": "2025-02-28 00:00:23", "description": "The government wants to adopt a scheme which encourages inmates to gain qualifications and take jobs.", "filename": "news_articles_cr52399eqgqo_1745652339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/709a/live/7a475af0-f520-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr52399eqgqo_1745652339.html", "title": "The US supermax prison the government hopes will solve UK prison crisis", "title_page": "The US supermax prison the government hopes will solve UK prison crisis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A pungent smell of detergent and rotten food hits me as we walk through this enormous high-security prison. Inmates press themselves up against the bars to look at us. There are no smiles, only expressionless stares.\nA man with a tattoo that swirls across his face shouts, \"Where you from, ma'am?\"\n\"England.\"\n\"Hope you enjoy Estelle,\" he says.\n\"Do you?\" I ask.\n\"A lot better than where I was before.\"\nWelcome to the Estelle Supermax Penitentiary in Huntsville, Texas.\nConcrete watchtowers punctuate the perimeter of this vast space - equivalent in size to almost 3,000 football pitches - and a sign with an image of a red-maned lion and the words Stay Hungry - Feast on Success greets staff and visitors as they enter.\nThe UK government is looking to Estelle prison for ideas - for ways to reduce reoffending and to bring down prisoner numbers in our already overcrowded jails. There's a scheme here they'd like to emulate, which gives inmates the chance to shorten their sentences by having a job while they're inside.\nLooking to this prison for inspiration might seem a curious choice to many, given Texas executes more people than any other US state. But ministers say by implementing schemes similar to ones used here, UK prisoners will be incentivised to gain qualifications - giving them more chance of employment once released.\nJust one in five offenders in England and Wales has a job six weeks after being released from custody, the latest stats show. According to the Ministry of Justice, people who are still unemployed six weeks after being released are twice as likely to reoffend as those in employment.\nNo prison in the UK has as many inmates as they do at Estelle. More than 3,000 men in white jail-suits are currently locked up here - from murderers and rapists, to those doing time for lesser crimes like shoplifting and fraud. Two inmates are on death row.\nJimmy Delgado is 52 and serving three life sentences for first-degree murder. He's already been inside for 25 years - 13 spent in solitary confinement. He's a large man with muscular shoulders and smiles broadly when we meet in the prison chapel, softly shaking my hand. He tells me he first ended up in prison aged just 16, after carrying out a robbery.\nHe's remorseful for his crimes and says this prison - together with his faith in Jesus - has helped turn his life around by giving him purpose. He now works as a counsellor, supporting offenders who are struggling to cope with life in prison.\n\"I'm here for taking a life - and I'm here to save multiple lives,\" he says. \"If I can change the dynamic of family life for all these guys that are here then I've done my job - even if I never get out of prison.\"\nDelgado may never be released, but inmates having jobs in prison is one of the reasons why Estelle Supermax Penitentiary is appealing to the UK government.\nThe \"good time credit\" scheme used here gives inmates the opportunity to reduce their time behind bars by participating in courses and studying for qualifications, taking up jobs, and behaving well.\nCredits earned are then added to the number of days the prisoner has already spent in jail, allowing them to reach their parole eligibility date sooner - when a panel decides if they're suitable for early release. This process depends on the classification of their crime and an assessment by the parole board on their overall rehabilitation.\nOff the long corridor that runs through the main prison building, inmates are quietly working in a small barbers. Kevin Smith is inside for minor offences. He is meticulously cutting a member of staff's hair with a pair of clippers, and says the good time credit scheme has made him feel positive about his time in prison.\n\"They helped me see that if I do the right thing and make the right decisions, I can do better in life,\" he says. \"I receive good time by working here, and I can get out earlier with the good time that I received - it works.\"\nThe rates of those returning to prison within three years of release have fallen to 20.3% in Texas - a fraction of those in the rest of the United States (68%).\nThe BBC came to Estelle to see their credit scheme in action with UK justice secretary Shabana Mahmood.\n\"The Texans had a system similar to ours - on the point of collapse, running out of prison places in 2007,\" Ms Mahmood says. \"They've now got a sustainable prison population - but most importantly, they've been able to massively cut the rates of reoffending here. They've got a rate of crime now that they haven't seen since the 1960s.\"\nShe believes the Texan credit system is effective - helping prisoners get out of prison early - and stay out. \"It does help prisoners turn their backs on a life of crime.\"\nThe Texas prison population is the highest of any state in the US, with 134,668 people in custody in the autumn of 2024 - although over the last couple of decades, since reforms were implemented, that number has reduced by nearly 20%. However, some experts say the good time credit programme is not a magic bullet.\n\"The incentivisation scheme has little to do with the reforms that helped bring Texas's prison population down in 2007,\" says Michele Deitch, a criminal justice policy lecturer at the University of Texas. \"And by itself it will do little to address the UK's very serious overcrowding problem.\"\nWhat would make a real difference, she says, would be diverting more people from incarceration in the first place: \"To shorten sentences, to reduce the use of recalls to prison, and to invest more heavily in rehabilitative programs in prison and in programs and services in the community.\"\nAs well as incentivisation, the UK government is also considering the use of \"diversion programmes\" - where offenders are sent on rehabilitation courses rather than to jail. This can apply to people with addiction issues or mental health problems. It's what they do here in Texas to reduce the burden on the courts and attempt to sort the root cause of the offence.\nIt's a plan with \"huge potential in the UK\" according to Nick Hardwick, a former chief inspector of prisons, who believes it will make prisons safer and more productive.\n\"It will help ensure prisoners are doing what is necessary to reduce the risk they will reoffend and create more victims,\" he says.\nBut not everyone agrees with incentivising convicted criminals to work towards an early release from prison.\nSamantha Nicholls' son was murdered in 2018. Twenty-two year old Joe Pooley was thrown into a river in Ipswich and held under the water. Three people were jailed for his murder in 2021. Joe's mother believes inmates should never be released before their sentence is complete.\n\"Prison is a punishment - you should do your time,\" she says. \"It needs to be a deterrent - you're there because you did something wrong.\"\nIt's clear the UK needs to find solutions to cut prison overcrowding – and find them fast. Even the recent prisoner early release scheme will barely keep pace with more offenders being jailed. New prison buildings will take years to come on stream. But does this Texan prison have the answers?\nThe challenge for ministers and the criminal justice system is how to stop the revolving doors on the UK's prisons - the reoffending and lack of prospects facing those who are released which draws them back into crime.", "url": "https://www.bbc.co.uk/news/articles/cr52399eqgqo"}