{"authors": ["Louise Fewster & Sabbiyah Pervez", "www.facebook.com"], "date_download": "2025-04-26 04:02:35", "date_modify": "2025-04-26 04:02:35", "date_publish": "2025-03-04 00:31:49", "description": "Rashid Zaman failed DBS check to work with children yet visited schools for charity projects.", "filename": "news_articles_c5yewk7zen8o_1745640155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74c5/live/54d1e740-ef71-11ef-a467-85bd361ad9bb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yewk7zen8o_1745640155.html", "title": "Bradford: Murderer worked in schools despite ban", "title_page": "Bradford: Murderer worked in schools despite ban - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A convicted murderer spent almost two years working with children after he was barred from doing so, the BBC has learned.\nRashid Zaman, 44, from Bradford, West Yorkshire, served 15 years in prison for killing a man who tried to stop him and two others stealing a car in Halifax in 2001.\nAfter his release, he began volunteering with the national charity, St Giles Trust, in 2021, and later became a paid employee who visited schools and young people's homes.\nThe charity said Zaman, who has not responded to the BBC's attempts to contact him, did not tell them he had been barred from working with children and that he was dismissed as soon as senior management found out.\nThe BBC has seen both of the Disclosure and Barring Service (DBS) certificates that St Giles asked Zaman to provide. The first, from 2021, did not say he was barred from working with children. But the most recent one, issued in March 2023, did say he was barred.\nSt Giles said its senior management was not aware of the outcome of the most recent DBS check until December 2024, which meant Zaman continued in his role - and had contact with 28 children - after being barred.\nThe charity said it \"deeply regret[s] the oversight\".\nZaman and two other men from Bradford were convicted of stabbing father-of-two Kevin Jackson in the head with a screwdriver, and beating him with a piece of wood near his home after he tried to stop the group from stealing his father-in-law's car.\nAt the time the judge called the murder \"a cowardly and horrific act\".\nZaman was given a life sentence and was released from prison in 2017.\nFour years later he started work at St Giles, which is one of nearly 1,500 registered charities in England and Wales working with ex-offenders across the country to help rebuild their lives.\nAn \"enhanced with barred lists\" DBS check would show up any previous convictions and whether or not someone has been barred from working with children.\nIt is seen as a vital part of safeguarding for organisations, and is required when anyone applies for a job with access to vulnerable people such as in teaching, social work and health services.\nA former staff member, who wants to remain anonymous, told the BBC that St Giles's safeguarding in this case was \"appalling\", adding: \"Clearly something is going wrong.\"\nThey said Zaman went into \"about three\" schools, sometimes alone, as part of the charity's SOS project in Yorkshire.\nThe early intervention programme prevents young people falling into criminal activity, and is delivered by ex-offenders as part of their reintegration back into society.\nThe source said Zaman \"was doing outreach work, supporting young people in school and would liaise with families and carry out home visits\".\nThe source called for the charity to put stricter measures in place.\n\"I feel really upset and annoyed because they are not just putting the young people at risk, they are putting staff at risk too,\" the ex-employee said.\nThe DBS did not tell the BBC why he was allowed to work with children in 2021 and then barred in 2023, as it does not comment on individual cases.\nIt said serious offences committed after 2006 may lead to someone being automatically barred from working with children, but that offences committed before that time would lead to a discretionary barring investigation.\nNot all murderers are necessarily barred from working with children – some will be able to appeal and persuade the DBS that they should not be on the barred list.\nBut it is an offence for someone on a barred list to undertake \"regulated activity\" with a group from which they are barred. They may face a fine or a jail sentence of up to five years.\nPeople on barred lists can still do up to three days of teaching or training with children in any 30-day period, in certain circumstances. It is not clear whether Zaman exceeded these limits.\nWest Yorkshire Police said it had launched a criminal investigation. The BBC understands Zaman was recently arrested.\nDBS checks are issued directly to individuals, not the organisation requesting them, but a DBS spokesperson said it was the responsibility of employers to review employees' certificates.\nSt Giles refused to answer when the BBC asked which schools Zaman had visited, how often, and whether parents had been informed.\nA spokesperson said Zaman did not tell the charity about being barred, which meant he continued to work with children.\n\"This should never have happened,\" they added.\n\"As soon as we became aware, we launched an internal investigation and re-checked all Yorkshire staff working with children, with no further concerns found. We have since strengthened our internal processes to ensure this cannot happen again and deeply regret the oversight.\"\nThe spokesperson said the charity had an \"unwavering commitment to safeguarding\" and had \"immediately\" reported itself to both the Local Authority Designated Officer and to the Charity Commission.\nThey said after the incident, it reviewed the DBS checks of all of its employees working with children in Yorkshire and \"no further issues\" were identified.\nThey added: \"Every person we employ undergoes rigorous risk assessments and criminal background checks, and each one is deeply committed to using their own experiences to help others.\n\"Evidence shows that lived-experience programmes like ours reduce offending by 21%, while also providing meaningful employment that allows people to give back to their communities.\"\nThe national charity's income increased from £18.4m in 2022-23 to £21m in 2023-24 – with millions of pounds of funding coming from government grants and contracts.\nIt has received almost £400,000 from the West Yorkshire Combined Authority since 2020, for local projects.\nAlison Lowe, the region's deputy mayor for policing and crime, said she would not comment specifically on St Giles. But she said suspending funding was one step the council might take against an organisation being investigated for an alleged DBS breach.\nShe said safeguarding was \"the number one most important issue\" for any public authority.\nAsked if it was an individual's responsibility to inform an employer if their DBS said they were barred, she said: \"I think it's absolutely critical that the employer gets a copy of that document so that together they can make the right decision and keep our communities safe, and particularly keep our children and young people safe.\"\nThe Charity Commission said it was investigating after St Giles reported a serious incident.\nA spokesperson said it had opened a regulatory compliance case and it was \"assessing the information to determine our next steps\".\nEmail YorksLincsInvestigations@bbc.co.uk, external if you have a story for our investigations team. Please leave a contact number if you are happy for the team to get in touch.", "url": "https://www.bbc.co.uk/news/articles/c5yewk7zen8o"}