{"authors": ["Andrew Harding", "www.facebook.com"], "date_download": "2025-04-26 06:24:20", "date_modify": "2025-04-26 06:24:20", "date_publish": "2025-03-01 00:34:57", "description": "The abrupt departure of the Tate brothers by private jet has left a fresh trail of confusion and unanswered questions in its wake.", "filename": "news_articles_c99np092vk1o_1745648660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7053/live/61932a20-f5f2-11ef-bd6e-cd71c2e1454a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99np092vk1o_1745648660.html", "title": "Chaos and unproven theories surround Tate brothers' release from Romania", "title_page": "Chaos and unproven theories surround Tate brothers' release from Romania - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "These were already turbulent times in Romania.\nBut as people here navigate the late winter ice and slush on Bucharest's elegant streets, the abrupt departure of the Tate brothers by private jet has left a fresh trail of confusion and unanswered questions in its wake.\nA country grappling with a cancelled presidential election, its future in Europe, its support for neighbouring Ukraine, widespread corruption, and collapsing faith in public institutions, is now left pondering why two controversial foreigners, facing a raft of complex but serious criminal charges, have been treated with such apparent lenience; their confiscated assets and their passports suddenly returned to them.\nWas a secret deal done between Romania's government and the Trump administration? If so, in these increasingly transactional times, what does Romania get in return? Or was this more like a pre-emptive gesture of good will towards the American president, a gift to lay at Donald Trump's imperious feet?\nOr are we searching for conspiracies when the truth is probably far more chaotic?\nAs foreign leaders – from Volodymyr Zelensky to Sir Keir Starmer – travel to Washington DC bearing deals and other apparent peace offerings, one might ask who could blame Romania, a staunch NATO ally navigating a host of internal and external challenges, for trying to keep an increasingly unpredictable US administration on side?\n\"It's a matter of life (or death) for Romania,\" said security analyst George Scutaru, describing his country's need to shore up Western support in the face of growing pressure from the Kremlin.\nDeclining to comment on the Tate issue specifically, Scutaru said it was clear Moscow was seeking to undermine Romania's democracy and that the government had good reason to seek ways to remind the Trump administration of the many advantages – commercial, diplomatic, and military – of continuing to back it.\nBut if the Tate brothers are part of that equation, it is already clear that many Romanians are not impressed.\nThis is a country already facing a strong populist backlash against an elite ruling class that is widely seen as corrupt and out of touch with the struggles of ordinary people who feel treated as second-class citizens – a mere source of cheap labour - within the European Union.\nSo, the sight of the Tates appearing to receive special treatment plays into the notion that Romania's institutions are hollow and cater only to those with money.\n\"For me, what has happened is unacceptable. We cannot allow Romania's image to be tarnished by impunity and defiance,\" fumed Elena Lasconi, a prominent presidential candidate here, expressing deep concern that Romanian prosecutors' sudden decision to relax the Tates' travel restrictions was the result of \"external influence.\"\n\"It's my personal perception that probably there is… pressure on the Romanian political system, as logically the prosecutor would have applied very strict rules to control (the Tates) and probably the United States would have been a place where they would be allowed to travel (due to concerns they would not be extradited if they failed to return),\" said international human rights lawyer, Silvia Tabusca.\nIt is beyond doubt that Andrew Tate's lucrative brand of assertive masculinity has earned him allies in President Trump's administration. One of his former lawyers, Paul Ingrassia, now works in the White House.\nMany in the so-called \"manosphere\" see Tate as a persecuted hero who has just been rescued from Romania's corrupt clutches.\nThere is also a more nebulous far-right alignment between some pro-Trump and pro-Tate figures in the US, far-right and allegedly pro-Russian forces in Romania, and the Kremlin itself, which stands accused of plotting to weaken Bucharest's pro-western stance.\nBut the picture is not clear cut.\nPresident Trump distanced himself from the brothers' case on Thursday and there are signs of a broader push-back in the US, with the governor of Florida Ron DeSantis making it clear the Tates are \"not welcome\" in his state, amid plans to open a \"preliminary inquiry\" into allegations against them of human trafficking and violence against women.\nMeanwhile in Bucharest, the theory that Romania's government cut a deal with the US to release the brothers is treated with caution by some analysts.\n\"I think the chances (of such a deal) are fifty-fifty,\" said Sorin Ionita, a political commentator, questioning the ability of Romania's various institutions and ministries to arrange a \"coherent\" policy concerning the Tates.\n\"I'm not sure they coordinate. Did they manage to demand something in exchange (from the US)? I'm not sure,\" said Ionita, bemoaning a situation almost designed to persuade Romania's public to lose faith in state institutions, and speculating that lower level \"satellite\" figures in an equally chaotic Trump administration were probably behind any deal in order \"to extract money from the Tate brothers.\" The BBC has seen no evidence of this.\n\"It's very depressing to see,\" he added.\nAs for the question of whether the Tates will return to Romania, as their lawyer has promised, to continue their legal battles, a degree of uncertainty endures.\nThe fact that most of their assets have been unfrozen could be seen as weakening the Romanian authorities' ability to compel them to come back. The Tates themselves have also questioned whether they can receive a fair trial in Romania, complaining of a \"conspiracy\" against them.\nAnd while Andrew Tate pointed out on Thursday that he and his brother currently face \"no active indictment\" in Romania, a more accurate way of describing their situation might be to say there is currently a lull in a long and complex legal process. An initial case has been returned to prosecutors for amendments, while a second and more substantial prosecution case against them is now pending.\n\"In the second case, we have 34 victims that cooperate and have been identified as victims. Among them are two minors, one a 17-year-old girl that has been recruited in order to be exploited by the criminal group. And the second girl is 15-years-old, and there is a crime for sexual acts with a minor in which they are also involved,\" said the lawyer, Silvia Tabusca, outlining the allegations in the second case.\nThe brothers also face arrest on separate and unrelated criminal charges in the UK. The Tates deny any wrongdoing in all these cases.\nIn the coming months, Romania faces far more pressing challenges than the fate of two foreign celebrities. Presidential elections have been rescheduled for May and a leading candidate – often accused of being a Kremlin puppet - has just been detained and is facing six criminal charges including fascism and undermining the constitutional order.\nWith their self-declared misogyny, extreme views, and online personas, Andrew and Tristan Tate do chime with some of the themes preoccupying and dividing society in America and far beyond.\nClearly, they remain influential figures, particularly among boys and young men. But the brothers face years of legal battles which may well push them, and their still lucrative brand, further to the periphery of the far larger dramas now reshaping our world.", "url": "https://www.bbc.co.uk/news/articles/c99np092vk1o"}