{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:48:15", "date_modify": "2025-04-26 07:48:15", "date_publish": "2025-02-26 22:57:00", "description": "The prime minister's upcoming talks with US President Donald Trump dominate the front pages on Thursday.", "filename": "news_articles_cjevxep9jnpo_1745653695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b8ef/live/280af0f0-f488-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevxep9jnpo_1745653695.html", "title": "'Putin will strike again' and Starmer heads to DC", "title_page": "Newspaper headlines: 'Putin will strike again' and Starmer heads to DC - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"He'll strike again\" is the headline in the Daily Mirror, external, which leads with Sir Keir Starmer's warning about Vladimir Putin. The Times says the prime minister will appeal to Donald Trump to \"hold back\" Russia, as he arrives in Washington at what the Guardian, external calls \"the most precarious moment for European stability in decades\".\nThe i newspaper, external says the UK's \"top Trump card\" will be raising the prospect of a state visit to London, hosted by King Charles III.\nThe Daily Mail, external reports the \"historic White House summit\" will also include discussions about the UK's plans to hand sovereignty of the Chagos Islands to Mauritius. The Sun, external calls on Trump to veto the \"inexplicable and insane deal\".\nAccording to the Daily Telegraph, external, American officials are also expected to bring up concerns about a \"Chinese mega-embassy\" planned for London.\nAnalysis by the Financial Times, external suggests that nearly half of the newly reduced aid budget is on track to be spent on housing asylum seekers in the UK. One Labour backbencher describes it as a \"horrendous waste of taxpayer money\", while another official tells the paper that \"the actual figure spent on aid is going to be really, really small\".\nA job advert for an NHS doctor to care for \"older people stuck in A&E corridors\" is highlighted in the Telegraph, external. It reports that the ad says corridor care is \"now normal\" at the Royal Sussex County Hospital in Brighton. But health leaders tell the Times, external the listing is a \"frightening and worrying indictment of how bad things have become\".\nThe front page of the Daily Star, external features screenshots from what it calls a \"bonkers\" AI-generated video shared online by Trump, which the paper says depicts Gaza as a \"glitzy Dubai-style paradise\". The video shows a giant gold statue of Trump, as well as a shirtless Israeli prime minister enjoying a cocktail on a beach.\nThe Daily Express, external says the post has \"sparked fury\" - with the president's own supporters describing it as being \"in very poor taste\".", "url": "https://www.bbc.co.uk/news/articles/cjevxep9jnpo"}