{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:52:47", "date_modify": "2025-04-26 06:52:47", "date_publish": "2025-02-28 17:04:10", "description": "Katie Evans had 'intimate' contact with prisoner while she was inexperienced in the job, court hears.", "filename": "news_articles_cd92ld9z1wvo_1745650367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba66/live/19455680-f5f2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92ld9z1wvo_1745650367.html", "title": "Doncaster prison officer faces jail over inmate relationship", "title_page": "Doncaster prison officer faces jail over inmate relationship - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A prison officer has been told she faces jail after admitting an \"intimate\" relationship with an inmate.\nKatie Evans communicated with the man more than 140 times using a SIM card which was smuggled into HMP Doncaster, and boasted of performing a sex act, Sheffield Crown Court heard.\nEvans, 26, of Hatfield, Doncaster, admitted misconduct in a public office at a previous hearing and will be sentenced on Tuesday.\nJudge Jeremy Richardson KC said she \"must go to prison immediately\" adding: \"The only issue I have to decide is for how long.\"\nProsecutor Matthew Burdon told the court on Friday that records showed Evans had 39 conversations with the man on just one day, with one call lasting 49 minutes.\nHe said Evans had boasted to an ex-prison officer that she had performed a sex act on him.\nMr Burdon said the defendant referred to herself as \"your queen\" when talking to the defendant.\nHe said the wording of the charge Evans had admitted to referred to \"engaging in an inappropriate and intimate relationship with an inmate\".\nAsked by Judge Richardson whether this meant a \"sexual\" relationship, he said: \"I'm not sure whether 'sexual' is accepted by the defendant but certainly 'intimate' is accepted.\"\nEdward Moss, defending, told the judge that the offending happened when his client was aged 21, in 2020.\nHe said mother-of-one Evans was \"immature and vulnerable\" and had not been a prison officer for long when she was contacted by the prisoner.\nMr Moss said: \"This is a young lady who is absolutely ashamed of her behaviour.\"\nEvans was remanded into custody ahead of sentencing.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/cd92ld9z1wvo"}