{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:03:28", "date_modify": "2025-04-26 04:03:28", "date_publish": "2025-03-03 20:35:42", "description": "Volunteers help prepare Tuel Lane Lock in Sowerby Bridge for the busier months to come.", "filename": "news_articles_cvg1vyk7xy4o_1745640208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e61/live/d77ce490-f860-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1vyk7xy4o_1745640208.html", "title": "UK's deepest canal lock gets spring clean", "title_page": "Tuel Lane Lock: UK's deepest canal lock gets spring clean - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK's deepest single canal lock has been partially drained for a spring clean.\nCanal & River Trust volunteers are removing debris and litter from Tuel Lane Lock, on the Rochdale Canal in Sowerby Bridge, West Yorkshire, in preparation for the busier boating months ahead.\nThe lock lowers and raises boats almost 20ft (6m) as they make their journeys over the Pennines, the trust said.\nThe charity said it recently launched its biggest ever volunteering campaign to ask for help protecting its 250-year-old network of waterways and historic structures.\nUnlike most locks, members of the public are not allowed to operate the mechanisms themselves, because of its depth and its proximity to a tunnel.\nInstead, the trust said that lock-keepers helped crews to negotiate the gates.\nThe lock is so deep because it replaced a pair of earlier locks when it was built in 1996 to enable the canal to tunnel under a road built on its original level and provide a more efficient route.\nVolunteer Maureen Readle said: \"I've enjoyed lots and lots of canal boating holidays with my husband. We wanted to help give back to the canals by volunteering when we retired.\n\"I have also adopted a stretch of the canal, too, which my husband and I look after.\n\"When I took part the first time two years ago, I'd never worn a pair of waders before, let alone being waist high in water, helping to look after the UK's deepest lock.\"", "url": "https://www.bbc.co.uk/news/articles/cvg1vyk7xy4o"}