{"authors": ["Michael Keohan", "Simon Jones", "www.facebook.com"], "date_download": "2025-04-26 04:07:30", "date_modify": "2025-04-26 04:07:30", "date_publish": "2025-03-03 00:01:06", "description": "The mayors say co-operation is “a must” and it is time for the UK prime minister to visit.", "filename": "news_articles_c70ww5pw4zjo_1745640450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8937/live/9a72ee70-f5d4-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70ww5pw4zjo_1745640450.html", "title": "Mayors call for Keir Starmer to visit Calais migrant camps", "title_page": "Mayors call for Keir Starmer to visit Calais migrant camps - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mayors in northern France have called on Sir Keir Starmer to visit the region to better understand the impact of small boat crossings in the region.\nIn a message to the prime minister, the mayor of Ambleteuse, Stéphane Pinto, said co-operation between the two countries was \"a must\".\nHome Office Minister Dame Angela Eagle said the UK government had \"ramped up\" its work with French authorities, revealing French police had stopped 28,000 small boat crossings last year.\nHome Secretary Yvette Cooper was in Calais last week to meet politicians and officials but Dame Angela declined to comment on whether the prime minister planned to accept the invitation.\nLast year was the deadliest for small boats crossing the English Channel, with an estimated 78 people having died attempting the journey.\nLatest boat crossing figures show that 592 migrants in 11 boats made the journey on Sunday - the highest single day total for a day in March on record.\nFrench authorities also rescued 24 other people with one in a critical condition.\nHome Office figures show that 36,816 people were detected crossing the Channel in small boats in 2024 – up from 29,437 in 2023, but below a record 45,774 in 2022.\nSo far this year 2,716 people have made the crossing, marking a 20% increase on the same period in 2024 but lower than the same period in 2023.\nMr Pinto has urged the prime minister to \"come and look at our beaches\".\n\"We must put in place measures to stop bodies on our beaches,\" he said.\nThe BBC has seen a camp in Calais, located in a former wine warehouse with no working toilets or running water, which is home to several hundred migrants.\nZinki, from Sudan, has lived at the camp for two months while he attempts to cross the Channel.\n\"I've faced persecution at home. For us, England works. The language is easier, some people have relatives there,\" he said.\nHe also warned of the dangers of crossing the Channel, stating: \"You see your brother die in the sea as you try to cross. Everyone has their own destiny.\"\nIn a nearby camp in Dunkirk, Akan, from Iran, said: \"It is very dangerous. Our boat got a hole in it and we were in the water for 30 minutes.\n\"We had to wait for the big French boat to save us. I thought we would die.\"\nThe Home Office said it had launched new specialist police and enforcement plans, including state of the art surveillance technology to disrupt criminal smuggling gangs in northern France.\nNew measures to tackle people-smuggling gangs have been agreed by the UK and France, with more than £7m of existing funds redirected towards a \"stronger\" law enforcement response on migrant Channel crossings, a spokesperson said.\nWhen questioned about what deterrent the government had to stop crossings, Dame Angela said \"one is they [migrants] may die.\"", "url": "https://www.bbc.co.uk/news/articles/c70ww5pw4zjo"}