{"authors": ["Neve Gordon-Farleigh", "www.facebook.com"], "date_download": "2025-04-26 07:04:59", "date_modify": "2025-04-26 07:04:59", "date_publish": "2025-02-28 06:31:45", "description": "The sand will be placed along the coast between Snettisham and Hunstanton.", "filename": "news_articles_ckg11ejqwnqo_1745651099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f1b/live/825e8030-f51e-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg11ejqwnqo_1745651099.html", "title": "Tonnes of Norfolk sand used to act as natural flood defence", "title_page": "Tonnes of Norfolk sand used to act as natural flood defence - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "About 14,000 tonnes of sand and shingle will be used as natural flood defences along a stretch of coastline to protect homes.\nThe material will be taken north to Heacham and south Hunstanton in Norfolk, in a bid to restore the shingle ridge along a three mile (5km) stretch of coastline.\nThe ridge protects more than 800 properties and 4,000 caravans.\nSadia Moeed, area director for the Environment Agency, said: \"It's vital the shingle ridge is kept in good condition to help reduce the risk of flooding to the communities behind it.\"\nMs Moeed said beach recycling like this was an \"incredibly important\" part of work carried out on the Norfolk coast.\nShe said: \"It's also important that property owners continue to refrain from digging into the ridge and approach us if they wish to carry out works within 16 metres of it. This will also help preserve the integrity of the ridge and its ability to perform as a natural flood defence.\"\nThe work has been funded by the East Wash Coastal Management Community Interest Company and Natural England, and the RSPB has consulted on the recycling.\nSandra Squire, cabinet member for environment at King's Lynn and West Norfolk Borough Council, said restoring the shingle ridges helped protect people and wildlife.\n\"[It] makes a real difference to the communities in the area,\" she said.", "url": "https://www.bbc.co.uk/news/articles/ckg11ejqwnqo"}