{"authors": ["Dharshini David", "www.facebook.com"], "date_download": "2025-04-26 04:11:58", "date_modify": "2025-04-26 04:11:58", "date_publish": "2025-03-04 12:41:17", "description": "Donald Trump's tariffs on Canada, Mexico and China have turned back the clock 70 years, erasing decades of globalisation.", "filename": "news_articles_cyvejezz71zo_1745640718.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/daf4/live/a6753d10-f8f2-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyvejezz71zo_1745640718.html", "title": "Trump tariffs could be good for some countries, including the UK", "title_page": "Trump tariffs could be good for some countries, including the UK - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump's latest move has left investors in a spin - for good reason.\nWith the stroke of a pen, the tariffs he has imposed on Canada, Mexico and China have turned back the clock 70 years, erasing decades of globalisation.\nTariffs, he says is a beautiful word, signalling jobs and riches for America.\nHowever, history tells us that those firing the opening shots in a trade war also suffer heavy casualties. Despite the president's rhetoric, American consumers are on the front line.\nThese extra taxes mean that Americans are facing the highest level of tariffs on goods being imported to their country since the 1930s.\nVegetables from Mexico, wheat from Canada, toys and T-shirts from China are all in the firing line. Retailers of such items can have very narrow profit margins and will raise prices quickly to cover the tariffs.\nConsumers will notice the price rises.\nGroceries may be one of Trump's favourite words, but his own electorate may not appreciate the increase in bills they could face. Assuming no further tariffs, economists suggest US inflation, already higher than expected, could rise further in the second half of this year.\nA price worth paying \"to make America great again\"? Look no further than the laundry room for a cautionary tale.\nDuring his first-term of office in 2018, Trump imposed tariffs of up to 50% on imported washing machines after American producer Whirlpool complained about cheap South Korean competition.\nThose rivals - Samsung and LG - then set up in America, creating close to 2,000 jobs.\nBut at what price? An imported washing machine cost an American shopper almost a third more at the start of 2023, just before tariffs were abolished, than five years previously.\nAdd up the costs of tariffs and one study claims each of those jobs cost Americans the equivalent of more than $800,000 (£627,000).\nThose tariffs of course meant revenue for American governments and that source has increased dramatically in recent years, following the raft of tariffs Trump also imposed in his first term on China - most of which were retained under President Joe Biden.\nHowever, the amount netted is equivalent to a tax rise on American households of up to $300. Ultimately it is they who are footing the bill - and will continue to do so.\nThen consider the impact on American manufacturers who have businesses spanning Canada, Mexico and perhaps even China. Overall, economists think we could be looking at a hit to US growth of up to 1% - not enough to prompt a recession, but unwelcome nonetheless.\nIn sheer numbers terms, the hit to the Canadian economy could be greater, economists say. It sells more than $400bn worth of goods to America every year, accounting for a fifth of its income.\nBut it has the capacity to lower interest rates, and healthy public finances, providing policy makers with scope to cushion the blow for Canadians.\nThe damage to Mexico's national income could be less severe, but its central bank has less capacity to cut interest rates making it harder to deflect the pain.\nAll of this will be anxiously watched by the European Union, likely next in line for those Trump tariffs. Germany, already in a fragile state, accounts for about a third of the goods sold by the EU to the US.\nChina, despite being the target of Trump's repeated trade blows could actually be less vulnerable. Its exports to the US account for less than 3% of national income - easily made up elsewhere.\nIronically, some of this resilience is down to the tariffs imposed by President Trump last time round. China simply looked for new markets.\nCountries like the UK could also benefit from a furthering of such trade diversion, more access to cheaper goods - something that could keep our own inflation down.\nA key point about trade wars is that there are winners as well as losers - particularly for those countries outside President Trump's firing line. Vietnam and Malaysia for example saw their exports grow rapidly during President Trump's last term as they scrambled to replace China in selling to America.\nIf the UK continues to escape the wrath of President Trump, we could actually benefit from closer trading links with his country and indeed from greater foreign investment, if we looked to be a more certain environment than some of our competitors. But of course, our fate remains unclear.\nAs it stands, the prospects for global growth in 2025 have dulled, but a recession appears very unlikely. However, in Trump world we have learnt very quickly to expect the unexpected - so much still depends on what happens from here.\nAnd that uncertainty itself is harming business confidence both in the US and around the world, putting off key decisions about where to invest and create jobs.\nWeaponising uncertainty too comes at a price - even on home soil.", "url": "https://www.bbc.co.uk/news/articles/cyvejezz71zo"}