{"authors": ["Paul Faulkner", "www.facebook.com"], "date_download": "2025-04-26 04:26:47", "date_modify": "2025-04-26 04:26:47", "date_publish": "2025-03-03 11:27:41", "description": "\"By May 2026, the whole of the North will have mayors,\" Angela Rayner tells a conference.", "filename": "news_articles_c7890jempmvo_1745641607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/820a/live/00a8c9e0-f818-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7890jempmvo_1745641607.html", "title": "Lancashire will get elected mayor, deputy prime minister says", "title_page": "Lancashire will get elected mayor, deputy prime minister says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After almost a decade of political wrangling, Angela Rayner appears to have confirmed Lancashire will be getting an elected mayor within the next 18 months.\nDuring a question and answer session at the Convention of the North in Preston, the deputy prime minister said she understood \"the perception\" that places without an Andy Burnham-style figurehead may feel left out.\n\"I've been really straight that we want mayors,\" she said, \"and with the new [devolution] priority programme, by May 2026, the whole of the north will have mayors, which is fantastic.\"\nLancashire local authority leaders had previously been asked to come up with proposals for \"deeper and wider devolution\" by this autumn.\nAll of Lancashire's 15 councils have been asked to submit initial plans for how they will reorganise themselves into new authorities.\nThe government wants councils to merge to create single unitary authorities to provide all the services in their area under an elected mayor.\nDevolution minister, Jim McMahon, told the conference: \"It's about giving local leaders the power to get on and do the job and a mayor is really important in that, they do make a difference.\"\nThe devolution white paper, published two months ago, stated that it was the government's \"strong preference\" that local areas opted for mayor if they did not already have one – but it also held out the alternative prospect of a non-mayoral \"strategic authority\", like the Lancashire Combined County Authority (CCA) that came into being last month, to oversee its existing devolution deal.\nThat \"level two\" agreement gives Lancashire powers including control of the adult education budget and some aspects of local transport, as well as a one-off £20m innovation fund.", "url": "https://www.bbc.co.uk/news/articles/c7890jempmvo"}