{"authors": ["Charles Heslett", "www.facebook.com"], "date_download": "2025-04-26 08:06:05", "date_modify": "2025-04-26 08:06:05", "date_publish": "2025-02-26 15:13:00", "description": "A campaign group raises safety fears over some planters in Bradford city centre.", "filename": "news_articles_cvg1pqvppw0o_1745654765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7300/live/08f22fc0-f452-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1pqvppw0o_1745654765.html", "title": "Bradford disability group's trip fears over planters", "title_page": "Bradford disability group's trip fears over planters - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A disability campaign group has raised concerns over the safety of planters in Bradford city centre.\nThe granite-edged features were put in as part of a £45m pedestrianisation scheme by Bradford Council, but some are worried they could be a trip hazard for pedestrians.\nMembers of the Bradford Association for Visually Impaired People (BAVIP) said it was also hard to navigate the ongoing roadworks.\nThe local authority said it was aware of the planter concerns and would \"work with mobility groups on a solution\".\nAt present Norfolk Gardens is being extended to include the whole of Hall Ings, and is closed to pedestrians.\nBAVIP spokeswoman Jamie Lowbridge said: \"Things look a lot better on the surface.\n\"Things look nice. There are lots of planters, lots of benches. They're working on public spaces.\n\"But there are still a lot of challenges that visually impaired people are facing.\"\nThe 35-year-old said the entrance to Bradford Interchange \"wasn't quite fixed yet\".\nMs Lowbridge, who is registered blind, said: \"Some people are having trouble with the planters that have been put around.\n\"(Those) who might've lost sight in later life are finding that they're a bit of a falls risk and a bit of a hazard.\"\nSusan Clarkson, 78, lives in Girlington and is a member of the Bradford Visually Impaired Women's Group.\nMs Clarkson, who is also registered blind, said she liked the new pedestrianised areas that were finished but had trouble accessing her bus stop in Nelson Street.\nShe said: \"Please put as a priority a safe, easy way to get from Bradford Interchange to Nelson Street while they're still using Nelson Street.\n\"Don't just wait for it to get better and the buses to go back to the Interchange.\"\nIn January 2024, the West Yorkshire Combined Authority (WYCA) closed the Interchange due to safety concerns after a piece of concrete fell from the roof of an underground car park.\nIt reopened a year later with a total of 47 services returning to the building - about 80% of all routes.\nBut the remaining services continue to run from Nelson Street as well as other stops across the city centre.\nA Bradford Council spokesperson said: \"We are aware of the concerns that they have raised about the lower-level planters on Market Street and will work with mobility groups on a solution.\n\"While the majority of bus services are now back using the Interchange, the most direct access to the bus stops which remain on Nelson Street, is from the back entrance to the bus station.\"\nThey added: \"Contractors are working as fast as they can to get Norfolk Gardens finished so that we can reopen this section to members of the public.\"\nA WYCA spokesperson said: \"We want to make sure that Bradford has the top-quality transport services it deserves.\n\"Since reopening the Interchange, we have been finishing important resurfacing works to ensure the safety and smooth running of bus services.\n\"We thank bus passengers for their continued patience.\"\nThe BBC understands that access linking Nelson Street and the Interchange will be reopened in the coming weeks.\nResurfacing works on stands 1-5 at Bradford Interchange are due to be completed in May when WYCA says remaining services are \"expected\" to return.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cvg1pqvppw0o"}