{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:31", "date_modify": "2025-05-19 15:17:31", "date_publish": "2015-03-03 02:52:22", "description": "The US president says Iran should freeze nuclear activity for 10 years, ahead of a controversial Washington speech by Israel's prime minister.", "filename": "news_world-us-canada-31703780_1747667851.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81355000/jpg/_81355855_81355854.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31703780_1747667851.html", "title": "Obama seeks Iran nuclear freeze as Netanyahu speech nears", "title_page": "Obama seeks Iran nuclear freeze as Netanyahu speech nears - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Iran should agree to freeze sensitive nuclear activity for at least a decade if it wants to strike a deal with the US, President Barack Obama has said.\nHowever, the odds are against talks with Iran ending with an agreement, Mr Obama told Reuters news agency, external.\nNegotiations on Iran's nuclear programme are at a critical stage, with an outline agreement due on 31 March.\nIsraeli Prime Minister Benjamin Netanyahu is expected to urge the US Congress on Tuesday to oppose a deal.\nHe was invited to speak at the US Capitol by Republican House Speaker John Boehner, angering Democrats.\nMr Netanyahu - who faces domestic elections in two weeks' time - will not meet Mr Obama during his visit to the US.\n\"Netanyahu made all sorts of claims - this was going to be a terrible deal, this was going to result in Iran getting $50bn worth of relief, Iran would not abide by the agreement.\"\nNone of that has come true, Mr Obama said.\n\"During this period we've seen Iran not advance its programme. In many ways, it's rolled back elements of its programme.\"\nMr Netanyahu is due to be presented with a bust of Winston Churchill by the Republican speaker John Boehner, who controversially invited him to speak in Washington without discussing the matter with the White House.\nThe Israeli prime minister sees himself as Churchill's heir, warning against Iran as Churchill warned against the Nazis.\nBut he's also been accused of political calculation - helping out his Republican friends and making the speech part of his campaign in the Israeli general elections a fortnight from now.\nThe Obama administration is countering by pointing everything it does for Israel, from $20bn in military aid since President Obama was first elected to the use of the veto in the UN Security Council to protect Israel diplomatically.\nHigh stakes for Netanyahu speech\nNetanyahu speech is win-win for Iran\nRepublican invitation riles Obama\nMr Obama said that if Iran was willing to agree to \"double-digit years of keeping their programme where it is right now and, in fact, rolling back elements of it that currently exist... and we've got a way of verifying that, there's no other steps we can take\" to ensure Iran does not have nuclear arms.\nMr Obama said that while a deal was still unlikely, it would be better than the alternatives.\n\"If they do agree to it, it would be far more effective in controlling their nuclear programme than any military action we could take, any military action Israel could take, and far more effective than sanctions will be,\" the US president told Reuters.\nThe US goal is to make sure \"there's at least a year between us seeing them try to get a nuclear weapon and them actually being able to obtain one,\" he said.\nThe Israelis say any agreement that leaves Iran with the potential to use a peaceful civilian nuclear programme for military means, now or in the future, is unacceptable.\n\"I have a moral obligation to speak up in the face of these dangers while there is still time to avert them,\" Mr Netanyahu told the American Israel Public Affairs Committee (Aipac) conference in Washington on Monday.\nObama seeks long Iran nuclear freeze\nThe leading Republican and Democrat on the House foreign relations committee have sent a letter to Mr Obama highlighting their concerns about a deal.\nThey said Congress must be convinced that any pathway Iran might have to developing a nuclear weapon is shut off before Congress considers easing sanctions.\nUS national security adviser Susan Rice has warned Congress not to seek new sanctions against Iran while the talks with world powers are ongoing.\n\"Congress has played a hugely important role in helping to build our sanctions on Iran but they shouldn't play the spoiler now,\" she said in a speech to Aipac.", "url": "https://www.bbc.com/news/world-us-canada-31703780"}