{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:59:43", "date_modify": "2025-04-26 03:59:43", "date_publish": "2025-03-04 06:05:45", "description": "Donavan Van Lill, a father of two, has not been seen since 3 March 2010.", "filename": "news_articles_czxn0zrykk0o_1745639983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1974/live/f3bcd320-f85d-11ef-b809-97b36d89f5f9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czxn0zrykk0o_1745639983.html", "title": "Donavan Van Lill: New appeal over Chippenham man's disappearance", "title_page": "Donavan Van Lill: New appeal over Chippenham man's disappearance - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A fresh appeal has been launched by police 15 years after the disappearance of a father of two.\nColleagues of Donavan Van Lill, 29, raised the alarm on 3 March 2010 when he did not show up for work in Chippenham, Wiltshire\nWiltshire Police said it \"remains committed\" to finding out what happened to him. and believes the answer to his disappearance will be found in the local community.\nDetectives have urged anyone who might know something to share it \"no matter how small or insignificant\".\nThe last known sighting of Mr Van Lill - a leisure centre staff member and keen Corsham rugby player - was at 01:00 GMT on 3 March 2010 at his home address at 3 Blackthorn Mews in Pewsham, near Chippenham.\nHis landlord, who was also a friend, reported that Mr Van Lill was on his way to bed, and all seemed well.\nMr Van Lill was believed to have been at his home until about 10:00 GMT that day but never arrived at the Olympiad Leisure Centre, where he was due to start work at 14:00.\nPolice said there was no sign of a disturbance or any evidence of forced entry, and his white Citroen Saxo was found on the drive where he had left it the evening before.\nBut despite extensive police operations and several appeals for information over the past 15 years, no trace of him has been found.", "url": "https://www.bbc.co.uk/news/articles/czxn0zrykk0o"}