{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:19:02", "date_modify": "2025-05-21 06:19:02", "date_publish": "2025-01-14 00:00:00", "description": "Forecasters say gusts of up to 70mph could spark new fires and spread current ones, as red flag warnings are issued.", "filename": "news_live_cew52g8r8e7t_1747808342.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cew52g8r8e7t_1747808342.html", "title": "‘A big pile of ash’", "title_page": "‘A big pile of ash’ – LA residents assess ruined homes - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "LA braced for 'dangerous' 24 hours as high winds roll in\nWe're pausing our live coverage of the ongoing fires ravaging parts of LA for the time being. Here are the main developments from today:\nThe next 24 hours are \"very dangerous\", LA County's sheriff warned at a press conference, with high winds forecast to hit the region\nAlmost 90,000 people remain under evacuation orders and that number could grow if the flames spread over the next 24 hours\nFour fires - two of them major - continue to burn. The Palisades Fire, the largest of them all, is still less than a fifth contained\nWarnings remain in place as forecasters and firefighters monitor whether strong winds push the fires towards built-up areas\nThousands of homes gutted by the wildfires have been searched over the last 24 hours. No bodies were found but 13 people remain missing\nIf you want to learn more about the crisis gripping LA, you can find our visual analysis of how the fires spread here.\nDuke and Duchess of Sussex's home on edge of extreme fire zone\nPrince Harry and Meghan Markle's California home could be close to the edge of an extreme fire zone.\nThe couple live in the town of Montecito in Santa Barbara county - which is located around 160km (99 miles) north-west of Los Angeles.\nAlthough the wildfires have not reached Montecito, it is close to a large swathe of LA under a red flag warning by the National Weather Service (NWS).\nThe release of the Duchess' new Netflix show has been postponed to March due to the fires.\nLast week, Prince Harry and Meghan were seen hugging residents in Pasadena.\nOne week after fires erupted in LA, the danger remains\nChristal Hayes\nReporting from Los Angeles\nExactly one week ago, two of the LA area's most destructive fires ignited - the Palisades fire and Eaton fire.\nMore than 10,000 homes are gone. At least 24 have died - a toll officials say could rise. Millions who live here are still on edge.\nSeeing the containment numbers on these fires go up each day has given all of us hope. But now another wind event has all of us on pins and needles. Officials warn the next 24 hours will be dangerous and there's a potential for new blazes to flare up. They're already warning people in fire-prone areas to leave - even if an official evacuation alert hasn't been issued.\nThis continued nightmare feels almost inescapable.\nEveryone seems to know someone who lost a home or is still evacuated and cannot yet return. Images of the crisis are shown on TV news all day. Signs of support now mark billboards across town. It's the topic of conversations in coffee shops and restaurants.\nBut each day we get closer to this ending - a day when we can focus on healing and rebuilding our communities.\n\"We will rebuild Los Angeles,\" Mayor Karen Bass declared on Tuesday.\nThe numbers behind the Republican attacks on Biden's LA response\nBy Jake Horton\nSome Republicans have circulated a video of President Biden saying: \"People impacted by these fires are going to receive a one-time payment of $770.\"\nAnother widely viewed post drew comparisons between that offer and the $500m aid package for Ukraine announced last week, external.\nThe $770 commitment - which the White House says has cost around $5m so far - is part of a much larger relief effort. It is intended to help victims meet immediate costs for things like food and medicine.\nOther forms of direct help are available: fire victims can claim for two Federal Emergency Management Agency (Fema) grants , externalworth $43,600 each.\nFema says it has around $27bn available to spend on disaster relief, and that this is enough to respond to the LA wildfires.\nThe US has given around $85bn in assistance to Ukraine, according to the Kiel Institutes’, external tracker. While that figure is significantly higher than what the federal government has spent on the LA fire response so far, it is important to note that sum has accrued since early 2022.\nWith the LA relief effort still ongoing, no one can say with any certainty what the eventual bill for the federal government will be.\nCash grants available to those who have lost their homes\nThe press conference ends with the Federal Emergency Management Agency's (Fema) Regional Director Robert Fenton Jr speaking about the help available to people whose homes have been damaged or destroyed.\nHe addresses false information circulating about what aid is available and instead points people in the direction of the two cash grants from the aid agency, which are both worth $43,600.\nThe news conference is now over. We will bring you a summary of the key developments soon so stick with us.\nPrice hikes on rents 'will not be tolerated', LA county official says\nHorvath is still giving an update on the wildfires in Los Angeles.\nShe says a number of measures will be passed via an LA county emergency proclamation later this afternoon. These will include measures to prevent price gouging - including on rent and housing options - and to stop people being taken advantage of during this disaster.\n\"These will not be tolerated,\" she says.\nUnder the proclamation, a local health emergency will be declared and measures will be introduced to ensure the continuity of education for displaced students. There will also be opportunities for people to secure financial support and resources, she says.\nAs we wrote earlier, thousands of Los Angeles residents displaced by the wildfires will soon find themselves facing the daunting challenge of finding somewhere to live amid LA's competitive housing market - already one of the most expensive real estate markets in the country.\nOfficials prepare for dangerous winds\nCounty Supervisor Lindsey Horvath is next up to speak at the conference. She says rescue workers are giving the Palisades fire \"all we've got\".\nThe situation will be particularly dangerous over the coming 24 hours, she adds, due to the high winds expected to hit the area.\nHorvath urges people in the area to make preparations in case they are ordered to evacuate at short notice, while schools in Malibu are being closed as part of readiness efforts.\nLA Mayor announces plan for rebuilding efforts\nMayor of Los Angeles Karen Bass is now speaking at the conference given by officials.\nBass says she took an aerial tour of California and describes the destruction from the LA fires as \"unimaginable until you actually see it\" .\nShe confirms that on Monday she signed an executive directive that will lay the groundwork for rebuilding efforts.\n\"We want to begin to think about how we rebuild the massive destruction that I saw from the air, we don't want people burdened by red tape and bureaucracy, so my executive directive addresses that,\" she says.\nShe says she does not want people to be \"burdened by red tape\" and the directive will take immediate action to make 1,400 habitable units available.\nShe says the two disaster relief centres will help people provide documentation like drivers licenses, and there will be medical and mental health support available.\nArrests being made for burglary and curfew violations\nLA County Sheriff, Luna, is now reminding people that a curfew from 18:00 to 06:00 will go into effect for areas under an evacuation order.\n\"If you do not live there, have any business there, I say this every day, don't go,\" he says, adding arrests are being made for those who violate this order.\nLuna stresses: \"I don't want to make arrests, please stay away from there.\"\nHe confirmed 39 arrests were made over night in the LA County area, including 33 in the Eaton fire area. The arrests include nine for curfew violations, two for flying drones and 11 for burglary.\nFor Palisades there were a total of six arrests - three for curfew violations and three for burglary.\nStay with us as we continue to follow the news conference by officials on the wildfires across Los Angeles.\nFirefighters 'standing strong' as they battle blazes, fire chief says\nWe're still hearing from Kristin Crowley, head of the fire service, who goes on to thank those who have expressed care and concern for firefighters.\n“Our firefighters and first responders are standing strong, they hold their heads up high and they will continue to work hard for you,\" she says.\nShe confirmed that the Palisades fire is currently at 23,713 acres, 17% containment, with 5,200 personnel assigned. The Hurst fire is at 799 acres and is 97% contained.\n\"Firefighters will continue to work tirelessly throughout the day to contain the fires,\" she says.\nOfficials give update on LA wildfires\nWe are now hearing from officials and emergency service chiefs who are speaking at a press conference about the wildfires across Los Angeles.\nKristin Crowley, head of the fire service, says aerial surveys have been carried out to judge the scale of the fires and the damage. She says this information will be used to decide how best to carry out recovery operations.\nShe also expressed her \"heartfelt\" thanks to firefighters from Mexico who are assisting with efforts.\nWe are following the conference so stay with us for further updates.\nCalifornia fire agency reports slow progress containing blazes\nThe California fire protection agency CalFire has released an update on the four fires still burning across LA.\nIt says the Palisades Fire - the first and biggest - has burned through 23,713 acres and is 17% contained - up from 14% at the previous update.\nThe Eaton Fire has swallowed up 14,117 acres and is 35% contained, up from 33%.\nThe much smaller Hurst Fire (799 acres) has been almost completely contained, at 97%.\nThe newest Auto Fire which began last night has burned through 56 acres and has not been contained at all. However Ventura fire crews say the fire has been stopped from advancing forwards.\nContainment describes the progress firefighters make in preventing the spread of the flames. It doesn't mean the fire has been put out, but that the spread has been stopped. So for example 17% containment means fire crews have established barriers around just 17% of the fire's perimeter.\nWinds start to pick up, but luckily remain light near biggest fire\nMatt Taylor\nBBC Weather\nAs the day begins, Santa Ana winds are already starting to pick up on higher ground especially. Wind gusts of over 60mph (97km/h) have been recorded on the higher parts of the San Gabriel mountains.\nThere’s also a noticeable breeze picking up along the Highway 5 corridor, south of Santa Clarita.\nHowever, for many populated areas, winds remain light for now with barely a breeze in Low Angeles itself. Crucially for those close to the Palisades Fire, winds are light and are not reach the levels of last week.\nWith a red flag warning from the National WeatherService now in effect and winds expected to increase throughout the day, “extremely critical fire-conditions” remain.", "url": "https://www.bbc.com/news/live/cew52g8r8e7t"}