{"authors": ["Alastair Fee", "www.facebook.com"], "date_download": "2025-04-26 03:45:20", "date_modify": "2025-04-26 03:45:20", "date_publish": "2025-03-05 06:20:42", "description": "Mohan Sivashankar left behind his home in India and a job in mechanical engineering three years ago.", "filename": "news_articles_c78ee8xdy08o_1745639120.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f450/live/51f1ff10-f5e3-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ee8xdy08o_1745639120.html", "title": "Poole care homes employs new workers from outside Europe", "title_page": "Poole care homes employs new workers from outside Europe  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mohan Sivashankar left behind his home in India and a job in mechanical engineering for a life in the UK three years ago.\nSince moving to Poole, Dorset, his career has taken a different path - he now works as a healthcare assistant at Eagles Mount Care Home.\nHe is among a new wave of migrants from outside Europe that have come to the UK in increasing numbers since the coronavirus pandemic.\nHis employer, Luxurycare, said problems with staff recruitment after Brexit had been eased thanks to sponsorship visas, external.\nMr Sivashankar said the UK had a lot of opportunities for foreigners.\n\"We do feel coming here is a safe place compared to other countries, a safe place and good pay, so that's the reason we move here,\" he added.\nFinding care home staff in Dorset has been tough for Luxurycare in recent years, after Brexit ended freedom of movement, external.\nBosses said a combination of EU citizens returning to their native country, competing employers and demands from the NHS saw the pool of workers shrink.\nEagles Mount Care Home used to have 20 staff from the EU, but that number has now halved.\nOf its 71 members of staff, 18 are English and 53 are non-English, with workers from India, Sri Lanka and Nigeria.\nManaging director Samantha Hoskins said they had been recruiting these workers using sponsorship visas.\n\"It wasn't a conscious decision by us to no longer employ European staff,\" she said.\n\"I think the fact that people couldn't come and go as they were able to had a direct impact on the care industry, so we weren't getting as many people applying from European countries.\"\nLuxurycare runs six care homes across Poole and Bournemouth, employing 490 members of staff.\nOf its workforce, 148 are English and 342 are classed as \"overseas\".\nSome staff are overseas-born but have indefinite leave to remain through family connections, such as a spouse, while others may be employed through sponsorship or hold different types of visas.", "url": "https://www.bbc.co.uk/news/articles/c78ee8xdy08o"}