{"authors": ["Nicholas Bourne", "www.facebook.com"], "date_download": "2025-04-26 06:48:48", "date_modify": "2025-04-26 06:48:48", "date_publish": "2025-03-01 10:32:28", "description": "Lisa Hicks says she filmed episode despite father's death as postponing would have made him cross.", "filename": "news_articles_c0mw9lmkgggo_1745650128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3887/live/df9f99c0-f675-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw9lmkgggo_1745650128.html", "title": "Dragons' Den soap business investment would have made dad proud", "title_page": "Dragons' Den soap business investment would have made dad proud - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who secured £50,000 for a stake in her hard soap dispenser business on BBC's Dragons' Den has said her late father would have been \"absolutely bursting with pride\" at her success.\nLisa Hicks revealed she was offered the opportunity to record the episode at another time with the show's five investors or \"dragons\" as it followed his recent death.\nBut she said postponing would have made him \"cross\" owing to \"my dad's work ethic\".\n\"It was a really tough, really challenging thing to do. But, having experienced the loss of... my dearly beloved dad, walking into five dragons felt somewhat easier to be honest,\" she said.\nFounder Ms Hicks' business idea came about while at home with her three children during lockdown in March 2020 as she had wanted to reduce single-use plastics, especially soap bottles, in their every day life.\n\"I made lots of changes around the house for more eco-friendly alternatives, but one area we really struggled with was solid [soap] bars for hand, hair and body washing.\n\"Nobody wanted to share the bar, and it was really impractical.\"\nFrom that she created Monmouthshire-based SNOAP and her pitch with husband Antony started a bidding war with the show's entrepreneurs all wanting to invest.", "url": "https://www.bbc.co.uk/news/articles/c0mw9lmkgggo"}