{"authors": ["Christian Fuller", "www.facebook.com"], "date_download": "2025-04-26 06:45:33", "date_modify": "2025-04-26 06:45:33", "date_publish": "2025-03-01 15:20:48", "description": "Victoria Way in Woking is expected to be closed until at least the end of March, the council says.", "filename": "news_articles_c8d4gy59zdjo_1745649933.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4af7/live/6e258e50-f6a0-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d4gy59zdjo_1745649933.html", "title": "Woking's Victoria Way will be closed for another month", "title_page": "Woking's Victoria Way will be closed for another month - council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A town centre road in Surrey is to remain closed for at least another month, a council has said.\nIssues with Victoria Way, in Woking, began in 2021 when cladding panels fell off the Hilton hotel in stormy weather, leading to road closures for repairs - a situation which has repeated itself several times.\nWoking Borough Council leader Ann-Marie Barker said work had been completed to secure panels at greater risk of detachment by Sir Robert McAlpine (SRM) in the past week, but the road was expected to remain closed until at least the end of March.\nSRM has been approached for a comment.\nMs Baker said it was \"disappointing news and extremely frustrating\" and said she would \"continue to apply pressure to reopen the road as soon as it is safe to do so\".\nSRM had previously apologised for the inconvenience and said it empathised with the frustration felt by residents and businesses.\nPreparatory work has also begun on the remaining cladding panels, with the use of a large crane on the site.\nMs Barker added that work was under way to develop a long-term solution, aided by exterior cladding specialists who were conducting investigations to determine the cause of the detachment.", "url": "https://www.bbc.co.uk/news/articles/c8d4gy59zdjo"}