{"authors": ["Jessica Rawnsley", "www.facebook.com"], "date_download": "2025-04-26 03:54:59", "date_modify": "2025-04-26 03:54:59", "date_publish": "2025-03-04 16:46:33", "description": "Tributes have been paid to the 64-year-old comedy writer, who died in an \"accident overseas\".", "filename": "news_articles_cm2yme20rypo_1745639699.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0ff/live/60e5ea30-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2yme20rypo_1745639699.html", "title": "Bill Dare: Spitting Image and Dead Ringers creator dies", "title_page": "Bill Dare: Spitting Image and Dead Ringers creator dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Comedy writer and producer Bill Dare, who worked on shows including ITV's Spitting Image and BBC's Dead Ringers, has died, his agent has said.\nThe 64-year-old created several award-winning satirical programmes for TV and radio over a decades-long career.\nIn a statement, his agent said he had \"died at the weekend following an accident overseas\" but did not provide further details.\nIn a post on social media, Dead Ringers star Jon Culshaw called Dare the \"wisest comedy alchemist and the dearest, dearest friend\".\nDare also worked on programmes including The Late Edition and I've Never Seen Star Wars.\nHis topical satire show Dead Ringers is set to mark its 25th anniversary on BBC Radio 4 this year.\nDare also produced The Now Show, a biting take on the news which ran on Radio 4 from 1998 to 2024.\nFormer EastEnders actress Tracy-Ann Oberman said on Instagram that she was \"devastated\" at the news and that her \"entire comedy career was down to Bill\".\nJulia McKenzie, comedy commissioner for Radio 4, said: \"Bill has been a huge part of Radio 4 comedy for decades, as a writer and producer, and listeners will have heard his legendary name at the end of many of their favourite shows.\"\nShe added: \"He was funny and very dry in person, amusingly cynical when he needed to be and always pushed to keep the comedy he made, and particularly satire, spiky.\n\"He will leave a big hole in the comedy world and in our hearts.\"\nRichard Morris, the creative director of comedy and entertainment at BBC Studios Audio, said: \"Bill was a legendary figure in the comedy world and we, his friends and colleagues in radio, will miss him hugely.\n\"We'll miss the sharp wit and wisdom he brought to every production he worked on.\"\nIn a statement released on Monday, Dare's representatives at JFL Agency said: \"We are shocked and greatly saddened to have to announce the death of our brilliant client Bill Dare, who died at the weekend following an accident overseas.\n\"Our thoughts are with his wife Lucy, daughter Rebecca, and with all of Bill's family and friends who will be devastated by his loss.\n\"Bill was a truly legendary producer and writer, and his comedy instincts were second to none.\"", "url": "https://www.bbc.co.uk/news/articles/cm2yme20rypo"}