{"authors": ["Tarah Welsh", "www.facebook.com"], "date_download": "2025-04-26 04:34:07", "date_modify": "2025-04-26 04:34:07", "date_publish": "2025-03-03 00:51:34", "description": "Ministers want to move to a \"commonhold\" system where flat-owners own a share of their buildings.", "filename": "news_articles_cvgezyz31jlo_1745642047.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1617/live/8bb5ff90-f78b-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgezyz31jlo_1745642047.html", "title": "Outright ban on new leasehold flats in England and Wales moves closer", "title_page": "Outright ban on new leasehold flats in England and Wales moves closer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New leasehold flats in England and Wales are set to be banned under the latest government plans to reform home ownership.\nUnder the current leasehold system, third-party landlords known as freeholders own the building and a leaseholder buys the right to occupy a flat within it for a fixed time period.\nThe government says it wants to move to a system of home ownership that is more in line with the rest of the world, known as commonhold, where homeowners own a share of and have control over buildings they live in.\nFreeholders say leasehold is the \"most effective way of managing large complex apartment buildings\".\nThe government has yet to set out specific plans for the conversion of current leasehold properties to commonhold, but says it is \"determined\" to make this easier.\nA white paper published on Monday, external stated the sale of new leasehold flats would be banned and commonhold \"reinvigorated\" with a new legal framework.\nA draft Leasehold and Commonhold Reform Bill - including the detail of how the new system would work - will be published later this year, the government has said.\nThe new legislation would apply in England and Wales. There are an estimated five million leasehold properties in England, 70% of which are flats.\nHousing Minister Matthew Pennycook told the BBC the current system is \"inherently unfair\" and reforms are needed to give leaseholders \"better control\" over their homes and associated costs.\nExisting leaseholders can feel like they have no control over costs for repairs and maintenance of the outside of their building.\nAround 1,000 people contacted the BBC after a BBC investigation about service charges in leasehold blocks last year.\nKasia Tarker bought a one-bedroom flat in Southall, West London, in 2022.\nHer service charge bills have increased from roughly £65 per month in 2022 to more than £200 per month this year.\nShe said she felt helpless and could not afford the charges.\n\"I am going have to try and sell the flat or become homeless, I don't know what I am going to do.\"\nFirstPort, who took over management of Kasia's development in 2023, said the \"increases in areas such as insurance and health and safety costs\" were beyond its control.\nKasia said she would like more control over her service charges but the government's commonhold proposals were for new builds, so would not help her in her current situation.\nJean Hopkin, another leaseholder who got in touch with the BBC, said the service charge for her three-bedroom flat in Sheffield had increased 356% - from £106 a month to £483 in four years - and was unsellable because of the high charges.\nJenny Baker in Southampton is also struggling to find buyers because of \"unjustified\" service charges that have gone up to £7,200 a year.\n\"The state of the apartment block is just terrible. The windows don't get cleaned and there's black mould on the outside of the building - what on earth am I paying for?\n\"I feel stuck – I can never come out of it. I feel like I have absolutely no control, and it makes me feel really anxious.\"\nRendall & Rittner, which manage Jean and Jenny's buildings, said the company did \"not profit from or mark up any costs\".\nAccording to property company Hamptons, the amount of money leaseholders pay for communal maintenance and services in their building has risen by 11% in England and Wales between 2023 and 2024 to an average of £2,300.\nCompanies responsible for managing buildings have said a rise in costs can be attributed to legitimate expenses including energy prices and higher inflation rates but many leaseholders felt the costs were unfair.\nUnder the current system, it is the freeholder or landlord that appoints a managing agent. Under a commonhold system, residents would have more autonomy over what they pay and who they appoint to do maintenance, the government said.\nThe National Leasehold Campaign (NLC) said it was \"delighted\" about the announcement and called today's white paper a significant step forward.\nBut NLC founder Katie Kendrick said it was \"paramount\" that those currently living in leasehold buildings were not forgotten.\nShe said: \"While focusing on preventing future leasehold abuses is crucial, it's equally vital to address the plight of existing leaseholders currently bound by the inequitable leasehold system.\n\"Commonhold conversion mechanisms are essential to offer an escape route for those trapped.\"\nMr Pennycook said the government would \"continue to implement reforms to help millions of leaseholders who are currently suffering\".\n\"Want we don't want is a two-tier system,\" he told the BBC.\n\"All existing leaseholders in blocks will be able to convert to commonhold,\" he said, adding the government will introduce a system that makes it \"very easy\" to do so, with a draft plan set to be outlined later this year.\nHe acknowledged there will be a \"remnant of existing leasehold blocks\" once the ban on new leaseholds is brought in and a new system to convert existing leaseholds to commonhold is brought in, but said those remaining leaseholders will still have \"greater protections\".\nIn 2023, Conservative housing secretary Michael Gove expressed a desire to abolish the leasehold system entirely, but later opted for reforms instead.\nSeveral of these reforms have now been implemented, including the end of a \"two-year\" rule on extending a lease, and new rules on the right-to-manage properties in a mixed-use building.\nAdditional reporting by Jade Thompson", "url": "https://www.bbc.co.uk/news/articles/cvgezyz31jlo"}