{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 06:29:04", "date_modify": "2025-04-26 06:29:04", "date_publish": "2025-02-27 11:14:42", "description": "The train is given a new lick of paint and restored to its former glory.", "filename": "news_articles_cpwdxe4xq58o_1745648944.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8103/live/ada2d6f0-f461-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpwdxe4xq58o_1745648944.html", "title": "Essex electric train saved by Suffolk man given new lease of life", "title_page": "Essex electric train saved by Suffolk man given new lease of life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work to restore the outside of a historically important electric train saved from scrap has finished.\nBrad Wright, 22, from Needham Market, Suffolk, bought the British Railways Class 309, also known as the Clacton Express, in March 2022.\nHe has been restoring it with a team of volunteers at the East Anglian Railway Museum in Wakes Colne, near Colchester in Essex.\nMr Wright revealed that while the inside still needed attention, the vehicle had been moved outside ahead of a beer festival taking place at the site.\n\"It was all about getting the vehicle outside after a six-month restoration programme to watertight it, as we'd suffered quite a lot of vandalism on it,\" Mr Wright explained.\n\"We did a full repaint - so stripped it down and completely top to bottom gave it a fresh coat of paint.\"\nMr Wright saved the train, which previously operated in Essex and Suffolk, from scrap in Sussex in 2022.\nWhile he searched to find it a new home, he said vandals targeted it on several occasions smashing 14 windows that cost nearly £3,000 to repair.\nHe eventually set up the Clacton Express Preservation Group - a non-profit group that offers support and volunteers to restoration projects.\nThe vehicle was moved outside of its storage building on Wednesday when its new waterproofing was unintentionally tested.\n\"The heavens had opened but the one good thing is that we did the roof first and it then spent a couple of months in the shed and it got a little dusty, so [the rain] cleaned it all off for us and made it look even better for the photos,\" Mr Wright said.\nHe added the team would now focus on making repairs to the vehicle's interior ahead of a dedicated public exhibition on 12 April.\nHe stressed the project had been a team effort with help from Brendan Sothcott, Aimee Archer, Robert Varletta and Dom Shaw.", "url": "https://www.bbc.co.uk/news/articles/cpwdxe4xq58o"}