{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:54", "date_modify": "2025-05-19 15:37:54", "date_publish": "2015-02-23 16:12:56", "description": "President Barack Obama warns Republicans against \"playing politics with national security\", as a partial government shutdown looms over his immigration policy.", "filename": "news_world-us-canada-31591653_1747669074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81186000/jpg/_81186247_81186246.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31591653_1747669074.html", "title": "Homeland security cash stand-off over US migrant policy", "title_page": "Homeland security cash stand-off over US migrant policy - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "President Barack Obama and Congress are at loggerheads over homeland security's $40bn (£26bn) budget, with time running out to secure a deal.\nRepublicans, who control Congress, are seeking to remove funding for Mr Obama's attempt to save undocumented immigrants from deportation.\nThe department of homeland security protects the US borders, and guards against disasters and terror attacks.\nIts current funding plan is due to end on Friday.\nMr Obama's plan to temporarily lift the threat of deportation for about five million undocumented immigrants has become a sticking point between the two parties.\nFor the fourth time Senate Democrats rejected House-passed legislation on Monday night that funds the department through the budget year while also blocking Obama's immigration policy.\nSpeaking to a conference of US governors earlier on Monday, Mr Obama told them a shutdown would have a \"direct impact\" on their state economies and on security.\n\"We can't afford to play politics with our national security,\" he said.\nUnless agreement is reached, a partial government shutdown will follow, which would limit the agency's ability to respond to terror threats, its head has warned.\n\"If we are going to shut down, we are greatly compromised,\" Secretary Jeh Johnson told US governors on Sunday at the National Governors Association annual meeting.\nMr Johnson said the response to severe winter storms would also be hampered by the lack of funding, as the US emergency management agency is also under the Department of Homeland Security (DHS).\nIf Congress fails to approve DHS funding, about 200,000 of the agency's employees would continue working without pay. Another 30,000 would be told to stay home.\nThe impasse has been complicated by a judge temporarily blocking Mr Obama's immigration executive action. The US immigration agency is under the purview DHS.\nIn November, Mr Obama directed US officials to protect immigrant parents of US citizens or legal permanent residents from deportation, as well as expand a previous programme doing the same for young migrants brought to the US illegally by their parents.\nSenator Lindsay Graham said on Sunday he was \"willing and ready to pass a DHS funding bill and let this play out in court\".\n\"Now we've got a perfect reason to not shut down because the courts have decided, at least initially, in our favour,\" Senator John McCain told broadcaster MSNBC.\nBut other Republicans, including a few governors attending a White House meeting on Monday, have argued Congress should stand firm on what they see as an unconstitutional power grab by Mr Obama.\nMr Obama is set to meet governors during the last day of the conference on Monday - but has not shown any willingness to drop his executive action in exchange for the department's funding.", "url": "https://www.bbc.com/news/world-us-canada-31591653"}