{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:17:39", "date_modify": "2025-05-21 06:17:39", "date_publish": "2025-01-23 00:00:00", "description": "It's a momentous day for Thailand, one of very few places in Asia to recognise marriage equality.", "filename": "news_live_czx8nxrn1j4t_1747808259.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_czx8nxrn1j4t_1747808259.html", "title": "Couples wed in a riot of colour as Thailand legalises same-sex marriage", "title_page": "Couples wed in a riot of colour as Thailand legalises same-sex marriage - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We're ending our live coverage\nThank you for following our coverage of this momentous day in Thailand, where hundreds of LGBTQ couples have already tied the knot as the country legalises same-sex marriage.\nWe are now wrapping up our live coverage, but celebrations are set to continue across the country.\nThe BBC has spoken to several couples on their long fight to get here.\nRead more:\n'We have been waiting 18 years': Joy as Thailand legalises same-sex marriage\n'A long fight full of tears': Why Thailand became a haven for LGBT couples\nWhere else is same-sex marriage legal in Asia?\nThailand is the third jurisdiction in Asia, after Nepal and Taiwan, to legalise same-sex marriages.\nIn May 2019, Taiwan’s parliament became the first in Asia to legalise same-sex marriages, two years after the island’s constitutional court ruled that same-sex couples had the right to marry. This was celebrated by LGBTQ+ communities across the region. In 2023, the legislature passed an amendment to allow gay couples to jointly adopt children.\nNepal registered its first same-sex marriage in November 2023, following an interim Supreme Court order in favour of it. However, local officials had not been consistent in following the order. In 2024, the federal government directed all local governments to register same-sex marriages.\n'Love can change everything' - gay lawmaker\nPaweena Ninbut\nBBC Thai in Bangkok\nGay lawmaker Tunyawaj Kamolwongwat, who has been a driving force behind the marriage equality laws, says this milestone was reached \"with the love of the people\".\n\"Without everyone's love, marriage equality bill wouldn't have succeeded.\n\"I'm not a believer in love, but today I have faith, and I believe love can change everything,\" says Tunyawaj, a People's Party MP.\nHis party is the successor of the reformist Move Forward party which has been instrumental in advocating for LGBTQ rights.\n\"We, the LGBTQ community, never imagined that we could get married or build a family.\n\"Today, I feel very happy for everyone to see that they have received an equal right,\" Tunyawaj says.\nThe right political moment for marriage equality\nJonathan Head\nBBC South East Asia Correspondent\nActivism and bold political reforms played a crucial role in Thailand's journey toward marriage equality.\nDifferent LGBTQ groups had come together in the Change 1448 campaign - 1448 is the clause in the Thai Civil Code covering the definition of marriage - and later under the Rainbow Coalition for Marriage Equality.\nThey learned to work with political parties in parliament to persuade them to change their stance on the law.\nIn the 2019 election which returned Thailand to civilian rule after five years under a military government, a new reformist party called Future Forward, which fully supported equal marriage, did unexpectedly well. They won the third-largest share of seats, revealing a growing hunger for change in Thailand.\nFuture Forward was later dissolved by a controversial court verdict, setting off months of student-led protests calling for sweeping reforms.\nIn 2023, the party's successor, Move Forward, performed even better than in 2019. Again, it was clear that the desire for change was felt across Thai people of all ages.\nMove Forward was blocked from forming a government by conservatives who objected to its call for wholesale political reforms. But by then, equal marriage had become less contentious.\nRead more here.\nA look at what's been happening today\nIt's coming up to 13:30 in Thailand and we've seen dozens of LGBTQ couples register their unions in the past few hours alone - more than a thousand of them are expected to marry by the end of today.\nIf you're just joining us now, here's what you need to know:\nOne of today's biggest events is a mass wedding happening at a luxury mall in central Bangkok. Couples can get wed here until 20:00 local (13:00 GMT). There will be performances and a pride carpet rolled out here until tonight\nLGBTQ couples now have the same rights as other couples to manage assets, inherit, adopt and take decisions about their partner's medical treatment\nThe BBC's Bangkok team has witnessed couples in all smiles, and in tears of joy, as they held their long-awaited marriage certificates. \"This is just perfect for us,\" says one man\nDistricts across Thailand are trying to outdo one another with parties and gifts to celebrate this legal milestone. Cupcakes, bags and free air tickets are among the things they are giving out\nThailand has long been seen as a haven for LGBTQ people - it remains an outlier in Asia - but activists say they are fighting for more changes because many laws are still not gender-neutral\nStay with us as we bring you the latest.\nThe reformist MP who pushed for marriage equality\nThanyawat Kamonwongwat, a transgender MP of the reformist Move Forward Party, is also expected to attend today's event at Siam Paragon.\nThanyawat submitted the first draft of Thailand's same-sex marriage bill in 2022 - it did not reach its final reading, but another was tabled the next year.\nMove Forward won more seats than any other party in the 2023 election in what analysts dubbed a stunning vote for change.\nThe party was blocked from forming a government by conservatives who objected to its call for major political reforms.\nBut by this time, equal marriage had become less contentious and the bill passed parliament last year with little opposition.\n'We're very jealous', says Chinese man\nLulu Luo\nReporting from Bangkok\nA Chinese gay man choosing only to be identified by his surname Zhang says he came to Thailand to celebrate the occasion with a dozen of his friends from China.\n“We’re excited, we’re also very jealous. Thailand is so close to China, but in another sense it’s so far away,” Zhang told the BBC.\nHe did not want to reveal his full name because LBGTQ+ rights are a controversial subject back home.\nSame-sex marriage is not allowed in China, as is the case across most of Asia, barring Nepal and Taiwan.\n“We do hope this will inspire the rest of our region,\" Zhang says. \"If it can happen in Thailand, Nepal and Taiwan, we have hope it will eventually happen elsewhere.”\nThailand’s LGBTQ movement is young - and still faces hurdles\nJiraporn Sricham\nBBC Thai\nIt was only in the past decade that Thailand's LGBTQ movement really took off.\nWhile the long-awaited passage of the marriage equality law is a milestone, observers believe the community still faces challenges.\nNarupon Duangwises, who researches queer theory, says the influence of the military, which has ruled the country at various points, and a conservative education system have “entrenched gender bias for 80 years”.\n“Many Western countries have had marriage equality laws for 10-20 years. But still, there are a lot of LGBTQ youths who are bullied in schools,\" he says. \"Therefore, the law does not guarantee the right to freedom in their daily life.\"\nCould other South East Asian countries follow suit?\nJonathan Head\nBBC South East Asia Correspondent\nWhile much of Thailand is now celebrating - the next question being asked is, could other countries in South East Asia follow suit?\nIn the Philippines, there is growing acceptance of LGBT couples living together openly. But the Roman Catholic Church vehemently opposes same-sex marriage.\nIn Vietnam, like Thailand, there are no religious or ideological obstacles, but campaigning to change the law is difficult under a repressive regime.\nThe influence of Islam in Malaysia, Indonesia and Brunei makes the notion of equal marriage a non-starter. LGBTQ communities there face discrimination and prosecution. And in Brunei, sex between men carries the death penalty.\nSo Thailand hopes to benefit from being a pioneer.\nThe country is already seen as a safe and welcoming destination for LGBTQ holiday-makers.\nNow, with the legal recognition of their marriages, they will be able to raise children here and grow old together with nearly all the rights and protections given to heterosexual couples.\nHere's more on how Thailand got here.\n'I have started my new life', say Thai-Japanese couple\nPanisa Aemocha\nBBC Thai\n\"Now I can say, welcome my husband. I am so excited,\" says Warin Kheanpikul.\nShe and her partner Aki Uryu have \"dreamed for so long” of this day.\n\"It is like i have started my new life,\" Aki says.\nIn an earlier interview, Warin told the BBC she never thought marriage equality would happen in her lifetime.\nAki, who is Japanese, moved to Bangkok to be with Warin. Life in Japan, which does not recognise same-sex marriages, is difficult for the LGBTQ community, Aki said.\n“In Thailand, I can hold hands with my partner, walk together. No one says anything. It’s just different. It feels right.\"", "url": "https://www.bbc.com/news/live/czx8nxrn1j4t"}