{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:39", "date_modify": "2025-05-19 15:32:39", "date_publish": "2017-07-17 00:00:00", "description": "News, sport, weather and travel updates from across the West of England on Monday, 17 July 2017.", "filename": "news_live_uk-england-bristol-40607464_1747668759.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-bristol-40607464_1747668759.html", "title": "As it happened: West of England", "title_page": "As it happened: West of England on 17 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Remembering the Hartcliffe Riots: a former techie remembers\nIan Parker\nBBC News\nOne of the things I'll always remember was the sight of one of our cameramen coming back to the BBC Points West studio covered in blood from a head wound.\nHe'd been out filming and had been struck with a piece of scaffold pole during the disturbance.\nThe camera was a write-off but luckily it had taken much of the impact.\nHe said he had lots of good pictures on the tape but that was jammed inside the camera.\nThinking there was nothing to lose I started dismantling a rather expensive camera using a big screwdriver as a crowbar.\nWe managed to get the tape out and transferred it in to an unbroken cassette in a record-breaking time.\nRemarkably it played and was used minutes later in the news bulletin with pictures right up to the moment the camera was destroyed and the picture turned to snow.\n'Sickie' PC claims work environment was 'toxic'\nA police officer accused of pulling \"sickies\" to go horse racing has told a misconduct hearing the police station in Gloucester was \"toxic\".\nPC Jonathan Adams, a probationary officer, said working at Barton Street was \"horrible\" and he dreaded going into work.\nHe told the panel he suffered stomach cramps and migraines and had not lied about being sick on the three occasions he went to the races.\n\"It was the worst time I ever had, the worst. I didn't want to let the team down but I didn't want to go into that environment because it was toxic,\" he said.\n\"I saw it as getting myself better for a day, get out of that environment, get myself better.\"\nClick here to read more.\nMemories of covering the Hartcliffe story\nSteph Marshall\nFormer BBC Radio Bristol reporter\nJuly 17th 1992\nI remember it was a hot day – the same as it is today, 25 years on. Sticky and humid.\nWe knew there had been a crash involving the police in Hartcliffe but we couldn’t guess the consequences. With hindsight we should have seen what was coming – after all, these were economically troubled times – unemployment was rising and by the end of that year three million would be out of work - with the official rate around 10.6%.\nBlack Wednesday wasn’t far away. Negative equity was about to enter our vocabulary. We were all feeling the pinch but in Hartcliffe it was worse. Lots of shops had shut: there was nowhere to go, nothing to do and no money. Hartcliffe was restless and broke.\nI was dispatched in the conspicuous BBC radio car with a giant reel-to-reel tape recorder, in the post-riot calm of the day after the night before. Shops had broken windows, the library had been set on fire, there was a lot of clearing up. Police cars were on corners. There weren’t many people around and those that were didn’t want to talk to a young reporter with a great big microphone.\nSuspicion and anger hung in the air. It seemed the only people up and about that morning were heading for the butchers and mostly to buy strings of chitterling. I joined the queue hoping that somebody or even the busy butcher himself would finally talk to me. I couldn’t go back empty-handed.\nWhat had they seen? Why did it happen? Would there be more?\nWhen I made it to the front and the shop had quietened down after the lunch rush I was finally given an interview. For the butcher and the rest of the queue what had happened the night before came as no real surprise: Hartcliffe was dying, felt forgotten and people living there were fed up.\nThe butcher shop was one of the few surviving business - but for how much longer? They all told me it was never going to take much for Hartcliffe to explode – everything was gone and there was nothing to lose. It was only a question of time.\nRemembering the Hartcliffe riots of 1992\nSharon Alcock\nBBC News\nI must have moved on to try to find my interviewees, because I know I went into one of the tower blocks further down the estate and knocked on doors.\nOne young single mum spoke to me. She was very anxious that she should remain anonymous and that no-one saw me enter or leave her flat. She had known, from a distance, one of the men who died. She had watched the fires and running men and women from her window overnight.\nNow she, too, felt unsafe.\nShe told me she thought the riots would have happened with or without the men’s deaths, because everyone was so fed up of not being helped or listened to.\nThere were small pockets of unrest still happening across the estate. Walking back to my radio car I remember, at one point, a group of agitated teenagers running around the corner towards me, shouting.\nFor a few seconds I wasn’t sure whether they were running at me: I was carrying a very visible BBC tape recorder and microphone - but the group passed on. In a parting shot, one of them threw a brick at the car as I drove away. I was quite lucky. Some of my colleagues did not fare as well.\nSorry, we're having trouble displaying this content.View original content on Facebook\nThe BBC is not responsible for the content of external sites. Facebook content may contain adverts.\nRemembering the Hartcliffe riots of 1992\nSharon Alcock\nBBC News\nI parked my BBC Radio Bristol car near to Symes Avenue – a central row of shops on the estate. Many of the shops and the local library had been looted and burned out overnight and were smouldering acrid black smoke.\nI remember picking my way across broken glass along the row of ruined shops and talking to a shopkeeper trying to pick out anything of worth still remaining.\nThis was a riot of the masses against what they perceived as the establishment – the have-nots against those who had more – and their local shops had fallen into the latter group in the rioters’ minds.\nHardly anyone was willing to speak to the BBC, for the same reasons. I mostly got waved away by young and old alike.\nBut the shopkeeper talked to me: he was shocked at what he saw as a personal attack on him and his family’s livelihood, after being a local resource for many years.\nOne elderly woman was very tearful about where she was now going to buy what she needed.\nBut the passions of a group of young men I spoke to were clearly still running high and I instinctively did not press them to talk to me.\nMore follows...\nRemembering the Hartcliffe riots of 1992: a BBC reporter\nSharon Alcock\nBBC News\nIn July 1992, I was three years into my job as a reporter on BBC Radio Bristol when I was sent, early in the morning, to cover the ‘unrest’ in Hartcliffe on Thursday 16th July. Two men - Shaun Star and Keith Buck - had been killed in a police chase, after stealing an unmarked police motorbike the evening beforehand. An inexperienced police driver had used his car to block the speeding bike’s progress and both Hartcliffe men had lost their lives.\nI was one of a several BBC reporters sent to Hartcliffe over the following 48 hours. It seems remarkably stupid, now, that we drove – alone – in a marked radio car, complete with hydraulic 40 foot radio mast, onto the estate to try to reflect what was happening and what local people had to say. Today’s risk assessments would never allow it.\nIt was a hot day and it had been a hot week. Hartcliffe was a deprived area, with one of the highest rates of unemployment in the UK, as well as the living conditions and frustrations that go hand-in-hand with that statistic. A bid for a multi-million-pound government development grant had been rejected the week before; the death of the two men was a trigger for simmering unhappiness to boil over.\nMore to follow...", "url": "https://www.bbc.com/news/live/uk-england-bristol-40607464"}