{"authors": ["George King", "www.facebook.com"], "date_download": "2025-04-26 03:46:40", "date_modify": "2025-04-26 03:46:40", "date_publish": "2025-03-05 05:34:49", "description": "Ch Insp Tony Atkin apologises to Oliver Powell over the handling of the investigation in Essex.", "filename": "news_articles_ce98x30j9z0o_1745639200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b0c3/live/9c911170-f91f-11ef-8893-abdeb609a7eb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce98x30j9z0o_1745639200.html", "title": "Essex Police admits £15,000 tool theft probe was 'below standard'", "title_page": "Essex Police admits £15,000 tool theft probe was 'below standard' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A senior police officer has admitted that an investigation into the theft of thousands of pounds-worth of tools from an electrician's van has \"not met the high standards\" expected.\nOliver Powell, from South Ockendon, Essex, parked his van at Lakeside Shopping Centre on 15 February.\nBut as the self-employed 39-year-old enjoyed dinner, a film at the cinema and a few games of pool with his partner, his van was broken into and as much as £15,000-worth of equipment was taken.\nMr Powell said Ch Insp Tony Atkin, Essex Police's district commander in Thurrock, has since apologised to him after he accused the force of \"complete negligence\".\nHe told the BBC that on his return to the van, he noticed a big hole in the side door where the thieves had accessed its locking mechanism.\nWhen he looked inside, he realised every tool had been stolen, including hand tools, power tools and electrical testers, and it left him \"gutted\".\n\"They were the very tools I used to keep a roof over my and my kids' heads and food in our tummies,\" he said.\nMr Powell called police immediately, and he says he was assured a forensics officer would be sent to his home to take prints from the van.\nHe stayed up waiting for them, and when they failed to show up he called the police again late the following afternoon.\nIt was then that Mr Powell says he was \"met with a shocking response\" from the operator, who notified him that his report had been documented incorrectly.\n\"Forensics hadn't been requested and the CCTV hadn't been looked at, and no more action would be taken,\" Mr Powell said.\n\"How in this day and age can a hardworking, taxpaying, law-abiding citizen be let down like that? It's complete negligence.\n\"I now have to replace getting on for around £10,000 to £15,000-worth of tools and the criminals haven't got to worry in the slightest.\n\"Vehicle and tool theft in Essex seems to have become lawless and I've now had to borrow tools be able to go to work to earn the money to replace it all.\"\nCh Insp Atkin said he had since spoken to Mr Powell to reassure him that the force would follow \"all reasonable lines of inquiry\".\nHe also said the early stages of Mr Powell's report would be reviewed to ensure \"all victims are given the best possible service\" when reporting an incident.\n\"We understand this investigation has not met the high standards any victim should rightly expect from us,\" he told the BBC.\n\"In cases like this, victims lose much more than just their belongings. Victims lose the means to carry out their work and the impact that has on livelihoods is even greater.\n\"We have liaised with security colleagues at Lakeside and a person and vehicle of interest have been identified. Work is ongoing to progress the investigation.\"", "url": "https://www.bbc.co.uk/news/articles/ce98x30j9z0o"}