{"authors": ["Kaleigh Watterson", "www.facebook.com"], "date_download": "2025-04-26 06:35:02", "date_modify": "2025-04-26 06:35:02", "date_publish": "2025-02-27 06:17:02", "description": "How are Chester's famous walls, which have overlooked the city since Roman times, being restored?", "filename": "news_articles_cy5kw46qxppo_1745649302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f3c/live/e1275ca0-da65-11ef-ac7f-a1120f6cdbc6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy5kw46qxppo_1745649302.html", "title": "Chester: What does it take to repair the city's historic walls?", "title_page": "Chester: What does it take to repair the city's historic walls? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Unique in the UK, Chester is still surrounded by its historic city walls, which date back to the time of the Romans.\nEver since a section collapsed five years ago, though, residents and visitors alike have had to rely on scaffolding to complete their two-mile lap of the city.\nWith preliminary work under way, BBC News asks: What does it take to fix a nationally recognised monument in the heart of a busy city centre?\nOn a foggy winter's day, contractors in bright orange protective clothing are hard at work building a ramp from the Grosvenor Shopping Centre car park.\nIt's not for cars though.\nInstead, the ramp will allow access to a section of Chester's city walls which has not been touched since January 2020.\nAccess is tricky because the ancient walls go through the heart of the city centre and are, in many areas, surrounded by buildings that have been constructed during the last 2,000 years. This section is no different.\nThe ramp will allow contractors to see, with their own eyes, the full extent of what they're dealing with.\nUntil the site is made safe and fully analysed, no actual repair work can begin.\nThis is definitely not a quick fix.\nChester's walls date back to when the city was an important Roman fortress, known as Deva.\nThe city's Roman heritage is widely known and much celebrated.\nYou can often see elaborately dressed \"centurions\" leading school children through the city centre and hear them shouting their \"left, right\" marching orders in Latin.\nBut like the city itself, Chester's walls have evolved over time.\nIt was actually the Victorians who added many of the walkways on top of them.\nThe section that collapsed five years ago is close to the Eastgate Clock, a Victorian icon which is now a popular selfie spot for tourists.\nAt the moment, though, if those same visitors want to complete a circuit of the city's walls, at one point they have to take a detour.\nThey must leave the historic stones and walk on a scaffolded walkway surrounded by large, white wooden walls which hide the collapsed segment from view.\nPrincipal structural engineer Paul Maddison is from Ramboll, the design and conservation engineering firm working on the restoration project.\nHe says it will have three stages.\nThe first - to stabilise the site - is under way, he said. It is expected that it will be completed this year.\nStage two will be the investigation work needed to allow the team to understand the scale and type of work that will be required, as well as its specific challenges.\nThe final stage will be the actual repairs.\nHistoric England will have to approve each stage before the next can begin.\nSo when can we expect the work to be finished?\n\"Until we've physically seen the wall, understood the extent, understood the problems, it's very difficult to put any time scale to the further investigations and repairs going forward,\" Mr Maddison told BBC News.\n\"We've had to design the whole solution around the fact we've not been able to step on the site at all,\" said Mr Maddison.\nSo what was it like when he first saw the collapsed section?\n\"The first thing that came to mind was how vast it is and how extensive it is,\" he replied.\n\"Our job now is to get to grips with what the problems are and how we're going to put them right.\"\nA project of his nature is bound to have its challenges, though.\n\"It's a very old structure, it's been built over numerous phases in history,\" Mr Maddison explained.\n\"So it's understanding its construction, understanding the reasons for the collapse.\n\"Once we've got that information, we can start to develop our investigations and our repairs.\"\nThe walls are the responsibility of Cheshire West and Chester Council.\nThey are \"scheduled monuments\", meaning that they are regarded by Historic England as a \"nationally important\" archaeological site.\nDespite being on a par with Stonehenge for example, the local authority receives no money from central government to preserve them.\nInstead, Chester's walls have to be funded through the council's highways budget.\nKaren Shore is the council's deputy leader, and looking after the borough's highways is one of her key responsibilities.\n\"Unfortunately there isn't any bespoke funding,\" she said, adding that \"the highways budget has been under pressure, as have all council budgets in recent times\".\nShe asked people to be \"patient\" and \"understanding\" during the walls' restoration.\n\"Even though you may not have seen anything happen on the site, there has been an awful lot of work behind the scenes to ensure we can restore this site for the benefit of everyone,\" she said.\n\"There was a lot of time taken to try and understand the site, to try and figure out and design a solution, which is really quite difficult when you're not accessing the site.\n\"But now that has been achieved, we're able to move forward in the way we hope.\"", "url": "https://www.bbc.co.uk/news/articles/cy5kw46qxppo"}