{"authors": ["Annabel Rackham", "www.facebook.com"], "date_download": "2025-04-26 06:16:45", "date_modify": "2025-04-26 06:16:45", "date_publish": "2025-03-01 19:22:24", "description": "The world's biggest artists were on the red carpet at London's O2 Arena ahead of the ceremony.", "filename": "news_articles_c70w5kk4e97o_1745648205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe85/live/02b74160-f6c1-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70w5kk4e97o_1745648205.html", "title": "Brit Awards in pictures: Sabrina Carpenter and Teddy Swims lead the red carpet", "title_page": "Brit Awards in pictures: Sabrina Carpenter and Teddy Swims lead the red carpet - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Brits Awards red carpet was as vibrant as ever, with some amazing musical talent making an appearance for the UK's biggest night in music.\nSabrina Carpenter, Jade Thirlwall and Teddy Swims stole the show with their outfits.\nTeddy, whose track Lose Control was nominated for international song of the year stayed true to his name by turning up to the red carpet covered in teddy bears and toys.\nIt was chilly at the O2 Arena this evening so it was a pretty smart choice from the US singer.\nSabrina Carpenter walked the red carpet as a winner already - she was the recipient of the Brits Global Success award and the first international artist to receive the accolade.\nThe Please Please Please singer opened tonight's show and will be embarking on a tour of the UK and Ireland over the next few weeks.\nJade Thirlwall appeared in an incredible gown, which she described as a \"denim wedding dress\".\nShe told the BBC she was \"very grateful\" to have received two nominations for best pop act and song of the year.\nHer song Angel of My Dreams is an honest assessment of her \"toxic relationship with the music industry\" and aims to show how \"fame has come at a price\" for Thirlwall.\nThe 32-year-old has navigated the music industry as a solo artist in the last year, after her group Little Mix went on hiatus in 2022.\nStella Quaresma, Renee Downer and Jorja Douglas make up the British girl group FLO, who were nominated for best R&B act.\nThe group told the BBC they have been busy in recent weeks preparing for their tour, working with Beyoncé's dance captain Amari Marshall.\n\"We've been running and singing and holding the plank and singing,\" Downer says.\nJust hearing that has made me break out into a sweat.\nRapper and YouTuber KSI opted for an all-black leather look.\nHis song Thick Of It, which features Trippie Redd, was nominated for song of the year - despite being something he was \"clowned for\".\nHe told the BBC about his very busy schedule, which he is currently \"winging\".\n\"I've got a fight at the end of the month, I'm making music, BGT [Britain's Got Talent], YouTube videos,\" he said.\nHopefully he left room for partying at the Brits in his calendar.\nIts been a busy week for Stranger Things star Millie Bobby Brown - from attending the SAG Awards and promoting her new film The Electric State at its Los Angeles premiere.\nBut it's great to see she found the time to come back home to the UK to enjoy a night of musical performances.\n\"I'm not being a mad man in shades,\" said Stormzy on stage, explaining he was wearing sunglasses inside the O2 because he had \"mashed up my eye\" while playing padel.\nIt was game, set and match to the best rap act who won his fourth Brit award.", "url": "https://www.bbc.co.uk/news/articles/c70w5kk4e97o"}