{"authors": ["Vincent Kearney", "www.facebook.com"], "date_download": "2025-05-19 15:29:21", "date_modify": "2025-05-19 15:29:21", "date_publish": "2015-02-09 17:13:05", "description": "An international human rights lawyer and wife of Hollywood star George Clooney has joined a legal team representing a group known as the \"hooded men\" taking action against the British government.", "filename": "news_uk-northern-ireland-31318181_1747668561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80890000/jpg/_80890950_apkikq6s.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31318181_1747668561.html", "title": "Amal Clooney to represent 'hooded men' in torture legal case", "title_page": "Amal Clooney to represent 'hooded men' in torture legal case - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An international human rights lawyer and wife of Hollywood star George Clooney has joined a legal team representing a group known as the \"hooded men\".\nAmal Clooney is part of a team representing 10 men taking the UK to the European Court of Human Rights.\nThe men allege they were tortured when they were held without trial in Northern Ireland in August 1971.\nTheir claim is being backed by the Irish government.\nFourteen men claimed they were hooded, forced to listen to constant loud static noise, deprived of sleep, food and water, forced to stand in a stress position and beaten if they fell.\nSome were also thrown from helicopters while their heads were covered with hoods.\nThey were told they were hundreds of feet in the air and believed they were going to be thrown to their deaths, while in reality they were only about 20 ft from the ground.\nIn 1976, the European Commission on Human Rights upheld a complaint by the Irish government that the men had been tortured, a ruling that was later overturned on appeal.\nThe European Court ruled that the men had been subjected to inhumane and degrading treatment, but not torture.\nIn a surprise move in December, the Irish government backed the men's campaign to have the case reopened. It said their treatment should be recognised as torture.\nMrs Clooney is now part of a team of lawyers from London, Dublin and Belfast who are taking the case.\nThey are representing 10 out of the 11 surviving members of the \"hooded men\", and the families of three others who have died. One survivor is not taking part in the legal action.\nMrs Clooney has a formidable list of high profile clients and cases, including Julian Assange, the founder of WikiLeaks, who is fighting against extradition from the UK to Sweden.\nShe also represents the Greek government in a campaign to secure the return of the world famous Elgin Marbles. Removed from Athens in 1811 by Lord Elgin, they are one of the most popular displays at the British Museum.\nHer list of clients and cases formed the basis for a joke at her husband's expense at the Golden Globes last year.\nAmerican comedienne Tina Fey told the audience: \"George Clooney married Amal Alamuddin this year. Amal is a human rights lawyer who worked on the Enron case, was an advisor to Kofi Annan regarding Syria and was selected for a three-person UN commission investigating rules of war violations in the Gaza Strip, so tonight her husband is getting a lifetime achievement award.\"\nAmal Clooney is expected to visit Belfast in the near future to meet the solicitors involved in the case, Kevin Winters and Company.\nShe will also meet the men whom she will help to represent in court in Strasbourg.\nThe solicitors have welcomed her agreement to be part of the legal team.\n\"The case of the 'hooded men' is one of the most significant judgements in human rights history,\" said solicitor Darragh Mackin.\n\"We think Amal's track record speaks for itself, as do all of the counsels' CVs in this case. It is an extremely rare application, an interstate case before the European Court.\n\"Therefore it is very significant that we have people with the background and experience of Amal and the other barristers who are involved making this application.\"", "url": "https://www.bbc.com/news/uk-northern-ireland-31318181"}