{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:10", "date_modify": "2025-05-19 15:29:10", "date_publish": "2017-07-19 00:00:00", "description": "Cost of repairs and insurance 'already more than £1m'; council reserves 'will be used' to repair damage, and more", "filename": "news_live_uk-england-devon-40591972_1747668550.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-devon-40591972_1747668550.html", "title": "BBC Local Live: Devon & Cornwall on Wednesday 19 July 2017", "title_page": "BBC Local Live: Devon & Cornwall on Wednesday 19 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coverack flash flood: What we know\nAndrew Segal\nLocal Live\nA flash flood has destroyed a road and 50 properties have been affected in the Cornish village of Coverack\nHeavy rain and hail moved in to the village at about 15:00 on Tuesday before it was declared a major incident at about 17:20\nA coastguard helicopter was deployed to rescue two people trapped on a roof. There were also reports of people trapped in outhouses and in attics as water rose\nNo reports of any injuries\nThe Environment Agency said some water courses were polluted and some sewers compromised, but drinking water is safe\nA generator was brought in to provide electricity for a care home after it lost power on its ground floor\nAbout 150 people attended a public meeting to discuss the aftermath of the flooding\nInsurers said they were \"on the ground supporting people\" affected by the flooding\nCornwall Councilor Adam Paynter said cash for repairs - already estimated at more than £1m - would be used from the authority's contingency fund\nHe also said road repairs would \"start as soon we can\" and contractors would stay in the village until the work was completed\nCornwall Council added that it had assurances that the government would help with a £1m bill to clean up the village\nCoverack flash flood: Work to repair roads 'to start as soon we can'\nJustin Leigh\nPresenter, BBC Spotlight\nWork to repair roads in Coverack will \"start as soon we can\", the leader of Cornwall Council says.\nFlash flooding left huge piles of rocks and stones blocking roads and road surfaces torn up in places, some exposing pipes underneath (pictured).\nCornwall Councilor Adam Paynter said \"getting roads reinstated is a priority for us\".\nHe added: \"We don't have timeframe on that yet.\n\"We'll get the heavy kit in tomorrow and we'll start as soon as we can.\"\nCoverack flash flood: Driver and boy 'had to leave bus through hole cut in hedge'\nAndrew Segal\nLocal Live\nA school bus driver caught up in the Coverack flood wanted to ensure his sole passenger got home because he \"wanted to make sure the boy was safe\".\nDriver Thomas Duffield, from Penzance, said his vehicle was \"pummelled\" by rocks, stones and boulders on a steep hill approaching the Cornish village in the flood on Tuesday.\nMr Duffield said the vehicle couldn't move any more and \"in the end the emergency services cut a hole in a hedge in a property next to the bus and got us both out\".\n\"Thankfully we got out of there safely, and when I turned up for work this morning I had my colleagues bowing at me which was quite funny.\"\nCoverack flash flood: More video of the floods\nJon Kay\nBBC News\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nCoverack flash flood: Coastguard helicopter involved in rescue\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nTwo people were rescued by a coastguard helicopter after water burst in through a door in their home, which was 5ft to 6ft deep in places.\nCoverack flash flood: Generator for care home\nAndrew Segal\nLocal Live\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nA generator has arrived for a care home in flood-hit Coverack after it lost power on its ground floor.\nCornwall Council transport portfolio holder Geoff Brown said the home's power situation had to be addressed because it was the \"main concern\" for the authority.", "url": "https://www.bbc.com/news/live/uk-england-devon-40591972"}