{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 07:54:21", "date_modify": "2025-04-26 07:54:21", "date_publish": "2025-02-25 13:30:35", "description": "Fritton Owl Sanctuary has had to install special enclosures and stop its \"hold an owl\" experience.", "filename": "news_articles_cly246jzp13o_1745654061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0671/live/eca6b750-f2c6-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly246jzp13o_1745654061.html", "title": "Fritton Owl Sanctuary says bird flu rules are affecting income", "title_page": "Fritton Owl Sanctuary says bird flu rules are affecting income - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Restrictions imposed due to avian flu are risking the future of an owl sanctuary, its founder has said.\nVisitors to Fritton Owl Sanctuary, based at Myhills Garden Centre near Great Yarmouth, can no longer \"hold an owl\" for a small fee - a major source of income for the charity.\nThe sanctuary had charged £4 per visitor per owl, which, prior to the restrictions, raised £300 to £600 per month. The losses equate to the charity's monthly food bill.\nLouise Thorpe, founder and manager, said the cost of installing enclosures and the loss of income also \"left no leeway for veterinary bills\".\nThe sanctuary has 39 owls but has had to build enclosures and hold off from wildlife rescues to protect them from the disease.\nVisitors must comply with biosecurity measures at the sanctuary and dip their feet in disinfectant to reduce the risk of infection.\nVolunteers are also instructed to change gloves regularly and to use sanitiser when working between enclosures.\nThe sanctuary's team manager, Adam Brunger, said: \"We care about the birds here immensely.\n\"They are a huge part of the family here and if avian flu were to get in here that would be a really bad thing for us and our birds.\n\"Any of our birds, if they came out of their enclosure they would be at risk of catching avian flu, so we've had to stop doing our 'hold an owl experience' which was our primary source of income.\n\"The amount of customers we've been having since the avian flu crisis has just dropped off completely.\n\"We were inundated with people last summer but with avian flu we're barely seeing anyone, which is really sad.\"", "url": "https://www.bbc.co.uk/news/articles/cly246jzp13o"}