{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:39:01", "date_modify": "2025-04-26 07:39:01", "date_publish": "2025-02-27 13:32:22", "description": "Langton Herring's boomers created TikTok videos to attract backing from a younger audience.", "filename": "news_articles_cn7vvz7dr5zo_1745653141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/edca/live/22501cb0-f502-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vvz7dr5zo_1745653141.html", "title": "Villagers raise cash needed to bid for Langton Herring pub", "title_page": "Villagers raise cash needed to bid for Langton Herring pub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners who went viral with their take on a Gen Z TikTok trend say they have raised enough money to place a bid to buy their village pub.\nThe Elm Tree Inn in Langton Herring, near Weymouth, closed its doors in November 2023.\nThe Friends of the Elm Tree group posted a video about the pub in January as villagers rallied to get £600,000 together.\nThe group said it was now able to make an offer to the owner before a 3 March deadline after more than £520,000 was pledged or received through fundraising and selling community shares.\nAlan Cooper, of Friends of the Elm Tree, said it was a \"daunting mountain\" to raise the amount needed.\n\"But I am happy to say that the villagers have been incredible and we are just about there,\" he added.\nHe said the group expected to put in a bid to purchase the pub on Friday.\n\"The owner is not obliged to accept the offer but we hope very, very much that he will.\n\"Having the village without its pub is only half a village,\" he said.\nThanking those who had got \"involved to get this far\", Friends of the Elm Tree said it was so grateful to everyone across the globe.\nThe group said it still needed about £100,000 to secure the Elm Tree for the future and planned to continue to fundraise with further videos planned.\nTheir short clips on social media saw the village's baby boomers adopt youth slang in a bid to get their message across to younger supporters.\nIn one clip, villager Hilary Warren, urges viewers to \"be an Elm Tree stan and help these boomers save their pub\".\nThe video has currently been viewed more than 2.3 million times and attracted support from as far afield as Brazil and Canada.", "url": "https://www.bbc.co.uk/news/articles/cn7vvz7dr5zo"}