{"authors": ["Tom MacDougall", "www.facebook.com"], "date_download": "2025-04-26 04:03:46", "date_modify": "2025-04-26 04:03:46", "date_publish": "2025-03-03 19:42:58", "description": "Absalom Sigiyo and Romulad Houphouet were found guilty following a five-week trial in Sheffield.", "filename": "news_articles_c5ym60q7gnlo_1745640226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/843f/live/66922800-f863-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ym60q7gnlo_1745640226.html", "title": "Two men found guilty of raping teenage girls in Rotherham", "title_page": "Two men found guilty of raping teenage girls in Rotherham - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two men have been found guilty of multiple sexual offences after a court heard how two teenagers were regularly raped over a period of months in Rotherham.\nThe girls were sexually assaulted several times a week over six months by a gang of men who referred to the teenagers as \"fresh meat\", Sheffield Crown Court heard during a five-week trial.\nRomulad Stefan Houphouet, who is now 37, and Absalom Sigiyo, now 41, were found guilty of a number of offences including rape.\nHouphouet, of Burngreave in Sheffield, and Sigiyo, of Catcliffe, in Rotherham, would be sentenced on Wednesday, Judge Sarah Wright said as she remanded both men in custody.\nA third defendant, Jacek Brzozowski, now 35, was cleared of the one charge he was facing in the trial, of inciting a child to engage in sexual activity.\nHowever, Brzozowski, of Rawmarsh, Rotherham, admitted a charge of penetrative sexual activity with a child earlier this year.\nHe was bailed and will be sentenced on 14 April.\nThe National Crime Agency (NCA) said the charges related to offences committed in 2011 and 2012, when the two victims were residents in a children's home.\nThe victims described living \"chaotic lives\" they wanted to escape, and Houphouet and Sigiyo took advantage of their vulnerability, giving them cigarettes and alcohol before demanding sex in return, the NCA said.\nThe agency said the victims had been raped \"countless\" times, with one victim reporting being raped two to three times a week by Sigiyo, and once waking up to find him attempting to rape her.\nThe other victim told investigators Houphouet was possessive and once raped her in an act of revenge after finding Brzozowski - his lodger - having sex with her at one of their parties.\nWhile under investigation for rape, Sigiyo approached one of the women on the street and pressured her to tell police he was innocent, the NCA said.\nInstead, she reported the incident, and he was further charged and found guilty of intimidation.", "url": "https://www.bbc.co.uk/news/articles/c5ym60q7gnlo"}