{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:24:15", "date_modify": "2025-05-19 15:24:15", "date_publish": "2017-07-04 00:00:00", "description": "Bringing you the news, sport, travel and weather for Tuesday 4 July 2017", "filename": "news_live_uk-england-devon-40418288_1747668255.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-devon-40418288_1747668255.html", "title": "BBC Local Live: Devon & Cornwall on Tuesday 4 July 2017", "title_page": "BBC Local Live: Devon & Cornwall on Tuesday 4 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nLive updates for Devon and Cornwall have finished for the day, but we'll be back at 08:00 on Wednesday with the latest news, sport, travel and weather.\nDon't forget Spotlight on BBC One later. There will also be news through the night on your BBC Local Radio station.\nFisheries minister 'would keep EU rules to protect dolphins post-Brexit'\nBBC Spotlight\nCamborne & Redruth MP and Fisheries Minister George Eustice has said he would keep EU rules to protect dolphins after Brexit.\nCampaigners said there must be laws in place post-Brexit to protect dolphins from dying in fishing nets and gear.\nA petition to Mr Eustice has reached about 54,000 signatures amid fears most of the protection currently comes from the EU.\nProtest for disabled: 'My daughter was out of education for six months for case to be assessed'\nBBC Radio Cornwall\nA protest has been held outside County hall in Truro to push for better help for disabled children in Cornwall.\nParents said their children were being failed by the health and education systems in the county.\nMichelle Huff said her daughter was out of education for six months while her case was assessed.\nShe said: \"I had to fight to get her into a special school. My daughter should never have had to go through that. It was detrimental to her health and detrimental to mine.\"\nCornwall Council said it recognised the importance in the provision of high quality services to keep children and young people safe, and enabling them to make good or better progress.\nFire crews called to two suspect fires at derelict Newquay hotel\nAmy Gladwell, BBC News Online\nFirefighters in Cornwall were called to the same derelict building twice in less than three days to deal with suspect fires.\nCrews from Newquay, St Columb and Penzance put out a fire this morning after being called to the outbuilding at the former Beresford Hotel in Narrowcliff, Newquay, at about 06:30, external.\nFire crews had to deal with a \"quite big\" and \"substantial\" blaze at the site on Sunday evening, external.\nToday they also had to call in an Environmental Support Vehicle from Penzance, which deals with decontamination, after asbestos was found.\nPolice are investigating the cause of the blazes.\nDevon Iraq veteran's Paralympic dream\nSophie Malcolm\nBBC News Online\nA veteran who lost his leg in an explosion in Iraq has won a world cup race in Spain, beating the world number one.\nTriathlete Steven Crowley won the World Paratriathlon Cup race in Altafulla in Spain.\nBut the cost of paying for his kit, including several different legs for competitions, is proving costly.\nHe is on the hunt for a sponsor and his goal is to represent Great Britain at the Paralympic Games in Tokyo in 2020.\nPaedophile councillor caught by vigilantes\nSian Davies\nBBC News Online\nA former councillor who was caught by a vigilante group as he tried to groom two young girls online has been jailed.\nRalph Sutton, 56 from Combe Martin, in Devon, thought the girls were aged 12 and 13 - but they were fake profiles set up by a self-appointed paedophile hunter.\nWithin hours of making contact he turned the chat to sex and made explicit suggestions to the girls.\nHe admitted five charges, including attempting to incite a child to sexual activity, and was jailed for 30 months.\nSeven vodka bottles seized from six teenagers visiting Newquay\nBBC Radio Cornwall\nSeven bottles of vodka seized from teenagers visiting Newquay were taken from one room with six 16 to 18-year-olds in it, police say.\nInspector Dave Meredith, of Devon and Cornwall Police, said the seizure was made during \"routine checks on various accommodation providers that we know take in 16 to 18-year-olds\".\nInsp Meredith has tweeted what he and other officers found, external, and appealed to parents to \"be responsible\" and not give alcohol to teenagers heading for the resort.\nThe town is expected to see thousands of teenage visitors over the next few months, with many being allowed to travel to Cornwall alone with friends to celebrate the end of exams.\n'Don't climb up or down cliffs,' RNLI warns\nBBC Radio Cornwall\nBeach users should be aware of the hazards involving cliffs and have been strongly advised by the RNLI that they \"don’t attempt to climb up or down the cliffs\".\nThe call, from the St Agnes RNLI crew, comes after they had to assist in rescuing a woman who was seriously injured after falling about 15ft (4.5m) at Trevaunance Point, near St Agnes, on Saturday evening.\nThe St Agnes RNLI Lifeboat, coastguard search and rescue team and paramedics were called to the scene for a rescue operation that took about 90 minutes to complete.\nSt Agnes RNLI operations manager Bruce Baker said: \"Beach users should be aware of the hazards involving cliffs and we would strongly advise that you don’t attempt to climb up or down the cliffs. The rocks can be slippery or unstable and you could easily lose your footing.\"\nPolice commissioner: Alison Hernandez 'should stand down'\nBBC Radio Cornwall\nThe vice chairman of a panel which oversees Devon and Cornwall's elected police and crime commissioner says he \"quite honestly\" thinks she should step down.\nIt follows comments by Conservative commissioner Alison Hernandez on BBC Radio Cornwall's Laurence Reed show last month.\nShe said during the broadcast that she was interested in having a conversation with the chief constable about whether ordinary people with gun licences could assist in a terrorist crisis.\nChris Batters, vice chairman of the Police and Crime Panel, which scrutinises the role of the commissioner, said: \"I think Alison has made various statements - this being one of the major ones - which, at times, should not have made.\"\nWhen asked if she should stand down, he said that, despite her being an \"experienced politician\", that \"quite honestly, I think she should\".\nPlymouth City Council has passed a motion of no confidence in Ms Hernandez, which she said she was \"disappointed about\".\nShe said she didn't want to see armed vigilantes roaming the streets \"but a discussion about how the public responds to any immediate terror threat is completely valid\".\nTunes in the Dunes: Feedback feelers out after overcrowding and poor sound complaints\nBBC Radio Cornwall\nOrganisers of the Tunes in the Dunes music event at Perranporth have asked festival goers to send feedback to them following complaints about overcrowding and poor sound.\nThey said on Facebook, external they understood that some people may not have enjoyed the festival this weekend and they want to hear from them.\nPeople were given free tickets for Saturday and Sunday events after the headline act Primal Scream was cancelled on Friday because of bad weather.\nCall for teenagers to get vaccinated against meningitis and septicaemia\nBBC Spotlight\nParents across Devon and Cornwall are being urged to remind teenagers to get vaccinated against deadly meningitis and septicaemia.\nPublic Health England (PHE) said cases caused by an aggressive MenW strain are on the rise and the MenACWY vaccine was \"the best form of protection against these deadly diseases\".\nThe first 18 months of a MenACWY vaccination programme saw more than two million teenagers receive the vaccine, but there were still many more who needed it, PHE said.\nVaccination was available at GP practices, it added.\nCuldrose helicopter is first aircraft to land on carrier HMS Queen Elizabeth\nAndrew Segal\nLocal Live\nA Merlin helicopter from a Cornwall military base has become the first aircraft to land on the flight deck of the new aircraft carrier, HMS Queen Elizabeth, the Royal Navy says.\nThe 14-tonne RNAS Culdrose aircraft, from 820 Naval Air Squadron, set down on the four-acre deck days after the vessel left Rosyth to begin trials in the North Sea.\nThe ship's commanding officer, Captain Jerry Kyd, said: \"It's an exciting and historic event which marks the beginning of the ship's life as the nation's flagship and the future of carrier-based aviation.\"\nThe squadron will be assigned to HMS Queen Elizabeth throughout the 50-year lifespan of the 65,000-tonne warship.\nBanned head teacher cannot apply for order to be lifted for four years\nAndrew Segal\nLocal Live\nA head teacher from Cornwall banned after being told she showed a \"complete disregard\" for safeguarding her pupils cannot ask for the prohibition order to be set aside for four years, profession bosses say.\nSarah Cooke, former principal of Foxhole Academy, near St Austell, has been banned from teaching indefinitely, external by the education minister from any school, sixth form college, relevant youth accommodation or children’s home in England.\nThe decision came after a National College for Teaching and Leadership (NCTL) panel last month ruled she breached professional standards over a possible safeguarding issue relating to a police caution her husband, Peter, had over stolen underwear.\nHowever, the ruling said that she \"may apply for the prohibition order to be set aside, but not until 30 June 2021\".\nIt added: \"This is not an automatic right to have the prohibition order removed. If she does apply, a panel will meet to consider whether the prohibition order should be set aside. Without a successful application, Mrs Sarah Kate Cooke remains prohibited from teaching indefinitely.\"\nVodka seized by police from teenagers' room in Newquay\nAndrew Segal\nLocal Live\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nNewquay has seen problems with teenagers with alcohol coming into the town at the beginning of the summer previously.\nInsp Meredith's tweet sees the renewal of previous appeals for parents to \"be responsible\" and not give alcohol to teenagers heading for the resort.\nThe town is expected to see thousands of teenage visitors over the next few months, with many being allowed to travel to Cornwall alone with friends to celebrate the end of exams.\nInitiatives including the multi-agency Newquay Safe partnership, external work to prevent underage drinking.\nExeter praise Chelsea conduct in Ampadu move\nJames Law\nBBC Sport Online\nExeter City chairman Julian Tagg says Premier League champions Chelsea have \"behaved impeccably\" in their pursuit of 16-year-old defender Ethan Ampadu.\nWelshman Ampadu joined Chelsea on Saturday, though a fee is yet to be agreed between the two clubs for the player.\n“Chelsea have behaved impeccably throughout the lead up to this point and therefore we are hoping through these negotiations we will avoid the need for a tribunal,\" said Tagg.\n\"However, we – like any other club – will reserve our right to do that should we need to.\"", "url": "https://www.bbc.com/news/live/uk-england-devon-40418288"}