{"authors": ["Jamie Waller", "www.facebook.com"], "date_download": "2025-04-26 03:58:07", "date_modify": "2025-04-26 03:58:07", "date_publish": "2025-03-04 13:22:08", "description": "The complex would be the size of 2,800 football pitches and capable of powering 200,000 homes.", "filename": "news_articles_cvgwnpwe7gpo_1745639887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4df3/live/02ba8da0-f8ee-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwnpwe7gpo_1745639887.html", "title": "Big solar farm planned on Nottinghamshire and Lincolnshire border", "title_page": "Big solar farm planned on Nottinghamshire and Lincolnshire border - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans for a huge solar farm covering the area of 2,800 football pitches have been submitted to the government.\nThe One Earth solar farm would cover 1,600 hectares (3,954 acres) south of Dunham-on-Trent, near East Markham in Nottinghamshire, and stretch over the Lincolnshire border.\nThe facility would be able to generate up to 740MW of electricity - enough energy to power more than 200,000 homes, the Local Democracy Reporting Service, external (LDRS) said.\nThe development, largely covering farmland, would sit across the borders of West Lindsey, Bassetlaw and Newark and Sherwood districts.\nAn application for the scheme has been submitted to the government by PS Renewables and Danish energy company Ørsted.\nThe companies carried out a six-week consultation last year, which they said made residents more accepting of the designs, according to the LDRS.\nThe project has been categorised as a Nationally Significant Infrastructure Project (NSIP) so it will be determined by Ed Miliband, secretary of state for energy security and net zero, rather than the local councils.\nThe LDRS said a decision on the scheme could be made by spring 2026.\nThe solar panels would use a grid connection at the decommissioned High Marnham power station in Nottinghamshire.\nA statement on the project's website said: \"The UK has committed to reducing carbon emissions to net zero by 2050 and fully decarbonising the power supply by 2035.\n\"This means that older forms of power generation, such as the coal-fired power station at High Marnham, are being taken out of use and need to be replaced with renewable energy sources.\n\"That means there is an urgent need for clean, affordable ways of generating energy.\n\"One Earth Solar Farm could make a significant contribution to this goal by producing enough energy for more than 200,000 homes each year.\"", "url": "https://www.bbc.co.uk/news/articles/cvgwnpwe7gpo"}