{"authors": ["Bernd Debusmann Jr", "www.facebook.com"], "date_download": "2025-04-26 04:12:52", "date_modify": "2025-04-26 04:12:52", "date_publish": "2025-03-04 12:18:17", "description": "Mexico accuses US firms of practices that help arm gangs, but the US gun trade association denies wrongdoing.", "filename": "news_articles_cgm1jr9pzw4o_1745640772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e18d/live/03407a30-f864-11ef-b75c-0ba717285eef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1jr9pzw4o_1745640772.html", "title": "Supreme Court sceptical of Mexican lawsuit against US gunmakers", "title_page": "Supreme Court sceptical of Mexican lawsuit against US gunmakers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US Supreme Court appears likely to block a lawsuit by Mexico against US gun manufacturers - who are accused of putting vast arsenals of weapons in the hands of drug cartels.\nIn the long-running lawsuit, Mexico's government argues that the \"flood\" of illegal guns across the border is a result of \"deliberate\" practices by US firms.\nThe gun industry's trade association has denied any wrongdoing and blamed Mexico's government for failing to control crime.\nThe flow of guns from the US to Mexico has recently emerged as a bargaining chip in talks over the implementation of tariffs on Mexican goods entering the US.\nDuring oral arguments on Tuesday, liberal and conservative justices alike expressed scepticism about Mexico's claims that US guns contribute to criminal networks.\n\"What you don't have is particular dealers, right?\" liberal Justice Elena Kagan told the lawyer representing Mexico. \"Who are they aiding and abetting in this complaint?\"\nThe lawsuit, which was first filed in 2021 in a federal courthouse in Massachusetts - where several of the companies are based - argued that the manufacturers knew that guns were being sold to traffickers fuelling violence in the country.\nIt has since become the focus of years of legal wrangling and appeals.\nMexico's fight to sue US gun manufacturers for $10bn\nAccording to Mexican authorities, tens of thousands of US-manufactured guns are trafficking south across the border each year and into the hands of drug cartels, which use them to fight each other and the Mexican government alike.\nSome estimates put the total at over half a million weapons each year.\nThe gun manufacturers, along with support groups such as the National Rifle Association (NRA), have argued that they are legally protected and that a lawsuit would undermine gun rights for Americans.\n\"Mexico has extinguished its constitutional arms rights and now seeks to extinguish America's,\" the NRA wrote in a legal brief filed to the Supreme Court. \"To that end, Mexico aims to destroy the American firearms industry financially.\"\nAt the heart of the gun manufacturers case is a federal law known as the Protection of Lawful Commerce in Arms Act, or PLCAA.\nThe law, enacted in 2005, is designed to protect gun companies from being held liable for the misuse of their weapons by criminals. The Supreme Court case marks the first time the highest court in the US will consider the law.\nIn court on Tuesday, liberal Justice Ketanji Brown Jackson said she thought it was likely the PLCAA means that \"we don't want the courts to be the ones to be crafting remedies that amount to regulation on this industry\".\nThe Mexican lawsuit also suggests that some weapons are being manufactured and decorated specifically to the tastes of cartel members - such as a gold-plated gold pistol known as the \"Super El Jefe\", Spanish for \"the boss\".\n\"Those are all things that are not illegal in any way,\" conservative Justice Brett Kavanaugh said of the argument. \"There are some people who want the experience of shooting a particular type of gun because they find it more enjoyable than using a BB gun.\"\nKavanaugh also expressed concerns that penalising companies for the misuse of their products could ultimately impact other industries, such as pharmaceuticals.\nThe issue of US weapons in Mexico recently emerged as part of last-minute diplomatic manoeuvring over US President Donald Trump's threats to impose 25% tariffs on goods coming from Mexico.\nAs part of a last-minute deal to avoid the tariffs coming into effect on 3 February, Mexican President Claudia Sheinbaum said the US had agreed to increase measures to prevent the trafficking of high-powered US weapons into Mexico.\nOn 14 February, however, Sheinbaum warned that the lawsuit against manufacturers could be expanded if the US designated Mexican cartels as foreign terrorist organisations - a move the administration took just days later.\nTrump's tariffs on goods from Mexico - and from Canada and China - ultimately came into effect on 4 March.\nAt least 25,000 people were murdered last year in Mexico, which has extremely restrictive gun laws. The country is home to only one gun shop, housed in a Mexico City military complex.\nStatistics from the US Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) show that between 2017 and 2022, nearly half of all weapons recovered from crime scenes in Mexico were manufactured in the US.", "url": "https://www.bbc.co.uk/news/articles/cgm1jr9pzw4o"}