{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:48:00", "date_modify": "2025-05-19 14:48:00", "date_publish": "2015-02-26 14:03:07", "description": "A German former nurse, who admitted killing more than 30 patients with lethal drug overdoses, is jailed for life by a court in Lower Saxony.", "filename": "news_world-europe-31646097_1747666080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81263000/jpg/_81263071_nielsh.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31646097_1747666080.html", "title": "German nurse jailed for life for murdering patients", "title_page": "German nurse jailed for life for murdering patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A former nurse who admitted killing more than 30 patients with lethal drug overdoses has been jailed for life by a court in northern Germany.\nThe man, identified as Niels H, 38, was convicted of two counts of murder and attempted murder.\nHe told the court last week he had acted on impulse and apologised to the victims' relatives.\nThe deaths took place at the Delmenhorst clinic, where he worked in intensive care between 2003 and 2005.\nThe former nurse was accused of injecting patients with a medication that should only be used under strict supervision of doctors because it can trigger fatal cardiovascular reactions.\nProsecutors at the district court of Oldenburg said he had been bored and had wanted to practise his - as he himself described them - \"excellent\" resuscitation skills. If his first attempt at resuscitation was successful, they said, he would sometimes make a second attempt.\nA senior doctor heard earlier on in the trial described Niels H as a \"passionate medic\" who had made a good impression on staff at the clinic.\nDoctors did notice, however, that he always seemed to be around when patients were being resuscitated, often assisting junior doctors with the procedure, he added.", "url": "https://www.bbc.com/news/world-europe-31646097"}