{"authors": ["Tim Parker", "www.facebook.com"], "date_download": "2025-04-26 07:37:29", "date_modify": "2025-04-26 07:37:29", "date_publish": "2025-02-27 14:14:40", "description": "There are now two different proposals for consultation on the future of Leicestershire's councils.", "filename": "news_articles_cvgee1zw8zxo_1745653049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c453/live/88c8e0d0-f511-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgee1zw8zxo_1745653049.html", "title": "Rival plans emerge to reorganise Leicestershire", "title_page": "Rival plans emerge to reorganise Leicestershire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Smaller councils have come up with a plan to reorganise themselves to meet government demands for reform.\nThe joint approach by Leicestershire's seven district and borough councils and Rutland County Council looks at how they can make changes \"positive\" for residents, businesses and communities.\nIt follows a plan already developed by Leicestershire County Council which would create one unitary authority for the whole county – something the authority has previously sought to create.\nThe government expects authorities to put in proposals for larger, simpler council structures across existing two-tier council areas like Leicestershire by 21 March.\nThe districts model is for three unitary councils across Leicester, Leicestershire and Rutland. One would serve North Leicestershire and Rutland - currently covered by Charnwood borough - North West Leicestershire district, Melton borough and Rutland County Council.\nA separate council would serve South Leicestershire, currently covered by Blaby district, Harborough district, Hinckley and Bosworth borough and Oadby and Wigston borough councils.\nLeicester city would remain unchanged.\nThe districts and boroughs claim this model would create \"three well-balanced unitary councils serving a similar number of residents, simpler local government structures, so it is easier to understand who does what and councils that are more local, accessible and accountable\".\nLeicestershire County Council has put forward its plan for one council authority across the county. It is built on established boundaries with the city, and excludes Rutland.\nCounty Hall claims its idea would improve services for residents, save money, simplify a confusing system and protect front-line services.\nIt could also unlock devolved powers and funding - giving the authority more money to fix roads and other services, plus new powers to coordinate planning and join-up transport.\nDistricts and boroughs claim the single unitary authority would be \"too cumbersome, remote, and inaccessible for local communities\".", "url": "https://www.bbc.co.uk/news/articles/cvgee1zw8zxo"}