{"authors": ["Imran Qureshi", "Cherylann Mollan", "www.facebook.com"], "date_download": "2025-04-26 04:27:17", "date_modify": "2025-04-26 04:27:17", "date_publish": "2025-03-03 10:54:53", "description": "The Mitr Clinic in Hyderabad offered medical care to thousands of transgender people in India.", "filename": "news_articles_c62zvlgqzdpo_1745641637.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ca6/live/78f71850-f801-11ef-8de2-8721900e2019.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zvlgqzdpo_1745641637.html", "title": "USAID cuts shutter India's first clinic for transgender people", "title_page": "Hyderabad: USAID cuts shutter India's first clinic for transgender people - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "India's first medical clinic for transgender people has shut operations in three cities after US President Donald Trump stopped foreign aid to it.\nMitr (friend) Clinic, which was started in 2021 in the southern city of Hyderabad, offered HIV treatment, support and counselling services to thousands of transgender people.\nTwo more Mitr Clinics in Thane and Pune cities in western India, which were established the same year, have also shut down due to the aid cut.\nIn January, Trump signed an executive order pausing all foreign aid for 90 days, pending a review.\nTrump has said he wants overseas spending to be closely aligned with his \"America First\" approach.\nHis crackdown on USAID, the US agency overseeing humanitarian aid to foreign countries since the 1960s, has been seen as a step to this end.\nThe pausing of USAID funds has affected dozens of development programmes all around the world, especially in poor and developing countries.\nIn India, the shutting down of the Mitr Clinics has impacted the transgender community's access to crucial medical support.\nThe project came into existence under the US President's agency for AIDS Relief (PEPFAR) in 2003 when George Bush was president. John Hopkins University worked in collaboration with USAID and the Indian government to set it up.\nA staff member who spoke on condition of anonymity to BBC Hindi said the three clinics catered to some 6,000 people and about 6% to 8% of the patients were being treated for HIV.\n\"All these cases were below 30 years of age. And 75% to 80% of this population was accessing health services for the first time,\" this staff member said.\nIn Hyderabad, the Mitr Clinic offered care to 150 to 200 transgender patients each month, many of whom suffered from HIV. The clinic had a small team of doctors, psychologists and technical staff.\n\"We were receiving 250,000 rupees ($2900; £2300) every month to provide services,\" Rachana Mudraboyina, a trans woman who was in-charge of the clinic, told BBC Hindi.\nThe news of the clinic's closure has come as a blow to the community.\nVyjayanti Vasanta Mogli, a trans woman who has visited the clinic, told The Indian Express newspaper that she was \"devastated\" by the news as the clinic used to offer treatment at subsidised rates.\nAnother trans woman, who was hoping to use the clinic's services, told the Express that she was sad that she would no longer be able to do this.\nIndia is estimated to have around two million transgender people, though activists say the number is higher. Despite a 2014 Supreme Court ruling that gives them the same rights as people of other genders, many still struggle to access education and healthcare due to stigma and discrimination.\nThere are state-run and private hospitals that offer medical help to the community, but many say they prefer going to Mitr Clinics because they find it more affordable and inclusive.\n\"Transgender people are not treated properly in general hospitals,\" Rachana says, explaining why the Mitr Clinics were so important for the community.\nTrump's order freezing foreign aid has been criticised by many.\n\"USAID has made significant contributions in health and education and shutting it down is bound to have an impact on developing countries,\" Bubberjung Venkatesh, a lawyer, told BBC Hindi.\n\"It's a big blow. Its support for HIV prevention was significant,\" he added.\nLast Thursday, the Trump administration said, external it was going to eliminate more than 90% of USAID's foreign aid contracts. This means that very few projects will survive and the Mitr Clinics are unlikely to be among them.\nElon Musk, a close aide of Trump who also heads a government department in charge of slashing federal spending and jobs, has criticised funding projects for transgender people.\n\"That's what American tax dollars were funding,\" Musk said in a post on X (formerly Twitter) on Friday in response to a post about the closure of the Mitr Clinics.\nMeanwhile, staff at the clinic say they are looking for funding from other sources and hope that the state government will step in to help.\n\"We did a lot more than just provide medical help. The clinic also provided us a space to interact with the community, to share advice about various government schemes and health facilities,\" Rachana says.\n\"We want to continue [running the clinic] and are trying our best to find donors,\" she adds.", "url": "https://www.bbc.co.uk/news/articles/c62zvlgqzdpo"}