{"authors": ["Olivia Copeland", "www.facebook.com"], "date_download": "2025-04-26 06:36:49", "date_modify": "2025-04-26 06:36:49", "date_publish": "2025-02-26 06:43:30", "description": "The National Education Union representative says the teacher shortage is more acute in the island.", "filename": "news_articles_c1lpn7d42mno_1745649409.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c107/live/610e68d0-f2c8-11ef-8f01-fb4843bea627.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1lpn7d42mno_1745649409.html", "title": "Teacher recruitment and retention leading to stress", "title_page": "Teacher recruitment and retention leading to stress - union  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Recruiting and retaining teachers in Guernsey was a challenge due to the lack of available housing and the cost of living, according to Guernsey's local representative for the National Education Union (NEU).\nPaul Montague said the worldwide shortage of teachers was felt more acutely in the island, where covering for vacancies was putting \"a lot of stress\" on existing staff.\nDeputy Andrea Dudley-Owen, President of Education, Sport and Culture, said the latest online recruitment campaign was receiving \"a really good level of interest\".\nHowever, she said the housing crisis remained a problem for teachers, despite help with rent from the government.\nMr Montague said despite the committee for education's efforts, teachers were still feeling the pressure of a shortage of staff.\n\"We keep hearing positive things,\" he said.\n\"We keep hearing that things are getting better but it is often a case of 'jam tomorrow' and we're just waiting to see if that really does come to pass.\"\nHe said the knock-on effect of increased responsibility on individuals was leading to staff taking sick leave for stress.\n\"We know of a number of situations where teachers are having to cover for absent colleagues and they're having to do a lot of extra work. It puts a lot of stress on them,\" Mr Montague said.\nTeachers who relocate to Guernsey from off-island are eligible for rent allowance, external, if their accommodation costs more than £185 per week.\nMr Montague said in spite of this, the cost of living remained an issue and teaching needed to become a more attractive career in terms of income and working environment, to retain teachers for longer.\nHe said the high turnover has a negative impact on student attainment.\n\"One of the major problems we've got in the secondary sector especially in terms of youngsters' progress in any subject is that we've got a massive turnover of teachers.\n\"Teacher turnover really causes massive problems for youngsters' progress. I speak to youngsters who've really fallen out of love with subjects they struggle with because they don't have that relationship with a teacher.\"", "url": "https://www.bbc.co.uk/news/articles/c1lpn7d42mno"}