{"authors": ["Jamie Whitehead and Francesca Gillett", "www.facebook.com"], "date_download": "2025-04-26 07:28:11", "date_modify": "2025-04-26 07:28:11", "date_publish": "2025-02-27 19:28:37", "description": "The documentary was pulled last week after it emerged its 13-year-old narrator was the son of a Hamas official.", "filename": "news_articles_c07zz5937llo_1745652491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7fbe/live/0dba7410-f540-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zz5937llo_1745652491.html", "title": "BBC apologises for 'serious flaws' over Gaza documentary", "title_page": "BBC apologises for 'serious flaws' over Gaza documentary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The BBC has apologised and admitted \"serious flaws\" in the making of a documentary about children's lives in Gaza.\nThe documentary, Gaza: How to Survive a War Zone, was pulled from iPlayer last week after it emerged its 13-year-old narrator was the son of a Hamas official.\nIt said it has \"no plans to broadcast the programme again in its current form or return it to iPlayer\".\nHoyo Films, the production company that made the documentary for the BBC, said it felt it was \"important to hear from voices that haven't been represented onscreen throughout the war with dignity and respect\".\nThe company added it was \"cooperating fully\" with the BBC to \"help understand where mistakes have been made\".\nThe BBC removed the documentary after concerns were raised that it centred on a boy called Abdullah who is the son of Hamas's deputy minister of agriculture. Hamas is proscribed as a terrorist organisation by the UK and others.\nIt also launched a review into the film, and the BBC's Board met earlier on Thursday to discuss it.\nIn the statement, a BBC spokesperson said both the production company and the BBC had made \"unacceptable\" flaws and that it \"takes full responsibility for these and the impact that these have had on the corporation's reputation\".\nIt added the BBC had not been informed of the teenager's family connection in advance by the film's production company.\nThe spokesperson says: \"During the production process, the independent production company was asked in writing a number of times by the BBC about any potential connections he and his family might have with Hamas.\n\"Since transmission, they have acknowledged that they knew that the boy's father was a deputy agriculture minister in the Hamas government; they have also acknowledged that they never told the BBC this fact.\n\"It was then the BBC's own failing that we did not uncover that fact and the documentary was aired.\"\nHoyo Films have told the corporation that they paid the young boy's mother \"a limited sum of money\" for narrating the film via his sister's bank account, the BBC statement added.\nIt said Hoyo assured the BBC that no payments were made to any members of Hamas or its affiliates \"either directly, in kind or as a gift\", and that it is seeking \"additional assurance\" around the programme's budget.\nIn its statement, Hoyo added: \"We feel this remains an important story to tell, and that our contributors – who have no say in the war – should have their voices heard\".\nA full audit of the expenditure on the film will be undertaken by the BBC, and it will be asking for the relevant financial accounts of Hoyo Films so this can be carried out.\nThe BBC spokesperson said the incident had \"damaged\" the trust in the Corporation's journalism - and \"the processes and execution of this programme fell short of our expectations\".\nThey added the director-general of the BBC had asked for complaints to be expedited to the Executive Complaints Unit, \"which is separate from BBC News\".\nA separate statement from the BBC Board added: \"The subject matter of the documentary was clearly a legitimate area to explore, but nothing is more important than trust and transparency in our journalism. While the board appreciates that mistakes can be made, the mistakes here are significant and damaging to the BBC.\"\nPrime Minister Keir Starmer was asked about the film during a press conference with US President Donald Trump on Thursday, saying he had been \"concerned\" about it, adding that \"the secretary of state has had a meeting with the BBC\".\nOn Friday, Culture Secretary Lisa Nandy said she was going to have an \"urgent meeting\" with the BBC chair Samir Shah later that day.\nShe said the BBC had \"acknowledged serious failings\" by them and the production company Hoyo Films.\n\"I want assurances that no stone will be left unturned by the fact-finding review now commissioned by the BBC's director general,\" she said.\n\"This review must be comprehensive, rigorous and get to the bottom of exactly what has happened in this case. It is critical for trust in the BBC that this review happens quickly, and that appropriate action is taken on its findings.\"\nEarlier this week, the BBC was criticised for pulling the programme by more than 500 media figures, including Gary Lineker, Anita Rani and Riz Ahmed.", "url": "https://www.bbc.co.uk/news/articles/c07zz5937llo"}