{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:39:21", "date_modify": "2025-04-26 03:39:21", "date_publish": "2025-03-04 20:46:30", "description": "The painting sold to a private buyer at auction in London the day after it was confirmed Vettriano had died aged 73.", "filename": "news_articles_cn7vd63z2zpo_1745638761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b4ad/live/bd25d8c0-f9ac-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vd63z2zpo_1745638761.html", "title": "Banksy take on Scottish artist Vettriano's work sells for £4.3m", "title_page": "Banksy take on Scottish artist Vettriano's work sells for £4.3m - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Banksy reimagining of a work by the late Scottish painter Jack Vettriano has sold at auction for £4.3m ($5.4m).\nCrude Oil (Vettriano) was put up for sale by Blink 182 bassist Mark Hoppus, who acquired the painting in 2011.\nIt depicts the Fife-born artist's best known work, The Singing Butler, which features a couple dancing on a storm-swept beach accompanied by their butler and maid, but with two figures in yellow hazmat suits disposing of an oil drum in the background.\nThe sale to a private collector at Sotheby's in London on Tuesday evening came just days after Vettriano was found dead aged 73 at his apartment in France.\nThe work was initially projected to fetch between £3m and £5m in the sale.\nThe entirely hand-painted work, created using oil and spray paints, was first exhibited in 2005.\nIt was initially placed in a disused shop window in Notting Hill in full view of passers-by.\nVettriano's original version sold at Sotheby's in 2004 for £744,800 – the highest price for any Scottish artwork sold at auction at the time.\nHoppus bought the painting following a visit to the Museum of Contemporary Art (Moca) in Los Angeles.\nHe described it as \"unmistakeable,\" adding that he and wife Skye \"fell in love\" with the work from the moment they saw it.\nA portion of the funds raised will go towards supporting the charities Children's Hospital Los Angeles, Cedars Sinai Haematology Oncology Research.\nThe couple will also donate some of the proceeds to the California Fire Foundation following the devastating wildfires which destroyed parts of the city earlier this year.\nHoppus said: \"We loved this painting since the moment we saw it. Unmistakably Banksy, but different. We bought it because we loved it. It's borne witness to our family over these past dozen years.\n\"It hung over the table in London where we ate breakfast and our son did his homework. It hung in our living room in Los Angeles. It's seen laughter and tears and parties and arguments. Our son has grown up in front of it.\n\"This painting has meant so much to us and been such an amazing part of our lives, and now I'm excited for it to be out there in the world, seen by as many as possible.\"\nVettriano was found dead at his apartment in Nice on Saturday. His publicist confirmed his death on Monday.\nThere were no suspicious circumstances around his death, police in Southern France said.\nThe artist was self-taught after being gifted watercolour paints for his 21st birthday.\nHis breakthrough came in 1989 when he submitted two paintings to the Royal Scottish Academy's annual show and both sold on the first day, inspiring him to become a full-time artist.\nHis works later garnered international acclaim, leading to exhibitions in cities including London, Hong Kong, Johannesburg and New York.", "url": "https://www.bbc.co.uk/news/articles/cn7vd63z2zpo"}