{"authors": ["Charlotte Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 03:55:26", "date_modify": "2025-04-26 03:55:26", "date_publish": "2025-03-04 16:09:28", "description": "A games arcade and new flats are approved for the building, and plans are submitted for next door nightclub.", "filename": "news_articles_c07zd13y91yo_1745639726.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02c0/live/905e67f0-f90a-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zd13y91yo_1745639726.html", "title": "Kingston: Arcade with alcohol licence to take over Wilko building", "title_page": "Kingston: Arcade with alcohol licence to take over Wilko building - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The future of a prominent retail space in the town centre of Kingston, south London, has been confirmed by the local council.\nThe former Wilko store in the four-storey building on the junction of Clarence Street and Old London Road shut in August 2023 when the high street chain went bust.\nKingston Council has now approved plans to turn the empty space in the basement and ground floor of the building into a games arcade.\nThe leisure business will be operated by entertainment company FunBox Ltd and will have activities including skittles, pool, bowling, snooker, golf, darts, shuffleboard, cricket and virtual reality games.\nThe venue will also serve food and alcohol from 12:00 to midnight on Sundays to Thursdays, and until 01:00 on Fridays and Saturdays.\nThe closure of Wilko put on hold plans, approved by the council in 2022, to convert the building's upper floors into housing.\nIt is now set to go ahead, with a separate housing scheme to extend the building by three storeys to provide 56 new flats once completed, including four affordable homes.\nPlans for the neighbouring building have also been submitted, in an attempt to attract late-night revellers.\nThe current PRZYM nightclub would be divided into a \"party bar\" on the ground floor and a nightclub on the upper two storeys.\nThe council will decide on those plans in due course.", "url": "https://www.bbc.co.uk/news/articles/c07zd13y91yo"}