{"authors": ["Jamie Waller", "www.facebook.com"], "date_download": "2025-04-26 06:56:17", "date_modify": "2025-04-26 06:56:17", "date_publish": "2025-02-28 15:05:08", "description": "West Lindsey District Council wants to redevelop the former home of the Dambusters squadron.", "filename": "news_articles_cpq22r35717o_1745650577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a38/live/226451d0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq22r35717o_1745650577.html", "title": "RAF Scampton: West Lindsey District Council hopes to buy site by November", "title_page": "RAF Scampton: West Lindsey District Council hopes to buy site by November - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council leader says an \"extremely positive\" meeting was held with the government, which could result in the authority buying RAF Scampton by November.\nThe former home of the Dambusters squadron is owned by the Home Office but plans to use it for asylum seeker housing by the previous government were scrapped in September.\nWest Lindsey District Council leader Trevor Young and other local leaders met with Dame Angela Eagle, minister for border security and asylum, in Westminster on Wednesday.\nThe authority hopes to buy the site in a deal which it says would unlock £300m of investment for the area, but there could be competition from other parties.\nYoung told the Local Democracy Reporting Service: \"We have come away feeling extremely positive – our case was well-received.\n\"We put forward a very good argument across as to why the council should be allowed to buy the site, to protect the heritage and bring the £300m of investment.\"\nHowever, Young said it was \"a little bit frustrating\" that the government wanted to put the site on the open market and said the local council should be \"the preferred bidder\".\nIt is almost two years since the council first unveiled its designs for the site, which would be carried out with its partner Scampton Holdings Ltd.\nThe plans would see the 800-acre location used for aviation, heritage, tourism, education and research.\nHowever, they were blocked when plans to house asylum seekers at Scampton were announced.\nThe former base is seen as vital due to its historic connections with the famous 617 Squadron and its economic potential relating to defence, air and space.\nThe Dambusters is the most famous wartime RAF squadron following its Operation Chastise mission in World War Two to destroy German dams using the bouncing bomb.\nThe council launched its bid to buy the site in December, after the government scrapped the plan to use the former base as an asylum centre.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cpq22r35717o"}