{"authors": ["Lucy Adams", "www.facebook.com"], "date_download": "2025-04-26 04:02:43", "date_modify": "2025-04-26 04:02:43", "date_publish": "2025-03-03 22:52:54", "description": "The teacher said the allegation spread quickly and the \"catastrophic\" impact affected every area of his life.", "filename": "news_articles_c1lpd1j429vo_1745640163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3054/live/4cd4b280-f84e-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1lpd1j429vo_1745640163.html", "title": "Teacher's life ruined after he was falsely branded a paedophile", "title_page": "Teacher's life ruined after he was falsely branded a paedophile - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mark had been a teacher for years when he was wrongly accused of being a paedophile by a pupil.\nThe allegation spread quickly – and he says the \"catastrophic\" impact affected every area of his life.\nDespite no wrongdoing being found, the school suggested that Mark – whose name we have changed to protect his identity – should go home.\nHe says he has not slept through the night once since then and has considered taking his own life. He also went off sick with stress.\nMark told BBC Scotland News that the worst thing was not the accusation but the lack of support and consistency from his headteacher and council employers.\n\"A pupil called me a paedophile, and I felt the school's reaction to that was unbalanced,\" he says.\n\"Then another pupil called me a paedophile, and another. Within a short space of time it was an epidemic.\"\nHe says that through a combination of social media and word of mouth things escalated quickly and got out of control.\n\"The impact was catastrophic, absolutely catastrophic,\" he says.\n\"I felt cast aside and devalued… There is not a corner of my life that has not been affected.\"\nMark says policies need to come into the 21st Century to understand how pupils can use digital media to \"weaponise their attacks on teachers\".\nHe is not the only teacher to have been targeted by unfounded allegations of this kind.\nThe NASUWT teaching union carried out a survey in which 500 of its members responded to questions about behaviour in schools over the last 12 months.\nAbout 80% said they had experienced verbal abuse, and a similar number thought violent and abusive behaviour had increased.\nIndividual teachers said they had been assaulted, bitten, spat on, had fireworks thrown at them and had their cars vandalised.\nSeveral said they, like Mark, had wrongly been accused of being paedophiles by pupils.\nAbout 45% of the teachers said they had considered leaving teaching in the past 12 months and 63% had experienced stress.\nLast summer, the Scottish government published a national action plan on behaviour in schools amid rising concerns about violence in schools.\nBut the union says most councils have not even discussed the action plan with teachers.\nEducation Secretary Jenny Gilruth said the survey told \"a concerning story of the nature of behaviour in Scottish schools, particularly post-pandemic\".\nShe told BBC Scotland News: \"The issues that give me great concern are around the number of schools without behavioural management policies in place.\n\"I will be writing to all directors of education around the country seeking assurances that those policies are in place to support staff in relation to bad behaviour.\"\nFigures published by the government in 2023 found an increase in violent incidents in schools. The Scottish Summary of Behaviour in Scottish Schools, external found a significant increase in teachers reporting difficult behaviour.\nRod McCready, the NASUWT national executive member for Scotland, said teacher stress levels were becoming unmanageable in the schools where they felt unsupported.\nHe said swearing and bad behaviour had become accepted and normalised without any consequences in some schools.\nSome teachers described conditions as \"like being in the frontline of war\".\nSo what is the solution?\nMr McCready believes that the school where he has taught for 20 years, St Andrew's RC Secondary in the east end of Glasgow, is an example of best practice.\nSt Andrew's is renowned for its strong and consistent policies on behaviour, and for high results.\nHead teacher John McGhee says that having values which are adopted by absolutely everyone in the school is key, alongside training for staff and a consistent, supportive approach by managers.\nMr McGhee says he is clear that actions have consequences and that pupils need to understand that their behaviour can lead to them being removed temporarily from the class.\n\"A teacher will have stepped through a number of consequences and warnings before it gets to that stage,\" he says.\n\"If it's got to the point where a teacher is unable to continue in a class and needs to seek support they would come to a head teacher or a depute head and we would remove that child from the class to have a conversation with them about what's behind all of this.\"\nMr McGhee says that child would have to get themself back into the class - and would not be able to return without an apology.\n\"They can't just walk back in without some form of restoration of the situation.\n\"One of our school values is forgiveness. We've got to live and we've got to breathe it.\n\"Then young people need to understand that forgiveness can be sought - but there has to be something on the side of forgiveness about them saying sorry.\"\nThe Scottish government said violence and abusive behaviour were \"completely unacceptable\" in schools and that the national behaviour action plan was a response to growing concerns from teachers and parents about behaviour.\nA progress update on the plan is expected in the coming weeks\nThe spokesperson said ministers would work with councils \"in our continued joint efforts to raise awareness of the national action plan, and, importantly, to ensure the plan drives the improvements we all want to see in Scotland's schools\".\nCouncil umbrella body Cosla said local authorities took the issue of safety in schools extremely seriously.\nCouncillor Tony Buchanan said the first stage of the action plan was focused on setting expectations and clarifying approaches, which had involved new Scottish government guidance across a range of subjects.\n\"Schools and local authorities will be considering this guidance in the weeks and months ahead,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c1lpd1j429vo"}