{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:24:00", "date_modify": "2025-04-26 04:24:00", "date_publish": "2025-03-03 12:49:52", "description": "Jordan Chiedozie was heading home from a game when he was hit by a car on the M27's hard shoulder.", "filename": "news_articles_c3w1d3g54xjo_1745641440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7124/live/514f2170-f82a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w1d3g54xjo_1745641440.html", "title": "Bashley footballer Jordan Chiedozie says career over after crash", "title_page": "Bashley footballer Jordan Chiedozie says career over after crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A footballer hit by a car on the hard shoulder of a motorway after stopping to change a tyre says his career in the game is over.\nJordan Chiedozie was seriously injured on the M27 near Ower, Hampshire, on 1 February.\nThe 30-year-old, who plays for Southern League club Bashley, said he was lucky to be alive and was \"truly grateful to everyone who has helped me\".\nBut added: \"Unfortunately my football career is over and my life has changed forever.\"\nIn a statement released by the club, Chiedozie said he was still being treated in hospital, with hopes to return home soon.\n\"I'm lucky to be alive thanks to all the surgeons, nurses and emergency teams whose work has been so brilliant since the accident happened,\" he said.\n\"I will never be able to thank everyone personally, but I am truly grateful to everyone who has helped me.\n\"I'm overwhelmed by all of it to be honest and can't believe the amount of kindness and support I've had. Whatever the future holds I will forever be a Bashley fan.\"\nChiedozie was returning home with the club's physio Reighan Taylor following the team's match against Tavistock in Devon when he was hit between junctions 2 and 3 on the eastbound carriageway of the motorway.\nThey had pulled on to the hard shoulder after a tyre blew out.\nMany football clubs have organised matchday collections along with a online fundraiser to help the self-employed striker, who works in the building industry.\nMore than £32,000 has been raised for the player who started his career at Bournemouth.\nBashley chairman Steve Lewis said: \"The response... has been amazing, not only from our own club and fans, but from all over the country.\n\"The 'football family' has certainly rallied round, and, like Jordan, we are truly grateful for that,\" he said.\nA 44-year-old woman, from Wraysbury in Berkshire, was arrested on suspicion of drink driving and causing serious injury by dangerous driving and was later bailed until 1 May.", "url": "https://www.bbc.co.uk/news/articles/c3w1d3g54xjo"}