{"authors": ["Tony Fisher", "www.facebook.com"], "date_download": "2025-04-26 06:20:57", "date_modify": "2025-04-26 06:20:57", "date_publish": "2025-03-01 06:19:55", "description": "Barbara Tite says she continues to suffer and has dreams of being buried alive since the incident.", "filename": "news_articles_c15qqez39l3o_1745648457.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/39ca/live/100f3e70-f5cd-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qqez39l3o_1745648457.html", "title": "Woman recalls 'nightmare' of waking up during surgery", "title_page": "Woman recalls 'nightmare' of waking up during surgery in Milton Keynes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who woke up during an operation after not receiving enough anaesthetic has described the experience as \"frightening, scary and horrific\".\nBarbara Tite, 67, said the accidental awareness, external happened at Milton Keynes General Hospital in June 2024 when she had successful surgery for a perforated bowel.\nShe said it caused her continued undue stress and she was seeking compensation.\nA spokesperson for Milton Keynes University Hospital said they were \"very sorry\" for the \"distress\" she experienced.\nListen: MK woman recalls waking up during surgery\nMrs Tite recalled going in for the surgery and being sedated.\n\"Next thing I knew I was aware,\" she said. \"It was anaesthesia awareness. You know what is going on around you but you are completely frozen.\"\nShe described the experience as like being \"buried underground\" and the \"worst nightmare - the sort of thing horror movies are made of\".\nMrs Tite said she managed to move her right hand to alert the doctors and they upped the anaesthetic.\nMrs Tite was badly injured over 20 years ago in a head on crash on the A5 in Buckinghamshire involving another car which was being pursued by police.\nIn total, over the course of her life, she said she had more than 40 operations, was diagnosed with a brain tumour in 2017, and \"never had a moment where anything became a reality on the operating table\".\nShe said the accidental awareness incident had brought on post traumatic stress disorder (PTSD), and she was seeking compensation as well as specialist help for the PTSD.\nA spokesperson for Milton Keynes University Hospital said: \"We are very sorry that Mrs Tite experienced distress when she was in our care last June. Every patient should feel safe when they are in our hospital.\n\"We believe that she experienced a sense of awareness as she was emerging from anaesthetic at the end of her operation, and fully acknowledge how difficult this was for her, especially in light of her past history.\n\"Acute providers, such as hospitals, do not offer the counselling that Mrs Tite seeks, and we have outlined how she can access this support.\n\"We are always here to discuss this matter further with Mrs Tite.\"", "url": "https://www.bbc.co.uk/news/articles/c15qqez39l3o"}