{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 04:31:48", "date_modify": "2025-04-26 04:31:48", "date_publish": "2025-03-03 06:08:21", "description": "The Chamber of Commerce president says firms are \"tightening belts\" so the government should too.", "filename": "news_articles_cy0ddr75y11o_1745641908.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ca88/live/797a3c20-f5be-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy0ddr75y11o_1745641908.html", "title": "Lobby group backs Isle of Man government's drive for efficiencies", "title_page": "Lobby group backs Isle of Man government's drive for efficiencies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A drive to make efficiencies and streamline services in a bid to reduce the Manx government's spending has been backed by the president of a business lobby group.\nTreasury Minister Alex Allinson recently revealed his financial plan for 2025-26, which saw department's budgets rise, while drawing down £110m from reserves.\nClaire Watterson from the Isle of Man Chamber of Commerce said businesses were \"tightening their belts\" and \"we need to see government doing the same thing\".\n\"Tough conversations\" were also needed about which services were essential so key infrastructure, which attracts and keeps recruits on island, were protected, she said.\nThe chamber previously said some measures in Allinson's budget, such as a 1% decrease in the higher rate of personal income tax, were \"steps in the right direction\" but more could have been done for businesses.\nMs Watterson said firms were having to adapt due to rising costs such as utilities and the overall cost of living, which were \"things the budget didn't directly address\".\nUrging government to continue to explore ways to reduce costs and improve efficiencies, she said it had been \"wonderful\" the government had provided all that it had in the past, but questioned if that approach was \"right in this day and age\".\nBut the chamber president said protecting funding for cornerstone services such as health and education would help to encourage future recruits to move to the Isle of Man and settle.\nWhile most government departments have been given an uplift of 2% on pay costs and a further 1% on non-pay costs, the budget of the Department of Health and Social Care includes a 5.3% uplift for Manx Care.", "url": "https://www.bbc.co.uk/news/articles/cy0ddr75y11o"}