{"authors": ["Gerry Bradley and Mike McBride", "www.facebook.com"], "date_download": "2025-04-26 06:20:00", "date_modify": "2025-04-26 06:20:00", "date_publish": "2025-03-01 07:00:28", "description": "Award-winning Irish novelist and playwright Jennifer Johnston died earlier this week at the age of 95.", "filename": "news_articles_c9deej59g6po_1745648400.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e09c/live/bb0afa20-f4ed-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deej59g6po_1745648400.html", "title": "Jennifer Johnston: A 'literary giant' and Dublin-born Derry girl", "title_page": "Jennifer Johnston: A 'literary giant' and Dublin-born Derry girl  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The award-winning Irish novelist and playwright Jennifer Johnston, who died aged 95 on Tuesday, was born in Dublin but adopted Londonderry as her home.\nThe Booker-nominated author moved to Derry in the 1970s and would remain there for more than 40 years.\nShe lived with her second husband David Gilliland in Brook Hall, an imposing 18th Century demesne on the Culmore Road, overlooking the River Foyle.\nHer eldest son, Patrick Smyth, told BBC News NI her life in Derry was a whole new chapter and she \"embraced its cultural life\".\nAmong her new friends were Brian and Anne Friel, John and Pat Hume, Denis Bradley - the former priest who acted as a secret \"backchannel\" between the IRA and the government - and \"half the taxi drivers of the city\", he said.\n\"She revelled in her work with the arts council and school and public readings, and took great pride in her visits to prisoners in the Maze.\n\"Her writing, notably Shadows on our Skin, reflected a deep commitment to cross-community reconciliation.\"\nPatrick said she passed on to her children a love of life, of curiosity, of fun, a need to challenge and a love of books.\n\"She once told an interviewer about her own childhood: 'We read real books, right from the age of four up to 17. We also read history books. But it always seemed to me that history books were written by people who were trying to explain some enormous mess that we'd all got into but were never going to be able to explain. Whereas novelists can explain things in their own way. That's why it's so important that children read.'\n\"That is how we hope she will be remembered,\" he said.\nDavid Gilliland's son Philip said the couple entertained at Brook Hall.\n\"There was nearly always somebody else at the kitchen table,\" he said.\n\"They sought out anybody who they thought was interesting and who thought their own thoughts; people from the literary world and not.\"\nHe said that, when she married his father and moved to Derry she \"made his home her home\".\n\"I would say it's where the bulk of her work was written. The house was something of a sanctuary from what was going on in the real world in Derry at that time,\" he added.\nPhilip said Brook Hall lent itself to being both a tranquil study, and at other times - particularly holiday times - the \"perfect place for large and lively gatherings of the two families\".\nHowever, as Shadows on our Skins shows - she was \"far from immune from what was going on in the real world\".\n\"Because she didn't drive, she struck up great relationships with Derry's taxi-men, who were universally kind to her.\n\"They will miss her, too, like the rest of us.\"\nClose friend Mary Murphy described her as having a deep love for the city and its people, being happy to call the place home for so long.\nShe told BBC Radio Foyle's Mark Patterson Show that an \"evening with Jennifer would have you going from being stimulated intellectually and philosophically one minute and the next, you would be bent over laughing\".\nJohnston was known for exploring themes like Anglo-Irish identity and the Troubles.\nHer novel Shadows on Our Skin - set in Derry in the 1970s - was shortlisted for the Booker Prize in 1977.\nIt followed Joe Logan, who grew up in the Bogside, navigating teenage life against a backdrop of bombs and bullets and was later made into a film, with local boy Macrea Clarke as Joe.\nHow Many Miles to Babylon?, the story of an unlikely friendship between two boys from different social backgrounds during World War One, remains a set text for English literature students.\nJennifer Prudence Johnston was born in 1930 and lived variously in Donnybrook - the family home - Paris, London, Derry and Dún Laoghaire.\nHer father was the famous playwright and war correspondent Denis Johnston and her mother was the acclaimed actress Shelah Richards.\nShe met her first husband Ian Smyth, who was a fellow student at Trinity College Dublin in the 1940s, and they lived in London, where they had four children.\nLater, after her divorce, she married lawyer David Gilliland, with whom she lived in Derry, before eventually moving back to Dublin.\nBBC presenter Marie-Louise Kerr, who interviewed Johnston, had a memorable experience when she went down to meet her at Brook Hall in the 1990s.\n\"This was all pre-mobile phones, so I arranged a time with her, and I drove down this extraordinary windy driveway to a house at the bottom which was overlooking the Foyle,\" Kerr said.\n\"When I got there, all I could see were these two massive dogs - and I mean massive - I was so terrified.\n\"I saw Jennifer come to the door and she shouted: 'They're fine, they're only babies - come in,' so I had to trust her. It was genuinely a trust walk, because they certainly didn't look like babies to me.\"", "url": "https://www.bbc.co.uk/news/articles/c9deej59g6po"}