{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 03:55:42", "date_modify": "2025-05-21 03:55:42", "date_publish": "2025-01-15 00:00:00", "description": "Saoirse Ronan and Hugh Grant make surprise appearances on the shortlist, ahead of the awards ceremony next month.", "filename": "news_live_c2k5x0yx8qdt_1747799742.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c2k5x0yx8qdt_1747799742.html", "title": "Conclave and Emilia Pérez lead Bafta nominations but Daniel Craig misses out", "title_page": "Conclave and Emilia Pérez lead Bafta nominations but Daniel Craig misses out - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stay tuned for more to come next month\nAdam Goldsmith\nLive reporter\nThe end of the nomination announcements marks the start of preparations for this year’s Baftas ceremony as the jury gets to work deciding its picks.\nThe prestigious awards night will take place on 16 February, with host David Tennant handing out the prizes to the eventual winners.\nWe’ve had some surprises this morning; Wicked misses out on a chance to secure a spot for best film.\nAt the same time, films like Emilia Pérez and Conclave, which performed well on longlists, secured 11 and 12 nominations for a Bafta respectively.\nBritish Academy members will vote on the shortlists for each category - here’s a round-up of who they’ll be choosing from.\nIf you’re not among the lucky few who will be in the room at London’s Royal Festival Hall in February then we’ll see you back here to find out all the winners and losers - we’ll bring the popcorn.\nConclave turns Pope's election into political thriller\nCaryn James\nfilm critic, BBC Culture\nBased on a bestselling novel by Robert Harris, Conclave imagines what goes on behind the scenes of the secretive process – complete with scheming, smearing and leaking.\nAs rival factions of cardinals manoeuvre to elect the next pope, the US Cardinal Bellini (Stanley Tucci) rejects a suggestion that he use stolen documents to smear a rival.\nHis decision is not entirely on moral grounds. \"I'd be the Richard Nixon of popes,\" he says, in a scene that captures the savvy plot, the wit and the colourful characters in Conclave.\nThe film takes us behind the scenes of the secretive, ritualised process that happens in the Vatican after a pope dies, but it plays like a bracing, contemporary political thriller.\nRead Caryn James's full piece\nTwo pop princesses nominated for supporting actress\nSteven McIntosh\nEntertainment reporter\nTwo huge pop stars have been nominated in the best supporting actress category.\nSelena Gomez is nominated for her role in Emilia Pérez, which sees her play the wife of a drug lord who leaves the world of crime to live a new life as a woman.\nAriana Grande, meanwhile, is nominated for her terrific comedic performance in Wicked as Glinda, the Good Witch of the North.\nBoth could make it into the same category at the Oscars (although Grande is a more likely nominee than Gomez), but neither is the current favourite to win.\nThe frontrunner is Gomez's co-star Zoe Saldaña. Awards voters may be looking for a chance to reward her for the huge box office success of the franchises she has starred in, such as Avatar and the Marvel films.\nThe only outlier in the supporting actor category is Jamie Lee Curtis for her performance as an ageing Las Vegas dancer in The Last Showgirl. But despite her late entry to the race, her nomination is less of a surprise than it might've been following her SAG nomination last week.\nBrazil’s Fernanda Torres misses out on nomination\nSofia Ferreira Santos\nBBC News\nAmong the names missing a Bafta nomination this year is Fernanda Torres, who won Brazil's first Best Actress Golden Globe earlier this month for her role in I’m Still Here, but was not longlisted by Bafta.\nThe film - which picked up a nomination in the foreign language category - tells the real story of a family living under Brazil’s military dictatorship in the 1970s.\nThe political drama, directed by Bafta winner Walter Salles, has broken records in Brazil - with many hoping to see it on the list of Academy Awards nominations next week.\nSpeaking to the BBC, Torres said she had huge admiration for Eunice and her determination to find justice for her family.\nBrazilians who lost loved ones during the two decades of military rule have commended the film for bringing the country's violent past to the forefront.\nI'm Still Here: Walter Salles film brings Brazil's dictatorship past to the surface\nMarianne Jean-Baptiste gets a much-needed boost\nSteven McIntosh\nEntertainment reporter\nThe best actress race is widely considered to have four guaranteed nominees at the Oscars - Demi Moore (The Substance), Mikey Madison (Anora), Cynthia Erivo (Wicked) and Karla Sofía Gascón (Emilia Pérez) - all of whom have been nominated at the Baftas.\nThere is much debate about who might get the fifth slot - with Golden Globe winner Fernanda Torres (I'm Still Here) considered to be one of the strongest contenders for her role as a Brazilian woman who investigates the disappearance of her congressman husband.\nBut it's a crowded category - with nominations still possible for Angelina Jolie (Maria), Nicole Kidman (Babygirl) and Pamela Anderson (The Last Showgirl), among others.\nOne notable Bafta nominee in this category is Marianne Jean-Baptiste, who plays a constantly miserable woman struggling with depression in Mike Leigh's film Hard Truths.\nHer tremendous performance has been wildly popular with critics' groups, but Jean-Baptiste's campaign faltered after she missed out on a nomination at the Golden Globe and SAG Awards. Her Bafta recognition gives her a much-needed boost of momentum.\nA 'brilliant variety' in this year's nominations, chairwoman says\nBafta chairwoman Sara Putt says the nominations list shows \"just such a brilliant variety\".\nSpeaking to PA news agency, Putt adds that \"when you look at the 10 films nominated for best film, there are six different genres in there.\n\"You've got sci-fi, you've got comedy, you've got horror... you've got straight drama, you've got musicals, and to see horror, with Nosferatu and The Substance and Heretic, all getting nominated.\"\nOn musical films, she says the variety means everything from Wicked through to Kneecap is represented, adding that \"it's an amazing list with real breadth and depth, which is very exciting.\"\nAnimation's 'best villain' gets nod in new category\nThis year's Bafta categories include a newcomer: best children's and family film.\nPaddington didn't make the longlist, and Bafta judge Ashanti Omkar says she is \"very sad\" that it didn't get a nod - but adds this may be down to its failure to take the chance to showcase Peruvian voices.\n\"Whilst Paddington himself was very diverse and they took him to Peru, there weren't many Peruvians in the mix... that's something that hasn't resonated with a lot of voters as well as people who watched the film,\" she says.\nBut Wallace and Gromit - the beloved clay characters plagued by the villainous Feathers McGraw - secured a nomination for Wallace & Gromit: Vengeance Most Fowl in the category.\nAshanti puts the success of this film down to the popularity of the evil penguin, as well as its focus on modern issues like AI.\n\"The penguin continues to be one of the best villains in animation of all time,\" she says.\nGascón becomes first trans nominee for best actress\nSteven McIntosh\nEntertainment reporter\nEmilia Pérez star Karla Sofía Gascón is the first trans actress to be nominated at the Bafta Film Awards.\nThere are a couple of caveats - another trans actress, Annie Wallace, was nominated at Scottish Baftas in 2016 for her role in Hollyoaks.\nAnd it's worth noting some previous nominees have transitioned in the years since they were recognised – such as Juno star Elliott Page, who was nominated in 2008.\nIn Emilia Pérez, a largely Spanish-language musical, Gascón plays a Mexican drug lord who wants to leave the world of crime to live a new life as a woman.\nGascón transitioned before the film was shot and plays the cartel leader as both male and female.\nWhere does this leave the best picture race?\nSteven McIntosh\nEntertainment reporter\nPerhaps the most interesting and exciting thing about this year's awards season is its unpredictability. There is currently no consensus on what will ultimately win best picture at the Oscars on 2 March.\nThere are six films which are thought to have a feasible route to victory - Conclave, Anora, The Brutalist, A Complete Unknown, Emilia Pérez and Wicked.\nBut while the Oscars have 10 best picture nominees, Bafta only has five slots available in best film, which left pundits wondering which of the above would miss out.\nDespite its popularity in other categories and its huge box office success, the answer was Wicked. It will almost certainly still get an Oscar nomination, but its absence in best film at Bafta suggests its chances of winning the Academy Award are smaller than previously thought.\nMeanwhile, Conclave scoring the most nominations is a particular sign of strength for that film, although a reason it was able to score one more nod than Emilia Pérez is it was eligible for the best British film category.\nEmilia Pérez having the second highest number of nominations is a sign of support too, but two of the musical's nominations are in the same category, and it has been more divisive with audiences.\nBoth films could be easily overtaken by The Brutalist or Anora, which had a strong showing at Bafta and have been hugely popular with critics and audiences.\nA Complete Unknown is perhaps lagging marginally behind, after James Mangold missed Bafta's best director category.\nSaoirse Ronan and Hugh Grant are surprise nominees\nSteven McIntosh\nEntertainment reporter\nSaoirse Ronan has made it into the best actress category for The Outrun, a film which sees her play a young alcoholic who returns to Scotland.\nHer nomination gives her awards campaign a much-need shot in the arm, after Ronan missed out on nominations at other ceremonies such as the Golden Globes and SAG Awards.\nSlightly less surprising - but still notable - is a nomination for Hugh Grant, who is nominated for playing a creepy man who entraps two young women in his house in the horror film Heretic.\nThe two women are missionaries from the Church of Jesus Christ of Latter-day Saints who initially knock on his door to ask if he is interested in finding out more about the Mormon Church.\nThere's a small chance Grant could also score an Oscar nomination next week, but he faces tough competition from the likes of Adrien Brody (The Brutalist), Timothée Chalamet (A Complete Unknown), Colman Domingo (Sing Sing) and Ralph Fiennes (Conclave).\nDaniel Craig misses out in best actor category\nSteven McIntosh\nEntertainment reporter\nOne of the most notable omissions in the Bafta nominations is James Bond star Daniel Craig, who is in the running for his film Queer.\nCraig is considered a strong contender in the best actor category, and the fact he is British suggested he was even more likely to show up at Bafta.\nBut Queer is a divisive film. Adapted from William S. Burroughs' novella, the film sees Craig play a gay man in 1950s Mexico City who falls for a younger man played by Drew Starkey.\nIt goes off in a bizarre direction, however, when Craig's character ventures into the jungle in search of a particular plant with telepathic qualities. The hallucinogenic sequences that follow are wildly at odds with the first part of the film and have alienated some audiences.\nHis Bafta miss suggests he is far more vulnerable at the Oscars than his competitors, such as Adrien Brody (The Brutalist), Ralph Fiennes (Conclave) and Timothée Chalamet (A Complete Unknown).\nDenzel Washington's wait for a Bafta nomination continues\nSteven McIntosh\nEntertainment reporter\nDenzel Washington has missed out on a nomination for his role in Gladiator II, Ridley Scott's sequel to the 2000 historical epic.\nThe film has had a fairly weak showing this awards season and was mostly longlisted in the technical categories at Bafta, so this isn't a huge surprise.\nHowever, it seems a particular shame that Washington has missed out in the best supporting actor category, as this would have been his first ever Bafta nomination.\nDespite a decades-long career and nine Oscar nods for acting (including two wins), Washington has never been nominated for a Bafta.\nThe supporting actor category instead features Yura Borisov (Anora), Clarence Maclin (Sing Sing), Edward Norton (A Complete Unknown) and Guy Pearce (The Brutalist), as well as two former Succession stars - Kieran Culkin (A Real Pain) and Jeremy Strong (The Apprentice).\nThe top three films with the most nominations\nThe winners are still under wraps, but the frontrunners are already making themselves known.\nAfter today's announcement, we now know 42 films have bagged nominations. Leading the pack is Conclave with a whopping 12 nods, including big hitters like best director, best film, and outstanding British film.\nHot on its heels is Emilia Pérez with 11 nominations, covering best director, best film, and film not in the English language. It's also made history, with Karla Sofía Gascón becoming the first trans actress to be nominated at the Bafta Film Awards.\nRounding out the top three is The Brutalist, scoring nine nominations, including best director and best film.", "url": "https://www.bbc.com/news/live/c2k5x0yx8qdt"}