{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:49:02", "date_modify": "2025-04-26 06:49:02", "date_publish": "2025-03-01 10:12:34", "description": "Hendon's Stephen Lewis Elms is Sunderland's first black or mixed-race councillor.", "filename": "news_articles_cz0lzr8pmmeo_1745650142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ccd/live/87ae89a0-f531-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz0lzr8pmmeo_1745650142.html", "title": "Rapping Sunderland councillor says city becoming more diverse", "title_page": "Rapping Sunderland councillor says city becoming more diverse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The first black or mixed-race councillor elected in a city says he has seen it become more diverse.\nCouncillor Stephen Lewis-Elms, who represents Sunderland's Hendon ward, said a lot had changed there over the past decade.\nElms moved to the region from Bedford when he was a teenager and felt inspired to join Sunderland City Council after it helped him out during the Covid-19 pandemic.\nThe Labour representative was elected last May and recently rapped a speech in the chamber in what he believes is a world first.\nIt aimed to celebrate the city's recently granted Music City status, while also calling for support and recognition for Sunderland's musicians.\n\"I've always said that Parliament and the council chamber are no different than 8 Mile rap battles,\" the 37-year-old said, referring to scenes from the 2002 film starring Eminem.\n\"Apart from, one rhymes, and one doesn't. It's using words to compete against each other and a debate is no different than a rap battle.\"\nElms's grandparents arrived in the UK in the late 1950s from Jamaica.\nHe grew up in Bedford and came to the North East as a teenager to play rugby for Gateshead Thunder.\nIn 2016, he moved to Hendon and said he felt \"intimidated\" at first, recalling a book signing by English Defence League founder Stephen Yaxley-Lennon, also known as Tommy Robinson, in the area which ended in violence.\n\"When I arrived here my partner wouldn't let me leave the house after a certain time, on foot,\" Elms said.\n\"Because at the time when we moved here, you had Tommy Robinson doing a book signing at the top of the street.\"\nThe far-right activist was jailed last year for contempt of court by repeating false claims against a Syrian refugee.\nElms said he had never felt unwelcome in the city, which he said had become more diverse.\n\"Over the time that I've been here, so much has changed,\" he said.\n\"Mainly Villette Road [in Hendon] has been completely revitalised.\n\"Now it's got so much and it's got diverse shops as well.\n\"It's got herbs and spices shops at the top there, it's got the Asian barbers, Asian cafe, then we've got the new baby shop that's just opened, fruit and veg, a chippy.\"", "url": "https://www.bbc.co.uk/news/articles/cz0lzr8pmmeo"}