{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:02:58", "date_modify": "2025-04-26 04:02:58", "date_publish": "2025-03-03 21:54:16", "description": "Two surgeons reunite with conjoined twin they operated on Great Ormond St Hospital 40 years ago.", "filename": "news_articles_cpde4g6ydgxo_1745640178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1d39/live/dfb109e0-f86d-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpde4g6ydgxo_1745640178.html", "title": "Great Ormond Street: Reunion for conjoined baby separated by doctors", "title_page": "Great Ormond Street: Reunion for conjoined baby separated by doctors - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's an unusual birthday present - being reunited with the surgeons who made your life possible.\nBut that's what happened to Holly, 40 years after being separated from her conjoined twin in a life-saving operation at Great Ormond Street Hospital.\nSpeaking from where she now lives in Texas, Holly told Prof Lewis Spitz and surgeon Edward Kiely, that she was \"grateful and thankful\".\n\"I truly am alive because of them and I know it was a whole different world 40 years ago, and things were quite new in this realm, but God bless them for having the knowledge and the ability.\"\nIn March 1985, Jill Reich underwent a Caesarean section when was told the news she had given birth to conjoined twin girls, named Holly and Carly.\nThey were born facing each other and joined from breastbone to navel, and posed a life or death challenge.\nProf Spitz recalls he had never separated conjoined twins before, and it was an emergency.\n\"When we started we had ultrasound but no CT, no MRI and so we were going in blind, we just had to do the operation,\" he says.\nJust a few days later, on 3 March 1985, Prof Spitz and fellow surgeon Mr Kiely, along with a team of 26 clinicians, carried out a nine-hour operation at Great Ormond Street Hospital in London to separate the twins.\nTragically, Carly died of heart complications around six weeks later, but her sister Holly survived.\nShe went on to have 10 more operations in the following months and remained at Great Ormond Street for almost a year.\nSince that first operation 40 years ago, teams at Great Ormond Street Hospital have cared for 43 sets of conjoined twins - thought to be the most conjoined twins in the world at a single hospital.\nMr Kiely adds: \"At the time it was new, but it was actually just a major operation and we were doing lots of major operations so I wouldn't say we were overwhelmed, but we were very aware that two babies were at risk.\n\"Looking back, the improvements in anaesthesia and intensive care have made the biggest difference.\n\"When you're a paediatric surgeon, you're dealing with children and hoping they'll have another 70 years to go.\n\"You are trying to maximise their potential and hope you are setting them up to ease their travel through life.\"\nHolly has remained in touch with Professor Spitz, including returning to the UK for his retirement party in 2004, but had not seen both men for around 20 years before the recent Zoom call.\n\"I know that my mum felt that Great Ormond Street Hospital and Professor Spitz, Mr Kiely and all the nurses there became family because we were there for the year, and that was really wonderful.\"\nShe said she is still thankful \"that in a small way I helped them learn when they did our separation, so that so many children were able to live\".", "url": "https://www.bbc.co.uk/news/articles/cpde4g6ydgxo"}