{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:30:06", "date_modify": "2025-04-26 06:30:06", "date_publish": "2025-02-27 10:48:52", "description": "The leaky warehouse in Sturminster Newton has been transformed to provide family services.", "filename": "news_articles_c5y0ezg4pe2o_1745649006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/981d/live/ac0bdfe0-f438-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0ezg4pe2o_1745649006.html", "title": "Volunteers help turn Sturminster Newton warehouse into family hub", "title_page": "Volunteers help turn Sturminster Newton warehouse into family hub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An \"army of volunteers\" has been praised for helping transform a derelict, leaky warehouse into a much-needed family hub.\nThe building in Sturminster Newton, Dorset, has been taken over by Vale Pantry food bank which has expanded to offer a range of services.\nIt joins a number of hubs offering midwifery, health visiting, financial advice, parenting classes and play sessions.\nDorset Council's family hub lead councillor, Carol Jones, said: \"We know that this space will make a massive difference to families in the area.\"\nDorset Council said the hub team had \"ambitious plans\" for the space and hoped to offer many more services, including homework clubs and social spaces \"aimed at promoting community and conquering loneliness\".\nMs Jones said: \"We couldn't be more excited to welcome the families into our brilliant new space.\n\"I'm so proud of our army of volunteers who have come together to make this happen, and so grateful to the many donors who have been a part of this.\"\nChildren's services councillor Clare Sutton said: \"The opening of The Vale Family Hub is a fantastic milestone in ensuring families have easy access to the support they need, exactly when they need it.\n\"I extend my heartfelt thanks to everyone who contributed to making this vision a reality.\"\nA community day will be held at the new facility in Butts Road on Saturday.", "url": "https://www.bbc.co.uk/news/articles/c5y0ezg4pe2o"}