{"authors": ["Lewis Coombes & Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 04:40:29", "date_modify": "2025-04-26 04:40:29", "date_publish": "2025-03-02 07:23:05", "description": "Marc Rhodes crossed 143 miles (230km) of snowfields and Arctic tundra in five days.", "filename": "news_articles_c1eng8n26d1o_1745642429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43c6/live/2783e680-f610-11ef-8bd4-79fbcae3264e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1eng8n26d1o_1745642429.html", "title": "Dorset endurance athlete finishes third in Ice Ultra marathon", "title_page": "Dorset endurance athlete finishes third in Ice Ultra marathon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An endurance athlete has completed one the world's toughest ultramarathons, crossing 143 miles (230km) of snowfields and Arctic tundra in five days.\nMarc Rhodes, from Poole, Dorset, finished third in the Ice Ultra last month and had to overcome temperatures dropping to about -25C.\nThe performance consultant, who specialises in mental resilience and physical performance, said people \"do not always know what they are capable of\".\nLeft by his birth mother as a baby in a cardboard box outside Johnson Community Hospital in Spalding, Lincolnshire, he said he is \"problematically adventurous and free-willed\".\n\"When I found out about that, it was much later. It kind of read like a movie script. I can't really believe that happened to me,\" the 33-year-old said.\nHe said completing the ultramarathon – which is defined as any distance longer than a standard marathon of 26.2 miles (42.2km) – was \"mentally very challenging\" but rewarding.\n\"I'm not so fast but if you put me in a beautiful environment with rolling hills I absolutely love it and I'll be there all day,\" Mr Rhodes added.\nOn the third day of his challenge, he had to complete a stage which included a 13-mile (20.9km) frozen lake.\n\"You can put your head down and run and nothing will move in front of you.\n\"It's like being on a treadmill. When you turn round you can see equally as far back and you can see the other racers trying to catch you. You can't really afford to have a rest or a breather because you're in a race,\" he said.\nMr Rhodes completed rigorous training before he set off for the challenge, during which competitors can expect about eight hours of sunlight a day.\n\"This is not a religious thing but I know that I'm not alone,\" he told BBC South.\n\"I have got a GPS tracker on and people are watching [his progress in the race] at home.\n\"You can't really coast because I really want the people who have backed me and supported me to be encouraged by the effort I'm putting in.\"", "url": "https://www.bbc.co.uk/news/articles/c1eng8n26d1o"}