{"authors": ["Bill Wilson", "www.facebook.com"], "date_download": "2025-05-19 15:29:26", "date_modify": "2025-05-19 15:29:26", "date_publish": "2015-01-30 00:06:36", "description": "Having a large tennis back-up team can bring a return on investment, but for lower ranked players having a huge staff is not an option.", "filename": "news_business-30206779_1747668566.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80647000/jpg/_80647027_80647026.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-30206779_1747668566.html", "title": "The tennis entourage pays its way for stars like Murray", "title_page": "The tennis entourage pays its way for stars like Murray - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is not often a player's entourage makes as many headlines as their on-court performance, but that is what happened to Andy Murray during his Australian Open semi-final win over Tomas Berdych.\nNot only had there been a tense build-up to the game, given that one of Murray's former coaches, Dani Vallverdu, now works with Berdych, but during the match the Scotsman's fiancee Kim Sears was apparently caught on camera swearing in the opposing camp's direction.\nIt has all put the spotlight on players' entourages - those close friends and advisers who can be seen sitting in the VIP boxes at big games.\nThe entourage is the highly motivated family, financial and sporting team driving their man or woman to the top.\nAs with a rock star or an F1 driver, those behind the scenes form a super-professional and well-drilled team, each with a specific role to play to ensure that the player is as well-prepared and supported as possible - physically, mentally, and financially.\nThe more cash a player rakes in through prize money and endorsements, the bigger the potential entourage they can employ, with the top stars paying hundreds of thousands of pounds a year on support staff.\nThey may not work all year round, but the chief coach is the main sporting point of contact with the player, honing his or her skills to a tournament-ready fine-pitch.\nOften, but not always, a former pro themselves who understands the challenges of battling to Grand Slam finals.\nThey are able to impart the wisdom of their experiences and successes, such as Amelie Mauresmo with Andy Murray, or Boris Becker with Novak Djokovic.\nHowever, Rafael Nadal's coach, his Uncle Toni, was never a top-ranked player, nor was Patrick Mouratoglou, coach of Serena Williams.\nThe principal coach is often also a defensive shield, and can provide another \"public face\" to the star.\nAt the top echelons of the game, most of these specialists will be on a basic financial retainer - plus a bonus from player prize money.\nObviously, the specialist's bonus is then bigger should their man or woman pocket a Grand Slam or a top-ranked ATP or WTA title.\nDifferent players have differently configured back-room teams and not all of them will have the same-sized entourage, while some roles can be mixed and matched between staff.\nBut a full entourage generally consists of the main coach, a day-to-day coach, a strength and conditioning or fitness coach, physio, manager/agent, and romantic partner.\nOther entourage members can include a hitting partner, a specialist coach brought in to work on just one stroke (such as Djokovic hiring Mark Woodforde in 2007 to improve his volleys), dieticians, as well as other family members or close friends.\nAs well as providing psychological and moral support by being courtside at their client's games, they are there to monetise the player's brand while they are at the top for the relatively short span of their career.\nAt tournaments that means sorting out media appearances, meeting existing and potential new sponsors, and dealing with other player commitments.\nThey are also responsible for extending a player's economic well-being after their playing career.\nThey may not always travel, but might restrict appearances to Grand Slams and other major events.\nIf they are in situ for many years, they become almost surrogate family members.\n\"It's a very insecure way of life for coaches and trainers,\" says Mr Feaver.\nAt the lower levels, on the ATP Challenger Circuit for example, it is a different story as it is almost impossible, given players' financial circumstances, to hire a huge entourage.\nRather, a lower-ranking player will look to hire a \"hybrid\" back-up person - and on a straight salary, which offers some stability and financial planning for both parties throughout the tennis season.\n\"They will certainly look for a person with a variety of skills,\" says Mr Feaver.\n\"They will be coaches who can be practice hitters, and who can also oversee physical programmes, who can massage, and who can manage the logistics at events - from transport to practice courts to practice partners.\"\nSuch a tight budget means no room for family members, unless they pay for themselves, and that might come at a cost.\n\"Having partners, close family members and friends as part of your entourage provides a psychological boost, which enables better performance,\" says Prof Chadwick.\nAnd, notwithstanding the latest ruction, he believes the female presence is good for Murray's image.\n\"I think there is a commercial aspect to this as well. Someone like Murray can sometimes seem edgy and not very accessible, so what Mauresmo, Kim Sears and his mother do is soften his image, which can only help with his marketing.\"", "url": "https://www.bbc.com/news/business-30206779"}