{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:08", "date_modify": "2025-05-19 14:23:08", "date_publish": "2015-04-17 02:54:54", "description": "Satellite images show China is making progress on building an airstrip on a reef in disputed territory in the South China Sea, a report says.", "filename": "news_world-asia-32331964_1747664588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82375000/jpg/_82375916_fieryreef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-32331964_1747664588.html", "title": "China 'building runway in disputed South China Sea island'", "title_page": "China 'building runway in disputed South China Sea island' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Satellite images show China is making progress on building an airstrip on a reef in disputed territory in the South China Sea, a report says.\nThe images, published by IHS Jane's Defence Weekly, external, show construction work on reclaimed land on Fiery Cross Reef in the Spratly Islands.\nThe landmass could accommodate a runway about 3,000m long, the report said.\nChina's land reclamation work in the area has raised concern around the Asia-Pacific region.\nChina claims almost the whole of the South China Sea, resulting in overlapping claims with several other Asian nations including Vietnam and the Philippines.\nThey accuse China of illegally reclaiming land in contested areas to create artificial islands with facilities that could potentially be for military use.\nThe report from IHS Jane's used images provided by Airbus Defence and Space in February and March.\nThe later image, dated 23 March, showed a paved section of runway on the north-eastern side of Fiery Cross Reef, as well as paving and ground preparation of other sections of the runway.\nThe 3,000m length, it said, \"would be well within the parameters of existing People's Liberation Army Air Force runways on mainland China, which vary in length from about 2,700m to 4,000m at most\".\nIt also showed dredging to the south of the reef, in apparent work to improve the reef's port facilities.\nAdditional images showed that China could be building a second air strip on Subi Reef, also in the Spratlys and only 25km from an island with a Filipino civilian population, by creating and then linking three artificial islands, the report said.\nChina's neighbours are concerned that Beijing is working to entrench a military presence in the South China Sea to reinforce - and make permanent - its claims.\nThe Philippines said last year it believed China was building an airstrip in Johnson South Reef, in the Spratlys - the extent of work there is not clear. And earlier this week, another report citing satellite images , externalsaid China was expanding an airstrip on Woody Island, much further north in the disputed Paracel Islands which Vietnam claims.", "url": "https://www.bbc.com/news/world-asia-32331964"}