{"authors": ["Andrea Pluck", "www.facebook.com"], "date_download": "2025-04-26 06:12:31", "date_modify": "2025-04-26 06:12:31", "date_publish": "2025-03-02 06:29:42", "description": "Residents have been invited to an event to find out how the council plan to resolve traffic issues", "filename": "news_articles_cy05yr8x181o_1745647951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dc28/live/41a106d0-f5e6-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05yr8x181o_1745647951.html", "title": "Farthinghoe: Council shares traffic solutions after rejecting bypass", "title_page": "Farthinghoe: Council shares traffic solutions after rejecting bypass - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council which refused a bypass for a heavily congested village is to put forward alternative traffic solutions at a drop-in event.\nWest Northamptonshire Council (WNC) has invited residents in Farthinghoe, Northamptonshire to \"hear first-hand\" the options to tackle ongoing traffic issues on the A422 in the heart of the village.\nThis follows long-standing calls by locals for a bypass and relief from daily congestion in the area, but council leaders declared the plan \"undeliverable\".\nMick Morris, who chairs Farthinghoe Parish Council, said that a bypass would be the only solution that \"solves the problem forever\".\nWNC stated proposals for a bypass lacked funding support from the government but it remained \"committed to finding an alternative way to reducing heavy congestion\".\nThe A422 is a key route through Farthinghoe but there have been a large number of accidents and incidents of vehicles getting stuck at the Baker Street Junction pinch-point in the centre of the village.\nPotential solutions the council has considered include a traffic signal scheme to control vehicle flow and traffic calming measures to reduce speed at the pinch- point.\nMr Morris said the council needed to also consider the traffic problems facing the entire village.\n\"It's become a pinch-point problem, but there are other areas in the village which are not quite as bad, but still dangerous,\" he said.\n\"There are other parts in the village where lorries go on the wrong side of the road in order to navigate through the village.\"\nPhil Larratt, WNC's Conservative cabinet member for highways and transport, said: \"The opportunity to deliver a bypass around Farthinghoe has been studied over many years.\n\"However the benefits of such a scheme do not meet the government's requirements and they have been clear that funding for the scheme will not be considered.\"\nThe drop-in event will be held on 10 March between 15:30 and 19:30 GMT at Farthinghoe Village Hall.\nResidents can also find out more about potential solutions and share feedback via the council's online survey, external.", "url": "https://www.bbc.co.uk/news/articles/cy05yr8x181o"}