{"authors": ["James Turner", "www.facebook.com"], "date_download": "2025-04-26 08:13:38", "date_modify": "2025-04-26 08:13:38", "date_publish": "2025-02-26 11:22:14", "description": "The application for land near Wainfleet Road, Boston, has been given the go-ahead by councillors.", "filename": "news_articles_cy7xgjljr05o_1745655218.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9278/live/76c112b0-f415-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xgjljr05o_1745655218.html", "title": "Plans for 200 affordable homes in Boston approved", "title_page": "Plans for 200 affordable homes in Boston approved - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new housing estate with 200 affordable homes on the edge of Boston has been approved.\nPlans for the development on land south of Wainfleet Road were approved by Boston Borough Council.\nThe scheme includes 200 affordable homes, a communal hall and parking.\nThe application was originally deferred due an objection from Lincolnshire Fire and Rescue, but permission was given on Tuesday after amendments to the plan were made.\nThe scheme is a resubmission of a 2018 proposal, with the main difference being that it now includes affordable homes, according to the Local Democracy Reporting Service.\nChristopher Lindley, the agent for the applicant, said there was an \"acute need for affordable housing for people in Boston\".\nHe added: \"Following consideration of this application earlier in the month, we've carefully analysed the points of concern raised by members.\"\nLincolnshire Fire and Rescue had said there would be \"inadequate access and water supply\".\nThe applicant, Hamilton Russell Harper Wood, subsequently clarified details about the construction standards of the adopted roads within the development, and that led to the fire service withdrawing its objection.\nThe developer was also asked to make financial contributions of about £130,000 for health and about £735,000 for secondary and sixth-form education.", "url": "https://www.bbc.co.uk/news/articles/cy7xgjljr05o"}