{"authors": ["Stephen Fairclough", "www.facebook.com"], "date_download": "2025-04-26 06:15:35", "date_modify": "2025-04-26 06:15:35", "date_publish": "2025-03-01 21:51:01", "description": "Nathan Osman's family say attempts to use his bank cards were made the day after he died.", "filename": "news_articles_c8x4qn74z2vo_1745648135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0336/live/73ab3550-f5c4-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x4qn74z2vo_1745648135.html", "title": "Nathan Osman: Questions remain over dad's Benidorm death", "title_page": "Nathan Osman: Questions remain over dad's Benidorm death  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a father-of-four who died while on holiday in Benidorm are flying to Spain to try and get answers about what happened in the hours before his death.\nThe body of Nathan Osman, 30, was found at the foot of a remote cliff on the outskirts of Benidorm less than 24 hours after he arrived on holiday with friends in September.\nHis family said attempts to use his bank cards were made the day after he died and fear others were involved before his death.\nThe Spanish authorities have agreed to meet with Nathan's family, who do not believe there has been an adequate investigation into what happened to him.\nNathan's brother Lee Evans and his sister Alannah are flying to Benidorm on Sunday, to try and speak directly with police about the investigation.\n\"We've been totally abandoned,\" Lee said. \"There's been zero investigation and we are fighting for answers.\"\nPolice in Benidorm have not responded to a request to comment.\nNathan, from Pontypridd, Rhondda Cynon Taf, had made a last minute decision to join his friends on a trip to Benidorm in September 2024.\nThe devoted dad had arrived on 27 September and after spending time with his friends, said he would walk back to his hotel on his own to sleep, because he was tired.\nThe following morning, his bed had not been slept in. Later that day, his body was found at the foot of a cliff by an off-duty policeman on a waterbike.\nLee does not believe Nathan made the journey to the remote location in the opposite direction to his hotel on his own, and said it would take an hour to walk up there.\nHe added Nathan had \"no reason to be up there\".\n\"We strongly believe he was taken up there, whether it was by taxi or against his own will,\" Lee said. \"And something has happened for him to be found where he was found.\"\nThe family said the day after his death attempts were made to use Nathan's bank cards, but this was not followed up by the authorities.\nAlannah and Lee have also been tracing Nathan's known movements on the night. They said he had been on a video call with one of his friends until his phone battery ran out.\nCarrying out their own investigations, the family discovered Nathan on public CCTV on the promenade, where they said he did not appear significantly intoxicated. They have found other premises with CCTV, but said the owners would not pass on any recordings without a request from the Spanish authorities.\nThe family said they had repeatedly tried to find out how the investigation into Nathan's death was progressing, but have been met with silence.\nThey recently received a police file which Alannah said was \"empty\", with the case described as closed.\nNathan's mother Elizabeth said there was \"no empathy\" from the Spanish police immediately after his death and claimed they were \"treated like dogs\".\nElizabeth said she had to identify her son by being shown a photo of a tattoo on his torso.\nShe said not knowing how he ended up at the remote location is torturous.\n\"Our boy deserves answers and we as a family deserve answers. Nathan wasn't a drunkard who'd go out and forget about everything. Nathan was really with it,\" she said.\n\"Not knowing about that last hour or two before his death, it's eating us away, day in day out, from the time we get up to the time we go to bed. We live this nightmare.\"\nNathan's father Jonathan said: \"They've done nothing, nothing at all. It's just a total disregard for his life in every kind of way.\"", "url": "https://www.bbc.co.uk/news/articles/c8x4qn74z2vo"}