{"authors": ["Duncan Leatherdale", "www.facebook.com"], "date_download": "2025-04-26 07:57:44", "date_modify": "2025-04-26 07:57:44", "date_publish": "2025-02-25 12:08:19", "description": "Andrew McCubin's home was destroyed and a neighbour's significantly damaged, a court is told.", "filename": "news_articles_c9q4j7zv5xpo_1745654264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a0d/live/0a5588d0-f36c-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q4j7zv5xpo_1745654264.html", "title": "Middlesbrough man found to have deliberately blown up his house", "title_page": "Middlesbrough man found to have deliberately blown up his house - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An explosion which destroyed a man's home and significantly damaged neighbouring houses was set off deliberately, a jury has found.\nProsecutors said Andrew McCubin, 57, interfered with the gas supply at his rented accommodation on Kirkland Walk shortly before a blast in June, Teesside Crown Court heard.\nMinutes before the explosion, he told neighbours he could smell gas but did not mention it while talking to the utility company, the court heard.\nMcCubin was accused of arson being reckless as to whether life was endangered, with a hearing held in his absence after he was found unfit to stand trial due to his mental health.\nAfter about two hours of deliberation, jurors found he had committed the offence. He will be sentenced at a later date.\nJudge Simon Batiste said he would consider a hospital order but further assessments were needed, with the court hearing McCubin was currently being held in a prison.\nMcCubin had been a tenant at the two-bedroom semi-detached home since 2017, prosecutor Christopher Baker said.\nThe court heard in the weeks before the explosion he had expressed suicidal thoughts.\nOn the morning of 18 June, McCubin asked two neighbours if they could smell gas and told one: \"Well, that's us all going up then.\"\nHe told another man he could smell and hear gas coming from a loose pipe and was advised not to ignite any fires and contact his energy supplier.\nAfter speaking to the neighbours, he called Northern Gas about topping up his electrical meter but at no point did he mention there was a problem with his gas supply, the court heard.\nThe house exploded at about 12:45 BST with McCubin badly burned, Mr Baker said.\nAn expert concluded a pipe in a cupboard had been disconnected and that could only have been done deliberately, the court heard.\n\"It was not an accident,\" Mr Baker said, adding CCTV showed McCubin as the only person going in and out of the home that morning.\nThe prosecutor told jurors: \"The question you have to focus on is whether the prosecution have made you sure that it was McCubin who interfered with the gas supply.\"", "url": "https://www.bbc.co.uk/news/articles/c9q4j7zv5xpo"}