{"authors": ["Katie Hunter", "www.facebook.com"], "date_download": "2025-04-26 03:49:23", "date_modify": "2025-04-26 03:49:23", "date_publish": "2025-03-05 13:39:08", "description": "Lindsay MacCallum defrauded £86,000 from Rainbow Valley and £9,505 from the Anthony Nolan Trust.", "filename": "news_articles_c99n4d1y38lo_1745639363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3cf2/live/86684ea0-f9be-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99n4d1y38lo_1745639363.html", "title": "Fraudster repays £86,000 stolen from friend's cancer charity", "title_page": "Fraudster repays £86,000 stolen from friend's cancer charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who stole £86,000 from a cancer charity set up in memory of her best friend's daughter has repaid the money.\nLindsay MacCallum defrauded Rainbow Valley after launching it with Angela MacVicar. She also embezzled £9,505 from her former employer, the Anthony Nolan Trust.\nFalkirk Sheriff Court heard MacCallum had fully reimbursed both charities before the payment deadline.\nThe fraudster, who did not appear in court, was jailed last October for three years.\nAfter the hearing Ms MacVicar told BBC Scotland News: \"She's put me through three years of hell.\n\"Nobody believed she was ever capable of this.\n\"I miss the person I thought she was but she never was that.\n\"It's just time to move on and look to the positives, and the people we can actually help.\"\nMacCallum, of Aberfoyle, near Stirling, had worked as a fundraising manager for the Anthony Nolan Trust from 1995 to 2012 before she left to set up Rainbow Valley with Ms MacVicar.\nThe foundation was launched in memory of her daughter, Johanna, who died from leukaemia in 2005.\nThe court previously heard MacCallum had already paid back £25,000 of the stolen money.\nMs MacVicar feared that if a criminal confiscation order was granted, the remainder of the cash owed would have gone to the Treasury.\nBut instead a compensation order was put in place so any money would go back to the charities.\nAnd on Wednesday it was confirmed the remaining outstanding funds - £60,000 to Rainbow Valley and £9,505 to the Anthony Nolan Trust - had been paid.", "url": "https://www.bbc.co.uk/news/articles/c99n4d1y38lo"}