{"authors": ["Laura Coffey", "www.facebook.com"], "date_download": "2025-04-26 04:20:31", "date_modify": "2025-04-26 04:20:31", "date_publish": "2025-03-03 15:26:09", "description": "Kirk Harrison's defection means North Northamptonshire Council now has three Reform members.", "filename": "news_articles_cy83n1dem53o_1745641231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c3a/live/f5f667e0-f83b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83n1dem53o_1745641231.html", "title": "Another North Northamptonshire councillor switches to Reform UK", "title_page": "Another North Northamptonshire councillor switches to Reform UK - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Another member of North Northamptonshire Council has joined Reform UK.\nKirk Harrison, the member for Irthlingborough, has defected from the Conservative Party.\nHe becomes Reform's third member on the council.\n\"I firmly believe that Britain needs real change and that Reform UK is best placed to deliver it,\" Harrison said.\nIn a statement, he added: \"This decision was not taken lightly... I remain committed to serving my constituents and will continue to work hard on their behalf, ensuring that their voices are heard and their concerns addressed.\"\nIn December, Ken Harrington, the member for Hatton Park in Wellingborough, joined Reform from the Conservatives while Irchester's Martin Griffiths – who was previously an independent – also joined the party.\nCouncil leader Jason Smithers said he respected Harrison's decision, but \"it underscores the importance of consistent alignment with the core principles that define our Conservative values\".\nHe added: \"We recognise that individuals may reassess their political affiliations, and we extend our best wishes to Kirk for his future endeavours.\"", "url": "https://www.bbc.co.uk/news/articles/cy83n1dem53o"}