{"authors": ["Umang Poddar", "www.facebook.com"], "date_download": "2025-04-26 07:25:55", "date_modify": "2025-04-26 07:25:55", "date_publish": "2025-02-27 23:22:26", "description": "In many cases, courts criticised the police for lapses in investigation, even \"falsely implicating\" people.", "filename": "news_articles_c757zl67n7wo_1745652355.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b18a/live/f447fdd0-f4c8-11ef-8022-5d43535d9ccc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c757zl67n7wo_1745652355.html", "title": "Delhi riots 2020: Why many police cases are falling apart", "title_page": "Delhi riots 2020: Why many police cases are falling apart - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Five years after deadly religious riots engulfed India's capital Delhi, there is no legal closure in sight for the people involved.\nA BBC Hindi analysis has found that more than 80% of the cases related to the violence where courts gave decisions have resulted in acquittals or discharges.\nMore than 50 people, mostly Muslims, were killed after clashes broke out between Hindus and Muslims over a controversial citizenship law in February 2020. The violence - the deadliest the city had seen in decades - stretched on for days, with hundreds of homes and shops set on fire by violent mobs.\nThe BBC had earlier reported on incidents of police brutality and complicity during the riots. The police have denied any wrongdoing and in their investigation, alleged that the violence was \"pre-planned\" as a part of a larger conspiracy to \"threaten India's unity\" by the people who were protesting against the law.\nThey registered 758 cases in connection with the investigation and arrested more than 2,000 people. This included 18 student leaders and activists who were arrested in a case that came to be known as the \"main conspiracy case\". They were charged under a draconian anti-terror law that makes it nearly impossible to get bail. Only six of them have been released in five years, and some like activist Umar Khalid are still in jail, waiting for a trial to begin.\nBBC Hindi examined the status of all the 758 cases filed in relation to the riots and analysed the 126 cases in which the Karkardooma court in Delhi had given decisions.\nMore than 80% of these 126 cases resulted in acquittals or discharges as witnesses turned hostile, or did not support the prosecution's case. Only 20 of these cases saw convictions.\nUnder Indian law, an accused is discharged when a court closes a case without a trial because there isn't sufficient evidence to go ahead. An acquittal is when the court finds the accused not guilty after a full trial.\nIn 62 of the 758 cases that were filed on charges related to murder, there was only one conviction and four acquittals, data accessed by the BBC through India's Right to Information law shows.\nA detailed analysis of the 126 orders also showed that in dozens of cases, the court came down heavily on the Delhi police for lapses in investigations. In some cases, it criticised the police for filing \"predetermined chargesheets\" and \"falsely implicating\" the accused.\nIn most of the 126 cases, police officials were presented as witnesses to the events. But for various reasons, the court did not find their testimonies credible.\nJudges have pointed out inconsistencies in the police statements, delays in identification of the accused by the police and, in some instances, cast doubts over whether policemen were even present when the violence broke out.\nIn two orders, the judge said that he could not \"restrain\" himself from saying that when history looked back at the riots, the \"failure of the investigating agency to conduct a proper investigation\" would \"torment the sentinels of democracy\". The court was hearing cases filed against three men on charges of arson and looting - but concluded they had been arrested without any \"real or effective investigation\".\nThe Delhi police did not respond to the BBC's request for comment. In a report filed last April, the police had told the court that all investigations were carried out in a \"credible, fair and impartial\" way.\nTestimonies from some of the accused and even the court's own observations, however, raise questions about the investigation.\nShadab Alam, who spent 80 days in jail, says he can never forget the terror of the riots.\nHe had taken shelter on the rooftop terrace of a medicine store where he worked with a few others.\nJust hours earlier, the police had arrived at the shop and asked them to shut it because of ongoing arson.\n\"Suddenly, they [the police] came again and took a few of us into their van,\" he told the BBC.\nWhen he asked the police why he was being taken, he said, they accused him of participating in rioting.\n\"They asked us our names and beat us up. Almost all of us arrested were Muslims,\" Mr Alam said. He added that he submitted his medical report before the court that confirmed three injuries.\nIn its official report, the police charged Mr Alam and 10 other Muslims of burning down a shop. But the court discharged all of them even before the trial could begin.\nIn its observations, the court criticised the police investigation saying that the witness's statements could have been \"artificially prepared\", and that \"in all probabilities\" the shop was burnt by a \"mob of persons from the Hindu community\".\nIt said the police did not pursue the case in that direction, despite being present when the incident happened.\nMr Alam had to wait four years for the case to be officially closed.\n\"All this happened during Covid-19 pandemic. There was a lockdown. We were in a state of frenzy,\" said Dilshad Ali, Alam's father.\n\"In the end, nothing was proved. But we had to spend so much time and money to prove our innocence.\"\nHe said the family wanted monetary compensation for their losses. \"If the police made a false case against my son, then action should be taken against them,\" he added.\nIn another case, the court acquitted Sandip Bhati, who was accused of dragging and beating a Muslim man during the riots.\nThe police had submitted two videos to show Mr Bhati was the culprit. But in court, his lawyer said that the police had submitted an incomplete clip to frame his client.\nIn the full video, which the BBC has verified, Mr Bhati is seen saving the Muslim man instead of beating him up.\nIn its order in January, the court ruled that the police \"manipulated\" the video to \"frame\" Mr Bhati instead of tracing the \"actual culprits\".\nIt also asked the commissioner of Delhi police to take appropriate action against the investigating officer in the case. The police did not respond to BBC Hindi's question on whether this had been done.\nMr Bhati, who spent four months in prison, refused to comment, saying he did not wish to discuss his \"ordeal\".\nWith so many acquittals, former Supreme Court judge Madan Lokur said, the prosecution and police \"should sit down to introspect what they have achieved in five years\".\nHe also said that \"accountability needs to be fixed on the prosecution as well if the arrest is found to be illegal or unnecessary\".\n\"If the prosecution puts someone in jail because they have the power to do so or because they want to do so, they should not be allowed to get away with it if the incarceration is found to be illegal or unnecessary,\" he added.\nEven as some cases fall apart in courts, many of those arrested are still languishing in jail awaiting a trial.\nGulfisha Fatima, a 33-year-old PhD aspirant, is among 12 activists who are still in jail on charges of being \"conspirators\" of the riots.\nHer family said three other police cases were lodged against her and she got bail in all of them. But she continues to face incarceration in a fourth case under the Unlawful Activities (Prevention) Act (UAPA) - the stringent anti-terror law that sets exceptionally challenging conditions for bail.\n\"Since she's gone to jail, with every hearing we hope she will finally come out,\" her father Syed Tasneef Hussain told the BBC.\nIn Ms Fatima's case, after months of hearing the bail plea, the judge from the Delhi High Court got transferred in 2023, and now the entire case is being heard again.\n\"Sometimes I wonder if I'll be able to see her or if I'll die before that,\" Mr Hussain said.\nFollow BBC News India on Instagram, external, YouTube,, externalTwitter, external and Facebook, external.", "url": "https://www.bbc.co.uk/news/articles/c757zl67n7wo"}