{"authors": ["Dawn Limbu", "www.facebook.com"], "date_download": "2025-04-26 03:48:00", "date_modify": "2025-04-26 03:48:00", "date_publish": "2025-03-05 15:19:39", "description": "Students and staff are encouraged to write a plaque to a woman as part of International Women's Day.", "filename": "news_articles_crrd7ngqdexo_1745639280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b892/live/f4e74a50-f916-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd7ngqdexo_1745639280.html", "title": "'Wall of Women' celebrated at the University of Bath", "title_page": "'Wall of Women' celebrated at the University of Bath - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Professors, cleaners, students and administrative staff are among those being highlighted on a \"Wall of Women\" at the University of Bath.\nStaff and students at the university are being encouraged to dedicate a plaque to a woman at the university who has inspired or supported them.\nThe plaques are being displayed at the library on the Claverton Down campus this week as part of celebrations for International Women's Day on Saturday.\nIt is the idea of Prof Turi King, director of the Milner Centre for Evolution at the university, who described them as \"little acts of kindness\".\n\"It's an event I ran at my previous university and I know from experience that it is such a great feel-good celebration of women at the university,\" said Prof King.\n\"It's one of these really heart-warming things because people see the plaques that are dedicated to them and some people are in tears.\"\nPens and plaques are available in the library for staff and students to write down who they appreciate and why.\nThe nominated women will receive an e-mail to say they have been recognised on the wall. The women can collect their plaques at the end of the week.\n\"Every woman who has a plaque dedicated to them will be emailed to let them know, and the week after the event staff will be able to come and collect their plaque,\" continued Prof King.\nDr Marianne Harkins, director of the faculty technical services, said: \"It was lovely to find out that someone had written a plaque for me, but also to have the chance to read the amazing plaques for other women here at the university.\"", "url": "https://www.bbc.co.uk/news/articles/crrd7ngqdexo"}