{"authors": ["Kate Moser Andon", "www.facebook.com"], "date_download": "2025-04-26 04:32:39", "date_modify": "2025-04-26 04:32:39", "date_publish": "2025-03-03 05:23:43", "description": "Cambridge has a higher proportion of non-UK passport holders than any area outside London.", "filename": "news_articles_cx2jrqnvrn2o_1745641959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9e92/live/7abbbf30-f381-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2jrqnvrn2o_1745641959.html", "title": "What does one in four non-UK passport holders mean for Cambridge?", "title_page": "What does one in four non-UK passport holders mean for Cambridge? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cambridge may be known for its chapels, colleges and winding lanes. But something else sets the city apart: 28% of residents hold a non-UK passport, compared with an England and Wales average of 10%.\nThis is greater than for any other local authority area outside London, according to the 2021 Census, external. So what does it mean for the community here?\nBarnali Ghosh, 51, remembers arriving in Cambridge as a student from India 25 years ago.\n\"I loved the city so much,\" she says.\n\"In the beginning, if you don't know people, it can be very isolating.\"\nWearing a yellow sari, she is at an Indian community event in Arbury, in the north of the city.\nIndia was the second most common country of birth, external for Cambridge residents in the latest census in 2021.\nThe figure of 4,000 was nearly double that of 10 years earlier.\nBarnali decided to stay on after her doctorate, and says many other Indian-born residents were attracted by the local economy.\n\"The IT, AstraZeneca, doctors and also education; these are sectors where we [as Indians] traditionally go and study,\" says Barnali, who adds that she found the city \"very welcoming\".\nBarnali helps to run Indian cultural events, where people in the community celebrate important dates in the calendar, worship, eat food and catch up.\n\"Indian people love to have fun, and so we go to these events; our weekends are always full of laughter and fun,\" she says.\nBarnali says she has not personally experienced discrimination in her mainly academic circles, but has heard negative stories.\n\"Some people find it difficult to rent because some people don't want to rent to Indian people,\" she says.\nShe has a piece of advice for any newcomers feeling lost in Cambridge.\n\"You need to reach out; reach out to the people in other communities and forge the friendships.\"\nSome 38% of Cambridge residents are born outside the UK, putting it well above the England and Wales average of 17%.\nThe city has long been a draw for international students and workers.\nCambridge is home to more than 60 multinational companies, and the University of Cambridge and Anglia Ruskin University both have significant international student populations.\nBeyond the opportunity represented by its colleges and office blocks, though, there is also deprivation.\nCambridge is considered one of the most unequal cities in the country, with the top 80% of earners in the city paid more than twice as much as the bottom 20%, external.\nCatharine Walston, a trustee of the Cambridge Refugee Resettlement Campaign, says a small minority of migrants are asylum seekers who arrived with very little.\n\"We welcomed a family from Sudan whose five children had all been born in a UN-managed camp, none of whom had ever seen a dentist,\" she says.\nAbout 120 families in the city currently receive the campaign's support. Most have arrived via resettlement schemes, but some do not have a legal right to support.\nLess than 0.5% of Cambridge's population, or fewer than 690 people, arrived via a supported asylum scheme, or the Homes for Ukraine and Afghan resettlement programmes.\nCatharine says the majority of non-UK passport holders living in Cambridge are \"by no means underprivileged\", but that a small minority of people are.\nThe charity helps people access English lessons and provides other support, such as providing bicycles for children to get to school, free laptops, and healthcare.\nCatharine believes people in Cambridge are generally welcoming towards asylum seekers.\n\"With two universities and a good regional college, people are well educated, so can see the benefits of having people with different ideas around,\" she says.\nPaul Swinney, an urban economist from the Centre for Cities, a think tank, says immigration is part of a bigger story in Cambridge: growth.\n\"Cambridge is this innovation superstar, but it's really small,\" he says.\n\"When you talk to cutting-edge businesses based in Cambridge, access to global talent is important to them.\"\nHe says companies are calling for more lab space, and housing for workers, but that some parts of society do not want that to happen.\n\"A number of people don't want to see new houses being built; they like Cambridge the way that it is,\" he says.\nThe government recently increased the Greater Cambridge area's annual housing target to 2,309 homes in Cambridge and South Cambridgeshire.\nReem Assil, 47, lives in Waterbeach just north of the city, having been born to Syrian parents in London and spending most of her life in Damascus.\nA former activist, she left Syria after what she describes as \"getting in trouble\" soon after the Arab Spring, the series of protests in 2011, and moved to safety in the south of France.\nShe then moved to Cambridge in 2012, thinking it would be the perfect place to use her immunology PhD and bring up her two sons, then aged five and 10.\nShe says she \"fell in love\" with the city, but admits it was isolating.\n\"There was no way for me to just practise and live the Arab culture which I wanted to keep going.\n\"My youngest didn't read or write in Arabic at all.\"\nLast year, Reem fulfilled a long-term aim of co-founding a group that celebrates Arab culture.\nCalled Makani – which means \"my place\" in Arabic – she helped organise an Eid al-Fitr celebration in the summer and runs ad-hoc drumming and dancing sessions.\n\"We'd drum a little bit, dance, have a break; people started to become really interested in learning,\" says Reem.\nShe says people from many different backgrounds and ages had been along to events, and eventually wants to open up Makani so other people share aspects of their culture, too.\n\"The goal is not to reinforce divides, but bring everyone together.\"", "url": "https://www.bbc.co.uk/news/articles/cx2jrqnvrn2o"}