{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:23:26", "date_modify": "2025-05-19 15:23:26", "date_publish": "2017-07-04 00:00:00", "description": "Plus: Order to arrest Tanzania MP for \"insulting\" president, Zambia's biggest market burns down, journalist \"axed over Zuma zombie\" jibe, and other updates.", "filename": "news_live_world-africa-39660321_1747668206.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_world-africa-39660321_1747668206.html", "title": "Africa highlights: Tuesday 4 July 2017, as it happened", "title_page": "Africa highlights: Tuesday 4 July 2017, as it happened - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nigeria 'in a state of emergency'\nChris Ewokor\nBBC Africa, Abuja\nThe speaker of Nigeria's lower chamber, the House of Representatives, has said the deployment of the armed forces in more than 28 states means the country is effectively under a state of emergency.\nYakubu Dogara said it was worrying that the armed forces have virtually taken over routine police work in Nigeria, which is made up of 36 states.\nHe was speaking at a security event involving lawmakers in the capital, Abuja.\nThe fear appears real for a country that came out of military rule less than 20 years ago.\nMr Dogara noted the military used to exercise absolute control over government until the restoration of civilian rule in 1999.\nHis critics will say there are plenty of reasons for the army to be deployed, including an insurgency by Islamist militants in the north-east, a separatist agitation in the south-east, a threat to eject ethnic Igbos from the north and attacks on oil facilities in the Niger Delta.\nSee also: Islamist militants 'defeated but 'not eliminated'\nUnesco take Ethiopia's Simien park off danger list\nUnesco has tweeted that it has taken Ethiopia's famous Simien Park off the list of endangered world heritage sites following the government's decision to build an alternative road around it:\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThe park was added to the danger list in 1996 due to the impact of a new road across it.\nIn a statement, Unesco said:\nQuote Message\nThe World Heritage Committee welcomed Ethiopia’s commitment in building an alternative road to alleviate the disturbance of traffic on the main road that crosses the property, reduce cattle overgrazing and visitor impact.\nQuote Message\nThe committee furthermore welcomed the stabilization of the site’s endemic animal populations of, notably, Walia ibex and Gelada baboons.\"\nThe park was placed on the danger list in 1996.\nWe reported earlier that Unesco had also taken Ivory Coast's Comoe National Park off the list after elephants and monkeys started reproducing again on the site.\nBurundi 'purging army along ethnic lines'\nBurundian authorities have intensified an ethnically-driven purge of the army this year, a French rights group has said in a report out today, external.\nThe government in Bujumbura rejected the findings, Reuters news agency reports.\nThe report by the Paris-based International Federation for Human Rights (FIDH) said there was already a split in the army between people who supported an attempted coup in 2015 and those who backed President Pierre Nkurunziza.\nIt said the split has become worse, with the \"purge and elimination\" of soldiers The \"primary targets\" were soldiers who came from the former army, dominated by the minority Tutsi ethnic group.\nIt goes on to say that the government has \"reinstated\" ethnic divisions in the army, and considers soldiers of the former army as \"enemies because of their Tutsi ethnic background\".\nThe report gives a stark warning about what could happen if the trend continues:\nQuote Message\nThis might lead the army to fall apart and entice many soldiers to disobey, which means a possible return of civil war.\"\nMr Nkurunziza comes from the majority Hutu etnic group. He took power in 2005 following the the end of a brutal civil war.\nHe refused to step down in 2015 when his two terms ended. It led to protests and an attempted coup which was crushed by troops loyal to him.\nTanzanian MP accused of inciting violence\nSammy Awami\nBBC Africa, Dar es Salaam\nOpposition Tanzanian MP Halima Mdee insulted President John Magufuli at a meeting of her Chadema party, Kinondoni District Commissioner Ally Hapi has said.\nMr Hapi has ordered the police to detain her for allegedly insulting Mr Magufuli.\nSpeaking at a press conference earlier today, he accused Ms Mdee - an MP in the main city, Dar es Salaam - of saying that the president had become \"ill-mannered\" and that one day he will \"order Tanzanians to go topless\".\nIt is not immediately clear what prompted her to make the alleged comments.\nMr Hapi says the comments incited violence and are not supposed to be made ordinary citizens, let alone an ethical leader.\nThe constitution gives power to a district commissioner to order the detention of any individual for up to 48 hours for allegedly causing \"public disturbance\".\nMs Mdee has not yet commented.\nSee earlier post for more details\nZambia's leader warns of 'sabotage' after fire\nKennedy Gondwe\nBBC World Service, Lusaka\nZambia's President Edgar Lungu has suggested that the country's biggest market was deliberately set on fire in an act bordering on \"economic sabotage\".\nHowever, some people at the gutted market in the capital, Lusaka, say they suspect it was caused by an electrical fault.\nMr Lungu - who is attending a heads of summit of the African Union in Ethiopia - vowed to bring the suspected arsonists to justice.\n\"We'll find you wherever you're hiding,\" he said, in a series tweets:\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post 2\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post 2\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post 3\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post 3\nThe blaze has been extinguished by firefighters from the city council and the Zambia Air Force.\nSome onlookers said they came to the scene late, causing the fire to spread rapidly this morning.\nPolice are still investigating the cause of the inferno.\nZambia's main opposition United Party for National Development (UPND) said the tragedy should not be politicised, and independent proferssionals should be left to identify the cause.\n\"All residents hold Lusaka City Market dear to their hearts because it’s a source of livelihoods to thousands of our mothers and youths,\" its chairperson Mutale Nulumongo said in a statement , externalpublished in local media.\n\"It’s a complex that cuts across political, religious or ethnic divides and brings World class goods and services from far flung places such as Dubai, China and Europe, right at our doorsteps,\" she added.\nSee earlier post for more details\nTanzania orders arrest of MP for 'insulting' president\nTanzanian authorities have ordered the arrest of an opposition lawmaker for insulting President John Magufuli.\nPolice should detain Halima Mdee - a lawmaker from the main opposition Chadema party in the commercial capital, Dar es Salaam - for 48 hours, pending criminal charges, the commissioner of the city's Kinondoni district, Ali Hapi, said.\n\"She should be questioned and sent to court to explain the insults she made against our president,\" Mr Hapi told journalists.\nHe did not say what the insults were but Tanzania's Citizen newspaper reported, external that it was related to President Magufuli's stand that teen mothers should not return to school after giving birth.\nInsulting the president was made a criminal offence under a contrtversial cyber crimes law passed in 2015 before Mr Magufuli came into office.\nMore than 10 people, including university students and a lecturer, have been charged in court over the past few months with insulting the president via social networking platforms like WhatsApp, according to Reuters news agency.\nIvory Coast park removed from endangered list\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nUnesco says it has decided to remove Ivory Coast's Comoe National Park from its list of endangered world heritage sites following \"very positive\" conservation efforts.\nIn a statement following a meeting of its World Heritage Committee in the Polish city of Krakow, Unesco said:\nQuote Message\nPopulations of iconic species such as elephants and chimpanzees that were thought to have disappeared from the site are reproducing again and the state of conservation of habitats is now very positive.\nQuote Message\nTargets for fauna conservation have in fact been met and even surpassed.\"\nThe park, in northern Ivory Coast, was declared a world heritage site in 1983 and is one of the largest protected areas in West Africa.\nIt is known for its diverse plant life and contains plants usually found much further south, such as shrub savannas and patches of thick rainforest.\nUnesco cited poaching, fires and overgrazing as causes for concern when it listed the park as endangered in 2003.\nTestosterone tests may return to athletics\nNick Cavell\nBBC Africa Sport\nSouth Africa’s Olympic 800 metre champion Caster Semenya looks set to be the centre of attention once again in the coming weeks - and not for her performances on the track - in the build up to the World Athletics Championships in London next month.\nThis comes after athletics world governing body the IAAF has published research today, external which could lead to female athletes like Semenya being banned from future Games because of their high naturally-occurring testosterone levels.\nThe research began two years ago when the Court of Arbitration of Sport (CAS) forced the IAAF to prove testosterone levels gave female athletes an advantage.\nThe IAAF will present their findings to CAS later this month.\nRead more on the BBC Sport website.\nAlgerian told 'not to write about army'\nA PhD student in Algeria says her university is withholding her degree because of objections to the political content of her thesis.\nAn official at the faculty said there were concerns over the way she presented the military.\nLeila Sidhoum has accused the Faculty of Political Science at the University of Algiers 3 of censorship and intimidation.\nShe said she had already successfully defended her work before a board.\nMs Sidhoum, who is also an assistant professor at the university, themed her work on the role of governing elites in the democratic transition in Algeria, from 1989 to 2016.\nShe said she has been told to remove parts of the thesis referring to the army, the president and the banned Islamic Salvation Front party (FIS).\nRead the full BBC story here\nGhana miners trapped underground\nThomas Naadi\nBBC Africa, Accra\nEmergency workers in Ghana are trying to rescue 17 miners trapped in an illegal mining pit since Sunday.\nThe pit, in Prestea-Nsuta town in the Western region, caved in, trapping the miners more than 25 metres underground. Five managed to escape, according to local police. Rescue efforts are still ongoing 48 hours later in the hope of finding survivors.\nIllegal mining, allegedly led by Chinese nationals, has been a source of concern to the Ghanaian authorities both because of safety issues and its destructive impact on the environment. Several arrests have been made and equipment seized.\nThe government has now set up a task force to investigate the problem as the number of accidents increase.\nRead: How I funded my studies by digging for diamonds\nNigeria's Islamist militants 'defeated but 'not eliminated'\nTerrorism is \"resilient\" but the Islamist militant group Boko Haram has been defeated militarily, Nigeria’s army chief Lt Gen Tukur Yusuf Buratai has told BBC Hardtalk.\nSpeaking last Thursday he told Stephen Sackur his army had succeeded in pushing back Boko Haram although they had not been completely eliminated.\nWhen Muhammadu Buhari became president of Nigeria in 2015, he vowed to eradicate Boko Haram and bring security and stability to his country.\n* You can see the interview in full on Tuesday 4 July on BBC World News and the BBC News Channel and after on BBC iPlayer (UK only).\nZimbabwe employs three football coaches\nInstead of having a full-time national team coach, Zimbabwe are using three different men in charge for three different competitions they are involved in.\nZimbabwe have not formally replaced Calistus Pasuwa who left the national team job after their exit from the Africa Cup of Nations finals in Gabon earlier this year.\nInstead Norman Mapeza is in charge of Nations Cup qualifying, Rahman Gumbo for the African Nations Championship (CHAN) campaign and veteran Sunday Marimo Chidzambwa is leading the squad at the Cosafa Cup.\nAll three men have had spells in overall charge of the Warriors in the past.\nRead the full BBC story here\nIvory Coast's reconciliation commission closes down\nTamasin Ford\nBBC Africa, Abidjan\nIvory Coast’s Reconciliation and Compensation Commission (RCC) has officially ended. It was set up to identify victims of the decade long crisis. However, few people have received any money.\nThis is actually the second commission set up since the end of the civil war in 2011. The first, the Truth and Reconciliation Commission (TRC), was criticised for spending all its budget and achieving almost nothing.\nIt modelled itself on South Africa’s TRC, set up after apartheid. However, it became more of a political show than one focused on the people.\nIt was scrapped and replaced by the RCC in 2015, along with a fund of around $17m (£13m).\nIt identified more than 300,000 victims but so far only around 5,000 have received any of the money.\nThe Ministry of Solidarity is now in charge of the fund and says it will continue the commission’s mandate.\nTanzania lawmakers back controversial mining laws\nSammy Awami\nBBC Africa, Dar es Salaam\nTanzania's parliament has passed two controversial laws to bring about far-reaching reforms in the mining sector.\nOne law explicitly states that the Tanzanian people will have permanent sovereignty over all natural wealth and resources, and ownership and control will be exercised by the government on behalf of the people.\nThis means private companies would mine on behalf of the nation - whereas before the law stated that once firms signed a contract with the government, they owned the minerals.\nAnother law empowers parliament to review all agreements made by the government regarding natural resources.\nThe two pieces of legislation follow months of dispute between President John Magufuli's government and UK-listed mining firm Acacia over revenue sharing.\nAcacia is accused of under-reporting the gold and copper levels in its concentrate exports by more than 10 times and of underpaying the government tens of billions of dollars over the two decades it has been operating in the East African country.\nThe company strongly denies any wrongdoing.\nMining companies and lobby groups had urged the government to delay passing the two laws to allow for more consultation.\nThe government, however, pushed ahead with gaining parliamentary approval for the legislation.", "url": "https://www.bbc.com/news/live/world-africa-39660321"}