{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:39:14", "date_modify": "2025-04-26 07:39:14", "date_publish": "2025-02-27 13:25:35", "description": "Ulster GAA's head of stadium development says it is not to late for Gordon Lyons to \"demonstrate his bona fides\".", "filename": "news_articles_c33775l0r17o_1745653154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3c7d/live/91bca740-f50b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c33775l0r17o_1745653154.html", "title": "Lyons 'needs to show he's minister for all sports' - GAA", "title_page": "Gordon Lyons 'needs to show he's minister for all sports' - GAA - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Communities Minister Gordon Lyons needs to do more to show he is a minister for all sports, a senior member of Ulster GAA has said.\nLyons has been criticised by GAA president Jarlath Burns over his handling of the stalled redevelopment of Casement Park in west Belfast.\nThe minister said it was \"very easy to blame a unionist minister\" and insisted the hold-up was not his fault.\nSpeaking on The View on BBC One, Ulster GAA's head of stadium development Stephen McGeehan said the minster still needs to \"demonstrate his bona fides in relation to the GAA community\".\n\"I think it is probably unprecedented that a minister for sport more than one year in office has not been to a GAA fixture,\" he said, adding that since Lyons came into office only one meeting had taken place about Casement Park.\nThat meeting was held in October of last year, Mr McGeehan said.\n\"We are watching on as the minister has announced initiatives - which we welcome - in relation to the Northern Ireland Football Fund, to the progression of the IFA's national training centre and we want to see equity, we want to see a fair distribution of resources and it is time to move Casement Park on.\"\nThe GAA has enjoyed a \"constructive and hard working\" relationship with previous DUP sports ministers, Mr McGeehan added.\nHe said: \"We want that again, it is not too late for that, but the minster needs to demonstrate good faith.\n\"Our membership are frustrated. They believe there is an equality issue. We are looking for parity of esteem. If the minister was to find the time to come to a GAA event, to put time into meeting with the GAA in relation to this strategic project, I think he can still do the right thing.\"\nCasement Park represents the \"single greatest investment in a GAA, in any stadium asset in Belfast and in Northern Ireland,\" he added, but as of yet, the minister \"has not demonstrated to date his willingness, by his actions\" to move it forward.\nEarlier on Thursday, Lyons hit back at claims that he had helped to create a \"hostile atmosphere\" for the GAA.\nHe said that £17m had been spent preparing for the full redevelopment of the Casement site.\nLast week, Burns pointed to a range of issues facing the GAA and added: \"We are operating in a very hostile environment, there's no doubt about it, and it's disappointing to say that because of all the work we do reaching out.\"\nAt a meeting on Thursday of the communities committee at Stormont, this was put to Lyons by Sinn Féin MLA Nicola Brogan.\nHe responded: \"I certainly wouldn't agree with that characterisation at all, that there is any way a hostile environment towards Jarlath or the GAA.\n\"I can understand his frustration. I can understand why after 14 years of no action being taken that he is frustrated but there is certainly not a hostile environment that I am presiding over within this department.\n\"When he has requested to meet with me, I have met with him. Officials engage regularly, at least once a month on this issue.\"\nThe minister added: \"He may well be under pressure from within his organisation as well, and I understand that.\n\"I don't think it is right to say that there is a hostile environment.\n\"It can be very easy sometimes to blame politicians, very easy to blame a unionist minister but that simply doesn't match up with the reality of what we've been doing in the department.\"\nBrogan responded by saying Lyons should be \"pushing forward\" the Casement redevelopment.\nShe said: \"I can totally understand the frustration of both Jarlath and Gaels right across the north at delays to this, and I do think as communities minister, it is your job to carry on that executive flagship project and see this project actually delivered.\"", "url": "https://www.bbc.co.uk/news/articles/c33775l0r17o"}