{"authors": ["Neyaz Farooquee", "www.facebook.com"], "date_download": "2025-04-26 03:43:51", "date_modify": "2025-04-26 03:43:51", "date_publish": "2025-03-05 08:02:05", "description": "Christian Michel has been held for six years in the high-profile AgustaWestland corruption case.", "filename": "news_articles_crrdqp9y212o_1745639031.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9995/live/e9327760-f985-11ef-8040-9f598afd05a7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrdqp9y212o_1745639031.html", "title": "AgustaWestland: Indian court orders release of Briton Christian Michel held without trial for years", "title_page": "AgustaWestland: Indian court orders release of Briton Christian Michel held without trial for years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A British man detained in India for six years without trial over a high-profile corruption case must be released on bail, the Delhi High Court has ruled.\nChristian James Michel, an arms consultant, is accused of bribing Indian officials to win a multimillion-dollar helicopter contract for British-Italian defence company AgustaWestland. He denies the charge.\nHe was extradited to India from the United Arab Emirates in 2018 and has been in custody ever since, in what a judge called an \"exceptional\" situation.\nThe AgustaWestland controversy was one of several corruption cases linked to India's former ruling Congress party, some of which fizzled out eventually.\nIn 2010 the Indian government signed a deal with AgustaWestland's parent company to purchase 12 helicopters.\nThe alleged irregularities came to light when India's federal auditor reported that the government may have vastly overpaid for the $753m (£455m) deal, which was eventually scrapped in 2014.\nAccording to court documents, Mr Michel is alleged to have received around €42m ($44.7m, £25m) for securing the contract. His lawyer has argued that there is no evidence to connect him with the alleged offence.\nIndia's financial crime fighting agency and domestic crime bureau have held separate investigations into Mr Michel.\nBut both of those investigations have yet to be concluded and trials have yet to begin, leading to a \"prolonged incarceration\" of Mr Michel, the Delhi High Court noted.\nThe judge said his six years in pre-trial custody was also \"alarmingly close\" to the maximum punishment of seven years' imprisonment for money laundering, which is one of the charges he faces.\nThe court decided to grant him bail in one of the cases, after the Supreme Court did the same in another case on 18 February.\nThis means that Mr Michel is now free to leave Delhi's high-security Tihar jail, but he cannot leave India as his passport has been seized.\nThe deal for 12 three-engine AW-101 helicopters was signed in February 2010 after AgustaWestland beat off competition from US and Russian rivals.\nThe aircraft were intended for an elite squadron of the Indian air force which ferries around the president, the prime minister and other VIPs.\nOnly three of the helicopters were delivered to India before the deal was scrapped.\nItalian prosecutors suspected that kickbacks worth almost $67.6m were paid to Indian officials to secure the contract.\nGiuseppe Orsi, the former chief of AgustaWestland's parent company which at the time was called Finmeccanica, and Bruno Spagnolini, the former head of AgustaWestland, were tried in Italy on fraud and corruption charges.\nBoth were acquitted in 2018. Indian officials have said their acquittals would have no bearing on the case in India.\nIndia's air force chief at the time of the deal was arrested for bribery in 2016, and later released on bail.\nFollow BBC News India on Instagram, external, YouTube, external, Twitter, external and Facebook, external", "url": "https://www.bbc.co.uk/news/articles/crrdqp9y212o"}