{"authors": ["Chris Page", "www.facebook.com"], "date_download": "2025-05-19 15:36:09", "date_modify": "2025-05-19 15:36:09", "date_publish": "2015-02-05 17:14:41", "description": "The case of a controversial cake has started a debate in Northern Ireland about rights, identity and values.", "filename": "news_uk-northern-ireland-31155548_1747668969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/78790000/jpg/_78790826_andrewmuir.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31155548_1747668969.html", "title": "Conscience clause 'gay cake' case leads to wider debate over rights and values", "title_page": "Conscience clause 'gay cake' case leads to wider debate over rights and values - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The case of a controversial cake has started a debate in Northern Ireland about rights, identity and values.\nFor both sides, the issues go to the heart of what sort of society people want to live in.\nThe Equality Commission's lawsuit against Ashers Baking Company is due to be heard in the High Court in March.\nThe Christian owners of the business refused a request to bake a cake bearing a slogan in support of gay marriage.\nThe story has been the catalyst for the DUP to put forward legislation designed to prevent such a case happening again.\nLagan Valley MLA Paul Givan will bring it before the Stormont assembly as a Private Member's Bill.\nHe said: \"This would not allow the LGBT community to be discriminated against on the basis of their sexual orientation.\n\"But it would give protection to the faith community to provide their services in accordance with their religious beliefs.\n\"So it's striking the balance between those two competing strands of competing legislation.\"\nThe Freedom of Conscience Bill would amend the Equality Act (Sexual Orientation) Regulations - a law that has been in force since 2006.\nThe draft legislation, as it currently stands, would mean religious adoption agencies would not be required by law to place a child with a same-sex couple.\nIt would also make it lawful for businesses to restrict the provision of goods, facilities and services under certain circumstances.\nThe draft bill says businesspeople could do this in order \"to avoid endorsing, promoting or facilitating behaviour or beliefs which conflict with strongly-held religious convictions\".\nCatholic bishops are yet to formally respond to the consultation.\nBut according to Fr Tim Bartlett, from the Catholic Council on Social Affairs, they like the idea.\n\"In principle we support the motivation behind it, and the purpose of it,\" he said.\n\"At present, any citizen could be jailed, fined, or lose their job because they hold a perfectly legitimate and rational view in a free and democratic society.\n\"That can't be right.\"\nOther faith groups generally agree.\nBut there are many passionately held views on the other side of the argument.\nAt the weekend, opponents of the DUP's proposals held rallies in Belfast, Londonderry and Newry.\nThe singer Brian Kennedy was among those who spoke at Belfast City Hall.\nHe said: \"I have one thing to say to Peter Robinson - get out of my gay life.\"\nPUP councillor Julie-Anne Corr-Johnston is also scathing about the idea of the clause.\nShe recently entered a civil partnership and said if the bill was passed, it would make Northern Ireland a \"cold house\" for people like her.\nShe accused the DUP of \"legalising discrimination\".\n\"On the one hand they tell us the British identity of Northern Ireland citizens is under threat,\" she said.\nPaul Givan said he hopes the opponents of the bill will allow it through its first debate in the assembly, so it can be scrutinised by a committee.\nBut he also said if the bill does not succeed, he still believes bringing it forward will have been worthwhile.\nThe DUP's public consultation, external is open until 27 February.\nAround a month later, the Ashers Baking Company case is due to be heard in the High Court.\nIt is likely the bill will go before the assembly before the general election in May.\nNo matter how far the legislation gets - it will provoke more passionate arguments around what has become a touchstone issue.\nYou can see more about this story later when the The View is broadcast on BBC One Northern Ireland at 22:40 GMT", "url": "https://www.bbc.com/news/uk-northern-ireland-31155548"}