{"authors": ["Greig Watson", "www.facebook.com"], "date_download": "2025-04-26 04:40:27", "date_modify": "2025-04-26 04:40:27", "date_publish": "2025-03-02 07:27:15", "description": "Completed in 1931 as a purpose-built global business hub, it went on to become a community asset.", "filename": "news_articles_cr7eyep8yxeo_1745642427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c45b/live/582ed990-f050-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr7eyep8yxeo_1745642427.html", "title": "How a closed building reflects Nottingham's 'social changes'", "title_page": "How a closed building reflects Nottingham's 'social changes' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Built more than 90 years ago as the headquarters of bike manufacturer Raleigh, the Howitt Building in Nottingham went on to become a business centre and community hub.\nBut the Grade II-listed building on Lenton Boulevard is now facing an uncertain future after Nottingham City Council ordered it to close at the end of December over safety concerns about the fire doors.\nThe authority, which said it would work with tenants and businesses to \"minimise\" disruption, has not yet confirmed its long-term plans for the site.\nHilary Silvester, from Nottingham Civic Society, says the building reflects \"the social changes the city has seen\", adding it would be \"the greatest shame if that legacy was lost\".\nThe Howitt Building was completed in 1931 to the designs of architect T Cecil Howitt, who was also responsible for the city's Council House and Home Brewery Building.\nMrs Silvester said Raleigh was \"one of Nottingham's 'big three', along with Boots and Players\".\n\"The owners of the businesses wanted their buildings to reflect their importance,\" she explained.\n\"Raleigh was worldwide business, so it wanted offices which would project that status.\n\"But its influence wasn't just about money, it had a big social impact.\n\"It was known for employing women and Nottingham gained a reputation for being a women's city.\"\nThe offices were described in the company's commemorative booklet as \"probably unexcelled in architecture, business equipment and hygienic planning\".\nOne of the striking features is the ballroom, which featured a sprung floor, a stage, and dressing rooms for productions.\nThe upper floor also housed a dining room and a reading room.\nMrs Silvester said: \"At this time companies were more family-minded, they actually provided facilities for their staff and workers.\n\"They had societies like drama and ballroom dancing and sports.\n\"My father worked there for 30 years and I remember going in and being so impressed by this big entrance hall and what the company was doing.\"\nIan Wells, also from the Nottingham Civic Society, said: \"The building has a sleek, Art Deco look.\n\"It also has these friezes of near-naked cherubs, which are a mark of Howitt's work, but it looks a little unsafe as they work on building bicycles.\n\"It is an excellent example of architecture and all the more impressive for how well it is preserved, with so many original features like panelling and stained glass windows.\"\nAt its height, Raleigh employed well over 8,000 people and was producing more than one million bikes a year.\nAfter World War Two, workers from across the Empire were invited to Britain and many came to work at Nottingham, with Raleigh again playing a central role in the sometimes difficult social changes.\nAccording to Historic England, Oswold George Powe, a leading member of Nottingham's African-Caribbean community, succeeded in changing the firm's employment policy following a bicycle boycott in Jamaica.\nRaleigh is said to have then become the largest employer of African-Caribbean workers in Nottingham.\nA document, seen by the BBC earlier in February, stated the council is considering various options for the building's future, including remediation works or potentially selling it.\nThe authority said on Friday that \"no decision regarding the long-term future of the site\" had been made.\nHowever, it said a recent risk assessment highlighted \"critical concerns\" regarding the fire doors and compartmentalisation throughout the building, which \"present a significant risk to life in the event of a fire\".\nA \"comprehensive survey which will determine the full extent of the works and costs required to address the outstanding issues\" is under way, the council added.\nOnce complete, \"all viable options will be considered in consultation\".", "url": "https://www.bbc.co.uk/news/articles/cr7eyep8yxeo"}