{"authors": ["Kelly Bonner", "www.facebook.com"], "date_download": "2025-04-26 03:55:59", "date_modify": "2025-04-26 03:55:59", "date_publish": "2025-03-04 15:28:10", "description": "Denis Shearer, 25, from Bangor, was attacked during his sleep and later died in hospital from his injuries.", "filename": "news_articles_cvgwn9klgyvo_1745639759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a36e/live/10999fe0-f909-11ef-bc87-ad84b3fde561.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwn9klgyvo_1745639759.html", "title": "Dennis Shearer: Man killed in 'brutal and sustained attack', court told", "title_page": "Dennis Shearer: Man killed in 'brutal and sustained attack', court told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"vulnerable\" Bangor man, who was attacked while he slept in his bed, died in a \"brutal and sustained attack\", Belfast Crown Court has heard.\nDennis Shearer was struck up to nine times in the head by his cousin's partner at his home on 28 February 2021 and died in hospital nine days later.\nTimothy Walker, 43, whose address was given as HMP Maghaberry and who is originally from Abbey Ring in Holywood, pleaded guilty to the murder of Mr Shearer and was given a life sentence in December 2024.\nNatalie Brannigan, 42, from The Green in Holywood, admitted a charge of assisting offenders.\nBrannigan accepted that the night of the assault, she collected Walker and drove him to Holywood and Newtownards.\nOn Tuesday, a prosecution barrister told the court that Mr Shearer suffered \"significant injuries\" because of the \"brutal force\" used by Walker.\nMr McDowell KC said: \"Mr Shearer was vulnerable and was attacked in his sleep with no way of defending himself\".\nThe court heard that the month before Mr Shearer's murder, there was a serious allegation made against him, which was reported to police.\nThe prosecution barrister told the court Walker broke into Mr Shearer's home, where he lived with his elderly step parents, closed his stepparents bedroom door and carried out a \"vigilante attack\" on the 25-year-old, \"taking the law into his own hands\".\nMr Shearer's foster mother heard him \"shouting in pain\".\nWhen she went into his bedroom, she found his body. She shook his leg as he lay in bed and shouted his name, but there was no response.\nThe court heard there was \"blood on the duvet and pillow\" with \"blood on the walls and ceiling\".\nThe prosecution barrister told the court they could \"easily draw inference, the intent was to kill\".", "url": "https://www.bbc.co.uk/news/articles/cvgwn9klgyvo"}