{"authors": ["Simon Jack", "www.facebook.com"], "date_download": "2025-04-26 08:11:15", "date_modify": "2025-04-26 08:11:15", "date_publish": "2025-02-26 12:04:48", "description": "The oil and gas producer faces criticism for its shift away from green energy, but many support it.", "filename": "news_articles_c0mw1yw3kyvo_1745655075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/92bd/live/f97bad40-f439-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw1yw3kyvo_1745655075.html", "title": "BP's shareholders want it to make money, not climate policy", "title_page": "BP's shareholders want it to make money, not climate policy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It was more than 20 years ago that the then boss of BP reframed those famous initials as \"Beyond Petroleum\".\nIt was the first tentative step in transforming the company from an oil and gas producer to an energy provider investing an increasing amount of its fossil fuel profits into greener technology.\nFive years ago, chief executive Bernard Looney, who was in charge at the time, accelerated that process with ambitious targets to cut oil and gas production 40% by 2030, while massively ramping up investment in wind and solar.\nToday, BP could stand for \"Back to Petroleum\" following its announcement to shift back to oil and gas production and slash investment in renewables.\nWhy?\nProfit and share price. There is simply less money in renewables than in oil and gas and some BP shareholders have become angry and impatient as they watch Shell produce double the returns they have seen while Exxon investors have received four times as much.\nFor most - but not all - shareholders, the number one job of a company's board and management is to maximise the value of the company.\nBP's failure to do this has led to active speculation that BP should be taken over by a company that understands this. Or one that list its shares in the US where investors are less interested in a green transition.\nNot all shareholders agree with BP's radical strategy shift back to petroleum. Dozens of them signed a letter expressing concern about increasing fossil fuel production and want to have a say in the company's direction of travel.\nBP's move follows rivals' Shell and Norwegian company Equinor scaling back of plans to invest in green energy. Meanwhile, US President Donald Trump's \"drill baby drill\" comments have encouraged investment in fossil fuels.\nMany groups say that long term BP and others are pursuing a no-win strategy.\nClimate concerns will become so acute that much of the oil and gas they're searching for will have to remain in the ground and become unusable \"stranded assets\" of no commercial value.\nHowever, the least patient shareholders tend to have the loudest voices.\nAs such, the cries of dismay from those concerned about the climate are being drowned out by those demanding that BP does what it knows best: drilling for oil and gas and returning those profits to shareholders, who include millions of pension savers.\nThey would say it is not BP's job to question how much oil and gas the world wants or needs - that is the job for the societies it serves and their policy makers.\nAnd, while the UK government has decided it wants no new oil and exploration in UK waters, over 90% of BP's activities are outside the UK and the current US government thinks very differently.", "url": "https://www.bbc.co.uk/news/articles/c0mw1yw3kyvo"}