{"authors": ["Rachel Russell", "www.facebook.com"], "date_download": "2025-04-26 03:57:01", "date_modify": "2025-04-26 03:57:01", "date_publish": "2025-03-04 14:30:19", "description": "Residents are urged to help during Empty Homes Week, as the city has \"a high level of housing need\".", "filename": "news_articles_c4g087x4w3qo_1745639821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/870b/live/ad7006c0-f8f9-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g087x4w3qo_1745639821.html", "title": "Report empty homes and we'll revamp them, says Hull City Council", "title_page": "Report empty homes and we'll revamp them, says Hull City Council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People are being urged to report empty houses so they can be brought back into use.\nHull City Council has launched the appeal as part of national Empty Homes Week.\nCouncillor Paul Drake-Davis, who leads on housing at the authority, said the city had \"a high level of housing need\".\nBut there were 4,767 private homes known to be empty, with 1,963 of them out of use for six months or more.\n\"Empty – usually dilapidated – properties deprive people of much-needed homes,\" Drake-Davis said.\n\"They also have a negative effect on neighbourhoods, making them look uncared for and can encourage anti-social behaviour and rodent infestations.\"\nHe said the council would do \"everything within our power\" to bring homes back into use and called on residents to help by offering their \"local knowledge\".\nAccording to the council, an empty home can be reported on the authority's website. It will then be checked and boarded up, with rubbish cleared and any water leaks stopped.\nThe owner will be contacted to discuss the next steps, which could include a sale to a private landlord, an agreement allowing the council to rent it out, or acquisition by the council.\nA spokesperson for the authority said it was \"retrofitting\" empty properties to be \"more energy efficient and healthier\".\nOne example of this work was in De Grey Street, where a row of flats and houses was being brought back into use by contractor Kingston Works Limited.\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c4g087x4w3qo"}