{"authors": ["Samantha Granville", "www.facebook.com"], "date_download": "2025-04-26 03:47:32", "date_modify": "2025-04-26 03:47:32", "date_publish": "2025-03-04 18:50:45", "description": "His defamation action says she admitted being pressured into making false claims, in an \"evil conspiracy\".", "filename": "news_articles_c5y08ye0xm2o_1745639252.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c2d7/live/e64a2590-f8b6-11ef-9926-81148c3c1dca.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y08ye0xm2o_1745639252.html", "title": "Jay-Z sues woman who dropped rape claim against him", "title_page": "Jay-Z sues woman who dropped rape claim against him - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jay-Z is suing a woman who in February withdrew her legal action accusing the rapper of rape.\nHis defamation action claims she \"voluntarily admitted\" being pressured into making false claims in what it describes as an \"evil conspiracy\" to extort money and damage his reputation.\nThe anonymous woman filed her legal action in October and refiled it in December, accusing Jay-Z, real name Shawn Carter, and Sean \"Diddy\" Combs of raping her aged 13, after the 2000 MTV Video Music Awards.\nBoth rappers denied the allegations.\nJay-Z's defamation action, filed at a federal court in Alabama, also accuses the woman's lawyer, Tony Buzbee, and his co-counsel, David Fortney, of orchestrating her lawsuit.\nMr Buzbee has garnered headlines internationally over the dozens of legal actions he has filed on behalf of people accusing Mr Combs of sexual misconduct, extortion, assault and other transgressions.\nMr Combs has denied all the allegations.\nHe is also facing federal sex-trafficking and racketeering charges, to which he has pleaded not guilty.\nJay-Z's defamation action says the woman told his legal team her lawyers had made her make the false allegations.\n\"Buzbee brought Jay-Z into it,\" it says she said.\nAnd despite her admitting Jay-Z \"did not sexually assault [her],\" Mr Buzbee \"pushed [her] towards going forward\" with the false story to strengthen the case and extort more money, the defamation suit claims.\nJay-Z's action also notes alleged discrepancies in the woman's interview with NBC News last year, including naming another celebrity guest at the MTV party, who had, in reality, been performing in a city thousands of miles away on the night.\nHer father also contradicted her claim he had picked her up after the alleged assault, it claims.\nJay-Z's defamation action says Mr Buzbee's firm failed to vet the claims and the woman, who they say has a history of mental health issues and an assault charge.", "url": "https://www.bbc.co.uk/news/articles/c5y08ye0xm2o"}