{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:18:33", "date_modify": "2025-04-26 04:18:33", "date_publish": "2025-03-04 06:26:40", "description": "The ancient game often falls in the school holidays when it is easier for young people to join in.", "filename": "news_articles_cz9ny27qp28o_1745641113.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee99/live/c5786760-f84c-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9ny27qp28o_1745641113.html", "title": "Plea for players to join term-time Shrovetide game", "title_page": "Plea for players to join term-time Shrovetide game in Alnwick - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The organiser of one of five remaining Shrovetide football games to take place around the country say he hopes a decent number of players will still turn up, despite the event falling in term-time this year.\nThe event, in Alnwick, Northumberland, dates back to at least 1762, and is played on the fields by the River Aln, following a procession from Alnwick Castle.\nAbout 80 players took part last year when Shrove Tuesday fell in the school holidays.\nOrganiser Archie Jenkins said: \"We do get a few less when the date falls in term-time and we do worry, but hopefully they'll go up again the following year.\"\nThe historic Shrovetide game has virtually no rules and no referee.\nOnce played in many towns and villages around England, just a handful of places continue the tradition - including Alnwick and Sedgefield in County Durham.\nIn Alnwick, players representing the parishes of St Michael's and St Paul's attempt to get the ball through large homemade goals known as hales.\nIn 2024, St Michael's were the winners with the final score being 2-1.\nAt the end of the game, the ball is kicked into the river with the person who dives in to retrieve it and take it to the other side known as 'the ball winner'.", "url": "https://www.bbc.co.uk/news/articles/cz9ny27qp28o"}