{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:36", "date_modify": "2025-05-19 15:30:36", "date_publish": "2015-02-04 15:40:34", "description": "Scotland's Finance Secretary John Swinney said his budget plans would create a \"more prosperous and fairer Scotland\".", "filename": "news_uk-scotland-scotland-politics-31128689_1747668636.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80787000/jpg/_80787541_hi025725954.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-politics-31128689_1747668636.html", "title": "More health cash in Scottish Budget 2015-16 plans", "title_page": "More health cash in Scottish Budget 2015-16 plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland's Finance Secretary John Swinney said his budget plans would create a \"more prosperous and fairer Scotland\".\nMr Swinney, who is also deputy first minister, was speaking as Holyrood debated his plans for next year.\nAfter the debate, MSPs gave final approval to the 2015-16 budget by 64 votes to 53, with 3 abstentions.\nMr Swinney had told MSPs that frontline health spending would rise by £383m next year, up to more than £12bn.\nThis would include an extra £127m which had not previously been announced, he said.\nIn his statement to the Scottish Parliament, the minister challenged local authorities over teacher numbers, threatening to withhold extra funding if they were not prepared \"to sign up to a clear commitment to protect teacher numbers\".\nResponding to Mr Swinney's statement, Scotland's largest teachers' union, the EIS, slammed the local authority group Cosla for its continuing refusal to sign up to a new agreement on maintaining teacher numbers.\nGeneral Secretary Larry Flanagan said: \"It seems that, despite Cosla's repeated statements about its commitment to protect education, their objective is to slash education budgets and cut teacher numbers even further - with serious consequences for pupils across Scotland.\n\"Teacher numbers have already been, quite literally, decimated over the past decade in that there has been a near 10% reduction in the number of teachers working in our schools.\"\nMr Swinney told the Scottish Parliament: \"The health of our population and the education of our young people are two of the most important responsibilities of government and they are at the top of our priorities.\"\nLabour's finance spokeswoman Jackie Bailie said the extra health spending was as a result of the Barnett consequentials which resulted from extra spending in England.\nShe said: \"There is not one penny more allocated to health than simply announcing what you would do with the remaining £127m consequentials.\"\nOn education, she said the finance secretary had not reached a deal with local authorities and had imposed a settlement.\nMs Baillie said: \"The concordat, that he signed up to, now lies in tatters.\"\nShe said that one local authority had complained that the money offered by Mr Swinney would not even cover the advertising bill for new teachers.\nMr Swinney asked if Ms Baillie would encourage Labour councils to sign up to the agreement.\nShe said: \"Our position is to maintain teacher numbers, the SNP promised to do just that, yet you have failed miserably.\n\"We now have almost 4,500 fewer teachers in Scotland today than when you took charge.\"\nTory economy spokesman Gavin Brown said: \"The education of our children in Scotland is best served if all levels of government work together to achieve outcomes instead of using a budget speech as a platform for creating a turf war with Cosla.\"\nMr Brown said the three most significant changes from the draft budget were down to UK chancellor George Osborne.\nHe said money was flowing to health through Barnett consequentials, business rates increases were being capped at 2% and changes had been made to the Land and Buildings Transaction Tax (LBTT) due to the actions of the Tory-led coalition at Westminster.\nScottish Liberal Democrat leader Willie Rennie says the context of the budget was one of an economy in recovery.\nEmployment was up, GDP was up and unemployment was down, he said.\nMr Rennie added: \"That is due to a plan the SNP were against.\"\nOther measures set out by Mr Swinney, which were not in the original budget included:\nThe Scottish government had already put forward plans to spend £4.5bn on infrastructure investment in 2015-16.\nInvestment of more than £390m should provide 6,000 new affordable homes, while more than £300m is to be spent extending free childcare to all three and four-year-olds and some vulnerable two-year-olds.\nIn addition, the Scottish government said £81m had been set aside to \"mitigate against changes to housing benefit\" which have been branded the \"bedroom tax\".\nFurther money is being made available to allow local authorities to continue the council tax freeze.", "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-31128689"}