{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 13:30:42", "date_modify": "2025-05-20 13:30:42", "date_publish": "2023-08-02 00:00:00", "description": "The ex-president claims he has \"never had so much support\" after being charged with plotting to overturn the 2020 election.", "filename": "news_live_world-us-canada-66248859_1747747842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/118E7/production/_130611917_trump-gettyimages-1526761038.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-us-canada-66248859_1747747842.html", "title": "Trump indictment: Ex-president hits out at 'corruption and scandal' after new charges", "title_page": "Trump indictment: Ex-president hits out at 'corruption and scandal' after new charges - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all for now\nWe're wrapping up our live coverage for today. We'll be back tomorrow ahead of Donald Trump's arraignment at federal court in Washington DC.\nFor more analysis on what these charges mean for the former US president, read this story from North America editor Sarah Smith.\nWe also have stories on the key takeaways from the indictment, Republican reactions to the news, Trump's rising poll numbers and a look at the judge who will try Trump's case, Tanya Chutkan.\nThank you to all the reporters who worked on covering this story, including Nomia Iqbal at court in DC, Sam Cabral and Bernd Debusmann Jr in Washington DC and Jacqueline Howard, Ali Abbas Ahmadi, and Sam Hancock in London.\nCome back tomorrow for our continued coverage.\nCourthouse to clear out for Trump visit\nWe've just heard that officials at the US District Court in Washington DC have rescheduled several other court appearances on the docket tomorrow - including those of several people facing charges for their participation in the 6 January riot at the US Capitol.\nThose who were scheduled to appear in court included a former Chicago police officer, Karol Chwiesiuk and Jay Johnson, an actor and comedian who was fired from the popular cartoon \"Bob's Burgers\" after it emerged he participated in the riot.\nWe don't have many more details, but it's likely that the court appearances are being rescheduled because of restrictions and security procedures being put into place for Donald Trump's arraignment.\nWe expect to have more details on that appearance by the end of the day today.\nWhat will Trump's defence be?\nDonald Trump has yet to appear on the charges in this indictment, but we're beginning to get a glimpse at what his legal defence might look like.\nOne of his lawyers, John Lauro, told NBC earlier today that Trump's efforts to reverse the results of the 2020 presidential election were based on legal advice he received at the time.\nLauro specifically laid the blame on a former Trump lawyer, John Eastman, who played a role in encouraging Trump to call on then Vice-President Mike Pence to declare Trump the winner of the election.\nEastman is one of six co-conspirators in the most recent indictment.\n“You’re entitled to believe and trust advice of counsel,” Lauro said. “You had one of the leading constitutional scholars in the US, John Eastman, say to President Trump, ‘This is a protocol that you can follow, it’s legal.’”\nLauro added that he believes this \"eliminates criminal intent\" on Trump's part.\nThe former president's legal team is also likely to argue that Trump's call on supporters to march \"peacefully\" on the Capitol absolves him of responsibility for the violence that took place on 6 January.\nWill Trump be arrested?\nWhile Donald Trump is expected in court on Thursday, the appearance does not mean he is going to be arrested. He's also been given the option to appear virtually.\nIf he's seen in court, it will be similar to what we've seen before in New York City and Miami after his two previous indictments.\nTomorrow, Trump will appear before Judge Moxila Upadhyaya at 1600 local time (2100 BST). He may be asked to enter a plea - although whether he will do so remains unclear.\nJudge Upadhyaya will then set release conditions. In his last court appearance, in Miami, the judge agreed to release him without bail. He did not have to surrender his passport or have to agree to pre-trial travel restrictions or other typical requirements.\nTypically, federal defendants are also fingerprinted during processing. It is unlikely that Trump, however, will have to submit his fingerprints or a DNA sample, or have a mugshot taken.\nWill any of this matter to voters?\nSarah Smith\nNorth America editor\nAll over America I have met countless Republicans who appear to sincerely believe that Donald Trump really did get more votes than Joe Biden in 2020 and was cheated out of office.\nHow will these people react when they hear detailed evidence that Trump knew there was no evidence of electoral fraud? That he was told again and again, by his trusted inner circle, that he had lost the election? Can their faith withstand the weight of the evidence the prosecution will bring to court?\nA trial could take place in the middle of the next presidential election. So voters - and not just Trump's base but moderate Republicans, independents and crucial swing voters - will hear detailed allegations of \"dishonesty, fraud and deceit\" whilst being asked to vote him back into office.\nIt is such a cliché to describe events involving Trump as \"unprecedented\". But what other word is there to describe the prospect of a US presidential candidate running a re-election campaign while being prosecuted for attempting to subvert the results of the last election?\nRead more from Sarah here.\nWhy aren't Trump's alleged co-conspirators named?\nThe indictment lists six 'co-conspirators' who allegedly helped Donald Trump try to overturn the election. They aren't named in the indictment, nor have any charges been levelled against them.\nSo why mention them at all?\nEssentially, in order to be part of a conspiracy, you have to conspire with others. For prosecutors to back up the claim of a criminal conspiracy to interfere with the election, they have to show evidence others were involved.\nThere could be a number of reasons why the alleged co-conspirators are nameless, according to Aziz Huq of the University of Chicago Law School, such as the potential that these individuals could be co-operating with investigators.\nThat means they might testify in court.\nAnd, just because none of the alleged co-conspirators have been charged now, that doesn't mean prosecutors won't seek charges in the future.\nYou can read more about this here.\nTrump’s backers flip the script on ‘election interference’\nMike Wendling\nUS disinformation reporter\nWith their man accused of election interference, Donald Trump’s supporters are responding by alleging… election interference.\nA broad claim is emerging - that the indictment is a naked political play meant to thwart Trump’s latest presidential campaign and thus affect the outcome of the 2024 election.\nThe sentiment was captured in a post by Marjorie Taylor Greene, the congresswoman who’s one of Trump’s biggest backers.\n“The politicized and weaponized DOJ [Department of Justice] is now committing election interference with this outrageous conspiracy theory,” she wrote on social media.\nThe supporters are taking their cues from the top. The former president has himself shouted about “election interference” several times in different contexts on his Truth Social network.\nIt’s a tactic that he's used before to defang his critics.\nRemember the phrase “fake news”? That originally referred to a bizarre phenomenon whereby teenagers in the Balkans were pumping out false pro-Trump news stories to make advertising money.\nBut then, at a press conference shortly before he took office in 2017, Trump railed against the “fake news” media, and journalists scrambled to find other terms for the sea of online rubbish.\nMaybe he hopes to similarly muddy the meaning of “election interference”. However, this time the charges will be litigated in a court of law, not just the court of public opinion.\nWhat's Biden up to right now?\nJoe Biden is keeping his distance both figuratively and literally from the legal storm encircling Donald Trump over the last day or so.\nBiden is currently on summer holidays at his beach house in Delaware and spent the morning riding his bike in the sunshine.\nLast night, he took wife Jill on a date night.\nThey went to the cinema to see the blockbuster Oppenheimer followed by a moonlit walk.\nThis morning, he cycled past a group of reporters keen for a soundbite, offering only a greeting as he cruised by.\nRecap: What's happened today\nIt has been a whirlwind day of reaction and speculation and following Trump's indictment on four charges connected to the 6 January riot - you can watch special counsel Jack Smith announce the move above.\nThe charges are conspiracy to defraud the United States, conspiracy to obstruct an official proceeding, obstruction of and attempt to obstruct an official proceeding, and conspiracy against rights\nHere's a look at what's happened in the hours since:\nImmediately after the announcement, Trump's team responded by calling the indictment \"corrupt\" and a \"witch hunt\" - they also likened it to persecutions in Nazi Germany\nDonald Trump posted on his Truth Social platform that he has “never had so much support” as he does now\nWhat happens next:\nTrump is meant to appear in court in Washington DC on Thursday, but it is not clear as yet whether he will appear in person or remotely.\nTrump remains the frontrunner for the Republican nomination according to pollsters, and is neck-and-neck with President Joe Biden in a general election.\nIf found guilty on all charges, Trump could face many years in prison – but this would not prevent him from continuing to run for office.\nHow do Americans feel about 6 January and Trump charges?\nPeople in the US are still processing the news. Recent polling, however, shows that American views on the former president's role in the riot are mixed.\nOne poll, conducted by AP-NORC in April, found that 49% of Americans believe he did something illegal, compared to 19% who said his conduct was legal but unethical, and 20% who said he did nothing wrong.\nA separate poll conducted by by Yahoo and YouGov in May found that a majority of Americans - 62% - believe Trump should not be allowed to serve if convicted of a serious crime, while 23% said he should be.\nA third poll, published by the New York Times and Siena College this week found that 17% of likely voters in the Republican primaries believe Trump committed a serious offence, compared to 71% who don't.\nCould Trump supporters be in trouble too?\nSam Cabral\nReporting from Washington DC\nJohn Wiltshire asks whether Donald Trump`s supporters could also be in trouble with this latest indictment, as accessories to the alleged crime.\nThe average Trump fan, no. Those who attacked the US Capitol in January 2021, yes - and many have been.\nAccording to the Justice Department, more than 1,000 people from around the country have been charged in connection with the riot, and more than half have since been sentenced for their crimes.\nAbout 350 were charged with assaulting, resisting or impeding law enforcement that day, while others face charges such as entering a restricted federal building, destroying government property and obstructing an official proceeding.\nYesterday's indictment also lists six unnamed co-conspirators who are alleged to have unlawfully aided Trump's efforts to subvert the election. US media have named at least five, including attorneys Rudy Giuliani and Sidney Powell.\nHow is Trump not banned from running for office ever again?\nSam Cabral\nReporting from Washington DC\nJohn asks how Trump is allowed to run for president again without accepting that he lost the 2020 election fairly, and what it says about future elections in the US.\nNothing in US law requires candidates for president to state that they know they lost a previous election.\nDonald Trump's debunked claims that the 2020 election was corrupt and stolen have been a destabilising force for the country. Not only has he championed these talking points, but legions of candidates for local, state and federal office have adopted them too, with varying degrees of success.\nIn last year's midterm elections, several Trump-backed and Trump-aligned candidates were rejected by voters - in a sign that the argument is not popular, particularly with independents and moderates.\nBut Trump continues to espouse the same arguments that have been repeatedly disproven, including in court, and he remains firmly the frontrunner for the Republican nomination.\nThat would appear to indicate Republican voters have largely accepted the case he is making or are willing to overlook it because they support his agenda and believe he is the only one who can defeat Joe Biden next year.\nConstitutionally, Trump could still run if he's convicted\nNomia Iqbal\nReporting from DC District Court\nThis is Donald Trump’s third indictment and the most serious one yet.\nThe Department of Justice says the former president had the right to question the election results, but accuses him of using unlawful methods to stay in power when he - they allege - knew he had lost.\nHe remains the clear frontrunner for the Republican Party’s presidential nomination and he's said if he’s convicted or jailed, it won’t get in the way of him running for the White House.\nAnd constitutionally speaking he’s correct - there is nothing to stop him.\nIs using donations for personal defence expenses legal?\nBernd Debusmann Jr\nReporting from Washington DC\nNik Marshall-Blank asks whether it's legal for money donated to fundraising groups - known as political action committees (PACs) - to be used for Donald Trump's personal legal defence.\nThat's a complicated question but Trump's main fundraising group, Save America, has already spent more than $40m (£31m) on legal fees for the former president and his allies this year.\nMost of that money comes from small contributions from Trump supporters across the country.\nWhether or not this is legal, however, is murky.\nJason Torchinsky, a campaign finance expert at the Holtzman Vogel Law Firm, tells the BBC that Trump may be violating federal election laws by accepting donations that directly cover his legal expenses.\n\"It is not unprecedented for a campaign committee to pay legal fees,\" Torchinsky says. \"But the issue is that Trump is a federal candidate, with a third party to pay his legal bills, that really do amount to a gift to the candidate that exceeds federal contribution limits.\"\nRead more about the role contributions play in Trump's legal defence here\nWhy do Republicans not have a strong alternative candidate?\nSam Cabral\nReporting from Washington DC\nPaul Dodd asks why the Republican Party has not put up a strong alternative for the 2024 presidential nomination, with all the money it has in hand.\nRepublican voters are looking for a fighter in 2024 and many continue to see Donald Trump as a proven commodity in that regard.\nLet's also not forget that Trump used his time in office to help elevate to power those who supported him and to help push out those who opposed him. Republicans in both chambers of the US Congress, and in key positions within the Republican National Committee, which oversees the nominating process, are significantly 'Trumpier' now than when he first came to Washington.\nIn the mid-term elections last November, several Trump-backed candidates were rejected by voters, while Florida Governor Ron DeSantis was resoundingly re-elected to a second term in his post. Many in the party used those results to argue the 44-year-old could take the baton as the next conservative warrior.\nBut Trump's mounting legal troubles have proven an effective rallying cry for a voting base that believes he has been unfairly persecuted. Or as Trump puts it: \"They're coming after you - and I'm just standing in their way.\"\nAt the same time DeSantis has badly stumbled on the campaign trail, leading both potential voters and donors to reconsider supporting him. And like most of the other candidates in the 2024 race, he has largely defended Trump after each indictment rather than risk angering Trump supporters who may be looking for an alternative.\nAnti-Trump candidates like Chris Christie have gained little traction, either.\nWhy has this taken so long?\nSam Cabral\nReporting from Washington DC\nMary Ehrlich asks, given that the January 6 congressional committee uncovered so much evidence of how Donald Trump and his allies tried to remain in power, why has it taken so long for him to be indicted?\nIt took nearly a year after the Capitol riot of January 2021 for the US Justice Department (DOJ) to begin investigating the efforts of the former president to overturn the 2020 election results.\nThat's because, for an FBI twice stung by premature decisions in investigating Russian interference in the 2016 election and Hillary Clinton's email scandal, investigators did not want to launch into an investigation until solid evidence directly linked Trump and his allies to the chaos that followed the election and to the riot.\nArguably, the select committee that investigated the attack helped lay out the case to both the DOJ and to the public that there was evidence to indict Trump.\nThe committee was not authorised to bring charges against Trump - but it handed over evidence and transcripts from its probe to the DOJ last December.\nSince then, Special Counsel Jack Smith and his team has expanded its probe by interviewing various officials, and has also needed time to present its evidence to a grand jury, which voted in favour of indicting Trump.\nWill Trump still get security clearance if found guilty?\nSam Cabral\nReporting from Washington DC\nChris Reed asks: Will Donald Trump still get security clearance if he is found guilty of espionage, and still get re-elected president?\nAmerican presidents are not required to get permission to hold security clearances. Neither are vice-presidents, members of Congress, Supreme Court justices or other so-called constitutional officers.\nAccording to the Information Security Oversight Office, that's because these positions are \"prescribed by the Constitution of the United States\" and are \"deemed to meet the standards of trustworthiness for eligibility for access to classified information\".\nIn fact, as a former president, Trump is currently entitled to classified briefings on the nation's secrets.\nNo US citizen has ever been found guilty of espionage and then been elected president, so he would have access to all the same information he did in his first term - and the US would be in uncharted territory.", "url": "https://www.bbc.com/news/live/world-us-canada-66248859"}