{"authors": ["Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 03:50:33", "date_modify": "2025-04-26 03:50:33", "date_publish": "2025-03-05 12:38:08", "description": "Taranjit Singh is believed to have fled the UK after initially being given a suspended sentence.", "filename": "news_articles_c757rgq5gk5o_1745639433.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7d1f/live/a131d460-f9bc-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c757rgq5gk5o_1745639433.html", "title": "Gloucester taxi driver has sexual assault sentence increased", "title_page": "Gloucester taxi driver has sexual assault sentence increased - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A taxi driver who sexually assaulted a woman passenger is thought to have fled the country after having his sentence increased.\nTaranjit Singh, also known as Tony, from Gloucester, was found guilty of three counts of sexual assault and given a suspended two-year prison sentence in October 2024.\nThe Court of Appeal reviewed the case and decided the sentence was \"too lenient\" and increased it to four years in jail.\nA warrant is now out for the arrest of Singh, 50, and police say they are trying to locate him.\nIn November 2021 he drove the victim, who had fallen asleep, to an industrial estate, rather than her home.\nShe later awoke to find Singh sexually assaulting her.\nHe was given the suspended sentence on 18 October, but the Court of Appeal increased it to four years' imprisonment on 21 January.\nA warrant for Singh's arrest was issued by a judge the day after the Court of Appeal hearing as he is believed to have left the country.\nDet Con Annabel Brittain from Gloucestershire Police said: \"Singh's disappearance is cowardly but I am hopeful that he will soon be located so he can begin his sentence behind bars.\n\"I would urge anyone who has been sexually assaulted to report it to police and be reassured that they will be supported and that their reports will be thoroughly and sensitively investigated.\"", "url": "https://www.bbc.co.uk/news/articles/c757rgq5gk5o"}