{"authors": ["Henry Godfrey-Evans", "www.facebook.com"], "date_download": "2025-04-26 06:13:14", "date_modify": "2025-04-26 06:13:14", "date_publish": "2025-03-02 06:19:39", "description": "An animal charity is trying to raise £10,000 to fund Bear's surgery.", "filename": "news_articles_cgr22g9e5vwo_1745647994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4fd0/live/2b737960-f5d2-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgr22g9e5vwo_1745647994.html", "title": "'Terrified' dog rescued in Thaxted needs £10k leg surgery", "title_page": "'Terrified' dog rescued in Thaxted needs £10k leg surgery - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An animal charity is trying to raise £10,000 for surgery after rescuing a puppy found in shrubbery.\nThe Harlow Essex Animal Rescue Team (HEART) said a dog walker found the Caucasian shepherd soaking wet in Thaxted on 8 February.\nThe puppy had a deformed or broken leg and the charity suspected he had been abused or neglected.\nVolunteer Felicity Sutton is looking after the puppy, which has been named Bear, and described him as a \"bit of a BFG\".\nThe 34-year-old, who lives in Farnham near Stansted Mountfitchet, said it looked like Bear had cigarette burns on his face, was very skinny, smelled \"terribly\" and had \"an oil texture to his coat\".\n\"He was terrified and was kind of making squeaky noises,\" she said.\n\"[But] he became very trusting of us quite quickly\".\nHEART has raised almost £3,000 so far and Ms Sutton said vets, trainers and people providing hydrotherapy had offered help.\nShe estimated the puppy was about six months old and would double in size with age.\n\"The weight of the dog is going to get too much on his legs,\" she explained.\n\"Ultimately it'll probably shorten his life expectancy.\"\nDespite his trauma, Bear was in high spirits and welcomed visitors, she said.\n\"He wants to be as close and as on you as he possibly can,\" she added.\nMs Sutton has also rescued a one-eyed dog from Romania and a tortoise which now lives with her mother in Dunmow.", "url": "https://www.bbc.co.uk/news/articles/cgr22g9e5vwo"}