{"authors": ["Charlotte Cox", "www.facebook.com"], "date_download": "2025-04-26 07:25:37", "date_modify": "2025-04-26 07:25:37", "date_publish": "2025-02-28 00:00:48", "description": "A farmer has described Dartmoor as the \"Wild West\" amid ongoing sheep thefts.", "filename": "news_articles_cly44r4pvd5o_1745652337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd26/live/8c509d70-f510-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly44r4pvd5o_1745652337.html", "title": "'I've lost 4,500 sheep to thieves on Dartmoor'", "title_page": "'I've lost 4,500 sheep to thieves on Dartmoor' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's beginning to feel like the Wild West up here when it comes to sheep crime - it's soul-destroying,\" says farmer Colin Abel, scanning his flock high up on west Dartmoor farmland.\nThis winter - like most years - Mr Abel is missing more than 400 ewes.\nHe says in the last decade he has lost nearly £500,000 worth of livestock to sheep rustling, which is pushing some farmers to the brink of quitting or bringing their flocks off the moors.\nDevon and Cornwall Police says livestock theft is challenging to police but its officers are \"pursuing every line of inquiry\" through \"forensics, surveillance, tracking and more\".\nSheep have grazed on Dartmoor in Devon for centuries but roaming free, they are hard to keep an eye on and the national park is among the five worst areas in the country for sheep rustling.\nMr Abel's family has run Lower Godsworthy Farm in Tavistock since 1888.\nHe estimates more than 4,500 sheep have gone missing in the last decade and with each ewe worth roughly £120, that is more than £500,000 worth of livestock, he says.\nHis hardy upland flock of Scotch Blackface and Welsh mountain sheep spend nine-and-a-half months of the year on the moor, where they are most vulnerable to theft.\n\"It impacts financially and on the viability of the business,\" he says. \"I know farmers who are thinking about whether they want to continue.\"\nDartmoor's remote landscape makes livestock vulnerable to theft, while also making it challenging to police.\nMartin Beck, who was appointed in 2024 as the UK's first national livestock theft specialist police officer, says more than 1,300 sheep were reported stolen in Devon and Cornwall in 2024.\nOf those, nearly 800 reports - or 62% - related to west Dartmoor.\nAccording to Mr Beck, more than 10,000 sheep were reported stolen in the UK in 2024, meaning more than 10% of logged thefts were in this region.\nTracking stolen sheep is challenging, he says, adding they can end up on the illegal meat market, in other farmers' flocks, or being sold on the black market, online or at markets.\nWith ear tags easily removed by criminals, the animals' disease and medicine status are unknown - creating a risk to consumers if they end up in the food chain.\nThey could also be illegally slaughtered in uncontrolled conditions, he says.\nMr Beck, who is based in Devon, has called for \"more investment and training in rural policing and technology\" to address the issue.\nThere have been no prosecutions for sheep theft in the last five years for Devon and Cornwall.\nThe challenge is complicated by the suspected involvement of people from the farming industry, says PC Julian Fry from Devon and Cornwall Police's Rural Affairs Team.\n\"The tragedy of this situation is that to steal livestock you have to know livestock and have the networks to shift them on.\"\nPC Fry, who grew up on the edge of Dartmoor and knows the farming community well, says despite the challenges, officers are working with abattoirs, commoners and farmers to build intelligence and employ \"lots of tactical options\".\n\"Any report of livestock theft we take seriously, investigate and pursue all lines of inquiry,\" he adds.\n\"We hope to make this crime a thing of the past.\"\nRural insurer NFU Mutual estimates livestock theft cost £2.7m in 2023, although Mr Abel says he quit reporting his losses to avoid higher premiums.\nSeven miles east across the moor, dense fog descends as farmer Neil Cole leads the way across a pen at his farm in Princetown.\nAs he glances through the gloom at his huddle of shuffling and bleating Scottish Blackface sheep, he says: \"Imagine you are creating a piece of art and someone sticks their finger nails through it, that's what it's like breeding good sheep for generations and trying to do it well – for someone to nick 50 of them is soul-destroying, all that profit gone.\n\"It does affect our mental health.\n\"We turn out 220 lambs expecting to get 160 back - at £150 a lamb we're in the lap of the gods until we gather.\"\nMr Cole says they lost £7,000 to theft this year, amid existing financial challenges including mortgages and debts.\nA report on Dartmoor, external by the Department for Environment, Food and Rural Affairs (Defra) describes farming on Dartmoor as \"economically extremely marginal\".\nMr Cole adds: \"The economics of keeping sheep on the moor is becoming harder and harder so the younger generation aren't taking it on as much.\n\"I've heard farmers say they are ready to give up and the sheep are important for the ecology of the moor.\n\"It's not the sort of thing you can steal if you don't have the knowledge. It is causing divisions in the community.\"\nPolice are also using forensics to track stolen sheep, while Cumbrian sheep and beef farmer Pip Simpson has trialled coded microdots on the sheep's fleece to brand his sheep.\nMr Simpson, based near Windermere in the Lake District, tells the BBC: \"I think the answer does lie in technology - what I'd like to see is ultimately a GPS tracker like a microchip in a dog so you can ringfence where it's at and receive a text when it gets stolen.\"\nBack on the moor, where sheep have grazed and shaped the land for more than 6,000 years, Mr Abel hopes a high-tech solution to this ancient crime can be found soon.\n\"We all know that things are stretched and budgets are tight but we need more to be done - it's affecting a whole community, and it could start to impact Dartmoor itself,\" he says.", "url": "https://www.bbc.co.uk/news/articles/cly44r4pvd5o"}