{"authors": ["Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 08:09:33", "date_modify": "2025-04-26 08:09:33", "date_publish": "2025-02-26 13:07:08", "description": "He presented shows including Game For A Laugh and Going For Gold, and fronted several radio programmes.", "filename": "news_articles_cn04y7dg68ko_1745654973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dab9/live/7c649150-f43e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04y7dg68ko_1745654973.html", "title": "TV presenter and journalist Henry Kelly dies", "title_page": "TV presenter and journalist Henry Kelly dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Journalist and TV presenter Henry Kelly has died aged 78, his family has announced.\nKelly was a journalist who later pivoted to light entertainment, hosting TV gameshow Game For A Laugh and Going For Gold in the 1980s and 90s.\nHe also presented programmes on BBC Radio 4, LBC and Classic FM.\nIn a statement, Kelly's family said he \"died peacefully\" on Tuesday \"after a period of ill health\".\n\"Henry will be sorely missed by his friends and family,\" it continued, \"including his partner Karolyn Shindler, their son Alexander, Henry's daughter Siobhan and her mother Marjorie\".\nBorn in Dublin on 17 April 1946, Kelly started his journalistic career in newspapers.\nHe worked for The Irish Times in the 1970s during civil unrest and the Troubles in Northern Ireland.\nHe left the newspaper and moved to London to join the BBC in 1976, working as a reporter and presenter for Radio 4's The World Tonight.\nBut in 1980, aged 34, he left journalism to become a light entertainment presenter.\nHe went on to front ITV's Game For A Laugh, and the first iteration of Good Morning Britain on TV-am, alongside Toni Arthur.\nGame For A Laugh largely involved practical jokes and elaborate set-ups, often on members of the studio audience or filmed on location on unsuspecting members of the public.\nKelly also fronted lunchtime quiz show Going For Gold for 10 seasons from the late 1980s to the mid-1990s.\nThe theme tune for Going For Gold was composed by Hans Zimmer, who went on to become a hugely successful film and TV composer.\nThe show saw contestants from different European countries compete against each other to answer questions to win prizes.\nGoing For Gold was briefly revived in the late 2000s by Channel 5, presented by John Suchet.\nKelly later became one of the launch presenters of Classic FM and also hosted shows on speech station LBC, BBC Radio London.\nHe hosted a show on BBC Radio Berkshire for 10 years from 2005.", "url": "https://www.bbc.co.uk/news/articles/cn04y7dg68ko"}