{"authors": ["Nadine Yousif and Madeline Halpert", "www.facebook.com"], "date_download": "2025-04-26 06:59:35", "date_modify": "2025-04-26 06:59:35", "date_publish": "2025-02-27 03:25:46", "description": "The move marks a major shift and prompted the outlet's opinion editor David Shipley to resign.", "filename": "news_articles_c5y44gw5gpro_1745650775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df2a/live/4db546a0-f4ad-11ef-bac4-3f545ab96239.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y44gw5gpro_1745650775.html", "title": "Bezos focuses Washington Post opinion pages on free markets and liberties", "title_page": "Bezos focuses Washington Post opinion pages on free markets and liberties - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Washington Post owner Jeff Bezos has announced that the newspaper's opinion section will focus on supporting “personal liberties and free markets\", and pieces opposing those views will not be published.\nThe move, which marks a major shift away from the section's broad opinion coverage, prompted the outlet's opinion editor David Shipley to resign.\nBezos, the billionaire founder of Amazon, sent a memo to staff on Wednesday which he also posted to X.\n“We are going to be writing every day in support and defence of two pillars: personal liberties and free markets,“ Bezos said.\nHe added the opinion section would cover other topics, but “viewpoints opposing those pillars will be left to be published by others”.\n“There was a time when a newspaper, especially one that was a local monopoly, might have seen it as a service to bring to the reader's doorstep every morning a broad-based opinion section that sought to cover all views,” Bezos wrote. “Today, the internet does that job.”\nBezos added that he had asked Mr Shipley if he wanted to stay at the outlet after the changes, but he said no.\n\"This is a significant shift, it won't be easy, and it will require 100% commitment - I respect his decision,\" Bezos said.\nThe billionaire businessman's move is a significant intervention in the editorial side of the newspaper, which he acquired in 2013.\nIt follows a decision last year not to run an endorsement of Democratic presidential candidate Kamala Harris, and to stop making presidential endorsements in general, which led to resignations and the loss of thousands of subscribers.\nAccording to the Washington Post, Will Lewis, the outlet’s chief executive, said in a memo to staff that the changes to the opinion section were \"not about siding with any political party”.\n\"This is about being crystal clear about what we stand for as a newspaper,\" he said.\nThe decision was praised by several of President Donald Trump‘s allies, including billionaire Elon Musk, who wrote on social media: “Bravo, @JeffBezos!\"\nBut on a Washington Post article announcing the change, some subscribers wrote in the comment section criticising the decision, and others said they would be cancelling their subscription.", "url": "https://www.bbc.co.uk/news/articles/c5y44gw5gpro"}