{"authors": ["Jim Reed", "www.facebook.com"], "date_download": "2025-04-26 04:04:28", "date_modify": "2025-04-26 04:04:28", "date_publish": "2025-03-03 19:00:49", "description": "Baroness Mone and her husband both asked to become 'core participants' to the inquiry.", "filename": "news_articles_cwygwrzpd1no_1745640268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0008/live/be9d9810-f861-11ef-b75c-0ba717285eef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwrzpd1no_1745640268.html", "title": "Covid inquiry rejects last-minute bid from Michelle Mone", "title_page": "Covid inquiry rejects last-minute bid from Michelle Mone - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Covid inquiry has rejected a last-minute bid that would have allowed Baroness Michelle Mone and her husband Doug Barrowman to access documents and other evidence about PPE deals during the pandemic.\nLast week both individuals asked to become \"core participants\" in the inquiry - a legal status which also gives the right to make statements and apply to ask questions of witnesses.\nPPE Medpro, led by Mr Barrowman, was awarded government contracts worth more than £200m during Covid after Baroness Mone recommended the firm to ministers.\nThe inquiry has already ruled that evidence about the company will be heard in private later this month to avoid prejudicing an ongoing National Crime Agency (NCA) investigation. Baroness Mone, 52, and Mr Barrowman, 59, have denied wrongdoing.\nTo date, no criminal charges have been brought and the NCA has not instructed the Crown Prosecution Service.\nThe Covid inquiry has now opened four weeks of public hearings into the supply and distribution of £15bn of PPE and other medical equipment in the pandemic.\nOn February 27, Baroness Mone, Mr Barrowman and PPE Medpro wrote to the inquiry saying they had a significant role in proceedings and they \"may be subject to explicit and significant criticism\".\nThey also argued they had concerns about the conduct of the NCA, which has been investigating PPE Medpro since May 2021.\nAs core participants they would have been granted access to documents and other witness evidence provided to the Covid inquiry. Participants must sign a confidentiality agreement and use that information only for inquiry purposes.\nThe inquiry's chair, Baroness Hallett, rejected the couple's approach, external saying she did not accept they had a large enough role \"in the matters to be investigated by the inquiry\".\nShe also said their application had been made after a November 2023 deadline.\n\"Whilst Medpro was a significant supplier of PPE to the UK government, it was but one of a number of such suppliers and there are several other contracts that the inquiry is investigating,\" she said.\nBaroness Hallet has previously said she will not take evidence directly from representatives of firms involved in supplying PPE, an approach which has angered groups representing bereaved families.\nInstead her main focus is on the approach of ministers and the government, she added.", "url": "https://www.bbc.co.uk/news/articles/cwygwrzpd1no"}