{"authors": ["David Grundy", "www.facebook.com"], "date_download": "2025-04-26 07:26:01", "date_modify": "2025-04-26 07:26:01", "date_publish": "2025-02-27 22:49:37", "description": "The arrival of 200 Indian nurses in Wales is welcomed - but a union warns of far greater shortages.", "filename": "news_articles_cvg11qqe3n1o_1745652361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b5aa/live/9de11ac0-f532-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg11qqe3n1o_1745652361.html", "title": "Welsh union welcomes 200 Indian nurses but warns of shortages", "title_page": "Welsh union welcomes 200 Indian nurses but warns of shortages - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A deal to recruit 200 nurses and doctors from India has been welcomed, but a union estimates Wales is currently short of 2,000 nurses.\nWelsh Health Secretary Jeremy Miles said an agreement with the Keralan government would reduce vacancies and the use of agency staff.\nThe Royal College of Nursing (RCN) said the Welsh government needed to look at \"valuing the nursing profession\".\nIt also warned of the potential impact of the proposed closure of the nursing school at Cardiff University.\n\"Of course we welcome an additional 200 professionals into the NHS in Wales where we have 2,000 nurse vacancies,\" said RCN's Nicky Hughes.\n\"This goes a little way to helping that.\"\nThe RCN, she said, was also concerned about proposals to close Cardiff University nursing school.\n\"That would have a huge impact, not only in terms of the pipeline of nurses coming into Cardiff and the Vale, but also in the wider profession,\" she said.\nMr Miles, who met officials in Kerala on Thursday, said the new agreement would cut the costs of using agency workers.\n\"The cost overall has halved, I think, over the last two or three years,\" he said.\n\"Being able to recruit in this way directly with the government of Kerala, rather than through expensive third party agencies, also makes a contribution to making sure that the money we're investing in the workforce is spent wisely.\"\nFirst Minister Eluned Morgan signed a similar agreement with the Keralan government when she was health minister.\n\"There's a long tradition that we're proud of in Wales about ethical international recruitment into the NHS from right across the world,\" said Mr Miles.\n\"I'm in India because we have an established relationship here which is working very well.\n\"The important skills which they're bringing to the NHS workforce can be put to work as quickly as possible to make sure patients get the care they need.\"\nBut the RCN has concerns that recruitment is difficult due to financial pressures the NHS is under.\n\"The financial crisis is affecting the ability to recruit into those posts, to enable staff to undertake essential continuing professional development and again keeping people in the NHS,\" Ms Hughes said.\nShe called for more action to fill nursing vacancies and improve patient care.\n\"We know that pay terms and conditions are having a real detriment to the nursing profession in Wales, and we also know that the working environments that people are working in at the moment is again having a detriment to their health and wellbeing,\" Ms Hughes added.\n\"We've been very open as the Royal College of Nursing in calling out the corridor care and the care in inappropriate places that's happening at the moment.\n\"When you're constantly going into areas where there's more patients being placed in areas they shouldn't be being cared for, and you have no more staff to care for them, you go home feeling that you haven't done your best. That's when nurses leave.\"", "url": "https://www.bbc.co.uk/news/articles/cvg11qqe3n1o"}