{"authors": ["Ana Faguy", "www.facebook.com"], "date_download": "2025-04-26 07:42:42", "date_modify": "2025-04-26 07:42:42", "date_publish": "2025-02-26 19:27:05", "description": "Unable to vote remotely due to congressional rules, the Colorado lawmaker now leads a bipartisan push for more flexibility for members.", "filename": "news_articles_cn48z5q28vyo_1745653362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02a7/live/3ea535a0-f46a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn48z5q28vyo_1745653362.html", "title": "US congresswoman votes with newborn in arms after proxy vote ban", "title_page": "US congresswoman votes with newborn in arms after proxy vote ban - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Four weeks after giving birth to her second child, Congresswoman Brittany Pettersen cradled her baby son in her arms as she cast a crucial vote on the House floor.\nUnable to vote remotely due to congressional rules, the Colorado Democrat flew across the country to oppose a multi-trillion-dollar budget deal, which narrowly passed in the House of Representatives.\n\"Unfortunately, I wasn't given the opportunity to vote remotely after giving birth, but I wasn't going to let that stop me from representing my constituents,\" Pettersen said on Tuesday.\nThe congresswoman - the 14th lawmaker to give birth while in office - now leads a bipartisan push for more flexibility for members with growing families.\nIn January, she introduced legislation allowing proxy voting for up to 12 weeks for members who have \"given birth or whose spouse have given birth and pregnant members who are unable to travel safely or have a serious medical condition\". The bill has 137 bipartisan co-sponsors.\nProxy voting - where a lawmaker designates another to vote on their behalf - was temporarily allowed during the pandemic, but current House rules prohibit it.\nThe restriction allowed some to see the unintended benefits of proxy voting for those recovering from childbirth or illness, but critics argued the policy was being abused.\nMore than 100 Republican members of the House of Representatives, including current Speaker Mike Johnson, filed lawsuit to end the practice, arguing it was unconstitutional.\nThe legal argument failed, but when Republicans regained control of the House in 2023, former Speaker of the House Kevin McCarthy ended proxy voting.\nPettersen and another Republican congresswoman who gave birth in 2023 continue to push for flexibility for new parents on Capitol Hill.\nCongresswoman Anna Paulina Luna, a Florida Republican who gave birth in 2023, missed 137 votes in the weeks after she gave birth. Doctors had advised her not to travel while recovering from a difficult birth.\nLuna called the inability to proxy vote a \"slap in the face to every constituent\" who elected her.\n\"How is it not discriminatory to tell a duly elected member of Congress that she can't vote because she gave birth to a child?\" she said in a video statement last month. \"New mothers in Congress should not be forced to choose their careers over children or choose children over careers.\"\nBut Republican leadership has yet to budge.\n\"I have great sympathy, empathy for all of our young women legislators who are of birthing age. It's a real quandary,\" Johnson said in a statement last month. \"But I'm afraid it doesn't fit with the language of the Constitution, and that's the inescapable truth that we have.\"\nJean Sinzdak, associate director at the Center for American Women and Politics, said the pushback, in part, is cultural: many of the leaders of institutions like congress are older men who are not concerned about the trials of young parents and families.\n\"It doesn't behove the leaders of these institutions to change this process because it's not affecting them directly,\" Ms Sinzdak told the BBC.\nThe UK parliament now allows proxy voting, external for members of parliament who are new parents, experiencing childbirth complications or need fertility treatment. The European parliament currently has no provisions to allow heavily pregnant members to vote if they can't physically make it to Strasbourg, the formal seat of the office.\nPettersen and Luna are now trying to bypass Johnson and put the legislation to a floor vote - it is a tough road but it may be their best shot unless the thinking surrounding proxy voting changes.", "url": "https://www.bbc.co.uk/news/articles/cn48z5q28vyo"}