{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:55:35", "date_modify": "2025-05-21 04:55:35", "date_publish": "2025-02-09 00:00:00", "description": "Rayner also says the government plans to digitalise the land registry to speed up house purchases.", "filename": "news_live_ckg0pejj1pdt_1747803335.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_ckg0pejj1pdt_1747803335.html", "title": "Labour ‘determined’ to meet 1.5 million homes target, Deputy PM Rayner says", "title_page": "Sunday with Laura Kuenssberg: Labour ‘determined’ to meet 1.5 million homes target, Deputy PM Rayner says - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "From housebuilding to a TikTok lawsuit and Reform's rise, here's what we heard this week\nJenna Moon\nLive reporter\nIt was a characteristically fiery edition of Sunday with Laura Kuenssberg.\nThere was plenty of talk about housing, with Deputy Prime Minister Angela Rayner repeating Labour’s pledge to build 1.5 million homes before the next election. She says she is \"determined\" to deliver on that promise.\nYesterday, Kuenssberg looked at whether the government's plans are bold enough – you can read more about the target in this InDepth piece.\nRayner also defended her behaviour at a meeting with Grenfell Tower victims and their families. She denies claims from some attendees that she was aggressive when announcing plans to dismantle the tower to ground level. You can read more from Kuenssberg on her response.\nElsewhere, Tory MP Alex Burghart reacted to Reform UK's rise in the polls, saying the party wants to \"destroy\" the Conservatives – but he didn’t rule out a deal.\nWe also heard from four parents suing TikTok in the US after their children died. They believe harmful content played a role and say big tech firms have \"no compassion\".\nAnd if you missed it, you can catch up on our interview with Israeli President Isaac Herzog.\nYou can also find out more about the background of Kuenssberg's interview with Israeli president Isaac Herzog in this story.\nThanks for joining us.\nRayner accepts building challenge, but time will tell if reforms have desired effect\nJoshua Nevett\nPolitical reporter\n“There are no excuses to not build those homes that people desperately need,” Rayner told Laura Kuenssberg earlier.\nShe is convinced this Labour government is making all the right moves to get Britain building.\nPlanning reform is at the centre of Labour’s plans. It includes reintroducing housing targets for councils, and making it easier for developers to build on so-called “grey” parts of the green belt.\nBut Labour’s target means building an average of 300,000 new homes a year - a number not achieved since the 1970s.\nAnd there’s only so much the government can do to get spades in the ground. Most new housing in the UK is built by a handful of large housebuilders - and the government cannot tell them when and how much to build.\nIt’s easy to see why - as Rayner admitted - she’d been asked if she wanted to review the housing target, weeks after taking office.\nHer response: “I wasn’t going to give up on the target.”\nChallenge accepted. Only time will tell whether Labour's reforms have the desired effect.\nTech giants' role in US inauguration shows their strong influence - panel\nJournalist Vicky Spratt from the i Paper points out that tech giants were at the US presidential inauguration, which shows how much power they have.\n\"There isn't enough transparency,\" she says, adding that we don't know enough about social media algorithms.\nGreg Jackson, chief executive of energy firm Octopus, says that as a parent, it was hard not to well up while watching the interviews.\nHe says dangerous content is what keeps people engaged on social media, and companies take advantage of that.\nSocial media firms have caused great harm, and we need to hold them accountable, he says.\nThat's the end of Kuenssberg's programme for today – we'll bring you a summary of the key points shortly.\n‘You do have some days that are particularly bad’\nLaura is now asking Ellen Roome what it means for these four parents to have found each other, particularly during this difficult time.\nRoome, who has been campaigning for legislation that would allow parents to access the social media accounts of their children if they die, says that she is grateful for the support she has received from the other bereaved parents.\n\"You do have some days particularly bad - when it's very difficult to function,\" she says, but being able to pick up the phone and call someone who understands what you are going through does help.\nRoome, from Cheltenham, believes her 14-year-old son Jools died after an online challenge went wrong and his social media accounts could provide the evidence needed.\nI have ‘no faith’ in Online Safety Act, father says\nLaura is now highlighting the new government online safety act, which comes into force in the spring.\nFor context, the Online Safety Act is designed to control online speech and media deemed \"harmful\". It said the act took a \"zero-tolerance approach\" to protecting children and ensured social media platforms were held responsible for the content they hosted.\nLaura now asks Liam Walsh if he has confidence in the UK's attempt to protect children online.\nWalsh says he doesn’t.\n\"I'm about to find out if I'm right or wrong. Because I don't think it's baring its teeth enough. I think I would be forgiven for having no faith at this point - two-and-a-half years down the road and having no answers.\"\nWalsh’s 13-year-old daughter, Maia, was found dead at her Hertfordshire home on 7 October 2022, a few weeks before her birthday. Her dad said at the time she was watching self-harm TikTok videos before her death and had previously mentioned a social media game.\nTikTok is ‘in breach of their own rules’ - mother\nKenevan continues to explain to Laura how she’s reported a certain video that she takes issue with on the platform “so many times”, and each time she’s received a message on the app that there’s nothing wrong.\n“They’re in breach of their own rules,” she says. “They’re saying they don’t allow harmful content [or] challenges,” Kenevan adds, but alleges that “they do”.\n“And they put out the same corporate statement every single time this is brought up,” she says, before Hollie Dance cuts in.\nDance, whose son Archie Battersbee died aged 12 after a \"prank or experiment\" went wrong at their home in Southend-on-Sea in April 2022, says she agrees with Kenevan.\n“No compassion at all,” Dance says.\n“It’s just a statement that goes out to the public.”\nParents suing TikTok want to see accountability\nLaura asks Lisa Kenevan, whose 13-year-old son Isaac died after it was believed he took part in a choke challenge on social media, what she and the other parents hope to achieve from the lawsuit.\n\"Accountability,\" says Kenevan. TikTok, she says, needs to look at \"parents around the world\", as she stresses that she believes what happened to her son in England is happening \"everywhere\".\n\"We want TikTok to be forthcoming, we want it to help us,\" she adds. \"Why hold back from giving us the data? How can they sleep at night?\"\nBritish families suing TikTok speak to Kuenssberg\nWe’re about to hear from four British families who are suing TikTok for the alleged wrongful deaths of their children.\nHollie Dance, Lisa Kenevan, Liam Walsh and Ellen Roome are accusing the tech giant of having \"no compassion\" and have sat down with Laura Kuenssberg to explain why they’re planning to take the company to court, including that they want to try to find out the truth about what happened to their children.\nThey believe their children died after taking part in a viral trend that circulated on the video-sharing platform in 2022.\nTikTok says it prohibits dangerous content and challenges. It has blocked searches for videos and hashtags related to the particular challenge the children's parents say is linked to their deaths.\nBurghart won't rule out a deal with Reform\nBurghart goes on to say that they take the challenge from Reform UK \"very seriously\".\nAsked if they would consider a pact with the party, he says their ambition is to \"destroy\" the Conservative Party, but he refuses to rule out making a deal.\nThe conversation then moves on to the parents who are taking TikTok to court over the deaths of their children.\nBurghart is asked if he wishes the Conservative Party had taken a tougher line when they were in government on regulating the online space.\nBurghart says he \"can't help but feel desperate for parents whose children have been through that\".\nHe says the country has to have a serious conversation about the relationship children have with devices and social media.\nHe adds there needs to be a serious conversation about regulation.\nTory plans to set hard cap on number of migrants coming to UK - Burghart\nKuenssberg asked Burghart about Tory leader Kemi Badenoch’s goal to lower migration.\nHe says that they would place a hard cap on the number of migrants entering the country but declines to say exactly what that number would be.\nBurghart also says that they would “elongate” the process to become a citizen and extend the time before an immigrant can apply for indefinite leave to remain.\nThe cap and migration plans will be announced by the Tories before the next election, Burghart notes.\nAsked by Kuenssberg about Reform’s surge in recent polls, Burghart says that anyone taking polling seriously at “this point in the election cycle … needs to get a life.”", "url": "https://www.bbc.com/news/live/ckg0pejj1pdt"}