{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 06:56:28", "date_modify": "2025-04-26 06:56:28", "date_publish": "2025-02-28 14:50:36", "description": "The Charity Commission finds serious failings at The Sikh Channel Community Broadcasting Company.", "filename": "news_articles_clyzzygk207o_1745650588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f7f1/live/56509080-f5de-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyzzygk207o_1745650588.html", "title": "Regulator finds misconduct at Birmingham Sikh TV charity", "title_page": "Regulator finds misconduct at Birmingham Sikh TV charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The former trustees of a faith based television channel did not sufficiently oversee the actions of its chief executive, leading to breaches of charity law, the regulator has found.\nThe Charity Commission found trustees of The Sikh Channel Community Broadcasting Company - who were all related to the chief executive - failed to manage a clear conflict of interest.\nThis amounted to misconduct and mismanagement by the trustees at the time.\nConcerns were also raised about the relationship between the Birmingham based charity and companies connected to the charity's chief executive.\nHe appointed himself to the role without an open recruitment process, and in breach of the charity's governing document, said the charity regulator.\nThe chief executive was found to have acted as a de-facto trustee, and set himself a yearly unauthorised salary of £40,000.\nAdditionally, the inquiry found that the charity made a bank transfer for £654 to a private company owned and directed by the chief executive.\nConcerns first arose about the charity in November 2019 due to its fundraising partnership with unregistered organisation Sikh Youth UK.\nThe charity began a fundraising partnership with Sikh Youth UK - which is subject to a statutory inquiry.\nIt organised a fundraiser, stating that money raised would pay for Sikh Youth UK support workers.\nHowever, the commission found that it misled members of the public by not stating that 40% of their donations would be kept by the channel for its general expenditure.\nThe former chief executive has agreed not to serve as a trustee for any charity for 10 years.\nA new board of trustees was appointed over the course of the inquiry, which led to its dissolution.", "url": "https://www.bbc.co.uk/news/articles/clyzzygk207o"}