{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:12:16", "date_modify": "2025-04-26 06:12:16", "date_publish": "2025-03-02 06:32:16", "description": "Unused tennis courts could be turned into five padel tennis and three pickleball courts.", "filename": "news_articles_cy4vvjmmv1lo_1745647936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0b70/live/afdef0b0-f5d4-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vvjmmv1lo_1745647936.html", "title": "Game on for new pickel and padel courts in Peterborough?", "title_page": "Game on for new pickel and padel courts in Peterborough?  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A successful tennis player is hoping to bring an \"inclusive\" racket sports facility to Peterborough.\nAlan Jordan has resubmitted plans to convert unused tennis courts into padel tennis and pickleball courts at Powerleague Peterborough next to Stanground Academy.\nA previous bid for a lawful development certificate to Peterborough City Council was refused because full planning permission was needed for the necessary surface upgrades.\nMr Jordan said the city \"deserves a dedicated racket sports centre\", adding he was \"excited\" to bring the sports to the grassroots level.\nMr Jordan is a British tennis player who has captained England in over 55s international tournaments.\nHe is hoping to get the go-ahead for five new padel tennis courts and three pickleball courts.\nSome of the courts will be accessible for Stanground Academy to use during the day, with \"all necessary safeguarding provisions taken care off\", Mr Jordan said.\nThe site would also have new toilets and a changing facility.\nMr Jordan added: \"Tennis is looked at as an elite sport but padel tennis provides an alternative for a racket sport.\n\"It's a more inclusive sport and there's a buzz around it. It's gaining in popularity.\n\"Hopefully, the council will recognise what I am trying to do as I believe the city deserves a dedicated racket sport centre.\"", "url": "https://www.bbc.co.uk/news/articles/cy4vvjmmv1lo"}