{"authors": ["Angie Brown", "www.facebook.com"], "date_download": "2025-04-26 07:49:26", "date_modify": "2025-04-26 07:49:26", "date_publish": "2025-02-26 22:35:48", "description": "Locals say the memorial to Hugo The West End Cat would bring the community together and increase visitor numbers.", "filename": "news_articles_clyrxvrkjr4o_1745653766.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/05ee/live/1d192f00-f2ca-11ef-b605-1fa85cd40094.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrxvrkjr4o_1745653766.html", "title": "Plans for memorial statue of Hugo the celebrity West End cat", "title_page": "Plans for memorial statue of Hugo the celebrity West End cat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A cat that was knocked down by a car in Edinburgh two years ago could be immortalised in bronze, under new plans submitted to the council.\nHugo was well known among local people in the west end of Edinburgh, where he was a familiar sight on its cobbled streets.\nNow locals have commissioned a life-sized statue of the much-missed pet in the hope of bringing the community together and increasing visitor numbers.\nIf it gets planning permission, external it would be the 16th sculpture of an animal in Edinburgh. There are 79 statues of men and eight of women.\nSculptor Alan Beattie Herriot, who created the statue of Wojtek the Bear in Edinburgh's Princes Street Gardens, has been lined up to take on the commission.\nIt is understood that thousands of pounds have been raised by the community for the sculpture, which they hope to place on a wall in William Street with a plaque.\nThe model would be cast in hot bronze at the capital's Powderhall Bronze Foundry.\nHugo, an Arabian Mau, was owned by local woman Jane Rutherford who rescued him from Doha when he was six months old.\nBut during his life in Edinburgh he became well known in the West End of the city, where many people looked after him.\nHe was seven years old when he died in May 2023 after being hit by a car that failed to stop.\nHis death led to calls for a change in the law, requiring drivers to report when they collide with a cat.\nPaul Hancock, West End community council engagement officer, told BBC Scotland News he failed to see any reason why the statue would not get planning permission.\n\"It's been done in good taste and in keeping with the historic nature of the city centre and world heritage site, so I think it can only be considered an asset.\n\"He is fondly remembered by a lot of people in the West End and our local Facebook page would always have pictures of Hugo in all sorts of random locations - he was a genuine interest in the West End.\n\"We are hoping people will remember him and come through the West End.\n\"We are short of footfall for some of our traders, so it will bring some valued trade to the West End and he will be fondly remembered.\"", "url": "https://www.bbc.co.uk/news/articles/clyrxvrkjr4o"}