{"authors": ["Susie Rack", "Charlotte Broadbent", "www.facebook.com"], "date_download": "2025-04-26 03:58:05", "date_modify": "2025-04-26 03:58:05", "date_publish": "2025-03-04 13:24:17", "description": "Worcester sauce Walkers crisps have returned to sale at just one newsagent in the city.", "filename": "news_articles_cwydqnd3rq9o_1745639885.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8194/live/3a163840-f8f7-11ef-ad98-31dd620eac72.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwydqnd3rq9o_1745639885.html", "title": "Worcester sauce fans queue for taste of discontinued crisps", "title_page": "Worcester sauce fans queue for taste of discontinued crisps - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crisp aficionados have flocked to Worcestershire to get their hands on a discontinued favourite flavour.\nWalkers' Worcester sauce variety was axed two years ago, but returned to shelves on Tuesday at one newsagent in the condiment's home city.\nWould-be customers lined up outside Charlie's Convenience Store on Barbourne Road before it opened for a taste of the limited supply.\nOne of them, Hannah Harley Young, said it was worth the five-hour round train trip from London adding: \"I would travel the globe for a packet of crisps.\"\nThe self-proclaimed \"crisp connoisseur\", 37, said the returning purple packet signalled a \"defining\" flavour from her childhood.\n\"It was kind of like that wild-card flavour that was always quite a pleasant surprise,\" she said.\n\"I was kind of sad when it was discontinued.\"\nShe would not disclose exactly how many packets she would take home but hinted it would be \"quite a few\".\nThe concoction was first produced in the city during the 19th Century by chemists John Wheeley Lea and William Perrins and went on sale in 1837.\nIt is still made in the city today, although the recipe's origins remain a mystery.", "url": "https://www.bbc.co.uk/news/articles/cwydqnd3rq9o"}