{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:02:29", "date_modify": "2025-05-19 15:02:29", "date_publish": "2015-03-06 07:30:05", "description": "Nearly £4,000 has been spent on Premier Inn hotel rooms by a council providing accommodation for homeless people.", "filename": "news_uk-england-beds-bucks-herts-31756845_1747666949.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81429000/jpg/_81429855_sbna_premierinnstalbans1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-beds-bucks-herts-31756845_1747666949.html", "title": "St Albans' homeless people put up in Premier Inn", "title_page": "St Albans' homeless people put up in Premier Inn - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "About £3,600 has been spent on Premier Inn hotel rooms by a council to provide accommodation for homeless people.\nSt Albans City and District Council revealed the £8.1m city centre hotel was used to help deal with a rise in the number of people needing temporary places to stay.\nA council officer said the Premier Inn, which opened last year, was only used when cheaper hotels were not available.\nThe council said it amounted to 52 nights.\nThe amount spent by the Conservative-run local authority on temporary bed and breakfast accommodation is £120,000 so far this financial year, compared to £10,419 in 2012-13 and £34,000 in 2013-14.\nThe figure was revealed during a full council meeting.\nLabour councillor Dreda Gordon said \"putting people in hotels isn't the answer\".\n\"When Premier Inn was going through planning, people weren't talking about it being used by the council for temporary accommodation,\" she said\n\"It isn't good enough. We should be providing more housing.\"\nLiberal Democrat councillor Chris White said: \"We have to find a way to eliminate that cost. We shouldn't have to use Premier Inn.\"\nThe council said it used a range of accommodation, including bed and breakfasts, usually costing £45-£90 a night.\nKaren Dragovic, the council's head of housing, said the Premier Inn was at the \"higher end of the [price] spectrum\" and it was used \"when other alternatives have been exhausted\".\n\"The number of households in temporary housing rose from 97 in January 2014 to 120 in December,\" she said.\n\"We have a duty to house people who meet the homeless criteria.\n\"With limited housing stock available, there is a very long waiting list for homes.\"\nA Premier Inn spokeswoman said she could not comment as \"we have no record of homeless people staying here\".", "url": "https://www.bbc.com/news/uk-england-beds-bucks-herts-31756845"}