{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 07:34:43", "date_modify": "2025-04-26 07:34:43", "date_publish": "2025-02-27 15:29:50", "description": "Mohammed Mahfuz Ahmed, 25, was arrested at his home in April 2024 by counter terrorism officers.", "filename": "news_articles_cyveenplgdyo_1745652883.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02cc/live/3958dd00-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyveenplgdyo_1745652883.html", "title": "Cleethorpes: Mohammed Mahfuz Ahmed guilty of terror offences", "title_page": "Cleethorpes: Mohammed Mahfuz Ahmed guilty of terror offences - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 25-year-old man from Cleethorpes has been convicted of terrorism offences following a two-week trial.\nMohammed Mahfuz Ahmed, of Crowhill Avenue, was found guilty of disseminating terrorist publications and encouraging terrorism at Sheffield Crown Court earlier.\nHe was arrested in April 2024 as part of an intelligence-led operation by Counter Terrorism Policing, with the support of Humberside Police.\nAhmed was remanded into custody and will be sentenced on 17 April.\nThe court heard the evidence gathered by officers from Ahmed's home address revealed a \"deep-seated extremist mindset\" and included magazines and propaganda which promoted jihad.\nAhmed had taken deliberate steps to circumvent the rules of social media platforms and had used five different accounts over a five-month period, officers said.\nHis social media posts, which attracted more than 14,000 responses, encouraged murder and acts as violence as well as identifying targets.\nDet Ch Supt James Dunkerley, the head of Counter Terrorism Policing North East, said Ahmed \"often included graphic content and glorified acts of terrorism\" in his posts.\nHe said: \"He went to considerable lengths to seek out and share material that could not easily be found on mainstream online platforms. The potential impact of his actions should not be underestimated.\n\"By sharing Daesh propaganda, he has promoted their cause and intentionally extended the reach and influence of their ideology.\n\"We are working tirelessly alongside our partners to remove this content and identify those who seek to legitimise terrorism in this way.\"", "url": "https://www.bbc.co.uk/news/articles/cyveenplgdyo"}