{"authors": ["Ken Banks and Rob Flett", "www.facebook.com"], "date_download": "2025-04-26 04:02:50", "date_modify": "2025-04-26 04:02:50", "date_publish": "2025-03-03 22:44:13", "description": "Council leader Heather Woodbridge says the rise was about finding the right balance.", "filename": "news_articles_cj9238klpe3o_1745640170.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1264/live/78883af0-f8f3-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj9238klpe3o_1745640170.html", "title": "Orkney councillors back 15% council tax rise", "title_page": "Orkney councillors back 15% council tax rise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors in Orkney have backed a 15% increase in council tax.\nThe 15% rise was passed by 15 votes to six at a meeting of the full Orkney Islands Council, defeating an amendment for a lower rise of 11%.\nThe biggest agreed percentage increase in Scotland so far had been in Clackmannanshire, with a 13% rise.\nA disappointed campaigner who had set up a petition against the 15% rise said people were struggling with rising costs.\nCouncillor Heather Woodbridge, the leader of Orkney Islands Council, put forward the 15% recommendation.\nShe said no-one wanted to put the public under pressure and the rise was about finding the right balance.\nShe said 15% rather than 11% would bring in a \"significant\" amount of extra money.\nCouncillor Steven Heddle moved the amendment to go for 11% rather than the proposed 15%.\nHe said in his 18 years as a councillor he had never seen people so angry.\n\"Life is about people and the people have spoken,\" he said.\nIsland councillors were trying to balance the need to raise revenue with protecting services against cuts.\nAt a 15% increase, council tax for a Band D property will be £1,574.60\nAt 11%, it would have instead taken the council tax to £1,519.82.\nThe difference between 11% and 15% is £1.05 per week for band D households.\nEach 1% rise on the council tax equates to £115,000 for the authority.\nWith councillors voting on a 4% difference, that amounted to a potential extra £460,000.\nAn online petition against the potential higher 15% rise gathered more than 1,000 signatures.\nShe described the 15% council tax increase, coupled with funding uncertainties, as placing organisations in a \"precarious position, potentially affecting the most vulnerable members of our community\".\n\"We understand the council's need to address financial challenges,\" the VAO chief executive said.\n\"However, this significant tax increase raises concerns about its impact on our third sector organisations and, more importantly, on the vulnerable population we support.\n\"Many local charities and community groups are already facing increased demand for services and rising operational costs. This tax hike could further strain household budgets, leading to an even greater reliance on third sector services.\"", "url": "https://www.bbc.co.uk/news/articles/cj9238klpe3o"}