{"authors": ["Greig Watson", "Lisa Teanby", "www.facebook.com"], "date_download": "2025-04-26 04:19:08", "date_modify": "2025-04-26 04:19:08", "date_publish": "2025-03-04 06:21:30", "description": "Grade I-listed St Mary Magdalene is in the middle of £4m of repairs to enhance its community role.", "filename": "news_articles_c4gmryn037po_1745641148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b7c/live/ba1a9f70-f84a-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gmryn037po_1745641148.html", "title": "Newark church restoration project faces £600,000 tax blow", "title_page": "Newark church restoration project faces £600,000 tax blow - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A historical church has said it faces a £600,000 shortfall on a major restoration project because of recent changes to tax rules.\nGrade I-listed St Mary Magdalene in Newark is undergoing £4m of repairs and refits to enhance its role as a community hub.\nThe church began the project expecting to be able to reclaim a substantial portion of the cost of VAT through the government's Listed Places of Worship Grant Scheme.\nHowever, project leaders said a new £25,000 cap on claims had left them \"scrabbling\" to make up the difference.\nThe government said it had taken the \"difficult\" decision to introduce the cap due to financial pressures.\nAndrew Fearn, church warden and project lead, said: \"We are lobbying furiously to try and persuade the government what they have done is thoughtless and in our case, we think, cruel.\n\"We are mid-contract, and the rug has been pulled from under our feet.\n\"We are scrabbling around now to work out how we can fill that gap but of course a public appeal to pay £600,000 of VAT doesn't really have legs.\"\nParts of the building, on Church Walk, date back to the 12th Century and its 236 feet (72 m) high spire is believed to be the fifth highest in England.\nThe church also functions as a community space, hosting toddler groups, youth hangouts, a community cafe, library group, flowers festivals and regular concerts.\nIt is also currently on Historic England's Heritage at Risk Register and is currently closed until November 2025 for the renovations.", "url": "https://www.bbc.co.uk/news/articles/c4gmryn037po"}