{"authors": ["Louise Parry", "www.facebook.com"], "date_download": "2025-04-26 06:30:28", "date_modify": "2025-04-26 06:30:28", "date_publish": "2025-02-27 10:24:15", "description": "Four men are convicted after parcels of drugs were dropped by plane into the UK countryside.", "filename": "news_articles_cx2xxxd7n1no_1745649028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a6cf/live/b62d9ff0-f4eb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xxxd7n1no_1745649028.html", "title": "Hertfordshire and Essex gang convicted over £4.1m drugs drop", "title_page": "Hertfordshire and Essex gang convicted over £4.1m drugs drop - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A gang involved in importing parcels of cocaine that were dropped into the British countryside from a plane has been convicted of drugs offences.\nCocaine worth an estimated £4.2m was later discovered at a car wash in Hertfordshire - and a house in Loughton, Essex.\nAn investigation led by the Eastern Region Special Operations Unit (ERSOU) found that the gang liaised with contacts abroad to drop the packages in Dorset.\nDet Insp Daniel Barker, of ERSOU, said the group \"had put significant thought and planning into how they could best bring Class A drugs into the UK\".\nERSOU said the flights, leaving from the Cherbourg area of northern France, would avoid radar systems and disable transponders which revealed their whereabouts to other pilots.\nOn at least three occasions, flights were made to southern England before immediately returning to France, \"dangerously\" entering UK airspace without the required documents, ERSOU said.\nEach time, either Rolandas Bauza, 47, or Martynas Piecia, 37, drove to the same location to collect the parcels.\nThe Bauza brothers, both of Colson Road in Loughton, Essex, travelled to Dorset a few days earlier to explore potential drop sites, the investigation found.\nA fourth man, 33-year-old Arjan Lisaj of Barrells Down Road in Bishop's Stortford, worked at a car wash in Spellbrook that was being used as a front for criminal activity, investigators found.\nHe was arrested near the car wash in September 2024, alongside Piecia and Rolandas Bauza. Officers found two blocks of cocaine in the car wash office, while Rolandas was found to be carrying £37,000 in cash.\nTomas was arrested at a raid of the Bauza brothers' home, which also uncovered 54g of cocaine in the loft and evidence the property had been used as a cannabis factory.\nPiecia, of Holst Lane in Thaxted, Essex, is due to be sentenced along with the other three men on 4 August.", "url": "https://www.bbc.co.uk/news/articles/cx2xxxd7n1no"}