{"authors": ["Brandon Drenon", "www.facebook.com"], "date_download": "2025-04-26 06:14:25", "date_modify": "2025-04-26 06:14:25", "date_publish": "2025-03-02 01:13:19", "description": "Donald Trump has promised to \"terminate\" diversity programmes. But a rebrand might yet save them.", "filename": "news_articles_c24110m30ddo_1745648065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ab8/live/bfc31930-f5d8-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c24110m30ddo_1745648065.html", "title": "In the US, DEI is under attack. But under a different name, it might live on", "title_page": "In the US, DEI is under attack. But under a different name, it might live on - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In Union County, South Carolina, the sprawling cotton mills that once put bread on the table for many are long gone. Union is also what is termed a \"food desert\", where many residents live far from the nearest supermarket. So in 2016, local non-profit director Elise Ashby began working with farmers to deliver discounted boxes of farm-fresh produce across the county, where 30% of the population is black and roughly 25% live in poverty.\nTo fund this, Ms Ashby first relied on her own savings and then some small-scale grants. But in 2023, the Walmart Foundation - the philanthropic arm of one of America's largest corporations - awarded her over $100,000 (£80,000), as part of a $1.5m programme to fund \"community-based non-profits led by people of colour\".\n\"I cried a little bit,\" she says. \"It was just one of those times where, like, somebody actually sees what you're doing.\"\nTwo years ago, this was the kind of programme that attracted sponsorship from major companies across America, as the country grappled with racism past and present following the murder of George Floyd, a black man suffocated under the knee of a Minneapolis police officer during an arrest in 2020.\nBut now, those same companies are pulling back. Walmart announced in November that it was ending some of its diversity initiatives, including plans to close its Center for Racial Equity, which supported Ms Ashby's grant.\nCorporations from Meta and Google to Goldman Sachs and McDonald's have all announced similar changes as part of a larger retreat from diversity, equity and inclusion programmes (DEI) across the corporate landscape.\nThe moment represents a stark cultural shift, fuelled in part by fears of lawsuits, investigations, and social media backlash, as well as relentless pressure from the new president of the United States.\nSince assuming office in January, Donald Trump has aggressively sought to \"terminate DEI\" and \"restore merit-based opportunity\" in the US. He has directed the federal government to end its DEI programmes and investigate private companies and academic institutions thought to be engaged in \"illegal DEI\".\nIn the early days of his second term, the Veterans Affairs department has closed its DEI offices, the Environmental Protection Agency has placed nearly 200 employees who worked in its civil rights office on paid leave and Trump has fired the top military general, a black man whom his defence secretary had previously said should be fired because of his involvement in \"woke\" DEI.\nAt first sight, it may appear that the US's experiment with policies designed to improve outcomes for specific racial and identity-based groups is finished. But some experts suggest there's another possibility, that some such efforts will continue - but in a different guise, one more suited to the political mood of a country that has just elected a president who has pledged a war on \"woke\".\nAs the movement evolved, promoting the rights of women, the LGBT community, and other racial and ethnic groups, use of the terms \"diversity\", \"equity\" and \"inclusion\" became more widespread.\nDEI programmes in the corporate world and government agencies have often focused on hiring practices and policies emphasising diversity as a commercial benefit. Their supporters say they aim to address disparities affecting people from a range of backgrounds, though a significant emphasis tends to be on race.\nThe programmes saw a huge upswing in 2020 during the social unrest of the Black Lives Matter movement. For example, Walmart committed $100m over five years to its racial equity centre. Wells Fargo appointed its first chief diversity officer; Google and Nike already had theirs in place. After adjusting their hiring practices, companies listed on the S&P 100 added more than 300,000 jobs – 94% of which went to people of colour, according to Bloomberg.\nBut almost as quickly as the pendulum swung left, a conservative backlash began. For Stefan Padfield, executive director of conservative think-tank the National Center for Public Policy Research, DEI programmes are based on a premise that \"divides people on the basis of race and sex\".\nMore recently, these arguments that programmes intended to combat discrimination were themselves discriminatory, particularly against white Americans, have been made with increasing force. Training sessions emphasising concepts like \"white privilege\" and racial bias have drawn particular scrutiny.\nThe roots of this opposition took hold in conservative opposition to critical race theory (CRT), an academic concept which argues racism is endemic to American society. Over time, the campaign to remove books from classrooms that allegedly indoctrinated students into CRT thinking evolved into one focused on \"punishing woke corporations\".\nSocial media accounts like End Wokeness and conservative activists such as Robby Starbuck seized the moment to target companies accused of being \"woke\". Mr Starbuck has taken credit for changes in policy at the likes of Ford, John Deere and Harley-Davidson after he publicised details of their DEI initiatives to his social media followers.\nOne of the clearest signs of this movement's strength came in spring 2023, after a Bud Light partnership with transgender influencer Dylan Mulvaney sparked right-wing outrage and calls for a boycott of the beer and its parent company Anheuser-Busch. In the aftermath of the campaign, Bud Light sales were 28% lower than usual, a Harvard Business Review analysis found.\nAnother major victory for conservatives arrived in June 2023, when the Supreme Court ruled that race could no longer be considered as a factor in university admissions, reversing decades of affirmative action-based policy.\nThe ruling also cast the legal standing of corporate DEI policies into uncertainty. When Meta made the internal announcement it was cancelling DEI programmes, the company told staff \"the legal and policy landscape\" surrounding DEI had changed.\nMuch rests on the question of whether DEI is actually effective in the first place.\nSome research has suggested that DEI programmes like diversity training can in fact be harmful. According to one study, external by researchers from Harvard University and the University of Tel Aviv, trainers commonly report hostility and resistance from employees who feel forced to do the training and threatened by what they see as reverse discrimination; it also says the programmes can often leave trainees feeling more hostility towards other groups.\nThis research has been seized on by DEI's opponents as part of the evidence that \"the best way to improve the lives of all our citizens, and all our neighbours, is to allow the free market to lift all the boats\", as Mr Padfield puts it.\nThe problem with this kind of thinking, according to Siri Chilazi, a researcher focused on gender equity at Harvard University, is that there is no historical precedent to suggest that racial and gender imbalances will correct themselves. Mrs Chilazi says racial and gender barriers still exist and believes DEI solutions focused on \"levelling the playing field for all\" are needed.\nShe cites multiple experiments that show white men disproportionately receive more responses after applying for jobs than women or people of colour. A recent study by the National Bureau of Economic Research sent identical CVs to roughly 100 of the largest US companies and found that applicants presumed to be white were contacted by employers 9.5% more often than applicants presumed to be black - with one company contacting presumed white applicants 43% more often.\nBut Mrs Chilazi also says there are genuine issues with many DEI programmes, adding that the most common programmes - including diversity and unconscious bias training and employee resource or affinity groups - are often the least effective. A recent study highlighting the ineffectiveness of some DEI practices said a common issue was treating them as an end goal in themselves, without measurable outcomes.\nAnd when it comes to large corporations donating money towards DEI initiatives – like Walmart's equity centre – Mrs Chilazi says the problem is that there is not much data to show how effective this is. \"This is an area where we actually don't have good research,\" she says.\nWhere studies have shown DEI to be effective is when it comes to making \"small systemic changes\", she says. There is evidence to suggest replacing open-ended questions in performance evaluations with more specific ones, such as \"what's the one biggest accomplishment of this person last year?\", has shown significant reductions in gender and racial evaluation gaps that can affect pay, according to Mrs Chilazi.\nColleges and schools have already begun making adjustments in response to the new climate. At one university, a lunar new year celebration was cancelled; another ended a decades-long forum on race. Elsewhere, social clubs for black and Asian students have been disbanded.\nBut the ruling's impact does not appear straightforward. Enrolment numbers for black and Hispanic students at some other top US colleges have actually increased since the Supreme Court's decision.\nFor the freshman class that arrived in the autumn, Northwestern University saw an 11% rise in enrolment for black students and a 13% increase for Hispanic students.\nBecause of results like these, some DEI opponents have accused universities of flouting the court's ruling.\nBut another explanation offered for the increase in diversity at some universities is a shift towards \"socio-economic inclusion\" instead of race and ethnicity - which nonetheless appears to have achieved the same objective.\nDartmouth University's Hispanic student enrolment jumped from 9.7% to 12.7% last year, after adjusting to make the school \"more accessible for low- and middle-income families\", it said in a press release.\nShe gave the example of Walmart renaming its chief diversity officer to chief belonging officer. Similarly, McDonald's gave one of its programmes a facelift, changing the name of its Global DEI Center of Excellence to the Global Inclusion Team.\n\"DEI has become more of a controversial word,\" she says. \"If I just take that word out, I can still do the same thing.\"\nBut not everyone is reassured.\nBack in the fields of Union County, Elise Ashby looks towards the future with uncertainty. The grant from Walmart gave her access to capital that she argues black-owned businesses often struggle to obtain.\nShe fears a return to when she \"stayed up nights\" wondering where the next cheque would come from and facing the kind of obstacles \"white men don't have\".\nShe says: \"Am I concerned about the future? Absolutely.\"\nAdditional reporting by Natalie Sherman\nTop image credit: Getty Images", "url": "https://www.bbc.co.uk/news/articles/c24110m30ddo"}