{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:34:36", "date_modify": "2025-05-21 06:34:36", "date_publish": "2024-12-24 00:00:00", "description": "The airline grounded all flights for a hour on one of the busiest travel days of the year - it says a \"vendor technology issue\" was to blame.", "filename": "news_live_cy7knk1e212t_1747809276.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cy7knk1e212t_1747809276.html", "title": "American Airlines says flights are resuming after all services were grounded", "title_page": "American Airlines says flights are resuming after all services were grounded - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "American Airlines flights back in the air, with some ongoing delays\nChristmas Eve travel plans across the US were hit this morning by a technology issue which led to American Airlines briefly grounding all its flights. Here's a recap:\nAs American Airlines delayed flights across the country, the US Federal Aviation Administration announced, external a \"nationwide groundstop\" for all AA flights\nSome passengers were held at airports while others had to disembark from their planes\nThe \"groundstop\" was lifted after an hour, and flights began taking off again\nAmerican Airlines released a statement saying the problem was caused by a \"vendor technology issue\", but that the issue was \"resolved\"\nAlthough the glitch was short-lived, passengers are continuing to experience disruptions, with departure boards showing delays of up to two hours\nWith passengers now back in the air, we're pausing our live coverage of this story. Thanks for joining us.\nMillions of lives depend on IT we don't think about\nTom Singleton\nTechnology reporter\nThis fleeting outage revives memories of a much more significant IT failure – that caused in July by a rogue software update by the US cybersecurity company CrowdStrike.\nThe global IT outage that followed affected small businesses, hit health systems and caused travel chaos that dwarfed what we have seen today.\nA CrowdStrike executive felt obliged to make a grovelling apology when he was hauled before a US congressional committee to account for what had happened.\nWe have not seen anywhere near those levels of disruption here – nor is there likely to be a similar mea culpa from anyone at American Airlines. As a reminder, AA blames a \"vendor technology issue\" for \"briefly\" affecting flights today.\nBut this episode is yet another reminder of how millions of people’s lives and plans depend on IT we hardly ever think about – until it goes wrong.\nDeparture boards show delays of between one and two hours\nDeparture boards at major US airports show many American Airlines flights are delayed in the wake of the carrier's technical problem.\nAt Ronald Reagan Airport in Washington DC, dozens of flights scheduled to leave between 06:00 (11:00 GMT) and noon were pushed back, with most delays lasting between one and two hours.\nA flight to Dallas which was scheduled to leave at 06:30 departed at 08:16, while a 09:26 flight to the same city is delayed by almost two hours.\nMost flights in the afternoon are departing on time.\nMeanwhile, the departure times for local and international flights at Miami International Airport have also been delayed by up to two hours.\nA flight to Barbados, scheduled to leave at 10:35 has been pushed to 12:15, for example\nSeveral American Airlines flights at John F Kennedy International Airport in New York scheduled to leave in the morning were also delayed, including flights to San Francisco, Miami and Las Vegas.\nWatch: Moment American Airlines passengers were told to get off plane\nAs we've reported, the problem with American Airlines flights seems to be easing.\nBut this was the moment earlier when passengers on an AA flight in Boston were told to disembark at about 07:00 local time, as news of \"a technical issue\" came through.\n\"American Airlines computers are down and we're getting off the plane,\" one person on the plane at Boston Logan International Airport can be heard saying.\nFlights have resumed, says American Airlines\nMore now from that American Airlines statement.\n\"A vendor technology issue briefly affected flights this morning,\" it says.\n\"That issue has been resolved and flights have resumed. We sincerely apologize to our customers for the inconvenience this morning.\n\"It’s all hands on deck as our team is working diligently to get customers where they need to go as quickly as possible.\"\nGlitch, and wintery weather, could set back Christmas travel\nBrandon Livesay\nReporting from New York\nIt appears the American Airlines technical glitch has been resolved, with passengers saying they have started to board planes.\nBut after about an hour-long US-wide groundstop for all of the major airline's planes, there's a lot of travel time to catch up on.\nSo far the FAA is showing no major delays at US airports, but we'll wait to see how that plays out.\nHere on the East Coast it's just after 08:20 and many residents are waking up to another potential problem for travel - a clipper system has brought in winter weather with a fair bit of snow about.\nAnd over on the West Coast, a bomb cyclone has delivered heavy rain, mountain snow and high winds to some areas.\nFor those travelling today, it may not be a merry Christmas.\nPassengers report progress at some airports\nFurther to the FAA lifting the nationwide \"groundstop\", some individuals on social media are reporting that the problem has been resolved.\nIn a video posted on X, by a CBS reporter at Fort Lauderdale, a gate agent announces a flight to Philadelphia is going to start boarding.\n\"The system is slowly coming back,\" she announces from a gate.\nElsewhere, a Washington Post reporter stuck on the tarmac in Washington DC reports his American Airlines pilot has told their flight the outage was \"resolved\", and flights should be up in the air again soon.\nAmerican Airlines grounds all flights\nIt’s the start of a busy Christmas Eve travel day in the United States - and American Airlines has just grounded all its flights.\nThe disruption is due to a technical issue, according to the airline, which they say they are trying to fix as soon as possible.\nWe’ll bring you the latest updates right here as we get them.", "url": "https://www.bbc.com/news/live/cy7knk1e212t"}