{"authors": ["Sean Coughlan", "www.facebook.com"], "date_download": "2025-04-26 03:38:46", "date_modify": "2025-04-26 03:38:46", "date_publish": "2025-03-04 22:34:01", "description": "There will be four days of events in May commemorating the 80th anniversary of VE Day.", "filename": "news_articles_crewnnzv8g7o_1745638726.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/be56/live/c6b13e00-f927-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crewnnzv8g7o_1745638726.html", "title": "Flypast and concert in VE Day 80th commemorations", "title_page": "Flypast and concert in VE Day 80th commemorations - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There will be a four-day celebration of the 80th anniversary of VE Day, including a flypast, concert and a Westminster Abbey service, the government has announced.\nThe commemorations, marking 80 years since the end of World War Two in Europe, will run from the Bank Holiday Monday on 5 May, until 8 May.\nVeterans will be joining the events, with only a shrinking number of that generation able to attend in what will be among the last major wartime commemorations involving those who served.\n\"People across society will be able to hear our veterans' stories first hand, to reflect and remember,\" Culture Secretary Lisa Nandy said.\nIt would be an opportunity to \"pay tribute to all those who served in the Second World War and to reflect on the values that they were fighting for,\" said the culture secretary.\nAmong those who will be part of the commemorations is Ruth Bourne, 98, who worked at Eastcote, an outstation of Bletchley Park, where she was an operator of a wartime code-breaking machine, known as a \"Bombe\".\nShe remembers how the war had ended and the VE Day celebrations on 8 May 1945, when the Nazi regime in Germany had been defeated.\n\"There was an electric buzz among everyone and eventually the royals came out and waved, and we cheered like crazy waving whatever we had on us,\" Ruth says.\n\"People climbed on every available lamppost, lit bonfires in Hyde Park and we sat around singing songs.\n\"Not many went to bed that night.\"", "url": "https://www.bbc.co.uk/news/articles/crewnnzv8g7o"}