{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 04:04:36", "date_modify": "2025-04-26 04:04:36", "date_publish": "2025-03-03 18:38:23", "description": "The body of a man in his 70s is found in the same area where Sebastian Sailes disappeared on Thursday.", "filename": "news_articles_clynz884238o_1745640276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1368/live/c0a034f0-f858-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynz884238o_1745640276.html", "title": "Ben Sailes: Body found in Chippenham not missing man, say police", "title_page": "Ben Sailes: Body found in Chippenham not missing man, say police - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A body found in the River Avon is not that of a missing man who vanished in the same area, police have confirmed.\nThe body of a man in his 70s was found in the water near Westmead Open Space, Chippenham, on Monday morning, Wiltshire Police said.\nHe has since been identified and his next of kin informed, a spokesperson for the force said.\nOfficers are currently searching for 21-year-old Sebastian Sailes, who is thought to have travelled to the same area after he was last seen late on 27 February.\nThe police spokesperson added there were not thought to be any suspicious circumstances around the death of the man found in the river.\nAn extensive search operation for Mr Sailes is under way, following his disappearance after leaving the Black Horse Pub in Chippenham on Thursday night.\nHe was seen on CCTV heading towards Lovers Walk and is thought to have travelled south along Avon Valley walk towards his home address in Notton.\nMr Sailes is described as white, around 5ft 10ins tall, slim build, with blonde/brown hair and a long fringe.\nHe was last seen wearing a grey jumper, blue jeans, a beige fur-lined jacket and white Adidas trainers with a Velcro strap across the top.", "url": "https://www.bbc.co.uk/news/articles/clynz884238o"}