{"authors": ["Dan Martin", "www.facebook.com"], "date_download": "2025-04-26 06:56:07", "date_modify": "2025-04-26 06:56:07", "date_publish": "2025-02-28 15:15:01", "description": "A jury hears how Bhim Kohli's relatives found him on the ground in the park - yards from his home.", "filename": "news_articles_c5y00wx8glwo_1745650567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a596/live/bf9c0a00-f5a8-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y00wx8glwo_1745650567.html", "title": "Daughter found dad in agony, murder trial told", "title_page": "Bhim Kohli: Daughter found dad in agony, murder trial told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The daughter of an 80-year-old man who died after being attacked in a park discovered him on the ground screaming in agony, a murder trial has heard.\nBhim Kohli died the day after being assaulted while walking his dog in Franklin Park, yards from his home in Braunstone Town, Leicestershire, on 1 September last year.\nA 15-year-old boy and a 13-year-old girl, who cannot be named because of their ages, are on trial at Leicester Crown Court accused of killing him.\nOn Friday, the jury heard statements from Mr Kohli's children, who went to the park just after he was attacked.\nMr Kohli's daughter, Susan Kohli, said her father and her mother Satinder had lived at their home in Bramble Way, near the entrance to Franklin Park, for 40 years - and that he would walk his dog Rocky for 15 minutes a day \"whatever the weather\".\nShe said she had been resting at the family home when Mr Kohli went out and she heard a \"commotion\" outside.\nThe court heard she went into the park, found Mr Kohli lying on his back, and asked him what had happened.\n\"He screamed 'my neck, my neck, my neck',\" she said.\n\"This was not his normal tone. He was in agony. I have never heard him cry out like in pain like that before.\n\"He said, 'I have been punched in the face and they have kicked me'.\"\nWhen she asked him who had done it, she said Mr Kohli replied: \"It was the lads, the same lads.\"\nShe added: \"I found out the lad responsible was wearing a balaclava.\n\"I continued to reassure my father, stroking him on the arm.\"\nIn a later statement to police, she said her father had told him that he had been racially abused.\nThe trial has previously heard the male defendant, who denies charges of murder and manslaughter, had said Mr Kohli had \"pulled a knife\" on a girl - a claim the prosecution said was false.\nMrs Kohli said her father had never habitually carried a knife - either to work in his allotment or for his protection.\nShe added: \"He never felt the need to carry a knife - even after the anti-social behaviour.\"\nShe added Bramble Way had always been \"quiet and peaceful\", and described it as \"a great place to live\".\nIn a statement, Mr Kohli's son, Virender Kohli, said he arrived at Franklin Park to find paramedics helping his father.\nHe added: \"My dad said he had been hit and indicated by pointing to his left side in the area of his ribs and left side of his neck.\n\"I was in shock seeing him lying on the floor.\"\nHe described his father as \"fit as a fiddle\" and that he regularly tended to three allotments.", "url": "https://www.bbc.co.uk/news/articles/c5y00wx8glwo"}