{"authors": ["Meleri Williams", "www.facebook.com"], "date_download": "2025-04-26 04:07:47", "date_modify": "2025-04-26 04:07:47", "date_publish": "2025-03-02 21:51:30", "description": "A charity aims to offer 3,000 blood tests to help with early detection of cancer.", "filename": "news_articles_cn89v7z7422o_1745640467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/326e/live/b1267f30-f771-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn89v7z7422o_1745640467.html", "title": "Prostate cancer test 'could save lives and embarrassment'", "title_page": "Prostate cancer test 'could save lives and embarrassment' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A blood test that may indicate signs of prostate cancer could save \"lives and embarrassment\" if it was made more widely available, a charity has claimed.\nProstate Cymru aim to test thousands of men in Wales for signs of the disease, but the charity said many face difficulties in getting a free prostate-specific antigen (PSA) blood test from their GP, with some refused.\nThe charity said the demand from men aged above 50 has increased with more awareness.\nA Welsh government spokesperson said the particular test is not always the right intervention for men without symptoms of prostate cancer.\nFormer S4C weather presenter Chris Jones, 59, who is an ambassador for the charity, was diagnosed with early stages prostate cancer himself after cells were detected in 2018.\n\"It's so, so important to go for a PSA test early,\" said Chris, who now gets tested every year.\n\"[This campaign] takes the test to the man, rather than the man having to go to the doctor and being embarrassed.\n\"It could basically save lives, it's as simple as that.\"\nA pilot was held in April last year and the charity said 200 men were tested, with 18 requiring further investigation.\nAmong them was Martin Lewis, an area manager for Swansea Building Society, who said the test turned out to be \"one of the most important decisions\" in his life.\n\"Like many men, I had no symptoms and wouldn't have thought to get tested,\" Mr Lewis said.\nHe is now undergoing treatment and is urging other men to get tested.\nThe blood test measures the level of PSA protein, produced by the prostate gland, and may help detect early signs of prostate cancer.\nIf a raised PSA level is detected, men may be offered an MRI scan of the prostate to help decide if further tests or treatment is needed.\nBut NHS Wales said results can be unreliable, so men are not routinely offered it.\nWelsh government said there is national guidance to support GPs to have discussions with asymptomatic men who are concerned about their risk.\nIn Bridgend on Sunday, at the first event of the charity's testing tour, nurse Amy Griffiths said the process is \"literally a two second job\".\n\"We take one sample of blood, it's sent off to the lab, and the results come back in the next few days,\" she said.\nRetired consultant urologist and Prostate Cymru chairman, Andy Thomas, said the demand is high.\n\"It's the first part of the process in being diagnosed, or excluded, of having prostate cancer,\" he said.\n\"We used to test men with our fingers, and that's really put off men from being tested, so the PSA test has been deemed more important.\"", "url": "https://www.bbc.co.uk/news/articles/cn89v7z7422o"}