{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:47:19", "date_modify": "2025-04-26 06:47:19", "date_publish": "2025-03-01 12:18:24", "description": "Ramadan starts with sighting the crescent moon and most mosques observing the first day on Saturday.", "filename": "news_articles_c0kgxnd83nmo_1745650039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0e9d/live/24adc300-f687-11ef-93d4-53054053c79d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kgxnd83nmo_1745650039.html", "title": "Cambridgeshire Muslims begin Ramadan, holy month of fasting", "title_page": "Cambridgeshire Muslims begin Ramadan, holy month of fasting  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The holy month of Ramadan has begun with thousands of Muslims across Cambridgeshire and Peterborough taking part.\nIt is the most important time in the Islamic calendar where Muslims fast and refrain from eating or drinking between dawn and sunset.\nMuslims also believe it is a time for self-reflection and renewing their faith to Allah, with giving charity also know as zakat and reciting special evening prayers known as Taraweeh, being an important aspect of the month.\nThe month begins after the sighting of the crescent moon, with most mosques in Cambridgeshire starting their first fast on Saturday, while some are expected to start on Sunday.\nDuring the fast, two meals are eaten - one before the fast begins at dawn known as suhoor and another at sunset known as iftar where families sit together and break their fasts with dates and water.\nAll adults who are well and fit are obligated to fast during Ramadan, with young children, pregnant woman, elderly and sick people exempted.\nDuring the holy month, mosques open their doors for iftars most days.\nCambridge Central Mosque and Khadijah Mosque in Peterborough are among many others opening their doors to Muslim worshippers for iftar.\nCommunity iftar or open iftar events are gaining popularity as well around the country where people of diverse communities and all faiths join Muslims in breaking their fasts and share a meal.\nThe Ramadan Tent Project, a charity bringing communities together in Ramadan is hosting an open iftar at King's College in Cambridge on Friday, 7 March, while similar events called as unity iftars are expected to be held in Peterborough by the UK Islamic Mission.\nThe month of fasting usually last about 30 days and concludes with the festival of Eid-al-Fitr, which is a time of family celebrations following congregational prayers.", "url": "https://www.bbc.co.uk/news/articles/c0kgxnd83nmo"}