{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:19:58", "date_modify": "2025-04-26 06:19:58", "date_publish": "2025-03-01 07:03:00", "description": "Cheltenham Festival returns next week and is expected to attract about 250,000 spectators over four days.", "filename": "news_articles_c8d93y9jp69o_1745648398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6743/live/18518da0-e92e-11ef-9892-4b7641e79162.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d93y9jp69o_1745648398.html", "title": "Cheltenham Festival 2025: Everything you need to know", "title_page": "Cheltenham Festival 2025: Everything you need to know - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cheltenham Festival 2025 begins next week and is expected to attract about 250,000 spectators over four days.\nIt is one of the biggest events in the horse racing calendar and includes the famous Gold Cup race on its final day.\nPlanned road closures are being paused around Cheltenham Racecourse and the wider town.\nHere is everything else you need to know.\nThe annual event will take place every day from 11 March to 14 March.\nAll races are scheduled to start every day at 13:20 GMT, and feature races are from 16:00 GMT.\nFinal races are set to take place at 17:20 GMT each day.\nHowever The Jockey Club has said these times are subject to change.\nDay one of the event starts with Champion Day with Unibet Champion Hurdle as the main race.\nStyle Wednesday, traditionally known as Ladies Day until the 2024 festival, is day two's theme.\nSt Patrick's Day is the focus for the third day, and the feature races are Ryanair Steeple Chase and Paddy Power Stayers' Hurdle.\nAnd finally the main event - Gold Cup Day - is on the last day and will see The Boodles Cheltenham Gold Cup take place.\nThere are various ways people can travel to and from Cheltenham Racecourse throughout the week.\nArle Court Park and Ride\nLocated directly off Junction 11 of the M5 (Golden Valley Interchange), buses will run every 15 minutes from 09:15 GMT to 14:30 GMT to the racecourse for the first time.\nReturn journeys to Arle Court Park and Ride start from 16:00 GMT until 19:30 GMT.\nTickets are £15 per day and journey time is about 20 minutes, but traffic should be expected.\nShuttle bus\nStagecoach provides a shuttle bus service for Cheltenham Festival, operating between Cheltenham Spa Railway Station, Cheltenham town centre and the racecourse's south car park.\nTickets are £9 return and £6 single.\nTrains\nThe nearest railway station to the racecourse is Cheltenham Spa. As well as the shuttle bus, racegoers can walk or cycle between 2 to 3 miles (3.3km - 4.18km) directly to the venue.\nCar parking\nThe are several car parks located around the Cheltenham Racecourse site and you will need to book your parking online.\nMore information and a full detailed map is available on The Jockey Club's website, external.", "url": "https://www.bbc.co.uk/news/articles/c8d93y9jp69o"}