{"authors": ["Lucy Ashton", "www.facebook.com"], "date_download": "2025-04-26 04:11:16", "date_modify": "2025-04-26 04:11:16", "date_publish": "2025-03-04 12:46:14", "description": "Developers say they want to preserve the history of the former manufacturing works.", "filename": "news_articles_cy05wyg1ggqo_1745640676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3e46/live/8e9052f0-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05wyg1ggqo_1745640676.html", "title": "La Plata Works at Malin Bridge could become houses and apartments", "title_page": "La Plata Works at Malin Bridge could become houses and apartments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A developer has submitted plans to transform the site of a former sheep shears factory into homes and apartments.\nMetal trades company Burgon & Ball started manufacturing agricultural shears in 1730 and built La Plata Works at Malin Bridge in Sheffield in 1873 so they could harness the power of the River Loxley.\nDeveloper Distinfields Properties propose to convert some of the buildings on the site into 12 houses and 14 apartments and create a further 17 apartments in a new building.\nThe firm said it would be a \"sympathetic conversion\" to preserve the history of the buildings, which have been vacant since the factory closed about 20 years ago.\nThe site originally had six houses and the Turner's Wheel, all of which were destroyed in the 1864 Sheffield Flood.\nWhen Burgon & Ball built its premises, La Plata Works was carved into the main entrance in recognition of the firm's main export market in Argentina and Uruguay - both located on the River Plate known as La Plata.\nA spokesman for Distinfields Properties said: \"Our proposals seek to retain and refurbish the original stone and historic brick building which forms a horseshoe shape on the site, this is very much a sympathetic conversion to retain as much historic fabric as possible.\"\nThey said the modern warehouse on the site would be demolished and replaced with a new unit to provide further homes.\nThe development would include 21 car parking spaces, however some residents in the area have written to object over concerns about additional traffic and parking.\nThe Malin Bridge Inn, a pub directly opposite the site, said the new properties would need sound proofing.\nBen Fletcher, from the pub, said in a letter to planners: \"For well over a 100 years, the Malin Bridge Inn has been known as not just a pub, but also a live music venue.\"\nHe said the pub can have up to 100 people leaving late at night.\n\"The Malin Bridge Inn is a well-respected community pub and has been in my family for over 50 years.\n\"We welcome the new residents into our pub however I can't help but worry this could cause more trouble for us if the necessary precautions aren't put in place by the property developers.\"\nNo date has been set for Sheffield Council planners to consider the application.", "url": "https://www.bbc.co.uk/news/articles/cy05wyg1ggqo"}