{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:35:27", "date_modify": "2025-04-26 04:35:27", "date_publish": "2025-02-28 12:26:18", "description": "Jersey Electricity says it needs more time to reply to comments about the application.", "filename": "news_articles_cdjyyzlmlmzo_1745642127.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e91a/live/40b46780-f523-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyyzlmlmzo_1745642127.html", "title": "St Mary solar farm application withdrawn by Jersey Electricity", "title_page": "St Mary solar farm application withdrawn by Jersey Electricity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jersey Electricity (JE) has temporarily withdrawn a planning application for a solar farm on the island.\nThe company had applied to put 10,000 panels across eight fields in Champs Verts, St Mary.\nIt said it needed more time to reply to comments made by one of the people who was consulted about the scheme.\nIt said it intended to resubmit an application in due course.\nSave This View, a campaign group against the solar farm, said it welcomed the announcement of the withdrawal.\nThe group said the withdrawal coincided with a cabinet office report, published on Tuesday, which called Jersey Electricity's analysis of potential solar farm sites \"flawed\".\nThe report concluded that while the principle form of development and location were supported by the plan (subject to assessment of the environmental impact), the \"use of open countryside to host a renewable energy generating station has not, however, been clearly justified\".\nWilliam Layzell, who started the group, said: \"It reflects our concern, and that of the many objectors to this plan, that Jersey Electricity is taking the easy option of covering high-grade agricultural fields, rather than targeting brownfield sites.\n\"We are asking the simple question 'what price is the countryside' and the cabinet office appears to be asking it too.\"", "url": "https://www.bbc.co.uk/news/articles/cdjyyzlmlmzo"}