{"authors": ["Padraig Belton", "www.facebook.com"], "date_download": "2025-04-26 07:25:33", "date_modify": "2025-04-26 07:25:33", "date_publish": "2025-02-28 00:06:40", "description": "Ireland is investing billions of euros to revamp its healthcare service - will AI help?", "filename": "news_articles_cly7yxm3py5o_1745652333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c37/live/231d9a10-e223-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly7yxm3py5o_1745652333.html", "title": "Can AI help modernise Ireland's healthcare system?", "title_page": "Can AI help modernise Ireland's healthcare system? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For a country famous as Big Tech's European address, Ireland's hospitals often lag far behind in technology.\nThey lack shared computerised patient records, or unique identifiers to track people when they move between clinics.\nIn July 2024, a computer system failure made Dublin's Mater hospital push back surgeries and beg people not to come to its A&E.\nThree years before, Russian ransomware attackers shut down the Irish health system's entire computer network, and published 520 people's medical records online.\nBut Ireland now has ambitious goals to modernise its healthcare.\nThat includes a programme called Sláintecare, external. Announced in 2017, the plan is to use some of its €22.9bn (£20bn; $24bn) budget surplus to create a healthcare service that is free at the point of care, like the UK's or Canada's.\nTo improve healthcare, pinch points like diagnostics will have to be improved.\nIt's a problem being tackled at Dublin's Mater hospital, 164-years-old and the location of Ireland's busiest emergency department.\nThat's especially so in winter, when one day early this January Irish A&E departments had 444 people on trolleys waiting to be seen.\n\"In Ireland, the big problem we have is waiting lists, and in particular waiting for diagnostics, for MRI [magnetic resonance imaging] or CT [computed tomography] scans,\" says Prof Peter McMahon, a consultant radiologist at the Mater.\nBecause of Prof MacMahon, who as a medical student dabbled as a hobbyist programmer, the Mater is now among the first hospitals in Ireland to use artificial intelligence (AI) across its radiology department - the part of a hospital providing medical imaging to diagnose diseases and guide treatment.\nTo make sure patients with the most urgent needs are seen first, Prof MacMahon says: \"We use AI to immediately analyse all head scans for bleeds, all chest scans for blood clots, and all bone x-rays for fractures.\"\nThe AI is particularly helpful in assisting younger doctors, when they don't have experienced consultants to turn to.\n\"Now a nurse or junior doctor at 2am isn't alone, they've got a wing man,\" he says.\nRural hospitals face different kinds of challenges.\nLetterkenny University Hospital in Donegal is without MRI facilities at evenings and weekends.\nCurrently, a patient urgently needing an MRI scan at night can face an ambulance ride to Dublin.\nBut now, Prof MacMahon and the Mater's AI research fellow Paul Banahan have trained a trial AI model to create a \"synthetic MRI\" from CT scans, to immediately triage patients with suspected spinal injuries.\nThat was done by feeding a \"generative AI\" model around 9,500 pairs of CT and MRI images of the same area on the same person.\nNow the AI can predict what the MRI scan would look like from the CT scan, something available in all emergency departments.\nAnd since radiology scans also come with doctors' text reports, he is also exploring using large language models to identify important disease patterns and trends.\nApplying AI to medical images in Ireland is easier since the country has stored scans in a central, digital filing system since 2008.\nBut a lot of other important information, like medical notes or electrocardiograms (ECGs), remains largely in paper format in most Irish hospitals, or in smaller databases that are not shared centrally.\nThat will \"severely delay\" applying AI to spot potential diseases and improve clinical care, points out Prof MacMahon.\nAgeing IT systems in Irish healthcare are more broadly a challenge.\n\"Quite bluntly, a lot of hospitals are dealing with legacy IT systems where they're just trying to keep the show on the road,\" says Dr Robert Ross, a senior computer science lecturer at Technological University Dublin.\n\"Doing anything else like integrating AI is not easy to do,\" he says.\nHealthcare regulators, who already have a \"weak enough\" understanding of software as a medical device, haven't at all caught up with rules for AI, says Dr Aidan Boran, founder of an Irish medical tech start-up called Digital Gait Labs, and a researcher at Dublin City University.\nFor example, getting a CE mark, which shows that a medical device meets EU safety regulations, includes providing details about the factory where the product is manufactured.\nBut in the case of software that is not relevant says Dr Boran. \"For us, manufacturing literally means copying software,\" he points out.\nAI can have a black box problem: we can see what goes in them and what comes out, but the deep learning systems that power these models are so complex that even their creators do not understand exactly what happens inside them.\nThat can create difficulties for a doctor trying to explain treatment decisions that involve AI, says Dr Paul Gilligan, head of St Patrick's Mental Health Services, one of Ireland's largest mental health providers that runs St Patrick's Hospital in Dublin.\nWhen AI influences their decisions, doctors need to \"be able to articulate the reasoning behind those decisions in a manner that is accessible and understandable to those affected,\" he says.", "url": "https://www.bbc.co.uk/news/articles/cly7yxm3py5o"}