{"authors": ["Joanna Taylor", "www.facebook.com"], "date_download": "2025-04-26 06:20:53", "date_modify": "2025-04-26 06:20:53", "date_publish": "2025-03-01 06:24:03", "description": "Twelve 'convicts' are arrested by real police officers and had to raise at least £1,000 each.", "filename": "news_articles_c1mne0lddg8o_1745648453.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d60/live/fa8f5550-f5e8-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mne0lddg8o_1745648453.html", "title": "Mock arrests raise £30k for Cambridgeshire, Norfolk and Suffolk hospices", "title_page": "Mock arrests raise £30k for Cambridgeshire, Norfolk and Suffolk hospices - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A children's charity raised more than £30,000 by staging mock arrests of business men and women and holding them on bail.\nReal police officers detained 12 volunteers at East Anglia Children's Hospices (EACH) in Cambridgeshire, Norfolk and Suffolk.\nThey were then asked to raid their contact books to raise at least £1,000 each to secure their release.\nMichael O'Hagan, founder of MOH Consultancy, raised around £10,000 for the charity after being arrested for wearing shorts all year round.\nHe said getting involved was a \"no-brainer\", but going through the process was \"eye-opening\".\nBeing cuffed and bundled into a police van was a \"little slap of reality\", he said, that made him wonder what it was like for police officers and offenders during real-life arrests.\n\"I often wonder if other people look at the police [taking part in the mock arrests] and think why are they wasting their time doing that?\" he added.\n\"But £30,000 for a couple of hours isn't wasting anybody's time and helps to highlight EACH.\"\nSgt Rob Taylor from the South Cambridgeshire Neighbourhood Policing Team was among those who staged the arrests.\n\"So often we are at the sharp end of policing, so it was great for our neighbourhood officers to pop in throughout the day, when not dealing with crimes, and help raise more than £30,000 for charity,\" he said.\n\"Community engagement is a vital part of the role we play in society and it's clear our officers benefitted from a different style of 'detainee' for the day.\"\nAs well as pleading with friends, families and colleagues for bail, the 'convicts' were read their rights, had their fingerprints taken, were made to wear grey tracksuits and plimsolls and fed prison food while being 'held' at the hospices.\nThe total raised may grow as the fundraising push will continue until 4 March, external, despite 'bail' having been met by most of the 'convicts'.\nAn EACH spokesperson said it was fitting they were able to pass the £28,500 mark as this was the amount needed to pay for a day of care at the hospice.", "url": "https://www.bbc.co.uk/news/articles/c1mne0lddg8o"}