{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:42:46", "date_modify": "2025-04-26 06:42:46", "date_publish": "2025-03-02 11:04:03", "description": "The Spirit of Tasmania IV has been docked in Leith due to issues at the Tasmanian port.", "filename": "news_articles_cn045ld91yzo_1745649766.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c2c4/live/0805c090-f74a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn045ld91yzo_1745649766.html", "title": "Australian 'fiasco' ferry ordered to leave Edinburgh", "title_page": "Australian 'fiasco' ferry ordered to leave Edinburgh - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A newly-constructed Australian ferry will be moved from Edinburgh to the other side of the world after leasing negotiations broke down.\nOften described as a \"fiasco\", the Spirit of Tasmania IV has been docked in Leith for three months due to issues with existing infrastructure in the Tasmanian city of Devonport.\nOperator TT-Line said it had been engaging with a broker to lease the ferry, however an agreement could not be reached.\nThe Tasmanian government has now ordered the ferry operator to relocate the 212m-long (695ft) vessel to the island.\nThe ship was built at a yard in Finland, but had to be moved to Scotland before winter over concerns it could be damaged by pack ice.\nA new berth to accommodate the ship, and sister vessel Spirit of Tasmania V, may not be ready until late 2026 or 2027 and the saga has sparked a huge political row in Australia.\nThe vessel was due to operate in the Bass Strait, between Tasmania and the Australian state of Victoria, and had been described as a \"game-changer\" for the island's tourism industry.\nHowever, it has seen a series of delays in its construction, skyrocketing costs and problems upgrading the current berths - mirroring many of Scotland's own ferry problems.\nTasmania's infrastructure minister, Michael Ferguson, and the chairman of ferry operator TT-Line, which is state-owned, resigned due to the controversy in August.\nThe cost of building the two LNG dual-fuel ships has risen by A$94m (£47.5m) from A$850m (£430m) when the contract was signed in 2021.\nMeanwhile the cost of upgrading current infrastructure in Devonport, which handles about 450,000 passengers a year, has more than quadrupled from an original estimate of A$90m (£45.5m).\nTT-Line was paying A$47,534 (£24,031) per week to berth the ship at Forth Ports, according to figures published by the Tasmanian government.\nLast week Australian media reported there was a possibility of the ferry being used to house Ukrainian refugees in Scotland.\nHowever the Scottish government quickly dismissed this saying: \"This is not true and we have no plans to lease this or any other vessel for this purpose.\"", "url": "https://www.bbc.co.uk/news/articles/cn045ld91yzo"}