{"authors": ["Liam Barnes", "Rob Sissons", "www.facebook.com"], "date_download": "2025-04-26 07:31:31", "date_modify": "2025-04-26 07:31:31", "date_publish": "2025-02-27 17:12:57", "description": "Donna Ockenden says the CQC is still to publish the findings from its visit in June last year.", "filename": "news_articles_c7vzzrvv3q9o_1745652691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9cf3/live/11fdf580-f511-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7vzzrvv3q9o_1745652691.html", "title": "Donna Ockenden: CQC criticised by Nottingham maternity inquiry lead", "title_page": "Donna Ockenden: CQC criticised by Nottingham maternity inquiry lead - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The head of the independent review into maternity failings at Nottingham hospitals has criticised a health watchdog over a nine-month delay into its findings.\nDonna Ockenden, whose inquiry into hundreds of neonatal deaths, stillbirths and injured babies and mothers began in September 2022, said the Care Quality Commission (CQC) was still to publish the findings from its visit in June last year.\nShe also said the watchdog should have been quicker in prosecuting Nottingham University Hospitals (NUH) NHS Trust, with the organisation fined £1.6m earlier this month over failings in three baby deaths.\nThe CQC said publication of some reports had been delayed because of computer problems, what it described as part of \"a large-scale transformation programme\", and thanked families \"for their time and input\" in helping the recent court cases.\nLast year the CQC was criticised by Health Secretary Wes Streeting, who said the body was not fit for purpose and that he was \"stunned by the extent of the failings\".\nMs Ockenden referred to the recent prosecution of the trust and stressed the watchdog needed to provide more support for people who have suffered \"unimaginable tragedy and loss\".\nShe added the current approach \"hasn't worked for the families here in Nottingham\".\n\"I'm aware how hard families have had to work to get the CQC initially to engage with them, to be interested in them, and finally to make a decision to prosecute,\" she said.\n\"These families will never get over [or] recover from what has happened to them, but what we're hearing time and time again is the compounded harm that is caused when families have to fight for justice.\"\nMs Ockenden said the results from the CQC's most recent inspection still had not been received by the trust, which was hampering efforts to bring about improvements.\n\"I don't think it's acceptable for there to be a nine-month delay [between inspection and publication],\" she said.\n\"Every day and week that goes by, I think that what families, local residents, and perhaps even staff would say is this report becomes less and less relevant - it's a picture of where we were last June.\"\nMs Ockenden said Streeting \"is looking very carefully across the patient safety landscape\" to improve accountability.\n\"I think the families - certainly in Nottingham, perhaps across the country - would be saying to him and to government, [that] having to fight so hard over such a prolonged period of time is not fair, and it's not right, and something needs to be done to change that,\" she said.\nMs Ockenden said she expected the review would be closed to new families on 31 May, with about 2,500 estimated to be involved by the time it stopped accepting additional cases.\nShe said she had been \"really pleased\" with NUH staff getting in touch with the review team, and also praised improvements to midwifery recruitment, but said families had also raised \"very recent examples of communication by trust staff that is leading to further distress\".\nThe CQC has apologised for the delay in publication of the report, adding it is \"taking urgent steps to ensure that inspection reports are published in a much more timely manner\".\nIt accepted that \"the amount of time taken to publish falls far short of what people using services and providers should be able to expect\".\nRegarding prosecutions, the CQC said there was \"a high threshold\" for evidence to clear before pursuing a case, but said it had \"a number of enforcement actions\" outside of court it could take \"to help drive improvement\".\n\"In cases where we consider evidential and public interest tests are met, we can bring a criminal prosecution,\" the statement said.\n\"In the case of [NUH], we hope that this particularly complex and difficult investigation and the resulting prosecution will drive real learning, deterrence and accountability as well as achieving justice for families.\"", "url": "https://www.bbc.co.uk/news/articles/c7vzzrvv3q9o"}