{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:39:03", "date_modify": "2025-05-19 15:39:03", "date_publish": "2017-07-19 00:00:00", "description": "The latest news, sport, travel and weather for the East Midlands Wednesday 19 July 2017.", "filename": "news_live_uk-england-derbyshire-40642956_1747669143.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-derbyshire-40642956_1747669143.html", "title": "Latest updates: East Midlands Live", "title_page": "Latest updates: East Midlands Live on Wednesday 19 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Who's been eating from my bowl?\nHeather Burman\nJournalist, BBC News Online\nA cat got a surprise when a badger popped through its cat flap.\nIts owner has rigged up a camera to catch the visits to the house in Nottingham.\nWeather: Humid night with the chance of some thunderstorms\nAnna Church\nBBC East Midlands Today weather presenter\nFor most it will be a dry end to the day although there is the risk of an isolated thunderstorm.\nIt will be another humid night. Cloud will increase with some light and patchy rain arriving from the west by dawn.\nMinimum temperatures of 15C (59F).\nBurton's MP named beer drinker of the year\nAleena Naylor\nBBC Radio Derby newsreader\nIt's a title previously held by Andrew Flintoff and Prince Charles, but now the MP for Burton and Uttoxeter has been named Beer Drinker of the year.\nThe title's been bestowed on Andrew Griffith by the All-Party Parliamentary Beer Group - which he's also been made an honorary life president of.\nHannah Pearson killing: Man guilty of manslaughter\nGreig Watson\nReporter, BBC News Online\nA man has been cleared of murdering a 16-year-old girl but found guilty of her manslaughter.\nJames Morton, 23, had met Hannah Pearson on 23 July 2016 and she went to his house in Newark, Nottinghamshire.\nHe told the trial at Nottingham Crown Court he had been giving her a massage and she had agreed to him putting pressure on her neck.\nMorton, who denied murder, saying he had no reason to want Ms Pearson dead, will be sentenced on Thursday.\nWeather warning for rain still in place\nAnna Church\nBBC East Midlands Today weather presenter\nBefore I get to the main forecast, here is a reminder that there is a yellow warning for rain still in place until 23:55 this evening.\nPlease keep an eye on the BBC Weather website for the most up-to-date information.\nBBC salary exposure 'an absolute outrage,' quips Lineker\nCalum McKenzie\nBBC Local Live\nMatch of the Day presenter Gary Lineker has feigned outrage at the revelation that Chris Evans is paid more than him by the BBC.\nThe pair's salaries, up to £1.79m and £2.25m respectively, were released for the first time as part of the BBC's Annual Report.\nFollowing the disclosure, former Leicester striker Lineker wrote on Twitter, external: \"This whole BBC salary exposure business is an absolute outrage...I mean how can @achrisevans be on more than me?\"\nHe had tweeted earlier this morning he would have his \"tin hat\" ready for after the salary release.\nPieces from yarn bomb project disappear\nMaryam Qaiser\nBBC Local Live\nDo you remember the yarn bomb project in Arnold?\nWell the group behind it says some of the pieces have gone missing today.\nTwo blankets and a squirrel have disappeared from the Market Place.\nThe Robin Hood style decorations were created by the ladies from the Button Moon craft shop to brighten up the area.\nT20 cricket: Rapids v Falcons\nDave Bradley\nCricket commentator\nYou can hear full ball-by-ball commentary as the Worcestershire Rapids take on the Derbyshire Falcons at New Road.\nThe game gets under way at 17:30 - hear it on BBC Hereford & Worcester's 738AM frequency and online.\nBullets found in car at Download Festival\nJeremy Ball\nSocial affairs correspondent, BBC East Midlands Today\nIt's emerged that live ammunition was found during a huge security operation at this year's Download music festival in Leicestershire.\nSecurity staff found a box of rifle bullets in the boot of a car.\nPolice say they'd been left there inadvertently by a registered firearms license holder.\nThe bullets -- which are used to shoot rabbits -- were handed over and destroyed by police officers.\nThe incident isn't being treated as a security threat.", "url": "https://www.bbc.com/news/live/uk-england-derbyshire-40642956"}