{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:30:22", "date_modify": "2025-04-26 04:30:22", "date_publish": "2025-03-03 06:21:40", "description": "The ombudsman said Slough Borough Council was at fault and should apologise.", "filename": "news_articles_ckgz1282428o_1745641822.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fcb0/live/20e42a90-f608-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz1282428o_1745641822.html", "title": "Council to pay £6,500 after failing autistic child", "title_page": "Slough Borough Council to pay £6,500 after failing autistic child - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council should pay £6,500 in compensation to an autistic child and their mother for failing to provide special educational provision (SEP), an ombudsman has found.\nThe Local Government and Social Care Ombudsman said Slough Borough Council was at fault, external in the case of the child, known as Child Y, and the mother, Ms X, and should apologise.\nThe ombudsman also said the authority's complaint handling caused \"avoidable distress and time and trouble\".\nThe council apologised and said it sincerely regretted its \"shortcomings\".\nThe ombudsman said it had failed to provide Y's education, health and care plan between September 2023 and July 2024.\nThe child was home schooled by the mother from June 2022 to September 2023, but was then due to transfer to a secondary school as part of a council education, health and care (EHC) plan.\nBut the mother told the council's SEND (special educational needs and disabilities) team that the school could not meet Y's needs.\nThe council said the situation would be reviewed in October and that Ms X's preferred school had no available places, but in the end she did not send her child to the recommended school.\nMonths of complaints from Ms X and correspondence between the relevant institutions continued until the following Summer.\nThe ombudsman found that the council failed to secure the education as part of its care plan and caused Ms X \"confusion and frustration\" because of its \"poor complaint response\".\nThe report said the authority should \"remedy the injustice\" with a payment of £6,000 to reflect Y's lost SEP, and one of £500 to Ms X to reflect her \"avoidable distress and time and trouble complaining\".", "url": "https://www.bbc.co.uk/news/articles/ckgz1282428o"}