{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:49:59", "date_modify": "2025-04-26 03:49:59", "date_publish": "2025-03-05 13:11:36", "description": "Lewis Bell, 26, was chased down and stabbed in the back amid a drug feud, prosecutors say.", "filename": "news_articles_cvgwn07ge0do_1745639399.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/77f2/live/18741b00-f8eb-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwn07ge0do_1745639399.html", "title": "Alleged Stockton murderers 'hunted man like prey'", "title_page": "Alleged Stockton murderers 'hunted man like prey' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two men and a teenager hunted a man down like prey and murdered him in a drug feud, a court has heard.\nLewis Bell, 26, was chased down and fatally stabbed in the back on Hills Drive in Stockton in September, Teesside Crown Court heard.\nLiam Matthews, 26, and Sean McLeod, 23, both of no fixed abode, and a 17-year-old who cannot be named all deny murder.\nProsecutor Peter Makepeace KC said the trio acted like a pack of predatory animals.\nAfter a short chase in which Mr Bell was \"running for his life\", the trio caught up with and attacked him shortly after midnight on 19 September, Mr Makepeace said.\nContinuing his opening of the case to jurors, Mr Makepeace showed CCTV footage in which Mr Bell could be heard begging for his life, repeatedly \"crying please\" and asking for an ambulance as \"it's gone in my heart\".\n\"It is apparent that young man was aware of what was happening to him and of his fate,\" Mr Makepeace said.\nMr Bell knocked on doors for help before collapsing in the street, with concerned residents quickly calling 999.\nDespite the best efforts of paramedics, he was declared dead at the scene at 00:37 BST, the court heard.\nHe was found to have suffered a 5in (12.5cm) stab wound to his back which penetrated his lung causing \"massive blood loss\", Mr Makepeace said, as well as two other knife injuries to his arms.\nThe prosecutor said the defendants acted as a pack and were all equally responsible for Mr Bell's death.\n\"They killed him together,\" Mr Makepeace said, adding: \"Like a pack of predatory animals, they chased Lewis Bell down and they killed him.\"\nMr Makepeace said they were \"intent on teaching him a lesson about taxing the customers of the drugs house\".\nTaxing is a term used for robbing or raiding rival drug dealers and users, the court heard.", "url": "https://www.bbc.co.uk/news/articles/cvgwn07ge0do"}