{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 04:41:29", "date_modify": "2025-04-26 04:41:29", "date_publish": "2025-03-02 07:08:07", "description": "The former lifeguard hut at Polurrian Beach has been empty since 2014 due to storm damage.", "filename": "news_articles_cly88y8504do_1745642489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f3d/live/3d9de860-f5d6-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly88y8504do_1745642489.html", "title": "Mullion Surf Life-Saving Club seeks return to beach HQ", "title_page": "Mullion Surf Life-Saving Club seeks return to beach HQ - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A derelict Cornish beach hut could be restored to its \"former glory\" in time for the summer.\nMullion Surf Life-Saving Club has issued a fundraising plea, external in a bid to raise £50,000 to support a £180,000 rebuilding project for the lifeguard hut at Polurrian Beach.\nThe club said the seaside building, which was its former base, had been sitting empty since it was damaged in a storm in 2014 and had become an \"eyesore\".\nPlans for the hut, which has been bought from Cornwall Council by the Polurrian Beach House Trust, include new toilet and shower facilities along with storage for equipment.\nClub representative Simon Mitchell said not being able to use the building had provided a number of challenges since 2014.\n\"For nearly a decade we've been operating out of my garage which isn't sustainable,\" he said.\n\"Rebuilding this facility is critical to continuing our life-saving mission and serving the community.\"\nLeanne Lester, a coach and lifeguard at the surf life-saving club, said other groups such as the local RNLI crew could use the hut as well once it was restored.\n\"It would mean the world for us to bring the building back to its former glory,\" Ms Lester said.\nRich Mulryne, a trustee for the Polurrian Beach House Trust, said the project had a lot of support already but more was needed from the local community.\n\"It's not just a financial begging bowl, although there is a part of that as well, but also to be involved as a community to benefit us all,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cly88y8504do"}