{"authors": ["Christian Barnett", "www.facebook.com"], "date_download": "2025-04-26 07:53:23", "date_modify": "2025-04-26 07:53:23", "date_publish": "2025-02-25 14:00:50", "description": "Plans to build shops and flats were first accepted in 2010 before going through revisions.", "filename": "news_articles_ckgnyy32rrro_1745654003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11d4/live/eac27ad0-f372-11ef-8402-45d3cf1c2dcb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgnyy32rrro_1745654003.html", "title": "New shops and flats plan for Wolverhampton could be approved", "title_page": "New shops and flats plan for Wolverhampton could be approved - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New shops and flats could finally be built planning permission was first requested over a decade ago.\nThe move would see five new shops and eight flats built on a boarded-up patch of land off Dudley Road, Blakenhall, Wolverhampton.\nCity of Wolverhampton Council first approved a plan to build shops and flats on the site of the former petrol station in 2010 before it went through several revisions – the last of which were approved in 2018.\nThe original developer then faced \"financial difficulties\" according to a letter sent to planners with the land eventually put up for sale in 2019.\nWork had begun several years ago with the site cleared and foundations put in place but little has been done since 2017.\nThe site was bought again in late 2020 and a new planning application was submitted for the revised work of shops and flats with a new two-storey extension to be approved.\nA total of 21 parking spaces would also be provided.\nThe original approved scheme had a large single supermarket on the ground floor and four large 100 square metre apartments on the first floor.\nA statement included with the application added: \"This may have been viable in 2014 when permission was granted however, Dudley Road already has a number of larger supermarket outlets along its route and our client wishes to offer a varied local centre with three smaller specialised retail outlets and two sit-in cafes on the ground floor.\n\"The large first floor apartments would be very difficult to fill in the current climate, all were two-bed four person minimum.\n\"Our client has marketed the development with two agents over a twelve month period and there has been no interest in larger units however, there is considerable interest in single and smaller two bed units.\"", "url": "https://www.bbc.co.uk/news/articles/ckgnyy32rrro"}