{"authors": ["Martin Eastaugh", "www.facebook.com"], "date_download": "2025-04-26 07:51:54", "date_modify": "2025-04-26 07:51:54", "date_publish": "2025-02-25 14:48:18", "description": "Three men are standing trial over the theft of the gold toilet which had been part of an exhibition.", "filename": "news_articles_cp8yq3q3050o_1745653914.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3d52/live/2a7547a0-f37f-11ef-bdb2-df3b1e28059d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8yq3q3050o_1745653914.html", "title": "Gold toilet theft trial: Jury shown CCTV of Blenheim Palace raid", "title_page": "Gold toilet theft trial: Jury shown CCTV of Blenheim Palace raid - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "CCTV footage showing the moment thieves stole a solid gold toilet worth £4.8m has been shown in court.\nThe work of art, called America, was taken from Blenheim Palace in Oxfordshire in the early hours of Saturday, 14 September 2019.\nMichael Jones, 39, from Oxford, denies one count of burglary. Fred Doe, 36, from Windsor and 41-year-old Bora Guccuk, from west London, both deny conspiring to transfer criminal property.\nThe footage played at their trial at Oxford Crown Court showed two vehicles driving across the Great Courtyard, before hooded individuals armed with sledgehammers and a large crowbar broke into the palace. One could be seen leaving carrying a golden toilet seat.\nThe CCTV footage shown in court captured two cars driving across the courtyard which had been covered in union flags as part of the exhibition.\nFive minutes later, the raiders can be seen rolling the gold toilet away from the building, before bundling it into the back of a blue VW Golf causing the car's suspension to sag under the 98kg weight.\nOne of the group can be seen clutching the golden toilet seat, which is also thrown into the back of the car.\nProsecution barrister Julian Christopher KC said it showed \"three people standing-up\" and \"a driver for each car\".\nPalace security guards, who had been watching on CCTV, chased on foot as the two cars sped away from the scene, Oxford Crown Court was told.\nThe 18-carat gold toilet was part of an exhibition at the palace by Italian conceptual artist Maurizio Cattelan.\nThe fully functioning lavatory was insured for the sum of $6m (£4.8m), the court heard previously.\nThe jury was also shown CCTV footage of Mr Jones and his partner on a visit to Blenheim Palace on the day before the burglary.\nThe court heard the pair had booked tickets to view the toilet in its cubicle.\nThe jury was shown photographs which the prosecution said were taken on Mr Jones' phone at that time of the toilet in situ, of the inside of the toilet door and of the window the thieves would later use to gain entry to the palace.\nThe thieves drove through locked gates into the grounds before breaking in through a window, jurors were told.\n\"They knew precisely where to go, broke down the wooden door to the cubicle where the toilet was fully plumbed in, removed it, leaving water pouring out of the pipes, and drove away,\" prosecutor Julian Christopher KC said previously.\n\"Clearly such an audacious raid would not have been possible without lots of preparation\", he added.\nThe court was previously also told the toilet was believed to have been broken up after it was stolen.", "url": "https://www.bbc.co.uk/news/articles/cp8yq3q3050o"}