{"authors": ["George King", "Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 03:46:42", "date_modify": "2025-04-26 03:46:42", "date_publish": "2025-03-05 05:33:21", "description": "Peterborough City Council says it cannot currently commit to funding the scheme.", "filename": "news_articles_cg4kvd3wgy1o_1745639202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fc91/live/ad779d20-f8d3-11ef-8a06-7ba4024a445c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4kvd3wgy1o_1745639202.html", "title": "'Lifeline' food voucher scheme in Peterborough could be axed", "title_page": "'Lifeline' food voucher scheme in Peterborough could be axed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Food vouchers described as a \"lifeline\" for residents-in-need could be axed after council bosses said they could not commit to funding the scheme \"at this stage\".\nPeterborough City Council currently allocates money from its Household Support Fund to Compas, which issued vouchers to those struggling to afford to buy food.\nThe charity, based at the Peterborough Culture Centre, had also previously offered a breakfast club programme, before deciding to no longer run the service.\nAt the end of March, funding for the scheme will end, leaving the \"really important\" programme potentially unable to continue supporting residents all together.\nA spokesperson for the council said: \"We are currently awaiting the Department for Work and Pensions to make an announcement of our funding for next year.\n\"At this stage, we cannot make any commitment to further funding and will need to re-assess commissioning Compas now they are not able to offer the same provision.\"\nCompas has more than 20 community hubs offering food vouchers and additional support.\nPetr Torak, who is the chief executive of the charity, said the possibility of the food voucher scheme ending has sparked \"lots of disappointment\".\n\"We give out food vouchers every Wednesday and sometimes 40 people are queuing outside on a rainy or freezing day for two hours to get a £10 food voucher,\" he added.\n\"That shows the level of desperation there is and the demand has been increasing constantly.\n\"This is an essential and very important service and families would struggle [without it], but unfortunately this scheme is finishing in three weeks' time.\"\nOne of those people who has been using the scheme since January after her circumstances changed told the BBC she and others relied on the food vouchers.\nShe added: \"I think it is really important because I am a single person so I have the bulk of the bills to myself, so every tiny little bit helps and they are a lifeline.\n\"But it's not just people who are unemployed who use it, it's pensioners and disabled people, and last week during half-term I saw a couple of women with their children.\n\"People queue up for over two hours in the hope they are going to get something, so, everybody is panicking because we don't know what's happening beyond April.\"\nProject coordinator Kamile Parimskyte also said there was a \"mixed range\" of different people who visit the centre to collect food vouchers.\n\"We try to support everyone the best we can, from families to single people, but a lot of the time we have to send people away until the following week,\" she said.\n\"We just hope they have a good day after getting the voucher and we are hoping to get new funding because it really does help people.\"", "url": "https://www.bbc.co.uk/news/articles/cg4kvd3wgy1o"}