{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:09", "date_modify": "2025-05-19 14:23:09", "date_publish": "2015-04-02 06:32:50", "description": "The US says Thailand's replacement of martial law with new emergency measures does little to reduce the power of the military.", "filename": "news_world-asia-32157204_1747664589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82075000/jpg/_82075030_82075029.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-32157204_1747664589.html", "title": "Thailand martial law replacement criticised by US", "title_page": "Thailand martial law replacement criticised by US - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The US says the replacement of martial law with new emergency measures in Thailand does little to restore democracy in the military-run country.\nThailand's army, which took power in a coup in May, declared martial law over on Wednesday after almost a year.\nBut a section of the new constitution has been invoked instead under which the military retains significant power.\nCritics have said Article 44 could lead to more draconian leadership and gives PM Prayuth Chan-Ocha unchecked power.\nSecurity forces are still able to make arrests without warrants and detain people without charge, while Gen Prayuth - who led last year's coup - can rule by executive order in the name of national security.\nThe media remains heavily restricted and political gatherings of more than five people are still banned.\nThe US said it had wanted to see an end to detentions and the limits on freedom of expression.\n\"We are concerned that moving to a security order under Article 44 will not accomplish any of these objectives,\" a State Department official said.\n\"We would welcome the actual, full restoration of civil liberties in Thailand.\"", "url": "https://www.bbc.com/news/world-asia-32157204"}