{"authors": ["Jacob Panons", "www.facebook.com"], "date_download": "2025-04-26 03:55:51", "date_modify": "2025-04-26 03:55:51", "date_publish": "2025-03-04 15:39:43", "description": "Lucian Sorenau, 32, denies manslaughter, actual bodily harm and affray.", "filename": "news_articles_cvg19vdpj72o_1745639751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ef55/live/63410a80-f90e-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg19vdpj72o_1745639751.html", "title": "Brighton attack: Man died after blood clot went to lung, jury told", "title_page": "Brighton attack: Man died after blood clot went to lung, jury told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man died six weeks after an unprovoked attack as a blood clot from his injured ankle travelled and blocked an artery in his lung, a court has heard.\nHove Crown Court heard that Lucian Sorenau, 32, attacked father-of-two Anthony Barrigan in Windsor Street, Brighton, on 18 June 2022.\nThe 44-year-old, who told police his ankle had been \"snapped\", died unexpectedly weeks later from a pulmonary thromboembolism on 1 August.\nMr Sorenau denies manslaughter, actual bodily harm and affray.\nThe jury heard police were called to a delivery bay in central Brighton at about 22:30 BST, following reports of an assault on Mr Barrigan and his girlfriend Sarah Chollerton.\nBen Irwin for the Crown said Mr Barrigan provided a witness statement before his death.\nMr Irwin said: \"He set out how he had been confronted by a complete stranger who attacked him without warning.\n\"He describes how he tried to fight back but couldn't.\"\nMr Irwin explained that Mr Barrigan felt the attacker stamp on his right ankle.\n\"He describes the most excruciating pain he had felt in his life,\" he added.\nMr Barrigan went on to collapse at home and paramedics were unable to save him.\nTwo years after the incident, Mr Sorenau was charged with manslaughter.", "url": "https://www.bbc.co.uk/news/articles/cvg19vdpj72o"}