{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:44:46", "date_modify": "2025-04-26 06:44:46", "date_publish": "2025-03-01 16:56:06", "description": "Speaking on a visit to Northern Ireland, the Conservative leader described the tax rise as a \"family farms tax\" and called for it to be reversed.", "filename": "news_articles_cm2n480xkx3o_1745649886.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5fe9/live/841e9d40-f6bf-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2n480xkx3o_1745649886.html", "title": "Inheritance tax change 'immoral', Kemi Badenoch says", "title_page": "Inheritance tax change 'immoral', Kemi Badenoch says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Conservative Party leader Kemi Badenoch has said that government changes to inheritance tax for farmers is \"immoral\".\nSpeaking on a visit to a farm in Bangor, County Down, she described the tax rise as a \"family farms tax\" and called for it to be reversed.\nIn the autumn budget, the chancellor Rachel Reeves capped the Agricultural Property Relief at £1m, with anything over that being taxed at 20%, half the normal rate of inheritance tax.\nThe government insists the majority of farms in Northern Ireland will be unaffected.\nThe change will be introduced from April 2026.\nThe government is adamant that its policy will not change. Other reliefs may help reduce the amount owed, but concern remains high.\nSpeaking from Fairview dairy farm near Bangor, the Conservative Party leader said: \"We want farmers to know that we are with you, we understand.\n\"Taxing those assets to force farmers to often give up their land and their children or their grandchildren to not continue in this way of life, I believe, is immoral.\n\"We are doing everything we can to fight the family farms tax.\"", "url": "https://www.bbc.co.uk/news/articles/cm2n480xkx3o"}