{"authors": ["Grace Howarth", "www.facebook.com"], "date_download": "2025-04-26 04:31:57", "date_modify": "2025-04-26 04:31:57", "date_publish": "2025-03-03 06:04:18", "description": "A railway bridge is \"horrible\" to walk under due to bird droppings and the lack of drainage.", "filename": "news_articles_crknn33x2epo_1745641917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ccf/live/58e11880-f5b4-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crknn33x2epo_1745641917.html", "title": "Call for 'health hazard' north London railway bridge clean up", "title_page": "Call for 'health hazard' north London railway bridge clean up - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Network Rail and Transport for London (TfL) are being urged to clean up a railway bridge underpass said to be creating a \"health hazard\" for residents.\nThe bridge over the North Circular Road has been monitored since an orange substance was spotted leaking from its weep holes on to the pavement, according to the Local Democracy Reporting Service (LDRS).\nResidents also say the underpass is \"absolutely disgusting\" as the drains are full and nesting pigeons leave behind droppings.\nNetwork Rail has said the orange substance poses no significant risk and TfL has said it is going to improve the drainage and clean the area more regularly.\nThe railway bridge is on the border of three north London boroughs – Haringey, Barnet and Enfield and carries the East Coast Main Line just south of New Southgate Station.\nIt is the responsibility of Network Rail, while TfL maintains the A406 North Circular which passes underneath the bridge.\nThe route is often used by locals to access Friern Bridge Retail Park.\nAlessandra Rossetti, a Liberal Democrat councillor for Alexandra Park ward in Haringey, said she'd begun making enquiries about the issues in 2023.\nRossetti said: \"It is shocking to me that years of neglect and a failure to take responsibility by multiple organisations have transformed a simple case of disrepair into a health hazard for residents.\n\"It isn't right that people in the area are having to suffer the consequences of this neglect.\n\"It is time for all stakeholders to stop shifting responsibility, pull together to address pigeons roosting, stop the leak, work on piping the drains and ensure proper maintenance of the footpath. Now is the time to take action.\"\nHazel Stokes, a resident, said she walks this route a couple of times a week to shop at the retail park, along with mums with prams, cyclists, and pedestrians who are all affected.\nShe said: \"You're walking in pigeon poo, and everything that's thrown up from the road, it's absolutely disgusting, and it's been this way for years.\"\nBarbara Waller, another resident, said she'd contacted Network Rail years ago to tell them it was \"dangerous\" and \"horrible for people walking along there\".\nShe added her two daughters \"take their shoes off and wash their trolleys before they can come back into the house, it's absolutely disgusting\".", "url": "https://www.bbc.co.uk/news/articles/crknn33x2epo"}