{"authors": ["Giancarlo Rinaldi", "www.facebook.com"], "date_download": "2025-04-26 04:28:24", "date_modify": "2025-04-26 04:28:24", "date_publish": "2025-03-02 09:29:36", "description": "BBC readers have reacted to plans for the Star of Caledonia sculpture near Gretna Green.", "filename": "news_articles_cy9dlqg4vgjo_1745641704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/67b2/live/45bb2810-f427-11ef-9822-d3d66c578726.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dlqg4vgjo_1745641704.html", "title": "Star of Caledonia at Gretna: Border artwork divides opinion", "title_page": "Star of Caledonia at Gretna: Border artwork divides opinion - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The designs for a landmark artwork near the Scotland-England border has divided opinion after the plans were revealed last week.\nStanding 33m (108ft) high, the £10m Star of Caledonia hopes to attract up to 250,000 visitors a year to the Gretna Green area.\nIf it secures planning permission it is hoped the giant winding sculpture - complete with illuminated spikes - could be open to the public by 2027.\nBBC Scotland News readers have been delivering their verdicts on the plans.\nLiz Chasey, from Aberdeenshire, was among those in favour of the proposals.\n\"I think the star is a wonderful way to celebrate the diversity of nations within the UK,\" she said.\n\"Transitioning from one country to another should be marked by a significant monument, plus large public sculptures are exciting and so capture the public's imagination.\"\nHowever, Gavin Whittaker from the Borders, who lives closer to the proposed site of the structure, was less impressed.\n\"Truly awful sculpture,\" he said.\n\"I'm so tired of having ever larger sculptures and so-called 'art' imposed on our landscapes, particularly when they come with lighting to draw your attention at night.\n\"For me, it's very simple: if I want to see art I can go to a gallery, what I don't want is having it foisted on me.\"\nFor former Borders resident Phil Hawes who now lives it Norfolk, it was more a question of priorities.\n\"I'm not against the project but I think given the housing crisis, the money would be better spent on affordable housing for local people,\" he said.\n\"The design? Well, what is pleasing to one is unattractive to another - I'm not a fan.\"\nIrene Allison from North Lanarkshire had similar concerns.\n\"I cannot understand why you would even consider spending this money on this eyesore when people are struggling to heat (their homes) and feed their kids with rising costs for both,\" she said.\n\"Also councils have been deprived of funds and basic services are struggling due to lack of funding.\"\nIan Blois from Invernessshire was more worried about the appearance of the Star of Caledonia.\n\"Looks like something designed by an architect for a 1970s inner city revamp,\" he said.\n\"Wrong design for a rural setting. More suitable for a new town roundabout.\n\"The Angel of the North works because it reflects the industrial heritage of Newcastle and appears to have risen organically from the surrounding landscape.\"\nHowever, others approved of the way the project had been expanded to include more than just the artwork.\nJohn Bade from Kent said he found the design \"very attractive and very original\".\nHe thought that it was a \"good idea for the accompanying visitor centre to be added\".\nThere will still be time for the public to have its say as the project makes its way through the planning process.\nDumfries and Galloway Council will have to give the green light before the Star of Caledonia can hope to shine.", "url": "https://www.bbc.co.uk/news/articles/cy9dlqg4vgjo"}