{"authors": ["Bill Jacobs", "www.facebook.com"], "date_download": "2025-04-26 06:33:31", "date_modify": "2025-04-26 06:33:31", "date_publish": "2025-02-27 06:46:29", "description": "Councillor Phil Riley says there is a \"recognition\" from the company that services had been unacceptable.", "filename": "news_articles_cd7ed707qp9o_1745649211.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2fed/live/cf6afe80-f488-11ef-90a8-7944e242c871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ed707qp9o_1745649211.html", "title": "Northern promises 'improvement' to Lancashire rail services", "title_page": "Northern promises 'improvement' to Lancashire rail services - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bosses of the rail company Northern have promised a \"substantial improvement\" in services across Lancashire.\nIn a meeting with the leader of Blackburn with Darwen Council and Northern, councillor Phil Riley said there was a recognition that the current level of cancellations and unreliability of service was unacceptable, particularly at weekends.\nHe met Craig Harrop, north-west regional director for Northern and Owain Roberts, its regional stakeholder manager, alongside Lancashire County Council's rail development manager, Mike Cliffe.\nThe company executives said the key issues included resolving long-running industrial disputes and investing in training.\nMr Harrop said a shortage of conductors had contributed to high cancellation rates which Northern was addressing by recruiting and training new ones.\nHe also highlighted plans to enhance services starting with the introduction of a seven-day service, speed up the training of new drivers and to scrap the controversial practice of planned cancellations.\nMr Riley, who also chairs Lancashire's new combined county authority's Transport Board, said: \"It was good to meet Northern senior management and to convey the ongoing concerns from local residents about the poor quality of service.\n\"Lots of plans were outlined and we will be meeting again, hopefully, when there have been measurable improvements.\"", "url": "https://www.bbc.co.uk/news/articles/cd7ed707qp9o"}