{"authors": ["Matthew Bassett", "www.facebook.com"], "date_download": "2025-04-26 07:48:08", "date_modify": "2025-04-26 07:48:08", "date_publish": "2025-02-26 23:00:49", "description": "BBC reporter Matthew Bassett was left stranded in 2014, and finds his story is far from unique.", "filename": "news_articles_cqjvnkzgr1no_1745653688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4268/live/5d3a5b70-f43e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjvnkzgr1no_1745653688.html", "title": "BBC reporter spent six hours on nightclub accessible toilet floor", "title_page": "BBC reporter spent six hours on nightclub accessible toilet floor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Spending six hours on the floor of a nightclub toilet wasn't how I imagined my evening out would go.\nIt was early 2014 and I was just getting used to being in a wheelchair after an accident that caused a spinal injury.\nInstead of enjoying a slap-up meal at a charity event at a Cardiff club, I ended up on the floor of the accessible loo after falling out of my wheelchair.\nIt wasn't until the music stopped that the bouncers heard me screaming and bashing the bins. My body was covered in bruises, but the outcome could have been much worse.\nI struggled to sit back up in my chair after using the toilet and ended up stranded on the floor until three in the morning because the emergency pull-cord in the accessible toilet snapped - and failed to alert staff that I was in danger.\nAt the time, I brushed it off. But now I realise how serious it could have been.\nEleven years on and campaigners say not much has changed.\nI have spoken to other people with similar stories and one charity has called for businesses and councils to take \"immediate steps\" to improve access to accessible toilets.\nCharity Euan's guide, external, which provides disabled access information, found almost three quarters of 6,800 people surveyed said they had come across an accessible toilet they were unable to use, while two-thirds said loos were dirty and unhygienic.\nWorking on this story has brought back a lot of traumatic memories about that night.\nBut my bad experience could have been resolved quickly if the emergency pull cord had worked.\nThe survey said some people found accessible toilets with faeces over walls and floors, Christmas decorations being stored in them, and another with an office set up, complete with a desk, chair and lamp.\nKieren Barlow said he was left exposed on the loo when a faulty handle failed to lock and someone walked in and left, leaving the door open.\nThe 35-year-old, who has cerebral palsy, was unable to transfer quickly back into his wheelchair to close the door.\nThe \"awful\" experience left the RSPCA branch manager from Connah's Quay, Flintshire, with toilet anxiety.\n\"I've had times where the toilet seat slides to one side, and you make a mess of yourself,\" he told me.\n\"It creates fear. It makes me scared of going to a public toilet because you don't know what you're going to face.\"\nHe said accessible toilets were rarely \"cleaned like the non-disabled toilets are\" and carries his own toilet bag with paper, sanitiser and underwear.\nSteph Bailey-Scott has found accessible toilets used as storage rooms and said they were often too small.\nThe 30-year-old from Cardiff has tiredness and pain in her legs and uses a wheelchair to get around after developing long Covid four years ago.\n\"I'm already tired, so to push a heavy door or find an alternative doesn't feel very fair,\" she said.\n\"It's very frustrating that other people can very easily go to the toilet when they want to without any issues.\"\nThe Welsh government said changes were made to building regulations in 2023 to increase the number of available accessible toilets in public buildings of a certain size.\nIt added: \"We are committed to supporting the rights of all disabled people in Wales and creating an inclusive and accessible society.\"\nThe UK government has also been approached for comment.", "url": "https://www.bbc.co.uk/news/articles/cqjvnkzgr1no"}