{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:07:34", "date_modify": "2025-04-26 04:07:34", "date_publish": "2025-03-02 23:18:53", "description": "Sir Keir Starmer's plans to form a \"coalition of the willing\" to end the war in Ukraine leads most of Monday's papers.", "filename": "news_articles_c1jp55w540zo_1745640454.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/064d/live/786c1930-f7bb-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jp55w540zo_1745640454.html", "title": "'New Ukraine peace deal' and Zelensky's 'king-size welcome'", "title_page": "Newspaper headlines: 'New Ukraine peace deal' and Zelensky's 'king-size welcome' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The summit of European leaders in London on Saturday to discuss the war in Ukraine dominates the front pages.\nThe i paper says, external Britain and France have \"taken over\" efforts to secure a peace deal with Russia, after Friday's shouting match between Donald Trump and President Zelensky.\nThe Times says, external Sir Keir Starmer and President Macron intend to act as a \"bridge\" to the US, in negotiations about an agreement. But, the paper says, there's further signs of worsening relations between Kyiv and Washington, after allies of President Trump suggested on Sunday that President Zelensky would have to stand down, as part of any deal.\nAccording to the Guardian, external, the prime minister's proposed plan would \"counter-balance\" the talks already under way between the US and Russia, which have so far involved neither Ukraine, nor European countries. Government sources tell the paper that while the main objective of securing an American security guarantee has yet to be been achieved, they are delighted that the prime minister has shown that post-Brexit Britain can play a global leadership role.\nSenior allies of the prime minister tell the Times that President Zelensky should learn from Sir Keir's approach. \"He needs to play the game\" a source explains, adding, \"Trump wants respect.\"\nEuropean leaders are expected to announce major increases in defence spending in the coming days, according to the Daily Telegraph, external. The paper says a number of ideas are being considered ahead of a meeting of the European Council on Thursday, including an easing of the EU's fiscal rules to allow greater public spending, and pooling common debt to buy arms.\nThe Financial Times names, external Germany, Spain and Poland as among the countries who have so far not offered to join what Sir Keir called the \"coalition of the willing\".\nThe Sun's leader column says it is worrying, external that some countries are still willing to outsource their own security and let others foot the bill.\nThe Daily Mail reports , externalon President Zelensky's visit to Sandringham, saying the King \"threw a protective arm\" around Ukraine's leader. The paper describes the meeting as a \"pointed show of support\" and notes that President Trump last week described King Charles as a \"beautiful man\".\nFor the Daily Mirror, , externala simple handshake between the two men said all that was needed.\n\"King-size welcome,\" is the Sun's headline, external. For the Metro, external, it's \"Send him victorious\".", "url": "https://www.bbc.co.uk/news/articles/c1jp55w540zo"}