{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 08:06:16", "date_modify": "2025-04-26 08:06:16", "date_publish": "2025-02-26 14:59:09", "description": "Pupils had sent Lando Norris letters of congratulations following his 2024 Grand Prix win.", "filename": "news_articles_c0q1wwk7p2do_1745654776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/10dd/live/6ea427a0-f444-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1wwk7p2do_1745654776.html", "title": "Lando Norris \"inspires\" his old primary school with thank you video", "title_page": "Lando Norris \"inspires\" his old primary school with thank you video - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Formula 1 driver has surprised his former primary school with a video message thanking pupils and staff for their support.\nLando Norris, 25, who drives for McLaren, told Chew Stoke Church School in Somerset: \"This season has been incredible, a lot of this is down to you. Thanks for cheering me on every weekend.\"\nThe pupils had sent him handwritten letters to congratulate him on his first F1 victory at the Miami Grand Prix in May 2024.\nLouise, 10, said the video was amazing, adding: \"He sat on the carpet where we sat. I feel like I can do anything now, be whatever I want.\"\nNorris also sent them a signed print, a replica helmet and individual gifts for all the children who had written to him.\nHe also hinted a visit to the school, located about eight miles (12.8km) south of Bristol in the Chew Valley, could soon be on the cards.\nTeaching assistant Sue Lewis said: \"I don't think we expected him to have the time to be able to reply to us, so when he did it was so exciting, not just for the children but for the staff as well.\"\nMs Lewis remembers the exact spot where Norris sat cross-legged on her classroom carpet, some 20 years ago.", "url": "https://www.bbc.co.uk/news/articles/c0q1wwk7p2do"}