{"authors": ["Jack Silver", "www.facebook.com"], "date_download": "2025-04-26 08:07:52", "date_modify": "2025-04-26 08:07:52", "date_publish": "2025-02-26 14:00:46", "description": "Seven hospices will be able to use the money for projects like buying equipment, renovations and IT.", "filename": "news_articles_cx204vlpvqvo_1745654872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6fa9/live/55a62c60-f441-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx204vlpvqvo_1745654872.html", "title": "Devon and Cornwall hospices share £1m government funding", "title_page": "Devon and Cornwall hospices share £1m government funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hospices in Devon and Cornwall will share more than £1m for upgrades and refurbishments as part of funding released this week, the government has announced.\nThe Department of Health and Social Care (DHSC) announced £100m of funding in December as part of its Plan for Change - an initiative to improve social care across England - with £25m being released nationwide this week.\nSeven hospice operators across the region will share £1.07m of funding.\nMinister for Care Stephen Kinnock said it was the \"largest investment in a generation\" and would help \"transform hospice facilities across England\".\nPaul Brinsley, CEO of Cornwall Hospice Care, said the £161,000 it is set to receive would help it improve sustainability and reduce overheads by installing insulation and improving double glazing, while it was exploring options for how to invest the next batch of money.\nMr Brinsley said it was \"exciting\" to get money to invest in one-off capital projects, but added it was a \"struggle\" getting longer-term funding.\nThe remainder of the funding - which will be used to \"modernise facilities, improve IT systems and ensure patients receive the highest quality care\" - would be released in April, DHSC said.\nThe hospice operators in Devon and Cornwall receiving support were:\nCornwall Hospice Care: £161k\nChildren's Hospice South West: £276k\nHospiscare (Exeter): £181k\nNorth Devon Hospice: £105k\nRowcroft - The Torbay & South Devon Hospice: £158k\nSt Luke's Hospice Plymouth: £177k\nSidmouth Hospice at Home: £17k", "url": "https://www.bbc.co.uk/news/articles/cx204vlpvqvo"}