{"authors": ["Galya Dimitrova", "www.facebook.com"], "date_download": "2025-04-26 07:36:10", "date_modify": "2025-04-26 07:36:10", "date_publish": "2025-02-27 14:49:50", "description": "Kaz Taplin recreates buildings from Henley on Thames that were part of her childhood.", "filename": "news_articles_cn7vvz4v1ego_1745652970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b6a0/live/227d4200-f514-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vvz4v1ego_1745652970.html", "title": "Lego models of town buildings bring Henley artist 'close to home'", "title_page": "Lego models of town buildings bring Henley artist 'close to home' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An artist has been recreating landmarks of her hometown using Lego.\nKaz Taplin, who now lives in Australia, has been reconnecting with Henley on Thames in Oxfordshire by creating models of places including Gabriel Machin butchers shop and the town hall.\nShe works off old photographs, as well as new ones she takes when she visits her family.\nMrs Taplin said using her memories for the models was \"very inspirational\" and that it brought her \"close to home\".\nShe said they had moved 17 years ago from Gainsborough Crescent in Henley to the coastal city of Mandurah in Australia where they built a house.\n\"But I go back every few years (...) because family have passed away, so it's to respect that or to see the children (...) and the grandchildren,\" Mrs Taplin added.\nThe places that she chose to build Lego models of are \"part of our childhood\".\n\"Mum used to take us to the shops and pick up stuff, I've done a Bagatelle toy shop that's full of toys,\" she said.\n\"The library used to be in the town hall, so we used to go and pick up books.\"\nMrs Taplin said the town hall had taken her a week to construct, and the roof had fallen apart in the process.\n\"But as I've been doing more and more, it's just [been taking] a few days on and off.\"\nShe said she is now recreating a Wimpy restaurant.\n\"My dad used to take us into the Wimpy on Saturdays to have a burger.\n\"I've not quite finished that one yet, but it's very inspirational and close to home.\"\nMrs Taplin said she had received \"absolutely amazing\" feedback on her work.\n\"I didn't think it would be like this. I'm just doing it because I like my hometown.\"\nThe models are currently displayed on a shelf in one of her spare rooms.\nMrs Taplin said she had also completed commissioned paintings of other local landmarks such as the Henley Villa.", "url": "https://www.bbc.co.uk/news/articles/cn7vvz4v1ego"}