{"authors": ["Azadeh Moshiri and Usman Zahid", "www.facebook.com"], "date_download": "2025-04-26 04:06:44", "date_modify": "2025-04-26 04:06:44", "date_publish": "2025-03-03 00:34:20", "description": "Pakistani officials have set a deadline to expel foreign nationals living illegally in the country.", "filename": "news_articles_cgl00ler0rno_1745640404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2cc3/live/b99044f0-f7f6-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl00ler0rno_1745640404.html", "title": "Afghans hiding in Pakistan live in fear of forced deportation", "title_page": "Afghans hiding in Pakistan live in fear of forced deportation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I'm scared,\" sobs Nabila.\nThe 10-year-old's life is limited to her one-bedroom home in Islamabad and the dirt road outside it. Since December she hasn't been to her local school, when it decided it would no longer accept Afghans without a valid Pakistani birth certificate. But even if she could go to classes, Nabila says she wouldn't.\n\"I was off sick one day, and I heard police came looking for Afghan children,\" she cries, as she tells us her friend's family were sent back to Afghanistan.\nNabila's not her real name - all the names of Afghans quoted in this article have been changed for their safety.\nPakistan's capital and the neighbouring city of Rawalpindi are witnessing a surge in deportations, arrests and detentions of Afghans, the UN says. It estimates that more than half of the three million Afghans in the country are undocumented.\nAfghans describe a life of constant fear and near daily police raids on their homes.\nSome told the BBC they feared being killed if they went back to Afghanistan. These include families on a US resettlement programme, that has been suspended by the Trump administration.\nPakistan is frustrated at how long relocation programmes are taking, says Philippa Candler, the UN Refugee Agency's representative in Islamabad. The UN's International Organization for Migration (IOM) says 930 people were sent back to Afghanistan in the first half of February, double the figure two weeks earlier. At least 20% of those deported from Islamabad and Rawalpindi had documentation from the UN Refugee Agency, meaning they were recognised as people in need of international protection.\nBut Pakistan is not a party to the Refugee Convention and has previously said it does not recognise Afghans living in the country as refugees. The government has said its policies are aimed at all illegal foreign nationals and a deadline for them to leave is looming. That date has fluctuated but is now set to 31 March for those without valid visas, and 30 June for those with resettlement letters.\nMany Afghans are terrified amid the confusion. They also say the visa process can be difficult to navigate. Nabila's family believes they have only one option: to hide. Her father Hamid served in the Afghan military, before the Taliban takeover in 2021. He broke down in tears describing his sleepless nights.\n\"I have served my country and now I'm useless. That job has doomed me,\" he said.\nHis family are without visas, and are not on a resettlement list. They tell us their phone calls to the UN's refugee agency go unanswered.\nThe BBC has reached out to the agency for comment.\nThe Taliban government has previously told the BBC all Afghans should return because they could \"live in the country without any fear\". It claims these refugees are \"economic migrants\".\nBut a UN report in 2023, external cast doubt on assurances from the Taliban government. It found hundreds of former government officials and armed forces members were allegedly killed despite a general amnesty.\nThe Taliban government's guarantees are of little reassurance to Nabila's family so they choose to run when authorities are nearby. Neighbours offer each other shelter, as they all try to avoid retuning to Afghanistan.\nThe UN counted 1,245 Afghans being arrested or detained in January across Pakistan, more than double the same period last year.\nNabila says Afghans shouldn't be forced out. \"Don't kick Afghans out of their homes - we're not here by choice, we are forced to be here.\"\nThere is a feeling of sadness and loneliness in their home. \"I had a friend who was here and then was deported to Afghanistan,\" Nabila's mother Maryam says.\n\"She was like a sister, a mother. The day we were separated was a difficult day.\"\nI ask Nabila what she wants to do when she's older. \"Modelling,\" she says, giving me a serious look. Everyone in the room smiles. The tension thaws.\nHer mother whispers to her there are plenty of other things she could be, an engineer or a lawyer. Nabila's dream of modelling is one she could never pursue under the Taliban government. With their restrictions on girls' education, her mother's suggestions would also prove impossible.\nA few weeks ago, when he was out shopping, he received a call. His three-year-old daughter was on the line. \"My baby called, come baba police is here, police come to our door,\" he says. His wife's visa extension was still pending, and she was busy pleading with the police.\nAhmad ran home. \"I couldn't leave them behind.\" He says he sat in a van and waited hours as police continued their raids. The wives and children of his neighbours continued trickling into the vehicle. Ahmad began receiving calls from their husbands, begging him to take care of them. They had already escaped into the woods.\nHis family was held for three days in \"unimaginable conditions\", says Ahmad, who claims they were only given one blanket per family, and one piece of bread per day, and that their phones were confiscated. The Pakistani government says it ensures \"no one is mistreated or harassed during the repatriation process\".\nWe attempt to visit inside Haji camp to verify Ahmad's account but are denied entry by authorities. The BBC approached the Pakistani government and the police for an interview or statement, but no one was made available.\nScared of being detained or deported, some families have chosen to leave Islamabad and Rawalpindi. Others tell us they simply can't afford to.\nOne woman claims she was in the final stages of the US resettlement scheme and decided to move with her two daughters to Attock, 80km (50 miles) west of Islamabad. \"I can barely afford bread,\" she says.\nThe BBC has seen a document confirming she had an interview with the IOM in early January. She claims her family is still witnessing almost daily raids in her neighbourhood.\nA spokesman for the US embassy in Islamabad has said it is in \"close communication\" with Pakistan's government \"on the status of Afghan nationals in the US resettlement pathways\".\nOutside Haji camp's gates, a woman is waiting. She tells us she has a valid visa but her sister's has expired. Her sister is now being held inside the camp, along with her children. The officers would not let her visit her family, and she is terrified they will be deported. She begins weeping, \"If my country was safe, why would I come here to Pakistan? And even here we cannot live peacefully.\"\nShe points to her own daughter who is sitting in their car. She was a singer in Afghanistan, where a law states women cannot be heard speaking outside their home, let alone singing. I turn to her daughter and ask if she still sings. She stares. \"No.\"", "url": "https://www.bbc.co.uk/news/articles/cgl00ler0rno"}