{"authors": ["Henry Godfrey-Evans", "www.facebook.com"], "date_download": "2025-04-26 06:37:11", "date_modify": "2025-04-26 06:37:11", "date_publish": "2025-02-26 06:33:25", "description": "Material routinely dredged at Felixstowe Port will be recycled to protect communities from flooding.", "filename": "news_articles_c5yxvrj5enjo_1745649431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5d44/live/a50e0070-f356-11ef-9040-bf215a6f65f6.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxvrj5enjo_1745649431.html", "title": "Dredged sediment to be used to protect Essex coastal communities", "title_page": "Dredged sediment to be used to protect Essex coastal communities - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dredged sediment is to be recycled and used to create buffers to protect communities from flooding and create wildlife habitats.\nSand and gravel will be collected during routine dredging at Felixstowe Port in Suffolk to give added protection to West Mersea, Tollesbury and Salcott in Essex.\nIt is part of a £25m programme funded by the Environment Agency, involving the Essex Wildlife Trust, RSPB and the Harwich Haven Authority.\nAdam Nixon, coastal recovery officer for Essex Wildlife Trust, said: \"It's vital that we explore different and innovative ways to protect Essex residents and the county's coastal areas.\"\nHe added: \"Storms are becoming increasingly more common and sea level rise is on the way in the not-so-distant future.\"\nThe two-year project will involve collecting 85,000 cubic metres of sediment - usually dumped into the sea - and redistributing it on the foreshore of Old Hall Point, Cobmarsh Island and Tollesbury Wick.\nIt is hoped the dredging will create 25km (16 miles) of coastal flood defences, 406 hectares of coastal flood plain grazing marsh and 240 hectares of coastal saltmarsh.\nThe designated areas are all sites of scientific or conservational interest.\nJames Dunn, senior project manager with the RSPB, said: \"We're really excited to be working with our partners to deliver such an ambitious project, that will help to protect coastal communities from flooding, whilst providing valuable new habitat for beach nesting birds such as amber-listed little tern.\"\nSarah West, chief executive of Harwich Haven Authority, said: \"As a trust port, we are committed to preserving and protecting the environment, operating sustainably and collaborating with partners to improve and mitigate our impact on the local area.\"\nShe said the project would \"futureproof\" coastal communities living along the Blackwater Estuary.", "url": "https://www.bbc.co.uk/news/articles/c5yxvrj5enjo"}