{"authors": ["Charlie Taylor", "Clara Bullock", "www.facebook.com"], "date_download": "2025-04-26 07:06:03", "date_modify": "2025-04-26 07:06:03", "date_publish": "2025-02-28 06:19:23", "description": "Zak, 16, now hopes to become a physiotherapist to help others.", "filename": "news_articles_c4g3931jnyro_1745651163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1370/live/8951ce00-e92b-11ef-9892-4b7641e79162.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g3931jnyro_1745651163.html", "title": "Somerset teen had to relearn how to walk after extreme headaches", "title_page": "Somerset teen had to relearn how to walk after extreme headaches - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager who had to relearn how to walk after cancer treatment plans to use his experience to become a physiotherapist.\nZak, 16, from East Huntspill, near Highbridge in Somerset, was diagnosed with tumours on his brain and spinal cord after suffering extreme headaches.\nHe told BBC Radio Somerset: \"I was in utter shock and I didn't feel old enough to understand what was going on at my diagnosis.\n\"It's a bit of an odd feeling relearning to walk, your legs feel numb. It's like a cloud feeling, you're moving them and there's no response at first.\"\n\"There were definitely a few moments when I didn't feel I'd make it through, but I just tried to stay calm.\"\nZak was admitted to hospital two days after his 15th birthday in July 2023 after experiencing severe headaches and vomiting.\nNow 18 months into his treatment, Zak is walking and playing football again and studying for his dream job at college.\nDoctors found several tumours on Zak's spinal cord, including near his neck, as well as a smaller tumour at the back of his brain.\nHis mum Helena Rowan-Lovell said: \"Being a teenager, Zak understood about cancer and tumours and he said that he'd 'had a good life' and asked me if he was going to die.\n\"Zak's headaches were so horrible that he didn't know where he was and even forgot he had a brother.\"\nShe said her \"heart just dropped\" when she was first told his diagnosis by doctors.\n\"It's news no one wants to hear.\"\nMs Rowan-Lovell said with the help of his physios and his determination, she is sure he will get there.\n\"As they were talking us through the risks involved with the surgery - such as not being able to breathe, eat and speak - the thought of not hearing his voice saying, 'I love you mummy' absolutely broke me,\" she said.\n\"Before he went down to theatre, he recorded a video of himself saying, 'Everything will be OK and I love you mum'.\"\nThe operation affected Zak's nerves and he was not able to sit up or use his legs for several months.", "url": "https://www.bbc.co.uk/news/articles/c4g3931jnyro"}