{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:24:57", "date_modify": "2025-04-26 04:24:57", "date_publish": "2025-03-03 12:24:07", "description": "Islanders with cataracts will no longer be sent to the UK for treatment after March.", "filename": "news_articles_cp8yy0961z6o_1745641497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bc3f/live/43b8e3c0-f82a-11ef-92bb-03e8a8ae1fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8yy0961z6o_1745641497.html", "title": "Guernsey off-island cataract treatment plan to end after March", "title_page": "Guernsey off-island cataract treatment plan to end after March - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Islanders with cataracts will no longer be sent to the UK for treatment after March.\nHealth & Social Care (HSC) decided to end the off-island initiative, which began in November 2024 and aimed to cut waiting lists.\nThe States said a total of 90 cataract surgeries will have been completed by eye health clinic Newmedica by the time the scheme finishes.\nNewmedica said it was \"disappointed\" the plan would not continue but HSC vice-president Deputy Marc Leadbeater said the committee would support similar schemes \"when appropriate funding is available\".\nThe States said said there would be a short transition period as HSC, MSG and Newmedica work to refer patients who have not received a surgery date back to the MSG.\nLeadbeater said: \"We would like to extend our gratitude to the patients who embraced the opportunity to be treated by another provider and provided positive feedback and encouragement to others.\n\"The aim of this initiative was to improve the overall ophthalmology waiting list and provide patient-centred care.\n\"The committee is delighted the partnership with Newmedica has helped to achieve this aim within a short timeframe.\"\nAccording to the States, 751 people were waiting for an ophthalmology outpatient appointment in November last year.\nIt said 136 waiting for surgery and 92 were told their wait would be more than a year.\nAt the end of February, it said 580 people were waiting for outpatient appointments.\nIt said 129 were on the waiting list for surgery and and 55 of those would still be waiting more than a year.", "url": "https://www.bbc.co.uk/news/articles/cp8yy0961z6o"}