{"authors": ["Lucy Adams", "www.facebook.com"], "date_download": "2025-04-26 07:52:58", "date_modify": "2025-04-26 07:52:58", "date_publish": "2025-02-25 14:28:31", "description": "The difference between the qualifications obtained by Scotland's richest and poorest pupils increased last year.", "filename": "news_articles_cy05880r55ko_1745653978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b81d/live/627cd160-f382-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05880r55ko_1745653978.html", "title": "Attainment gap widens in Scottish schools", "title_page": "Attainment gap widens in Scottish schools - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The attainment gap between Scotland's richest and poorest school pupils increased last year, according to new figures.\nThe Scottish government has said since 2015 that closing this gap - between the level of national qualifications obtained by children from the most affluent and the least affluent areas - is its priority.\nBut the latest figures, external show the difference has widened for pupils sitting National 4s, National 5s and Highers.\nThe Scottish government said it was pleased that the vast majority of school leavers were going on to positive destinations such as college and university.\nThe attainment gap between the proportion of school leavers from the most and least deprived areas who had one pass or more in National 5s or equivalent qualifications was 22.7% last year – up from 20.2% in 2022/23.\nThe gap in the proportion of school leavers who achieved one pass or more in Highers or equivalent qualifications was 38.4% in 2023/24, up from 36.9% the previous year.\nEducation Secretary Jenny Gilruth told BBC Scotland News the statistics showed \"positive signs for the future\" despite the attainment gap increase.\nThe figures also show that 8,084 pupils left school after S4. That accounted for about one in seven of those leaving school, and was the highest number since 2010.\nThe proportion of pupils who left school last year with one or more pass at National 5s, or equivalent and one or more pass at Higher level or equivalent has also dropped.\nLast year 83.5% of school leavers had one pass or more at National 5 level, while 57.4% had one pass or more at Higher level. Both were lower than in 2022/23.\nProf Lindsay Paterson, from Edinburgh University, said the closure of schools during the Covid pandemic was one reason for the attainment gap getting worse in Scotland.\n\"Unlike in England and other countries, there has never been a proper programme of educational recovery here,\" he told BBC Scotland News.\n\"The harm is greatest to those children who have not been able to get help at home, or whose parents can't afford to pay for extra tutoring.\n\"But behind this is a deeper problem. The Scottish government has never had a coherent strategy for dealing with the educational effects of poverty.\"\nHe added that there was nothing intrinsically wrong with pupils leaving after S4 as long as they have something worthwhile to go to.\nJust under 56,000 young people left school last year – the highest number since 2010.\nMore than 95% went on to positive destinations such as university, college, employment, some training and voluntary work. This was slightly lower than the previous year but one of the highest levels since 2010.\nMore than 67% of school leavers last year were in higher or further education three months later.", "url": "https://www.bbc.co.uk/news/articles/cy05880r55ko"}