{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:29", "date_modify": "2025-05-19 14:47:29", "date_publish": "2015-03-05 09:29:24", "description": "The president of Mexico visits Aberdeen to sign a memoranda of understanding on collaboration in the energy sector.", "filename": "news_uk-scotland-31745822_1747666049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81413000/jpg/_81413141_nietoafp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-31745822_1747666049.html", "title": "Mexican president Enrique Pena Nieto visits Aberdeen", "title_page": "Mexican president Enrique Pena Nieto visits Aberdeen - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The president of Mexico has visited Aberdeen to sign a memoranda of understanding on collaboration in the energy sector.\nEnrique Pena Nieto met senior senior representatives of the oil and gas industry during a ceremony at the city's Town House.\nIt was the final day of his state visit to the UK.\nHuman rights groups have called for concerns to be raised about an upsurge in torture cases in Mexico.\nMr Pena Nieto was joined by Scottish Secretary Alistair Carmichael, UK Energy Minister Matthew Hancock and Scottish External Affairs Secretary Fiona Hyslop.\nHe also met Aberdeen Lord Lieutenant George Adam and Aberdeen City Council chief executive Angela Scott during the event.\nDuring his three-day state visit he has attended a state banquet at Buckingham Palace hosted by the Queen, taken part in a business leaders' breakfast meeting with Deputy Prime Minister Nick Clegg at the Palace, met opposition leader Ed Miliband and delivered the Canning Lecture at Lancaster House.\nHis visit to the north east of Scotland follows discussions with David Cameron on future co-operation in the oil and gas sector as part of Europe's efforts to diversify the sources of its fuel supplies away from Russia during the ongoing stand-off over Ukraine.\nThe prime minister hosted the Mexican leader for lunch at 10 Downing Street on Wednesday, after which Mr Cameron's official spokesman said Mr Pena Nieto \"very much agreed with what the PM and other international leaders have set out about how Russia's actions in the context of Ukraine means we can't, as an international community, have 'business as usual' relations with Russia\".\nThe spokesman said Mr Cameron had also raised the issue of human rights and judicial reform in Mexico.\nAmnesty International UK says the nation's nine-year-long \"war on drugs\" has seen more than 100,000 killings and some 22,000 disappearances.", "url": "https://www.bbc.com/news/uk-scotland-31745822"}