{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:16:41", "date_modify": "2025-05-21 06:16:41", "date_publish": "2025-03-31 00:00:00", "description": "As Muslims across the world celebrate Eid-Al-Fitr, the BBC screens a live service from Bradford.", "filename": "news_live_c4g01p7xq19t_1747808201.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/596b/live/e6bd42e0-0e24-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c4g01p7xq19t_1747808201.html", "title": "Muslims celebrate end of Ramadan as Eid prayers broadcast", "title_page": "Muslims celebrate end of Ramadan as Eid prayers broadcast - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "End of live coverage\nWe're ending our live coverage of Eid prayers at Bradford Central Mosque.\nThe broadcast by the BBC was the first time the service had been shown on a UK terrestrial channel.\nThe BBC is also broadcasting a special show at 22:40 BST from Bradford.\nCelebrity Eid will bring together food and fun with a host of well known guests.\nYou can catch it on BBC One or watch here when it is broadcast or afterwards.\nThank you for joining us for our coverage.\nEid equals boom time for Bradford's businesses\nEid is a time to treat yourself and your loved ones, from luxurious banquets to new clothes, and businesses in Bradford say the income at this time of year provides a big boost.\nAtsham Ali, who works at clothes store Shaam G, in Bradford, says the week before the celebrations had led to an increase in sales of about 60%.\nHe says: \"This is one of the busiest periods in our business, especially the last few days before Eid because we'll be open till about 02:00 on the last two days.\n\"This year the farshi shalwar is a new trend, which used to be in fashion in the 1970s, but it's come back and that's been the most in-demand item for us this time.\n\"We're getting customers from all over the UK, Birmingham, Glasgow and customers come to Bradford for Eid especially.\"\nFind out more about the economic impact of Eid on Bradford and businesses in the city.\nAre there Eid movies in the way there are Christmas movies?\nNoor Nanji\nCulture Reporter\nUnlike Christmas, there aren’t many films specifically focused on Eid.\nBut some films feature Eid celebrations as part of the storyline.\nIn India, Bollywood films are often lined up to be released around festival times - and Eid is a major national festival.\nSo in that sense, many films can be considered Eid films.\nThis year, for example, Salman Khan's Sikandar is being released at Eid - the action-packed film is highly anticipated by fans.\nMouth-watering recipes to help celebrate Eid in style\nTalking of food, after a month of fasting Eid is a chance to celebrate the end of that period of sacrifice and devotion.\nAnd what better way to have fun than by cooking up some delicious dishes?\nFrom Spinach borek pastries with tomato and pomegranate salad and Lamb raan to sweet treats like sheer khurma and coconut rose ladoos the BBC Food pages are bursting with recipes for you to try at home.\n'Eid is a day full of fun and food'\nRichard Edwards\nBBC Political Reporter, North Yorkshire\nTayyeba Zeb, from Garforth in West Yorkshire, says Eid is particularly exciting for her this year as she has a newborn baby boy.\n\"We're a crazy house in the morning, you have all the kids running around and getting really excited,\" she says.\n\"They have Eid sacks, where they get presents, so they will open all of those and as a family we'll eat a lavish breakfast together.\n\"It's just a day full of lots of fun and food - a bit like Christmas I guess!\"\n'It’s a peaceful month, we look forward to it'\nChloe Aslett\nBBC News, Yorkshire\nIn Sheffield, university students Dana and Riham said they had enjoyed Ramadan and having a chance to focus on their faith.\nDana says: \"It’s a peaceful month, we look forward to it. We try and create some new habits that we can maintain after. If you do something for 30 days, you can continue it.\n\"Reflecting and being more grateful – we’re not eating so when we do have that meal, we feel more grateful for it. We also like to do more charity – it’s not just giving money, it can be like smiling to someone on the road, things like that.\n\"It’s becoming a better version [of yourself]. I look forward to changing and improving myself, it’s a really nice time honestly.\"\nRiham says Ramadan comes at \"the exact perfect time\".\n\"Sometimes you just need that month where your focus is worshipping, doing better as a Muslim, charity, and if you’re abstaining from food, you become more aware of everything around you.\n\"[At Eid] sometimes you get money from your family, you might wear new clothes, but it’s a bittersweet day as well, because Ramadan is gone.\"\n'End of fasting means more freedom'\nAdam Laver\nBBC News in Bradford\nThere's a palpable sense of relief among worshippers that fasting is at an end.\nSakeb Zahoor, 55 and his son Huzaifah Sakeb, 20, say they enjoyed their feast after sunset last night.\nSakeb says with a smile that it is nice \"just to be a bit more free to do what we want, while still being focused on our faith and our obedience on what we have to do in life\".\n'Ramadan is therapy for some'\nRichard Edwards\nBBC Political Reporter, North Yorkshire\nAs Muslims celebrate Eid, Mohammed Osman, an imam in the North Yorkshire town of Selby, says the preceding period of Ramadan can an \"opportunity\" for people to socialise when communities gather for break their fast after sunset.\n\"You see people you've not seen for the whole year,\" Mr Osman, 59, says.\n\"Some people are isolated, by their work or nature, and they don't integrate with other people. So for them Ramadan is great, it is therapeutic I think.\"\n'Eid is a celebration because you have achieved something'\nChef Asma Khan will be joining Jason Mohammed and a host well-known sports stars, comedians, actors and musicians as part of the BBC's Celebrity Eid at 22:40 BST.\nAhead of the broadcast she has been sharing her favourite recipes, cooking tips and memories of Eid.\n“Many people have fulfilled targets over this month, like reading the Quran or fasting all 30 days,” says Khan. “Eid is a joyous celebration because you have achieved something.”\nFood is a big part of the celebrations, although exactly what each family will eat depends on taste and heritage. Khan still remembers what she’d eat on Eid as a child in India.\n“The breakfast really stands out for me, because the adults who’d been fasting hadn’t eaten breakfast for 30 days. This idea of having breakfast together was very exciting and, in my family, it was very lavish.\n“My absolute greatest memory was this warm milky, vermicelli nut and date dish, called sheer khurma. We would have it in beautiful bone china cups, although I was considered clumsy, so was made to sit on a newspaper on the floor with it,” she explains, laughing.\n“I’ve made it ever since I left home – every Eid – and I’m going to be making it for the event in Bradford as well.”\n'Charity key to Islam and Eid al-Fitr'\nZakat al Fitr, also known as Fitrana, is the practice of making a small donation to help feed the less fortunate before the end of Ramadan.\nAs part of the service, worshippers have heard about the importance of charity - not just money and material items but time, care and effort.\n\"Every small act of kindness contributes to a better world,\" Shaykh Ahsan tells the congregation.\nMany Muslims have been collecting and sending money to help those in Gaza who have been left in need due to the conflict between Israel and Hamas.\nCelebrations take place across the UK\nMillions of Muslims across the UK are celebrating Eid with family and friends.\nIn Birmingham, a city with one of the UK's largest Muslim communities, crowds gathered outdoors in Small Heath Park.\nAfter bad weather in 2023 and 2024, it was the first time in three years Eid celebrations could take place outdoors in the city.\nOne of those there, Aqsa Nasar, said: \"When you see people coming together, it is such an unreal and beautiful feeling.\n\"I think everyone must visit it, because we celebrate Eid twice a year.\"\nIn Belfast meanwhile, 2,000 people gathered at Newforge Sports Complex.\nDr Ahmad Saeed, who was among that number said: \"It's basically like Christmas for us, at the end of Ramadan, a very difficult a hard time for us.\n\"We've accomplished it, we've gone through it successfully, so we are today grateful for it, grateful to God.\"\n'Unity, family and calories' says worshipper\nAdam Laver\nBBC News in Bradford\nShafiq Janjua, who has come to Bradford Central Mosque today, says Eid \"gives a message of unity\".\n\"It's about your family and putting on calories!\" he smiles.\nMr Janjua says the BBC's broadcast today, which is a UK first, is a \"good initiative\".\n\"There's a large number of Muslims in Great Britain - this beautiful country.\"\nMr Janjua, who has lived in Bradford for more than 30 years, adds: \"It's good to see the BBC here. I think it gives a good message.\"", "url": "https://www.bbc.com/news/live/c4g01p7xq19t"}