{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:57", "date_modify": "2025-05-19 15:37:57", "date_publish": "2015-02-20 09:53:19", "description": "Accident and emergency performance in England's NHS hospitals has dipped slightly in the latest weekly figures.", "filename": "news_health-31549841_1747669077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80099000/jpg/_80099440_stretcher.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_health-31549841_1747669077.html", "title": "A&E waits worsen across England", "title_page": "A&E waits worsen across England - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Accident and emergency performance in England's NHS hospitals has dipped slightly in the latest weekly figures.\nAnd a separate report suggests that many acute hospitals are facing financial pressure.\nSome 91.6% of patients were treated or admitted within four hours last week, down from 92.9% the week before.\nThis stands below the 95% target, which has not been achieved on a weekly basis since September.\nNHS England says A&Es faced a surge in attendance this week, with the highest number of patients seen since the surge at Christmas.\nIn Wales, the number of people seen within four hours improved slightly last month to 82.3%.\nBut performance in both Wales and Northern Ireland is still well below official targets and performance in England.\nNHS England's figures show some 420,000 patients turned up at emergency departments, up from 407,000 the previous week.\nDr Barbara Hakin, the national director of commissioning operations for NHS England, said: \"Last week saw a sharp increase in A&E attendances and emergency admissions - up by nearly 15,000 on the week before.\n\"These are the highest levels since Christmas and are also up on the same week last year.\n\"This has resulted in a slight impact on waiting times, but we continue to admit, treat and discharge more than nine out of ten patients within four hours.\"\nIn Scotland, 89.9% were seen within four hours in December - a similar performance to England during that period.\nA separate report, put together by the regulator Monitor, shows that more than half of the foundation trusts in England are in deficit - including many hospitals involved in acute and emergency care.\nThe analysis says such hospitals and other NHS organisations are facing \"exceptional pressure\".\nThe Health Foundation think tank argues that the figures do not include the recent period of severe winter pressure.\nIt predicts that the NHS will not balance its books this year.\nAdam Roberts, of the foundation, said: \"Today's figures from Monitor act as a reminder that financial deficit is now the norm for NHS providers.\n\"Acute providers are already running a deficit before accounting for the extra demand from the severe winter and the flu outbreak.\n\"Even with the additional funds made available for services, the task for the NHS to break even looks increasingly impossible.\"\nThe Department of Health says the NHS budget is increasing and it expects the health service as a whole to end the year in financial balance.\nA spokesperson said: \"We know the NHS is busier than ever, which is why we're increasing the budget by an extra £2bn next year to back the NHS' long-term plan to move more care from hospital to home.\"", "url": "https://www.bbc.com/news/health-31549841"}