{"authors": ["Syed Moziz Imam", "Neyaz Farooquee", "www.facebook.com"], "date_download": "2025-04-26 04:14:16", "date_modify": "2025-04-26 04:14:16", "date_publish": "2025-03-04 11:16:32", "description": "Shahzadi Khan's family say she was innocent and the four-month-old died from an incorrect vaccination.", "filename": "news_articles_c20lne76yp3o_1745640856.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6858/live/e75be5e0-f8c5-11ef-a7c3-9ba138beafd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20lne76yp3o_1745640856.html", "title": "Shahzadi Khan: Indian woman executed in UAE for killing baby", "title_page": "Shahzadi Khan: Indian woman executed in UAE for killing baby - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Indian woman who worked as a domestic helper in the United Arab Emirates has been executed after she was convicted of killing her employers' baby.\nShahzadi Khan, who worked for an Indian couple, was executed last month, according to the Indian government.\nAccording to Abu Dhabi court documents, Khan asphyxiated the boy, external, but a doctor who testified at the trial could not confirm this as he had not been allowed to perform a post-mortem.\nKhan's family maintain she was innocent and say the four-month-old died from an incorrect vaccination on the day of his death. They said Khan did not get \"adequate representation\" during her trial. The BBC contacted UAE authorities for comment.\nThe execution was carried out on 15 February, but the news was only confirmed by Indian authorities on 3 March after Khan's parents petitioned the Delhi High Court seeking information about their daughter.\nThe secrecy surrounding the execution has made headlines in India, which has close ties with United Arab Emirates. Hundreds of thousands of Indians live and work in the country.\nAccording to the petition filed by Khan's family, she had moved to Abu Dhabi in December 2021 to work for the Indian family as a caregiver.\nShe was entrusted to look after the baby, who was born in August the following year. According to Khan's father, she would often call her family back in the north Indian state of Uttar Pradesh and show them the baby over video calls.\nBut the calls stopped after his death - and the family later learnt that Khan was in jail. According to Khan's family, the baby died on 7 December 2022, just hours after he received a vaccine.\nPolice arrested Khan two months later. She insisted that a video recording showing her confessing to killing the baby had been forced, and that she had not received proper legal support in court.\nShe was sentenced to death in July 2023. Her appeal was rejected in February 2024.\nKhan's family said they last heard from her on 13 February this year when she called from prison, saying that she might be executed the next day.\n\"She kept crying and said she was put in a separate cell, and that she would not come out alive and that it might be her last call,\" her father Shabbir Khan told the BBC.\nWhen Khan's family did not hear from her after that, they filed a petition with the Delhi High Court, seeking information from the Indian government on whether she had been executed.", "url": "https://www.bbc.co.uk/news/articles/c20lne76yp3o"}