{"authors": ["Rachel Russell", "www.facebook.com"], "date_download": "2025-04-26 07:35:59", "date_modify": "2025-04-26 07:35:59", "date_publish": "2025-02-27 14:58:57", "description": "The rabbit, now named Peter, was left in a cat litter tray on the doorstep of the RSPCA in Hull.", "filename": "news_articles_cm2nn018pnpo_1745652959.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/20d1/live/bfe0a270-f50b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2nn018pnpo_1745652959.html", "title": "RSPCA warning after rabbit dumped in litter tray", "title_page": "RSPCA warning after rabbit dumped in litter tray in Hull - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "RSPCA staff who found an \"unresponsive\" rabbit dumped outside their rescue centre have urged people to ask for help if they are struggling to care for pets.\nThe rabbit, which had mange disease and mites, was left in a cat litter tray on the doorstep of the centre in Clough Road, Hull, just after 22:30 GMT on Monday.\nFred Owen, chief executive of RSPCA Hull and East Riding, said: \"Whoever did it was clearly at the end of their tether, or really doesn't care about animals. If we'd have got a call during the day, we would have supported them and got the animal to a vet.\"\nThe rabbit, which volunteers have named Peter, \"is doing better\" after treatment.\n\"We thought it was a cat in the litter tray at first, so it was a bit of a shock to find a poorly rabbit, but we acted quickly to help,\" Mr Owen said.\nA spokesperson for the RSPCA said it dealt with 918 incidents of abandoned rabbits across the UK in 2024, amid concerns about people not being able to afford to keep the animals as pets.\nThe RSPCA's Kindness Index showed 78% of people had found having pets more expensive than last year, according to Mr Owen.\n\"If people are struggling, they can have a conversation with their vets, and there are a lot of charities that support people with animals with costs,\" he said.\n\"The RSPCA call centre receives a cruelty call every four minutes, so the RSPCA would find it impossible to pursue whoever did this to the rabbit, but the animal is safe and will have a bright future,\" he said.\nAn RSPCA spokesperson said rabbits were not as easy to look after as people may think.", "url": "https://www.bbc.co.uk/news/articles/cm2nn018pnpo"}