{"authors": ["Paul Rogers", "www.facebook.com"], "date_download": "2025-04-26 04:18:55", "date_modify": "2025-04-26 04:18:55", "date_publish": "2025-03-04 06:23:07", "description": "Red kiosks can be adopted by town and parish councils, while modern kiosks can house defibrillators.", "filename": "news_articles_cvg5ql52zlvo_1745641135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/58c0/live/32a019c0-f850-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg5ql52zlvo_1745641135.html", "title": "Consultation to decide fate of 61 payphones", "title_page": "Shropshire: Consultation to decide fate of 61 payphones - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The fate of 61 payphones, external across Shropshire is being decided.\nBT is consulting until 12 June over the removal of public call boxes (PCBs) in the county.\nHowever, a stay of execution is possible. Traditional red kiosks may be adopted by charities and councils for various community uses, and while adoption is also possible for modern-style kiosks, they may only be used to house defibrillators.\nThirteen of the 61 kiosks are listed, meaning they would not be removed even if there is no interest in adoption, although they would be locked and have their telephony removed.\nThe leader of Shropshire Council Lezley Picton said that further to the adoption \"there is opportunity to share feedback with the council should there be a local view that a payphone in their area should remain operational\".\n\"This could include for example feedback about local flooding issues of which BT may be unaware, or ongoing concerns about its usefulness for helpline calls or calls from people needing to access emergency services or other essential services, who may not have a mobile phone.\"\nThe consultation period has been extended in the light of the forthcoming local elections.", "url": "https://www.bbc.co.uk/news/articles/cvg5ql52zlvo"}