{"authors": ["Shanaz Musafer and Lucy Acheson", "www.facebook.com"], "date_download": "2025-04-26 04:07:27", "date_modify": "2025-04-26 04:07:27", "date_publish": "2025-03-03 00:04:29", "description": "Donald Trump has scrapped federal diversity initiatives and many US firms have too - will UK companies follow suit?", "filename": "news_articles_cm2365p3m4ko_1745640447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7f3a/live/305f0f20-f5fa-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2365p3m4ko_1745640447.html", "title": "Diversity backlash: Is 'masculine energy' coming to the UK?", "title_page": "Diversity backlash: Is 'masculine energy' coming to the UK? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Dangerous, demeaning, and immoral.\" That's how Donald Trump has described diversity, equity, and inclusion (DEI) programmes which aim to boost workers from diverse backgrounds.\nUpon returning to the White House, he ordered the shutdown of all federal DEI initiatives, urging the private sector to follow suit.\nAnd many have, with the likes of Walmart, McDonald's, Meta and Amazon ditching or scaling back their diversity policies.\nCorporations, according to Meta boss Mark Zuckerberg, have been \"neutered\" and need more \"masculine energy\".\nSome UK employees fear Trump's rhetoric could normalise intolerant attitudes in the workplace, even if DEI policies remain intact.\n\"Someone that is at the top saying things like that sets a precedent that it's okay to do so,\" says Chloe, who works at a London-based finance company.\nStefan Hoops, the head of Deutsche Bank's investment arm, also said he feared Trump's language would \"lead us straight back to the macho 'Wolf of Wall Street' era\" and called on companies to ensure equal opportunities.\nHe posted his thoughts on LinkedIn alongside a picture of him lifting weights, external, saying, \"I figured a masculine-looking picture would balance my anti-anti-woke observations.\"\nBut so far there is little evidence of UK firms changing their diversity policies.\nIn fact, the UK arm of accountancy giant Deloitte has signalled a split with its US counterpart, external by saying it remains \"committed to our diversity goals\", not long after staff in the US were told there were plans to \"sunset\" their DEI goals.\nIn the UK, the Equality Act protects against discrimination and since 2017, organisations with over 250 employees must report their gender pay gap.\nIn addition, any company listed on the stock exchange is required to publish board diversity data against set targets, including that at least 40% of board members should be women.\nPavita Cooper is the UK chair of the 30% Club, which campaigns to increase gender diversity in senior management.\nShe says the UK's legal system will help protect DEI policies.\n\"In the US, they are talking a lot about affirmative action and 'woke ideology'. In the UK, we focus a lot more on positive action,\" Ms Cooper says.\nShe explains that affirmative action involves quotas, while positive action encourages participation without preferential treatment, such as through scholarships or mentoring.\nMartha Lane Fox, who has worked to promote diversity in the tech sector, believes the UK has an opportunity to \"lean into diversity - stand apart from the US\".\nShe points out the \"irony\", external of Elon Musk, tasked by Donald Trump with slashing federal government spending, standing in the Oval Office with his young son as he dismantled DEI programmes.\n\"Imagine if everyone had such casual and extraordinary opportunities for childcare, what could we unlock?\"\nThe CIPD, the professional body for HR, notes some change to DEI (also known as EDI) policies, with companies such as BT dropping diversity measures from its managers' bonus scheme., external\n\"We're seeing some UK organisations reposition or re-evaluate their EDI initiatives and metrics,\" says Peter Cheese, chief executive of the CIPD.\n\"Some of this will be in response to what is happening in America but it's a shift that has been building for a while.\n\"The current climate – social and political - is making organisations look at what they're doing and why, how they're measuring the impact of these initiatives, and the difference their EDI policies are making to business outcomes.\"\nA spokesperson for BT said the changes do not represent a rollback on the company's EDI commitments.\nIn the US even tech giant Apple, which points to its \"north star of dignity and respect for everyone\", has been forced to admit that it may need to make some changes to its policies \"as the legal landscape around this issue evolves\".\nLast month, consulting giant Accenture also cited the \"evolving landscape\" as it said it was ending employee representation goals, external and career development programmes for \"people of specific demographic groups\".\nThe company, which employs around 11,000 people in the UK, said the change in its policies and practices would apply \"globally, and not just in the US\".\nIt also noted that it had \"largely achieved\" its diversity goals.\nSimilarly, investment bank Goldman Sachs told the BBC earlier this month that it had axed an internal diversity rule that barred it from advising all male, all white boards on company flotations because it was no longer needed.\nAnn Cairns, who is the chair of Crown Agents Bank and Trust Management Finance Group, and also sits on the board of London Business School, says she isn't surprised that DEI policies are under attack.\n\"We swing back and forth on this topic depending on who is in power and their influence. Some bigger companies are being driven by America but we will have to wait and see what happens.\"", "url": "https://www.bbc.co.uk/news/articles/cm2365p3m4ko"}