{"authors": ["Jude Sheerin", "www.facebook.com"], "date_download": "2025-04-26 03:46:50", "date_modify": "2025-04-26 03:46:50", "date_publish": "2025-03-05 05:06:48", "description": "The president declares \"America is back\" as he spars with Democrats and gives a shout-out to Elon Musk.", "filename": "news_articles_c981wj6n9l2o_1745639210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/424e/live/3a68e380-f9a4-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981wj6n9l2o_1745639210.html", "title": "Six takeaways from Trump's big speech", "title_page": "Six takeaways from Trump's big speech  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump declared \"the American Dream is unstoppable\" as he addressed a raucous joint session of Congress for the first time since he returned to power.\nIn the longest presidential speech to lawmakers on record, he outlined his vision for his second term, as Republicans applauded a high-octane six weeks that has reshaped domestic and foreign policy.\nTrump was heckled by Democrats and he goaded them in turn during the rowdy primetime address, during which he said his administration was \"just getting started\".\nThe Republican president has moved to slash the federal workforce and crack down on immigration, while imposing tariffs on the US's biggest trading partners and shaking up the transatlantic alliance over the war in Ukraine.\nHere are six of the key takeaways.\nFollowing a second day of market turbulence, Trump played down the potential economic fallout from a trade war he ignited this week, including 25% tariffs on Mexico and Canada, and an additional 10% on Chinese imports.\nBut in contrast with the ovations that greeted his other policy objectives, many Republicans remained seated, a sign of how Trump's import taxes have divided his party.\n\"Tariffs are about making America rich again and making America great again,\" he said.\n\"And it's happening. And it will happen rather quickly. There'll be a little disturbance, but we're okay with that. It won't be much.\"\nTrump added that reciprocal tariffs tailored to US trading partners would \"kick in\" on 2 April.\nEarlier in the day, US Commerce Secretary Howard Lutnick told Fox Business that Trump could announce a trade deal with Mexico and Canada as soon as Wednesday.\nTrump said he had received an \"important letter\" from Ukraine's leader earlier in the day, which appeared to match what Volodymyr Zelensky posted publicly on social media.\nUkraine's president had said he was now ready to work under Trump's \"strong leadership\" to end the war and \"come to the negotiating table as soon as possible to bring lasting peace closer\".\n\"I appreciate that he sent this letter,\" Trump told lawmakers.\nZelensky offered the olive branch a day after Trump paused all military aid to the beleaguered US ally.\nIt followed an acrimonious Oval Office meeting last week when the two leaders argued in front of TV cameras, before cancelling plans to sign a minerals deal that would allow the US to profit from an economic partnership involving Ukraine's natural resources.\nTrump was reportedly hoping to announce during his speech to Congress that the deal had finally been sealed. But it did not materialise.\nDespite most of his 99-minute speech focusing on domestic issues, Trump's worldview also came more sharply into focus.\nThere are places in the world he wants to expand US influence and others where he wants to withdraw.\nRepeating his desire for the US to acquire Greenland, he vowed \"we're going to get it - one way or the other\". And he said his administration would \"reclaim\" the Panama Canal.\nThere were several mentions of African countries when he rattled through a long list of aid programmes funded by US taxpayers that he portrayed as ridiculous.\nLiberia, Mali, Mozambique and Uganda were all places where he suggested money had been wasted.\nBut his most pointed remark was about Lesotho, which he said was a country \"nobody has ever heard of\" despite receiving $8m (£6.2m) to promote LGBT rights.\nThe government there quickly responded.\n\"To my surprise, 'the country that nobody has heard of' is the country where the US has a permanent mission,\" Foreign Affairs Minister Lejone Mpotjoane told the BBC.\nEarly on, Trump name-checked his billionaire adviser Elon Musk, who was watching from the gallery.\nThe tech mogul's Department of Government Efficiency (Doge) taskforce has moved to fire tens of thousands of federal workers, cut billions of dollars in foreign aid and slash programmes across the US government.\nThe SpaceX and Tesla boss, wearing a dark suit with a blue tie, stood and acknowledged the cheers from the crowd.\n\"Thank you, Elon,\" the 78-year-old president said. \"He's working very hard. He didn't need this.\"\nMusk's cuts have sparked some angry scenes at town hall meetings and his instructions to federal employees have at times been overruled by members of Trump's cabinet.\nIn the chamber, Democratic lawmakers held up signs saying \"Musk steals\" and \"false\".\nDoge claims to have saved $105bn already, but that figure can't be independently verified. Receipts have been published for $18.6bn worth of savings, but accounting errors have been reported by US media outlets that have analysed the figures.\nTrump pledged to voters that he would beat inflation on his return to office and he used the speech to say his focus would be to reduce the cost of energy, by opening up the country to new oil and gas drilling.\n\"We have more liquid gold under our feet than any nation on earth, and by far, and now I fully authorize the most talented team ever assembled to go and get it. It's called drill, baby, drill.\"\nThe soaring cost of eggs has been headline news in recent weeks, and Trump made clear who he felt was responsible.\n\"Joe Biden especially let the price of eggs get out of control - and we are working hard to get it back down,\" he added.\nEgg prices rose as the Biden administration directed millions of egg-laying birds to be culled last year amid a bird flu outbreak, though prices have continued rising during the early stages of Trump's second presidency.\nInflation was slightly elevated at 3% last month, but way down from its peak of 9.1% in 2022.\nOnly one in three Americans approve of Trump's handling of cost of living, according to a Reuters/Ipsos survey on Tuesday.", "url": "https://www.bbc.co.uk/news/articles/c981wj6n9l2o"}