{"authors": ["Samira Ahmed", "www.facebook.com"], "date_download": "2025-05-19 15:29:25", "date_modify": "2025-05-19 15:29:25", "date_publish": "2015-02-05 01:55:06", "description": "Is it becoming more difficult for people from working-class backgrounds to make an impact in the arts, asks Samira Ahmed?", "filename": "news_uk-31110063_1747668565.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80751000/jpg/_80751338_michaelcaine.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31110063_1747668565.html", "title": "Are the rich winning a cultural class war?", "title_page": "Are the rich winning a cultural class war? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That Britain's cultural class war is complicated is perhaps most apparent in the fact that Labour's new culture spokesman, Chris Bryant, was educated at private Cheltenham College while the Conservative Culture Secretary Sajid Javid is a bus driver's son from a comprehensive school.\nWhen Mr Bryant said: \"We can't just have a culture dominated by [Eton-educated] Eddie Redmayne and James Blunt and their ilk,\" he uncorked a fizzing bottle of sensitivity and resentment and not just about acting.\nMr Bryant's comments have opened up the debate about worsening social mobility and the growing power and dominance of an affluent London-based elite, benefitting from private school and Oxbridge connections and the exclusive, because of benefit cuts, ability to ride out the years of training thanks to the bank of Mum and Dad.\nMr Bryant emphasised that his concern, external was not directed against any individual but against the inequality of opportunity.\nThey cited increased art and drama school tuition fees, benefit changes especially when it comes to renting in London, and the rise of an intern culture with very low pay rates for those starting out, which they feel are closing down prospects for talented working-class men and women.\nJudi Dench has said she is regularly asked for help by aspiring actors unable to take on such expense.\nWalters, who quit nursing against her mother's wishes to study drama in the early 1970s, got a full grant, and a salaried job at Liverpool's Everyman Theatre.\nLocal government spending cuts have closed down much of that sector.\nWalters has said it would be impossible, external for someone like her to embark on such a career now.\nJames Blunt claimed he was discouraged from a career in music, but it is clear that the old middle-class parental push towards \"professions\" such as stockbroking or law has declined.\nEton College is now as famous for nurturing talented actors such Tom Hiddleston, Damien Lewis and Dominic West as future prime ministers such as David Cameron.\nAs with sports such as rowing, private schools now seem to offer many of the artistic \"extras\" that have started to disappear in the face of a more \"vocational\" push in the state-school sector.\nWhether at the Olympics or the Oscars, it can seem that Britain is increasingly represented at an elite level by people who had access to an exclusive paid-for education.\nEdward Kemp, the director of the Royal Academy of Dramatic Art (Rada) one of the UK's most prestigious drama schools, says the problem is more complex.\nSpeaking before the current row, he pointed out that the number of Rada applicants from working-class backgrounds had actually been going up - 36% of places in the previous year had gone to students from families earning less than £25,000 a year.\nRada graduates from financially modest backgrounds such as Gemma Arterton and Ben Whishaw have achieved great success.\nBut in what kind of roles?\nChris Bryant in his comments on culture also expressed concern that a preoccupation with Downton-Abbey-style upper-class and period drama meant TV was no longer offering roles that reflected the full diversity of British society.\nAnd that is without mentioning the challenge faced by actors of colour, such as Sophie Okonedo, who has won a Tony award on Broadway alongside Denzel Washington but has found few roles in the UK.\nDavid Oyelowo, star of the hit film Selma, tweeted this week: \"I had to leave Britain to have an acting career.\"\nHe has said that he had been told by a commissioning executive: \"If it's not Jane Austen or Dickens, the audience don't understand.\"\nThe charge is that a narrowing elite of decision makers are closing down who gets represented.\nMr Kemp told the Independent, external: \"It would be great to have another working-class drama, but where are those stories being told?\n\"They're not - it's shows with dragons or people in tweed suits on bicycles.\"\nMr Bryant has harked back to the British social realism boom in art of the late 1950s and 1960s that put a cultural focus on the state-backed creative output of the industrial north of England, not London.\nWorking-class stars such as Stanley Baker, from Mr Bryant's Rhondda constituency, Albert Finney and Michael Caine and writers such as Shelagh Delaney emerged at this time.\nRock journalist Simon Price believes that the 1990s generation that produced the Manic Street Preachers was the last to benefit from a genuinely meritocratic state-support system, and the days of musicians such as Joe Strummer playing down their middle class roots are long gone.\n\"These days whenever I hear of an up-and-coming band and I look into it, it seems more often than not they are from the 7% [of the population] who were privately educated.\n\"There's this myth that on YouTube if you have a good song it will spiral, but it does take money.\"\nPrice says that changes to the benefits system have made it harder for working-class teenagers to develop their talent.\n\"David Cameron famously proclaims himself to be a fan of the Smiths.\n\"Well Morrissey spent years on the dole finding himself and finding his voice before launching his musical career.\"\nIt's hard to imagine any politician would advocate a more generous dole for aspiring pop stars.\nBut Price sees a direct link in the requirements now placed on benefit claimants to take whatever work they're told, and the focus on \"vocational\" training, which is undermining the very economically measurable success that Britain's creative industries are famous for.\nThe question underlying the current posh war remains: are too many careers increasingly an option only for those with the backing of an affluent family?\nAnd what will Britain become if this continues?", "url": "https://www.bbc.com/news/uk-31110063"}