{"authors": ["Harriet Heywood", "www.facebook.com"], "date_download": "2025-04-26 07:04:15", "date_modify": "2025-04-26 07:04:15", "date_publish": "2025-02-28 07:23:35", "description": "Geraldine hopes the new NHS network can further diagnosis and treat the rare genetic disease.", "filename": "news_articles_c5y44qwk5e9o_1745651055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5dec/live/2b7541d0-f548-11ef-a9c6-c7f9594861df.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y44qwk5e9o_1745651055.html", "title": "First person diagnosed with MSMD disease welcomes new network", "title_page": "First person diagnosed with MSMD disease welcomes new network - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the first people in the world to be diagnosed with a rare genetic disease has welcomed a network to share expertise on her condition.\nGeraldine, 75, has mendelian susceptibility to mycobacterial disease (MSMD), which affects her immune system and increases her risk of severe infection.\nThe disease is difficult to diagnose as its severity varies.\nShe hoped the NHS Rare Disease Collaborative Network (RDCN) - led by doctors in Cambridge - could advance diagnosis and treatment.\nRetired teacher Geraldine, who lives near Basingstoke in Hampshire, is believed to be the oldest person with MSMD, which has caused infections to develop in her spine.\nAt 15 she spent a year in hospital, alongside her twin, under the care of renowned physician Sir John Crofton.\nHer twin Elizabeth died aged 17 and she may also have had MSMD.\nIn 1982, an infection made Geraldine's spine so weak she needed to be immobilised in a plaster bed which she could not leave for 22 months.\nIn the early 1980s, Cambridge-based Dr Dinakantha Kumararatne became involved in Geraldine's case and made early clinical observations that helped to define MSMD.\nShe is under the care of Addenbrooke's Hospital in the city.\nAbout 150,000 people are estimated to have MSMD, but many are undiagnosed.\nIt is caused by genetic changes that weaken the body's defences against infections.\nWithout specialist care people can develop multiple, long-lasting infections that can become life-threatening.\nPeople with MSMD often depend on treatment involving long-term, carefully monitored use of antibiotics.\nMore severe cases can require bone marrow transplants.", "url": "https://www.bbc.co.uk/news/articles/c5y44qwk5e9o"}