{"authors": ["Tom de Castella", "www.facebook.com"], "date_download": "2025-05-19 15:35:24", "date_modify": "2025-05-19 15:35:24", "date_publish": "2015-02-20 09:03:02", "description": "The owners of the Daily Telegraph, Sir Frederick and Sir David Barclay, are under the spotlight.", "filename": "news_magazine-31517392_1747668924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81088000/jpg/_81088212_hi015963360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_magazine-31517392_1747668924.html", "title": "Who are the Barclay brothers?", "title_page": "Who are the Barclay brothers? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The owners of the Daily Telegraph, Sir Frederick and Sir David Barclay, are under the spotlight after allegations over the way their newspaper treats stories that impinge on commercial interests.\nTo say the Barclay twins do not seek publicity is more than an understatement.\nThey are billionaires. They own the Daily Telegraph, Sunday Telegraph and the Spectator, but rarely give interviews. And now the resignation of one of the Telegraph's political columnists, Peter Oborne, backed by a searing article in which he accuses the paper's management of colluding with advertisers, has put them into the limelight they appear to hate.\nIn his piece for Open Democracy, external, Oborne wrote: \"After a lot of agony I have come to the conclusion that I have a duty to make all this public. There are two powerful reasons. The first concerns the future of the Telegraph under the Barclay Brothers.\"\nThe second related to the wider free press, Oborne wrote. His chief accusation was that the Telegraph's management had not given prominence to the tax scandal at HSBC because of commercial interests. Oborne also accused the Telegraph of removing a news story from their website about HSBC.\nThe Telegraph has denied Oborne's allegations. \"Like any other business, we never comment on individual commercial relationships, but our policy is absolutely clear. We aim to provide all our commercial partners with a range of advertising solutions, but the distinction between advertising and our award-winning editorial operation has always been fundamental to our business. We utterly refute any allegation to the contrary. It is a matter of huge regret that Peter Oborne, for nearly five years a contributor to the Telegraph, should have launched such an astonishing and unfounded attack, full of inaccuracy and innuendo, on his own paper.\"\nSurprisingly little has been written - in any depth - about the Barclays. Few photos exist of them on news picture libraries. One of the few shows them formally dressed, having just been knighted by the Queen. That was in 2000. One of the images from that occasion shows them playing up for the cameras, with Sir Frederick fussing over Sir David's hair.\nThe twins were born in 1934. The Sunday Times in 2003 described them coming from \"humble origins as two of 10 children born to a Scottish travelling salesman and his wife in a house in Hammersmith, west London, which they shared with several other families\". Their father died when the boys were 12, and around the age of 16 the boys set up a painting and decorating business, later moving into property.\nIn 1955 David Barclay married Zoe Newton, a trained ballerina who became a model. She was only 4ft 11in (1.5m) tall but became one of the most highly photographed models of her time. She appeared in television advertisements for the Dairy Council as the \"drinka pinta milka day\" girl. \"The photographers were never far away and David was horrified when it was suggested their son Aidan should be marketed as the first 'milk baby',\" the Sunday Times reported. Zoe had two more sons - Howard and Duncan - and gave up her modelling career to concentrate on her family.\nIn the 1970s, Sir Frederick reportedly married Hiroko Asada. Her son from a previous marriage, Ko, followed his stepfather's example and is now a successful businessman, the Times has reported, external.\nFrederick joined David to buy up old boarding houses in London and turn them into hotels.\nMoving into media in 1992, Frederick and David bought the European newspaper from Robert Maxwell. In 1995, they bought the Scotsman.\nBut their big newspaper purchase came in 2004 with the acquisition of the Daily and Sunday Telegraph from Hollinger, following the forced departure of Conrad Black. The Spectator magazine is part of the same group.\nThe brothers also own mail order firm Littlewoods, bought in 2002 for £750m. That purchase brought controversy after they ended the firm's tradition of giving 1% of profits to charities.\nBut the knighthoods that came in 2000 were for services to charity. By this point their foundation was thought to have donated about £40m to charity, external and medical research. After the ceremony Sir Frederick said: \"Giving to charity is an important part of our life. It's an obligation to society. If you've been fortunate, it's a duty to give to those less fortunate than yourself.\"\nThey bought the Ritz Hotel in London in 1995. Other businesses they have owned include the Ellerman shipping and brewery group in the 1980s, and more recently the Handbag group of websites. They currently own the delivery firm Yodel.\nToday the brothers are said to be worth £6bn, according to the Sunday Times Rich List, external. Noting their homes in the Channel Islands and Monaco, the Guardian has described, external them as \"tax exiles\". But Sir Frederick has been quoted before as saying he and his brother left the UK solely for health reasons.\nIn 2012, the BBC's Panorama covered the tax arrangements of their hotel, the Ritz, reporting that it had paid no corporation tax in the UK by legally claiming reliefs for the 17 years since the Barclays took over. At the time Sir David said: \"We have always acted in a responsible way with regard to taxation and have never been involved in any tax avoidance scheme. We are not responsible for corporate taxes in the UK and are unaware what tax is paid on the Ritz.\"\nA rare insight into Sir Frederick and Sir David's lives came in a 2012 court case relating to their attempt to gain control of Coroin, a rival hotel group. Sir Frederick, in a witness statement, told the court: \"I am now into my late seventies. As I explain below, I am effectively retired. I keep no work diary, have no business secretary and received or reviewed little or no documentation relating to the matters in issue in these proceedings (given the limits of my involvement and the fact that I do not use email or text messages).\"\nThe court also heard that his brother Sir David had undergone heart surgery, external in 2011 and was not medically fit to give evidence. Sir David's son Aidan has long managed the family's businesses in the UK.\nThe brothers are often called reclusive - a term they are said to dislike. After their knighthood ceremony, during what was thought to be their first face-to-face interview for 30 years, Sir David said: \"We're in a good mood today. We're giving you a lot of our privacy. We're not secretive, just private.\"\nIn another interview in 2004, external to discuss their purchase of the Telegraph group, Sir David said \"I don't think I've done anything dirty in my life.\"\nEven in 1999, when the Queen opened the new offices at the Scotsman, which they owned, there was no big speech. \"Frederick Barclay's only comment as he stepped into a chauffeur-driven car was that he had enjoyed a 'good, good' day,\" reported the Daily Mail. The paper, which said they'd been \"lured out of hiding\" to meet the Queen, noted that the last photograph of them together had been from 25 years before.\nThe brothers have bases in Monaco and Brecqhou, one of the Channel Islands. In 1993 they bought the 32-hectare (80-acre) island for almost £3.5m. They built a castle, external, designed by Quinlan Terry and planted vineyards, an olive grove and an organic market garden.\nIn 2008 they announced they were closing down all their businesses on the nearby island of Sark with the loss of about 100 jobs, a sixth of the island's population. They later reopened the businesses but there's been a long-running dispute with some locals over the brothers' desire to change the island's system of governance.\nBoth brothers are in Who's Who, but with little of the detail that marks many of the entries in the reference work. There are no recreational interests listed. Sir David's entry mentions that he was a member of the Sark parliament until 2008. Both brothers were appointed \"Ambassador Extraordinaire at Large for Economic Development in Monaco\" in 2010.\nIn 2003 the Sunday Times reported that the Barclays had asked their friend Lord McAlpine, who died last year, to write their biography. The piece quoted McAlpine's own memoirs where he had written warmly of the brothers: \"I have spent many hours in their company and never cease to wonder at their insights… The two brothers are not secretive, just immensely private in how they earn their money and how they give it away.\" The following year a Times diary piece shed further light on the book: \"The intention is that this will never be published, though, but will be for the private amusement of the twins and their families.\"\nThe Barclays make no political pronouncements. But they were close to former Prime Minister Margaret Thatcher who spent the months prior to her death in April 2013 staying at the Ritz as their guest.\nIn March last year the pair won a £1.2bn payment from HMRC over miscalculated tax, external.\nBut it is their ownership of the Telegraph that has prompted the biggest headlines.\nLongstanding Telegraph writer Bill Deedes, described the new regime as a \"stinking mob\" to friends. In a memo, passed to his biographer only to be published after his death, he wrote: \"It struck me that what the Barclays saw in the Telegraph was an asset that in the right hands could be turned into a more profitable business... The intention to change the nature of the Telegraph into something more profitable had to be shielded from readers who loved it most for its unprofitable qualities which they saw as a stand against the vulgarity of the red tops.\"\nBut there were those who praised the Barclays for taking on the paper, and it was reported at the time that staff at the Telegraph Group much preferred them to the various other potential bidders, external.\nStaff turnover ratcheted up. Between 1923 and 2004 just six men had edited the Telegraph, Oborne pointed out. Since the Barclays took over 11 years ago there have been half a dozen more. The departure of Tony Gallagher, external as editor in January 2014 was particularly surprising for media observers.\nIt followed the announcement of 80 editorial redundancies in March 2013. There was then the creation of 50 new digital journalism jobs, external, leading to a picture of upheaval and constant change.\nA former senior Telegraph journalist says that when the Barclays arrived no-one knew why they'd bought the Telegraph. Unlike Rupert Murdoch, say, they had no \"feel\" for newspapers. One staff member noted privately that previous Telegraph owners had ended up with peerages.\nThe Barclays were said to have hated the \"country club\" atmosphere of the paper. They brought in Murdoch MacLennan from the Daily Mail to shake things up. Some of the moves were symbolic - alcohol was banned in the executive dining room. But the main changes were to staffing.\nOld correspondents left and a succession of digital thinkers were brought in, some of whom did not last long, the ex-Telegraph journalist recalls. The Barclays weren't much interested in what journalism the newspaper did. \"I don't think they intervened very much [editorially]. It was mostly commercial stuff.\"\nThe Spectator addressed the current row over Peter Oborne on its blog, external. There was no mention of the Barclays in the piece. At the bottom, one reader wrote: \"I had a subscription to the DT for over 10 years, but cancelled it once the vandalism of the Barclay brothers became apparent. The current incarnation of the DT is an embarrassment to the memory of great writers like Bill Deedes.\"\nRoy Greenslade, the Guardian's media blogger, puts many of the ways the Telegraph has changed down to the brothers. \"It's less comprehensive in news coverage than it was. It's very very much more obviously a commercial operation. And less credible than it was.\"\n\"There was a recognisable Daily Telegraph approach to daily news coverage.\" It was thorough and comprehensive, Greenslade says. He believes the Telegraph came to resemble \"a feeble approach to doing a broadsheet Daily Mail\".\nBut in the past Spectator editor Fraser Nelson has praised the brothers for their non-interference. In an interview in February 2013 he said he had never met the brothers. His links were with Sir David's sons, Aidan and Howard, who were interested in politics but did not tell him how pieces should be written.\n\"I often think how lucky I am to have them as owners; a magazine like ours could be easily run as an entree into society,\" Nelson said, external.\nThe twins' wealth and their emphasis on privacy will continue to flavour coverage of the businesses they own. But for Sir David, talking on the day of their knighthood, theirs is a straightforward story. \"It's a great example of what can be achieved in this country from whatever background or education or humble beginnings.\"\nSubscribe to the BBC News Magazine's email newsletter to get articles sent to your inbox.", "url": "https://www.bbc.com/news/magazine-31517392"}