{"authors": ["Marc Ellison", "www.facebook.com"], "date_download": "2025-05-19 14:46:25", "date_modify": "2025-05-19 14:46:25", "date_publish": "2015-02-25 00:48:56", "description": "Thousands of beds were blocked this winter by patients healthy enough to return home, according to data obtained by BBC Scotland.", "filename": "news_uk-scotland-31590454_1747665985.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81220000/jpg/_81220509_57440335.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-31590454_1747665985.html", "title": "Thousands of hospital beds blocked by 'healthy' patients", "title_page": "Thousands of hospital beds blocked by 'healthy' patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thousands of beds were blocked this winter by patients healthy enough to return home, according to data obtained by BBC Scotland.\nOver a four-week period, an average of 1,216 beds per day were unavailable to incoming patients in hospitals across the country.\nA tenth of all these delayed discharges occurred in two NHS Grampian hospitals.\nThe new figures come in the wake of the Scottish government announcing £100m in funding to tackle the issue.\nHealth Secretary Shona Robison said the figures \"aren't good enough\" but blamed the position the government inherited.\nShe said: \"We inherited a much worse situation with people delayed over four weeks being three times what it is now. We did manage to get it down to almost zero when I was public health minister and I am absolutely determined as cabinet secretary for health to get to that position again.\"\nScottish Labour's health spokeswoman Jenny Marra described the bed blocking figures as \"really worrying\".\nShe said: \"Bed blocking has a real impact on our whole health service and the operation of our hospitals. It is something the government needs to get on top of soon.\"\nBed blocking, or \"delayed discharge\", is when a patient is judged clinically ready to go home but continues to occupy a hospital bed while plans are made for appropriate follow-up care.\nCare packages may mean arranging places in care homes, care in patients' own homes, or adaptations to be fitted to their homes, such as grab rails.\nBed blocking causes a bottleneck in hospitals, as more people cannot be admitted to a ward until existing ones have been discharged.\nIt is often the hidden reason for long delays in accident and emergency departments.\nRecent figures show bed blocking is also a problem south of the border.\nNHS England reported 139,156 days where patients were stuck in beds, unable to leave, in December.\nBut while this figure is far more than the 31,610 reported in Scotland for the same period, the NHS in England caters for a population 10 times the size.\nOne of the ways the NHS hopes to tackle bed blocking in the long term is by running hospitals more like airports or supermarket checkouts - with extra resources at times of peak demand to keep customers flowing through.\nThe idea comes from a US organisation called the Institute of Healthcare Optimisation.\nWhen its methods were adopted by a children's hospital in Cincinnati, not only did it find it didn't need to build a multi-million pound extension, it discovered it already had more than enough beds.\nThe work in Scotland is at an early stage though.\nThere are lots of reasons why people stay in hospital unnecessarily.\nIt's not just an issue created by a lack of social care.\nSometimes people are waiting for scans or diagnostic tests.\nWork is under way to find out where the delays are, before plans can be created to improve the flow of patients through hospitals.\nThe NHS's information unit only provides figures on the number of lost \"bed days\" on a quarterly basis, external, and only at a health board level.\nBut the data obtained by BBC Scotland - collated from a series of co-ordinated freedom of information requests - gives a more revealing snapshot of how delayed discharges varied from hospital to hospital during the busy winter period.\nThe figures suggest the strain was felt most in Grampian, where Woodend Hospital in Aberdeen reported 1,789 blocked bed days between mid-December and mid-January.\nWoodend regularly had 70 beds a day blocked by people who were ready for discharge and, on some days, the number of patients ready for discharge exceeded the number being admitted.\nAberdeen Royal Infirmary - also run by NHS Grampian - experienced the second-highest number of bed-blocked days of any Scottish hospital.\nA statement said: \"We have a number of schemes which are aiming to make a career within care more attractive and more sustainable but these are long-term changes.\"\nThe statement also acknowledged that a number of elective procedures over the four-week period were postponed due to a lack of available beds.\nBut despite this, the board warned \"it would be overly simplistic to draw a 'line of sight' between delayed discharge and surgical cancellations\".\nAfter NHS Grampian (7,197), the most blocked bed days were reported by health boards in Glasgow (5,865), and Lanarkshire (4,116).\nBy contrast, some hospitals seemed to be able to discharge patients quickly.\nHospitals in the Borders rarely had any blocked beds, and there were also very few in Highland hospitals.\nScottish Labour's Jenny Marra told BBC Scotland: \"We know that delayed discharge is the biggest problem [in] bed blocking in our health service, because it has a massive impact on the whole system.\n\"In the winter crisis we've seen in A&E, bed blocking is one of the main reasons for that because doctors and nurses can't get patients to flow through the hospitals because beds are being blocked.\"\nScottish Lib Dem health spokesperson Jim Hume said SNP ministers had \"taken their eye off the ball\".\n\"Scottish Liberal Democrats have long warned that cutting hospital beds without putting adequate community resource in place will only increase the pressure on our hospitals,\" he said.\n\"People will wonder why the SNP government is yet to recognise the real problems NHS staff and local communities have long known.\"\nCouncil social care budgets are to be merged with health budgets - forcing both to work closer together to move patients more quickly into cheaper home and residential care.\nBut in the interim, the Scottish government announced £100m in funding which, invested over three years, will be used to help health boards and councils provide support packages for people in their own homes.\nNHS Grampian will receive more than £9m - nearly a tenth - of that funding.\nA Scottish government spokesperson added that \"a further £10m Winter Resilience Fund was also made available in December, which is focused on delayed discharges\".", "url": "https://www.bbc.com/news/uk-scotland-31590454"}