{"authors": ["Phil Harrison", "www.facebook.com"], "date_download": "2025-04-26 04:19:07", "date_modify": "2025-04-26 04:19:07", "date_publish": "2025-03-04 06:21:59", "description": "The Royal Naval Benevolent Trust is asking people who have as little as one hour a week to help.", "filename": "news_articles_c4geky5nn70o_1745641147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfd8/live/19f32d10-f83f-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4geky5nn70o_1745641147.html", "title": "Medway veterans care home looks to recruit volunteers", "title_page": "Medway veterans care home looks to recruit volunteers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A care home run by a charity which supports navy veterans is calling out for volunteers.\nPembroke House in Gillingham is run by the Royal Naval Benevolent Trust (RNBT) and cares for veterans, some of whom are now living with dementia.\nThe trust is asking people who have as little as one hour a week spare to help by chatting to residents, getting involved with activities, day trips, gardening, serving meals, and driving a minibus.\nRetired Gp Capt Keith Reyner who has been at the RNBT's Pembroke House, external for two years said: \"The volunteers are like my own family, when they ask 'how are you?' they're actually quite sincere and want to know.\"\nMarion Cruse from Gillingham who has been volunteering for the past two years said: \"I do it to try and give back something for all the care that my husband received when he was here.\n\"I enjoy helping at the coffee shop and veterans' trips out. It gives me a purpose to get up in the morning, and I really, really enjoy it.\"\nAnother volunteer, Kim Buttenshaw from Gillingham, is urging anyone with some spare time to volunteer at the home.\nShe told BBC Radio Kent: \"The residents here are lovely and it's nice to feel useful, and you know that you're going to brighten somebody's day.\"\nShe added: \"We haven't got many men volunteers, we need some more. There's one who works in the garden but there's room for more to join our merry band.\"\nAnyone interested in finding out more about volunteering opportunities, external at Pembroke House can call Corinne on 02394 216308.", "url": "https://www.bbc.co.uk/news/articles/c4geky5nn70o"}