{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:51:49", "date_modify": "2025-04-26 06:51:49", "date_publish": "2025-02-28 17:33:44", "description": "Albie Speakman was playing in a garden on the farm when he was killed.", "filename": "news_articles_cdel2n90grno_1745650309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a5a3/live/ca51d8e0-f5fc-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdel2n90grno_1745650309.html", "title": "Bury farmer who reversed over and killed son jailed", "title_page": "Bury farmer who reversed over and killed son jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A farmer who killed his three-year-old son when he reversed a defective vehicle into him has been jailed.\nAlbie Speakman suffered catastrophic injuries when he was struck by a telehandler driven by Neil Speakman on their family farm in Bury, Greater Manchester, on 16 July 2022.\nAlbie had been left by his dad playing in an unsecured garden at the front of the farmhouse on Bentley Hall Road in Walshaw, before entering the yard.\nSpeakman, 39, was cleared of gross negligence manslaughter earlier this month, but has been given a one-year jail term after pleading guilty to a health and safety offence.\nThe trial heard Albie's mother, Leah Bridge, had dropped off her son at the farm earlier that day for a regular weekend visit with Speakman who she had separated from shortly after Albie's birth.\nOn the first day of his trial, Speakman pleaded guilty to an offence under the Health and Safety at Work Act in failing to ensure, so far as reasonably practical, the health and safety of Albie.\nA tearful Ms Bridge read out her victim personal statement from the witness box of the court as Speakman looked on from the dock.\nShe described how her \"world has been shattered into a million irreparable pieces\".\n\"There are absolutely no words to describe how I'm feeling – pain, sadness, heartbreak, they don't even come close,\" she said.\n\"There are still so many questions that will forever remain unanswered. Why you? Did you suffer? How could someone think that little of you that they would risk your life?\n\"The only thing that keeps me going is thinking that every new day is one day closer to me seeing you again.\n\"I love you endlessly my sunshine boy.\"", "url": "https://www.bbc.co.uk/news/articles/cdel2n90grno"}