{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:08:33", "date_modify": "2025-05-19 15:08:33", "date_publish": "2015-02-12 19:46:03", "description": "The UN Security Council passes a motion cracking down on Islamic State financing as US Republicans push for tougher US military action.", "filename": "news_world-middle-east-31446798_1747667313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80977000/jpg/_80977829_80976433.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31446798_1747667313.html", "title": "UN Security Council targets Islamic State financing", "title_page": "UN Security Council targets Islamic State financing - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The UN Security Council has adopted a resolution aimed at cracking down on trade with, and ransom payments to, Islamic State (IS) militants.\nThe measure calls for sanctions on any person or group trading with IS.\nIn the US, Republicans are trying to toughen legislation President Barack Obama has sent to Congress authorising military action against IS.\nThe US Senate has voted overwhelmingly to approve Pentagon official Ashton Carter as the new defence secretary.\nHe replaces Chuck Hagel, who resigned in November, and is likely to play a key role trying to persuade Congress to pass the legislation on military force.\nThe UN resolution was passed unanimously, another indication of how the international community has come together to target IS, said the BBC's Nick Bryant.\nA UN report estimates jihadist groups are earning up to $1.65m (£1m) per day from oil sales, and at least $35m a year from ransom payments.\nThe UN resolution is expected to put pressure on the Turkish government as the country is considered a key transit point for oil shipments, with trucks often returning to Iraq and Syria with refined products.", "url": "https://www.bbc.com/news/world-middle-east-31446798"}