{"authors": ["Chloe Harcombe, Leigh Boobyer and Lee Madan", "Beth Cruse", "www.facebook.com"], "date_download": "2025-04-26 07:40:13", "date_modify": "2025-04-26 07:40:13", "date_publish": "2025-02-27 12:29:16", "description": "Two people are arrested as police investigate reports the dog was an XL bully.", "filename": "news_articles_c86pp14j0dxo_1745653213.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6aa4/live/d98dd830-f508-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pp14j0dxo_1745653213.html", "title": "Woman, 19, dies in suspected XL bully dog attack", "title_page": "Woman, 19, dies in suspected XL bully dog attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 19-year-old woman has died after she was attacked by a dog believed to be an XL bully, police have said.\nTwo people have been arrested following the attack at about 19:00 GMT on Wednesday at a property on Cobhorn Drive, south Bristol.\nOfficers confirmed the dog has now been put down. Initial reports suggested it may be an XL bully, but police said it was too early to confirm the breed.\nA man and woman, both in their 20s, are in custody after being arrested on suspicion of being in charge of a dog dangerously out of control causing injury resulting in death and possession of a prohibited breed of dog.\nThe woman's family have been informed and are being supported by a specially trained officer, police said.\nA neighbour who lives close to the scene said the woman had only lived in the property a few weeks.\n\"She seemed a lovely girl,\" said the neighbour, who did not wish to give her name.\n\"I am still trying to process this. I was up all night awake trying to process this.\n\"I am shocked. I just can't believe it's happened and she hasn't been there that long.\"\nReferring to the dog owner, the neighbour said: \"The moment she walked out the door I could hear her, and I ran over to her and said, 'Are you okay?'\n\"She couldn't talk or say a word. It was like she wasn't there because of the shock.\"\nSpeaking at a press conference on Thursday, Insp Terry Murphy, from Avon and Somerset Police, called the incident \"incredibly rare\".\n\"The circumstances [officers] faced were \"immensely difficult\", he said.\n\"Our thoughts, first and foremost, are with the family of the young woman who's tragically died as a result of yesterday evening's incident.\n\"A full investigation is now well under way to establish the full circumstances of the events that led to her death.\"\nPolice do not consider there to be any ongoing risk to the public, he added, but there will be increased police presence in the area over the coming days.\nHe declined to comment on whether the woman who died lived at the address where the incident happened, or if there had been previous police contact with the household.", "url": "https://www.bbc.co.uk/news/articles/c86pp14j0dxo"}