{"authors": ["Jake Lapham", "www.facebook.com"], "date_download": "2025-04-26 03:45:32", "date_modify": "2025-04-26 03:45:32", "date_publish": "2025-03-05 06:17:47", "description": "The statement indicates a cooling of tensions between the leaders after their fiery meeting last week.", "filename": "news_articles_cm2jzpn5j8do_1745639132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/afe2/live/01254100-f985-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzpn5j8do_1745639132.html", "title": "Trump says he appreciates Zelensky message on Ukraine peace", "title_page": "Trump says he appreciates Zelensky message on Ukraine peace - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump says he's received a letter from Volodymyr Zelensky agreeing to \"come to the negotiating table\" to strike a peace deal in Ukraine.\n\"I appreciate that he sent this letter,\" Trump said as he addressed a joint session of Congress in Washington.\nIt came after Zelensky said in a social media post that he was ready to work under Trump's \"strong leadership\" to achieve a lasting peace.\nThe statements indicate a cooling of tensions between the leaders following their fiery meeting in the Oval Office last week.\nIn his address to Congress, Trump said he received an \"important letter\" from Zelensky on Tuesday, before reading what he said were excerpts from it.\nParts of what he read used precisely the same language as the statement posted by Zelensky earlier on Tuesday.\n\"The letter reads Ukraine is ready to come to the negotiating table as soon as possible to bring lasting peace closer. Nobody wants peace more than the Ukrainians,\" Trump said.\nContinuing to read from what he said was Zelensky's letter, Trump said: \"My team and I stand ready to work under President Trump's strong leadership to get a peace that lasts.\"\nTrump also said Zelensky told him he was ready to sign a rare earth minerals deal with the US.\nUkraine is yet to comment on the letter.\nThe US president also said there had been \"serious discussions\" with Russia, and he'd \"received strong signals that they are ready for peace\".\nTrump did not indicate when the talks took place, or whether he was personally involved in them.\n\"It's time to end this senseless war. If you want to end wars, you have to talk to both sides,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cm2jzpn5j8do"}