{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:09", "date_modify": "2025-05-19 14:52:09", "date_publish": "2015-02-24 14:37:34", "description": "A French woman working for an international organisation has been kidnapped in Yemen, the French foreign ministry says.", "filename": "news_world-middle-east-31607326_1747666329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81208000/jpg/_81208963_81208959.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31607326_1747666329.html", "title": "Yemen kidnap: French woman seized in capital Sanaa", "title_page": "Yemen kidnap: French woman seized in capital Sanaa - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A French woman working for an international organisation in Yemen's capital, Sanaa, has been kidnapped, the French foreign ministry says.\nSecurity sources say gunmen seized the woman and her Yemeni driver on Tuesday morning as she was going to work.\nThe French foreign ministry, which closed its embassy in Sanaa in February, said it was trying to locate and free the woman.\nIt gave no further details, but urged French citizens to leave the country.\nYemen is a base for al-Qaeda-affiliated militants and foreigners have been targets of kidnappings in the past.\nThe security situation in the country sharply deteriorated after President Abdrabbuh Mansour Hadi resigned in January following a takeover by a Shia militia group, the Houthis.\nOn Saturday he escaped his house arrest and fled to the southern city of Aden where he has since said he is withdrawing his resignation and resuming his duties, and has branded all measures adopted by the Houthis \"null and illegitimate\".\nIn its first official statement since the Mr Hadi's departure from the capital, the Houthi group said the president had lost his legitimacy as head of state and was being sought as a fugitive of justice.", "url": "https://www.bbc.com/news/world-middle-east-31607326"}