{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:13:02", "date_modify": "2025-05-19 15:13:02", "date_publish": "2015-02-15 20:15:32", "description": "A video emerges purportedly showing the beheadings of 21 Egyptian Christians who had been seized by Islamic State in Libya.", "filename": "news_world-31481797_1747667582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81027000/jpg/_81027253_81027173.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-31481797_1747667582.html", "title": "Islamic State: Egyptian Christians held in Libya 'killed'", "title_page": "Islamic State: Egyptian Christians held in Libya 'killed' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A video has emerged apparently showing the beheadings of 21 Egyptian Christians who had been kidnapped by Islamic State (IS) militants in Libya.\nThe footage shows a group wearing orange overalls being forced to the ground and then decapitated.\nPresident Abdel Fattah al-Sisi has said Egypt reserves the right to respond in any way it sees fit.\nIS militants claim to have carried out several attacks in Libya, which is in effect without a government.\nHowever, with many armed groups operating in Libya, it is not clear how much power IS actually wields.\nThe kidnapped Egyptian workers, all Coptic Christians, were seized in December and January from the coastal town of Sirte in eastern Libya, now under the control of Islamist groups.\nThe video of the beheadings was posted online by Libyan jihadists who pledge loyalty to IS. A caption made it clear the men were targeted because of their faith.\n\"Egypt and the whole world are in a fierce battle with extremist groups carrying extremist ideology and sharing the same goals,\" President Sisi said.\nThe beheadings were described as \"barbaric\" by al-Azhar, the highly regarded theological institution which is based in Egypt.\nThe Coptic church said it was \"confident\" Egypt would exact retribution. Egypt has declared seven days of national mourning.\nLibya has been in turmoil since 2011 and the overthrow of its then-leader, Col Muammar Gaddafi.\nSince then, numerous other militia groups have battled for control.\nThe head of the US Defense Intelligence Agency warned last month that IS was assembling \"a growing international footprint that includes ungoverned and under-governed areas\", including Libya.\nThe five-minute video shows hostages in orange jumpsuits being marched along a beach, each accompanied by a masked militant. The men are made to kneel before they are simultaneously beheaded.\nMost were from a poor village in Upper Egypt where some relatives fainted on hearing the news. A caption accompanying the video made it clear the hostages were targeted because of their faith. It referred to the victims as \"people of the cross, followers of the hostile Egyptian church\".\nThere's speculation here that Egypt may now consider airstrikes across the border. President Abdel Fattah al-Sisi has said in the past that militants in Libya are a danger not just to Egypt, but also to the Middle East.", "url": "https://www.bbc.com/news/world-31481797"}