{"authors": ["Duncan Kennedy", "www.facebook.com"], "date_download": "2025-04-26 08:14:58", "date_modify": "2025-04-26 08:14:58", "date_publish": "2025-02-26 11:04:14", "description": "Maddison Wilson had been due to attend a plea hearing at Southampton Crown Court.", "filename": "news_articles_c5y920n0zj4o_1745655298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0895/live/eaab5e60-f438-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y920n0zj4o_1745655298.html", "title": "Trans woman Maddison Wilson charged with rape in Southampton dies", "title_page": "Trans woman Maddison Wilson charged with rape in Southampton dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A transgender woman who was due to appear in court charged with the rape and sexual assault of children has died.\nNews of the death of Maddison Wilson, who was born male but identified as a woman, was given in Southampton Crown Court ahead of a plea hearing she was due to attend on Wednesday.\nThe prosecutor told the judge Ms Wilson, who was 37, was \"deceased\" and a coroner's court listing stated she died on 14 February.\nA spokeswoman for Hampshire Coroner's Office said the provisional cause of death was hanging.\nMs Wilson, of April Square, Portsmouth, had been due to face charges of rape of a girl under 13 and causing a girl aged five to engage in sexual activity - both of which were alleged to have taken place in Hull, in 2011.\nShe had also been charged with the sexual assault of a three-year-old boy and causing a boy, aged three, to engage in sexual activity - both of which were alleged to have taken place in Southampton in 2017 and 2020.\nThe court heard the charges would now be formally discontinued.\nHer death has been listed at the Portsmouth Coroner's Court, which said she died in Southsea two days after she appeared at Southampton Magistrates' Court.\nA full inquest has been listed to be heard on 20 January 2026.", "url": "https://www.bbc.co.uk/news/articles/c5y920n0zj4o"}