{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:39:21", "date_modify": "2025-04-26 04:39:21", "date_publish": "2025-02-28 09:41:19", "description": "Micheál Martin's spokesperson said he was delighted by the invitation to celebrate St Patrick's Day.", "filename": "news_articles_cm2yyrl0dj5o_1745642361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/505c/live/0ef24670-f5b1-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2yyrl0dj5o_1745642361.html", "title": "Irish PM 'delighted' by Trump's White House invite", "title_page": "St Patrick's Day: Irish PM 'delighted' by Trump's White House invite - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The taoiseach (Irish Prime Minister) has been invited to the White House by US President Donald Trump to celebrate St Patrick's Day next month.\nThe meeting is scheduled to take place on 12 March, five days before the Irish public holiday.\n\"I have never met Donald Trump, but I am looking forward to meeting with him,\" Micheál Martin said on RTÉ's The Late Late Show, external on Friday night.\n\"We have to keep engaging with the United States,\" he said.\nThe meeting is scheduled to take place on 12 March, five days before the Irish public holiday.\nIrish broadcaster RTÉ reported that Martin received the invitation in a letter, external from the US president.\nIt said Trump's letter congratulated the taoiseach on his recent appointment and highlighted the special bond between the Irish and American people.\nDuring Friday night's Late Late Show, Martin also described a clash between the Ukrainian President Volodymyr Zelensky and the US president as \"extraordinary\".\nThe meeting ended early and a planned press conference was cancelled after the two leaders disagreed over the conflict between Ukraine and Russia.\n\"This has been a huge unsettling setback today, there's no question about that,\" Martin said.\nMartin and Zelensky met at Shannon Airport in County Clare on Thursday, where Martin said that Ireland is committed to helping Ukraine financially.\nIt is customary for Irish leaders to travel to the US every March for an audience with the president at the White House.\nThey present their host with a bowl of shamrock - a tradition that dates back to President Harry Truman in 1952.\nMartin is serving his second term as taoiseach, having previously led his country from June 2020 to December 2022.\nHowever, he was not able to visit the White House on St Patrick's Day in 2021 because of Covid travel restrictions.\nHe did make the trip to Washington DC in March 2022 but he could not visit the White House in person because he contracted Covid while in the US.\nAs a result, Martin's previous St Patrick's Day duties as taoiseach consisted of video calls with Trump's predecessor Joe Biden.", "url": "https://www.bbc.co.uk/news/articles/cm2yyrl0dj5o"}