{"authors": ["Emily Hudson", "www.facebook.com"], "date_download": "2025-04-26 06:55:02", "date_modify": "2025-04-26 06:55:02", "date_publish": "2025-02-28 15:52:12", "description": "Danny Chambers answers questions from constituents in BBC Radio Solent's regular hotseat feature.", "filename": "news_articles_c1jppjdp2ppo_1745650502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d55f/live/a977b370-f5d8-11ef-b21f-25997e41ca0d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jppjdp2ppo_1745650502.html", "title": "Winchester MP says developers put profit before communities", "title_page": "Winchester MP says developers put profit before communities - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP has said developers have had \"free rein\" for too long when it comes to building homes.\nDanny Chambers, who represents Winchester, answered questions from constituents in BBC Radio Solent's regular hotseat feature.\nListener Norma said plans to redevelop Bushfield Camp legacy land for housing and a hotel concerned her.\n\"We need to use brownfield sites first and keep these spaces as the green lung of Winchester,\" she said.\nMr Chambers said the \"developer-led\" approach to building needed to be stopped, adding: \"They will still make profit, maybe less but enough.\"\nHe said it was absolutely the policy to use brownfield sites for housing first, before considering development on greenfields.\nAmir said he had seen an increase in traffic because of development in the Weeke area.\nHe has been giving out leaflets raising concerns about planned development at Lanham Lane and the impact it may have on local roads and services.\nMr Chambers did not comment on individual developments, but said \"new infrastructure, doctors surgeries, improvements to sewage systems, school provision must happen first, before development was allowed\".\nHe said the Liberal Democrat council in Winchester city had pledged to provide 1,000 new council houses by 2032.\nHe added a new doctors surgery had opened in the middle of the city in the last few weeks.", "url": "https://www.bbc.co.uk/news/articles/c1jppjdp2ppo"}