{"authors": ["Tom Espiner, Faarea Masud and Sean Dilley", "www.facebook.com"], "date_download": "2025-04-26 06:25:21", "date_modify": "2025-04-26 06:25:21", "date_publish": "2025-02-28 22:25:43", "description": "Protests, politicking and planning could stall the runway, despite the government being 'minded to approve' it", "filename": "news_articles_cly44dknrj8o_1745648721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a51b/live/f60a6940-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly44dknrj8o_1745648721.html", "title": "Gatwick: Why is it so hard to move a runway 12 metres?", "title_page": "Gatwick: Why is it so hard to move a runway 12 metres? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Expansion at Gatwick Airport has moved a step closer after the government gave the plan its tentative backing.\nOn the surface Gatwick's plans look relatively straightforward.\nIn contrast to Heathrow, which wants to bulldoze houses and reroute the M25, Gatwick is proposing to shift an already existing runway just 12 metres north, and bring it into regular use.\nYet it still may not happen for years, or may not happen at all.\nGatwick officially opened as an airport in 1958. It had one runway and an additional taxi-way, that was expanded so it could be used as a back-up in case the main runway was out of action.\nIt was never supposed to be for daily use.\nIn fact, in 1979 Gatwick's owners signed a legally binding agreement with the local council not to build another operational runway for at least 40 years.\nNow, though, Gatwick is keen to increase flights in and out, especially for short-haul destinations, by putting the back-up runway into regular use.\nIn the summer of 2023, it put in a planning application, including for additional buildings, flyovers to local roads and expanding rail links.\nHowever, the centre line of a runway that's in full operation, must be at least 210 metres from the centre line of any other runway.\nThe back-up runway needs to shift 12 metres northwards to meet that safety rule.\nJust because the government has given backing in principle for the privately-funded £2.2bn scheme, doesn't mean it is ready for take-off.\nThere is strong opposition to the expansion of Gatwick among some local residents objecting to increases in traffic, noise and pollution.\nClimate campaigners oppose any airport expansion, pointing out that the extra flights will make it harder for the UK to meet its obligations to reduce emissions that are altering the climate.\nAnd in January MPs called on the government to delay the decision on expanding Gatwick until current noise levels were monitored adequately at the site.\nGatwick has until 24 April to submit more information to support its planning application, and respond with measures, such as noise mitigation and having a proportion of passengers travelling to the airport via public transport.\nThen there will be a fresh consultation on the plans, before the government makes a final decision on 27 October.\nEven if Gatwick is given the go-ahead then, it could still face further hurdles.\n\"There remains the possibility that the final decision could be subject to legal challenge which would lead to further delay,\" Paul Maile, head of planning and infrastructure consenting at Eversheds Sutherland, told the BBC.\n\"It is probable that it will still be several years before work is likely to start, at the earliest,\" he said.\nGatwick has previously said it believed the new runway could be ready by the end of the decade.\nBut there is still a reasonable chance it might not happen at all.\nBy 2030 there will have been another general election, and a different government could overturn any previous decisions. Planning permissions and regulations may change, and climate targets could be ramped up - all of which would put the project at risk.\nIt will also depend on what the public want, says Prof Tony Travers of the London School of Economics.\nPoliticians are \"susceptible to public pressure\" so sometimes choose to slow or cancel infrastructure projects like this.\nWhile there are wider benefits of airport expansion, to the regional and national economy as well as the travelling public, those advantages don't usually prompt people to make placards and write to their MPs. Living under a flight path, on the other hand, does.\nRichard Threlfall, global head of infrastructure, government and healthcare at KPMG International, says other countries, which don't have such strong democracies as the UK, can \"just get on and do it\", when they want infrastructure built.\nIn the UK road bypasses, rail infrastructure, housing and other projects can be slowed or completely blocked, if enough people oppose them.\nBut this government has staked its reputation on overcoming opposition to projects that it believes will boost growth, indicating it wants to see airport expansion despite the objections.", "url": "https://www.bbc.co.uk/news/articles/cly44dknrj8o"}