{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:53:19", "date_modify": "2025-04-26 07:53:19", "date_publish": "2025-02-25 14:11:32", "description": "Several bills are going up at the start of April - but there are some things you can do about it.", "filename": "news_articles_cvg18pvz7kko_1745653999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b1c/live/7e84dc80-f37e-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg18pvz7kko_1745653999.html", "title": "What you can do about the seven bills going up this week", "title_page": "From car tax to energy: What you can do about the seven bills going up this week - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The start of April means several bills are going up, putting extra pressure on household finances.\nFor some payments, such as energy, water or broadband, there are things you could do to reduce the impact of price rises.\nHere are seven ways you could be affected by this week's increases.\nWater bills for households in England and Wales are going up by £10 per month on average.\nHowever, there's a lot of variation depending on your supplier, external.\nFor example, the annual Southern Water bill is jumping 47% to £703, while Anglian Water customers are paying 19% more, or £626.\nThe increases are being front-loaded for the next five years, meaning the biggest rise is coming this year.\nHow much your bills will rise depends on a range of factors including whether households have a meter and how much water they use.\nWater companies in England and Wales have said the increases are needed to invest in creaking infrastructure, including sewage, and to build more reservoirs.\nIn Scotland, water bills are rising by almost 10%. Scottish Water said spending was needed to cope with periods of \"drought and intense rainfall\" brought on by climate change.\nDomestic customers in Northern Ireland are not billed for water.\nRead more: There are a number of ways you can cut your water bill, from taking showers instead of baths to checking your bill for unexplained increases.\nThe annual energy bill for a household using a typical amount of gas and electricity is going up by £111 a year to £1,849 from April.\nRegulator Ofgem increased the energy price cap because of higher wholesale costs and inflation.\nThe cap is set every three months and limits the amount suppliers can charge for each unit of gas and electricity, but not the total bill, so if you use more, you will pay more.\nIt covers 22 million homes in England, Wales and Scotland.\nStanding charges - fixed fees to connect to a gas and electricity supply and vary by region - are rising again for gas but dropping for electricity, but the amount you pay depends on where you live.\nOfgem is suggesting households may consider switching to a fixed tariff for a bit of stability.\nRead more: Fixed-price deals are not affected by the energy price cap and offer certainty for a set period. But if energy prices drop when you are on the deal, you could be stuck at a higher price.\nIt is likely the tax you pay to your local authority is going up.\nIn England, local authorities with responsibility for delivering social care can increase council tax every year by up to 4.99% without triggering a referendum or local vote.\nSmaller councils without social care duties can increase bills by up to 2.99%.\nFor 2025-26, the government is allowing Birmingham, Bradford, Newham, Somerset, Trafford, and Windsor and Maidenhead to bypass the 4.99% cap, meaning residents face larger increases.\nCouncil tax rates in Scotland have been frozen or had limited increases since 2007, but they are are also going up, in some cases by more than 10%.\nThe Scottish government says it is offering local authorities an extra £1bn in 2025-26 to help reduce the scale of any rise.\nIn Wales, council tax rates are jumping by as much 15% in some areas. Local authorities were given £253m by the Welsh government in its draft budget, but council leaders say more money needed.\nNorthern Ireland uses a domestic rates system, external instead of council tax. All of Northern Ireland's councils have reported district rate increases for the next year.\nRead more: There are some exemptions and discounts, for example for someone living alone and homes occupied only by students. You can also check your council tax band.\nHouse buyers in England and Northern Ireland will start paying stamp duty on properties over £125,000, instead of over £250,000.\nFirst-time buyers currently had paid no stamp duty on homes up to £425,000, but this is dropping to £300,000.\nA host of homebuyers had been trying to beat the deadline to avoid paying the higher rate.\nRead more: The amount of stamp duty you pay depends on the cost of the property, whether you will live in it, and whether you own any other property.\nRule changes introduced by the telecoms regulator earlier in 2005 mean that mobile and broadband providers must now tell customers \"in pounds and pence\" about any price rises, as well as when they occur.\nThe new rules typically only apply to new customers, so any price rise will depend on when you took your contract out, but prices often increase at this time of year.\nFor instance, under the new rules, someone with a mobile sim-only contract with EE will see their bill go up by £1.50 a month, or £18 a year.\nBut the majority of EE customers who took their contract out before 10 April 2024, will face an increase of 6.4%, which is based on the December 2024 inflation rate plus an additional charge.\nSimilarly, most Virgin Media broadband customers will face a 7.5% rise in bills, but anyone who took out a contract after 9 January 2025 will see their monthly bill go up by £3.50.\nThe cost of a TV licence is also going up by £5 to £174.50. The cost for a black and white TV is going up by £1.50 to £58.50.\nThe government has kept in place the freeze on tax thresholds on income tax and National Insurance until 2028, a policy brought in by the previous government.\nThis is often dubbed a stealth tax because of a process called \"fiscal drag\", which sees more people \"dragged\" into paying higher rates of tax as wages rise.\nThe new tax year begins on 6 April.\nAccording to the government's financial watchdog, external, the frozen thresholds mean that by 2028-29, nearly four million additional people will be expected to pay income tax - and three million more will have moved to the higher rate.\nRead more: What are income tax and National Insurance and what do they pay for?", "url": "https://www.bbc.co.uk/news/articles/cvg18pvz7kko"}