{"authors": ["Tom Richardson", "www.facebook.com"], "date_download": "2025-04-26 08:00:18", "date_modify": "2025-04-26 08:00:18", "date_publish": "2025-02-25 10:45:00", "description": "French developer Ubisoft urges fans to avoid sharing spoilers as video of its latest game appears online.", "filename": "news_articles_ckgz0vxkx3po_1745654418.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e7c6/live/14f11330-f363-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz0vxkx3po_1745654418.html", "title": "Assassin's Creed Shadows: Ubisoft confirms game leaks genuine", "title_page": "Assassin's Creed Shadows: Ubisoft confirms game leaks genuine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The makers of Assassin's Creed Shadows - the forthcoming entry in one of video gaming's biggest franchises - have confirmed footage leaked online is real.\nSome players managed to get their hands on the game - due to be released on 20 March - ahead of its official release.\nDeveloper Ubisoft said gameplay videos shared online \"did not represent the final quality of the game\".\nIn a statement posted online, the company said it was \"still working on patches\" and urged fans not to share spoilers.\nThe Assassin's Creed series has sold more than 200 million copies worldwide and, according to a Ubisoft earnings report published last year, external, generated about €4bn ($4.2bn/£3.3bn) revenue in the decade up to 2024.\nShadows will be the first instalment set in Japan - something fans have long been asking for.\nThe new release, seen by many as a make-or-break title for the French gaming giant, has already been delayed twice.\nEarly authorised previews of the game have been positive, and its developers have insisted they pushed back its release to polish certain features.\nIt was previously due to come out for PC, PlayStation and Xbox on 14 February.\nReports suggest that leaked footage came from physical copies of the game, and it is possible that copies had been printed on to discs to meet this date.\nModern games frequently receive downloadable release-date updates to address any issues that are discovered after physical versions have been produced.\nSet in 16th Century Japan, Assassin's Creed Shadows features two playable protagonists.\nThey are Naoe – a female ninja – and Yasuke – who's based on a real-life figure often referred to as \"the African samurai\".\nShadows' developers have defended the inclusion of Yasuke against critics who argued that a native Japanese character would have been preferable.\nOpponents have accused those complaining of racism, pointing out that they have not taken issue with depictions of the character in other video game franchises.", "url": "https://www.bbc.co.uk/news/articles/ckgz0vxkx3po"}