{"authors": ["Paul Burnell", "Robbie MacDonald", "www.facebook.com"], "date_download": "2025-04-26 06:29:30", "date_modify": "2025-04-26 06:29:30", "date_publish": "2025-02-27 11:01:32", "description": "West Lancashire Council has to scrap its plans to close two swimming pools after losing a key vote.", "filename": "news_articles_c15qqq1e104o_1745648970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f88/live/3d5fe720-f4e8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qqq1e104o_1745648970.html", "title": "Skelmersdale and Ormskirk swimming pools saved after council vote", "title_page": "Skelmersdale and Ormskirk swimming pools saved after council vote - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two publicly owned swimming pools earmarked for closure next month have been reprieved after opposition councillors won a crucial vote to block the move.\nThey also pressed for repairs needed to keep Park Pool in Ormskirk and Skelmersdale's Nye Bevan Pool open for the next five years.\nThe vote at Wednesday's full meeting of West Lancashire Borough Council in Ormskirk was a defeat for the ruling Labour group, which had insisted it had no other option but to reluctantly shut the pools.\nThe outcome of the vote means the local authority will now have to hold a special budget meeting to amend its spending plans.\nThe Local Democracy Reporting Service said opposition to the pool closure plans came from the Conservatives, the local Our West Lancashire party, and former Labour councillors who now sit as Independents.\nThey said strong public opposition to closing the leisure facilities, expressed in a winter consultation exercise, should be respected.\nOpposition councillors have asked a senior director to report to their next full meeting with proposals for repairs to the two pools \"to ensure continued operation for the coming five years\".\nThey also called for a cross-party working group to:\nClosely examine the income and expenditure of the leisure centres\nInvestigate investments to reduce operating costs\nMake recommendations to reduce the subsidy currently needed to run the pools", "url": "https://www.bbc.co.uk/news/articles/c15qqq1e104o"}