{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:56:35", "date_modify": "2025-04-26 03:56:35", "date_publish": "2025-03-04 15:03:54", "description": "A man who claimed he was sexually abused in school by Fr Malachy Finegan is to receive compensation.", "filename": "news_articles_c8j01g8w4d2o_1745639795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/65ee/live/f6e52d40-f902-11ef-a51b-792f5c266a1c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j01g8w4d2o_1745639795.html", "title": "Malachy Finegan: Man to get £115k damages over school sex abuse", "title_page": "Malachy Finegan: Man to get £115k damages over school sex abuse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who claimed he was sexually abused by a priest while attending a school in Newry in the 1980s is to receive £115,000 in damages.\nThe High Court case alleged he was attacked by the late Fr Malachy Finegan, who was a former headmaster at St Colman's College.\nThe priest, who died in 2002, was accused of a long campaign of child sex abuse but was never prosecuted or questioned by police about claims made against him.\nThe plaintiff, who is not being named, sued the Diocese of Dromore along with the trustees and board of governors of the school.\nThe plaintiff was also awarded legal costs as part of the settlement.\nNo admission of liability was made by the defendants.\nIt is the latest in a series of settlements reached by people who reported being sexually abused by Finegan while he worked as a teacher in Newry.\nHe was also accused of abusing young boys during his tenure as a Clonduff parish priest in Hilltown, County Down.\nThe first settlement was reported in 2018, at which stage the school's board of governors condemned the abuse inflicted by Finegan while he worked there.\nThey also removed the priest's image from the school's photographs at that time.\nIn this case, the man's lawyers claimed Finegan groomed and isolated their client from other children in St Colman's before subjecting him to severe sex assaults.", "url": "https://www.bbc.co.uk/news/articles/c8j01g8w4d2o"}