{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 04:32:24", "date_modify": "2025-04-26 04:32:24", "date_publish": "2025-03-03 05:33:40", "description": "The new programme will include crossings and cycle paths to connect the city better for cyclists.", "filename": "news_articles_ckgdyv777x2o_1745641944.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7860/live/e87ff2a0-f4d7-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgdyv777x2o_1745641944.html", "title": "Work on Thorpe Wood's new active travel scheme to start", "title_page": "Work on Thorpe Wood's new active travel scheme to start - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work on a council's sustainable travel plan which includes new cycle paths and crossings is due to start on Monday.\nThe Cambridgeshire and Peterborough Combined Authority has provided a £2m grant to Peterborough City Council via Active Travel England funding.\nThe works at Thorpe Wood will include widening footways and a cycle way, allowing people on bikes to travel safely in both directions and are expected to be complete by the summer.\nIt also includes plans for two crossings to be installed and a new bus shelter.\nOther major schemes where active travel is a major component include the £48m Peterborough Station Quarter and about £400,000 of revenue grant for feasibility and early design options to help develop 16 cycling routes.\nCouncillor Angus Ellis, cabinet member for the environment and transport at Peterborough City Council, said \"This is great news for Peterborough residents.\n\"Thorpe Wood is a key link to areas of employment and leisure and the project will be a significant improvement to those that use the route.\n\"The new infrastructure will also link in to the new pedestrian and cycle bridge over the Nene Parkway and provide a seamless transition between Longthorpe and Thorpe Wood.\"\nHe added: \"It is wonderful that we have been able to secure external funding to deliver the works and demonstrates our ongoing determination to ensure people can navigate the city sustainably.\"\nDr Nik Johnson, Mayor of Cambridgeshire and Peterborough, said: \"The Combined Authority is helping to make journeys in Peterborough better, and that includes putting in infrastructure that will encourage more people to walk, cycle or wheel.\n\"This month we announced we had secured a further £6.5m in funding from Active Travel England to support even more accessible, safe and pleasant routes for Peterborough and the whole region.\"\nThe works will be delivered by Milestone Infrastructure Limited, Peterborough City Council's highways partner.\nResidents will see barriers going up in the area in the coming days in preparation for the works.", "url": "https://www.bbc.co.uk/news/articles/ckgdyv777x2o"}