{"authors": ["Ewan Gawne", "www.facebook.com"], "date_download": "2025-04-26 08:15:06", "date_modify": "2025-04-26 08:15:06", "date_publish": "2025-02-26 11:02:15", "description": "The search for the remains of Raina Alayed moves to a new area of a layby in North Yorkshire.", "filename": "news_articles_c743edz4l77o_1745655306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6810/live/6819d500-f427-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c743edz4l77o_1745655306.html", "title": "Raina Alayed: Decade-long search for murdered woman's body continues", "title_page": "Raina Alayed: Decade-long search for murdered woman's body continues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A decade-long search for the body of a woman who was murdered by her husband has resumed, police have said.\nMother-of-three Rania Alayed was killed by Ahmed Al-Khatib in 2013 in a flat in Salford, Greater Manchester, but the 25-year-old's remains have never been found.\nPolice have returned to a lay-by on the A19 in Thirsk, North Yorkshire, where they will sweep a wider area of land than has been searched previously.\nA Greater Manchester Police (GMP) spokesperson said the force \"have acted upon information that has been available to us\".\n\"We continue to do everything we can to help bring some form of closure to her loved ones\", the spokesperson added.\nIn June 2014, Al-Khatib was jailed for life for murdering his wife.\nThe then 35-year-old was told he would spend a minimum of 20 years behind bars.\nAl-Khatib's brothers Muhaned and Hussain were jailed for helping to dispose of Ms Alayed's body.\nAt the time, GMP said the \"sickening\" crime was a planned, so-called honour killing motivated by Al-Khatib's \"outrage and jealousy that Rania would attempt to take control of her own life\".\nThe prosecution at his murder trial said Ms Alayed had been killed for becoming \"too westernised\" and \"establishing an independent life\".\nPassing sentence, Mr Justice Leggatt noted that Ms Alayed had suffered \"years of abuse\".\nThe judge added: \"The contempt you showed for Rania in death matched the contempt of how you treated her in life.\"\nThe search for her body has been focused on the A19 lay-by after one of Al-Khatib's brothers told police she had been buried there.\nOfficers, who have combed the area on several occasions in recent years, have now returned to the site and will search a wider area.\n\"We will be on location to carry out a thorough search of the area identified and will keep disruption to the local community to a minimum, with no wider risk or threat to the public,\" the GMP spokesperson added.", "url": "https://www.bbc.co.uk/news/articles/c743edz4l77o"}