{"authors": ["Jude Winter", "www.facebook.com"], "date_download": "2025-04-26 04:15:19", "date_modify": "2025-04-26 04:15:19", "date_publish": "2025-03-04 10:36:03", "description": "A peaceful demonstration is planned to take place after a series of knife crime incidents in Nottingham.", "filename": "news_articles_cx29j3x2dllo_1745640919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/658c/live/ec06cdc0-f86c-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx29j3x2dllo_1745640919.html", "title": "'We can't allow knife crime to be normal in Nottingham'", "title_page": "'We can't allow knife crime to be normal in Nottingham' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Enough is enough, we cannot allow knife crime to become normal in our city.\"\nCampaigner Marcellus Baz has expressed \"deep concern\" following a series of knife crime incidents in Nottingham, including a stabbing inside the city's Primark store on 23 February.\nA machete was recovered following reports of a fight on Lower Parliament Street on Thursday, and a 17-year-old boy was taken to hospital with serious injuries following a stabbing near Nottingham Castle the following day.\nDr Baz, founder of anti-crime youth charity Switch Up, believes \"words are not enough\" to tackle the issue and has organised a peaceful demonstration to take place in Old Market Square on Saturday.\nHe said the aim of the event was to bring communities together and to \"provide reassurance and outline a clear plan to combat knife crime\".\n\"If we don't try, nothing will happen,\" Dr Baz, who won the BBC Sports Personality of the Year Unsung Hero Award in 2016, added.\n\"Our community needs to be heard, we should not be living in fear and we need reassurance.\"\nDr Baz hopes the demonstration will show a \"collective commitment\" to make Nottingham a safer place to live.\nAssistant Chief Constable Suk Verma of Nottinghamshire Police said he \"understands people's concerns\" but added they were \"isolated incidents\".\nHe said: \"We are implementing an increased police presence and I want to drive down this particular fear of knife crime.\n\"The reality is, this is a whole systems approach needed to tackle knife crime. We need to tackle this through multi-agency groups.\n\"This needs everyone to get round the table and we can't deal with this alone as the police.\"", "url": "https://www.bbc.co.uk/news/articles/cx29j3x2dllo"}