{"authors": ["Jonathan Marcus", "www.facebook.com"], "date_download": "2025-05-19 15:29:46", "date_modify": "2025-05-19 15:29:46", "date_publish": "2015-02-05 02:18:39", "description": "Defence Correspondent Jonathan Marcus looks at how Nato is readjusting its strategy in response to the crisis in Ukraine.", "filename": "news_world-europe-31137760_1747668586.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80793000/jpg/_80793908_80793907.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31137760_1747668586.html", "title": "Nato readjusts as Ukraine crisis looms", "title_page": "Nato readjusts as Ukraine crisis looms - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Thursday Nato will set out the details of what the Alliance's Secretary General Jens Stoltenberg has described as \"the biggest reinforcement\" of its \"collective defence since the end of the Cold War\".\nIt's all about reassuring Nato countries in eastern Europe and deterring what is perceived as a potential Russian threat to the Baltic Republics or other Nato members.\nThe force that will be announced on Thursday should bolster Nato's ability to respond swiftly to a military threat.\nBut it is also a signal that the Alliance's political leaders and military planners now see Russia's seizure of the Crimea and military forays into eastern Ukraine as much more than just a temporary crisis between Moscow and the West.\nNato's Deputy Secretary General, Alexander Vershbow - a seasoned US diplomat - set out this view most clearly in a speech earlier this week.\n\"Russia's aggression against Ukraine\", he said, \"is not an isolated incident but a game-changer in European security. It reflects an evolving pattern of behaviour that has been emerging for several years.\"\nWorse still - as far as Nato insiders are concerned - there is simply no telling how the Ukraine crisis will evolve.\nThe hope was that sanctions against Russia (now bolstered by falling oil prices) would make President Vladimir Putin think again, though many experts believe that this is to understate the domestic political aspects of the Russian adventure in Ukraine.\nBut nobody at Nato rules out a major escalation, for example a Russian push westwards through Mariupol to open up a corridor to Crimea.\nRussia's deployments and pattern of snap exercises suggests that it could mount such an operation at very short notice.\nNato military planners say they believe they could execute such an operation successfully in a matter of days, with the Ukrainian military unable to stop them.\nCrisis produces uncertainty and uncertainty leads to an elevated level of risk. That is why Nato's defences are now firmly looking eastwards.\nThe aim is to overhaul and upgrade all of the Alliance's rapid reaction forces on land, sea and air.\nBut the most important initial element is what is termed the \"spearhead\" - a brigade-sized force (say 4,000-5,000 strong), parts of which will be able to deploy at two-days notice. The rest would be able to follow along within the week.\nAt Thursday's Nato meeting defence ministers will announce how this force will be constituted and who will participate.\nBear in mind that many more than 5,000 troops may be needed as units rotate into this role from other duties.\nBeing able to move rapidly is one thing but the facilities have to be in place on Nato's eastern flank to receive, accommodate and support the arriving forces.\nTo this end command elements are to be set up in six Nato countries: Estonia, Latvia, Lithuania, Poland, Romania and Bulgaria.\nThese small headquarters - designated by Nato in another addition to its massive lexicon of military acronyms as NFIUs or Nato Force Integration Units - will each have about 50 personnel. Half will be drawn from the host country and half from other Nato countries.\nTheir job is to ensure that the arriving \"spearhead\" units can deploy rapidly to where they are needed, but in normal times they will assist with collective defence planning and mounting multinational exercises.\nSuch exercises will remain a permanent feature of Nato's activities. A number of countries, not least the United States, are looking again at pre-positioning heavy equipment like tanks and artillery in Europe, not in vast quantities, but sufficient to give credibility to Nato's deterrent posture.\nOf course, posture is very much in the eye of the beholder.\nNato sees its actions as entirely defensive but this is not the way they will be seen in Moscow. Indeed their fundamentally different perceptions of the Ukraine crisis is what is driving the wider rift between Russia and the West.\nNato's wider actions - its plans to open a training centre in Georgia and its support for the reform of Ukraine's military - all ring alarm bells in Moscow.\nTensions could get worse still if the US or other Nato allies move to arm the Ukrainian military.\nThis is not a Nato issue as such but something for national governments, and everyone is watching the course of the evolving debate within the Obama administration.\nA recent report, external from the influential Brookings think-tank made just this case. It was a powerful statement not least because it was authored by a number of former administration officials with recent experience of these issues.\nSome serving officials are said to be rethinking their opposition to arming the Kiev government. It is an issue that Secretary of State John Kerry will be raising with America's allies in talks over the coming few days in both Brussels and Munich.\nHowever, some experts still warn, external that this course of action could simply inflame the situation and perhaps provoke the Russians into a larger military adventure.\nThis one-day Nato ministerial meeting will be followed by the annual security conference in Munich starting on Friday.\nUkraine will figure prominently. Russian Foreign Minister Sergei Lavrov will be there and is expected to meet a number of key players.\nIt may though be an occasion for more heat rather than light.", "url": "https://www.bbc.com/news/world-europe-31137760"}