{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:54:31", "date_modify": "2025-05-19 14:54:31", "date_publish": "2017-07-05 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across the North East on Wednesday 5 July 2017.", "filename": "news_live_uk-england-tyne-40462804_1747666471.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-tyne-40462804_1747666471.html", "title": "BBC Local Live: Updates from North East England on Wednesday 5 July 2017", "title_page": "BBC Local Live: Updates from North East England on Wednesday 5 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nThat's all for today - thank you for joining us.\nTo keep up with what's happening overnight, head to BBC Tees, BBC Newcastle, Look North, and online.\nYou can tweet your photos to @BBCNewsNE, external, email them, or contact us via our Facebook page, external.\nWe'll be back tomorrow from 08:00. Have a great evening.\nWe'll leave you with this lovely photo taken by Billy Atkinson earlier this week of a female roe deer in woods near Chester-le-Street.\nCounty Durham dog found dumped in a river hundreds of miles away\nThe body of a dog from County Durham has been found hundreds of miles away in a river with a rope around its neck.\nThe Staffordshire bull terrior was discovered two weeks ago. It was attached to a lump of wood in the Llangollen River in North Wales. '\nIt was microchipped but the RSPCA, external says its chip hasn't been able to lead its officers to the dog's owners.\nWoman raped in Ashington\nA woman was raped in Ashington in the early hours of this morning, police said.\nThe victim was attacked in the North Seaton area of the Northumberland town.\nDet Ch Insp Helen Anderson of Northumbria Police said: \"The victim is our utmost priority and our specialist officers are working closely with her to offer all the support she needs.\n\"While we are treating this as an isolated incident we do have officers on patrol in the area to reassure the public.\"\nNorthumbria police reassuring public over proposed changes to front desks\nNorthumbria Police says the changes to the opening hours of its front desks will not affect the number of operational stations across the force or the availability of front line officers.\nSince Monday, all its front desks, apart from the one at Sunderland have only been open during daytime hours.\nThe force says it wants to reassure the public after the union, Unison circulated a petition about the changes.\nQuote Message\n\"We are still wrestling with the impact of austerity and the cuts that we have faced in Northumbria are the largest of any force in the country. This has meant that we have to make difficult decisions whilst striving to deliver the best possible service to our communities. \"\nChief Constable Steve Ashman, Northumbria Police\nMP applauded over comments in women's pensions debate\nEasington Labour MP Grahame Morris was applauded in Parliament as he led a debate on resolving the so called \"WASPI\" pensions issue.\nHe was highlighting what he calls an \"injustice.\" It concerns women born in the 50s who say they had little or no notice that their retirement age was being increased - leading them to claim they face financial difficulties bridging the gap to when they will now be entitled to a pension.\nMr Morris said he believes the matter needs special consideration\nThe Government says the decision to increase women's retirement age was made more than 20 years ago to bring it in line with men.\nApplause broke out after Mr Morris made his closing remarks in the debate - asking for dignity for the WASPI women.\nMPs and members of the public gallery reacted angrily as the pensions minister Guy Opperman said support was available for women in their 60s to retrain or seek apprenticeships to find work until their pensions now began.\nMr Opperman, who is Hexham Conservative MP, also said that much work had been done since 1995 to alert women to their increasing retirement age. But the Conservative Minister said the Government would not be changing the new rules.\nBradley Lowery 'still fighting'\nTerminally-ill Bradley Lowery is still fighting, a family friend has posted.\nThe six-year-old, from Blackhall Colliery, near Hartlepool, has neuroblastoma and is receiving palliative care at home. At the weekend his family said he was having difficulty breathing and he was visited by footballer Jermain Defoe (pictured).\nThe Facebook post reads: \"Hi Guys Lynn here Update on Brad.\n\"Bradley is still fighting to stay with us. Nobody knows where he is getting the strength from or how he is doing it.\n\"He has been very close to going with the angels but he pulls himself out of it.\n\"It is a hard time for us waiting and watching for our baby to take his last breath he started with fighting and he is ending with fighting.\"\nCounty Durham MP secures debate on women's pensions\nBBC Newcastle\nEasington MP Grahame Morris (pictured) secured a debate in Parliament's Westminster Hall today about the State Pension age for women.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThe campaign group Waspi - Women Against State Pension Inequality - argues women born in the 1950s, thought they'd retire at 60, but will now have to retire at - or after - 65, the same as men. T\nThe group says the the way the changes were implemented is unfair, with little or no personal notice. The Government's arguing it's already made concessions worth more than £1bn to limit the impact of the rising state pension age.\nAshley calls £15m pub promise 'nonsense'\nBillionaire Mike Ashley said a claim that he agreed to pay a finance expert £15m during a drinking session in a pub is 'nonsense'.\nInvestment banker Jeffrey Blue said the Newcastle United owner promised to pay him £15m if he increased Sports Direct's share price to £8 each.\nHe was paid £1m but is suing Mr Ashley for the rest at London's High Court.\nMr Ashley said it \"would be obvious\" to anyone at the pub where they were drinking that he \"was not serious\".\nCheaper rail fares now available on day of departure\nMillions of rail passengers can now buy cheaper \"advance\" tickets on the day of departure, the Rail Delivery Group (RDG) has announced.\nUntil now, advance fares have generally only been available up until midnight on the day before.\nEight train operators are offering the service, claiming that the cheaper tickets can be bought as little as 10 minutes before the train leaves.\nBut advance fares are for a limited number of seats and often sell out.\nAdvance tickets can potentially be bought on the day with CrossCounty, Grand Central, Greater Anglia, Northern, Transpennine Express, Virgin Trains East Coast, Virgin West Coast and Caledonian Sleeper.\nMan arrested in connection with Gateshead crossbow investigation\nBBC Newcastle\nA man has been arrested following reports of a man with a crossbow in Gateshead last night.\nA cordon was put in place yesterday evening in Avenue Road while a property was searched.\nA weapon was recovered and Northumbria Police said a man who had been spoken to was not at the address.\nHe was arrested later and remains in custody.\nProtest as South Tyneside hospital consultation begins\nA protest has been taking place this morning to coincide with the start of a consultation on the reorganisation of health services in South Tyneside and Sunderland.\nDoctors, nurses and NHS staff have come up with different options for the delivery of stroke, maternity and children's services - these could be moved from South Tyneside to Sunderland hospital.\nHealth bosses say the changes will make the service more efficient but campaigners have labelled them 'a downgrading of care'.\nPeople and patients are being invited to have their say from today.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nRevised plans for potash mine near Whitby\nThe company behind plans for a new £1.7bn potash mine in North Yorkshire has published revised proposals for the site.\nDeveloper Sirius Minerals wants to mine on land near Whitby and build a 23-mile tunnel to a processing plant in Teesside.\nSirius Minerals says among the \"minor alterations\" is the relocation of some approved buildings.\nThe changes are designed to simplify the mine infrastructure and make the construction process more efficient, the firm says.\nIt's been discussing its proposals with the local planning authority and says it will submit an amended application in the next few days.", "url": "https://www.bbc.com/news/live/uk-england-tyne-40462804"}