{"authors": ["Niall McCracken", "www.facebook.com"], "date_download": "2025-04-26 03:44:59", "date_modify": "2025-04-26 03:44:59", "date_publish": "2025-03-05 06:28:06", "description": "Monica Johnston worked at a Belfast hospital for almost 50 years and was diagnosed with asbestos-related cancer in 2023.", "filename": "news_articles_c3w11486p5wo_1745639099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/089f/live/768f9170-f9b2-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w11486p5wo_1745639099.html", "title": "Asbestos: Retired nurse with cancer suing trust over exposure", "title_page": "Asbestos: Retired nurse with cancer suing trust over exposure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A retired nurse with terminal cancer is suing the Belfast Health Trust over alleged exposure to asbestos during her time working there, BBC News NI can reveal.\nMonica Johnston worked at the Royal Victoria Hospital for almost 50 years and received a diagnosis of mesothelioma, an asbestos-related cancer, in January 2023.\nAsbestos was used in building materials until it was discovered that inhalation of fibres could cause cancers, but it is only considered dangerous when it is moved.\nIn a statement, the Belfast Trust said it had \"robust arrangements in place to effectively manage\" sites with asbestos.\nMs Johnston is taking a legal case against the Belfast Trust as she believes she was exposed to asbestos fibres during her working life.\nSymptoms of mesothelioma can take decades to develop, and it is almost always fatal.\nA leading cause is long-term, low-level inhalation of asbestos.\nThe 66-year-old from Bangor said when she received the diagnosis, \"it was like a bomb was dropped on my family.\"\n\"I kept thinking, 'How could this happen?' I've only ever worked as a nurse; it has changed our lives forever,\" she said.\nBetween 2014 and 2023, there were 699 asbestos-related deaths in Northern Ireland.\nBBC News NI can reveal that more than £10m has been spent on removing asbestos from hundreds of hospitals and healthcare buildings in Northern Ireland since 2019.\nMore than half was spent in the Belfast Trust.\nThe Department of Health said the controlled removal of asbestos from the health estate \"mitigates the risk to health from exposure to asbestos\".\nHealth trusts say they invest \"significant amounts of money\" to reduce the risk of any exposures to asbestos and that \"robust arrangements\" are in place to manage sites where it was present.\nThere are a number of ways to claim compensation for asbestos exposure in Northern Ireland.\nFirstly, individuals can sue the organisation they believe is responsible.\nNew figures obtained by BBC News NI show at least £347,000 has been paid out by Northern Ireland's health trusts since 2003 to people who believe they were exposed to asbestos in their buildings.\nThe Belfast, Northern, and Southern Trusts were able to provide an overall figure for the total amount they have paid out in asbestos compensation that they have on record.\nThe South Eastern Trust and the Western Trust only provided the money they paid out in asbestos compensation between 2019 and 2024.\nOther avenues for people impacted by asbestos exposure include a number of government compensation schemes.\nBBC News NI previously reported that millions of pounds have been paid out through these schemes, with the majority linked to Belfast's shipbuilding industry.\nMs Johnston started working as a nurse in 1977.\n\"I loved my job, and I was very fortunate that I had very good health for most of my life, and I never smoked or anything like that,\" she said.\nIn November 2021 she started noticing that she was constantly out of breath but was unable to get a diagnosis for some time.\nThings eventually came to a head when she developed pains in her chest and collapsed at work.\nScans would eventually confirm that Ms Johnson had mesothelioma.\n\"Even as an experienced nurse, I had never heard of it, and the doctor explained that the only way you can get it is by coming into contact with asbestos,\" she said.\n\"There was nothing in my childhood, my family, or their work that connected me to asbestos; the only possible exposure was through my own work.\"\nThe Belfast Trust said it has 148 sites which still contained asbestos, but that these were \"low risk\".\nThe Department of Health said all of its organisations had to comply with strict rules regulating asbestos in their buildings.\nLiz Darlison, chief executive of the charity Mesothelioma UK, said she was increasingly concerned about the growing incidence of mesothelioma in people who worked in occupations that exposed them to low levels of asbestos, such as education and healthcare.", "url": "https://www.bbc.co.uk/news/articles/c3w11486p5wo"}