{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:59:25", "date_modify": "2025-05-19 14:59:25", "date_publish": "2015-02-03 12:40:04", "description": "EastEnders boss Dominic Treadwell-Collins says he will not bring minority characters into the BBC soap just to fulfil diversity quotas.", "filename": "news_entertainment-arts-31108409_1747666765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80754000/jpg/_80754807_80754806.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31108409_1747666765.html", "title": "EastEnders: 'No diversity quota' says boss", "title_page": "EastEnders: 'No diversity quota' says boss - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "EastEnders boss Dominic Treadwell-Collins has said he will not bring minority characters into the BBC soap just to fulfil diversity quotas.\nHe told the Radio Times defining such characters with plots around ethnicity, sexuality or disability would turn the soap into \"a blancmange\".\n\"The day I start box-ticking is the day I leave,\" he said.\nLast year, the BBC Trust said the show \"isn't a documentary and has to appeal to audiences throughout the UK\".\nSpeaking last summer, Diane Coyle - the former acting head of the Trust - said \"there are almost twice as many white people living in [EastEnders'] fictional E20 as in real life E17\", adding that the corporation needed to step up its efforts to reflect contemporary Britain.\nBBC director general Tony Hall announced plans last year to increase the BBC's diversity, pledging that 15% of on-air staff would be black, Asian, minority or ethnic (BAME) by 2017 - increasing it from the current 10.4%.\n'Fight back'\nAlthough EastEnders has not been told it must meet any target, Mr Treadwell-Collins said he would not adhere to one if asked.\n\"As soon as someone starts imposing editorial decisions, we fight back, because we know what we're doing,\" he said.\nDuring his tenure at EastEnders, Mr Treadwell-Collins has overseen the introduction of two characters with disabilities, including market trader Donna Yates, in addition to a number of ethnic and minority characters.\nHe also created the storyline in which Muslim character Syed Masood struggled with his faith and sexuality.\nMr Treadwell-Collins also recently cast Richard Blackwood in the soap, describing him as \"an authentic Londoner\".", "url": "https://www.bbc.com/news/entertainment-arts-31108409"}