{"authors": ["Gavin Butler", "www.facebook.com"], "date_download": "2025-04-26 04:27:24", "date_modify": "2025-04-26 04:27:24", "date_publish": "2025-03-03 10:46:50", "description": "At least one person has died and more than 80 buildings have been damaged in the blaze.", "filename": "news_articles_c89ypkq72d0o_1745641644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/558c/live/c55bb870-f81c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89ypkq72d0o_1745641644.html", "title": "Thousands evacuated as Japan's biggest fire in decades continues to burn", "title_page": "Thousands evacuated as Japan's biggest fire in decades continues to burn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Japan has deployed more than 2,000 firefighters to battle the country's biggest forest fire in three decades.\nAt least one person has died in the blaze, which has torched more than 5,200 acres around the northern Japanese city of Ofunato since Thursday, according to the Fire and Disaster Management Agency (FDMA).\nAlthough January to March is typically Ofunato's driest season, the area saw less rainfall last month than any February in more than 20 years - recording just 2.5 millimetres, compared to the usual average of 41.\nAbout 4,600 people remain under government-issued evacuation orders as the fire continues to burn.\nSome 2,000 have already left the area to stay with friends or relatives, and more than 1,200 have evacuated to shelters, officials said.\nThe fires are burning in a forest area of Iwate Prefecture, which is Japan's second largest prefecture and has the country's second-lowest population density.\nMore than 80 buildings are estimated to have been damaged so far, although FDMA noted that details are still being assessed.\n\"Although it is inevitable that the fire will spread to some extent, we will take all possible measures to ensure there will be no impact on people's homes,\" Prime Minister Shigeru Ishiba said in parliament.\nThousands of firefighters from 14 prefectures, including Tokyo, have been dispatched to fight the fires. At least 16 helicopters are also being used, with images showing the aircraft dumping water onto the smouldering hills.\nLike many other countries, Japan in 2024 recorded its hottest year since records began.\nIt is difficult to know if climate change has caused or worsened specific fires, because other factors - such as changes to the way land is used - are also relevant.\nHowever, the IPCC says, external climate change is making the weather conditions needed for wildfires to spread more likely.\nHave you been evacuated? Send us your story.", "url": "https://www.bbc.co.uk/news/articles/c89ypkq72d0o"}