{"authors": ["Emma Petrie", "www.facebook.com"], "date_download": "2025-04-26 06:46:18", "date_modify": "2025-04-26 06:46:18", "date_publish": "2025-03-01 14:12:52", "description": "South Kesteven District Council is offering the free four week trial to attract new traders.", "filename": "news_articles_c5y9gp43w9wo_1745649978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74f3/live/7f2b6dc0-f694-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y9gp43w9wo_1745649978.html", "title": "Grantham traders offered free trial spot at market", "title_page": "Grantham traders offered free trial spot at market - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Businesses in Grantham are being invited to try market trading as part of a free four week trial by South Kesteven District Council.\nCouncil officials said the project would give traders \"a feel for trading on Grantham Market\" before deciding whether to sign up for a regular spot.\nA spokesperson for the council said they hoped the scheme would bring \"fresh energy\" to the market.\nThe authority said the trial would be funded through the government's Future High Streets programme and will run from 5 April, continuing until all of the funding had been spent.\nOfficials said they hoped the scheme would also boost footfall in the town.\nCouncillor Paul Stokes said: \"Markets play a vital role in our town centres, not only as place for shopping but also as a hub for the local community.\"\nHe said the scheme would give new traders the opportunity to experience market trading with no up-front costs and bring a greater variety of goods to Grantham Market.\nAbout 30 traders regularly attend the market, which runs every Saturday from 08:30 GMT until 15:00 on Narrow Westgate, Butcher's Row and Market Place.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c5y9gp43w9wo"}