{"authors": ["Clara Bullock", "www.facebook.com"], "date_download": "2025-04-26 07:51:37", "date_modify": "2025-04-26 07:51:37", "date_publish": "2025-02-25 15:01:56", "description": "Cultural venues were \"shocked and disappointed\" after government funding was slashed.", "filename": "news_articles_cly24zlvg6do_1745653897.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/80ee/live/ebbb91d0-f2b7-11ef-8db0-bbc7a4fcf665.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly24zlvg6do_1745653897.html", "title": "Somerset venue Cheese and Grain 'shocked' as funding withdrawn", "title_page": "Somerset venue Cheese and Grain 'shocked' as funding withdrawn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Staff at two arts venues say they are \"shocked and disappointed\" after government funding was slashed.\nThe government has now withdrawn £5m in funding which the previous administration had promised to Frome's Cheese and Grain venue and Shepton Mallet's Amulet theatre in Somerset.\nThe government said it would change the way funding was distributed and the venues could apply for funding again in the future.\nSteve Macarthur, director at the Frome Cheese and Grain venue, said: \"I'm shocked but not surprised.\"\nThe Cheese and Grain had planned a refurbishment of its studios and the roll-out of apprenticeships for sound technicians.\n\"Not too much blood and treasure tipped into this. Nonetheless, it is disappointing and caused delays and increase in costs for young people,\" Mr Macarthur said.\n\"There's young people looking for apprenticeships now and this will delay things by a year.\"\nCampaigner Martin Berkeley, who was hoping the Amulet theatre in Shepton Mallet could reopen, said: \"It is very disappointing because it would have made a huge difference to Shepton Mallet.\n\"Because we put so much work into the funding bid, we are in a great position to put our project for the new round of funding.\n\"All these things take a very long time.\"", "url": "https://www.bbc.co.uk/news/articles/cly24zlvg6do"}