{"authors": ["Paul Glynn and Annabel Rackham", "www.facebook.com"], "date_download": "2025-04-26 06:15:01", "date_modify": "2025-04-26 06:15:01", "date_publish": "2025-03-01 22:44:50", "description": "The Essex star won artist, song and album of the year, for her LP which became a cultural phenomenon.", "filename": "news_articles_c0rz54kn75ko_1745648101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/26ba/live/dddbc1e0-f6f2-11ef-8eb0-3b0492672615.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rz54kn75ko_1745648101.html", "title": "Brit Awards go Brat as Charli XCX sweeps best artist and song of the year", "title_page": "Brit Awards go Brat as Charli XCX sweeps best artist and song of the year - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Brit Awards belonged to Charli XCX on Saturday night, who completed her transformation from underground hero to bona fide pop star by winning five awards including best artist, album and song of the year.\nEzra Collective, Sam Fender, Stormzy and best new artist The Last Dinner Party were the other big British winners on Saturday night, while Fontaines DC and Chappell Roan bagged the international awards.\nThe night also included a memorable, blush-inducing performance from US pop sensation Sabrina Carpenter, who was handed the global success award at London's O2 Arena.\nThe arena fell silent near the end of the show for a moving video tribute to the late Liam Payne, who died last October.\nDespite not performing, Charli XCX stole the show by winning the biggest awards of the night - artist of the year, album of the year for her cultural phenomenon Brat, and song of the year for Guess.\n\"This is cool, I'm really happy that a song about underwear now has a Brit award, very important stuff\", said Charli, dryly, on stage after collecting her first award.\n\"I'm sure that that proves something about songwriting but I'm not sure what.\"\nShe went on to thank Eilish - the first non-Brit to appear on a best song-winner - for her guest vocals on Guess which she delivered at just three days notice. \"Thank you Billie for running and gunning...\"\nThe 32-year-old from Essex also picked up the best dance act and songwriter of the year awards.\nIn her speech for best dance act, which she dedicated to late pop star and producer Sophie, Charli spoke of the importance of the night-time genre. \"I feel like dance music, electronic music gets a really bad rep' because everyone is like, 'it's not that deep, is it?'. And I kind of feel it is,\" she said.\n\"This genre of music for me is euphoric, it allows me to escape, it allows me to feel on such a deep level.\"\nAs she collected her fifth and final award of the night for best album, Charli told the crowd how she had \"always felt like an outsider\" up until this point.\n\"Culture caught up with us and wanted to be on the journey with us - I am living proof that it takes a long time but you don't need to compromise your vision,\" she added.\nIt's always difficult getting the tone of the opening performance right - but Carpenter certainly nailed the brief with her mash-up of mega-hit Espresso and recent favourite from her best-selling album, Bed Chem.\nFans of the star who have been eagerly following her Short n' Sweet Tour will have recognised some elements of it in her Brits performance - which was given a suitably British update with the opening strains of Rule, Britannia! and a, ahem, close encounter with a red-coated, bearskin-wearing \"soldier\".\nCarpenter also became the first international star to accept the returning global success award, jokingly saying it was \"an insane honour, for such a tea-drinking country you streamed the [heck] out of Espresso.\"\nWearing some lingerie that might have been a little bit too racy for the pre-watershed slot, her performance around a heart-shaped bed was energetic and embodied her cheeky style that has elevated her fame in recent months.\nSeveral artists used their winning platform to urge the powers-that-be to do more to protect artists and give them the time, space and funds to develop.\nJazz group Ezra Collective - who closed the night with an upbeat performance alongside Jorja Smith - won group of the year, with bandleader Femi Koleoso expressing how giving a young person at a youth club a trumpet, for example, could help to fix \"so many of the problems that face greater society in the UK\".\nChappell Roan, who won best international act and international song for Good Luck, Babe!, noted via a video link how she had to write \"a lot of bad songs to get to the good ones\".\nRising star winner Myles Smith - or \"the Luton Bob Dylan\", as host Jack Whitehall called him - performed his hit Stargazing and called on the government to stop treating British music as an \"after thought\".\n\"How many more venues need to close?\" he asked, before urging the music industry to stick with artists their first viral hits and tours.\nIt was also a night that marked the return of Sam Fender, with the Geordie singer-songwriter picking up the best alternative/rock act.\nHe thanked his band in his speech, saying he would just be a \"mad man shouting at walls\" without them.\nIt marks the end of a huge week for Fender, who also topped the UK album charts with People Watching - which had the biggest opening week for a British album since Harry Styles' Harry's House in 2022.\nHe topped off the evening with an emphatic performance of its title track.\nLiam Payne, who tragically died in Argentina aged 31, had a huge connection to the Brits, both as part of One Direction and as a solo artist.\nThe ceremony included a touching tribute to the star, which was a bit of a gear shift towards the end of the fun-packed show, as Whitehall queued up a sombre black and white montage of Payne's career, including music and quotes from him and his bandmates.\n\"I hope that me singing today brings enjoyment to someone,\" he was heard saying.\nSeven-time Brit winner Dua Lipa won nothing on the night despite having received four nominations.\nThere were also snubs for rock royalty The Beatles, Coldplay and The Cure, who like Dua, all lost out to Charli in various catergories.\nLet's hope they're not too Bratty about it.", "url": "https://www.bbc.co.uk/news/articles/c0rz54kn75ko"}