{"authors": ["James Bovill", "www.facebook.com"], "date_download": "2025-04-26 04:30:05", "date_modify": "2025-04-26 04:30:05", "date_publish": "2025-03-03 06:29:24", "description": "Dozens of Gen Z chess players are flocking to a new type of club, complete with DJ soundtrack.", "filename": "news_articles_c5y0e645gp0o_1745641805.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b859/live/0d2f23e0-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0e645gp0o_1745641805.html", "title": "ChessCafe: The Birmingham venue bringing young people together", "title_page": "ChessCafe: The Birmingham venue bringing young people together - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On a side street, in a cafe above an office, more than 70 young people are playing chess, to a thumping DJ soundtrack.\nSome have arrived alone, others with friends or partners. Most, but not all, are in their early 20s.\nThis is ChessCafé, external in Birmingham's city centre.\n\"This is not just a chess club,\" its social media pages said.\n\"Just show up, hang out, and enjoy the vibes.\"\nThe vibes of the venue, EthyOn Cafe, is reminiscent of a 1980s New York-style loft apartment with exposed brick, unsanded floorboards, dim lighting and vinyl records kept on shelves.\nPeople start filing in during the late afternoon, hugging each other and smiling. By 19:00, it's standing room only and the place is buzzing.\nKaran Singh co-founded the fortnightly event to recreate a chess club he found while doing an internship in London.\n\"Social spaces for young people are often limited to a bar or a club. We wanted to break that,\" he said.\nSans is a first-timer at the venue.\n\"There are so many social activities in places which involve alcohol,\" she said.\n\"This is something different. Everything is so online now, so meeting people physically is rare.\"\nIt's a paradox. More young people are discovering chess because influencers are streaming games on online platforms like Youtube and Twitch.\nIt's become one of the fastest growing game in the world, with an estimated six million players in the UK alone.\nBut the players here, many who learned how to play online, are craving the real thing, both the game, and the connection that comes with it.\n\"We really want to disconnect from our phones. It can get overstimulating,\" Najma, aged 20, said.\n\"It's a place where you can get together with people, especially someone like me who has social anxiety and has trouble meeting people.\"\nFive years on from the start of the pandemic, many young people still find it hard to socialise. Groups like this offer a stress-free environment in which to meet people.\n\"You can walk in by yourself, play a game with someone, and over the next 10 to 20 minutes, you've made a friend. The board and the pieces are there to facilitate social interaction,\" co-founder Karan Singh said.\nInside the room is a mix of personalities. Some just turn up, play, and leave. Others see it as a social gathering with a game thrown in. Some take it seriously. Others are laughing throughout.\nMilan, 20, plays for his university chess society and has arrived alone. \"You don't need to know people. There's no pressure to talk, you can just play if you want.\"\nLiban is the opposite: \"You can talk to anybody. I can walk up to any table right now, have a chat with them. Everyone is so welcoming here\".\nTyrese and Nadira are a couple and, like many here, enjoy the mindfulness of chess, a haven to take them away from the stress of real life for a couple of hours.\n\"I enjoy the thinking, the originality. Chess is very abstract, it's like life in many ways, and I think it brings people together no matter who you are,\" Tyrese said.\nNadira agrees: \"There's a theory to chess but not a correct way to play. You can have your own effect on the game, you can be yourself. There's a silent competitiveness about it. Even if you're losing you can learn something.\"\nI asked everyone I spoke to, how they would describe ChessCafé to a newcomer.\nCo-founder Abdi-Rahim Haji summed up the most common reply: \"We've created a space for people to start talking again. By the end of the night, you'll definitely have made new friends, and hopefully you'll leave with a smile as well.\"", "url": "https://www.bbc.co.uk/news/articles/c5y0e645gp0o"}