{"authors": ["David Grundy", "www.facebook.com"], "date_download": "2025-04-26 03:38:33", "date_modify": "2025-04-26 03:38:33", "date_publish": "2025-03-04 22:52:08", "description": "\"Provoking China\" by supporting US military aims would be a bad idea, campaigners say.", "filename": "news_articles_c0kg73dmzmzo_1745638713.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/52d3/live/2c1960d0-f908-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg73dmzmzo_1745638713.html", "title": "Donald Trump could 'dominate space' in Pembrokeshire radar plans", "title_page": "Donald Trump could 'dominate space' in Pembrokeshire radar plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to build a space radar station could allow US President Donald Trump to dominate space from Wales, campaigners have said.\nMore than 15,000 people have signed an online petition opposing Ministry of Defence (MoD) plans to build 27 radar dishes at Cawdor Barracks in Brawdy, Pembrokeshire.\nJim Scott, a spokesman for the People Against Radar Campaign (PARC), said \"provoking China\" by supporting US military aims \"where there is no rational imperative to do so\" would be a bad idea.\nThe UK government said Deep Space Advanced Radar Capability (DARC) was vital to track objects in deep space and protect satellite and communication and navigation networks.\nIt added that DARC would meet or exceed international environmental and health standards.\nMr Scott said: \"Would you trust Donald Trump, who in recent weeks has switched sides in a global proxy war, to militarily dominate all of space using Pembrokeshire as a foothold to do so?\n\"If not, we very strongly urge you to consider ways you can help to stop DARC.\"\nCefin Campbell, Plaid Cymru Member of the Senedd (MS) for Mid and West Wales, has tabled a statement in the Senedd opposing DARC, supported by 11 other politicians.\nPARC, along with groups including CND Cymru, Stop the War and Peace Action Wales (Heddwch ar Waith), will take the campaign to Senedd politicians on Wednesday, with an event planned at the Pierhead building in Cardiff Bay.\nTheir concerns also include possible effects on tourism, residents' health, pressures on infrastructure and the geopolitical implications.\n\"There is a mainstream consensus emerging that where once the UK could go on under the assumption that if there was a major war, that the US could be relied upon to be fighting on the same side as the UK, this is no longer the case,\" PARC said in a statement.\nThe DARC dishes would be 66ft (20m) high and 49ft (15m) wide and built very close to the Pembrokeshire Coast National Park.\nThe programme is part of the trilateral AUKUS security partnership with the US and Australian governments.\nThose countries are also building similar sites to DARC, in response to possible threats from countries such as Russia and China.\nWhen it was announced in December 2023, then-defence secretary Grant Shapps said tracking activity in \"deep space\" would help the UK protect itself from \"space warfare\".\nThe MoD said radars would enable nations to identify objects in deep space, up to 22,000 miles (36,000 km) from Earth.", "url": "https://www.bbc.co.uk/news/articles/c0kg73dmzmzo"}