{"authors": ["Eleanor Maslin", "www.facebook.com"], "date_download": "2025-04-26 03:39:29", "date_modify": "2025-04-26 03:39:29", "date_publish": "2025-03-04 20:22:53", "description": "Humber Rescue has attempted to refloat the vessel three times since it ran aground on Sunday.", "filename": "news_articles_cy4lnj7le82o_1745638769.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/137f/live/1386d820-f932-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4lnj7le82o_1745638769.html", "title": "Three attempts to refloat cargo ship in Humber unsuccessful", "title_page": "Three attempts to refloat cargo ship in Humber unsuccessful - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A cargo ship remains aground in the Humber Estuary despite three attempts to refloat it.\nH&S Wisdom became stuck on Sunday near Brough with the current navigation status by Vessel Finder, a website that tracks the status of ships, reported as aground.\nHumber Rescue attempted to refloat the vessel once on Sunday and twice on Monday but was unsuccessful. Attempts by tugboats were also unsuccessful.\nThe tracker said the ship left Rotterdam on Saturday and was heading to Gunness Wharf Port near Scunthorpe.\nGunness Wharf Port is operated by RMS Trent Ports. It handles mainly bulk and steel-based imports and exports, accommodating vessels that are up to 328ft (100m) long.\nHumber Rescue was first alerted to the ship being aground at 21:08 GMT on Sunday.\nIt attempted to re-float the vessel on Sunday but was unsuccessful.\nAfter coordination with HM Coastguard Humber, a second attempt was made at 07:00 on Monday morning with the assistance of three tugs.\nA third attempt was made at 18:00 the same day.\nAccording to the tracker website, the vessel is a general cargo ship that was built in 2004 and is currently sailing under the flag of the Netherlands.\nThe BBC has contacted the ship's owners for comment.", "url": "https://www.bbc.co.uk/news/articles/cy4lnj7le82o"}