{"authors": ["Beth Cruse", "www.facebook.com"], "date_download": "2025-04-26 04:24:48", "date_modify": "2025-04-26 04:24:48", "date_publish": "2025-03-03 12:28:27", "description": "Sir Daniel Gooch is recognised as a key figure in the development of the railway in Swindon in the 1800s.", "filename": "news_articles_cj3nx0z1612o_1745641488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d907/live/7f0d3f30-f617-11ef-bc15-b928e72b39da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj3nx0z1612o_1745641488.html", "title": "Great Western Railway pioneer honoured with new statue in Swindon", "title_page": "Great Western Railway pioneer honoured with new statue in Swindon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A sculpture honouring a \"remarkable\" railway pioneer has been unveiled.\nA two-metre-tall hand-carved statue of Sir Daniel Gooch has been revealed at Swindon's GWR Park.\nSir Daniel was a key figure in the development of the Great Western Railway, who, at the age of 24, recommended to build the line in Swindon in a letter to Isambard Kingdom Brunel.\nGraham Derham, who carved the sculpture from wood, said: \"I hope I've done him justice and helped bring to light a man who is so often overshadowed by Brunel.\"\nSir Daniel Gooch was the first Superintendent of Locomotive Engines on the Great Western Railway from 1837 to 1864, and its chairman from 1865 until his death in 1889.\n\"Daniel Gooch was remarkable, his engineering expertise, compassion towards the workers, his energy, forethought and will is inspiring,\" Mr Derham added.\n\"This project has been fantastic to work on.\n\"There have been several challenges, both logistically with the working platforms and organically with the structure of the tree.\n\"I'm very pleased with the end result, however, given more time there is much more I would like to do.\"", "url": "https://www.bbc.co.uk/news/articles/cj3nx0z1612o"}