{"authors": ["Will Jefford", "www.facebook.com"], "date_download": "2025-04-26 06:38:03", "date_modify": "2025-04-26 06:38:03", "date_publish": "2025-02-26 06:23:30", "description": "At 30 metres below ground level, the tunnel allows trains to avoid woodland above, HS2 says.", "filename": "news_articles_cpq2len1weyo_1745649483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aa3f/live/b3be5680-f39f-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq2len1weyo_1745649483.html", "title": "HS2 'deep tunnel' reaches construction milestone", "title_page": "First HS2 'deep tunnel' reaches construction milestone - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "HS2's first deep tunnel, which took 15 months to dig and is under ancient Warwickshire woodland, has reached a construction milestone.\nCivil engineering works, including concrete finishing works, base slabs and emergency walkways , have now been completed on the one-mile (1.6km) stretch of the line.\nThe Long Itchington Wood Tunnel is the first of five twin-bore tunnels on the HS2 project and was created by 2,000 tonne tunnel boring machine 'Dorothy'.\nAt 30m (98ft) below ground level, the tunnel allows the high speed line, which will connect London and Birmingham, to avoid villages and woodland.\nThe process to fully excavate two tunnel drives and the entrance sections produced around 750,000 tonnes of material, which has since been reused to build embankments along the route of the railway.\nSince the breakthrough almost two years' ago, work has been ongoing to fit out the tunnels with its vital structural components.\nDoug Barnett, senior project manager for HS2 Ltd, said: \"It's a small part of HS2 but it's been four and a half years of my life in which I've seen this construction go from its very embers to nearing completion – a really proud moment for me personally.\n\"Long Itchington Wood Tunnel is a tremendous feat of engineering and would not have been possible without a huge amount of continuous work put in over the past five years.\"", "url": "https://www.bbc.co.uk/news/articles/cpq2len1weyo"}