{"authors": ["Faith Page", "www.facebook.com"], "date_download": "2025-04-26 04:29:50", "date_modify": "2025-04-26 04:29:50", "date_publish": "2025-03-03 06:41:28", "description": "Katy Mellor said she wanted to share the beauty of the Shropshire countryside with others.", "filename": "news_articles_c5y0r8rpyylo_1745641790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4eb9/live/26b18e10-f5de-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0r8rpyylo_1745641790.html", "title": "Horse rider maps routes in Shropshire hills", "title_page": "Horse rider maps routes in Shropshire hills - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A young equestrian has mapped 47 safe, circular routes for horse riders, cyclists and walkers across the Shropshire hills.\nThe paths are in areas including the Long Mynd, Stiperstones, Clee Hills, Wenlock Edge and Clun.\nKaty Mellor, who has been working on the Pathfinder Project, external for eight months, wanted others to enjoy the county's areas of outstanding natural beauty (AONB).\nThe 26-year-old said she also wanted to offer a safe alternative to riding on the roads.\nThe endurance rider said the idea was to create between 40 and 50 new rides, using the existing bridleway network.\nShe said there were lots of long-distance, linear routes, but she wanted to map some shorter circular rides of between 5 and 15 miles that people could do in a day.\nMs Mellor, who works at Shropshire Farm Vets in Hanwood, has tried to minimise the use of country lanes for safety reasons.\nThe British Horse Society, which is supporting the Pathfinder Project, said in the past two years there were 120 incidents involving horses on Shropshire's roads.\nThe BHS figures show two riders were injured, two horses died and two horses were injured in 2023-24.", "url": "https://www.bbc.co.uk/news/articles/c5y0r8rpyylo"}