{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:21", "date_modify": "2025-05-19 14:26:21", "date_publish": "2015-03-22 13:54:05", "description": "Women break Afghan funeral customs to help bury a woman killed by a mob in Kabul on an apparently false charge of burning the Koran.", "filename": "news_world-asia-32009004_1747664781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81825000/jpg/_81825714_81825713.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-32009004_1747664781.html", "title": "Kabul mob attack: Women help bury 'wrongly accused' Farkhunda", "title_page": "Kabul mob attack: Women help bury 'wrongly accused' Farkhunda - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The coffin of a woman, killed by a mob in Kabul on an apparently false charge, has been carried by women, marking a break with Afghan funeral customs.\nHundreds of people attended a funeral for the woman, named as Farkhunda, demanding her killers be punished.\nFarkhunda had been accused of burning the Koran, but an official investigator said there was no evidence for this.\nThe attack on the woman, as well as the alleged failure of police to intervene, have been heavily criticised.\nAfghan President Ashraf Ghani said he had ordered an investigation into the killing.\nFootage of the attack, filmed on mobile phones, has been widely circulated on social media.\nA mob, largely made up of men, attacked the woman with sticks and stones, beating her to death before setting her body alight, while police reportedly looked on.\nWitnesses said the crowd had accused the woman of burning a copy of the Koran.\nThe attack, near the Shah-Du-Shamshaira mosque and shrine, is thought to have been the first of its kind in Afghanistan.\nAt the funeral on Sunday, women's activists carried the coffin, breaking with tradition as men usually perform that role.\nAn interior ministry official in charge of investigating the case said he had found no evidence that the woman had burnt the Koran.\n\"Farkhunda was totally innocent,\" Gen Mohammad Zahir told reporters. He said 13 people, including eight police officers, had been arrested.", "url": "https://www.bbc.com/news/world-asia-32009004"}