{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:50:47", "date_modify": "2025-04-26 06:50:47", "date_publish": "2025-02-28 18:07:41", "description": "Officers may ask fans to remove 'identity-concealing' clothing ahead of the meeting between Hibs and Hearts.", "filename": "news_articles_ce34vw78pkvo_1745650247.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5af1/live/d716c760-f5fd-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce34vw78pkvo_1745650247.html", "title": "Police given 'stop and search' power ahead of Edinburgh derby", "title_page": "Police given 'stop and search' power ahead of Edinburgh derby - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police Scotland have been given special powers to stop and search fans around Sunday's Edinburgh derby in a bid to avert football-related disorder.\nThe force warned fans may be asked to remove items of clothing felt to be concealing their identity as part of the operation ahead of the meeting between Hibs and Hearts at Easter Road.\nCh Supt David Robertson said the powers, which were previously deployed by officers to curb Bonfire Night trouble in the city, had been temporarily introduced following \"several incidents of disorder and violence\" linked to matches.\nThe measures will be in place in various areas of the city, including the city centre and Leith, between 10:30 and 16:30 on Sunday.\nMore than a dozen men were charged following an outbreak of disorder in the city centre after Hibs played Motherwell in October.\nPolice Scotland said \"violence\" had been directed at officers during that incident.\nThree men were also arrested and charged for carrying or using pyrotechnics when the Edinburgh sides met at Tynecastle on Boxing Day.\nOfficers are allowed to search those they believe to be under \"reasonable suspicion\" of committing a crime, planning to commit a crime or in possession of a \"prohibited article\" under section 60 of the Criminal Justice and Public Order Act 1994.\nIt also allows officers to \"require the removal of any item the officer believes is being used wholly or partly for the purposes of concealing their identity\".\nThe powers will include the right to stop and search those on foot and in vehicles.\nPolice deployed similar tactics on Bonfire Night in the city, when they were attempting to stop disorder in a number of communities.", "url": "https://www.bbc.co.uk/news/articles/ce34vw78pkvo"}