{"authors": ["Abdujalil Abdurasulov", "www.facebook.com"], "date_download": "2025-05-19 14:23:27", "date_modify": "2025-05-19 14:23:27", "date_publish": "2015-03-23 14:25:42", "description": "After 26 years in power there is no suggestion that Uzbek President Islam Karimov will lose presidential elections, reports the BBC's Abdujalil Abdurasulov in Almaty.", "filename": "news_world-asia-31971638_1747664607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81772000/jpg/_81772587_024245892-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31971638_1747664607.html", "title": "Why Islam Karimov will win Uzbekistan's elections", "title_page": "Why Islam Karimov will win Uzbekistan's elections - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In a bright and spacious room Uzbek President Islam Karimov is talking to his voters. Like every other meeting broadcast on state TV, it all looks very orderly.\nMen in suits and ties, women in smart dresses occupy the entire hall leaving no empty seats. They all have a pen and a notebook but nobody is taking any notes.\nWhen the speech is over, everyone jumps from their seats and applauds.\nPresident Karimov has been in power since 1989 when he was selected as the Communist Party leader of Soviet Uzbekistan.\nToday this Central Asian state is seen as one of the most repressive countries in the world, international organisations describe its human rights record as \"abysmal\" and Uzbek citizens often call their leader \"podishoh\", the king.\nFew doubt that Mr Karimov will be re-elected for yet another term in the vote on 29 March.\nHis other three opponents are virtually unknown politicians who pose no real challenge.\n\"They are running just to create a sense of democracy,\" said Abdurakhmon Tashanov, a Tashkent-based activist from Ezgulik human rights organisation. \"But no real opposition is present. This is all like a play and everyone is playing their roles.\"\nMr Karimov's opponents show little sign of criticism. When they campaign, they repeatedly talk about \"continuing the development of the country\", \"further democratisation\" and \"keeping the [current] high pace of economic growth\".\nThey all praise \"achievements\" of Uzbekistan since independence.\nTheir message is to vote for Islam Karimov as he has been doing everything right.\nObservers say that the general public is indifferent towards the election, yet many are expected to cast their votes for the incumbent.\nA voter in the eastern province of Jizzakh says that she will vote for Mr Karimov because \"no one else can be better than him\", referring to the president as \"otamiz\" - our father.\n\"We are used to him. I can't imagine anyone else in his place,\" she said.\nOthers feel under pressure. A voter in the capital Tashkent told the BBC that an official from the municipality came to her flat with a list of people who are to vote for Islam Karimov. The list included the names of the residents and their addresses. She was asked to provide her passport details.\n\"I didn't dare to refuse because I did not want to have problems,\" she said.\nThis election is drawing a lot of attention because of speculation about a possible successor to Mr Karimov, who is now 77. His disappearance from public sight for almost a month earlier this year only fuelled rumours about his poor health.\nBut according to Dr Lawrence Markowitz, an expert on Central Asian affairs at Rowan University, the political elite in Uzbekistan is keen to keep Islam Karimov in power as long as possible.\nHe says that ultimately they benefit from the system by converting state resources into private wealth. The central leadership provides them with protection in return for political support.\n\"[This] system, and corruption it fosters, is so pervasive in public offices in Uzbekistan that it now severely constrains any transfer of power since a disruption of this flow of wealth brings repercussions for many political elites.\"\nHowever, as the president gets older the signs of an internal power struggle are becoming more visible.\nIt is particularly illustrated by the downfall of Gulnara Karimova, the \"Uzbek princess\" and the president's eldest daughter. Until recently, she was one of the most powerful people in the country, but is now believed to be under house arrest.\nUzbek authorities charged Ms Karimova with mafia-style corruption. She is under investigation over a money-laundering probe in Europe, which involves telecommunication giants like Scandinavian company TeliaSonera and an Amsterdam-based VimpelCom.\nThe firms are accused of bribing Ms Karimova in order to receive mobile licenses.\nIn Uzbekistan's secretive environment it is impossible to tell how Gulnara Karimova, who was groomed to be the next president of Uzbekistan, became an outlaw.\nBut in the relentless tweets from her account that went silent a year ago, she blamed national security services head Rustam Inoyatov.\nMr Inoyatov has been the head of the SNB, the Uzbek version of the KGB, since the 1990s and is considered to be a possible successor to Mr Karimov.\nOther influential officials who are also widely believed to be candidates for the presidency include Prime Minister Shavkat Mirziyoyev and his first deputy, the Finance Minister Rustam Azimov.\nBut Dr Markowitz says that none of them can manage the country's major power structures - its complex economy and oppressive system of government.\n\"These two structures are central to Uzbekistan's internal stability,\" he said.\n\"Yet the two are largely at odds with one another, making it difficult for Mirziyoyev or Azimov to exercise authority over the coercive apparatus and for Inoyatov to command the economic administration.\"\nWhat is important is not who will take over when Islam Karimov leaves, but how this person will be able to govern, Dr Markowitz adds.\n\"The highly corrupt and highly unequal system that privileges elites and marginalises everyone else politically and economically is not sustainable in the long term. If it is not reformed, I believe it will eventually lead to instability.\"", "url": "https://www.bbc.com/news/world-asia-31971638"}