{"authors": ["Nick Clark", "www.facebook.com"], "date_download": "2025-04-26 07:54:11", "date_modify": "2025-04-26 07:54:11", "date_publish": "2025-02-25 13:43:36", "description": "Slough Borough Council says a mum of four will have a \"considerable wait\" for a new home.", "filename": "news_articles_c4gm998105lo_1745654051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea33/live/dd63eac0-f379-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gm998105lo_1745654051.html", "title": "Slough family told to wait seven years for a council home", "title_page": "Slough family told to wait seven years for a council home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A family of six has been told they will have to wait seven years to move out of their council flat despite their children's needs.\nSabrina Kelly lives in a two-bedroom top floor flat on Ronaldsay Spur, in Slough, with her partner and four children, who all have complex special educational needs.\nShe said her youngest son had little understanding of danger, which means he needs to be constantly supervised.\nSlough MP Tan Dhesi was told by Slough Borough Council she would have a \"considerable wait\" before her application could be considered.\nMs Kelly first applied for a more suitable home in June 2022.\nShe said: \"It's quite stressful. I've explained to Slough Borough Council that I need space.\n\"I've given them medical details and letters to say this place isn't suitable and they're just not taking me seriously.\n\"They told me I'm on the housing waiting list but I've got to wait another six to 10 years.\"\nShe has also sent the council evidence, including special educational needs assessments and a letter from her son's school, all outlining her children's complex needs.\nThese include the need for outdoor space, space to calm down, and somewhere safer for her youngest son.", "url": "https://www.bbc.co.uk/news/articles/c4gm998105lo"}