{"authors": ["Susana Mendonça", "www.facebook.com"], "date_download": "2025-04-26 04:29:03", "date_modify": "2025-04-26 04:29:03", "date_publish": "2025-03-02 08:23:15", "description": "Dominic Twomey leads Barking and Dagenham Council, where support has risen for Reform UK.", "filename": "news_articles_cr7ey7n978do_1745641743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/078d/live/5c8b5780-eb0e-11ef-b25f-37430fe73ea9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr7ey7n978do_1745641743.html", "title": "Barking & Dagenham: Labour warned on Reform party rise in London", "title_page": "Barking & Dagenham: Labour warned on Reform party rise in London - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Labour leader of an east London council has said that the Labour Party should not \"be complacent\" about the rise in support for Reform UK in the capital.\nThe comments by Dominic Twomey, the leader of Barking and Dagenham council, come after national YouGov opinion polling, external suggested that Nigel Farage's Reform UK was one point ahead of Labour in voting intentions.\nThe borough is among the areas where Reform UK did well in London in the General Election last year.\nReform UK's London Assembly member Alex Wilson said his party's rise is \"because of the establishment's continued failure to deliver for working people\".\nMr Twomey took over running the east London borough last year after his predecessor Darren Rodwell stepped aside as leader after being forced to withdraw as a parliamentary candidate for Labour.\nSpeaking to Eddie Nestor for BBC Radio London's \"Meet the Leader\" hot-seat, a series about the capital's newest council leaders, Mr Twomey recalled the part he and other Labour Party members played in countering the rise of the British National Party (BNP) back in 2006 in Barking and Dagenham when it won 12 council seats.\nHe said: \"We learnt the lesson from 2006 to 2010 and onwards and ever since. Do not become complacent.\n\"Do not allow a void to come where you don't talk to your residents, because someone will fill it.\"", "url": "https://www.bbc.co.uk/news/articles/cr7ey7n978do"}