{"authors": ["Cachella Smith and Tom Symonds", "Rob England", "www.facebook.com"], "date_download": "2025-04-26 06:30:56", "date_modify": "2025-04-26 06:30:56", "date_publish": "2025-02-27 10:20:44", "description": "More than 108,000 people claimed asylum in the UK in 2024, according to new statistics.", "filename": "news_articles_c62zzxeeveeo_1745649056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bcf4/live/71359190-f4ec-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzxeeveeo_1745649056.html", "title": "UK asylum claims hit highest level since 1979", "title_page": "UK asylum claims hit highest level since 1979 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The number of people claiming asylum in the UK in 2024 has reached its highest level since records began in 1979, Home Office figures show.\nAccording to data published on Thursday, 108,138 people claimed asylum in the year to December 2024 - an increase of 18% on 2023 and almost twice the number in 2021.\nThe Home Office said the previous recorded peak was in 2002.\nThe new high follows an uptick in recorded small boat arrivals in recent years. The number of small boat arrivals also increased in 2024 - 25% higher than in 2023 - but the figure was 20% lower than in 2022.\nThe UK now receives the fifth largest number of asylum seekers in the \"EU plus\" area at a time when the government is under pressure to cut the asylum decision backlog.\nThese figures, which cover the end of the Conservative government and the start of Labour, show the number of asylum cases awaiting an initial decision fell by 5% last year - with more than 90,600 cases, relating to around 124,800 people, pending a decision as of the end of 2024.\nThe number remains higher than before 2022.\nThe UK also sent more people into immigration detention last year, with that figure increasing by 12%.\nMeanwhile, the UK returned 2,251 people to another country who had arrived by small boat last year, a 10% increase compared to 2023.\nThere has also been a sharp increase in people granted citizenship - with the figure standing at more than 269,600 in 2024.\nThe prime minister's deputy official spokesman said there were \"no quick fixes\" to the \"global\" problem of illegal migration, but the government had a \"serious long-term plan to restore order to the asylum system\".\nBorder Security and Asylum minister Angela Eagle criticised the previous government for a \"broken asylum system\", saying Labour inherited a \"huge backlog\" of claims.\n\"We are beginning to get some order to the system but it will take time to make certain that we can get a grip and start making the system work again.\"\nAsked why claims are so high, Eagle said \"many people want to come here\", further referring to those coming on work and student visas and then claiming asylum.\nShe underlined \"we have to be much tougher\" dealing with visa overstayers.\nShadow home secretary Chris Philp described the figures as \"no surprise,\" saying there was \"no deterrent\".\nPhilp added that the blame for the numbers \"lies firmly at Labour's feet, who have been slow to act to tackle the crisis unfolding on our border\".\nThe British Red Cross's policy, research and advocacy director Mubeen Bhutta called for the government to create \"more safe routes\" to prevent people taking dangerous journeys to the UK.\n\"Behind today's numbers are real men, women and children who have been forced to flee their homes. Too many are making perilous journeys to find safety, because they have no other option,\" Bhutta said in a statement.\n\"For the vast majority of people, there is no way to claim asylum in the UK without already being here.\"\nNew guidance issued for visa and immigration staff earlier this month set out that anyone entering the UK illegally having made a dangerous journey to do so, including those already here, will normally be refused citizenship.\nThe measure was criticised by the Refugee Council as well as some Labour MPs.\nThe Refugee Council said on Thursday it was \"encouraged\" the government continued to work on the \"broken asylum system\" during its first six months in power.\nHowever, it called for further efforts to cut the backlog of asylum applications to avoid people \"stuck in hotels, trapped in limbo and unable to work\".\nThe government's use of hotels to house asylum seekers has continued to rise, with more than 38,000 in hotels at the end of December. That figure was still lower than the peak of 56,000 hit in September 2023.\nThe government has pledged to stop this practice by the end of the parliament.\nThe government is legally obliged to provide accommodation to asylum seekers who cannot afford to support themselves while their claims are being considered. But the number of people seeking asylum in the UK has hit record levels, leading to a shortage of spaces in existing accommodation.", "url": "https://www.bbc.co.uk/news/articles/c62zzxeeveeo"}