{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:02:30", "date_modify": "2025-05-19 15:02:30", "date_publish": "2015-02-12 03:58:30", "description": "Posting so-called revenge porn pictures and videos on the internet is due to become a criminal offence in England and Wales.", "filename": "news_uk-31429026_1747666950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/78178000/jpg/_78178117_78178116.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31429026_1747666950.html", "title": "'Revenge porn' illegal under new law in England and Wales", "title_page": "'Revenge porn' illegal under new law in England and Wales - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Posting \"revenge porn\" images and videos on the internet is becoming a criminal offence in England and Wales.\nThe Criminal Justice and Courts Bill, which has a specific amendment dealing with such actions, will receive Royal Assent and become law later. Offenders face up to two years in jail.\nThe amendment covers images sent on social networks, including Facebook and Twitter, and those sent by text.\nBoth Scotland and Northern Ireland are considering similar laws.\nThe new English and Welsh law classes revenge porn as \"photographs or films which show people engaged in sexual activity or depicted in a sexual way or with their genitals exposed, where what is shown would not usually be seen in public\".\nIt covers images shared on and offline without the subject's permission and with the intent to cause harm. Physical distribution of images will also be covered.\nThe Scottish Government told BBC Newsbeat there were plans to consult on making revenge porn a specific offence.\nNorthern Ireland's Department for Justice said there were existing laws to prosecute revenge porn offenders, but ministers would consider the case for a new offence.\nVictims of revenge porn have found it difficult to have pictures removed from the internet.\nMany sites where the images are hosted are based outside the UK, and requests to remove content are often ignored.\nIn some cases, asking for removal results in more attention being brought to the images.\nAccording to information from eight police forces in England and Wales that kept data on this issue, there were 149 allegations of revenge porn made between 1 January 2012 and 1 July 2014.\nThe vast majority of victims were women. Six incidents resulted in police action.\nWithout specific legislation, some have sought legal workarounds to have images taken down - most commonly the use of copyright law, since if an intimate picture has been taken as a \"selfie\", the image's copyright belongs to the taker.", "url": "https://www.bbc.com/news/uk-31429026"}