{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:57:44", "date_modify": "2025-04-26 03:57:44", "date_publish": "2025-03-04 13:46:01", "description": "A trial over the murder of Stuart Everett hears his remains were dumped across Greater Manchester.", "filename": "news_articles_cp8ymy6y72qo_1745639864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/56b5/live/88580d90-f8f6-11ef-ad98-31dd620eac72.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8ymy6y72qo_1745639864.html", "title": "Man's body cut into 27 pieces, trial hears", "title_page": "Stuart Everett: Man's body cut into 27 pieces, trial hears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man's body was cut into 27 pieces and left across Greater Manchester, a jury has heard.\nMarcin Majerkiewicz, 42, has denied the murder of Stuart Everett, whose remains were first discovered by a member of the public in an abandoned bunker at a nature reserve in Salford in April last year.\nThe prosecution in the trial at Manchester Crown Court allege he was caught on CCTV making numerous trips to the Kersal Dale area to dump the 67-year-old's body parts.\nBoth men lived in a house in the Winton area of Salford where police found evidence of blood stains and a clean-up operation, the court was told.\nMr Everett is believed to have died between 27 and 28 March last year before his body was cut up.\nJason Pitter KC, opening the prosecution case, said the \"gruesome\" discovery of his torso at Kersal Dale triggered investigations that led to other body parts being found at six other locations in Greater Manchester.\nMr Majerkiewicz has also denied an alternative charge of manslaughter.\nMr Everett was of Polish heritage and was born with the name Roman Ziemacki, the court heard.\nHe lived at a shared house at 195 Worsely Road, in Winton, as the sole tenant, responsible for the rent but sub-let rooms in the property to others including Mr Majerkiewicz.\nAn increase in rent may have led to \"tension\" between the two men, the court heard.\nThe prosecutor said after the initial torso find police scoured CCTV from the area around Kersal Dale on 4 April 2024.\nDetectives found, two days before, about 17:00 BST, a man was seen entering the pathway nearby carrying a heavy blue bag, walking to the wooded area where the body part was found.\nThe same person was seen to emerge a short while later holding the bag folded up.\nMr Majerkiewicz was traced and arrested on suspicion of murder as he matched the man in the CCTV footage, the court heard.\nHe had on him two mobile phones, one belonging to Mr Everett along with the victim's bank cards, the court was told.\nWhen police searched Mr Majerkiewicz's address they found evidence of bloodstaining and a clean-up operation, showing \"something terrible had happened in that house\", Mr Pitter added.", "url": "https://www.bbc.co.uk/news/articles/cp8ymy6y72qo"}