{"authors": ["Paul Rogers", "www.facebook.com"], "date_download": "2025-04-26 08:09:46", "date_modify": "2025-04-26 08:09:46", "date_publish": "2025-02-26 12:50:56", "description": "It is feared a further collapse of a wall which fell in Ludlow in 2013 will hurt pedestrians.", "filename": "news_articles_cwygj20ewgvo_1745654986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c60/live/bc410830-f434-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygj20ewgvo_1745654986.html", "title": "Ludlow meeting hears concerns over further town wall collapse", "title_page": "Ludlow meeting hears concerns over further town wall collapse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A stone town wall which suffered a collapse 12 years ago could be at risk of further collapses which posed a risk to pedestrians, a meeting has heard.\nA structural engineer's report in 2021 concluded the original slippage by St Laurence's Church in Ludlow, in February 2013, was most likely caused by a build-up of water.\nBut, because of a dispute over responsibility, the wall has not been repaired.\nAt the weekend the Ludlow Town Walls Trust told the meeting the wall extending from the collapsed section was \"in a tenuous condition of stability\".\nIt said it had asked the town council to erect warning signs and protective barriers, but claimed the authority had declined, saying liability lay with the Parochial Church Council (PCC).\nSince the 10m (33ft) section fell, temporary measures have been taken to prop it up and fence it off, but neither the Ludlow Town Council nor the PCC have admitted responsibility for its upkeep and repair.\nThe section still at risk, the meeting of about 80 people heard, was the part extending eastwards from the collapse to the rear of the Compasses Inn.\nThe PCC, which is part of the Diocese of Hereford, has said it planned to initiate legal proceedings for a judicial review and file a complaint of maladministration with the Local Government Ombudsman.\nIn an email to the Town Walls Trust in January, the town council said any demands for a risk assessment should be directed to the church, which owned the wall, and that it had no liability to investigate or undertake remedial works.\nLudlow Town Council has been approached for comment.", "url": "https://www.bbc.co.uk/news/articles/cwygj20ewgvo"}