{"authors": ["Huw Oxburgh", "Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 03:46:05", "date_modify": "2025-04-26 03:46:05", "date_publish": "2025-03-05 06:06:24", "description": "East Sussex County Council is now considering other options for the bridge due to spiralling costs.", "filename": "news_articles_c3w14d6qlp7o_1745639165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a413/live/5bc36620-f910-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w14d6qlp7o_1745639165.html", "title": "Sussex: Plans to replace Exceat Bridge deferred", "title_page": "Sussex: Plans to replace Exceat Bridge deferred  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A decision to build a two-way crossing to replace a single-lane bridge has been deferred as councillors explore more affordable alternatives due to spiralling costs.\nOn Tuesday, East Sussex County Council's cabinet discussed other options for Exceat Bridge, which spans across the A259 between Seaford and Eastbourne.\nOne possibility is to build a one-lane replacement bridge with permanent traffic lights and this would cost £9.7m instead, compared to the original plan which costs £21.4m.\nCarolyn Lambert, councillor for Seaford South, said the county council should \"gather more evidence\" regarding the impact of pursuing this alternative, according to the Local Democracy Reporting Service.\n\"There are some important points that need to be considered,\" she said.\n\"This includes consultation with emergency services, the impact on local businesses and the impact on tourism.\"\nOfficers pointed out if the county council goes forward with this option, this would require the road to be closed for about 22 weeks and delays of up to an hour for motorists during rush hour.\nIn 2021, the county council received almost £8m from the Levelling Up Fund to fund the proposed scheme to replace Exceat Bridge, which was estimated to cost £10.5m.", "url": "https://www.bbc.co.uk/news/articles/c3w14d6qlp7o"}