{"authors": ["Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 03:45:50", "date_modify": "2025-04-26 03:45:50", "date_publish": "2025-03-05 06:11:59", "description": "Emelyn Enad worked in the Portsmouth hospital's neonatal ward for about 18 months until June 2022.", "filename": "news_articles_c3rn9pwlegvo_1745639150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c5dd/live/f441d900-f90a-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rn9pwlegvo_1745639150.html", "title": "Portsmouth: Nurse who went to sleep feeding two babies suspended", "title_page": "Portsmouth: Nurse who went to sleep feeding two babies suspended - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A nurse went to sleep as she fed two babies and left another alone when they needed to be constantly monitored, the nursing regulator has heard.\nEmelyn Enad worked in the neonatal ward at Queen Alexandra Hospital in Portsmouth between January 2021 and June 2022.\nA Hampshire care home she had also worked at shared concerns with the Nursing and Midwifery Council (NMC) and the hospital was then asked if staff had raised any issues.\nMrs Enad has been suspended from nursing for a year.\nThe hospital told the NMC that Mrs Enad also gave a father the wrong bottle of breast milk for their child and did not tell any senior staff of the error.\nIt told the NMC it had started its own investigation into Mrs Enad over concerns but it had not finished by the time she resigned in June 2022.\nA panel found that she had fallen asleep while feeding the two babies and writing up patient notes on the ward on 31 July 2021.\nOn 31 August 2021, she was found to have left a baby alone in an isolation cubicle, forgetting to ask a colleague to cover her absence.\nThe colleague found that while Mrs Enad was away, the cubicle's \"red alarm\" was triggered.\nThey told the panel that suggested immediate care was required.", "url": "https://www.bbc.co.uk/news/articles/c3rn9pwlegvo"}