{"authors": ["Tim Dale", "www.facebook.com"], "date_download": "2025-04-26 04:20:26", "date_modify": "2025-04-26 04:20:26", "date_publish": "2025-03-03 15:34:27", "description": "Andrew and David Turnbull admitted a breach of health and safety rules at an earlier hearing.", "filename": "news_articles_cy87d2dzj6jo_1745641226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d1c0/live/73712bd0-f830-11ef-a8b4-b37546a32a57.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy87d2dzj6jo_1745641226.html", "title": "Richmond farmers fined over teacher trampled to death by cows", "title_page": "Richmond farmers fined over teacher trampled to death by cows - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two farmers who admitted health and safety failures over the death of a dog walker killed by their cows have been fined.\nDavid Clark, a 59-year-old teacher from Richmond in North Yorkshire, was fatally crushed by cattle while crossing a field in September 2020.\nDavid and Andrew Turnbull, of Low Whashton near Richmond, admitted failing to ensure the health and safety of persons other than employees while operating a farm.\nJudge Jonathan Carroll fined David Turnbull £1,390 and Andrew Turnbull £1,589 at Teesside Crown Court and also expressed concern about the time taken to bring the case to court.\nHe said the fines were arrived at by \"close application of the sentencing guidelines\" and did not reflect, \"nor should they be perceived by anybody, to be a reflection of the value of Mr Clark\".\nThe prosecution had earlier said Mr Clark had been out running with his two dogs when he was attacked by the cows as he crossed the field using a public right of way.\nHe collapsed and, despite treatment by the emergency services, was pronounced dead at the scene.\nThe Health and Safety Executive (HSE) said people who own livestock were required to take precautions to warn the public of the risks, especially when cattle were with their young.\nThey argued the Turnbulls could have offered an alternative route to the public to avoid walkers and runners having to cross the field.\nHowever, they acknowledged that even if such a step had been taken it may not have prevented Mr Clark's death as it was impossible to state he would have taken it and there would still have been no barrier between him and the cows.\nCounsel for the brothers said Mr Clark's death had had a significant impact on them and their family and his death \"weighed heavily\" on them.\nThey also said since Mr Clark's death there had been no cows placed in that field and never would be again.\nSentencing the brothers, Judge Carroll said he first wished to pay tribute to Mr Clark.\n\"There is no suggestion he was doing anything wrong,\" he said.\nAddressing the defendants, he said it was not a case \"in which you took no steps\" or had been \"cavalier\" with the risks.\nHe said they had placed older mothers in the field with their calves, regularly checked the animals, had signs warning of the risks to dog walkers and had used the field for grazing for 30 years without incident.\nJudge Carroll added that the case had taken five years to come to a conclusion and, while he realised some health and safety cases could be complex, he did not find this case to be so.\nHe said the delays in the case were not justifiable and had caused \"significant stress and anxiety\".\nA spokesperson for the HSE said the organisation was \"committed to thorough investigations which ensure fairness to all parties\".\n\"Having taken over conduct of the case from the police in 2020, we acted as quickly as possible to make a decision in this case\", they said.\n\"Our investigation took time but ensured we built a robust case which ultimately resulted in guilty pleas and today's outcome.\"\nIn addition to their fines, Judge Carroll ordered both brothers to pay £1,500 in costs.", "url": "https://www.bbc.co.uk/news/articles/cy87d2dzj6jo"}