{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:36:34", "date_modify": "2025-05-21 07:36:34", "date_publish": "2025-03-28 00:00:00", "description": "The vice-president says Russia and China have increased footprints in the area and the world cannot \"bury our heads in the sand\".", "filename": "news_live_cwyd5zr20gdt_1747812994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5abf/live/d4064350-0c07-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cwyd5zr20gdt_1747812994.html", "title": "Vance scolds Denmark during Greenland trip as Trump says US must have island", "title_page": "Vance scolds Denmark during Greenland trip as Trump says US must have island- updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'We’re afraid of being colonised again' - Greenlander politician\nQupanuk Olsen, a Greenland politician with the pro-independence party Naleraq, says the country is taking Donald Trump's demands very seriously.\nShe tells the BBC's Maryam Moshiri that Donald Trump Jr's visit in January first sparked concerns, saying \"that’s when we realised that his words are no longer just words, he actually means what he says\".\n\"We’re afraid of being colonised again. We’ve been a colony for the past 300 years under Denmark, it still feels like it,\" Olsen says. \"Now another coloniser is interested in us.\"\nOlsen, however, says Greenland needs to be \"open-minded\" and consider strengthening relations with the US to secure a sustainable independence strategy.\n\"Trump is only going to be president for the next four years so we also need to think about what’s going to happen in 10 years, 15 years,\" she adds.\nHow JD Vance's speech has been received in Denmark\nWe just heard from the Danish prime minister. Now let's look at some more reactions out of Denmark, after US Vice-President JD Vance's speech in Greenland earlier today.\n\"I am a little provoked,\" says the country’s Foreign Minister, Lars Løkke Rasmussen. He tells Danish network TV2, \"These are very harsh words, and I am a little offended when you think that Denmark has always been there for the USA.\"\nJakob Kaarsbo, a former Chief Analyst in the Danish Defense Intelligence Agency, told Danish broadcaster DR, the speech was a “political propaganda stunt”. He added, \"It is true that Denmark has underinvested in the surveillance capabilities that have been agreed upon, but the US has also underinvested in their own military efforts in Greenland and in the Arctic for many years.”\n\"In isolation, this is a de-escalation,” Former Foreign Minister Mogens Lykketoft, told Danish newspaper Berlingke. \"But you don't really know if Trump will think differently tomorrow.”\nDenmark’s ambassador to the US, Jesper Møller Sørensen responded to JD Vance directly in a tweet on X, \"We agree that we both could have done even more, which is why Denmark is taking action. Another 2 bn USD investment in January - more to come soon… Our defence spending is now at 3.2%.\"\nDanish PM tells BBC that international rules must be followed\nThe BBC has received a statement from Danish Prime Minister Mette Frederiksen, which we have translated to English.\n\"The US vice-president has made it clear that the US respects Greenland’s sovereignty and the Greenlanders’ right to self-determination. It was important that this was made clear,\" Frederiksen says.\nThe PM says \"Denmark is a good and strong ally. For everyone in the NATO alliance\".\n\"We have significantly increased defense spending. For many years we have stood side-by-side with the Americans in very difficult situations. Therefore, it is not an accurate way for the vice-president to refer to Denmark.\nOn the other hand, it is right that security in the Arctic must be given higher priority.\nThat is why Denmark is now strengthening our efforts. With, among other things, more surveillance, new Arctic ships, long-range drones and satellite capacity. More capabilities will come later. And we can strengthen security more quickly if we can get the necessary supplies, among other things, from the US.\nGreenland is part of NATO, and therefore there is also a need for NATO to significantly increase its presence in the Arctic.\nSecurity in The Arctic is a matter for NATO and for all Arctic allies.\nWe are ready – day and night – to cooperate with the Americans. A cooperation that must be based on the necessary international rules of the game. And in an increased defense for all parts of the NATO alliance.\"\nEditor's note: While many Greenlanders favour independence from Denmark, polls suggest that the vast majority - 85% - of the territory's residents do not want to be part of the US.\nVance blasts Denmark but does not lay out what next steps for US will be\nAdrienne Murray\nReporting from Copenhagen\nJD Vance wasted little time before launching into a heavy dressing down of Denmark. As expected, he blasted the Nordic country for what he claimed was decades of neglecting military spending and investment in Greenland’s security architecture. He said Denmark had left the region vulnerable to Russian and Chinese encroachment.\nHowever, he was keen to spell out that the US \"argument is not with the people of Greenland, but with the leadership of Denmark\".\nIt was notable that the tone was softer, and Trump’s threats to annex the territory were downplayed, with Vance instead repeating that the United States supported Greenland’s right to self-determination - but that an independent Greenland should partner the United States.\nOne Danish reporter said Vance had used a bit of a \"good cop, bad cop\" by saying that the US has no problem with the Greenlanders.\nThough the speech trashed Denmark, there was a nervousness beforehand that it might have been worse. This wasn’t, at least, an escalation.\nAnd there were no plans for enlarging the American military footprint in terms of troops on the ground or more bases, though he did comment that the US would carry out more investment in more icebreakers and naval ships.\nEven so, Vance offered few clues though as to what the United States’ next steps are, which leaves some guessing, but concluded the US would cut a “Trump-style” deal.\nVance's comments likely to rattle US allies\nBernd Debusmann Jr\nReporting from Washington\nVice-President JD Vance's comments at Pituffik Space Base in Greenland were nothing we have not heard before - but are sure to raise eyebrows among some US allies, particularly in Copenhagen.\nHis assertion that Denmark has been \"under-investing\" in Greenland's security is one that we've heard often from Vance, Donald Trump and others - not just about Greenland but about European security in general.\nWe also saw shades of that with this week's publication of the now-infamous Signals chat with other cabinet members, in which Vance expressed his displeasure with European allies.\nVance's comment that the US respects Greenlander's \"self-determination\" will also ring hollow to many, both in Greenland and in Denmark.\nWhile many Greenlanders - including those of the centre-right Demokraatit Party that just won the most votes in Greenland's parliamentary election - favour independence from Denmark, polls show that the vast majority - 85% - of the territory's residents do not want to be part of the US.\nIt's unclear what the US endgame is here, although Vance seems certain that, ultimately, Greenlanders will \"cut a deal\" with the US.\nVance says that he believes a military operation will never be necessary, but the entire visit is likely to be seen as provocative, leaving many to question American intentions.\nMany foreign observers will also be watching carefully to see if the administration's handling of Greenland offers any clues to how they will handle other foreign territories that Trump has expressed interest in - namely Panama, Canada and Gaza.\nIn Nuuk, residents 'concerned' by Vance visit\nHere's more from the residents of Greenland's capital, Nuuk.\n\"I'm concerned (about the visit)...this is kind of odd, I don't like it,\" Nina tells the BBC.\nShe says the US already has a military base in Greenland \"so they can upscale...why don't they do that?\"\nHer daughter says the visit has caused \"a lot of uncertainty and a lot of people are worried\".\nThe \"intentions\" of the Americans \"aren't as pure or as clear as they claim to be\", her daughter, Anita, says.\nGreenlanders are usually \"very welcoming people,\" Anita says, but in recent days, many have said they would turn their backs on the Vances if they saw them walking down the street \"because of the disrespect\" the Americans have shown.\nTrump posts video proclaiming 'America stands with Greenland'\nWhile Vance was speaking, Trump shared a video produced by the lobbying group Securing American Greatness, outlining the US interests in Greenland.\nThe video Trump posted on social media features sweeping shots of Greenland's landscape, as well as archive footage that appears to come from newsreels in the 1940s.\n\"In the cold silence of the tundra, a bond was born,\" the narrator begins. The video goes on to describe how the Nazis sought control of the Arctic during WW2, and torpedoed a US ship that was on its way to Greenland to help prevent a Nazi invasion.\nFour chaplains gave up their life vests \"giving their lives so others might live, to protect America and Greenland,\" the video says. This refers to the sinking of the SS Dorchester by a German U-boat in 1943.\n\"But today, Greenland faces new threats - from Russian aggression and Chinese expansion,\" the narrator continues.\nIt goes on to say describe the US-Greenland partnership growing with \"every Arctic patrol, every partnership forged in the shadow of melting ice and rising tensions.\"\n\"This is not just history. It is destiny,\" as music swells in the background and icebergs are shown on screen.\n\"Now is the time to stand together again,\" it continues. \"For peace, for security, for the future. America stands with Greenland.\"\nHave plans been drafted for a US takeover of Greenland?\nVance is now asked if military plans to take over Greenland have been drafted.\n\"What we think is going to happen is that the Greenlanders are going to choose - through self-determination - to become independent of Denmark,\" the vice-president says, \"and then we're going to have conversations with the people of Greenland from there\".\nHe adds: \"We do not think military force is ever going to be necessary\".\nWith that, the press conference ends. We're pulling together a recap of the key lines - stay tuned.\nVance says military force 'not necessary'\nVance continues to talk about the US future in Greenland, but says that he does not believe that military force is necessary for the US to expand its presence on the Arctic island.\nHe says Trump holds the same opinion for his plans for Greenland.\nGreenland, he says, is \"extremely vulnerable right now\". He says that he thinks Greenlanders will want to partner with the US, despite opinion polls showing widespread opposition from the local population to US governance.\nVance says \"we think we're going to be able to cut a deal, Donald Trump-style, to ensure the security of this territory\".\nHe says \"this has to happen\" and again blames Denmark, saying they haven't kept the area safe.\nVance says 'no immediate plans' to expand military presence in Greenland\nThe vice-president is now taking questions from reporters.\nResponding to the first question, he says that there are no immediate plans to expand the US military presence in Greenland.\nBut he says there are additional investments happening in icebreakers and naval ships that will have a presence in Greenland.\nHe again says Russia and China have an increased footprint in the area, and that \"we need to wake up\".\n\"We can't bury our heads in the sand - or in this case in the snow - and pretend the Chinese are not interested in this landmass,\" he says.", "url": "https://www.bbc.com/news/live/cwyd5zr20gdt"}