{"authors": ["Aileen Moynagh", "www.facebook.com"], "date_download": "2025-04-26 07:46:53", "date_modify": "2025-04-26 07:46:53", "date_publish": "2025-02-27 00:01:01", "description": "Terry Cannon is waiting for a diagnosis for a stomach problem after experiencing internal bleeding.", "filename": "news_articles_cj4n887wj9ko_1745653613.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/05cf/live/82868740-f381-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n887wj9ko_1745653613.html", "title": "Man 'in limbo' waiting for consultant appointment", "title_page": "Waiting lists: Man 'in limbo' waiting for consultant appointment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A County Antrim man has said the wait to see a consultant is controlling his life and he is in limbo.\nTerry Cannon, 62, from Kells outside Ballymena, is waiting for a diagnosis for a stomach problem after experiencing internal bleeding.\nHis GP is trying to treat and manage his symptoms without a diagnosis.\nFigures from the Department of Health (DoH) show more than 440,000 people in Northern Ireland were waiting for a first consultant-led outpatient appointment across four of its trust areas on 31 December 2024.\nMr Cannon said after paying taxes and national insurance, it made him \"extremely angry\" that he is not \"getting any benefit\" out of the NHS.\nThe chair of the Northern Ireland General Practitioners Committee said the impact on patients being on waiting lists is \"absolutely devastating\" and their conditions deteriorate as they wait.\nFigures for the Northern Trust have not been included as the trust went live with encompass in November 2024.\nMore than half of patients have been waiting for more than a year for a first consultant-led outpatient appointment.\nThe draft waiting times target states that no patient should wait longer than 52 weeks.\nSpecialists with the longest waiting times include ears, nose, and throat (ENT), gynaecology, orthopaedics, and ophthalmology.\nMr Cannon said he postponed having cataract surgery as his symptoms are so unpredictable, he does not like leaving his house.\nHe was referred to a consultant by his GP in October.\n\"People don't understand that, when you're in a situation where you're actually losing blood, my first thought was cancer,\" he said.\nWhile waiting for the appointment, Mr Cannon said the pain started and increased \"to the stage where, on a scale from nought to 10, I was having spasms at level eight\".\nMr Cannon went for a colonoscopy, external and, while he was told he did not have cancer, did not get a diagnosis.\nHe was referred to another consultant and another waiting list.\nThis time it was gastroenterology.\nHe said he \"maybe naively\" assumed he was in the process of being treated, and there would be follow-up appointments over the course of weeks.\n\"I'm now on a new list, and this list, although it's supposedly urgent, is longer than the first,\" he said.\nMr Cannon said he was \"angry\" and \"disappointed\" in the current situation.\n\"The way the system works is, you initially see your GP, who passes you to the consultant and you are now in the care of the consultant\".\nHowever, because he has not yet had a first appointment with the gastroenterology consultant and is not yet in their care he feels \"in limbo\".\nMr Cannon's GP has given him medication to \"treat the symptoms, not the actual cause, because the cause can only be determined once I get the second procedure done\".\nHe is on high-strength steroids but said he cannot stay on them long term.\n\"It makes me extremely angry,\" he said.\n\"I paid my taxes, I paid my national insurance, and I haven't been to the doctor prior to this for maybe 10 years.\n\"Now I do need that help, and all that money that I invested in the National Health Service, I'm not getting any benefit out of it.\"\nHe said he felt he and hundreds of other people were just \"names on lists\".\nDr Allen McCullough is Mr Cannon's GP in Antrim health centre and family practice.\nDr McCullough has been qualified for 35 years and said managing patients on waiting lists has become more of an issue in the past five to 10 years.\nHe said a good portion of his working day is taken up with patients who have long-term conditions that need investigation and treatment.\nDr McCullough said he accepted that all services were under pressure, and \"what we're trying to do is meet an unmet need with a limited resource and we need to make best use of what is available for these patients\".\n\"Our generic point is we want to get the right person seen by the right person at the right time,\" he told BBC News NI.\n\"There's nothing worse than knowing what you suspect a condition would be and there's treatment that can be available but will take one to two years to access when you know you can improve their quality of life now,\" he said.\nDr Frances O'Hagan, chair of Northern Ireland General Practitioners Committee, said patients' conditions deteriorate while they wait.\n\"They're on the list for joint replacement, for example, and they're in pain. Their pain is getting worse. The mobility is decreasing. They're possibly no longer able to work and on increasing doses of painkillers\".\n\"It's not just months, it's years. The patient journey is just so terrible.\"\nDr O'Hagan said the earlier someone is diagnosed and the quicker the intervention, the better the outcome, but thousands of people on waiting lists impact general practice as well as patients.\nShe said fixing waiting lists would fix many \"problems in secondary care and in primary care.", "url": "https://www.bbc.co.uk/news/articles/cj4n887wj9ko"}