{"authors": ["Annabel Rackham", "www.facebook.com"], "date_download": "2025-04-26 06:54:27", "date_modify": "2025-04-26 06:54:27", "date_publish": "2025-02-28 15:59:55", "description": "Some fans aren't happy with the characters' updated appearance, 15 years on from the last Shrek film.", "filename": "news_articles_cgkmmkyrl0vo_1745650467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/be25/live/1f11b220-f5d4-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmmkyrl0vo_1745650467.html", "title": "Has Shrek had a face lift? Trailer for new film divides fans", "title_page": "Has Shrek had a face lift? Trailer for new film divides fans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The long-awaited first trailer for the new Shrek 5 film has been criticised by some film fans over the way characters have been animated, giving them different facial features.\nIn the 27-second clip, external, recurring characters Shrek, Donkey, Pinocchio and Princess Fiona appear alongside Felicia - one of Shrek and Fiona's now grown-up children.\nThe short teaser announces that Zendaya is joining the cast as Felicia, whilst also reintroducing Mike Myers, Cameron Diaz and Eddie Murphy who are all reprising their roles.\nOli Hyatt, who runs Blue Zoo Animation, told the BBC there's often \"an instant reaction\" when changes are made to a film like Shrek, due to its \"nostalgic properties\".\nSome users on social media have described the changes as \"disrespectful to the original art style\", external and \"an AI interpretation of what Shrek 5 could look like\", external.\nOthers have compared it to the film animation of video game character Sonic the Hedgehog, which Paramount Pictures changed after fan backlash in 2019.\nHyatt added: \"The generation of children that watched Shrek back [when it was first released in 2001] are now adults.\n\"There's usually a feeling of 'this isn't what I knew' or 'I want the old show I remember back'\", he says.\nHyatt, whose team contributed to The Adventures of Paddington and Lego City - No Limits, said that \"because the trailer is so short it's hard to tell how its going to look in general\".\nBut, he added: \"You can see from a technical perspective, the advancement in technology.\n\"That means that on a similar or lower budget, you can producer a higher sheen and render quality, so it doesn't look quite as CGI (computer-generated imagery) and feels more tangible and real\".\nHe doesn't feel like much has changed from the original \"art style\" of Shrek, but says \"the colours, vibrancy and realism\" have changed, which is a symptom of animation technology improving.\nIn the short trailer, Shrek (Mike Myers), Princess Fiona (Cameron Diaz), Donkey (Eddie Murphy) and Felicia (Zendaya) gather round a magic mirror to ask \"Who's the fairest of them all?\".\nThe face in the mirror, which also appears to have had a bit of a makeover, responds that it is Shrek, with images then flashed up on screen of Shrek wearing glasses and posing, then dancing in a skintight catsuit before appearing with rippling abdominal muscles.\nThis pays tribute to some of the internet's favourite Shrek memes, whilst giving viewers a first look at the now grown-up Felicia, who first came to life in Shrek The Third in 2007, alongside her triplet siblings Fergus and Farkle.\nShrek's return was teased at the end of the Puss In Boots sequel in 2022, so fans have been expecting this new film for quite some time.\nIts perhaps why the much-loved film has sparked so much pushback, with fans joking that Shrek looks like he's has had \"botox and a face lift\", external whilst others have criticised the characters for having rounder faces, external.\nBut not everyone has a problem with the new looks - some have praised the animators for ageing the characters with greying hair and wrinkles,, external whilst others say the updated animations are just a symptom of CGI improving., external", "url": "https://www.bbc.co.uk/news/articles/cgkmmkyrl0vo"}