{"authors": ["Sarah Rainsford", "www.facebook.com"], "date_download": "2025-04-26 06:59:31", "date_modify": "2025-04-26 06:59:31", "date_publish": "2025-02-27 05:12:03", "description": "The latest statement suggests that the 88-year-old is able to sit in his chair, eat normally and do what the Vatican calls \"light work\".", "filename": "news_articles_c0l11gr35gwo_1745650771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a7bf/live/18e5e1d0-f4c8-11ef-9c59-bfe78b9ccee3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0l11gr35gwo_1745650771.html", "title": "'In a scary world, he gives us hope': Faithful gather to support the Pope", "title_page": "'In a scary world, he gives us hope': Faithful gather to support the Pope - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Catholics gathered to pray for the health of the Pope beneath the steps of St Peter's Basilica for a third night, as his doctors said his condition showed further slight improvement.\nNuns dangling rosary beads, tourists and student priests were among those who joined the gentle incantation of the rosary in the Vatican.\nThey were led by a cardinal in a scarlet skull cap who prayed for Pope Francis to be able to resume his duties as soon as possible.\nThe nightly gatherings began on Monday after the 88-year-old's health took a dramatic dip at the weekend. He was fighting to breathe and needed blood transfusions.\nBut the latest statements suggest the Pope is able to sit in his chair, is eating normally and even doing what the Vatican calls \"light work\": reading and signing documents.\n\"It was a bit scary last weekend but a bit better now,\" Stacey, a medical student from Paris, told the BBC.\nShe was attending the prayers for the Pope for a second time.\n\"Francis is very popular with young people because he's really open, and in a world that became a little scary, he gives us a lot of hope.\"\nXiomara, from Panama, said she felt drawn to this Pope in particular as he was \"a good man\".\n\"Prayers always help, they don't just hang in the air,\" she believes.\nLeading the rosary from beneath a white canopy was Cardinal Battista Re.\nHe's the figure in the Vatican who would call a conclave - the closed gathering of senior clergy that elects a Pope - if Francis were not able to continue in the role.\nDespite the slight improvement, the Pope's medical team are still giving no prognosis.\nHe was admitted to Gemelli hospital on 14 February with double-pneumonia and, according to the Vatican, a CT scan of his lungs shows a \"normal evolution\" which suggests he is responding to treatment.\nWe're told he still uses additional oxygen but has suffered no further \"respiratory crises\".\nThe tone of Vatican officials has certainly relaxed a little.\nOn Tuesday, the Pope's condition was described as \"stable\", which was new. By Wednesday evening there was a \"further slight improvement\" and the update omitted to say \"critical\" for the first time.\nVatican officials cautioned that didn't mean the Pope was out of the woods.\nBut with so little to go on, those following his condition closely are wringing every word - or missing word - for meaning.\nInevitably, many have also been wondering about the future.\nThe Pope was frail even before this infection, so there has been speculation over whether he might resign.\nThe Quotidiano Nazionale newspaper calls it the \"fluttering of crows\" over St Peter's, inevitable at the \"sunset\" of any Papacy.\nIt's even louder this time since Benedict XVI set a precedent and stepped down in 2013, the first Pope to do so in six centuries.\nFrancis has said before that he would consider resigning if he can't carry out his duties.\n\"His instinct will be to carry on as long as he can and is able to,\" believes Austen Ivereigh, who co-authored a book with Pope Francis.\n\"He's shown he doesn't mind being a weak and frail Pope; he can be a Pope in a wheelchair, or one who gets ill regularly and that's ok.\"\nAll the same, if his health prognosis were too bad, the author said, \"then the [resignation] issue might arise.\"\nEven with Francis confined to the Gemelli hospital, the well-oiled Vatican cogs continue to turn. The bureaucracy functions and the Pope has been signing some documents.\nOn Monday, his secretary of state and another senior official visited.\nOfficially, the Pope signed papers, moving a list of candidates further along the path towards sainthood.\nBut some question why they couldn't wait, given the frailty of the Pope, and wonder what other plans were discussed at that meeting.\nAs Francis enters his 14th day in hospital, pilgrims to Rome are already experiencing life without him. His weekly audience, or meeting, with the faithful was cancelled for the second week.\n\"We really want him to get better and continue the amazing work he's started,\" said Mabi.\nShe mentions the foregrounding of women in the church in particular.\n\"He's a people's Pope and people want his work to continue.\"\n\"We're sorry, because we hoped to meet the Pope today at an audience – we had tickets,\" Fr Cristiano said.\nAround him almost 100 Catholics from northern Italy were gathering to begin processing up the street towards St Peter's behind a large wooden crucifix.\n\"I'm not disappointed, I'm just worried for him,\" the priest said. \"Today the news is not so bad, but it's not so good, either. So we need to pray.\"", "url": "https://www.bbc.co.uk/news/articles/c0l11gr35gwo"}