{"authors": ["Federica Bedendo", "www.facebook.com"], "date_download": "2025-04-26 06:52:53", "date_modify": "2025-04-26 06:52:53", "date_publish": "2025-02-28 16:57:06", "description": "The Cumberland Infirmary intensive care consultant says he spent sleepless nights thinking about it.", "filename": "news_articles_c871179g333o_1745650373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5f7a/live/90354fa0-f5ea-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c871179g333o_1745650373.html", "title": "Doctor 'devastated' by error in care of Workington woman", "title_page": "Doctor 'devastated' by error in care of Workington woman - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A doctor has told the family of a woman who died in hospital he was \"devastated\" by an error he made while caring for her.\nJulie Penrice died at the Cumberland Infirmary in Carlisle, Cumbria, last February after she suffered a bleed to her intestine and a cardiac arrest.\nA coroner heard Miss Penrice suffered a ruptured diaphragm while she was in hospital and while the initial damage was likely to have happened \"spontaneously\", further damage was caused while inserting a tube into her chest.\nThis did not cause Miss Penrice's death, the coroner said, instead she died of natural causes due to the damage caused to her body by her chronic alcohol use.\nMiss Penrice had been to see her GP on 8 February 2024 complaining of a swollen abdomen and was advised to go to A&E at the West Cumberland Hospital in Whitehaven.\nConsultants there decided there was a risk she might have an intestinal bleed and decided to transfer her to the Cumberland Infirmary the following day, where she could have an emergency endoscopy, an examination where a camera is inserted in the body.\nBefore the examination could be performed on her the day after, Miss Penrice collapsed in the toilet and went into cardiac arrest.\nThis could have been caused by arrhythmia or a spontaneous rupture of the diaphragm, both likely in patients with liver damage.\nA post-mortem revealed she suffered a ruptured diaphragm, but that could have been caused by the pressure of the CPR performed on her, the coroner heard.\nFour rounds of CPR were needed to resuscitate Miss Penrice and once in the theatre, doctors bandaged a number of veins to stop some of the internal bleeding.\nMiss Penrice was taken to intensive care where Dr Oranmore-Brown wanted to insert a tube into her lungs to drain fluid, to help get her oxygen levels back up.\nBut a scan revealed the drainage tube had accidentally been inserted into her diaphragm instead of her lung, causing a second rupture to the diaphragm.\n\"I am devastated by this error, which was my error. I have done hundreds of these [procedures] and it's never happened before in the way it happened in Julie's case.\n\"I'm glad we got a post-mortem to find out how it happened and how we can learn from it,\" he told the inquest.\nDr Oranmore-Brown explained his expectation was that the drainage tube would be \"resting\" on top of the diaphragm, a muscle which is generally quite rigid.\nHowever, in patients with liver failure, the diaphragm becomes \"almost as thin as paper\".\nHe said: \"That's why spontaneous rupture happens, it really wouldn't take much at all to pierce a hole, especially following cardiac arrest.\"\nHe added Miss Penrice's diaphragm was \"like a balloon full of water\" and the tube created a ridge when resting on it, that caused the second rupture.\nThe drain still \"effectively worked as a chest drain\", Dr Oranmore-Brown said, but he told the inquest he spent countless sleepless nights trying to work out how the error had occurred.", "url": "https://www.bbc.co.uk/news/articles/c871179g333o"}