{"authors": ["Stuart Maisner", "www.facebook.com"], "date_download": "2025-04-26 07:52:49", "date_modify": "2025-04-26 07:52:49", "date_publish": "2025-02-25 14:33:03", "description": "Stephen Ireland, who founded Pride in Surrey, faces 35 charges while David Sutton is accused of 20.", "filename": "news_articles_c62zqqd32lyo_1745653969.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9745/live/09792700-f376-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zqqd32lyo_1745653969.html", "title": "Messages about children a 'fantasy', jury told", "title_page": "Surrey: Messages about children a 'fantasy', jury told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The founder of an LGBTQ+ group said his alleged conversations about kidnapping and sexually assaulting children were \"fantasy\" and \"taboo\", a trial has heard.\nStephen Ireland, 40, who co-founded Pride in Surrey in 2018, and David Sutton, 27, a volunteer with the organisation, are accused of \"targeting children for their sexual proclivities\" between 2022 and 2024, prosecutors say.\nThey are charged with a total of 38 offences between them, including conspiring to sexually assault children, arranging the commission of child sex offences and kidnap - all of which they have denied.\nMr Ireland, who gave talks in schools, told Guildford Crown Court on Tuesday that there were \"no actual plans to do anything\".\nThe defendant said: \"Me and [Mr Sutton] were smoking too much and your thoughts run away with a fantasy taboo chat.\"\nAlex Krikler, defending Mr Ireland, asked about WhatsApp messages from 2022, during which the pair allegedly spoke of \"snatching\" or \"kidnapping\" a child.\nProsecutor Isabel Delamere previously said the conversations were beyond fantasy and jurors were told that the pair discussed targeting children outside school gates while pretending to be a talent coach or music manager and how to avoid CCTV.\nMr Ireland said: \"It's a fake taboo chat between David and I.\"\nHe told jurors that he visited schools to give talks about the LGBTQ+ community in a \"professional\" capacity with staff present and that he had no intention of doing anything unlawful.\nMr Ireland also spoke of his \"regret\" over messaging about sexually abusing two children, including a girl aged six, saying they were \"stupid conversations\" and that nothing happened.\nHe is solely charged with 21 of the 38 offences, including one count of raping a child, three counts of causing a child under 13 to engage in sexual activity, and one count of sexual assault on a child.\nThe defendants are jointly charged with 13 offences, including six counts of conspiracy to sexually assault a child, three counts of arranging the commission of a child sex offence and one count of conspiracy to kidnap a child.\nMr Sutton is also charged with another four offences, including three counts of making indecent photographs of children.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/c62zqqd32lyo"}