{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:50:15", "date_modify": "2025-05-21 05:50:15", "date_publish": "2025-04-02 00:00:00", "description": "The chancellor answers questions from MPs a day after a series of household bills went up.", "filename": "news_live_c1eg8q81z90t_1747806615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c23/live/6ab674a0-0fcd-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1eg8q81z90t_1747806615.html", "title": "Reeves defends handling of economy and says tax rises were needed for 'stability'", "title_page": "Reeves defends handling of economy and says tax rises were needed for 'stability' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tariffs and economic prospects dominate political agenda\nAdam Durbin\nLive reporter\nIt's been a busy afternoon in Westminster, as Wednesdays so often prove to be, with a lively PMQs session and a lengthy hearing for the chancellor.\nTwo major themes emerged for today's political news cycle, the state of the economy and the looming prospect of a full-blown global trade war with the US.\nKeir Starmer and Kemi Badenoch clashed over the \"fragile\" economy, with the Tory leader pressing the prime minister on revised down forecasts for growth and living standards.\nThe PM hit back by citing the previous Conservative government's handling of the economy, accusing Badenoch of making up a \"fantasy figure\" of families being £3,500 worse off under his government.\nOn tariffs, Starmer reiterated the government's position that they would not reflexively respond to Donald Trump plans to introduce more import taxes.\nRachel Reeves echoed that later in the afternoon when she faced questioning at the Treasury Select Committee, saying that the UK would wait to see how other nations would answer tariffs - stressing the government would not rush into anything and risk jeopardising a possible future US-UK trade deal.\nFollow live all the lead-up and fallout of Trump's tariff announcement tonight\nUK won't retaliate to US tariffs, Reeves indicates\nDharshini David\nDeputy economics editor\nChancellor Rachel Reeves acknowledges that tariffs President Trump imposes can be damaging to UK growth, inflation - even if they're not imposed on British goods. But she again steers away from the idea the UK will retaliate, saying that the government - and businesses it's consulted - don't want to risk undermining the ongoing talks on an economic agreement with the US.\nIn the hearing at the Treasury Select Committee, Reeves reiterated that she believes in free and fair trade and pointed out that trade in goods between the two nations is broadly balanced.\nShe repeated that discussions are ongoing in the \"rapid dialogue\" the US had agreed to have with the UK following the PM's visit to Washington.\nWhile there had been discussions with other nations, including the EU, about \"an appropriate response\", she said that the government had been \"clear that we'll approach this in a clear headed way\".\nThe government and businesses she'd consulted with have agreed it would be counterproductive to undermine work on an economic agreement with a (tariff) response that might amount to \"posturing\"\nReeves said that both growth and inflation could be damaged even if the UK were not subject to tariffs, due to impacts elsewhere - but economists stress the implications are very uncertain.\nFiscal headroom could be impacted by tariffs, Reeves admits\nBack to Committee Chair Meg Hillier now, who observes that there is a risk that Rachel Reeves' Spring Statement forecasts - and the headroom she has cleared - will be made redundant when Trump's new charges are revealed later tonight\nThe chancellor responds somewhat indignantly that the government is \"not passive, waiting for things to happen\", and points out that Labour has made moves to grow the economy, for instance by introducing a planning and infrastructure bill.\nAs a result, Reeves says she accepts that there are risks headroom might be impacted by tariffs, but stresses that the government is focused on \"growing the economy\".\nUK to see how others respond to US tariffs first, Reeves says\nGlen presses Reeves of the looming possibility of a trade war, asking: \"How will you respond to tariffs?\"\nThe chancellor replies saying \"first let's see how other countries and trading blocs respond\", adding that the UK will approach possible US tariffs in a \"clear headed way\".\nThe \"prize on offer is an economic agreement\" with the US and the government doesn't want to \"get ahead of ourselves\", Reeves says, noting the key is to avoid \"posturing\" and rushing into decisions for a \"quick headline\".\nShe adds that depressed demand and rising inflation overseas from tariffs hitting other nations still impacts the UK, even if the government secures an agreement with the Trump administration.\nReeves concludes that she understands US concerns over global imbalances in trade, but makes the case that the UK has a \"balanced\" trading relationship with Washington and so increasing tariffs on the UK would \"not be the right policy\" from Trump.\nConcerns Trump's tariffs will change OBR's forecast\nSticking with the hot topic of tariffs, Conservative MP John Glen says the committee is concerned that the OBR world economy forecast does not take them into account.\n\"You said you would not be coming back with more tax increases,\" he says, asking Reeves if she can confirm this.\nLast year's Budget was a once in a parliament event, Reeves responds, to wipe the slate clean after the \"economic mismanagement\" of the previous government.\nShe says it would not be responsible to write another four years' worth of Budget, and reassures the committee that the government has \"put public finances on a firm footing\".\nUK in 'rapid dialogue' with US ahead of tariff announcement\nTalk moves onto Trump's tariffs - we're covering what to expect when those new charges on imports to the US are announced later today on another live page.\nFacing the Treasury Committee, Reeves is asked how effective she thinks she's been in negotiating to try and avoid harmful tariffs on the UK.\nThe chancellor responds that talks are ongoing with the US and adds that she believes in \"free trade\".\nShe then mentions \"ongoing\" work on an economic agreement with the US, with the two parties in \"rapid dialogue\".\nDoes Reeves regret raising National Insurance contributions?\nCommittee chair and Labour MP Meg Hillier asks Reeves about the decision last October to raise National Insurance (NI) contributions.\nSome companies have paused investment and recruitment because of this, Hillier says, and asks Reeves if she has any regrets about her decision.\nReeves says they had to take the decision to raise NI to ensure the stability of public finances. Some small business are excluded from the rise, she adds.\nHiller asks what metrics Reeves is looking at to ensure the small businesses are successful? Reeves lists a few of them and then claims wages are rising twice the rate of inflation.\nMore spent on debt payments than MoD, MoJ and Home Office combined\nBaldwin continues, asking Reeves about the \"deterioration\" in the economic forecasts and the reaction of the markets to the borrowing announcements in the Spring Statement.\nThe chancellor says the cost of government borrowing has \"moved in line with our European peers\" - citing similar costs to the French and German governments.\nWhen she took over the Treasury, national debt under the previous Conservative government was \"twice as high\" as when Labour was last in power in 2010, which means the UK is spending £105 billion pounds on debt interest payments, she says.\n\"That's more than we spend on defence, the Home Office and the Ministry of Justice combined,\" Reeves says.\nShe says that is why it is \"absolutely essential\" that the government has \"returned fiscal stability\" to the economy and beginning to bring down debt as a share of GDP, adding that she would rather spend money on the \"British people's priorities\" than on servicing government debt.\nReeves: There are costs for every policy, but also for irresponsibility\nConservative MP Harriett Baldwin says that in the space of five months, the Office for Budget Responsibility (OBR) forecast has worsened in many areas, including inflation, borrowing, and unemployment figures.\nReferencing \"Awful April\", as we heard from Badenoch during PMQs and noting that bills are set to rise and tariffs are expected tonight, she puts it to Reeves that business and consumer confidence took a \"real hit\" after the October Budget,\nReeves goes on the defence, saying the International Monetary Fund has been supportive of her measures, and that the Organisation for Economic Co-operation and Development (OECD) has downgraded a range of countries in the G7.\nShe also notes that the OBR has upgraded its growth forecasts for the next four years.\nBaldwin presses Reeves again on whether or not she accepts that business and consumer confidence has deteriorated, to which Reeves responds that there are costs for every policy, but also for irresponsibility.\nShe argues that she has brought stability back to the economy and that the government has put extra investment into the NHS by increasing national insurance contributions. She says this was the right priority.\nWhy is the government targeting both growth and living standards?\nReeves is asked about two milestones announced by the prime minister – higher growth and higher living standards in every region.\nWhy is it important to have those twin objectives, Labour MP Yuan Yang asks.\nReeves says economic growth is crucial for keeping the country competitive, for improving living standards and providing the money to fund public services.\nShe points to government plans to build more homes every year - she says the public tells her are desperately needed, but says that it also directly contributes to the public purse through an increase in tax revenue because the economy will be bigger.\nThe government also needs to measure household disposable income because that is what impacts whether the general public feels \"better off\", she says.\nChancellor: 'Absolutely crucial' to increase growth outside London\nLabour MP Dr Jeevun Sandher focuses on Reeves's growth targets, asking her how important it is to increase productivity outside London - which he says is 26% higher than the national average.\nReeves says it's \"absolutely crucial\". She says achieving strong economic growth is not just about lines on a graph but about the money in people's pockets.\n\"We want to see economic growth and the benefits it brings felt in all parts of the country,\" she says, adding that the government announced investment in projects around the country at last year's Budget.\nReeves also speaks of yesterday's announcement to increase the national minimum wage and living wage, which she says will give a pay rise to 3 million working people, the majority of which are outside London.\nShe adds that there is work happening towards increasing the number of well paid jobs outside of the capital.\nPolitical debate over increase in wages and National Insurance\nKevin Peachey\nCost of living correspondent\nThe government has said the rise in wages, as well as a freeze on fuel duty and other policies, were giving workers more money in their pockets.\nAs of 1 April, the National Living Wage went up from £11.44 an hour to £12.21, external.\nHowever, the Conservatives said that benefit will be \"wiped out\" by the increase to employers' national insurance contributions, while the Liberal Democrats said they were \"very disappointed\" with Labour's approach on the economy so far.\nReform UK has previously said it would impose taxes on the renewable energy sector, blaming net-zero for higher energy bills. The Green Party said it would introduce a wealth tax.\nRead more about the April increase to household bills\nWelfare, growth and defence: A reminder of the Spring Statement\nThere were many economic announcements made last week, including sweeping changes to the benefits system, a boost in defence spending and planned cuts to civil service jobs.\nSome of the most significant changes are over the welfare system, with cuts to cause some people lose support from next year, although universal credit payments are set to rise from next April.\nAmong the sweeping reforms are a cut to health-related universal credit for new claimants and a freeze in many existing payments.\nThe statement also included some less-than-stellar economic forecasts, with experts predicating a fall in growth to 1% expected for this year - although these have been slightly revised up for the next four years. There is also an anticipated rise in inflation to 3.2% for this year, before reducing to the government's 2% target by 2027.\nCuts to public services are also expected, including a target to reduce the administrative costs of government departments by 15% by 2030 and about 10,000 civil service jobs are expected to go.\nHow will the Spring Statement affect you?\nChancellor facing grilling over economy and Spring Statement\nThe next moment in today's political news cycle is coming up shortly, when Rachel Reeves will be quizzed by MPs at the Treasury Select Committee.\nIn the session, due to start at 14:30, the chancellor will likely face questions on the state of the UK economy, public services and government finances in the wake of her spelling out her economic plans at the Spring Statement last week.\nThe committee is chaired by Labour MP Dame Meg Hillier, with the remaining 10 MPs on it made up of six more Labour backbenchers, two Conservatives and two Liberal Democrats.\nWe'll be covering all the key moments from Reeves's appearance here, and you will be able to stream her appearance by hitting watch live at the top of this page.", "url": "https://www.bbc.com/news/live/c1eg8q81z90t"}