{"authors": ["Riyah Collins", "www.facebook.com"], "date_download": "2025-04-26 06:51:52", "date_modify": "2025-04-26 06:51:52", "date_publish": "2025-02-28 17:32:04", "description": "US police say a rapper's \"cowardly\" actions in a \"rival gang stronghold\" led to a spate of violence.", "filename": "news_articles_ce9882yv2nyo_1745650312.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/753b/live/88309ea0-f4f4-11ef-ab77-6b27a1316238.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce9882yv2nyo_1745650312.html", "title": "Lil Baby blasts 'nonsense' link between music video and killings", "title_page": "Lil Baby blasts 'nonsense' link between music video and killings - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rapper Lil Baby has described a link made between one of his music videos and the killing of two teenagers in the US as \"nonsense\".\nJakody Davis and Lamon Freeman died following a gang-related shootout at Lamon's 13th birthday party in Atlanta, Georgia, last summer.\nAnd while city detectives did not name Lil Baby, real name Dominique Armani Jones, they said the boys had been innocent victims of a flare up of gang violence sparked by a \"cowardly rapper\" filming a video in rival territory.\nIn a statement via lawyers, Lil Baby, who spent weeks in the UK charts for Band4Band with Central Cee, said he had \"absolutely no involvement\" and branded the comments from police \"shameful\".\nAddressing reporters, Maj Ralph Woolfolk said \"the overall theme of this case is grown men playing gangster that left two of our children in graves and our communities in fear\".\n\"Lamon Freeman was allowed to be a teenager for 27 minutes before gang violence ultimately took his life, gang violence that was orchestrated by adults and cowardly acts of an Atlanta-based rapper.\"\nThe rapper, he said, \"decided to go over into a rival gang stronghold and shoot a music video in a place that he knew he should not have been.\n\"And in the subsequent days, we saw homicides and shootings and ultimately the deaths of two children as a result of his cowardly actions.\"\nIn the months before Lamon and Jakody were shot, Atlanta police said they responded to several people being shot during a video shoot., external\nNobody was killed but three men in their 20s were injured in the attack in the north west of the city on 14 May which was widely reported to have taken place on set for one of Lil Baby's videos.\nLil Baby's statement said it was \"disgraceful\" for the officer \"to say that he couldn't shoot a music video in his home town\".\n\"The location for a major music video shoot is a decision made by a professional team and is not a decision made by any individual.\"", "url": "https://www.bbc.co.uk/news/articles/ce9882yv2nyo"}