{"authors": ["Ed Barnes", "www.facebook.com"], "date_download": "2025-04-26 07:05:55", "date_modify": "2025-04-26 07:05:55", "date_publish": "2025-02-28 06:20:16", "description": "Waves spilled over West Kirby's sea wall during a storm but the council says it \"worked as intended\".", "filename": "news_articles_c4g77z3d3eyo_1745651155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7553/live/19e69ca0-f54f-11ef-bf48-f1af4855b062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g77z3d3eyo_1745651155.html", "title": "£20m flood wall 'was effective' in storm - report", "title_page": "Criticised £20m flood wall 'was effective' in storm - report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Flood defences which cost £20m and were criticised after homes and a businesses were deluged in a storm on Merseyside \"worked as intended\" and \"limited the damage\", a review has found.\nWaves spilled over the West Kirby sea wall during Storm Pierrick on 9 April last year.\nIt resulted in staff at Tanskeys Bistro being evacuated by the RNLI, damage to some properties and cars and people being trapped inside their homes.\nThere were calls for a \"full and frank investigation\" into the effectiveness of the defences, but a review carried out by Wirral Council and the Environment Agency said that the \"overtopping was not unexpected\" and the wall had broken \"the energy of the waves\".\nThe seafront defences were completed in 2023 and Liberal Democrat councillor Stuart Kelly claimed the wall had failed \"so spectacularly\" during the storm.\nBut the review said it was clear the storm was \"a significant event which resulted in extreme sea levels\" and \"extreme wave heights\" which data suggests \"likely met the limit of or exceeded the design standard for the new flood wall at West Kirby\", the Local Democracy Reporting Service reported.\nIt said the three homes flooded were at a location where the flooding was deepest and would have benefited from property level protection like some of their neighbours.\nHowever no flood warning was issued for West Kirby with the council report adding: \"Public expectations that the wall would prevent all flooding may have been a factor in not utilising property level protection.\"\nThe report said: \"The overtopping that occurred as a result of the conditions on the day is therefore not unexpected.\n\"The new defences, however, limited the damage that would have otherwise occurred had they not been built.\n\"The new flood wall worked as intended in breaking the energy of the waves and retaining an extreme mean sea level on the seaward side of the wall.\"", "url": "https://www.bbc.co.uk/news/articles/c4g77z3d3eyo"}