{"authors": ["Anthony Reuben", "www.facebook.com"], "date_download": "2025-05-19 15:38:11", "date_modify": "2025-05-19 15:38:11", "date_publish": "2015-02-05 02:01:40", "description": "Disposable income is rising towards pre-crisis levels.", "filename": "news_business-31136141_1747669091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80784000/jpg/_80784632_happy_thinkstock.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31136141_1747669091.html", "title": "Headline numbers: Are you feeling better yet?", "title_page": "Headline numbers: Are you feeling better yet? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yesterday's Green Budget, external from the Institute for Fiscal Studies was, on the whole, a depressing affair, with much talk of the need for increased taxes and reduced public spending if targets are to be met.\nThere was, as IFS director Paul Johnson warned, little reason to \"rejoice with gladness evermore\", despite that quote being embossed in big, gold letters on the ceiling at the launch event.\nSo it was a surprise to hear a prediction from Oxford Economics, which carried out some of the economic research, that the average person would have an extra £417 to spend in 2015, with a disposable income of £18,106.\nThe figure comes from its Spending Power Index, external. The index is based on the incomes after tax of three groups: the median wage earner (that's the one who would be in the middle if you ranked all the wage earners in the country), someone claiming jobseekers' allowance and the incomes of pensioners, from both state and private pensions.\nThe figure is then adjusted to take account of inflation and the average income from housing benefit and child benefit.\nYou can see on the graph above that spending power took a dive in 2009 and is only just starting to recover some of the losses made.\n\"It's a sign that we're finally righting the wrongs of the last six years and getting back to where we started,\" Andrew Goodwin from Oxford Economics tells BBC News.\nThe factors boosting spending power include the lower rate of inflation, especially lower fuel prices recently, increases in the income tax personal allowance and some signs of rising wages as unemployment falls.\nBefore you start popping Champagne corks, the level of disposable income has still not recovered to its 2009 peak and Oxford Economics does not expect it to do so until late 2016.\nBut the improvement is important, because so far the recovery has not been making everyone feel better.\nThe pollsters Populus, external asked 18,000 people about the economy in their local areas last October. They found that 29% of people had not noticed any economic recovery in their areas while 57% said there probably was a recovery in their area but they had not felt it personally.\nPerhaps recovering spending power will make people feel better, which could be good news for the government as the election approaches, but not necessarily.\nAndrew Goodwin says, \"Our research indicates that even though people may be feeling better financially, it doesn't always feed into greater support for the incumbent government.\"", "url": "https://www.bbc.com/news/business-31136141"}