{"authors": ["Jamie Waller", "www.facebook.com"], "date_download": "2025-04-26 06:48:30", "date_modify": "2025-04-26 06:48:30", "date_publish": "2025-03-01 11:16:07", "description": "An independent panel is recommending the salary for the new Greater Lincolnshire mayor.", "filename": "news_articles_c1ennxx72qgo_1745650110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9fb7/live/687f1900-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1ennxx72qgo_1745650110.html", "title": "Greater Lincolnshire mayor could earn £80,060 per year, says report", "title_page": "Greater Lincolnshire mayor could earn £80,060 per year, says report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The first mayor for Greater Lincolnshire could earn £80,060 per year, states a report.\nAn Independent Remuneration Panel has set the wage after looking at the average rate for the role across England.\nIn September 2024, North East Lincolnshire, North Lincolnshire and Lincolnshire County Council voiced their commitment for the new Greater Lincolnshire Combined County Authority (GLCCA).\nThe GLCCA will hold its first meeting next week at Lincoln Cathedral between leaders of the councils which will form it.\nAuthors of a report detailing reasons for the proposed salary said it would \"be arguably the most high-profile political position of the region\".\nThey also referenced the geographical size of the GLCCA, \"with a mix of rural and urban areas adding complexity\", according to the Local Democracy Reporting Service.\nThe new mayor should also have the option of creating a deputy mayor position, with an annual salary to be 20% of the mayor's, capped at £17,212, the panel recommended.\nOn 1 May, voters will choose an elected mayor to head the combined authority of Greater Lincolnshire, which will have an annual budget of £24m.", "url": "https://www.bbc.co.uk/news/articles/c1ennxx72qgo"}