{"authors": ["Stuart Pollitt & Gemma Sherlock", "www.facebook.com"], "date_download": "2025-04-26 06:35:39", "date_modify": "2025-04-26 06:35:39", "date_publish": "2025-02-27 06:13:44", "description": "A popular youth zone tells of its struggles with rising costs as a rebuild project stalls.", "filename": "news_articles_c93n8jvyjgxo_1745649339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4fce/live/7147d6d0-f388-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93n8jvyjgxo_1745649339.html", "title": "Liverpool Bronte: 'We cannot let dream youth zone close to the kids'", "title_page": "Liverpool Bronte: 'We cannot let dream youth zone close to the kids' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A youth hub which has been a haven for Merseyside children for 60 years will not be able to fully reopen if extra funds are not secured, trustees have said.\nThe Bronte youth and community centre opened in Liverpool in the 1960s with an aim to give children a safe space to learn and have fun.\nLast year it was given £3.4m to renovate the building off Brownlow Hill but a rise in costs means the centre needs another £750,000 to complete the project.\nTrustee Tony Clarke, who has had five generations of his family go to the youth centre, said: \"If we don't raise the extra money, we are not going to be able to open that often.\"\nShane, 11, said: \"I couldn't tell you how excited I am for the new Bronte to come because it means a thousand more memories are going to be made and kept in our hearts.\n\"I feel like The Bronte is part of my family, it's my second home\".\nThe Bronte has launched a fundraising campaign in an attempt to raise the extra money it needs to complete the renovation.\nThe centre's \"Big Build\" fundraiser has so far raised £4,850 of the £750,000 needed but Laura Cain, centre manager, said it has been a \"struggle\".\nShe said: \"We have had to offer a limited youth service but we've just been glad to keep it going, we didn't want to close it down completely.\n\"There needs to be a safe space for children to come. We all know the rise in knife crime and it's good just getting young people off the streets and involved in positive activities.\"", "url": "https://www.bbc.co.uk/news/articles/c93n8jvyjgxo"}