{"authors": ["Natasha Booty", "www.facebook.com"], "date_download": "2025-04-26 03:47:25", "date_modify": "2025-04-26 03:47:25", "date_publish": "2025-03-04 19:02:21", "description": "Around 40 diplomats, politicians, and journalists are accused of conspiring against state security.", "filename": "news_articles_cn4y114x92vo_1745639245.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/79a6/live/e122f910-f920-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4y114x92vo_1745639245.html", "title": "Mass trial begins of Tunisian president's opponents", "title_page": "Mass trial begins of Tunisian president's opponents - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A mass trial of around 40 prominent opposition figures began in Tunisia on Tuesday, in a case that lawyers, relatives and rights groups say is politically motivated.\nDiplomats, politicians, lawyers, and journalists who are critical of President Ka誰s Sa誰ed are among the defendants.\nThey could face the death penalty if found guilty of charges which include \"plotting against state security\" and \"belonging to a terrorist group\".\nHuman Rights Watch has labelled it a \"mockery of a trial\" based on \"abusive charges\", while the UN recently urged Tunisian authorities to end \"all forms of persecution of political opponents\".\nThe country's foreign ministry said it read the UN's statement, external with \"astonishment\" and criticised what it said were \"inaccuracies\", and added that \"Tunisia can give lessons to those who think they are in a position to make statements\".\nCampaigners say the trial highlights Sa誰ed's authoritarian control over the judiciary, after dissolving parliament in 2021 and ruling by decree.\nSince he was first elected six years ago, the former law professor has rewritten the constitution to enhance his powers.\nAs the trial began on Tuesday, defence lawyers complained that they were not granted access to the full case file.\n\"You can put an end to this madness and absurdity,\" lawyer Abdelaziz Essid told judges in court.\nAmong those on trial are ex-presidential chief of staff Nadia Akacha, the former leader of the Ennahda opposition party Abdelhamid Jelassi and Jaouhar Ben Mbarek, who was a high-profile critic of the president's 2021 power grab.\nSome of the defendants, including Akacha, were tried in absentia having already fled the north African country.\nAmong the defendants are people who were arrested two years ago and detained ever since, with Sa誰ed labelling them \"terrorists\".\n\"It is one of the darkest injustices in Tunisia's history,\" said the head of the Tunisian League for the Defence of Human Rights, Bassam Trifi.\nOutraged Tunisian activists have been demonstrating outside the court in the capital, Tunis.\nAmong the banners they carried was the slogan: \"No to remote trials, No to a judiciary that does not guarantee rights, freedom for political detainees\".\nAdditional reporting by Lipika Pelham", "url": "https://www.bbc.co.uk/news/articles/cn4y114x92vo"}