{"authors": ["Tanya Gupta", "www.facebook.com"], "date_download": "2025-04-26 04:40:29", "date_modify": "2025-04-26 04:40:29", "date_publish": "2025-03-02 07:25:08", "description": "The combined authority says a franchised bus network would improve services for passengers.", "filename": "news_articles_c7988lwv55no_1745642429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/17c3/live/0dc44e00-f512-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7988lwv55no_1745642429.html", "title": "West Midlands consultations on bus franchise move", "title_page": "West Midlands consultations on bus franchise move - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Consultation events on plans to bring West Midlands bus services under public control are being held in Wolverhampton, Stourbridge and Birmingham this month.\nStaff from the West Midlands Combined Authority (WMCA) will be at the events with more information on bus reforms and how to get involved.\nIt follows an assessment of the bus network, which concluded that a franchised bus network would improve services for passengers.\nHundreds of people have replied to the consultation,, external which was launched on 6 January and runs until 30 March.\nThe WMCA currently provides an annual subsidy of about £50m to private operators.\nThe authority said the move to a franchise model would cost £22.5m over three years, the Local Democracy Reporting Service has reported.\nIn-person consultation events, external will be held in Wolverhampton on 8 March, in Stourbridge on 21 March and in Birmingham on 25 March and there will be an online webinar on 13 March.\nA drop-in session was held in Coventry on Friday.\nA TfWM spokesperson said people were \"really keen to find out more and have their say\" on the mayor's plans, including those who spoke to the body at Pool Meadow bus station in the city.\nThey added: \"This is about taking control of fares, timetables and routes to better connect our communities.\"", "url": "https://www.bbc.co.uk/news/articles/c7988lwv55no"}