{"authors": ["Tom Oakley", "www.facebook.com"], "date_download": "2025-04-26 07:31:52", "date_modify": "2025-04-26 07:31:52", "date_publish": "2025-02-27 16:54:09", "description": "A man in his 20s was found dead after police responded to reports of an aggravated burglary.", "filename": "news_articles_c5yxxe2zl1qo_1745652712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b7ae/live/ac710640-f528-11ef-ba6e-5dc164a31f2d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxxe2zl1qo_1745652712.html", "title": "Murder arrests after man dies at scene of burglary", "title_page": "Tuxford: Murder arrests after man dies at scene of burglary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A murder investigation has been launched after a man was found dead at the scene of a reported aggravated burglary.\nNottinghamshire Police said the man was found by detectives who were called to an industrial unit in Lodge Lane, Tuxford, Nottinghamshire, at about 22:40 GMT on Tuesday.\nHe has been formally identified as 22-year-old Taylor Green, the force added.\nA 24-year-old man and 21-year-old woman were arrested on suspicion of murder as part of the investigation.\nOfficers carried out CPR on the victim but he was pronounced dead at the scene.\nDet Insp Clare Gibson, who is leading the inquiry, said there would be an increased police presence in the area following the man's death.\n\"Our thoughts remain with Mr Green's loved ones during what must be an incredibly difficult time for them,\" she said.\n\"We are actively seeking another three males in connection with the aggravated burglary and we have multiple teams and force resources dedicated to this search.\n\"I'd like to reassure the public that we believe this to be an isolated incident and there will be an increased police presence in the area while we continue with our lines of inquiry.\"\nThe force said the victim's family had been informed and were being supported by specially trained officers.", "url": "https://www.bbc.co.uk/news/articles/c5yxxe2zl1qo"}