{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 06:37:04", "date_modify": "2025-04-26 06:37:04", "date_publish": "2025-02-26 06:38:09", "description": "The Griffin Trail will connect to one of the county's most scenic walks, the Brampton Valley Way.", "filename": "news_articles_cd92qqe080zo_1745649424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aa89/live/73e43720-f389-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92qqe080zo_1745649424.html", "title": "New walking trail to open up in the village of Braybrooke", "title_page": "New walking trail to open up in the village of Braybrooke - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A village is preparing to open a £100,000 trail that will connect it to \"one of the area's most scenic walking and cycling routes\".\nThe Griffin Trail around Braybrooke, Northamptonshire, will replace a route that involves negotiating unsafe roads.\nIt will join up with the Brampton Valley Way - a 14-mile (23km) walk along a disused railway.\nBraybrooke Parish Council said the trail was a \"critical step toward building a broader network of safe walking and cycling routes\".\nIn research for the project, 41% of locals were recorded as wanting better footpaths and cycle routes to Market Harborough, which is three miles (5km) away.\nBraybrooke Parish Council said the route of the Griffin Trail was \"designed with a gentle gradient and an all-weather surface\", so it would be usable throughout the year.\nBy diverting an existing footpath, known as GC13, along the edge of a field, a direct connection between the trail and the Brampton Valley Way has been established.\nThe Brampton Valley Way, described by the council as \"one of the area's most scenic routes\", follows the line of the old Northampton to Market Harborough railway for 14 miles (23km).\nIt includes the Kelmarsh Tunnel - a 480m (1575ft) unlit structure - and the 414m (1,358ft) Oxendon Tunnel.", "url": "https://www.bbc.co.uk/news/articles/cd92qqe080zo"}