{"authors": ["Caitlin Parr", "Lucy Vladev", "www.facebook.com"], "date_download": "2025-04-26 06:53:14", "date_modify": "2025-04-26 06:53:14", "date_publish": "2025-02-28 16:37:17", "description": "Neighbours of Ffos-y-Fran say the \"only thing we were getting out of it has been taken away\".", "filename": "news_articles_c5yrr1y6klpo_1745650394.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/32a0/live/733c4b40-f5e2-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yrr1y6klpo_1745650394.html", "title": "Ffos-y-Fran: Mine planning application 'the ultimate betrayal'", "title_page": "Ffos-y-Fran: Mine planning application 'the ultimate betrayal' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Neighbours of the UK's last opencast mine say they have been betrayed by new plans to restore the site.\nFfos-y-Fran's operators Merthyr (South Wales) Ltd were originally granted planning permission in 2011 to restore the 285 hectares of land site above Merthyr Tydfil once they stopped mining for coal.\nBut those plans have been changed and campaigners are now worried the site, which was forced to close in 2023, will be unsafe for the public.\nThe Welsh government said it was working with Merthyr Tydfil council and other regulators to ensure the best possible outcome for local people.\nIf approved, the new application will now see steeper sided slopes by the main site of excavation, with land fenced off to prevent livestock grazing.\nAlyson and Chris Austin, who live on the edge of the site, said the plans would be the \"ultimate betrayal\".\n\"We could see this coming when we sat in the public inquiry in 2004,\" Alison said. \"We thought 'this is never ever going to go back'.\n\"We've suffered the noise, the dust, and the only thing we were going to get out of it has been taken away from us.\"\nThe Ffos-y-Fran site closed in November 2023 after its appeal to extend its operational time was refused by Merthyr Tydfil council.\nA year after the site's permit to mine for coal ran out 115 staff were made redundant.\nThe mine was responsible for 86% of the UK's total coal output before it closed.\nChris said the couple have previously written to the Welsh government to try and encourage them to change the regulations.\n\"We've been making representations to the local authority for years to put in stronger securities to ensure we don't end up in this position,\" he said.\n\"We could see it coming, and we couldn't get the local authority to act on this.\"\n\"They had a second chance to do this in 2015, when the mining company operating there now bought the operation out,\" Chris added.\n\"They didn't take the opportunity to strengthen those guarantees.\"\nUnder new \"low level\" plans yet to be discussed by council planners, one mound or coal tip in the north of the site would be reduced in height, and grass seeded.\nPlanners said sections of exposed rock on the mound would be maintained, to provide \"possible habitats for breeding birds\".\nTwo other mounds or tips would remain largely untouched, with only their lower slopes grass seeded, and trees planted.\nUnder the plans, a natural lake of groundwater formed in the main void would be kept with shallow banks and its surrounding slopes \"re-profiled\" and planted with a mixed woodland.\nThe Coal Action Network has described the plans as a \"proposal to do as little as possible in a final betrayal\" of the restoration promised to Merthyr Tydfil residents.\n\"Merthyr Tydfil residents are understandably concerned by that in light of the recent coal tip slip in Cwmtillery, and the destablising effects of climate change,\" a Coal Action Network spokesperson said.\nThe Welsh government said: \"We are working with Merthyr Tydfil County Borough Council and other regulators as part of a technical working group to ensure the best possible outcome is achieved for local people.\"\nMerthyr Tydfil County Borough Council and the developers Richards, Moorehead and Laing Ltd have been asked to comment.", "url": "https://www.bbc.co.uk/news/articles/c5yrr1y6klpo"}