{"authors": ["Finn Purdy", "www.facebook.com"], "date_download": "2025-04-26 07:38:52", "date_modify": "2025-04-26 07:38:52", "date_publish": "2025-02-27 13:40:50", "description": "The proposal includes replacing the mercury that makes the light rotate and installing an LED alternative.", "filename": "news_articles_c4g031pqv0yo_1745653132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1dac/live/ab29c800-f45e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g031pqv0yo_1745653132.html", "title": "Backlash against proposed lighting changes to historic lighthouse", "title_page": "Backlash against proposed lighting changes to historic lighthouse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dozens of objections have been submitted to a proposed change to the light source at an historic lighthouse at St John's Point in County Down.\nThe proposal includes replacing the mercury that makes the light rotate with a low-energy LED alternative.\nCampaigners fear that altering the mechanism controlling the rotating light could harm the landmark's historic character.\nThe Commissioners of Irish Lights, who operate the lighthouse, said the proposed works would \"ensure that the historic lens continues to provide the same unique flash character of the light, while allowing the removal of mercury\".\nClodagh Hanratty, director of coastal operations for the organisation said that \"the proposals outlined demonstrate a clear commitment to protecting the heritage of St John's Point, while enhancing the lighthouse's reliability and effectiveness as an aid to navigation\".\n\"Extensive research and pilot projects have been undertaken to safeguard the heritage and to plan for future development of the site as a tourism destination,\" she added.\nEileen Peters from the Lecale Lightkeepers said it would be a \"terrific loss of the intangible and industrial heritage if it is changed\".\nShe told the BBC's Good Morning Ulster Programme that the lighthouse currently produces a \"beautiful\" and \"reassuring beam\" that she said an LED \"cannot produce\".\nShe said that the current cost of running the light was 84 pence per night.\n\"I think for a light that has a range of up to 27 miles and is constantly lit at night, that's pretty good value.\"\nShe said that the lens sits in a \"pure form of mercury... [that] does not evaporate easily\".\n\"And it is only the vapours of that sort of mercury that can be dangerous if inhaled for any length of time.\"\nNewry, Mourne and Down District Council has received 66 complaints about a listed planning application from the Commissioners of Irish Lights.", "url": "https://www.bbc.co.uk/news/articles/c4g031pqv0yo"}