{"authors": ["Asha Patel", "www.facebook.com"], "date_download": "2025-04-26 06:42:51", "date_modify": "2025-04-26 06:42:51", "date_publish": "2025-03-02 10:56:23", "description": "Police say officers have arrested a 16-year-old girl and 17-year-old boy.", "filename": "news_articles_cx2reygn0g1o_1745649771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/76ea/live/e0a356a0-f750-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2reygn0g1o_1745649771.html", "title": "Further arrests after stabbing at party near Nottingham Castle", "title_page": "Further arrests after stabbing at party near Nottingham Castle - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police have arrested two more teenagers after a stabbing at a flat party.\nA 17-year-old boy was stabbed in Hounds Gate, near Nottingham Castle, on Friday at 23:43 GMT and remains in hospital with serious injuries.\nA boy, 17, and a 16-year-old girl, who were also injured, have now been arrested on suspicion of affray, Nottinghamshire Police announced on Sunday.\nFive others were previously arrested on Saturday on suspicion of affray - an 18-year-old man and four other 17-year-old boys - and they have since been released on bail with conditions not to enter the city centre.\nThe 16-year-old girl has also been released on bail with the same conditions while the 17-year-old boy who was arrested after being injured at the party remains in custody.\nSupt Kathryn Craner said: \"We now know that a number of those involved are believed to be known to each other, and we continue to work around the clock to establish the circumstances which resulted in the shocking acts of violence.\"\nA large cordon was in place in Hounds Gate and other streets surrounding the castle throughout much of Saturday while inquiries took place at the scene.\nForensic officers were within the walls of the castle and in the street outside the landmark.\nThe closures have since been removed, the force said.", "url": "https://www.bbc.co.uk/news/articles/cx2reygn0g1o"}