{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:37:39", "date_modify": "2025-04-26 07:37:39", "date_publish": "2025-02-27 14:05:01", "description": "A brief meeting between the two leaders took place at Shannon Airport in County Clare.", "filename": "news_articles_c8e774zkeg6o_1745653059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e41/live/02aceaa0-f520-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e774zkeg6o_1745653059.html", "title": "Taoiseach 'committed' to helping Ukraine financially", "title_page": "Micheál Martin: Taoiseach 'committed' to helping Ukraine financially - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Taoiseach (Irish prime minister) Micheál Martin has told the President of Ukraine Volodymyr Zelensky that Ireland is committed to helping his country financially.\nThey met at Shannon Airport in County Clare on Thursday. Martin cancelled a planned visit to Stormont in order to attend the meeting.\nHe told Zelensky that he has to look at \"alternative approaches to give financial aid to Ukraine\".\n\"Our commitments... have been frustrated by Hungary's decision to veto the deployment of the European peace facility fund set up by the European union,\" he explained.\nZelensky is due to meet US President Donald Trump in Washington on Friday to sign an agreement on sharing his country's mineral resources.\nHe made a brief stop at the Irish airport on the way to this meeting.\n\"We discussed issues around a sustainable and durable peace settlement,\" Martin said.\n\"We made it clear that we would push very strongly for an accelerated timeline in terms of Ukrainian membership of the European Union,\" he said.\nHe said Zelensky \"was very thankful... for Ireland's sustained support for the Ukrainian people... as they battle through this terrible war\".\nHe said Ireland could help by taking part in initiatives to help feed children in Ukraine and is looking into supporting financially the use of robotic drones to help bring back soldiers who are injured.", "url": "https://www.bbc.co.uk/news/articles/c8e774zkeg6o"}