{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 06:19:59", "date_modify": "2025-04-26 06:19:59", "date_publish": "2025-03-01 07:00:45", "description": "A Bristol businessman employs the city's recent graduates to fix electronics and prevent e-waste.", "filename": "news_articles_czdnlnm7ge6o_1745648399.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b1c8/live/55f97b90-f388-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czdnlnm7ge6o_1745648399.html", "title": "Bristol graduates helping city fight mounting e-waste", "title_page": "Bristol graduates helping city fight mounting e-waste  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Bristol businessman who employs recent graduates from the city's universities to fix electronics is urging people to think twice before throwing away their broken items in an effort to fight e-waste.\nCasey Sather, 27, fixed his first iPhone as a teenager - bringing the skills he learned from YouTube to the University of Bristol, where he repaired friends' devices in lecture theatres, student halls and pubs.\nMore than a decade later his business, which employs seven people full-time, repairs hundreds of electronic items each month and helps run free repair cafes.\n\"The stuff that people bring in [to get fixed] is amazing,\" he said. \"But the stuff that people throw out is even more amazing.\"\nMr Sather realised there was a need for reliable, affordable technology repairs during his astrophysics degree, where he saw fellow students taken advantage of by repair shops or simply throwing away their broken phones or laptops.\n\"The thing with repair is, it's not that hard,\" he told the BBC. \"You can find the parts online, you can find a YouTube video, and you can get a screwdriver.\"\nWith many students looking for a quick fix on their expensive devices, the word around Mr Sather's interest in repairing broken tech spread fast. Before he had even finished his degree, he was employing fellow students to help.\nAfter graduating, Mr Sather formalised the business into Fix My Crack, setting up two repair shops at the University of Bristol and the University of the West of England, employing students part-time.\n\"The last thing we want to do is charge a student,\" Mr Sather said. \"Some shops will charge you just for cleaning charging ports, and it's ridiculous - we've been collecting all the charging port dust for years into a very gross jar.\n\"So there's a lot of ways we help students, and our goal really is to educate and also reduce the amount of stuff going to e-waste, and if we can do that for free it's all the better.\"\nThe Fix My Crack name flew on campus, with both shops still repairing hundreds of devices each month, but as the business grew the decision was made to rebrand to FixMyTek.\nThe team, made up of seven full-time employees, all of whom have recently graduated from Bristol's universities, still fix phones and laptops, but now also help businesses in the city tackle the mounting e-waste problem.\nThe work investigates \"how businesses handle their e-waste and what their current processes are\", Mr Sather explained.\n\"We've been working with researchers from the university to investigate this, and we do pop-up repair days and donation drives where the company and any employees are able to bring any old tech and learn repair skills.\"", "url": "https://www.bbc.co.uk/news/articles/czdnlnm7ge6o"}