{"authors": ["Caroline Lowbridge", "www.facebook.com"], "date_download": "2025-04-26 06:14:37", "date_modify": "2025-04-26 06:14:37", "date_publish": "2025-03-02 00:44:43", "description": "Drivers say they are being unfairly \"fined\" due to problems with parking payment machines.", "filename": "news_articles_cdeln2ly1z0o_1745648077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ace1/live/58a31dc0-f5b7-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdeln2ly1z0o_1745648077.html", "title": "Drivers taken to court over car park keying errors", "title_page": "Parking fines: Drivers taken to court over car park keying errors - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Drivers have said they are being unfairly penalised due to payment machines that make it difficult - or impossible - to enter car registrations correctly.\nSome car park operators are sending drivers £100 parking charge notices (PCNs) due to what are known as \"keying errors\".\nThe trade associations for private car parks say drivers should not be given PCNs for \"minor\" keying errors, and charges for \"major\" keying errors should be reduced to £20.\nHowever, this is not always happening, and some drivers are being taken to court if they refuse to pay the £100 charges.\nDonna Nash, from Worksop in Nottinghamshire, was ordered to pay Excel Parking £282 after she lost a court case against the car park operator.\nShe had parked in its Newcastle Avenue car park in Worksop, and only entered the first two letters of her registration before paying.\n\"The machine jumped forward and asked me to make payment,\" she said.\n\"I made payment, not aware there was any particular issue. I just thought that was normal for that machine.\"\nExcel Parking argued Mrs Nash had broken the contract she entered into when she used the car park, as the terms and conditions stated she must enter her full vehicle registration mark.\nBut in her witness statement, Mrs Nash claimed the machine had been \"set up to trick motorists into paying too soon\".\nShe provided the judge with photos of tickets bought by other drivers who have had the same problem.\nHowever, District Judge Heppell said he was \"not satisfied there was any fault with the machine\".\nHe ordered Mrs Nash to pay the £100 PCN, plus other costs, totalling £282.\nSpeaking after the hearing on 21 February, Mrs Nash told the BBC: \"I just feel sick to be honest with you.\n\"It's taken a lot of our time. It's just been very stressful and hard.\"\nHer husband, Jonathan Nash, said: \"The machines shouldn't allow for you to only enter two letters because there are no registrations in the UK that haven't got numbers, so as far as we're concerned that's a fault in the machine itself.\"\nExcel Parking told the BBC it \"vehemently\" refutes there is a problem with the payment machines.\nAll of the people who spoke to the BBC told us they paid using machines that required them to enter their vehicle registrations.\nThey then received PCNs through the post asking for £100. While PCNs are sometimes referred to as \"fines\", they are effectively letters demanding money for alleged breach of contract.\nSome people said they had made mistakes when entering their registrations.\nHowever, some insisted they entered their registrations correctly, but the machines had either not printed them in full, or had printed them incorrectly.\nOthers said they started entering their registrations but the machines \"jumped\" to the payment screen as soon as they pressed the first one or two letters.\nOne of the alleged keying error hotspots is Syston Town Square car park in Leicestershire, where more than 100 people have been issued with PCNs.\nPeople affected say they have entered their vehicle registrations in full, but the machine missed off some of the letters and/or numbers.\nTracy Campbell was filmed entering the registration LG19 BRV - but it came up on the machine as LG19 BII.\nPrivate car park operators are meant to follow the sector's Code of Practice, external.\nAccording to the Code of Practice, parking charges should not be pursued where the driver has \"paid the tariff but made a minor keying error when registering their vehicle\".\nThe code says the charge should be reduced to £20 for \"major keying errors\".\nTherefore, if drivers receive a £100 PCN they can appeal to the car park operator with evidence that they bought a ticket, and ask for the charge to be reduced to £20.\nIf the appeal is rejected, they can also appeal to one of two appeals services - POPLA, external or the IAS, external - depending on which trade association the operator belongs to.\nHowever, the BBC has spoken to drivers who appealed but were not offered reduced charges of £20, including Donna Nash.\nWhen drivers do not pay the charges, car park operators often issue court claims against them for alleged breach of contract.\nSome of the drivers then pay, due to fear of being taken to court, but some choose to challenge the charges in court.\nLynda Eagan, who runs a Facebook group, external helping people fight charges, said parking operators often discontinued cases before hearings.\n\"They will commonly cancel it at the last minute,\" she said. \"They let their cases get right up to the point where they have to pay the court fee.\"\nThis was what happened to Richard Degnan, who received a PCN after parking at the Crown Street car park in Leeds, and had appeals rejected by both Excel Parking and the IAS.\nMr Degnan prepared to fight his case in court, but when he arrived, was told the claim had been discontinued.\nHowever, some cases are heard in court, and although Donna Nash lost her case, judges dismiss some.\nThis was what happened when Sietske Sikkema defended herself against Excel Parking at Derby County Court on 31 January.\nShe had accidentally entered her registration incorrectly when using the Copeland Street car park in Derby, because she was rushing.\nThis is the car park where Rosey Hudson was asked to pay £1,906 for taking too long to pay.\nDeputy District Judge Nathan Smith said he accepted Ms Sikkema had made \"an innocent mistake\" when she typed in \"AOV AO14\" instead of \"AO14 AOV\".\nHe said it was \"difficult to see what legitimate reason the claimant [Excel Parking] has for enforcing the term\", adding that the £100 plus £70 they demanded was \"disproportionate to the mistake that was made\".\nAs well as dismissing the claim, he ordered Excel Parking to pay Ms Sikkema's travel expenses for attending court.\nHowever, Ms Sikkema told the BBC that the case had caused her a lot of stress.\n\"It's taken up a lot of time, which is quite frustrating really, knowing that it's such an obvious mistake, so I think it's unfair to people to act like that,\" she said.\nLynda Eagan said keying errors - and subsequent PCNs - could be prevented by installing better payment machines.\n\"They could so easily stop and ask you, 'is that your full registration number? Press the green button'. And that would solve all the problems,\" she said.\nThe RAC believes charges for keying errors should be banned completely.\nHead of policy Simon Williams said: \"The company concerned ought to be able to see if the registration plate of a vehicle entering a car park [captured on an ANPR camera] doesn't match with what they put into the machine, and if it doesn't they ought to be able to flag that up and no parking charge notice should be issued.\"\nIn relation to the problems at Syston Town Square car park, he said: \"The company concerned is turning down all the appeals, absolutely wrongly in our opinion.\n\"We call on Euro Car Parks to overturn these and refund all the money concerned.\"\nThe RAC has been campaigning for the reintroduction of the Private Parking Code of Practice, external, which was withdrawn in 2022 because of legal challenges from the industry.\n\"There's a consumer working group which we are part of and we are desperate to get this code into operation to protect people from private parking operators who really aren't following best practice,\" Mr Williams added.", "url": "https://www.bbc.co.uk/news/articles/cdeln2ly1z0o"}