{"authors": ["Alun Jones", "www.facebook.com"], "date_download": "2025-04-26 07:53:36", "date_modify": "2025-04-26 07:53:36", "date_publish": "2025-02-25 13:50:42", "description": "The sign was meant to pay tribute to the area’s mining heritage, but misspelt \"miners\" in Welsh.", "filename": "news_articles_cwyj1jlx9p0o_1745654016.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/90ac/live/f033b6f0-f37c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyj1jlx9p0o_1745654016.html", "title": "Sign gaffe describes school as place with 'angry look'", "title_page": "Powys: Sign gaffe describes school as place with 'angry look' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A road sign mistakenly identifying a primary school as somewhere with an \"angry or annoyed look\" is set to be replaced.\nThe Welsh language sign, opposite Ysgol Gynradd Gymraeg Dyffryn y Glowyr in Cwmtwrch, Powys, was meant to pay tribute to the mining heritage of the area.\nBut \"glowyr\", the Welsh word for miners, is misspelt as \"glower\", which is defined as \"an angry, annoyed or threatening look\".\nA new sign will be \"ordered and installed as soon as possible\", a Powys council spokesperson said.\nYsgol Gynradd Gymraeg Dyffryn y Glowyr - which translates as Valley of the Miners Welsh-language Primary School - is a state school for boys and girls aged from three to 11.\nA council spokesperson said the original sign was damaged, with a new sign installed last summer.\n\"We can confirm that there is a spelling mistake on the new sign,\" they added.\nThe is the latest in a series of spelling mistakes or translation errors spotted around Wales.\nA no entry sign at an Aldi's car park in Llandudno, Conwy county, was translated in the context of book-keeping, not traffic, while a sign at a Tesco in Swansea told drivers to exit left in Welsh (allanfa) and right in English.\nA road sign in Swansea once issued correct instructions to lorry drivers in English, but read in Welsh: \"I am not in the office at the moment. Send any work to be translated.\"", "url": "https://www.bbc.co.uk/news/articles/cwyj1jlx9p0o"}