{"authors": ["Mark Savage", "www.facebook.com"], "date_download": "2025-04-26 06:32:12", "date_modify": "2025-04-26 06:32:12", "date_publish": "2025-02-27 08:23:58", "description": "The band, whose hits include Slam Dunk (Da Funk), haven't toured as a five-piece since 2001.", "filename": "news_articles_cd65487lezxo_1745649132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b44/live/7bd535b0-f456-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65487lezxo_1745649132.html", "title": "Boy band Five to reunite with all original members", "title_page": "Boy band Five to reunite with all original members - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After 25 years apart, all five original members of the British boyband Five are reuniting for a massive UK arena tour.\nThe group sold more than 20 million records in the late 1990s and early 2000s with tracks such as When The Lights Go Out, If Ya Gettin' Down and Slam Dunk (Da Funk).\nThe group - Sean Conlon, Ritchie Neville, Scott Robinson, Abz Love and Jason \"J\" Brown - haven't performed as a five-piece since they broke up in 2001, amid burnout, mental breakdown and backstage fights.\n\"This has been a long time coming and it really does feel right for all of us now,\" said Scott in a statement. \"I know I speak for all the boys when I say we can't wait to do this all over again. Hope you're ready!\"\nFive were formed in 1997, in a gruelling audition process that saw more than 3,000 aspiring singers - including a pre-fame Russell Brand - audition for former Spice Girl managers Bob and Chris Herbert.\nThe group came together relatively naturally, however, after the members formed a unit during rehearsals and convinced record label executives with their chemistry.\n\"I remember Simon Cowell was there and he said, 'You're the band, I'm signing you to RCA Records on a five-album deal, this is happening very soon,\" Scott told journalist Michael Cragg in his book about the 2000s pop era, Reach For The Stars.\nThe group were quickly moved into a shared council house in Surrey to begin the process of bonding - but it didn't go entirely to plan.\n\"They wanted a band with edge and that's what they got,\" Ritchie said in Reach For The Stars.\n\"None of us are people that will be bossed around. So if you put five of those people together all the time and then they start annoying each other... eventually there's going to be eruptions.\"\nDespite those initial tensions, the group achieved huge commercial success. Their first song, Slam Dunk (Da Funk), went to number 10 in the UK; and the follow-up, When The Lights Go Out, achieved the same ranking on the US Billboard chart.\nOne of the first bands to utilise the talents of Swedish hitmaker Max Martin, they famously turned down the opportunity to record ...Baby, One More Time before Britney Spears turned it into an era-defining smash.\nUndeterred, they had further chart success with see-sawing song titles such as Everybody Get Up and If Ya Gettin' Down, and opened the 2000 Brit Awards by performing We Will Rock You with rock legends Queen.\nFor three consecutive years, they were named best band at the Smash Hits Poll Winners Party, while Scott picked up a hat-trick of best haircut awards.\nMeanwhile Ritchie's relationship with fellow teen star Billie Piper made them a permanent fixture in the tabloids and teen music magazines.\nIn 2001, Five played to half a million fans at Brazil's Rock In Rio festival, but the band was disintegrating due to a relentless touring schedule and personal conflicts.\nSean walked out during an interview to promote the 2001 single Let's Dance and never came back. His absence from the music video was officially explained as glandular fever but, in reality, he had suffered a mental breakdown.\nHis departure was formally announced later that year and, after releasing a greatest hits album, the band officially split up.\nScott said he decided to leave after being pressured to perform on TV while his young son was in a hospital's intensive care ward.\n\"I was crying in the corridor and I think [Ritchie] looked at the boys and said, 'This is done',\" he later recalled.\nIn the recent BBC documentary Boybands Forever, Cowell cited Five as the band that \"got away\", saying they had come tantalisingly close to becoming a major act in the US.\n\"The band ended before we really cracked America, and I honestly think we could have done that,\" former manager Chris Herbert agreed.", "url": "https://www.bbc.co.uk/news/articles/cd65487lezxo"}