{"authors": ["Riyah Collins", "www.facebook.com"], "date_download": "2025-04-26 04:16:19", "date_modify": "2025-04-26 04:16:19", "date_publish": "2025-03-04 09:29:59", "description": "Cinna, Valkyrae and Emiru were streaming in LA when a man chased and threatened to kill them.", "filename": "news_articles_cn4ygnmj7jno_1745640979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1d19/live/66f03da0-f84f-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4ygnmj7jno_1745640979.html", "title": "Twitch creators 'taking live stream death threats very seriously'", "title_page": "Twitch creators 'taking live stream death threats very seriously' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three US Twitch streamers say they're grateful to be unhurt after a man threatened to kill them during a live stream.\nCinna, Valkyrae and Emiru, who have millions of followers between them, had been taking part in a week-long marathon stream in Los Angeles on Sunday night.\nA man who introduced himself as Russell appeared on their stream from Pacific Park, Santa Monica, and reappeared about half an hour later saying \"I'll kill you right now\" when Emiru refused to share her contact details.\nValkyrae, real name Rachell Marie Hofstetter, said they had spoken to Santa Monica police, who confirmed reports an individual had made threatening statements.\nCinna, real name Brittany Lynn Watts, has 500K followers on Twitch and was recognised last year at the Streamer Awards as best female streamer.\nIn a follow up stream on Monday, she and Valkyrae became emotional as they spoke about what happened.\n\"It sucks that a marathon that was to highlight women streamers is unfortunately ending up on one of the worst things that can happen to a female streamer,\" Cinna said.\n\"We're very thankful it didn't end with one of us getting seriously hurt.\"\nIn the stream on Sunday, a man was seen asking Emiru, real name Emily Schunk, for her phone number after the three streamers got off a fairground ride.\nWhen she says she doesn't have her phone, he suggests she enter her number into his, but she responds: \"I don't know how to use a phone, I'm sorry\".\n\"I'm just going to keep following her,\" he says in response.\nThe streamers then walk away, pull their hoods up and put on sunglasses while they wait for food before spotting the man again seconds later.\nHe then chases the women, saying \"I'll kill you right now\" as they scream, run away and call for security.\nA Santa Monica Police spokesman told BBC Newsbeat officers escorted the streamers from the pier and conducted a search for the suspect.\nHowever, they said they had been unable to find him.\n\"We are aware of video footage circulating online related to the incident and are reviewing the information that has been shared publicly,\" the spokesperson added.\nOn Monday, Cinna said a clip from the stream, which has been shared widely online, \"does not do it justice for how scary it was\".\n\"It is an attempt on our life and we are taking it very seriously.\n\"He said he was going to kill us, he kept trying to get something out of his pocket. We had to run into a store screaming that somebody was going to kill us.\"\nValkyrae, who has 3.4m followers on Instagram, said she hopes it's a \"learning for other streamers\".\n\"It only takes one person, so be careful.\"\nPosting on X, she also said what happened demonstrates the \"harsh reality women live in\" and hit out at online comments that it was staged to drive hits.\n\"Seeing accounts accusing my friends and I for faking this and blaming us instead of questioning the man's behaviour has been embarrassing to see.\n\"I've learned it doesn't matter how much I accomplish in this industry or how much I try to gain respect, some men will hate women and blame women no matter the situation.\"", "url": "https://www.bbc.co.uk/news/articles/cn4ygnmj7jno"}