{"authors": ["Emma Stanley", "www.facebook.com"], "date_download": "2025-04-26 04:34:35", "date_modify": "2025-04-26 04:34:35", "date_publish": "2025-02-28 13:04:28", "description": "PC Molly Bury was arrested after her mother was overheard saying she shared sensitive information with her.", "filename": "news_articles_c3vwwq260gdo_1745642075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cfbc/live/a336b950-f5d0-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vwwq260gdo_1745642075.html", "title": "PC looked up Nicola Bulley details on days off and shared with mum", "title_page": "PC looked up Nicola Bulley details on days off and shared with mum - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former police officer has been handed a suspended sentence after sharing information with her family about the Nicola Bulley investigation.\nLancashire Police said they received a report in March 2023 \"regarding the potential unauthorised disclosure of sensitive police information\".\nThe force said the mother of PC Molly Bury, 28, was overheard at an event in Burnley telling someone \"Molly checked the police system\" before it emerged the officer had illegally accessed police computer systems over several years.\nMs Bulley, 45, disappeared in St Michael's on Wyre in January 2023 with her body later found a mile from where she was last seen after she had fallen in the River Wyre and accidentally drowned.\nA warrant was served at a property in Oswaldtwistle in December 2023 and electronic devices were seized, which revealed Bury had accessed police computer systems between 31 October 2019 and 8 May 2023 while on rest days or off sick.\nThe force said PC Bury had also told her mother about other investigations including a rape and a murder.\nBury, who worked as a response officer, was arrested and interviewed in March before being summonsed to appear at court.\nShe later admitted 32 counts under the Computer Misuse Act and received a six-month suspended sentence at Chester Magistrates' Court.\nBury resigned as a police officer while under investigation.\nA case of gross misconduct was proved at an accelerated misconduct hearing held last year where it was deemed had she not already resigned she would have been dismissed.\nShe has also been added to the police barred list.\nDet Ch Insp Pete Reil said: \"The public trust the police with their data, particularly when they or their loved ones have been victims of crime.\n\"They expect officers and police staff to act responsibly and sensitively with it.\n\"Molly Bury's behaviour fell way below what the constabulary expects and what the public would expect of a serving police officer.\"", "url": "https://www.bbc.co.uk/news/articles/c3vwwq260gdo"}