{"authors": ["David Mercer", "Will Ross", "www.facebook.com"], "date_download": "2025-04-26 06:39:08", "date_modify": "2025-04-26 06:39:08", "date_publish": "2025-03-02 16:29:42", "description": "Rwanda-backed rebels said they captured fighters from a group that took part in the 1994 genocide.", "filename": "news_articles_c70e64yj0nzo_1745649548.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3294/live/e7cf5bf0-f777-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70e64yj0nzo_1745649548.html", "title": "DR Congo accuses Rwanda of faking capture of fighters linked to genocide", "title_page": "DR Congo accuses Rwanda of faking capture of fighters linked to genocide - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The army of the Democratic Republic of Congo has accused Rwanda of dressing up prisoners in military uniforms in an effort to pass them off as newly-captured rebels linked to the Rwandan genocide.\nIt comes after Rwanda-backed M23 rebels in eastern DR Congo said they had captured fighters from the Democratic Forces for the Liberation of Rwanda (FDLR) - a militia founded by ethnic Hutus who took part in the 1994 genocide against Rwanda's Tutsis.\nBut the DR Congo military said a video allegedly showing the handover of 20 FDLR rebels at a border crossing was \"faked\".\nM23 fighters have been advancing through eastern DR Congo since January, seizing Bukavu and Goma, the biggest city in the region.\nThe fighting has forced about 500,000 people from their homes, worsening an already dire humanitarian crisis, according to the UN.\nIn its statement, the Congolese military said the Rwandan video was a \"faked incident in poor taste orchestrated with the sole aim of discrediting our army\".\nIt said Rwanda had taken old FDLR prisoners and dressed them in new military uniforms to claim they had been newly captured in Goma.\n\"This is part of the Rwandan strategy to justify the invasion of parts of the DRC's territory,\" it added.\nRwanda has used the presence of FDLR forces in eastern DR Congo to justify its support for the M23.\nThe country previously denied backing the M23, but it has also stressed that due to the FDLR presence in eastern DR Congo it has a right to take military action there.\nUN experts have previously estimated that between 3,000 and 4,000 Rwandan troops are in eastern DR Congo.\nUN experts also reported last year that the Congolese military had been using several armed groups, including the FDLR, as proxies in the fight against the M23.\nThe genocide in Rwanda took place over 100 days in 1994.\nThe ethnic Hutu militia involved in killing up to 800,000 people - the vast majority from the Tutsi community - fled to what is now DR Congo, some forming the FDLR.\nRwandan President Paul Kagame, who headed the rebel Tutsi force that ended the killing more than three decades ago, sees this \"genocidal militia\" as an existential threat.", "url": "https://www.bbc.co.uk/news/articles/c70e64yj0nzo"}