{"authors": ["Jenny Coleman", "www.facebook.com"], "date_download": "2025-04-26 04:06:32", "date_modify": "2025-04-26 04:06:32", "date_publish": "2025-03-03 16:34:33", "description": "Alex Rigby ran 109 miles in 28 hours to raise money for a Liverpool-based domestic abuse charity.", "filename": "news_articles_cgl0e3xg7d6o_1745640392.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7085/live/3aeea6e0-f847-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl0e3xg7d6o_1745640392.html", "title": "Bootle man finishes 28-hour run for Liverpool domestic abuse charity", "title_page": "Bootle man finishes 28-hour run for Liverpool domestic abuse charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity worker who spent 28 hours running around the Merseyrail network has described his adventure as the \"proudest moment\" of his life.\nTo complete his 109-mile challenge, Alex Rigby even had to walk through a tunnel under the River Mersey which links Liverpool and Wirral.\n\"The support from people is what makes it so special,\" he said.\nAlex has raised more than £40,000 for domestic abuse charity Centre 56.\nHis latest challenge followed one he completed last year when ran to all 36 stations on the Merseyrail Northern line in 12 hours, raising £20,000.\nThe 33-year-old, from Bootle, said he wanted to support the \"amazing work\" done by the Centre 56 charity.\nAfter setting off from Chester at 15:00 GMT on Friday. Alex did not stop until he reached his final destination, Hunts Cross in south Liverpool, at 19:00 the next day.\nHe ran through Wirral on Friday afternoon before donning high-visibility safety gear to walk through the Mersey railway tunnel at 01:00 GMT when no trains were running.\nAfter making it to Liverpool city centre, he continued to run through the night in freezing temperatures to Kirkby and then on to Ormskirk in Lancashire.\nHe then continued across to Southport before running back to Liverpool.\nAlex's route also passed by the Centre 56 nursery in Kirkdale.\nHe described this part of his run as \"very emotional\" because staff and children gathered with balloons and placards to cheer him on.\nA crowd also gathered at Hunts Cross to celebrate his final stop.\n\"When you see people supporting you, you get very emotional,\" he said. \"You don't want to let them down.\n\"It was just unbelievable, it was the proudest day of my life!\"", "url": "https://www.bbc.co.uk/news/articles/cgl0e3xg7d6o"}