{"authors": ["Katy Prickett", "www.facebook.com"], "date_download": "2025-04-26 06:59:32", "date_modify": "2025-04-26 06:59:32", "date_publish": "2025-02-27 05:39:37", "description": "The figures reveal Peterborough has 46 incidents per 1,000 people with Luton only slightly lower.", "filename": "news_articles_ckgz08z21g1o_1745650772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/31c2/live/b1c0b8e0-f43b-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz08z21g1o_1745650772.html", "title": "Peterborough and Luton top Defra fly-tipping statistics table", "title_page": "Peterborough and Luton top Defra fly-tipping statistics table - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The latest government statistics have revealed Peterborough has the highest number of fly-tipping incidents across the East of England.\nThe city council area had 46 incidents per 1,000 people. Luton was not far behind with 44 incidents per 1,000 people.\nThe national figures for 2023-2024 were released by the Department for Agriculture, Environment and Rural Affairs (Defra).\nPeterborough City Council said the figures were \"not a like-for-like comparison... [our] area includes urban and rural areas which historically have suffered from fly-tipping\".\nAngus Ellis, the council's cabinet member for environment and transport, said it was \"fully committed\" to tackling litter, listing recent measures it had introduced including new cameras in hotspots.\nIt had also \"increased fixed penalty notices for fly-tipping offences to the maximum amount\" and run a public awareness campaign.\n\"I would point out that although the council is sometimes criticised for fly-tipping in Peterborough it is not the authority committing the act itself,\" he said.\nIn February, Peterborough City Council introduced permits for its Fengate Household Recycling Centre in a bid to reduce the number of out-of-area visitors.\nHowever, residents recently raised concerns it could lead to an increase in fly-tipping.\nHarry Machin, chairman of Peterborough Litter Wombles Association, said fly-tipping had got worse since the group began in 2021.\nIts volunteers regularly pick up lots of small fly-tips, including \"bags of household waste, DIY materials, tyres, children's toys, mattresses, bedding\" that are not included in the official statistics.\nHe also called for authorities to make it cheaper and easier for people to dispose of their bulky waste.", "url": "https://www.bbc.co.uk/news/articles/ckgz08z21g1o"}