{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:55", "date_modify": "2025-05-19 14:25:55", "date_publish": "2015-04-13 19:10:14", "description": "A California woman who shot and stabbed her boyfriend in his Arizona home in 2008 has been sentenced to life in prison.", "filename": "news_world-us-canada-32292847_1747664755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82293000/jpg/_82293898_82293897.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-32292847_1747664755.html", "title": "Jodi Arias sentenced to life in prison for murder", "title_page": "Jodi Arias sentenced to life in prison for murder - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A woman who shot and stabbed her boyfriend in his Arizona home in 2008 has been sentenced to life in prison, in a long and highly publicised case.\nJodi Arias had faced the death penalty but that was removed as an option in March, when a jury failed to reach agreement on prison or execution.\nShe was convicted of premeditated murder in 2013.\nThe case's salacious testimony of sex and violence gained huge media attention in the US.\nArias, 34, initially blamed the killing of boyfriend Travis Alexander, 30, on intruders, and later said she had killed him in self-defence.\nShe shot Alexander and stabbed him nearly 30 times in his suburban Phoenix home.\nFour family members of Alexander spoke ahead of the sentence, criticising Arias as they broke down in tears.\n\"Stop murdering my brother again and again by smearing his name,\" sister Tanisha Sorenson said, referring to Arias as \"this evil that sits behind me\".\nArias also gave a statement in which stood by her testimony of self-defence and accused police and prosecutors of changing their story during the investigation.\n\"The most important thing I want to say is that I'm very sorry for the enormous pain I caused to the people who loved Travis,\" she said.\n\"I'm truly disgusted and I'm repulsed with myself.\"", "url": "https://www.bbc.com/news/world-us-canada-32292847"}