{"authors": ["Tom Symonds", "www.facebook.com"], "date_download": "2025-04-26 08:09:50", "date_modify": "2025-04-26 08:09:50", "date_publish": "2025-02-26 12:49:36", "description": "All 58 recommendations of the Grenfell Tower public inquiry will be enacted, government says.", "filename": "news_articles_cvg1eje2jg4o_1745654990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/377d/live/ddd00840-f464-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1eje2jg4o_1745654990.html", "title": "Seven organisations to be investigated over Grenfell Tower fire", "title_page": "Seven organisations to be investigated over Grenfell Tower fire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Seven organisations criticised in wake of the Grenfell Tower disaster could be banned from bidding for public contracts, the government has said.\nCladding and insulation firms are among those set to be investigated, Housing Secretary Angela Rayner said, as she announced all recommendations of a public inquiry into the fire will be met.\n\"The bereaved and the survivors and members of the Grenfell community are still waiting for the justice they need and deserve,\" Rayner said, \"and justice must be done\".\nThe government said it is already working on a list of reforms to building safety which came from the cladding crisis following Grenfell, and that it will begin implementing the changes from 2028.\nThe fire in the west London tower block killed 72 people in 2017. The inquiry found all their deaths were avoidable.\nIt concluded that the fire was the result of a chain of failures by governments, \"dishonest\" companies and the fire service, which lacked a strategy for dealing with high rise cladding fires.\nRayner, who is also deputy prime minister, said the Grenfell Inquiry had uncovered \"serial incompetence and negligence, complacency and inaction, and blatant dishonesty and greed\" which led to the fire.\nShe said the government was acting on its findings and would take \"tough action\" to reform the system and \"ensure no community will ever have to face a tragedy like Grenfell ever again\".\n\"That means greater accountability, stronger regulation, and putting residents at the heart of decision-making,\" she added, saying it was owed \"to the memory of those who lost their lives\".\nEd Daffarn, who survived the fire, told the BBC the announcement left him feeling frustrated, adding the government's intentions \"may be good but the wait is torturous\".\nRayner said three of the organisations set to be investigated - manufacturing companies Arconic, Kingspan, and Celotex - were found by the inquiry to have acted with \"systemic dishonesty\".\n\"Their disgraceful, mercenary behaviour put profit before people and exploited the regulatory regime to evade accountability with fatal consequences.\"\nShe also said the organisations that failed \"included the government and regulators\".\nThe department she now leads, she said, \"failed to act on known risks and ignored, delayed, or disregarded matters affecting the safety of life\".\nThe full list of seven companies set to be investigated for professional misconduct is:\nArconic Architectural Products SAS - made cladding\nSaint-Gobain Construction Products UK Limited - in relation to its then ownership of insulation firm Celotex Limited\nExova (UK) Limited - carried out fire risk safety assessments\nHarley Facades Limited - installed cladding\nKingspan Insulation Limited - insulation\nRydon Maintenance Limited - main project contractor\nStudio E Architects Limited - architects\nThey will be investigated using powers under the Procurement Act passed in 2023.\nThe government's role in failing to regulate safety in the construction industry became apparent early in the Grenfell inquiry, prompting an apology for \"past failures\" during the hearings.\nThe government will provide an update on its work to meet the inquiry's recommendations every three months.\nThe announcement is part of a continuing effort to strengthen the regulations and oversight of construction.\nOn Wednesday, the government published a new Construction Products Reform Green Paper setting out possible penalties for companies found to have breached safety obligations, such as fines and powers to limit individuals being involved in the industry.\nBut officials will not say if these will be applied retrospectively. The failures which led to the Grenfell fire happened in the years before its refurbishment in 2016.\nThe government has backed a new \"Hillsborough Law\", which would create a legal duty for public authorities to tell the truth and be transparent.\nMinisters are also promising a new single construction regulator, created through merging two existing bodies, will improve standards in the industry.\nMr Daffarn, a member of the Grenfell United campaign group told BBC Radio 5 Live: \"The report is full of recommendations for further consultations, further reviews - we are eight years on from the tragedy.\n\"It feels like we are just in this carousel of waiting, waiting for justice.\"\nGrenfell Next of Kin, which represents some of the bereaved, said it welcomed the measures being put in place but that these \"should have been basic requirements for a developed country such as ours\".\nThe group said it was concerned that there so far had been no charges related to the fire, and claimed the \"immense\" delay was \"primarily because the inquiry was allowed to overshadow the necessary criminal process\".\nThe Grenfell disaster was caused by the use of highly flammable cladding backed by insulation which also contributed to the spread of the fire.\nManufacturers either concealed evidence of the risks their products posed or made false and misleading claims, the inquiry found.\nThe London Fire Brigade failed to respond to the rapid spread of the fire due to poor training and a lack of guidance about how to deal with flammable cladding.\nThe government will seek views about its plan for a new College of Fire and Rescue later this year to \"improve the training and professionalism of firefighters\".\nIt will also bring in certification for fire risk assessors, after the inquiry found Grenfell was inspected by an assessor who lacked the necessary training.\nThe Ministry of Housing, Communities and Local Government (MHCLG) has taken over responsibility for fire safety from the Home Office and says it will support both the continuing police investigation and plans for a memorial which will replace the tower once it is dismantled in two years' time.", "url": "https://www.bbc.co.uk/news/articles/cvg1eje2jg4o"}