{"authors": ["Shehnaz Khan", "Phil Corrigan", "www.facebook.com"], "date_download": "2025-04-26 03:51:54", "date_modify": "2025-04-26 03:51:54", "date_publish": "2025-03-05 11:22:08", "description": "The council will proceed with £1.1m of cuts affecting front-line services following consultation.", "filename": "news_articles_c70wxy9ljdqo_1745639514.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d13c/live/25c41b20-f99f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70wxy9ljdqo_1745639514.html", "title": "Council approves budget with 4.99% tax rise", "title_page": "Stoke-on-Trent City Council approves budget with 4.99% tax rise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stoke-on-Trent City Council has approved its budget for the new financial year, including a 4.99% council tax rise and a £16.8m loan from the government.\nCouncillors said the budget would help stabilise finances without requiring compulsory redundancies or major cuts to front-line services.\nIt includes £7.5m of savings, including £1.1m of cuts such as plans to dim some street lights, as well as increasing leisure centre prices, which were subject to a public consultation.\nCouncillors voted in favour of approving the new budget at a full council meeting on Tuesday.\nThe council tax rise is the biggest increase allowed without a referendum and will include the previous adult social care precept of 2%.\nBand A households will pay an extra £53.85 to the city council in the 2025-26 financial year, while Band D households will pay £80.75 more annually.\nThe budget includes £16.8m of Exceptional Financial Support (EFS), which is an emergency loan from the government to help struggling councils.\nOpposition Conservative councillors have accused Labour of mismanaging the local authority's finances and failing to make difficult decisions, saying that the city's taxpayers would be left having to pay back the EFS for years to come.\nConservative group leader Dan Jellyman described the council as a \"payday loan authority\".\n\"£16.8m this year, and including the bailout last year, that means £10,000 a day in interest payments, £10,000 a day that city taxpayers are paying,\" he added.\nHe said opposition councillors understood that key services had gone through a transformation and needed extra financial support, but Labour had assured them it would just be a \"safety net\".\n\"But what's happened 12 months later? They've maxed it out,\" he said.\n\"And out of the £16.8m bailout, £2.8m will be for paying interest on the last bailout. If that's not a payday loan council, I don't know what is.\"\nJane Ashworth, leader of the Labour-run council, blamed the current financial problems on austerity cuts by the previous Conservative government.\n\"The city council has been deprived of investment from the Conservative government from 2010 onwards, which amounted to reduction in spending power of about £95m a year,\" she said.\n\"That is something like £280,000 a day and now you have the audacity to throw at us the suggestion that we're increasing debt.\"", "url": "https://www.bbc.co.uk/news/articles/c70wxy9ljdqo"}