{"authors": ["Ruth Lucas", "www.facebook.com"], "date_download": "2025-04-26 03:49:08", "date_modify": "2025-04-26 03:49:08", "date_publish": "2025-03-05 13:55:17", "description": "California Cross has been the subject of controversy since its redesign in 2024.", "filename": "news_articles_cm2jzqrqvzqo_1745639348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1af/live/ed5af850-f9ba-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzqrqvzqo_1745639348.html", "title": "Wokingham councillors 'burying their heads' over roundabout redesign", "title_page": "Wokingham councillors 'burying their heads' over roundabout redesign - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council executives have \"their heads in the sand\" over a controversial redesign of a roundabout junction, a councillor has said.\nPeter Harper has called upon Wokingham Borough Council to make changes to California Cross, between Finchampstead Road and Nine Mile Ride.\nHe said councillors were \"waving the flag about how wonderful the scheme is\" despite safety concerns being raised, including a 1,600-signature petition.\nLeader of the council, Stephen Conway, said the project, dating back to 2015, had been treated with \"incredible care and thoroughness\".\nMr Harper said: \"I get a feeling of this as a sort of discussion the Post Office were having when the Horizon scheme was being discussed – everyone was raising concerns, we have the executive members waving the flag about how wonderful the scheme is, with their heads in the sand.\n\"I think we should be listening to the people who are using that scheme, we should be listening to the safety experts.\n\"We should make the change now.\"\nThe Post Office Horizon scandal involved thousands of innocent sub-postmasters being blamed for financial shortfalls caused by faults in the IT system.\nAt an overview and scrutiny management committee meeting on Tuesday, he asked highway officers why certain recommendations made in a safety audit, carried out in September 2024, were rejected by the council.\nHe also presented the committee with the petition calling for safety improvements to the junction.", "url": "https://www.bbc.co.uk/news/articles/cm2jzqrqvzqo"}