{"authors": ["Phil Corrigan", "www.facebook.com"], "date_download": "2025-04-26 04:18:38", "date_modify": "2025-04-26 04:18:38", "date_publish": "2025-03-04 06:24:46", "description": "New plans for 260-year-old The Leopard, used as a cannabis factory in 2022, are due later this year.", "filename": "news_articles_cge1g4we998o_1745641118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b911/live/f60f92c0-f8cb-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge1g4we998o_1745641118.html", "title": "Historic Burslem pub The Leopard's renovation plan withdrawn", "title_page": "Historic Burslem pub The Leopard's renovation plan withdrawn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to restore a fire-ravaged historic 260-year-old pub in Stoke-on-Trent have been withdrawn, it has been confirmed.\nInitial proposals to turn Burslem's The Leopard into shops and 17 flats were lodged last March, after the building was gutted in the devastating blaze in 2022, before police uncovered a cannabis factory inside it.\nHowever, the original application has now been withdrawn by the owner of the building in Market Place, Daneets Investments.\nA new planning application for the Grade II listed building - which was the meeting place of Josiah Wedgwood and James Brindley where they discussed building the Trent and Mersey Canal in 1765 - is expected in the summer.\nStoke-on-Trent City Council said the submission of an entirely new application would \"avoid any confusion\" and allow a fresh round of consultation.\n\"Our planners have been in frequent dialogue with the owner since the planning applications were submitted last year and now, as a result of these discussions, the owner has appointed a team of professionals to review the original proposals and produce an amended scheme,\" a spokesperson said.\n\"These new plans will be considered under a fresh application which is likely to be submitted in the summer.\"", "url": "https://www.bbc.co.uk/news/articles/cge1g4we998o"}