{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:31:51", "date_modify": "2025-05-21 05:31:51", "date_publish": "2025-01-14 00:00:00", "description": "First Minister Eluned Morgan takes questions in the Senedd.", "filename": "news_live_cqx9wdqjr73t_1747805511.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cqx9wdqjr73t_1747805511.html", "title": "First Minister's Questions from the Senedd: 14 January 2025", "title_page": "First Minister's Questions from the Senedd: 14 January 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Supporting people who are living in poverty\nLiberal Democrat Jane Dodds - whose vote is likely to be crucial in getting the Welsh government budget through the Senedd in March - asks \"how is the Welsh government supporting people who are living in poverty?\"\nEluned Morgan replies \"we have invested almost £5 billion between 2022 and 2025 in plans to support people in all parts of Wales who are living in poverty. These are plans that target support for people who need it most, helping people to access what they have the right to access and to help keep money in people's pockets.\"\nJane Dodds says \"you are our representative from Wales to the UK Labour government. We know that the UK Labour government has actually made people here in Wales much poorer. The winter fuel allowance, now means tested, has left over 500,000 Welsh pensioners without that critical lifeline. The two-child benefit cap, which you and your Cabinet branded as the greatest driver of child poverty, has been cruelly maintained, leaving 65,000 children here in poverty in Wales. And national insurance hikes, burdening charities like Tenovus Cancer UK Wales. They face an annual £250,000 bill, when they are actually helping people who are living in poverty.\"\nThe Labour party holds half of the seats in Cardiff Bay and needs the support of at least one opposition member to abstain for their spending plans to become a reality.\nSince late last year it has looked more likely that Labour would try to carve a deal with Jane Dodds, leader of the Welsh Liberal Democrats and the party's only Member of the Senedd.\nHer abstention, or support, would be enough to get Labour's spending plans through.\nLandslides caused by Storm Darragh\nPlaid Cymru MS Mabon ap Gwynfor highlights the impact of road closures late last year, following landslides caused by Storm Darragh, in Dinas Mawddwy and between Corris and Minffordd, Gwynedd, which are key routes for north-south travel.\nHe says \"it caused huge damage to businesses that needed to carry goods on those routes, and to people who wanted to travel to get medicine and to go see GPs to attend health appointments\".\nThe first minister thanks the agencies that worked to reopen the roads.\nShe says \"we do take the risk of landslides, particularly on our transport network in Wales, very seriously. On the network, we review around 200 kilometres of routes every year, and we monitor over 75 sites proactively.\"\n'An interesting ride'\nAhead of Donald Trump's inauguration as US president on 20 January, the first minister says \"we'd better get ready for an interesting ride\".\nShe says \"tariffs, clearly, would be very harmful to our businesses in Wales, and they would inevitably lead to job losses, so I think they are something that we need to take very seriously, which is why I'm very pleased that I've accepted a request to meet with the new ambassador from the United Kingdom who will be going to the United States to make the case for how important a market the United States is for Wales, how important it is that we can drive further investment from the United States into Wales and that we can also encourage exports, ideally, without a tariff.\"\nShe was responding to Conservative Tom Giffard's comment that \"we've seen deeply concerning reports in the media yesterday that showed that Trump's plans for tariffs on British businesses exporting to America could cost British industry £2.5 billion\".\n'Unite our society rather than divide it'\nCommenting on reports that staff at a refugee charity say colleagues have had \"their lives threatened\" after Elon Musk shared a post which suggested videos of girls were being used to \"entice\" migrants to the UK, the first minister says \"I think it's really important that we do all we can to unite our society rather than divide it\".\nThe Welsh Refugee Council (WRC) has said staff and volunteers had been harassed online after a video, from 2023, was shared on the billionaire entrepreneur's social media site, X.\nWRC said the video was made as a school project and shows a group of girls explaining why Wales is a welcoming country for refugees.\nAlso posting on X, the former leader of the Welsh Conservatives in the Senedd, Andrew RT Davies, has accused Labour Welsh government ministers of using schoolchildren as \"propaganda\", to promote an \"ideologically motivated project\".\nNHS waiting times\nOn the day that Plaid Cymru announced it would look to set up at least one surgical hub in every Welsh health board area if it wins the Senedd election next year, its leader Rhun ap Iorwerth raises the issue of waiting times.\nHe says \"by introducing specialist hubs on a regional basis, a triage service on a national basis, and emergency legislation to generate capacity to make better use of technology to assess symptoms, then we believe that waiting times could be as much as halved in a relatively brief period of time.\"\nHe asks whether the first minister is \"willing to consider these proposals developed in partnership, of course, with healthcare professionals within the NHS?\"\nThe first minister replies that progress is being made in efforts to reduce the longest waiting times, pointing to \"a 65 per cent reduction in the waiting times for those waiting over two years\", and says \"I have in fact looked at your proposals, and there is not one that we're not already implementing\".\nThe NHS is likely to be one of the main battlegrounds ahead of the Senedd election in May 2026.\nGrooming gangs\nDarren Millar, in his third session of FMQs as leader of the Welsh Conservatives in the Senedd, asks whether the first minister supports the calls for a new national inquiry into grooming gangs.\nEarlier this month MPs voted against a Tory move to force a fresh national investigation.\nEluned Morgan replies \"the Welsh government fully supported the previous independent inquiry into child sexual abuse and we are, on the back of that, developing a 10-year strategy for preventing and responding to child sexual abuse. The author of that report made it very clear that her interest was in making sure that the recommendations of that report were actioned, and I can assure you that several of those recommendations have already been implemented here in Wales.\"\nDarren Millar asks \"given the extent of public concern, will you now commission a Wales-wide inquiry into child sexual exploitation by grooming gangs here in Wales?\"\nThe first minister replies, \"I can make it clear to you that I have asked questions about the extent to which this is an issue in Wales of the police. I think that what is important is that we recognise that, actually, in Wales, we have legislated. There are duties in Wales to report, which were introduced back in 2014. You may not be aware of this, Darren, but this was a part of the Social Services and Well-being (Wales) Act 2014. There is a legal duty on agencies, including health boards, including police, probation and other local authorities to inform the local authority if they have reasonable cause to suspect that a child, or an adult with care and support needs, in their area is at risk of abuse, neglect or harm. That's in our law.\"\nBetween 1997 and 2013, several areas of England - including Oldham and Rotherham - were blighted by gangs of men, predominantly of Pakistani descent, who raped and trafficked children as young as 11.\nAn independent report, published by Prof Alexis Jay in 2014, estimated 1,400 girls had been abused in Rotherham.\nShe would later go on to lead the Independent Inquiry into Child Sexual Abuse (IICSA), which lasted seven years and made 20 recommendations.\nProf Jay has previously said victims want to see action on her recommendations, rejecting the calls for a fresh probe.\nThere have also been a series of local reviews into child sex abuse in Manchester, Rochdale and Oldham, which were published between 2020 and 2024 and found authorities had failed to protect children from sexual exploitation by gangs of predominantly Asian men.\nRetention of skills in the TV industry\nLlywydd Elin Jones conducts a ballot to determine the names of members who may table questions to the first minister.\nIndependent member Rhys ab Owen asks \"what support is the Welsh government providing to freelancers in TV and film to ensure the retention of skills in the industry?\"\nFirst Minister Eluned Morgan replies \"since 2020, we have funded 51 projects in this key sector, resulting in £342 million of spend in Wales. Many freelancers will have had opportunities to work as a result of this investment.\"\nShe admits to being a \"massive fan\" of Gavin and Stacey.\nRhys ab Owen points out that despite the success of Christmas TV shows like Gavin and Stacey, the union Bectu has said half of freelancers were out of work as broadcasters grappled with tighter budgets and falling advertising revenue.\nWelsh independent production company Wildflame closed in August, along with Label 1 which had made Saving Lives in Cardiff for BBC Wales.", "url": "https://www.bbc.com/news/live/cqx9wdqjr73t"}