{"authors": ["Zoe Applegate", "www.facebook.com"], "date_download": "2025-04-26 06:36:47", "date_modify": "2025-04-26 06:36:47", "date_publish": "2025-02-26 06:44:26", "description": "A head teacher, who has spoken about the hardships her pupils face, will speak at the launch.", "filename": "news_articles_c20dgd7ggg3o_1745649407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f5d/live/8dafe6d0-f385-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20dgd7ggg3o_1745649407.html", "title": "Anti-poverty campaigners join to launch movement", "title_page": "Anti-poverty campaigners join to launch movement - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A head teacher who has previously spoken out about her pupils having bowed legs due to undernourishment is helping to launch a network to tackle poverty.\nJade Hunter, who leads West Earlham Infants in Norwich, will join a panel at the launch event of The Norfolk Anti-Poverty Alliance at the city cathedral on Wednesday evening.\nOther panelists will include Big Issue founder Lord John Bird, Sumi Rabindrakumar, from anti-poverty and foodbank charity Trussell, and Norfolk Community Law Service chief executive David Powles.\nMr Powles said he hoped the new movement would help allow different organisations to band together to be a \"campaign voice\" for those struggling with hardship.\nNorfolk Community Advice Network - a partnership of advice and community experts and led by charity Norfolk Community Law Service - is co-ordinating the alliance of local charities, faith groups, organisations and individuals.\n\"We can have a strong voice to MPs, to local councils and also on the national level,\" said Mr Powles.\n\"We know there has been a big increase in poverty over the last few years - this has been caused by the cost of living crisis, lockdown and other issues.\n\"We know there are dozens of organisations throughout Norfolk that are doing some fantastic work... but what we don't know is whether they're working together... whether there are ideas happening in one part of the county that should be rolled out.\"\nMr Powles said the coalition wanted to speak to as many associated groups and those with a stake in the issue as possible - and hoped regular meetings and events would now be held.\nThe alliance said experiences of poverty will vary, but according to Citizens Advice nearly 10% of people in some areas of Norfolk did not have enough money to cover their essential costs.\nIn 2023, Ms Hunter spoke to The Guardian newspaper, external about how her pupils were arriving at school hungrier than ever.\n\"We've got children with bowed legs because they're so deficient in vitamins. We've had children so malnourished they've had heart murmurs,\" she told the paper.", "url": "https://www.bbc.co.uk/news/articles/c20dgd7ggg3o"}