{"authors": ["Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 07:06:50", "date_modify": "2025-04-26 07:06:50", "date_publish": "2025-02-28 06:11:46", "description": "The council leader said the authority needs to look at plans to deliver services \"more efficiently\".", "filename": "news_articles_c4gee5d9ll9o_1745651210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/db23/live/d165dfe0-f553-11ef-bf48-f1af4855b062.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gee5d9ll9o_1745651210.html", "title": "Potential day centres closure plan approved", "title_page": "West Berkshire: Potential day centres closure plan approved - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A plan that could see three council-run day centres used by disabled people closed or operated by alternative providers has been approved.\nWest Berkshire Council plans to potentially save £469,000 by changing or shutting the centres, external in Calcot, Newbury and Hungerford but opponents said they are well used.\nJeff Brooks, the council's leader, said the cash-strapped authority needs to look at plans to deliver services \"more efficiently and more economically\".\nBut users, their relatives and a trade union told the BBC that the plans would be short-sighted.\nGreenfield House in Calcot, Hungerford Resource Centre and The Phoenix Centre in Newbury are used by adults with learning disabilities, physical disabilities and those with dementia.\nIain Cottingham, the council's executive member for finance, said it will carry out a \"detailed review\" into them \"to ensure that any alternative provision delivers the same level of service to users\".\nThe council will receive £16m of emergency funding from the government but Cottingham said that did not mean it could be spent on maintaining the status quo.\n\"We have to show that we are prepared to find efficiencies,\" Brooks added.\n\"If it is the case we cannot provide [day centres] as well through other providers…then we will leave the service as it is. But it is appropriate to explore other options.\"\nDavid Marsh, the Green Party's group leader, said the authority's proposal for \"high quality services\" through the proposed saving was \"vague and aspirational rather than realistic\".\nConservative group leader Ross Mackinnon said it had been \"prepared very shoddily\" and the way it had been announced to staff and users had \"caused distress\".\nThe day centres proposal formed part of West Berkshire Council's budget for 2025/26, which will also see residents' council tax increase by 4.99% in April.", "url": "https://www.bbc.co.uk/news/articles/c4gee5d9ll9o"}