{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:16", "date_modify": "2025-05-19 14:26:16", "date_publish": "2015-04-01 17:15:12", "description": "Former South African President Thabo Mbeki used the National Prosecution Authority as a political tool against President Jacob Zuma, court documents say.", "filename": "news_world-africa-32146909_1747664776.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82059000/jpg/_82059526_82059525.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-32146909_1747664776.html", "title": "South Africa's Thabo Mbeki accused of using NPA against Zuma", "title_page": "South Africa's Thabo Mbeki accused of using NPA against Zuma - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former South African President Thabo Mbeki used state prosecutors as a political tool against his then deputy Jacob Zuma, new court documents say.\nThe National Prosecuting Authority filed the papers to block an opposition attempt to reinstate corruption charges against President Zuma.\nThe multimillion dollars charges were controversially dropped on the eve of the 2009 elections.\nMr Zuma, who denies any wrongdoing, ultimately won those elections.\nHe had just won a bitter battle against Mr Mbeki for control of South Africa's governing African National Congress.\nMr Mbeki has always denied interfering in the prosecution of his rival.\nAt the time the charges were dropped, acting National Director of Public Prosecutions Mokotedi Mpshe said there was \"proof enough of a political conspiracy against Zuma\" but he did not reveal many details.\nThe BBC's Milton Nkosi in Johannesburg says we are now seeing some of the alleged evidence.\nEssentially what's happening here is that the in-fighting which reared its ugly head in 2007 between Thabo Mbeki and Jacob Zuma has come back to haunt both leaders of the ANC.\nThe opposition Democratic Alliance is trying every possible available legal avenue to reinstate the corruption charges against Jacob Zuma.\nSome say the DA lost the contest at last year's elections when it was trounced by Mr Zuma's ANC and now it is making an attempt to dethrone him via the courts.\nThe ordinary person in the street is left completely dumfounded by all this destructive rivalry, which is diverting attention from the real issues facing the country such as inequality, poverty and unemployment.", "url": "https://www.bbc.com/news/world-africa-32146909"}