{"authors": ["Katy Docherty-Warren", "www.facebook.com"], "date_download": "2025-04-26 07:57:46", "date_modify": "2025-04-26 07:57:46", "date_publish": "2025-02-25 12:06:37", "description": "Hari Budha Magar, from Canterbury, climbed Mount Aconcagua in the Andes mountain range on Saturday.", "filename": "news_articles_cyve43r7demo_1745654266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/995c/live/c591e2d0-f36a-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyve43r7demo_1745654266.html", "title": "Double amputee scales highest summit outside Asia", "title_page": "Canterbury: Double amputee scales highest summit outside Asia - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Gurkha veteran who lost both legs serving in Afghanistan has set a new record becoming the first double above-knee (DAK) amputee to summit the highest peak outside of Asia.\nHari Budha Magar, from Canterbury, made history when he reached the summit of Mount Everest in 2023, becoming the first DAK amputee to attempt and complete this challenge.\nHe has now set another world first after making it to the top of the 6,961m (22,837ft) Mount Aconcagua, in the Andes mountain range in Argentina, on Saturday.\nMr Budha Magar, who is aiming to climb the highest peak in each of the seven continents by the end of the year, said completing this challenge had given him the confidence to finish the final two.\nMr Budha Magar joined the Royal Gurkha Rifles at the age of 19. While serving in Afghanistan he stepped on an improvised explosive device (IED) and lost both legs in 2010, aged 31.\nHe was made a Member of the Order of the British Empire (MBE) in the King's Birthday Honours for services to disability awareness last year.\n\"I'm trying to do my bit to give some hope and optimism to the people with disabilities or people who are feeling low,\" he said.\n\"I'm trying to raise awareness of disability all around the world, because disabled people can do anything.\"", "url": "https://www.bbc.co.uk/news/articles/cyve43r7demo"}