{"authors": ["Alex Pope", "www.facebook.com"], "date_download": "2025-04-26 07:59:42", "date_modify": "2025-04-26 07:59:42", "date_publish": "2025-02-25 11:25:14", "description": "A number of vehicles are stopped in a day of action with one arrest, a police force says.", "filename": "news_articles_c17qedx4jwno_1745654382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f558/live/f2a2e430-f366-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qedx4jwno_1745654382.html", "title": "Police seize van as part of fly-tipping crackdown", "title_page": "Hertfordshire Police seize van as part of fly-tipping crackdown - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A disqualified driver had their van seized after a police force carried out a day of action to tackle fly-tipping and criminal behaviour.\nHertfordshire Police said a \"multi-agency operation\" was held at a checkpoint off the A602 near Ware on Monday.\nTeams from East Herts Rural and Ware Neighbourhood Policing Teams (NPT), the Rural Operational Support Team and Environment Agency checked a number of vehicles.\nThe force said one person was also arrested on suspicion of drug driving and one person was stopped for having an insecure load.\nA number of Traffic Offence Reports (TOR) were issued for people not wearing a seatbelt and using a mobile phone while driving and a Community Resolution was issued for possession of cannabis, the force added.\nSgt David Miller said: \"Fly-tipping is a big concern among rural communities and we're doing all we can to tackle the issue.\n\"Operations such as this allow us to stop and check a large number of vehicles, to ensure they are carrying and disposing of waste correctly and legally.\n\"They also allow us to detect all sorts of other criminality which may be occurring.\n\"There is still work to do and we will not stop our pursuit of these criminals who cause misery for hard working farmers and the wider rural community.\"", "url": "https://www.bbc.co.uk/news/articles/c17qedx4jwno"}