{"authors": ["Jordan Davies", "Tony Brown", "www.facebook.com"], "date_download": "2025-04-26 04:07:49", "date_modify": "2025-04-26 04:07:49", "date_publish": "2025-03-02 21:50:48", "description": "The daughter of a mining union official describes the threats her family faced during the 1984 strike.", "filename": "news_articles_cly7lyl2484o_1745640469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0ace/live/a34a9b00-f5c6-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly7lyl2484o_1745640469.html", "title": "Miners' strike 1984: 'They threatened to kidnap my little brother'", "title_page": "Miners' strike 1984: 'They threatened to kidnap my little brother' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The daughter of a mining union official has spoken for the first time about how her family faced kidnap threats during the 1984 miners' strike.\nAmanda McKay's father, Ted McKay, represented miners who continued to work during the year-long dispute and pushed for a national vote to settle the issue, putting him at odds with many striking miners.\n\"I know we had petrol through the letterbox on more than one occasion,\" said Ms McKay, who at the time was studying for her A-levels whilst living at the family's home in Wrexham.\nShe recalled a group gathered outside her bedroom window, shouting that they were going to \"kidnap my little brother\".\nThe BBC has spoken to people who were children during the strike to mark the 40th anniversary of the end of the dispute.\nMs McKay, 58, said her family's experiences changed things at home.\n\"We were having phone calls night and day, there were an awful lot of threats to my dad,\" she said.\nMs McKay, now an assistant head teacher, said her mother slept with an air rifle near her bed because she was so scared.\n\"She got herself into such a state, she had no idea how to use it, it was just that state of mind,\" she said.\nEventually, the McKay family were advised by police to leave their home because they were not safe.\nAs a promising hockey player, Ms McKay remained in north Wales and lodged with her PE teacher while her family moved to Merthyr Tydfil.\nMs McKay said the strike took its toll on her family.\n\"We often wonder whether mum had a nervous breakdown during that time,\" she said.\n\"Financially it ruined mum and dad, but it ruined a lot of people.\"\nShe said her father now regretted becoming a miners' agent, \"because of the effect on his family\".\n\"It's sad, really sad, because he did such a good job in my opinion,\" she said.\n\"I was out in the streets of Ammanford collecting [money] with a jam jar - it was the best of times, it was the worst of times,\" he said.\n\"It was tremendously difficult, but also as a young teenager it was energising.\"\nPrice recalled attending picket lines in his school uniform with his father, who \"knew how to handle himself\".\n\"The surge forward, a sea of people, locking arms, in the pouring rain - that stays with you,\" he said.\nPrice went on to become the MP and later Senedd Member for Carmarthen East and Dinefwr, and was the leader of Plaid Cymru for five years.\n\"The strike placed within me a deep and undying passion for politics and campaigning,\" he said.\n\"It was about standing up for what we believed in, but it also changed us.\"\nPrice said the strike also shaped him personally, as he recalled the gay and lesbian support groups who visited Ammanford.\n\"I'd really struggled to put together those different parts of my identity. My working class Welsh identity [and] how did my gay identity fit in that world?\" he said.\n\"I didn't have any role models... so to see the gay and lesbian community embraced, literally, hugged and welcomed - that affected me very, very deeply.\n\"I think it planted a seed that actually things were going to be OK, and when I did come out, my parents were accepting.\"\nDafydd Francis was ten when the strike began.\nHis father, Hywel, was chair of the Neath, Dulais and Swansea Valleys Miners' Support Group - and later became the MP for Aberavon.\nHis mother, Mair, helped women learn new skills and produced a weekly paper.\n\"There was a sense of being on the right side of history,\" Mr Francis said.\nHe recalled motorists on the M4 in Bridgend coming to a stop to prevent hauliers breaking the strike.\n\"That wasn't organised, people didn't know the convoy was coming, they all stopped,\" he said.\nMr Francis witnessed his community change and said his \"placid and gentle\" father became angry because of \"what was at stake\".\nHe even visited the former Soviet Union with his parents.\n\"They saw us, people from south Wales, almost like royalty because we were fighting [Margaret] Thatcher and we were fighting the good fight,\" he said.\nShe said things became particularly difficult after the strike, when her father lost his job.\n\"It kind of floored the family,\" she said.\n\"Everybody talks about the comradeship underground - I think for a man, especially a working class man, you can't underestimate the value in that.\n\"My parents felt lost, I felt lost - it was not just a job, it was a way of life.\"\nMs Richards said her beliefs have cost her jobs, including when she refused to cross a picket line working for a parcel delivery company.\n\"I went to the manager and said I wouldn't be crossing any picket line,\" she said.\nPaula said \"trauma from being wronged\" had also made her more cautious about standing up for her beliefs.\n\"I do it, but with fear of the consequences - which has been left over from the strike,\" she added.\n\"My father said 'we're not in the strike any more Paula, you can't win the strike now'.\n\"That was really profound for me because I realised I had been trying to make it right.\"", "url": "https://www.bbc.co.uk/news/articles/cly7lyl2484o"}