{"authors": ["Brandon Drenon", "www.facebook.com"], "date_download": "2025-04-26 03:52:24", "date_modify": "2025-04-26 03:52:24", "date_publish": "2025-03-03 10:25:46", "description": "\"You've got to have money - lots of it,\" says one resident of the suburb that has inspired a ground-breaking soap opera.", "filename": "news_articles_cn8r0513n5vo_1745639544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5cd2/live/d46910e0-f61b-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8r0513n5vo_1745639544.html", "title": "Beyond the Gates: Inside Prince George's County, the wealthy black community that inspired a soap opera", "title_page": "Beyond the Gates: Inside Prince George's County, the wealthy black community that inspired a soap opera - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Behind the closed gates of the Country Club at Woodmore, lies a world of power, luxury and one of America's wealthiest African-American communities.\nLocated in Prince George's County, Maryland - one of the wealthiest majority-black counties in the US - the country club, and its attached gated community, is the epicentre of the area's upper crust.\nAlthough it traces its roots back to plantation-era slavery, the region has become synonymous with \"black excellence\", locals told the BBC.\nTo live there, Patricia Gafford says: \"You've got to have money – lots of it.\"\nThough Mrs Gafford is a dues-paying member of the private country club where she often plays golf, the 73-year-old says she does not live inside the gated community, because, as her husband once told her, \"'it's a little bit too rich for us'\".\nThe setting has also inspired a ground-breaking new soap opera called Beyond the Gates; its second week of programming begins on Monday. Beyond the Gates is the first new daytime soap opera on network TV in over two decades and the first hour-long daytime soap with a predominantly black cast on network TV.\nKristen Warner, an associate professor of performing and media arts at Cornell University, says seeing its release feels long overdue.\n\"Black folks have been huge supporters and viewers of soap operas since its inception,\" she told the BBC.\nYet with over 90 years of soap opera history, there has \"never\" been a black family as the main family from the start of the show, she explains.\nShe says Beyond the Gates shows that black families are just as capable of embodying the soap-opera essence of \"elegance and glamour and style and fashion\", as well as the trademark \"messiness\" of the day-time plot lines.\nThe show is set in a fictional posh Maryland suburb called Fairmont Crest and centres on the Dupree family. While its daily drama-filled plot lines are sure to be, in classic soap opera fashion, over-the-top, the setting was inspired by the very real exclusive enclave inside Prince George's County.\nThe long winding road that leads up to the Country Club at Woodmore is lined with big brick houses built like castles, and surrounded by expansive manicured lawns. A Maserati, Mercedes Benz or something similar decorates most driveways.\nThe depth of wealth in the black community was also a surprise for Sierra Balgar, who moved to Prince George's County from New York City in 2023.\n\"It was kind of like a culture shock for me to see black people with like these mega houses,\" Ms Balgar says.\nIn Woodmore, where census estimates say over 80% of the population is black, the average median household income is over $214,000 (£170,091). The average in the US is just over $80,000.\nMs Balgar too plays golf on Woodmore's course, where she occasionally hosts events for her women-of-colour centred social club, City Girls Golf.\nShe says Beyond the Gates has been \"all over social\" media and that \"everyone is excited\" about how it's putting a spotlight on a little-known hub of black affluence.\nLong before it was an axis for Washington DC's black elite, in the 1800s, Prince George's County was once known to house the most enslaved African Americans in all of Maryland, says Susan Pearl, a historian at Prince George's County Historical Society.\nOne of the largest plantations in the area, Pleasant Prospect, was located where Woodmore's gated community now stands. The street leading into Woodmore's gates carries the same name.\n\"Some of these wealthy, successful black families are living on land where hundreds of enslaved people were working for one large white property owner,\" says Ms Pearl.\nThe county was predominantly black following the Civil War, but that changed after \"a wave of violence\" against African Americans drove many of them away, says Maya Davis, chair of the Maryland Commission on African American History and Culture.\nBlack Americans started returning to the area en-masse in the early 1970s, after a court ordered the county to desegregate its schools.\nThe area soon became known for its affluence.\nAt the time, the federal government, which employs many people in nearby Washington, DC, was one of the first to implement anti-discrimination policies, giving black Americans a rare chance at better opportunities and better pay.\nFederal jobs \"played a huge role\" in creating black economic success, Ms Davis says, leading to Prince George's County eventually becoming the wealthiest majority-black county in the US.\nBy the late 80s, \"McMansions\" owned by black families began popping up, she added.\nMeanwhile, the county's white population continued to decline as large numbers of white residents began leaving the District of Columbia area in a phenomenon called \"white flight\".\nYet it wasn't until 1992 that the Country Club at Woodmore admitted its first black member - nearly 70 years after the club first opened, in 1923. He died last year.\nThe history-making Beyond the Gates arrives at a \"strange time\", media professor Ms Warner says: \"The soap opera is nearly extinct.\"\nFor most of soap opera history, she explains, black characters were secondary to the story, introduced through the lives of white families, initially in roles like housekeeper, then later as cops and lawyers.\nNBC soap opera Generations made history in 1989 when it became the first to feature a black family from the beginning, but this will be the first soap to make a black family the star of the central plot.\nThe soap is also airing amid a backlash - spearheaded by President Donald Trump's administration - against diversity, equity and inclusion efforts.\nBeyond the Gates was born out of a collaboration between CBS and the NAACP in 2020, following the social uprising of the Black Lives Matter movement. It was a gesture of \"goodwill\" that Ms Warner says is now being \"rolled back\".\n\"In the midst of everything being taken away, we have this one little moment where there is something there for us,\" Ms Warner says, referring to the soap.\n\"Everybody wants to be behind the gates, so it's funny they called it Beyond the Gates. Everybody wants to see kind of what's back there,\" Ms Wiseman says.\nShe opened a cannabis dispensary down the road in 2018, making her the youngest black woman at the time to own one.\nIt's success stories like these and people like Ms Wisemen - black entrepreneurs and black dentists, like her mom - that aren't on TV screens enough, she says.\nThat's why Ms Wiseman says she is pleased to see this new soap opera depicting her community.\n\"A lot of people don't understand what it's like to grow up around and operate in an environment where there's black excellence all around you,\" she says.\n\"That's not the experience of most of black America. That's exciting to see on TV.\"", "url": "https://www.bbc.co.uk/news/articles/cn8r0513n5vo"}