{"authors": ["Nick Thorpe", "www.facebook.com"], "date_download": "2025-04-26 03:49:56", "date_modify": "2025-04-26 03:49:56", "date_publish": "2025-03-05 13:14:40", "description": "Calin Georgescu is the frontrunner in the May vote, but he has not yet been able to register as a candidate.", "filename": "news_articles_c3d810xyvz9o_1745639396.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1bb/live/82582460-f94c-11ef-bfcf-31934e2c8848.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d810xyvz9o_1745639396.html", "title": "Romanians on the march after arrest of presidential favourite", "title_page": "Romanians on the march after arrest of presidential favourite - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tens of thousands of Romanians marched on Bucharest's Victory Square, the seat of the Romanian government, at the weekend, after the presidential election favourite was taken in for questioning.\nCalin Georgescu was picked up on his way to register as a candidate, and he was later charged with attempting to overthrow the constitutional order, as well as membership of a neo-fascist organisation.\n\"Georgescu's mentality is the same as the mentality of Trump,\" said Lavinia approvingly, as she steered her three-year-old daughter's pushchair through a sea of Romanian tricolour flags.\n\"He will listen to our opinion, just as we listen to him. We came here today for freedom, and democracy.\"\nOn the day of Georgescu's arrest came an unexpected twist.\nGuns, grenade launchers, and gold bullion buried beneath the floorboards were found in raids on 47 properties by Romanian police targeting a network, allegedly run by a former French legionnaire and militia chief in the Democratic Republic of Congo.\nHoratiu Potra's current whereabouts are unknown, but his alleged links to Georgescu have only added to the intrigue.\nWhile Horatiu Potra has admitted to illegal possession of weapons, Georgescu has denied all wrongdoing.\nIn just three months, Romania has gone from a stable and loyal member of the European Union and Nato, to a country where a far-right, pro-Russia figure has come from almost nowhere to become favourite for the presidency.\nGeorgescu led the first round of last December's election, but the run-off vote was then annulled after Romanian intelligence revealed Russia had been involved in 800 TikTok accounts backing him.\nThe election is being rerun on 4 and 18 May.\nFor Georgescu's critics, photographs of the weapons cache are the ultimate proof of his danger to the republic.\nFor his supporters, they're the latest bout of mud-slinging, the doomed attempt of a corrupt regime to resist inevitable, Trump-inspired change.\nAt the roadside, a lone busker played the same tune over and over again on an electric piano, as a sea of protesters passed by.\n\"We are talking about the freedom to choose our own president,\" said Oana Eftimie, vice-president of the Patriotic Party of Romanians, another right-wing grouping.\nOne of the peculiarities of the Calin Georgescu phenomenon, is that he seems to have reached beyond existing nationalist parties like AUR, the Alliance for the Union of Romanians, which won 18% and 63 seats in the House of Deputies in the Parliamentary elections on 1 December.\nSome polls put him as high as 40%.", "url": "https://www.bbc.co.uk/news/articles/c3d810xyvz9o"}