{"authors": ["Emily Sinclair", "www.facebook.com"], "date_download": "2025-04-26 06:41:42", "date_modify": "2025-04-26 06:41:42", "date_publish": "2025-03-02 12:25:55", "description": "Surrey Wildlife Trust and the Dogs Trust warn that dogs can cause birds to abandon their nests", "filename": "news_articles_c62zz8l8gvxo_1745649702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4039/live/2a469550-f847-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zz8l8gvxo_1745649702.html", "title": "Surrey Wildlife Trust urges dog owners to keep pets under control", "title_page": "Surrey Wildlife Trust urges dog owners to keep pets under control - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dog owners are being urged to keep their pets on a lead as ground-nesting season approaches.\nSurrey Wildlife Trust (SWT), along with the Dogs Trust, are warning that unsupervised dogs can cause birds to abandon their nests, leaving eggs and chicks unprotected.\nBetween March and August, certain species of bird, such as Skylarks, Woodcocks and Nightjars, breed on the ground of nature reserves, according to SWT.\nDr Jenna Kiddie, head of canine behaviour at the Dogs Trust, said: \"Dogs enrich our lives, but they also bring a level of responsibility.\"\nShe added: \"When visiting rural areas, owners should keep their dogs under control.\"\nAs well as dogs being perceived as predators by the birds, SWT warned that dog faeces can present a health risk to animals and people.\nJames Herd, director of reserves management at SWT, said: \"Keeping your dogs under control and making sure you clean up behind them keeps sensitive habitats safe from damaging disturbance and dangerous diseases.\"\nNeosporosis, a disease which poses a serious risk of aborted pregnancies in grazing animals, has been seen twice already during the spring 2025 calving period, SWT explained.", "url": "https://www.bbc.co.uk/news/articles/c62zz8l8gvxo"}