{"authors": ["Andy Giddings", "www.facebook.com"], "date_download": "2025-04-26 07:36:11", "date_modify": "2025-04-26 07:36:11", "date_publish": "2025-02-27 14:49:12", "description": "Eight-year-old Dulcie Dulcie was diagnosed with a stage four neuroblastoma in 2021.", "filename": "news_articles_cwyddqpn7d4o_1745652971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ecd0/live/596b9bf0-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyddqpn7d4o_1745652971.html", "title": "Young Telford girl to ring bell to mark end of cancer treatment", "title_page": "Young Telford girl to ring bell to mark end of cancer treatment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An eight-year-old girl is due to ring a bell to mark the end of three years of cancer treatment on Monday.\nDulcie, from Telford, was diagnosed with a stage four neuroblastoma in 2021 and underwent chemotherapy, surgery and two sets of clinical trials.\nHer mother, Debra, said: \"I can't wait for her to ring the bell because the last three years have been the most horrific of our lives.\"\nShe has been raising money to take her daughter to Disneyland Paris and said she wanted to create some \"happy memories\" for her.\nWhen Dulcie received her diagnosis in November 2021, her mother said: \"Our entire world changed completely.\"\nAlthough surgeons removed a 1.2kg (2.6lb) mass in 2022, it was found to have spread, and the family had to turn to clinical trials as chemotherapy was not able to reduce it.\nDebra said they finally got the happy news that there was \"no evidence of disease\" a fortnight ago, and Dulcie would ring a bell at Birmingham Children's Hospital to mark the end of her treatment.\nDebra added: \"I just know I'm going to be an absolute mess, because it means she's done it, she's got through it and she's going to be ok.\"\nDebra said her family had endured some dark moments over the past three years.\nShe said: \"You never expect your six-year-old child to say mommy, just let the nurses kill me, I just want to die.\"\nThat came after Dulcie told her she was fed up with life and, if this was what it was going to be like, she didn't want it.\nSince 2021, Debra said their lives had been on hold and \"everything has just revolved around Dulcie and just trying to get her back well\".\nAfter spending three years in the company of adults she wanted to give her daughter a chance to be a girl again.\n\"We want to make new happy memories for her because she will tell you she does not remember anything before cancer,\" she explained.\nMore than £2,000 has been raised to take her and Dulcie to Disneyland Paris, and they also hope to visit the Eiffel Tower.\nAfter three years of cancer, Debra said it would be a chance to go somewhere without having to worry about the treatment waiting for them back home.", "url": "https://www.bbc.co.uk/news/articles/cwyddqpn7d4o"}