{"authors": ["Eddie Bisknell", "www.facebook.com"], "date_download": "2025-04-26 06:36:46", "date_modify": "2025-04-26 06:36:46", "date_publish": "2025-02-26 06:44:42", "description": "The county council has secured funding to further the develop the former coking works.", "filename": "news_articles_cm2d3k43mj1o_1745649406.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fb20/live/9cbf38b0-f3c1-11ef-9843-25877e801f1e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2d3k43mj1o_1745649406.html", "title": "Plans for more homes on formerly contaminated land", "title_page": "Wingerworth: Plans for more homes on formerly contaminated land - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A further 200 homes could be built on what used to be one of Europe's most contaminated brownfield sites.\nDerbyshire County Council is set to receive £1m from the East Midlands Combined County Authority (EMCCA) to create a new access to the south of the former Avenue site in Wingerworth.\nThe council asked for the funding to enable more homes to be built on the former coking works, which closed in 1992 after 40 years of producing coal and gas and processing tar and sulphuric acid.\nNorth East Derbyshire District Council approved plans for 469 homes on the site in 2014 and Tilia Homes has now built 252 homes, with the remaining 217 gaining \"reserved matters (detailed) approval\" in November 2023.\nA business case submitted by the county council says an upgraded junction, which would also involve traffic lights, is required where Derby Road meets Mill Lane, just past the Bellway Homes Curzon Park estate, in order for a further 200 homes to be built, according to the Local Democracy reporting Service (LDRS).\nIt says work on the junction is set to start in October and be complete by March 2026.\nIt details that the upgraded junction would also allow an additional 10 acres of business space to be built and sustainable transport access to the Avenue, including buses.\nA report published by the combined county authority, which shows that the project will cost £1.3m, has described it as a \"major regeneration initiative on the site of a former coking plant, already delivering new homes, a country park and sustainable travel connections\".\nThe government detailed in 2022 that the Avenue site, by the end of its life, was a \"a mess of leaky tanks, pipelines, waste tips, lagoons filled with tar and soil poisoned with cyanide and arsenic\".\nAfter 10 years of remediation work, finishing in 2018, the site was brought back into use with housing and a 220-acre country park – at a cost of £185m in public spending.", "url": "https://www.bbc.co.uk/news/articles/cm2d3k43mj1o"}