{"authors": ["Lyndsey Telford and Holly Fleck", "www.facebook.com"], "date_download": "2025-04-26 07:05:23", "date_modify": "2025-04-26 07:05:23", "date_publish": "2025-02-28 06:30:48", "description": "Sean O'Reilly, 49, was shot twice in an attack in the Bell Steel Manor area of Dunmurry on Sunday.", "filename": "news_articles_c3d88z5e0d7o_1745651123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba1b/live/78289b00-f55f-11ef-9dd3-3538510401a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d88z5e0d7o_1745651123.html", "title": "Sean O'Reilly: Dunmurry feud shooting victim to receive surgery in Dublin", "title_page": "Sean O'Reilly: Dunmurry feud shooting victim to receive surgery in Dublin - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A victim of a suspected republican feud has been offered surgery at a Dublin hospital after he was prevented from travelling to Scotland for the operation, his solicitor has said.\nSean O'Reilly, 49, was shot twice in an attack in the Bell Steel Manor area of Dunmurry on Sunday that police are treating as an attempted murder.\nHe underwent surgery to remove a bullet from his collarbone but required a further operation to save a nerve in one of his arms.\nMr O'Reilly's solicitor said the surgery, which is not understood to be available in Northern Ireland, is set to take place \"very soon\".\nIt had been scheduled to take place at a hospital in Glasgow but it is understood the hospital cancelled the operation.\nMr O'Reilly is said to be a member of Republican Network for Unity, a small political group with links to the dissident organisation Óglaigh na hÉireann.\nHe was believed to be under armed guard at the Royal Victoria Hospital in Belfast for his own safety.\nA solicitor for Mr O'Reilly told BBC News NI that Mr O'Reilly had been advised he would need to have the surgery carried out by the weekend - or risk the nerves in his arm dying.\nHowever, it is understood the surgeon who was initially scheduled to perform the procedure has indicated the furthest date by which it could be performed was in the region of between 10 days and two weeks.\nOn Friday, Mr O'Reilly's solicitor told BBC Radio Ulster's Evening Extra programme that the surgery will happen within that timeframe to save his client's arm.\n\"We end tonight on very positive news without the need for having to go to court and waste public funds, we were able to resolve this directly with Belfast Trust,\" his solicitor said.", "url": "https://www.bbc.co.uk/news/articles/c3d88z5e0d7o"}