{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 08:11:37", "date_modify": "2025-04-26 08:11:37", "date_publish": "2025-02-26 11:58:59", "description": "Birds at a premises in Fownhope in Herefordshire are affected after Defra confirmed an outbreak.", "filename": "news_articles_c89y72wyzwdo_1745655097.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ec1/live/33718890-f434-11ef-8241-abbb923a0925.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89y72wyzwdo_1745655097.html", "title": "Avian flu outbreak in Herefordshire prompts cull of birds", "title_page": "Avian flu outbreak in Herefordshire prompts cull of birds - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A cull of birds is to be carried out in an area of Herefordshire following the confirmation of avian influenza.\nA 3km (1.8 mile) captive bird monitoring zone has been declared around a premises in Fownhope, the Department for Environment, Food and Rural Affairs (Defra) said.\nIt follows the introduction of enhanced safety measures in the county ten days ago after a rise in cases across England.\nThe order requires poultry and captive birds to be kept indoors to prevent the spread of the disease.\nHousing orders were also introduced in Worcestershire, Cheshire, Merseyside and Lancashire on 16 February.\nThey were already in force for parts of Yorkshire, eastern England and Shropshire, where one million hens were culled in January.\nEarlier this month, Top Barn, based at Hallow, near Worcester, was forced to move its normally free-range flock of chickens indoors because of the order.\nThe latest update from Defra stated \"highly pathogenic avian influenza\" was confirmed in captive birds at a premises near Fownhope and affected birds would be humanely culled.\nA bird flu prevention zone enforcing strict hygiene measures around domesticated birds was declared for the whole of the country last month.", "url": "https://www.bbc.co.uk/news/articles/c89y72wyzwdo"}