{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:42", "date_modify": "2025-04-26 03:51:42", "date_publish": "2025-03-05 11:35:19", "description": "Peter Beck already a history of dangerous driving and driving while disqualified, a court hears.", "filename": "news_articles_cx2gvdr84v7o_1745639502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/adb8/live/8aed6d20-f9b4-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gvdr84v7o_1745639502.html", "title": "South Shields danger driver who twice fled from police jailed", "title_page": "South Shields danger driver who twice fled from police jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A driver who twice fled from police has been jailed for almost two years.\nPeter Beck, 31, had multiple motoring offences on his record and a history of ignoring driving bans when he twice made off from officers, Newcastle Crown Court heard.\nOn the first occasion he mounted verges, sped through red lights and drove at 90mph in a 40mph zone. On the second, he caused thousands of pounds worth of damage to another car and a McDonald's restaurant as he rammed his way out of a drive-through.\nHe was jailed for 20 months after admitting offences including dangerous driving, criminal damage and driving while disqualified and without insurance.\nBeck, of Hardy Avenue in South Shields, was spotted driving a blue Ford Focus on the Felling bypass on 18 October 2023, prosecutor Katie Spence said.\nHe had failed to stop for police several days before so officers decided to follow him and try to box him in at a petrol station, the court heard.\nBeck manoeuvred past the officers and made off at speed, mounting a verge to force his way through traffic and going through red lights, Ms Spence said.\nHe managed to make his escape but was arrested a short while later at his home, the court heard.\nOn 24 November 2024, while still on bail for the earlier pursuit, officers became aware of him driving a white BMW at a McDonald's, the court heard.\nAgain he refused to stop, ramming a car in front of him and reversing into the restaurant's wall and window.\nHe then drove off at speed through a Tesco car park but again was arrested at his home a short while later, with police finding him hiding in a cupboard, Ms Spence said.\nThe court heard he had 15 convictions for 38 offences on his criminal record including several counts of dangerous and careless driving and driving while disqualified.\nHe was banned from driving for three years and seven months and will have to pass an extended test before being allowed his licence.", "url": "https://www.bbc.co.uk/news/articles/cx2gvdr84v7o"}