{"authors": ["Vitaly Shevchenko", "www.facebook.com"], "date_download": "2025-05-19 14:52:09", "date_modify": "2025-05-19 14:52:09", "date_publish": "2015-02-07 02:14:08", "description": "Bombings target Ukraine's military installations, transport infrastructure and civilian facilities.", "filename": "news_world-europe-31107456_1747666329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80848000/jpg/_80848230_461044518.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31107456_1747666329.html", "title": "Ukraine conflict: Bombings go beyond battle zone", "title_page": "Ukraine conflict: Bombings go beyond battle zone - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Explosions have become part of daily life in the conflict zone in eastern Ukraine. But bombs have also been going off in other parts of the country, targeting military installations, transport infrastructure and a variety of venues frequented by pro-Kiev government activists.\nThe blasts have caused plenty of damage, disruption and injury. But so far the only fatality was a man killed by a device he was carrying.\nKiev says the bombings are part of a \"hybrid war\" of unorthodox techniques waged on Ukraine by Russia since the overthrow of President Viktor Yanukovych last year. The Russian government denies any involvement.\nLate on 19 January, a bomb went off outside a courtroom in Ukraine's second largest city Kharkiv wounding 14 people, most of them supporters of a right-wing Ukrainian activist standing trial for firearms possession.\nKharkiv, in north-east Ukraine but well away from the battle lines, has seen the lion's share of the attacks.\nMore than a dozen have been reported there in the past three months, including an explosion in a bar frequented by pro-government activists which injured more than 10 people in November. It was blamed on a pro-Russian group calling itself the Kharkiv Partisans.\nBut there have also been several attacks elsewhere. On 20 January, a railway bridge was blown up in Zaporizhya region to the southwest of Donetsk as a freight train was crossing it.\nNo-one was hurt, but a number of wagons were derailed and traffic disrupted on a key railway line used to send supplies and military hardware to the front.\nIn response, Zaporizhya region was formally declared part of the area covered by Ukraine's \"counterterrorism operation\".\nAn earlier attempt to blow up a bridge there was made in June, but failed to cause much damage.\nFurther west, the area in and around the port city of Odessa was hit by five explosions in December alone, targeting railway lines and the offices of pro-Ukrainian activist groups.\nIt was in Odessa that a man carrying a bomb was killed.\nTruckloads of National Guard soldiers armed with machine guns were sent to the city on 3 January.\nBut the next day another attack targeted a collection point for donations to Ukraine's military. The offices of a volunteer group called \"Together with the Army\" were bombed less than a fortnight later.\nThe attackers' identity and motives remain unclear, though it is widely thought they are trying to spread fear and panic.\n\"If that is the case, they have failed,\" says Oleg Konstantinov, chief editor of Odessa's most popular news website Dumskaya, external. \"The city just goes about its normal business,\" he adds.", "url": "https://www.bbc.com/news/world-europe-31107456"}