{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:16", "date_modify": "2025-05-19 14:47:16", "date_publish": "2015-03-04 23:15:36", "description": "A militant Korean nationalist slashes the face of the US ambassador to South Korea, with the North calling it a \"knife shower of justice\".", "filename": "news_world-asia-31743055_1747666036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81410000/jpg/_81410476_81410475.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31743055_1747666036.html", "title": "South Korea US envoy Lippert 'well' after knife attack", "title_page": "South Korea US envoy Lippert 'well' after knife attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A militant Korean nationalist has slashed the face of the US ambassador to South Korea at a breakfast meeting in Seoul, but the envoy narrowly survived serious injury.\nMark Lippert, 42, was also cut on his left hand, with blood spattered over the breakfast table.\nSecurity officers subdued the attacker, one pinning him down with a shoe on his neck, until he was arrested.\nNorth Korea described the attack as \"just punishment for US warmongers\".\nIn a statement on state media, it said the attacker had delivered a \"knife shower of justice\".\nUS Secretary of State John Kerry reacted by saying America would not be \"intimidated or deterred by threats or by anybody who harms any American diplomats\".\nThe attacker, named as Kim Ki-jong, 55, appears to have broken his ankle during the attack and was taken away on an ambulance trolley after questioning.\nMr Lippert had hospital treatment but later wrote in a tweet, external: \"Doing well and in great spirits... Will be back ASAP to advance US-ROK [Republic of Korea] alliance!\"\nNobody believes that pro-North Korean groups represent a majority of South Koreans but they are still a significant minority and part of the political landscape.\nIn November, South Korea's constitutional court ordered that the Unified Progressive Party be dissolved even though it had five members elected to parliament. The authorities said the UPP posed a threat to South Korean democracy. One of its leaders was jailed.\nThe counter-argument of the leftist nationalists is not so much that they want to be ruled by Pyongyang or fall under a North Korean system but that the American military presence in South Korea perpetuates a division within one people - the Korean people.\nThe strong feelings of pro-Pyongyang activists become most obvious when anti-Pyongyang activists launch balloons into the North loaded with propaganda messages. The two sides confront each other, with much jostling and shouting. There was a small pro-US demonstration after the attack on the ambassador but some on the streets of the capital said they applauded it.\nThe 1950-53 war which split the Korean peninsula ended in an armistice, with neither side able to claim outright victory.\nNo peace treaty has ever been signed and the sides regularly accuse each other of violating the agreement.\nMr Lippert - a former US assistant secretary of defence - was appointed ambassador to South Korea in 2014.\nHis wife gave birth in the country, and the couple gave their son a Korean middle name, the AP news agency reports.", "url": "https://www.bbc.com/news/world-asia-31743055"}