{"authors": ["Jack Fiehn", "www.facebook.com"], "date_download": "2025-04-26 04:18:29", "date_modify": "2025-04-26 04:18:29", "date_publish": "2025-03-04 06:30:04", "description": "Woking Borough Council approves a 2.99% increase to its share of the overall council tax bill.", "filename": "news_articles_cly8vkzyz10o_1745641109.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ef5/live/4eff5e10-f877-11ef-a40e-1dcee1447ad7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly8vkzyz10o_1745641109.html", "title": "Cash-strapped Woking Borough Council ‘moving the right way", "title_page": "Cash-strapped Woking Borough Council ‘moving the right way - leader - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A cash-strapped council in Surrey \"moving the right way,\" its leader has said.\nWoking Borough Council (WBC), which declared itself effectively bankrupt in June 2023, approved a 2.99% increase to its share of the council tax bill in the county at a meeting on Monday.\nThe budget for 2025-2026 was passed after ministers agreed to financial support of £171m.\nLast year, residents saw a 10% increase in council tax, as well as cuts to services because of borrowing and investment decisions which led to debts of more than £2bn.\nA band D household will be charged £298.11, alongside the amounts paid to Surrey County Council and the police.\nLiberal Democrat leader Ann-Marie Barker told BBC Radio Surrey: \"We've done all we can as a council to put our house in order.\n\"We've balanced the budget. We've made some more savings, and the council as a whole is moving the right way.\"\nShe added that the government Exceptional Financial Support included £74.6m to cover the costs of paying the interest on the council's historic borrowing.\n\"We are actually adding to our debt with that,\" she added. \"But that's the only deal on the table, it's the way we need to go.\n\"It's our second year of doing that. We can't keep doing it forever, so we are still looking for government to work with us and come up with a longer term solution.\n\"We realise that is clearly a challenge.\"\nShe added: \"The remaining amount of money is not making us make payments, called Minimum Revenue Provisions (MRP), that should have been put aside to repay the borrowing.\"", "url": "https://www.bbc.co.uk/news/articles/cly8vkzyz10o"}