{"authors": ["Daisy Stephens", "www.facebook.com"], "date_download": "2025-04-26 07:39:31", "date_modify": "2025-04-26 07:39:31", "date_publish": "2025-02-27 13:08:27", "description": "Two people are arrested as part of the investigation into the pedestrian's death.", "filename": "news_articles_c80yypll340o_1745653171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b3b/live/929211f0-f506-11ef-9808-4d9b058d1a40.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c80yypll340o_1745653171.html", "title": "Woman dies in hospital after Bracknell hit-and-run crash", "title_page": "Woman dies in hospital after Bracknell hit-and-run crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A pedestrian has died after a hit-and-run, police have said.\nEmergency services were called to Bay Road in Bracknell at 22:30 GMT on Monday, where the woman in her 40s had been hit by a black Ford vehicle.\nA car matching that description was found a short while later crashed into a bollard in Opladen Way and the driver likely escaped on foot, Thames Valley Police said.\nA 32-year-old man, from Bracknell, was arrested on suspicion of causing death by dangerous driving and later released on bail.\nHe was also questioned on suspicion of driving while disqualified, driving with no insurance and failing to stop at the scene of a collision.\nA 30-year-old woman, also from Bracknell, was arrested on suspicion of perverting the course of justice, assisting an offender, causing serious injury by dangerous driving and failing to stop at the scene of a collision.\nShe has since been released under investigation, the force said.\nThe victim was taken to hospital but died of her injuries on Tuesday.\nDet Sgt Lyndsey Blackaby urged anyone who witnessed the crash or who may have dashcam, CCTV or doorbell camera footage to get in touch.", "url": "https://www.bbc.co.uk/news/articles/c80yypll340o"}