{"authors": ["Matthew Richards", "www.facebook.com"], "date_download": "2025-04-26 04:04:38", "date_modify": "2025-04-26 04:04:38", "date_publish": "2025-03-03 18:30:47", "description": "Craig Richardson probably died from choking on blood from facial injuries, an inquest is told.", "filename": "news_articles_cvg17v3v5reo_1745640278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/da48/live/309004d0-f5e7-11ef-86a6-15c2bb2c0119.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg17v3v5reo_1745640278.html", "title": "Wrexham: Alleged murder victim had facial injuries", "title_page": "Wrexham: Alleged murder victim had facial injuries - inquest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 37-year-old man found dead in his home had severe facial injuries, an inquest has heard.\nCraig Richardson's body was discovered by police officers in a bed in his home in Acrefair, Wrexham, on 23 February.\nThomas Iveson, 30, from Burton in Wrexham is accused of murder.\nThe opening of an inquest into the death was told that a Home Office pathologist gave a provisional cause of death as airway asphyxiation due to inhalation of blood from facial injuries.\nOfficers were called to the address just before 12:30 GMT following concerns for the safety of Mr Richardson.\nHe was pronounced dead by paramedics.\nAnother man, 32, also from Wrexham, was also arrested in connection with the murder and later released pending further investigation.\nAdjourning the inquest, the Senior Coroner Ruthin John Gittins, said Mr Richardson's body would not be released for burial until it was known whether a second post-mortem examination would be called for.\nFollowing his death, Mr Richardson's family described as \"a loving son, dad, brother, uncle, nephew, cousin, partner and friend\", who was \"full of fun\".\nMr Iveson denies murder and is due to go on trial at Mold Crown Court on 20 October.", "url": "https://www.bbc.co.uk/news/articles/cvg17v3v5reo"}