{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:37", "date_modify": "2025-05-19 15:29:37", "date_publish": "2015-02-13 16:00:00", "description": "An Isle of Wight councillor questions why potholes outside her home were filled when other more \"dangerous\" ones in the area were \"ignored\".", "filename": "news_uk-england-hampshire-31452172_1747668577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80991000/jpg/_80991866_80991865.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-hampshire-31452172_1747668577.html", "title": "Isle of Wight councillor questions pothole repairs 'a joke'", "title_page": "Isle of Wight councillor questions pothole repairs 'a joke' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A councillor has questioned why potholes outside her home were filled when other more \"dangerous\" ones in the area were \"ignored\".\nIsle of Wight councillor Julia Baker-Smith asked Island Roads, which manages the highways, if it was \"some kind of joke\", after she made complaints about several roads in East Cowes.\nThese included Adelaide Grove and Grange Road.\nIsland Roads said it inspected, categorised and prioritised repairs.\nMiss Baker-Smith, ward member for Whippingham and Osborne, made the comments in an email to the firm.\nIt came after fixes to holes, which were originally highlighted to the firm before Christmas, had not been carried out, she said.\nShe said she was \"delighted\" when temporary repairs were made to holes outside her home.\nHowever, she added: \"Imagine my dismay when I went further down the road, and then to Adelaide Grove, Grange Road and Yarborough Road to discover that the only potholes you had fixed were those directly outside of my house, including a slightly rough area at the entrance to my driveway that hadn't yet become a pothole.\"\nFollowing the email, Miss Baker-Smith said repairs on other roads were carried out.", "url": "https://www.bbc.com/news/uk-england-hampshire-31452172"}