{"authors": ["Jo Kent", "www.facebook.com"], "date_download": "2025-04-26 04:30:55", "date_modify": "2025-04-26 04:30:55", "date_publish": "2025-03-03 06:17:03", "description": "Find out what it takes to be a BBC Make a Difference Award winner as volunteers fix treasured items.", "filename": "news_articles_c93nle09qqvo_1745641855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0049/live/48e62ba0-f45b-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93nle09qqvo_1745641855.html", "title": "BBC Make a Difference Awards: Behind the scenes at repair cafe", "title_page": "BBC Make a Difference Awards: Behind the scenes at repair cafe - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is Winchester's answer to the popular BBC programme The Repair Shop and on a grey Saturday morning it is a hive of activity.\nThe Repair Cafe is held at the Badger Farm Community Centre in the city once a month.\nDespite starting just over a year ago, word has quickly spread and its popularity was further boosted after it won a BBC Make a Difference Award.\nThe Green Award recognised its work in saving items from landfill and has allowed it to access more grant funding with expansion plans now in the pipeline.\nAmongst the dozens of kettles, toasters and vacuum cleaners are a handful of treasured items.\nThe volunteers are not simply fixing things - they are keeping memories alive.\nAt the back of the hall a volunteer is puzzling over the intricacies of the rigging of a model ship brought in by Jane Harding: \"A friend of mine worked here and she told me about it, and I thought 'well I just wonder whether they might be able to mend it', but I hope I'm not giving them too much to do!\"\nThe ship is very precious to Ms Harding as it was made by her late partner Andrew: \"It was made in 1993, before I met him.\n\"He died 10 years ago but his boat has been up in his office in my attic since then, gradually bits falling off it and falling to pieces.\"\nIt is a new one for cafe volunteer Charles Bone: \"We are doing our best to repair the rigging, so far we have restored this mast here.\n\"It is a Thames Wherry, but the Thames Wherrys on the images we found are not quite the same so it gives us an extra challenge as to how we are going to complete it.\"\nIn response to demand, the repair cafe has extended its opening hours, which is good news for the ship repair.\n\"It gives us a better chance to restore it, and we're certainly making improvements already,\" says Mr Bone.\nAnd Ms Harding is a happy customer \"it just instantly looks better\".\nNew volunteer Christopher Rice is at his third session and already this morning he has partly fixed two guitars.\nLast month he had a cuckoo clock, and he is working on an antique doll which has been brought in by Katie Faddy.\n\"It's certainly new to me, I've never done a doll before,\" he says.\nHowever, Mr Rice is unfazed: \"I like fixing things, and I've been doing it all my life for my family, so I thought I'd come along, and I've really enjoyed it.\"\nHe is also discovering that the internet is a big help: \"A lot of the guys use YouTube, there's always a video for almost everything you want to fix.\"\nIt's helped him with Ms Faddy's doll. The string which held the limbs together has broken, so the doll has been dismantled and is in the process of being restrung.\nMs Faddy says: \"The doll was given to me in the 1970s by my mother, I didn't rediscover it again until I cleared out her things.\n\"I was about 14 when she gave it to me because it's not meant to be played with by children, it's a collection piece.\n\"She's a beautiful doll, a bit more upmarket than a Cindy doll, she's lovely.\"\nMs Faddy is a repeat customer, having previously visited with a broken hairdryer, which was beyond repair.\nThe repair cafe has saved more than 1500kg (3300lbs) of waste from landfill.\nIt was recognised with The Green Award at BBC Radio Solent's Make a Difference Awards in September.\nSince winning the award the cafe has had success with grant applications and is planning to open pop up repair cafes around Winchester, as well as helping other groups to get similar projects off the ground.\nAnd it is good news for the doll as Mr Bone says \"I'm getting the hang of it, I think we'll fix her\".\n\"It's a great service,\" Ms Faddy agrees.\nThe Make a Difference Awards recognise and celebrate people, across eight different categories, who are going above and beyond to make a difference where they live.\nEvery BBC Local Radio station will host an awards ceremony in 2025.\nThe awards are a chance to say \"thank you\" and show recognition and appreciation for people who love to make life better for others.\nNominations can be made via the BBC Make a Difference website where you can also see full terms and the privacy notice.\nNominations close on the 31st March 2025 at 17:00.", "url": "https://www.bbc.co.uk/news/articles/c93nle09qqvo"}