{"authors": ["Paul Moseley", "Eleanor Storey", "www.facebook.com"], "date_download": "2025-04-26 03:41:06", "date_modify": "2025-04-26 03:41:06", "date_publish": "2025-03-05 09:05:39", "description": "A report written for Norfolk County Council says changes to local government could save £29m a year.", "filename": "news_articles_cqx02g3nl8po_1745638866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dcf9/live/6bc54e90-f9be-11ef-bed1-9da6d7f95712.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx02g3nl8po_1745638866.html", "title": "Report says single-council option for Norfolk could save millions", "title_page": "Report says single-council option for Norfolk could save millions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scrapping Norfolk's district, borough and city councils and replacing them with one large authority could save £29m a year, a report says.\nIt was prepared for Norfolk County Council, with local authorities given until later this month to submit their initial proposals for how local government reorganisation might work.\nThe report suggests that reducing staff numbers and combining services would save money and improve efficiency.\nBut an alternative report prepared for the seven smaller councils argues that three authorities covering the county would offer better engagement with local people.\nThe report prepared for Norfolk County Council offers three options but appears to favour the council effectively continuing as one authority responsible for the entire county.\nAlong with up to £29m in annual savings, it suggests efficiencies could be made in areas such as planning and waste collection, which are currently covered by more than one body.\nIt suggests that reorganising to have two councils would save less money, be less efficient and see duplications of expensive jobs, such as directors of adult social care.\nAnd it argues that having three authorities in Norfolk would be \"sub-optimal\", costing more with a less joined-up approach.\nConservative county council leader Kay Mason Billig insisted \"there are lots of other pieces of work to be done\" before a decision was made on which option to pursue.\n\"There are a number of issues to explore and it's too early to draw lines on any maps,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cqx02g3nl8po"}