{"authors": ["Mariam Issimdar", "www.facebook.com"], "date_download": "2025-04-26 07:04:37", "date_modify": "2025-04-26 07:04:37", "date_publish": "2025-02-28 06:45:09", "description": "Prince Edward visits schemes where young people are helped to realise their potential.", "filename": "news_articles_cx2rr3ep710o_1745651077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1a7a/live/dbc4b6c0-f547-11ef-a9c6-c7f9594861df.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2rr3ep710o_1745651077.html", "title": "Duke of Edinburgh meets Peterborough teens making a difference", "title_page": "Duke of Edinburgh meets Peterborough teens making a difference - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prince Edward, the Duke of Edinburgh, has been meeting with young people who have made a difference to their communities by taking part in a royal award programme.\nThe group in Peterborough have been working their way to achieving a Duke of Edinburgh (DofE) Award.\nThe awards aim to help young people discover passions, gain skills and build resilience and self-belief.\nParticipant Tom Brett, who is working towards his silver award through community group Chatterbox, said it was \"amazing\" to meet the duke.\n\"When I was younger, I struggled with controlling my anxiety, being antisocial, not wanting to break out of my comfort zone,\" said Mr Brett.\nThe 21-year-old, who left school early, said his life changed after he joined Boxing Futures, visited by the Duke.\n\"I feel like I'm moving towards something. I got fitter, I just started losing weight. It all feels rewarding and then you have a community backing you, people in your corner.\"\nMr Brett now volunteers at Boxing Futures, which is a charity combining the DofE award with non-contact boxing and therapeutic talk to reduce loneliness and improve young people's physical and mental health.", "url": "https://www.bbc.co.uk/news/articles/cx2rr3ep710o"}