{"authors": ["Georgina Barnes", "Lisa Young", "www.facebook.com"], "date_download": "2025-04-26 07:55:42", "date_modify": "2025-04-26 07:55:42", "date_publish": "2025-02-25 12:38:33", "description": "Susan Davy says May's parasite contamination of water in Devon was \"devastating\" for residents.", "filename": "news_articles_c4g7pxkn7nlo_1745654142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3669/live/0f6c7b80-f36c-11ef-a30e-87a8a95b0cd7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g7pxkn7nlo_1745654142.html", "title": "Pennon chief Susan Davy quizzed about Brixham cypto outbreak", "title_page": "Pennon chief Susan Davy quizzed about Brixham cypto outbreak - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A parasite contamination of water in Brixham, Devon, last year was \"devastating\" for some households, the chief of South West Water's (SWW) parent company, Pennon, has admitted.\nSusan Davy told a committee of MPs: \"I absolutely understand how devastating that incident was for that community and for the customers who were poorly… it was a really horrible time for them.\"\nMs Davy said her annual salary had been increased by about £300,000, leading to a £860,000 pay package last year, which included an increase from share awards, but that she did not take her annual bonus.\nThe outbreak last May left some people in hospital and hundreds of others ill after contamination of the water supply by cryptosporidium, a parasite which causes sickness and diarrhoea.\nMs Davy said: \"I am always sorry when something happens either to our customers or to the environment.\"\nWhen asked why she did not speak publicly at the time of the outbreak, Ms Davy said she \"was wanting to speak to my customers\".\n\"I should have, in retrospect - perhaps it would have helped if I spoke to the media,\" she added.\nMPs asked the chief executive whether it was appropriate in January to have announced £45m in dividend payments for 2024-5, a 265% increase from the £12m in 2022-3.\nMs Davy replied by saying that, although the dividend had been announced, it had not been paid as the company \"faced significant energy costs and pressures\".", "url": "https://www.bbc.co.uk/news/articles/c4g7pxkn7nlo"}