{"authors": ["Paul Kirby & Kristina Volk", "www.facebook.com"], "date_download": "2025-04-26 07:54:34", "date_modify": "2025-04-26 07:54:34", "date_publish": "2025-02-25 13:08:08", "description": "Germany's main parties refuse to work with the far right, but the AfD wants to tear the firewall down.", "filename": "news_articles_cy9dl4drr8lo_1745654074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6b56/live/69456cb0-f377-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dl4drr8lo_1745654074.html", "title": "Has Germany's 'firewall' against the far right been breached by AfD success?", "title_page": "Has Germany's 'firewall' against the far right been breached by AfD success? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One in five German voters put an X in the box for Alternative for Germany (AfD) on Sunday: a record result that has made them the second biggest force in German politics.\nRiding on the back of that success, the party is now calling for an end to the consensus in German politics not to work with the far right.\nThat \"firewall\" - Brandmauer in German - has worked since the end of World War Two, but AfD joint leader Tino Chrupalla says: \"Anyone who erects firewalls will get grilled behind them.\"\nThere is a determination among all of Germany's main parties to keep that block in place - and the German public backs them up: 69% see the AfD as a threat to democracy, according to voters surveyed on Sunday.\nFriedrich Merz, who won the election for the conservatives, believes the only reason the AfD exists is because of problems such as migration and security that need to be addressed: \"We need to resolve these problems... then that party, the AfD, will disappear.\"\nThe AfD won 20.8% of the vote nationally, and as the light blue areas of the map show, it was dominant in the five states in the east, securing 34%.\n\"East Germans have made it very clear they no longer want a firewall,\" said Tino Chrupalla.\nFriedrich Merz will now go into talks on forming a government with the Social Democrats, who came third.\nEven though his party won 28.6% of the vote, it was still their second-worst result since World War Two.\nSupport for the AfD doubled, and a million of their voters deserted Merz's conservatives for them, according to a survey by research institute Infratest dimap.\nVoters have not been put off by the fact that Germany's domestic intelligence classifies parts of the AfD as right-wing extremist - or that the party has now embraced a policy called \"remigration\".\nThe AfD argues that remigration means deporting immigrants convicted of crime, but the term has been used by the extreme right to mean mass deportations.\nOne of the big issues for the Christian Democrats is how to get their voters back and stop losing more.\nMerz has already flirted with the AfD in parliament, relying on their votes to push through a motion on migration.\nBut he was clearly stung by a public outcry and the mass protests that followed in many German cities.\nGermany's chancellor-in-waiting is unlikely to try that again, especially if he forms a government with the centre-left.\nBut now the AfD has more than 150 seats in parliament, its supporters in particular believe it is time for the firewall to go.\n\"I just hope that the firewall will fall. But we all know that it won't be like that,\" says pro-AfD TikTok influencer Celina Brychcy, 26.\n\"I think it will fall at the latest when new elections are held. Then they'll have to realise at some point they can't get through with what they're doing right now.\"\n\"I think the Brandmauer will stay,\" says Dominic, 30, who voted for the AfD in Saxony. \"I want the government to really think about their own people and their own country.\"\nPressure to take down the long-standing firewall is not just coming from the AfD, but from leading figures in the Trump administration too, including US Vice-President JD Vance and Elon Musk, who has repeatedly backed the party.\nMost of the voices you hear challenging the firewall come from the east, which may not be surprising considering the deep reach of the AfD, especially in the five eastern states out of a total of 16 across Germany.\nThey won 38.6% of the vote in Thuringia and 37.% in both Saxony and Saxony-Anhalt, far ahead of the CDU. It makes them increasingly difficult to keep at arm's length.\nThat is the main issue the big national parties will have to address. How to avoid ostracising AfD voters who clearly have no problem with the firewall being breached.\nOne mayor pointed out that one of her fellow residents who was also an AfD councillor was fixing the local fountain. It made no sense not to work with him.\nProf Conrad Ziller from the University of Duisburg-Essen believes the greatest threat to the firewall could come at state level, rather than nationally.\n\"If you have trouble building a coalition in a state, then at some point, there could be a minority government that relies on the AfD, or gets votes from the AfD from time to time.\"\nOn a national level, the worst-case scenario would be for a breakdown in a Merz-led coalition: \"Merz could make mistakes. If he gets really tough on immigration, it might become problematic with the SPD.\"\nGermany has already seen one early election because of a coalition collapse, and the AfD's Alice Weidel has made clear she is looking for early elections.\nHer repeated appearances on TV election debates have made her a prominent figure in Germany and helped raise her party's profile.\nBut it was the constant focus on migration and security that became the number one issue for AfD voters, partly fuelled by three deadly attacks, all allegedly carried out by immigrants.\nTackling insecurity, and the perception of it, will be an immediate task for the next government, when it eventually takes shape.\nUnderlying the urgency, Bavaria's centre-right leader Markus Söder said the need to tackle immigration, along with Germany's faltering economy, was \"in fact, the last bullet of democracy\".\nThere is no question of breaching the long-standing firewall for the moment.\nAnd the general secretary of Merz's party, Tom Unger, was adamant that there should be no collaboration with a party that opposed Germany's ties with the West, its membership of Nato and \"the European idea\".\nThat was incompatible, he said, with the conservatives' \"core DNA\".", "url": "https://www.bbc.co.uk/news/articles/cy9dl4drr8lo"}