{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 03:59:13", "date_modify": "2025-04-26 03:59:13", "date_publish": "2025-03-04 06:11:44", "description": "Dr Leah Veronese uncovers the version of Sonnet 116 tucked away in a poetry collection in Oxford.", "filename": "news_articles_cj0q9pjj8yjo_1745639953.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f553/live/35267780-f845-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0q9pjj8yjo_1745639953.html", "title": "Shakespeare sonnet from 17th century found by Oxford researcher", "title_page": "Shakespeare sonnet from 17th century found by Oxford researcher - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rare hand-written copy of one of the most famous love poems ever written has been discovered after hundreds of years.\nDr Leah Veronese uncovered the version of William Shakespeare's Sonnet 116 tucked away in a 17th Century poetry collection at the University of Oxford.\nThe manuscript was found among the papers of Elias Ashmole, founder of Oxford's Ashmolean Museum.\nProf Emma Smith, an Oxford expert in Shakespeare, said the \"exciting discovery\" would help researchers understand the Bard's popularity in the decades following his death.\nDr Veronese found the sonnet featured in a miscellany - a type of manuscript which contains a selection of texts from different authors on various subjects - stored at the Bodleian Library.\n\"As I was leafing through the manuscript, the poem struck me as an odd version of Sonnet 116,\" the university researcher explained.\n\"When I looked in the catalogue (originally compiled in the 19th Century) the poem was described, not inaccurately, as \"on constancy in love\" – but it doesn't mention Shakespeare.\"\nIn Ashmole's version, parts of Sonnet 116 - also known as Let me not to the marriage of true minds - have been altered, and additional lines added.\nDr Veronese said she thought the changed first line and the lack of mention of Shakespeare were the reasons \"why this poem has passed un-noticed as a copy of Sonnet 116 all these years\".\nThe sonnet sits in the miscellany alongside \"politically charged\" works from the 1640s - the decade of the English Civil War, fought between Royalists and Parliamentarians.\nAshmole was a strong supporter of the monarchy, and the lines added to the sonnet could be read as an appeal towards religious and political loyalty.", "url": "https://www.bbc.co.uk/news/articles/cj0q9pjj8yjo"}