{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 06:18:28", "date_modify": "2025-04-26 06:18:28", "date_publish": "2025-03-01 07:27:53", "description": "Ben Lukowski was injured in a crash but secured double gold in Vancouver at the Invictus Games.", "filename": "news_articles_cwygwkg4g9jo_1745648308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/742a/live/2b626480-f434-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwkg4g9jo_1745648308.html", "title": "Invictus Games glory for Marine after car crash", "title_page": "Invictus Games glory for Marine after car crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Life does go on, there's always a light at the end of the tunnel for you,\" says former Royal Marine Ben Lukowski.\nThe 42-year-old served several tours of Iraq and Afghanistan but suffered a brain injury in a car crash near his home in Nottinghamshire.\nIt was a love of sport that aided his rehabilitation and helped him triumph at the Invictus Games in Canada in February, winning two gold medals.\n\"I can't describe it in words but to have my family there cheering me on with my two girls watching was amazing,\" said the dad of two, from Hucknall.\nHis wife Claire Lukowski said her husband went to pick their daughter up from a party when the crash happened in July 2022.\nShe noticed he had been out a long time and thought he had gone to the shops on the way home.\nIt was not long after she received a phone call from her husband that he had been involved in a car crash.\n\"I was in total shock,\" she said. \"He told me where it was and it was close to my parents' house, where I was at the time.\n\"I started running towards where it happened and found him sitting up against a garden wall... the driver's side was completely smashed in.\"\nMrs Lukowski explained a few days later, he could not remember conversations with her, he forgot information and his speech was not right.\nShe added: \"It's now the standing joke, everyone says it... he's been shot at, bombed and it was a car that got him. People still can't believe it.\"\nAfter heading to hospital days after the crash, Mr Lukowski was told he had suffered a brain injury.\nIt led to his medical discharge from the Royal Marines, which left him \"devastated\".\nThe injury affected his speech, his memory and mobility on one side of his body.\nHe spent the next two years in rehabilitation centres in Leicestershire and Cornwall.\nMr Lukowski said: \"The world for the first three or four months was really tough trying to understand that my brain works differently.\n\"It would have been easy for me to sit back and do nothing, but I threw myself into sport.\"\nWhile he was at the Royal Navy Recovery Centre, he was urged to apply for selection for the Invictus Games.\n\"I saw how good it had been for the other guys who had been injured so I went for it and was buzzing when they told me I'd been picked,\" he said.\n\"The whole preparation has helped me massively, not only is the injury life-changing, you don't really know what is happening - with a complex brain injury you're constantly trying to readjust.\"", "url": "https://www.bbc.co.uk/news/articles/cwygwkg4g9jo"}