{"authors": ["Claire Hamilton", "www.facebook.com"], "date_download": "2025-04-26 07:06:28", "date_modify": "2025-04-26 07:06:28", "date_publish": "2025-02-28 06:16:50", "description": "Anneliese Midgley said the Simonswood Industrial Estate was attracting numerous complaints.", "filename": "news_articles_cn8993055v6o_1745651188.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0576/live/c2cdc260-f52e-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8993055v6o_1745651188.html", "title": "MP calls for action on dump making people 'sick'", "title_page": "Knowsley MP calls for action on dump making people 'sick' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP has called for better management of waste sites claiming the \"stink\" caused by a dump is making her constituents feel \"physically sick\".\nKnowsley MP Anneliese Midgley said the Simonswood Industrial Estate had been the subject of numerous complaints from people living in Kirkby due to dust and dirt and reports of a \"mysterious rotten egg smell\".\nThe site is situated in west Lancashire and falls under the jurisdiction of Lancashire County Council, but Knowsley Council has also submitted reports on behalf of their residents as the smell drifts over the border.\nLast year, Knowsley Council said the Environment Agency (EA) had implemented an Odour Management Plan to address the smell.\nThe EA said it was \"taking action\" and an enforcement notice remained in place.\nBut Midgley told the House of Commons her constituents had endured the foul stench - known locally as the \"Simonswood stink\" - for years.\nShe said one resident said her child had a persistent sore throat and others had reported breathing difficulties.\nBut speaking to MPs, Midgley said enforcement from Lancashire County Council and the Environment Agency had been \"unacceptable\"\nShe asked the Leader of the House of Commons Lucy Powell if there could be a debate about lack of enforcement around waste management plans.\nLucy Powell said she was \"disappointed\" to hear the issue was taking so long to resolve.\nShe added the EA had all the powers it needed to tackle the problems and to make sure sites were complying with permit conditions.\nPowell said she would encourage the EA to enforce the site's licensing conditions \"at pace\".\nThe EA said an enforcement notice remained in force.\nOfficers would continue to be deployed to assess the impacts of the odour within the community, it added.\nA spokeswoman said: \"We are also taking action against the operator when there is non-compliance, as demonstrated by the use of the ongoing enforcement notice.\"\nLancashire County Council has also been contacted for comment.", "url": "https://www.bbc.co.uk/news/articles/cn8993055v6o"}