{"authors": ["Jonny Manning", "www.facebook.com"], "date_download": "2025-04-26 03:50:10", "date_modify": "2025-04-26 03:50:10", "date_publish": "2025-03-05 13:03:45", "description": "The housing minister has intervened after South Tyneside Council rejected the plans twice.", "filename": "news_articles_c20ln97dg9wo_1745639410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3092/live/208a30f0-f9bc-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20ln97dg9wo_1745639410.html", "title": "South Tyneside Council ordered to submit housing plans", "title_page": "South Tyneside Council ordered to submit housing plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A local authority has been ordered to submit its house building plans to the government after repeatedly voting them down.\nLast week, South Tyneside Council rejected its controversial Local Plan document, which includes a scheme to build 1,200 homes on green belt land in Fellgate, for the second time.\nBut Housing Minister Matthew Pennycook has told the council it must submit its plan by 18 March as Labour attempts to ramp up housebuilding across the country.\nCouncil leader Tracey Dixon said she now had \"no option\" but to send the draft plan for public examination.\nAll councils must have a Local Plan setting out how they will develop housing, employment and public facilities over the next 15 years.\nBut in a letter to the council, external, Pennycook said it was particularly important for South Tyneside to have a new plan as it had a significant need for affordable housing.\n\"The current South Tyneside Local Plan is one of the oldest in the country having been adopted in June 2007, meaning the policies it contains are significantly out of date,\" he said.\n\"Having failed to submit its emerging plan for examination, the local authority faces the prospect of having to prepare a replacement plan, which will further extend the period in which it does not have an up-to-date plan in place.\"", "url": "https://www.bbc.co.uk/news/articles/c20ln97dg9wo"}