{"authors": ["Vanessa Buschschlüter", "www.facebook.com"], "date_download": "2025-04-26 07:59:36", "date_modify": "2025-04-26 07:59:36", "date_publish": "2025-02-25 11:32:04", "description": "The politician was seized by masked men a day before Nicolás Maduro was sworn in for a third term.", "filename": "news_articles_c15qz4yl7ngo_1745654376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3957/live/af637af0-f36a-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qz4yl7ngo_1745654376.html", "title": "Venezuelan opposition activist dies in jail", "title_page": "Reinaldo Araujo: Venezuelan opposition activist dies in jail - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Venezuelan opposition activist who was arrested during anti-government protests in January has died in jail, his party has said.\nReinaldo Araujo, a leader of the Vente Venezuela party in Trujillo state, had been suffering from health problems, which his wife said were not treated while he was in prison.\nVente Venezuela's leader, María Corina Machado, said she held \"the regime\" of Nicolás Maduro responsible for Araujo's death.\nAccording to the Venezuelan Prison Observatory NGO, 20 political prisoners have died while in custody over the past few years.\nVente Venezuela said Araujo had been seized by masked men on 9 January during a protest on the eve of the swearing in of Nicolás Maduro for a third term as president.\nHis wife said he had been returning from a medical appointment and had merely been observing the protest when he was taken away.\nHe had been in state custody since then.\nRead: Jailed Venezuelan activist details brutality of prison life\nHis wife accuses the authorities of failing to providing her husband with medical care until it was too late, even though she had warned them that his health had been deteriorating.\nThe head of the regional body Organization of American States (OAS), Luis Almagro, denounced Araujo's death, writing on X that it was a \"new atrocity of the regime\".\nHe added: \"No more political prisoners, no more torture, no more death.\"\nAlmagro has been an outspoken critic of Nicolás Maduro, accusing the Venezuelan leader of repressing the opposition in the run-up and the aftermath of July's presidential election.\nVenezuela's National Electoral Council (CNE), a body closely aligned with the government, declared Maduro the winner of the election without providing detailed voting tallies to back up their claim.\nThe OAS's electoral observation department said it could not recognise the result because the CNE \"was biased towards the government\".\nVenezuela's opposition coalition also refused to recognise the result, saying that voting tallies it had gathered, with the help of official election observers, showed that its candidate, Edmundo González, was the overwhelming winner.\nThe opposition also organised protests on the eve of Maduro's swearing in and it was at one such event that Reinaldo Araujo was seized.\nAccording to the Venezuelan Prison Observatory, hundreds of protesters were arrested in the days leading up to Maduro's inauguration and sent to jails notorious for the mistreatment of detainees.\nAmong those seized was Rafael Tudares, the son-in-law of Edmundo González.\nMr Tudares's wife says she has not been given any information about her husband's whereabouts since he was taken away by the security forces on 7 January.\nShe also accused the government of holding her husband in order to exert pressure on Edmundo González, who is living in exile and has been meeting presidents across the region, many of whom have recognised him as the legitimate leader of Venezuela.", "url": "https://www.bbc.co.uk/news/articles/c15qz4yl7ngo"}