{"authors": ["Paul Kirby", "www.facebook.com"], "date_download": "2025-04-26 07:34:51", "date_modify": "2025-04-26 07:34:51", "date_publish": "2025-02-27 15:20:23", "description": "Abdullah Ocalan had earlier met pro-Kurdish MPs on an island where he has been in jail since 1999.", "filename": "news_articles_c2kggzqy0x7o_1745652891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/55a3/live/ca6ce360-f52a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kggzqy0x7o_1745652891.html", "title": "Jailed Kurdish PKK leader Ocalan issues call to lay down arms", "title_page": "Jailed Kurdish PKK leader Ocalan issues call to lay down arms - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Abdullah Ocalan, the jailed leader of the outlawed Kurdish group PKK, has called on his movement to lay down its arms and dissolve itself.\nHis statement, read out in a letter by MPs from a pro-Kurdish party, was aimed at ending four decades of armed struggle in south-eastern Turkey in which tens of thousands of people have been killed.\nOcalan, 75, had earlier met the MPs for several hours on Imrali, an island in the Sea of Marmara south-west of Istanbul where he has been imprisoned in solitary confinement since 1999.\nHis announcement came months after ultra-nationalist leader Devlet Bahceli, who is an ally of Turkey's government, launched an initiative to bring an end to the conflict.\n\"There is no alternative to democracy in the pursuit and realisation of a political system,\" Ocalan's letter read. \"Democratic consensus is the fundamental way.\"\nThe letter was read out by Dem party members Ahmet Turk and Pervin Buldan in both Kurdish and Turkish at a hotel in Istanbul, after their third visit to Imrali island in recent months.\nAppealing to members of the PKK - the Kurdistan Workers' Party - Ocalan said \"all groups must lay their arms and the PKK must dissolve itself\".\nHe said the movement - banned as a terrorist group in Turkey, the EU, UK and US - was formed primarily because \"the channels of democratic politics were closed\".\nHowever, Devlet Bahceli, backed by positive signals from President Recep Tayyip Erdogan and other political parties, had created the right environment for the PKK to lay down its arms, he added.\nBahceli has for years pushed for tough military action against the PKK, but last October he surprised colleagues by shaking hands with MPs from the Dem party in parliament. He then suggested Ocalan could be given parole if he gave up violence and dissolved his armed group.\nThere was cautious optimism from some quarters that the 40-year conflict would come to an end.\n\"We'll look at the outcome,\" said a leading member of Erdogan's ruling AKP, Efkan Ala.\nThe biggest opposition party, the secular CHP, said it would convene a meeting on Thursday evening.\nPervin Buldan and Dem party colleague Sirri Sureyya Onder had already met Ocalan twice in recent weeks, and they have briefed other parties on their visits.\nOnder told an audience made up largely of Kurdish politicians and journalists that they were at a positive turning point in history.\nKurdish leaders largely welcomed the statement and local reports said thousands of people gathered to watch the statement on big screens in the cities of Diyarbakir and Van in the predominantly Kurdish south-east.\nHowever, significant questions remain among both the Kurdish and Turkish public over what the next step might be.\nNot everyone was convinced things would change.\nLast week a senior PKK commander, Duran Kalkan, warned that the ruling AKP was not looking for a solution but to \"take over, destroy and annihilate\".\nKurdish politicians and journalists had faced a crackdown and the Turkish army was engaged in military operations in Iraqi Kurdistan and north-eastern Syria, he added.\n\"[Erdogan} is provoking and instigating war like a 'war baron',\" he told a pro-PKK TV channel.\nTurkish-backed forces in northeastern Syria have intensified their campaign against Kurdish forces and last month called on Syria's new leaders to eliminate the Kurdish-led Syrian Democratic Forces.\nPro-Kurdish politicians have been targeted by a wave of arrests and jail sentences in recent years.\nLast year the two leaders of the pro-Kurdish HDP, Selahattin Demirtas and Figen Yuksekdag, were imprisoned for 42 years and 30 years respectively over deadly riots in 2014. They had already been in prison since 2016.\nKurdish politicians said it was a \"black stain\" on Turkey's justice system and the HDP was subsequently reformed as the Dem party.\nSome 40,000 people have died since the PKK's insurgency began.\nThere was a spike in violence in southeastern Turkey from 2015-17 when a two-and-a-half year ceasefire broke down.\nMore recently, in October the PKK claimed an attack on the Turkish Aerospace Industries (TAI) headquarters near Ankara which left five people dead.\nWhile Ocalan's letter was being read out, the opposition Good party hung a large black banner on its headquarters remembering victims of the PKK: \"We will not forget, we will not let them be forgotten.\"", "url": "https://www.bbc.co.uk/news/articles/c2kggzqy0x7o"}