{"authors": ["Gemma Dillon", "www.facebook.com"], "date_download": "2025-04-26 06:35:03", "date_modify": "2025-04-26 06:35:03", "date_publish": "2025-02-27 06:16:33", "description": "Leeds City Council leader James Lewis says the authority cannot rule out compulsory redundancies.", "filename": "news_articles_c984y032vlqo_1745649303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7e96/live/3a3eecc0-f453-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c984y032vlqo_1745649303.html", "title": "Leeds City Council job cuts as authority makes £100m savings", "title_page": "Leeds City Council job cuts as authority makes £100m savings - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors in Leeds have approved budget savings of £103.8m for the next financial year.\nIt means council tax in the city will rise by almost 5% for 2025/26, with a proportion ring-fenced for adult social care.\nTransport services for children and families will be placed under review along with the future of 56 children's centres.\nThere will be a reduction of more than 230 full-time equivalent staff jobs, and council leader James Lewis said the authority could not rule out compulsory redundancies.\nEarlier this month, Leeds City Council confirmed it had received £67m in extra funding for the next year.\nLewis noted it was the first budget set under the new Labour government, saying: \"We've started to see more money come into the council.\n\"The government is allocating money to councils based on deprivation now which is a big change from the last Conservative government, so a city like Leeds is beginning to see more money coming in.\"\nBut the council will still need to save £103.8m overall to deliver its legally required balanced budget.\nLewis said: \"We've agreed to have a look at community buildings in the city.\n\"We have about 180 buildings used for community services, some of those are really well used and we'll keep them open and invest.\n\"Some of them aren't well used and we'll look at whether we can put those services close by.\"\nHe said some of the reduction in spending was \"good news\".\nHe highlighted the fact there were \"more children's homes in the city so we can look after our children and we've really invested in kinship carers and foster carers in our adoption services\".\nMeanwhile, councillors approved a maximum 4.99% council tax rise.\nThe figure comprises a 2.99% rise in council tax, plus a 2% increase in the adult social care levy.\nFor a Band D property this means an increase of £86.29 for the year (£1.66 per week).\nOpposition parties were critical of the council's budget.\nConservative group Leader Alan Lamb said people living in the city would feel the impact of the multimillion-pound cuts.\nHe said residents would notice the difference when they \"have to pay for parking when before they didn't, when fees and charges for older people are going up, when support for social care is being cut - they're not funding social care properly - and of course council tax is going up by 5% so they are asking people to pay more and deliver less\".\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/c984y032vlqo"}