{"authors": ["Jayne McCubbin", "www.facebook.com"], "date_download": "2025-05-19 15:30:25", "date_modify": "2025-05-19 15:30:25", "date_publish": "2015-02-16 14:52:23", "description": "A universal-credit claimant who featured in a government film to promote the reform now says the system is riddled with computer problems and could make people destitute.", "filename": "news_uk-england-manchester-31487792_1747668625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81039000/jpg/_81039898_81039897.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-manchester-31487792_1747668625.html", "title": "Universal credit 'a nightmare', says claimant who advertised welfare reform", "title_page": "Universal credit 'a nightmare', says claimant who advertised welfare reform - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A claimant who featured in a Government film about universal-credit said it is riddled with computer problems and could push people into hardship.\nIn the Department for Work and Pensions (DWP) film, Daniel Pacey said it helped him find work and was far better than jobseeker's allowance.\nBut he told the BBC a six-week delay before the first payment and further monthly payments were \"a nightmare\".\nThe DWP said the benefit replicates the world of work and tackles dependency.\nA spokesman said: \"Universal credit is simplifying the benefit system and [makes] the transition into employment smoother.\n\"Our work coaches discuss budgeting support with all claimants and nearly 80% say they are confident in their ability to manage a monthly budget.\"\nMr Pacey, 24, from Wigan, Greater Manchester, said: ''It might be easy for a government minister to make their wages last a month. But I'd like to see them make £250 last four weeks while looking for work.\"\nHe added: ''JSA was just a case of write your name down. Write a couple of jobs down. Hand it in you get paid for it.\n\"But with this, you really have to work hard to find a job. And it works.''\nThe government has announced that a national roll-out of universal credit is starting in earnest across the country. The aim is for it to be offered in all job centres in England, Scotland and Wales by 2016.\nWork and Pensions Secretary Iain Duncan Smith told BBC News the new benefit was £600m under budget and had been implemented gradually on advice.\nBut Mr Pacey, who lives with his father, said his job centre struggled with failing computer systems, adding: \"I hate to think about how I would have coped had I lived on my own. I know I couldn't have.\"\nThe DWP spokesman added: \"People can apply for advanced benefit payments if they need extra support and we are working with local authorities to make sure people get budgeting and debt advice.\n\"The IT system adapts smoothly to claims as they become more complex, which we have already seen across the North West.\n\"Computer problems in offices are separate issues and are resolved quickly but these do not impact the operating system, or have an impact on claims.\"\nThe scheme has also been criticised by the National Audit Office as badly managed and failing to deliver on its targets.\nIt is concerned that a roll-out from pilot areas in north-west England is taking place with fewer resources to spend on staff training and less time for staff to get accustomed to the changes.\nAbout 50,000 people in selected areas have claimed the benefit since it was introduced in April 2013 - far fewer than the government originally said would be getting it by now.\nComputer problems have also caused delays and seen ministers write off tens of millions of pounds.", "url": "https://www.bbc.com/news/uk-england-manchester-31487792"}