{"authors": ["Vanessa Pearce", "www.facebook.com"], "date_download": "2025-04-26 07:28:01", "date_modify": "2025-04-26 07:28:01", "date_publish": "2025-02-27 19:37:38", "description": "Henok Gebrsslasie should have been checked every 15 minutes, but was left alone for three hours.", "filename": "news_articles_cwyde244759o_1745652481.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9c13/live/4455efc0-f448-11ef-837a-fdc1fd381948.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyde244759o_1745652481.html", "title": "Nurse made 'mistake' in not checking Coventry mental health patient", "title_page": "Nurse made 'mistake' in not checking Coventry mental health patient - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A nurse who did not check on a man who died at a mental health facility said she \"made a mistake\", not realising she was responsible for carrying out observations every 15 minutes.\nHenok Zaid Gebrsslasie was found unresponsive at the Caludon Centre in Coventry on 12 August 2021.\nA jury at an inquest was told the patient was left unchecked for three hours on the afternoon of his death.\nThe 23-year-old had told another worker on the Psychiatric Intensive Care Unit (PICU) he wanted to be left alone to \"sleep forever,\" minutes before his death, the court heard.\nGiving evidence at the Coventry coroner's hearing on Thursday, Jade Wittey said she had been scheduled to check on the patient every 15 minutes from 14:00 to 15:00 on 2 August.\nHe died shortly after 14:00, the court was told.\nAsked why the checks were not carried out, she said: \"I didn't check the board, I didn't realise I was supposed to be on Level 2 observations\".\nAs the nurse in charge of the Sherbourne ward on the day, she said documentation showing that she had carried out the checks had been completed by a colleague.\nFrom the paperwork she inferred that another member of staff had done the therapeutic observations, she told the jury.\nMs Wittey denied being given a verbal handover prior to the task from another member of staff who had earlier given such evidence to court.\nIt was \"common practice\" for observation paperwork to be \"left in the office\" and not handed from staff member to staff member, she said.\nMr Gebrsslasie had been admitted to the facility on 2 August after telling police officers he wanted to kill others as well as himself.\nAfter absconding from the facility he was returned on 6 August and admitted to the Sherbourne ward.\nHe was observed by some members of staff earlier on 12 August smiling and playing football.\nOther witnesses told the court he was left feeling disappointed when told he would not be being discharged that day.\nHis last contact with a health worker was at 13:55 when student nurse Amy Edwards was sent to his room to take physical observations.\nThis includes taking a patient's blood pressure and temperature.\nMs Edwards told the court that on asking the patient if she could carry out the task he told her to \"go away and leave him alone\".\n\"He also said he wanted to be left to sleep forever,\" she said.\n\"I interpreted it as he just wanted to sleep.\"\nVideo footage of the interaction played in court showed the 23-year-old patient sitting on the floor on the other side of his bed to where Ms Edwards was standing in the doorway.\nThe witness said she believed she gave a verbal handover to another member of staff about the patient's \"low mood\" during the interaction and later recorded part of the incident onto the hospital's care notes records system.\nThe inquest continues.", "url": "https://www.bbc.co.uk/news/articles/cwyde244759o"}