{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:46:11", "date_modify": "2025-04-26 06:46:11", "date_publish": "2025-03-01 14:26:20", "description": "The victim, aged in his 70s, was assaulted at a flat in the Corrainey Park area on Thursday evening.", "filename": "news_articles_cr52dzn1vjqo_1745649971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5851/live/9f669a40-f69b-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr52dzn1vjqo_1745649971.html", "title": "Man arrested on suspicion of pensioner's murder", "title_page": "Man arrested on suspicion of pensioner's murder in Dungannon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 30-year-old man has been arrested on suspicion of the murder of an elderly man in Dungannon, County Tyrone.\nThe victim, aged in his 70s, was found with serious injuries following an assault at a flat in the Corrainey Park area on Thursday evening.\nEmergency services were sent to the incident in the Lisnahull Estate but the man died at the scene.\nIt is understood he was originally from Poland but police said he had lived in the Dungannon area for more than 20 years.\nThe arrested man remains in police custody.\nDet Ch Insp Kerrie Foreman said: \"Our officers remain at the scene today, as we continue to work to establish the full circumstances that led to this senseless attack.\n\"I am appealing to anyone who believes they may have information that could assist us with our investigation to contact us.\"\nThe attack happened at a block of flats on the edge of the Lisnahull estate at about 20:00 GMT on Thursday.\nThe Northern Ireland Ambulance Service said it received a call about the incident at 20:13 GMT.\nIt despatched one rapid response paramedic, two emergency crews and an advanced paramedic to the scene.\nThe Police Service of Northern Ireland (PSNI) confirmed they were treating his death as murder on Friday.\nSupt Peter Stevenson said the victim \"was found seriously injured on the living room floor of the property\".\nLater that evening, more than 100 people attended a vigil close to the block of flats where the man lived.", "url": "https://www.bbc.co.uk/news/articles/cr52dzn1vjqo"}