{"authors": ["Andrew Jackson", "www.facebook.com"], "date_download": "2025-04-26 06:56:46", "date_modify": "2025-04-26 06:56:46", "date_publish": "2025-02-28 14:38:21", "description": "The men are accused of murdering Abdullah Hassan, who died in 2023 after being shot in Sheffield.", "filename": "news_articles_c78998j9g8mo_1745650606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/93fd/live/e799b2a0-f5da-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78998j9g8mo_1745650606.html", "title": "Abdullah Hassan: Three charged with murder over Sheffield shooting", "title_page": "Abdullah Hassan: Three charged with murder over Sheffield shooting - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three people have been charged with the 2023 murder of a man shot dead in Sheffield.\nAbdullah Hassan died after being shot once on Callow Drive in Gleadless Valley, shortly after 01:30 BST on 9 April.\nAlex Taff, 30, of Springfields, Catcliffe; Andrew Horton 46, of HMP Doncaster and Osai Williams, 28, of HMP Lowden Grange have been charged with his murder.\nMr Taff appeared before Sheffield Magistrates' Court earlier and was remanded in custody ahead of an appearance at Sheffield Crown Court on 4 March.\nAs well as murder, Williams is accused of using another to hide a firearm, possession of crack cocaine, heroin and cannabis, possession of a CS gas cannister and possession of a bladed article.\nHorton and Williams will both will appear before Sheffield Magistrates' Court on 3 March.\nA statement from Mr Hassan's family after his death said he was a \"massive pillar\" in their lives.\n\"There is only one way to describe him. He was one of a kind, inside and out,\" they added.\nA further two men remain on police bail in connection with Mr Hassan's death while three other men and three women remain released under investigation, South Yorkshire Police said.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c78998j9g8mo"}