{"authors": ["Clara Bullock", "www.facebook.com"], "date_download": "2025-04-26 06:36:44", "date_modify": "2025-04-26 06:36:44", "date_publish": "2025-02-26 06:45:00", "description": "A woman who started going to dog shows only three months ago has qualified with her dachshund for Crufts.", "filename": "news_articles_cp3ywyw79vno_1745649404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/353c/live/a3b31df0-f45f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3ywyw79vno_1745649404.html", "title": "Dog show rookie from Wells to go to compete at Crufts", "title_page": "Dog show rookie from Wells to go to compete at Crufts  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who started going to dog shows only three months ago has qualified for Crufts.\nSusie Curteis-Lateo from Wells qualified for the dog show with her standard long-haired dachshund Swansford Priyankadora, which she started training half a year ago.\nShe said she is both \"nervous and excited\" about going to the show, which takes place in Birmingham from 6-9 March.\n\"I just wanted a new hobby with a dog, and here we are,\" Ms Curteis-Lateo said.\nMs Curteis-Lateo has been running a dog hotel near Wells for more than 11 years.\nShe said she got Swansford Priyankadora as a puppy a year ago, after visiting Crufts.\nShe wanted to compete at the show but has previously only owned rescue dogs and started going to dog shows as soon as her pet was six months old, and was placed third in the hound class at her first show.\n\"I thought it would be at least another year before we could actually compete at Crufts,\" Ms Curteis-Lateo said.\n\"I'm excited and nervous, it's creeping up fast. Everyone has been very helpful and welcoming.\"\nOutside of the dog show world she said it is \"just a normal dog\".\n\"People think show dogs are proper all the time,\" Ms Curteis-Lateo said.\n\"But mine runs around in the mud with all the other dogs.\"", "url": "https://www.bbc.co.uk/news/articles/cp3ywyw79vno"}