{"authors": ["Sarah Dickins", "www.facebook.com"], "date_download": "2025-05-19 15:36:31", "date_modify": "2025-05-19 15:36:31", "date_publish": "2015-02-09 18:01:47", "description": "Not content with just being the capital of Wales, Cardiff is flexing its muscles and teaming up with the UK's biggest hitting cities.", "filename": "news_uk-wales-31300634_1747668991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80893000/jpg/_80893633_80893631.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-31300634_1747668991.html", "title": "Cardiff joins the big hitting cities", "title_page": "Cardiff joins the big hitting cities - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Not content with just being the capital of Wales, Cardiff has been flexing its muscles and teaming up with the UK's biggest hitting cities in recent months.\nIt has been looking to stand its corner on different fronts.\nToday sees it joining with nine others pushing for more powers to help their city economies grow.\nCardiff last autumn became the newest member qualifying for the Core Cities Group.\nBetween them they contribute almost one quarter of the combined output of Wales, England and Scotland.\nAt a summit in Glasgow on Monday the group launched what it called a Modern Charter for a Freedom Charter , external- a Magna Carta for the urban giants - setting out what powers were needed to help local economies grow.\nCardiff, like cities including Manchester, Birmingham and Newcastle, called for more power to be passed down from Welsh, Scottish and UK governments to cities, with more control over some taxes.\nThey want cities to be able to keep more of the property and income taxes raised in their area.\nThe charter comes less than a week after Cardiff joined Newport and Bristol under the banner Great Western Cities.\nThis is one of six \"powerhouse super city regions,\" as described by the RSA City Growth Commission.\nThe aim is to market the area as a strong place to invest and do business. They also plan to work together to improve road and area links for their wider region.\nAs well as being members of those groups Cardiff is also at the heart of the Cardiff Capital City Region\nSo that's Cardiff represented in three relatively new groups - Cardiff Capital City Region; Core Cities Group; Great Western Cities.\nAll are arguing for more powers from government but as yet none of the groups have powers nor budgets.", "url": "https://www.bbc.com/news/uk-wales-31300634"}