{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 08:02:44", "date_modify": "2025-04-26 08:02:44", "date_publish": "2025-02-26 16:49:13", "description": "Telford and Wrekin Council wants to redevelop the site of a deteriorating building in Wellington.", "filename": "news_articles_ce8mye42j6yo_1745654564.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0fc5/live/311dc600-f45f-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8mye42j6yo_1745654564.html", "title": "Archaeological survey needed before Wellington redevelopment", "title_page": "Archaeological survey needed before Wellington redevelopment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An archaeological survey will have to be carried out in a town, before redevelopment work can take place.\nTelford and Wrekin Council planning officials approved the demolition of a badly deteriorating building which sits on the corner of Walker Street, Duke Street and Crown Street in Wellington.\nBut it noted the site was in the medieval heart of the town and was known to hold archaeological interest.\nThe council ordered that development, which would be carried out by the authority itself, could not place until a programme of archaeological work was agreed.\nOnce the archaeological survey is complete and the building has been demolished, a block including a ground floor shop below four flats has been planned.\nThe redevelopment work will be carried out by the council's own contractors and a number of conditions have been imposed as part of the planning approval.\nThey include limits on the way work vehicles are parked, how equipment is loaded and unloaded and the hours of operation on the site.\nIn addition, the contractors have told the council the majority of the demolition work would be done by hand and hand tools.\nA structural survey of the building found that the building was riddled with cracks up to 20mm (0.8 inches) wide and deathwatch beetles.", "url": "https://www.bbc.co.uk/news/articles/ce8mye42j6yo"}