{"authors": ["David Gilyeat", "www.facebook.com"], "date_download": "2025-04-26 03:45:16", "date_modify": "2025-04-26 03:45:16", "date_publish": "2025-03-05 06:22:10", "description": "Two people have been arrested as part of the investigation into Tania Goswell's death.", "filename": "news_articles_ckgd6q44k7po_1745639116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9280/live/0ee18110-f934-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgd6q44k7po_1745639116.html", "title": "Bracknell hit-and-run: Family pay tribute to Tania Goswell", "title_page": "Bracknell hit-and-run: Family pay tribute to Tania Goswell - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a woman who died after a hit-and-run have said she always \"made the room light up with happiness\".\nEmergency services were called to Bay Road in Bracknell at 22:30 GMT on 24 February, where Tania Goswell, 47, was hit by a car.\nShe was taken to hospital but died of her injuries a day later. Police have arrested a man and a woman.\nPaying tribute, her family said: \"Tania was so unique, and her loss has left our hearts empty, knowing we will never experience her love again.\"\nAccording to Thames Valley Police, Ms Goswell was hit by a black Ford vehicle.\nA car matching that description was found a short while later crashed into a bollard in Opladen Way and the driver likely escaped on foot, it said.\nA 32-year-old man, from Bracknell, was arrested on suspicion of causing death by dangerous driving and later released on bail.\nHe was also questioned on suspicion of driving while disqualified, driving with no insurance and failing to stop at the scene of a collision.\nA 30-year-old woman, also from Bracknell, was arrested on suspicion of perverting the course of justice, assisting an offender, causing serious injury by dangerous driving and failing to stop at the scene of a collision.\nShe has since been released under investigation, the force said.", "url": "https://www.bbc.co.uk/news/articles/ckgd6q44k7po"}