{"authors": ["Phil Harrison", "www.facebook.com"], "date_download": "2025-04-26 03:46:15", "date_modify": "2025-04-26 03:46:15", "date_publish": "2025-03-05 06:05:46", "description": "Viktoriya Richardson from Canterbury is selling artwork to help buy military boats and vehicles.", "filename": "news_articles_cly2830wl49o_1745639175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4d9e/live/2d952b90-f92d-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly2830wl49o_1745639175.html", "title": "Ukrainian artist from Canterbury sells artwork to help war effort", "title_page": "Ukrainian artist from Canterbury sells artwork to help war effort - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Ukrainian artist who lives in Kent is selling her artwork to help the war effort in her home country.\nViktoriya Richardson from Canterbury has been creating patriotic paintings since the Russian invasion in 2022 and has raised thousands of pounds in sales and donations after exhibiting in local galleries.\nThe money raised has been used to buy a boat and vehicles for the Ukrainian military.\n\"They needed a little boat to make regular crossings over a river, so I bought them one and the army sent me a video of them using it. It makes me very happy to help,\" she said.\nMs Richardson previously worked as a teacher and a lawyer in her hometown of Odesa before moving to the UK in 2003 and taking up art.\nShe still has family living in the warzone who she speaks to everyday, but said \"we do not talk about long term plans as nobody knows what will happen next\".\nHer paintings and collages feature women and girls in Ukrainian national dress or are representations of Kyiv, Odesa and Lviv before the conflict began.\n\"I've painted these figures to show the strength of our nation and culture,\" she said.\n\"By knowing I'm making my art, people in Ukraine know that they are not on their own. They have support and they will be heard.\"", "url": "https://www.bbc.co.uk/news/articles/cly2830wl49o"}