{"authors": ["Andrew Harding", "www.facebook.com"], "date_download": "2025-05-19 14:44:48", "date_modify": "2025-05-19 14:44:48", "date_publish": "2015-01-29 11:42:28", "description": "South African actor Fana Mokoena tells the BBC's Andrew Harding about giving up a role in a Hollywood blockbuster to become an MP with the radical EFF.", "filename": "news_world-africa-31026575_1747665888.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80586000/jpg/_80586749_fana.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31026575_1747665888.html", "title": "Fana Mokoena's dilemma: Interstellar or revolution in South Africa?", "title_page": "Fana Mokoena's dilemma: Interstellar or revolution in South Africa? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Can you save the world, and still keep your day job? I remember Bob Geldof grumbling about that conundrum to me a decade ago in a dusty corner of Ethiopia.\nNow South African actor Fana Mokoena is facing a similar dilemma.\nIf you've watched World War Z, you may remember him as the deputy UN secretary-general, plotting ways to eliminate zombies and save Brad Pitt.\nHe was also in Mandela: Long Walk to Freedom, Safe House and Hotel Rwanda.\nBut now he's had to put his Hollywood dreams on hold - and has just missed out on what might have been the biggest role of his career.\n\"I was supposed to be in Interstellar, with Christopher Nolan. I was going to play the scientist. I forget his name. We were in talks about me taking the role, and then this came up,\" said Mr Mokoena with a faraway look in his eyes.\nThe \"this\" he is referring to is a new job as an MP for South Africa's newest, brashest political party - the Economic Freedom Fighters (EFF).\n\"It's a huge sacrifice,\" Mr Mokoena said of the experience of watching the plum Interstellar role of the worm-hole astronaut Romilly - trapped in a spaceship for 23 years waiting for Matthew McConaughey and Anne Hathaway to get back from a nearby plant - slip through his fingers and go instead to British actor David Gyasi.\n\"I spoke to my agent and I said: 'Listen there's going to be a problem.' But [the EFF] is kind of important for me - it's history,\" he said resolutely.\nWe met in an office block near the centre of Johannesburg, where the EFF has just taken up residency, and where Mr Mokoena was filling in as acting spokesman for the party, and media handler for the its famously outspoken \"Commander-in-Chief\" Julius Malema.\n\"But it's all right. It's cool. The banks take you seriously because you're earning more regularly.\"\nAnd there's the satisfaction of being part of a cause he believes in - as the EFF prepares to expand its controversial \"land occupation\" programme across the country.\n\"Land occupation is protest action - not land grabs. Not like Zimbabwe,\" said Mr Mokoena, with vigor.\n\"Land is a huge issue, not just in South Africa. Africans just don't own land and this is a huge problem. The African is still not in control of the means of production - mines and so forth - 60 or 70 years down the line. The geography of the economy hasn't changed. We need land.\n\"The funny thing is, that in South Africa white people are beginning to understand the message - that we need to share. Everybody needs to share. The fact that 70% of the land is sitting in the hands of 20% of the population, is not viable, not even economically,\" he continued.", "url": "https://www.bbc.com/news/world-africa-31026575"}