{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:48", "date_modify": "2025-05-19 14:52:48", "date_publish": "2017-07-05 00:00:00", "description": "The latest news, sport, travel and weather for the East Midlands on Wednesday 5 July 2017.", "filename": "news_live_uk-england-leicestershire-40499624_1747666368.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-leicestershire-40499624_1747666368.html", "title": "Latest updates: East Midlands Live", "title_page": "Latest updates: East Midlands Live on Wednesday 5 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sports Direct owner says Shirebrook a 'very boring and lonely' place\nCalum McKenzie\nBBC Local Live\nMike Ashley, the owner of Shirebrook-based Sports Direct, has described the town as a \"very boring and lonely\" place.\nMr Ashley, who also owns Newcastle United, made the remarks during a case at the High Court in London.\nHe is being sued by investment banker Jeffrey Blue, who claims he was promised £15m in a pub drinking session for increasing Sports Direct's share price to £8 each.\nMr Blue claims he was paid just £1m for the increase in share price.\nBut Mr Ashley said it \"would be obvious\" to anyone at the pub where they were drinking that he \"was not serious.\"\nShakespeare: We've got to aim higher than just survival\nReuters\nLeicester City boss Craig Shakespeare has said the club must look beyond Premier League survival next season and set higher targets.\n\"Premier League survival is good,\" Shakespeare told the club's official website., external\n\"But I look at the squad and the players we're trying to attract - I want to be better than that, and I think the players want to be better than that.\n\"I think our aim is to try and be competitive in every match, whether we're playing Chelsea as Premier League winners last season or a team that's just come up.\"\nThe Foxes finished 12th in the Premier League last season, ten points above the relegation zone.\nWeather: Yellow warning for rain\nAnna Church\nWeather Presenter, BBC East Midlands Today\nThere's a Met Office yellow weather warning in place for rain from 06:00 on Thursday to 02:00 on Friday.\nIsolated thunderstorms are likely to develop across England and Wales from early Thursday morning before clearing by early Friday.\nWhile these storms may miss many places, where they do develop intense downpours are likely, bringing the threat of sudden flooding of roads, transport routes, homes and businesses.\nLightning and hail may be additional hazards.\nHughes closes on on hundred\nDerbyshire 368 & 180-7 (53 overs) v Durham 301 - tea\nMartin Emmerson\nBBC Newcastle\nDurham have conceded the lead in six of their nine Championship matches so far and have lost four of them, drawing the other.\nAnd Derbyshire's lead passed the 200 mark at around 3.00pm with Durham looking flat in the field and their bowling lacking any real threat - but three wickets then fell in seven balls.\nMatt Critchley was on 28 when he clipped Barry McCarthy down the legside to the keeper; Daryn Smit went for 4, second ball, caught in the slips off McCarthy, and Ryan Pringle had Tony Palladino caught behind for a third ball duck.\nDerbyshire lead by 247 at tea, but Alex Hughes is leading the way for them with 87.\nBridgen: Time for people to bring photo ID in order to vote\nCalum McKenzie\nBBC Local Live\nPeople should have to provide photo ID in order to vote at elections, according to North West Leicestershire MP Andrew Bridgen.\nMr Bridgen said that people could vote \"all day long in different polling stations.\"\n\"It's been highlighted that when someone goes to vote, all they need is a name and address,\" he added.\n\"In theory someone could get hold of a telephone directory and vote all day long in different polling stations.\n\"Does the minister agree with me that it is time for photo ID to prevent electoral fraud?\"\nChris Skidmore, the constitutional affairs minister, said that there would be voter ID pilots carried out at next year's local elections.", "url": "https://www.bbc.com/news/live/uk-england-leicestershire-40499624"}