{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:25:38", "date_modify": "2025-04-26 04:25:38", "date_publish": "2025-03-03 12:04:34", "description": "Zola the Collie was once kicked out of obedience school but is now off to Crufts.", "filename": "news_articles_cevx4k4mgvzo_1745641538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5f57/live/7461aa80-f829-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevx4k4mgvzo_1745641538.html", "title": "'Badly behaved' rescue dog Zola to compete at Crufts", "title_page": "'Badly behaved' rescue dog Zola to compete at Crufts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rescue dog that was once kicked out of obedience school and struggled in the company of other dogs is to compete at Crufts.\nZola, a black, white and tan Collie, was being cared for by an animal charity when she was rescued three years ago by Jessica Gibson from Limavady in County Londonderry.\nJessica, 19, said Zola's journey to the world's biggest dog show has not been an easy one.\n\"She had a lot of problems but we worked through them,\" she said. \" I cannot get over how far she has come, she is nothing like the dog she used to be.\"\nWhen Jessica and Zola first met, the Collie was being cared for by rescue charity Pet FBI.\n\"She was very excited, jumping up on the side of the kennel, just buzzing to get out,\" Jessica told BBC Radio Foyle's North West Today.\n\"We took her to obedience school and she got kicked out. She was very bad around other dogs.\"\nIt was then the work began. Jessica watched a raft of online videos and training began in earnest.\n\"I have always liked watching agility, but it seemed so out of reach and I didn't think Zola would be the dog for it.\n\"We started agility training two years ago – it's been a long and hard journey with a lot of set backs,\" said Jessica.", "url": "https://www.bbc.co.uk/news/articles/cevx4k4mgvzo"}