{"authors": ["Stephen Hervieu", "Gemma Daubeney", "www.facebook.com"], "date_download": "2025-04-26 06:31:02", "date_modify": "2025-04-26 06:31:02", "date_publish": "2025-02-27 10:04:44", "description": "Jersey Taxi Drivers' Association says about 300 taxis are now competing for about 25 spaces.", "filename": "news_articles_cx2xk9xve7eo_1745649062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/adfc/live/b5134a00-f461-11ef-bc71-6ff62e3f49fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xk9xve7eo_1745649062.html", "title": "Jersey taxi drivers call for rank spaces to be restored", "title_page": "Jersey taxi drivers call for rank spaces to be restored - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Taxi drivers are calling for the government to restore some of the spaces on a rank which were removed and replaced with disabled parking bays and bike racks.\nThree disabled parking bays were introduced at Library Place in St Helier earlier this month and two spaces were removed from the taxi rank - with one left to \"meet demand\".\nJersey Taxi Drivers' Association (JTDA), external said the islands 300 taxis were now competing for about 25 spaces in the town centre.\nInfrastructure Minister Constable Andy Jehan has defended the decision to remove the spaces and said he believed the requirement for parking taxis had been reduced because consumer habits had changed.\nMr Tostevin said drivers hoped \"common sense would prevail\" and the decision could be changed.\n\"If we can at least not put the cycle racks there, and keep the three spaces and the five or six at the front that is probably adequate.\"\nHe said it made more sense to put bicycle racks on the Esplanade in St Helier, rather than a new taxi rank, which was the minister's plan.\n\"That's no good for shoppers, people with disabilities... but if people are fit enough, to cycle put the cycle racks down there,\" Mr Tostevin said.", "url": "https://www.bbc.co.uk/news/articles/cx2xk9xve7eo"}