{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:16:47", "date_modify": "2025-05-19 15:16:47", "date_publish": "2017-07-05 00:00:00", "description": "News, sport, weather and travel updates for the West of England on Wednesday, 5th July 2017", "filename": "news_live_uk-england-bristol-40496079_1747667807.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-bristol-40496079_1747667807.html", "title": "As it happened: West of England", "title_page": "As it happened: West of England - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Weather for the West\nIt looks like it's going to be hot again tomorrow, with a chance of some thundery showers.\nHere's Sara Thornton with all the details.\nAnd that's all from us for tonight.\nWe'll be back with more news, sport, travel and weather from 7am-10pm tomorrow.\n'Funeral' protest held over incinerator plan\nProtestors returned to Shire Hall in Gloucester for the third time in a week to protest against the waste incinerator being built by the council.\nCampaigners held a fake funeral for the \"death of democracy\" and painted slogans outside.\nThey want the contract cancelled claiming that it's unlawful and needs more public scrutiny.\nThe council said it respects the right to protest but that the incinerator would cut carbon emissions and save over £100m for the taxpayer.\nSecond cave rescue in a week for crews\nFirefighters have rescued a group of people trapped in a Wiltshire cave for the second time in a week.\nDorset and Wiltshire Fire and Rescue worked with Mendip Cave Rescue to free them from the former stone mines in Box after being called at 02:50 BST.\nMartin Grass, from Mendip Cave Rescue, who helped rescue the seven, in their late teens and early 20s, said they were \"cold and inadequately equipped\".\nRead the full story here.\nPolice failed murdered man Bijan Ebrahimi on many levels\nA report has found police failed a man who was murdered in Bristol on many levels, over many years.\nAn IPCC investigation into the Bijan Ebrahimi case found he was treated with disrespect, prejudice and contempt, and was branded an attention-seeker, nuisance and a liar.\nThe 44-year-old repeatedly called police to report harassment and threats, and hours before he was beaten to death and then set on fire by a neighbour, he told police he feared for his life.\nBBC Points West's Charlotte Callen met his former neighbours.\nRoyal visit for the National Star College\nSophie, Countess of Wessex, visited students and staff at The National Star College today.\nIt's just one of the events marking the 50th anniversary of the college based at Ullenwood, Gloucestershire.\nFor the past half-a-century, the college has helped unlock the potential of students with physical and learning difficulties who have come from all over the UK.\nGolden tickets: the Bristol hunt is on!\nGolden tickets have been hidden around Bristol as part of the Colston Hall's 150th anniversary celebrations.\nThere are 21 in total to find. Those that discover one will win a pair of tickets to a concert of their choice.\nThere's also a platinum ticket to find which secures the finder a pair of tickets to as many gigs of their choice between September and February.\nGet hunting!\nEbrahimi: 'Police responding to any incident should keep an open mind'\nA disabled Iranian refugee repeatedly reported death threats and racial abuse to police for seven years before being brutally murdered, a report has found.\nBijan Ebrahimi was beaten to death and set alight on a Bristol estate amid false claims he was a paedophile.\nThe Independent Police Complaints Commission said he had been treated \"consistently differently from his neighbours\" in what could be construed as \"racial bias, conscious or unconscious\".\nClick here to read more.\n23 arrests after drugs warrants in Taunton\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nQuote Message\nToday wasn’t just about taking drug dealers off the street; more importantly it was about protecting vulnerable people who are exploited due to debt, addiction, mental health problems or other issues that make them an easy target. We won’t tolerate it.\nLisa Simpson, C/Insp Avon and Somerset Police\nSafety warning over Box stone mines\nDorset & Wiltshire Fire and Rescue Service is warning people to think twice before visiting the former stone mines below Box.\nFirefighters have attended at Box Hill twice in three days to support Mendip Cave Rescue in bringing groups of people to safety.\nAccording to firefighters anyone intending to explore any underground complex should:\nAlways tell someone where you are going, where you intend to park, and what time you intend to back on the surface – and make sure they have all appropriate mobile phone numbers for contacting you.\nDress appropriately – it can get very cold underground so take warm clothes, even if you don’t think you’ll need them.\nHave more than one torch, fully charged, and make sure all mobile phones are fully charged as well.\nTake water and some snacks.\nUse a map and, where possible, check before you leave that the map is still valid – for example, some entrance points may have been closed off since the map was produced.\nCountry house rescue\nFirefighters practise emergency evacuation of a National Trust property in Somerset.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post", "url": "https://www.bbc.com/news/live/uk-england-bristol-40496079"}