{"authors": ["Annabel Rackham", "www.facebook.com"], "date_download": "2025-04-26 04:14:12", "date_modify": "2025-04-26 04:14:12", "date_publish": "2025-03-04 11:18:09", "description": "The 21-year-old Stranger Things actress has reacted to headlines about her recent media appearances.", "filename": "news_articles_c05m6ld46m1o_1745640852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5be1/live/02e55a10-f8e1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05m6ld46m1o_1745640852.html", "title": "Millie Bobby Brown says journalists are 'bullying' her", "title_page": "Millie Bobby Brown says journalists are 'bullying' her over appearance - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stranger Things actor Millie Bobby Brown has criticised recent press articles about her appearance, saying \"this isn't journalism, this is bullying\".\nThe 21-year-old posted a three-minute video on her Instagram page, in which she called out article headlines and the names of the reporters who wrote them.\nBrown has been on the promotion circuit in recent weeks for the press tour of her new movie The Electric State, whilst also making appearances at the SAG and Brit awards.\n\"I grew up in front of the world and for some reason people can't seem to grow up with me,\" Brown said.\nShe added: \"Instead, they act like I'm supposed to stay frozen in time, like I should still look the way I did on Stranger Things season one. And because I don't, I'm now a target.\"\nThe articles highlighted by Brown criticise her hair, face, body and style, with some insinuating she looks much older than she is.\n\"The fact that adult writers are spending their time dissecting my face, my body, my choices, is disturbing,\" Brown said.\n\"That some of these articles are written by women makes it even worse,\" she added.\nBrown has grown up in the media spotlight since the age of nine, when she appeared in ABC drama Once Upon a Time in Wonderland and BBC America show Intruders.\nHer big break came in 2016, when she was cast as Eleven in the Netflix's sci-fi hit Stranger Things.\nIt led to worldwide recognition for Brown, who was nominated for various accolades at the SAG and Emmy awards.\nIn her social media video, Brown concluded: \"I will not be shamed for how I look, how I dress or how I present myself.\n\"Let's do better, not just for me but for every young girl who deserves to grow up without the fear of being torn apart for simply existing.\"\nBrown has been praised by fellow actors in response to the post, including Sex and the City's Sarah Jessica Parker, who wrote that she was \"enormously proud\".\nBrown's co-star in Enola Holmes, Louis Partridge, commented: \"Well said Millie. Handled with grace.\"\nFellow former child actor and The Handmaid's Tale star Mckenna Grace added: \"No young woman or person deserves to feel pressure or cruelty for simply existing. You are so well spoken and so beautiful. Very well said, thank you for making this video.\"", "url": "https://www.bbc.co.uk/news/articles/c05m6ld46m1o"}