{"authors": ["Graham Fraser", "www.facebook.com"], "date_download": "2025-04-26 06:56:12", "date_modify": "2025-04-26 06:56:12", "date_publish": "2025-02-28 15:07:47", "description": "The internet chat and phone service, which is owned by Microsoft, made the announcement on X.", "filename": "news_articles_cn7vxlrvxyeo_1745650572.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9fd5/live/cfb9db20-f5e3-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vxlrvxyeo_1745650572.html", "title": "Skype announces it will close in May", "title_page": "Skype announces it will close in May - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Skype, the video-calling service that had hundreds of millions of users, is closing in May, its owner Microsoft has said.\nIt was once one of the world's most popular websites and allowed people to make voice calls via their computers to friends and family all over the globe for free.\nSkype was not the first or only company offering this service but by allowing the public to make computer-to-computer calls free, it helped popularise the concept.\nIn an announcement on X, external, Skype said users can sign in to Microsoft Teams with their account to stay connected with all their chats and contacts.\nMicrosoft made no immediate comment when contacted by BBC News.\nFirst released in 2003, Skype was bought by the tech giant in 2011 for $8.5bn (£6.1bn) - its biggest-ever acquisition at the time.\nAs Microsoft once outlined, external, Skype became integrated with the company's other products such as Xbox and Windows devices.\nIn December 2010, tech industry commentator Om Malik called it one of the \"key applications of the modern web\", when the website suffered a two-day global outage.\nFollowing news of its imminent closure, Skype users past and present described their memories of using the service for video calls and the impact it had on their lives.\n\"My best friend and I share many good memories on Skype,\" one X user said. \"This is a sad day and almost a feeling of losing yet another fragment of my adolescence.\"\nAnother early user of Skype called Louise told the BBC she and her partner used the service to chat when they \"embarked on a transatlantic relationship\".\n\"Skype was such an exciting invention at the time - before smartphones and WhatsApp calls,\" she said.\n\"It's so easy to assume that we've always been able to freely talk to people across the world but that's such a recent development really.\"\nAnna Simpson, from digital marketing firm Cedarwood Digital, posted on LinkedIn, external that she would video-call her grandparents on Skype after they moved to France nearly 20 years ago.\n\"Back then, it felt like magic,\" she wrote. \"There were no dodgy international call charges, just a quick dial-up and some pixelated faces keeping us connected.\n\"Skype led the way for video calls. But now it's officially done. Microsoft is pulling the plug, but honestly... it's been on life support for years.\"\nWhen Microsoft bought Skype, the company was buying into an app that had been downloaded one billion times and had hundreds of millions of users.\n\"Together we will create the future of real-time communications,\" Microsoft chief Steve Ballmer said at the time.\nBut as WhatsApp and Facebook Messenger grew in popularity, Skype was waning.\nIn 2017, Microsoft redesigned Skype, with some features looking very much like rival Snapchat. Users were not happy.\nAt the time, Rachel Kaser, a reporter at The Next Web, said: \"People are annoyed by this update to the Skype app because it's fixing something that was never broken to begin with.\"\nIn June 2021, speculation persisted that it was the beginning of the end for Skype.\nWhen Microsoft announced Windows 11, its new operating system, it stated that Microsoft Teams would be integrated by default, while Skype, for the first time in years, was not.\nTeams had seen a boost in popularity during the Covid pandemic as people moved their work and personal meetings online.\nAs the news of Skype's closure was announced, Microsoft published a blog post, external from Jeff Teper, the company's president of collaborative apps and platforms.\nIn it, he said the company wants to streamline its free services to focus on Teams.\n\"With Teams, users have access to many of the same core features they use in Skype, such as one-on-one calls and group calls, messaging, and file sharing,\" he said.\n\"Additionally, Teams offers enhanced features like hosting meetings, managing calendars, and building and joining communities for free.\"\nSkype users now have a choice – move over to Microsoft Teams or export their Skype data including chats, contacts and call history, the post added.\nFor Skype customers who pay for some features, Microsoft said they will be able to use their service up, external until their next renewal period.", "url": "https://www.bbc.co.uk/news/articles/cn7vxlrvxyeo"}