{"authors": ["Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 04:23:24", "date_modify": "2025-04-26 04:23:24", "date_publish": "2025-03-03 13:18:47", "description": "A choir of people directly affected by the Post Office scandal deliver a moving performance.", "filename": "news_articles_c7vz7q75dd2o_1745641404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c969/live/f3486840-f822-11ef-8e9e-47bc43726032.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7vz7q75dd2o_1745641404.html", "title": "Worthing singer and Post Office choir deliver moving BGT entry", "title_page": "Worthing singer and Post Office choir deliver moving BGT entry - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Worthing singer delivered a moving performance on ITV's Britain's Got Talent alongside a choir made up of people directly affected by the Post Office Horizon scandal.\nThe 40-strong choir, Hear Our Voice, sang a rendition of \"Falling Down\" written and led by Will Rendle, of Will and the People\nThe performance earned a standing ovation from the audience and the judges on Saturday.\nOne of the choir members, Teju Adedayo, who ran a Post Office in Gillingham, Kent, told BBC Breakfast her voice had been \"suppressed for a very long time\".\nIn 2006, Ms Adedayo was convicted of false accounting and given a 50-week prison sentence, suspended for two years.\nHer conviction was overturned in 2021.\nShe told BBC Breakfast that before the performance, she \"chickened out\" because her \"nerves were all over the place\" but then decided \"let's just do it\".\nShe said: \"I wanted to release the stress that we have all been put under.\n\"I'm grateful we are all standing together.\"\nIn a statement, the Post Office said it was \"deeply sorry for the suffering caused to so many people by Post Office's past actions\".\nIt said it acknowledged that victims of the scandal needed answers, as well as justice and redress.\nA spokesperson said: \"The business failed to put postmasters first, did not listen to postmasters, and did not act on concerns postmasters raised with us.\n\"We are doing all we can to help get victims answers, including fully co-operating with police investigations to help try to put things right.\"\nFujitsu Group, which developed the software Horizon, said it offered its deepest apologies to the sub-postmasters and their families.\nIts spokesperson added: \"Fujitsu Europe's boss has previously said that the firm has a 'moral obligation' to contribute to compensation for sub-postmasters wrongly prosecuted as a result of its faulty IT software.\"", "url": "https://www.bbc.co.uk/news/articles/c7vz7q75dd2o"}