{"authors": ["Megan Bonar", "www.facebook.com"], "date_download": "2025-04-26 03:49:36", "date_modify": "2025-04-26 03:49:36", "date_publish": "2025-03-05 13:30:01", "description": "Daniel Parker, 37, killed his 78-year-old mother Margaret at their home in Edinburgh last May.", "filename": "news_articles_cvgwnyj2elwo_1745639376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a1d3/live/ca6dda30-1872-11ef-80aa-699d54c46324.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwnyj2elwo_1745639376.html", "title": "Crossbow killer said 'devil' made him attack his mother", "title_page": "Crossbow killer said 'devil' made him attack his mother - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who used a crossbow to kill his mother told police officers that the \"devil\" made him do it, a court has heard.\nDaniel Parker, 37, killed 78-year-old Margaret Parker at their home in Fernieside Crescent, Edinburgh, on 21 May 2024.\nThe High Court in Edinburgh heard Parker - who was suffering from a serious mental health condition - had also fired a crossbow at his sister Deborah McGlashan and Sarah Manifold, a neighbour.\nParker, now a patient at Carstairs State Hospital, was acquitted of all charges after a special defence was submitted on his behalf.\nThe court heard Parker believed his mum was poisoning his food and that cameras had been installed in the house to watch him.\nHe believed that his family had betrayed him and that his life was like the Jim Carrey film The Truman Show, in which a man's life is revealed to be a fictional television programme.\nProsecutor Margaret Barron told the court: \"At 08:45 hours paramedics attended at the locus and knocked at the front door but received no answer.\n\"The paramedics heard the women with Deborah McGlashan screaming 'help her, she's been shot'.\"\nThey retreated to await a police response.\nMs Barron continued: \"A piercing scream was heard from inside the locus which lasted for approximately 10 seconds and at 09:15 hours Mr Parker shouted at the police 'because of you lot, me and my mum are going to die today'.\"\nFirearms officers arrived at the scene at 09:33 and forced entry through the rear of the house. They found Daniel Parker in an upstairs cupboard, where he told them he was unarmed.\n\"At 09:48 hours, Daniel Parker was arrested on suspicion of attempted murder and cautioned. He intimated that he understood and stated that he was guilty and 'I did this because of the devil'\", Ms Barron said.\nMrs Parker was found unresponsive, lying on the bed in her bedroom with a crossbow bolt in her hand and shoulder as well as a large laceration to her neck.\nShe could not be resuscitated.\nA post-mortem examination found she had sustained four incised wounds to her neck, one bolt wound to her neck and 11 bolt wounds to her torso among other injuries.\nMs Barron described her as a \"much-loved grandmother\", who \"other than a few minor ailments, was in good health.\"\nJudge Lady Ross told Parker that he was acquitted of the charges and imposed a interim compulsion order on him for treatment at the state hospital.\nHe was also found not guilty of breaching firearms legislation by having a stun gun in his possession.\nMs Barron told the court that the Crown accepted not guilty pleas after psychiatrists concluded that his mental health was so poor that he didn't \"appreciate the nature or wrongfulness of his conduct\".\nThe advocate depute said that Parker was diagnosed with a \"recurring personality disorder\" in 2021 and that doctors described him symptoms as a \"paranoid personality trait\".\nParker moved in with his mother in February 2023 and during that time his mental health had noticeably deteriorated.\n\"He would not take his medication and a delusion took hold that a gang was out to get him,\" Ms Barron added.\nJudge Lady Ross said: \"Having regard to the psychiatric evidence, I acquit you of the charges on this indictment by reason of the special defence lodged on your behalf.\"\nShe continued the matter for 10 further weeks.\nParker will next appear at the High Court in Edinburgh in May for the court to consider a final disposal.", "url": "https://www.bbc.co.uk/news/articles/cvgwnyj2elwo"}