{"authors": ["Keiron Tourish", "www.facebook.com"], "date_download": "2025-04-26 06:49:34", "date_modify": "2025-04-26 06:49:34", "date_publish": "2025-03-01 09:43:39", "description": "A Derry girl band who supported Snow Patrol say it was one of the biggest nights of their lives.", "filename": "news_articles_cly21588wyzo_1745650174.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3713/live/0cede050-f674-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly21588wyzo_1745650174.html", "title": "CHERYM: The 'Derry Girls' supporting Snow Patrol", "title_page": "CHERYM: The 'Derry Girls' supporting Snow Patrol - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's the biggest night of our lives – one hundred percent.\"\nThis is what Alannagh Doherty, drummer with Derry band CHERYM, had to say following the thrill of supporting Snow Patrol in Belfast.\nThey played to a packed SSE Arena on Friday night.\nLead singer Hannah Richardson got them the gig simply by asking Snow Patrol's Gary Lightbody in person if they could join his band's tour.\nIt was a \"special night,\" the group says.\n\"We take a big inspiration from punk and rock music with a local twist,\" Hannah explains.\n\"And we talk about issues that affect us as women, as queer people here in Derry, and we just have a lot of fun doing it.\"\nHannah and Alannagh had known each other before bass guitarist Emer McLaughlin came on board last January.\n\"Myself and Alannagh, who's a brilliant drummer, knew Emer as she went to the tech, the same as us and the music scene here in Derry is so small,\" said Hannah.\n\"Everybody knows everybody and she's a phenomenal bass player, so it was amazing to get her on board with the band.\"\nThe big break in supporting Snow Patrol came about when Hannah seized the moment and approached Gary Lightbody at a music conference in Belfast.\n\"He was speaking about his experience in music and I just asked him: 'Is there any chance we can come on board maybe for a date on the tour?\n\"And he took our album and said that he knew us and he was a fan of the band and here we are!\n\"So, really exciting. It's absolutely amazing,\" Hannah said.\nBass player Emer McLaughlin was equally thrilled at the opportunity of a lifetime.\n\"I'm so incredibly excited and honoured to be supporting giants Snow Patrol in the SSE Arena.\n\"This has been a literal dream come true for us as an upcoming band in so many ways.\n\"It's such a landmark venue - it's our first ever arena show - and to be supporting a fellow Irish band like Snow Patrol just makes it such an unbelievable experience.\"\nThe members of CHERYM say that when it comes to the music industry they, like many other young bands, need as much exposure as possible in order to progress in a very competitive industry.\n\"This is probably the biggest level of exposure we've ever had,\" says Alannagh.\nAlthough CHERYM are signed to a small independent record label called Alcopop Records, who they say are so artist-friendly, Alannagh says it is \"extremely difficult\" to make a name for yourself.\n\"I saw an article by Sam Fender where he was speaking about the music industry very recently and how ninety per cent of it are people who come from middle-class and upper-class backgrounds.\n\"Whereas for a working-class band it is very, very difficult to do that.\"\nAlannagh explained that CHERYM's members rely on funding and other support \"to actually be able to pay our petrol money on the way home and to be able to make a living out of this\".\n\"Some of us have full time jobs in order to make this work,\" she said.\n\"So we have to have a second job in order to pursue our actual passion.\"", "url": "https://www.bbc.co.uk/news/articles/cly21588wyzo"}