{"authors": ["Zac Sherratt", "www.facebook.com"], "date_download": "2025-04-26 06:55:20", "date_modify": "2025-04-26 06:55:20", "date_publish": "2025-02-28 15:32:47", "description": "The hospital is hiring a doctor whose duties include caring for people stuck in its corridors.", "filename": "news_articles_cm2ddz0r0zlo_1745650520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f71/live/162341e0-f5e5-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2ddz0r0zlo_1745650520.html", "title": "Royal Sussex hospital updates advert for corridor role", "title_page": "Royal Sussex hospital updates advert for corridor role - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hospital in East Sussex is hiring a doctor to design and implement a \"toolkit\" to better treat elderly and frail people in its corridors.\nThe Royal Sussex County Hospital, in Brighton, said the doctor would treat patients held in corridors due to a lack of beds, and across its emergency department.\nProf Katie Urch, chief medical officer at University Hospitals Sussex NHS Foundation Trust, said: \"We all understand that corridor care is not acceptable and that we must continue our progress towards eliminating it.\"\nThe hospital removed the advertisement from its website on Thursday and reinstated an updated version on Friday, but would not confirm why.\nThe trust removed reference to corridor care in the updated advertisement, but kept it in the role's job description.\nIt previously explained that as well as caring for patients, the doctor would also work to find new ways to help vulnerable people from needing to come to hospital at all.\n\"The delays that patients are experiencing in our hospitals, including corridor care, are linked to challenges across our entire health and care system,\" said Prof Urch.\n\"The challenges cannot be solved by us alone, and need collective solutions.\n\"To support this, the role is focused on the care of frail elderly patients to avoid unnecessary hospital admissions and to ensure the most appropriate inpatient assessment and care.\"", "url": "https://www.bbc.co.uk/news/articles/cm2ddz0r0zlo"}