{"authors": ["Simon Dedman", "www.facebook.com"], "date_download": "2025-04-26 04:32:38", "date_modify": "2025-04-26 04:32:38", "date_publish": "2025-03-03 05:25:24", "description": "The proportion of people in Thurrock who were not born in the UK has nearly doubled.", "filename": "news_articles_c14n6l1d8nzo_1745641958.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/46d2/live/2b401a40-f607-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14n6l1d8nzo_1745641958.html", "title": "Why Thurrock is fast becoming a multi-cultural home", "title_page": "Why Thurrock is fast becoming a multi-cultural home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Half of the people born outside of the UK in Thurrock are European, according to the 2021 Census, external.\nOver the last decade, the number of Romanians in the district has gone from about 300 to 5,200.\nWalking down Grays High Street, there is now a Romanian supermarket, cake shop and an accountancy company catering for the community.\nThis is the firm that Marin Gobjila opened a year ago.\n\"I believe here you can find cheaper rents and places to work that brought our community closer to areas like Grays,\" says Mr Gobjila, who moved to Essex four years ago.\n\"It's cheaper than London.\n\"Amazon is the main thing [Romanian] people go to [for work].\"\nRomanian Silvian Marin came to work in the UK in 2012. He and his wife later moved from London to South Ockendon.\nHe now runs his own travel and transportation company.\nThe 42-year-old says Romanians typically moved to Thurrock to raise their families, and had \"integrated in the community\".\n\"When I decided to purchase a house, we decided to look for somewhere very quiet and where we can send the kids to the park by themselves. It takes me 25 minutes to get to central London. I think most Romanians had the same idea.\"\nAlongside the Romanian businesses are several hairdressers and barbers aimed at African communities, Asian food stores and Turkish restaurants.\nBubble tea and bao buns are available, but you can still get the ubiquitous Essex pie and mash.\nGillian Rainbow was born and grew up in Thurrock and says the area has \"really changed\" in the last 15 years - and, in her view, not for the better.\n\"There's not as many locals as there used to be. Things have really changed,\" explains the 62-year-old, who volunteers at the Grays Town Park Cafe.\n\"It's not as vibrant, it's not as homely. It's just got so many different things.\n\"If you walk into Grays, it's mainly chicken shops, takeaways and charity shops.\n\"Whereas before there were clothes shops, ironmongers - you could get everything you wanted. Now you can't.\"\nOn the growth of new communities in the area, Ms Rainbow says: \"It's not bad, it's OK.\n\"A lot of the older people that were Thurrock-based have moved out and have gone more rural.\n\"They wanted to go more quieter because it is a busy place.\"\nAfter England, Nigeria is the country where most people living in Thurrock were born - representing 3% of its population.\nThe total number of Nigerians has increased by 62% between 2011 and 2021 - up to 5,500 in the district.\nRuth Onafuye's family moved to Tilbury from London in the 1990s.\nGrowing up, she says they were the only Nigerians living on their street for five or six years.\n\"All of a sudden, Nigerian families started flocking in.\"\nMs Onafuye - who is laughing over biscuits with her sister Rachael in the Thameside Complex - recalls: \"Our dad likes to think he was a trend setter\n\"He is always like 'ah they came because we came!'.\"\nThe pair are both teachers and run their own education business.\nFor Nigerian-born Adekunle Omirin, the large African community already in Essex was the main pull factor for his partner and two daughters, who are from Hendon in north-west London.\n\"Family, community, was very key. The Nigerian community is very, very strong round here.\n\"I wanted an enabling environment where my kids can play in the park because compared to what you have in north London, with all the police vans, it is a very busy place.\"\nThe 42-year-old says food was a big factor too: \"For someone like me I still love to eat our African dish - I would not live somewhere where I could not easily get it!\"\nRacheal Onafuye, 26, agrees: \"When we were quite young we were still going to Upton Park to do our hair for so many years.\n\"But for 10 years - we found our Essex hairdresser who is down the road and she moved from London.\"\nHarlow has the second highest proportion of people born outside of the UK in Essex. Most are European with about 2,100 people born in Romania and 1,800 born in Poland.\nOn the other hand, 94.7% of residents in Rochford were born in England.\nIt is in stark contrast to London, where 41% are born abroad.\nEssex district % population born outside of the UK in 2021\nThurrock 21%\nHarlow 18.3%\nColchester 14.5%\nEpping Forest 13.9%\nSouthend-On-Sea 12.5%\nChelmsford 11.9%\nBasildon 11.8%\nBrentwood 11.2%\nUttlesford 8.7%\nBraintree 7.2%\nTendring 5%\nCastle Point 4.8%\nMaldon 4.5%\nRochford 4%\nSource: Census 2021, external", "url": "https://www.bbc.co.uk/news/articles/c14n6l1d8nzo"}