{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 07:28:20", "date_modify": "2025-04-26 07:28:20", "date_publish": "2025-02-27 18:58:37", "description": "Sean Kershaw, 43, died in a collision on Hangman Stone Lane in Doncaster in June 2023.", "filename": "news_articles_c0jggzxjx0do_1745652500.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/34e6/live/05796fc0-f52e-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jggzxjx0do_1745652500.html", "title": "Biker killed in Doncaster due to hedge blocking driver's view", "title_page": "Biker killed in Doncaster due to hedge blocking driver's view - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An overgrown hedge that impaired a driver's view as he was pulling out onto a road led to a crash in which a motorcyclist died, a coroner has concluded.\nSean Kershaw, 43, died when his motorbike collided with a Nissan pickup on Hangman Stone Lane, High Melton, Doncaster, on the afternoon of 13 June 2023.\nAn inquest at Doncaster Coroner's Court heard on Thursday that when the pickup driver pulled out onto the carriageway, he did not see Mr Kershaw, a father-of-three from Castleford, in time.\nFollowing the inquest's conclusion, Mr Kershaw's family paid tribute to him, describing him as \"the best dad and best husband\", who would always give his time and attention generously to others.\nThe inquest heard that Mr Kershaw, who was born in Bradford, had been on his way home from work at Senior Architectural Systems in Denaby when the collision happened.\nThe driver of the pickup was the manager of the nearby windfarm in Marr, who had wanted to exit the site and turn right onto Hangman Stone Lane, the court was told.\nThe driver's view was obstructed by a vehicle parked in a lay-by and a hedgerow with \"thick foliage\", and because of this, he positioned his vehicle towards the left to have more sight of the road.\nForensic collisions investigator Grant Anderson told area coroner Louise Slater that the driver's view when edging out of the mouth of the junction would have been impaired substantially by the hedge.\n\"It is likely the vehicles were not visible to each other until the motorcycle was approximately 35 metres from the point of collision,\" Mr Anderson said.\nThe investigator agreed there was insufficient time for the driver to cross the carriageway with the view he had.\nThe court heard the hedge had been planted in 2014 by the owners of the windfarm, Banks Renewables, now known as OnPath Energy.\nDan Thomas, the firm's former operations manager and lead director for health and safety, said site inspections were carried out monthly.\nRecords showed the hedge had been trimmed in August 2021 and again in September 2022 and was not identified as a hazard before the collision, Mr Thomas said.\nFollowing the fatal collision, parts of the hedge were removed to improve visibility, he added.\nOnPath Energy has been approached for comment.\nThe court heard there was no evidence of speeding or mobile phone usage by either the pickup driver or Mr Kershaw, and toxicology reports confirmed neither of them had any alcohol or drugs in their system at the time.", "url": "https://www.bbc.co.uk/news/articles/c0jggzxjx0do"}