{"authors": ["Marie-Louise Connolly", "www.facebook.com"], "date_download": "2025-04-26 04:18:36", "date_modify": "2025-04-26 04:18:36", "date_publish": "2025-03-04 06:26:10", "description": "Suzy Spence was diagnosed with a tumour in her salivary gland and the surgery could have caused facial paralysis.", "filename": "news_articles_cgr25lgqz40o_1745641116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d5b2/live/2bab71c0-f821-11ef-8e9e-47bc43726032.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgr25lgqz40o_1745641116.html", "title": "Woman praises 'hero' surgeons who saved her smile", "title_page": "Woman praises 'hero' surgeons who saved her smile - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who had pioneering surgery to remove a tumour has described her surgeons as \"heroes\" after they avoided facial paralysis and managed to save her smile.\nSuzy Spence, from Carrickfergus in County Antrim, was diagnosed with a tumour in her salivary gland in December 2023 and was warned that a cancer diagnosis could not be ruled out.\nAs the facial nerve was wrapped round the tumour, the 28-year-old was warned surgery could cause partial facial paralysis, which could prevent her from being able to smile.\nHer family found specialists privately in London who used a radical technique involving an MRI scan and a hologram.\nThat provided surgeons with more accurate positioning of the nerve and tumour, which meant they could operate with greater precision and confidence that her face would remain unchanged and her smile would be saved.\nAccording to the surgeons, the radical technique is \"breaking taboos\" in the world of surgery.\nPR consultant Ms Spence first felt a lump behind her ear in September 2023 when she was putting in an earring.\nAfter several visits to her GP and dentist she was referred to her local hospital for an ultrasound and she was red-flagged as needing urgent care.\nWith a risk of cancer, the family paid privately for an MRI scan which confirmed a tumour.\n\"There was the risk of cancer and there was also the risk of severe or temporary facial paralysis - it was very scary,\" Ms Spence said.\nShe was told she required parotidectomy surgery which involved removing part of a major salivary gland in her cheek called the parotid gland.\nThe positioning of the parotid gland was important as it was preventing the tumour from damaging facial tissue or harming important nearby structures, including the facial nerve.\nWhile surgeons could have performed the operation in the Belfast Health Trust, Ms Spence's family found a specialist oral and neck cancer surgical team in London.\nThey offered pioneering treatment that used a high-tech MRI scan which produced a hologram that identified the exact position of the tumour and the facial nerve before the surgery.\nAxel Sahovaler, a head and neck surgeon who operated on Ms Spence, said the \"minimalist invasive approach\" was rare and practiced by only a few surgeons.\nMr Sahovaler said the procedure had several benefits, including lowering the risk of facial nerve weakness and lowering the risk of the patient developing Frey's syndrome, a rare neurological disorder which can cause a person's face to sweat when they should be salivating.\nIt also causes less disruption to the shape of the face.\nThe surgery took place in London in January 2024.\nHours after the operation, Ms Spence's mum, Margie Butten, visited her daughter and was relieved to see her sitting up in bed and smiling.\n\"She was in surgery for some hours; my other daughter and I just wandered around London waiting for the call, we were so worried,\" she said.\n\"Then we got the phone call to say she was out of surgery and to see her sitting up in bed with such a beautiful smile, such a beautiful girl - it had all been worth it, \" Ms Butten said.\nThe MRI scan and the 3D model provide surgeons with greater accuracy as to where exactly the tumour is going to be in relation to the facial nerve; it also means they can establish a surgical plan before going into theatre.\nMr Sahovaler said there was a small risk to one of the branches of the facial nerve, but knowing this beforehand and being able to plan around it meant the operation was smoother.\nMs Spence said the experience had made her realise how \"fragile life is\".\n\"I was so lucky that my family found the surgeons and that I was able to go to London,\" she said.\n\"Being able to smile is one of those things you don't really think about until you think that it suddenly might be taken away from you and at such a young age. I was just scared of losing that.\"\nThe family has not revealed the cost of the private operation, which involved flights and hotel accommodation, but Ms Butten said there were no regrets and that it was \"money well spent\".\n\"While we had the money, to be honest, if we hadn't, I think I would have remortgaged the house,\" she said.\n\"At that age, to have been left in that position, it would have been life-changing.\"", "url": "https://www.bbc.co.uk/news/articles/cgr25lgqz40o"}