{"authors": ["Lucy Acheson and Thomas Copeland", "www.facebook.com"], "date_download": "2025-04-26 07:25:40", "date_modify": "2025-04-26 07:25:40", "date_publish": "2025-02-28 00:00:26", "description": "Disability Rights UK and the RNIB are warning that a cashless society could create barriers for disabled people.", "filename": "news_articles_cp3yz40r2zyo_1745652340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fad1/live/c8fe2640-f52c-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yz40r2zyo_1745652340.html", "title": "Disability charities urge government to protect cash", "title_page": "Disability charities urge government to protect cash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leading disability charities have called on the government to ensure that people will continue to be able to use physical cash in shops.\nIt comes after a government minister said that shops will not be forced to accept cash, despite concerns that millions of vulnerable people rely on it.\nDisability Rights UK (DRUK) and the Royal National Institute of Blind People (RNIB) are warning that making card payments the default creates \"more barriers\" for disabled people.\nThe BBC has heard from disabled people and their families who fear losing access to cash would limit their independence.\nReece Kinsman, 31, from Manchester, has Williams Syndrome, a rare genetic disorder, external that is characterised by a neurodevelopmental disability.\nHe relies on cash to manage his money, as he struggles to track his spending when using a card.\nOn a recent trip to New Brighton, Merseyside, Reece was left panicked and upset when a fast-food restaurant told him they didn't accept cash.\n\"I was disappointed really, I didn't know what else to do. It was just card, and it's not easy because I've got cash only,\" he says.\nLuckily his support worker was with him and covered the cost on her card.\nReece's mum, Ann-Marie, says handling physical money has given Reece a tangible sense of control over his finances - one that could be threatened if cash is phased out.\n\"Reece's level of understanding is around about a six-year-old. We give him cash because it's better for him to go out in the community and be able to learn how much money is needed to pay for things.\"\nLast month, Emma Reynolds, the new Economic Secretary to the Treasury, told MPs that shops and service providers would not be required to accept cash. However, she assured the Treasury Committee that the UK would not go fully cashless anytime soon.\nBut with more than 16 million disabled people in the UK, external, many relying on cash, charities DRUK and RNIB are urging the government to ensure continued access to cash and banking.\nFazilet Hadi, DRUK's head of policy, says the government must \"step in and provide clear guidance\".\n\"The last government proposed legislation requiring businesses to accept cash as an alternative, but that didn't go forward. In the absence of that, new legislation is needed.\"\nMeanwhile, the RNIB emphasises the importance of offering \"a choice of payment options,\" including cash, adding \"there is no one-size-fits-all solution for blind and partially sighted consumers\".\nJack Hickinbotham, 29, from Hereford, has autism, epilepsy and severe learning disabilities. He enjoys the sense of confidence that comes with directly handling cash.\n\"I feel independent and I like speaking to people.\"\nHi mum and carer, Nicola, says that without cash, Jack wouldn't know how much money he had available.\n\"We were in the flower shop on Saturday and Jack wanted to buy a packet of mini eggs. They were £4.95, so I gave Jack a £5 note and he was able to pay with that.\n\"That's a really big thing for Jack and for his learning skills too.\"\nSamantha Smith, 53, from Rotherham, is registered blind and says using cash is a necessity, as she has only 2-3% of her vision left and can't see the numbers on card machines to verify transactions.\n\"Blind people rely on cash, so this will have an impact on the whole blind community.\"\nSamantha also worries a cashless society could leave her more vulnerable to scams and theft - something she has already experienced.\n\"At Christmas two years ago, I went out to pick up a few last presents. I had my handbag and my purse taken off me. I only lost about £10 in cash that was in the purse. I'd be fearful that if they had taken a card, they would have had access to all of my money.\"\nA Treasury spokesperson said: \"Individual businesses can decide which payment methods they accept, but new rules introduced by the Financial Conduct Authority aim to ensure that businesses can deposit cash, helping those who want to keep accepting it.\"", "url": "https://www.bbc.co.uk/news/articles/cp3yz40r2zyo"}