{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:39:00", "date_modify": "2025-04-26 04:39:00", "date_publish": "2025-02-28 09:46:24", "description": "Five riverfronts sites were bought in December to help expand student numbers in Londonderry.", "filename": "news_articles_cx2eezzyz3do_1745642340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ce6/live/4483dc40-f5b6-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eezzyz3do_1745642340.html", "title": "Magee: Funding 'not yet in place' to redevelop Derry campus land", "title_page": "Magee: Funding 'not yet in place' to redevelop Derry campus land  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Funding is \"not yet in place\" to redevelop five riverfront sites in Londonderry which have been earmarked to help Ulster University (UU) reach 10,000 students at the Derry campus, its vice-chancellor has said.\nThe land was bought in December last year from businessman Garvan O'Doherty as part of expansion plans for the campus, formerly known as Magee.\nOn Thursday, Economy Minister Dr Caoimhe Archibald said UU now had the land it needed to expand, following the additional purchase of the Timber Quay office block on the Strand Road.\nProfessor Paul Bartholomew said Timber Quay will eventually cater for up to 700 students, but redeveloping the other riverfront sites would take time.\nSpeaking to BBC Radio Foyle's North West Today on Friday morning, Mr Bartholomew said the acquisition of the Timber Quay site was a \"good news story\" for their immediate expansion plans, but that long-term goals for the other sites would need further scrutiny.\n\"We have just bought land and the land is there as an option,\" he said.\n\"As I said, we don't have a crystal ball in terms of the shape of the growth going forwards, but we certainly need land to accommodate whatever we are going to do.\n\"Of course, buildings take a long time to build and the overall funding for that endeavour isn't yet in place as we know, we are going year-by-year, but this is a good news story for what we need to do for our growth this coming year.\n\"We are already full on our campus, so we need Timber Quay for this coming September.\"\nThe most recent purchase comes after a report on boosting student numbers at the campus was published last year.\nThe report said the increase to 10,000 students by 2032 would help address regional imbalance and be \"transformative\" for the north west region.\nThe university currently has about 5,335 students enrolled in its Derry campus this academic year.\nPaul Bartholomew said the total number of students will surpass 6,000 in the 2025/26 academic year with the Timber Quay site.", "url": "https://www.bbc.co.uk/news/articles/cx2eezzyz3do"}