{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:21:15", "date_modify": "2025-04-26 04:21:15", "date_publish": "2025-03-03 14:54:21", "description": "Three men are sentenced after a man fell from the back of a van being driven by motorbike thieves.", "filename": "news_articles_c7890exrz12o_1745641275.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6b16/live/5cee2fc0-f83a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7890exrz12o_1745641275.html", "title": "Southport van fall victim 'unable to engage in world' says family", "title_page": "Southport van fall victim 'unable to engage in world' says family - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who was seriously injured after he fell from the back of a van while trying to stop his motorbike from being stolen has been left \"unable to engage with the world as he once did\", his family have said.\nThe now 21-year-old, who remains in hospital after the July 2024 attack, suffered head and chest injuries after falling from the moving Peugeot Boxer van on The Promenade in Southport.\nMason McLean, 20, of Liverpool, has been sentenced at Liverpool Crown Court to six years and eight months in custody for causing serious injury by dangerous driving and conspiracy to steal a motor vehicle.\nThe victim's family said it was \"heartbreaking\" to witness his ongoing struggles.\nIn a victim impact statement, the family said: \"His once bright and hopeful demeanour has been replaced by sadness, confusion and frustration.\"\nTwo other men have also been jailed in connection with the incident.\nDylan Tollitt, 24, of Toxteth, was jailed for four years and four months for conspiracy to steal a motor vehicle and an unconnected charge of possession with intent to supply drugs.\nLeroy Agatha, 23, of no fixed address, was jailed for three years for conspiracy to steal a motor vehicle.\nDet Ch Insp Nick Suffield, of Merseyside Police, said the man was the victim of a \"shocking incident\" which had left him with life-changing injuries.", "url": "https://www.bbc.co.uk/news/articles/c7890exrz12o"}