{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:49:26", "date_modify": "2025-04-26 06:49:26", "date_publish": "2025-03-01 10:00:18", "description": "Foster, who played Christian Wright, gets a jail term of more than eight years but remains at large.", "filename": "news_articles_c86pj0dg7ejo_1745650166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/66c8/live/88824850-f679-11ef-b3b4-819a5c0aa1c3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pj0dg7ejo_1745650166.html", "title": "Brookside star Philip Foster jailed for modelling fraud", "title_page": "Brookside star Philip Foster jailed for modelling fraud - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former Brookside actor who masterminded a £13.6million fraud operation that conned thousands of would-be models has been jailed.\nPhilip Foster, 49, who played Christian Wright in the Liverpool soap, ran a network of fake modelling agencies for more than eight years.\nFoster, who lived in Marbella, Spain, was given an eight-and-a-half-year prison sentence at Sheffield Crown Court on Friday for conspiracy to defraud.\nEight other people were sentenced in relation to the fraud and an arrest warrant was issued for Foster and an associate after both failed to appear in court.\nMore than 6,000 victims parted with money on the false promise of securing paid modelling work from Foster, whose address was given as Chermside Road, Liverpool, but who operated from his base in Spain.\nHe used a network of associates in England to operate a string of sham modelling agencies and photography studios in cities including London, Manchester, Leeds, Bristol, Coventry and Nottingham.\nThe scam was uncovered in a six-year investigation by National Trading Standards (NTS).\nAfter sentencing, NTS chairman Lord Bichard said Foster's \"cruel exploits left thousands of victims in serious debt, causing lasting emotional distress and significant financial pressures\".\nVictims first received emails telling them they had potential after they responded to a social media advertising campaign.\nThey were invited to a \"free\" test shoot at a photographic studio where they were handed glossy brochures and told they had passed their studio test, but would need to buy a portfolio of images for the modelling agencies who were interested in them.\nSome victims used credit deals arranged by the fraudsters or expensive payday loans to make the upfront payment.\nIn return, they got poor quality digital photographs which stood no real chance of landing them professional jobs and most did not get paid modelling work.", "url": "https://www.bbc.co.uk/news/articles/c86pj0dg7ejo"}