{"authors": ["Lucy Ashton", "www.facebook.com"], "date_download": "2025-04-26 04:25:08", "date_modify": "2025-04-26 04:25:08", "date_publish": "2025-03-03 12:15:53", "description": "Snake Pass is an example of poor transport links in the north, two regional mayors have said.", "filename": "news_articles_c3d84z72pm8o_1745641508.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9f95/live/037a0060-f81a-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d84z72pm8o_1745641508.html", "title": "Snake Pass closures need to be tackled say regional mayors", "title_page": "Snake Pass closures need to be tackled say regional mayors - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Regional mayors are trying to find a solution for the Snake Pass as frequent landslips keep closing the key route between the north's biggest cities.\nThe 12-mile section of the A57, which connects Manchester and Sheffield, is managed by Derbyshire County Council (DCC) but it has warned it cannot afford to keep repairing it.\nSouth Yorkshire Mayor Oliver Coppard and Greater Manchester Mayor Andy Burnham said the frequent closure of the road was an example of poor transport links in the north.\nBurnham said: \"They [DCC)] are not particularly concerned about whether people can get from Manchester to Sheffield - it's not their main priority.\"\nThe Department for Transport said highway maintenance funding was given to DCC and it had to decide how best to spend it - whether on local issues such as potholes or on more major repair works to Snake Pass.\nDCC said it was being forced to make difficult choices with a limited budget and it has called on the government to create a national landslip fund.\nThe mayors said the government needed to invest more in transport in the north.\nSpeaking on BBC Radio Sheffield, Coppard said: \"We need a new plan for connecting South Yorkshire and Greater Manchester.\n\"Andy Burnham and I are going to involve the East Midlands Mayor Claire Ward to figure out a solution.\n\"It is a big problem.\n\"Sheffield and Manchester are growing really quickly. They are two of the biggest cities in the north and they are connected by that road.\"\nBurnham said all the roads connecting Sheffield and Manchester were unsuitable.\n\"You have the Woodhead but you can't rely on that for the main connectivity between two major northern cities,\" he said.\n\"You can go around the M1 and M62 but that is a pretty big detour.\n\"It's the same old story - there is never enough money to finish things properly in the north.\n\"We need better road and rail connectivity between Manchester and Sheffield for certain.\"", "url": "https://www.bbc.co.uk/news/articles/c3d84z72pm8o"}