{"authors": ["Mansur Abubakar", "www.facebook.com"], "date_download": "2025-04-26 07:54:14", "date_modify": "2025-04-26 07:54:14", "date_publish": "2025-02-25 13:39:04", "description": "Ibrahim Badamasi Babangida, known as IBB, has got Nigeria talking about the past and what might have been.", "filename": "news_articles_c0kg58xk4dvo_1745654054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/facc/live/34cdcb30-f39a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg58xk4dvo_1745654054.html", "title": "Gen 'IBB' Babangida’s book: Former Nigerian military ruler reveals all", "title_page": "Gen 'IBB' Babangida’s book: Former Nigerian military ruler reveals all - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nigeria's former military ruler Ibrahim Badamasi Babangida, known as IBB, has released a new autobiography including several revelations about the turbulent times while he was in charge of the country from 1985 to 1993.\nA Journey In Service has got Nigerians talking and reflecting on what might have been if things had turned out differently - especially the controversial decision to annul the 1993 elections, and the execution of a childhood friend.\nBabangida has a mixed record. While some praise him for the infrastructural development Nigeria he oversaw, others say there was massive corruption during his time.\nHere are four takeaways from the book:\nThis is the biggest talking-point as it touches on a topic which many believed altered Nigeria's history. Some say the country still has not really recovered from the annulment of the 1993 presidential elections.\nIn the book, Babangida, now 83, for the first time expressed deep regret for cancelling that election.\nThe poll was supposed to bring an end to military rule after 10 years and the cancellation of the outcome threw the country into turmoil.\nThe date of the vote - 12 June - is now remembered in Nigeria as Democracy Day.\nMoshood Abiola, widely believed to have won the election, was later imprisoned and his wife assassinated.\nGen Babangida acknowledged that Abiola, who died in 1998, had won the vote.\nHowever, in 1993 as results were being collated, the military government abruptly stopped the process - an action that triggered widespread protests and a political crisis.\n\"That accident of history is most regrettable. The nation is entitled to expect my expression of regret,\" Babangida writes.\nAt the time, he cited the issue of vote-buying, as well as the need to protect the country’s judiciary as reasons for the annulment.\nGen Babangida was forced to resign several months later.\nNigeria's current President, Bola Tinubu, said at the book launch that Gen Babangida had shown courage by admitting what took place.\nAbiola’s son Jamiu said the acknowledgment by Gen Babangida that his father had won the election came as a welcome surprise to him and some of his family members.\n\"Perhaps General Babangida was looking for peace,” he told the BBC Focus on Africa podcast.\nCivilian rule was eventually restored in 1999, 11 months after the death of another military ruler Gen Sani Abacha. He had seized power towards the end of 1993 in the wake of the annulled elections.\nGeneral Mamman Vatsa and Babangida grew up together, were in the same class in school and rose alongside each other in the military. His execution in 1986 after he was convicted of a coup plot is another major talking-point of Babangida's presidency.\n\"We were very close friends,\" Babangida recalls.\n\"We had grown up together in Minna and had been classmates in Bida. We did several things together as peers. My wife recalled that we used to share a room as bachelors. We would reach out for whatever shirt was available, irrespective of whose it was, and just wear it and head out! We were that close.\"\nHowever, he says now realises that Vatsa had been jealous since when they were teenagers.\n\"With the benefit of hindsight now, I recall that a constant part of our relationship as teenagers and young men was a continuous and recurrent peer jealousy on his part towards me. He was always envious of my achievements, especially when he thought I was progressing better than him, either in school or our military career path.\"\nVatsa and nine others were executed in March 1986. They were said to have planned a coup, which according to Babangida would have plunged the country into darkness.\n\"I had to choose between saving a friend's life and the nation's future,\" he writes.\nAnother contentious issue has been the 1966 coup which overthrew Nigeria's first government following independence from the UK. Prime Minister Abubakar Tafawa Balewa was killed, along with other high-ranking national and regional leaders.\nThe fact most of the coup plotters were from south-eastern Nigeria meant the coup became known as an \"Igbo coup\" - a label Babangida rejects.\nHe highlighted the role of Major John Obienu, an ethnic Igbo officer, who played a key role in quelling the coup, revealing that many senior Igbo officers were also killed in the mutiny.\nThe book also sheds light on the involvement of members of other ethnic groups, notably Yorubas, many of whom he said had participated in the military takeover.\nThe former leader confirmed that the original intention of the coup plotters was to release politician Obafemi Awolowo from detention and install him as president.\nBabangida writes: \"It was a terrible time for the Nigerian military. As I have said elsewhere, as a young officer who saw all of this from a distance, probably, ethnic sentiments did not drive the original objective of the coup plotters.\n\"For instance, the head of the plotters, Major Kaduna Nzeogwu, was only 'Igbo' in name. Born and raised in Kaduna, his immigrant parents were from Okpanam in today's Delta State, which, in 1966, was in the old mid-western region. Nzeogwu spoke fluent Hausa and was as 'Hausa' as any! He and his original team probably thought, even if naively, that they could turn things around for the better in the country.\"\nThe association of Igbos with the coup led to attacks on members of that community around the country and ultimately to the civil war in which some Igbo leaders tried to secede from Nigeria in 1967. At least a million people were killed in what became known as the Biafran war.\nMany Nigerians see Babangida's wife Maryam as the country's most iconic and influential first lady. From 1985 to when they left office in 1993, their love story captivated a lot of people. She died in 2009 and the ex-head of state has never remarried.\n\"She was stunning. Her ebony beauty set off enchanting eyes, and her dazzling smile showed off a lovely set of teeth; when she smiled - and she often smiled - her face lit up, and her eyes danced,\" he writes.\n\"We both saw our marriage as our freedom and agreed to sort things out ourselves if we quarrelled. We were very compatible; indeed, I can only recall two occasions on which we quarrelled, and neither of us was afraid to apologise to the other. In all our years of marriage, it was never necessary for anyone to mediate between us over a misunderstanding because of that original meeting of minds.\n\"I never imagined that Maryam would pass away before I did, but the gift of life is in Allah's hands, not in humanity's. I am grateful for the life Maryam and I shared and for the fruit of our union. Coping without her has not been easy, but it has been made much less demanding by the memories of our life together and the length of her shadow,\" Babangida says.\nHe describes Maryam as a devoted wife, mother, homemaker, and passionate advocate for rural women. Above all, he saw her as a true partner.", "url": "https://www.bbc.co.uk/news/articles/c0kg58xk4dvo"}