{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:42", "date_modify": "2025-05-19 15:29:42", "date_publish": "2015-02-05 03:45:55", "description": "Highland Fashion Week is using social media in its effort to find more than 20 models for what it says will be its biggest event.", "filename": "news_uk-scotland-highlands-islands-30498393_1747668582.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79657000/jpg/_79657692_c3282091-84ca-4b03-aecd-55684dd78b58.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-30498393_1747668582.html", "title": "Highland Fashion Week using social media to find models", "title_page": "Highland Fashion Week using social media to find models - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Highland Fashion Week is using social media in its effort to find more than 20 models for what it says will be its biggest festival.\nCandidates, who must be aged 16 and over, have been asked to post a selfie using the #CastMeHFW hashtag on Facebook, Twitter or Instagram.\nLast year's Highland Fashion Week included a competition to redesign the traditional woollen Inverness Cape.\nThe garment was made famous by the fictional detective Sherlock Holmes.\nThis year's week will be held from 22-28 April and events will be staged all over the Highlands.\nGarry James, director of We Are Giraffe, the company behind Highland Fashion Week, hopes social media will help to widen the search for models.\nHe said: \"Everyone has either a Facebook, Twitter or Instagram account, sometimes all three, and so our selfie model audition is a really simple and nice way for people to get involved in Highland Fashion Week.\n\"For fashion week this season, we are looking for more than 20 models.\n\"This is our biggest week to date, with loads more people involved, and that is why we are looking for so many people.\"\nYounger modelling candidates will require parental consent before taking part in events.\nLydia Francis won a competition last year to model the new look Inverness Cape.\nElaine Mackenzie, a designer who was raised on the Isle of Lewis and is now based in London, came up with the winning design for the garment.", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-30498393"}