{"authors": ["James FitzGerald", "www.facebook.com"], "date_download": "2025-04-26 04:23:57", "date_modify": "2025-04-26 04:23:57", "date_publish": "2025-03-03 12:51:10", "description": "The outgoing PM said he would stand up for Canadian sovereignty during his audience with Charles.", "filename": "news_articles_cddy2q2z8dzo_1745641437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3759/live/0f1d82e0-f827-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy2q2z8dzo_1745641437.html", "title": "Provocative Trump statements about Canada loom large as Trudeau meets King", "title_page": "Provocative Trump statements about Canada loom large as Trudeau meets King - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "King Charles has met Canadian Prime Minister Justin Trudeau, under the shadow of inflammatory statements made about Canada by US President Donald Trump.\nTrump has repeatedly spoken of making the neighbouring country the 51st state of America. He has also vowed to impose new import taxes on Canada, which is one of the US's top trading partners.\nAhead of his meeting with the King at Sandringham, outgoing PM Trudeau said he would discuss issues of importance to Canadians, including \"standing up for our sovereignty and our independence as a nation\".\nThe King has also extended an invitation to Trump to visit him in what will be an unprecedented second state visit.\nAs head of state of the Commonwealth nation, the King has faced calls to give Canada his vocal backing in the face of Trump's statements.\nJason Kenney, the former leader of the Canadian province of Alberta, suggested Charles faces a difficult tightrope.\nJason Kenney, a conservative who served as Alberta's premier, wrote on X that the King could only act on the advice of the Canadian PM, who \"should ask [Charles] to underscore Canadian sovereignty\".\nBut the conservative politician then took aim at British Prime Minister Sir Keir Starmer, whom he said had \"cravenly thrown Canada under the bus\" when he refused to comment on Trump's annexation threats during his visit to the White House last week.\n\"It was a shameful betrayal of a fellow realm which has made enormous sacrifices for the defence of Britain,\" Kenney wrote.\nNew import taxes announced by Trump are also set to come into effect on Tuesday, targeting goods arriving from China and Mexico as well as Canada.\nThe president is eager to protect American manufacturing and jobs, and to address the US trade deficit.\nHe suggested in a post on his Truth Social platform on Sunday that his country was effectively subsidising Canada by paying to import its products. Without this flow of capital, Canada \"ceases to exist as a viable country\", he wrote.\nTrump has previously spoken of using \"economic force\" to make Canada the 51st state of America. But he said he was not considering using military force - an assurance he has not given while stating his ambitions of taking the Panama Canal and Greenland.\nThe question of how to respond to Trump's tariff threats and other statements about Canadian sovereignty has dominated the debate in Trudeau's Liberal Party, with candidates vying to replace the PM after he announced his resignation in January.\nOn the other side of the Canadian political divide, Conservative leader Pierre Poilievre has also attacked Trump's statements.\nThe King has found himself at the centre of a recent whirlwind of diplomatic meetings following Trump's return to the presidency - some of which relate to the war in Ukraine.\nOn Sunday, he also met Ukrainian President Volodymyr Zelensky - who ended up in a row of his own with Trump at the White House on Friday.\nZelensky was in the UK to meet European leaders, who reiterated their support for Ukraine in its conflict with Russia - with American support apparently on the wane under Trump.", "url": "https://www.bbc.co.uk/news/articles/cddy2q2z8dzo"}