{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:57", "date_modify": "2025-05-19 14:47:57", "date_publish": "2015-02-08 16:33:54", "description": "The Thai military government denies former PM Yingluck Shinawatra permission to travel ahead of a court case against her.", "filename": "news_world-asia-31247794_1747666077.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80868000/jpg/_80868339_80868087.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31247794_1747666077.html", "title": "Thai military denies former PM Yingluck right to travel", "title_page": "Thai military denies former PM Yingluck right to travel - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thailand former Prime Minister Yingluck Shinawatra has been denied permission to travel overseas.\nA spokesman for the military-backed government said the move was designed to make sure she was in the country to face criminal charges later this month.\nShe is accused of corruption in a scheme she oversaw to subsidise rice farmers which could result in a 10-year jail term. She denies the charges.\nShe was also banned from politics following her impeachment in January.\nThe former prime minister had asked for permission to leave the country until 22 February, government spokesman Sunsern Kaewkumnerd said.\nHe added that the attorney general was due to submit a subpoena on 19 February and she would have to be present for the case to go ahead.\nMs Yingluck's lawyer said it was not necessary for her to appear in court for at least two months and if the military government used her case as an excuse to deny her the right to travel, that would be a \"violation of her basic rights\".\nYingluck Shinawatra became Thailand's first female prime minister in July 2011.\nShe remained in her post until the Constitutional Court forced her to step down in early May 2014 after finding her guilty of abusing her power.\nWeeks later, the military seized power and suspended the constitution saying it was necessary to restore order after months of protests against Ms Yingluck's government.\nHer impeachment in January led to a five-year ban from politics.\nThe allegations against Ms Yingluck centre on a scheme in which her Pheu Thai-led government bought rice from Thai farmers at a much higher price than on the global market.\nIt resulted in the accumulation of huge stockpiles of rice and hit Thailand's rice exports hard.\nAnti-corruption investigators have accused Ms Yingluck and her party of using the scheme to buy votes from farmers, particularly from their power base in the north, and allowing government associates to profit from it.\nMs Yingluck has maintained that she was not involved in the scheme's day-to-day operations, and has defended it as an attempt to support the rural poor.\nHer supporters say the charges against her are designed to limit the influence of her brother, the ousted former Prime Minister Thaksin Shinawatra.", "url": "https://www.bbc.com/news/world-asia-31247794"}