{"authors": ["Ed Barnes", "www.facebook.com"], "date_download": "2025-04-26 04:12:25", "date_modify": "2025-04-26 04:12:25", "date_publish": "2025-03-04 12:21:48", "description": "Birkenhead Town Hall will close, libraries could shut and up to 200 jobs could go at the authority.", "filename": "news_articles_ce8yzy998y6o_1745640745.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f27/live/03274b70-f8e9-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yzy998y6o_1745640745.html", "title": "Wirral council tax hiked by 4.99% and libraries to close", "title_page": "Wirral council tax hiked by 4.99% and libraries to close - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People in Wirral will be paying more council tax from next month after the council approved a 4.99% increase.\nThe authority also revealed Birkenhead Town Hall will close, a number of libraries could be shut and up to 200 jobs could go at the authority as part of £25m savings in its annual budget.\nLast month, the government approved a £20m bailout, to help the council avoid bankruptcy.\nCouncil leader Paul Stuart said councillors would need to work together \"to put our residents and staff first\".\nThe council tax rise, the highest increase allowed by the government, will generate around £9m which, along with the cuts, will help close a £34m budget gap.\nWhile Wirral Council got £34.7m more from the UK Government this year to spend as part of its settlement, pressures on the council's finances from social care, school transport, and pensions total more than £70m.\nFor the financial year which runs between April 2025 and March 2026, the local authority also received a further £7.5m bailout following the second request in recent years.\nThis will be used to cover the cost of redundancy payments as well as supporting the local authority to make services more efficient.\nWirral Council leader Councillor Paul Stuart praised the roll-out of family hubs, work starting on the Hind Street Urban Village, and Floral Pavilion box office success as examples of things the council was doing well.\nHe also said the conditions of roads had improved.\nHowever he said \"this budget is going to be difficult\", adding implementing the changes \"is going to be the most difficult part to do and that is where we are going to have to work together to put our residents and staff first\".", "url": "https://www.bbc.co.uk/news/articles/ce8yzy998y6o"}