{"authors": ["Miles Davis", "www.facebook.com"], "date_download": "2025-04-26 04:34:55", "date_modify": "2025-04-26 04:34:55", "date_publish": "2025-02-28 12:41:04", "description": "Katya Maddison was ordered to apologise for saying 'shame on you' to the chief executive.", "filename": "news_articles_c4gdd9led9go_1745642095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8de0/live/78bbfd00-f541-11ef-ae0b-6f48bf49ce47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdd9led9go_1745642095.html", "title": "No apology from councillor in Facebook comment row", "title_page": "No apology from councillor in Facebook comment row - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A councillor has refused to make a public apology for her behaviour and comments on Facebook which prompted a council to hire an independent investigator.\nTorbay Council member Katya Maddison said \"shame on you\" to the council's chief executive after a heated meeting in May 2024 and later wrote on Facebook that the council was \"a sick institution\".\nMaddison was ordered to apologise to other councillors and staff at a council meeting on Thursday after she was found to have breached the council's code of conduct.\nThe meeting saw Torbay Council approve a council tax increase of 4.75%.\nAt the same meeting a new protocol - designed to stop councillors taking part in \"name-calling, personal criticism or abuse\" - was signed by group leaders.\nOn Thursday, when asked to apologise, Maddison attempted to make a speech about what had happened but was repeatedly interrupted by the mayor, Hannah Stevens.\nMaddison said: \"The council has impugned my reputation by publishing the suggestion I have something to apologise for and it is therefore directly relevant to explain myself.\n\"The hearing failed to offer any evidence that harm or disrepute was caused.\"\nWhen asked if the investigation had been an \"effective use of public funds\", Jackie Thomas, Conservative, who chaired the standards committee hearing, said: \"The code of conduct is a very important part of being a Torbay councillor and, when the code is breached, there is a standard procedure we all have to respect.\"", "url": "https://www.bbc.co.uk/news/articles/c4gdd9led9go"}