{"authors": ["Daniel Dadzie", "www.facebook.com"], "date_download": "2025-04-26 07:46:45", "date_modify": "2025-04-26 07:46:45", "date_publish": "2025-02-27 00:39:31", "description": "The BBC joins a mission aboard the Léon Thévenin to repair an undersea fibre optic cable.", "filename": "news_articles_cx2eyqz49v5o_1745653605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a734/live/dfa4bc80-f449-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eyqz49v5o_1745653605.html", "title": "Africa's internet: The ship keeping the continent connected", "title_page": "Africa's internet: The ship keeping the continent connected - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A ship the size of a football field, crewed by more than 50 engineers and technicians, cruises the oceans around Africa to keep the continent online.\nIt provides a vital service, as last year's internet blackout showed when internet cables buried deep under the sea were damaged.\nMillions from Lagos to Nairobi were plunged into digital darkness: messaging apps crashed and banking transactions failed. It left businesses and individuals struggling.\nIt was the Léon Thévenin which fixed the multiple cable failures. The ship, where a BBC team recently spent a week on board off the coast of Ghana, has been doing this specialised repair work for the last 13 years\n\"Because of me, countries stay connected,\" Shuru Arendse, a cable jointer from South Africa who has been working on the ship for more than a decade, tells the BBC.\n\"IT people at home have work because I bring the main feed in,\" he says.\n\"You have heroes that save lives - I'm a hero because I save communication.\"\nHis pride and passion reflect the sentiment of the skilled crew on the Léon Thévenin, which stands eight floors high and carries an assortment of equipment.\nThe internet is a network of computers servers - to read this article it is likely that at least one of 600 fibre optic cables across the world collected the data to present it on your screen.\nMost of these servers are in data centres outside of Africa and the fibre optic cables run along the ocean floor linking them to coastal cities on the continent.\nData travels through hair-thin fibreglass wires, often grouped in pairs and protected by different layers of plastic and copper depending on how close the cables are to the shore.\n\"As long as the servers aren't in the country, you need a connection. A cable runs from one country to the next, linking users to servers that store their data - whether it's accessing Facebook or any other online service,\" says Benjamin Smith, the Léon Thévenin's deputy chief of mission.\nUndersea fibre optic cables are designed to work for 25 years with minimal maintenance, but when they are damaged, it is usually due to human activity.\n\"The cable generally doesn't break on its own unless you're in an area where there are pretty high currents and very sharp rocks,\" says Charles Heald, who is in charge of the ship's remotely operated vehicle (ROV).\n\"But most of the time it's people anchoring where they shouldn't and fishing trawlers sometimes scrape along the seabed, so typically we would see scars from trawling.\"\nMr Smith also says natural disasters cause damage to cables, especially in parts of the continent with extreme weather conditions. He gives an example of the seas off the coast of the Democratic Republic of Congo, where the Congo River empties into the Atlantic.\n\"In the Congo Canyon, where they have a lot of rainfall and low tide, it could create currents that damage the cable,\" he says.\nDeliberate sabotage is difficult to identify - but the Léon Thévenin crew say they not seen any obvious evidence of this themselves.\nA year ago, three critical cables in the Red Sea - Seacom, AAE-1 and EIG - were severed, reportedly by a ship's anchor, disrupting connectivity for millions across East Africa, including Kenya, Tanzania, Uganda and Mozambique.\nJust a month later, in March 2024, a separate set of breaks in the Wacs, Ace, Sat-3, and MainOne cables off the coast of West Africa caused severe internet blackouts across Nigeria, Ghana, Ivory Coast and Liberia.\nAnything that required the internet to function felt the strain as repairs stretched on for weeks.\nThen in May, yet another setback: the Seacom and Eassy cables suffered damage off the coast of South Africa, hitting connectivity in multiple East African nations once again.\nSuch faults are detected by testing electricity and signal strength transmitted through cables.\n\"There may be 3,000 volts in a cable and suddenly it drops to 50 volts, this means there's a problem,\" explains Loic Wallerand, the ship's chief of mission.\nThere are local teams with the capacity to deal with faults in shallow waters, but if they are detected beyond a depth of 50m (164ft), the ship is called into action. Its crew can fix cables deeper than 5,000m below sea level.\nThe repair witnessed by the BBC off Ghana took over a week to deal with, but most internet users did not notice as traffic was redirected to another cable.\nThe nature of every repair depends on the part of the cable that is damaged.\nIf the fibreglass at the core breaks, it means the data cannot travel along the network and needs to be sent to another cable.\nBut some African countries have only one cable serving them. This means a cable damaged this way leaves the affected area without the internet.\nAt other times, the protective layers of the fibre could be damaged, meaning data transmission still occurs, but with a lower efficiency. In both cases, the crew must find the exact location of the damage.\nIn the case of broken fibreglass, a light signal is sent through the cable and through its point of reflection, the crew can determine where the break is.\nWhen the problem is with the cable's insulation - known as a \"shunt fault\" - it becomes more complicated and an electrical signal has to be sent along the cable to physically track where it is lost.\nAfter narrowing down the possible area for the fault, the operation moves to the ROV team.\nBuilt like a bulldozer, the ROV, weighing 9.5 tonnes, is lowered under water from the ship where it is guided down to the ocean floor.\nAbout five crew members work with a crane operator to deploy it - once it is released from its harness, called the umbilical cord, it floats gracefully.\n\"It doesn't sink,\" says Mr Heald, explaining how it uses four horizontal and vertical thrusters to move in any direction.\nThe ROV's three cameras allow the team onboard to look for the precise location of faults as it moves to the ocean bed.\nOnce found, the ROV cuts the affected part using its two arms, then ties it to a rope that is dragged back to the ship.\nHere the faulty section is isolated and replaced by splicing and joining it to a new cable - a process that looks like welding and which took 24 hours in the case of the operation witnessed by the BBC.\nAfterwards the cable was carefully lowered back to the ocean bed and then the ROV made one final journey to inspect that it was well placed and take coordinates so maps could be updated.\nAnother South African, maintenance fitter Noel Goeieman, is worried he may miss his son's wedding in a few weeks if the ship is called out to another mission.\n\"I've heard we might go to Durban [in South Africa]. My son is going to be very sad because he doesn't have a mum,\" says Mr Goeieman, who lost his wife three years ago.\n\"But I'm retiring in six months,\" he adds with a smile.\nDespite the emotional toll, there is camaraderie onboard.\nWhen off-duty, crew members are either playing video games in the lounge or sharing meals in the ship's mess hall.\nTheir entry into the profession is as diverse as their background.\nWhile Mr Goeieman followed his father's footsteps, chief cook, South African Remario Smith, went to sea to escape a life of crime.\n\"I was involved in gangs when I was younger,\" Mr Smith says, \"My child was born when I turned 25, and I knew I had to change my life.\"\nLike the others onboard he is appreciative of the role the ship plays on the continent.\n\"We are the link between Africa and the world,\" says chief engineer Ferron Hartzenberg.", "url": "https://www.bbc.co.uk/news/articles/cx2eyqz49v5o"}