{"authors": ["Yolande Knell", "www.facebook.com"], "date_download": "2025-04-26 08:01:23", "date_modify": "2025-04-26 08:01:23", "date_publish": "2025-02-26 17:34:46", "description": "In a display of deep public grief, thousands lined roads of southern Israel for the funeral procession of Shiri, Ariel and Kfir Bibas.", "filename": "news_articles_ckg178g4nrwo_1745654483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd49/live/478661a0-f468-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg178g4nrwo_1745654483.html", "title": "Israelis pay last respects to hostage mother and sons killed in Gaza", "title_page": "Bibas family funerals: Israelis pay last respects to hostage mother and sons killed in Gaza - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In a display of deep public grief, thousands of Israelis, many with orange balloons and Israeli flags, lined the roads of southern Israel for the funeral procession of three hostages who were killed in captivity in Gaza - Shiri Bibas, and her two red-haired sons, Ariel and Kfir.\nIsraeli TV channels carried a live feed of the scenes and - after a private burial - the public eulogies by relatives, with crowds gathering to watch on large screens in Tel Aviv's Hostages' Square.\n\"This trio settled in my heart, and I believe in all of our hearts,\" a woman called Neta told Channel 12. She said she had come from the north to pay her final respects to the Bibas family at the procession.\n\"I set out this morning at 04:30. I saw that I couldn't fall asleep, so I headed south. I wanted to come here to be as close as possible to the Gaza border communities, to be part of this farewell.\"\nKfir, aged nine months, from Kibbutz Nir Oz, was the youngest of the 251 hostages snatched in the Hamas-led 7 October 2023 attacks. His brother, Ariel, was just four.\nImages of the two boys became among the most recognisable symbols of the struggle to return the hostages.\nThere was deep anguish in Israel at the sight of Yarden Bibas, Shiri's husband, being released by Hamas at the start of this month without his immediate family.\nOn Wednesday, Yarden Bibas paid tribute to Shiri, who was 32, as \"the most amazing wife and mother\", saying he would always love her.\n\"I want to tell you everything that's happening in the world and here in Israel,\" he went on. \"Shiri, everyone knows us and loves us. You have no idea how surreal this madness is.\"\nWearing an orange kippah, or skullcap, he shared touching memories of his children and spoke of how he and his wife had been happily surprised on giving birth to their second red-headed boy.\nThe Israeli president's residence was lit up in orange - the colour that has come to represent the family.\nAt the procession's start, the Bibas family thanked Israelis for their show of support and expressed longing for days \"when we can once again gather in moments of joy, not sorrow\".\nWrapped in an orange flag to watch the convoy of cars passing en route to the cemetery, Shontal expressed sympathy with the bereaved.\n\"I wanted to come and be close to them, to offer my condolences to Yarden and the family. I hope he manages to recover - not only from the captivity he endured but also from grasping and understanding this terrible tragedy,\" she told Channel 12. \"His tragedy is all of ours.\"\nA haunting video of Shiri Bibas was filmed during the Hamas assault in southern Israel over 16 months ago.\nShe appears terrified as she clutches onto her children surrounded by armed men before they are taken away from their home. Hours later, surveillance camera footage showed them in Khan Younis.\nIn November 2023, Hamas said that an Israeli air strike in Gaza had killed Shiri and her sons. However, that was never verified by the Israeli military, which only expressed \"serious concern\" for them.\nAs recently as last week, the Bibas family continued to hold out hope that the mother and her sons could be returned to Israel alive. They asked the public to \"refrain from eulogising our loved ones\" until a government post-mortem examination was completed.\nThen, last Friday, after the first handover of the remains of dead hostages by Hamas since its deadly 2023 attack, under the terms of the Gaza ceasefire deal, news came through that devastated many Israelis.\nThe Bibas boys were dead, their identities confirmed by DNA tests. The Israeli military spokesman said pathological exams and intelligence showed they had been murdered by their captors \"with their bare hands\".\nIn addition, the remains of Shiri Bibas were not found in the coffin labelled with her name that had been handed to the International Committee of the Red Cross.\nThis was said to contain the remains of a Palestinian woman from Gaza instead. Hamas suggested that there may have been a mix up in the aftermath of the Israeli bombardment.\nTwo days later, the Bibas family announced that Shiri's body had been returned to Israel and that she too had been murdered in captivity.\nThe upsetting confusion over the bodies, along with the grim handover ceremony for the dead hostages staged by Hamas, were among what Israel said were truce violations, leading it to postpone the agreed release of some 600 Palestinian prisoners last Saturday.\nHamas responded that this was a \"serious violation\" by Israel which threw the ceasefire process into a new crisis.\nHours before the funeral, Israeli and Hamas officials said the crisis had been resolved by mediators, with the bodies of another four Israeli hostages now expected to be returned later on Wednesday or on Thursday at the same time as the Palestinian prisoners are freed.\nHowever, the fallout triggered fresh anxiety for the relatives of some 60 remaining hostages who remain unsure if their loved ones - or their bodies - will ever be returned from Gaza.\nA pledge by Israeli Prime Minister Benjamin Netanyahu to avenge the Bibas family's deaths only increased their relatives' worries.\nThe family have criticised the Israeli media and Netanyahu for ignoring their wishes not to release more details of the circumstances of their loved ones' deaths.\nIn a Facebook post on the eve of the funeral, Ofri Bibas Levy, the sister of Yarden Bibas, told the prime minister to \"shut up\" after he repeatedly described the murders. She said publication of the information was \"outright abuse of a family that has gone through 16 months of hell and still has the worst ahead\".\nThe Bibas funeral came a day after that of Oded Lifshitz, who was also from Nir Oz and was 83 when he was abducted. His body was also returned last week. Netanyahu has said he was murdered in captivity by Palestinian Islamic Jihad.\nShiri Bibas and her children were buried in a single casket next to the final resting place of her parents, Yossi and Margit Silberman, who lived in the same kibbutz and were killed there on 7 October.\nIn total, some 1,200 people were killed on Israel's deadliest ever day. It ignited the deadliest ever war in Gaza, in which more than 48,000 people have been killed, according to the Hamas-run health ministry.\nAt the funeral, Ofri Bibas Levy called on Israeli officials seeking forgiveness for their failure to protect Shiri, Ariel and Kfir that day to instead hold themselves accountable.\n\"Forgiveness means accepting responsibility and committing to act differently, to learn from mistakes. There is no meaning to forgiveness before the failures are investigated, and all officials take responsibility.\n\"Our disaster as a nation and as a family should not have happened, and must never happen again.\"", "url": "https://www.bbc.co.uk/news/articles/ckg178g4nrwo"}