{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:51:43", "date_modify": "2025-04-26 07:51:43", "date_publish": "2025-02-25 14:56:09", "description": "Charles Hanson had admitted pushing her to get her attention away from TikTok, a trial hears.", "filename": "news_articles_cvg181qkx44o_1745653903.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/013e/live/d8316ab0-f382-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg181qkx44o_1745653903.html", "title": "TV auctioneer 'expressed regret at jolting wife'", "title_page": "Charles Hanson: TV auctioneer 'expressed regret at jolting wife' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A television auctioneer sent a letter to police expressing regret and saying he had pushed and jolted his wife backwards to get her attention away from TikTok, a trial has heard.\nGiving evidence in his defence at Derby Crown Court, Charles Hanson denied his wife Rebecca Hanson's claim that the incident in May 2023 had constituted an assault, saying he had \"tapped her shoulder\" in response to bad language.\nHe is accused of using violence towards her over a 10-year period, including pushing, scratching and grabbing her.\nMr Hanson denies controlling or coercive behaviour, assault occasioning actual bodily harm, and assault by beating, charges brought after he was arrested in June 2023.\nThe trial heard the 46-year-old, of Ashbourne Road in Mackworth, Derby, wrote a letter to the dedicated officer for the investigation in August 2023, saying he had serious doubts about his wife's reliability and credibility and \"concerns as to her mental health\".\nJurors were told the letter claimed that in May 2023, Mr Hanson and his wife were both feeling unwell and Mrs Hanson was \"sat on the bed watching TikTok\" when he asked her for help.\nAccording to the letter, Mrs Hanson then shouted a swear word at her husband three times, and he \"pushed her right shoulder so as to jolt her backwards... to show my annoyance at her dreadful language, her rudeness towards me\".\nThe letter, in which Mr Hanson referred to a \"double push\", said the \"short jolt\" was \"to get her attention away from TikTok\" and said he deeply regretted the incident.\n\"A double push sounds like more than it was,\" he said.\n\"It was a double tap - there was no more in it than that.\n\"I did not push my wife in the strictest sense.\n\"I tapped her shoulder to get her attention in the first instance about bad language.\"\nMr Hanson told jurors a further contact was made as he asked his wife if she was OK as she flailed her fists.\n\"It was to get her attention,\" he said. \"There was never an assault.\n\"I think her behaviour was completely unreasonable. It was bewildering, seeing her thrash her arms and fists about in front of her.\n\"I was concerned about her wellbeing. I don't think she was very well.\"\nMessages sent between the couple were read to the court, including one in which Mrs Hanson said \"don't chuck your wife around\".\n\"I never chucked my wife around,\" Mr Hanson said. \"I was a fool under her control.\"\nWhen asked what motive his wife may have had to tell lies about him, Mr Hanson said: \"I don't think she wanted a future with me.\n\"I don't think my wife ever really in our life loved me. She saw it a marriage of association based on who I was.\n\"I think my wife wanted out for a very long time and I think, regretfully, the way she made it happen is based on over-exaggerated and factually wrong allegations.\"\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/cvg181qkx44o"}