{"authors": ["David McKenna", "www.facebook.com"], "date_download": "2025-04-26 07:37:43", "date_modify": "2025-04-26 07:37:43", "date_publish": "2025-02-27 14:02:26", "description": "Carl Smith and Nigel Crellin tried to fraudulently backdate gas safety paperwork.", "filename": "news_articles_cjevvwq39n0o_1745653063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a544/live/a0312fa0-f50e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevvwq39n0o_1745653063.html", "title": "Scunthorpe 'rogue traders' jailed over campervan explosion", "title_page": "Scunthorpe 'rogue traders' jailed over campervan explosion - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rogue business owner and engineer from Scunthorpe have been jailed after a gas cylinder exploded in a campervan, leaving a customer with burns.\nGrimsby Crown Court heard Carl Smith, owner of Ivy Lane Campers, employed Nigel Crellin to carry out an inspection in the aftermath of the incident in August 2023.\nThis resulted in Crellin backdating the paperwork to make it look like the vehicle had been gas safety tested.\nSmith, 37, of West Common Crescent, pleaded guilty to fraud and a health and safety offence and was jailed for 16 months. Crellin, 40, of Downing Crescent, admitted two counts of fraud and was sentenced to 14 months.\nThe prosecution was brought following an investigation by North Lincolnshire Council's Trading Standards.\nOfficers told the court the campervan had been occupied by the victim and their family at the time when the gas cannister exploded without warning as the customer attempted to make a meal.\nIt resulted in burns to their leg, hand and foot, with the victim's wedding ring having to be cut off by A&E staff. The door of the cupboard where the cylinder was housed was blown off its hinges.\nPassing sentence on Tuesday, Judge Singh said the appropriate punishment was an \"immediate custodial term\".\n\"To do otherwise would send out the wrong message. Three people were endangered in a confined space and the cover up was systematic,\" he added.\nSpeaking at the conclusion of the case, councillor Carl Sherwood, cabinet member for community wellbeing, said he was pleased to see \"rogue traders like these being held accountable for their actions\".\n\"By not having the correct checks in place, the customer was put in danger. To then try and cover their tracks is totally unacceptable,\" he said.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cjevvwq39n0o"}