{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:35:42", "date_modify": "2025-04-26 04:35:42", "date_publish": "2025-02-28 12:11:57", "description": "David Stewart killed his passenger in the crash after fleeing at more than 100mph, a court is told.", "filename": "news_articles_clyjj07j32qo_1745642142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4622/live/450100e0-f5c9-11ef-9b68-05a34bb37cf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyjj07j32qo_1745642142.html", "title": "Stockton biker who killed man in Peterlee police chase jailed", "title_page": "Stockton biker who killed man in Peterlee police chase jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A banned biker who killed his passenger in a crash while trying to evade police has been jailed for 11 years.\nDavid Stewart reached speeds of 100mph and drove on the wrong side of the road during a minute-and-a-half-long pursuit before crashing on a roundabout in Peterlee, Durham Crown Court heard.\nHis passenger Lee Stevenson, a 27-year-old father of two, was killed instantly.\nStewart, 34, who was banned from driving at the time having had a string of motoring convictions, initially blamed Mr Stevenson for the crash but later admitted causing death by dangerous driving.\nStewart and Mr Stevenson had been drinking and taking drugs including cocaine on the night of 25 March 2023, prosecutor John Crawford said.\nThey were both urged by Mr Stevenson's uncle not to get on Stewart's Kawasaki Ninja ZX-12R due to their intoxication but, at about 02:00 BST, they went out on the bike, the court heard.\nStewart, of George Stephenson Boulevard in Stockton, Teesside, was wearing a helmet but Mr Stevenson was not, the court heard.\nDue to a spate of motorbike thefts in the area, police started following the bike at about 02:30.\nWhen officers activated their blue lights, Stewart, also a father of two, drove away at speed, reaching 100mph, going the wrong way around roundabouts and on the opposite side of the road in a bid to escape, Mr Crawford said.\nAfter about 90 seconds he crashed on a roundabout in Passfield Way, smashing into a chevron sign, the court heard.\nMr Stevenson was declared dead at the scene and Stewart spent several weeks in hospital.\nStewart was over the drug driving limit for cocaine and also had alcohol in his system, the court heard.\nMr Stevenson's mother Naomi Stevenson told the court the crash had \"ruined\" the family's lives.\nShe said her son was a \"larger than life character\" and his death had \"left a massive hole in our lives\".\nMrs Stevenson said she did not like to leave her home any more, adding: \"I don't want people to look at me as a mother who has lost her son.\"\nShe said her grandchildren would have to grow up without their dad but Stewart would still get to be with his family upon his release.\n\"I have no feelings for David Stewart,\" Mrs Stevenson told the court, adding: \"He has to live with his actions and decisions.\"\nShe said: \"Lee is my first thought, my last and all my thoughts in between.\"", "url": "https://www.bbc.co.uk/news/articles/clyjj07j32qo"}