{"authors": ["Tara Mills", "www.facebook.com"], "date_download": "2025-05-19 15:36:32", "date_modify": "2025-05-19 15:36:32", "date_publish": "2015-02-10 17:23:34", "description": "What do people on benefits think about the shake-up to the welfare system?", "filename": "news_uk-northern-ireland-31380360_1747668992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79853000/jpg/_79853423_money.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31380360_1747668992.html", "title": "Welfare reform woes: What do people think about benefits changes?", "title_page": "Welfare reform woes: What do people think about benefits changes? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland's politicians have been debating the biggest change in the welfare system in a generation.\nLast December, the parties came to an agreement about bringing Northern Ireland into line with the rest of the UK.\nThe reform will see jobseeker's allowance and housing benefit merge into universal credit, and Disability Living Allowance (DLA) will become personal independence payments (PIP).\nSo what do people on benefits think about the changes? BBC Newsline's Tara Mills has been speaking to a range of people to get their views.\nPatrick Stokes turned 30 this year. He has autism and a learning difficulty and although he lives on his own he has a lot of help.\nHe is also completely dependent on DLA and Employment Support Allowance (ESA).\nHis mum Eilish is his main carer. She cannot understand why the benefits system needs to change for people like her son and said: \"He's not going to get better, his development is not going to change.\n\"I just don't understand it, are they trying to save money? Did they not get it right the first time?\"\nEilish and her husband top up Patrick's rent and other benefits so he can live on his own, but now they are retired that will not be so easy to do.\nShe said she just wanted a \"decent life for her son\".\n\"It's not as though he's living the high life,\" she said.\n\"What annoys me is that you're always left to feel you've got the begging bowl out looking for more money.\"\nMrs Stokes says Patrick does not understand how dependent on benefits he is, so if there were to be changes she would not tell him because she worries it would distress him.\n\"Maybe he would have to come back and live with us but it wouldn't be ideal for any of us. There is one way to look at it and that's that I've saved the government a fortune by looking after him all this time,\" she said.\n\"He's my son and I love him but it is frustrating having to deal with all the bureaucracy.\"\nIt is not just people on DLA who will be affected. Mothers - particularly lone parents, will also be affected as working tax credits are changed and the benefits cap are introduced.\nAlthough Stormont has pledged to protect people who are worse off because of the cuts, none of the detail on how that will work was spelt out today.\nIt is likely to be March before we know how any top-up systems would work.\nMothers at the Shankill Sure Start group are confused about the changes. Zoe Warnock has a four-week-old baby and has just applied for working tax credits.\nShe said: \"If I didn't have my sister to help me look after my baby I wouldn't be able to go back to work.\"\nThe cost of childcare is the biggest barrier to parents on lower incomes returning to work and moving off benefits.\nThough not everyone thinks change is a bad thing.\nKelly Morris works full-time and believes it should not be a way of life to be on benefits.\n\"It's good to have a safety net but it's got to the point where some families don't try any more,\" she said.\nOne thing that was revealed during today's debate was that people will lose their benefits completely for 18 months if they refuse a reasonable offer of employment three times.\nThe Falls women's centre was alarmed to hear this. Elizabeth Darragh, who is on sick leave at the minute, said she was \"really panicked\" about it.\nShe said: \"I couldn't go back to a nine-to-five job, my mental health wouldn't let me.\n\"A few years ago I wouldn't even have been able to leave the house. I live with my mum and I know she struggles too. I don't know how we would do. We wouldn't be able to eat.\"\nThe most common reaction to the welfare changes though, was confusion. Most people we spoke to did not know there were any changes on the way.\nYou can see more about this story on BBC Newsline at 18:30 GMT", "url": "https://www.bbc.com/news/uk-northern-ireland-31380360"}