{"authors": ["Jonathan Beale", "www.facebook.com"], "date_download": "2025-04-26 04:16:15", "date_modify": "2025-04-26 04:16:15", "date_publish": "2025-03-04 09:31:35", "description": "It's a bitter blow for Ukraine and Europe - but not the first time the US has withheld aid, writes BBC's Jonathan Beale.", "filename": "news_articles_ce8yz5dk82wo_1745640975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cd43/live/7e508a00-f8f8-11ef-ad98-31dd620eac72.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yz5dk82wo_1745640975.html", "title": "What pause in US military aid could mean for Ukraine", "title_page": "What pause in US military aid could mean for Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "President Donald Trump's decision to pause all US aid to Ukraine is a bitter blow – not just for Kyiv but also European allies who have been lobbying the US administration to continue its support.\nThis is not the first time that the US has withheld military aid. Republicans in Congress blocked then-President Joe Biden's largest tranche of military assistance for Ukraine in the summer of 2023.\nThen, Ukraine just about managed to eke out its existing stocks of ammunition with the help of Europe.\nCongress finally approved the £60bn aid package in the spring of 2024. It was just in time - Ukraine was struggling to fend off a renewed Russian offensive in Kharkiv. The arrival of the delayed US weapons helped turn the tide.\nAs in 2024, it may be months before the effects of cutting off US aid are felt – at least in terms of ammunition and hardware. European nations have slowly ramped up their production of artillery shells. Overall Europe now provides Ukraine with 60 percent of its aid – more than the US.\nHowever, US military support is still vital to Ukraine. One Western official recently described it as \"the cream\" in terms of weapons.\nUkraine's ability to protect its people and cities has heavily relied on sophisticated US air defence systems – such as Patriot batteries and NASAMS – jointly developed with Norway.\nThe US has given Ukraine the ability to carry out long range strikes – with HIMARS and ATACM missiles. The US has limited their use inside Russia, but they have still been vital to hit high value targets inside occupied territories.\nIt is not just quality, but quantity too. As the world's most powerful military, it has been able to send hundreds of surplus Humvees and armoured vehicles - numbers that smaller European armies could never match.\nThe absence of some of this aid may take time to filter down to the frontline. But there could be a more worrying immediate impact, not least in terms of intelligence sharing.\nNo nation can match the US in terms of space-based surveillance, intelligence gathering and communications. And it is not just provided by the US military, but commercial companies too.", "url": "https://www.bbc.co.uk/news/articles/ce8yz5dk82wo"}