{"authors": ["David Mercer", "www.facebook.com"], "date_download": "2025-04-26 06:46:40", "date_modify": "2025-04-26 06:46:40", "date_publish": "2025-03-01 13:15:49", "description": "A rescue operation is under way after the avalanche swept away road construction workers in the village of Mana.", "filename": "news_articles_c1mne8lj4kxo_1745650000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d4af/live/bd7bda80-f697-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mne8lj4kxo_1745650000.html", "title": "Four dead and several missing after Indian Himalayas avalanche", "title_page": "Four dead and several missing after Indian Himalayas avalanche - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least four people have died and several others are missing after an avalanche hit the northern Indian state of Uttarakhand, authorities have said.\nA rescue operation has been under way after the avalanche swept away road construction workers in the village of Mana, which shares a border with Tibet, on Friday.\nSome 50 people who were buried under snow and debris were rescued, but four died from their injuries, the Indian army said.\nHelicopters have been deployed in the search for five people who are still unaccounted for in the Himalayan mountain state, it added.\nUttarakhand state chief minister Pushkar Singh Dhami said rescue teams were \"continuously engaged in relief efforts\" following the avalanche, which hit a Border Roads Organisation camp.\nHe added that the government was committed to providing all possible assistance to those affected \"in this hour of crisis\".\nFootage posted on X, external on Friday by the Indo-Tibetan Border Police showed rescuers carrying people on stretchers and walking through several feet of snow - even as more snow continued to fall.", "url": "https://www.bbc.co.uk/news/articles/c1mne8lj4kxo"}