{"authors": ["David McKenna", "www.facebook.com"], "date_download": "2025-04-26 03:39:58", "date_modify": "2025-04-26 03:39:58", "date_publish": "2025-03-05 10:44:27", "description": "Teresa Jackson, 77, from North Hykeham, near Lincoln, started as a cadet nurse at the age of 16.", "filename": "news_articles_c5y9kgk2jj1o_1745638798.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c5da/live/8345b620-f8f3-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y9kgk2jj1o_1745638798.html", "title": "Grimsby nurse with 60 years' service has no plans to retire", "title_page": "Grimsby nurse with 60 years' service has no plans to retire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A nurse who has clocked up more than 60 years of service says she has no plans to retire, just yet.\nTeresa Jackson, 77, who is originally from North Hykeham, near Lincoln, started as a cadet nurse in Grimsby at the age of 16.\nShe has since worked in a number of roles and currently works as a clinical nurse specialist in colorectal and stoma care.\nReflecting on how the profession had changed Ms Jackson said \"the more computer work is involved the nearer retirement approaches\".\n\"When I am asked do I intend to retire, of course. But as to when, or how much longer I will continue, who knows,\" she said.\nThe mother-of-three said she first decided she wanted to be a nurse at around the age of nine - when she would bandage her pet dog and baby sister.\nShe started her training in 1965 and after qualifying became a staff nurse on a general surgical ward.\nShe also worked on a special baby care unit, in elderly care and as a night manager, before going on to become one of the first clinical nurse practitioners in surgery at the hospital.\nLooking back, she said: \"Nursing was vastly different back in the 1960s. We started our day by damp dusting all lockers, window ledges and backs of the beds. We didn't have all the equipment available today, nursing was patient-orientated not machine-orientated.\n\"A patient's stay in hospital was so very much longer and in each bedside locker there was an ashtray as patients were allowed to smoke.\n\"All patients had bed baths, giving time to really get to know your patients, listening and talking with them as you helped them wash,\" she added.\nShe said for her the highlights were passing her exams and \"meeting so many wonderful people\" throughout her career.", "url": "https://www.bbc.co.uk/news/articles/c5y9kgk2jj1o"}