{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 03:45:03", "date_modify": "2025-04-26 03:45:03", "date_publish": "2025-03-05 06:28:34", "description": "A group of parents and young people are told solutions \"will take time\" at a council meeting.", "filename": "news_articles_c8e74p50p39o_1745639103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/65aa/live/82d647b0-f991-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e74p50p39o_1745639103.html", "title": "Newport families call for supported housing for disabled children", "title_page": "Newport families call for supported housing for disabled children - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Concerns about disabled children who will need somewhere to live after their parents and carers die have led to calls for homes to be built in Newport.\nParents and young people were told solutions \"will take time\" at a recent meeting at Telford & Wrekin Council.\nOne of the parents, Liz Bickford-Smith, asked what plans the council had to develop supported living for adults with learning disabilities and difficulties.\nCouncillor Kelly Middleton, cabinet member for public health & healthier communities, said the authority had a commitment to securing such accommodation in its local plan.\nShe said demand for such housing in Telford had risen by 20%, higher than the national average.\nThe council saw the development of 53 individual housing units for 53 individuals on seven sites across the borough in 2023-24, she added.\nShe said the council realised the importance of continuing with the effort, but added \"it will take time\".\nParents who attended last Thursday's meeting of the full council said it was a vital issue but they \"haven't got anywhere\" with their calls for help.\n\"It needs something now,\" said one. \"We have people who are in their 70s and their children will need somewhere to live when their parents die.\"\nAnother said: \"We have been campaigning with MPs and councillors to get something done.\"", "url": "https://www.bbc.co.uk/news/articles/c8e74p50p39o"}