{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 04:30:25", "date_modify": "2025-04-26 04:30:25", "date_publish": "2025-03-03 06:20:29", "description": "National Highways say the works are nearing completion and the 50mph restrictions will be lifted.", "filename": "news_articles_cly6rvym02lo_1745641825.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cceb/live/67bc0710-f768-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6rvym02lo_1745641825.html", "title": "M1 motorway: Roadworks and speed restrictions set to end", "title_page": "M1 motorway: Roadworks and speed restrictions set to end - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Roadworks and speed restrictions on a section of the M1 in Derbyshire are set to end in the \"coming weeks\".\nNational Highways began building 20 emergency lay-bys between junction 28 at Pinxton and junction 30 at Barlborough in April 2024.\nThe original end of date of January 2025 was changed earlier this year to the end of March, but the organisation said the work was now nearing completion.\nA spokesperson said it was on track but factors such as \"severe weather\" could affect the end date.\nThe emergency areas are dotted at regular intervals along the motorway and have bright road surfaces to help motorists identify them.\nAt 100m (328ft) long, they have space for large lorries and a recovery vehicle.\nThey are equipped with emergency telephones linking directly to National Highways control rooms.\nThe wider project has resulted in a lane closure along different parts of the M1 with a 50mph speed restriction.\nA National Highways spokesperson said: \"Work is coming to an end on the scheme with traffic management and speed restrictions due to be lifted in the coming weeks but these plans may be affected by such factors as severe weather.\n\"We do anticipate all works being completed before the end of March.\n\"We will update our website and road users when the traffic management has been removed and want to thank drivers for their patience while we have been carrying out these works.\"", "url": "https://www.bbc.co.uk/news/articles/cly6rvym02lo"}