{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:31:43", "date_modify": "2025-04-26 07:31:43", "date_publish": "2025-02-27 16:59:45", "description": "Christian Lambert posed as a teenager to message the girl on Snapchat before attacking her at a flat.", "filename": "news_articles_c8d4477d5d8o_1745652703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/63f1/live/f7005050-f526-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d4477d5d8o_1745652703.html", "title": "Man who choked 12-year-old girl during rape in Edinburgh jailed", "title_page": "Man who choked 12-year-old girl during rape in Edinburgh jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who choked a 12-year-old girl while he raped her as she slept after posing as a teenager on a social media app has been jailed.\nChristian Lambert messaged the girl on Snapchat, claiming to be a boy just a few years older than the child before attacking her at a house in Edinburgh's Slateford last year.\nThe 21-year-old was assessed as being at \"high risk\" of further sexual offending after pleading guilty to raping a child at the High Court.\nHe was jailed for three years and four months for the attack and placed on the sex offenders register for life.\nThe court heard Lambert, of Slateford, had known the girl for about a week after meeting online.\nProsecutor Leanne McQuillian said the girl had contacted Lambert, whom she knew as Chris, and believed him to be 14 or 15-years-old.\nLambert met the girl in Edinburgh on 27 March last year before returning to the flat where he was staying.\nThey briefly left the property at about midnight to visit a local park, before returning.\nThe girl was said to have a \"very vague recollection\" of what happened, but remembered \"repeatedly falling asleep\".\nShe said she had been raped by Lambert and that he had \"choked her\".\nThe girl told police the following day and Lambert was arrested a short time later.", "url": "https://www.bbc.co.uk/news/articles/c8d4477d5d8o"}