{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 08:08:30", "date_modify": "2025-04-26 08:08:30", "date_publish": "2025-02-26 13:42:13", "description": "The money is coming from £25m in government funding for refurbishments of hospices across England.", "filename": "news_articles_c62x71624x2o_1745654910.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e5a6/live/ee1088c0-f440-11ef-8f19-430fec9d0afd.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62x71624x2o_1745654910.html", "title": "Herefordshire and Worcestershire hospices share £700k for upgrades", "title_page": "Herefordshire and Worcestershire hospices share £700k for upgrades - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hospices across Herefordshire and Worcestershire have been awarded almost £775,000 towards upgrading buildings and IT systems.\nFive hospices will benefit from a share of the money from a total of £25m in government funding for the refurbishment of hospices across England.\nAcorns Children's Hospice, which has sites in Worcester, Birmingham and Walsall, will receive £302,000. Chief executive Trevor Johnson said the money would \"genuinely make a difference\".\nThey were among 18 hospices around the West Midlands to share grants totalling more than £2.7m.\nMr Johnson said: \"The government has acted very, very fast on this, and we're looking at which bits of our buildings we need to look at.\"\n\"It's really going to help us do some work on our facilities and make sure our buildings and our systems are fit for purpose with all of the things to make sure we can reach the children and families we support in the way that we need to.\"\nHe said the team was looking at what the money could be spent on.\n\"We're also looking at how we can utilise it on systems. One of the things we want to do is try and make sure we can, [make] the information that we transfer between us and other healthcare partners work really effectively.\"\nFunding the care for patients was still a challenge, he added, and as the money could not be used for that, fundraising remained \"absolutely vital\" as well as government grants.\n\"There is an ongoing conversation with the government about how we address those things,\" he said.\n\"Having the right systems in place is great, but we also need to make sure we've got the staff and have the people there that provide that care.\n\"It's 800 children every year, a thousand families that we support at Acorns, and we have to be there for them because this is the darkest time for them.\"\nOther hospices to benefit in Herefordshire and Worcestershire are St Richard's Hospice in Worcester with £172,000 in funding, St Michaels Hospice in Hereford has been given £166,000, Mary Stevens Hospice in Worcestershire will receive £83,256, Kemp Hospice in Kidderminster has been awarded £21,000, and Primrose Hospice in Redditch and Bromsgrove has been handed £29,000.\nMinister for Care Stephen Kinnock said the money would transform hospice facilities across England.\n\"Hospices provide invaluable care and support when people need it most, and this funding boost will ensure they are able to continue delivering exceptional care in better, modernised facilities,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c62x71624x2o"}