{"authors": ["Lisa Young", "www.facebook.com"], "date_download": "2025-04-26 03:51:33", "date_modify": "2025-04-26 03:51:33", "date_publish": "2025-03-05 11:48:04", "description": "About 71% of people surveyed say they are satisfied with plans to reshape St Helier's waterfront.", "filename": "news_articles_cp8v6ek385eo_1745639493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dca2/live/84711480-f9a8-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8v6ek385eo_1745639493.html", "title": "Majority satisfied with St Helier waterfront plans", "title_page": "Majority satisfied with St Helier waterfront plans - survey  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nearly three quarters of people surveyed about plans to reshape St Helier's waterfront say they are satisfied with them.\nA total of 2,190 people took part in the survey on Jersey Development Company's (JDC) proposals, which was carried out by research agency 4insight.\nAbout 71% said they were satisfied with the plans and satisfaction was highest among young people aged 16–34, with 80% of that age group saying they approved.\nThe research firm said it had produced a \"statistically robust and representative sample\" which had included street interviews to engage underrepresented groups and young people.\nDorothy Parker, director of 4insight, said: \"It was particularly good to see significant numbers of both young islanders and the Portuguese community, as surveys are often very low on responses from these groups.\"\nResearchers found 95% of the residents and visitors surveyed wanted improvements to the connections between St Helier and the waterfront.\nA total of 88% of participants said it was important to open up views between the new waterfront buildings and the coast.\nPhase one proposals include a redesigned Les Jardins de La Mer and a new children's jet play area.\nAn outdoor swimming pool with eight lanes and suitable for water polo, with a cafe, sauna and changing facilities, are also included in plans.\nThe results showed young people were especially keen for the plans for sports facilities such as a new outdoor swimming pool.\nAbout 60% of under-25s said they thought the overall plans would enhance tourism.", "url": "https://www.bbc.co.uk/news/articles/cp8v6ek385eo"}