{"authors": ["Basillioh Rukanga", "www.facebook.com"], "date_download": "2025-04-26 03:55:02", "date_modify": "2025-04-26 03:55:02", "date_publish": "2025-03-04 16:40:31", "description": "Rwanda had asked for additional money it said it was owed after the UK suspended aid to the country.", "filename": "news_articles_c05m6mvq45lo_1745639702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5051/live/06cfaea0-f918-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05m6mvq45lo_1745639702.html", "title": "UK will not pay Rwanda more for scrapped migrant deal", "title_page": "UK will not pay Rwanda more for scrapped migrant deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK government has said it will not send further payments to Rwanda following the cancellation of the migrant deal between the two countries.\nOn Monday, Rwanda's government spokesperson Yolande Makolo said the UK had asked Rwanda to \"quietly forgo\" the remaining payment, external - reportedly amounting to £50m ($64m) - based on \"trust and good faith\".\nHowever, Rwanda has now asked the UK to pay the remainder of the money it says it is owed, accusing the UK of breaching trust by suspending some aid to the country.\nIn a statement, a UK government spokesperson said that \"no further payments in relation to this policy will be made and Rwanda has waived any additional payments\".\nThe row over payments linked to the Rwanda scheme comes after the UK government announced it would halt bilateral aid to the east African country last month, except for \"support to the poorest and most vulnerable\".\nThe UK took the decision to cut aid after accusing the country of supporting M23, a rebel group that has captured swathes of eastern Democratic Republic of Congo in a deadly uprising.\nThe aid cuts have amounted to \"unjustified punitive measures to coerce Rwanda into compromising our national security\", Makolo said on Monday.\nRwanda has often denied backing the M23 rebel group, but has recently been more defensive, saying it has had to take measures to deal with the \"existential threat\" posed by genocidal militia near its borders.\nUN experts have previously estimated that between 3,000 and 4,000 Rwandan troops are in eastern DR Congo.\nMakolo said Rwanda would now be \"following up\" on outstanding payments relating to the migrant deal to which the UK was \"legally bound\".\nThe plan to deport some asylum seekers to Rwanda, devised by the previous Conservative government in 2022, cost the UK £240m ($310m) before being scrapped by Prime Minister Sir Keir Starmer.\nSpeaking in July last year, shortly after being elected, Starmer said the plan was \"dead and buried\", arguing that the scheme had \"never been a deterrent\" and would only deport \"less than 1%\" of small boat arrivals.\nIn a statement, a UK government spokesperson said: \"The Home Secretary has been clear that the costly Migration and Economic Development Partnership with Rwanda wasted tax-payer money and should not continue.\"", "url": "https://www.bbc.co.uk/news/articles/c05m6mvq45lo"}