{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 03:48:26", "date_modify": "2025-04-26 03:48:26", "date_publish": "2025-03-05 14:41:33", "description": "Developer the Vistry Group says it is keen to press ahead with plans to build hundreds of new homes.", "filename": "news_articles_cvg1e98e8l8o_1745639306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/49c6/live/92627970-f9c7-11ef-9f72-45b1d71715b1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1e98e8l8o_1745639306.html", "title": "Nottingham City Airport to close in three months", "title_page": "Nottingham City Airport to close in three months - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A privately-run airport is set to close in three months after a developer served notice on the operator of the site.\nThe Vistry Group, which owns Tollerton Airfield, plans to build 1,600 homes and a school at the site, which is home to Nottingham City Airport and a number of other businesses as well as providing a landing zone for the air ambulance.\nVistry has now served a three-month notice on operator Truman Aviation to vacate the site, which will mean the airfield will close on 6 June.\nA group spokesperson said it wanted to progress its plans to build homes on the site but would continue to provide a landing zone for the air ambulance during the initial phase of development.\nThe spokesperson said: \"With the site having been allocated for development a decade ago, we are keen to progress our plans and commence construction of the new homes, subject to planning permission.\n\"Vistry is working closely with Lincolnshire and Nottinghamshire Air Ambulance about the redevelopment of Tollerton Airfield.\n\"We have agreed to work together to maintain a safe landing site which will ensure that the current air ambulance service can continue during the initial phase of development.\"\nBrian Wells, who used to own the site and is managing director of Nottingham Airport and Truman Aviation, which are based at Tollerton, confirmed his business would not be moving to a new home.\nHe said: \"We have tried talking to the Ministry of Defence regarding [RAF] Syerston.\n\"But they want to hang on to that, they don't want to transfer it anywhere else.\n\"So there's no other option because grass land is not good for us at all.\"\nA detailed planning application for the first phase of the development, which includes demolishing existing airfield buildings and building 400 homes, a primary school and sports pitches has been submitted to Rushcliffe Borough Council.", "url": "https://www.bbc.co.uk/news/articles/cvg1e98e8l8o"}