{"authors": ["Chris Mason", "www.facebook.com"], "date_download": "2025-05-19 15:36:13", "date_modify": "2025-05-19 15:36:13", "date_publish": "2015-02-13 20:08:08", "description": "UKIP donor Arron Banks threatens to sue Armando Iannucci over remarks the satirist made on the BBC's Question Time.", "filename": "news_uk-politics-31463868_1747668973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81000000/png/_81000576_au.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31463868_1747668973.html", "title": "Armando Iannucci tax claim sparks UKIP donor legal threat", "title_page": "Armando Iannucci tax claim sparks UKIP donor legal threat - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "UKIP donor Arron Banks has threatened to sue the satirist Armando Iannucci, over remarks The Thick of It creator made on BBC One's Question Time.\nMr Iannucci accused Mr Banks of owning a firm in Belize and being the director of a company with a turnover of £19m which paid £12,000 in corporation tax.\nMr Banks has denied owning a company in Belize or seeking to avoid UK tax \"via any device\" and said he would sue if he did not get an apology within a week.\nMr Iannucci has not yet responded.\nThe comedian was on Thursday night's programme during a discussion on tax avoidance.\nResponding to a comment by UKIP deputy chairman Suzanne Evans, Mr Iannucci said: \"When I said they're all in it together, I did really mean they are all in it together.\n\"UKIP has Arron Banks donating a million pounds, and he has got a company in Belize. He is the director of a firm that had a turnover of £19.7m but paid £12,000 in corporation tax because £19.6m was actually an administrative expense.\"\nWriting on Facebook, Mr Banks said the comments were \"clearly defamatory\".\nArron Banks wrote: , external \"Apparently some Italian / Scottish comedian accused me of being a tax dodger ! Here was my Dear Mr Lanucci,\nI understand you mentioned me on question time in connection with the use of Belizean/ overseas companies to reduce my tax bill including a company in Belize and a service company.\nI do not own any companies in Belize so this comment is clearly defamatory.\nI believe it is recycling an old guardian story which was incorrect - I have made charitable donations to the Belize children's hospital and hosted a function for them.\nThis was for a cancer charity.\nMeanwhile the service company mentioned is in respect of mainly UK staff and expenses incurred and does not save any UK tax.\nThe company does not produce revenue. I have created over 5,000 local jobs in South Gloucestershire and donated over a million pounds to charity including, local churches, facilities for schools, scouts, cubs, cricket and hockey clubs and local sports clubs in the area.\nI paid £2m pounds in tax , over the last two years - probably more than most Italians one imagines.\nParticularly funny ones. I do not own any Belizean companies or seek to avoid UK tax via any device - I expect an apology within 7 days or proceedings will follow.\nBest regards\nArron\nPs love the thick of it !\"", "url": "https://www.bbc.com/news/uk-politics-31463868"}