{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:53:54", "date_modify": "2025-04-26 03:53:54", "date_publish": "2025-03-03 07:32:55", "description": "Police say a man died on Friday after he was reportedly assaulted outside a hotel on Tuesday.", "filename": "news_articles_czje4gyj0zmo_1745639634.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/334c/live/ae418ca0-f7fe-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czje4gyj0zmo_1745639634.html", "title": "Man bailed over death after assault outside Bournemouth hotel", "title_page": "Man bailed over death after assault outside Bournemouth hotel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man arrested on suspicion of murder after another man died days after being assaulted outside a hotel has been released on bail.\nDorset Police was called to an address in Redhill Avenue, Bournemouth, shortly after 20:00 GMT on Friday following the death of a man in his 60s.\nThe same man was reportedly assaulted outside the Bournemouth Carlton Hotel in East Overcliff on Tuesday at about 13:00 GMT, police said.\nA 46-year-old man from the town, arrested on suspicion of murder, has since been released on conditional bail.\nDet Insp Shaun Inkpen said: \"Our thoughts continue to remain with the loved ones of the man who sadly died and we are keeping them updated with the latest developments.\n\"The investigation is still in the early stages and we are going to be continuing our work to establish the cause of the man's death and whether there is any link to the reported assault.\"\nThe force said the man's death was currently being treated as unexplained.\nPassers-by who were near the hotel at the seaside resort on Tuesday and anyone with information are being urged to contact police.\nA police cordon in place outside the hotel in East Overcliff, Grove Road, has been removed.", "url": "https://www.bbc.co.uk/news/articles/czje4gyj0zmo"}