{"authors": ["Chris Mason", "Alice Thompson", "www.facebook.com"], "date_download": "2025-04-26 07:49:34", "date_modify": "2025-04-26 07:49:34", "date_publish": "2025-02-26 22:31:30", "description": "The PM stresses the importance of US help but Trump suggests responsibility lies with Europe.", "filename": "news_articles_c5ymvygpj7go_1745653774.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16b5/live/4f2ffb60-f48f-11ef-b27c-cbb996f05222.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymvygpj7go_1745653774.html", "title": "US needs role in Ukraine to deter Putin, says PM", "title_page": "US needs role in Ukraine to deter Putin, says PM  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer has reiterated his call for a US security guarantee in Ukraine to deter Vladimir Putin from invading again, as he prepares to meet Donald Trump.\nSpeaking on the plane to Washington DC, Sir Keir said he hoped the UK-US relationship could go from \"strength to strength\".\nBut the two leaders appear to be at odds over the importance of US security guarantees for Ukraine as part of any peace deal there.\nSir Keir said discussions about potentially sending British troops to Ukraine were ongoing but he re-emphasised his belief in the importance of a so-called US \"backstop\".\nAsked what form he believed this backstop should take, he said: \"Exactly what the configuration of that is, exactly what the backstop is, is obviously the subject of intense discussion but I'm not going to get ahead of myself on it, other than to say I'm very clear about what the principles are.\"\nIn contrast, Trump has said: \"I'm not going to make security guarantees beyond very much.\n\"We're going to have Europe do that, because we're talking about Europe as the next door neighbour.\"\nThe president did add that the expected deal between Washington and Kyiv over access to Ukrainian minerals was \"great\" for Ukraine \"because they get us over there.\"\n\"We will be on the land and that way there is going to be automatic security because nobody is going to be messing around with our people.\"\nIt is not yet known how much security support European leaders are asking for from America, nor is the scale of any American manpower on the ground in Ukraine associated with a minerals deal.\nThe prime minister said: \"I'm considering how we preserve peace in Europe and how we get a lasting peace in Ukraine.\n\"And I'm absolutely convinced that we need a lasting peace, not a ceasefire, and for that to happen we need security guarantees.\n\"Precisely what that layers up to, what that looks like, is obviously a subject of intense discussion. We will play our part and I've been clear that we will need a US backstop of some sort.\n\"My concern is if there is a ceasefire without a backstop, it will simply give him [Putin] the opportunity to wait and to come again because his ambition in relation to Ukraine is pretty obvious, I think, for all to see.\"\nSpeaking at a reception at the UK Ambassador's residence in Washington on Wednesday evening, the Sir Keir told guests that he wanted to strike a \"new partnership\" with the United States, and said \"our best days lie ahead\".\nOn domestic policy, the prime minister said that \"taking out a chainsaw isn't quite my style\" - a reference to an Elon Musk stunt at the conservative CPAC conference earlier this week - but said \"we are stripping away red tape and bureaucracy\".\nLord Mandelson, the British ambassador, said Trump was a \"very consequential president\" and that \"all the freedom-loving democracies in the world\" faced a \"very significant moment\".\n\"The US and the United Kingdom, we basically share everything together,\" he said.\n\"And of course one thing we don't need to fight over is trade, because we have this fantastically fair and balanced trade relationship when we reciprocate so much - that's just a little thing for you to remember in the coming weeks.\"\nTariffs on steel imports to the US are set to come into force in March, with the president also considering other import taxes as part of his drive to protect American businesses.\nAfter the visit from Sir Keir, Trump will host Ukrainian President Volodymyr Zelensky.\nZelensky has said the deal on minerals is preliminary and that he still wants further agreements, arguing that without security guarantees from the US \"we won't have a ceasefire, nothing will work.\"\nForeign Secretary David Lammy, speaking to ITV's Peston programme, sounded hopeful about a deal.\n\"If US interests are on the ground in Ukraine, then that is the best security guarantee that the Ukrainians can have,\" he said.\nSir Keir was notably guarded in his remarks in advance of Thursday's meetings in the White House, such are the stakes and sensitivities around Ukraine, the Middle East and trade with America since Trump's inauguration.\nStrengthening and deepening the US-UK relationship might be his ambition, but it is far from guaranteed with such an unpredictable president.\nBut asked if he could trust Trump, given what he had said in recent weeks, the prime minister replied: \"Yes, I've got a good relationship with him.\n\"As you know, I've met him, I've spoken to him on the phone, and this relationship between our two countries is a special relationship with a long history, forged as we fought wars together, as we traded together.\"\nDoes he think President Trump sees Russia as the aggressor in Ukraine?\n\"Of course, the president has been very clear about the peace that he wants - he's right about that.\n\"We all want peace - the question is, how do we make sure it's a lasting peace.\"\n\"There's no issue between us on this,\" Sir Keir insisted.\nTheresa May, former prime minister and Conservative peer, urged Sir Keir to tell Trump that Russia is the aggressor in Ukraine.\nSpeaking in the House of Lords on Wednesday, she said: \"Will he impress on President Trump that...the defence of Europe benefits the defence of America, and the Ukrainians are fighting for their independence and their sovereignty - principles which should be defended by all of us who value or benefit from economic and democratic freedom.\"", "url": "https://www.bbc.co.uk/news/articles/c5ymvygpj7go"}