{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:13", "date_modify": "2025-04-26 03:55:13", "date_publish": "2025-03-04 16:30:54", "description": "Annabel Mackey was discovered unresponsive in Kingsley Pond in Hampshire in September 2023.", "filename": "news_articles_c798qq8q3z5o_1745639713.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d51c/live/8b215d60-f90f-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c798qq8q3z5o_1745639713.html", "title": "Woman charged with murdering two-year-old found in Hampshire pond", "title_page": "Woman charged with murdering two-year-old found in Hampshire pond - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman has been charged with the murder of a two-year-old girl who died after being found in a village pond.\nAnnabel Mackey was discovered unresponsive in Kingsley Pond, near Bordon, Hampshire, on 10 September 2023, shortly after she was reported missing. She was pronounced dead in hospital a day later.\nAlice Mackey, 42, of Gibbs Lane, Oakhanger, has been remanded in custody to appear at Basingstoke Magistrates' Court on Wednesday.\nEarlier, Annabel's father paid tribute to the toddler who he described as a \"shining star\" who would be \"loved forever\".\nHe said Annabel was a \"beautiful, positive and very happy little girl\".\n\"She had an incredibly pure and caring nature that we miss so much,\" he continued.\n\"She loved story time, dogs and her dolly. She enjoyed singing songs and nursery rhymes and had a very sweet tooth.\n\"Annabel loved to laugh, she brought so much happiness into our lives.\n\"She was dearly loved by her family and friends. Thank you to everyone who was a positive influence in her life. Please continue Annabel's legacy by remembering her and caring for others as much as she did.\n\"The world needs more people like Annabel to spread positivity and kindness.\n\"Annabel, I love you so much, you are a shining star and you will be loved forever.\"", "url": "https://www.bbc.co.uk/news/articles/c798qq8q3z5o"}