{"authors": ["Lauren Woodhead", "James Alexander", "www.facebook.com"], "date_download": "2025-04-26 07:34:36", "date_modify": "2025-04-26 07:34:36", "date_publish": "2025-02-27 15:38:35", "description": "A guide to some key terms on the topic of migration", "filename": "news_articles_cz7veer980go_1745652876.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee03/live/a6f7fa90-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz7veer980go_1745652876.html", "title": "Immigration explained: Migrants, refugees, and visas defined", "title_page": "Immigration explained: Migrants, refugees, and visas defined - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Migration is a topic that is never far from the headlines and political debate.\nWe have made a quick guide to some of the common terms to help you navigate the subject.\nThe move can be temporary or permanent, between different countries or within the same country.\nIt could be because they are forced to move by war, famine, natural disaster or persecution, or because they have chosen to study elsewhere or seek a better job and better life.\nThis is a more specific term, and sometimes people will use the terms legal immigrant and illegal immigrant.\nLegal immigrants are those who entered the country with permission, whereas illegal immigrants arrived without it.\nSome illegal immigrants make claims for asylum once they have arrived.\nIn the UK, all applications for asylum are processed by the Home Office.\nAsylum seekers do not have the same rights as a refugee or a British citizen while they wait for a decision. For example, asylum seekers are not allowed to work.\nSuccessful applicants are given refugee status, but the applicant usually has to leave the country if their claim is rejected and any appeal is unsuccessful.\nThis term is often used to describe people forced to move because of war, famine or natural disaster, but the legal definition covers only those in fear of persecution.\nIn the UK, the Home Office decides which asylum seekers should get refugee status.\nA grant of refugee status lasts for five years and means the person can stay, work and receive some benefits.\nAfter that time, they can apply for Indefinite Leave to Remain.\nThese children arrive in the country without an adult taking responsibility for them and will usually be taken into the care system by the local authority they are first reported to.\nIn contrast, separated children are apart from their parents or primary caregiver, but may be with other adults in their family.", "url": "https://www.bbc.co.uk/news/articles/cz7veer980go"}