{"authors": ["Charlotte Benton", "Tammy Gooding", "www.facebook.com"], "date_download": "2025-04-26 04:22:36", "date_modify": "2025-04-26 04:22:36", "date_publish": "2025-03-03 13:55:06", "description": "Esme Savage graduates after postponing her studies following a diagnosis of pancreatitis.", "filename": "news_articles_c9wpgqv14v2o_1745641356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2594/live/75060f90-f823-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9wpgqv14v2o_1745641356.html", "title": "Worcester student nurse wrote degree essays from hospital bed", "title_page": "Worcester student nurse wrote degree essays from hospital bed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"There were definitely times where I felt it was impossible to get my degree but I just kept pushing through.\"\nSuch perseverance has paid off for Esme Savage, who will formally receive her degree in Adult Nursing after her own battle with ill health.\nShe was forced to postpone her studies for two years following a diagnosis of pancreatitis.\nBut she suggested those challenges were also that which would shape her career, saying: \"I had multiple surgeries, often away from home, and I had to do my assignments from my hospital bed, but being a patient and on the other side of nursing, really made me see the kind of nurse I want to be for everyone else.\"\nThe 23-year-old, who graduates from the University of Worcester on Tuesday, started her university course in 2019, but became unwell after her first year.\nMs Savage, who had to have procedures every six months, said it was a \"setback\" but it made her realise nursing was \"definitely what I wanted to do\".\n\"I've always enjoyed looking after people even from when I was younger and I used to look after my Nan. I saw the difference it made to her and I wanted to do that for other people.\nShe added: \"My studies were almost a distraction from what was going on with my health but there was something in me that said 'Esme you've got to do it' and here I am.\"", "url": "https://www.bbc.co.uk/news/articles/c9wpgqv14v2o"}