{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:39:04", "date_modify": "2025-05-19 15:39:04", "date_publish": "2017-08-16 00:00:00", "description": "News, sport, travel and weather updates from across the West of England on Tuesday, 15 August 2017.", "filename": "news_live_uk-england-bristol-40937519_1747669144.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-bristol-40937519_1747669144.html", "title": "As it happened: West of England", "title_page": "As it happened: West of England on Tuesday, 15 August 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Expect a warm day tomorrow with showers forming\nWe're done here for another day. Thank you for your company.\nHere's a recap on some of our top stories from today:\nFestival-goer George Zographou contracts meningitis and dies\nSecond WW2 bomb found in Bristol Channel near Hinkley Point\nDavid Somerset, 11th Duke of Beaufort dies, aged 89\nFootball referees in Gloucestershire begin sin-bin trial\nJoin us from 7am tomorrow for more live news, sport, weather and travel updates from across the West of England.\nGorilla reaches three month milestone\nBristol Zoo’s baby gorilla, Ayana, is now three months old. She was born to mum, Touni, and dad, Jock, at the end of April.\nAyana, the zoo says, often ends up on her mums shoulders seeing things backwards.\nQuote Message\nShe cannot turn herself around, so she just sits there and sees the world the wrong way round. But apart from that she is progressing really well.\nShani Ratnayake, Senior keeper\nHow far would you go for the one you love?\nAndrew Hall from Calne has suffered with claustrophobia since he was seven-years-old after a traumatic experience in a swimming pool.\nHe met his Australian wife, Kim, online but she has not been allowed a Visa to remain in the UK.\nIt means they've only ever spent five weeks together at a time since getting married in 2014.\nNow he's trying hypnotherapy so that he gain the confidence to fly the 11,500 miles to be with her in Australia.\n'Biggest issue with retaining referees is the abuse'\nBadly behaved footballers could find themselves in the sin-bin as part of a nationwide pilot to crack down on dissent.\nThe scheme is being trialled in Gloucestershire as well as in Somerset.\nBBC Points West's Ali Durden was live in Almondsbury tonight where he met Jon Pike from Somerset FA.\nMeningitis death not related to previous cases\nThe death of George Zographou, 18, is not being linked to previous cases of meningitis at the sixth form he attended.\nHe was a student at St Brendan’s Sixth Form College in Bristol that saw two confirmed cases of meningococcal infection last year.\nQuote Message\nWe do not believe that this case is related to the previous cases at St Brendan’s because they occurred 14 months ago. Additionally, they had not attended the college since the end of the summer term at the beginning of July. Although the risk to others is very small, those who were in close contact with the individual have been given antibiotics as a precaution.\nMike Wade, Public Health England\nCalne man tackles fear of flying to be reunited with his wife\nA Calne man who hasn't seen his Australian wife for two years due to his extreme claustrophobia is hopeful a course of hypnotherapy will allow him to finally travel to live with her.\nAndrew Hall is moving down under but has a huge fear of flying and unfortunately she can't get a visa to come and live here.\nHe says it's still early days but is feeling positive.\nQuote Message\nGiven time, with a few more of these sessions, I'm just going to float with nothing worrying me and I'm going to take on the world.\nAndrew Hall, Claustrophobia sufferer\nDuke of Beaufort dies, aged 89\nIt's been announced that the Duke of Beaufort has died at the age of 89.\nBadminton House said in a statement he died peacefully at his Badminton estate home on Wednesday.\nHe leaves his widow Miranda and four children Harry, Anne, Edward and John, and is succeeded by his eldest son Harry, The Marquess of Worcester.\nThe duke was the president of the Badminton Horse Trials which is held on the family estate every year in May.\nMan arrested after attempted knifepoint robbery of 12-year-old\nA man has been arrested following the attempted knifepoint robbery of a 12-year-old boy in Stroud.\nGloucestershire Police said a 48-year-old man from Gloucester was arrested on Tuesday on suspicion of attempted robbery, and has been released under investigation.\nThe 12-year-old boy was approached by a man who threatened him with a pocket knife in an alleyway leading from Stratford Park to Jack Russell Close last Wednesday.\nA spokesman said the boy was unharmed and nothing was taken from him but he was \"very upset\".\nMeningitis victim's school offering support\nSchool friends and peers of George Zographou, 18, who has died after a short battle with meningitis, are to be offered support.\nSt Brendan’s Sixth Form College in Bristol said it would be using extra teachers to support George’s friends and those who knew him.\nThe school will also have a welfare room for those who are upset when they come in to collect A Level results tomorrow.\nPublic Health England will also be there to answer any concerns.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nFootball: Bristol City's Djuric has groin surgery\nBristol City striker Milan Djuric has been sidelined for at least two months following groin surgery on Tuesday.\nThe 27-year-old Bosnia and Herzegovina international joined the Robins from Italian club Cesena in January.\n\"Milan is going to be out for a while. He's had a release procedure to let out his tendon a little bit,\" head coach Lee Johnson told BBC Radio Bristol.\n\"We are in the market (for an additional striker), people know that. But we work with what we've got.\"\n'I thought I was going to die' - surfer recalls sea rescue\nA woman from Somerset has been telling the BBC how she was rescued by life boat crews.\nSamantha Mildon got into trouble while surfing off the Devon coast and dislocated her shoulder out at sea.\nShe was stranded until her cries for help were heard.\nTonight, Samantha stars in a BBC2 series about RNLI lifesavers, called Saving Lives at Sea.\nView from the Red Arrows over Filton\nHundreds of aviation fans have been given a preview of the new museum dedicated to Concorde.\nThe site at Filton, which will have tickets on sale within weeks, opened its doors today to some of those who sent in their memories of the supersonic aircraft.\nThe RAF Red Arrows flew over the airfield too.\nFamily held hand of teenager who died from meningitis\nA teenager who became ill with meningitis at a festival has died, public health officials have confirmed.\nGeorge Zographou, 18, from Bristol, fell ill at the Boardmasters Festival in Newquay on Friday.\nHis sister Nicole said on Facebook, \"George took his final breaths on Wednesday August 16th at 13.34 all by himself without the machine. The three of us holding his hand.\"\nMurder accused to appear at crown court\nTwo people charged after a man was stabbed to death in his home in Bath will appear at crown court on Thursday.\nTashan Corpe, 27, died in Sedgemoor Road on Sunday.\nPolice have charged 30-year-old Josh Farnham of Old Fosse Road in Bath with murder, grievous bodily harm with intent and actual bodily harm.\nRachel Smith, 42, of Sedgemoor Road, has been charged with assisting an offender.\nBoth appeared before Bristol Magistrates' Court earlier and were remanded in custody to appear before Bristol Crown Court.\nThe crime scene is still cordoned off while officers gather evidence.\nBristol Channel bomb: Controlled explosion carried out\nThe MOD says \"it was rendered safe with a controlled explosion as of 16:20 today\".\nThe suspected World War Two device was the second to be found in just over a week, close to Hinkley C power station, near Lilstock.\nThe first was a 500lb (226kg) device discovered 2.5 nautical miles (4.6km) from the coast, about 26ft (8m) below the surface.\nThis second device was believed to weigh 250lb (113kg) and was 0.3 miles (500m) from the power station.\nReward offered to find murder suspect\nA £5,000 reward has been offered for information leading to the arrest of a murder suspect, external.\nPolice want to trace James Atherley - pictured below - in connection with the fatal stabbing of a man in Solihull earlier this month. The West Midlands force thinks the 21-year-old is in Weston Super Mare in Somerset.\nCallum Lees, 20, was stabbed in the neck following what police believe to have been a row at a flat in the Kingshurst area. He died in hospital after being found on a nearby street.\nIn connection with the investigation, three men aged 21, 20 and 18 have been arrested and bailed pending further enquiries.\nFootball: Yeovil sign Bournemouth forward Green\nYeovil Town have signed versatile forward Jordan Green on a free transfer from Bournemouth.\nThe 22-year-old has signed a one-year deal with the Huish Park outfit.\nHe made 10 league appearances during a loan spell at Newport County last season, but has not played in a senior match for the Premier League Cherries.\nQuote Message\nJordan has the potential to reach a very high standard. He's quick, clever and difficult to mark.\nDarren Way, Yeovil boss", "url": "https://www.bbc.com/news/live/uk-england-bristol-40937519"}