{"authors": ["Jonathan Morris", "www.facebook.com"], "date_download": "2025-04-26 07:04:56", "date_modify": "2025-04-26 07:04:56", "date_publish": "2025-02-28 06:33:41", "description": "From Denmark and Belgium to the US, Australia and Japan, Argyle fans are passionate about the club.", "filename": "news_articles_c30mm6lllmro_1745651096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4fa3/live/cc937870-f520-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c30mm6lllmro_1745651096.html", "title": "Plymouth Argyle: Global Green Army unites for epic FA Cup clash", "title_page": "Plymouth Argyle: Global Green Army unites for epic FA Cup clash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From Denmark and Belgium to the United States, Australia and Japan, Plymouth Argyle's fan base is diverse and passionate.\nFans from around the world have been reminiscing as they look forward to the FA Cup clash on Saturday between Argyle and Manchester City.\nBo Sondrup, a Plymouth Argyle fan from Denmark, has been supporting the club for more than three decades.\nThe cup clash is \"like a fairytale for me, because it's always been there for these past 33 years,\" he said.\nMr Sondrup's passion for Argyle began with a love for the team's green colours and the romantic imagery of ships and pirates.\nDespite the challenges of being a fan in Denmark he regularly wears his Argyle top and has passed his passion on to his son, who is also eagerly anticipating the match against Manchester City.\n\"It would be too easy for me to support Liverpool or Man United or City,\" he said.\n\"Hopefully I'll be able to go to Plymouth to watch a game at Home Park, maybe during this season, if not the next one,\" he said.\nEric Nemes, from Plymouth, Massachusetts, has found a deep connection with Plymouth Argyle, a club that shares his home town's name and historical ties.\nLiving near the Mayflower and historical landmark of the Plymouth Rock, he was drawn to Argyle's logo and nickname, \"The Pilgrims,\" which resonated with his area.\nHis passion for Plymouth Argyle has grown over the past year, becoming a dedicated supporter and helping to expand the club's fan base in the United States.\n\"We think that Plymouth Argyle is America's team,\" he said.\nHe and fellow fans organise watch parties and connect with other fans across the country.\nHe recalls the excitement of watching Argyle's FA Cup victory over Liverpool, describing it as \"a win for the ages.\"\n\"It was very exciting. That was our Super Bowl of the day, watching Argyle beat Liverpool,\" he said.\nWith the upcoming FA Cup match against Manchester City, Eric is optimistic fopr another win.\n\"We are having a watch party at the Vitamin C Brewery on Water Street in Plymouth, and we have a view of the Mayflower replica,\" he said.\nTony Bullock-Formosa has strong ties to Plymouth Argyle, despite living in Australia.\nBorn and raised in Plymouth, Tony completed an apprenticeship at the dockyard before moving to London, where he met his Australian wife.\n\"My grandfather used to work on the gate, and he used to get us some tickets to the grandstand. The absolute treat.\"\nTony recalls attending two memorable games last season against Sunderland and Stoke, both of which ended in wins for Argyle.\n\"And everybody said to me, you must come back. Every time you come we win.\"\nTony's passion for the club has endured through the decades, even after relocating to Australia.\nHe frequently makes the long journey back to Home Park, attending games whenever he can.\nHe connects with other Argyle supporters in Australia and New Zealand, often watching games at odd hours due to time differences.\n\"Come on, you Greens!\" he said, hoping for victory on Saturday.\nJeff Down, originally from the Plymouth, has been a dedicated Argyle fan since the glory days of the 1975 promotion season.\nNow based in Flanders, Belgium, he recalls the excitement of the FA Cup runs in the early 1980s and is eagerly anticipating the game against Manchester City.\n\"It's kind of a nice distraction away from the relegation battle,\" he said.\nTravelling to games is no small feat for Jeff, but he will be in Manchester on Saturday.\n\"Thankfully, the Eurostar makes things a lot easier,\" he notes, attending up to 17 games a season.\nHis dedication has even inspired Belgian and Dutch friends to adopt Argyle as their second team.\nTatsuki Usi, a devoted Plymouth Argyle fan from Japan, has been captivated by the club since he was five years old.\nHis passion was ignited when he watched an Argyle game against Everton on TV.\n\"I couldn't take my eyes off it,\" he said.\n\"The players looked like they were having so much fun, and they seemed like superheroes to me.\n\"I was completely hooked and from that day on, the Green Army stole my heart.\"\nHe is eagerly anticipating the FA Cup match against Manchester City.\n\"I can't believe we are actually going to play against Manchester City,\" he said.\nDespite the early morning kick-off time in Japan, Tatsuki is determined to watch \"every second\" of the game.\nFor Tatsuki, supporting Plymouth Argyle is about more than just the results.\n\"I just want us to enjoy our football,\" he said.\n\"If we stick to what we do best, we won't lose.\"", "url": "https://www.bbc.co.uk/news/articles/c30mm6lllmro"}