{"authors": ["Alex Bish & Georgia Poncia", "www.facebook.com"], "date_download": "2025-04-26 07:07:46", "date_modify": "2025-04-26 07:07:46", "date_publish": "2025-02-28 05:58:52", "description": "\"If you're employing people without the permission to work, you will be fined,\" the government says.", "filename": "news_articles_cq6y276p743o_1745651266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a0b1/live/4bf96340-f454-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq6y276p743o_1745651266.html", "title": "South East illegal workers told 'you will be arrested'", "title_page": "South East illegal workers told 'you will be arrested' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"If anyone is thinking of entering the UK illegally to work, don't do it,\" says Tano Grima from the Home Office's South East immigration and enforcement team.\n\"Immigration officers will come for you and you will be arrested,\" he told BBC South East.\nJoining immigration staff on a series of operations the BBC was told they have even found young teenagers suspected of working illegally.\nMr Grima, South East Immigration Compliance Enforcement team lead said: \"If you're employing people without the permission to work, you will be fined.\"\nBetween July, when Labour came into power, and 31 January, 3,930 arrests were made during more than 5,424 visits around the UK by immigration enforcement officers, the Home Office said.\nA total of 1,090 civil penalty notices were also issued, with employers facing potential fines of up to £60,000, external per worker if found liable.\nThe government says those arrested for illegal working made the journey to the UK through a mix of routes, including by crossing the Channel, and by overstaying legitimately-granted visas.\nHome Office minister, Dame Angela Eagle, said: \"Under our Plan for Change, we're ramping up enforcement activity to record levels to send a clear message that there is no hiding place from the law.\"\nBut Reform UK leader Nigel Farage recently described the figures released by the government as feeble, compared with the numbers that had entered the country.\nHome Office enforcement teams say their visits to work places are intelligence led, following information from a number of sources, partners and the public.\nDuring recent operations in the South East, three Romanians were arrested at a factory in east Kent on suspicion of working in breach of their entry conditions and overstaying.\nIn north Kent, five Indian nationals were arrested at a takeaway shop on suspicion of overstaying their visa.\nThree men - two Indian and one Afghan national - were detained at a restaurant in West Sussex on suspicion of overstaying and working in breach of bail conditions.\nMeanwhile, in East Sussex a man and a woman from India were arrested at a takeaway on suspicion of immigration offences.\nAcross the UK, enforcement teams raided 828 premises including nail bars, car washes, and restaurants and made 609 arrests in January 2024 - a 73% increase on January 2023.\nPeter Walsh, head of the Migration Observatory , externalat the University of Oxford, said: \"Visits to businesses and arrests in January are up , but that's only one month, so we should be cautious about inferring too much from a single month.\"\nHe said more than 1,000 civil penalty notices were issued to employers over the first seven months of the Labour government.\n\"That is more than in recent years, although they were already trending upwards from historic lows after the pandemic.\n\"They're still below levels seen a decade ago,\" Mr Walsh said.\n\"Raids can only ever target a small share of the total businesses employing unauthorised workers.\"", "url": "https://www.bbc.co.uk/news/articles/cq6y276p743o"}