{"authors": ["Jamie Morris", "www.facebook.com"], "date_download": "2025-04-26 06:21:01", "date_modify": "2025-04-26 06:21:01", "date_publish": "2025-03-01 03:54:02", "description": "Six-year-old Teddy is gifted a \"buddy bench\" after saving more than 2,500 tubs from landfill.", "filename": "news_articles_c33744nxpdro_1745648461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3381/live/e12c1080-f651-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c33744nxpdro_1745648461.html", "title": "Teddy surprised with gift made from thousands of tubs he saved from landfill", "title_page": "Teddy surprised with gift made from thousands of tubs he saved from landfill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A little boy, who has earned the nickname \"Sweet Tub Teddy\" after saving thousands of confectionery tubs from landfill, has been gifted a bench made from his recycled plastic tubs.\nThe six-year-old from Netley, Hampshire, collected more than 2,500 tubs through the Tub2Pub scheme to make outdoor furniture.\nArriving at school on Thursday, he was surprised to find the \"buddy bench\" in the playground.\n\"Everyone can make a difference, it doesn't matter how small you are,\" said Teddy, as the bench was unveiled.\nA plaque on the purple seat reads: \"With thanks to Teddy for your outstanding efforts contributing to Tub2Pub 2025 from Greene King, co-cre8, DCW Polymers and Macmillan Cancer Support.\"\nTeddy, whose hero is David Attenborough, previously told the BBC he was \"angry\" when he found out that the containers could not be recycled in his family's normal recycling bin.\nSome authorities in the UK have the capacity to recycle the tubs via kerbside collection but Hampshire currently does not.\nTeddy set about collecting the tubs from people's houses and bins and wrote a letter to his school, which in turn wrote to parents.\nWith help from his mum Laura, he put up posters at local businesses and got his grandad to go to the local tip to ask them to save any tubs that people had binned.\nA post from Teddy on Facebook, in which he described himself as an \"eco warrior on a mission\" and telling of how \"hundreds of thousands of [tubs] go to landfill or the ocean\", helped gather further momentum.\nGeorgia Harlow, from Co-cre8, said Teddy \"epitomises the willingness of the public to engage with recycling\", adding that he is a \"fantastic example of what can be achieved\".\nShe said: \"The bench we are donating to Teddy's school is not only to show our appreciation for his amazing efforts but also to demonstrate how he has helped to turn used plastic tubs that may have otherwise been discarded as general waste, into a new, useful product that will be used at the school for many years to come.\"\nThe day before, Teddy visited a recycling facility to learn how they use the plastic collected through the scheme to make outdoor furniture.", "url": "https://www.bbc.co.uk/news/articles/c33744nxpdro"}