{"authors": ["David Spereall", "www.facebook.com"], "date_download": "2025-04-26 07:50:31", "date_modify": "2025-04-26 07:50:31", "date_publish": "2025-02-25 15:53:41", "description": "Marina Stocks struck off nursing register by tribunal hearing details of 'unprofessional' conduct.", "filename": "news_articles_c3w1882q145o_1745653831.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0ddb/live/21503e60-f38d-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w1882q145o_1745653831.html", "title": "Leeds nurse made 'sexual gestures' and 'touched breasts' at work", "title_page": "Leeds nurse made 'sexual gestures' and 'touched breasts' at work - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A senior care home nurse who danced \"provocatively\" and made \"sexual gestures\" in front of a resident has been barred from the profession.\nMarina Stocks was drunk when she began \"touching her breasts\" and dancing in front of the resident at Ravensdale Care Home in Whinmoor, Leeds, a tribunal was told.\nShe then became abusive towards colleagues, swearing at them and elderly residents when she was challenged about her behaviour.\nThe Nursing and Midwifery Council (NMC) panel said Stocks, who resigned shortly after the incident on 21 April 2023, had to be struck off the nursing register to \"maintain confidence\" in the profession.\nPapers from the tribunal, which Mrs Stocks did not attend, told how \"while dancing and singing\" in front of a resident in a lounge she \"became more expressive and began to behave in an inappropriate manner\".\nIt was said that she was \"observed dancing provocatively, including touching her breasts, and making sexual gestures\" towards the resident.\nAfter being asked about her behaviour by the home's manager, Mrs Stocks replied that she was \"only trying to have a laugh\" and, using an expletive, branded her colleagues \"miserable\".\nThe nurse was then allowed to return to work, but swore at one of the colleagues who had reported her actions and was then later seen drinking a bottle of wine through the window of a staff room.\nAfter being sent home because she was deemed unfit to work, Mrs Stocks was abusive to the manager and returned to the lounge where she \"shouted and swore at the staff and residents present\".\nShe formally resigned shortly afterwards and later retired from nursing.\nThe NMC said concerns had been raised previously about the nurse's behaviour while employed at Ravensdale, including occasions where she was seen \"lying down next to residents in their beds\".\nDuring the investigation into her conduct, further claims were brought that Mrs Stocks had failed to administer medication to residents on four occasions during a previous job at another Leeds care home, in May 2021.\nHer actions left the residents at \"unwarranted risk of serious harm\" it was said.\nAccording to the tribunal, Stocks admitted all allegations and accepted her actions amounted to \"serious professional misconduct\".\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c3w1882q145o"}