{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:46:07", "date_modify": "2025-05-19 14:46:07", "date_publish": "2015-02-11 09:52:03", "description": "A vicar who claims he was the victim of a four-year campaign of hate appears at the Court of Appeal over whether he has the right to bring an action for unfair dismissal.", "filename": "news_uk-england-hereford-worcester-31320959_1747665967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80919000/jpg/_80919078_mark_sharpe_464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-hereford-worcester-31320959_1747665967.html", "title": "Hanley Broadheath 'harassed' vicar at Court of Appeal", "title_page": "Hanley Broadheath 'harassed' vicar at Court of Appeal - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A vicar who claimed he was the victim of four years of harassment has appeared at the Court of Appeal over whether he has the right to bring an action for unfair dismissal.\nThe Rev Mark Sharpe said he was driven from Hanley Broadheath parish near Worcester, by a \"campaign of hate\".\nHis case rests on whether his position can be legally defined as an \"employee\" or a \"religious office holder\".\nMr Sharpe argued he was the former, but the Church of England disagreed.\nMembers of the clergy are not covered by employment legislation as, in the eyes of the law, they are employed directly by God.\nBut if appeal judges agree Mr Sharpe was employed by the Bishop of Worcester, he would be entitled to protection by legislation including the 1996 Employment Rights Act, external, enabling him to begin an attempt to sue for unfair dismissal.\nThe Church maintained he was not an employee but a religious office holder, and therefore subject to ecclesiastical law.\nMr Sharpe claimed his dog was poisoned, his car tyres slashed and his post tampered with.\nHe said the Church should have \"warned him of the nature of the parish and its problems\" and that he \"should have been offered better support and protection when the harassment began\".\nThe case has already been through two hearings.\nInitially, the Church view prevailed, and an employment tribunal ruled that he was neither an employee nor a worker and rejected his unfair dismissal claim.\nBut an employment appeal tribunal overturned that decision.\nSally Kosky, Unite union's national officer, said: \"It is deeply disappointing that the Church of England has gone to such lengths to avoid its responsibility as an employer.\n\"It cannot be that on the one hand the Church takes huge strides forward on gender equality, yet on the other remains in the dark ages on fundamental employment rights.\"\nA spokesperson for the Church of England said clergy \"are office holders, not employees of the bishop, the diocese or anyone else\".\nThe spokesperson said: \"Discussions and decisions at General Synod following a major consultation with clergy, have shown that on the whole clergy do not wish to change this status.\n\"It is also disappointing that Mr Sharpe and Unite continue to negatively reflect on the parishes which he served in Teme Valley South. This claim is not borne out by clergy working in the parish either before or since, all of whom speak very warmly of the people of the parishes.\"\nThe hearing continues on Wednesday.", "url": "https://www.bbc.com/news/uk-england-hereford-worcester-31320959"}