{"authors": ["Paul Brennan", "Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 06:59:04", "date_modify": "2025-04-26 06:59:04", "date_publish": "2025-02-27 05:56:03", "description": "Roller hockey players in Bisley say the sport has been \"decimated\" after its rink was taken away.", "filename": "news_articles_ceqj98w721no_1745650744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/57af/live/b9cc6540-f461-11ef-bc71-6ff62e3f49fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ceqj98w721no_1745650744.html", "title": "Surrey inline hockey league 'devastated' by loss of Bisley rink", "title_page": "Surrey inline hockey league 'devastated' by loss of Bisley rink - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Roller hockey players across the South East say the sport has been \"decimated\" after its Surrey home was taken away.\nMore than 1,800 players from 87 clubs competed at the Lord Roberts Centre in Bisley with teams travelling from Brighton, Southampton and as far afield as Cardiff, the British Inline Puck Hockey Association (Bipha) says.\nBut organisers said they were \"shocked and devastated\" that the rink's owners, the National Small-bore Rifle Association (NSRA), stopped them using the rink midway through their season.\nAn NSRA spokesperson said the decision was made to protect its members and staff after incidents involving hockey players, which Bipha said were \"dealt with through our normal processes\".\nAt a protest in Pirbright on Saturday, Rob Golding, vice chairman of the Bipha South division, said: \"It came as a massive shock without any real warning or any real reason as to why it has happened.\"\nHockey player Tim Richards added: \"It's devastating. You are not just taking the league away, it's a huge chunk of people's lives.\"\nThe NSRA told Bipha that, as of 17 February, it could no longer use the rink.\nOriginally built in the 2000s, the rink is the only purpose-built roller hockey site in the south of England, Bipha added.\nMatt Guille, NSRA vice chairman, said the decision came after meetings with Bipha about behaviour, and incidents in January involving the police being called.\nSurrey Police said it had been called to an alleged assault on 5 January but took no further action.\nMr Guille added: \"While we feel a great deal of sympathy for them, we feel we have to protect our members and our staff.\"\nA Bipha South spokesperson said it \"dealt with situations through our normal processes\", but appealed to the NSRA to \"work together to create a safe rink\" until the end of the season in June.", "url": "https://www.bbc.co.uk/news/articles/ceqj98w721no"}