{"authors": ["Paul Glynn", "www.facebook.com"], "date_download": "2025-04-26 08:01:16", "date_modify": "2025-04-26 08:01:16", "date_publish": "2025-02-25 10:25:13", "description": "The Rockin' Chair singer was affectionaly known as the \"queen of the rare groove\".", "filename": "news_articles_cm2jlygl46zo_1745654476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/17e2/live/4e5b2a80-f2b3-11ef-9220-d3ef6018353e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jlygl46zo_1745654476.html", "title": "Gwen McCrae: Tributes paid to funk and soul singer who has died", "title_page": "Gwen McCrae: Tributes paid to funk and soul singer who has died - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tributes have been paid to Gwen McCrae, the much-loved and influential US funk and soul singer, who has died aged 81 after a long illness.\nAffectionately known as the \"queen of the rare groove\", McCrae had a 1975 soul smash with Rockin' Chair.\nHer catalogue - which also includes the dancefloor anthem All This Love That I'm Givin', as well as other tracks like 90% of Me Is You, Keep the Fire Burning and Funky Sensation - has been heavily sampled by artists including Lady Gaga, Cassius, Avicii, Madlib, Cypress Hill and Mobb Deep.\nThe singer died on Friday in Miami, Florida, her family confirmed in a statement to the BBC late on Monday.\n\"While we will miss her dearly and our hearts are heavy, we find solace in knowing she is no longer suffering from the pain she endured in the last few years of her 81 years of life,\" added daughters Wanda, Sophia, Leah and son Alex.\nThey added they now wished to \"celebrate\" the \"remarkable legacy\" of a \"talented and gifted artist\".\n\"She poured her love into what she did, and cherished her family, friends, and adoring fans worldwide.\"\nFrom around the music world, Disclosure and Dave Pearce led the tributes to the singer.\n\"Rest in peace the great Gwen McCrae,\" posted English electronic duo Disclosure., external\nDJ Dave Pearce said:, external \"Sad to learn of the passing of soul legend Gwen McCrae - thanks for all the amazing tunes...\"\nBorn Gwen Mosley in Pensacola, Florida into a church-going musical family, the star started singing in the church choir aged seven.\nShe began her career as a teenager singing in local clubs with groups such as The Lafayettes and The Independents.\nShe then met a young navy sailor and singer named George McCrae who she married within a week of meeting. And the couple signed to Henry Stone and Steve Alaimo's TK Records, which would provide the groundwork for the later disco explosion.\nGwen McCrae found success on the R&B chart as a solo artist with 1970 single Lead Me On.\nAnd in 1972 she released Always on My Mind, a track that would go on to be a hit for the likes of Elvis Presley, the Pet Shop Boys and Willie Nelson.\nHer 1975 minor hit, It's Worth the Hurt, was eclipsed by the success of her husband's mega hit Rock Me Baby, a track which had originally been meant for her.\nHer response came in the form of her own big hit, Rockin' Chair - penned by Willie Clarke and Clarence Reid - which helped to define the label's dance-oriented Miami sound.\n\"Her rich alto voice sounded like she was still singing in church, but the lyrics were pure 70s pop/soul,\" noted US music source Soul Tracks, external of the track.\nTheir respective successes put a strain on the couple's marriage and they got divorced a year later.", "url": "https://www.bbc.co.uk/news/articles/cm2jlygl46zo"}