{"authors": ["Rachel Russell", "www.facebook.com"], "date_download": "2025-04-26 06:56:50", "date_modify": "2025-04-26 06:56:50", "date_publish": "2025-02-28 14:33:30", "description": "The month of Ramadan is expected to start on 28 February and end on 30 March in 2025.", "filename": "news_articles_cwyggye4g9do_1745650610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/967f/live/b9a11490-f5d7-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyggye4g9do_1745650610.html", "title": "Mosque opens doors during Ramadan", "title_page": "Hull Mosque opens doors during Ramadan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A mosque in East Yorkshire will hold daily prayer and iftar events as it prepares to become part of the \"heartbeat of the community\" during this year's Ramadan.\nRamadan is expected to start on 28 February and end on 30 March in 2025, as it usually lasts between 29 and 30 days depending on the cycle of the Moon.\nDuring the month of Ramadan, Muslims do not eat or drink between dawn and sunset, and will often gather for meals known as iftar to break their fast.\nZia Salik, chair of the Hull Mosque and Islamic Centre, in Berkeley Street, said people would be welcome to join their community to break their fast and pray.\nHe said: \"Ramadan is one of the busiest times for the Muslim community generally but it's also the time when Muslims are the most charitable.\n\"There will be an iftar meal every day in the mosque so anyone that is struggling or doesn't have any family, is lonely, or is a student and want to break their fast with others, they are very welcome.\n\"The mosque becomes the heartbeat of our community during this time as the amount of activities going on here during this time goes through the roof, which keeps all of us busy.\n\"As much as the month of Ramadan is a nourishment for the soul from a spiritual perspective, there is also a strong sense of community which people benefit from as well, so it is a fantastic time for us.\"", "url": "https://www.bbc.co.uk/news/articles/cwyggye4g9do"}