{"authors": ["Charlotte Benton", "PJ Ellis", "www.facebook.com"], "date_download": "2025-04-26 07:36:03", "date_modify": "2025-04-26 07:36:03", "date_publish": "2025-02-27 14:55:41", "description": "Regional officer for Unite Zoe Mayou fears the bin strike could continue on into the summer.", "filename": "news_articles_crlxxjz7je2o_1745652963.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a0eb/live/8b7cbd90-f50e-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlxxjz7je2o_1745652963.html", "title": "Birmingham bin strike could go on for months, union says", "title_page": "Birmingham bin strike could go on for months, union says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bin strikes in Birmingham could go on for months, a union has warned.\nUnite members have staged a series of one-day walkouts since January, but on Wednesday the trade union announced refuse workers would move to all-out strikes from 11 March.\nScenes of bin bags piled on pavements are an unwelcome reminder of industrial action in previous years and have been blamed by residents for attracting vermin.\nIn a statement, Birmingham City Council said the escalation would lead to \"greater disruption to residents, despite the fair and reasonable offer that the council made to the union\".\nSteven Message, who is a resident in Hockley on Brookfield Road, said he was concerned the disruption would lead to an increase in fly-tipping.\n\"We can't have wheelie bins because there is nowhere to store them, but then we put the black bags out and people see that and think 'Great, I'll dump my mattress there or my sofa' and it attracts more waste,\" he said.\n\"We've had everything, you name it we've had it. There's no way anyone can get down this pavement.\"\nOther residents in the city told the BBC that they believed the large amounts of waste on the streets had attracted \"cat-sized\" rats.", "url": "https://www.bbc.co.uk/news/articles/crlxxjz7je2o"}