{"authors": ["Paul Burnell", "www.facebook.com"], "date_download": "2025-04-26 03:49:04", "date_modify": "2025-04-26 03:49:04", "date_publish": "2025-03-05 13:58:58", "description": "Six men and four women are being quizzed about an alleged scam involving £700,000 of equipment.", "filename": "news_articles_c5yx07kqpy5o_1745639344.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/37a3/live/37c7cfd0-f9c5-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yx07kqpy5o_1745639344.html", "title": "Plant machinery hire 'scam' sees 10 arrested in Lancashire raids", "title_page": "Plant machinery hire 'scam' sees 10 arrested in Lancashire raids - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ten people have been arrested after nearly £700,000 of plant machinery was stolen across the UK, police have said.\nDetectives said the scammers used fake ID to hire equipment without any intention of returning it.\nOfficers carried out dawn raids in Lancashire and made arrests in Padiham and Burnley.\nPolice said the thefts had taken place in Cheshire, Cumbria, Humberside, West Midlands, Lancashire, Hertfordshire, Avon and Somerset, Staffordshire, Merseyside, Derbyshire, North Yorkshire, West Mercia and Lincolnshire.\nThe list of stolen equipment was dominated by mechanical diggers, Cheshire Police said.\nSix men, aged from 44 to 69, and four women, aged 29 to 36, have been arrested and are being questioned.\nDet Sgt Graeme Carvell said the arrests were \"the culmination of a detailed investigation into the theft of around £700,000 worth of plant equipment from suppliers across the UK\".\nHe added: \"We believe that those involved have been using false identifications in order to hire out plant equipment with no intent of ever returning the machines.\"\nThe investigation has been led by Cheshire Police, working with the specialist National Construction and Agriculture Theft Team and officers from Lancashire Police's rural crime unit.", "url": "https://www.bbc.co.uk/news/articles/c5yx07kqpy5o"}