{"authors": ["Rachel Russell, Sarah Sanderson & Andrew Spence", "www.facebook.com"], "date_download": "2025-04-26 07:30:04", "date_modify": "2025-04-26 07:30:04", "date_publish": "2025-02-27 18:02:03", "description": "The move has reduced the Liberal Democrat majority on Hull City Council to one.", "filename": "news_articles_cvgppvjy0g1o_1745652604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d947/live/fa73ab80-f52e-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgppvjy0g1o_1745652604.html", "title": "Hull councillors defect over council tax and rent rises", "title_page": "Hull councillors defect over council tax and rent rises - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two Liberal Democrat councillors in East Yorkshire have defected to become Independent after they said they were unable to support rising council tax and rent bills.\nJulia Conner and Sherilee Jepmond, who both represent the Longhill and Bilton ward, are now listed as Independents on the Hull City Council website.\nThe move has reduced the Liberal Democrat council majority to one on the council. The party has 29 councillors, Labour has 25 and there are now three Independents.\nConner, who defected from Labour to the Liberal Democrats three years ago, said the recent budget announcements were the final straw.\nShe said: \"Last year we were the only two Lib Dems in the group to vote against the maximum increase for council tax of 4.99% and 7.7% rent increase for council tenants.\n\"This year we could not support a Lib Dem budget which, for the third year running, increased the council tax and tenants' rent to the maximum possible.\n\"In the last two years council rent has increased by 14.7%, putting additional financial pressures on families already struggling with a cost of living crisis.\"\nEarlier this month, council leader Mike Ross said the money from the increased council tax would go towards funding pothole repairs, street cleaning and making communities safer.", "url": "https://www.bbc.co.uk/news/articles/cvgppvjy0g1o"}