{"authors": ["Samantha Granville", "www.facebook.com"], "date_download": "2025-04-26 03:43:53", "date_modify": "2025-04-26 03:43:53", "date_publish": "2025-03-05 07:57:40", "description": "\"He's already surpassed all expectations\", Republicans say as they watch Trump's address to Congress.", "filename": "news_articles_cx2031zz370o_1745639033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1fda/live/21afafe0-f995-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2031zz370o_1745639033.html", "title": "Young Republicans cheer Trump on from Texas watch party", "title_page": "Young Republicans cheer Trump on from Texas watch party - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's the first night of the Rodeo in Houston,Texas - usually an unmissable event in the city.\nBut gathered at an Irish pub in the suburbs of the city are a group of young Republicans who don't want to miss US President Donald Trump's prime-time address to Congress.\nAbout a dozen members of the party have piled into the back room of the pub while Fox News blares on surrounding TV screens.\nPeople have come out wearing red, white and blue, with flag pins and scarves to accessorise.\nBefore the speech started, members of the club told me how excited they were to hear Trump's policy proposals.\nIf they had to give him a grade on the first 44 days in office, it was a unanimous \"A+\".\n\"He's already surpassed all expectations,\" one person told me.\nAs the president took to the podium, the group chatter stopped, but the cheering and laughing did not.\nSporting a Trump-Vance baseball cap, Evan Howard, 26, raised his glass every time the President said something he agreed with. And that was a lot.\n\"He's going to crack down on crime and be tough with cartels. He'll stop a lot of American bloodshed,\" he said.\nBut Evan conceded that, 44 days in, he's not feeling the benefit of President Trump being back in office. At least, not yet, and he's happy to wait.\n\"I'm not too much better off, to be honest, but I like what he's doing,\" Evan said. \"I see the work that's being done, and I understand that some of these changes that he's putting through are not going to go through right away, and that we will see their effects in the future.\"\nSeated across from Evan was Brittany, who was far less expressive throughout the event than the rest of the table. A 31-year-old black woman, she's new to the Republican Party.\n\"I think he did great. I thought it was a very unifying message,\" she said. \"He pointed out a lot of things that the Democrats, who I used to feel really connected to at one point, have failed to press on.\n\"[The Democrats] tend to advocate for certain things that don't really apply to Americans as a whole. Americans are struggling. You have issues with crime, you have people losing their home, you have people becoming homeless. And the liberals want to talk about pronouns.\"\nMentions of pronouns, gender, and \"wokeness\" garnered a lot of cheers and claps from the crowd on Tuesday night.\nThe boos came every time the cameras panned to Nancy Pelosi, or Democrats holding signs in the crowd, or any lawmaker looking sleepy in the crowd.\nIn her solemn rebuttal speech to Congress, Democratic senator Elissa Slotkin warned US democracy was \"at risk\".\n\"It's at risk when the president decides you can pick and choose what rules you want to follow, when he ignores court orders and the constitution itself, or when elected leaders stand by and just let it happen,\" she said.\nShe also took aim at the world's richest man, Elon Musk, who she said was combing through Americans' private information with a \"gang of 20-year-olds\" from his White House team known as Doge.\nBut Slotkin's remarks appear to have had little effect on the Republicans gathered in the Texas bar.\nThe only feedback for Trump tonight? Maybe talk about Joe Biden a little less.\nBut otherwise, the parting message from this group is: promises made and promises kept.", "url": "https://www.bbc.co.uk/news/articles/cx2031zz370o"}