{"authors": ["Frank Gardner", "www.facebook.com"], "date_download": "2025-04-26 04:04:45", "date_modify": "2025-04-26 04:04:45", "date_publish": "2025-03-03 18:15:40", "description": "Whatever words are used to frame the plan, enormous challenges lie ahead, the BBC's Frank Gardner writes.", "filename": "news_articles_cwygwrzjxqzo_1745640285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8e44/live/2a92bbb0-f856-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwrzjxqzo_1745640285.html", "title": "What are the hurdles to Europe's peace plan for Ukraine?", "title_page": "What are the hurdles to Europe's peace plan for Ukraine? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Whatever words are used to frame the plans emerging from Sunday's summit of 19 mainly European leaders in London - ceasefire, truce or peace plan - the challenges ahead are enormous.\nThe UK's Prime Minister Keir Starmer, along with French President Emmanuel Macron, hope this will be the plan to eventually bring lasting peace to Ukraine.\nAt its heart lies what Sir Keir is calling the \"coalition of the willing\", those who would help to guarantee peace in the event of a deal being reached.\nBut what are the hurdles – and how easily can they be overcome?\nFirst, can Europe's depleted armies and half-empty arsenals muster anything approaching a substantial deterrent force to deploy to Ukraine? What nations, other than the UK and France, will be willing to send forces into such an uncertain scenario given the doubts over US support?\nUkrainian President Volodymyr Zelensky has said it would need an international force of up to 200,000 troops to sustain a ceasefire along the 600 mile (960km) line of contact between the two opposing armies, Russia and Ukraine.\nAlthough that figure is wildly optimistic, the Ukrainian leader is correct in assessing just how many would be needed to act as a sufficient deterrent to any future Russian incursions.\nIn reality, Europe will struggle to come up with even a third of that number, such is the effect of decades of running down its militaries, years after the post-Cold War peace dividend should have ended.\nAir power would be crucial. This is both for what is known as ISR [Intelligence, Surveillance and Reconnaissance] and for repelling any future Russian incursions.\nThere is no point having a brigade of UK troops sitting on part of the notional ceasefire line if thousands of Russian troops and armoured vehicles are pouring through a gap 100 miles away and there is no adequate means to repel them.\nThe US has a huge capability in Signals Intelligence, Sigint, as well as air-to-air refuelling, without which a purely European force would struggle.\nA recent report by the London-based think tank the International Institute for Strategic Studies (IISS) stated: \"Europe's reliance on Washington's military capabilities, especially critical enablers such as ISR and air-to-air refuelling, will make pursuing 'independence' a major challenge without major investment in those areas.\"\nIt goes on to say that: \"The US also contributes over half of all Nato's fighter and fighter ground attack aircraft.\"\nIn short, putting together a credible deterrent force to protect Ukraine would be extremely challenging, if not impossible, without US military backup.\nDonald Trump likes to say that he doesn't start wars, he stops them.\nThe last thing he wants to do right now is to commit US combat troops and air power to a notional unstable ceasefire line which has the potential to erupt into a shooting war that drags in Nato forces.\nInstead, he has telegraphed his preferred way to end this war, which is to cut a deal direct with Russian President Vladimir Putin, one-on-one.\nSir Keir's aim is for Europe to come up with a credible ceasefire proposal which can then be presented to President Trump in the hope - and I would emphasise that word \"hope\" - that he then agrees to provide a US military backstop.\nSo far, that looks unlikely.", "url": "https://www.bbc.co.uk/news/articles/cwygwrzjxqzo"}