{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 07:53:17", "date_modify": "2025-04-26 07:53:17", "date_publish": "2025-02-25 14:06:25", "description": "Hong Kong teacher Long Wan struck Richard Bower, who had been cycling in the opposite direction.", "filename": "news_articles_ckgz09nnjj8o_1745653997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee8f/live/466217b0-f37d-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz09nnjj8o_1745653997.html", "title": "Driver's 'loss of concentration' killed cyclist in Sheffield", "title_page": "Driver's 'loss of concentration' killed cyclist in Sheffield - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An inexperienced driver caused the death of a cyclist when his car veered onto the wrong side of the road due to a complete loss of concentration, a court has heard.\nLong Wan, 33, had been travelling from Manchester when he fatally struck Richard Bower, 55, on Rivelin Valley Road, Sheffield, on 29 September 2023.\nSheffield Crown Court heard it could not be explained why Wan had ended up on the opposite side of the road as neither excessive speed nor phone usage were identified as possible contributing factors.\nOn Tuesday, the teacher, of Ash Grove, London, and of previous good character, was jailed for two years and disqualified from driving for six.\nWan, who previously pleaded guilty to causing death by dangerous driving, was told he would have to take an extended driving test before he could drive again after his release.\nWitnesses described how Mr Bower, an experienced cyclist who had been wearing hi-vis clothing and a helmet, \"stood no chance\" when Wan's car crossed into his path from the opposite direction.\nMr Bower was taken to hospital with life-threatening injuries and died three weeks later, on 22 October.\nIan Goldsack, prosecuting, told the court Wan, who had moved to the UK from Hong Kong and bought his Mazda car not long before the collision, had considered himself an inexperienced driver.\nMr Goldsack said the defendant maintained he had been complying with the 40mph speed limit but lost control of his car while navigating a bend in the road.\nWhile a collision investigation report could not establish the speed of the car, it concluded it should have been possible to drive along the bend safely even at speeds of up to 60mph.\nThe Recorder of Sheffield, Judge Jeremy Richardson KC, said even if Wan had been travelling above the speed limit, it would not have been \"a widely excessive speed\" and between 30-40mph.\nJudge Richardson said speed had not been \"the real issue\" but rather Wan's \"complete inattention and a comprehensive loss of concentration\".\nPassing sentence, he told him: \"Your very bad driving took the life of a decent man, who had a whole life ahead of him with his wife who had that very day retired from work.\n\"You have wrecked her life.\"\nChristopher Aspinall, mitigating, said the events of that day had \"haunted\" his client, who wished to extend \"an unreserved apology\" to Mr Bower's family.", "url": "https://www.bbc.co.uk/news/articles/ckgz09nnjj8o"}