{"authors": ["Guy Henderson", "www.facebook.com"], "date_download": "2025-04-26 06:28:01", "date_modify": "2025-04-26 06:28:01", "date_publish": "2025-02-27 11:49:48", "description": "The Torquay-born author is known for her detective novels featuring Hercule Poirot and Miss Marple.", "filename": "news_articles_cqjdvkv50jyo_1745648881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dbd0/live/666ba8a0-f44f-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdvkv50jyo_1745648881.html", "title": "Agatha Christie Devon waterfront statue to be unveiled in April", "title_page": "Agatha Christie Devon waterfront statue to be unveiled in April - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new statue of crime writer Agatha Christie in a south Devon town is due to be unveiled later this year.\nThe statue, by local artist Elisabeth Hadley, will be the focal point of Torquay's £4m new harbourside plaza.\nThe unveiling, which will the final part of the development, will coincide with an Agatha Christie festival, Spring Gathering, external, in April.\nVine, who will launch his first crime novel - set in Devon - at the festival, said Christie had \"inspired me from the age of 11\".\nThe statue of the author, known for her detective novels featuring characters such as Hercule Poirot and Miss Marple, should have been unveiled last year, but delays to the harbourside project meant the event had to be pushed back.\nThe author was born in Torquay in 1890 and kept Devon links throughout her life.\nShe died in 1976 aged 85, after writing 66 detective novels, 14 short story collections and more than 20 plays, selling an estimated 300 million books worldwide.\nCarolyn Custerson, chief executive of the English Riviera Business Improvement District, said people were thrilled to celebrate \"one of Torquay's most treasured cultural icons\", according to the Local Democracy Reporting Service.\nShe said the festival would \"bring together crime fiction enthusiasts, bestselling authors, and Christie devotees\".\nThe festival will feature events and speakers including journalist and BBC Radio 2 presenter Jeremy Vine, Sunday Times bestselling novelist and Death in Paradise creator Robert Thorogood.\nMr Thorogood said: \"I have loved Agatha Christie's books my whole life.\n\"It's an honour to be part of this celebration and share a day with fellow Christie fans.\"", "url": "https://www.bbc.co.uk/news/articles/cqjdvkv50jyo"}