{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 03:56:07", "date_modify": "2025-04-26 03:56:07", "date_publish": "2025-03-04 15:22:32", "description": "The authority approves a review of its Local Plan, which goes out for public consultation next week.", "filename": "news_articles_c04zdnzg3kko_1745639767.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8ea4/live/b8fe6bb0-f8e7-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c04zdnzg3kko_1745639767.html", "title": "Debate clashes over plans for thousands of Telford homes", "title_page": "Debate clashes over plans for thousands of Telford homes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to build thousands of new homes in Telford and Wrekin were branded the \"pillage\" of the countryside during a debate between councillors in which others spoke of the necessity for development.\nCouncillor Carolyn Healy, of Labour-run Telford and Wrekin Council, said the loss of 2.8% of farmland was part of a \"balance we need to strike\" to meet growing housing needs.\nFull council approved the step under the Local Plan, which is to go out for public consultation from 17 March before being sent to government inspectors to look at.\nIt came after detracting views were lodged, including those of councillor Andrew Eade, from the opposition Conservative group, who made the \"pillaging\" comment.\nThe proposed strategy, covering a 20-year period, is to expand Telford northwards.\nThree extensions are planned for north of Bratton, Wappenshall and northeast of Muxton.\nThe authority has also decided to keep green spaces in urban areas while \"removing\" development sites in some villages.\nHealy, the cabinet member leading a review of the plan, told Thursday's meeting new homes were needed.\n\"It will involve 2.8 per cent of our farming land and that is a balance we need to strike to meet the needs that we have for our growing population,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c04zdnzg3kko"}