{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:27:44", "date_modify": "2025-04-26 06:27:44", "date_publish": "2025-02-28 18:32:30", "description": "Diana Fairweather-Purkis, 79, died in hospital after waiting hours for an ambulance, an inquest hears.", "filename": "news_articles_cwygn3k2yjwo_1745648864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e313/live/d515b650-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygn3k2yjwo_1745648864.html", "title": "Coroner's action call after woman's 10-hour ambulance wait", "title_page": "Coroner's action call after woman's 10-hour ambulance wait - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A coroner has called for government action following the death of a 79-year-old woman who had waited 10 hours for an ambulance.\nDiana Fairweather-Purkis died from multi-organ failure at the University Hospital of North Tees in 2022.\nA report by Teesside and Hartlepool coroner Paul Appleton highlighted concerns about the shortage of ambulance crews and delays in handing over to hospital staff.\nThe Department of Health said it had \"inherited a broken NHS\" but was \"determined\" to turn it around.\nThe inquest heard a call to the 111 service was made at 22.14 BST on September 30 2022 and an ambulance should have got to Ms Fairweather-Purkis within two hours.\nAt almost 08:00 the next day it had still not arrived and her case was upgraded to Category 2 with a target response time of 18 minutes.\nA crew arrived at 08.10 - nine hours and 56 minutes after the initial 111 call - and transferred her to hospital but her condition deteriorated and she died two days later.\nThe death was due to \"multi-organ failure secondary to urosepsis and contributed to by naturally occurring comorbidities, delays in ambulance attendance, and delays in the prescription and administration of antibiotics\".\nIn a prevention of future deaths report, Mr Appleton outlined his concerns, saying: \"There is insufficient ambulance service availability/resource to enable ambulances to attend to patients in a timely manner and in accordance with relevant target attendance times.\n\"There are excessive delays in ambulance crews being released following attendance at hospital, due to delays in patients being handed over to hospital staff.\"\nThe report, which demands a response containing details of proposed action, was sent to the Department of Health, NHS England, and NHS North East and North Cumbria Integrated Care Board for action.", "url": "https://www.bbc.co.uk/news/articles/cwygn3k2yjwo"}