{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:05:37", "date_modify": "2025-05-21 05:05:37", "date_publish": "2025-01-24 00:00:00", "description": "It could take up to ten days to restore connection to the 250,000 homes without power, says NIE.", "filename": "news_live_cvged0yr8e3t_1747803937.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cvged0yr8e3t_1747803937.html", "title": "'Life threatening' storm sees highest gusts in 27 years in NI", "title_page": "'Life threatening' storm sees highest gusts in 27 years in NI - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThank you for following our live page on the impact of Storm Éowyn in Northern Ireland and the Republic.\nWe're ending our live coverage for tonight, but you can continue to follow the latest on the fallout from the storm here.\nAnother storm to come on Sunday\nBarra Best\nBBC News NI weather presenter\nA wind warning has been issued across Northern Ireland on Sunday ahead of Storm Herminia.\nThis storm has been named by the Spanish Met Office, with more impacts expected there.\nThe system is not forecast to be as severe for Northern Ireland as Storm Éowyn.\nThe Met Office is warning of gusts between 50 to 60 mph and higher over some exposed coastal areas.\nThe yellow warning comes into force at 08:00 on Sunday and lasts until 15:00.\nThose gusts could hamper cleanup operations and repairs following Storm Éowyn.\nTrees falling 'left, right and centre' says councillor\nFallen trees are blocking the lane up to SDLP councillor Malachy Quinn's house in County Tyrone.\nHe said: “It looks as though the tree has come down on the telephone lines in one of the lanes here, and so it's a very volatile and very dangerous situation at the minute.\"\n“Local people have been contacting me since 6am this morning about trees coming down left, right, and centre, so the wind's really done a lot of damage locally.”\n'Limited operations' resume at airport\nBelfast International Airport says that it will be operating limited operations for the remainder of Friday evening.\n\"Like many others across Northern Ireland, we have experienced some power shortages and technical issues this evening, and we will be operating on reduced power,\" a spokesperson said.\nThe airport says it is preparing for a full service to be in place from Saturday and asks that all passengers check with their airlines ahead of travelling to the airport.\nTens of thousands could remain without power through the weekend\nNIE has said that, although they would like to, at least half the number of people without power, 10s of 1000s, could still go through the weekend without power.\nFor context, the last big storm that NI had due to wind was Boxing Day 1998, when about 162,000 customers lost supply, so this is about 100,000 on top of that.\nNIE have requested additional support from colleagues in GB, but say it could be next week before that help arrives in NI.\nAt the peak there were 283,000 people without power; however, as of 17:30 GMT, that number is down to 250,000.\n'Significant number of roads blocked'\nThere have been more than 1,827 blockages logged on Northern Ireland's roads since midnight, according to the Department for Infrastructure.\nThe department advised motorists that it will take some time to clear the fallen trees, branches, and debris.\nIt said that there may be further delays in opening some roads due to a yellow weather warning for snow and ice, which is due to take effect from 19:00 GMT to 10:00 GMT on Saturday morning.\n\"While efforts will be made to salt the main strategic road network, our ability to do so may be impeded by blocked roads and difficult conditions,\" a spokesperson said.\n\"Please continue to consider if your journey is necessary.\"\nSome bus services to return on Friday evening, says Translink\nTranslink says the Belfast Metro and Glider services will resume at 17:00 GMT on Friday, but with a limited offering.\nBuses from Belfast to Dublin, including Dublin Airport, and Belfast's International and City Airports, will also return at 17:00 GMT.\nHowever, Ulsterbus and Foyle services aren't set to return until Saturday, with Translink warning these routes may still be subject to disruption and diversions due to road closures.\nTrain services also won't resume until Saturday, with some disruption expected.\nPolice received 2,000 calls throughout the storm\nPSNI Assistant Chief Constable Davy Beck says police have received about 2,000 calls throughout the day, which is 50% more than they would normally expect on a Friday.\nThis is due to impassable roads, debris, and fallen power lines.\nHe urges the public to continue to stay at home and only travel if absolutely necessary as the high-impact amber warning continues.\nClean-up begins in Fermanagh\nJulian Fowler\nBBC News NI\nIn Bellanaleck the strength of the wind has subsided, allowing people to go outside and inspect the damage.\nTrees and fences have blown down, and some houses have lost ridge tiles, fascia, and television aerials.\nA car has had its rear window broken by flying debris.\nThe cleanup has begun, and roads blocked by fallen trees are being cleared.\nSome shops in Enniskillen have reopened, but many rural areas still have no power or mobile signal.\nAmbulance service acting at 'critical incident level'\nAs expected, Storm Éowyn has brought disruption to ambulance services in Northern Ireland.\nThe service's strategic commander, Mark Cochrane, told Evening Extra that the severe weather has brought \"a whole new set of different challenges\".\nThroughout the day, the service has been acting at a \"critical incident level\" and is now considering how to return to normal.\nChallenges have included staff getting to work due to debris and property damage, as well as difficult road conditions causing issues in getting to patients.\nProblems facing health trusts\nAileen Moynagh\nHealth reporter, BBC News NI\nHealth trusts across Northern Ireland are encouraging people to use the Phone First service before heading to any emergency department.\nThis is their current status:\nNorthern Health Trust\nAntrim Area Hospital and Holywell are running on generators. The trust says it doesn't have any immediate concerns as the generators can run for 200 hours. There is still some staffing impact due to travel issues.\nSouthern Trust\nNone of the hospitals in the area are on generators. Currently low numbers in emergency departments. There are issues with some staff getting in and out and some community staff travelling to home visits.\nWestern Trust\nThe trust says none of its hospitals are running on generators.\nBelfast Trust\nThe trust has reported no problems as of yet, with no impact on acute services.\nNI Ambulance Service\nThey have 65 crews out today responding to category one and category two calls. Other calls are being dealt with by paramedics on the phone. They say their biggest challenge is blocked roads. Call volume is low at this time.\nSouth Eastern Trust\nThe trust is yet to comment on its situation.\nFamily 'terrified' living in crumbling house during storm\nMike McBride\nBBC News NI\nMartin Homer and his family are one of many families in the Republic of Ireland that are staying in a crumbling home during Storm Éowyn.\nThousands of homes in several counties like Donegal, Mayo, Clare and Limerick, are crumbling due to them being built with defective concrete blocks\nMr Homer says he is worried about the structural integrity of their house in County Donegal, which is scheduled to be demolished, and says he is very worried after seeing parts of their exterior walls fly away due to the strong wings.\n\"It's a horrendous situation to live in, we wouldn't wish it on anyone, it's something you have to live in to truly experience we know it's not just us and there are so many out there living this nightmare,\" he says.\n\"We are all terrified, every crunch or crack we hear is leaving us all terrified.\"\nHe says it is vital that everyone stays indoors during the storm, and appealed directly to anyone, like their family, currently residing in a crumbling house to ensure both themselves and their loved ones are safe.", "url": "https://www.bbc.com/news/live/cvged0yr8e3t"}