{"authors": ["Michele Paduano", "www.facebook.com"], "date_download": "2025-04-26 04:30:06", "date_modify": "2025-04-26 04:30:06", "date_publish": "2025-03-03 06:26:51", "description": "Wil Vincent says he was attacked during an admission at the hospital in Dudley.", "filename": "news_articles_c5y0e12x4ygo_1745641806.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b535/live/a387c0b0-f5ea-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0e12x4ygo_1745641806.html", "title": "Black Country troubled mental health hospital worse", "title_page": "Black Country troubled mental health hospital worse - patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former inpatients of a troubled Black Country mental health service have said the situation is getting worse.\nWil Vincent, who runs a peer support group, was attacked during his last admission to Bushey Fields Hospital in Dudley.\nThe Black Country Healthcare Trust is known to have a significant morale problem and the results of another poor staff survey are expected to be announced.\nThe trust said it had upheld some of the concerns raised, and was investing heavily in recruitment as well as a £2.3m new ward that would improve the environment.\nMr Vincent, a university lecturer, spent three periods as an inpatient at the trust in 2023 and the latter part of 2024.\nHe raised concerns relating to a group of 10 patients.\nAfter the attack, in which his head was cut open by another patient, shards of window glass were left for a week, he said, adding to safeguarding concerns.\nHe claimed drugs made their way on to wards through the fence and patients were \"cheeking\", or concealing medication in their mouth, to give it to others.\nSome staff ignored patients who had to adopt a \"knock, wait and hope approach\" at the nurses' office door, he said, adding that patients were often \"left to fester\" with very little to do, particularly at weekends.\n\"There are some great nurses, there are some fantastic healthcare assistants, but this is all swept up in what I can only describe as a mess as to what Black Country Healthcare has become since my first admission in June 2023,\" he said.\nAnother patient, Andrew Potter, claimed that while supposedly being observed by staff because he was in crisis and a danger to himself, he stepped over staff asleep in the corridor.\n\"Every time I went to the toilet, they were just asleep in the corridor. You could just tiptoe past them,\" he said.\nTheir claims related to two wards at the hospital - Wrekin and Clent.\nMr Vincent said staff were often too scared to raise concerns with managers, including concerns for their safety.\nThe Black Country Healthcare trust had already been told to improve its mental health inpatient services after safeguarding issues were raised following an inspection in February 2023.\nMany of the issues highlighted at the time - lack of individual care, staff not having skills required and patients being discharged too soon - have also been been raised since by Mr Vincent.\nThe trust has also been subject to a vote of no confidence by consultants and a poor staff survey last year.\nIn a letter to staff, Chief Executive Marsha Foster identified areas where this year's staff survey also gave cause for concern, which were trust values and behaviours, accountability, leadership compassion and inclusion, managers' effectiveness and freedom to speak up.\n\"I know we need to do better,\" she wrote. \"These latest results make that even clearer.\"", "url": "https://www.bbc.co.uk/news/articles/c5y0e12x4ygo"}