{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:12:42", "date_modify": "2025-04-26 08:12:42", "date_publish": "2025-02-26 11:50:05", "description": "Parents at Gilmerton Primary are warned about a person impersonating pupils on Snapchat.", "filename": "news_articles_c3vwp20g90zo_1745655162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/158d/live/cd6ded40-f44c-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vwp20g90zo_1745655162.html", "title": "Warning after girl, eight, victim of sextortion", "title_page": "Warning after girl, eight, victim of sextortion in Edinburgh - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Edinburgh mother is warning families to check their children's social media after her eight-year-old daughter was a victim of sextortion.\nThe incident happened at home on a personal device.\nParents at Gilmerton Primary have been contacted by the school informing them that a person has been impersonating pupils on Snapchat.\nThe headteacher has written to families urging them to check all pupils' social media accounts and to screen shot, block and report anything suspicious.\nPolice are investigating several reports of indecent images being shared online in Edinburgh.\nThe Edinburgh parent has posted a warning on a community forum urging families to be aware someone has been making fake accounts of her eight-year-old daughter and others, demanding embarrassing videos and pictures, hacking their phones and posting everything online.\nHead teacher Alet Bouwer wrote: \"Dear Gilmerton families, I am writing to inform you that we are aware of an ongoing situation with regards to a person impersonating pupils on social media (specifically Snapchat).\n\"We are working very closely with our colleagues from the Child Protection team within Police Scotland on this matter.\n\"Can I direct you to the page on our website with useful information to keep your children safe online. Please do check all your children's social media accounts.\n\"Screen shot, block and report any suspicious accounts and report this to Police Scotland. We are also more than happy to answer any questions and signpost families to information about online safety.\"\nA Police Scotland spokesman said: \"An investigation is under way after we received several reports in February 2025 relating to indecent images being shared on an online platform in Edinburgh.'\n\"Inquiries are ongoing and we are working closely with a number of partner agencies.\"\nJoan Griffiths, City of Edinburgh Council's education, children and families convener said: \"I was shocked and extremely upset to hear that a child has been subjected to this – and disgusted that anyone could be capable of such a thing. I hope whoever is responsible is caught quickly and feels the full force of the law.\n\"We are offering our full support to the child and her family while reminding all parents to remain vigilant and help keep their children safe online.\n\"If you have any cause for concern, please contact Police Scotland, external immediately.\"\nA Snapchat spokesman said: \"Any sexual exploitation of young people is horrific and illegal, and our hearts go out to the victims in this case.\n\"If we are made aware of such activity, whether through our proactive detection efforts or confidential in-app reporting tools, we remove it, lock the violating account, and report it to authorities.\n\"Snapchat is for people aged 13 and over and we have extra safeguards in place to prevent strangers from being able to easily find or search for teens.\n\"Our Family Centre also lets parents see who their teen is friends with and talking to on Snapchat.\"", "url": "https://www.bbc.co.uk/news/articles/c3vwp20g90zo"}