{"authors": ["Guy Hedgecoe", "www.facebook.com"], "date_download": "2025-04-26 03:58:39", "date_modify": "2025-04-26 03:58:39", "date_publish": "2025-03-04 13:01:08", "description": "It's the first time that a case has gone to court since a euthanasia law was introduced in Spain in 2021.", "filename": "news_articles_crrdqdky9gxo_1745639919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ca05/live/ef8a3570-f8eb-11ef-808b-234dabc32b78.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrdqdky9gxo_1745639919.html", "title": "Father tries to block daughter's euthanasia in landmark Spanish case", "title_page": "Father tries to block daughter's euthanasia in landmark Spanish case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A young woman is due to testify in a Spanish court today in a bid to persuade a judge to let her die voluntarily against the wishes of her father, in the first case of its kind.\nThe 23-year-old woman called Noelia who wants to end her life is paraplegic due to injuries suffered when she tried to take her own life in 2022.\nShe has the support of the regional government of Catalonia after a local euthanasia guarantee and evaluation board unanimously supported her decision in July 2024.\nEuthanasia is the act of deliberately ending a person's life to relieve suffering. It can be involuntary – for example, if a person is in a coma and unable to give their consent – or voluntary, as in this case.\nThe woman was due to die in August, but the process was suspended at the last moment due to legal objections raised by her father, with the backing of the campaign group Christian Lawyers (Abogados Cristianos).\n\"I want to finish with dignity once and for all,\" Noelia told the court on Tuesday.\nShe claimed to have been \"coerced\" by religious groups and said people had filled a room in the care centre where she was currently living with \"small pictures, crosses and religious symbols\".\nThe Catalan government's legal representation in the case has stated that \"no evidence of a scientific or expert character has been presented to contradict the many medical reports which support the decision [to die].\"\nHowever, the woman's father has argued that she is suffering from a personality disorder which affects her judgement and he has pointed to \"the obligation of the state to protect the lives of people, especially the most vulnerable, as is the case with a young person with mental health problems.\"\nHe has also said that she has responded well to rehabilitation treatment.\nHis legal representation has also claimed that the young woman has changed her mind about undergoing euthanasia several times.\nThe public prosecutor has not positioned itself with regard to the case, instead calling for the judge to hear the opinions of experts and the woman herself before taking a decision.\nAmong those also due to testify in court in Barcelona today are a member of the euthanasia board which evaluated her case, a neuro-rehabilitation specialist, and a psychiatric specialist.\nA euthanasia law was introduced in Spain in 2021, but this is the first time that a case has gone to court for a judge to decide.\nLast year, a magistrate in Barcelona rejected an attempt by a man to appeal against his 54-year-old son's euthanasia after it had been approved by the guarantee and evaluation board.", "url": "https://www.bbc.co.uk/news/articles/crrdqdky9gxo"}