{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:34:29", "date_modify": "2025-04-26 06:34:29", "date_publish": "2025-02-27 06:27:01", "description": "Audit Scotland says 40% of Scottish pupils now receive extra help in the classroom.", "filename": "news_articles_c0q1wyeevvgo_1745649269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e528/live/9a4b9170-f441-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1wyeevvgo_1745649269.html", "title": "'Failure to plan' over soaring pupil support needs", "title_page": "'Failure to plan' over soaring pupil support needs - watchdog - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ministers and councils have failed to plan effectively for the soaring numbers of pupils needing extra support in the classroom, according to a spending watchdog.\nAudit Scotland found around 40% of Scottish pupils are now receiving additional support for learning (ASL), most of it delivered within mainstream schools.\nThe report calls for ministers to \"fundamentally rethink\" how they fund and staff provision to meet demand.\nThe Scottish government said it had invested £1bn in additional support needs in the past year and would work with councils to provide more consistent services.\nThe definition of additional support needs is broad - it can include emotional or behavioural issues, autism, disabilities, dyslexia and language support needs.\nIn recent years, the Scottish government has expanded it further to include, for example, looked after children and young carers, which it says in part explains the increase in numbers.\nSince 2004, when a new law marked a shift towards keeping children in mainstream schools, there has been an eight-fold increase in recorded ASL pupil numbers with 285,000 children now receiving some form of support.\nAuditor General Stephen Boyle said: \"The Scottish government has failed to plan effectively for its inclusive approach to additional support for learning.\n\"Current gaps in data mean it is unclear whether all children's right to have an education that fully develops their personality, talents and abilities is being met.\"\nThe report found only about 20% of schools have dedicated facilities for ASL pupils, and dealing with their needs was increasingly a core role for classroom teachers.\nThe inclusive approach had not been reflected in funding formulas, training, class sizes or the design of school buildings, it added.\nIt also found inconsistencies in gathering data, making it hard to gauge what resources were needed.\nNatalie Pinnell's 10-year-old daughter Erin was diagnosed with autism and also has ADHD. She has not been to school since October last year.\nPreviously she attended the \"support hub\" at her Aberdeenshire primary but became increasingly isolated from her peers, eventually refusing to go anywhere near the school.\nNatalie was reassured that mainstream education was the right place for her daughter but she now regrets that.\n\"The impact on children who need that extra support, in a place that doesn't have the budget or the resources to give them that support affects detrimentally the self- esteem and wellbeing both of the children that need it - but also the other children in the classroom as well,\" she told BBC Scotland News.\nShe accepts there are funding pressures, but believes cuts being made in areas like psychological support are impacting some of the most vulnerable children.\n\"It's all well and good saying you can make this cut now - but you've got to look at the longer term.\"\nTeaching union NASUWT said the report showed the presumption of mainstream education had been introduced as a policy without sufficient planning or resources, and was now \"plainly not fit for purpose\".\nGeneral secretary Dr Patrick Roach said schools were left struggling to do their best, but with too many children not getting the support they needed.\n\"Many teachers are increasingly expected to teach children with such high and complex needs that they require almost one-on-one support, at the same time as teaching the rest of their class,\" he said.\n\"Such a situation undermines the right of all pupils to a high-quality education and those pupils who deserve to have their additional learning needs met with specialist support.\"\nScottish Conservative education spokesman Miles Briggs said the report was a \"damning verdict\" showing children were being let down.\n\"Just as the attainment gap between the most and least deprived has widened under John Swinney's government, this report identifies a gulf in outcomes between students who receive support and the rest,\" he said.\nScottish Labour said there was a \"shameful\" failure to grasp the scale of the problem.\nThe party's education spokeswoman Pam Duncan-Glancy said: \"Parents are constantly fighting for their children's education and teachers are being worked to the bone but they aren't getting the support they need from the government.\"", "url": "https://www.bbc.co.uk/news/articles/c0q1wyeevvgo"}