{"authors": ["Jacqueline Howard", "www.facebook.com"], "date_download": "2025-04-26 03:54:24", "date_modify": "2025-04-26 03:54:24", "date_publish": "2025-03-04 17:32:28", "description": "The Ukrainian leader describes Friday's fiery Oval Office meeting as \"regrettable\".", "filename": "news_articles_cge1qq4jdxdo_1745639664.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0f8c/live/9ba7e090-f938-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge1qq4jdxdo_1745639664.html", "title": "Zelensky vows to 'make things right' with Trump and negotiate peace", "title_page": "Zelensky vows to 'make things right' with Trump and negotiate peace - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volodymyr Zelensky said he was ready to work under Donald Trump's \"strong leadership\" to achieve a lasting peace days after their explosive Oval Office meeting.\nThe Ukrainian president described the White House showdown as \"regrettable\" in a lengthy social media post in the wake of the US announcing a pause in military aid to Kyiv.\nZelensky said \"it was time to make things right\", after Trump had accused him of not being ready to come to the negotiating table.\nThe Ukrainian leader also outlined the first stages of how the war could be ended.\n\"We are ready to work fast to end the war, and the first stages could be the release of prisoners and truce in the sky – ban on missiles, long-ranged drones, bombs on energy and other civilian infrastructure – and truce in the sea immediately, if Russia will do the same,\" he wrote.\n\"Then we want to move very fast through all next stages and to work with the US to agree a strong final deal.\"\nIn his social media post, Zelensky said Friday's meeting \"did not go the way it was supposed to be\", adding: \"It is regrettable that it happened this way,\" he wrote. \"It is time to make things right. We would like future co-operation and communication to be constructive.\"\nHe also reiterated that Ukraine was ready to sign a minerals deal with the US, after the failure to do so at the Washington meeting.\nUkraine woke to the news on Tuesday that the US was \"pausing and reviewing\" its military aid to the country after a breakdown in diplomacy last week.\nIn his post, Zelensky offered an overt declaration of gratitude for the help the US has so far given to his country.\n\"We do really value how much America has done to help Ukraine maintain its sovereignty and independence,\" he wrote.\n\"And we remember the moment when things changed when President Trump provided Ukraine with Javelins. We are grateful for this,\" he added, referring to the US anti-tank missile system sold to Ukraine during Trump's first administration.\nDuring Friday's meeting in the Oval Office, Vice-President JD Vance accused Zelensky of being ungrateful for the military support the US had provided.\n\"Have you said 'thank you' once this entire meeting?\" Vance said, before Trump told Zelensky he was not being \"very thankful\".\nZelensky defended himself in the meeting, and began an interview with Fox News in the hours afterwards, saying: \"I'm very thankful to Americans for all your support.\"\nThe Oval Office meeting between Zelensky and US officials last week was due to conclude with the two parties signing a deal that would grant the US access to rare earth minerals in Ukraine.\nAfter the clash, which saw Trump accuse Zelensky of \"gambling with World War III\", the Ukrainian delegation left without signing the deal – Trump told Zelensky \"come back when you're ready for peace\".\nTrump is due to deliver an address to Congress later on Tuesday, during which the Reuters news agency reports he plans to announce a minerals deal between US and Ukraine has been signed.\nA number of Ukraine's allies have commented on the latest from the Ukrainian president, including UK Prime Minister Sir Keir Starmer, who welcomed Zelensky's \"steadfast commitment to securing peace\".\nIt is \"vital that all parties worked towards a lasting and secure peace for Ukraine as soon as possible\", a statement from No 10 said.\nLikewise, French President Emmanuel Macron praised Zelensky's willingness to \"re-engage in dialogue\" with Trump, the Elysee Palace said.\nDays before his meeting with Zelensky, the US President had met with Macron, who travelled to Washington with a warning to Trump: \"You can't be weak in the face of Putin.\"\nWhile European leaders rallied behind Zelensky following the clash, Nato's secretary general advised the Ukrainian leader to \"find a way\" to restore his relationship with Trump.\nSpeaking to the BBC the following day, Mark Rutte said he had told him \"we have to respect\" what Trump has done for Ukraine so far.\nZelensky's statement falls short of an apology to Trump, which those in the US president's camp had called for.\nIn Moscow, Vladimir Putin's team earlier welcomed the US's pause to military aid as likely to be the \"best\" contribution to peace.\n\"If the US stops, or pauses these supplies, this will probably be the best contribution to the cause of peace,\" Kremlin spokesperson Dmitry Peskov told the BBC's Steve Rosenberg.\nTrump himself has not commented on the pause to aid, nor Zelensky's response, however he did earlier berate the Ukrainian leader following his meetings with European allies at the weekend.\nA Sunday summit - hosted by the UK prime minister - was intended as a show of support for Ukraine.\nAfter the meeting, Zelensky said a deal to end the war between Ukraine and Russia was \"still very, very far away\".\nTrump described this as the \"worst statement that could have been made by Zelensky\", in a post on his Truth Social platform.\n\"It is what I was saying, this guy doesn't want there to be peace as long as he has America's backing,\" the president wrote.", "url": "https://www.bbc.co.uk/news/articles/cge1qq4jdxdo"}