{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:58:34", "date_modify": "2025-05-19 14:58:34", "date_publish": "2015-02-06 03:00:20", "description": "Police have spent about £10m providing a 24-hour guard at the Ecuadorean embassy in London since Wikileaks founder Julian Assange claimed asylum there.", "filename": "news_uk-31159594_1747666714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2974/production/_88121601_88121600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31159594_1747666714.html", "title": "Julian Assange: Costs of policing Wikileaks founder reach £10m", "title_page": "Julian Assange: Costs of policing Wikileaks founder reach £10m - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland Yard has spent about £10m providing a 24-hour guard at the Ecuadorean embassy in London since Wikileaks founder Julian Assange claimed asylum there, figures show.\nMr Assange, who denies allegations he sexually assaulted two women in Sweden, faces arrest if he leaves the embassy.\nA Wikileaks spokesman said the policing costs were \"embarrassing\".\nDeputy Prime Minister Nick Clegg said Mr Assange should go to Sweden and \"face justice\".\nBetween June 2012 and October 2014, direct policing costs were £7.3m, with £1.8m spent on overtime, police said.\nScotland Yard confirmed the cost of the operation to UK taxpayers in the first 28 months, until 31 October last year, had reached £9m.\nThe Metropolitan Police said the costs were covered by the budget for diplomatic protection, which provides policing for embassies in the UK.\nThe cost of a further three months policing is now expected to have taken the total bill to about £10m.\nThe figures - which equate to more than £10,000 a day - were obtained by LBC radio under the Freedom of Information Act.\n\"It is embarrassing to see the UK government spending more on surveillance and detaining an uncharged political refugee than on its investigation into the Iraq war, which killed hundreds of thousands,\" WikiLeaks spokesman Kristinn Hrafnsson said.\nSpeaking on the \"Call Clegg\" show on LBC radio on Thursday, Nick Clegg said it was a \"frustrating\" situation, both for the British taxpayer and the Swedish government.\n\"[Sweden] is a country of impeccable democratic credentials with a well-respected judicial system that says [Julian Assange] should go to Sweden to face very serious allegations,\" he said.\n\"Of course the right thing for him to do is to do that, is to face justice.\"\nMr Assange has attacked Sweden, saying the country had \"imported Guantanamo's most shameful legal practice - indefinite detention without charge.\"\nIn August last year, Mr Assange indicated he would \"soon\" leave the embassy, where he has now been for more than 950 days, but he remains inside.\nSwedish authorities want to question Mr Assange over allegations that he sexually assaulted two women while he was in Stockholm to give a lecture in 2010.\nA Swedish appeal court upheld an arrest warrant against Mr Assange in November last year.\nUK courts have repeatedly ruled that he should be extradited to Sweden to face questioning.\nBut Mr Assange fears he could be extradited to the US to face charges over the release of top-secret documents by Wikileaks.\nHe entered the embassy after the UK's Supreme Court dismissed his bid to reopen his appeal against extradition.\nHe was then granted asylum by Ecuador in August 2012\nHe has been warned he will be arrested if he leaves the embassy, prompting the 24-hour guard by Metropolitan Police officers.\nThe Foreign and Commonwealth Office said it was committed to reaching a diplomatic solution.\n\"We are clear that our laws must be followed and Mr Assange should be extradited to Sweden. As ever we look to Ecuador to help bring this difficult, and costly, situation to an end,\" a spokesman said.", "url": "https://www.bbc.com/news/uk-31159594"}