{"authors": ["Sophie Millward", "Susie Rack", "www.facebook.com"], "date_download": "2025-04-26 03:56:01", "date_modify": "2025-04-26 03:56:01", "date_publish": "2025-03-04 15:27:55", "description": "Jane Brookes admits taking £6,000 from Cancer Research UK but is accused of a £226,000 fraud.", "filename": "news_articles_ce8m31d7nz3o_1745639761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/556a/live/9d8303a0-f900-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8m31d7nz3o_1745639761.html", "title": "Bromsgrove fundraiser stole £220k from Cancer Research UK, court told", "title_page": "Bromsgrove fundraiser stole £220k from Cancer Research UK, court told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A fundraiser who admitted defrauding a charity of £6,000 has actually stolen more than £220,000, a court has heard.\nJane Brookes, 54, pleaded guilty on Monday to taking a sum of £6,000 donated by bereaved families to Cancer Research UK over a period of 10 years.\nHowever, the prosecution at Worcester Crown Court has argued she stole £226,557 while chairing a local fundraising committee for the charity.\nDuring a Newton Hearing, external on Tuesday, sitting without a jury to consider the discrepancy in evidence between the two sums, the defence claimed Ms Brookes had taken the money because she was under pressure from a boyfriend.\nInstead a total of £226,557 was allegedly moved by Ms Brookes into multiple personal bank accounts and spent on petrol, shopping, and riding lessons, the prosecution said.\nProsecutor David Iles described the defendant's actions as a \"cunning, deceitful enterprise\".\nHe said she referred to herself as Lady Brookes to present a façade of respectability and argued she misled the charity for a decade, fabricating excuses such as overwork and bereavement to avoid scrutiny.\nThe court heard the fraud was only uncovered in 2021, when a bereaved individual queried why their donation had not been acknowledged and, when police investigated in November of that year, just 47p remained.\nIt was alleged Ms Brookes opened four Halifax accounts to disperse transactions and used ten personal accounts despite having no paid employment during the period in question.", "url": "https://www.bbc.co.uk/news/articles/ce8m31d7nz3o"}