{"authors": ["Isaac Ashe", "Ady Dayman", "www.facebook.com"], "date_download": "2025-04-26 04:19:26", "date_modify": "2025-04-26 04:19:26", "date_publish": "2025-03-04 06:16:50", "description": "Lumbers says it has traded in the city centre for 140 years but might relocate to Fosse Park.", "filename": "news_articles_c5y02w1lnlxo_1745641166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/18d8/live/0897a6d0-f83b-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y02w1lnlxo_1745641166.html", "title": "Jewellers could quit Leicester city centre over parking concerns", "title_page": "Jewellers could quit Leicester city centre over parking concerns - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A jewellers based in Leicester for more than 140 years said it could move to an out-of-town shopping centre due to concerns over city centre parking.\nLumbers, in High Street, has traded in Leicester since 1881 but is now considering an offer to relocate to Fosse Park on the edge of the city, near Enderby.\nThe firm's managing director Dominic Gomersall said there was \"not a part\" of him that wanted to move but he claimed city centre pedestrianisation and bus and cycle lanes were driving out shoppers in cars.\nLeicester City Council said city car parks were competitively priced and well-used and that there was a good bus service to the city centre.\nMr Gomersall told the BBC: \"I can't quite believe that there's even a minute of a thought that I'd want to move.\n\"Moving a business is a huge upheaval.\n\"I believe the council has made Leicester look better than it's ever looked - Jubilee Square, what they're proposing on the Market Square, the new train station proposals, cobbling the old part of town, the cathedral, Guildhall Lane - there's lots of parts we should be really proud of.\n\"But to me, they're going one step too far with the absolute demise of allowing a car in a centre.\n\"We're a luxury goods emporium - we also need the people who drive their Range Rovers and drive their Teslas and this, that and the other.\n\"The city council needs to understand that they're never going to come on the bus.\"\nLeicester mayor Sir Peter Soulsby said: \"The city centre is not dying, it's changing, and of course there are challenges city centres up and down the land are facing.\n\"Out of town shopping is one of the things that is changing it, online shopping is another.\n\"Since 2020 we've had a few losses, M&S is the very obvious one, but we've had a net gain of some 36 businesses.\n\"They come not out of charity, they come because it makes business sense for them.\n\"It's not just shops - Fosse Park doesn't have the night time economy the centre does, the city centre is 24/7, increasingly a place that people want to live, and it's also a place where people work.\"", "url": "https://www.bbc.co.uk/news/articles/c5y02w1lnlxo"}