{"authors": ["Harriet Heywood", "www.facebook.com"], "date_download": "2025-04-26 07:03:29", "date_modify": "2025-04-26 07:03:29", "date_publish": "2025-02-28 08:09:40", "description": "The auctioneer says it confirms works by East Anglian painter Cedric Morris are much sought-after.", "filename": "news_articles_c78ee414g4eo_1745651009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1424/live/e7a83a30-f52d-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78ee414g4eo_1745651009.html", "title": "Double-side Cedric Morris painting auctioned for £162,500", "title_page": "Double-side Cedric Morris painting auctioned for £162,500 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A two-sided painting by a renowned East Anglian artist has sold at auction for more than three times its estimated sale price.\nCambridge-based auctioneers Cheffins said the Cedric Morris artwork, which had never been sold on the open market before, fetched £162,500 and showed the artist's \"continued popularity\".\nMorris (1889-1982), who founded the East Anglian School of Painting & Drawing in Essex before moving it to Suffolk, was believed to have finished the artwork in the 1930s before gifting it to his student, Bettina Shaw-Lawrence.\nThe oil on canvas, which featured a floral landscape on one side and rural building on the reverse, was sold to a London-based bidder on Thursday.\nThe auction was the first time the painting had been available on the open market and the sale estimate was set at £30,000-£50,000.\nIt followed Cheffins' previous auction of another Morris which had been gifted to fellow artist Lucy Harwoodwork.\nThe other side depicted outbuildings at the art school at Benton End, near Hadleigh in Suffolk, which had relocated from Dedham in Essex after a fire.\nMorris ran the private art school with fellow painter Arthur Lett-Haines. Aldeburgh Scallop sculptor Maggi Hambling was one of their pupils.\nBrett Tryner, a director at Cheffins said: \"This is an excellent result and demonstrates Morris's continued popularity as one of the most sought-after artists in the post-modern era.\n\"The paintings enviable provenance, having been gifted directly by Morris to Bettina Shaw-Lawrence, helped to ensure this painting had some serious pre-sale interest, with inquiries from both private buyers and institutions the world over.\n\"Perfectly demonstrating the period in Morris's career when he produced some of his most wonderful still-life pictures, this painting was unusual to have firstly been fresh-to-market, but also to have another view painted on the reverse.\"\nThe landscape paintings, external were given to Cheffins to auction by the Shaw-Lawrence family.\nMr Tryner said Bettina Shaw-Lawrence had been a well-regarded artist herself and initially attended art classes by the painter Fernand Léger in 1938.", "url": "https://www.bbc.co.uk/news/articles/c78ee414g4eo"}