{"authors": ["James Robbins", "www.facebook.com"], "date_download": "2025-05-19 15:35:30", "date_modify": "2025-05-19 15:35:30", "date_publish": "2015-02-18 19:01:45", "description": "Did the West's \"limited intervention\" policy lead Libya down a path of destruction, the BBC's James Robbins asks.", "filename": "news_world-africa-31521282_1747668930.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81093000/jpg/_81093354_81093353.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31521282_1747668930.html", "title": "How West's limited intervention failed Libya", "title_page": "How West's limited intervention failed Libya - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"In the wake of Iraq and Afghanistan, Britain is pulling back from international intervention, just as America pulled back after the Vietnam War.\"\nThat was the judgement this week on Britain's shifting foreign policy from a real insider, Sir John Sawers.\nHe was Chief of the Secret Intelligence Service, MI6, for five years until last November.\nFor the whole of the preceding decade, he was also extremely close to the centre of power, as Tony Blair's foreign policy adviser, Britain's Ambassador in Egypt, and then at the United Nations.\nSo Sir John's speech this week was particularly timely and interesting, coinciding with one of those moments when the harsh light of brutal events suddenly focuses attention on how much has changed in the world.\nThis was his view of Libya in 2011: \"When crisis erupted in Libya, we didn't feel it right to sit by as Gaddafi crushed decent Libyans demanding an end to dictatorship.\n\"But we didn't want to get embroiled in Libya's problems by sending in ground forces. After Gaddafi was ousted, no-one held the ring to help manage a transition to something better, as the US, Britain and other allies had done in Baghdad and Kabul.\n\"Libya had no institutions. Who or what would take over? The answer? Those with the weapons. Result? Growing chaos, exploited by fanatics.\"\nColonel Gaddafi had completely stripped it of any genuine bodies of representative government during his four decades of horribly successful family dictatorship.\nIt's a far cry from Iraq and Afghanistan, which in their different ways, exacted high prices in blood and treasure.\nBut is the outcome in Libya likely to be any better? Does the shift leave Britain's foreign policy looking increasingly rudderless in a sea of international fear and uncertainty?\nMost foreign policy analysts seem to agree that the major Western powers, Britain included, are now caught in a sort of policy no-man's land between intervention and non-intervention.\nPoliticians are trying to satisfy citizens who continue to expect security and protection, but who also seem increasingly unwilling to tolerate the sort of defence spending that protection might require, and, more importantly, the scale of sacrifice in soldiers' lives which ground combat inevitably brings.\nWhat Libya got was neither full intervention nor complete non-intervention, but a sort of limited intervention.\nThat limited intervention, sanctioned by the UN, led by David Cameron for Britain and President Nicolas Sarkozy for France, was based on the new-ish doctrine of the \"Responsibility to Protect\".\nThe justification in this case was to prevent the late Colonel Gaddafi massacring civilians in Benghazi, headquarters of the revolution gathering pace to destroy him.\nOne argument, which often runs through Foreign Office and Downing Street thinking, is that Britain can only exercise its \"Responsibility to Protect\" in some cases, where it seems do-able - and cannot in others, like Syria, where Assad's forces have usually been considered too dangerous a foe.\nBut that, so the argument goes, shouldn't prevent all intervention anywhere. Do good where you can.\nAn incidental advantage of the Libya strategy, at least as seen from Washington, was that it largely excused the United States from major involvement. It instead showcased the European Union's two dominant military powers taking the lead for a change.\nThe huge difficulty with limited intervention, of course, is the unpredictability of outcomes.\nThat fickle and unfathomable \"law of unintended consequences\" delivered catastrophic results in Libya.\nWestern policy relied on maintaining the unity of anti-Gaddafi forces once they had dealt with their shared enemy.\nLight-touch Western efforts to help Libyans put aside their tribal and factional differences forever and embrace power-sharing through representative government based on national unity, have comprehensively collapsed.\nAs evidence of that, you need look no further than today's Benghazi - Libya's second city, home to the revolution.\nWestern airpower helped protect it from destruction by Gaddafi.\nInstead, in recent months the revolutionaries have reduced large swathes of the city to ruins by fighting each other. The wider collapse of the state has now allowed in elements of so-called Islamic State.\nThey have recruited ideological allies and gained a significant foothold from which to open a new front beyond Syria and Iraq.\nLet's leave the last words to Sir John Sawers, from his speech at the beginning of this week.\n\"Yes, intervening has huge risks and costs. Not intervening also has huge risks and costs,\" he said.\n\"Afghanistan and Iraq? Or Syria and Libya? Which outcome is worse? Perhaps it's too early to say. We need to have that debate.\"", "url": "https://www.bbc.com/news/world-africa-31521282"}