{"authors": ["Chloe Harcombe", "www.facebook.com"], "date_download": "2025-04-26 06:48:39", "date_modify": "2025-04-26 06:48:39", "date_publish": "2025-03-01 11:05:54", "description": "Jegir Asaad is remanded in custody ahead of sentencing at a later date.", "filename": "news_articles_c757dqe0365o_1745650119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5d17/live/6b0bb810-f688-11ef-93d4-53054053c79d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c757dqe0365o_1745650119.html", "title": "Bristol man convicted of murder by jury following stabbing", "title_page": "Bristol man convicted of murder by jury following stabbing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been convicted of murder after a man was stabbed last year.\nJegir Asaad, 24, fatally attacked Tomasz Stankiewicz on Filton Avenue in Horfield, Bristol, during the early hours of 21 August, following an altercation.\nMr Stankiewicz, 39, was stabbed when he went to collect one of two women who had been with Asaad and fellow defendant Ferahg Fukeri, who was acquitted of murder.\nAsaad was remanded to be sentenced at a later date.\nAsaad called police at about 02:30 BST to report that a man was making threats in the street.\nHowever, when officers arrived, they saw nothing untoward and left the scene.\nPolice said Mr Stankiewicz continued to offer to take the second woman home.\nWhen Mr Stankiewicz returned to the street at about 03:40 BST, he took a wheel wrench from the boot of his car and approached the property, the force added.\nAn altercation broke out and Mr Stankiewicz sustained fatal injuries.\nA few minutes later, a taxi driver travelling along the street saw Mr Stankiewicz lying in the road.\nHe collected him and drove a short distance before stopping to call an ambulance, which took the victim to Southmead Hospital where he died a short time later.", "url": "https://www.bbc.co.uk/news/articles/c757dqe0365o"}