{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:28", "date_modify": "2025-05-19 15:22:28", "date_publish": "2015-03-06 08:51:01", "description": "Alexei Navalny vows not to \"step back\" as he is released from prison a week after the killing of fellow opposition figure, Boris Nemtsov.", "filename": "news_world-europe-31762173_1747668148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81439000/jpg/_81439469_81439462.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31762173_1747668148.html", "title": "Russian Kremlin critic Alexei Navalny out of Moscow prison", "title_page": "Russian Kremlin critic Alexei Navalny out of Moscow prison - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kremlin critic Alexei Navalny has been released from prison after serving a 15-day sentence for handing out leaflets to promote a protest rally.\nThe Russian opposition leader vowed not to \"step back\" as he left detention a week after the killing of another opposition figure, Boris Nemtsov.\nThe 1 March rally for which Navalny was leafleting instead became a mourning march for Mr Nemtsov.\nNavalny says the legal cases against him are politically motivated.\nLast year he and his brother Oleg were found guilty of stealing 30m roubles ($462,000;£300,000) from two companies.\nOleg was given a three-and-a-half-year jail sentence, while Navalny received a suspended sentence that prosecutors say they will appeal against.\nSpeaking to reporters outside a Moscow detention centre, he pledged to continue his work despite the murder of Mr Nemtsov, who was shot dead outside the Kremlin walls in what his allies say was a political killing.\n\"We won't reduce our efforts; we won't step back,\" Navalny said. \"That terrorist act didn't achieve its aim; it didn't frighten anyone.\"\nNavalny was not allowed out of prison to attend the funeral of Mr Nemtsov on Tuesday.", "url": "https://www.bbc.com/news/world-europe-31762173"}