{"authors": ["Mark Savage", "www.facebook.com"], "date_download": "2025-04-26 06:13:30", "date_modify": "2025-04-26 06:13:30", "date_publish": "2025-03-02 04:48:18", "description": "From Jade's problematic dress, to Stormzy's eye injury - here's what really went down at the Brits.", "filename": "news_articles_cqx04vrlqn0o_1745648010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a373/live/0b8bfa90-f71d-11ef-873e-a3c40463214e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqx04vrlqn0o_1745648010.html", "title": "Brit Awards 2025: The real winners and losers", "title_page": "Brit Awards 2025: The real winners and losers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nudity, swearing, petulance, club anthems, more nudity and a woman dressed as a horse - the 2025 Brit Awards had it all.\nCharli XCX was the big winner, taking home five prizes in all - including best artist, best album and song of the year.\nUS star - and the BBC's Sound of 2025 - Chappell Roan picked up two awards; while Ezra Collective, The Last Dinner Party, Fontaines DC and Stormzy got one apiece.\nBut no-one's only interested in all that. Here's what really went down at the 2025 ceremony at London's O2 Arena.\nListen, this was never going to be anything other than Charli's night.\nThe pop star's seventh album, Brat, captured the cultural zeitgeist in a way that few artists ever manage.\nReleased in June, the record combined abrasive dance-floor beats, soaring hooks and meme-friendly artwork; as the 32-year-old assessed her place in the music industry, the real and imaginary rivals she's accumulated along the way, and whether or not to leave it all behind to have a baby.\nIn the star's own words, the album was \"chaos and emotional turmoil set to a club soundtrack\".\nJust as everyone was absorbing that, she hired a bunch of guest stars - Billie Eilish, Ariana Grande, Lorde, Addison Rae, Bon Iver - and re-recorded an entirely new, sometimes superior, version of the album.\nCritics called it \"pop music for the future\" and praised the way its \"painfully relatable\" lyrics captured Charli's coming of age.\nKnowingly trashy, yet surprisingly deep, it was easily the best British album of the last 12 months - and one that proved Charli's detractors wrong.\n\"I feel like dance music, electronic music, gets a really bad rep because everyone is like, 'It's not that deep, is it? And I kind of feel it is,\" she said after collecting her second award.\n\"This genre of music, for me, is euphoric, it allows me to escape, it allows me to feel on such a deep level.\"\nJade Thirlwall was the last of the Little Mix crew to launch a solo career, but she's been giving it her all.\nAs well as winning best pop artist at Saturday's ceremony, she put on one of the night's highest-concept performances - a five-act melodrama about the cruelty of the music industry and her creative rebirth.\nOver the course of the night, she wore six different outfits. But she chose the wrong one for climbing the stairs to pick up her trophy. Thank goodness the Sugababes were there to help.\nJack Whitehall made a welcome return as the ceremony's host, after four years away.\nAs ever, his jokes were close to the bone... including a passing reference to allegations surrounding some presenters on Brits broadcaster ITV.\n\"ITV had so many of its presenters cancelled this year that they had to come crawling back to an ex, and what an honour it is to be hosting again the biggest night in British music,\" he joked.\nLater, he described Youtuber-turned-musician KSI as \"an inspiration\".\n\"Because you listen to Kendrick Lamar and you're like, 'I couldn't do that in a million years'. Then I listen to your song and I'm like, 'Oh, I could do this'.\"\nSpeaking before the show, Whitehall revealed a sneaky secret: He uses a fake script during rehearsals.\n\"Previously I used to do the actual script in rehearsal, and then you'd have an hour of people from record labels and publishers coming and knocking on the dressing room door going, 'You can't say this, you can't say that',\" he told Heart radio.\n\"So now I just do this fake script, which if you heard it, you'd be like, 'This is the lamest script ever', because it's all me just complimenting everyone and going, 'Oh, our next award is the best musician I've ever heard. They're great.'\"\nSabrina Carpenter pretended to pleasure a royal guardsman.\nCharli XCX gave a speech in a see-through top, with no bra.\nOne of Jade Thirlwall's dancers mooned at the camera.\nDanny Dyer uttered one of the English language's most offensive swear words.\nI'd guess that ITV's responses to Ofcom are going to make an interesting read.\nWord of the censor's concerns even filtered through to the arena during the show, much to Charli's annoyance.\n\"I heard that ITV were complaining about my nipples,\" she said from the podium. I feel like we're in the era of free the nipple though, right?\"\nAs fans applauded, the singer grimaced: \"They put the clap track on, cool. Thanks for being on my side.\"\nThe Brits were set up in 1977 to celebrate the British Music Industry, and they are run by the BPI - an organisation funded by, and representing, the biggest record labels in the country.\nBut lots of the winners on Saturday used their speeches to criticise the way they are being treated.\n\"Are we building careers, or are we just chasing moments - because moments fade and careers take time,\" said Myles Smith. \"So please stick with artists past a viral hit.\"\nChappell Roan, who won best international artist, had a similar plea.\n\"I had to write a lot of bad songs to get to the good ones - and artists deserve that freedom, to explore horrible concepts, and to flop, and rise, and not be pressured into making music based off of what's trending.\"\nCharli XCX's multiple victories proved their point. Signed at the age of 14, she had to fight to make the music she wanted - after years of being told her songs were too abrasive and uncommercial.\n\"It feels really nice to be recognised on this album, when I haven't made any sacrifices,\" she said.\n\"I've been doing my own thing in my own corner of the industry - and I guess, this time, culture caught up with us.\"\nMyles Smith has had an incredible 12 months. After giving up his job to pursue music, his feel-good pop anthem Stargazing went viral. So viral that it ended up as the best-selling British song of 2024.\nAsked about the moment he realised it had taken on a life of its own, he told us: \"I got new wi-fi the other day, and they put me on hold... and it was Stargazing.\n\"And that said two things. One: This is like, the most irritating thing. But at the same time, I had made it to hold.\"\n\"Did you sing it for the operator when they picked up?\" we asked.\n\"No, I was passed to seven more people.\"\nSee? Being a pop star doesn't give you any shortcuts in the world of broadband service provider call centres.\nEzra Collective made history by becoming the first jazz band to win the Brit Award for best group - beating previous title-holders like Coldplay, The Cure and Bring Me The Horizon.\nTaking to the stage, frontman Femi Koleoso had a few words to say about cuts to music education, and the lack of funding for youth clubs like Tomorrow's Warriors - where his band got their start.\n\"I'll bang this drum a bunch of times and I'll continue to do so until the entire country gets it\", he said.\n\"This moment right here is because of the great youth clubs, and the great teachers and the great schools that support young people playing music.\n\"The reason we continue to bang this drum is because so many of the problems that face greater society in the UK... we're unsure of how to fix it, but the solution lies with giving a young person a trumpet, the solution lies in giving a young person a saxophone.\n\"Because when you do that, you give them a dream, an aspiration and a goal.\"\nTo prove his point, he invited the London youth group Kinetika Bloco onto the stage of the O2, to blast through Ezra Collective's infectiously upbeat jazz anthem Shaking Body.\nThis year's Brit Award trophies, designed by Gabriel Moses, were cast in bronze... And they were heavy.\nWeighing 1.6kg each, you could break a toe if you dropped one. And Charli had to pick up four of the things for her winner's photo.\nIt took approximately six people to arrange them in her arms (\"don't push them between my boobs\", she squealed at one point) before she was ready for the flashbulbs.\n\"Is this lame?\" she asked at the last moment. \"It feels lame.\"\nThen she dropped them all and fell to the floor in a fit of giggles.", "url": "https://www.bbc.co.uk/news/articles/cqx04vrlqn0o"}