{"authors": ["Dan Hunt", "www.facebook.com"], "date_download": "2025-04-26 03:48:44", "date_modify": "2025-04-26 03:48:44", "date_publish": "2025-03-05 14:27:48", "description": "Plans for the attraction at Honister Slate Mine are approved after being resubmitted.", "filename": "news_articles_c2d40wk8rn4o_1745639324.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bf18/live/ce532ba0-f9c7-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2d40wk8rn4o_1745639324.html", "title": "Revised Lake District zip wire attraction to go ahead", "title_page": "Revised Lake District zip wire attraction to go ahead - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Revised plans for a zip wire spanning more than half a mile (1km) in the Lake District National Park have been approved.\nThe attraction between Honister Crag and the Honister Slate Mine Visitor Centre was approved by the park authority in 2019, but plans were resubmitted due to a landing post being moved.\nHonister Slate Mine is described as the oldest working slate mine in England and is the source of roof slate for both Kensington and Buckingham Palace.\nAmendments to the zip wire plans include changes to the landing point for passengers, removing an intermediate post and updated technology braking systems.\nThe plans were approved unanimously by Lake District National Park Authority (LDNPA) members, the Local Democracy Reporting Service said.\nCommittee members added conditions to the application, which stated the infrastructure should be removed if it is no longer required and that the zipwire could only be used between 08:00 and 18:30.\nLDNPA member Jim Jackson told the committee that \"to allow our businesses to sustain, grow and flourish we need to allow them to continue to evolve their businesses\".\nHe did express concern the proposed attraction would impact on the \"tranquillity\" of the higher fells but said he was \"conscious\" there were other fells to find \"peace and quiet\".\nCommittee member Vicky Hughes believed it would have \"significant impacts on the landscape, visually and audibly\" with it \"impacting ramblers and horse riders\".\nShe added the only reasons she would support it were the fallback position of the previously approved application and how planning experts considered the revised application a \"betterment\".", "url": "https://www.bbc.co.uk/news/articles/c2d40wk8rn4o"}