{"authors": ["Niall Glynn", "www.facebook.com"], "date_download": "2025-04-26 08:04:36", "date_modify": "2025-04-26 08:04:36", "date_publish": "2025-02-26 15:41:40", "description": "Communities Minister Gordon Lyons also addresses the funding for the stalled Casement Park GAA stadium.", "filename": "news_articles_ce8y5l68y6wo_1745654676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5be3/live/91bd7c90-f445-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8y5l68y6wo_1745654676.html", "title": "IFA Galgorm centre: Too soon to say on public money, says Lyons", "title_page": "IFA Galgorm centre: Too soon to say on public money, says Lyons - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It is too early to say whether any public money will be committed to the new football National Training Centre in County Antrim, the communities minister has said.\nThe Irish Football Association's (IFA's) \"state-of-the-art\" centre will be located next to the Galgorm Resort, just outside Ballymena.\nThe IFA said the facility - which is expected to open in 2028 - will \"feature world-class pitches and cutting edge training facilities\".\nSpeaking to BBC News NI at the site, Communities Minister Gordon Lyons said the project was in the \"very early stages\".\nLyons said a business case would have to go through the \"proper processes\" before a decision is made.\n\"There'll be a lot of work to do on that first, but overall we have the Northern Ireland football fund, it is part of that, but it is far too early to talk about sums of money at this stage.\"\nHe added that after the business case is considered, the IFA will submit further plans that will need consideration.\nAnalysis by Mark Simpson, BBC News NI\nQuestions about how the cost of the new football centre will be met were politely kicked away by all involved in the project.\nAnd when Communities Minister Gordon Lyons was put on the spot, he swerved the issue of whether public money would be available.\nThe involvement of a private enterprise, Galgorm Resort, complicates the issue but the IFA believe it is still entitled to Stormont cash.\nIn terms of the overall cost of the new 50-acre football centre, figures between £8m and £10m have been floated in sporting circles but the Irish FA insist no figure can be estimated.\nUltimately, it depends on how ambitious the IFA wants to be regarding the facilities it builds.\nIn spite of the unanswered questions, there is an air of quiet confidence around the project and that the first ball will be kicked at the new centre before the summer of 2028.\nLyons was also asked about funding for the stalled Casement Park GAA stadium.\nLast September, the British government said it would not be providing funding to redevelop the stadium in time for the Euro 2028 football tournament, adding that there was a \"significant risk\" it would not be built in time.\nThe government estimates the potential cost will be more than £400m, although there are suggestions it could be closer to £450m in order to meet the specification required by UEFA.\nTo date, only a fraction of that money is available, a long-standing commitment of £62.5m from the Stormont executive, £15m from the GAA, and approximately £43m from the Irish government.", "url": "https://www.bbc.co.uk/news/articles/ce8y5l68y6wo"}