{"authors": ["Jennifer McKiernan", "www.facebook.com"], "date_download": "2025-04-26 04:28:00", "date_modify": "2025-04-26 04:28:00", "date_publish": "2025-03-02 10:50:09", "description": "Sir Keir Starmer also says he believes the US president wants peace, despite last week's Oval Office row with Ukraine's leader.", "filename": "news_articles_c70wnjvj1x0o_1745641680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4f33/live/ba847b50-f77a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70wnjvj1x0o_1745641680.html", "title": "UK and France to work on Ukraine peace plan, Starmer says", "title_page": "UK and France to work on Ukraine peace plan, Starmer says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prime Minister Sir Keir Starmer has said the UK and France will work with Ukraine \"on a plan to stop the fighting\" with Russia - and will then \"discuss that plan with the United States\".\nUkrainian President Volodymyr Zelensky is attending a summit of European leaders, two days after a fiery exchange with US President Donald Trump in the White House.\nSir Keir told BBC One's Sunday with Laura Kuenssberg that his \"driving purpose\" right now was to act as a \"bridge\" between the two men.\nAsked about how he felt watching the spat in the White House, Sir Keir sought to play down the incident, saying \"nobody wants to see that\" and admitted he felt \"uncomfortable\".\nThe PM's response was to pick up the phone to his counterparts Trump and Zelensky that same night, in an effort to \"get us back to the central focus\", he said.\n\"There are a number of different routes people can go down. One is to ramp up the rhetoric as to how outraged we all are or not.\"\nHe said the other option was to \"roll up my sleeves\" and quickly phone both men - and then also to speak to French President Emmanuel Macron about the role that the leading nations of Europe would play.\n\"Because my reaction was we have to bridge this, we have to find a way that we can all work together because in the end we've had three years of bloody conflict now, we need to get to that lasting peace\".\nHe also dismissed calls by SNP first minister John Swinney to cancel the invite for a second state visit to the UK by Trump.\nSir Keir said: \"I'm not going to be diverted by the SNP or others trying to ramp up the rhetoric without really appreciating what is the single most important thing at stake here - we're talking about peace in Europe.\"\nThe prime minister received support from Liberal Democrat leader Sir Ed Davey, who said the state visit should be used to secure guarantees for Ukraine.\nHe said: \"I think we should use every single card that we have, and I think it should be made clear to the White House that the state visit would be a genuine one, we would welcome him here, but on condition that he steps up – that the US steps up to work with the UK and Europe to support and defend Ukraine.\"\nIn his interview, Sir Keir was careful to avoid laying any blame for the row and insisted he was \"clear in my mind\" that Trump \"wants a lasting peace\", answering \"yes\" when asked directly if he believed Trump could be trusted.\nZelensky could also be trusted, he added, but not Russian President Vladimir Putin - which is the reason the US needs to provide a security guarantee for any peace deal.\nThe prime minister acknowledged that a European security guarantee would have to be led by a \"coalition of the willing\".\nSir Keir said that \"Europeans have stood up in the last three years\" but that \"generally Europe needs to do more in its own defence and security\".\nConservative leader Kemi Badenoch, also speaking on the Kuenssberg show, gave her backing to the PM over Ukraine, but said it was important to keep the US engaged.\n\"We need to make sure that America does not disengage, it is in their interest for peace now, if we all get dragged into an escalation, America will get dragged into it eventually,\" she told the BBC.\nBadenoch also repeated her call for the UK to raise defence spending further, saying it should reach 3% of national income by the end of this Parliament.\nEarlier this week, the PM announced he would cut the foreign aid budget to raise defence funding from 2.3% to 2.5% of national income by 2027, which led to the resignation of his International Development Minister Anneliese Dodds.\nThe move came after Trump had called on Nato allies to increase defence spending to 5% of their respective national incomes.\nFrance spends 2.1% on defence and has pledged to double this by 2030.\nSir Keir urged all European nations to review their defence budgets, saying: \"We've got to increase capability and we've got to co-ordinate more because in the Ukraine conflict we've seen that the co-ordination isn't there.\"\nAsked to explain what a European \"coalition of the willing\" was, he said: \"We need to be clear what a European security guarantee [in Ukraine] would look like.\n\"We've got to find those countries in Europe that are prepared to be a bit more forward-leaning.\"\nHe said the UK and France were leading the thinking on it, but added: \"The more the better in this.\"\nItalian Prime Minister Giorgia Meloni was welcomed to Downing Street by the PM shortly before the summit, which Sir Keir said they were approaching \"with a very similar mindset\".\nMeloni spoke to reporters in Downing Street, saying: \"We are all very committed about a goal that we all want to achieve, which is a just and lasting peace in Ukraine.\n\"I think it is very, very important that we avoid the risk that the West divides and I think on this UK and Italy can play an important role in bridge-building.\"", "url": "https://www.bbc.co.uk/news/articles/c70wnjvj1x0o"}