{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:53", "date_modify": "2025-05-19 15:22:53", "date_publish": "2015-03-03 16:59:17", "description": "Jim Murphy says a Scottish Labour government would keep free university tuition for Scottish students as the SNP accuse him of \"hypocrisy\".", "filename": "news_uk-scotland-scotland-politics-31708838_1747668173.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81376000/jpg/_81376807_jim_murphy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-politics-31708838_1747668173.html", "title": "Scottish Labour 'will keep free university tuition'", "title_page": "Scottish Labour 'will keep free university tuition' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A Scottish Labour government would keep free university tuition for Scottish students, Jim Murphy has said.\nHe also said the party would set up funding to \"properly support\" Scottish universities alongside Labour's plan to reduce tuition fees in England.\nHowever, the SNP has accused Mr Murphy of \"shameless hypocrisy.\"\nThe party said that both he and Labour \"cannot be trusted\" on tuition fees as they were the party that introduced them in the first place.\nThe Scottish Labour leader was speaking to students in Glasgow.\nHe said: \"I want young Scots to be able to train to be doctors, teachers, lawyers, engineers, scientists and much more no matter their background or how much money their parents have.\n\"That was why Donald Dewar abolished tuition fees in the first place.\"\nHe also announced that a Labour government at Holyrood would set up a funding package to offset any negative consequences of Labour's policy to reduce tuition fees in England.\nGordon Maloney, president of NUS Scotland, said: \"Today's welcome announcement marks a broad consensus against fees for Scottish students, and against charging in Scottish higher education, which should settle the debate once and for all.\"\nHe added: \"Many students still have bitter memories of the betrayal on fees at Westminster and it's vital that commitments such as today's are kept to, if not exceeded.\n\"We must see all parties back up their words with action. We'll continue campaigning, ahead of the Holyrood elections, to ensure all prospective MSPs, and parties, are fully committed to free education and to ending student poverty in Scotland.\"", "url": "https://www.bbc.com/news/uk-scotland-scotland-politics-31708838"}