{"authors": ["Neve Gordon-Farleigh", "Chris Goreham", "www.facebook.com"], "date_download": "2025-04-26 03:55:42", "date_modify": "2025-04-26 03:55:42", "date_publish": "2025-03-04 15:50:39", "description": "Keeping them open would have saved the council £40,000 a year - but vandalism has increased.", "filename": "news_articles_c4g98xnk52vo_1745639742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e7f2/live/a19f9720-f908-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g98xnk52vo_1745639742.html", "title": "Council-run Norwich parks and cemeteries to be locked at night", "title_page": "Council-run Norwich parks and cemeteries to be locked at night - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The gates of council-run parks and cemeteries in a city will be locked again at night after a spate of vandalism - and despite calls to reverse the decision.\nIn October, Norwich City Council decided that the gates of nine public areas would stay open at night in a bid to save the council about £40,000 each year.\nBut in recent days the authority has had to review its decision following reports of drug use and vandalism.\nA council spokesperson said: \"The subsequent knock-on effect of anti-social behaviour means we have reviewed our original thinking.\"\nWaterloo Park is home to The Feed, a social enterprise cafe where staff reported \"an increase in the activity compared to this time last year, when the gates were being locked.\"\nGrace Stewart, who has worked there for three years, said she worried that if the gates had been kept unlocked during the summer months, the amount of vandalism would have been \"exponentially higher\".\n\"People will have seen on our social media we've had thousands of pounds worth of benches damaged, all sorts, people try to break in, people get on the roofs, damage our bins out the back all sorts,\" she said.\n\"As a charity it is really detrimental to what we are trying to do and I [believe] that over the summer months that it would have been a free for all.\"", "url": "https://www.bbc.co.uk/news/articles/c4g98xnk52vo"}