{"authors": ["Antonia Matthews", "www.facebook.com"], "date_download": "2025-04-26 04:12:55", "date_modify": "2025-04-26 04:12:55", "date_publish": "2025-03-04 12:11:34", "description": "Megan Wyn from Anglesey will support Alanis Morissette at her Cardiff gig in July.", "filename": "news_articles_cx2x0x5kvm1o_1745640775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b5ab/live/2d7b19e0-f8eb-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2x0x5kvm1o_1745640775.html", "title": "Alanis Morissette: Megan Wyn on 'unbelievable' support role", "title_page": "Alanis Morissette: Megan Wyn on 'unbelievable' support role - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 20-year-old singer from Anglesey described how her mum cried when she told her she will support superstar Alanis Morissette.\nThe Grammy award-winning Canadian will perform in the Welsh capital on 2 July, and demand for tickets has been so high organisers have had to move the gig to a bigger venue.\nMegan Wyn said she is still in shock at being asked to perform as a special guest at Blackweir fields.\nThe indie-pop artist has listened to Morissette her entire life, adding her mum was a big fan and would play her songs in the house.\nMorissette, now 50, had huge international success when her album Jagged Little Pill was released in 1995.\nSongs such as Ironic, Hand In My Pocket and Head Over Feet helped her sell millions of copies worldwide.\n\"It's unbelievable, I can't believe it,\" Wyn told BBC Radio Wales Breakfast.\n\"It's nuts. I never thought I'd get to support her.\"\nThe singer said she and her live band would have to treat the concert like \"any other gig\".\n\"Once I start thinking about it as something completely different, I think that's when things go wrong,\" she laughed.\n\"We're just going to put on the best show we can.\"", "url": "https://www.bbc.co.uk/news/articles/cx2x0x5kvm1o"}