{"authors": ["Robin Levinson King", "www.facebook.com"], "date_download": "2025-04-26 04:10:43", "date_modify": "2025-04-26 04:10:43", "date_publish": "2025-03-04 19:54:15", "description": "Ford announced retaliatory plans shortly after Trump implemented tariffs against Canada.", "filename": "news_articles_c3d81pdmnm8o_1745640643.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7f34/live/15166f70-f94b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d81pdmnm8o_1745640643.html", "title": "Ontario's Doug Ford says he could cut electricity to US over tariffs", "title_page": "Ontario's Doug Ford says he could cut electricity to US over tariffs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ontario Premier Doug Ford says he's willing to cut off power supply to the US if President Donald Trump continues with tariffs against Canada.\nFord announced his retaliatory plans shortly after Trump implemented a 25% tariff against Canadian imported goods and a 10% tariff on Canadian energy.\nHe said he would implement his own 25% surcharge on Canadian electricity exports to three US states: Michigan, New York and Minnesota.\nIf the US tariffs are escalated, he said, he would consider completely cutting those states off from Canadian power.\nAbout 1.5m Americans in those states get their electricity from Canada.\nFord's response comes after Prime Minister Justin Trudeau announced his own retaliatory measures – including an immediate 25% tariff on C$30bn ($20.7, £16.2) of goods from the US.\nAs the leader of Ontario, Canada's most populous province and largest economy, Ford is able to wield his own carrot and stick.\nHe banned US companies from bidding on Ontario infrastructure projects, and he cancelled a $100m deal with Elon Musk's Starlink internet provider.\nHe also said he's reached out to lawmakers in those three US states to urge them to put pressure on Trump to back off tariffs against Canada - or risk leaving their own constituents in the dark.\nHe also urged premiers in other Canadian provinces to follow suit.\nBut the timing of Ford's promised tariffs is not clear.\nFord told media he would implement the tariff on electricity if Trump's tariffs \"persist\".\nHe said he is looking for ways to avoid passing new legislation, which could take weeks.\n\"We need to act immediately,\" he said.\n\"If they go further into April, then we'll cut off their electricity,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c3d81pdmnm8o"}