{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:55", "date_modify": "2025-05-19 15:34:55", "date_publish": "2015-01-29 19:49:01", "description": "A school for children with speech, language and communication difficulties is put into special measures.", "filename": "news_uk-england-sussex-31040709_1747668895.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80660000/jpg/_80660224_school.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-sussex-31040709_1747668895.html", "title": "Bexhill school for pupils with disabilities in special measures", "title_page": "Bexhill school for pupils with disabilities in special measures - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A school for children with speech, language and communication difficulties has been put into special measures.\nOfsted inspectors rated St Mary's School and Sixth Form College, in Bexhill, East Sussex, as inadequate in all six categories, external, including safeguarding, teaching and leadership.\nThe school's previous inspection in May 2012 was rated as good.\nIn a statement, the school said the findings were of no surprise and it was \"already addressing the issues\".\nFormer principal David Cassar, who retired in 2009 when the school was rated as outstanding, said he was \"shocked and very saddened\" to learn of the recent Ofsted report.\n\"The staff at St Mary's were magnificent people, very professional and enormously knowledgeable about the students we had in our care.\n\"My understanding is that the majority of these people have now gone... no organisation can succeed when so much expertise is lost.\n\"Questions have to be asked why it is such dedicated staff have left St Mary's in such huge numbers,\" he said.\nInspectors who visited the school in November said \"a sizeable proportion of parents\" had concerns and good teaching and learning across the school had not been secured.\nThey said procedures to keep pupils safe and secure were not properly followed, the curriculum had not been planned and monitored systematically enough, and sixth form students were not able to reach their potential.\nToo many pupils were making \"poor progress\" and teaching was inadequate \"because teachers do not plan work effectively enough\", the report said.\nHowever, the inspectors said pupils had positive attitudes and were well behaved, and their achievement in science, art and drama was good.\nSt Mary's School said it had already taken action to implement Ofsted's recommendations and to ensure that all the areas highlighted for action would be dealt with as soon as possible.\n\"Safeguarding issues have already been addressed, and we will now expand the series of improvements that were already under way across the rest of the school,\" it said.", "url": "https://www.bbc.com/news/uk-england-sussex-31040709"}