{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 07:03:54", "date_modify": "2025-04-26 07:03:54", "date_publish": "2025-02-28 07:39:15", "description": "The improved trading figures for 2024 mark a turnaround in the fortunes of the company.", "filename": "news_articles_cvgwwvkzjv8o_1745651034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b7ab/live/2614f570-f519-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwwvkzjv8o_1745651034.html", "title": "Rolls-Royce announces £1.5bn shareholder payout", "title_page": "Rolls-Royce announces £1.5bn shareholder payout - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rolls-Royce is to pay out £1.5bn to shareholders and has announced dividends will return after a rise in profits.\nThe company, which is based in Derby and manufactures items ranging from jet aircraft engines to propulsion systems for sea vessels, generated an operating profit of £2.5bn in 2024, according to its full-year results.\nIts operating profit had risen by 55% on the year before, after sales rose by £2.4bn.\nThe firm gifted 150 shares to each of its workers, worth about £700, in August and will pay a dividend of 6p per share following its results.\nThe latest figures mark a turnaround in the fortunes of Rolls-Royce, which was forced to announce 9,000 job cuts and raise billions in emergency funding after it was hit by a fall in air travel during the Covid-19 pandemic.\nIt appointed former executive at BP, Tufan Erginbilgic, as CEO early in 2023, who initially described the company as a \"burning platform\" and said its current performance was \"unsustainable\".\nThe engineering giant then underwent a revival over the next 18 months and announced a gift of 150 shares to its 42,000 workers worldwide in August 2024 after a rise of £1.1bn in profits over the first half of the year.\nMr Erginbilgic said: \"Strong 2024 results build on our progress last year, as we transform Rolls-Royce into a high-performing, competitive, resilient, and growing business.", "url": "https://www.bbc.co.uk/news/articles/cvgwwvkzjv8o"}