{"authors": ["Koh Ewe", "www.facebook.com"], "date_download": "2025-04-26 06:38:12", "date_modify": "2025-04-26 06:38:12", "date_publish": "2025-02-26 06:21:07", "description": "The noodle dish, provided only to mourners, has gone viral on Chinese social media.", "filename": "news_articles_cjry8zz8yego_1745649492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d7d1/live/3bf4b3b0-f3fe-11ef-a273-25bad1bc544c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjry8zz8yego_1745649492.html", "title": "Chinese foodies pose as mourners to try funeral home's noodles", "title_page": "Guizhou: Chinese foodies pose as mourners to try funeral home's noodles - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Foodies in China have been reportedly flocking to an unlikely destination - a funeral home - after a noodle dish served at its canteen went viral on social media.\nThe dish is found at the Erlong Funeral Home in the southwestern province of Guizhou.\nThe canteen caters to the funeral home's customers, but as word began to spread about its noodles, hordes of diners - some posing as mourners - began showing up to try the food.\nErlong has since announced it will allow some members of the public to eat at its premises, as long as they do not disturb genuine mourners.\nThe funeral home offers various types of noodle dishes during breakfast and supper hours, which cost 10 yuan per bowl ($1.38; £1.09).\nThe most popular type is reportedly the noodles topped with minced pork and peanuts.\nOne Erlong worker told Jiupai News that they \"only served customers who come to the funeral home to handle matters\".\nBut other people have been sneaking in to get a bowl of noodles, the worker said, adding that sometimes queues at Erlong are so long that diners sometimes have to wait a couple of hours to get their food.\n\"There have been people pretending to be relatives of the deceased, it's hard to tell them apart when it gets crowded, and it's hard to manage,\" he said.\nTo meet the demand, the funeral home has since decided to offer 50 bowls of noodles to members of the public every day - for free - as long as \"they do not affect people's mourning\", according to Erlong's chef in an interview with local media.\nWhile the noodle dish was already popular among locals, the craze appeared to have ramped up earlier this month when a social media user posted about the dish while visiting a friend in Guizhou, which is known for its spicy and sour dishes.\n\"My friend says the food at this funeral home is so good,\" they wrote earlier this month on Xiaohongshu, also known as RedNote. \"The queue for food is longer than the queue to lay flowers for the deceased.\"\n\"I didn't get to eat the noodles, because my friend's mum didn't know anyone who was holding a funeral service.\"\nSince then, many Chinese social media users have also shared their experiences eating the noodles.\nOn Douyin, the Chinese version of TikTok, one user shared a photo of the dining hall's tickets, with what appeared to be a crowd queuing up for food.\n\"I heard the noodles here were very good,\" they wrote. \"I thought about how short life was, and got another bowl.\"", "url": "https://www.bbc.co.uk/news/articles/cjry8zz8yego"}