{"authors": ["Julia Armstrong", "www.facebook.com"], "date_download": "2025-04-26 06:45:51", "date_modify": "2025-04-26 06:45:51", "date_publish": "2025-03-01 14:31:33", "description": "The teenagers appealed to councillors for a zebra crossing outside their school to increase safety.", "filename": "news_articles_clyjqzljxp9o_1745649951.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9378/live/67253370-f6a6-11ef-b898-07ecc7bad187.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyjqzljxp9o_1745649951.html", "title": "Stannington students take safety campaign to Sheffield council", "title_page": "Stannington students take safety campaign to Sheffield council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pupils have asked councillors for a zebra crossing outside their school to increase road safety.\nA group of sixth form students at Forge Valley School in Sheffield surveyed their peers and found 86% were concerned there was no safe crossing outside the school.\nStudent Chuck said he had bad experiences of road safety outside the school.\nHe told councillors: \"Many of us have had dangerous experiences of walking or travelling to school.\"\nThe teenagers presented their survey of 890 students to a meeting of Sheffield City Council north local area committee and called for a zebra crossing, pavement barriers, or for a school crossing patrol.\nAccording to the Local Democracy Reporting Service, the students' survey found 68% walked to school - the most popular method of transport.\nStudent Anne told the meeting: \"I joined this group because I wanted to make a positive change for our school and the wider community.\n\"Lots of us have experienced maybe not the best safety as we're walking to school or cycling to school.\"\nAnother student, Grace, said: \"We believe that students should just be able to walk home safely from school and not be scared of being hit by any cars or put in any danger.\"\nCouncillor Will Sapwell, who represents Stannington ward, which the school is based in, offered to help the students create a petition to present to the council.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/clyjqzljxp9o"}