{"authors": ["Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:33:06", "date_modify": "2025-04-26 07:33:06", "date_publish": "2025-02-27 16:29:34", "description": "Michelle O'Neill said \"everybody has a \"right to remember their dead\" when asked about tributes to a former IRA man.", "filename": "news_articles_c5y00pyj625o_1745652786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2ec0/live/c0f6c0d0-f520-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y00pyj625o_1745652786.html", "title": "Sinn Féin defends tributes to IRA man", "title_page": "'Bik' McFarlane: Sinn Féin defends tributes to IRA man - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "First Minister Michelle O'Neill has said \"everybody has a right to remember their dead\" in response to questions over Sinn Féin tributes to a former senior IRA man.\nBrendan 'Bik' McFarlane, who died at the weekend, was jailed in 1976 for his part in a gun and bomb attack on Bayardo Bar in Belfast in which five people were killed.\nSinn Féin leader Mary Lou McDonald described him as a \"great patriot\" who had a \"life well lived\", and several senior party figures attended his funeral in Belfast.\nThe Democratic Unionist Party (DUP) said the tributes from the Irish republican party were \"disgraceful\" and did not acknowledge McFarlane's victims during the Troubles in Northern Ireland.\nDeputy First Minister Emma Little-Pengelly, a DUP assembly member, said that McFarlane was \"no hero\".\nThe first and deputy first ministers were speaking to reporters at Stormont on Thursday as they announced the executive had agreed a programme for government.\nO'Neill, the deputy leader of Sinn Féin, was asked if she could understand the \"anger\" of some victims over her party's tributes to McFarlane.\nThe first minister said she was \"not going to tread on anybody's grief\".\n\"I think it's important that we all maintain that everybody has a right to respect their dead, to remember their dead,\" she added.\nO'Neill said she was \"very conscious of the fact that only in the last few days, a family have laid their father to rest\".\n\"I'm also very conscious that over the course of conflict, many people have lost loved ones, and I think we need to be respectful of that - find ways to try to heal.\n\"But everybody has a right to remember their dead - that includes republicans.\"\nLittle-Pengelly said that \"any person that sets out to kill and take an innocent life is no hero\".\nShe said it was important to remember those \"who lost their loved ones to that unnecessary violence of the past\".\n\"And I think it's absolutely wrong that we would glorify any of those activities.\"\nThe deputy first minister said most people would be \"rightly horrified when they see such a person being referred to as a hero\".\n\"So I want to take the opportunity to remember the victims, the innocent victims of that person, and the grief and the mourning that those families have had to endure for many decades.\"", "url": "https://www.bbc.co.uk/news/articles/c5y00pyj625o"}