{"authors": ["Faarea Masud", "www.facebook.com"], "date_download": "2025-04-26 04:13:23", "date_modify": "2025-04-26 04:13:23", "date_publish": "2025-03-04 11:41:42", "description": "The investment firm will now be called aberdeen group as it hopes the name change will remove \"distractions\".", "filename": "news_articles_cz9nkeg79gyo_1745640803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/19be/live/da7b08f0-f8da-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9nkeg79gyo_1745640803.html", "title": "Abrdn adds back vowels after widely mocked rebrand", "title_page": "Abrdn adds back vowels after widely mocked rebrand - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Investment firm Abrdn will add the vowels back into its name after dropping them in a rebrand that was widely mocked.\nThe firm said it will now be called aberdeen group, with no capital letter at the start. In the past it has been Aberdeen Standard Life and Aberdeen Asset Management.\nIts rebrand to Abrdn in 2021 was largely derided, with some saying it seemed like a typo, and others joking the firm had \"irritable vowel syndrome\". The company said the mockery amounted to \"corporate bullying\".\nChief executive Jason Windsor said the latest name change would remove \"distractions\".\n\"This is a pragmatic decision marking a new phase for the organisation,\" said chief executive Jason Windsor, as he revealed a strategy revamp.\nHowever, some people commented that while the company had found its vowels, it still hadn't found its capital letters.\nThe firm has faced a barrage of mockery over the last four years since rebranding to Abrdn under previous boss Stephen Bird.\nIt attracted reaction on social media, external with one user posting a mock-up of word game Countdown. The letters ABRDN are shown on the letter board behind presenter Rachel Riley, with the words \"another consonant please Rachel...\"\nA new version of the image was posted on Tuesday with one user joking, external that reinstating the vowels was responsible for the firm's share price rising.\nRebrands for big firms have in the past proven tricky to navigate. Royal Mail, for example, caused a public outcry after it suggested a name change to \"Consignia\" in 2002.\nA few years ago, Volkswagen was greeted with derision after an April Fool's joke misfired. The German car giant was forced to deny that it was changing its name to \"Voltswagen\" in the US, despite having said in a press release that it would.", "url": "https://www.bbc.co.uk/news/articles/cz9nkeg79gyo"}