{"authors": ["Paul Glynn and Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 07:33:43", "date_modify": "2025-04-26 07:33:43", "date_publish": "2025-02-27 15:55:29", "description": "The show paid tribute to the \"great\" quizzer, who also won Mastermind and Brain of Britain.", "filename": "news_articles_cx2009jgj58o_1745652823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3e39/live/f9eaca40-f51f-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2009jgj58o_1745652823.html", "title": "Eggheads star quizzer Chris Hughes dies aged 77", "title_page": "Eggheads star quizzer Chris Hughes dies aged 77 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Quizzer Chris Hughes, star of the popular BBC and Channel 5 series Eggheads, has died aged 77, a statement on the programme's social media accounts has said.\nHughes was one of several general knowledge experts who regularly appeared on the show, which saw members of the public take on the five so-called \"Eggheads\".\nA statement posted on the show's Facebook and X accounts on Thursday, reported by the Press Association news agency, paid tribute to an \"Eggheads great\".\n\"It is with immense sadness that we announce the passing of Eggheads great Chris Hughes,\" it read.\nHughes was born in Middlesex and attended Enfield Grammar School.\nBefore becoming known as one of the country's leading quizzers, he worked as a train driver and railway worker.\nHe went on to become a regular contributor on Eggheads - which began on BBC Two in 2003 before moving to Channel 5 in 2020.\nThe Eggheads panel was made up of general knowledge experts, including winners from others shows such as Mastermind, The Weakest Link and Who Wants To Be A Millionaire?.\nIn each episode, five Eggheads would compete with a team made up of five members of the public, who would play individually against a single Egghead in each round, before a final face-off between the remaining players of both sides.\nIf the amateurs were successful, they would take home a cash prize. The jackpot would increase by £1,000 per episode, with each edition's prize money rolling into the next day if the Eggheads won.\nAs a result of the Eggheads high level of expertise, many of the jackpots would reach a sizeable sum before finally being won. The highest ever jackpot reached £75,000, which was won by a team in 2007.\nThe series was presented by news presenter Dermot Murnaghan, before Radio 2 DJ and Channel 5 talk show host Jeremy Vine took over the role.\nHughes is one of only seven people to have won both Brain of Britain and Mastermind, and also scored a victory on International Mastermind.\nEggheads producer Robert Dean said on X:, external \"[Hughes] was an amazing Egghead who considered everyone on the production team part of his family.\n\"I have such fond memories of him and count myself lucky to have known him. I'll miss him tremendously.\"\nAfter having reached the final three of another hit quiz show, The Weakest Link, without getting a single question wrong, host Anne Robinson declared Hughes to be \"the best contestant we have had on the Weakest Link\" and chose not to use her mean spirited signature catchphrase: \"you are the Weakest Link, goodbye!\".", "url": "https://www.bbc.co.uk/news/articles/cx2009jgj58o"}