{"authors": ["David Mercer", "www.facebook.com"], "date_download": "2025-04-26 04:28:59", "date_modify": "2025-04-26 04:28:59", "date_publish": "2025-03-02 08:29:02", "description": "They held up pro-Ukraine signs on the route that the vice-president and his family were expected to take to go skiing.", "filename": "news_articles_cdxqnxw6z73o_1745641739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a8d/live/94d9b370-f734-11ef-bc27-75fa4a0e95b5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxqnxw6z73o_1745641739.html", "title": "Protesters target JD Vance in Vermont after clash with Zelensky", "title_page": "Protesters target JD Vance in Vermont after clash with Zelensky - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Protesters in the US have lined a road in Vermont that Vice-President JD Vance was due to drive down following his and President Trump's angry exchange with Volodymyr Zelensky at the White House.\nThey held up pro-Ukraine signs on the route in Waitsfield that Vance and his family were expected to take on their way to go skiing.\nUS media reported the family moved to an undisclosed location from their planned ski resort because of the demonstrations.\nHundreds of people also gathered in New York, Los Angeles and Boston on Saturday to express their support for Ukraine - a day after the furious row in the Oval Office.\nThe extraordinary scenes in the Oval Office saw Vance accuse the Ukrainian president of being disrespectful to the US.\nTrump also clashed with Zelensky, telling him to make a deal with Russia \"or we are out\" and accusing him of \"gambling with World War Three\".\nA protest in Waitsfield against the Trump-Vance administration had been organised earlier in the week - before the US president and vice-president's clash with Zelensky - but many signs referenced the row and Russia's war with Ukraine.\n\"I think [Friday's] performance at the White House has probably galvanised even more people to come out today,\" Judy Daly, from Indivisible Mad River Valley, the group which organised the protest, told Vermont Public Radio.\n\"[Vance] crossed the line,\" protester Cori Giroux added.\nAhead of the Vance family's trip, Vermont's governor Phil Scott had urged people to \"be respectful\" to them.\nScott, the Republican governor who refused to vote for Trump, said: \"I welcome the vice-president and his family to Vermont and hope they enjoy their weekend here.\n\"It's no surprise they chose Vermont, we've had a lot of snow this winter, which has been good for our economy.\"\nHe added: \"I hope Vermonters remember the vice-president is here on a family trip with his young children and, while we may not always agree, we should be respectful.\n\"Please join me in welcoming them to Vermont, and hoping they have an opportunity to experience what makes our state, and Vermonters, so special.\"\nVance, who has three young children with his wife Usha, has not publicly commented on the protests. Counter-protesters supporting Trump and Vance were also reportedly in Waitsfield.", "url": "https://www.bbc.co.uk/news/articles/cdxqnxw6z73o"}