{"authors": ["Jon Wright", "www.facebook.com"], "date_download": "2025-04-26 06:20:08", "date_modify": "2025-04-26 06:20:08", "date_publish": "2025-03-01 06:36:07", "description": "Project40Seven won a Make a Difference Award last year and nominations are open for 2025.", "filename": "news_articles_cqlydpgw73xo_1745648408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c09f/live/580f4ae0-f446-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqlydpgw73xo_1745648408.html", "title": "Leiston social supermarket tackling stigma and food costs", "title_page": " Leiston social supermarket tackling stigma and food costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wednesday's at Project40Seven in Leiston start with a delivery of food.\nCrates of supermarket surplus come through the door from FairShare, which are swiftly sorted and added to the shelves of the pantry.\nWhile items are unpacked, people arrive ready to shop at the social supermarket - chatting and having a hot drink while they wait.\nThis, in essence, is why the project won the BBC Radio Suffolk Make a Difference Community Award last year.\nCo-director Toby Lindsay-White says: \"Sometimes you can feel there is a certain stigma in using services that are available in many of our communities.\n\"People don't necessarily fit boxes prescribed by other organisations or councils or such like. So, when it comes to using our social supermarket, there is no means testing, we have equal access for anyone that comes in.\n\"It's more of an exclusive shopping club.\"\nBased on Leiston High Street, the project opened its doors in July 2023 as a community interest company. The ethos is to add services and adapt to meet changing needs.\nThere is a school uniform exchange, a café, a library of 'things' to borrow and a community allotment - which grew 6,800 meals-worth of fruit and veg in its first year.\nIt is also starting a digital inclusion project.\nRita Wilcock started coming to Project40Seven after she moved to Leiston last year.\n\"It makes a huge difference,\" she says.\n\"I feel welcomed and relaxed. I have a medical condition which people here know about, so I feel safe... and that's a big thing.\"\nThe pantry works by shoppers buying either a £2.50 or £4 shop, in which they are able to select a specified number of items from different colour-coded shelves.\nThat could be the equivalent of between £15-£20 worth of goods.\nMelvyn Moyes started coming to use the pantry six weeks ago and says: \"It's helped me a lot.\n\"My wife and I are both 77. Prices in the shops are going up, and someone said 'why not go down there?'\n\"Everyone feels welcome, doesn't matter who you are or what you do.\"", "url": "https://www.bbc.co.uk/news/articles/cqlydpgw73xo"}