{"authors": ["Alex Moss", "www.facebook.com"], "date_download": "2025-04-26 06:40:03", "date_modify": "2025-04-26 06:40:03", "date_publish": "2025-03-02 14:59:27", "description": "Work will see upgrades to the towpath along the Leeds-Liverpool Canal between Kildwick and Silsden.", "filename": "news_articles_c981pl1wxe9o_1745649603.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ab2b/live/1d5695b0-f776-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981pl1wxe9o_1745649603.html", "title": "Work to start on Leeds-Liverpool canal towpath 'missing link'", "title_page": "Work to start on Leeds-Liverpool canal towpath 'missing link' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work to resurface and improve part of a Yorkshire canal towpath is due to start on Monday.\nThe two-mile stretch between Kildwick in North Yorkshire and Silsden in West Yorkshire has been described as the \"missing link\" in the Leeds to Liverpool route.\nImprovements costing about £1.8m will include better access for people with mobility difficulties and pushchairs, as well as the addition of new signs and widening of the path itself.\nThe Canal and River Trust said the work was expected to take until the end of June and make the area more \"welcoming and attractive\".\nThe project will be carried out in a partnership between Bradford Council, North Yorkshire Council and the West Yorkshire Combined Authority.\nThe towpath, located on the edge of the Yorkshire Dales, offered some of the most uplifting open countryside anywhere on England's canal network, the trust said.\nOther improvements will include retaining grass verges, native plants and trees to support wildlife habitats as well as removing unnecessary barriers.\nA spokesperson said: \"With research showing that time spent by water can help people feel happier and healthier, and with more people looking for a local escape on their doorstep, these works will make it easier and more appealing for people to get out and explore the local canals and other routes on their doorstep.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c981pl1wxe9o"}