{"authors": ["Danny Fullbrook", "www.facebook.com"], "date_download": "2025-04-26 07:43:01", "date_modify": "2025-04-26 07:43:01", "date_publish": "2025-02-26 18:40:12", "description": "\"I'm lucky to have the skill set to make a difference,\" she says.", "filename": "news_articles_c70ekdrl9reo_1745653381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a40f/live/999c0b00-f456-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70ekdrl9reo_1745653381.html", "title": "Hertfordshire University awards fellowship to nurse Rebecca Platt", "title_page": "Hertfordshire University awards fellowship to nurse Rebecca Platt - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A nurse who had visited conflict and disease outbreak zones around the world said she was \"thrilled to bits\" after being awarded a fellowship by her former university.\nRebecca Platt, who has previously received a British Empire Medal (BEM), collected her prize during the University of Hertfordshire's graduation ceremony at St Albans Abbey.\nShe said: \"I'm greatly honoured to receive this phenomenal award. As a nurse, I feel privileged to be there in the moments that change people's lives.\n\"Being awarded this fellowship is the pinnacle of a hugely rewarding career.\"\nShe started her career as a children's nurse in 1996, completing the BSc Hons Nursing programme at Oxford Brookes University.\nThe paediatric nurse later finished a master's in contemporary nursing at the University of Hertfordshire.\nDuring her career, she has been deployed to disease outbreaks in places such as Bangladesh and Samoa. She has also worked in conflict zones in Ukraine and most recently Gaza.\nShe said: \"It's pretty full on, as you would imagine, but it feels like an incredible honour in a way because I think a lot of us sit at home worrying about these kinds of emergencies and feel we can't do much.\n\"I'm lucky to have the skill set to make a difference.\"", "url": "https://www.bbc.co.uk/news/articles/c70ekdrl9reo"}