{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:41:54", "date_modify": "2025-04-26 04:41:54", "date_publish": "2025-03-02 06:36:08", "description": "Lifeguard supervisor Ted Morgan says it is \"the best job\" for people who love the great outdoors.", "filename": "news_articles_cpv4mwn71x8o_1745642514.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7853/live/c5b38dc0-f4ed-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4mwn71x8o_1745642514.html", "title": "RNLI wants new lifeguards across Norfolk and Suffolk beaches", "title_page": "RNLI wants new lifeguards across Norfolk and Suffolk beaches - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The RNLI is looking for lifeguards to cover its beaches in Norfolk and Suffolk.\nTed Morgan, lead lifeguard supervisor, helps manage 16 beaches stretching from Wells-next-the-Sea to Southwold.\nHe explained the job could be incredibly rewarding and anyone was capable of being a lifeguard with training.\n\"Working outdoors was amazing, working in a team environment, every single day there's lots of problem solving,\" he said.\n\"When I became a lifeguard years and years ago, I learnt so many skills,\" he explained.\n\"A lot of the first aid stuff was new to me, but those are really valuable things that could help you or someone else at any stage of your life.\nCandidates would need to pass their National Vocational Beach Lifeguard Qualification (NVBLQ) which has various elements.\nMr Morgan said it partly required a 200-metre run in under 40 seconds and a 400-metre swim in a swimming pool in under seven and a half minutes.\nSimilarly, candidates must be able to swim 25 metres underwater followed by 25 metres above water in under 50 seconds.\n\"They're all things that with a little bit of training are really achievable,\" he added.\n\"When I first started lifeguarding as a 16-year-old I was not the best swimmer, but with a few months of going to the pool once or twice a week I got to the level where I could meet that fitness requirement and become a lifeguard.\"\nMr Morgan shared it was a job \"where every day is a bit different\" and could benefit those who enjoyed working outdoors, within a team, and enjoyed learning new skills.\n\"It's just the best job,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cpv4mwn71x8o"}