{"authors": ["Anthony Zurcher", "www.facebook.com"], "date_download": "2025-04-26 03:46:43", "date_modify": "2025-04-26 03:46:43", "date_publish": "2025-03-05 05:32:24", "description": "The US president celebrated Elon Musk's Doge, defended his trade war and vowed to press on with his whirlwind agenda in primetime address.", "filename": "news_articles_ckgn3v0rdx2o_1745639203.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5b18/live/2ffefc00-f9a3-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgn3v0rdx2o_1745639203.html", "title": "Trump says he is 'just getting started' in speech to US Congress", "title_page": "Trump says he is 'just getting started' in speech to US Congress - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Six weeks into his presidency, Donald Trump came to a US Capitol controlled by his Republican Party to take a lengthy victory lap.\n\"We have accomplished more in 43 days than most administrations accomplished in four years or eight years, and we are just getting started,\" he told the joint session of Congress.\nIn typical Trumpian hyperbole, he said that \"many\" believed his to be the most successful start to a presidency in US history. He noted what he said was a change in the national mood toward \"pride\" and \"confidence\". He compared himself to George Washington, and boasted about the size of his electoral victory.\nThe whirlwind start to his presidency offered plenty of material for Trump to cover, and he didn't shy away from it.\nHe ticked through a lengthy list of tangible accomplishments – hundreds of executive orders and actions, a freeze on foreign aid, lower levels of illegal border crossing, and the withdrawal from international organisations and agreements.\nHe also spoke at length about his ban on transgender athletes in women's sports and moves to get \"woke ideology\" out of US schools and the military.\n\"Wokeness is trouble. Wokeness is bad. It's gone, it's gone, and we feel so much better for it, don't we?\"\nMeanwhile, Democrats – who filled up half the audience in the House chamber – sat in icy silence, as the president repeatedly blamed them, former President Joe Biden and \"radical left lunatics\" for all the nation's ills.\nSeveral dozen responded by holding up small black signs with words like \"false\" and \"lies\".\nThe president seemed to enjoy putting the \"bully\" in the presidential bully pulpit.\nHe needled his political adversaries, mocking their refusal to cheer his remarks, dusting off his \"Pocahontas\" nickname for Massachusetts Democratic Senator Elizabeth Warren, and wryly noting that attempts to prosecute him \"didn't work out\" for his opponents.\nTexas congressman Al Green was not around to see any of that, however.\nAfter about half an hour of touting his opening actions, Trump turned to the tasks he still needed to accomplish. That made up the bulk of a speech that stretched for more than an hour and 40 minutes. It was standard presidential address fare, and Trump's rhetorical flourishes began to blur together.\nWhile he said \"small business optimism\" was up, he blamed Biden for the current state of the economy – including high egg prices. He promised to \"rescue\" the economy and make getting \"dramatic and immediate relief to working families\" his highest priority.\nHe called out Elon Musk in the audience, and said his Department of Government Efficiency (Doge) would reduce inflation by cutting wasteful spending and fraud, prompting him to recite a laundry list of purported examples in foreign aid and other government programmes.\nTrump leaned heavily into promises of further progress on immigration enforcement and offered an animated defence of his tariff policies, saying that they were \"protecting the soul of our country\", even if most economists warn they will lead to higher prices for American consumers.\nThe president acknowledged that adding a tax on imported goods from Canada, Mexico and China might cause a \"disturbance\" and that US farmers might feel a \"period of indigestion\".\nBut nothing in his comments suggested that he was backing away from a budding trade war that has roiled the stock market in recent days - in fact, he promised to move forward with reciprocal tariffs on all US trade partners next month.\nTrump once again promised to balance the budget, prompting a round of applause from Republican legislators. He provided no details about the kind of steep cuts such a promise would require, however.\nIn fact, he quickly turned to discussing the tax cuts he hopes Congress will enact – including his campaign promises of no taxes on tips, overtime or Social Security. Any of those, if enacted, would add hundreds of billions of dollars to the current nearly $2tn budget deficit.\nForeign policy is rarely front and centre in these presidential addresses, and that was the case this time despite how Trump has shaken up global politics in the first weeks of his second term.\nHe repeated his desire for an American annexation of Greenland, promised American control of the Panama Canal and only made brief mention of Gaza and the Middle East.\nThe president spoke more extensively about negotiating with Russia for peace in Ukraine. And he took pleasure in reading from a letter he said he'd just received from Volodymyr Zelensky - which was similar to a message the Ukrainian leader posted on X earlier in the day.\n\"He said: 'My team and I stand ready to work under President Trump's strong leadership to get a peace that lasts. We do really value how much America has done to help Ukraine maintain its sovereignty and independence.'\nTrump added that Zelensky had said he was ready to sign an agreement on minerals and security \"at any time that is convenient for you\".\n\"I appreciate that,\" Trump told the chamber, offering a hint of a possible cooling of the acrimony between the two leaders.\nBy the time Trump wrapped up and Democrats practically sprinted for the exits, his speech had set a modern record for the longest presidential address to Congress. Much like the first six weeks of Trump's presidency, there was plenty for his supporters to love, and lots for his critics – at least those who tuned in – to jeer.", "url": "https://www.bbc.co.uk/news/articles/ckgn3v0rdx2o"}