{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:45:21", "date_modify": "2025-04-26 06:45:21", "date_publish": "2025-03-01 15:43:21", "description": "Carmen Somerset and Daniel Creed are running the half marathon two days after their wedding.", "filename": "news_articles_cnvzz0l2mmlo_1745649921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/13ca/live/4af446a0-f5c5-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cnvzz0l2mmlo_1745649921.html", "title": "Couple to run Brighton Half Marathon as newly-weds", "title_page": "Couple to run Brighton Half Marathon as newly-weds - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thousands of runners are preparing for the 13.1 mile Brighton Half Marathon on Sunday as organisers confirm the event is going ahead.\nThe race is in its 35th year and some runners have decided to make this event extra special, including Carmen Somerset and Daniel Creed who will be running together as newly-weds.\nMs Somerset, 40, told BBC Radio Sussex: \"When planning our wedding party we realised it is the day before the half marathon.\"\nThe couple got married at Brighton Town Hall on Friday and 30 people from their running club are attending their wedding party on Saturday.\nMr Creed said: \"We're going to stick together on the run with a 'just married' sign on our back.\n\"On Sunday morning we'll be nursing sore heads but we'll be running together in the half-marathon as newly-weds,\" said Ms Somerset.\nMartin Harrigan, organiser of the Brighton Half Marathon, said: \"It's a great story, I used to run the half marathon with Daniel.\"\nSoph Cheesman and Hannah Brown, both from Brighton, will be running the half marathon tied together at their wrists and ankles.\nThey are also attempting a world record with a target time of one hour and 50 minutes.\nThe duo are raising money for Macmillan Cancer in memory of Ms Cheesman 's grandfather, Robert Cheesman, who died from stomach cancer last December.\nShe said: \"He was a true legend and we miss him greatly.\n\"He competed regularly in the bathtub races in Shoreham. He attempted a Guinness World Record to get across the channel in a bathtub.\n\"This was not achieved but a great effort, so therefore in his memory we would like to achieve a Guinness World Record.\"", "url": "https://www.bbc.co.uk/news/articles/cnvzz0l2mmlo"}