{"authors": ["Andrew McNair", "www.facebook.com"], "date_download": "2025-04-26 06:57:45", "date_modify": "2025-04-26 06:57:45", "date_publish": "2025-02-28 13:55:22", "description": "Barristers in NI will scale back industrial action from 1 March, but will continue to refuse some new cases.", "filename": "news_articles_c5y44ygppq2o_1745650665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fd54/live/a3aa7070-f5d5-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y44ygppq2o_1745650665.html", "title": "Legal aid strike: Barristers to recommence some case work", "title_page": "Legal aid strike: Barristers to recommence some case work - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barristers in Northern Ireland will scale back their industrial action from 1 March, but continue to refuse some new cases in a long running dispute over legal aid fees.\nThe Criminal Bar Association (CBA), which represents criminal barristers, had withdrawn some services in November, and escalated its action in January by refusing to take all legal aid cases at the Crown Court.\nIt wants an increase in legal aid fees, which it says haven't changed in 20 years.\nA spokesperson for the Department of Justice said that minister had already announced a \"significant 16% uplift in fees\".\nThe CBA said in a statement: \"The Bar of Northern Ireland has at all times been, and remains, ready, willing, and able to engage in meaningful dialogue with the Department of Justice in order to resolve the access to justice crisis and bring to an end its remaining industrial action.\"\nIt began industrial action in November last year by withdrawing certain legally aided services.\nIn January, citing \"failings on the part of the Department of Justice\", the CBA announced its members had voted to extend action by refusing to take all cases listed at the Crown Court in February.\n\"Engagement has taken place with the Department of Justice in recent weeks\" it said in a statement.\n\"Although positive, the CBA does not consider that this engagement has created the conditions necessary to enable them to advise their members to cease entirely their withdrawal of services.\"\nThe CBA confirmed that it would return to refusing \"defined classes of new Crown Court action\".", "url": "https://www.bbc.co.uk/news/articles/c5y44ygppq2o"}