{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 03:46:34", "date_modify": "2025-04-26 03:46:34", "date_publish": "2025-03-05 05:40:23", "description": "Labour agrees to fund £20m to three councils over the next 10 years for a range of investments.", "filename": "news_articles_ckgy5xxgxljo_1745639194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/40a6/live/84c073a0-f911-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgy5xxgxljo_1745639194.html", "title": "Relief as Government honours Tory pledge to invest in three towns", "title_page": "Relief as Government honours Tory pledge to invest in three towns - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three Norfolk towns will receive £20m each over the next decade after the government confirmed it would honour a pledge made by the Conservatives.\nGreat Yarmouth, King's Lynn and Thetford had all been identified to receive £2m per year over the next 10 years.\nHalf a million pounds each year could be spent on things including street repairs, enviro-crime, skills training and tackling antisocial behaviour.\nSheila Oxtoby, chief executive of Great Yarmouth Borough Council, said: \"It does look as though what we submitted under the Long Term Plan [for Towns] will fit within the new Plan for Neighbourhoods, so we are very pleased.\"\nEach town will have a board made up of local people, which will decide how to spend the money.\nThey can choose from options ranging from repairs to pavements and high streets, to setting up community grocers providing low-cost alternatives when shopping for essentials, as well as co-operatives or even neighbourhood watches.\nMs Oxtoby added: \"It was a lot of work with stakeholders like the Civic Society, to make sure allocating the funding would make a real difference to the town, so all of the projects and initiatives wouldn't have been able to be funded.\n\"The funding doesn't come into play until 2026-27 but during 2025 we will start to put our plans in place and hopefully people will start to see a difference.\n\"The priorities people said they wanted were around enviro-crime, cleanliness and antisocial behaviour, improvements to the town centre... the government seems to have widened out the criteria to include health and skills, all of the things we would want to see invested in.\"\nAlistair Beales, leader of the Borough Council of King's Lynn & West Norfolk, said the authority had consulted residents and set its priorities for spending and investment.\nHe said the \"significant national investment\" would help deliver \"new facilities, opportunities and jobs... making more of our rich heritage... building upon the good work that's already in progress under the Town Deal.\n\"Through major regeneration and investment, our town will become a better connected, more attractive and accessible place, where residents and businesses are inspired and supported to achieve their ambitions, visitors choose to explore as a destination, and where there is more for everyone who comes into the town to enjoy and experience.\"", "url": "https://www.bbc.co.uk/news/articles/ckgy5xxgxljo"}