{"authors": ["Jasmine Ketibuah-Foley", "Adrian Chiles", "www.facebook.com"], "date_download": "2025-04-26 06:20:03", "date_modify": "2025-04-26 06:20:03", "date_publish": "2025-03-01 07:01:11", "description": "BBC Radio 5 Live's Adrian Chiles joins Saints Old Boys FC in training to deal with \"banter\" in sport.", "filename": "news_articles_cgj54376492o_1745648403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6148/live/053e8340-f2b5-11ef-9220-d3ef6018353e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgj54376492o_1745648403.html", "title": "Adrian Chiles joins Bristol team training to end harmful 'banter'", "title_page": "Adrian Chiles joins Bristol team training to end harmful 'banter' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Do you know what to say when \"banter\" in the locker room becomes misogynistic, homophobic or racist?\nIf you do nothing, it could give your peers the impression their behaviour is acceptable and possibly the green light to do something worse.\nThe government has pledged to halve violence against women and girls within a decade, and has set out new measures, external to combat the issue.\nBBC Radio 5 Live presenter Adrian Chiles invited 10 Bristolian male footballers to a bystander training session to learn how to safely stop harmful attitudes and beliefs.\nSitting in a conference room in the heart of Bristol, the players from Saints Old Boys Football club heard statistics about how common violence against women is in the UK.\n\"One in three women will experience domestic abuse in their lifetimes. How does it feel to hear that?\" trainer Nate Eisenstadt asked the men.\nOne of the amateur footballers, Chris Jones, expressed surprise at the figures, saying, \"we're just not aware of it, it's really sad. you could be sat next to somebody who is a wife beater and you wouldn't know\".\nHowever, his teammate Lewis Tilley was less surprised: \"I know of people,\" he said. \"You see it on Facebook, doing the rounds on social media, 'did you see so and so, they've broken up and he's gone mental'.\n\"If it's somebody you don't know that well, you might think it's not your place [to intervene].\"\nIt is in these situations that trainer Nate Eisenstadt advises to approach a person \"as a friend\", to not \"cut them down\", but to invite them to \"think about the impact of their words\".\n\"Some people will be resistant,\" he warned.\nBut he said it was \"about upskilling people to intervene in low-level harmful interventions\".\n\"For example, you might hear some locker room banter that is sexist, street harassment, things that undermine women and pave the way for higher-level harm.\n\"Someone in response could say, 'I think that's outdated', or make a joke out of it and say, 'Are we in the 1940s?'.\n\"The next day you can say, 'What you said didn't sit right with me'.\"\nSport is no stranger to being a place where harmful comments are made.\nCharities like Kick It Out have been established to promote inclusion and address discriminatory behaviour among fans and players.\nThe organisation said it had received 1,332 reports of abuse in the 2023/24 season - the highest number it had seen in a single season, with reports of sexism and misogyny increasing by 44% in the same time period.\nThese statistics suggest discrimination in sport is not slowing down.\nWhen harmful language becomes part of a culture, it can be very confusing for people to know where the boundaries lie.\nThe Radio 5 Live presenter asked the group if they were clear on what was acceptable and unacceptable within their team.\n\"Would you confess any confusion?\" he asked them.\nGraham Edgell, club manager, said it was quite normal for people to see \"banter\" in sport as something that brought players together, something that \"drops the barriers\".\n\"But it does mean that you're more aware when you're in different environments, you need to behave in a different way,\" he said.\n\"You need to be a bit more agile, especially people at my age, we have no idea what is correct.\"\nAfter sharing very honest and candid examples of difficult moments they could have intervened in, the footballers reflected on how they would take their learnings back into their own lives.\nThey were struck by how \"powerful\" it could be to speak up in situations and said they now felt more \"empowered\" to spot things before they escalated.\n\"We have a lot of leaders within the club,\" the manager said.\n\"People young lads and adults will look up to.\n\"If that person is demonstrating a set of values and a way of acting then that sets the tone for people around them.\"\nChiles said the aspect of the course that most struck him was when trainer Nate Eisenstadt asked the group to read out quotes from women on methods they use to ensure their personal safety.\nThe men in attendance were then asked what they themselves did to minimise their risk of sexual violence.\n\"It really stunned me - partly at my own naivety and stupidity in not thinking about this before as a father of two daughters and somebody who cares about these things,\" he said.\nHaving sat in on the course, Chiles reflected on how \"taken\" he was by \"how little I've thought about intervening really\".\n\"It's never simple, but that doesn't mean you shouldn't think about doing it.\n\"Given that you can affect the behaviour of the whole group, it's quite highly geared.\n\"Just one gentle word might affect a greater change than you think,\" he added.\nIf you have been affected by issues raised in this article, help and support can be found on the BBC action line website.\nAdrian's interview was part of a wider series on BBC Radio 5 Live about violence against women.\nListen to a live audience discussion about the subject on BBC Sounds.", "url": "https://www.bbc.co.uk/news/articles/cgj54376492o"}