{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:21:17", "date_modify": "2025-04-26 04:21:17", "date_publish": "2025-03-03 15:03:08", "description": "The NI Executive's programme for government is officially unveiled after being presented to the assembly.", "filename": "news_articles_cvgdv0ndln1o_1745641277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f971/live/4f4dbe40-f84d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgdv0ndln1o_1745641277.html", "title": "NI programme for government: What does it really mean?", "title_page": "NI programme for government: What does it really mean? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Northern Ireland Executive's programme for government (PfG) has been officially unveiled after being presented to the assembly.\nThe plan, called Doing What Matters Most, was unanimously agreed by the four parties in the executive last week.\nThe PfG sets out priorities for the executive for the remaining assembly term.\nBut what will it mean for people?\nJulian O'Neill, BBC News NI crime and justice correspondent\nThe PfG appears to support plans by the chief constable to increase police numbers – without making cast iron commitments on finance.\nJon Boutcher has said he is seeking £200m over the next five years to recruit more officers and staff.\nStormont has pledged to \"develop a robust business case\", which seeks to boost the number of officers from 6,300 to 7,000 by 2028.\nElsewhere, the programme recommits to speeding up justice.\nIt will explore expanding the use of Community Resolution Notices (CRNs) which would dispose of more cases without the need for court action.\nThere is also a pledge to secure agreement around continuing the tackling paramilitary programme.\nThe £16m-a-year initiative, jointly funded by London, currently runs until 2027.\nIt supports more than 100 grass roots projects, including schemes to divert young people from becoming involved in paramilitary activity.\nMarie-Louise Connolly, BBC News NI health correspondent\nIf you are on a hospital waiting list your ears may have pricked up when you heard that the PfG is to treat an extra 70,000 patients by 2027.\nIt's a positive headline but dig behind it and it throws up questions.\nWhat type of patients and what kind of surgery will be targeted?\nIf we take an average spend of around £4,000 per patient and considering knee or hip operations per person cost around £10,000 and a hernia operation around £3,000 the money will not go too far.\nThe £135m figure is not new.\nIt was quoted last February, when then Health Minister Robin Swann said funds above £75-80m were required for cancer lists and up to £135m to tackle all waiting lists.\nAccording to the Royal College of Surgeons, it will take up to ten years of sustained investment to tackle the lists which are the longest in the UK.\nPerhaps the most contentious question is if the Department of Health is willing to use the independent sector to help clear the lists?\nBBC News NI understands that only last year, an offer by an independent hospital to cut gall bladder and hernia waiting lists by half at a cost of around £6m was turned down by the department.\nWhile the offer may have been welcomed - it's understood there wasn't the additional resources, as all focus was on trying to get the health workers pay deal over the line.\nClodagh Rice, BBC News NI business correspondent\nThe number of people on a waiting list underlines the fact we aren't building enough social homes.\nThere are nearly 48,000 households currently on a waiting list for a social home, about 36,000 of those are in housing stress.\nThe target in the PfG is to have started work on at least 5,850 new build social homes in Northern Ireland by 2027 - that's less than 3,000 homes a year for the next two years.\nWhile having a target is welcomed, this isn't the first target that's been set.\nThe executive wasn't able to deliver on its previous target of building an additional 2,500 new social homes a year, falling short of that, completing an estimated 1,400 last year.\nRamping up will be a challenge - achieving any of these targets will require a cross-cutting effort to address well documented barriers such as our water infrastructure, planning, land availability and funding.\nThe figures in this document are also largely in keeping with targets set in the Housing Supply Strategy which was published last year.\nIt said 100,000 new homes needed to be built by 2039 and one third - about 33,000 - of those will be social homes.\nMark Simpson, BBC News NI communities correspondent\nAnyone hoping for a concrete guarantee about the redevelopment of Casement Park will not find it in the PfG.\nMore money is needed to rebuild the west Belfast stadium – at least £140m extra – but there is only a general commitment to the project in the document.\n\"We will make progress on the redevelopment of Casement Park and initiate investments in sub-regional and grass roots sports,\" say ministers on page 65.\nCommunities Minister Gordon Lyons has started the ball rolling on a £36.2m Northern Ireland Football Fund which will help improve Irish League grounds.\nHowever, the Casement Park project remains in limbo due to the funding shortfall.\nA total of £62.5m has been ringfenced by the Stormont executive and is available, but it is not enough for work to begin.\nCasement Park remains on the Stormont executive's lengthy to-do list.\nRobbie Meredith, BBC News NI education and arts correspondent\nProviding adequate support to children and young people with Special Educational Needs (SEN) is one of the biggest challenges in education.\nThe past few years have seen problems with things like school places, support, assessments and post-school provision for children and their families.\nMany families say they face a battle from the early years to get timely and meaningful help for their children.\nThe PfG makes that a task for the whole executive rather than just the departments of education, health and the economy.\nIt promises a comprehensive \"reform agenda and delivery plan\" for SEN this year.\nThere are some proposals in the PfG to identify children's SEN earlier and ensure there are pathways to further education or training when they leave school.\nMany will welcome the fact that supporting children with SEN is one of the executive's main priorities.\nBut any real detail is frustratingly absent from the PfG, presumably to come in the SEN delivery plan at a later date.\nLouise Cullen, BBC News NI agriculture & environment correspondent\n\"Planet\" is one of the executive's three missions, and \"Protecting Lough Neagh and the Environment\" is priority number eight of the nine objectives of the PFG.\nOne of the actions it outlines has already been fulfilled – Northern Ireland's first Environmental Improvement Plan was published within days of the consultation being opened.\nAnd under the PfG's \"People\" mission, a Food Strategy Framework has also been published to help support farmers and local food producers.\nBut there are questions about how other aims like housing targets can be met when enabling infrastructure has already been ruled out by NI Water.\nThe company said last week it would move to a maintenance programme for its facilities in Belfast rather than upgrading, due to funding shortfalls.\nAnd that ageing infrastructure already places constraints on house-building and development that NI Water has warned will only get more severe as a result.\nWhile Carbon Budgets covering 2023-2027 have been set, a Climate Action Plan (CAP) has yet to go out to consultation.\nThe CAP will also require executive approval, which delayed the publication of both the Lough Neagh Action Plan and the EIP.\nWith no specific targets in the PfG to improve the environment, campaigners may well ask just what commitments Stormont can be held to.\nBrendan Hughes, BBC News NI political reporter\nThis is a document that has been over a year in the making.\nOne hundred pages setting out the key priorities of the Northern Ireland Executive.\nAnd after a last-minute hiccup last week, the public finally gets to see Stormont's programme for government.\nGiven the volatile nature of the devolved institutions, getting this far with a four-party coalition could be seen as an achievement in itself.\nThe last time a programme for government was finalised and endorsed by the Northern Ireland Assembly was in 2012.\nBut now that the executive has agreed its key pledges, can they be delivered?\nWhile some promises have targets attached, others seem pretty vague.\nClaiming success or failure over the next two years could be left open to interpretation.\nThe executive will nevertheless be keen to make as much progress as possible before the next assembly election is due in 2027.", "url": "https://www.bbc.co.uk/news/articles/cvgdv0ndln1o"}