{"authors": ["Nathan Turvey", "www.facebook.com"], "date_download": "2025-04-26 03:54:11", "date_modify": "2025-04-26 03:54:11", "date_publish": "2025-03-03 07:14:00", "description": "Special postbox allows children to send letters and drawings to family members they have lost.", "filename": "news_articles_cpdexngg2n5o_1745639651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/292e/live/22337970-f5b1-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpdexngg2n5o_1745639651.html", "title": "Harrogate mum creates 'letters to heaven' postbox", "title_page": "Harrogate mum creates 'letters to heaven' postbox - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For children experiencing their first family bereavement, it can be difficult to explain to them what has happened.\nA primary school teacher from Harrogate whose own daughters had suffered the loss of their great-grandmother has given them an outlet for their feelings by helping to set up a \"letterbox to heaven\" in the town.\nLynsey Rogers said she was finding it difficult to talk to Daisy and Bella, who are three and five, about the death of her grandmother at the age of 85.\nShe said: \"I just wanted to make sure, as I was upset and dealing with my own grief, that I was able to do it in the best way for them.\"\nAnyone can use the special postbox to send letters and drawings to a relative they have lost.\nRemembering her grandmother, Ms Rogers said she was an \"amazing lady\" and they were a \"very close family unit\".\n\"The girls were both upset - as we thought they would be - and they both wanted to draw a picture.\n\"Then my eldest daughter said to me: 'Well how will she get them in heaven'? and I was just a bit flummoxed to start with - I didn't know how to answer that question.\"\nMs Rogers took to social media to find out whether Harrogate already had a letterbox to heaven.\n\"It turned out we hadn't got one - and there were lots of people saying it would be lovely if we did, what a nice idea that would be.\"\nA local funeral director then got in touch and said they would install one on the wall outside their building on Franklin Road.\nTim Canavar, from Hubert Swainson's Funeral Directors, said they had been \"really surprised\" by the response to the postbox.\n\"There's been some really good comments, people think it's such a good idea\", he said.\n\"We were aware of some postboxes down south that some cemeteries had installed and they were proving popular - but we never really gave it a thought until Lynsey asked the question online.\"", "url": "https://www.bbc.co.uk/news/articles/cpdexngg2n5o"}