{"authors": ["Joshua Askew", "Fiona Irving", "www.facebook.com"], "date_download": "2025-04-26 06:55:25", "date_modify": "2025-04-26 06:55:25", "date_publish": "2025-02-28 15:31:00", "description": "Prosecutors say Claire Knights's killer Harrison Lawrence Van-Pooss was \"strong and determined\".", "filename": "news_articles_cn89901p07lo_1745650525.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0e9/live/5ea8f090-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn89901p07lo_1745650525.html", "title": "Man who killed dog walker in random attack jailed", "title_page": "Claire Knights: Man who killed dog walker in random attack jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who sexually assaulted and killed a dog walker after ambushing her near a Kent beach has been jailed for life.\nHarrison Lawrence Van-Pooss, 21, had previously admitted murdering Claire Knights, 54, from Upstreet, near Canterbury.\nHer body was found hidden in reeds between St Nicholas-At-Wade and Minnis Bay in August 2023, following a two-day search.\nVan-Pooss, who attacked Ms Knights a day after being caught upskirting, said in a statement read out by his lawyer at Canterbury Crown Court: \"I will never forgive myself.\"\nOn the first day of sentencing on Thursday, the court heard how Ms Knights' son found his mother's body \"face down in the dyke\".\nHer neck and thighs were bruised, which the prosecution said meant she had been sexually assaulted while still alive.\nDuring the sentencing, Mr Justice Garnham said Van-Pooss, who he described as having a personality disorder, had never provided an honest account of what happened.\nMr Garnham added he \"beat Ms Knights mercilessly\", causing catastrophic brain injuries.\nVan-Pooss, from Margate, used a knife to \"terrify and control\" the lone woman and force her away from the path, the court also heard.\nNatalie Smith, from the Crown Prosecution Service (CPS) South East, said: \"None of us can imagine the terror that Claire suffered when she was attacked, knowing that she was alone on an isolated path and being overpowered by a strong and determined man.\"\nA coroner said at an inquest in September that she was believed to have died from a blunt force injury and drowning.\nVan-Pooss will serve a minimum of 25 years in jail.\nMs Knights and Van-Pooss did not know each other before he killed her.\nVan-Pooss was confronted about upskirting a woman the day before the attack, but went on the run before he could be arrested.\nIt is believed he camped out by the beach overnight before murdering Ms Knights the following afternoon, the CPS said.\nThe exact sequence of events leading up to Ms Knights' death was known only to her killer, according to the prosecution.\nProsecuting barrister Alison Morgan KC said Van-Pooss - who she detailed as a \"vast and powerful\" man - told experts he had \"no recollection of parts of the day\" and was under the influence of alcohol at the time.\nShe said he left Ms Knights with multiple fractures after beating her.\nVan-Pooss took Ms Knights' spaniel Zebulon to a nearby shop to buy it treats after murdering her, according to the CPS.", "url": "https://www.bbc.co.uk/news/articles/cn89901p07lo"}