{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:24:13", "date_modify": "2025-05-19 15:24:13", "date_publish": "2017-07-04 00:00:00", "description": "Bringing you the news, sport, travel and weather for the Channel Islands on Tuesday 4 July 2017", "filename": "news_live_world-europe-jersey-40447644_1747668253.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_world-europe-jersey-40447644_1747668253.html", "title": "BBC Local Live: Channel Islands on Tuesday 4 July 2017", "title_page": "BBC Local Live: Channel Islands on Tuesday 4 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our coverage across the Channel Islands\nOur coverage across the Channel Islands has finished for the day.\nWe'll be back tomorrow from 08:00 with the latest news, sport, travel and weather.\nDon't forget BBC Channel Islands News on BBC One at 22:30.\nThere will also be news through the night on your BBC Local Radio station.\nMan 'repeatedly punched in face' in St Peter Port\nRob England\nBBC News Online\nA man was \"repeatedly punched in the face\" after a fight broke out at the Panda Chinese takeaway in St Peter Port, police have said.\nOfficers are appealing for information after the incident, which saw a second man being arrested on Sunday.\nPolice say there were about 20 people in the restaurant and are appealing for witnesses.\nGuernsey teachers strike: Parents should not be 'concerned'\nGareth Owen\nBBC Radio Guernsey\nGuernsey's Education Committee has said plans are in place to deal with a potential strike by teachers at Les Beaucamps High School which is set for next Tuesday and Thursday.\nMembers of the Guernsey branch of the NASUWT are due to walk out next week following concerns about \"management practices\" at the school.\nThe Committee Vice-President Deputy Carl Meerveld said parents should not be concerned.\nStaff in care home did not have 'basic qualifications'\nStaff at Jersey's Heathfield care home for children were appointed \"without basic qualifications\" it has been revealed as part of the Independent Jersey Care Inquiry.\nThe final report from the panel said staff did not have sufficient training, and despite \"some innovative practices\" being introduced in 2005, the management response to issues with the home's operation were \"inappropriate\" and \"lacking insight\".\nOne manager, Kevin Parr-Burman was mentioned by name, and came under criticism from the panel for \"blaming young people\", and emphasising the necessity of control, as opposed to care of the children in the home.\nCare inquiry: Secure rooms not used in other Western nations\nSecure accommodation or detention rooms were \"a significant feature\" of the experience of many former Jersey care home residents.\nThe inquiry's report says throughout the period reviewed \"secure rooms were not used in other Western nations, save for the most serious of circumstances, and only as a means of last resort and for the minimum necessary time\".\nIn contrast in Jersey they were used \"routinely and excessively, in a punitive fashion, without regard to the needs, welfare or rights of the child and without proper care or safeguards\".\nChild services care home saw 'young children' work in factory\nYoung people at a care home run by the States of Jersey were made to work in factories, a report has found.\nThe Independent Jersey Care Inquiry panel said the \"industrial model\" where young people were trained to work in local services whilst in care, \"continued much longer in Jersey\".\nSacre Coeur, one of a number of States run care homes mentioned in the report, was highlighted in the report for doing this.\nThe panel said \"young children\" at the homes worked in the \"Summerland Garment Factory\" and criticised the States of Jersey for not taking \"greater responsibility\" for the young workers.\nChalmers turns down London Games offer\nJames Law\nBBC Sport Online\nCameron Chalmers says he has turned down a 400m spot at this weekend's London Anniversary Games to rest before next week's European Under-23 Championships.\nThe 20-year-old, from Guernsey, came third at the British trials on Sunday to boost his hopes of representing Great Britain at next month's World Championships.\n\"I actually got a phone call yesterday offering me a lane which I turned down, as crazy as that sounds,\" he told BBC Sport.\n\"But it's just the wrong timing, to put it plainly. I've run half-a-second quicker than I thought I would [this season] and that's suddenly opened a lot of doors, so I'm a victim of my own success a little bit.\"\nChalmers turns down London Games offer\nSprinter Cameron Chalmers turns down a spot at the London Anniversary Games to rest before the European Under-23 Championships.\nRead More\nChildren 'humiliated and beaten with nettles'\nThe Independent Jersey Care Inquiry panel has said the children housed at the Jersey Home for Boys and Jersey Home for Girls suffered \"cruel and degrading punishments\".\nThe facilities, which later joined to become Haut de la Garenne, were the setting for \"children being humiliated and beaten with nettles\" and \"locked in confined spaces\", according to the inquiry panel.\nAlthough the report acknowledges regime changes at the facilities over the years, it concludes \"the suffering of children who were sent there did not diminish\".\nGuernsey residents advised 'to avoid jellyfish'\nRob England\nBBC News Online\nJellyfish have been sighted off Guernsey's west coast at Cobo and Grandes Rocques.\nPeople have been warned not to touch them by Agriculture, Countryside and Land Management Services. However, it added it was likely the species offshore were largely harmless.\nThe department said the descriptions provided indicated the jellyfish seen were likely to be blue and compass jellyfish.\nIn 2007 a similar looking jellyfish, the poisonous Portuguese man-of-war, was found at Portelet in Guernsey.\nCare inquiry: Interests of children were 'secondary'\nThe Jersey Care Leavers Association says too often the interests of vulnerable children in care were secondary to the interests of others and the \"reputation\" of the island.\nSpeaking after the publication of the Independent Jersey Care Inquiry report, Carrie Modral from the association said often the States of Jersey would put resources into short-term measures to protect its reputation.\nQuote Message\nThose concerned may well have thought they were acting wisely at the time, but they were blinkered as to the real issues. Children were being failed and in the worse possible way.\"\nCarrie Modral, Jersey Care Leavers Association\nCare inquiry details 'will take some time to fully analyse'\nJersey's chief minister says the States will starts the process of getting into the details of the 800-page report on Thursday.\nSenator Ian Gorst said he planned to have a detailed response ready in October.\nHe said with the States approval a new Independent Children’s Commissioner will be appointed \"to champion the rights of all children and young people\".\nThe chief minister said the States would \"accelerate the modernisation of our children’s legislation and the delivery of a Children’s Plan\" with money already invested in initiatives to help vulnerable children.\nVictims coming forward shows 'increased trust'\nQuote Message\nIt is clear multi-agency responses to allegations of abuse in the past were not of the high standards we expect today - important lessons have been learned. The SoJP (States of Jersey Police) will continue to play a full and active role in protecting the most vulnerable in our community, including children and young people.\"\nMike Bowron, Jersey's Chief of Police\nHe said: \"We can only do that in partnership – no-one generally has the complete picture – this remains 'everyone's business'.\n\"We now see more victims coming forward than ever before, which demonstrates an increased trust and confidence in the criminal justice system.\n\"We will continue to listen to victims of historical abuse and where feasible bring offenders to justice – whilst also focussing very much on today’s victims and the prevention of tomorrows.\"\nCare inquiry: Jersey Care Leavers Association welcomes report\nThe Jersey Care Leavers Association (JCLA) welcomed the Independent Jersey Care Inquiry report, saying it was \"a long time coming\".\nCarrie Modral from the JCLA said: \"The report makes for disturbing reading. The inquiry exposes repeated failures in good governments and managements on the part of the States of Jersey.\"\nShe criticised the use of the \"historical\" label, saying it is misleading as the survivors of the care system are \"living testimony to the fact there is nothing historical about the abuse they suffered\".\nMs Modral said it was important the report doesn't just \"gather dust\" and the recommendations are properly implemented and acted on to ensure there is a \"fit for purpose child protection system in place\".", "url": "https://www.bbc.com/news/live/world-europe-jersey-40447644"}