{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:12", "date_modify": "2025-05-19 15:34:12", "date_publish": "2015-01-30 10:44:23", "description": "New figures suggest the recent slowdown in property sales may continue for at least the next few months.", "filename": "news_business-31055557_1747668852.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80671000/jpg/_80671034_017534689.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31055557_1747668852.html", "title": "Mortgage approvals point to further sales fall", "title_page": "Mortgage approvals point to further sales fall - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New figures suggest the recent slowdown in property sales may continue for at least the next few months.\nThe number of new mortgages approved to house buyers in December, but not yet lent, rose slightly to 60,275, according to the Bank of England, external.\nAlthough the number of approvals was a little higher than in November, it was 17% down on December 2013.\nApprovals are a good indicator of near-term trends in house sales.\nThey had been running at a monthly average of 67,203 in the first half of 2014, but in the second half of the year that monthly average fell to 61,669.\nUK home sales went up by 14% for the whole of last year to 1.22 million, the highest number since 2007.\nBut they eased off in the last few months of the year, taking the steam out of house price inflation.\nRecent surveys have shown that house prices across the UK have in fact stayed flat since last summer.\nSome economists suggested that activity in the property market might now start to pick up.\n\"The first rise in mortgage approvals for six months in December reported by the Bank of England supports our suspicion that the weakening in housing market activity may be drawing to a close,\" said Howard Archer of IHS Global Insight.\n\"Of course, not too much should be read into one month's data and mortgage approvals are still at a low level.\"\nCapital Economics said the small rise in monthly approvals reflected several factors.\n\"Housing demand is being supported by further falls in interest rates,\" said the consultancy firm.\n\"Indeed data on mortgage rates also released this morning showed that the effective rate on new loans dropped for the third consecutive month to just 3.0% in December, down from 3.2% in the summer.\n\"Meanwhile rising real earnings and the reform to stamp duty have boosted prospective buyers' purchasing power,\" it added.", "url": "https://www.bbc.com/news/business-31055557"}