{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 04:28:09", "date_modify": "2025-04-26 04:28:09", "date_publish": "2025-03-02 10:19:34", "description": "Miron Muslic's side lost 3-1 in the fifth round against Premier League champions Manchester City.", "filename": "news_articles_cvg15dll0z8o_1745641689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a8d3/live/0171fc70-f74b-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg15dll0z8o_1745641689.html", "title": "FA Cup: Plymouth Argyle fans still proud as 'terrific' run ends", "title_page": "FA Cup: Plymouth Argyle fans still proud as 'terrific' run ends - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth Argyle fans said their sense of pride towards their club was huge despite their giant-killing FA Cup run ending in defeat.\nA total of 7,800 Argyle fans followed Miron Muslic's side to the Etihad Stadium on Saturday where the Championship club faced reigning Premier League champions Manchester City in the fifth round.\nMaksym Talovierov gave the visitors hope when he gave them a surprise lead, but a Nico O'Reilly brace and late goal from Kevin de Bruyne helped City to a 3-1 win.\nArgyle fans said it was a sad ending to their cup run which saw them shock Premier League sides Brentford and Liverpool, but they had a lot of fun along the way.\nSupporters travelled up by coach, car and train to watch Argyle take on Pep Guardiola's men, who have won the FA Cup seven times in their history.\nTristan and Claire Bannister were among those who went up to Manchester along with other members of the North Devon Greens supporters group to the Etihad.\nThe couple from Westward Ho! said the whole day would live in their memories for a long time, despite the defeat.\n\"That feeling of going 1-0 up at the Etihad with 7,800 Green Army fans will live with us forever I'm sure,\" Tristan said.\n\"To keep the class of Man City and Kevin De Bruyne in particular quiet for the remainder of the match would have been a monumental task. However, the lads put in terrific shift.\"\nClaire added the team's focus could now shift to staying in the league as they fight to get out of the relegation zone, with the side currently 23rd in the table and three points adrift from safety.\nShe said: \"We will enjoy our train journey back to Devon and look forward to the end of the season, and hope we can stay in the Championship.\"\nJulie Cardell also went to match and said the atmosphere was fantastic when Argyle's goal went in.\nShe said: \"We were at the other end of the stadium when Maxi scored, but you could tell straight away he'd scored.\"\nMrs Cardell said she set off to Manchester from Plymouth at 09:00 GMT and did not get home until 02:00 on Sunday.\nHowever, she said she thought the very long day was \"totally worth it\".\n\"I wouldn't have missed it for the world,\" she added.\n\"We held our own and we were worried when [Erling] Haaland came on, but even he couldn't do much against us.\"\nPlymouth Argyle's chaplain Arthur Goode travelled up to the Etihad and managed to get pitch side.\nHe managed to do a pre-match prayer session with some of the players and said the players gave a \"good account of themselves\".\nMr Goode, who is also a pastor at the Plymouth Vineyard Church, added the atmosphere in the away end was brilliant.\nHe said: \"We often say Plymouth is a bit of a village anyway because you bump into people you know all over the place, but it was intensified in the stadium.\n\"The away atmosphere is sometimes better and it was absolutely humming during the match.\n\"When we scored, it was just like: 'Is this really happening?' It was immense.\"\nJacqueline said being in the stadium was \"absolutely cracking\" and even when City scored, her fellow Argyle fans kept singing.\nShe said: \"The atmosphere carried on even after City equalised and even when we went 2-1 down we were still shouting and cheering.\n\"I was a little bit deflated at the final whistle, obviously, as it would have been nice to come away with a win.\n\"But, at the end of the day, they came across to us and it was lovely to see Miron and all the team clapping us as it just shows their appreciation, doesn't it.\"\nSteve said it was the second time he had been to the Etihad Stadium as he saw a Robbie Williams concert there previously.\n\"I think watching Argyle here was better,\" he said.\n\"I don't think there were any expectations that we were going to stuff them, but it was good that we scored that goal and we got to celebrate it.\"", "url": "https://www.bbc.co.uk/news/articles/cvg15dll0z8o"}