{"authors": ["Anna Lewis", "www.facebook.com"], "date_download": "2025-04-26 03:55:53", "date_modify": "2025-04-26 03:55:53", "date_publish": "2025-03-04 15:35:51", "description": "The prime minister meets members of the cast as part of an event celebrating Wales.", "filename": "news_articles_cwynrjpger4o_1745639753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3746/live/408917d0-f8ff-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynrjpger4o_1745639753.html", "title": "Gavin & Stacey: Fishing trip mystery remains after PM meeting", "title_page": "Gavin & Stacey: Fishing trip mystery remains after PM meeting - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The truth behind the infamous fishing trip in Gavin & Stacey remains a mystery after stars of the show met with the prime minister.\nSir Keir Starmer shared a picture with members of the cast at Downing Street on Tuesday after an event to \"celebrate the achievements, people and history of Wales\".\nHowever, Starmer joked: \"And no, they wouldn't tell me what really happened on the fishing trip...\"\nMore than 19.1 million viewers watched the final episode of the show which aired on Christmas Day.\nGavin & Stacey was first screened in 2007 and for years fans have followed the intertwined lives of the couple and their friends and family.\nOver half (59%) of Wales' population watching the final ever episode - compared to just 32% of those in rest of the UK - according to BBC viewing figures.\nKeen re-watcher Laura Davenport, 39, has watched the finale five times and said the viewing figures came as no surprise to her.\nBorn in Barry, Vale of Glamorgan, where the show is set, and the founder of Scoop ice cream store on Barry Island, she said the characters reflected those that many people know and love in their own lives.\n\"People may not like to admit it, but we all see a bit of ourselves in the characters,\" she said.\n\"Some people get quite offended and think it makes us look stupid, but it's Welsh humour and our ways of speaking.\n\"Everyone knows a Gwen, who is very particular about things, while everyone knows a Nessa, someone who you would call if you were in trouble.\"", "url": "https://www.bbc.co.uk/news/articles/cwynrjpger4o"}