{"authors": ["Bridget Kendall", "www.facebook.com"], "date_download": "2025-05-19 14:26:29", "date_modify": "2025-05-19 14:26:29", "date_publish": "2015-04-18 12:08:46", "description": "Stalin still haunts Oryol, a historic Russian town cherished by famous writers but showing signs of neglect, Bridget Kendall reports.", "filename": "news_world-europe-32349312_1747664789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82405000/jpg/_82405136_russtalingetty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-32349312_1747664789.html", "title": "Russian town of Oryol trapped in Soviet past", "title_page": "Russian town of Oryol trapped in Soviet past - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On a small stage in a community hall, still grandly called a Palace of Culture, a powerfully built lady belts out an old Russian gypsy ballad.\nThen a choir of podgy teenage girls troops out, all dressed in sky-blue party frocks, like something out of the 1950s.\nThe mostly elderly spectators, sitting in their raincoats on wooden chairs, listen attentively.\nIt is a fitting mid-afternoon concert to find in Oryol, a Russian provincial town which prides itself on its cultural heritage, and its links to an extraordinary number of Russian authors.\nIvan Turgenev, the 19th-Century Russian novelist of elegant love stories, came from here. So did Ivan Bunin, who won the Nobel Prize for Literature. So did the ingenious storyteller Nikolai Leskov, the poets Tyutchev and Fet, the short story writer Leonid Andreev…\nIt is as if one small English town had produced Jane Austen, Charles Dickens, the Bronte sisters, T S Eliot and Philip Larkin and many more.\n\"How did this one place give rise to so much literary talent?\" I asked the mayor, Sergei Stupin, who was taking me on a personal tour in his car, to show me all the writers' statues.\n\"Who knows?\" he answered obliquely. \"Something in the air, perhaps.\"\nThe director of the Turgenev Museum, an enthusiastic bibliophile called Vera Yefremova, was clearer. \"We are in the very middle of Russia,\" she said. \"And in tsarist times Oryol was at the heart of a huge guberniya, or province, which covered a large area and included many estates.\n\"We like to call this the third literary capital of Russia, after Moscow and St Petersburg. Last year we had 65,000 visitors. But it could be so much more,\" she added wistfully.\nLike everywhere else in provincial Russia, Oryol is looking to Moscow to furnish more federal funding for upcoming anniversaries. \"To rebrand ourselves,\" says the mayor, a former marketing man.\nBut there's a long way to go before Oryol becomes a mecca for tourism. It feels trapped in time.\nWhen I arrived by train from Moscow I was struck by how reminiscent it was of the Soviet towns I had known as a student.\nBut most people I spoke to told me a Stalin statue was a good idea: yes there had been repressions during Stalin's years, but what he had done during the war should never be forgotten. \"And anyway Russia always needs a harsh leader,\" said one of the leading campaigners. \"A firm hand at the top, like Stalin or Putin.\"\nMeanwhile the mayor, though he is allied to the Communists politically, says he's against it.\n\"A statue to Stalin would be too divisive in these difficult times,\" he told me. Possibly toeing the official line from Moscow, was what I thought.\nSo is this the old story of the Russian provinces - caught in a time-warp through lack of investment and opportunity?\nPossibly Oryol's problem is at heart economic - the loss of factory jobs, with nothing to fill the gap. Hence the protest vote for the Communists, whose rule has not helped, given their lack of interest in helping private enterprise to create local wealth.\nSo everyone is beholden to the authorities. Everyone watches their back.\nBelow the radar, however, there were some whispered criticisms of President Putin. But only in private. One man even followed me down the street afterwards, scared in case I didn't understand that I shouldn't use his name.\nAnd now Russia is in economic difficulties, and for these provincial towns life has just got much worse.\nMy guess is that people here will keep their heads down - unless the crisis becomes so deep that they have nothing to lose by speaking out.", "url": "https://www.bbc.com/news/world-europe-32349312"}