{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 03:51:34", "date_modify": "2025-04-26 03:51:34", "date_publish": "2025-03-05 11:46:18", "description": "Ofsted found staff form good relationships with the children and help create positive experiences.", "filename": "news_articles_cp9y0e99nv0o_1745639494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2633/live/0b180dd0-f9b4-11ef-b257-2b725ccbdd87.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp9y0e99nv0o_1745639494.html", "title": "'Homely' children's service in Wolverhampton praised by Ofsted", "title_page": "'Homely' children's service in Wolverhampton praised by Ofsted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A service that provides short breaks for children and young people with emotional and behavioural difficulties has been judged to be good by Ofsted inspectors.\nUpper Pendeford Farm in Wolverhampton helps up to six children learn how to cook and use public transport, as well as taking them on trips, the city council said.\nOfsted found staff were committed to children having the best educational outcomes, form good relationships with them, and create positive experiences.\nCouncillor Jacqui Coogan, cabinet member for children, young people and education, welcomed the \"positive\" report which demonstrated the good quality service.\nSocial care inspector Chanel Bryant visited Upper Pendeford Farm earlier this year and found it to be \"warmly decorated and homely\", the council said.\nStaff have a good understanding of children's health needs, which ensured they were well met and spoke highly of the support they received from managers.\nChildren were helped with how to keep themselves safe and develop their independence skills, and parents had praised staff for helping their development, the council added.\nOfsted concluded that the overall experiences and progress of children and young people, how well children and young people were helped and protected and the effectiveness of leaders and managers were all good.\n\"Upper Pendeford Farm offers a home away from home for children and young people who may have experienced childhood adversity that has led to emotional and behavioural difficulties,\" Ms Coogan said.\n\"I am pleased that, not only Ofsted but also the children and young people and their families, speak so highly of the important support it provides.\"", "url": "https://www.bbc.co.uk/news/articles/cp9y0e99nv0o"}