{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:24", "date_modify": "2025-04-26 03:51:24", "date_publish": "2025-03-05 11:57:29", "description": "Russell Findlay will propose giving pupils a \"fast track\" to an apprenticeship or college place instead.", "filename": "news_articles_c4g08de49mzo_1745639484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6555/live/b0994e70-f9a2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g08de49mzo_1745639484.html", "title": "Scottish Tories propose 14 years old for school leaving age", "title_page": "Scottish Tories propose 14 years old for school leaving age - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The school leaving age could be lowered to 14 in Scotland to \"transform opportunities\" for young people, the Scottish Conservatives have suggested.\nIn a speech in Edinburgh later, party leader Russell Findlay will propose giving pupils a \"fast track\" to an apprenticeship or college place instead.\nScotland's education secretary, Jenny Gilruth, branded the plans \"Dickensian\" and said they singled out working class children.\nThe school leaving age is 16 across the UK, but the Tories suggest the Scottish Parliament could use its powers to lower it.\nThe party says the apprenticeship proposal fits within UK employment law, but would require new legislation to set out how it would work.\nFindlay says it would grow Scotland's economy by developing a stronger workforce, reducing skills gaps and encouraging more investment.\nIn a speech to a think thank, he is expected to say: \"Too many young people become trapped in a system that isn't working for them.\n\"Even worse, far too many exit from it altogether\n\"This is not about writing off these young people. It is the very opposite of that.\"\nFindlay says his party wants to give young people the opportunity to continue in a form of \"hybrid education that is better suited to their talents\".\nJenny Gilruth accused the Tories of wanting to \"leave academic pursuits to the upper and middle class\".\nThe education secretary said: \"These reckless plans were proposed in 2011 and were soundly rejected by the Scottish people.\n\"The Tories should say what they mean - they want to see working class children leave school at 14 and leave academic pursuits to the middle and upper class.\n\"That is not an approach this government will agree with.\"\nDetails of how the apprenticeship proposal would work are not clear.\nUnder current laws under-16s can only work part-time, cannot work on industrial sites and cannot work during school hours.\nEducation association School Leaders Scotland described the plan as an \"interesting contribution to the debate\" on pupil pathways.\nA spokesperson said: \"We would definitely encourage young people to stay on in education beyond 16.\n\"It is important that all young people are helped and supported on their own individual learning pathway.\"\nRussell Findlay has described this proposal as a \"bold idea\", and it's certainly one that's grabbing headlines. With an election looming next year, the Scottish Conservatives are keen to differentiate themselves from the rest of Holyrood's parties.\nEye-catching policies that get people talking are one way to do this. But as is often the case with such plans, dig in to the detail, and things might not be quite so straightforward.\nFor example, it's not clear how the Tories' proposal to offer apprenticeships to those under-16 would fit in with current UK employment rules for children.\nThe party has indicated such details could be worked out further down the line, and admits legislation would be required. They suggest this is the beginning of a broader conversation about education reform.\nBut you only have to look at Rishi Sunak's 2024 general election pledge to bring back national service - described by some as \"unworkable\" and a \"gimmick\" - to see the potential pitfalls of presenting such policies to voters without doing your homework first.", "url": "https://www.bbc.co.uk/news/articles/c4g08de49mzo"}