{"authors": ["Shannen Headley", "Alexander Brock", "www.facebook.com"], "date_download": "2025-04-26 07:36:01", "date_modify": "2025-04-26 07:36:01", "date_publish": "2025-02-27 14:57:30", "description": "A committee finds councillor Saqib Khan \"failed to treat\" councillor Shabina Bano with \"respect\".", "filename": "news_articles_c20ddr8x646o_1745652961.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5600/live/1fc84d70-f50f-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20ddr8x646o_1745652961.html", "title": "Labour councillor disrespected ward colleague", "title_page": "Birmingham Labour councillor disrespected ward colleague - panel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Birmingham Labour councillor has been found to have disrespected a fellow ward councillor who raised concerns about his behaviour.\nLiberal Democrat councillor Shabina Bano reported several of her interactions with councillor Saqib Khan to Birmingham City Council.\nA standards committee meeting found he had breached the authority's code of conduct with a \"pattern of behaviour which failed to treat councillor Bano with respect\".\nSanctions for Khan, who denied the claims, are due to be considered and confirmed at a later stage.\nThe standards committee sub-group heard evidence from Bano on Wednesday relating to incidents in 2022.\nBano, who represents the Small Heath ward, left Labour and joined the Liberal Democrats last year following a dispute with her former party.\nDuring one incident, Khan was reported to have said there were going to be big changes at the council, which Bano claimed was directed at her to make her uncomfortable.\nCommittee chair Steve Jonas also mentioned a moment during which Khan allegedly told Bano she would be rewarded if she voted a certain way.\nKhan denied her allegations, adding the comment about changes at the council was light-hearted and not directed at her.\nBut, Bano was left tearful when the chair said they found her \"credible\" and Khan \"not credible\".\nResponding to the outcome, she said: \"Everyone in the party knows how I've been treated and to this day, many of my former Labour colleagues have quietly offered support and sympathy.\"\nShe added: \"Even though this has been difficult, I didn't give up, because this was always about something much bigger than me.\n\"I know that there are other women being treated this way in the party, and if no one stands up to it, then it will continue to happen.\"\nThe councillor added she felt she \"had to leave\" Labour to \"get my voice heard\".\nLib Dem group leader Roger Harmer said the outcome highlighted \"dysfunction\" and \"deep divides\" within the Birmingham Labour group.", "url": "https://www.bbc.co.uk/news/articles/c20ddr8x646o"}