{"authors": ["Ewan Gawne", "www.facebook.com"], "date_download": "2025-04-26 06:38:16", "date_modify": "2025-04-26 06:38:16", "date_publish": "2025-02-26 06:19:35", "description": "Fabrice Kapena drove his victim to a quiet area before subjecting her to a \"vicious\" sexual attack.", "filename": "news_articles_cgm1y8y0j92o_1745649496.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8b4e/live/dd4e8170-f38e-11ef-b176-3b0103bf5e53.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1y8y0j92o_1745649496.html", "title": "Manchester rapist jailed for 'disgusting' car attack on woman", "title_page": "Manchester rapist jailed for 'disgusting' car attack on woman - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rapist who \"viciously\" attacked a woman in his car after picking her up on a night out has been jailed for 13 years.\nFabrice Kapena, from Manchester, convinced her to get into his vehicle at a bar in Deansgate by promising to pick her friends up later and then help them get into another venue on 7 August 2022.\nInstead, the 32-year-old drove out of the city centre before what Greater Manchester Police (GMP) described as the \"horrific\" rape in which he tried to strangle the woman as she fought back.\nKapena, who was also convicted at Manchester Crown Court of robbery, theft and strangulation, was sentenced to 13 years in prison plus an extended licence period of seven years.\nWarning: This article contains distressing details about sexual assault\nThe court heard Kapena approached the woman at the bar and claimed he knew people working on the door at another venue.\nOnce she was in his car, Kapena promised to loop back to collect her friends.\nInstead, he drove to a quiet area while becoming increasingly threatening.\nThe court heard Kapena pushed himself on to the woman and grabbed her around the neck while she hit and scratched his face.\nShe eventually escaped the car and, at about 03:00 BST, managed to find help from a nearby care home, where staff called 999.\nKapena was tracked down by police and arrested at his home on Bridgelea Road.", "url": "https://www.bbc.co.uk/news/articles/cgm1y8y0j92o"}