{"authors": ["Gabriel Morris", "www.facebook.com"], "date_download": "2025-04-26 03:53:08", "date_modify": "2025-04-26 03:53:08", "date_publish": "2025-03-03 09:19:39", "description": "Nightingale Dental Surgery in Margate says it wants to treat thousands of NHS patients a year.", "filename": "news_articles_c39vx4pnw3go_1745639588.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a5a8/live/02210fd0-f809-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vx4pnw3go_1745639588.html", "title": "Margate dentists 'stymied' in attempts to get NHS contract", "title_page": "Margate dentists 'stymied' in attempts to get NHS contract - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bosses at a new dental practice in east Kent have said they are being \"stymied\" in their attempts to secure an NHS contract, despite a \"huge need\" for appointments.\nNightingale Dental Surgery in Margate believes it could see thousands of patients a year if permitted to provide NHS services.\nIt said its pleas have \"fallen on deaf ears\" and it \"cannot gain a contract for love nor money\".\nNHS Kent and Medway said it was \"in the process of evaluating expressions of interest from dental providers\".\nNightingale opened in February in Seacole Way and is run by Clare Henderson and Teresa Kelsall.\nAlthough a private practice, the pair want to provide NHS appointments too, to help meet the demand in the area.\nMs Kelsall told the Local Democracy Reporting Service (LDRS) the opportunity to bid for contracts \"rarely comes around\" and they are \"unsure when they will be able to put their case forward\".\nShe said: \"A lot of the dentists in the area are corporations and they mop up a huge amount of contracts for the actual surgeries and it's really difficult to get in there and try to push our way in.\n\"We only want a small contract, we're not asking for the world but we would like to provide NHS dentistry because I feel it's really needed.\"", "url": "https://www.bbc.co.uk/news/articles/c39vx4pnw3go"}