{"authors": ["Sam Francis", "www.facebook.com"], "date_download": "2025-04-26 03:54:47", "date_modify": "2025-04-26 03:54:47", "date_publish": "2025-03-04 17:02:18", "description": "The White House's criticism of Zelensky was \"very hard to watch,\" the former prime minister told the BBC.", "filename": "news_articles_ce30701e1eqo_1745639687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c93d/live/580643a0-f8fb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce30701e1eqo_1745639687.html", "title": "Trump's treatment of Zelensky 'wrong', says Rishi Sunak", "title_page": "Trump's treatment of Zelensky 'wrong', says Rishi Sunak - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump's treatment of Ukraine President Volodymyr Zelensky was \"wrong\", former prime minister Rishi Sunak has said.\nThe US president's criticism of Zelensky culminated in an explosive Oval Office meeting alongside JD Vance last week. It was \"very hard to watch,\" Sunak said.\n\"For him to have been treated that way was wrong,\" he added.\nThe former PM was speaking to the BBC's Political Thinking with Nick Robinson before the US announced it was pausing military aid to Ukraine, in his first major interview since his 2024 election defeat.\nSince coming to office, Trump has repeatedly criticised Zelensky.\nTrump has called him a \"dictator without elections\", claimed he was doing a \"terrible job\" and falsely suggested he was the one who started the war with Russia.\nTrump - who has long called for European members of the Nato military alliance to spend more on defence - is also attempting to cut a rapid deal to bring the Ukraine war to an end after speaking to Russian President Vladimir Putin.\nLast week, a White House meeting on a mineral deal - seen as key to continuing US support of Ukraine - erupted into argument. Trump and his Vice President, JD Vance, accused Zelensky of not being grateful enough.\nThe angry exchange meant the deal, that would give the US access to Ukraine's deposits of rare earth minerals, was left unsigned.\nSpeaking to the BBC, Sunak emphasised his close relationship with Zelensky - having visited Kyiv during his time as prime minister.\nSunak stressed he agreed with Trump that Europe needed to take more responsibility for its own defence and not rely solely on the US.\n\"We can't expect America to bear any burden for our security if we are not prepared to make those sacrifices ourselves,\" he said.\n\"What has happened over the last few weeks has been clarifying, and we have just had to be open and honest about that now.\"\nPressed on whether the UK needs to prepare for the US to pull out of military support for Europe, Sunak said: \"Of course we need to prepare to protect ourselves.\n\"That is the first job of any British prime minister.\n\"We are living in a new world that all of us are going to have to adjust to - and that was the case even before the US election.\"\nAs prime minster, Sunak committed the government to increase defence spending to 2.5% by 2030.\nThe plans were accelerated by Labour, who last week set out plans to hit the target by 2027 - funded through a cut to Overseas Development Aid.", "url": "https://www.bbc.co.uk/news/articles/ce30701e1eqo"}