{"authors": ["Zoe Applegate", "www.facebook.com"], "date_download": "2025-04-26 06:33:39", "date_modify": "2025-04-26 06:33:39", "date_publish": "2025-02-27 06:38:05", "description": "The technology has helped scientists count seals at Winterton and will support conservation efforts.", "filename": "news_articles_c0mw1yvvmw7o_1745649219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b7f7/live/f78efca0-f432-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw1yvvmw7o_1745649219.html", "title": "Seal survey technology finds thousands more animals at Winterton", "title_page": "Seal survey technology finds thousands more animals at Winterton - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new scientific study using the latest technology has counted 2,300 more seals on a stretch of beach - and could go on to help conservation efforts.\nVolunteers on the ground counted 6,200 seals along a 8km (4.9-mile) run of shoreline around Winterton-on-Sea in Norfolk.\nBut more than 8,500 seals were counted by drone cameras and the use of artificial intelligence (AI).\n\"This difference is likely due to the drone's aerial perspective,\" said Gabriella Fasoli, a scientist at Natural England, which is running a pilot project.\nSeal populations have previously been monitored through observations made on the ground and aerial surveys.\nNatural England, which advises the government on the natural environment, said this had sometimes caused problems in collecting accurate data.\nIt had proved particularly challenging in hard to reach areas.\nIn December, a specialist team sent up a drone with high-resolution cameras to capture images from 110m (360ft) above, as part of the two-year pilot.\nHowever, while the new methods - which minimise disturbance to the animals - will enhance the accuracy of assessing the UK seal population's size, Natural England say volunteers will still remain crucial in recording numbers.", "url": "https://www.bbc.co.uk/news/articles/c0mw1yvvmw7o"}