{"authors": ["Steven McKenzie & Jennifer Bowey", "www.facebook.com"], "date_download": "2025-04-26 06:34:45", "date_modify": "2025-04-26 06:34:45", "date_publish": "2025-02-27 06:23:16", "description": "Annual bills for an average band D property would be £1,527.09 if the increase is approved.", "filename": "news_articles_c4g0948yymmo_1745649285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f239/live/3bc65110-f448-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g0948yymmo_1745649285.html", "title": "Council tax rise of 7% proposed for Highland", "title_page": "Council tax rise of 7% proposed for Highland - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Highland Council has proposed raising council tax by 7%.\nAnnual bills for an average band D property would be £1,527.09 if the increase is approved by councillors at a meeting on 6 March, external.\nThe local authority said 2% of all council tax raised would be invested in schools and improving roads.\nConvener Bill Lobban said the council was proposing a three-year budget plan that would lead to financial security for the authority.\nThe proposed budget for 2025-26 is £818m.\nCouncil tax levels were frozen last year.\nUnder its plan, Highland Council has proposed a £14m package of savings.\nBut it said it would spend £2m to fund an increase in numbers of teachers.\nIt has also recommended creating a £6m fund to expand its bus services.\nEarlier this month, the local authority completed a deal to take over an Inverness-based company that provides a significant number of its school buses.\nThe local authority said buying D&E Coaches would reduce its school transport costs, and also help in its efforts to improve local bus services.\nThe council spends about £25m a year on school and public transport provision.\nAlso included in Highland's budget plan is a £500,000 fund to support community-based recycling schemes.\nCouncil leader Raymond Bremner said the proposed investment programme would create jobs and economic prosperity across the region.\nHe said keeping the council tax rise as low as possible was a priority.\n\"You can see over the last 18 years we have got a track record of keeping it as low as zero or capping it at three then four and seven (per cent),\" he told BBC Scotland News.\n\"We've tried our very best to keep the council tax as low as we possibly can.\"\nMr Bremner added: \"The cost of living in the Highlands tends to be higher than other places and it is incumbent on the council to minimise passing on costs to our Highland communities, and protecting them as much as possible.\"\nCouncil convener Bill Lobban added: \"These budget proposals underline our steadfast journey towards our objective of financial sustainability.\n\"They would also ensure Highland Council will not require to use reserves to balance its budget and therefore is taking a major step on its pathway to financial security, which will be of great reassurance to our 10,000 employees.\"\nLast year, councillors backed a plan to invest £2bn over the next 20 years to upgrade its potholed roads and build new schools.\nThe local authority said it would pay for the plan by borrowing money and using 2% of the money it collects through council tax.\nHighland has the longest road network in the UK with more than 4,200 miles (6,759km) of roads, in excess of 1,000 miles (1,609km) of footpaths and more than 2,200 bridges and culverts.\nAlmost 70 of its more than 200 schools have been rated to be in a poor condition and 74 rated as being of poor suitability.", "url": "https://www.bbc.co.uk/news/articles/c4g0948yymmo"}