{"authors": ["David Bamford & Natasha Booty", "www.facebook.com"], "date_download": "2025-04-26 06:31:21", "date_modify": "2025-04-26 06:31:21", "date_publish": "2025-02-27 09:15:38", "description": "Herds have shrunk because of drought and dry pastures, so Moroccans are urged to abstain from slaughtering sheep.", "filename": "news_articles_cevxxxmdmxeo_1745649081.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1677/live/d2d54dd0-f4e4-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevxxxmdmxeo_1745649081.html", "title": "Morocco's King Mohammed VI urges nation to avoid slaughtering sheep during Eid al-Adha", "title_page": "Morocco's King Mohammed VI urges nation to avoid slaughtering sheep during Eid al-Adha - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "King Mohammed VI has asked Moroccans to abstain from performing the Muslim rite of slaughtering sheep during Eid al-Adha this year due to a sharp drop in the country's herd.\nThe shortages are blamed on seven years of drought.\nEid al-Adha, which falls in June, commemorates the willingness of Prophet Ibrahim, or Abraham, to sacrifice his son on God's command.\nMuslims mark the event by slaughtering sheep or other animals and the meat is shared among family and donated to the poor.\nBut herds in Morocco have shrunk by 38% in a decade due to dry pastures, according to official data.\nMeat prices are rocketing, and 100,000 sheep are being imported from Australia.\nPerforming the rite \"under these difficult circumstances will cause significant harm to large segments of our people, especially those with limited income,\" King Mohammed VI said in a speech read by the minister of religious affairs on national television on Wednesday.\nHis father, Hassan II, made the same appeal back in 1966 when Morocco also suffered a long drought.\nExplaining the challenge in a recent interview, Morocco's agriculture minister, Ahmed Bouari, said \"the need to secure water for priority sectors, such as driving and industry\" meant that agriculture was the worst-hit, \"with most irrigation areas subject to strict regulations and water rationing\".\nImport tax and VAT on cattle, sheep, camels and red meat were recently lifted to help stabilise prices across Morocco.", "url": "https://www.bbc.co.uk/news/articles/cevxxxmdmxeo"}