{"authors": ["Helen Burchell", "www.facebook.com"], "date_download": "2025-04-26 06:20:55", "date_modify": "2025-04-26 06:20:55", "date_publish": "2025-03-01 06:20:51", "description": "Dr Ally Louks reflects on dealing with online hate after posting about her thesis on smells.", "filename": "news_articles_cjryy5dprn9o_1745648455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/124d/live/d5c5a340-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjryy5dprn9o_1745648455.html", "title": "Cambridge Uni academic reflects on her social media storm", "title_page": "Cambridge Uni academic reflects on her social media storm - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some people seek fame or infamy on social media, while others find themselves embroiled in a storm of unsolicited and often vitriolic comments. This happened to a Cambridge University academic - but how has being in the spotlight affected her?\nA photo of Dr Ally Louks and her completed PhD thesis, posted to X, external in November 2024, attracted viral fame when it was viewed more than 120 million times - and the numbers have risen steadily since then.\nAmong the congratulations and interest in her subject - \"the politics of smell\" - were many disturbing comments, mysogynistic, accusatory and personally threatening.\nReflecting on the experience three months on, she says: \"This has undoubtedly changed my life... and while I would not wish this on anyone, it has given me a platform to speak positively about academia and research.\"\nHer subject - \"Olfactory Ethics: The politics of smell in modern and contemporary prose\" - explored \"why certain writers of the past century use the language associated with smell to characterise harmful attitudes towards objects of disgust and desire\".\n\"I draw on the well-documented history of olfactory prejudice in order to examine its contemporary relevance,\" she says.\nFor example, her work looked at Hitler's claims about the smell of Jewish people in his book Mein Kampf, and how descriptions of the transatlantic slave trade were also used \"to legitimize racism\".\nHer seemingly innocent post attracted a number of abusive comments from people who believed women should stay out of academia and those who did not understand her work, and were \"under-informed or indeed uninformed\", as she puts it.\nThe comments included threats of rape and death.\nWithin about 36 hours of her post, the haters got on board.\n\"It was pretty all-consuming for the first week,\" she says.\n\"Replies were coming in far faster than I could read them, so I wasn't sleeping much in an attempt to keep up with the conversation.\n\"I won't pretend that it was pleasant to have people saying unkind things, but the critiques were ultimately quite baseless as they were based on the title and abstract of my thesis alone or were downright misogynistic.\n\"It never caused me to question the value or validity of my work. I tried to approach the situation with openness and intellectual curiosity, because there was some valid scepticism, and I've relished the opportunity to prove the worth of my work among the public audience that I've been gifted.\"\nDr Louks says she tried to approach the attention - both good and bad - in a positive way - and would advise anyone else to do the same.\n\"The positive comments I received significantly outweighed the negatives, but the negative ones were liked and shared which boosted them to the top of my feed.\n\"I refused to engage with anyone who was aggressive or insulting but I did respond to some people who were sceptical or just didn't understand my work. I was perfectly happy to prove the validity of it.\n\"I don't engage so there's no point in the negative posters carrying on.\n\"My story shows that it's possible to remain both open to criticism and respectful of others online whilst also defending what matters, which is the value and validity of research in the humanities and the legitimacy of women's role in academia.\"\n\"Initially I was very shaken up when the hateful comments starting coming in,\" she says.\n\"I'm an introvert and I never asked for this - and while some people say they are even jealous of this social media 'fame', I wouldn't wish this on anyone.\n\"But it has given me a platform to talk about the importance of academia so for me, personally, it's undoubtedly been a good thing.\"\nDr Louks now has been assigned both a British and American literary agent.\n\"It doesn't go over my head that the reason that I have all of these opportunities is because people responded to my work with such scepticism initially,\" she previously told the BBC.\nFor someone who used to shy away from social media, she admits that \"all of the things I post get a lot of attention now because I have gained a large following.\n\"But the attention has been overwhelmingly positive since that initial post.\n\"I do think very carefully about what I say online now, and as a generally offline person, it has been a real learning experience, but I think you typically can't go too wrong if you remain open to feedback and approach discussions with generosity and a willingness to listen.\"", "url": "https://www.bbc.co.uk/news/articles/cjryy5dprn9o"}