{"authors": ["Andrew Thomson", "www.facebook.com"], "date_download": "2025-04-26 04:26:44", "date_modify": "2025-04-26 04:26:44", "date_publish": "2025-03-03 11:30:13", "description": "The bird of prey will make regular flights as part of efforts to avoid gulls becoming a nuisance.", "filename": "news_articles_cly23z2y5w1o_1745641604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/90a1/live/5d11b290-f814-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly23z2y5w1o_1745641604.html", "title": "Bird of prey swoops into Inverness to scare gulls", "title_page": "Bird of prey swoops into Inverness to scare gulls - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bird of prey will be patrolling the skies above Inverness over the coming weeks to try to scare away gulls.\nInverness Business Improvement District (Bid) has arranged for Angel, a four-year-old gyrfalcon, to fly over the city centre three times a week until April.\nThe flights will then increase to six per week as peak nesting season approaches.\nAngel, who is owned by Allan MacKinnon of Highland Bird Control Services, began work on Saturday and has already covered 14 miles on her patrols.\nInverness Bid said gulls regarded falcons as a natural predator and could be scared off by their presence alone.\nThey are perceived as a threat and cause the gulls to seek a safer location.\nThe organisation said Mr MacKinnon used a lure and calls to guide Angel on her flights.\nIt added: \"She soars above the gulls and yesterday she covered 14 miles.\n\"After her flights, she is given a treat of quail from Allan which helps her identify to return to him.\n\"We look forward to sharing updates on Angel's adventures over the coming weeks.\"\nA similar scheme was used in Dumfries more than a decade ago and found it affected gull behaviour but that the impact reduced over time and was better when used in conjunction with other methods.", "url": "https://www.bbc.co.uk/news/articles/cly23z2y5w1o"}