{"authors": ["Joe McFadden", "www.facebook.com"], "date_download": "2025-04-26 06:47:16", "date_modify": "2025-04-26 06:47:16", "date_publish": "2025-03-01 12:27:49", "description": "Shockat Adam and Iqbal Mohamed, who were elected in 2024, say they want to participate in the parliamentary system.", "filename": "news_articles_cn7vv72vme5o_1745650036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50d1/live/aefd70e0-f601-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vv72vme5o_1745650036.html", "title": "Independent MPs call for change to Parliament's committee rules", "title_page": "Independent MPs call for change to Parliament's committee rules - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two independent MPs are calling for changes to the way seats on parliamentary committees are allocated, saying the current system is \"undemocratic\".\nShockat Adam and Iqbal Mohamed, who were elected in 2024 as independent MPs, want to sit on select committees, which can question ministers; or bill committees, which scrutinise legislation in detail.\nSpeaking to BBC News, Mohamed said the call was about having equal opportunity to contribute and being a \"good parliamentarian\".\nTheir comments followed a Procedure Committee hearing earlier this week where MPs heard about their experiences as independent members.\nDuring the hearing both Adam and Mohamed said the lack of committee membership opportunities impacted their ability to fully represent constituents.\nAdam, who represents Leicester South, said it felt as though independent MPs were \"not able to contribute\" with their expertise to committees.\n\"We're still as elected as any other individual from any political party, we hold the same mandate.\n\"That is one area that we miss out and I feel that my constituents miss out on,\" he said.\nSpeaking to BBC News following the hearing, Mohamed, who represents Dewsbury and Batley in West Yorkshire, said his desire to sit on a select committee was about equal opportunity.\n\"It's being a good citizen, a good parliamentarian and having that opportunity to contribute in the same way as other MPs.\n\"It does come across as slightly undemocratic, but the aim isn't to be the same or replace or kick out other people; it's just having that same opportunity to contribute to the governance of our country,\" he said.\nUnder current parliamentary rules independent MPs are not automatically entitled to membership on select or bill committees.\nFor select committees, political parties control the process and allocate seats in proportion to the size of each party's parliamentary intake.\nThis means that the Labour Party gets the largest share of select committee seats, then the Conservatives, followed by the Liberal Democrats and so on.\nHowever, parties are able to voluntarily give up a seat for an independent MP or an MP from a different party, such as when the Green party's Caroline Lucas was given a spot on the Environmental Audit Committee from 2015 to 2024.\nAll MPs can ask questions in the Commons chamber and participate in debates there and in Westminster Hall, as well as submitting written questions to ministers, external.\nMohamed said his background in science and engineering was one thing he could bring to a select or bill committee.\nHe also mentioned the \"wide breadth of experience\" independent MPs have across their alliance, as well as their interest in foreign affairs - several won their seats on pro-Gaza platforms.\n\"We're at a point in history where the public have lost faith in politics and politicians - and I'm including myself in that group because I'm part of that elected group now. And anything we can do to rebuild that trust and to demonstrate fairness, impartiality, transparency, balance...I think it's only a good thing,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cn7vv72vme5o"}