{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:57:35", "date_modify": "2025-04-26 03:57:35", "date_publish": "2025-03-04 13:48:04", "description": "Drug smuggler Kristopher Purvis declared he was only bringing Mexican hats through Edinburgh Airport.", "filename": "news_articles_cpq2n7x5g57o_1745639855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/de29/live/a267ee00-f8f9-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq2n7x5g57o_1745639855.html", "title": "Edinburgh Airport sombreros souvenir passenger hid £5m cocaine haul", "title_page": "Edinburgh Airport sombreros souvenir passenger hid £5m cocaine haul - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who tried to smuggle cocaine worth more than £5m into Scotland from Mexico told staff he had only brought sombreros back from his trip.\nKristopher Purvis, 35, was stopped by a Border Force officer in the Nothing to Declare channel at Edinburgh Airport on 24 July 2024.\nThe High Court in Edinburgh heard 45kg (99lb) of cocaine had been concealed in two suitcases carried by Purvis and his travelling companion.\nPurvis admitted two charges related to drug smuggling.\nThe court heard Purvis and his friend each had a suitcase and he was carrying a plastic bag containing four traditional Mexican sombrero souvenir hats.\nAdvocate depute Brian Gill KC told the High Court in Edinburgh: \"The accused told the officer that they had come from Mexico, where they had been since June 30 2024.\"\nThe prosecutor told the court Purvis told the officer the \"only thing that he had acquired in Mexico was the sombreros\".\nHowever, when his suitcase was searched eight vacuum-sealed plastic packages containing cocaine were discovered.\nA further seven packages were found in the other suitcase.\nThe court heard Purvis was cautioned and replied: \"It's all mine, my mate had nothing to do with it. I put it in his case.\"\nThe 15 packages were each found to contain about 3kg (6.6lb) of 52% pure cocaine.\nThe court heard the maximum street value of the drugs was about £5,640,000.\nPurvis, formerly of Murton, County Durham, was found to have flown from Mexico City airport to Edinburgh via a stopover at Paris Charles de Gaulle airport.\nHe admitted being concerned in the supply of cocaine and the fraudulent evasion of the ban on importing controlled drugs.\nDefence solicitor advocate Ewen Roy said that as Purvis was a first offender a background report would be required ahead of sentencing.\nThe judge, Lord Summers, deferred sentence on Purvis, who followed the proceedings via a TV link to Edinburgh prison, for the preparation of the report.", "url": "https://www.bbc.co.uk/news/articles/cpq2n7x5g57o"}