{"authors": ["Isaac Ashe", "www.facebook.com"], "date_download": "2025-04-26 06:18:39", "date_modify": "2025-04-26 06:18:39", "date_publish": "2025-03-01 07:23:03", "description": "Officers are taking illegal e-bikes and scooters without warning, said Leicestershire Police.", "filename": "news_articles_c204k7wv2l0o_1745648319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c457/live/dc48aa20-f452-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c204k7wv2l0o_1745648319.html", "title": "Scooters and illegal e-bikes seized in Leicester day of action", "title_page": "Scooters and illegal e-bikes seized in Leicester day of action - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A crackdown on illegal vehicles in Leicester city centre is making \"a real difference\", according to mayor Sir Peter Soulsby.\nA day of enforcement was carried out on Wednesday by Leicestershire Police and resulted in nine e-scooters and 12 illegal e-bikes being seized.\nThe action is part of the force's ongoing Operation Pedalfast which has seized a total of 64 illegal vehicles which should not be driven on public land since January.\nSoulsby said Leicester City Council \"welcomes\" the action and is working to support the enforcement.\nNeighbourhood policing commander for Leicester city centre Insp Ryan Ludlam said the need for the operation showed \"the extent of the problem\" and that the force was seizing unlawful vehicles \"without warning\".\nSoulsby said: \"I very much welcome this initiative and am grateful to Leicestershire Police for the work they are doing to tackle the use of illegal e-bikes and scooters in the city centre.\n\"Three operations to seize illegal vehicles have taken place in the last month or so, and they have already made a real difference to the city centre.\"\nA four week consultation into wider issues of anti-social behaviour in the city centre finished on Monday 17 February.\nThis came after Soulsby had sworn to use \"all the tools at his disposal\" to deal with an increase in issues including street drinking, begging and \"irresponsible\" vehicles.\nOne proposal to tackle the issues is a new Public Spaces Protection Order (PSPO) which would grant greater powers to the police and council, including fines of £100 against those causing a nuisance, or up to £1,000 if prosecuted.", "url": "https://www.bbc.co.uk/news/articles/c204k7wv2l0o"}