{"authors": ["Laura Gozzi", "www.facebook.com"], "date_download": "2025-04-26 06:14:43", "date_modify": "2025-04-26 06:14:43", "date_publish": "2025-03-02 00:16:19", "description": "Former surgeon Joël Le Scouarnec is accused of abusing hundreds of patients, most of them children, including Mauricette Vinet's grandson", "filename": "news_articles_ce34v17dw53o_1745648083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a380/live/9fa654a0-f696-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce34v17dw53o_1745648083.html", "title": "His name was in a child abuse diary - now his family listen to 'vile' testimony", "title_page": "Joël Le Scouarnec trial: His name was in a child abuse diary - now his family listen to 'vile' testimony - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "This story contains distressing details from the start\nWhen Mauricette Vinet speaks of her grandson, her voice grows warm with affection.\n\"He was a lovely little boy. He had a strong personality, for sure! But he always thought of others, always asked if he could help,\" says the French retiree, in her 80s.\n\"He loved to be out in the garden with his grandfather, picking green beans. He was a charming boy, Mathis,\" she adds.\n\"But, as you know, there was a 'before' - and there was an 'after'.\"\nMauricette and her husband Roland are among the 267 plaintiffs who have pressed charges against Joël Le Scouarnec, the French former surgeon who is accused of abusing almost 300 people - mostly children, and almost all his patients - over the course of several decades. The trial started in Vannes, Brittany, on Monday.\nLe Scouarnec and Mathis only crossed paths once, when Mathis, aged 10, was hospitalised overnight at the clinic in the small French north-western town of Quimperlé. Le Scouarnec - a mild-mannered, respected gastrointestinal surgeon - told Mathis' parents the boy had to be kept overnight for checks.\nIt turned out Mathis only had a stomach ache, and he was sent home the next day. But Mauricette is convinced the brief hospital stay changed Mathis forever.\n\"The unease set in, little by little. It happened gradually in the first year; then he stopped being happy and became aggressive with everyone,\" she tells the BBC.\nThere is no way to establish conclusively whether Mathis' troubles were linked to the surgeon. What is certain is that in his teenage years Mathis distanced himself from his family and started using increasingly hard drugs; later, he spent time in detox and rehab centres.\nThen, in 2018, police knocked on his door.\nThey told him a man named Joël Le Scouarnec had been arrested the year before for raping his six-year-old neighbour. During a search of the surgeon's home, police uncovered stacks of diaries and hard disks in which Le Scouarnec appeared to list hundreds more victims. Mathis' name was among them.\nMauricette said Mathis told her police then read out an excerpt of the diary to him, which seemed to detail abuse Le Scouarnec's inflicted on him during his hospital stay.\n\"Then they left. Mathis shut the door and was left on his own, with no help. And that was the beginning of a descent into hell,\" Mauricette says.\nThe police visit helped Mathis make sense of flashbacks that had long plagued him, Mauricette says: \"His malaise finally made sense; he traced it to the source.\"\nMathis pressed charges against Le Scouarnec, but the revelations sent him down a spiral which came to an abrupt end on 14 April 2021, when Mathis overdosed and died. He was 24.\nMauricette and her husband pressed charges the very next day, and they are now listed as \"indirect victims\" of Le Scouarnec. They have attended court in Vannes, north-western France, every day since the trial opened on Monday.\nIt has not been an easy listen.\nThe testimony of witnesses - mostly close relatives of Le Scouarnec, now 74 – painted a picture of an apparently ordinary middle-class family which, behind the scenes, has been ravaged by child abuse, incest and sexual violence.\nAnnie, Le Scouarnec's sister, said she had been \"taught to keep quiet\".\nThis week, it was all brought out in the open.\nAll three sons of Le Scouarnec struck an almost apologetic tone as they told the court about their happy childhoods with a cultured, intellectual father who may not have been particularly present but who was kind, patient and supportive.\n\"We had holidays, nice houses - everything that constitutes a normal family,\" said one.\nThe youngest son – who said he stopped contact with Le Scouarnec in 2017 \"to preserve the image of him I have from my childhood\" – said he now \"looked upon everyone with distrust\" and never left his own toddler alone with anybody.\n\"I am always worried that if my father could do this then my neighbour could, my partner, anyone,\" the 37-year-old said.\nLater the middle son – a tall man in his early 40s who admitted he was a \"not totally abstinent alcoholic\" – shared his memories of being abused at the hands of his paternal grandfather, Le Scouarnec's father.\nHe was shocked as he was told for the first time in court that among his father's alleged victims were some of his childhood friends.\nAnd, on Friday, a stunned silence descended upon the courtroom as Le Scouarnec admitted he had abused his granddaughter - his eldest son's daughter when she was under five years old. Moments after the revelation, the 44-year-old and his partner left the room to be assisted by a psychologist.\nOther witnesses sparked consternation in the plaintiffs. Due to their sheer number, they sit in a separate room – a former university lecture hall – and follow proceedings via video link.\nChristian D., a friend of Le Scouarnec now aged 80, often answered questions from the court sarcastically and repeatedly minimised the events at the centre of the trial, declaring that he could not \"afford to cry over everything that happened in the world\".\nLater, he insisted that he \"never saw anything, therefore had nothing to say\" about the devastating allegations against his friend. When he stated that he would take in Le Scouarnec if he was ever to leave jail, many alleged victims in the lecture hall got up and left their seats.\nBut most difficult for Mauricette and Roland was the much-awaited testimony of Marie-France L., Le Scouarnec's ex-wife.\nIt has been alleged that she was at the centre of the omerta that reigned in the Le Scouarnec family, as she was repeatedly made aware of her husband's obsession with children but did nothing to stop it.\nMany lawyers and plaintiffs now believe she could have spared hundreds of children from being abused. Le Scouarnec's brother - who was also heard this week - openly wondered whether she had been too enamoured by the lifestyle provided by her husband's salary to speak out.\nMarie-France has always denied this and, at the stand, was frequently defiant in the face of the accusations levelled at her.\n\"Catastrophe has struck: she knows I am a paedophile,\" Le Scouarnec wrote as early as the mid-1990s in his diary. \"Perhaps he was talking about his conscience,\" Marie-France told the court.\nShe also suggested her five-year-old niece – who Le Scouarnec has been convicted of raping – had most likely \"manipulated\" her husband.\n\"She's devious, that one. She loves the attention,\" she said. Later, she complained that she was being \"blamed\" for everything. Only when she was shown an indecent photo montage Le Scouarnec made of their son as a child did she look visibly shocked.\n\"That was absolute theatre,\" Mauricette told the BBC, adding that Christian D.'s testimony had been \"vile\" and that she thought Marie-France was living in \"pure denial\".\nAs the gut-wrenching events played out, Le Scouarnec sat in his box – mostly reactionless, but at times noticeably agitated, his voice cracking as he asked his sons for forgiveness. He flinched when excerpts of his diary were read out, and averted his eyes as indecent photographs he took of his nieces were shown.\nHis lawyers have said he admits to the \"majority\" of the charges against him, and that he will explain himself over the course of the trial, which is due to last until June.\nThe alleged victims will take the stand from next week; Mauricette and Roland will do so in April. \"I will look at Le Scouarnec and tell him what is deep in my heart - he killed my grandson,\" Mauricette says.\n\"Not with a gun, but he killed him,\" she adds. \"He's going to get 20 years, but his victims... will have to live with this their whole lives.\n\"Their sentences will be longer than his.\"\nThroughout the week, over in the victims' hall, people came and went, but the majority stayed for hours on end each day.\nAs descriptions of trauma and abuse poured in, one middle-aged woman covered her face with her hand and kept it there a long time.\nNext to her, a young man rubbed his eyes repeatedly, then stood up and left.", "url": "https://www.bbc.co.uk/news/articles/ce34v17dw53o"}