{"authors": ["Hannah Stacey", "Victoria Gould", "www.facebook.com"], "date_download": "2025-04-26 03:45:59", "date_modify": "2025-04-26 03:45:59", "date_publish": "2025-03-05 06:08:17", "description": "On St Piran's Day, we meet some of the people who have decided to make Cornwall their home.", "filename": "news_articles_c8rkj8zj5ejo_1745639159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8908/live/0ff80cd0-f755-11ef-b0ec-f990ca2ebe14.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkj8zj5ejo_1745639159.html", "title": "St Piran's Day: Why I made Cornwall my home", "title_page": "St Piran's Day: Why I made Cornwall my home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People all over the world are celebrating their links to Cornwall for St Piran's Day, marking the feast day of the patron saint of tin miners.\nThe Cornish have a long history of taking their culture around the globe, and in turn many people from other places have chosen to set up their lives in Cornwall.\nThe BBC has been speaking to some of them about why they have chosen to make Cornwall their home.\n\"Cornwall chose us, our family, not the other way around,\" says Karina Busquets, a fibre artist from Brazil.\nNow living near Truro with her family, she said they came to the country six years ago.\nOne of her favourite memories created just after the family arrived in Cornwall was a trip to the beach on a fine May day.\n\"We went in a thoroughly Brazilian mindset, we went to the beach just with bikinis and flip-flops, without jumpers, without anything,\" she recalled.\n\"It was beautiful so we ran to the water, went for a dip and it was so cold we could only manage to stay for five minutes… That was our first experience!\"\nThe 48-year-old said the family had experienced both amazing and tough moments and it was hard to be so far away from family.\n\"Sometimes it can be very lonely because there's only our family, only the four of us.\n\"Our whole family, our parents, are still living in Brazil so there is this mixed feeling sometimes to how to be far away, but also to enjoy what Cornwall has to offer.\"\nBobby Inman, originally from Tennessee, US, has lived in England for 21 years and now resides on a boat moored in Falmouth.\nKnown by many as Tennessee Bob, the 49-year-old said he had found his place in Cornwall.\n\"I absolutely love Cornwall, I feel I have found my place, more so than I ever really have in this country,\" he said.\n\"I'm lucky enough, I get to host the sea shanty festival, I get to do history tours in Falmouth.\n\"I meet so many great people and I met my wife.\n\"Cornwall has become my home in so many different ways.\"\nBobby also loves the Cornish landscape.\n\"I'm from a place that's rolling hills and lots of agriculture and small towns and so this reminded me a lot of Tennessee and where I'm from,\" he said.\n\"My absolute favourite thing about Cornwall is the landscape - the beauty, the innate beauty, whether it's wildlife or the coast or the rocky tors, it's just beautiful.\"\nAdam Kesacoff said Cornwall became his home 15 years ago after he \"fell in love with a beautiful girl\".\nOriginally from Perth in Australia, the 41-year-old lives in Falmouth with his family and runs a BBQ catering company in Frogpool.\nHe said his experience of moving countries had involved \"highs and lows\".\n\"Living in Australia, things seemed expensive but you earned a lot,\" Adam said.\n\"Living here I find that everything is really expensive, even though the numbers may be less.\n\"But there is so much beauty, so much ease. We walk our kids to school, my gym's around the corner, there's a castle outside my window.\n\"If the weather is not good on this coast we just pop over to Newquay or St Agnes and it's absolutely beautiful.\n\"Living here is absolutely magical.\"\nLily, who moved with her family to Redruth from the London borough of Croydon six years ago, said it was \"incredible to live here\".\nThe 15-year-old said they made Cornwall their home as \"my family thought it was a safer place to live\".\n\"The atmosphere itself with people walking past saying \"hello, how are you, good morning\", it was so different,\" she said.\n\"Living in Cornwall has been a complete shift in atmosphere, it's my favourite thing about it, how kind everyone is.\"\nAlthough Lily loves the lifestyle and the food in Cornwall, she still feels the pull to the capital.\n\"I miss my family so much because pretty much all of my family live in London so when we go… to visit it just reminds me how much I do miss them.\"\nThe scenery is one of her favourite things about life in the far south west.\n\"There's something about the beaches, the fresh air,\" she said.\n\"The sea is always freezing cold but it's amazing.\n\"I love the atmosphere, the dogs running around, the families playing games together.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkj8zj5ejo"}