{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:01:07", "date_modify": "2025-04-26 08:01:07", "date_publish": "2025-02-25 10:44:23", "description": "The boy was riding his bicycle when he was attacked and taken to hospital on Monday evening.", "filename": "news_articles_c17qedrzyylo_1745654467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5cc5/live/13c0b410-f364-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qedrzyylo_1745654467.html", "title": "Boy, 15, hurt in stab attack near leisure centre", "title_page": "Crosby: Boy, 15, hurt in stab attack near leisure centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 15-year-old boy was stabbed while riding an e-bike near a leisure centre on Merseyside.\nHe suffered injuries to his leg, buttock, arm and chest and was taken to hospital following the attack in Crosby, Sefton, just after 18:00 GMT on Monday.\nHe was riding close to Crosby Leisure Centre on Mariners Road when he was set upon by two males who were also on e-bikes, Merseyside Police said.\nTwo men, aged 21 and 44, from Seaforth, have been arrested in connection with the incident.\nThe victim's bike was collected by unknown people before the arrival of police, the force continued.\nOfficers later spotted a Sur-Ron bike being pushed into a property in Seaforth. They entered the building and seized two bikes and some cannabis.\nThe 21-year-old suspect was held on suspicion of causing grievous bodily harm with intent, possession with intent to supply cannabis, two offences of theft of a motor vehicle and assisting an offender.\nThe 44-year-old man was arrested on suspicion of possession with intent to supply cannabis, assisting an offender and possessing criminal property.\nDet Insp Edward Barr urged anyone with information to contact the force.\n\"The area around Crosby baths will have been busy around 6pm and I would urge anyone who saw anything to come forward,\" he said.\n\"I would also appeal to drivers who may have dashcam footage to get in touch with us so we can find those responsible and put them before the courts.\"", "url": "https://www.bbc.co.uk/news/articles/c17qedrzyylo"}