{"authors": ["Michelle Roberts", "www.facebook.com"], "date_download": "2025-04-26 03:55:49", "date_modify": "2025-04-26 03:55:49", "date_publish": "2025-03-04 15:41:31", "description": "Packaging inside the box incorrectly states the pills are a different painkiller, aspirin.", "filename": "news_articles_cy7xn5lyxemo_1745639749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a29/live/4c55df20-f90a-11ef-b5c1-27f306935cb2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xn5lyxemo_1745639749.html", "title": "Boots recalls paracetamol over labelling error", "title_page": "Boots recalls paracetamol over labelling error - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The High Street pharmacy chain Boots is asking customers to return packs of 500-milligram paracetamol tablets because a labelling error incorrectly states they are a different painkiller, aspirin.\nMore than 110,000 packs, with the batch number 241005 and expiry date \"12/2029\" on the bottom, are affected.\nCustomers can receive a full refund without a receipt.\nBoots and the supplier, Aspar Pharmaceuticals Limited, have begun a full investigation.\nThe outer cardboard packaging is correctly labelled: \"Paracetamol 500mg Tablets\" but the inner foil blister pack of pills instead reads: \"Aspirin 300mg Dispersable Tablets\".\nThe affected packs should not be used or kept, even if the error is known, as this could lead to an incorrect dose.\nAnd anyone who has bought this product for someone else should tell them as soon as possible.\nDr Stephanie Millican, from the Medicines and Healthcare Products Regulatory Agency (MHRA), said: \"Patient safety is always our priority.\n\"It is vitally important that you check the packaging of your Boots Paracetamol 500mg Tablets 16s - and if the batch number is 241005, you should stop using the product and return it to a Boots store for a full refund.\n\"If you are unsure which pack you have purchased or have taken Boots Paracetamol 500mg Tablets and experienced any side effects, seek advice from a healthcare professional.\n\"Please report any suspected adverse reactions via the MHRA's Yellow Card scheme.\n\"If you have any questions or require further advice, please seek advice from your pharmacist or other relevant healthcare professional.\"", "url": "https://www.bbc.co.uk/news/articles/cy7xn5lyxemo"}