{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 04:18:57", "date_modify": "2025-04-26 04:18:57", "date_publish": "2025-03-04 06:22:57", "description": "Crogga Limited decided not to sign a licence extension to continue gas exploration, a minister says.", "filename": "news_articles_cg701pp0n4do_1745641137.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eda2/live/dec88d30-f842-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg701pp0n4do_1745641137.html", "title": "Gas exploration firm made call not to proceed, Manx minister says", "title_page": "Gas exploration firm made call not to proceed, Manx minister says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Manx-based firm previously issued a licence to search for gas in Manx territorial waters made the decision not to proceed further, the infrastructure minister said.\nFirst obtained in 2018, Crogga Limited's Seaward Production Innovative Licence lapsed in late February as the parties were unable to agree compensation terms.\nThe Manx-based business had been given five extensions to the agreement to allow seismic surveys of a 266 sq km (165 sq mile) section of seabed off the east coast.\nMichelle Haywood said the government had put in \"considerable\" efforts into supporting Crogga to \"help them keep their licence alive\".\nIn a statement confirming it would not sign another extension to its licence, Crogga said the parties had been unable to reach \"revised terms\" to cover arrangements around compensation for other parties \"interested in utilising the Manx seabed\".\nIt said its board had been engaged in discussions with the Department of Infrastructure over several months about an extension and variation to the licence, but it had become clear it was \"not be possible to agree workable terms\".", "url": "https://www.bbc.co.uk/news/articles/cg701pp0n4do"}