{"authors": ["Brian Farmer", "www.facebook.com"], "date_download": "2025-04-26 04:15:09", "date_modify": "2025-04-26 04:15:09", "date_publish": "2025-03-04 10:45:54", "description": "A court is told how Kyle Clifford \"planned and executed\" attacks at his ex-girlfriend's family home.", "filename": "news_articles_c4g02npjjkjo_1745640909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ff5/live/0a6008b0-f915-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g02npjjkjo_1745640909.html", "title": "Crossbow killer Kyle Clifford 'raped ex-girlfriend after rejection'", "title_page": "Crossbow killer Kyle Clifford 'raped ex-girlfriend after rejection' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Warning: This article contains details that some people may find distressing\nA triple killer raped his ex-girlfriend in a \"violent, sexual act of spite\" during an attack that saw him murder her and her sister with a crossbow and their mother with a butcher's knife, a court heard.\nKyle Clifford, 26, is alleged to have become \"angry\" when 25-year-old former partner Louise Hunt ended their 18-month relationship.\nCambridge Crown Court heard Clifford murdered Ms Hunt, her mother Carol, 61, and sister Hannah, 28, after deceiving his way into the family home in Bushey, Hertfordshire, on 9 July 2024.\nThe defendant, of Enfield, north London, admitted murder, false imprisonment and possession of offensive weapons, but denied raping Louise Hunt.\nOpening the prosecution's case, Alison Morgan KC said Clifford \"carefully planned and executed\" the attacks at the cul-de-sac property.\nShe told jurors Clifford had admitted the murders, but they were to determine if he raped Louise Hunt.\nCarol Hunt was stabbed to death, while Hannah and Louise suffered fatal injuries from a crossbow bolt.\nThe three women were the wife and daughters of BBC racing commentator John Hunt, who observed the court proceedings on Tuesday from the public gallery.\n\"During the course of this prolonged incident, the prosecution alleges that the defendant raped Louise Hunt,\" Miss Morgan said.\n\"It was a violent, sexual act of spite, before he then killed her.\"\nShe said Clifford gained access to the family home by deceiving Carol Hunt, before stabbing her to death in a \"brutal knife attack\".\nMiss Morgan said Clifford acted under the guise of dropping off items owned by Louise before stepping inside the property.\nIn a transcript read to the court, Clifford spoke with Mrs Hunt about relationships not working out and she told him: \"I don't think you're a nasty person.\"\nThe conversation was picked up by a home security system.\nAfter murdering Mrs Hunt, it was alleged he then waited inside the house for Louise, who was working in a pod in the family's garden, where she ran a dog grooming business.\nDogs were dropped off \"without anybody knowing what was going on in the property\", the court heard.\nAfter Louise came inside, he restrained, raped and then murdered her with a crossbow, jurors heard.\nMiss Morgan said Clifford claimed the forensic evidence of sex was explained by consensual sex, which had taken place on 23 June.\nShe said that argument was \"untenable\".\nDefence counsel Phil Bradley KC said jurors had to decide the central issue of whether the scientific findings could be explained by \"sexual activity on 23 June\" or by \"rape on 9 July\".\nProsecutors said Clifford killed Hannah Hunt with the crossbow when she came home after work.\nMiss Morgan said Hannah messaged her partner, telling him to call the police immediately after she was fatally injured.\nClifford checked Mr Hunt would not be home that day \"by searching online to see what racing events were taking place\", she told the court.\nLouise told one friend that Clifford had a \"nasty temper\" and he had \"behaved in an aggressive manner\" several times, the trial heard.\nMiss Morgan said a family member found Clifford \"odd\" and was concerned about how he treated her, while others \"hoped the relationship would come to an end\".\n\"Hannah Hunt had said the family found the defendant to be disrespectful, rude and arrogant,\" she added.\nClifford had also been in relationships with other women while he was dating Louise \"which he hid\" from her, the court heard.\nThe prosecutor said Louise instigated the end of the relationship, but Clifford tried to \"rekindle\" with her.\nShe said when Clifford was rejected, he set about \"planning an attack\" on the family for favouring the break-up.\nLouise had said the relationship was \"sucking the life out of me\", the court heard.\nIn a message to Clifford on 26 June, read to the jury, Louise wrote: \"I'm sorry Kyle but I feel I can't continue with what we have, I feel like it has been broken and I can't ignore how I've been feeling.\n\"I just feel right now I owe it to myself to take some space and walk away for my own sanity and health.\n\"I never want there to be anything nasty between us ever. Take care of yourself always please.\"\nMiss Morgan said Clifford appeared to accept \"this position\", but in the days that followed he became less accepting.\nJurors were told he spent £350 online buying a crossbow, six bolts and a cocking device.\nHe also purchased an air pistol, which was not delivered, and duct tape, Miss Morgan said.\nJurors saw CCTV footage that showed Clifford buying rope in a Toolstation store on 28 June, and fuel containers in Halfords on 4 July.\nClifford also researched how to source a knife before purchasing a 10-inch steel \"high level butchering knife\" for £89, Miss Morgan said.\nThe defendant's sister had messaged him on the day of the attacks asking him \"what are you playing at?\" when she realised he had taken the crossbow out with him.\nHe told her he was doing nothing \"illegal\" and he was shooting it in his friend's back garden, the jurors were told.\nFollowing the murders, he became the subject of a manhunt for a number of hours before he was found injured in Lavender Hill Cemetery, in Enfield, after shooting himself in the chest with the crossbow.\nThe jury was told he is now paralysed from the chest downwards.\nThe defendant, who has not been in court to hear the start of his trial, served in the military for about three years from 2019.\nMr Justice Bennathan has told jurors it would be \"fundamentally wrong\" to think Clifford must be guilty of \"anything else\" because he admitted murder.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/c4g02npjjkjo"}