{"authors": ["Kevin Peachey", "www.facebook.com"], "date_download": "2025-04-26 04:21:31", "date_modify": "2025-04-26 04:21:31", "date_publish": "2025-03-03 14:43:44", "description": "A looming deadline for people to plug NI gaps, to ensure they get the full state pension, has been eased.", "filename": "news_articles_c99n1550510o_1745641291.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/971f/live/b1dc3100-f829-11ef-92bb-03e8a8ae1fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99n1550510o_1745641291.html", "title": "Deadline for National Insurance top-ups softened", "title_page": "State pension: Deadline for National Insurance top-ups softened - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A looming deadline for people to plug gaps in their National Insurance record, to ensure they get the full state pension, has been softened.\nConcerns over a rush of last-minute enquiries mean anyone who requests a call back from the Department for Work and Pensions (DWP) on the issue will not be regarded as having missed the 5 April deadline.\nPeople can currently make voluntary extra contributions to plug National Insurance gaps back to 2006.\nBut, after April's deadline, this will be limited to the previous six years only.\nSome people may have spaces in their National Insurance record if, for example, they have lived abroad or taken time off for caring responsibilities.\nIn general, people need 35 years of qualifying contributions to get the full state pension.\nTop-ups have been permitted, as part of the transition to the flat-rate state pension, which was introduced in 2016.\nCurrently, these can go back for nearly 20 years, but are due to return to the normal six years after April.\nPensions experts say that extra contributions may not suit every individual in these circumstances, so it is important to check whether it is worthwhile for their finances.\nThere is complexity about when and whether to top-up, which has meant many people have called the DWP's Future Pension Centre or Pension Service to discuss their options.\nWorries about the clogged phonelines mean two earlier deadlines were extended.\nAlthough this April's deadline still stands, there will now be some leeway for anyone who struggles to get through on the phone.\nAnyone who is unable to make contact with the DWP ahead of the deadline can use an online call-back request form, external.\nPeople who submit a call-back request by the 5 April deadline will still be able to pay voluntary National Insurance Contributions back to April 2006, after the deadline has passed.\nAnyone in this position should save a screenshot of their call-back confirmation message. A return call should come within eight weeks.", "url": "https://www.bbc.co.uk/news/articles/c99n1550510o"}