{"authors": ["Tom Gerken", "www.facebook.com"], "date_download": "2025-04-26 08:01:44", "date_modify": "2025-04-26 08:01:44", "date_publish": "2025-02-26 17:20:47", "description": "It is available from March and included in a Prime subscription - or $19.99 to non-members.", "filename": "news_articles_cd654p339q3o_1745654504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e2a7/live/2fb97e40-f463-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd654p339q3o_1745654504.html", "title": "Alexa relaunched with ambition to be 'your best digital friend'", "title_page": "Alexa relaunched with ambition to be 'your best digital friend' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Amazon has unveiled Alexa+, an overhauled version of its virtual assistant with which it hopes users will share \"just about anything\".\nRapid recent advances in artificial intelligence (AI) have caused huge growth in software capable of natural-sounding conversations, with ChatGPT and DeepSeek among the most-downloaded apps worldwide.\nAmazon is attempting to tap into this, with Alexa+ telling a launch event in New York it wanted to be \"your new best friend in the digital world\".\nIt will be included for free in Prime subscriptions when it launches from March - but to non-members it will cost $19.99 (£16) per month, with the UK price yet to be announced.\nHowever experts have suggested consumers may struggle to get past their limited expectations of Amazon devices.\n\"Smart speakers are found in one in four UK homes, yet many users treat them as nothing more than expensive kitchen timers,\" said Ed Freed from marketing agency Rapp UK.\n\"Ultimately, the most logical place for a truly personal AI assistant is on your phone, not on your countertop.\"\nAmazon's head of devices and services Panos Panay said Alexa+ would remember information, meaning if you tell it you're a gluten intolerant vegan, for example, future recipes it suggested would bear this in mind.\nAnd he promised there would be \"no more Alexa speak\" - meaning users will be able to speak to it more conversationally than previously possible.\nThese are new features that Dr Richard Whittle of University of Salford's Business School explained were \"long overdue\".\n\"Amazon is hoping its upgraded Alexa will challenge Copilot, Google Assistant and Siri, all of whom use new LLM (large language model) technology,\" he said.\n\"When users can now chat naturally to their AI assistants, Alexa's once leading voice interaction seems narrow and rigid.\"\nHis colleague Dr Gordon Fletcher, associate dean of research and innovation, agreed.\n\"Technology changes more rapidly now, competing AI models get updated and everyone else scrambles to respond, Grok last week, Claude this week,\" he said.\n\"Alexa and the Echo hardware have increasingly seemed like an ageing relic, slow to shift and always behind the curve.\"\nAmazon told the BBC Alexa+ would be available in all countries which currently have Alexa.\nIn the US, it will be available from March, with other countries getting it later in 2025.\nIt will be available on devices as far back as the second generation Echo Dot, which launched in 2017.\nFor its devices with screens, it will be available as far back as the first generation Echo Show 8, which launched in 2019.\nIt is clear that Amazon expects Alexa+ to do more than its predecessor - and know much more about its users' lives.\nMara Segal, director of Alexa, said people will now be able to share \"just about anything\" with the virtual assistant - the idea being that by sharing emails and photographs, it will be able to search through them for things you request.\nOther demonstrations included using it to book a taxi and a dinner reservation at a restaurant.\nThomas Husson, principal analyst at Forrester, said the relaunch was a tacit admission by Amazon that its original vision for smart speakers had failed.\n\"By subsidising hundreds of millions of Echo connected speakers, Alexa managed to enter households in the hope of generating incremental e-commerce sales,\" he said.\n\"This strategy failed and the company invested $25 billion (£20bn) in its Alexa division, without truly revolutionizing smart homes.\"\nHe said it was \"about time\" Amazon created a \"truly smart and useful assistant\".\nBut he warned that to \"truly differentiate\" itself, Alexa would need to distinguish between personal and household data, which \"equals a big privacy and trust hurdle\".\nAnd Dr Stuart Millar, lead AI engineer at Rapid7, said the move \"makes sense\" as Alexa has \"lagged behind\" competitors such as ChatGPT - but warned the real test will be when regular people get their hands on it.\n\"We've seen big tech companies launch ambitious AI features before, only to backtrack when unexpected issues arise, or it hasn't behaved as expected,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cd654p339q3o"}