{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 04:37:43", "date_modify": "2025-04-26 04:37:43", "date_publish": "2025-02-28 11:02:25", "description": "Police investigating after incident affecting eight pupils at school in Darnall.", "filename": "news_articles_c0mwwe90gpko_1745642263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4214/live/342fb410-f5d7-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mwwe90gpko_1745642263.html", "title": "Sheffield: Children in hospital after eating cannabis sweets", "title_page": "Sheffield: Children in hospital after eating cannabis sweets - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Eight children were taken to hospital after being suspected of eating sweets laced with cannabis at a school in Sheffield.\nSouth Yorkshire Police said officers were called to Phillimore Community Primary School in Darnall shortly after noon on Tuesday.\nThe children have since been discharged and an investigation had been launched, the force confirmed on Friday.\nPhillimore Community Primary School said the pupils had now \"rejoined classes\".\nOne mother, who did not wish to be named, said she found out about the incident from her daughter who told her children had been \"collapsing and throwing up\" in class.\nShe said an official message from the school was circulated at 15:00 GMT on Friday, which she believed was prompted by the presence of journalists outside the school gates.\n\"I shouldn't have to hear that from my daughter, I should've heard that from the headteacher,\" the mother told the BBC.\n\"We should've been told beforehand, so you have that conversation ready, to speak to your kids about it; that you don't take things from other children.\"\nShe said since finding out about the incident, she was \"scared\" to send her children to school.\n\"It's scary because we think them going to school for six hours is a safe space, they are safe there, but clearly they are not,\" she said.\n\"Our children are not safe in school.\"\nShe added: \"If they had taken anything at home, we would have social services on our back, our kids would get taken off us.\"\nA spokesperson for Phillimore Community Primary School said: \"We have been supporting South Yorkshire Police with an ongoing investigation into an incident this week where it is reported a small number of children ingested sweets suspected of containing cannabis. We will continue to support that investigation in any way we can\n\"We cannot comment further at this time, and are unable to provide further details on individuals involved due to the ongoing police investigation\n\"Those affected have now returned to school and rejoined their classes\n\"The school is available to support the families involved with anything they may need, as well as anybody in the school community who may have concerns. Please approach a school senior leader if you require such support.\"\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c0mwwe90gpko"}