{"authors": ["Shehnaz Khan", "www.facebook.com"], "date_download": "2025-04-26 07:42:43", "date_modify": "2025-04-26 07:42:43", "date_publish": "2025-02-26 19:18:39", "description": "Paul Hunt is accused of sexually assaulting two female prison officers while on duty.", "filename": "news_articles_c3e41n97551o_1745653363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e01/live/85399fe0-f3ae-11ef-9963-97f48f5bf5d5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e41n97551o_1745653363.html", "title": "Redditch prison manager 'groped' female officer at work, court hears", "title_page": "Redditch prison manager 'groped' female officer at work, court hears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A prison manager accused of sexual assault groped a prison officer during work and told her \"it must remain our little secret,\" a court has heard.\nPaul Hunt is charged with sexually assaulting two female prison officers whilst on duty as a custodial manager at HMP Hewell in Redditch, Worcestershire, in 2023.\nA trial at Worcester Crown Court heard he \"groped\" and \"grabbed hold\" of one woman and kissed her without her consent.\nMr Hunt pleaded not guilty to three charges of sexual assault involving two of his colleagues.\nJurors heard the offences took place in 2023 whilst Mr Hunt was in charge of the operation of the prison in his role as custodial manager.\nOpening the case on Wednesday, prosecutor Lisa Hancox told the jury the defendant had \"intentionally touched\" and kissed one of the women without her consent.\nGiving evidence, one female prison officer told the court Mr Hunt \"groped\" her breast and touched her between her legs on 6 January 2023, when the pair were on a night shift.\nShe claimed the conversation had changed while they were working and the defendant began staring at her before suddenly asking what size her breasts were, to which she responded \"it's none of your business\" and walked out the room.\nThe woman said Mr Hunt then followed her to a kitchen at the prison before assaulting and kissing her after she dismissed his advances.\n\"He grabbed hold of me, he forced his tongue down my throat,\" she told the court.\n\"I was frightened,\" she said. \"I felt trapped by him.\"\n\"He groped me between my legs.\"\nThe woman said she did not immediately report the interaction as Mr Hunt was \"in charge\" and \"was a higher rank than me\".\nShe said the defendant then told her what had happened \"must remain our little secret\".\n\"I was shocked and sickened,\" she said.\n\"He said he's never done anything like that before.\"\nThe woman alleged it was \"common knowledge\" that Mr Hunt was \"lecherous\" but she had never felt unsafe around him.\nMr Hunt has denied the allegations and said the sexualised conversation between himself and the woman was \"consensual\".\nHe claimed she had opened the buttons on her uniform during their interaction and had said \"yes\" when he had asked for permission to touch her intimately.\nThe defence claimed the reason the woman did not immediately contact anyone for help or leave the office following the alleged assault was because there was \"consensual flirting\".\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/c3e41n97551o"}