{"authors": ["Mark Denten", "www.facebook.com"], "date_download": "2025-04-26 07:42:28", "date_modify": "2025-04-26 07:42:28", "date_publish": "2025-02-26 20:33:52", "description": "Stray banned dog breeds must be destroyed if their owners are not found within seven days.", "filename": "news_articles_cj4n8r748wlo_1745653348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d5dc/live/5b5ddc00-f47a-11ef-996c-13462f77b475.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n8r748wlo_1745653348.html", "title": "Dunsdale animal charity says banned dogs put down unnecessarily", "title_page": "Dunsdale animal charity says banned dogs put down unnecessarily  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An animal charity says dogs that it believes are no threat to the public are being put down because of dangerous dogs legislation.\nIt has been a criminal offence in England and Wales to own an XL bully without an exemption certificate since February last year.\nMaxi's Mates, in Dunsdale near Guisborough, takes in strays and said it had not been able to rehome any banned breeds since then and was required to destroy dogs if their owners were not found within seven days.\nFounder Jane Galliford said the dogs \"don't deserve it\" but the government said the ban was \"there to protect public safety\".\n\"There's nothing anyone can do for these banned breeds,\" Ms Galliford said.\n\"The only thing that we can try to do is to try to find the owner.\n\"The clock's ticking on them - we know - it's like they've got a digital hour on their head.\n\"It's everything we fight against - we don't want to put any dogs down because they don't deserve it.\"\nThere have been a number of attacks involving XL bullies, external - some fatal - since the new laws were put in place.\nWhen the previous government announced the XL bully ban in 2023, it said the breed had been \"disproportionately involved\" in deaths recorded since 2021.\nIn January this year the owner of an XL bully was jailed for three years after his dog chased a man who died after being left with \"catastrophic\" neck injuries.\nExemptions require the animal to be insured, microchipped, housed securely, neutered, and kept on a lead and muzzled in public.\nThe government received 61,000 applications for exemption before the deadline.\nThe Department of Environment, Food and Rural Affairs said: \"\"The ban on XL bullies is there to protect public safety and we expect all XL bully owners to comply with the strict conditions.\n\"Ongoing dog attacks show we need to do more to encourage responsible dog ownership across all breeds of dog and to consider whether the current dog control rules are sufficient to ensure communities are protected.\"", "url": "https://www.bbc.co.uk/news/articles/cj4n8r748wlo"}