{"authors": ["Galya Dimitrova", "www.facebook.com"], "date_download": "2025-04-26 06:29:12", "date_modify": "2025-04-26 06:29:12", "date_publish": "2025-02-27 11:09:11", "description": "South Oxfordshire and Vale of White Horse district council have paused moving plans over local government reorganisation.", "filename": "news_articles_cg70zx9dk18o_1745648952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7fa7/live/0759e1e0-f465-11ef-8dd5-1d47b25c094a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg70zx9dk18o_1745648952.html", "title": "Oxfordshire district councils HQ might face further delays", "title_page": "Oxfordshire district councils HQ might face further delays - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of a district council has said plans for the local authority's new home may be set back due to local government reorganisation.\nSouth Oxfordshire District Council (SODC) wants to build a new complex opposite Didcot Parkway train station to use as its HQ with the Vale of White Horse District Council.\nIts former home was destroyed by fire in 2015 and staff have been using Abbey House in Abingdon since 2022.\nSODC leader David Rouane said it might have to pause any decision \"until we have a clearer picture of our future\".\nThe project has already experienced several delays and SODC has not said publicly what it expects the project to cost.\nIts last permanent office in Crowmarsh Gifford burned down after Andrew Main, from Rokemarsh, near Wallingford, drove a car filled with gas canisters into it.\nHe was detained in a mental health unit in May 2015.\nMr Rouane said it had been progressing plans for a potential permanent home at the Didcot Gateway.\n\"However, in light of Local Government Reorganisation, we may now have to pause any decision until we have a clearer picture of our future,\" he said, referring to Oxfordshire County Council's cabinet unanimous support for the government's fast-track council restructure.\nThe move would likely mean reducing the number of councils in the county to one or more unitary authorities.", "url": "https://www.bbc.co.uk/news/articles/cg70zx9dk18o"}