{"authors": ["Laura Kuenssberg", "www.facebook.com"], "date_download": "2025-04-26 06:47:14", "date_modify": "2025-04-26 06:47:14", "date_publish": "2025-03-01 12:30:05", "description": "Starmer is confronting difficult dilemmas after Zelensky and Trump's showdown, writes Laura Kuenssberg.", "filename": "news_articles_cvgddp56570o_1745650034.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e5e9/live/fba5ce60-f5e8-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgddp56570o_1745650034.html", "title": "Keir Starmer faces decision about who he can trust after White House horror show, writes Laura Kuenssberg", "title_page": "Keir Starmer faces decision about who he can trust after White House horror show, writes Laura Kuenssberg - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A meltdown. A horror show. A pile-on. However you want to describe it, the meeting between US President Donald Trump and President Volodymyr Zelensky in the Oval Office last night was a catastrophe: Ukraine and its most important ally in a public slanging match.\nBut more important than the insults and shouting was the clash on substance. America's threat to cut its support for Ukraine if Zelensky doesn't sign a deal. Trump's refusal to name Russia as the clear aggressor and Ukraine as the clear victim in the conflict.\nIt was a total contrast to what happened on Thursday when Prime Minister Sir Keir Starmer met Trump. \"Ecstatic\", \"triumph\", \"outstanding\" were a few of the words used by the PM's team.\nThey weren't just delighted with the optics of the two leaders chatting about their families and the royals over winter greens and sea bass – Sir Keir's team believed they had made genuine progress in talks in the Oval Office about Ukraine.\nTrump told Sir Keir that the US was working fast on a ceasefire deal, but it wasn't done and they weren't rushing to a bad one. And the PM got an assurance the US was looking at how it could guarantee Ukraine's security if a peace was agreed. A senior government source told me \"there are good reasons to be optimistic\" about Trump's true position.\nBut last night's outbursts give a very different picture, and this morning you'd be hard pushed to find an optimist in Westminster.\nIf America's out, does he push European allies to join the UK and France in offering troops that could guarantee a peace deal – the \"reassurance force\" plan we talked about last week.\nIs it even feasible for Europe to support Ukraine on its own?\nI'll be asking the prime minister these questions myself when he joins us live in the studio tomorrow morning at one of the most critical junctures for both his leadership and the security of our continent.\nThe irony is that until last night's drama, conventional wisdom in political and diplomatic circles was that slowly but surely, the direction of travel was towards a deal to end the war. Whatever you think of him, the election of Trump had changed the dynamic and focused minds on bringing an end to the conflict.\nNo western allies would suggest that Zelensky should just fold after three years of holding off Russia, with all the lives lost and all the suffering of his people. Yet privately, and tiptoeing towards it in public, there was a sense that he was willing to take part in some form of negotiation.\nHis previous stance of not giving an inch had visibly softened in recent months. If the conflict is to end, most diplomats would tell you that has to happen at the negotiating table. For all the hot tempers, Trump had said he could get Russia to talk. To stop the war, Zelensky may have to get back to the table too.\nIn the next crucial 24 hours, Sir Keir will hope to pick up the pieces of last night's disastrous encounter and push Europe to come up with the strongest expression of support, alongside potential promises of more military backing.\nHe'll also hope he can reset the tone and calm the atmosphere.\nThe version of Trump administration we saw in the Oval Office last night does not portray a reliable partner.\nThe prime minister is now faced with a decision not just on what to do, but who he can trust.", "url": "https://www.bbc.co.uk/news/articles/cvgddp56570o"}