{"authors": ["Brian Farmer", "www.facebook.com"], "date_download": "2025-04-26 06:35:01", "date_modify": "2025-04-26 06:35:01", "date_publish": "2025-02-27 06:17:16", "description": "Judge temporarily halts proceedings as the alleged victim struggles during cross-examination.", "filename": "news_articles_c2013r88lwyo_1745649301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4c75/live/52a9dc80-f466-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2013r88lwyo_1745649301.html", "title": "Bedford woman who alleges rape breaks down at trial", "title_page": "Bedford woman who alleges rape breaks down at trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who said she was raped in a lay-by after accepting a lift following a night out broke down in court while giving evidence.\nThe woman, who said she was attacked by two men after visiting a nightclub in Bedford in August 2024, became distressed when giving evidence at Huntingdon Crown Court.\nJudge Bal Dhaliwal-Thomas temporarily halted the trial and the woman resumed her evidence after about 15 minutes.\nRobert Balcan, 22, and Adrian Madarasz, 25, who lived together in Shortstown, near Bedford, deny kidnap and rape. Mr Madarasz also denies sexual assault.\nThe woman, who cannot be identified for legal reasons, told police she was raped in a car in the early hours of 26 August.\nShe said the men \"threw\" her out of the car after the assault - and told how she had knocked on a door and asked for help.\nLawyers representing Mr Balcan and Mr Madarasz, who lived together in Evans Croft, Shortstown, have suggested that the woman was not a victim of crime.\nThe woman, who gave evidence from behind a screen, became distressed and said she was feeling sick when being questioned by barrister Yvonne Kramo, who represents Mr Balcan, on Wednesday.\nMs Kramo suggested that the woman had asked Mr Balcan if he wanted sex - and argued that sex had been consensual.\nThe woman repeatedly said \"no\" to Ms Kramo's suggestions.\n\"They threw me out of the car,\" the woman told jurors. \"He raped me.\"\nShe said she had been \"very scared\" and added: \"It was not consensual.\"\nJames Wing, who represents Mr Madarasz, also suggested that his client had not assaulted the woman.", "url": "https://www.bbc.co.uk/news/articles/c2013r88lwyo"}