{"authors": ["Shelagh Parkinson", "www.facebook.com"], "date_download": "2025-04-26 07:34:24", "date_modify": "2025-04-26 07:34:24", "date_publish": "2025-02-27 15:49:22", "description": "A review at Blackpool's £13m Showtown museum will \"ensure staffing levels match operational requirements\".", "filename": "news_articles_c8rkkeg7klzo_1745652864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c2c5/live/264864b0-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkkeg7klzo_1745652864.html", "title": "Blackpool museum axes staff 12 months after opening", "title_page": "Blackpool museum axes staff 12 months after opening - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A shake-up at a £13m museum has seen some staff made redundant and an overhaul of the way the attraction runs.\nBlackpool's Showtown museum - which celebrates the Lancashire seaside town's entertainment history - has now been taken under the wing of the same company which already runs the Sandcastle Waterpark on behalf of the council.\nAbout 15% of staff have been made redundant with chief executive Liz Moss set to leave after resigning from her role.\nShowtown, which is approaching a year since it opened on 15 March, will continue to be operated by the Blackpool Heritage and Museum Trust on a day to day basis.\nSpencer Philips, chairman of the Blackpool Heritage and Museum Trust, said: \"In order to ensure that staffing levels match operational requirements we have proposed a new structure.\n\"Unfortunately, this resulted in the loss of a number of posts.\"\nBut he added: \"One of the key focuses for Showtown going forward will be engaging with the local and visitor market, ensuring the fantastic proposition of the museum is showcased more effectively, and visitation follows year-round.\"\nShowtown did not confirm the number of redundancies but a spokesman said it was about 15% of the workforce.\nBlackpool Council leader, councillor Lynn Williams, said: \"There is no doubt that Showtown's future is secure in Blackpool.\n\"The first year of any new business is a challenging one. I have every confidence that the right changes are being made to ensure a sustainable future.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkkeg7klzo"}