{"authors": ["Paul Moseley", "www.facebook.com"], "date_download": "2025-04-26 03:57:39", "date_modify": "2025-04-26 03:57:39", "date_publish": "2025-03-04 13:51:52", "description": "Norfolk and Waveney ICB is considering closing the facility or reducing its opening hours.", "filename": "news_articles_c62zgx84790o_1745639859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a75c/live/2b76cc20-f8f0-11ef-aa9e-0529c5c73157.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zgx84790o_1745639859.html", "title": "MPs oppose plan to cut Norwich's NHS walk-in service", "title_page": "MPs oppose plan to cut Norwich's NHS walk-in service - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An MP has come out against proposals to shut an NHS walk-in centre which has already once been saved from closure.\nNHS Norfolk and Waveney Integrated Care Board said it was looking at shutting the site in Norwich or reducing its opening times to just four hours a day.\nBut Norwich North Labour MP Alice MacDonald said the centre – which sees about 72,000 patients a year – was \"vital to so many of my constituents\".\nThe care board, which has opened a consultation on its plans, said money saved by making cuts to the centre in Rouen Road would be given to GP surgeries.\nOn the streets of the city, people said they were disappointed by the proposal after a similar idea was put forward two years ago.\nDescribing it as a \"bad idea\", 75-year-old Ian Bucknall said \"the capacity to walk in to somewhere and get an opinion quickly is absolutely crucial\".\nHe added: \"Closing it is short-sighted. Unless they do something about the pretty diabolical service offered around here, it's a step backwards.\"\nAdelia Tisdall, from Norwich, said she thought closure was \"bonkers, because it's so heavily used\".\n\"People are using it because the local GP surgeries are useless now and nobody can get an appointment.\"", "url": "https://www.bbc.co.uk/news/articles/c62zgx84790o"}