{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:18:33", "date_modify": "2025-05-21 05:18:33", "date_publish": "2024-12-25 00:00:00", "description": "Ukraine's air force says it detected 184 missiles and drones, causing damage to energy infrastructure across the country.", "filename": "news_live_c159082vdqyt_1747804713.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c159082vdqyt_1747804713.html", "title": "Russia says Christmas Day attack on Ukraine was a success, as Zelensky calls strikes 'inhumane'", "title_page": "Russia says Christmas Day attack on Ukraine was a success, as Zelensky calls strikes 'inhumane' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dnipro still has 65 homes without heating, says mayor\nAs we've been reporting, Dnipro is one of the cities targeted by today's Russian strike.\nBoris Filatov, the mayor of Dnipro, says that as of 14:30 local time (12:30 GMT), gas, water, and electricity supplies have been restored in the city, but about 65 houses are still without heat.\nAccording to the UK's Met Office, the temperature in Dnipro is currently 4°C.\nFilatov also reports that there are 300 broken windows across the city, and seven educational institutions have been damaged.\nAdditionally, he mentions that the city needs to evacuate one of its hospitals, where more than 100 patients are being cared for. These patients will be moved to other medical facilities in the city.\n\"We are not folding our hands,\" says Filatov. \"We are helping each other.\"\nKharkiv still under attack, says Ukraine's air force\nAs we've been reporting, Kharkiv, Ukraine's second-largest city, has been one of the areas under Russian attack.\nIn the past hour - while most of Ukraine has quietened down - Kharkiv still had air raid warnings in place.\nAt 13:06 local time (11:06 GMT), the Ukrainian air force announced the presence of enemy drones near the city and urged people to stay in shelters. It later made a similar warning.\nKharkiv's mayor, Ihor Terekhov, says, as of 13:48 local time, damage to 74 buildings had been recorded from today's attacks.\nTerekhov also says repairs to the energy infrastructure are in progress, and 35% of the circuits have been fixed.\nFour killed by Ukrainian shelling in Kursk, says Russian governor\nFour people have been killed and five more injured by Ukrainian shelling in the town of Lgov in Russia's Kursk region, according to the region's acting governor.\nAlexander Khinshtein says a five-storey building, two single-storey residential buildings, and a single-storey beauty salon were damaged.\nHe adds that the \"blast wave\" destroyed a small section of a gas pipeline, blew out windows in neighbouring homes, and damaged at least a dozen cars.\nParts of the Kursk region are occupied by Ukraine following its surprise cross-border offensive in early August.\nLast week, Khinshtein said five people had been killed in the region, after a Ukrainian strike.\nMeanwhile, in Vladikavkaz in Russia's North Ossetia region, a woman was killed after debris from an intercepted Ukrainian drone fell on a shopping centre, according to Russia's defence ministry.\nThis is the second Christmas on 25 December for Ukraine\n\"For the second time, we celebrate Christmas on the same date as one big family, one country,\" Ukraine's President Zelensky said yesterday, on Christmas Eve.\nUkraine had traditionally followed the Julian calendar, like Russia, where Christmas is on 7 January.\nBut in a move away from Russia, Ukrainian President Volodymyr Zelensky changed the law in July 2023.\nSince then, Christmas is marked according to the Western - or Gregorian - calendar.\nZelensky said this change allows Ukrainians to \"abandon the Russian heritage\" of celebrating Christmas in January.\nUkraine's air force detects 184 missiles and drones in attack\nUkraine's air force has just given more details on Russia's Christmas Day attack.\nIt says Russia targeted Ukrainian energy facilities using \"air, ground, and sea-based missiles\", as well as drones. In total, the air force detected 184 \"enemy air targets\".\nThe air force says that according to preliminary data, as of midday local time (10:00 GMT), they've shot down 59 missiles and 54 drones (113 in total), and another 52 drones \"did not reach their targets\".\nThe areas with energy facilities attacked include Kharkiv, Kyiv, Dnipropetrovsk, Poltava, Zhytomyr, Ivano-Frankivsk, and Zaporizhia.\nThe Ukraine Air Force also confirms there have been casualties as a result of the attack, although does not say how many.\nKharkiv official says 520,000 people without heating and water\nFurther to those pictures from Kharkiv, we're now getting more information about the impact of this morning's air strikes.\nOleg Sinegubov, head of Kharkiv's regional administration, reports that 500,000 people in the Kharkiv area are without electricity. Also, 520,000 people are without heating and water.\n\"We are doing everything possible to restore heat, water, and electricity to people's homes as quickly as possible,\" Sinegubov says.\nThe official also says a 53-year-old woman died due to \"enemy mortar fire\".\nEveryone is working in Dnipro to repair damage - mayor\n\"Everyone is in coordination: the military administration, city authorities, police, energy workers, utility workers, rescuers, volunteers,\" says Dnipro Mayor Borys Filatov, as it deals with Russia's missile attack.\nHe says he won't say too much, so as to not inform Russia, but declares: \"If we had not prepared for the shelling, it would have been much worse.\"\nThe regional head, Sergiy Lysak, says that as well as energy infrastructure, an administrative building and a house were damaged.\nHe accuses Russia of sending \"darkness\" to Ukraine, \"even on bright holidays\".\n\"For the third year, our Christmas has been overshadowed by war. But it is ours. Let's stand up and win!\"\nTwelve missiles launched at Kharkiv, says mayor\nThe mayor of Kharkiv, Ukraine's second largest city, has just issued an update, saying they faced another \"massive missile attack on energy facilities\" this morning.\nIhor Terekhov says 12 missiles were launched at the city, targeting energy facilities such as boiler houses and power plants. As a result, a large part of Kharkiv is currently without heating.\nHe says at least four people have been injured in the city so far (earlier reports said six).\n\"All our specialised municipal services will work to maintain the heat and restart the heating system. We will work around the clock to restore normal life in the city as soon as possible,\" he says.", "url": "https://www.bbc.com/news/live/c159082vdqyt"}