{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 14:47:07", "date_modify": "2025-05-20 14:47:07", "date_publish": "2023-07-28 00:00:00", "description": "The area where the most-polluting vehicles face extra daily charges will now be extended next month.", "filename": "news_live_uk-england-london-66328175_1747752427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/177C3/production/_130559169_aa68ab3d7c96e66099af1899c435aeb624a21a2c0_0_3000_20221000x674.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_uk-england-london-66328175_1747752427.html", "title": "Ulez: Sadiq Khan's plan to extend Ulez can go ahead", "title_page": "Ulez: Sadiq Khan's plan to extend Ulez can go ahead - court - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all folks\nDulcie Lee\nLive reporter\nWe're going to wrap up our live coverage here - but we've got plenty more for you on this story:\nCatch up with today's developments in our main story here\nFind out all about Ulez and what it means for you here\nSee if your vehicle is Ulez-compliant here, external\nToday's updates were brought to you by Andrew Humphrey, James Harness, Malu Cursino, Jacqueline Howard, Yaroslav Lukov, Gem O'Reilly, Yasmin Rufo, Harry Low, Andre Rhoden-Paul and Michael Sheils McNamee.\nThe page was edited by Chirag Trivedi, Paul Gribben and me. Thanks for joining us.\n'My van's value has plummeted - should I raise customer prices?'\nNick Johnson\nReporting from Oxted, Surrey\nBen Rickard is a groundsman in Oxted, Surrey, but many of his customers are within Greater London, only a few miles to the north of here.\nBen drives a van which only just breaches the Ulez emissions threshold. He says not only can he not afford a new van, but the value of his current van has plummeted because of Ulez.\nHe says he’s still trying to decide whether he stops taking customers in Greater London, or if he attempts to increase his prices, to help swallow the impact of the daily charge.\nHow much did the councils' challenge to Ulez cost?\nA little earlier, London Mayor Sadiq Khan said he had been told the cost to taxpayers of the court challenge which sided with him today amounted to more than £1m. But is he right?\nThe short answer is we're not sure - but not for lack of trying.\nThe BBC contacted all five councils involved in the judicial review to understand how much they have spent throughout the legal challenge process.\nSo far only one, Bromley, has responded. The council said it had set aside a budget of £140,000 for legal fees. Its interim spending at the time of its response was £20,953 in counsel fees and £11,453 for internal legal staff.\n'We've replaced our vans - but it's been financially crippling'\nYasmin Rufo\nReporting from Bromley\nOne Londoner tackling the Ulez charge is Josh, a sixth-generation sweep who runs a firm founded way back in 1860 in Crouch End.\nHe says his small family business previously used four non-compliant vans to get between jobs. Now, he has bought an electric bike to beat the £12.50 daily charge.\nThe e-bike, which costs over £16,000, is powered by a battery and allows Josh to cover over 40 miles a day, at speeds up to 15mph.\n“As a trade, we’ve used primarily the same equipment – rods and brushes – for generations. So it seems that, in terms of how we’re getting around, it’s gone full circle as well. ”\nJosh also replaced three of his non-compliant vans, which he said cost him £20,000 each.\n“For a small family business, it’s been a lot to pay for these new vehicles, so it’s meant that we’re in a fair amount of debt now.\n“It’s been financially crippling”, Josh added.\nPoliticians now need to step up on the environment - Greens\nIn admittedly not the most surprising news, the Green Party has welcomed today's High Court ruling, with co-leader Adrian Ramsay saying \"clean air zones save lives - the issue is as stark as that\".\nHe says the ruling is \"a signal to party leaders of all political stripes that they need to step up and show political leadership in tackling the environmental crisis\".\nAddressing concerns that schemes such as Ulez come with a financial cost to people and businesses, the Greens say change must be paid for \"by the super-rich and the polluting companies raking in gigantic profits, not the poorest in society\".\nHe called for the government to provide support to people who need to change their vehicles - the mayor already has a scrappage scheme you can find out more about here, external.\nMy car isn't Ulez-compatible - what now?\nFirstly, you can check if your vehicle meets the emission standards to exempt it from Ulez here, external.\nBroadly, your car will not be compliant if it is pre-2006 petrol or pre-2015 diesel.\nIf your vehicle is not compliant, you have a choice of either paying a daily charge of £12.50 to drive within the zone, replacing your car or finding another way to travel.\nThe mayor of London has created a £110m scrappage scheme, external that allows Londoners on certain means-tested benefits to receive up to £2,000 for scrapping a car or up to £1,000 for scrapping a motorcycle.\nFor wheelchair-accessible vehicles there is a grant of up to £5,000.\nTo qualify for money from the scheme, you must be on certain low income or disability benefits, or be in receipt of child benefit.\nTransport for London says more details on eligibility criteria will be available on its website “at the end of July 2023”.\nWas Starmer right to say Khan legally had to reduce pollution?\nFollowing last week’s by-election in Uxbridge, Labour leader Keir Starmer pointed out that Sadiq Khan is legally required to reduce air pollution.\nOpposition to Ulez was seen as the deciding factor in why Labour failed to win Boris Johnson's old seat from the Conservatives.\nStarmer called on Khan to “reflect” on the scheme, but emphasised the mayor’s hands were somewhat tied. “If the law requires you to do something you can’t simply do nothing,” he said.\nStarmer is right that Khan is legally obliged to do something about air quality, but the law does not specify expanding Ulez.\nUnder the Environment Act, external, all local authorities are required to ensure the air quality in their areas does not breach, external legal limits on pollution.\nLondon meets legal limits for most pollutants, but still has illegally high levels, external of nitrogen dioxide (NO2).\nAs such Khan is legally required to take “appropriate measures” to bring air pollution in London in line with legal limits. How he does this is not set out in law.\nAwkward moment for Labour as Khan at odds with leadership over Ulez\nHelen Catt\nPolitical correspondent\nMayor Sadiq Khan's insistence that it was essential for the expanded low emissions zone to go ahead as planned is very clearly at odds with what's been said by his own party leadership, which is awkward for Labour.\nThe shadow chancellor Rachel Reeves said yesterday that it was not the right time to \"clobber people\" with a charge which she described as \"not progressive\".\nKeir Starmer had called on the mayor to \"reflect\" - after Ulez was pinpointed as the major driver behind the Conservatives managing to hold on to Boris Johnson's old seat of Uxbridge and South Ruislip in last week’s by-election.\nKhan though suggested there had been \"a lot of misinformation\" about the policy during campaigning.\nWhat do Londoners really think about Ulez?\nYou'll have worked out from our previous posts that Ulez divides opinion and sparks pretty passionate views.\nBut has there been any polling on what Londoners think about the scheme expanding across all London boroughs?\nLast year, following a 10-week consultation which had more than 57,000 respondents, including stakeholders and organisations, 59% thought it should not be expanded - 12% believed it should be earlier and 21% thought it was the right date. Only 8% thought it should be introduced at a later date.\nConcerns brought up included the cost of the daily charge, concerns about poor transport provision and effects on the economy.\nBut a YouGov poll at the time of 1,245 London adults showed 51% supported the Ulez expansion - with 21% keen to see it implemented by August 2023, 22% at an earlier date and 8% at a later date. Just over a quarter (27%) thought it should not be introduced at all.\nUlez condemned as 'tax on poor'\nYasmin Rufo\nReporting from Bromley\nPaul has been a fishmonger in Bromley for more than 10 years and regards Ulez as a \"tax on the poor”.\n\"People here are so unhappy with what is happening, how can you expect someone to pay £12.50 a day just to get to work?\"\nAs I talk to Paul, many other people on the high street in this part of south London join in the conversation, all expressing the same feelings.\nFred, a local electrician, says he is really worried about Ulez.\n\"It’s going to really hurt working-class people,\" he tells me.\n\"Mr Khan is going to put a lot of people in a lot of debt.\"\nHow polluted is London’s air?\nMark Poynting\nBBC News\nAcross all London boroughs, air pollution far exceeds limits recommended by the World Health Organization (WHO), external.\nUlez will be expanded to include outer London. Here, air pollution is actually lower than in inner London, but air pollution has a greater effect on health, external. This is because there is a higher proportion of elderly people in outer London, who are more vulnerable to air pollution.\nLondon’s air quality has been improving. Between 2016 and 2019, average concentrations of nitrogen dioxide and fine particulate matter – two of the most damaging pollutants for human health - fell by around one-fifth, external.\nNevertheless, no areas of London will meet the WHO’s guidelines for safe air for these pollutants by 2030 without further action, according to current projections, external.\nThe mayor of London says this is the reason that the expansion of the Ulez is needed.\nUlez ruling 'a relief' - mum whose daughter died from pollution\nThe mother of a nine-year-old girl who died following an asthma attack due to air pollution has said it is a relief Ulez will be expanded in London.\nRosamund Adoo-Kissi-Debrah lost her daughter, Ella, in 2013. The family had lived near a major road in Lewisham, south-east London.\nA coroner concluded air pollution had contributed to Ella's death - making her the first person in the UK to have it listed as a cause of death.\nFollowing today's ruling, Adoo-Kissi-Debrah told BBC News: \"I would like to take this opportunity to thank the mayor of London for listening to me and [prioritising] the lives of children, especially in London.\n\"Up to 12 die every year from asthma, and I am relieved really. I think I'm slightly overwhelmed and quite shocked.\"\nNow a World Health Organization (WHO) air quality ambassador, Adoo-Kissi-Debrah stressed that air pollution should be seen as a \"health issue\" and she called on Prime Minister Rishi Sunak to contribute more to the Ulez scrappage scheme.\n\"This isn't a party political issue. This is about lives and about the nation's health,\" she added.\nHow do I know if my car is Ulez-compliant?\nWhether or not your vehicle can be freely driven in the Ulez depends on its year of manufacture. Broadly, these are the vehicles you can drive in London without paying the Ulez fee:\nDiesel cars and vans: 2015 models and newer\nPetrol cars and vans: 2006 models or newer\nFor motorbikes, it's 2007 and up\nBuses, coaches and lorries are a little different – they're beholden to the LEZ standards, external\nWhether or not your vehicle is compliant isn't based on some arbitrary year – it's to do with EU standards., external\nEvery few years, as developing technology allows for greener cars, the EU updates the standards that new cars sold from that point on into the EU market must comply with.\nWhen Ulez was first proposed for central London by the then-mayor Boris Johnson, we were up to Euro 6 standard, which covered cars from 2015. Sound familiar? That's the diesel car and van Ulez cut-off point. For petrol cars, it's Euro 4, motorbikes Euro 3 and, as mentioned above, the largest vehicles must be Euro 7.\nHow does Ulez work? Five things you need to know\nAre you driving to Heathrow Airport to catch a flight next month? Or maybe you live in a London borough and you drive to the supermarket for the weekly shop?\nIn either case, you will need to know how Ulez works when it extends across all London boroughs on 29 August.\nTransport for London (TfL) charges drivers for using the road if their vehicle does not meet Ulez emissions standards\nUlez operates 24 hours a day, seven days a week, every day of the year, except on Christmas Day\nMost petrol vehicles under 16-years-old or diesel vehicles under six-years-old meet emission standards. You can check on TfL website if your vehicle complies or if it does not comply but is exempt from the charge\nIf your car does not comply with TfL's emission standards and you drive in the Ulez charging zone, you need to pay a daily charge of £12.50\nThe Ulez zone will be expanding across all London boroughs from 29 August\nKhan says taxpayers' money 'wasted' in court case\nMayor of London Sadiq Khan has just been speaking to the BBC.\nHe told us: \"I welcome the judgement today. I've been told more than £1m of council taxpayers' money has been wasted on this case\".\nHe adds: \"I'm quite clear though, I made this decision to expand Ulez because it is really important we address the public health crisis.\"\nAsked about increased costs to Londoners, Khan says nine out of 10 cars in London are already compliant with Ulez and the scrappage scheme would offer support.\nThe Ulez expansion map\nThe Ultra Low Emission Zone is set to expand to three times its current size in a month's time, after a judge ruled its expansion could go ahead.\nIt means any cars that don't meet emissions standards (generally petrol cars registered before 2005 and diesel cars before September 2015) will have to pay £12.50 to drive in London.\nCheck out the areas affected - and see which councils brought the unsuccessful court challenge - below:\nHow does air pollution affect human health?\nMark Poynting\nBBC News\nThe Ultra Low Emission Zone (Ulez) typically targets older vehicles, because they are the most polluting.\nThis is because there is very strong evidence that air pollution damages human health.\nAir pollutants - for example nitrogen dioxide - can cause and worsen respiratory problems like asthma, and can affect those with heart conditions, according to multiple scientific studies.\nAcross Greater London, the equivalent of between 3,600 and 4,100 deaths can be attributed to air pollution every year, according to Imperial College London research, external.\nThis figure isn’t the number of people whose deaths have been directly caused by air pollution. Instead, it’s an estimate of how many extra deaths there have been across the whole population because of the effect of pollution on people’s health.\nAcross the whole of the UK, air pollution has an effect equivalent to between 28,000 and 36,000 deaths , externala year – making air pollution “the largest environmental risk to public health in the UK”, according to Public Health England.\n'Bitter disappointment' among councils who lost court bid\nWe're now hearing from some of the councils who lost their court bid this morning, here's a flavour of their reactions:\nCouncillor Colin Smith, leader of Bromley Council said the ruling was a \"bitter disappointment\" for motorists and traders who would have to \"consider ceasing business and laying off staff\".\n\"I can only say sorry. We've tried our very hardest to protect you but ultimately, today's judgment does mean that the mayor has taken another step closer to getting his way,\" he said.\nHarrow Council leader, Paul Osborn, said: \"It is a sad day for our residents and businesses who are worried about the impact the expansion will have on them when it comes into force.\"\nCouncillor Tim Oliver, leader of Surrey Council said the decision will be respected but was \"incredibly disappointing\".\n\"This has always been about protecting Surrey residents, many of whom will now be significantly socially and financially impacted by the mayor's decision as they go about essential, everyday journeys,\" he said.", "url": "https://www.bbc.com/news/live/uk-england-london-66328175"}