{"authors": ["Tom McArthur", "www.facebook.com"], "date_download": "2025-04-26 04:07:44", "date_modify": "2025-04-26 04:07:44", "date_publish": "2025-03-02 22:02:48", "description": "Ukraine's president tells reporters that despite a fractious White House meeting, he is prepared for the deal to go ahead.", "filename": "news_articles_c8j0ggm3mdwo_1745640464.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/033b/live/fb78eae0-f7bd-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j0ggm3mdwo_1745640464.html", "title": "Zelensky: Ukraine still 'ready' to sign minerals deal with Trump", "title_page": "Zelensky: Ukraine still 'ready' to sign minerals deal with Trump - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volodymyr Zelensky has said he is still \"ready to sign\" a US-Ukraine minerals deal after leaving the White House without it being agreed.\nUkraine's president said in response to a question from the BBC's Laura Kuenssberg that, despite a fractious meeting with US President Donald Trump last week, he is still willing to have a \"constructive dialogue\" with the US, adding: \"I just want the Ukrainian position to be heard.\"\n\"We want our partners to remember who the aggressor is in this war,\" he told reporters.\nWhen relations between the US and Ukraine first became strained over the Trump administration's handing of peace talks with Russia, the minerals deal was intended as a stepping stone towards further security ties between the two countries.\nBut after Zelensky, Trump and US Vice-President JD Vance had a heated argument in front of the media in the Oval Office, the Ukrainian leader was told to leave without the deal being signed.\nZelensky's remarks come as US Treasury Secretary Scott Bessent told the BBC's US partner CBS News it was \"impossible to have an economic deal without a peace deal\", external.\nBessent said Zelensky had \"thrown off the sequencing\" of how the minerals deal and peace deal were supposed to play out - instead choosing to \"relitigate\" discussions in public when they should have taken place in private.\nSpeaking after a summit of European leaders in London on Sunday, Zelensky said the combative nature of his recent meeting in Washington did not benefit the US or Ukraine as partners, and only really benefited Russian President Vladimir Putin.\nHowever, he said that he would return to the White House if invited.\nBut he refused to be drawn into talking about conceding territory to Putin - an option Trump officials have touted as part of a peace deal - or expressing regret in how he had handled the meeting with Trump.\nRussia launched a full-scale invasion of Ukraine in February 2022, and currently controls around 20% of Ukrainian territory.\nZelensky was speaking to the media in London following a summit in which world leaders agreed on a four-point plan to work with Ukraine to stop the war and defend it from future Russian aggression.\nAmong these pledges is for the UK, France and other nations to form a \"coalition of the willing\" to defend a potential peace agreement in Ukraine.\nUK Prime Minister Sir Keir Starmer reiterated Europe \"must do the heavy lifting\", but any agreement would need US backing.\nAsked for his thoughts on the outcome of the summit, Zelensky said the \"best security guarantees are a strong Ukrainian army\".\nBut he added Europe needed some form of US input, perhaps in the form of air defence and intelligence, in an apparent sign of agreement with Sir Keir.\nIn an interview with France's Le Figaro newspaper on the way to the summit, French President Emmanuel Macron was quoted as saying that a month-long truce on striking in the air, on the sea and energy infrastructure was on the table.\nDuring this time, a peace deal could be thrashed out, while the deployment of European troops would occur in a second stage.\nAsked by the BBC's Laura Kuenssberg about these reports, Zelensky replied he was \"aware of everything\".\nZelensky insisted Ukraine's relationship with the US will continue and he was \"sure this situation will pass by\", in reference to the fall-out with Trump.\nHe said there had been communication between the US and Ukraine since Friday, but \"not on my level\".\nThe Ukrainian leader also said: \"The failure of Ukraine would not just mean Putin's success, it would be a failure for Europe, it would be a failure for the US.\"\nFollowing the row in the Oval Office, several leading Republicans backed how the meeting had been handled by Trump and criticised Zelensky.\nSenator Lindsey Graham - once a staunch supporter of Ukraine - told reporters that Zelensky \"either needs to resign and send somebody over that we can do business with, or he needs to change\".\nAsked about these calls to step down in the interest of US-Ukraine relations, Zelensky said that to resign was one thing, but preventing him from running again would require Nato membership.\nUkraine joining the transatlantic military alliance has been a demand of Kyiv since the war began, and forms a key part of the country's victory plan - though the Trump administration has said this was unlikely.\n\"I am exchangeable for Nato,\" Zelensky told journalists before he was due to leave the UK.\n\"I have said that I am exchanging for Nato membership, then it means I have fulfilled my mission. Nato means I have fulfilled my mission.\"\nHe added it was \"not very democratic\" for people from other nations to be deciding who led Ukraine, but said Graham could become Ukrainian and then \"his voice will have weight\" in deciding who its leader was.", "url": "https://www.bbc.co.uk/news/articles/c8j0ggm3mdwo"}