{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:05", "date_modify": "2025-05-19 15:32:05", "date_publish": "2015-02-11 00:54:25", "description": "Many oil and gas firms will need to transform the way they operate in order to grasp future opportunities in the sector, according to a report.", "filename": "news_uk-scotland-scotland-business-31361008_1747668725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79803000/jpg/_79803294_79803293.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-business-31361008_1747668725.html", "title": "Oil firms 'need fresh strategies' says PwC report", "title_page": "Oil firms 'need fresh strategies' says PwC report - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Many oil and gas firms will need to transform the way they operate in order to grasp future opportunities in the sector, according to a report.\nPwC said companies should be looking to deploy fresh strategies, following a sustained fall in the price of oil.\nIt suggested they should look to reduce costs \"in a sustainable manner\" and find efficiencies by keeping tax costs in control.\nOther suggestions included divesting non-core parts of their business.\nPwC argued that firms might also want to identify and invest in strategic acquisitions to secure market position in key areas.\nThe report's authors said the UK oil and gas sector would have been in a much better place \"to weather the oil price maelstrom\", had it heeded 30%-40% cost reduction warnings which surfaced 12-18 months ago.\nThe report said there was still time for firms to \"learn the harsh lessons of past languor\" by adopting fresh strategies.\nBut it also warned that to achieve that, they needed to get away from \"short term knee-jerk reactions\" seen in previous downturns - or risk damaging the long term future of the industry.\nPwC cited significant downsizing undertaken during the downturn of 1999-2000, arguing that the industry had struggled since then with talent retention.\nIt said \"aggressive price negotiation\" and contract revisions with the oil services sector would also do little to create a collaborative environment.\nThe report argued that companies must answer \"hard questions\" about whether they can continue to invest in the sector, or if they should instead \"move on\".\nBut it stressed the need for the industry to take a long-term view, adding that \"intelligent and strategic cost-cutting\" could \"position players well through this turmoil\".\nBrian Campbell, oil and gas capital projects director at PwC and co-author of the report, said: \"With economists predicting low oil prices throughout 2015, UK oil and gas firms are not out of the woods by any means.\n\"They are still at risk of an economic triple-whammy: as the falling oil price reduces income, incremental investment may no longer be economic with a risk that field life diminishes and decommissioning is accelerated.\n\"The stark reality is that firms need to be able to operate in an environment where oil averages at $50 per barrel - only then can it be truly fit for the future.\"\nHe added: \"We've been talking about cost reduction and restructuring within the industry for several years now, and the harsh truth is that if many larger exploration and production and oil field services firms had implemented programmes before the oil price crisis hit, then the industry would be in a much better place to weather the storm that is currently raging.\n\"But it's not too late to glean some good out of adversity and for businesses to work together to create their own new dawn for the North Sea.\n\"There are a series of levers business leaders can pull, which, as we've seen in the past, can lead to long-term sustained efficiencies and opportunities for their business and the wider industry.\"", "url": "https://www.bbc.com/news/uk-scotland-scotland-business-31361008"}