{"authors": ["Mallory Moench", "www.facebook.com"], "date_download": "2025-04-26 03:40:04", "date_modify": "2025-04-26 03:40:04", "date_publish": "2025-03-05 10:31:42", "description": "The UN says at least 80 community kitchens may run out of stock, and remaining food rations will soon run dry.", "filename": "news_articles_c1jpw5p5e6go_1745638804.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1093/live/62855ca0-f903-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpw5p5e6go_1745638804.html", "title": "Gaza food prices soar after Israel halts aid deliveries", "title_page": "Gaza food prices soar after Israel halts aid deliveries - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Food prices in Gaza have risen sharply and aid food parcels could soon run out after Israel blocked the entry of humanitarian aid, the UN's humanitarian agency said.\nOCHA's partners reported that flour and vegetable prices had more than doubled in some cases, with Gazans telling the BBC the same.\nIf the blockade continued, \"at least 80 community kitchens may soon run out of stock\" and remaining food parcels that \"will support 500,000 people, will soon run out\", OCHA said.\nPrime Minister Benjamin Netanyahu chose to stop aid at the weekend, accusing Hamas of stealing supplies and refusing a US proposal to extend the Gaza ceasefire. A Hamas spokesman said the halt was \"cheap blackmail\".\nThe foreign ministers of France, Germany and the UK issued a joint statement on Wednesday calling the humanitarian situation in Gaza \"catastrophic\" and expressing deep concern at Israel's action.\n\"A halt on goods and supplies entering Gaza, such as that announced by the government of Israel would risk violating international humanitarian law,\" the statement read. \"Humanitarian aid should never be contingent on a ceasefire or used as a political tool.\"\nThe ministers said it was vital that the ceasefire was sustained, all hostages held by Hamas were released, and continued flows of aid were ensured.\nThousands of aid trucks had surged into Gaza each week under the ceasefire deal that started on 19 January.\nAfter the ceasefire's first phase expired on Saturday night, Netanyahu's office accused Hamas of stealing aid \"to finance its terror machine\".\nHamas has previously denied stealing humanitarian aid in Gaza.\nNetanyahu also said Hamas was refusing to accept a six-week ceasefire extension, under different terms from those previously agreed, as proposed by US President Donald Trump's envoy, Steve Witkoff.\nAfter the halt of aid in response, OCHA said on Tuesday that some community kitchens which remain operational \"will need to start to adjust meal content or reduce the number of meals prepared to cope with anticipated shortages\".\nPartners would also \"be forced to reduce food rations\". While they are distributing previously dispatched food parcels, remaining supplies are expected to run out.\nAbu Qais Aryan, from Khan Younis, told BBC Arabic the cost of basic goods doubled over Sunday night. Prices had already doubled or tripled since the war began, he said.\nOther residents said the price of a 1kg (2.2lb) of tomatoes rose overnight from five shekels ($1.38; £1.07) to 10, and a 1kg of cucumbers from six to 17 shekels.\n\"We could barely afford to buy a kilo of tomatoes just to satisfy our hunger,\" said one man, Issam, adding that people could not buy food \"because there is no cash liquidity\".\nIssa Meit, from Gaza City, said there was a shortage of goods and very high consumption, and he was \"very afraid that prices will increase again\".\n\"The recent decision is unfair as it wrongs our children. How will our children live in light of these high prices that will increase in an arbitrary way?\" he said.\nSome blamed merchants for hiking prices, saying they were exploiting the situation.\nMerchant Mahmoud Abu Mohsen told BBC Arabic he raised prices because the wholesalers he purchases from did as well.\n\"For example, I used to buy sugar for five shekels, three shekels, or four shekels, but now I buy sugar for six shekels, meaning I don't make more than a small profit,\" he said. \"The news that Netanyahu announced is what caused a stir among the people.\"\nA spokeswoman for Doctors Without Borders (MSF), Caroline Seguin, told the BBC on Wednesday that in Gaza City, the price of just over 2lb (900g) of sugar had risen from just over $1 (78p) to $5.\nIn Khan Younis and Gaza City, the cost of a carton of 30 eggs had shot up around 150%, she added.\n\"The news has created uncertainty and fear, causing food prices to spike,\" Ms Seguin said in an earlier statement. \"Israel is once again blocking an entire population from receiving aid, using it as a bargaining chip. This is unacceptable, outrageous, and will have devastating consequences.\"\nQatar and Egypt, which helped mediate the ceasefire along with the US, condemned Israel's move.\nQatar's foreign ministry called the decision \"a clear violation of the ceasefire agreement\" and \"international humanitarian law\" in a statement.\nEgypt's foreign ministry accused Israel of using starvation as \"a weapon against the Palestinian people\".\nIsraeli government spokesman David Mencer said in a video briefing that \"Hamas has hoarded for months and months of supplies. They have enough food to fuel an obesity epidemic.\"\n\"The supplies are there but Hamas doesn't share,\" he added.\nA month ago, OCHA said more than a million people - roughly half of Gaza's population - had received food assistance since the ceasefire began.\nAll aid, not just food, is affected by the blockade.\nMedical Aid for Palestinians (MAP) said that inside Gaza, it had some medicine in reserve for its clinics and assistive devices for people with disabilities, in addition to hygiene kits.\n\"However, we don't currently have high aid reserves as most items entering were for immediate distribution,\" the charity said.\nMs Seguin said even though it appeared MSF's medical supplies would last for a few months, \"it doesn't mean that we haven't been consistently running short of essentials\".\nThe main concern for the health system, she said, was fuel for generators at hospitals to ensure ventilators and other critical medical equipment continued to work.\nShe said \"the consequences will be at the cost of the people in Gaza\".\nThe ceasefire aimed to end 15 months of conflict, which erupted after Hamas killed about 1,200 people and took another 251 hostage in its attack on Israel on 7 October 2023.\nIsrael responded with an air and ground campaign in Gaza that killed at least 48,405 people, according to the Hamas-run health ministry.", "url": "https://www.bbc.co.uk/news/articles/c1jpw5p5e6go"}