{"authors": ["Cash Murphy", "www.facebook.com"], "date_download": "2025-04-26 06:36:06", "date_modify": "2025-04-26 06:36:06", "date_publish": "2025-02-27 06:04:35", "description": "The researchers are trying to develop a better understanding into how vision develops in babies.", "filename": "news_articles_cy9dlde2v40o_1745649366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ce8b/live/948e8080-f38d-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dlde2v40o_1745649366.html", "title": "Sussex university study suggests babies' favoured architecture", "title_page": "Sussex university study suggests babies' favoured architecture - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Babies as young as four months prefer complex and varied architecture over more simple designs, a study has suggested.\nThe University of Sussex study was carried out by its Baby Lab, which examines how babies see, think and learn about colour.\nPsychologists showed 26 infants between four and nine months-old, plus 29 adults, pairs of building facades and recorded how long they looked at each.\nDr Philip McAdams, who carried out the research with Baby Lab, said the results of the study were \"surprising because they argue against the common misconception that babies need and want simplicity\".\n\"Our study shows the opposite - that babies from four months are seeking out complexity and variety,\" she said.\nThe researchers found the babies in their study looked for shorter amounts of time when the edges in a building facade pointed in mostly the same directions, but maintained longer eye-contact when the facade edges were more complex and at a variety of angles.\nAnalysis of the babies' eye movements showed their attention was specifically concentrated on the areas of the image with most detail - not across the image as a whole.\nBaby Lab founder professor Anna Franklin said the study showed that by four-months-old, babies' visual skills are \"sufficient to seek out and learn from visual complexity.\"\nShe said that by investigating what babies look at we can \"gain insight into how vision develops and how babies build up a perceptual representation of the world around them\".", "url": "https://www.bbc.co.uk/news/articles/cy9dlde2v40o"}