{"authors": ["Lauren Monaghan", "www.facebook.com"], "date_download": "2025-04-26 06:34:47", "date_modify": "2025-04-26 06:34:47", "date_publish": "2025-02-27 06:21:56", "description": "Gedling Borough Council's former finance officer was jailed last year after taking almost £1m.", "filename": "news_articles_cvg1ergvxl4o_1745649287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d97f/live/b3956d80-f46a-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1ergvxl4o_1745649287.html", "title": "'Significant work' for Gedling Borough Council hit by £1m fraud", "title_page": "'Significant work' for Gedling Borough Council hit by £1m fraud - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council defrauded of nearly £1m by an ex-employee still has work to do to prevent a repeat offence, a meeting has heard.\nAlan Doig, a former finance officer at Gedling Borough Council, was jailed for five years after pleading guilty to fraud by abuse of position and obtaining money transfers by deception over a 19-year period.\nHis activity was uncovered in 2022 and he was subsequently dismissed.\nAuditors examining the authority's accounts said providing assurance the council was making informed decisions and properly managing its financial risks would be a \"significant piece of work\".\nThe council's audit committee met on Tuesday to discuss its external audit report on its financial statements for the 2023-24 financial year, which would be checked by Forvis Mazars.\nIn the firm's annual report of the accounts, it found no significant weaknesses in the authority's financial sustainability or how it improves its economy, efficiency and effectiveness, the Local Democracy Reporting Service said.\nHowever, it did find risks of significant weaknesses in the council's governance, referring to how the authority ensures it makes informed decisions and properly manages risks.\nAudit documents noted \"significant\" IT control deficiencies and the \"privileged access\" given to Doig within the financial system Agresso, which also hindered the completion of the audit.\nAhead of his sentencing in October 2024, Nottingham Crown Court heard Doig joined the authority in 1985 as a clerical assistant and worked his way through the ranks, becoming a \"popular and credible\" employee.\nHe managed a team of staff with responsibility for payroll and creditor payments, as well as a car loan scheme, and used his knowledge of these systems to make illegal payments to himself over two decades to finance a gambling habit.\nHis fraudulent activities were eventually uncovered when a member of his team noticed irregularities with the car loan scheme and raised concerns with a senior colleague, the court heard.\nAfter he was dismissed from the authority, a more detailed investigation conducted by Nottinghamshire Police revealed the extent of his offending and uncovered 86 fraudulent payments totalling £934,343.30.", "url": "https://www.bbc.co.uk/news/articles/cvg1ergvxl4o"}