{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 06:24:19", "date_modify": "2025-04-26 06:24:19", "date_publish": "2025-03-01 00:38:59", "description": "The strippers, dancers and actresses of Anora give us their take on the film's realism - and its limits.", "filename": "news_articles_cqjd051z5ejo_1745648659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2498/live/7c5f9930-f6b8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjd051z5ejo_1745648659.html", "title": "Oscars 2025: Meet the sex workers of Anora now eyeing Academy Awards success", "title_page": "Oscars 2025: Meet the sex workers of Anora now eyeing Academy Awards success - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Luna Sofia Miranda approached Sean Baker in a strip club in New York in 2022, she tried her best to charm him.\nBut he \"very clearly did not want to buy a lap dance,\" she says.\nMiranda, who was 23 at the time, started asking why he and his wife were there.\n\"I'm very nosy,\" she says. \"So I kept asking them questions and I finally got it out of them. They were making a film about strippers.\"\nShe told them she had studied acting, and - after a successful audition - got a call on her 24th birthday, to offer her a part in the film.\nThat film, Anora, is now seen as one of the frontrunners heading into the Oscars on Sunday.\nIt's directed by Baker, and stars Mikey Madison, who plays a New York stripper.\nSince publication of this article, Anora won best picture at the Oscars and Madison won best actress.\nAnora star: Oscar talk is 'overwhelming and amazing'\nMadison, 25, relied on real-life strippers to help her perfect the part.\nWhen she won a Bafta film award last month, she dedicated it to the sex worker community.\n\"I have been able to meet some of that community through my research of the film, and that's been one of the most incredible parts of making the film,\" she told us backstage.\nThey \"deserve respect and don't often get it. And so I had to say something,\" she added.\nWe've been speaking to the actresses, strippers and dancers in the film about their experiences of working on it - and their thoughts on the finished product.\nSome praised the film as realistic, particularly in its portrayal of the rejection and exhaustion that sex workers often feel. But others said the film was \"limited\".\nEdie points to 2020 film Zola, about a waitress who goes to Florida for a weekend of stripping for quick cash. \"I found it hyperbolic, totally overglamourising the work, and it felt like it was talking down to women,\" she said.\n\"And don't get me started on Pretty Woman, which is infuriating, especially the idea of a street worker played by Julia Roberts. Come on.\"\nBut when Edie realised Anora was a Sean Baker film, she changed her mind.\n\"His films are based on realism, he has a fly-on-the-wall style of filmmaking, which I love,\" she said. \"So I was down.\"\nBaker's filmmaking skills were also what attracted Lindsey Normington to the film. The actress and stripper stars as Diamond, Anora's workplace enemy.\nShe says she saw him at afterparty for a film premiere, and went up to him to tell him she was a fan.\nThey connected on Instagram, and months later, he contacted her to tell her he might have a role for her in a new film. \"I fell to my knees in my house,\" Normington said.\nMiranda said a lot of the film's themes, on heartbreak and rejection, were relatable for her.\n\"Sometimes I feel like this shiny toy, that people want to play with. They go, 'wow like you're a stripper. You're so cool.' And then they just cast you aside and abandon you,\" she said.\n\"I think about the ending a lot because I feel like Anora a lot.\"\nEdie agrees, calling the ending \"very relatable and poignant\", adding that it accurately depicts the \"exhaustion and fatigue\" strippers often feel.\n\"The sex industry has trauma built into it. It felt so real. It's an incredible vulnerable industry,\" she said.\n\"You're putting yourself in danger every time you go to work. It's a complex and exhausting job.\"\nBut overall, she said has mixed feelings about the film.\n\"What a lot of stripper films miss - and what Anora starts but doesn't go far enough on - is the moral question around men who buy sex,\" she said.\n\"It's the question of consent. Most of these films shy away from answering it, or looking into it.\"\nShe said it also frustrates her that these characters \"never exist outside their profession\".\n\"[Anora] is a pretty limited character,\" she said. \"We never learn anything about her. The film takes the perspective of [male leads] Igor and Vanya, in defining who she is.\"\n\"It's better than any film I've seen about it, but ultimately it's limited as it's not told by a sex worker,\" she added. \"I can't wait till we're telling our own stories and hopefully this opens the door to that.\"\nWhen Anora came out, special screenings were held for sex workers in New York and LA.\nFootage circulated on social media, external shows the strippers banging their high-heeled platform pleaser shoes together over their heads, to show their appreciation at the end of the screenings.\n\"That is the most beautiful applause I've ever received, I don't know if that will ever happen again,\" Madison told us.\nNow, all eyes are on the Oscars.\nMiranda and Normington will both be attending. \"It's kind of silly to think that I'm going to the Oscars, but [at the same time] I'm at the club arguing with a stupid man over $20,\" said Miranda.\n\"I feel like I'm living two lives.\"\nShe said that Madison is \"spot on\" to say the sex worker community doesn't get the respect it deserves, and said she hopes that Anora's success will change that.\n\"My hope is that if this film wins an Oscar, it marks the beginning of a shift in Hollywood, where sex workers are respected, as workers in their own fields, but also as entertainers,\" she said.\n\"If this film wins an Oscar, I want to see that.\"", "url": "https://www.bbc.co.uk/news/articles/cqjd051z5ejo"}