{"authors": ["Dan Martin", "www.facebook.com"], "date_download": "2025-04-26 08:01:37", "date_modify": "2025-04-26 08:01:37", "date_publish": "2025-02-26 17:25:58", "description": "A 15-year-old boy and 13-year-old girl are accused of killing Bhim Kohli at a park in Leicestershire.", "filename": "news_articles_cn04y5j0d94o_1745654497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8f0b/live/c249d000-f3a7-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04y5j0d94o_1745654497.html", "title": "Bhim Kohli: Jury shown CCTV of children running from scene of fatal attack", "title_page": "Bhim Kohli: Jury shown CCTV of children running from scene of fatal attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jurors have been shown CCTV of two children running away from a park where an 80-year-old man was fatally assaulted.\nBhim Kohli died after he was attacked while walking his dog in Franklin Park, near his home in Braunstone Town, Leicestershire, on 1 September last year.\nA 15-year-old boy and 13-year-old girl, who cannot be named because of their ages, are on trial at Leicester Crown Court accused of killing Mr Kohli.\nCCTV footage, played to the court on Wednesday, showed the pair running away from Franklin Park minutes after it is alleged the girl laughed as she filmed the boy attacking Mr Kohli.\nProsecutors said the boy, who denies charges of murder and manslaughter, racially abused Mr Kohli and kicked and punched him during an \"intense\" attack.\nThe court heard the boy, who was wearing a balaclava, also slapped Mr Kohli on the face with his shoe as the girl, who denies manslaughter, filmed the attack.\nThe jury was taken through the sequence of events leading up to the attack.\nCCTV showed Mr Kohli entering the park at 18:18 GMT at its entrance with Bramble Way, where he lived.\nThe defendants, and three other young people, were shown entering the park from the same direction minutes later.\nLeicestershire Police's major crimes CCTV manager Laura Stevens-Toon told the court the three other young people were then recorded on camera shortly afterwards leaving the same way without the defendants.\nShe said the two defendants were then recorded running after them before the group met up again at the end of Bramble Way.\nHarpreet Sandhu KC, prosecuting, said the male defendant could be seen pulling his balaclava from his head and bending to put his shoes back on.\nMr Sandhu said the group then walked away together towards Braunstone Park.\nHe told the court another CCTV camera later recorded audio of them talking and a male voice was heard saying \"he whacked his head off a log\".\nHe said a female voice was then heard saying: \"Oh, I know. I saw that. It goes 'dhoosh'.\"\nAnother female voice is then heard saying: \"Oh God. It's getting worse. Is there anything else you need to tell us before it gets worse?\"\nA female voice is then heard asking \"have you got anger issues or something?\", the court heard, before a male voice said \"I smacked him.\"", "url": "https://www.bbc.co.uk/news/articles/cn04y5j0d94o"}