{"authors": ["Declan Carey", "www.facebook.com"], "date_download": "2025-04-26 06:38:05", "date_modify": "2025-04-26 06:38:05", "date_publish": "2025-02-26 06:22:52", "description": "Salford City Council agrees to bail out the firm which runs its libraries and leisure centre.", "filename": "news_articles_cwydeq41rw1o_1745649485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4fb2/live/eb16e420-f3b9-11ef-8093-8707b98f6d80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwydeq41rw1o_1745649485.html", "title": "Salford City Council: 'No cuts' to libraries or leisure centre", "title_page": "Salford City Council: 'No cuts' to libraries or leisure centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Library and leisure centre staff in a city will not be cut and opening hours will not be affected despite the operator facing major financial problems, a council has said.\nSalford Community Leisure (SCL) runs sites including Salford Museum and Art Gallery, Salford Sports Village, and several libraries on behalf of Salford City Council.\nSCL is struggling to keep up with rising costs of wages and inflation according to a new report from the city council.\nThe authority agreed to bail out the company with a one-off payment of £350,000 to cover management costs this year.\nThe \"significant\" problems stem from staffing and running costs going up, with recent pay awards costing the company £2.3m over the last three years, the Local Democracy Reporting Service (LDRS) said.\nEmployer national insurance increases will cost SCL an additional £350,000 from April, alongside a yearly repair overspend of £50,000 \"and additional pressures\" from the Clarendon Leisure Centre fire last year.\nThe city council agreed to bail out the company with a one-off payment of £350,000 to cover management costs this year, but as much as £1.5m could be needed as soon as next year.\nSCL's reserves have been \"wiped out\" to cover the rising running costs, the report stated, leaving the firm in a \"critical\" situation.\nIt is hoped cash from the council will help SCL to start building its reserves back up and get to a point where it can make enough money to cover costs.\nA council officer said the city's libraries and leisure services are \"areas of review\" for the future, but the council told the LDRS there is currently no talk of changes to opening hours and staff levels.\nThe officer added the council has set up monthly meetings with the company to try and turn things around.", "url": "https://www.bbc.co.uk/news/articles/cwydeq41rw1o"}