{"authors": ["Gavin Kermack", "Lee Blakeman", "www.facebook.com"], "date_download": "2025-04-26 04:20:01", "date_modify": "2025-04-26 04:20:01", "date_publish": "2025-03-03 16:06:21", "description": "People fear the liquidation of a firm running a smelly landfill site could add to their woes.", "filename": "news_articles_c3w1dydl4jno_1745641201.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ac7/live/027a2d40-fda4-11ef-8989-9d6f464f1b15.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w1dydl4jno_1745641201.html", "title": "Walleys Quarry: what next, ask Silverdale residents", "title_page": "Walleys Quarry: what next, ask Silverdale residents - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"We're still going to have this smell for years and years until they sort it out.\"\nLiving just down the road, Liz Forster knows all about the stench that has emanated for years from the Walleys Quarry landfill site.\nShe and fellow Silverdale residents were celebrating in November, after the site was ordered to close, following years of complaints about the smell.\nToday though, they are less optimistic after Walleys Quarry Ltd (WQL) - which has been contacted for comment - went into liquidation, with the question arising over who will be responsible for it now.\n\"We're still going to have this smell for years and years until they sort it out,\" said Ms Forster.\nComplaints about the stench stretch back to 2011, with last year's Environment Agency (EA) closure notice saying it was badly managed and that its continued operation could lead to significant long-term pollution.\nWQL was then ordered to cap the site to prevent the further escape of gas and smells.\nMs Forster says however, that it feels like the firm is taking the easy option to escape its responsibilities.\n\"I just feel a bit like they've gone, 'Ok, well we knew this was coming,\", she said.\n\"They've realised their lawyers aren't going to help them win any kind of appeal, so this is what they've done.\"\nThe EA has said it will be working with the liquidators to ensure they comply with the environmental requirements of the closure notice.\nBut for Steve Meakin, co-founder of the Stop the Stink campaign group, the question is one of accountability.\nHe says the site is damaging people's health, something it has done for years.\n\"Our young children in this community are going to suffer for many many years because of this,\" he said.\n\"[WQL] should not be allowed to just walk away on the premise that they've gone into liquidation.\"", "url": "https://www.bbc.co.uk/news/articles/c3w1dydl4jno"}