{"authors": ["Aisha Iqbal", "www.facebook.com"], "date_download": "2025-04-26 03:52:31", "date_modify": "2025-04-26 03:52:31", "date_publish": "2025-03-03 10:12:21", "description": "A quarrying firm had planned to swap an area of common land in Haworth for another larger site.", "filename": "news_articles_c74kzlvyym9o_1745639551.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6b3d/live/46ef9960-f5e8-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c74kzlvyym9o_1745639551.html", "title": "Haworth quarry land swap plan in 'Brontë country' rejected", "title_page": "Haworth quarry land swap plan in 'Brontë country' rejected - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to expand a sandstone quarry in Bradford's Brontë country have been blocked by a Government inspector for a second time after a land swap offer was rejected.\nCompany Dennis Gillson and Son wanted to extend its existing Naylor Hill Quarry on to a 3-acre stretch of common land at Brow Moor in Haworth.\nThe firm had offered to swap the land for a site that was more than twice the size, about 2km (1.2 miles) away.\nHowever, campaigners argued the replacement land did not \"measure up\" and a government inspector agreed that deregistering the site as common land \"would deter a proportion of the public from walking on it.\"\nGillsons, originally a family firm with a long history in Haworth, had won permission from Bradford Council for an expansion.\nBut the company also needed consent from the Secretary of State to remove the common land designation and complete the land swap.\nConservation group the Open Spaces Society opposed the swap, arguing the new land was inaccessible for locals and lacked the character of the original space.\nThey also feared farmers would find it difficult to let their livestock graze on the new land because of a lack of a reliable water supply.\nA spokesperson for Gillsons said the decision to reject its plans had put the future of the firm in doubt.\nRefusing consent in his ruling, the inspector said the remoteness of the new site \"would negatively outweigh any…benefits.\"\nHe concluded that Brow Moor had much \"positive ecological value\", but the replacement site offered \"would deter a proportion of the public from walking on it\".\nHugh Craddock, case officer at the Open Spaces Society, said the land swap offer was \"inadequate and inappropriate\".\n\"It would have replaced the joy of the heather and gorse-covered heights of Brow Moor with characterless enclosed fields,\" he said.\n\"The public would hardly know the replacement common land existed.\"\nHe said: \"We're not against quarry extensions outright.\n\"But if developers want to take away part of the common, they need to offer something genuinely worthwhile in return. This proposal just didn't measure up.\"", "url": "https://www.bbc.co.uk/news/articles/c74kzlvyym9o"}