{"authors": ["Thomas Mackintosh", "Will Grant", "www.facebook.com"], "date_download": "2025-04-26 07:04:13", "date_modify": "2025-04-26 07:04:13", "date_publish": "2025-02-28 07:31:31", "description": "Rafael Caro Quintero arrived in New York late on Thursday and was escorted by FBI agents.", "filename": "news_articles_cx2995y25lyo_1745651053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dbeb/live/716a5060-f5a0-11ef-8fb0-67b44ba4a77d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2995y25lyo_1745651053.html", "title": "Notorious Mexican drug lord among 29 cartel members extradited to US", "title_page": "Notorious Mexican drug lord among 29 cartel members extradited to US - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mexico has extradited 29 alleged drug cartel members to the United States – including high-profile gang leaders.\nThose extradited include notorious drug lord Rafael Caro Quintero who has been wanted by the US for the murder of an American agent 40 years ago.\nThe move – considered to be of the biggest extraditions in Mexico's history – is seen as a major step in bilateral security relations between the two countries.\nIt comes after US President Donald Trump threatened to impose tariffs on imports from Mexico earlier this year, accusing it of failing to tackle drug trafficking and mass migration.\n\"As President Trump has made clear, cartels are terrorist groups, and this Department of Justice is devoted to destroying cartels and transnational gangs,\" US Attorney General Pam Bondi said in a statement on Thursday night.\n\"We will prosecute these criminals to the fullest extent of the law in honour of the brave law enforcement agents who have dedicated their careers – and in some cases, given their lives – to protect innocent people from the scourge of violent cartels,\" she added.\nCaro Quintero is one of the founding members of the Guadalajara Cartel and a linchpin in the creation of modern Mexican drug-trafficking.\nHe was wanted in the US in connection with the torture and murder of a Drug Enforcement Administration (DEA) agent, Enrique 'Kiki' Camarena, in 1985.\nCaro Quintero was arrested at the time and spent 28 years in prison in Mexico before being released in 2013 – much to the anger of the Americans.\nBut in 2022, aged in his 70s, he was recaptured by the Mexican Navy after a dog found him hiding in bushes.\nReacting to Caro Quintero's extradition DEA Acting Administrator Derek Maltz hailed the move as a \"victory for the Camarena family\".\nHe added: \"Today sends a message to every cartel leader, every trafficker, every criminal poisoning our communities: You will be held accountable.\n\"No matter how long it takes, no matter how far you run, justice will find you.\"\nQuintero is expected to appear in court in New York on Friday.\nOther fugitives extradited include the founders of the brutal Zetas Cartel - Miguel Angel Treviño and his brother Omar Treviño.\nKnown as Z-40 and Z-42 respectively, the two men ran the feared organisation for years before its eventual demise in the mid 2010s.\nMiguel Treviño, who was arrested by Mexican marines in July 2013, was wanted on both sides of the border for ordering massacres and running drugs on a global scale.\nOmar Treviño - who was wanted in the US and Mexico on charges of drug trafficking, kidnap and murder - was captured by security forces in Monterrey in March 2015.\nTheir criminal empire spanned a wide range of illicit activities including cocaine-smuggling, people trafficking, extortion, gun-running and kidnappings.\nPolice in Webb County, Texas, confirmed the brother's extradition and warned Americans from crossing into Mexico for fear of reprisals.\nAmong the other prominent figures included in the extradition are former Juarez Cartel boss Vicente Carrillo Fuentes and Andrew Clark, a Canadian citizen accused by US authorities of being part of a massive US and Canada drug smuggling ring that was allegedly run by former Olympic snowboarder Ryan James Wedding.\nAccording to the justice department, six of the 29 detainees could be subject to the federal death penalty, which the Trump administration restored on the first day of his administration.\nThe agreement marks a significant departure for the Mexican government, which has historically resisted extraditing its citizens if they might face capital punishment.", "url": "https://www.bbc.co.uk/news/articles/cx2995y25lyo"}