{"authors": ["Gráinne Connolly", "www.facebook.com"], "date_download": "2025-04-26 07:29:31", "date_modify": "2025-04-26 07:29:31", "date_publish": "2025-02-27 18:20:46", "description": "Older people gathered outside the Department for Communities in Belfast calling for the payments to be restored.", "filename": "news_articles_ckg112g1n19o_1745652571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bb88/live/0bb6a810-f530-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg112g1n19o_1745652571.html", "title": "'Sitting in the house with coats on' after winter fuel payment cuts", "title_page": "'Sitting in the house with coats on' after winter fuel payment cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's 2025 and you're sitting in the house with coats on to keep warm, that's ridiculous.\"\nThat is just one of the struggles facing people like Denis Loughlin affected by cuts to winter fuel payments.\nHe was among protesters that gathered outside the Department for Communities (DfC) headquarters in Belfast on Thursday calling for the payments to be restored.\nLast summer, the UK government said winter fuel payments would be means tested and only go to pensioners on certain benefits.\nStormont's Communities Minister Gordon Lyons said while he did not agree with the move, Stormont would be maintaining parity with the rest of the UK.\nBut he said pensioners in Northern Ireland affected by the cuts would get a one-off £100 payment.\nIt was estimated about 249,000 pensioners in Northern Ireland were going to be affected by cuts to winter fuel payments this year.\nDuring Thursday's demonstration, which was organised by Unite the union's retired members, campaigners handed over thousands of consultation responses demanding the payments be re-established.\nThey said the £100 payment per household fell \"far too short\" and it has yet to materialise.\n\"I'm one of the many thousands that gets the bare minimum because I'm £3 over the limit so I don't get pension credit, nothing. I've just my pension and that's it,\" Mr Loughlin said.\n\"It's harder now because I don't have that extra £200 or £300.\n\"I'm having to pay my rates, then electric and gas on top of all that.\"\nMr Loughlin said many older people were struggling and having to choose between heating their homes and eating.\n\"I know personally a friend of mine and they're exactly at that point,\" he said.\n\"They've said 'If I put the heating in, I haven't got enough money to buy food' or vice versa.\n\"It's ridiculous, it's terrible in this day and age.\"\nThe communities minister said the demonstration was a reminder of how the Labour government \"disgracefully\" cut the winter fuel payment from thousands across Northern Ireland.\n\"There are some people that are just at the borderline, that don't qualify for pension credit or other benefits,\" Lyons said.\nHe said every year the winter fuel payment \"helped them to get by\".\n\"We'll do what we can as an executive but ultimately the government need to recognise they made a mistake and they need to reverse course.\"\nUnite has also launched a legal action through a judicial review against the winter fuel payment cut, arguing the cut is unlawful and risks increasing cold-related deaths among older people.", "url": "https://www.bbc.co.uk/news/articles/ckg112g1n19o"}