{"authors": ["James Aldridge", "www.facebook.com"], "date_download": "2025-04-26 03:58:59", "date_modify": "2025-04-26 03:58:59", "date_publish": "2025-03-04 06:16:32", "description": "More than 10,000 fines were issued in Reading in a single year - over 4,000 of which were on one road.", "filename": "news_articles_cvg1vqw2zg7o_1745639939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8db6/live/0dbf56d0-f845-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1vqw2zg7o_1745639939.html", "title": "Reading CCTV cars issue 4,000 parking fines on Oxford Road", "title_page": "Reading CCTV cars issue 4,000 parking fines on Oxford Road - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than 4,000 parking fines were issued on a single street in a year, data has shown.\nReading Borough Council has electric cars with CCTV equipment which patrol the town taking photos of drivers who break parking rules.\nOf the 10,408 penalty charge notices (PCNs) issued by the cars in the 2023/24 municipal year, 4,485 were on Oxford Road.\nThe figures, which were revealed in the council's Annual Parking Service Report 2023/24, will be discussed by the council's traffic management sub-committee on Thursday.\nFriar Street was the second highest, with 1,227 fines issued - knocking out Wokingham Road with 1,039 fines - which was the second highest last year.\nThe majority of the fines issued by the cars in the borough were for drivers caught stopping along the red route, which bans parking along the route at any time.\nThe remainder were for drivers who wrongfully parked in bus stops and stands, or on \"School: Keep Clear\" markings, according to the Local Democracy Reporting Service.\nAll of these are classed as higher-level PCNs that come with a fine of £70, reduced to £35 if paid within 21 days of receiving a postal notice.\nThe total figure is an increase of 306 compared to the 10,102 which were issued in 2022/23.", "url": "https://www.bbc.co.uk/news/articles/cvg1vqw2zg7o"}