{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:05:44", "date_modify": "2025-04-26 07:05:44", "date_publish": "2025-02-28 06:23:47", "description": "Campaigners are calling for plans to build a holiday park in Hamsterley Forest to be rejected.", "filename": "news_articles_c9q44w29l3zo_1745651144.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c95/live/9cb4dc50-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q44w29l3zo_1745651144.html", "title": "Forest holiday park plan sparks legal objections", "title_page": "Hamsterley Forest holiday park plan sparks legal objections - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners have claimed plans for a forest holiday park are missing important documents and have used out-of-date travel information.\nForestry England is working with two private firms to build 70 cabins, a campsite and a Go Ape high rope course in Hamsterley Forest, in County Durham.\nA lawyer for a group campaigning against the park said the plans lacked flood risk and protected species assessments and used travel data from July 2021, when some Covid-19 restrictions were still in place.\nForestry England said no major concerns with its documents had been flagged by Durham County Council and it was collecting more information to satisfy public feedback.\nIn the letter sent on behalf of the Hamsterley Forest Action Group, barrister Nicola Allan said the planning application was \"not fit for validation\".\n\"The lack of information and inconsistencies taken as a whole are so grave that if the council proceeded to approve this application then it is likely to be quashed on judicial review,\" she said.\nShe claimed there were \"serious inaccuracies\" in the transport statement, drawings and travel plan, including failing to mention a road connecting Hamsterley village to the A68 being closed for two years due to subsidence.", "url": "https://www.bbc.co.uk/news/articles/c9q44w29l3zo"}