{"authors": ["Alex Blake", "www.facebook.com"], "date_download": "2025-04-26 04:40:39", "date_modify": "2025-04-26 04:40:39", "date_publish": "2025-03-02 07:16:47", "description": "A election to fill four vacant seats on the upper chamber of the parliament takes place on Tuesday.", "filename": "news_articles_cdxqq37wkyro_1745642439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/52c0/live/1f703d20-f5e5-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxqq37wkyro_1745642439.html", "title": "Isle of Man's Legislative Council and what it does explained", "title_page": "Isle of Man's Legislative Council and what it does explained - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The oldest continuous parliament in the world, Tynwald dates back more than 1,000 years and has its roots in the Viking Age.\nThe tri-cameral parliament is made up of the House of Keys and the Legislative Council, which as well as sitting separately in their own chambers come together as one body.\nAnd the ancient parliament could welcome up to four new members to the Council on Tuesday as the latest round of elections to the upper chamber takes place.\nAn advisory body with its origins in the medieval period, its powers changed significantly during the 20th Century leaving it predominately seen as a revising chamber for new laws in modern times.\nThe Council's make up sees eight MLCs chosen by members of the democratically elected House of Keys joined by the President of Tynwald, who is elected by all 32 Manx national politicians in a separate contest to preside over sittings.\nThe Lord Bishop of Sodor and Man is also a member with voting rights, while the Attorney General takes part in sittings but does not have a vote.\nThe council predominantly debates and votes on primary legislation, and sometimes asks and answers questions.\nWhile much of its work involves scrutinising new legislation in its own chamber after it has passed through its stages in the House of Keys, MLCs also take part in the monthly Tynwald sittings.\nMembers also often take on roles within the government departments and can be chosen to serve on Tynwald scrutiny committees.\nAlthough the majority of bills originate in the House of Keys, members of the upper chamber can bring forward proposed legislation of their own for progression.\nSuccessful candidates will earn a basic annual salary of £71,659.\nThe eight MLCs are elected by MHKs for a term of five years, with elections taking place in two tranches of four seats in different years to maintain and element of continuity within the Council.\nThe end of the term of office that triggered the latest vacancies was 28 February.\nThis is the first election process whereby prospective members have had to complete an application form to be considered.\nIt was among a raft of changes approved by Tynwald last year, following several recommendations to reform the election process by the Standing Orders Committee.\nThat meant candidates in the latest election were the first to be required to fill out an application from in the first instance, which had to include a curriculum vitae, followed by an applicants' conference to allow potential candidate to meet MHKs.\nThose elected must take oaths of fidelity to King Charles III, as Lord of Man, before taking up their seats.\nThe President of Tynwald then welcomes the new members to the parliament and presents them with a copy of the Standing Orders of the Legislative Council.\nAlthough ceremonies were in the past held in private, more recently have been carried out in the Legislative Council chamber for family and supporters to witness.\nThe first sitting of the newly formed council be in their own chamber on 11 March.\nOne of the first items before the new members when they meet for the first time on 11 March could be the Assisted Dying Bill 2023, which is set to return to the upper chamber after MHKs votes to make further changes to it last week.", "url": "https://www.bbc.co.uk/news/articles/cdxqq37wkyro"}