{"authors": ["John Wimperis", "www.facebook.com"], "date_download": "2025-04-26 03:50:27", "date_modify": "2025-04-26 03:50:27", "date_publish": "2025-03-05 12:44:20", "description": "The charges have proved controversial as locals say there is not an air quality issue and they have to use cars to get around.", "filename": "news_articles_ckg8le08qd3o_1745639427.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6130/live/e46d3fa0-f9b0-11ef-b257-2b725ccbdd87.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg8le08qd3o_1745639427.html", "title": "Free car parks in Somerset start charging based on emissions", "title_page": "Free car parks in Somerset start charging based on emissions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three free car parks have started charging drivers based on how polluting their vehicle is.\nThe car parks in North East Somerset use vehicle information linked to number plates to determine fees between £1.20 and £1.80 for the third hour of parking, following two free hours.\nBut traders near Radstock's Church Street and Waterloo Road car parks and Midsomer Norton's South Road car park are worried that footfall will decrease.\nBath and North East Somerset Council's Mark Elliott previously said charging \"would make it easier for shoppers to find parking by encouraging turnover of spaces\".\nThe charges have proved controversial for the Somer Valley towns, where locals say there is not an air quality issue and they have to use cars to get around, according to the Local Democracy Reporting Service.\nSpeaking last year about plans for the emissions-based charges, Elaine Cousins of model shop Signals on Midsomer Norton High Street, said: \"My first thought was that it will kill the town.\"\nEmissions-based charges were introduced to all council car parks in Bath in 2023.\nThe council had planned to use the proceeds of the fees to install CCTV and lighting in the Radstock and Midsomer Norton car parks as safety measures.\nBut it has delayed these installations by a year, freeing up £210,000 for its 2025/26 budget.\nMr Elliott, a Liberal Democrat, said that the CCTV and lighting costs would add \"unfunded risk\" to the budget – but added they could still be installed if resources are available.\nIndependent councillor Shaun Hughes wants the Liberal Democrat-led council to go ahead with the installations, warning that its own reports had identified safety issues.\nHe said: \"Delaying investment into a car park that now charges our residents risks harming our economy by reducing trade and discouraging footfall.\"\nMr Hughes tabled an amendment to reinstate the investment but it was voted down.", "url": "https://www.bbc.co.uk/news/articles/ckg8le08qd3o"}