{"authors": ["Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 03:52:11", "date_modify": "2025-04-26 03:52:11", "date_publish": "2025-03-03 10:33:02", "description": "There was \"significant uptake\" in the pilot and 15,000 were distributed, Healthwatch says.", "filename": "news_articles_cvg1vjdx9peo_1745639531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea0a/live/e35b8b30-f834-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1vjdx9peo_1745639531.html", "title": "NHS urged to rollout QR trauma cards after Essex trial", "title_page": "NHS urged to rollout QR trauma cards after Essex trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The NHS should introduce pocket-sized cards listing patients' traumas to help \"empower\" survivors when they seek health care, a patient champion group said.\nHealthwatch England said the cards, with a QR code on them, could discreetly alert health workers that they were caring for someone who has experienced trauma, and detail how to effectively look after them.\nA trial in Essex found the cards were a \"helpful tool\" for patients, Healthwatch said, as it called for a national pilot.\nChief executive Louise Ansari said the experiences of vulnerable patients could be improved by a national rollout of the scheme.\nThe cards were designed to be handed to a healthcare professional when a holder was in a \"triggering\" situation.\nThey had a QR code that, when scanned, provided more information to the healthcare professional about what the individual was experiencing and how best to help.\nOne patient, who used the card during the pilot, said: \"I find it very helpful - because of the anxiety I just shut down and can't talk.\n\"Knowing I've got the card means I'm less likely to be triggered. It's like that comfort blanket. It takes that stress off you.\"", "url": "https://www.bbc.co.uk/news/articles/cvg1vjdx9peo"}