{"authors": ["Alice Smith", "www.facebook.com"], "date_download": "2025-04-26 04:30:03", "date_modify": "2025-04-26 04:30:03", "date_publish": "2025-03-03 06:26:29", "description": "The challenge was inspired by the boys' grandfather who battled MND for two years.", "filename": "news_articles_c9vykxz097po_1745641803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0870/live/866f67c0-f361-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vykxz097po_1745641803.html", "title": "Somerset brothers complete unique cricket challenge for MNDA", "title_page": "Somerset brothers complete unique cricket challenge for MNDA - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three brothers raised nearly £4,000 for charity by completing a unique cricket challenge.\nTom, James, and Charlie, aged 16, 14, and 12, ran a lap at all 18 first-class county cricket grounds in England over four days, covering more than 1,200 miles with their father.\nThe challenge was inspired by their grandfather, David, who battled motor neurone disease (MND) for two years before his death in December 2023.\nThe boys completed the challenge in July and August 2024 and this week they handed over £3,755 to the Motor Neurone Disease Association (MNDA).\nAs keen cricketers, the brothers wanted to honour their granddad's love for the sport while raising money to support families living with the condition.\nAlong the way, they attended matches at Headingley in Leeds, Lord's in London, the Utilita Bowl in Southampton, and Somerset's County Ground.\nSpeaking to BBC Radio Somerset, Tom said: \"Our granddad loved cricket. He was a member of Somerset County Cricket Club, so we thought it would be nice to visit all 18 first-class grounds.\n\"Lord's was particularly special - it's the home of cricket, and there was a women's Hundred game on. It was surreal to be there.\"\nTheir father Richard said when his dad was diagnosed with MND in 2022 one of the biggest impacts was losing his voice.\n\"The MNDA provided a tablet that allowed him to communicate, which was invaluable to us as a family.\n\"Without the association's support, we wouldn't have had that connection with him,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c9vykxz097po"}