{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 04:15:13", "date_modify": "2025-04-26 04:15:13", "date_publish": "2025-03-04 10:38:29", "description": "Northern is using Harris hawks to deter pests at railway stations in Beverley, Driffield and Filey.", "filename": "news_articles_cly38515jmjo_1745640913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a518/live/53265790-f8dc-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly38515jmjo_1745640913.html", "title": "Top gun Maverick swoops in to end pigeon chaos", "title_page": "Top gun Maverick swoops in to end pigeon chaos at train stations - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two birds of prey will patrol the skies above three railway stations in an attempt to bring an end to a \"pigeon problem\".\nThe Harris Hawks, called Maverick and Zulu, have been introduced in Beverley and Driffield, East Yorkshire, and Filey, in North Yorkshire, as part of a three-month trial.\nTrain operator Northern, which run the stations, said the birds were being used to deter pigeons and prevent them from nesting, rather than for hunting.\nAlex Hornby, commercial and customer director, said: \"We have tried plastic owls and recorded hawk noises but they weren't an effective deterrent.\"\nHe added: \"The pigeons are a real nuisance for our customers and cause headaches for the station staff who have to clear up after them.\"\nNorthern said it had been \"locked in a long-running battle\" with pigeons because of damage and corrosion caused by droppings.\nLast year, the roof at Driffield station was smeared with fire gel, which appears as ultraviolet light to pigeons and tricks them into thinking a surface is too hot to land on.\nHowever, instead of solving the issue, the birds flocked to other parts of the station.\nNorthern has previously asked customers to stop feeding birds and avoid leaving food lying around.\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cly38515jmjo"}