{"authors": ["Lucy Gilder, Jake Horton & Ben Chu", "www.facebook.com"], "date_download": "2025-04-26 03:40:19", "date_modify": "2025-04-26 03:40:19", "date_publish": "2025-03-05 10:14:01", "description": "BBC Verify has looked into several claims made by Trump during his speech to Congress.", "filename": "news_articles_cp3ylpd2n9no_1745638819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9c65/live/633820b0-f999-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3ylpd2n9no_1745638819.html", "title": "Fact-checking Donald Trump's speech to Congress", "title_page": "Fact-checking Donald Trump's speech to Congress - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In his address to Congress, which ran for more than an hour and a half, President Donald Trump made a series of claims about the state of the US under his predecessor Joe Biden and the achievements of his first weeks in office.\nHe returned to key campaign themes including illegal immigration, rising prices and what he called \"appalling waste\" in government spending.\nBBC Verify has looked into the facts behind some of his key claims.\nTrump said he inherited an \"economic catastrophe\" from Biden.\nThis is misleading. The US economy was growing at an annual rate of 2.3% in the final quarter of 2024 under the previous administration. It expanded by 2.8% over 2024 as a whole according to official US statistics., external\nThe International Monetary Fund estimates, external that the US growth rate in 2024 was faster than any other nation in the G7.\nOn rising prices, Trump added \"we suffered the worst inflation in 48 years, but perhaps even in the history of our country\".\nInflation under Biden peaked at 9.1% in June 2022 - the highest level since 1981 - so not quite as far back as Trump claimed.\nThe 2022 peak was in the context of high inflation in the rest of the world in the wake of the Covid pandemic and a global energy shock. The inflation rate had dropped to 3% by the time Trump took office.\nInflation has also been much higher than 9% at several other points in US history, including the 1940s and 1920s, external.\nTrump went on to blame Biden for egg prices, claiming he \"let the price of eggs get out of control\".\nPrices are high, but this has been linked to a bird flu outbreak in the US.\nEgg prices rose under Biden in 2023, and in January a dozen eggs averaged over $5, according to the US Department of Agriculture (USDA). That is 53% above the average for the whole of 2024.\nThe USDA has said a bird flu outbreak has led to US farmers having to kill millions of chickens, creating egg shortages, and has announced a $1bn (£780m) plan to help combat the issue.\nThe outbreak started in February 2022 and last year the Biden administration allocated more than $800m to tackle it.\nThe Trump administration recently fired a number of USDA officials who worked on the government's response to bird flu as part of cost-cutting measures by the Department of Government Efficiency (Doge). They are now reportedly attempting to rehire some of them.\nTrump praised Elon Musk's Department of Government Efficiency (Doge) and claimed the advisory body had found \"hundreds of billions of dollars of fraud\" in federal government spending.\nNo evidence has been provided for this figure.\nOn its official website, Doge states that it has saved an estimated $105bn, external, from fraud detection, contract and grant cancellations, real estate lease terminations, asset sales, workforce reductions, programmatic changes, and regulatory savings.\nHowever, that figure cannot be independently verified as, so far, Doge has only published \"receipts\" for contract, grant and real estate lease cancellations on the website. These add up to about $18.6bn. We have asked the White House for evidence of the remaining $86bn of savings.\nUS media outlets have also highlighted some accounting errors. For example, Doge initially listed its largest saving of $8bn from scrapping an immigration agency contract - it later corrected this to $8m.\nSpeaking about his actions to tackle illegal immigration, Trump said that \"as a result, illegal border crossings last month were by far the lowest ever recorded\".\nThis is true.\nIn February 2025, 8,326 encounters of migrants at the south-west border with Mexico were recorded by US Border Patrol, external.\nThis is the lowest level since monthly records began in 2000.\nBy comparison, there were 140,641 encounters by US Border Patrol at this border in February last year under Biden.\nNumbers fell to 47,316 in December 2024, external.\nContinuing with illegal migration, Trump claimed: \"Over the past four years, 21 million people poured into the United States\".\nThere is no evidence for a figure this high.\nEncounters with migrants at the borders - a measure of illegal migration - reached 10 million under Biden but this does not mean this many people stayed in the US.\nIt is impossible to know exactly how many illegal immigrants have come to the US, as many will have evaded law enforcement agencies, but several estimates put the number at around half what Trump stated.\nA report published by the Office of Homeland Security, external last year estimated the number of illegal immigrants living in the US, as of January 2022, at 11 million.\nIt says about a fifth of them arrived in 2010 or later but the majority arrived before this time, some as early as the 1980s.", "url": "https://www.bbc.co.uk/news/articles/cp3ylpd2n9no"}