{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:12", "date_modify": "2025-05-19 15:38:12", "date_publish": "2015-02-20 12:48:31", "description": "A paedophile priest from County Antrim is dismissed from the priesthood by Pope Francis three years after he was jailed for sex crimes.", "filename": "news_uk-northern-ireland-31553606_1747669092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81132000/jpg/_81132984_donaghy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31553606_1747669092.html", "title": "James Martin Donaghy: Pope dismisses Lisburn paedophile priest", "title_page": "James Martin Donaghy: Pope dismisses Lisburn paedophile priest - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A convicted paedophile priest from County Antrim has been dismissed from the priesthood by Pope Francis.\nJames Martin Donaghy, originally from Lady Wallace Drive, Lisburn, is serving a 10-year jail sentence for abusing three victims, following a 2011 trial.\nIn 2013, he admitted indecently assaulting a boy and was given two more years in jail, to run concurrently.\nDonaghy stepped down from his duties in 2004 and has not worked as a priest since, but is now banned from ministry.\nThe Bishop of Down and Connor Noel Treanor said that his diocese had been informed of the Pope's decision by the Vatican's Congregation of the Doctrine of the Faith.\n\"This means that Mr Donaghy is not permitted to function as a priest under any circumstance, public or private,\" the bishop's statement said.\nHe added: \"On behalf of the priests and people of the Diocese of Down and Connor, I again extend my deepest sorrow and apologise to survivors who suffered such pain at the hands of someone in whom they had placed their trust.\n\"I hope that this decision will assist those affected on their journey towards healing.\"\nAt his 2011 trial, Donaghy was found guilty of 23 sex abuse charges committed against three teenagers on dates between June 1983 and December 2000.\nHis victims were an altar boy and two young trainee priests.\nIn June 2013, he was convicted of abusing a fourth victim, when he pleaded guilty to four charges of indecently assaulting a boy in 1989 and a further charge of common assault.\nWhen he was sentenced the following month, the court heard that at the time of the 1989 offences, Donaghy was working a priest in the west Belfast parish of Corpus Christi, Ballymurphy.\nHe told the youngster he could get his dead grandfather into heaven as he sexually abused him.\nThe judge added two years to Donaghy's original sentence, but as the terms will run concurrently, he will spend no additional time in prison for abusing the fourth victim.", "url": "https://www.bbc.com/news/uk-northern-ireland-31553606"}