{"authors": ["Paul Kirby", "www.facebook.com"], "date_download": "2025-04-26 03:39:45", "date_modify": "2025-04-26 03:39:45", "date_publish": "2025-03-05 11:03:05", "description": "Germany's likely chancellor-to-be announces a political deal to raise hundreds of billions of euros in extra spending.", "filename": "news_articles_c981w25y5wpo_1745638785.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b091/live/3c8c5b90-f9ab-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981w25y5wpo_1745638785.html", "title": "Germany's Merz promises to do 'whatever it takes' on defence", "title_page": "Germany's Merz promises to do 'whatever it takes' on defence - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Friedrich Merz, who's expected to become Germany's next chancellor, has announced a political deal to raise hundreds of billions of euros in extra spending on defence and infrastructure.\n\"In view of the threats to our freedom and peace on our continent, the rule for our defence now has to be 'whatever it takes',\" he said.\nMerz, whose conservatives won Germany's election last month, said he and his likely coalition partners from the centre left would put new proposals to parliament next week.\nHe has spoken of a need for urgency on German spending in light of \"recent decisions by the American government\".\nMerz, 69, did not elaborate but he has been outspoken in his criticism of President Donald Trump's treatment of Ukraine's Volodymyr Zelensky in the Oval Office.\nEarlier this week he said European leaders had to show \"we are in a position to act independently in Europe\".\nAt a news conference on Tuesday, alongside leaders from the Social Democrats and his conservative sister party in Bavaria, Merz said Germany was counting on the US to stand by \"mutual alliance commitments... but we also know that the resources for our national and alliance defence must now be significantly expanded\".\nMerz said, in English, he would do \"whatever it takes\" to protect freedom and peace - a reference to Mario Draghi's vow to save the euro in 2012 when he was European Central Bank president.\nAt the heart of his proposals is a special €500bn (£415bn) fund to repair Germany's creaking infrastructure, as well as loosening stringent budget rules to allow investment in defence.\nIn the wake of Europe's financial crisis, Germany imposed a \"debt brake\" or Schuldenbremse, limiting the budget deficit to 0.35% of national economic output (GDP) in normal times.\nThe new defence proposal recommends that \"necessary defence spending\" above 1% of GDP should be exempt from debt brake restrictions, with no upper limit.\nAlthough Germany has provided more aid to Ukraine than any other European country, its military is notoriously underfunded.\nOlaf Scholz's Social Democrat-led government set up a €100bn fund after Russia's full-scale invasion of Ukraine in 2022, but most of that has already been allocated.\nGermany will have to find an extra €30bn a year just to meet the current Nato target of 2% of GDP on defence, and security experts believe it will need to raise its target closer to 3%.", "url": "https://www.bbc.co.uk/news/articles/c981w25y5wpo"}