{"authors": ["Liv McMahon", "www.facebook.com"], "date_download": "2025-04-26 06:54:18", "date_modify": "2025-04-26 06:54:18", "date_publish": "2025-02-28 16:05:36", "description": "Thousands of users reported problems on Friday, but the Meta-owned company says the issue is now resolved.", "filename": "news_articles_c5y0r8wdk62o_1745650458.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cbd1/live/0b520180-f5ee-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0r8wdk62o_1745650458.html", "title": "WhatsApp says technical issue reported by thousands now resolved", "title_page": "WhatsApp says technical issue reported by thousands now resolved - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Messaging service WhatsApp went down briefly on Friday afternoon, thousands of users reported.\nDowndetector, a site which monitors platform outages, received more than 50,000 reports from users shortly after 15:30 GMT, which began to decline soon after.\nWhatsApp said the issues, largely impacting users' ability to send messages, had now been resolved.\n\"We know some people briefly had trouble sending messages on WhatsApp,\" a spokesperson told the BBC. \"We've fixed the issue.\"\nSome users reported problems affecting Facebook and Facebook Messenger, but in much fewer numbers than WhatsApp.\nThe end to end encrypted messaging app, acquired by Meta in 2014, has nearly three billion users worldwide.\nMeta's last mass global outage affected WhatsApp and Instagram in December.\nThe company's boss Mark Zuckerberg told investors at the end of January that the company was \"making progress towards becoming the leading messaging platform in the US like it is in a lot of the rest of the world\".\nIn October, he said more than two billion calls were happening globally on the app every day.\nBut the scale of the app's user base can mean that any glitches are felt by millions of users across the globe.\nHowever, few of the recent technical difficulties affecting Meta's apps have come close to mirroring the impact of its outage in 2021, which saw the company's apps go down for nearly six hours worldwide.", "url": "https://www.bbc.co.uk/news/articles/c5y0r8wdk62o"}