{"authors": ["Mona McAlinden", "www.facebook.com"], "date_download": "2025-04-26 03:38:30", "date_modify": "2025-04-26 03:38:30", "date_publish": "2025-03-04 22:59:07", "description": "The camera hidden by Nicola Hughes captured footage of staff roughly handling and shouting at her mother.", "filename": "news_articles_c74kwkmvw27o_1745638710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/44b0/live/f3609660-f92e-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c74kwkmvw27o_1745638710.html", "title": "Woman secretly filmed her mum being abused in care home", "title_page": "Woman secretly filmed her mum being abused in care home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman secretly filmed her mother's mistreatment in a care home after concerns she raised about her care were ignored.\nNicola Hughes, who is a registered nurse, hid a covert camera in a radio in her mother's bedroom at Barrogil House in Fife.\nThe footage revealed staff roughly handling Janette Ritchie and shouting at her. One carer was filmed holding bedclothes over her head and saying \"Rest in Peace\".\nFive people were dismissed last year after the care home was made aware of the footage.\nHowever, the family continued to have concerns about standards, which they raised with the Care Inspectorate – and it has now upheld four complaints against the home.\nNicola said the family were initially delighted when Janette got a place at the home, near Cluny, in February 2024. The specialist facility for people with dementia is located just miles from where they live.\nJanette, 67, who was a former carer herself, has dementia and is doubly incontinent.\nThe family say some of the staff at Barrogil House provide excellent care.\nHowever, within weeks of her admission, her daughter said Janette seemed to be distressed in the mornings. Nicola said her mother often smelled of urine and was wet when they visited.\n\"Making a decision to put cameras into someone's room is nerve-wracking because you're frightened - frightened of consequences for me, for my mum. You're frightened about what you're going to find on these cameras,\" Nicola said.\n\"What I discovered was absolutely heartbreaking.\n\"My mum was getting left overnight without any welfare checks being completed. Unfortunately, my mum's incontinent so she was left lying in her own urine.\n\"Staff verbally abusing her, emotionally abusing her - telling her that she's stinking, telling her that she's stupid. Using my name against her.\"\nNicola says that because of the severity of her mother's dementia, it was too disruptive to move her to a new home.\n\"Starting over again is a big upheaval for her,\" she said. \"It would be unfair to move her about again.\"\nNicola wanted improvements to be made at the home, and said she made several complaints to the management during the period when the footage was recorded.\n\"I consistently went into the home manager's office and raised my concerns, and nothing changed,\" she said.\nWhen the family saw a member of staff holding the bedclothes over Janette's head and saying \"Rest in Peace\", they decided to inform the care home about the footage.\nFive members of staff were sacked following an investigation.\nBut six months after the dismissals, the family still have concerns about standards of care.\n\"All I keep asking for is just that basic care needs are met,\" said Nicola.\nLast month, the Care Inspectorate upheld four complaints from the family about Janette's care. It said her personal care needs were not always met, and her medication was not always administered properly.\nNicola said: \"I think it's important to stress that these complaints are only to make sure that the home operates at a better level, not only for my mum - but for everyone.\"\nInspectors have given the home a deadline to improve.\nIn a statement, a spokesperson for Barrogil House said: \"Following concerns raised by Mrs Ritchie's family in June of last year, we took immediate action which resulted in the dismissal of five members of staff.\n\"A subsequent unannounced inspection noted our good staffing levels and commitment to kindness and respect, and we continue to work closely with all relevant authorities to make improvements - including a revised care plan for Mrs Ritchie.\n\"The health and wellbeing of our residents is our utmost priority, and we aim to offer the highest possible standards of care and compassion.\"\nNicola said: \"It's difficult for the families, watching your loved one deteriorate in front of you. And it's made incredibly more difficult because I don't get to spend quality time with my mum, because I'm too busy nursing my mum, effectively.\n\"I don't mind nursing my mum, but I should be spending quality time with her as a daughter, not as a nurse.\n\"I just want a safe passage for my mum in these last few years of her life.\"", "url": "https://www.bbc.co.uk/news/articles/c74kwkmvw27o"}