{"authors": ["Mary McCool", "www.facebook.com"], "date_download": "2025-04-26 06:46:20", "date_modify": "2025-04-26 06:46:20", "date_publish": "2025-03-01 14:08:16", "description": "A second state visit cannot go ahead if the US president does not show further support for Ukraine, Stephen Gethins says.", "filename": "news_articles_cwyj0ve33x1o_1745649980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/68b7/live/9a7cf4f0-f6a2-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyj0ve33x1o_1745649980.html", "title": "SNP MP calls for Trump state visit to be scrapped", "title_page": "SNP MP calls for Trump state visit to be scrapped - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An SNP MP has said that Donald Trump's second state visit to the UK cannot go ahead if he refuses to show further support for Ukraine.\nTrump accused Ukraine's president Volodymyr Zelensky of \"gambling with World War Three\" during a fiery showdown at the White House on Friday.\nIt came the day after Prime Minister Sir Keir Starmer used his US visit to present Trump with a letter from the King, offering an initial meeting in Scotland to discuss the unprecedented second visit.\nStephen Gethins, the SNP's foreign affairs spokesperson, called Trump's behaviour towards Zelensky \"grotesque\" and said it amounted to \"bullying\".\nSpeaking to BBC News, he said: \"I'd describe last night's performance as bullying, as a bigger country ganging up on a small country that is struggling for its very survival.\n\"The UK has left itself in an utterly isolated position. We need to get closer to our European partners and allies.\n\"Right now, given that treatment of one of our allies in Ukraine, I do not see how a state visit could possibly go ahead. We've had a bit of silence from the prime minister so far and that's extremely disappointing.\"\nMr Gethins' call was echoed by SNP Westminster leader Stephen Flynn who posted on X that the prime minister \"better get back up off his knees and revoke that offer of a state visit\".\nZelensky arrived in London earlier and embraced the prime minister outside Downing Street.\nStarmer reiterated the UK's support for Ukraine, saying \"we stand with Ukraine for as long as it may take\" and spoke of \"unwavering determination\" to achieve a lasting peace for Ukraine.\nZelensky thanked Starmer for his support, and thanked King Charles III for accepting a meeting with him on Sunday - the same day he will take part in a summit with European leaders.\nThree years on, the war continues in Ukraine, with further injuries in the city of Kharkiv after a recent Russian drone attack.\nZelensky had hoped for positive talks with Trump during his visit, including the signing of a minerals deal which would give the US a real stake in his country's future, if not an outright security guarantee.\nInstead he faced an extraordinary dressing down in front of the world's media, with Trump and his Vice-President JD Vance demanding that he show more gratitude for years of US support.\nThe Ukrainian president pushed back at suggestions from his more powerful partners that he should work harder to agree a ceasefire with Vladimir Putin. They responded that he was being \"disrespectful\".\nAfter his departure, Zelensky said Ukraine is \"ready to sign the minerals agreement\" but continued his call for US security guarantees.\nThe exchange prompted a series of responses from European leaders with French President Emmanuel Macron and German Chancellor Olaf Scholz among those reiterating their support for Ukraine.\nPosting on X on Friday, First Minister John Swinney said: \"Today's events in Washington are a clear cause for deep concern, for shock, for anger.\n\"What we need now are cool heads and clear thinking. We must stand firm with our European allies in the steadfast defence of Ukraine. That is where Scotland stands.\"\nScottish Conservative MP Andrew Bowie, who is shadow secretary of state for Scotland, said the White House exchange was a \"sad and depressing spectacle\".\nOn X, he added: \"In the face of unprovoked Russian aggression and in the third year of a war to save his country, Vlodomyr Zelensky has been a symbol of calm strength and determination.\n\"Today his restraint was incredible. We stand with him and Ukraine.\"\nIf Trump does indeed meet the King in Scotland to discuss a second state visit, it would be his first return to the country where he has family and business connections since 2023.\nThe Scottish government said Swinney, who endorsed rival Kamala Harris in last year's election, would work to \"strengthen\" ties between the two countries.\nTrump was hosted by the late Queen Elizabeth for a three-day state visit during his first presidential term in 2019.\nSecond-term US presidents are traditionally not offered state visits and have instead been invited for tea or lunch with the monarch, usually at Windsor Castle.\nBut King Charles' letter proposed a meeting in Scotland, where Trump owns two golf courses, to discuss arrangements for a second state visit.\nThe letter suggested meeting at either Dumfries House in Ayrshire, which the King has owned since 2007, or Balmoral Castle in Aberdeenshire.\nTrump appeared taken aback by the letter, but after taking a minute to read it he said he accepted the invite and that it would be an \"honour\" to visit the \"fantastic\" country.\nThe prime minister said it was a \"privilege and an honour\" to deliver the King's letter to Trump, adding he \"looked forward to welcoming\" the president to the UK.\nMeanwhile the Scottish Greens have said Donald Trump is not welcome in Scotland, with co-leader Patrick Harvie forecasting \"protests and a great deal of anger\" around the visit.", "url": "https://www.bbc.co.uk/news/articles/cwyj0ve33x1o"}