{"authors": ["Angela Ferguson", "www.facebook.com"], "date_download": "2025-04-26 04:11:02", "date_modify": "2025-04-26 04:11:02", "date_publish": "2025-03-04 19:11:28", "description": "Azar Nazir, the owner of \"Wakey Wines\", has over 900,000 followers on the social media platform.", "filename": "news_articles_cpde1zp6e7yo_1745640662.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43f0/live/eac3c430-f921-11ef-ab75-3d760539555a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpde1zp6e7yo_1745640662.html", "title": "Viral 'Wakey Wines' Tik Tok off-licence goes up for sale", "title_page": "Viral 'Wakey Wines' Tik Tok off-licence goes up for sale - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A shopkeeper who went viral on social media after reportedly selling bottles of a sought-after energy drink for over £100 each has put up his business for sale.\nFans of Prime Energy drinks flocked from across the country in 2022 to visit the off-licence in Wakefield known as \"Wakey Wines\" run by Azar Nazir, 44, where bottles of the beverage were said to be on sale for as much as £120.\nFather-of-eleven Mr Nazir, who has earned over 900,000 followers on Tik Tok, told the BBC that running the shop had affected his mental health and he felt it was \"time to move on\".\nMr Nazir said in the future he would focus his efforts on his online business selling sweets.\nMr Nazir - who also became famous online for his \"Abdul come closer, Abdul go back\" catchphrase - said at one point after videos featuring his shop went viral on Tik Tok, about £7,000 worth of stock was stolen in a burglary.\n\"I had to get security and had to have one person sleeping in the shop at night time,\" he said.\nMr Nazir said he had even auctioned off a limited edition bottle of the energy drink for £1,200, which he donated to Wakefield charity Next Generation.\nThe practice of selling the popular energy drinks for high prices has previously drawn criticism from YouTuber KSI, co-founder of the business venture behind the product.\nMr Nazir said one of the reasons for selling Wakey Wines was his poor mental health, having suffered from \"really bad anxiety\" and depression for the past seven years.\nHe said that when large numbers of people came into the shop, he felt anxious and so had decided to focus on his online confectionery business.\nMr Nazir, who was interviewed about Wakey Wines for the BBC's Pinned podcast, said he had stopped doing paid appearances at nightclubs due to his mental health.\nHe said one of the things helping his mental health was taking up boxing, with plans to compete in his first match in April.", "url": "https://www.bbc.co.uk/news/articles/cpde1zp6e7yo"}