{"authors": ["Jude Winter", "www.facebook.com"], "date_download": "2025-04-26 06:17:57", "date_modify": "2025-04-26 06:17:57", "date_publish": "2025-03-01 07:28:56", "description": "A football club says it will consult on the proposal before submitting a planning application.", "filename": "news_articles_cwynn081kgxo_1745648277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c9d/live/90ad4620-f5e7-11ef-9e7b-21c750c82d19.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynn081kgxo_1745648277.html", "title": "Plans for £1.5m shipping container stadium in Newark revealed", "title_page": "Plans for £1.5m shipping container stadium in Newark revealed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans for a £1.5m \"sustainable\" football stadium built using repurposed shipping containers have been revealed.\nNewark & Sherwood United FC (NSUFC) has showcased a 3D model of the proposed 500-seat facility which, if approved, could be built on playing fields on Lincoln Road in Newark, Nottinghamshire.\nIt said the stadium would be constructed using 66 shipping containers and be designed to have off-grid energy solutions, such as solar power and rainwater harvesting.\nNSUFC said it would hold several public consultations to discuss the proposal before submitting a planning application.\nThe designs for the proposed stadium include space for a community kitchen, a boxing gym and floodlit 3G pitches for training and youth games.\nNSUFC, which is currently sharing a ground with Harrowby United FC in Grantham, would share the facility with local junior football clubs.\nJed Wright, the club's operation director, said: \"If given the go-ahead, the stadium would be the fourth-best facility in the county only behind Nottingham Forest, Notts County and Mansfield's stadiums and its unique design will create one of the best spectator experiences in lower league football.\n\"At grassroots level clubs, you typically watch football from the side of the pitch, but the viewing platform at our stadium will be on top of the containers, allowing spectators to watch the action from above.\"\nIf a planning application is approved, NSUFC said work was expected to begin in the summer and would finish in 2026.", "url": "https://www.bbc.co.uk/news/articles/cwynn081kgxo"}