{"authors": ["Lisa Summers and Claire McAllister", "www.facebook.com"], "date_download": "2025-04-26 07:54:56", "date_modify": "2025-04-26 07:54:56", "date_publish": "2025-02-25 12:59:07", "description": "A third of patients who are delayed getting out of hospital are stuck because of a legal complication.", "filename": "news_articles_cly62e1z3jzo_1745654096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5006/live/674fd820-f05f-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly62e1z3jzo_1745654096.html", "title": "Patients stuck in hospital over legal issues", "title_page": "Patients stuck in hospital over legal issues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A third of patients who are delayed getting out of hospital in Scotland's largest health board area are stuck because of a legal complication.\nProf Angela Wallace, NHS Greater Glasgow and Clyde's nurse director, says significant delays can come from patients not having power of attorney in place to approve their care plans.\nThis is a legal way to give somebody you trust the power to make financial and welfare decisions on your behalf.\nIf patients come to hospital after an illness and no longer have capacity to make decisions for themselves, it can lead to significant delays when they are ready to be discharged.\nThe current system means that a guardianship order has to be put in place - but it has to go through the courts and that can take many months.\nHospitals across Scotland are working at capacity.\nBed shortages on wards means patients are cared for in corridors, waiting too long in A&E or finding that a long-awaited operation is cancelled.\nBut each day, an average of 2,000 people are unable to get out of hospital despite being medically fit to be discharged.\nThere are many reasons why people are getting stuck in hospital, ranging from a lack of social care workers to a shortage of spaces in care homes.\nBut Prof Wallace said one of the biggest reasons for patients being delayed in their discharge was down to not having the right legal documents in place.\nShe says that across her health board right now there are 300 patients unable to get out of hospital despite not needing to be there.\nIn a third of those cases, it is because people do not have a power of attorney in place.\nNo-one has the automatic right to make decisions on your behalf.\nOrganising a power of attorney means if you cannot make the decision for yourself, someone you trust can make choices about your care - such as if you should receive healthcare treatment or where you should live.\nProf Wallace says that families can sometimes be reluctant to discuss their future wishes because it can feel it is about coming to the end of life, but she says it allows a patient's wishes to be absolutely clear.\n\"If patients have a power of attorney in place then we are absolutely clear about their wishes,\" Prof Wallace says.\n\"Therefore we can facilitate their discharge from hospital to a place of care that they have decided on before they have become unwell.\"\nProf Wallace says she has seen patients delayed more than 400 days in an acute hospital due to legal complications.\n\"It is not good for them, they feel isolated, and they become deconditioned and start to lose their mobility,\" she says.\nChristine Carmichael, whose 67-year-old husband Norman had a stroke in January, says her advice is to get the legal side arranged as soon as you can.\nThe couple, who are recently retired, had just returned from a holiday in Portugal when Norman collapsed in their kitchen.\nNot having power of attorney sorted has already caused the family financial issues and it could have implications for Norman's future care.\n\"We always spoke about it, but never got round to it. You never think it's going to happen to you but it shouldn't be left,\" says Christine.\n\"People think it's an age thing but it's something you can do as soon as you are married.\"\nNorman currently has some mobility and speech issues, but it is hoped he will be able to get out of hospital and continue rehabilitation at home.\nOn the day we visited, the Royal Alexandra Hospital (RAH) in Paisley was full.\nThere was no room on the stroke ward where Norman was being cared for to admit a further four patients who needed to be in the ward.\nOne of those patients was still in the Emergency Department, which was operating at double its usual capacity.\nDuring winter it was routinely four times its capacity.\nDr Chris McDonald, the clinical director for emergency medicine at the RAH and at Inverclyde hospital, says this winter is the worst he has seen.\nHis department has routinely been operating at 400% capacity.\n\"It's been incredibly difficult, I think we have all felt the strain,\" he said.\n\"We are walking down corridors that are completely full of patients and people are asking us for help and you've not got no time.\"\nHe says the single biggest challenge they face is getting patients onto the wards for further care.\nProf Wallace says: \"Every single day we could do better in terms of getting people both in and out of hospital.\n\"Across our sites, I think we are close to 100% occupancy. We don't want to care for patients in areas they shouldn't be cared for, it's not ideal.\"\nThe Royal College of Physicians of Edinburgh (RCPE) is calling on the Scottish government to introduce legislative reform around power of attorney and guardianship provisions, with funding attached to make it easier for people to put in place.\nDr Conor Maguire, vice president (international) at RCPE, says it can lead to elderly patients or those with dementia spending up to half their remaining lives in a hospital bed which is unsuitable and disruptive.\n\"The government should move forward with modifying the law around guardianship provisions so that patients who lack capacity to make decisions about their care can be moved from an NHS healthcare environment to an appropriate social care environment without delay – ideally to the nursing or care home in which they are to reside indefinitely - while they wait for the outcome of the court process,\" he said.\nThe Scottish government it had published analysis last month of responses to a consultation on proposals for reform of the Adults with Incapacity Act, including powers of attorney and guardianship orders.\nA spokesperson said: \"We are now considering those responses and working towards modernising the AWI Act, taking forward recommendations from the Scottish Mental Health Law Review.\"", "url": "https://www.bbc.co.uk/news/articles/cly62e1z3jzo"}