{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:36:46", "date_modify": "2025-04-26 04:36:46", "date_publish": "2025-02-28 11:37:25", "description": "The former home secretary launches a petition to stop government plans for Wates House in Fareham.", "filename": "news_articles_c1mnnv4zk0do_1745642206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2b2c/live/e7b501a0-f5c0-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mnnv4zk0do_1745642206.html", "title": "Braverman urges Fareham council to prevent asylum flats plan", "title_page": "Braverman urges Fareham council to prevent asylum flats plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former home secretary Suella Braverman has urged a council to buy an apartment block in her constituency to stop the government using it to house asylum seekers.\nShe has started a petition calling on the Conservative-controlled Fareham Borough Council to purchase Wates House in order to block her former government department from using the site.\nBut the council, which has already told the Home Office the property an \"inappropriate location\" for the plan, said the cost of buying it could not be \"justified\".\nThe Home Office said it does not comment publicly on sites which may or may not be used to accommodate asylum seekers.\nIn a video posted on social media, Fareham and Waterlooville MP Braverman said she had received \"many messages\" from constituents who \"are really worried\" about the plan for Wates House.\n\"I have the same concerns as you do about the proposal... it would be wholly inappropriate for this to happen and pose a risk to public safety,\" she commented.\nShe urged the council to \"do the right thing\" and lease or purchase the property for \"local housing needs\".\n\"In Fareham alone there are over 1,000 people on our housing waiting list, and there's no reason why Wates House couldn't be used by those people,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c1mnnv4zk0do"}