{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 03:40:40", "date_modify": "2025-04-26 03:40:40", "date_publish": "2025-03-05 09:49:36", "description": "The exercise is conducted to train crews as the fleet begins its return to active service.", "filename": "news_articles_c04zeyx74lqo_1745638840.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e421/live/f0776010-f9a5-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c04zeyx74lqo_1745638840.html", "title": "Osprey aircrew train with lifeboat for sea rescues", "title_page": "Osprey aircrew train with lifeboat for sea rescues off Norfolk - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "American military aircrew have performed sea rescue exercises off the Norfolk coast.\nTwo Osprey helicopters from RAF Mildenhall in Suffolk took part alongside Caister's lifeboat team.\nEach crew attempted to lower winching strops - used to rescue personnel from the water - on to the lifeboat deck.\nLt Hailey Malay from USAF 352nd Special Operations Wing described the training as crucial for both teams.\nThe Bell Boeing V-22 Osprey is a tiltrotor military transport and cargo aircraft, which can take off and land vertically like a helicopter but fly like a plane.\nThe craft, stationed at RAF Mildenhall in 2013, are capable of flying at 315mph (507km/h).\nMonday's exercise was conducted to train crews as the fleet begins its return to active service.\nLt Malay said two air crew practiced several times to lower a winching strop on to the lifeboat deck while each was travelling ahead, requiring both the pilot and lifeboat skipper to maintain the same speed and bearing.\nShe added: \"We could be called on for a variety of personnel recovery operations.\n\"Imagine a distress call comes in, someone is injured on a boat far out at sea and they need urgent medical attention.\n\"That's where the Osprey, with its unique capabilities comes in, we can quickly reach those in need, even in challenging weather.\"\nCaister coxswain Guy Gibson said: \"It's a totally different winching procedure to our coastguard, so we learned a lot and I think it was a good exercise for them.\"", "url": "https://www.bbc.co.uk/news/articles/c04zeyx74lqo"}