{"authors": ["Brian Farmer", "www.facebook.com"], "date_download": "2025-04-26 06:54:00", "date_modify": "2025-04-26 06:54:00", "date_publish": "2025-02-28 16:19:41", "description": "A drug addict stabbed her partner to death following an argument over £10, a judge says.", "filename": "news_articles_ce8vvv4y967o_1745650440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b34c/live/58de7410-f5ee-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vvv4y967o_1745650440.html", "title": "Addict guilty of 'savage' murder in Stevenage jailed for 16 years", "title_page": "Addict guilty of 'savage' murder in Stevenage jailed for 16 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A drug addict who stabbed to death a man with whom she had a \"toxic\" relationship must spend at least 16 years in jail, a judge has ruled.\nJudge Mark Bishop has imposed a mandatory life sentence on 35-year-old Erin McNeilly, of Stevenage, Hertfordshire, after she was found guilty of murdering 61-year-old Peter Lynch, in June 2024.\nThe judge described McNeilly's attack on her partner as \"savage\" and \"brutal\" and said she must serve 16 years in prison before being considered for parole.\nMcNeilly, who lived in Walden End, Stevenage, had admitted manslaughter but denied murder during a crown court trial in Huntingdon, Cambridgeshire.\nJudge Bishop said a jury had heard how both McNeilly and Mr Lynch were addicts - Mr Lynch also sold drugs.\nHe said members of the \"crack addict community\" had given evidence and the trial had given an \"insight\" into the \"degrading\" lives of people dependent on drugs.\nThe judge said McNeilly and Mr Lynch had a \"toxic relationship\".\nMcNeilly had stabbed Mr Lynch after an argument about £10, the judge said.\nThe judge said McNeilly had admitted being \"greedy\" for drugs and letting her \"anger get the better of her\".\n\"A witness said you were 'off your head',\" the judge told McNeilly when passing sentence at a hearing in Huntingdon.\n\"I am sure that when you stabbed him, you intended to kill him.\"\nThe judge added: \"It was a savage, sudden and brutal attack.\"\nLawyers representing McNeilly had pointed to mental health difficulties in mitigation.\nJudge Bishop said he accepted that Mr Lynch had been violent to McNeilly - and that McNeilly had been violent to Mr Lynch.\nBut he said Mr Lynch had not been \"coercive and controlling\".\nHe said he had \"no doubt\" that McNeilly regretted what she had done.", "url": "https://www.bbc.co.uk/news/articles/ce8vvv4y967o"}