{"authors": ["Helen Burchell", "www.facebook.com"], "date_download": "2025-04-26 04:00:05", "date_modify": "2025-04-26 04:00:05", "date_publish": "2025-03-04 05:28:53", "description": "After a pothole gets fixed, others ask to borrow the inverted wooden legs that prompted action.", "filename": "news_articles_cj4n2g4ppwlo_1745640005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/507f/live/84b61b30-f3b2-11ef-9963-97f48f5bf5d5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4n2g4ppwlo_1745640005.html", "title": "Demand for fake legs used as a pointer for Cambridgeshire pothole", "title_page": "Demand for fake legs used as a pointer for Cambridgeshire pothole - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who drew attention to a large water-filled pothole by placing a pair of fake legs upside down in it said many people with similar watery woes had asked to borrow them after his stunt proved successful.\nJames Coxall put the \"legs\" in a pothole on Haverhill Road in Castle Camps, on the Cambridgeshire/Suffolk border on 23 February.\nWithin days of his photo being publicised, Cambridgeshire County Council fixed the hole, which initially appeared about eight months ago.\nMr Coxall said while the legs were just a bit of fun, his \"joke\" attracted media attention across the UK and as far afield as Canada, and people were now asking to borrow the legs to draw attention to their own long-standing potholes.\nMr Coxall, a 41-year-old carpenter, said his family just wanted to \"have a bit of fun\" with the pothole.\nAlthough it was not a busy road, if there were oncoming vehicles you would \"have to either stop, or hit the pothole\" and risk a blown tyre, he said.\nTheir \"pothole person\" creation, made using old jeans, colourful shoes, rags and wood was placed in the deep hole, and weighed down with a brick.\nPhotographs of it were shared from various social media sites and Mr Coxall said people seemed to \"love it\", and he was known locally as \"a bit of a joker\".\nIt was picked up by a number of media outlets, and more locally, Mr Coxall has been receiving requests from people wanting to borrow the legs in the hope of highlighted that their own potholes need fixing.", "url": "https://www.bbc.co.uk/news/articles/cj4n2g4ppwlo"}