{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:34:32", "date_modify": "2025-04-26 06:34:32", "date_publish": "2025-02-27 06:25:35", "description": "North Somerset Council urges people using companies near Bristol Airport to research before booking.", "filename": "news_articles_c8rkj18v52po_1745649272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c26/live/0e7eab20-f453-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkj18v52po_1745649272.html", "title": "Bristol Airport passengers warned of poor parking companies", "title_page": "Bristol Airport passengers warned of poor parking companies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Holidaymakers are being urged to be vigilant after multiple complaints from people using parking near Bristol Airport.\nJill Gale, from Uplyme on the Devon/Dorset border, returned from holiday to find \"£600 worth of damage to her car\".\nShe booked with a site called Meet & Greet Bristol Airport Parking Services and claimed her car's bumper and paintwork were damaged while she was away.\nNorth Somerset Council's leaders are urging people to be careful following a spate of complaints about different companies leaving travellers stranded and vehicles damaged.\nShe tried to contact the company to discuss it, but said they have not offered any compensation or investigated the issue.\n\"My pride is very hurt, and I'm just so angry,\" she said.\nThe BBC has approached Meet & Greet Bristol Airport Parking Services for a comment.\nThe council said travellers have complained after incidents with their cars while they are away, involving a number of different car parking companies.\nA spokesperson said holidaymakers have said their vehicle have been damaged and there has been unexplained mileage on the vehicle's clock.\nMatt Lenny, the council's director of health and sustainable communities said some operators were reputable parking companies providing good service, but caution is key.\n\"It's all about making sure you're confident that provider is good before you start and it's all about what you do before you book,\" he said.\n\"Read the terms and conditions, make sure you've looked at some of the reviews.\n\"We would ask people to look for the Park Mark, the symbol of the British Parking Association.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkj18v52po"}