{"authors": ["Paul Moseley", "www.facebook.com"], "date_download": "2025-04-26 04:20:33", "date_modify": "2025-04-26 04:20:33", "date_publish": "2025-03-03 15:29:09", "description": "The integrated care board is again looking at closing Norfolk and Waveney's only such facility.", "filename": "news_articles_c20lq2ze6yqo_1745641233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a5e7/live/e68f4110-f907-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20lq2ze6yqo_1745641233.html", "title": "NHS walk-in centre in Norwich faces closure or a big cut in hours", "title_page": "NHS walk-in centre in Norwich faces closure or a big cut in hours - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An NHS walk-in centre could be closed or have its opening hours cut to just four hours a day.\nThe centre in Norwich – which sees about 72,000 patients a year – faced closure in 2023 before a new contract was agreed to keep it running.\nNHS Norfolk and Waveney Integrated Care Board (ICB) said it was reviewing the future of the service as it faced a £280m gap in its budget.\nCity councillor Lucy Galvin warned that cutting back the service would be a \"massive, painful cut that risks doing more harm than good\".\nThe ICB said more patients were getting treatment and advice from GPs or pharmacists under the Pharmacy First scheme.\nIt said that closing the service in Rouen Road would free up £1.5m a year while opening only in the morning would save £750,000, with the money saved being put towards GP services.\nLaunching a consultation, external on the proposals, Sadie Parker, director of primary care for NHS Norfolk and Waveney, said: \"We are always looking at what we do and how we can get the best value for the public money that we spend.\"\nThe ICB said it was also reviewing how many of its nine out-of-hours treatment sites would remain open, as well as its vulnerable adults service, which supports those such as homeless people, sex workers and refugees.\nIt said it was considering closing the service's base in Norwich and creating a team \"that goes to different communities across Norfolk and Waveney\".", "url": "https://www.bbc.co.uk/news/articles/c20lq2ze6yqo"}