{"authors": ["James Waterhouse", "Jacqueline Howard", "www.facebook.com"], "date_download": "2025-04-26 04:15:29", "date_modify": "2025-04-26 04:15:29", "date_publish": "2025-03-04 10:10:20", "description": "One Ukrainian soldier said the impact of the US aid pause would be \"measured in lives\"", "filename": "news_articles_cwydq82e7r1o_1745640929.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a21f/live/db642f70-f8e5-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwydq82e7r1o_1745640929.html", "title": "Fears Ukraine will last only months without US military support", "title_page": "Fears Ukraine will last only months without US military support - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Our meeting in Washington, at the White House on Friday, did not go the way it was supposed to be,\" Zelensky said on social media on Tuesday.\nUkraine's Prime Minister Denys Shmyhal also said his country is still willing to cooperate with the US, and reiterated Kyiv's \"gratefulness\" to Washington for their support to date.\nVenislavsky, one of Zelensky's MPs, said Ukraine officials were also working to find ways to compensate for the shortfall of weapons in the wake of the US announcement.\n\"I think we've definitely got enough resources to last about half a year even without consistent help from the US, but of course it will be much more difficult,\" he said.\nThe Ukrainian defence committee had already held a meeting behind closed doors to discuss \"the negative scenario of the possible stop to US military assistance\", Venislavsky added.\nOne serving 25-year-old Ukrainian soldier, who the BBC is not naming because she did not have permission to speak, said she did not think Ukraine's military could hold out for \"very long - maybe six months\".\n\"But judging by how our units and our army have endured extreme pressure without assistance before, I still don't know the full capacity of our forces,\" she continued.\n\"The real cost of the US cutting off aid will be measured in lives, in more orphans, in more suffering,\" she said, adding Europe could replace US support if they \"step out of their comfort zones\".\nSerhii, a soldier in Kupiansk, also said the EU could replace US aid \"if they wanted to, but the EU itself is not as united around this goal\".\nMany homes on the front-line have been rebuilt with US aid money, he said, and many rely on its food and medical supplies.\nA 31-year-old grenade launcher commander in Russia's Kursk region voiced confidence in Ukraine's military power and said his unit could \"keep pressuring [Russia] indefinitely\" without US support.\n\"Analysts estimate we have about six months' worth of ammunition. But we all know that the resources of the Ukrainian Armed Forces are limitless. So if needed, we'll keep hitting them as long as necessary,\" he said.\nCivilians on the front line, too, said they have faith in Ukraine's resourcefulness.\n\"There have been pauses in supplies before - we will restore our own faster,\" council worker Oleksandra Shcherbyna said.\n\"Everything coming from the US now benefits Europe's consolidation.\"\nYuliya Balayeva, a translator, remembered the last time Ukraine was without US aid.\nIn the summer of 2023, Republicans in Congress blocked then-President Joe Biden's £60bn aid package for Ukraine, eventually passing it in spring 2024.\n\"The last time aid was delayed due to Congress blocking it, two of my friends were killed on the front line. I hope this time we are better prepared,\" Ms Balayeva said.\nDobrynia Ivanov, an artist, said Ukraine had retained its dignity throughout the diplomatic breakdown.\n\"In the end, the only power suffering public humiliation is not Ukraine, nor even Russia, but the United States itself,\" he said.\nLate on Monday - in the early hours of Tuesday morning in Ukraine - the White House announced the US would pause military aid for Ukraine.\nA White House official told the BBC's US news partner CBS that its reason for doing so was to \"ensure that it is contributing to a solution\".\nThe move, welcomed by Russia, comes after last week's angry meeting between US President Donald Trump and Ukrainian President Volodymyr Zelensky in Washington.\nThe visit was supposed to be about ending the war in Ukraine, and the signing of a minerals deal. What happened instead was a public clash in the Oval Office that resulted in Zelensky being told to leave the White House.\nSome Ukrainian MPs have called the decision \"disastrous\".\n\"We'll see very soon the serious consequences - dangerous consequences,\" Oleksandr Merezhko, who chairs the Ukrainian parliament's foreign affairs committee, told BBC Breakfast on Tuesday.\n\"When we are in desperate need of American weaponry, of American support... [it] looks like siding with Russia\" to end it now, Merezhko said.\n\"I'm appealing to Mr Trump not to play with these dangerous issues because we're talking about lives.\"\nQuestions remain unanswered over whether Trump's team will readily reopen the negotiating table to Zelensky, whether Ukraine will still receive ammunition for American weapons already delivered, or whether Washington will continue to share intelligence with Kyiv.", "url": "https://www.bbc.co.uk/news/articles/cwydq82e7r1o"}