{"authors": ["Ben Price", "www.facebook.com"], "date_download": "2025-04-26 07:25:58", "date_modify": "2025-04-26 07:25:58", "date_publish": "2025-02-27 22:51:33", "description": "A creative solution was needed to make prosthetics for Louise Marshallsay who lost all eight fingers.", "filename": "news_articles_cjd3n9j9knro_1745652358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/09d5/live/a929ea50-f3a3-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjd3n9j9knro_1745652358.html", "title": "'My hand twin made my new fingers when I lost them to sepsis'", "title_page": "'My hand twin made my new fingers when I lost them to sepsis' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who lost all eight of her fingers to sepsis has received prosthetics based on the hands of the trainee tasked with making them.\nLouise Marshallsay, 46, from Swansea, needed life-saving treatment after being admitted to Morriston hospital with a kidney stone in 2022, but lost her fingers as well as five toes.\nTypically prosthetics are based on one of the patient's remaining fingers, but as Ms Marshallsay's had all been amputated, Katarzyna Gach used her own as a mould due to the pair's similar hand shape and size.\nMs Gach said it was a \"very unique case\".\nMs Marshallsay went into septic shock shortly after being admitted to Morriston with a kidney stone, and life-saving treatment was delivered to protect her vital organs.\nBut this meant restricting the blood flow to her outer limbs, which can cause the soft tissue to die.\n\"I'm lucky that it was only my fingers and toes because it could have been my arms and legs,\" she said.\n\"At one stage my hands were black and my feet were black, so I class myself as being very lucky that it was just the tips.\"\nAfter the fingers were amputated, Ms Gach, a trainee clinical reconstructive scientist, used her own fingers to help create the prosthetics.\nShe described it as a \"very unique case\" because of the number of prostheses that had to be made without being able to copy any of the patient's fingers.\n\"Half of [the fingers] are the anatomy of Louise's remnants and half is my own fingers,\" she said.\n\"The shape around the stump has to match her but when I was looking at the details like the creases and generally how the fingers are shaped, I was looking at my own fingers and going by that.\"\n\"[She] used the bottom of my hands and the tops of her hands and it worked. It's remarkable what they did,\" Ms Marshallsay said.\nMs Gach added: \"We used different nails, we changed the shape and when we got to the final stage, which is a colour match... we mix all the different silicones and create a custom colour for the patient.\n\"This is probably the longest case we have ever worked on here. All the wax trials we have done three times for each hand so I have waxed all the fingers multiple times and everything is handmade.\"\nConsultant plastic hand and reconstructive surgeon Hywel Dafydd said it was \"relatively unusual\" for a patient to lose all eight fingers in \"quite a dramatic way\".", "url": "https://www.bbc.co.uk/news/articles/cjd3n9j9knro"}