{"authors": ["Damian Zane", "www.facebook.com"], "date_download": "2025-04-26 06:47:22", "date_modify": "2025-04-26 06:47:22", "date_publish": "2025-03-01 12:14:55", "description": "Thousands turn out to say farewell to Sam Nujoma who led the struggle against apartheid South Africa.", "filename": "news_articles_c2019ez78pvo_1745650042.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/099d/live/65e87a40-f691-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2019ez78pvo_1745650042.html", "title": "Namibia's Sam Nujoma: 'End of era' for Africa as country buries founding father", "title_page": "Namibia's Sam Nujoma: 'End of era' for Africa as country buries founding father - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Namibia's founding father Sam Nujoma was \"a giant among leaders\" and left behind \"the most precious gift of… freedom\", the country's President, Nangolo Mbumba, has said.\nHe was speaking in front of the large crowd at Heroes' Acre, where the country's most revered citizens are buried, before Nujoma was laid to rest in a mausoleum.\nThe leader of Namibia's independence struggle against apartheid South Africa died last month at the age of 95.\nNujoma was seen as the last of a generation of African figures who headed anti-colonial movements and fought for freedom.\n\"Therefore his departure signals an end of an era, a founding father of Africa,\" President Mbumba said in an earlier speech at a national memorial service on Friday.\n\"We are not only mourning today, we are celebrating an extraordinary leader who has contributed significantly to our country's independence, who will continue to inspire us for many more years to come,\" Namibian Given Shiyukifein told the Reuters news agency.\nOn Saturday, Nujoma's coffin, draped in the Namibian flag, was driven by a military gun carriage from the centre of the capital, Windhoek, where the body was lying in state, to the burial ground on the outskirts of the city.\nMourners had been arriving since the early hours, the independent Namibian newspaper reported.\nIt added that they waved flags and sang songs in his memory, including Sam Ouli Peni? (Sam, Where are you?) – a popular anthem from the period after independence in 1990.\nAmong the dignitaries present were the presidents of neighbouring countries Angola, South Africa and Zimbabwe.\nNujoma, one of 10 children from a peasant family, was working on the railway in the late 1940s when he got a political education. He developed a passion for politics and yearned to see his people free from the injustice and indignity of colonialism.\nHe led the long fight for freedom from South Africa, which was then under white-minority rule, and helped found the liberation movement known as the South West Africa People's Organisation (Swapo) in the 1960s.\nAs the country's first president – a position he held for 15 years until 2005 - Nujoma is widely credited for ensuring peace and stability. His policy of national reconciliation encouraged the country's white community to remain, and they still play a major role in farming and other sectors of the economy.\nHe also championed the rights of women and children, including making fathers pay for the maintenance of children born out of wedlock.\nNamibia, then known as South West Africa, was under German occupation from 1884 until 1915, when Germany lost its colony in World War One.\nIt then fell under the rule of white South Africa, which extended its racist laws to the country, denying black Namibians any political rights, as well as restricting social and economic freedoms.\nThe introduction of sweeping apartheid legislation led to a guerrilla war of independence breaking out in 1966.", "url": "https://www.bbc.co.uk/news/articles/c2019ez78pvo"}