{"authors": ["Danielle Andrews", "www.facebook.com"], "date_download": "2025-04-26 03:55:44", "date_modify": "2025-04-26 03:55:44", "date_publish": "2025-03-04 15:47:32", "description": "The council says in future the deputy mayor will use the mayor's civic car if needed.", "filename": "news_articles_cn8969x199yo_1745639744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1f8/live/e69dca90-f908-11ef-bc87-ad84b3fde561.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8969x199yo_1745639744.html", "title": "Rotherham Council to sell deputy mayor's car", "title_page": "Rotherham Council to sell deputy mayor's car - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A car used by a deputy mayor for civic engagements is to be sold.\nRotherham Council said the 2004 Volvo S80, which has been used 21 times since 2019, is no longer considered necessary due to its low usage and age.\nIt comes after a review of civic protocol by council officers, which found the mayor and deputy mayor no longer attend civic engagements on the same day, reducing the need for two vehicles.\nThe vehicle is due to be auctioned on 6 March with any funds raised going towards the council's capital funding pot.\nThe council said although the vehicle no longer incurred direct costs for its purchase, ongoing costs for repairs, maintenance, and fuel, could now be saved - according to the Local Democracy Reporting Service.\nIn the event both the mayor and deputy mayor are required to attend engagements on the same day, a hire vehicle will be arranged - but this would be on a rare occasion and no budget allocation had been made.\nBoth civic figures will be able to continue using the main mayoral car, an Audi A8.\nThe disposal of the vehicle is part of an ongoing effort to ensure the effective use of resources within the council's operations, the authority added.", "url": "https://www.bbc.co.uk/news/articles/cn8969x199yo"}