{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 06:58:27", "date_modify": "2025-04-26 06:58:27", "date_publish": "2025-02-28 13:35:28", "description": "The event organisers say they aim to return in 2026.", "filename": "news_articles_cjryye5wr34o_1745650707.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aa65/live/20aafe80-f5ce-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjryye5wr34o_1745650707.html", "title": "Suffolk Primadonna Festival cancelled for 2025 due to costs", "title_page": "Suffolk Primadonna Festival cancelled for 2025 due to costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A literary festival will not take place in the summer due to financial pressures, organisers have said.\nPrimadonna Festival has previously been held in different locations across Suffolk and brought writers and readers together.\nOrganisers said despite a \"record-breaking\" 2024 event at Stowmarket's Food Museum, this year's event would not take place due to \"rising costs and lack of funding\".\nHowever, they added they would work on a plan to return in 2026.\nTracey Bleakley, chair of the Primadonna Festival and Prize CIO, said the decision to take a fallow year marked \"an important step in our evolution\".\n\"We have a brilliant team committed to building on Primadonna's special roots and seeing it thrive in 2026 and beyond, and we'd like to take this opportunity to thank our wonderful volunteers, suppliers and partners who have made our festival what it is.\n\"With 13 festivals in our region already announcing pauses and cancellations this year, our thoughts also go out to our fellow festival organisers who are struggling to operate in an unprecedentedly difficult climate for festivals and the wider arts sector.\"\nPrimadonna said last year's event saw the highest-ever audience, artist and volunteer ratings.", "url": "https://www.bbc.co.uk/news/articles/cjryye5wr34o"}