{"authors": ["Mark Smith", "Steve Knibbs", "www.facebook.com"], "date_download": "2025-04-26 04:30:18", "date_modify": "2025-04-26 04:30:18", "date_publish": "2025-03-03 06:22:21", "description": "After just a few weeks at the new Dingley's Promise centre four year old Peyton is communicating more.", "filename": "news_articles_c4geze1yy0ro_1745641818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b342/live/5d354a10-f388-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4geze1yy0ro_1745641818.html", "title": "A father says his daughter is thriving thanks to special nursery", "title_page": "A father says his daughter is thriving thanks to special nursery - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new nursery for children with special educational needs and disabilities (Send) is making a huge difference, parents have said.\nGareth said his five-year-old daughter Peyton struggled when she went to a mainstream nursery at the age of two, and left after a few months.\nHer development has come on significantly since she started at Dingley's Promise Cheltenham, which opened this month.\nGloucestershire County Council, which has given the charity a three-year contract, said investing in younger children will improve their chances in mainstream education.\nFive year old Peyton should have started primary school last September, but she is non-verbal and has development delays.\nHer parents believe she has autism and a place within a mainstream school could not be found.\nEven though she does now have an Education and Health Care Plan, which sets out the extra help and funding a child needs to access education, no place could be found in a specialist school.\nGareth said Dingley's Promise has made a huge difference to his daughter, despite her only being there seven hours a week.\n\"If you had met Peyton six months ago, she wasn't making a lot of noise, but now she's constantly babbling, she's communicating with you a lot,\" he said.\nCatherine McLeod, the nursery's chief executive, said spending money on Send provision for children under the age of five leads to savings in the future.\n\"If we can get support to children and families as early as possible, they feel more confident, they can also then thrive in a way that in the long term will save us money because we won't be spending larger amounts of money in primary and secondary schools,\" she said.\nDingley's run several centres across the UK, and data shows that ten years ago, 35% of children who left Dingley's went on to mainstream education.\n\"Through all the work we've done on inclusion it's now 70%,\" said Ms McLeod.\n\"That movement into mainstream education, when you get early intervention, is so important.\"\nPaul McLain, cabinet member for education at Gloucestershire County Council, describes it as a \"win-win\".\n\"Getting in there early really helps. It allows the child to integrate, to hopefully go on to mainstream school. It's everything that makes a difference to that child's life, and also to the family's life.\"", "url": "https://www.bbc.co.uk/news/articles/c4geze1yy0ro"}