{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:20", "date_modify": "2025-05-19 14:25:20", "date_publish": "2015-03-27 10:37:28", "description": "Three new investigations into alleged corruption by the Metropolitan Police over claims of child abuse are to be managed by the police watchdog.", "filename": "news_uk-32086251_1747664720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81947000/jpg/_81947764_81947763.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-32086251_1747664720.html", "title": "Met Police sex abuse 'cover-up' inquiry extended", "title_page": "Met Police sex abuse 'cover-up' inquiry extended - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three new claims of Metropolitan Police corruption over child abuse are to be managed by the police watchdog.\nThe latest allegations include one that an investigation in London was dropped on the orders of a senior Met officer.\nThe abuse in that case was said to have been carried out by MPs, judges, actors and clergy, among others.\nThe Independent Police Complaints Commission (IPCC) is already managing 14 referrals of alleged Met corruption, external, which were announced on 16 March.\nThe Met said it had voluntarily referred those allegations, which arose from an investigation it launched in 2012.\nThat investigation, known as Operation Fairbank, is looking into historical child sex abuse claims involving politicians and other public figures.\nAll the allegations referred to the IPCC date from the 1970s to the 2000s.\nThe police watchdog will also now manage an investigation into an allegation that Greater Manchester Police (GMP) failed to adequately investigate an incident involving former Liberal MP Cyril Smith.\nA former GMP officer has said he was threatened with the Official Secrets Act after finding Smith, who died in 2010, with two teenage boys in Stockport in 1988.\nThe three new referrals are:", "url": "https://www.bbc.com/news/uk-32086251"}