{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:42:32", "date_modify": "2025-05-21 05:42:32", "date_publish": "2025-01-13 00:00:00", "description": "In a combative hearing, no Republicans came out against Pete Hegseth as he made his case to overhaul the Pentagon.", "filename": "news_live_cr53m3g32n6t_1747806152.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cr53m3g32n6t_1747806152.html", "title": "Trump's defence chief pick Pete Hegseth questioned over alcohol use and views on women in military, in Senate grilling", "title_page": "Trump's defence chief pick Pete Hegseth questioned over alcohol use and views on women in military, in Senate grilling - live updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A contentious hearing, but Republicans indicate support\nConfirmation hearings for Donald Trump's cabinet nominees began with one of the most hotly anticipated: Pete Hegseth for defence secretary.\nHegseth, a military veteran and Fox News host, faced four hours of grilling from Democrats and Republicans on the Senate Armed Services Committee. Several protesters interrupted proceedings and were removed from the hearing room early on\nHe was challenged over previous comments he's made about women in the military; elsewhere he vowed to restore a \"warrior ethos\" to the Pentagon\nHegseth also dismissed questions over reports of his heavy drinking and womanizing, including sexual assault allegations, calling them part of a \"smear campaign\"\nUnder US law, presidents select members of their cabinet, but those pics must be confirmed by the Senate, which is currently in Republican hands\nHegseth's confirmation hearing was the first faced by the latest round of Trump nominees – each will face a similar grilling. The process will then move to a committee vote and, if that passes, a vote by the entire Senate.\nThank you for joining us for today's hearing - we're now closing our live coverage. You can stay up to date on the latest below:\nFive takeaways from Pete Hegseth's confirmation hearing\nThe tricky questions facing Trump's nominees for top jobs\nTrump's 'anti-woke' defence pick surprises Washington - here's why\nJust the start of a week-long marathon of hearings\nRachel Looker\nReporting from Capitol Hill\nToday marked the first day of Senate confirmation hearings for President-elect Donald Trump's nominees.\nIf today was an indicator for how the rest of the week may go, expect more drama, contentious questioning and heightened exchanges between lawmakers and nominees.\nLawmakers on Capitol Hill are bracing for a week of more of the same as several other controversial picks will be making their appearances throughout the week. Keep an eye out for:\nWednesday: South Dakota Gov. Kristi Noem to lead the Department of Homeland Security\nWednesday and Thursday: Pam Bondi for attorney general\nWednesday: Florida Senator Marco Rubio for State Department\nSchumer: Hegseth 'woefully unfit'\nRachel Looker\nReporting from Capitol Hill\nSenate Democratic leader Chuck Schumer has just reacted to Hegseth’s confirmation hearing, calling Hegseth “woefully unfit” to serve as secretary of defence.\n\"If today's hearing is a sense of what's to come, we are deeply concerned,\" he said.\nSchumer said Hegesth’s testimony failed to address questions about his background or explain why he is qualified for the position.\nHe said it would be deeply irresponsible for the Senate to confirm him as secretary of defence.\nRhode Island Senator Jack Reed, the top Democrat on the Armed Services Committee, told reporters he went into the hearing with deep concerns about Hegseth's qualifications.\n\"I have concluded that he lacks the character, the competence and the commitment to do this job,\" Reed said.\nHow does confirmation voting work?\nRachel Looker\nReporting from Capitol Hill\nHegseth - just like all cabinet nominees - will need to be confirmed by a Senate vote to become Trump's defence secretary.\nAfter a nominee appears before a relevant Senate committee, those members vote to report a nominee favourably or unfavourably to the whole Senate. All 100 senators then vote for or against the nominee.\nThe Senate Armed Services Committee is comprised of 14 Republicans and 13 Democrats. It could take just one Republican defection to block Hegseth's nomination from moving to the Senate floor for a full vote.\nThe committee also has the option to report the nominee without recommendation, meaning the majority on the committee oppose the candidate but want the full Senate to have consideration.\nTypically, a nomination that clears the committee does not face major opposition on the full Senate floor, where a nominee needs a simple majority to be confirmed.\nRepublicans control the upper chamber 53 to 47. It's also important to note that once inaugurated on 20 January, Vice President-elect JD Vance would be able to break any ties in the Senate.\nRepublicans repeatedly accused Democrats of failing latest defence audit\nDuring the hearing earlier, Republicans said several times that defence department under the current Democratic Biden administration had repeatedly failed its financial audits. They said it showed that Hegseth was needed to turn the department's finances around.\nIn November, the Pentagon released the results of its seventh annual department-wide financial statement audit, where it found it had yet to meet its budget goals.\nIn the audit, Michael McCord, under secretary of defence and chief financial officer audit said: \"The Department continues to need the sustained investment, senior leadership commitment, and the support of our partners in Congress, federal regulators, the audit community, and our military and civilian personnel to accomplish its audit goals\".\nSpeaking in December, Bernie Sanders, an independent Senator from Vermont who caucuses with Democrats, said Elon Musk, from the Department of Government Efficiency, \"is right\" about proposed cuts to the defence budget.\nSanders said the Pentagon has \"lost track of billions\", Sanders wrote on X, saying the department had failed its seventh audit in a row.\nDemocrat Blumenthal \"conceding nothing\" on whether Hegseth will be confirmed\nNomia Iqbal\nNorth America correspondent\nI've just spoken to Senator Richard Blumenthal, a Democrat who questioned Hegseth sharply during the hearing. He said he's \"conceding nothing\" in terms of Republicans' confidence the vote will got through.\n\"It confirmed for me the questions I've raised about his qualifications. He's unqualified and unprepared to lead our nation's military. And I think there should be continued investigations into him,\" he told me.\nSenate Democrats have said that an FBI background check on Pete Hegseth missed key details on major allegations against him, and did not include interviews with critical witnesses.\nBlumenthal is also concerned about how the rest of the world would view a Defence Secretary Hegseth.\n\"I'm deeply worried what he'll do about our reputation and relations around the world. He has said we should abandon NATO, which is essential to defend our own security. He has taken positions that would weaken our military by discouraging the best and brightest of our young people from coming forward and joining,\" he said.\nDuring the hearing Blumenthal told Hegseth - a professional broadcaster - he would be better as a \"spokesperson\" for the military, not its leader.\n\"I stand by that.\"\nDemocrat Kaine tells reporters he doesn't get why Republicans were upset with questions\nRachel Looker\nReporting from Capitol Hill\nReporters have chased after committee members as they leave to try to get their reads on how the hearing went.\nVirginia Senator Tim Kaine, a Democrat, just told us that Hegseth did not answer any of Democrats’ questions regarding his conduct. He stressed that Hegseth didn’t disclose much of these concerns to Trump’s transition team. “Why? Because he knew it would affect his ability to get nominated,” he says.\nKaine said he doesn’t understand why Republicans are upset with Democrats’ line of questioning during the hearing.\nKaine had pressed Hegseth about admissions from the nominee that he had cheated on women he was in relationships with and about his drinking. “If they're upset because it's irrelevant that he cheated on his wife and on the mother of the child with somebody, maybe they think it's irrelevant,” Kaine said.\nWe wrote about Kaine's questions during the hearing earlier.\nHegseth's performance unlikely to fracture increasingly solid Republican support\nAnthony Zurcher\nBBC North America correspondent\nAfter approximately four hours of questioning, Pete Hegseth is done with his Senate confirmation hearing. While Democrats peppered the nominee with pointed, often fiery questions – about his past statements and views, as well as his personal and professional conduct – the sound and fury may do little to derail his nomination hopes.\nRepublicans, by all indications during the proceedings, are sticking by Trump's defence pick – and those on the Armed Services Committee frequently showered him with praise. Even Joni Ernst of Iowa, a war veteran and sexual assault survivor whose early support for Hegseth had been tepid, gave him a friendly reception, noting the “productive” and “very frank” private conversations they had.\nBy the time Tim Sheehy, the junior Republican on the committee, had his turn, the questions were about the diameter of common firearm rounds and how many pushups the nominee could do.\nDemocrats needed Hegseth to crack during this hearing, putting pressure on Republican senators to break with Donald Trump and his nominee despite intense lobbying efforts by the president-elect’s team. While Hegseth evaded some questions and flatly refused to answer others, his performance is unlikely to be enough to fracture what appears to be his increasingly solid support among Republicans.\nThe key lines from Pete Hegseth's hearing\nAfter more than four hours, Hegseth's confirmation hearing for the role of defence secretary has now ended. Here's what happened:\nThe hearing began with protesters interrupting Hegseth's opening statement and demonstrators being dragged from the room by Capitol Hill police\nIn his opening statement, Hegseth said Trump wants him to bring back a warrior culture to the defence department and bring change\nDuring the questioning, he called allegations of sexual misconduct and excessive drinking a \"smear campaign\"\nBut he did accept non-specific, personal failings and said he had been saved by the grace of God\nThere was a strong focus on whether he supports women serving in combat roles, with Democratic senators accusing him of an \"11th-hour conversion\" in order to get his nomination approved - Hegseth insisted his focus has always been on maintaining high standards\nOngoing conflicts and military rivalries around the world were not given much time, but Hegseth did say he supports Israel \"destroying and killing every last member of Hamas\", while saying little about Trump's plan for how to end the Russia-Ukraine war\nA number of Republican questions focused on the culture within the military, with Hegseth telling the hearing he believes troops want the \"woke\" agenda kept out of the military and there is a need to \"tear\" out diversity, equity and inclusion policies\nAhead of the hearing, there was speculation Republican senator Joni Ernst could scupper Hegseth's chances by withholding her support - you can see an overview of their exchange here\nHegseth questioned on using troops on US soil\nJust before the hearing ended, Elissa Slotkin, a newly elected Democratic senator from Michigan, questioned Hegseth about what he would do if the president ordered him to deploy military troops inside the United States.\nUnder US laws, troops generally can’t be used to enforce laws inside the country, although exceptions can be granted and National Guard troops are frequently pressed into service to maintain order – for instance during the current wildfires in California.\nSlotkin, a former CIA officer who served in Iraq, noted that Trump had floated the idea of using the military against the “enemy within” and asked Hegseth if he had been involved in conversations to deploy troops on US soil.\nHegseth tries to turn the question into one about border security, calling illegal immigration an “invasion that threatens the American people”.\n“There are ways in which the American military is already playing a role,” he said, noting that there are National Guard troops on the border under the current administration.\nHegseth tears into military diversity initiatives\nHegseth says he wants to \"tear\" up diversity, equity, and inclusion initiatives and send a clear message that this is a time for equality rather than equity.\nPeople should be treated equally rather than prescribe outcomes based on race or gender, he says, adding quotas lower morale and make people think they are being judged by something other than their performance, which he describes as \"poisonous\".\nRepublican Senator Jim Banks asks if he will reinstate and give back-pay to people who were fired from the military for not adhering to Covid guidance such as getting vaccinated.\nHegseth says they will be reinstated, get an apology, back-pay and rank because they were forced out due to an \"experimental vaccine\", saying Trump has also said he supports such a move.\nA combative Tammy Duckworth says Hegseth 'not qualified'\nNomia Iqbal\nNorth America correspondent, reporting from Capitol Hill\nIf Hegseth gets this job, he'll face an array of global problems from countries such as Russia, China, North Korea and Iran, not to mention the ongoing conflicts America is involved in.\nDemocratic Senator Tammy Duckworth - who lost her legs while serving in the army - is combative in her tone. She has made clear beforehand that Hegseth should not be in charge of one of the most important agencies in the world.\nShe tells him now: “Our adversaries watch closely during times of transition, and any sense that the Department of Defense that keeps us safe is being steered by someone who’s wholly unprepared for the job puts America at risk, and I am not willing to do that.”\nShe also points out the hypocrisy of Hegseth asking for standards when it comes to women in combat roles.\n\"Here's a guy who can't meet the standards and is asking for special dispensation to do a job that he's not qualified to do,\" she says.\nTo underline the point, Hegseth is unable to answer Senator Duckworth's question about the number nations the Association of Southeast Asian Nations (ASEAN).\nHegseth replied: \"We have allies in South Korea, Japan, and Australia.\"\n\"None of those countries are in ASEAN,\" Duckworth says.", "url": "https://www.bbc.com/news/live/cr53m3g32n6t"}