{"authors": ["Ben Mellor", "Chris Waring", "www.facebook.com"], "date_download": "2025-04-26 03:46:06", "date_modify": "2025-04-26 03:46:06", "date_publish": "2025-03-05 06:06:24", "description": "Sleaford Mods' Jason Williamson volunteers at a drop-in centre in West Bridgford, Nottinghamshire.", "filename": "news_articles_cly8v9k4n2no_1745639166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7c72/live/d3a60ea0-f842-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly8v9k4n2no_1745639166.html", "title": "West Bridgford: Punk band frontman volunteers at homeless charity", "title_page": "West Bridgford: Punk band frontman volunteers at homeless charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I feel like I'm contributing,\" says Jason Williamson, the lead vocalist of English electronic punk music duo Sleaford Mods.\nHe says he is fed up of swearing at politicians on social media without actually helping himself, humbly adding \"it doesn't work\".\nA self-confessed former drug addict, Williamson has been partially driven by his own lived experiences and now volunteers at a drop-in homeless centre in West Bridgford, Nottinghamshire.\nFor two-and-a-half years, he has been manning the coffee bar at the Friary, a homelessness support charity in the town.\nWilliamson has long sung about austerity and been critical of past governments, but now he is hoping to better help vulnerable people through direct action.\n\"You can contribute nationally by voting or whatever, but a lot of things are out of your hands,\" he said.\n\"You feel powerless, but local community, and adding to that, is one of the best things you can do.\"\n\"I was an addict,\" the singer said. \"I didn't have anywhere to live at times, couldn't afford to eat, I went hungry. All kinds of mental health problems. I'm a lot better now, but you can relate to it.\n\"Sometimes that's not so great because it brings back memories, and you don't enjoy it, it can be quite heavy working here, but most of the time it's a bit of a laugh.\"\nAlongside hot food and drinks, the charity provides service users with a place to shower, clean their clothes, and access IT services.\nOrnella Luconi visits the Friary to get breakfast and to wash. She said without the work of volunteers here, she would have nowhere to go after rough sleeping.\n\"I come here for the daily shower, they clean my clothes. I don't like beans on toast, it's very English, though I did have a slice of toast because I was very hungry,\" she said.\nThe 29-year-old moved to the UK with her family as a teenager to find a \"better future\", but anxiety and low self-esteem led her to excessive drinking.\nThis resulted in her being kicked out of home, where she fell into a heroin addiction for eight years - but after the suicide of a close companion in 2023, she decided to try and get clean.\nShe told the BBC she was no longer an \"addict\".\nAnd despite still rough sleeping, she considered herself to be \"lucky\" because she has not yet been raped or stabbed.\nWilliamson has lived in many areas of Nottingham, from Sneinton to Sherwood, to West Bridgford.\nHowever, despite the \"middle class\" reputation of the latter, he said there was no difference in those who need help.\n\"If people are feeling alienated, depressed, suicidal, don't understand how to apply for Universal Credit, don't know how to apply for accommodation – it's the same.\n\"I don't necessarily think there's any difference to this area than with the city centre.\"\nBen Talbot, the chief executive of the Friary, said that Williamson was no different to any other volunteer and \"he just wants to help\".\n\"It's nothing to do with anything else other than Jason being part of the local community and wanting to get himself in here and get involved,\" he added.\n\"[He's] seen what we do here and had an interest in the work and a passion for supporting those who are less fortunate. And before you know it, he's got himself on the rota,\" he said.\nWilliamson has so far kept his work with the charity low-key and was only spotted online because he appeared amongst a photo reel of coffee bar volunteers.\n\"You don't promote yourself doing it. That's just sick,\" the frontman said. \"I guess someone with my platform, if they did promote themselves, it would bring more consciousness to the Friary.\n\"But generally, at the end of the day, you come here, and you've got a job to do.\"\nIf you have been affected by any issues in this story, support is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/cly8v9k4n2no"}