{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:57:53", "date_modify": "2025-04-26 06:57:53", "date_publish": "2025-02-28 13:52:41", "description": "Graham Trinder was holding an air rifle when he was shot by an armed officer in Swindon in 2020.", "filename": "news_articles_crknnk2jn01o_1745650673.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94cf/live/896fbb30-f5ed-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crknnk2jn01o_1745650673.html", "title": "Man shot in Swindon by officer was killed lawfully", "title_page": "Man shot in Swindon by officer was killed lawfully - inquest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who was shot in a residential street by an armed police officer was killed lawfully, an inquest jury has concluded.\nPolice were called to Summers Street, Rodbourne, Swindon in the early hours of 8 November 2020 to reports of a fight between neighbours.\nGraham Trinder, 57, had been holding an air rifle which he failed to put down when asked to numerous times by the officer, the inquest was told.\nThe officer who fired the fatal shot told Wiltshire and Swindon Coroner's Court he had thought the gun was real and feared for his life.\nMr Trinder, also known as Tommy, died from a single gunshot wound to the chest during the incident outside his home.\nHe was pronounced dead at the scene after being shot at 02:06 GMT.\nAn inquest jury returned the conclusion of lawful killing after a three-day hearing.\nThe officer, referred to as AL/1 in court, said Mr Trinder had emerged from a house carrying a \"long-barrelled rifle with a scope\", which looked like a hunting rifle.\nHe explained that his training had \"taken over\" and he had drawn his police-issue Glock and was shouting at Mr Trinder to put the gun down repeatedly.\nHe told the inquest: \"I was terrified, the most scared I've been in my career to date. I thought I was going to die.\"\nThe officer said Mr Trinder had taken a \"proper stable shooting position\" and then brought the air rifle towards him \"in a deliberate aimed action\".\nMr Trinder had been drinking with neighbours when a dispute broke out between him and another man, which resulted in the police being called.\nNeighbour Richard Fitzsimmons described hearing the officer shout repeated warnings to Mr Trinder.\nMr Fitzsimmons said he saw the rifle appear to be pointed at the officer, with Mr Trinder swaying: \"I couldn't tell if he did this deliberately or if it was because he'd been drinking. He didn't bring the rifle up to a shooting position.\n\"The rifle was always held at his waist and when it was pointed at the officer, or in the direction of the officer, it was still at his waist.\n\"I then heard a loud bang. It all happened very fast.\"\nMr Trinder's death has been investigated by the Independent Office for Police Conduct (IOPC) which found the firearms officer's use of force during the incident was appropriate in the circumstances.\nThe investigation found it would not have been possible for police officers to have known at a distance and in a relatively dark environment that the weapon Mr Trinder was holding was an unloaded air rifle.\nIOPC director Derrick Campbell said: \"Our thoughts remain with Graham Trinder's family, and everyone affected by his death.\n\"Fatal police shootings are fortunately rare and lethal force must only be used by officers when absolutely necessary.\n\"This was a highly stressful and challenging incident for all concerned.\n\"At a time when Mr Trinder had raised and pointed his weapon in the direction of police, in our view the firearms officer's use of fatal force was justified and reasonable.\"\nWiltshire Police and Crime Commissioner Philip Wilkinson said it had been the first fatal police shooting in the county and that firearms officers \"undergo rigorous and continuous specialist training\".\n\"My office has a dedicated scrutiny panel which reviews police use of force, ensuring transparency and accountability to the public,\" he added.", "url": "https://www.bbc.co.uk/news/articles/crknnk2jn01o"}