{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:34:28", "date_modify": "2025-04-26 07:34:28", "date_publish": "2025-02-27 15:43:42", "description": "Councillors voted for the rise by 11 votes to six at the council's annual budget meeting", "filename": "news_articles_czx7kzxn93yo_1745652868.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74b5/live/f887fc60-f513-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czx7kzxn93yo_1745652868.html", "title": "Clackmannanshire's council tax to rise by 13%", "title_page": "Clackmannanshire's council tax to rise by 13% - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors in Clackmannanshire have voted to increase council tax by 13% following the local authority's annual budget meeting.\nIt means the average Band D property will pay £1594.38 a year, up from £1410.96.\nMeanwhile, councillors in Stirling voted for an 8.8% increase, while Perth and Kinross will see its council tax rise by 9.5%\nDundee City Council set an 8% rise, with an 11% increase agreed in Angus.\nMs Forson told the meeting: \"I need to be able to stand in front of people and defend the budget.\n\"So I therefore need to be able to believe in what it's going to deliver and know that it's going to have the impact that it needs to have, moving forward.\n\"And that's really the only reason we have set council tax at 13%.\"\nClackmannanshire is the smallest council in mainland Scotland by population, with no single party having overall control.\nThe council's estimated grant funding for this financial year is £139m, an increase of £10.7m.\nThe local authority said that despite this, increased cost pressures along with rising demand for services and a council tax freeze last year, meant the 13% increase in council tax was necessary.\nStirling Council's 8.8% increase means an average band D property will result in an annual bill of £1,611.87, up from £1,481.50.\nThe minority Labour administration's budget was approved by elected members 12 votes to 11 with one abstention.\nStirling Council leader Gerry McGarvey said: \"I would like thank everyone who took part in the Big Conversation surveys and for providing such constructive and considered feedback.\n\"Be in no doubt – your views have shaped the decisions we have made today.\"\nThe average Band D property in Dundee will pay £1605.35 this year, compared to £1486.43 as a result of the 8% increase.\nIn Angus, the 11% rise means the average Band D property will pay £1461.52, compared to £1316.68 last year.Councillors in Perth and Kinross voted for the 9.5% increase in council tax on Wednesday.\nFor an average band D property, the rise will mean an annual bill of £1,537.04, up from £1,403.69.\nThe SNP administration's budget was approved by elected members by 26 votes to 13 with one abstention.\nProvisional increases have also been agreed of 9.5% for 2026/27 and 6% for 2027/28.\nCouncil leader Grant Laing said: \"For a number of years this council has taken what have been often difficult decisions to agree budget reductions to balance the increasing costs of providing core services and growing levels of need, all while either maintaining a national council tax freeze or keeping the increase as low as possible.\n\"This approach is simply not sustainable.\"", "url": "https://www.bbc.co.uk/news/articles/czx7kzxn93yo"}