{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:26:27", "date_modify": "2025-05-19 15:26:27", "date_publish": "2017-07-06 00:00:00", "description": "News, sport, weather and travel updates from across Kent on Thursday 6 July 2017.", "filename": "news_live_uk-england-kent-40512748_1747668387.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-kent-40512748_1747668387.html", "title": "BBC Live: Kent - As it happened", "title_page": "BBC Live: Kent - As it happened on Thursday 6 July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sevenoaks woman repeatedly targeted by conmen\nPolice are searching for a pair of rogue traders, after an elderly Sevenoaks woman was conned for the third time.\nThe woman, who's in her eighties, was asked by the men to pay £150 for gardening work at her home in Seal Road, after they had originally quoted just £20.\nShe had previously been targeted by a man posing as a police officer, who stole her bank cards, and a man who charged her £600 to repave her driveway, but vanished after digging it up.\nThe two suspects in the latest case are described as white, one in his thirties, with curly hair, and one in his twenties, with hair shaved on one side and long on top.\nThe mane attraction?\nBob Dale\nBBC Live reporter\nA herd of decorated life-size horses are appearing across Kent and West Sussex to raise money for Hospice in the Weald.\nThey've been designed and painted by artists, schoolchildren and community groups and will be on display over the summer and auctioned off in October.\nHere's where you can see them...\nPair sought in connection with burglaries\nBob Dale\nBBC Live reporter\nPolice believe a pair of distraction burglars have struck in Deal.\nA woman in her nineties agreed to let a man who knocked on her door carry out work on her guttering in Manor Road.\nAfter the man, who it's believed had an accomplice, had left, she discovered cash missing from from a box.\nA neighbour, who's also in his nineties, found his house had been burgled, with cash, watches and wedding rings stolen.\nDetectives believe the thieves were driving a white Ford Transit van with a roof rack.\nGeorge Low stabbing: Family's anger after suspect 'freed'\nThe family of a man stabbed to death in Cyprus have spoken of their \"shock and devastation\" that his \"self-confessed murderer\" has been freed into Turkey.\nEstate agent George Low, 22, from Dartford, was killed near a nightclub in Ayia Napa in Cyprus last August.\nArrest warrants were issued for Mehmet Akpinar, 22, and Sali Ahmet, 42, who fled to the Turkish-controlled north and arrested for an unrelated offence.\nDartford MP Gareth Johnson blamed the current political situation in Cyprus.\nMr Low's parents said Mr Ahmet, who is from Bulgaria, was \"set free\" in June.\nMr Akpinar, who is a Turkish citizen, was released by the northern Cypriot authorities in January.\nQuote Message\nWe fail to understand why Turkey would allow a Bulgarian citizen suspected of murder to be set free in their own country instead of handing him over to the Bulgarian authorities to start the deportation process back to southern Cyprus to stand trial for the despicable and senseless act of violence.\"\nQuote Message\n\"We feel totally let down by the authorities. They should have been more pro-active in getting the two suspects deported back to southern Cyprus to stand trial instead of allowing this injustice to happen... now 11 months on both men are free to enjoy their lives.\"\nStatement from George Low's parents\nRogue traders reported in Swale\nBob Dale\nBBC Live reporter\nPolice in Swale are looking for a man who took hundreds of pounds from an elderly householder for building work which wasn't carried out.\nThe man knocked on the door of the property in Minster Road on 21 June, claiming the roof was damaged and needed urgent repair.\nThe woman who lived there paid him £500 to do the work, and the following day the man returned with an accomplice.\nThe pair said further work was needed, and demanded more cash, which was handed over.\nWhen a third demand for money was made, it was refused and the pair left.\nIt's being linked with a similar incident in April, when doorstep callers were given money to carry out work on a house's guttering, then returned in June to demand more cash, demands that were repeatedly made over the phone throughout the month.\nHidden disabilities: Pain beneath the surface\nImagine having to inject yourself thousands of times over the course of your lifetime, but never talking about it to anyone.\nMany people live with hidden disabilities - conditions which don't have physical signs but are painful, exhausting and isolating. Sympathy and understanding from others can often be in short supply.\nBBC Radio Kent's Erika North explains what it's like to have a hidden disability.\nAppeal after reported sexual assault\nLizzie Massey\nBBC Live reporter\nKent Police is appealing for witnesses after a man allegedly sexually assaulted a woman in Maidstone.\nThe victim, a woman in her 20s, was at a bus stop in Northumberland Road, Maidstone, on Wednesday 5 July 2017 when a man reportedly approached her between 06:10 and 06:40 BST.\nThe man is alleged to have shouted at the woman, before pulling at her clothing and knocking her to the ground.\nThe woman was able to push the man away and he ran off in the direction of Cambridge Crescent.\nThe man is described as white, aged in his 30s with black short hair. He was unshaven and was wearing a black cap with black tracksuit bottoms.", "url": "https://www.bbc.com/news/live/uk-england-kent-40512748"}