{"authors": ["Joshua Askew", "www.facebook.com"], "date_download": "2025-04-26 03:46:09", "date_modify": "2025-04-26 03:46:09", "date_publish": "2025-03-05 06:06:15", "description": "Ukrainian refugees say they are worried about what happens after their three-year visas run out.", "filename": "news_articles_c79dpewnezdo_1745639169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bf31/live/0d6ea3a0-eaf0-11ef-b296-c70114635fc4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c79dpewnezdo_1745639169.html", "title": "Ukrainians in South East face 'uncertain' futures", "title_page": "Ukrainians in South East face 'uncertain' futures in UK - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukrainian refugees living in south-east England say they are facing uncertain futures as their three-year visas near expiry.\nOlesia Sydorenko, from Ukraine's Kherson region, said she was unable to plan ahead and had struggled to enrol her son in college due to his rapidly expiring visa.\n\"[It is] causing a lot of problems in my brain,\" said the mother-of-two, who lives in Worthing, West Sussex.\nA government spokesperson said officials had \"always recognised the importance of providing certainty and security\" for Ukrainians and \"continue to do so\".\nUkrainians who came to the UK under the Homes for Ukraine scheme - most within the first few months of Russia's invasion in February 2022 - were given a three-year visa.\nMany of these are due to run out over the coming weeks and months.\nThe Home Office has said Ukrainians can apply to extend their stay for 18 months, 28 days before their visa expires.\nDr Jo Wilding, associate professor of migration law at Sussex University, said that although Ukrainians would still have legal permission to be in the country, there were fears they would struggle to prove it if their visa renewals were not processed in time, particularly if the Home Office is overwhelmed with applications.\nShe warned \"horrendous things\" could happen to people when they cannot prove their right to be in the UK, such as being denied access to employment, housing, benefits, or medical care.\nMs Sydorenko has not yet applied to extend her visa as it runs out in May.\nA government spokesperson called the 28-day window for applications to be submitted \"sufficient\".\n\"Provided an application is made before the date of expiry of existing permission, the applicant will continue to benefit from ongoing permission in the UK (and associated access to benefits and services) until a decision is made,\" they added.\nJust under 26,000 Ukrainian refugees have come to the South East under the Homes for Ukraine scheme, according to data from the Home Office and the Ministry of Housing, Communities and Local Government that covers the year ending September 2024.\nA BBC investigation published in February 2024 found that 20% of arrivals in Kent, Surrey and Sussex have since returned to their war-torn home.\nKateryna Turenko, who moved from Vasylkiv in the Kyiv region to Haywards Heath, said the lack of clarity around visa extensions was creating challenges for her family.\n\"My children have adapted well to life here,\" she said. \"I would love to stay and extend their education in the UK.\n\"We have settled and integrated into the community,\" Ms Turenko said.\nThe former head of sales - whose visa runs out at the end of April - urged the government to provide a \"clear path\" forward for Ukrainians in the country.", "url": "https://www.bbc.co.uk/news/articles/c79dpewnezdo"}