{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 06:18:37", "date_modify": "2025-04-26 06:18:37", "date_publish": "2025-03-01 07:24:31", "description": "Cyclists are being invited to \"bling their bike\" for a series of parades through Leicester.", "filename": "news_articles_c8e7pr8lj83o_1745648317.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ebd/live/5da933d0-f5f4-11ef-bd6e-cd71c2e1454a.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e7pr8lj83o_1745648317.html", "title": "Illuminated bike ride announced for Light Up Leicester event", "title_page": "Illuminated bike ride announced for Light Up Leicester event - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cyclists are being invited to \"bling their bike\" and join parades planned during a free festival of light.\nLight Up Leicester festival is set to make a return to the city from 12 March to 15 March for the first time since 2022, when it was attended by 80,000 people, according to the city council.\nA series of 0.9 mile (1.5km) bike parades are planned on Thursday 13 March, where cyclists can ride to some of the art installations on display.\nWorkshops will be run at Town Hall Square before the parades, where cyclists can add lights to their bicycles before they take part.\nCouncillor Geoff Whittle, assistant city mayor for environment and transport, said: \"Our focus is on it being a family-friendly ride, inclusive of all ages and abilities.\n\"This will also show people how easy it can be to navigate the city centre by bike - and after the ride, you can use the bike park at Town Hall Square to securely store your bike while you look around on foot.\n\"It promises to be a great showcase of our city and a really enjoyable experience for those on the rides – and it's all free.\"\nParade participants are also being urged to add their own speciality lights to their bikes at home before taking part in one of the parades which start at 18:30 GMT, 19:00, 19:30 and 20:00.", "url": "https://www.bbc.co.uk/news/articles/c8e7pr8lj83o"}