{"authors": ["Nadine Yousif, Brandon Drenon and James FitzGerald", "www.facebook.com"], "date_download": "2025-04-26 04:14:10", "date_modify": "2025-04-26 04:14:10", "date_publish": "2025-03-04 11:21:03", "description": "Canada has imposed its own retaliatory tariffs, which will remain in place until the US reverses course.", "filename": "news_articles_c89ye749nxvo_1745640850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5026/live/76b99670-f8e8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89ye749nxvo_1745640850.html", "title": "Trudeau says US wants to collapse Canada's economy with tariffs", "title_page": "Trudeau says US wants to collapse Canada's economy with tariffs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prime Minister Justin Trudeau slammed Donald Trump's sweeping tariffs on Canada, calling it a \"very dumb thing to do\" and vowed to conduct a \"relentless fight\" to protect its economy.\nTrump has imposed 25% tariffs on products entering the US from Canada and Mexico, and has increased a levy on goods coming from China.\nThe Canadian prime minister announced retaliatory tariffs on US exports and warned that a trade war would be costly for both countries.\nBut Trump pushed even further in a post on Truth Social, saying: \"Please explain to Governor Trudeau, of Canada, that when he puts on a Retaliatory Tariff on the U.S., our Reciprocal Tariff will immediately increase by a like amount!\"\nTrudeau accused the US president of planning \"a total collapse of the Canadian economy because that will make it easier to annex us\".\n\"That is never going to happen. We will never be the 51st state,\" he told reporters on Tuesday.\n\"This is a time to hit back hard and to demonstrate that a fight with Canada will have no winners.\"\nHe said that Canada's main goal remains to get the tariffs lifted so that they \"don't last a second longer than necessary\".\nTrump said he is protecting US jobs and manufacturing, and trying to prevent illegal migration and drug trafficking. The US president said his goal is to clamp down on the powerful opioid fentanyl; he has variously blamed the other countries for the drug's arrival in the US.\nResponding to the accusations, Trudeau said on Tuesday there was \"no justification\" for the new tariffs, because less than 1% of the fentanyl intercepted at the US border comes from Canada.\nTrudeau's words were echoed by Mexican President Claudia Sheinbaum, who said there was \"no motive, no reason, no justification\" for Trump's move. Speaking on Tuesday, she too vowed to issue her own \"tariff and non-tariff measures\" - but said further details would be given on Sunday.\nTrump's tariffs are likely to push up prices for consumers in the US and abroad, said John Rogers, an economics professor at American International University.\nThe items most likely to be affected the soonest are food - the fruits, vegetables and other produce the US imports from Mexico - followed by the large amounts of oil and gas imported from Canada, Prof Rogers said.\n\"Prices could go up pretty soon\", Prof Rogers warned, though he was reluctant to say by exactly how much or how quickly.\n\"We are in pretty uncharted territory,\" he told the BBC.\nThe bigger concern for prof Rogers was the potential damage he said was being done to America's longstanding trade partners.\n\"This is kind of sticking your finger in the eye of your neighbour,\" he said, adding that, in a potential US-Canada-Mexico trade war, \"everybody is a loser\".\nThe three countries targeted are America's top trading partners, and the tit-for-tat measures also prompted fears of that very trade war.\n\"There's no way you can win a trade war. Everybody suffers, because everybody's just going to wind up paying higher prices and sacrificing quality,\" Prof Rogers said.\nTariffs are a tax on imports from other countries, designed to protect against cheaper competition from elsewhere, and boost businesses and jobs at home.\nCanada's retaliatory measures include a 25% reciprocal tariff that will be imposed on C$155bn (US$107bn; £84bn) of American goods:\nA tariff on C$30bn worth of goods, external will become effective immediately\nTariffs on the remaining C$125bn of American products will become effective in 21 days' time\nCanada's Immigration Minister Marc Miller warned that as many as a million jobs in Canada were at risk if the tariffs were implemented, given how intertwined trade was between the two countries.\n\"We can't replace an economy that is responsible for 80% of our trade overnight and it's going to hurt,\" he said on Monday.\nSpeaking to the AFP news agency, a car manufacturing employee in the Canadian province of Ontario said people were indeed \"pretty scared\" of being laid off. \"I just bought my first house,\" Joel Soleski said. \"I might have to look for work elsewhere.\"\nThe sector is one that could be badly affected by the new tariffs regime in North America. Car parts may cross US-Canada border several times during the manufacturing process, and so might be taxed on multiple occasions.\nOntario Premier Doug Ford, whose province is home to Canada's auto manufacturing industry, told reporters on Tuesday that he anticipates assembly plants will \"shut down on both sides of the border\" as a result of the tariffs.", "url": "https://www.bbc.co.uk/news/articles/c89ye749nxvo"}