{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:02:39", "date_modify": "2025-04-26 08:02:39", "date_publish": "2025-02-26 17:00:50", "description": "Abdul Malik was reprimanded by the judicial watchdog for post of Hamas justifying the attacks.", "filename": "news_articles_cvgpexrv0d7o_1745654559.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f21b/live/15a34920-f448-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgpexrv0d7o_1745654559.html", "title": "Magistrate and Bristol councillor given warning for Hamas video", "title_page": "Magistrate and Bristol councillor given warning for Hamas video - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A magistrate has been given a formal warning for serious misconduct by a judicial watchdog for sharing on social media a video from Hamas about the 7 October 2023 attacks on Israel.\nAbdul Malik, who is also a Bristol City councillor and mosque leader, originally claimed he had only been tagged in the post but later accepted he must have shared the post himself.\nThe Judicial Conduct Investigations Office (JCIO) found Mr Malik had \"failed to exercise due care and diligence\" and his actions \"had a detrimental effect\" upon the \"reputation of the magistracy\".\nThe Green Party councillor has apologised repeatedly for the incident and insisted that he does not support Hamas.\nThe party said \"he has made abundantly clear that he does not endorse\" the contents of the post he shared.\nIn a statement, external published on Tuesday, the JCIO said the post on Mr Malik's Facebook timeline in October 2023 contained \"a video from Hamas regarding their attack on southern Israel\".\nMr Malik told the media in early 2024 that he had been tagged in the post by someone else, and that it appeared on his account because it was not protected.\nBut this account was challenged and he later informed his superiors that he had \"discovered he must have shared the post himself\", with an investigation then launched.\nThe JCIO said: \"He explained that he had shared the post without checking its source or content, and did not endorse it, comment on it or 'like' it.\n\"He agreed the post was offensive and he emphasised that he does not support Hamas.\n\"He said he had been consistently critical of Hamas in his position as chair of a large mosque in Bristol. He removed the post as soon as he became aware of it and said he regretted sharing it and had learned from the incident.\"\nThe JCIO said Mr Malik claimed his original explanation was given \"in good faith\" and that he had revised it when he realised it was not correct.\nA nominated JCIO committee member found that Mr Malik's initial denial of responsibility for the post \"was publicly discredited and compounded the damage caused by the initial sharing of the post\".", "url": "https://www.bbc.co.uk/news/articles/cvgpexrv0d7o"}