{"authors": ["Alex McIntyre", "Lee Blakeman", "www.facebook.com"], "date_download": "2025-04-26 03:44:59", "date_modify": "2025-04-26 03:44:59", "date_publish": "2025-03-05 06:29:45", "description": "Alan Wright says he was shocked by the gesture after he called an energy company about his bill.", "filename": "news_articles_c0kg7zp4zn4o_1745639099.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b29c/live/e7cde7e0-f991-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg7zp4zn4o_1745639099.html", "title": "Call handler sends flowers to 'sweet' Staffordshire customer", "title_page": "Call handler sends flowers to 'sweet' Staffordshire customer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man was left \"highly emotional\" after he got a bouquet of flowers in the post from a call handler he spoke to about his energy bill.\nAlan Wright, from Eccleshall, Staffordshire, called Octopus Energy on Thursday with concerns that he had been charged too much for his energy usage.\nThe 73-year-old had a polite conversation with an energy specialist called Marnie, who helped him to sort out the bill before the pair said their goodbyes.\nOn Sunday, Mr Wright returned home from a day out to find a \"huge\" parcel addressed to him, which contained a large bouquet of flowers and a message from Marnie.\nThe note thanked him for being \"such a sweet and kind customer\" who had made a big difference to her day.\nMr Wright told BBC Radio Stoke that he was still in shock at the gesture, adding: \"It was highly emotional.\n\"I was just being me, just being myself. I wasn't doing anything special but obviously it seems I touched the heart of this particular operator.\"\nHe said he contacted the firm after he was sent two bills, which he thought said he owed about £500, but it was discovered that his account was actually in credit.", "url": "https://www.bbc.co.uk/news/articles/c0kg7zp4zn4o"}