{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:34", "date_modify": "2025-05-19 14:23:34", "date_publish": "2015-03-09 12:12:38", "description": "Supporters of five women's rights activists detained in China say they are concerned for their welfare.", "filename": "news_world-asia-china-31792608_1747664614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81492000/jpg/_81492909_026218186-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-china-31792608_1747664614.html", "title": "Concern for women's rights activists detained in China", "title_page": "Concern for women's rights activists detained in China - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Supporters of five women's rights activists detained in China say they are concerned for their welfare.\nThe women were taken into police custody last week in the run-up to International Women's Day on Sunday.\nActivists said that the detainees were planning to hold public campaigns against sexual harassment.\nCorrespondents say the police appear to be holding at least one of them for an unusually lengthy period, as she was taken into custody on Friday.\nPolice in China usually release or charge a detainee within three days of their arrest, and Li Tingting, also known as Li Maizi, was detained on 6 March.\nChinese activist Feng Yuan, speaking from New York where she was participating in a UN women's issues events, said lawyers for the five in custody had not been able to reach them since their arrest.\n\"We're worried that they're still detained,\" Ms Feng told AP news agency. \"We don't understand how this has to do with public safety. And this goes against what the Communist Party and the government says they want to do to build a safer, crime-free society.\"\nThis year's International Women's Day coincided with China's top political meetings and observers say Chinese authorities often detain activists before the start of major political or international meetings.\nEight women's rights activists were taken to police stations on Friday and Saturday, and three were released after a few hours.\nOne of those released told the BBC that the police told her to warn people not to take part in planned events.\nAmong the activities which the activists had planned were a march in a Beijing park where participants would wear stickers advocating safe sex and action against sexual harassment; and gatherings in Beijing and Guangzhou calling for awareness of sexual harassment on buses.\nShe added that the five who are still in detention are either members, or founders, of women's rights and gay rights groups in Beijing, Hangzhou and Guangzhou.\nThe irony is that the activists were detained for trying to promote women's rights to mark International Women's Day. One of the activists - who did not want to be identified - told the BBC the police detained her for two hours over the weekend.\nShe had planned to take part in a protest at Beijing's Olympic Park to raise awareness about sexual harassment.\nThe campaigners held similar activities to mark International Women's Day in the past and faced no troubles. But this year's event coincided with China's annual parliamentary session, during which security is tighter than normal.\nThe police routinely detain people organising protests on vague charges of disturbing the public order.\nWomen's rights are high on this year's agenda - with the legislative session expected to pass a landmark domestic violence law. But increasingly the authorities are cracking down on non-governmental organisations pursuing their own agendas.", "url": "https://www.bbc.com/news/world-asia-china-31792608"}