{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:39:35", "date_modify": "2025-04-26 07:39:35", "date_publish": "2025-02-27 13:04:30", "description": "The UK culture minister praises the sport, after Welsh Labour colleagues say they will outlaw it.", "filename": "news_articles_c93kklzn14yo_1745653175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2dd6/live/5f6ba100-f507-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kklzn14yo_1745653175.html", "title": "'No plans' for UK greyhound racing ban beyond Wales", "title_page": "'No plans' for UK greyhound racing ban beyond Wales - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There are \"absolutely no plans\" to extend a greyhound racing ban announced in Wales to the rest of the United Kingdom, the UK culture secretary has said.\nWelsh Deputy First Minister Huw Irranca-Davies revealed plans last week to wind down the sport, which has been criticised for harming dogs.\nBut on Thursday Lisa Nandy told MPs she appreciates the \"joy\" greyhound racing brings and its the \"economic contribution\".\nThe Wales ban, the first in the UK, follows cross-party calls to outlaw the sport, a government consultation and a petition attracting 35,000 signatures.\nWales has just one dog-racing track: the Valley Stadium in Ystrad Mynach.\nWelsh Liberal Democrat leader Jane Dodds has said the ban was \"part of the package\" agreed with Labour ministers to allow the Welsh government's 2025-26 budget to get through the Senedd.\nIrranca-Davies told Senedd members he had \"seen the strength of feeling on this, and I have listened\", pointing to bans in other countries, including New Zealand where the government announced one in December.\nNo date has been announced for a Welsh ban, but the deputy first minister said: \"I want a ban to come into force as soon as practicably possible.\nThe Welsh government will ask an \"implementation group\" to flesh out proposals and learn from other countries.\nThe news was welcomed by a coalition of animal welfare charities including the Dogs Trust, which called for England, Scotland and Northern Ireland should follow suit.\nBut the Greyhound Board of Great Britain (GBGB), which regulates the sport, said the announcement had \"nothing to do with greyhound welfare and everything to do with pressure from the extreme animal rights movement\".", "url": "https://www.bbc.co.uk/news/articles/c93kklzn14yo"}