{"authors": ["Robbie Macdonald", "www.facebook.com"], "date_download": "2025-04-26 04:31:14", "date_modify": "2025-04-26 04:31:14", "date_publish": "2025-03-03 06:12:25", "description": "Pendle Council sets a new budget and postpones plans for two new waste sites in the borough.", "filename": "news_articles_clyd1ypqd8qo_1745641874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1fe7/live/366ec3c0-f739-11ef-9602-b3ff8cb82ca5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyd1ypqd8qo_1745641874.html", "title": "Pendle waste sites shelved as council tax rises", "title_page": "Pendle waste sites shelved as council tax rises - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors have axed plans for a new £2m waste transfer site as they agreed a tax rise for the coming year.\nPendle Council shelved the scheme in Nelson as the new budget was set, while another waste site, planned for Henrietta Street in Bacup, was also postponed.\nCouncillors said the facilities could prove to \"white elephants\" ahead of potential changes to waste management across Lancashire, as well as expected reforms to the county's councils.\nA council tax rise of 2.99% was also approved.\nBand D properties will now be charged £307.52 for Pendle's share of council tax, an increase of £8.93 for the year.\nMore than 60% of Pendle homes are in Band A, which will see an increase of £5.95 for the year from £199.06 to £205.01.\nLib Dem councillor David Whipp called for the £2m waste plans to be axed.\nHe said: \"Local government reorganisation requires us to reconsider our priorities, and what we can aim to do in the next two or three years.\"\nWhipp added that with council reform \"the pattern of waste collection and disposal may change radically\" and \"it would be foolish to spend millions on something that may well be a white elephant in just four years\".", "url": "https://www.bbc.co.uk/news/articles/clyd1ypqd8qo"}