{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:34", "date_modify": "2025-04-26 03:55:34", "date_publish": "2025-03-04 16:03:14", "description": "Hundreds of people gather across the south of England to mark Shrove Tuesday with pancake races.", "filename": "news_articles_c4g089vvn4ko_1745639734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4e21/live/73dc0510-f900-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g089vvn4ko_1745639734.html", "title": "Pancake Day 2025: Races take place across the south of England", "title_page": "Pancake Day 2025: Races take place across the south of England - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People have been flipping pancakes while running through the streets to mark Shrove Tuesday across the south of England.\nMany donned fancy dress outfits to take part in Pancake Day races, watched by hundred of onlookers.\nIn some towns across Hampshire, Oxfordshire, Berkshire, the Isle of Wight and Dorset the running races have been a longstanding, annual tradition.\nThe one in Wallingford, Oxfordshire, has been held for at least 50 years, organisers said.\nLocal resident, 44-year-old Ben Hodgkinson, came first in this year's race around Market Place in the town.\nRunners turned up with their frying pans for a short lap around the town, with the added requirement of a pancake toss at the start line.\nElsewhere in the region, in Wimborne Minster, Dorset, the town's former mayor organised this year's flipping event.\nCompetitors darted around the town's minster, slinging their pancakes in the air at four corners of the church.\nWhile in Berkshire, Great Western Railway passengers were served pancakes on their journey between Plymouth and Paddington.\nIsle of Wight ferry service Red Funnel posted a social media video to mark Shrove Tuesday where staff are purportedly seen hurling a pancake to one another, between different locations.", "url": "https://www.bbc.co.uk/news/articles/c4g089vvn4ko"}