{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:59", "date_modify": "2025-05-19 15:30:59", "date_publish": "2015-02-27 16:35:20", "description": "A senior council official at Tendring District Council says his annual pay rise should be shared by the council's lowest paid workers.", "filename": "news_uk-england-essex-31659904_1747668659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81285000/jpg/_81285243_81285242.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-essex-31659904_1747668659.html", "title": "Tendring council boss wants pay rise 'to go to workers'", "title_page": "Tendring council boss wants pay rise 'to go to workers' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A senior council official offered to forgo his annual pay increase so its 41 lowest paid workers can receive the \"living wage\" of £7.85 an hour.\nIan Davidson, chief executive of Tendring District Council based in Clacton-on-Sea, Essex, earns £121,000 a year and is due a rise of £2,666.\nHe said as \"a responsible employer\" in a \"deprived\" area the council should be seen to be \"setting an example\".\nThe council will decide whether the staff will get the rise on 24 March.\nConservative-run Tendring District Council employs 500 people and a spokesman said the pay rise, if implemented, would cost £25,955.\nMr Davidson said the area was \"deprived\" with \"a lot of people\" earning less than the living wage.\nMr Davidson said: \"I think that as a responsible employer that for us to pay the living wage to our staff, particularly in an area like Tendring, it is important that council be seen as a community leader and to demonstrate best practice.\".\nHe added it would \"demonstrate to our staff just how much we think about them\" and also would \"help them\" with living costs.\nThe council's human resources committee has recommended the pay increase but said Mr Davidson should still receive his pay rise.\nThe living wage is based on the amount an individual needs to earn to cover the basic costs of living, but unlike the national minimum wage is not legally enforceable.\nIt is set at £9.15 an hour in London and £7.85 an hour in the rest of the UK.\nThe adult minimum wage is £6.50.\nMr Davidson, who used to work for the Council of Europe, has worked at the council for more than four years.\nIf the full council meeting approves the pay rise, the workers would receive it by 1 April.", "url": "https://www.bbc.com/news/uk-england-essex-31659904"}