{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:14:50", "date_modify": "2025-04-26 06:14:50", "date_publish": "2025-03-01 23:10:45", "description": "Many of Sunday's front pages are dominated by Ukrainian President Volodymyr Zelensky's visit to No 10.", "filename": "news_articles_c93ng2qzgv2o_1745648090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ef5b/live/bd487100-f6f0-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93ng2qzgv2o_1745648090.html", "title": "'Hug of hope' and 'billions for Kyiv and UK defence'", "title_page": "Newspaper headlines: 'Hug of hope' and 'billions for Kyiv and UK defence'  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pictures of the prime minister and Ukrainian President Volodymyr Zelensky embracing outside Downing Street make almost all of the front pages.\n\"We've got your back\", is the Sunday Mirror's, external main headline. The Sunday People describes the embrace as a \"hug of hope\", after US President Donald Trump clashed with the Ukrainian president during a meeting at the White House on Friday.\nThe Observer notes, external how in a clear demonstration of his sympathy for Zelensky, Sir Keir Starmer \"took the unusual step of walking along the pavement to greet him\". It says that when inside Number 10, Sir Keir told him the UK had an \"absolute determination\" to stand with Ukraine.\n\"We still love you\", is the Sun on Sunday's message to Zelensky, external. In what the paper describes as \"highly emotional scenes\", crowds lined Whitehall to cheer his arrival to Downing Street.\nThe Sunday Telegraph's, external comment section says the support is because \"the British love an underdog, especially if he also happens to be a hero\".\nThe Daily Express lavishes praise, external on the welcome provided by the prime minister, saying he \"made the nation proud\".\nThe Sunday Times has details, external of the aftermath of the row between Zelensky and Donald Trump in Washington. Those who listened in to Sir Keir's calls with both leaders say Zelensky was \"still in an emotional place\", while Trump remained \"pretty defiant\".\nThe paper says Sir Keir's national security adviser, Jonathan Powell, is understood to have urged the Ukrainians to return to the White House on Friday night, but Trump's team is said to have thought tempers needed to cool first.\nAnd finally, \"stay under the duvet\", declares the Mail on Sunday, saying that a Sunday lie in \"really can make you happier\"., external Researchers at Chengdu University in China found people who spend up to two hours longer in bed at the weekend may halve their risk of depression. The extra snoozing reportedly has particular benefits for men and those aged between 40 and 60.", "url": "https://www.bbc.co.uk/news/articles/c93ng2qzgv2o"}