{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:50:48", "date_modify": "2025-05-21 06:50:48", "date_publish": "2025-03-31 00:00:00", "description": "At least three hospitals in the country are out of service, according to the World Health Organisation, three days after a powerful earthquake hit the country.", "filename": "news_live_c04z4wzgq5qt_1747810248.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/033f/live/0ced76f0-0e35-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c04z4wzgq5qt_1747810248.html", "title": "Myanmar hospitals overwhelmed as military government says more than 2,000 killed", "title_page": "Myanmar hospitals overwhelmed as military government says more than 2,000 killed - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Death tolls rise as rescue efforts continue\nRescue efforts are continuing in Myanmar, three days after a 7.7 magnitude earthquake hit the country.\nThe military government there says the number of people killed has now risen to 2,056, with more than 3,000 injured - but getting information out of Myanmar is difficult and there are questions over the scale of the disaster.\nIt has declared that a minute's silence will be held on Tuesday, as well as a week of national mourning.\nThe UN says the earthquake has compounded \"an already dire crisis\" in the country, which is in the midst of a four-year civil war. Despite the destruction, reports suggest Myanmar’s military leaders are still carrying out air strikes against pro-democracy rebel groups.\nMeanwhile in neighbouring Thailand, at least 20 people are known to have died, with rescue efforts continuing in Bangkok for 74 construction workers thought to be trapped under the rubble of a collapsed high-rise building.\nBut officials there warn there has been no signs of life amongst the wreckage for hours.\nWe’re bringing this live page to a close, but you can keep up-to-date on the BBC News website:\nMyanmar quake: 'I feel guilty - our people need us the most now'\nMyanmar earthquake: What we know\nAdditional Chinese rescuers to be deployed to Myanmar\nAn additional 80 rescuers from China's Blue Sky Rescue Team will be deployed to Myanmar on Tuesday, the organisation says.\nTeam leader Zhu Minyun says that as things stand, the main focus is on search and rescue, with deployed teams short on manpower and equipment, and working in intense heat.\nZhu points out that with more rescuers arriving, things should improve \"a lot\".\nHe says the goal is to set up a major relief corridor into Myanmar to reach more affected areas, and rescuers plan to work with Chinese and Burmese authorities to assess the safety of the route.\nMilitary junta not responding to ceasefire calls in Myanmar - ousted government politician\nMyanmar's military junta is not responding to requests for a ceasefire in the country's four-year civil war, according to a member of the National Unity Government (NUG), which represents the ousted civilian administration.\nSpeaking to the BBC, Win Myat Aye says \"fighting is continuing from their side. Near Mandalay, in some townships, they have the heavy weapons shooting inside”. We brought you details on some of the reported ground attacks earlier.\nHe adds that some “revolutionary forces have extended their will to help” but “there is no signal” or response from the military.\nHe also accuses the military junta of prioritising taking aid for themselves rather than channelling it to those most in need.\nMyanmar citizen in Thailand: 'I feel guilty - our people need us the most now'\nTessa Wong\nReporting from Samut Sakhon\nThe last time Soe Ko Ko Naing saw his great-uncle was in July as he was about to flee the country\nLiving in Min Kun, a small town in the military stronghold area of Sagaing, Ko Naing did not trust anyone enough to tell them of his plan – except his beloved Oo Oo ('uncle' in Burmese).\n\"I told him I was going to Thailand. He thought it was a good plan. He wished me good health and safety,\" recalled Ko Naing, a 35-year-old labour rights activist.\nNearly a year on, Ko Naing, a supporter of Myanmar's resistance against the military junta, is safe in Thailand. But his Oo Oo was killed by the powerful earthquake that struck Sagaing near Mandalay last Friday.\n\"I have sleepless nights. I'm still suffering,\" said Ko Naing.\n\"I have no remorse for leaving the country, because I had to. But I feel guilty because our people need us the most now. I feel helpless.\"\nThe BBC has spoken to some of the millions of Myanmar's diaspora anxiously watching from afar as their country struggles following its biggest earthquake in a century.\nPrison where Aung San Suu Kyi is 'largely unaffected' - son\nThe prison housing Aung San Suu Kyi, Myanmar's jailed democracy icon, is believed to be \"largely unaffected by the earthquake\", her son Kim Aris told the BBC from the US, where he's based.\n\"But there's no way of getting anything confirmed,\" he said, adding that she has only been allowed to write to him once since she was imprisoned.\nThe former civilian leader who was ousted in the 2021 military coup and is serving a decades-long jail sentence on charges that her allies and supporters say are politically motivated.\n\"The military have used natural disasters like this in the past as weapons against their own people by withholding humanitarian aid,\" Kim Aris said - echoing previous claims from activists and aid groups following similar natural disasters.\n\"I hope that's not going to be the case on this occasion, but I don't imagine they're going to change their stripes.\"\nMyanmar ceasefire 'crucially important' for aid work - UN official\n\"There needs to be a ceasefire\" in the ongoing civil war in Myanmar to help disaster relief efforts, according the the UN's special rapporteur on human rights in Myanmar.\nAs we told you earlier, rebels have been reporting that the Myanmar military has been carrying out ground attacks in areas hit by the earthquake.\nSpeaking to the BBC's Newsday programme, Tom Andrews says there are also fears among those volunteering that they might be arrested or conscripted.\n\"The level of fear in this country and the devastation brought by this military coup and all that has followed is absolutely devastating,\" he says.\nHe adds that a ceasefire is \"crucially important\" to enable humanitarian aid to \"get in and not be blown up\".\nThe UN official also calls on the international community to \"put as much pressure as possible on the junta to just stop. Stop the fighting, stop the bombing\".\nTeachers and students still trapped in Sagaing high school - rescuer\nA rescue worker tells our colleagues at BBC Burmese that eight children and three teachers from Myat Soeung High School in the city of Sagaing, Myanmar are still trapped in the rubble.\nSince the earthquake struck on Friday, dozens of students and teachers have remained stuck in the school's wreckage, but this morning the Malaysian rescue team managed to get the headteacher out, they say.\nThe rescue worker adds that this is thanks to the Malaysian team's technology and machinery, as they have a team able to identify where people are - making the process faster.\nBut a sense of uncertainty and diminishing hope overshadows rescue efforts at the moment, they add. In recent days rescuers have heard cries for help, but \"today we haven't heard any, so we're not sure if the children are alive\", they say.\nRescue efforts continue three days after earthquake - a recap\nRescues efforts have continued into Monday after a 7.7 magnitude earthquake hit Myanmar - here's everything you need to know so far.\nMyanmar\nThe full scale of devastation here continues to emerge.\nIn the last hour, the military junta ruling the country announced that 2,056 people have been killed, with more than 3,900 injured and 270 people still missing.\nAs a reminder, getting information out of the country is difficult, and Myanmar's military leadership has a history of supressing the scale of national disasters.\nThe World Health Organization has launched an urgent appeal for $8m (£6.2m) in aid for its earthquake response in Myanmar, with a spokesperson reporting hospitals destroyed and overwhelmed.\nForeign aid and rescue teams have joined the effort, with a Chinese team reportedly pulling four people alive from the rubble in Mandalay on Monday.\nThailand\nAt least 19 people are confirmed to have died in Thailand since Friday's earthquake.\nThe situation in the country has \"largely returned to normal\" according to the prime minister, but rescue operations continue amongst the rubble of a high-rise building that collapsed in Bangkok - where 12 people are known to have died.\nThe city's deputy governor has warned that three days out from the collapse, there is now a “lower chance for a survivor” to be found, and there have been no signs of life spotted for hours.\nDo we know the true scale of the devastation in Myanmar?\nThere have been questions surrounding the information and statistics released by Myanmar's military leadership, which has a history of supressing the scale of national disasters.\nGetting information out of Myanmar is difficult.\nMedia access has been restricted in the country since 2021, and the state controls almost all local radio, television, print and online media. Internet use is also restricted.\nThe military council has rejected requests from international journalists to cover the devastation, citing the lack of water, electricity and hotels, according to the Reuters news agency.\nMobile lines in the affected areas have been patchy, but tens of thousands of people also live without electricity, making it difficult for the BBC to reach residents.\nForeign journalists are rarely allowed into the country officially, and the junta has said it will not grant visas for foreign reporters requested to cover the aftermath the earthquake, citing an inability to guarantee their safety.\nWhat we know about the Myanmar earthquake so far\n'Super-shear' earthquake caused damage miles from epicentre\nVictoria Gill\nScience correspondent\nEarly analysis of Friday's earthquake that hit Myanmar and the surrounding region has revealed why the event has had such devastating effects hundreds of miles from the epicentre - in Bangkok.\nScientists who are currently examining data from a global network of seismic monitors say it appears that the rupture in the Earth’s crust that caused the earthquake grew faster than the waves of energy it created could physically move through the earth.\nWe call this a \"super-shear\" earthquake, Dr Stephen Hicks from UCL explains.\nThis means, he says, that the energy from that rupture builds up because it is moving faster than seismic waves can travel through the rock of Earth's crust. “That’s what causes this greatly increased ground shaking,” he says.\nSeismologists, who have been sharing their early analyses online, say the length of the rupture was as much as 400km (248.5 miles) long.\nIn one post, Prof Frederik Tilmann from the Helmholtz Centre for Geosciences in Potsdam, Germany, explains that a super-shear rupture like this “is the earthquake equivalent of a supersonic jet”, travelling at speeds of around 5km per second.\nBecause the fracture “unzipped” towards the south it also directed this piled up energy towards the Thai capital, Bangkok.\nSuper-shear earthquakes are relatively rare, but scientists studying them say understanding what causes them - and where they are most likely to happen - is vital to develop a more accurate picture of earthquake risk.\nNo 'vital signs' among rubble of Thai high-rise for five hours\nNineteen people are known to have died in Thailand so far, with 12 killed when a high-rise building in Bangkok that was under construction collapsed.\nRescue operations at the construction site continue, but in the last past five hours, rescuers have been unable to detect \"more vital signs\" from those trapped in the rubble, Bangkok deputy governor Tavida Kamolvej says.\nRescuers detected one individual earlier today, she adds, but \"unfortunately it's the dead body, which you have already seen we carried that body out.”\nKamolvej says there is now a “lower chance for a survivor” to be found, as it has passed 72 hours since the construction site collapsed, but insists teams are not giving up and are working to speed up their efforts.\n“The reason why there's a lot of trucks coming in and out because we try to clear the mountains of the rubbles for the space,” Kamolvej says.\nThai PM says situation 'largely returned to normal'\nWe've been bringing you a lot of updates this morning on the situation in Myanmar, but Friday's earthquake has also had an impact in neighbouring Thailand.\nThe country's Prime Minister, Paetongtarn Shinawatra says search and rescue operations there continue, but the \"situation has largely returned to normal\".\nWriting in a post on Facebook, she also offers her \"heartfelt\" appreciation to leaders who reached out and sent support in the aftermath of the earthquake.\n\"We are deeply touched to all who have reached out and extended a helping hand, which reflects your solidarity and care,\" she writes.\nShinawatra adds that the government is monitoring the current situation and is ready to provide further assistance if needed. She also extends her \"thoughts and prayers\" to Myanmar.\nA preschool reduced to rubble in Myanmar\nHtet Naing Zhaw\nBBC Burmese in Kyaukse\nIn Kyaukse – which is about 44km (27.3 miles) away from Mandalay, the epicentre of Friday’s massive earthquake - I’m standing at what used to be a preschool for children aged between two-and-a-half years to seven.\nAll that is left now is a pile of bricks with iron bars protruding out here and there.\nStrewn amid the wreckage are childhood mementos. I see about 15 school bags of different colours - pink, blue, orange, and some shaped like Minions from the Despicable Me film franchise – torn apart with books spilling out of them.\nAlso visible are Spiderman toys, letters of the alphabet, sliders and other learning materials.\nThere were believed to be about 70 children at the school when the earthquake struck. The school says 13 of them have died, but locals believe the number to be at least 40 - that is how many were in the downstairs section of the school that collapsed entirely.\nResidents and parents here are distraught.\nMany tell me they rushed to the school when the earthquake struck to try and help with rescue efforts. They say they have not been able to eat a thing since, with some describing scenes where bodies of children were retrieved and taken away in ambulances.\nSome talk about how mothers came here and cried, calling out the names of their children, until the next day.\nRescue efforts continued until midnight on Friday night, but efforts stopped the following day.\nThere is no rescue work as I’m here. It’s all empty now.\nFour people pulled alive from rubble in Myanmar - report\nFour people have been pulled alive from a collapsed building in Mandalay, Myanmar, according to China's Xinhua news agency.\nThose rescued included a pregnant woman and a child, who were found alive amidst the rubble of the Sky Villa apartment building.\nAccording to the news agency, Yue Xin, head of the China Search and Rescue Team that reportedly pulled people from the rubble in Mandalay says: \"It doesn't matter how long we work. The most important thing is that we can bring hope to the local people\".\nMyanmar's neighbours, including China, India and Thailand, are among some of the countries to support rescue efforts.\n'I have lived through several earthquakes, but never anything like this' - rescue worker\nRescue teams on the ground in Myanmar are having to navigate damaged roads, landslides and debris to reach affected communities, the International Rescue Committee says.\nTheir work is also being complicated by \"unreliable\" communication systems, \"especially in downtown areas\", and severe power outages, one worker adds.\nThey are currently stationed near the epicentre in Mandalay, and say people are sleeping outside on roads or in open fields for fear of aftershocks. But in towns and cities, there are not enough tents for people to shelter in, or safe spaces to seek refuge.\n\"We are also running out of water for both drinking and daily use. Only small water bottles are available, but they are rare and expensive,\" they say.\n“I have lived through several earthquakes in my life, but I have never experienced anything like this.\"", "url": "https://www.bbc.com/news/live/c04z4wzgq5qt"}