{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:48:23", "date_modify": "2025-04-26 06:48:23", "date_publish": "2025-03-01 11:25:56", "description": "The sisters will compete in an international pageant, each promoting an issue close to them.", "filename": "news_articles_cddy9vlyp80o_1745650103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ccbb/live/0c8fb5b0-f4fe-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy9vlyp80o_1745650103.html", "title": "York sisters to promote community projects at US beauty pageant", "title_page": "York sisters to promote community projects at US beauty pageant  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three sisters are set to use an international beauty pageant in the United States to raise awareness of issues close to them.\nGrace Steeley, 17, Bella Gledhill, 12, and Millie Gledhill, 10, from York, have followed in the footsteps of their mother, Tracie Steeley, who took up pageantry after being diagnosed with breast cancer.\nAfter each winning a title and dozens of trophies in the UK, the girls will travel to Orlando in June to compete in the Pure International Pageant, and to promote their own \"community impact project\".\nBella, whose project is to provide care packages to kids whose parents have cancer, said: \"I had the packages when I was struggling with Mum.\"\nShe told BBC Radio York: \"Growing up, it wasn't easy to do things that other children did.\n\"Most of the time it was only me, Mum, the girls and my older brother; it was really tricky.\"\nGrace, who is autistic and whose project is to promote circus skills to help other girls with autism, said most of her friends had been made through pageantry.\nShe added: \"You don't go into pageantry just because the dresses are pretty.\"\nGrace said she fought for years to get her diagnosis and, as a result, did not have the support she needed when she was in mainstream school.\n\"I want to make sure that other girls do get that support,\" she said.\n\"I started circus because it calmed me down and now it's 10 years down the line, I'm still performing and it makes me happy.\"", "url": "https://www.bbc.co.uk/news/articles/cddy9vlyp80o"}