{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 03:55:29", "date_modify": "2025-04-26 03:55:29", "date_publish": "2025-03-04 16:06:27", "description": "An inquest hears that Robert Astley sustained burns to his left thigh, which became ulcerated.", "filename": "news_articles_c36wxxpxp2lo_1745639729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5b59/live/3b269f60-f90e-11ef-b5c1-27f306935cb2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c36wxxpxp2lo_1745639729.html", "title": "Birmingham child killer Robert Astley died in hospital from sepsis", "title_page": "Birmingham child killer Robert Astley died in hospital from sepsis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who kidnapped and murdered a two-year-old girl more than four decades ago died from natural causes, an inquest has heard.\nRobert Astley died from sepsis after sustaining a burn to his left thigh which became ulcerated while under the care of HMP Norwich.\nHe had been serving life in prison for sexually assaulting and murdering Denise Bradbury after he abducted her from her home in Kingstanding, Birmingham, in 1983.\nThe coroner said the 64-year-old refused medical care and was taken to Norfolk and Norwich University Hospital three days later, where he died.\nThe inquest heard Astley, who had a complex medical history, died of sepsis, a skin ulcer on his left thigh, diabetes mellitus and chronic kidney disease.\nA pathology report read out to the court on Tuesday said the background medical history of diabetes and chronic kidney disease would have been \"significant co-morbid conditions\", and attributed the death to natural causes.\nAstley was sentenced to life in prison at Birmingham Crown Court in October 1983, when he was 23, after he confessed to murdering two-year-old Denise.\nHe sexually assaulted and murdered her, before dumping her body in the back of a car in the Sparkhill area of the city.\nAstley sustained the burn to his left thigh on 22 November 2023, after a nurse passed him hot water through the hatch of his cell.\nThe inquest heard that Astley became abusive with the nurse after some of the water fell onto his pants, later refusing any dressing or antibiotics.\nHe reported feeling unwell on Christmas Day and was taken to hospital on Boxing Day after his condition worsened.\nThe doctor concluded Astley had sepsis and pneumonia, later developing multi-organ failure and died on 27 December.\nAmendment 6 March 2024: The headline has been corrected to say Astley died in hospital rather than in prison.", "url": "https://www.bbc.co.uk/news/articles/c36wxxpxp2lo"}