{"authors": ["Declan Carey", "www.facebook.com"], "date_download": "2025-04-26 04:41:49", "date_modify": "2025-04-26 04:41:49", "date_publish": "2025-03-02 07:00:09", "description": "Ongoing roadworks in Stockport town centre could last until the end of March, residents are warned.", "filename": "news_articles_cr42679qn9xo_1745642509.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/981f/live/08f2c9d0-f443-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr42679qn9xo_1745642509.html", "title": "Stockport town centre roadworks may take a month to complete", "title_page": "Stockport town centre roadworks may take a month to complete - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Roadworks in a busy town centre may not be completed until the end of March, residents have been warned.\nAimed at providing better links between Stockport Interchange and other parts of the town centre, a new traffic light-controlled crossing is being built for pedestrians and cyclists on Wellington Road, between Viaduct Park and the Hat Works museum.\nThe work, which started in January, has required the narrowing of lanes on the A6.\nStockport Council said it expected the new crossing to be ready by the end of the month.\nThe Local Democracy Reporting Service also said Daw Bank would close in both directions between the Exchange Street and Mersey Square junctions from 12-30 March.\nFor new railings to be installed on the A6 viaduct parapet, scaffolding must first be erected.\nThe higher railings will mean cyclists can use new sections of a shared footway and cycleway on the approaches to the new town-centre crossing.\nSigned diversion routes for vehicles and cyclists will be displayed around the Daw Bank closure.\nThe council said the roadworks had been carefully planned to minimise disruption.\nIt also said it had been working with Transport for Greater Manchester to plan bus service diversions on the A6 and Daw Bank.", "url": "https://www.bbc.co.uk/news/articles/cr42679qn9xo"}