{"authors": ["Paul Kirby", "www.facebook.com"], "date_download": "2025-04-26 04:12:23", "date_modify": "2025-04-26 04:12:23", "date_publish": "2025-03-04 12:23:04", "description": "Should he apologise to Trump or even resign? The options for Ukraine's leader are looking increasingly thin.", "filename": "news_articles_ce98xnldr0vo_1745640743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0247/live/20d66a50-f8fa-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce98xnldr0vo_1745640743.html", "title": "The difficult choices facing Ukraine's Zelensky", "title_page": "The difficult choices facing Ukraine's Zelensky - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukraine's Volodymyr Zelensky is in a bind.\nAfter last Friday's disastrous meeting in the Oval Office, it seems nothing that he says goes down well with President Donald Trump. And now the US has suspended aid to Ukraine, his options are looking increasingly thin.\nEven a former close Republican ally in the US, Senator Lindsey Graham, has turned on him, suggesting \"he either needs to resign and send somebody over that we can do business with, or he needs to change\".\nWhat kind of change might that be - or should he resign if that's the price of US support?\nThis option seems Zelensky's most likely way out and Ukraine's prime minister now says Kyiv is open to talks on signing a minerals deal with the US.\nTrump told Zelensky point-blank on Friday he was not in a very good position: \"You don't have the cards right now - with us you start having cards.\"\nZelensky had been ready to sign-off on the minerals deal with Trump on Friday before he was told to leave the White House.\nThat particular card appears to have remained on the table, and on Monday night Zelensky's chief aide Andriy Yermak said he was working on it with Republican Congressman Brian Fitzpatrick and the deal was \"crucial for both our countries\".\nBut clearly the Trump administration is holding out for more.\nZelensky cannot afford to be humbled into an abject apology. After three years of Russian bombardment, Ukrainians are not in the mood for capitulation.\nBut he would have to find a form of words sufficient to appease Trump.\nHe might also have to accept a ceasefire on Trump's terms, even if he still believes peace is \"very, very far away\".\nWould the deal mean a resumption of aid and to what extent? Certainly that's a priority for Kyiv.\nThe head of parliament's foreign affairs committee, Oleksandr Merezhko, says suspending US aid is dangerous for Ukraine's ability to defend its own civilians.\nFalling on his sword is not something Zelensky will or can consider.\nTrump has called him both unelected and a dictator, echoing Vladimir Putin's Russian propaganda narrative since the start of the war.\nZelensky said on Sunday night it seemed \"a bit undemocratic\" for Ukrainians to be told who should be their president.\nHe is after all Ukraine's elected leader, and although his term was meant to end last year, he remains president under martial law, which came into place precisely because of Putin's Russian invasion.\nIt would be a great result for Putin, who has sought to replace Zelensky since the start of the war and will not even talk directly to him \"because of his illegitimacy\".\nBut the only way Zelensky would consider it would be in exchange for Nato membership for Ukraine, and Trump has said he should forget about that.", "url": "https://www.bbc.co.uk/news/articles/ce98xnldr0vo"}