{"authors": ["Grace Wood", "www.facebook.com"], "date_download": "2025-04-26 06:42:36", "date_modify": "2025-04-26 06:42:36", "date_publish": "2025-03-02 11:23:06", "description": "A service is being held to remember the last German aircraft to be brought down over British soil.", "filename": "news_articles_c62zgr167g5o_1745649756.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/56a8/live/6e2d5ca0-f747-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zgr167g5o_1745649756.html", "title": "Elvington service to remember WW2 aircraft tragedy 80 years on", "title_page": "Elvington service to remember WW2 aircraft tragedy 80 years on - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A service is being held to remember the last German aircraft to be brought down over British soil during World War Two.\nOn 4 March 1945, a German aircraft crashed at Elvington near York killing all four of the crew and three civilians on the ground.\nYorkshire Air Museum marketing and communications manager Jerry Ibbotson said the attack had been \"a last throw of the dice\" by the German Luftwaffe.\nHe said: \"These were the dying weeks of the Second World War. They were very tragic events and we are gathering people in one place 80 years on to remember something that was tragic and ultimately pointless because the war ended two months later.\"\nA service of remembrance and reflection will be held at Yorkshire Air Museum on Sunday at 13:00 GMT.\nThe aircraft was part of Operation Gisela, which saw 117 fighter planes sent to intercept allied bombers returning to base after striking targets in Germany.\nA number of bombers were brought down, including three from RAF Elvington (operated by French aircrew).\nThe memorial service will be attended by relatives of the RAF soldiers killed during the operation.\nRoss Oliver, the nephew of Flt Lt Jack Laffoley of No.10 Squadron, RAF Melbourne, who was shot down and killed, will attend the ceremony from Canada with his daughter Tanya and her husband.\nLaffoley was on his last, 33rd mission, aged 22.\nAccording to Yorkshire Air Museum, the German aircraft – a Junkers JU88 Night Fighter – had been attacking a nearby RAF bomber base, now home to the museum, when it struck a farmhouse, killing the Junkers crew and three people in the house.\nFarmer Richard Moll, his wife, Helen and daughter in law, Violet, died in hospital from their injuries.\nViolet's husband Fred Moll saved the life of their three-year old son, Edgar, fighting his way to the outside.", "url": "https://www.bbc.co.uk/news/articles/c62zgr167g5o"}