{"authors": ["Lisa Young", "Georgina Barnes", "www.facebook.com"], "date_download": "2025-04-26 07:33:31", "date_modify": "2025-04-26 07:33:31", "date_publish": "2025-02-27 16:04:16", "description": "The automated Longships Lighthouse off Land's End is sounding a loud beep every 13 seconds.", "filename": "news_articles_cdelld75wgro_1745652811.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6a89/live/195aa690-f51e-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdelld75wgro_1745652811.html", "title": "Land's End lighthouse fog alarm sounding 'all day, all night'", "title_page": "Land's End lighthouse fog alarm sounding 'all day, all night' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People living near Land's End have been advised to buy earplugs due to a lighthouse's broken fog alarm.\nLongships Lighthouse has been sounding a loud beep every 13 seconds for the past week.\nThe National Coastwatch Institution Gwennap Head said on social media, external the horn had been sounding \"all day, all night\" and \"a set of ear plugs might be a good investment\".\nA tourist visiting the spot told the BBC it was \"the noisiest sunset I've seen so far\".\nTrinity House, which manages more than 60 lighthouses across the UK, said there was an issue with the \"audible hazard warning signal\" on Longships.\nThe company is making plans to send technicians to fix the fault.\nThe high-pitched electronic beep is usually only heard during foggy conditions, most clearly at Land's End, and also by residents of places around the coast including Sennen and Cape Cornwall.\nA spokesperson said: \"It will likely be an issue with the visibility sensor not functioning as expected.\n\"The hazard warning signal indicates diminished visibility in the area, such as fog.\"\nThe weather conditions have not been foggy this week.\nSimon Muth, deputy station manager at the national coastwatch station at Gwennap Head, said it was reported to Trinity House on Wednesday.\n\"Trinity House came back and said 'yes, we know there's a fault...we're waiting for a spare part',\" he said.\nLongships Lighthouse, a 115ft-tall (35m) tower, was built in 1875 and is about 1.25 miles (2km) off Land's End.\nIt was manned by resident lighthouse keepers until it became automated in 1987.\nSince then it has been monitored and controlled from Trinity House's planning centre in Harwich, Essex.", "url": "https://www.bbc.co.uk/news/articles/cdelld75wgro"}