{"authors": ["Hugh Pym", "www.facebook.com"], "date_download": "2025-05-19 15:02:37", "date_modify": "2025-05-19 15:02:37", "date_publish": "2015-02-27 12:46:30", "description": "Greater Manchester is to take control of its health budget from April this year. While details are still to emerge, it's a significant move.", "filename": "news_health-31661416_1747666957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81288000/jpg/_81288658_mancth.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_health-31661416_1747666957.html", "title": "'Devo Manc' and the NHS", "title_page": "'Devo Manc' and the NHS - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been a potentially momentous week for the NHS and the future of regional government in England.\nThat's what the rhetoric is suggesting. But details of the ground-breaking announcements on health and social care in Greater Manchester are still patchy.\nThe jury will be out for a while, but opinion formers in the health world are favourably disposed at this stage.\nNews of such significance is often trailed in a controlled way with a few outlines released in advanced followed by the full package at a pre-planned press conference.\nIt was nothing of the sort this time.\nThe announcement was a genuine surprise - there had been no nudges and winks in preceding weeks.\nIt was leaked by over-eager councillors in the Manchester area briefing BBC Radio Manchester and the Manchester Evening News. Well done to them on a fine scoop.\nI gather NHS England chiefs were livid that their thunder had been stolen by local authority sources in Manchester.\nThey had planned to unveil the plan in the city today once the memorandum of understanding had been signed.\nThe merger of health and social care for 2.7m people will be one of the most significant developments on Simon Stevens' watch.\nUnderstandably he wanted to be in control of the announcement.\nThe Chancellor George Osborne, unsurprisingly, was smiling as he delivered a brief TV clip after the story broke.\nIt fits in well with his Northern powerhouse agenda and the devolution of power and money from Whitehall to Manchester which he set in train last autumn.\nCynics might think it all looks rather convenient with the election barely two months away.\nBut I am told that his contacts amongst Greater Manchester councillors were important in facilitating an agreement.\nA Chancellor of the Exchequer has the clout across national and regional government to make things happen.\nThe first thing which has been made clear is that this is a joint initiative involving local authorities and the GPs who head the local health commissioning groups.\nThe idea that £6 billion was being handed to local councillors was always wrong.\nA new strategic health and social care partnership board will have representatives from the councils, hospitals and other providers, clinical commissioning groups and local NHS England management.\nIt has been emphasised that the deal does not amount to another reorganisation of the NHS.\nThe new structure in Manchester will have to work to standards on care and patient rights and meet statutory duties set out in the NHS Constitution.\nEven so Simon Stevens described it as the greatest integration and devolution of care since the creation of the NHS in 1948.\nAbout £1.5 billion currently spent by NHS England will be handed to the new Greater Manchester body.\nThis includes money spent on specialised commissioning, for example treatments of rare diseases, and on GP services. The £6 billion pooled budget will also include funding for public health and social care at present held in town halls.\nThere is no doubt of the excitement amongst health and civic leaders in Greater Manchester, with \"defining moment\" and \"unprecedented agreement\" spicing up the press releases.\nThere is a genuine conviction that the new arrangements will help move the region from one with some of the worst health outcomes to the best.\nJoined up thinking and spending, its argued, will promote prevention and care outside hospitals which can only improve the lives of residents.\nAnd yet.....it will be a huge undertaking.\nThe structure, we are told, will be in place by April 2016 and fully functional a year later.\nRemember, this has never before been tried in England. It will be on a bigger scale than the integrated health and social care system in Northern Ireland which has been operational since the 1970s.\nThere are suspicions in the health world that local councillors will distort priorities for the NHS.\nA former clinical director of an NHS drug and alcohol service warned in The Guardian today that devolving this service to a local authority had resulted in it being outsourced because of local government competitive tendering rules.\nFew doubt that the prize of genuine health and social care integration is well worth striving for. But delivering it is a big ask.\nThere will be unintended consequences and continued questions about whether this is the beginning of a fragmentation of the NHS in England.\nPerhaps the old cliche is applicable here - only time will tell.", "url": "https://www.bbc.com/news/health-31661416"}