{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:19:32", "date_modify": "2025-05-19 15:19:32", "date_publish": "2017-07-31 00:00:00", "description": "Live updates as a second day trouble breaks out at HMP The Mount prison in Hertfordshire.", "filename": "news_live_uk-england-beds-bucks-herts-40788682_1747667972.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-beds-bucks-herts-40788682_1747667972.html", "title": "HMP The Mount prison: Second day of trouble breaks out", "title_page": "HMP The Mount prison: Second day of trouble breaks out - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage of the riot at HMP The Mount\nOur coverage of a second day of trouble at The Mount prison has come to a close.\nJoin us on the regular Local Live service for Hertfordshire, when we will have more reaction to two days of problems at the jail.\nOrder restored at jail\nOrder has been restored at HMP The Mount after a second day of rioting, the Ministry of Justice has confirmed.\nIt says that the disorder had been resolved shortly before 17:00.\nSpecialist riot-trained officers were deployed after inmates reportedly seized control of part of Nash Wing, which houses up to 250 inmates.\nIt was reported that prisoners were armed with weapons.\nPersonnel from the Tornado team were called in again less than 24 hours after restoring order at jail yesterday.\nMore on Nash wing..\nHMP The Mount is located close to the Hertfordshire/Buckinghamshire border in a village called Bovingdon on the site of a former RAF base.\nIt holds just over 1,000 criminals, with the last report stating that 223 prisoners were in the Nash Wing where the riots are said to be taking place.\nOn 28 February 2017, the report recording that the jail as a whole had approximately 130 prisoners (13%) over the age of 50, with half of these allocated on the specialist residential unit where they have a quieter and more flexible regime.\nSome 128 prisoners were identified as disabled.\n'Officers are treating the riot quite seriously'\nWe've just spoken to John O'Reilly, who's a photographer for South Beds News Agency. He is outside the prison and has just been asked to move towards the end of the road.\nHe said \"there have been lots of prison officers arriving in the last few minutes. They are driving vehicles in to the prison itself\".\n\"They are obviously treating it quite seriously,\" he said.\n\"I think there are more vehicles here now than there were yesterday.\n\"I've seen at least six plus a coach full of prison officers go in to the prison. They are all carrying bags but aren't wearing riot gear.\"\nReport found 'influx of drugs' in prison\nMore now on a report by the Independent Monitoring Board, external on HMP The Mount, published only yesterday, that found the amount of drugs at The Mount has increased significantly between 1 March 2016 and 28 February 2017, the period which the document focused on.\nIn particular, there was a big increase in Spice, which is a chemical concoction loosely based on cannabis and only recently made illegal outside prisons.\nThe report says that Spice has proved highly dangerous to the health of individuals, particularly the strain \"Death\" which was seemingly widely available and led to a number of hospital visits.\nIt added that for some time, The Mount ran a successful drug rehabilitation programme.\nHowever, this was discontinued in December 2016 following the massive influx of Spice onto Dixon Wing - put down to a lack of staff and to cell windows not being \"gridded\".\nWith no netting, drones arrived nightly.\nThis has been rectified and the windows are now \"gridded\".\nThe report added that in February, the RAPt programme restarted, with only five prisoners, on Lakes Wing, which is to be re-classified as “the Wellbeing Wing”.\nIt said the programme is in a state of transition, but the board had confidence that the RAPt team will restore the programme to the level of success previously achieved.\nPrison 'reasonably safe' according to report\nSarah Jenkins\nBBC Local Live\nIn the last report by HM Chief Inspector of Prisons, external, based on a visit over a week in April 2015, the prison was said to be \"reasonably safe\" and \"strikingly calm\".\nHowever, the report also said the prison had some \"safety weaknesses\" and had not fully embedded lessons from previous deaths in custody.\nPrisoners told inspectors drugs and alcohol were \"easily available\", despite efforts by prison staff to prevent this.\nAccommodation on Nash Wing, the wing prisoners are reported to have taken over today, was described as \"excellent\" with \"plentiful light and good facilities\".\nPrison had 'all ingredients' to suffer disorder\nSarah Jenkins\nBBC Local Live\nAccording to a report by the Independent Monitoring Board, external published only yesterday, The Mount prison had \"all the ingredients\" for disorder last summer.\nThere were \"staff shortages, readily available drugs and mounting violence\".\nThe report credits the new prison governor and his staff as the reason why it ended 2016 as a safe prison \"where prisoners have a good chance of rehabilitation.\"\nIn the year from 1 March 2016 - 28 February 2017, the board said violence towards staff and prisoner fights and assaults \"grew considerably\".\nDue to this, a revised \"safer custody\" strategy was introduced to prevent further violence.\nWhat happened yesterday?\nSarah Jenkins\nBBC Local Live\nAs we are hearing there appears to be more trouble at HMP The Mount prison in Bovingdon near Hemel Hempstead in Hertfordshire.\nYesterday, riot-trained staff were sent to the jail after violence broke out on two of prison's wings.\nThe \"tornado team\" arrived at the jail at about 18:30, equipped with shields and batons while fire, police and ambulance crews were on standby outside.\nThe Ministry of Justice said late last night the incident had been \"resolved\" and no staff or prisoners had been injured.\nIt revealed officers had dealt with an \"incident involving a number of prisoners\".\nOur Home Affairs Correspondent, Danny Shaw, says well-placed sources say there is yet another disturbance at the prison today.\nWe will bring you more information as soon as we have it.", "url": "https://www.bbc.com/news/live/uk-england-beds-bucks-herts-40788682"}