{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:36:04", "date_modify": "2025-04-26 06:36:04", "date_publish": "2025-02-27 06:05:23", "description": "The facility located in Rivergate Shopping Centre will be run by charity COMPAS.", "filename": "news_articles_cpdex74n1vzo_1745649364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/de2a/live/430f3ef0-f448-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpdex74n1vzo_1745649364.html", "title": "Charity marks milestone with new Peterborough Cultural Centre", "title_page": "Charity marks milestone with new Peterborough Cultural Centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The people behind a new cultural centre say they hope it will become a safe space for their city's diverse communities.\nPeterborough Cultural Centre opened in Rivergate Shopping Centre on Sunday and will be run by COMPAS, a charity that supports migrant communities.\nCharity co-founder Petr Torak said the centre was \"much-needed\" with Peterborough City Council planning to sell off or repurpose a number of its buildings.\nHe added that the venue would host exhibitions and activities for different community groups, and become a place where they could \"embrace each other\".\nMr Torak said the establishment of the new centre was a \"huge milestone\" for COMPAS after 15 years of supporting local communities.\nThe venue will also serve as the charity's new home. It was previously based at the council-owned Gladstone Park Community Centre on Bourges Boulevard.\nThe charity supports people with food vouchers, as well as consultation and advice on integrating in the local community, and previously also ran a breakfast club for school children in Millfield.\n\"A community centre like this is missing in Peterborough and I feel it is much-needed, especially now that so many council ones are closing down,\" Mr Torak said.\n\"I want this to be a safe space and want people to feel inclusive and positive here no matter what community they are from.\n\"It will help with beating isolating and promote integration.\"\nHe said his team was running an exhibition displaying arts from Lithuania and Romania, and hoped to have themed events to mark Ramadan and Chinese festivals.\nDozens attended the centre's opening, and Mr Torak said he was excited for its future.\n\"The opening day was very positive,\" he continued.\n\"The message is - this is open to everyone. It can be hired for events. But also it can be used by community groups and volunteers to carry out any signposting or consultation services.\n\"We are very excited for the new beginning.\"", "url": "https://www.bbc.co.uk/news/articles/cpdex74n1vzo"}