{"authors": ["Steven McKenzie", "www.facebook.com"], "date_download": "2025-04-26 08:13:05", "date_modify": "2025-04-26 08:13:05", "date_publish": "2025-02-26 11:30:08", "description": "The first order of its kind to be imposed by a Scottish court prevents Kevin Booth from leaving the UK for five years.", "filename": "news_articles_cy9dld3jgx8o_1745655185.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/29f7/live/06ea42e0-f433-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dld3jgx8o_1745655185.html", "title": "Travel ban for man who abused women in Highland dungeon", "title_page": "Travel ban for man who abused women in Highland dungeon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who abused vulnerable women in an underground chamber at his Highland home has been given the first worldwide travel ban to be imposed by a Scottish court.\nKevin Booth, who is in his 60s, carried out \"punishment beatings\" using whips, canes and riding crops at his Lochdhu Lodge in Altnabreac, a small community in Caithness.\nA court ruling said he had carried out \"a systematic course of conduct of acts of human trafficking and exploitation\" over many years.\nThe travel ban, which was approved after Police Scotland raised a civil action, prevents Booth from travelling outside the UK for the next five years.\nPolice raised the action at Wick Sheriff Court to secure the travel ban under human trafficking and exploitation legislation.\nBooth travelled regularly abroad and recruited economically vulnerable women in a number of countries, including South Africa, Dubai, Sri Lanka and Philippines, then paid for them to travel to the UK.\nHis assaults at Lochdhu Lodge were carried out in a chamber, accessed via a trapdoor and a 60m (197ft) concrete tunnel, which contained an empty coffin, life-size ancient Egyptian figures and a metal bench.\nSome women were restrained by handcuffs and video showed them in extreme distress and pain, the judgement said.\nBooth's violence also involved the use of belts and wooden brushes in what the sheriff described as punishment beatings.\nSheriff Neil Wilson said Booth had committed acts of human trafficking and exploitation over many years.\nHe described the evidence which had been presented in court as \"utterly harrowing\".\n\"The graphic video footage, combined with the context and background provided by supporting documentary evidence in various forms, was redolent of a level of cruelty and depravity which, whilst extreme, one can only hope is rare,\" he said.\nIn addition to the travel ban, he ordered that Booth must notify police in advance of hiring any woman as a housekeeper or to any other role at his home.\nBooth had been charged with assaulting children in his care at a school in 1991 and left the UK in an attempt to evade justice, but later returned.\nIn 1994 he was convicted after a trial at Newcastle Crown Court of five charges of assaulting children and a further charge of failing to surrender to bail.\nHe was sentenced to three months' imprisonment, suspended for two years.\nIn 2002, Booth was convicted following a trial at Bradford Crown Court of indecently assaulting his Brazilian au pair and was sentenced to two years in jail.\nPolice search Booth's home in the Highlands following allegations made about his conduct in March 2019.\nHe later appeared in court in private but a procurator fiscal discontinued the proceedings in March 2021.\nThen in July 2023 a former employee made a complaint to Police Scotland about Booth's conduct to her when she was employed by him at the lodge between June and December 2022.\nThe court judgement says Booth pressured her into providing him with \"sexual services\".\nIt also tells how Booth was investigated for raping a woman in Ireland and subsequently sought to apply financial pressure on the complainer to withdraw her allegation.\nDuring their investigations, police gathered evidence which was presented in the civil action.\nFollowing the release of the judgement, Det Sgt Chris Hughes, of Police Scotland, said: \"The safety of women and girls is an absolute priority for us and we sought the Trafficking and Exploitation Risk Order as an option open to us to prevent any further offending.\n\"Trafficking and exploitation is a blight on our communities and has no place in society and we will use all resources open to us to tackle it.\"\nThe Crown Office and Procurator Fiscal Service said it had a duty to keep cases under review.\nA spokesperson said: \"Crown counsel concluded in 2021 that there should be no further criminal proceedings at that time.\n\"The Crown reserved the right to proceed in the future.\"", "url": "https://www.bbc.co.uk/news/articles/cy9dld3jgx8o"}