{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:28:12", "date_modify": "2025-04-26 07:28:12", "date_publish": "2025-02-27 19:15:21", "description": "A coroner raises concerns after an inmate died when his wife and police could not contact the prison.", "filename": "news_articles_ce988dggl5go_1745652492.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/98da/live/e3f208a0-f530-11ef-a161-d137c0587442.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce988dggl5go_1745652492.html", "title": "Broken buzzer at jail stops Cambridgeshire wife's suicide warning", "title_page": "Broken buzzer at jail stops Cambridgeshire wife's suicide warning - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who drove 60 miles (96.5 km) to a prison could not alert staff about her husband's impending suicide because of its broken intercom and diverted phone line, a coroner ruled.\nIsaiah Adekunle Olugosi hanged himself in a cell in Wormwood Scrubs, London, between 27 and 28 March 2022.\nAfter Olugosi's wife spoke to him on the evening of 27 March, she repeatedly tried to call the prison and then drove through the night from Cambridge to the facility, a prevention of future deaths report said.\nAssistant coroner for west London, Richard Furniss said the intercom had been out of action \"for several years\" and ruled \"there is a risk that future deaths will occur unless action is taken\" by the prison governor.\nHe said Olugosi's wife, Cambridgeshire Police and the Met were all unable to contact the prison by telephone to warn them because \"calls were being diverted to an unmanned or obsolete number\".\nHe shared that Olugosi's wife drove for two hours and banged on the main gate for some time, calling out and pressing a buzzer which promised to connect her to an intercom through which she could speak to prison staff.\nMr Furniss said Olugosi's wife and police could not contact the prison all night and \"the deceased took his life\".\nA jury inquest on Friday concluded he died by suicide.\n\"The buzzer/intercom system must have been provided because it was thought important to provide that additional means of communication between the prison and the outside world,\" Mr Furniss added.\n\"In this case, a working system would have enabled the deceased's wife to warn the prison of his impending suicide.\n\"This could happen again in the future if there was another problem with the telephone system during the night shift.\n\"It is difficult to understand why the buzzer/intercom system has not worked for several years.\n\"There was evidence that it is irreparable. But the proposed solution appeared to be either to leave it as it is (still not working) or to remove it altogether.\"\nHe continued: \"The jury found that the failure to provide a working buzzer/intercom system was a failure. It is a matter of concern that the prison/the Ministry of Justice still considers that it is unnecessary.\"\nThe prison's governor has been asked to respond to Mr Furniss' report by 21 April with details of action taken or proposed action to be taken.\nA Ministry of Justice spokesperson said: \"We will carefully consider the coroner's findings and will respond to the report in due course.\"", "url": "https://www.bbc.co.uk/news/articles/ce988dggl5go"}