{"authors": ["Maia Davies", "www.facebook.com"], "date_download": "2025-04-26 06:44:49", "date_modify": "2025-04-26 06:44:49", "date_publish": "2025-03-01 16:42:00", "description": "About 30 people were also injured after two buses collided early on Saturday, police say.", "filename": "news_articles_c4g02qx349do_1745649889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9cb8/live/6e7ee500-f6b8-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g02qx349do_1745649889.html", "title": "Bus crash in Bolivia kills at least 37 people", "title_page": "Bus crash in Bolivia kills at least 37 people - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least 37 people have died and 30 left injured after two passenger buses collided in Bolivia, police said.\nThe crash happened early on Saturday about 5km (3 miles) from the south-western city of Uyuni.\nOne of the drivers was receiving intensive care while the other was in a stable condition, police commander Wilson Flores said.\nImages published in Bolivian media showed a badly damaged coach with its bodywork ripped off and luggage scattered on the roadside.\nThe buses collided on the route between Uyuni and Colchani in Bolivia's Potosí department after a \"lane invasion\", local media reported.\nOne bus was travelling to the western city of Oruro, where Oruro Carnival - one of Latin America's largest festivals - was taking place.\nThe vehicles were recovered by 10:00 local time (14:00 GMT) and those injured were taken to hospitals in both Oruro and Potosí.\nThose who died have not been identified and the condition of the injured is yet to be determined.\nAccording to local media, Cdr Flores said police were awaiting the results of alcohol tests taken by the drivers.\nDeadly traffic accidents are common in Bolivia. More than 30 people were killed in February when a bus plunged almost 800m (2625 ft) into a ravine between the cities of Potosí and Oruro.\nIn January, 19 people were killed when another bus came off a road in the same region, also near Potosí.\nAn average of 1,400 people die in road accidents every year in the country of about 12 million inhabitants, according to government data.", "url": "https://www.bbc.co.uk/news/articles/c4g02qx349do"}