{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:21:05", "date_modify": "2025-04-26 04:21:05", "date_publish": "2025-03-03 15:08:11", "description": "Andrew Thomas admitted hiding the device inside a vase of flowers to record the woman undressing.", "filename": "news_articles_c5y9qz2y301o_1745641265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dfe7/live/5de77c80-f83d-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y9qz2y301o_1745641265.html", "title": "Man hid phone in vase to secretly record woman", "title_page": "Man hid phone in vase to secretly record woman at Perthshire home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A groundskeeper snuck into a woman's home to plant a hidden camera which recorded her getting undressed.\nAndrew Thomas admitted recording more than 40 hours of footage over six months from an iPhone attached to the inside of a vase with Velcro at the 65-year-old's home in Perthshire.\nThomas, 49, was caught when the woman went to rearrange a bunch of artificial flowers at the foot of her bed.\nHe admitted one charge of voyeurism under the Sexual Offences Act 2009 between 29 January and 29 July 2023 at Perth Sheriff Court, but sentencing was deferred until a later date.\nThe court heard that in December 2022, Thomas, a former offshore worker, told the woman he had \"deeper romantic feelings towards her\" but she did not share them.\nMore than six months later, the woman was rearranging the flowers facing her bed when she discovered the white iPhone inside the vase, connected to a power bank.\n\"She became aware of an object within the vase, which had a camera lens pointing in the general direction of her bed,\" fiscal depute Rachel Hill said.\nThe phone was stuck on using Velcro and protruding from the vase by about an inch.\nThe woman found that a video recording with a time of 40 hours and 45 minutes was active.\nHer daughter later inspected the phone's photo gallery and found 34 files showing images and video of the woman in various states of undress.\nThe following day, Thomas entered the woman's home shortly after she left for church.\nHowever, the woman's daughter and her partner, who were passing the property, saw him inside.\nThey found that the back door had been unlocked with a spare key that had been stored in the porch and was standing open.", "url": "https://www.bbc.co.uk/news/articles/c5y9qz2y301o"}