{"authors": ["Mark Norman", "www.facebook.com"], "date_download": "2025-04-26 03:59:36", "date_modify": "2025-04-26 03:59:36", "date_publish": "2025-03-04 06:09:51", "description": "Three NHS staff who came to the UK from overseas have told the BBC why they decided to move here.", "filename": "news_articles_cj4nd8pgvxro_1745639976.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a0a/live/9563f180-ef72-11ef-a467-85bd361ad9bb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4nd8pgvxro_1745639976.html", "title": "The overseas staff serving the South East NHS", "title_page": "The overseas staff serving the South East NHS - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rishan Belete arrived in the UK from her native Sudan in the back of a lorry at the age of 17, as an unaccompanied minor.\nThat was in 2016. Last year, she qualified as a nurse.\nNow working in East Kent, she is one of more than 50,000 NHS staff, external in the wider South East who self-reported as not being British in 2023, many of whom may have come to the UK as migrants.\nMs Belete said \"learning the language and learning the culture was the hardest thing\" about integrating in the UK.\nAcross Kent Sussex and Surrey approximately 25% of NHS staff are from overseas, but the region still struggles with a vacancy rate of more than 8%.\nNHS trusts all recruit from overseas to try and fill the gaps they have in their workforce with many describing overseas staff as \"vital\" to be able to maintain services.\nHaving left Sudan almost a decade ago, Ms Belete travelled to the UK via Libya and then across the Mediterranean sea.\nShe said some people could not accept that she had arrived in the UK illegally.\nMs Belete said it was \"kind of alarming to people to think that I'm a criminal person\".\nSupported by the Kent Refugee Action Network, Ms Belete was fostered in Kent as an unaccompanied minor and said she watched Emmerdale and Eastenders on TV to help her learn English.\nIt was always her dream to work in the health service.\n\"Healthcare, that was really something I was really passionate about,\" she said.\nAfter qualifying as a nurse in 2009 Joanne Cabiguen left the Philippines to work for the NHS in 2022.\nMs Cabiguen now works as a theatre practitioner in Maidstone and Tunbridge Wells.\nShe said at home she was \"earning say £75 to £90 per month, which is not very much\" and that to come to the UK and work for the NHS was her \"dream\".\n\"A friend invited me to try the UK and I was like, why not? It's my dream and it's never too late for dreams right?\"\nDr Chirollos Romani qualified as a doctor in Italy.\nHe is now a cardiologist and Chief Registrar at Maidstone and Tunbridge Wells NHS Trust.\nDr Romani has been working in the NHS for seven years - but remembers how challenging his first few weeks were working in the health service.\n\"The way people communicate in a different country is completely different and you have to get used to it,\" he said.\nA patient asked him if she could spend a penny and he replied: \"On what?\"\nDr Romani said when there is a patient in front of you, you are \"trying to understand what is going on\".\n\"It's like: 'Oh my God, I don't have a grip on this',\" he said.", "url": "https://www.bbc.co.uk/news/articles/cj4nd8pgvxro"}