{"authors": ["Tim Parker", "www.facebook.com"], "date_download": "2025-04-26 08:08:07", "date_modify": "2025-04-26 08:08:07", "date_publish": "2025-02-26 13:52:55", "description": "Parents urge the council to rethink plans to cut funding for children aged over 16.", "filename": "news_articles_c9q47255p4jo_1745654887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1f0/live/5d5c7130-f374-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q47255p4jo_1745654887.html", "title": "Fight to save SEND school transport funding goes on", "title_page": "Leicester: Fight to save SEND school transport funding goes on - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Parents of young people with special educational needs and disabilities (SEND) in Leicester have again lobbied councillors in the city over funding for transport to schools and colleges.\nLeicester City Council's education scrutiny committee is considering ending the home-to-school transport funding for SEND youngsters, aged 16 or over.\nThe authority does not have any statutory duty to provide this transport and says it receives no funding from central government to do so.\nRajesh Ramachandran, from Rushey Mead, who has an autistic daughter with learning disabilities, is worried she will not be able to attend further education without continuing council support.\nMr Ramachandran's daughter currently attends a Leicester school but is due to start further education in Loughborough from September.\nHer father has a full-time job, which takes him round the country and his wife is not well enough to transport her and provide the full-time support she needs at home.\nThey told the BBC the twice-daily 22-mile trip would be too much for them to take on.\nMr Ramachandran says taxi firms have quoted a price of £100 per trip for her to travel while accompanied.\nHe said: \"With three days a week at college, I would be spending £1,200 a week. That's absolutely exorbitant.\"\nHe is now worried his daughter may miss out on further education altogether.", "url": "https://www.bbc.co.uk/news/articles/c9q47255p4jo"}