{"authors": ["Kevin Connolly", "www.facebook.com"], "date_download": "2025-05-19 14:23:13", "date_modify": "2025-05-19 14:23:13", "date_publish": "2015-03-13 11:40:02", "description": "The Israel-Palestinian peace process has been largely sidelined during Israel's election campaign, but the outcome could determine whether the issue moves back up the agenda, says the BBC's Kevin Connolly.", "filename": "news_world-middle-east-31870282_1747664593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81619000/jpg/_81619728_81619727.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31870282_1747664593.html", "title": "Israel election: Will outcome revive peace process?", "title_page": "Israel election: Will outcome revive peace process? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As electoral drama goes, Israeli election campaigns can be rather a slow burn.\nThey last for three months, which is long enough to sap the finances of the political parties and the energy of voters, battered by a never-ending string of cheap shots in cheap internet videos.\nCampaign 2015 is coming to the boil rather nicely now with the latest opinion polls suggesting that a centre-left alliance is running ahead of the hawkish Likud Party headed by Benjamin Netanyahu.\nThat does not necessarily mean he will be forced from office - he could still form a right-wing coalition. But election night on 17 March promises to be an exciting affair.\nOutsiders, though, might be surprised that the moribund state of the vexed peace process between Israel and the Palestinians has never felt like a major campaign issue.\nIt is there in the background all the time, of course, as the central historical and strategic issue that his faced this country since the Middle East war of 1967 when it captured Gaza from Egypt and the West Bank from Jordan.\nIt captured the Golan Heights from Syria too, but that raises a different set of strategic issues which are separate from this particular diplomatic equation.\nAt one point in the campaign there was a brief controversy about whether a speech Mr Netanyahu made six years ago, cautiously embracing the concept of the Two-State solution, was still valid.\nHis view appears to be that in an unstable Middle East where Iraq and Syria are disintegrating a newly-created Palestinian state could quickly become an ungoverned territory over-run by Islamist extremists.\nHis many detractors might see in that an excuse for avoiding a deal for which he did not have much enthusiasm in the first place, but part of Mr Netanyahu's pitch to the Israeli people is that he is cautious in such matters - a steady, statesmanlike hand on matters affecting Israel's security.\nSo while the peace process might be the prism through which outsiders tend to view Israeli politics, this campaign has centred much more on the economy - problems like the way in which the cost of housing outstrips the spending power of ordinary Israelis are front and centre.\nAnd what political scientists call the low-participation rate of the ultra-Orthodox communities in the economy and in the army is a major fault-line between secularists like the Yesh Atid movement and the religious parties like Shas.\nHe says this is an issue where it is up to the government to lead.\n\"The Israeli public cares about the cost of living and housing and the street doesn't feel the urgency of a deal with the Palestinians or a regional approach,\" he told me.\n\"It's a reality and you should look at it when running an election campaign.\"\nYou get a sense of the tensions that brought down the last coalition when you discuss the same issues with Naftali Bennett, leader of the nationalist right-wing party Habayit Hayehudi who also sat in the outgoing cabinet.\nHe has said that there should never be a Palestinian state in the West Bank because to create one would be to create an existential threat to the Jewish State.\n\"It would,\" he said, \"spell calamity for the future of Israel... handing land over to Palestinians doesn't bring peace, it brings catastrophe... This formula that the West is obsessed with, of land-for-peace simply doesn't work.\"\nBut the Arab population of Israel itself - descendants of those who remained after the fighting in Israel's War of Independence in 1948-49 - does have the right to vote.\nIt makes up about about 15% of the electorate and that proportion will rise as its young people reach voting age.\nThe three traditional Arab parties have combined into a unified list which is hoping to raise the turnout in that community.\nAnd if they succeed, one of their candidates Aida Touma Suleiman told me, they intend to put the peace process back on the national agenda - not least because they see a clear link between economic and security issues.\n\"This should be the centre of the campaign,\" Ms Suleiman said. \"There's no issue you can discuss without making a connection to the continuation of the occupation and war policy that different governments have led in the last few years.\n\"If you want to talk about housing you need solutions that come with resources and then you should ask where the resources are in this country.\"\nOver the course of the campaign, though, those kind of connections have not dominated the national debate here.\nHow quickly the issue re-asserts itself will depend on whether victory goes to the left or to the right.", "url": "https://www.bbc.com/news/world-middle-east-31870282"}