{"authors": ["Koh Ewe", "www.facebook.com"], "date_download": "2025-04-26 07:08:01", "date_modify": "2025-04-26 07:08:01", "date_publish": "2025-02-28 05:03:02", "description": "An Australian couple said it was \"traumatic\" to sit next to the body of the woman who died mid-flight.", "filename": "news_articles_c5y44z9z67po_1745651281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/83bb/live/fc817810-f58a-11ef-96e1-f3ffcde4e4bd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y44z9z67po_1745651281.html", "title": "Qatar Airways: Crew handled dead body on flight 'appropriately'", "title_page": "Qatar Airways: Crew handled dead body on flight 'appropriately' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Qatar Airways says an internal review has found that its crew \"acted quickly, appropriately and professionally\" when they placed the body of a woman who died mid-flight next to an Australian couple.\nThe airline issued the statement to the BBC on Friday, after the couple told Australia's Channel Nine that they were traumatised by the experience on the Melbourne to Doha flight.\nQatar Airways had apologised in a previous statement for \"any inconvenience or distress this incident may have caused\".\nThe incident sparked debate over procedures on dealing with deaths aboard planes.\nMitchell Ring and Jennifer Colin, who were travelling to Venice for a holiday, said the cabin crew had placed the dead woman, covered in blankets, next to Mr Ring for the last four hours of a 14-hour flight.\nThe cabin crew had trouble moving her body through the aisle to the business class section because \"she was quite a large lady\", Mr Ring said.\nThey then asked Mr Ring to move over and placed the lady in the seat he was in.\nWhile Ms Colin was invited by another passenger to sit beside her across the aisle, Mr Ring said the plane's staff did not offer to move him elsewhere even though there were vacant seats around.\nQatar Airways said on Friday that the crew's handling of the woman's death was \"in line with training and industry standard practice\".\n\"Passengers were accommodated to other seats, and a crew member was sitting at all times with the deceased passenger for the duration of the flight until landing in Doha,\" its statement said.\n\"It is an unfortunate reality that unexpected deaths do sometimes occur on board aircraft across the aviation industry and our crew are highly trained to deal with these situations with as much respect and dignity as possible.\"\nThe airline also said that they have offered support and compensation to the family of the deceased and other passengers who were \"directly affected\" by the incident.\n\"We totally understand that we can't hold the airline responsible for the poor lady's death, but surely after that there has to be a protocol to look after the customers on board,\" Ms Colin said in the televised interview with Channel 9.\nWhen the plane landed, Mr Ring said passengers were asked to stay put while medical staff and police came on board. Ambulance officers then started pulling blankets off the woman and he saw her face, he said.\n\"I can't believe they told us to stay,\" he said, adding that he thought they would have let the passengers leave before medical staff arrived.\nBarry Eustance, a former Virgin Atlantic captain, earlier told the BBC that in his experience \"the crew would normally try to isolate the body, so there is no passenger exposure to the body and vice versa, for respect and privacy but also for medical reasons\".\nAccording to the guidelines by the International Air Transport Association on dealing with deaths on board a flight, the deceased person should be moved to a seat, preferably one with few other passengers nearby, and covered with a blanket or body bag up to the neck. The body could also be moved to another area that does not obstruct an aisle or exit.\nUpon landing, the association recommends that other passengers disembark before the body is attended to by local authorities.\nAdditional reporting by Fan Wang.", "url": "https://www.bbc.co.uk/news/articles/c5y44z9z67po"}