{"authors": ["Kate Whannel", "Vicki Young", "www.facebook.com"], "date_download": "2025-04-26 04:35:38", "date_modify": "2025-04-26 04:35:38", "date_publish": "2025-02-28 12:19:59", "description": "Dodds delayed her resignation until after Keir Starmer's meeting with President Trump, saying he had needed a united cabinet.", "filename": "news_articles_cpv44982jlgo_1745642138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ef5/live/b40d9880-f5cf-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv44982jlgo_1745642138.html", "title": "Minister Anneliese Dodds quits over aid cuts", "title_page": "International Development Minister Anneliese Dodds quits over aid cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "International Development Minister Anneliese Dodds has resigned over the prime minister's cuts to the aid budget.\nIn a letter to Sir Keir Starmer,, external Dodds said the cuts to international aid, announced earlier this week to fund an increase in defence spending, would \"remove food and healthcare from desperate people - deeply harming the UK's reputation\".\nShe told the PM she had delayed her resignation until after his meeting with President Trump, saying it was \"imperative that you had a united cabinet behind you as you set off for Washington\".\nThe Oxford East MP, who attended cabinet despite not being a cabinet minister, said it was with \"sadness\" that she was resigning.\nShe said that while Sir Keir had been clear he was not \"ideologically opposed\" to international development, the cuts were \"being portrayed as following in President Trump's slipstream of cuts to USAID\".\nAhead of his trip to meet the US president, Sir Keir announced aid funding would be reduced from 0.5% of gross national income to 0.3% in 2027 in order to fund an increase in defence spending.\nIn his reply to Dodds's resignation letter, the prime minister thanked the departing minister for her \"hard work, deep commitment and friendship\".\nHe said cutting aid was a \"difficult and painful decision and not one I take lightly\" adding: \"We will do everything we can...to rebuild a capability on development.\"\nBaroness Chapman of Darlington, formerly a Labour MP, has been appointed to replace Dodds as international development minister.\nIn her resignation letter, Dodds said she welcomed an increase to defence spending at a time when the post-war global order had \"come crashing down\".\nShe added that she understood some of the increase might have to be paid for by cuts to ODA [overseas development assistance].\nHowever, she expressed disappointment that instead of discussing \"our fiscal rules and approach to taxation\", the prime minister had opted to allow the ODA to \"absorb the entire burden\".\nShe said the cuts would \"likely lead to a UK pull-out from numerous African, Caribbean and Western Balkan nations - at a time when Russia has been aggressively increasing its global presence\".\n\"It will likely lead to withdrawal from regional banks and a reduced commitment to the World Bank; the UK being shut out of numerous multilateral bodies; and a reduced voice for the UK in the G7, G20 and in climate negotiations.\"\nThe spending cuts mean £6bn less will be spent on foreign aid each year. The aid budget is already used to pay for hotels for asylum seekers in the UK, meaning the actual amount spend on aid overseas will be around 0.15% of gross national income.\nThe prime minister's decision to increase defence spending came ahead of his meeting in Washington - the US president has been critical of European countries for not spending enough on defence and instead relying on American military support.\nHe welcomed the UK's commitment to spend more, but Sir Keir has been attacked by international development charities and some of his own MPs for the move.\nDodds held off her announcement until the prime minister's return from Washington, in order not to overshadow the crucial visit, and it was clear she did not want to make things difficult for the prime minister.\nBut other MPs have been uneasy about the decision, including Labour MP Sarah Champion, who chairs the international development committee, who said that cutting the aid budget to fund defence spending is a false economy that would \"only make the world less safe\".\nLabour MP Diane Abbott, who had been critical of the cuts earlier in the week, said it was \"shameful\" that other ministers had not resigned along with Dodds.\nDodds's resignation also highlights that decisions the prime minister feels he has to take will be at odds with some of the views of Labour MPs, and those will add to tensions between the leadership and backbenchers.\nIn a post on X,, external Conservative leader Kemi Badenoch said: \"I disagree with the PM on many things but on reducing the foreign aid budget to fund UK defence? He's absolutely right.\n\"He may not be able to convince the ministers in his own cabinet, but on this subject, I will back him.\"\nHowever one of her backbenchers - and a former international development minister - Andrew Mitchell backed Dodds, accusing Labour of trying \"disgraceful and cynical actions\". \"Shame on them and kudos to a politician of decency and principle,\" he added.\nLiberal Democrat leader Sir Ed Davey said Dodds had done \"the right thing\" and urged the government to find alternative ways to pay for increases to defence spending.\nHe suggested raising money through increases to the digital services tax or setting up a European rearmament bank, which would lend money to governments to buy military equipment or the private sector to expand their manufacturing capacity.\nSir Ed argued that if the UK cut back on overseas aid, China and Russia would \"fill the vacuum\".\nDeputy Prime Minister Angela Rayner said she was \"sorry to hear\" of Dodds's resignation.\n\"It is a really difficult decision that was made but it was absolutely right the PM and cabinet endorse the PM's actions to spend more money on defence,\" she said.\nDodds first became a Labour MP in 2017 when she was elected to represent the Oxford East constituency.\nUnder Jeremy Corbyn's leadership of the Labour Party she served as a shadow Treasury minister and was promoted to shadow chancellor when Sir Keir took over.\nFollowing Labour's poor performance in the 2021 local elections, she was demoted to the women and equalities brief.\nSince July 2024, she has served as international development minister.\nDodds becomes the fourth minister to leave Starmer's government, following Louise Haigh, Tulip Siddiq and Andrew Gwynne.", "url": "https://www.bbc.co.uk/news/articles/cpv44982jlgo"}