{"authors": ["David Gritten", "www.facebook.com"], "date_download": "2025-04-26 07:51:40", "date_modify": "2025-04-26 07:51:40", "date_publish": "2025-02-25 15:00:58", "description": "Hundreds are attending the event, which the interim president promised after ousting Bashar al-Assad.", "filename": "news_articles_cpv4m4npnedo_1745653900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6515/live/0c1edc80-f37f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4m4npnedo_1745653900.html", "title": "Syria dialogue conference a 'historic opportunity', Sharaa says", "title_page": "Syria dialogue conference a 'historic opportunity', Sharaa says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Syria's interim president has told a national dialogue conference that the country has a \"historic\" opportunity to rebuild after the overthrow of Bashar al-Assad.\nAhmed al-Sharaa also stressed the need for armed groups to integrate into the military and for the state to have a monopoly on weapons, saying Syria's \"strength lies in its unity\".\nThe 600 delegates have been asked to provide recommendations on transitional justice, the economy, the new constitution and other topics to guide a new transitional government.\nBut there has been criticism that the process has been rushed, and the Kurdish-led militia alliance and autonomous administration which control north-eastern Syria were not invited.\nThe Assad family ruled Syria for more than 50 years with an iron fist, with Bashar becoming president in 2000 after the death of his father Hafez.\nIn 2011, Bashar brutally crushed a peaceful pro-democracy uprising, sparking a devastating civil war in which more than 600,000 people were killed and 12 million others forced to flee their homes.\nOn 8 December, he fled to Russia after a rebel alliance led by Sharaa's Islamist group Hayat Tahrir al-Sham (HTS) swept down from north-western Syria and entered Damascus in the space of only 12 days.\nSeven weeks later, Sharaa was named president for the \"transitional period\" by his fellow rebel commanders. They also announced the cancellation of the 2012 constitution, the dissolution of the parliament, army and security agencies, and the integration of all rebel groups into the new state institutions replacing them.\nSharaa promised to hold a national dialogue conference to discuss Syria's future, which he said would be followed by a \"constitutional declaration\" to serve during the transition.\n\"Syria liberated itself on its own, and it suits it to build itself on its own,\" Sharaa said in a speech at the national dialogue conference in Damascus on Tuesday.\n\"What we are living today is an exceptional, historic and rare opportunity. We must take advantage of every moment of it to serve the interests of our people and our country.\"\nThe organising committee said six working groups would be formed to discuss a transitional justice system, the new constitution, reforming and building state institutions, personal freedoms, the role of civil society, and the country's future economic model.\nThe groups would agree non-binding recommendations, which would be presented to the new transitional government set to take power on Saturday and help shape the constitutional declaration, according to the committee.\nSharaa said a transitional justice body would soon be formed to \"restore people's rights\" and start holding to account those who committed crimes against Syrians during the civil war.\nHe also reiterated that non-state armed groups had to disarm and hand over their territory.\n\"The unity of arms and their monopoly by the state is not a luxury but a duty and an obligation,\" he said. \"Syria is indivisible; it is a complete whole, and its strength lies in its unity.\"\nThe interim government's forces control Syria's biggest cities, but large parts of the country are still held by various armed groups.\nThey include the Kurdish-led Syrian Democratic Forces (SDF), a militia alliance supported by the US, which controls most of the north-east and serves as the armed forces of the Autonomous Administration of North and East Syria (AANES).\nThe SDF has so far refused to integrate its forces into the new Syrian army, although negotiations have been taking place in recent weeks.\nOrganisers of the conference said the SDF and AANES had not been invited because of that refusal, and that Kurds would be represented in Damascus even if they were not.\nHowever, SDF spokesman Farhad Shami told AFP news agency that \"the exclusion of the SDF and large sections of Syrian society confirm that the conference serves to please the outside world and not to seek a better future\".\nThirty-five parties in the AANES also criticised what they claimed was the \"token representation\" of Kurds and other minorities, saying such events were \"meaningless, worthless, and will not contribute to finding real solutions to the country's ongoing crisis\".\nMoutasem Sioufi of The Day After, an independent civil society group that is participating in the conference, told the BBC that it was important that all groups were involved.\n\"We need to have dialogue with all the Syrian groups, with all Syrian powers, especially those who have great influence on the ground. Without that Syria would face a very hard time maintaining itself together,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cpv4m4npnedo"}