{"authors": ["Bernd Debusmann Jr", "www.facebook.com"], "date_download": "2025-04-26 08:01:26", "date_modify": "2025-04-26 08:01:26", "date_publish": "2025-02-26 17:32:42", "description": "The Trump administration believes the announcement will encourage mass 'self deportations'.", "filename": "news_articles_cn4ymkl7294o_1745654486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5cc3/live/735674c0-f4f7-11ef-a2a8-e1b826ae43ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4ymkl7294o_1745654486.html", "title": "Trump administration to require undocumented migrants to register", "title_page": "Trump administration to require undocumented migrants to register - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump's administration has said it will create a national register for undocumented migrants, with those failing to sign up possibly facing criminal prosecution.\nThe Department of Homeland Security (DHS) announced on Tuesday that any undocumented migrants above the age of 14 must provide the US government an address and their fingerprints.\nThis is the latest move in the White House's effort to dramatically overhaul the US immigration system, which has included promises of mass arrests and deportations that have largely failed to materialise.\nExperts say that the registration system will face hurdles, as it is difficult to enforce and fraught with logistical challenges.\nDHS justified the move by citing a section of the complex Immigration and Nationality Act.\nThe law has rarely been enforced, although in 1940 - with anxiety heightened due to World War Two - the US moved to require undocumented immigrants to register with the government at local post offices.\nDHS in a statement on Tuesday night that the change could compel mass \"self-deportation\", which it described as a \"safer\" path for migrants and law enforcement. It argued that it was also a way for immigration authorities to conserve resources.\n\"President Trump and [Homeland Security] Secretary [Kristi] Noem have a clear message for those in the country illegally: leave now,\" DHS spokeswoman Tricia McLaughlin said in a statement.\n\"If you leave now, you may have the opportunity to return and enjoy our freedom and live the American dream,\" she added. \"We must know who is in our country for the safety and security of our homeland and all Americans.\"\nIn a separate memo, US Citizenship and Immigration Services (USCIS) said that lawful residents are exempt, along with those who have entered the US on visas or who are already in immigration proceedings.\nThere are approximately 13 million undocumented migrants in the US. It is unclear how many will register or be impacted by the registration directive.\nThe National Immigration Law Center, an advocacy organisation, said it believed the registration would \"identify and target people for detention and deportation\". It noted that the US had only used a registry to identify \"potential nationals security threats broadly characterised as communist or subversive\" ahead of World War Two.\nNayna Gupta, policy director at the American Immigration Council, told the BBC that she believes the directive will be \"ineffective\".\n\"Without any assurances, it's hard to imagine undocumented migrants following this new process,\" she said. \"Essentially, what they are saying to folks is to put them on notice, when they've made clear that their goal is mass deportation.\"\nThe vast majority of undocumented migrants in the US have been here for 15 years or more, she added, making them even less likely to comply.\n\"It creates yet another tool for the Trump administration to advance the mass deportation agenda,\" Ms Gupta added.\nWhile mass deportations formed a key part of Trump's campaign message - and were the focus of a slew of immigration and border-related executive orders signed in his first week in office - the president and other officials have reportedly been dissatisfied by the pace of removals.\nData obtained by Reuters shows that nearly 38,000 people were deported during Trump's first month in office, compared to a monthly average of about 57,000 during Joe Biden's last full year in office.\nThe White House has celebrated a 36% decline in the number of border crossings in January 2025 when compared to December 2024.\nThat month, the Biden administration managed the border for roughly the first three weeks before the Trump administration took over. Antcipated restrictive asylum and immigration policies under Trump are believed to have contirbuted to the decline.", "url": "https://www.bbc.co.uk/news/articles/cn4ymkl7294o"}