{"authors": ["Kaleigh Watterson", "www.facebook.com"], "date_download": "2025-04-26 03:40:44", "date_modify": "2025-04-26 03:40:44", "date_publish": "2025-03-05 09:41:59", "description": "The firms want it to run to Crewe instead of the current plan to stop north of Birmingham.", "filename": "news_articles_czrnyv876nvo_1745638844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/76d6/live/8940b020-f907-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czrnyv876nvo_1745638844.html", "title": "Call to extend HS2 from London to Crewe by rail businesses", "title_page": "Call to extend HS2 from London to Crewe by rail businesses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The government is being urged to pay for the HS2 line to run all the way to Crewe in Cheshire by rail industry businesses as they say a shorter route would risk \"squandering\" its benefits.\nThe High Speed Rail Group (HSRG) has put several requests to the Treasury's spending review and said the rail route needed to be \"reset to an irreducible Euston-Crewe core\".\nThe high speed line north of Birmingham to Manchester was scrapped by the previous government.\nA spokesperson for the government said they were committed to \"improving rail connectivity\" across the Midlands and northern England.\nThe HSRG is made up of businesses involved in the industry including Arup, Hitachi and Alstom.\nIn its submission to the Treasury, external, the group makes six \"key asks\" of the government.\nThese include to change HS2 to a \"Euston-Crewe core\" and fund the connection from the West Midlands to Crewe rather than the current plan to stop in Handsacre near Lichfield, Staffordshire, north of Birmingham.\nThey also called for a more cost-effective approach to the London Euston plan by building to a \"plain vanilla design\".\nThe group added that the government needed to extend the safeguarding restrictions on the land between Birmingham and Crewe.\nThese were planning tools used to protect land from conflicting development but were lifted in January 2024.\nThe group also suggested HS2 should be connected to the West Coast Mainline 10 miles (16km) south of Crewe, rather than on the approach to the town's station.\nThey said this \"yields the potential for a further substantial cost-saving\" - although no estimate is currently available.\nIn the submission, the HSRG further added: \"There is currently a risk of overreaction and cutting HS2 short and, as a result, diminishing both the national economic growth stimulus HS2 provides, and short-changing the national account\".\nJim Steer, one of the directors of the group, told BBC Radio Stoke they felt HS2 had been cut back \"in a way that we think makes it very hard to deliver real economic value\".\nHe added the line going to Crewe was significant because HS2 was always planned to join the existing railway and it was needed to bypass a \"bottleneck\" in Staffordshire.\nOtherwise he claimed the scheme would not lead to more capacity on railway lines.", "url": "https://www.bbc.co.uk/news/articles/czrnyv876nvo"}