{"authors": ["Rebecca Brahde", "www.facebook.com"], "date_download": "2025-04-26 08:11:31", "date_modify": "2025-04-26 08:11:31", "date_publish": "2025-02-26 12:01:10", "description": "The chief minister says a formal application to overturn the misadventure verdict has not been made.", "filename": "news_articles_cgkmj04ydd5o_1745655091.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2abc/live/67d7bdc0-f439-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmj04ydd5o_1745655091.html", "title": "Formal bid for fresh Summerland fire inquest not yet received", "title_page": "Formal bid for fresh Summerland fire inquest not yet received - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A formal application for a fresh inquest into the 50 people killed in the Summerland fire disaster in 1973 has not been made, the chief minister has confirmed.\nThe Justice for Summerland Group, made up of survivors and relatives of victims, said last May that it would make a formal bid to overturn the original misadventure verdicts.\nAlfred Cannan said the Attorney General had not received a formal application.\nBut campaign group, which appointed Belfast-based human rights law firm Phoenix Law to act for the families last year, said taking legal action over the issues was still its intention.\nCannan told the House of Keys the Attorney General (AG) had received a letter on 20 May from the firm that said it intended to make an application for a fresh inquest in the coming weeks.\nHowever the AG had confirmed he had not received an application, but would \"give his full consideration to such a request at the time should one be received\", Cannan said.\nJoney Faragher MHK questioned whether Cannan acknowledged that a fresh inquest could provide \"long overdue justice and closure for the families affected\".\nHe said government had paid \"full respects\" to those who lost their lives along with those who dealt with the tragedy and had apologised.\nBut he said it was \"not for me to make judgement on what happened at Summerland\" and it would be for the AG to consider whether an inquest was reopened.\nAbout 3,000 people were at the Summerland entertainment complex on the evening 2 August 1973, which at the time was one of the biggest indoor leisure complexes in Europe, when a blaze thought to have been started by three boys from Liverpool smoking broke out.\nA public inquiry held in the aftermath of the tragedy found there were \"no villains\", only human beings who made mistakes.", "url": "https://www.bbc.co.uk/news/articles/cgkmj04ydd5o"}