{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 03:51:01", "date_modify": "2025-04-26 03:51:01", "date_publish": "2025-03-05 12:14:09", "description": "A Banbury business leader says the town doesn't have the man power to implement new legislation.", "filename": "news_articles_ceqj773gr08o_1745639461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd9a/live/38c50440-f9b4-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ceqj773gr08o_1745639461.html", "title": "Banbury business leaders question anti-social behaviour bill", "title_page": "Banbury business leaders question anti-social behaviour bill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to tackle anti-social behaviour have been backed by an MP despite business leaders doubting the schemes' effectiveness.\nThe government introduced a raft of measures including action against shoplifting, as part of its flagship Crime and Policing Bill last week.\nBanbury's Labour MP Sean Woodcock, said his Oxfordshire constituents \"wholeheartedly\" welcomed the new legislation.\nBut the chair of Banbury's Chamber of Commerce said the new bill was \"almost like dressing up for an occasion and then not being able to go\".\nDerek Hattenbach said shoplifting and anti-social behaviour were \"very great problems\", and were \"putting people out of business\" in the market town.\n\"Action is needed, but unfortunately just putting in place legislation to show the public you mean to do well is a very different thing from actually having police officers on the ground to act,\" he said.\nMr Hattenbach said Banbury didn't have the \"man power\" in terms of policing to \"deal with the street crime as it is\".\n\"If you haven't got them [police officers] there in the first place, then purely and simply it's just a soundbite for the population unfortunately,\" he added.", "url": "https://www.bbc.co.uk/news/articles/ceqj773gr08o"}