{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:26:24", "date_modify": "2025-05-19 15:26:24", "date_publish": "2017-07-10 00:00:00", "description": "Investigation after three die in A38 collision; people in Great Torrington claim they struggle for cash after last bank closes; child almost falls through moving train floor; and more", "filename": "news_live_uk-england-devon-40499682_1747668384.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-devon-40499682_1747668384.html", "title": "BBC Local Live: Devon & Cornwall on Monday 10 July 2017", "title_page": "BBC Local Live: Devon & Cornwall on Monday 10 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nSophie Malcolm\nBBC News Online\nLive updates for Devon and Cornwall have finished for the day, but we'll be back at 08:00 on Tuesday with the latest news, sport, travel and weather.\nDon't forget Spotlight on BBC One later.\nThere will also be news through the night on your BBC Local Radio station.\nLatest weather: Sunshine in the evening before rain\nBBC Weather\nEvening sunshine is likely for many. However, occasional rain will cross Land's End by midnight and spread across the region during the early hours. Minimum temperature: 13C (55F).\nThere will be patchy rain on Tuesday morning. It will intensify during the afternoon, becoming heavy for a time. Maximum temperature: 18C (64F).\nAnne Marie Morris racist expression: Members of political parties condemn MP\nAndrew Segal\nLocal Live\nMembers of political parties across the spectrum have condemned a Devon MP who used a racist expression during a public discussion about Brexit.\nAnne Marie Morris, MP for Newton Abbot, used the phrase at an event in London to describe the prospect of the UK leaving the EU without a deal.\nLabour's national campaign co-ordinator Andrew Gwynne said: \"Anne Marie Morris' comments are outrageous and totally unacceptable\"\nOutgoing Liberal Democrat leader Tim Farron said he was \"utterly shocked\", adding: \"Even if she misspoke, this is the nastiest thing I've heard an MP utter since Lord Dixon Smith uttered the same awful phrase a few years ago\"\nFellow Conservative and South Cambridgeshire MP Heidi Allen tweeted, external that an \"apology is not good enough\". She said: \"We must show zero tolerance for racism. MPs must lead by example\"\nGreen Party co-leader Caroline Lucas tweeted, external: \"Appalling. Should have the whip removed immediately. No place in our politics for racism, full stop\"\nMs Morris, who was first elected to Parliament in 2010, told the BBC the comment was \"totally\" unintentional, adding: \"I apologise unreservedly for any offence caused.\"\nCalls for MP to have Tory whip withdrawn after racist expression\nBBC Politics\nThe Liberal Democrats have called on Prime Minister Theresa May to withdraw the party whip from a Devon Conservative MP criticised after it emerged she used a racist expression during a public discussion about Brexit.\nAnne Marie Morris, MP for Newton Abbot, used the phrase at an event in London to describe the prospect of the UK leaving the EU without a deal.\nLeader Tim Farron said he was \"shocked\" and called for her to be suspended from the parliamentary party.\n\"This disgusting comment ... has no place in our Parliament,\" he said.\nMs Morris, who was first elected to Parliament in 2010, told the BBC the comment was \"totally\" unintentional, adding: \"I apologise unreservedly for any offence caused.\"\nA Conservative Party spokesman said: \"We are aware of these reports. This kind of language is completely unacceptable and we are urgently investigating.\"\nBBC Political Editor Laura Kuenssberg tweeted, external that the pressure was \"already for May to withdraw the whip from Morris\", which would mean \"another one off the majority if she does\".\nMP Anne Marie Morris apologises for racist remark\nBBC Politics\nA Devon Conservative MP has been criticised after it emerged she used a racist expression during a public discussion about Brexit.\nAnne Marie Morris, MP for Newton Abbot, used the phrase at an event in London to describe the prospect of the UK leaving the EU without a deal.\nAccording to a recording published on the Huffington Post, external website, Ms Morris was discussing the impact of Brexit on the UK's financial services industry at an event organised by the Politeia think tank.\nThe Lib Dems have urged Theresa May to discipline her for the \"nasty\" remark.\nMs Morris told the BBC: \"The comment was totally unintentional. I apologise unreservedly for any offence caused.\"\nChild avoids falling through train floor: What happened?\nAndrew Segal\nLocal Live\nA small boy almost fell from a moving train carriage on to the track below because the toilet floor was missing.\nHis mother was able to catch him before he fell when she took him to the toilet on the South Devon Railway Totnes Riverside to Buckfastleigh train in Devon last month.\nThe Rail Accident Investigation Branch said its investigation found, external that the former ex-British Railways Mark 1 Open Second carriage \"had been put back into service after repairs to its braking system, which had required the dismantling of the lavatory floor\".\nIt said: \"The floor had not been replaced and staff had placed a notice on the compartment door and attempted to secure it to prevent it being opened. This had not been effective.\"\nSouth Devon Railway, which runs the steam train attraction, said it is taking the investigation \"extremely seriously\".\nExmouth man arrested after one killed and seven injured in M42 crash\nBBC News England\nOne person was killed when four cars and a lorry crashed on the M42 near Redditch and Bromsgrove.\nThree of the cars went up in flames after the smash on the southbound junction of the motorway last night.\nOne woman was pulled from a flaming car by an off-duty paramedic who ran to her aid.\nA 52-year-old man from Exmouth, Devon, has been arrested on suspicion of death by dangerous driving, police say. He remains in police custody.\nRow over Porthleven double yellow lines\nLaurence Reed\nBBC Radio Cornwall\nA row has broken out over 200ft of new double yellow lines in Porthleven.\nThey've been painted along Commercial Road, which is owned by Harbour and Dock Company.\nPhil Ward, from the company, said it was part of a project to calm the traffic.\nHowever, Cornwall Council said the lines were not legal, had no legal standing, and no enforcement could be carried out by anyone.\nNative seahorse makes a rare return\nBBC Spotlight\nDivers in the South West have had a rare sighting of one of our native seahorses.\nThe creature is under threat, along with its natural habitat - seagrass - which provides a nursery for all kinds of marine life and helps reduce coastal erosion.\nExperts at the National Marine Aquarium in Plymouth said they were now looking at how best to help our seahorses by learning how to cultivate seagrass, because it was in worldwide decline.", "url": "https://www.bbc.com/news/live/uk-england-devon-40499682"}