{"authors": ["Chris Caulfield", "www.facebook.com"], "date_download": "2025-04-26 07:41:32", "date_modify": "2025-04-26 07:41:32", "date_publish": "2025-02-26 21:34:10", "description": "Surrey Fire and Rescue Service says the issue was temporary and its coverage was not affected.", "filename": "news_articles_c5yr7yd1g70o_1745653292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e847/live/4d56e4b0-f486-11ef-a3a5-1367a02ff0af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yr7yd1g70o_1745653292.html", "title": "Surrey fire station out of action twice over staff issues", "title_page": "Surrey fire station out of action twice over staff issues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Surrey fire station was out of action on two separate occasions in December and January due to staff shortages.\nCamberley Fire Station was twice left without an operational crew during change-over periods due to a lack of cover.\nThe Local Democracy Reporting Service said the admission came during questions from the public at a recent meeting of Surrey Heath Borough Council.\nSurrey Fire and Rescue Service said the issue was temporary and the service's \"response offer to communities\" was not affected.\nRaising the issue was Derren Martin, who said: \"Camberley Fire Station has been closed due to staff shortages, largely because the station is now operating with just one fire engine crewed by four firefighters - a reduction of 30 firefighters since the station opened in 1967.\"\nMr Martin said the rising population, and fire cover \"now at its lowest ever\", could cost lives.\nA spokesperson for Surrey Fire and Rescue Service said: \"I would like to reassure the questioner and the public that there was fire and rescue cover in place for the whole of Surrey during periods when Camberley Fire Station was not crewed.\n\"Whilst the crew who begin and end their shifts at Camberley Fire Station were temporarily not on duty on two occasions between December 2024 and January 2025… this did not affect the services' response offer to communities.\"\nSurrey Fire and Rescue service is managed by Surrey County Council meaning it has overall responsibility.\nDuring the closures, the on-call Chobham Fire Station remained available for deployment.\nOn both occasions, there were no critical incidents within the Camberley area.", "url": "https://www.bbc.co.uk/news/articles/c5yr7yd1g70o"}