{"authors": ["Sharon Edwards", "www.facebook.com"], "date_download": "2025-04-26 07:29:37", "date_modify": "2025-04-26 07:29:37", "date_publish": "2025-02-27 18:14:25", "description": "A Ukrainian leader has signed an agreement to work with Lincolnshire's farming and food businesses.", "filename": "news_articles_c1mnnp4rmjko_1745652577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d2a6/live/9f21b970-f524-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mnnp4rmjko_1745652577.html", "title": "Ukraine leader welcomed in Lincoln, as farming agreement signed", "title_page": "Ukraine leader welcomed in Lincoln, as farming agreement signed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A leader from one of Ukraine's most war-torn regions has visited Lincolnshire and signed an agreement to work with the county's agricultural businesses.\nOleksandr Prokudin, governor of Ukraine's Kherson Oblast province, was welcomed in Lincoln on Thursday.\nHe said the agreement - a Memorandum of Understanding on future collaboration - was \"about moral support to the region\".\nCouncillor Colin Davie, from Lincolnshire County Council, said it was \"the first step\" in establishing a new relationship to help rebuild the country.\nKherson, a province in southern Ukraine, has seen intense fighting since the Russian invasion.\nThe city of Kherson was seized by Russian troops and then retaken in the same year.\nSpeaking through an interpreter, Prokudin said \"our region is now more than 70 percent occupied\" and that \"Russians are hunting people with drones\".\nHe signed the agreement with Davie at the county council headquarters in Lincoln and also visited the University of Lincoln's Riseholme campus, which is home to the Lincoln Institute for Agri-Food Technology (LIAT), as well as the Siemens factory.", "url": "https://www.bbc.co.uk/news/articles/c1mnnp4rmjko"}