{"authors": ["Holly Phillips", "www.facebook.com"], "date_download": "2025-04-26 07:38:59", "date_modify": "2025-04-26 07:38:59", "date_publish": "2025-02-27 13:36:36", "description": "The replica is being exhbitied at St Wulfram's in Grantham until 3 March.", "filename": "news_articles_cvg111z4kxmo_1745653139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e333/live/bb8f4350-f503-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg111z4kxmo_1745653139.html", "title": "Shroud of Turin replica goes on display", "title_page": "Shroud of Turin replica goes on display in Grantham - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A replica of the Shroud of Turin is being shown in Lincolnshire.\nThe 4.4m-long (14ft) replica, made using laser technology, is on display at St Wulfram's in Grantham until 3 March.\nIt is a replica of the original linen cloth, which is said to be the burial cloth that was wrapped around Jesus' body after the Crucifixion.\nThe copy was displayed for the first time in England at Crowland Abbey last year.\nBrother John is a part of Templars Today - a community interest company aiming to end hate and preserve Christianity.\nThe group said everyone was welcome to attend the exhibition, including those who are non-religious.\n\"You can dispel the religious part of it because it's actually a factual item and proven by science,\" Brother John said.\n\"Everyone comes in with a preconceived conception of what we're doing, why we're doing it and they have personal opinions of the authenticity of the shroud.\n\"We hold the scientific facts that have been used to disprove it over the past few years.\"\nThe Catholic Church takes no official position on the authenticity of the shroud, which is kept at Turin Cathedral.\nEver since radiocarbon dating in 1989 proclaimed the cloth to be 700 years old, the Church has stirred away from saying it was anything but an \"icon\" of Christian devotion.", "url": "https://www.bbc.co.uk/news/articles/cvg111z4kxmo"}