{"authors": ["Tim Parker", "www.facebook.com"], "date_download": "2025-04-26 07:04:17", "date_modify": "2025-04-26 07:04:17", "date_publish": "2025-02-28 07:21:36", "description": "Campaigners say the budget just approved offers no assurances about the future of their library.", "filename": "news_articles_crknnlmp1n8o_1745651057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c05f/live/80674240-f559-11ef-b7da-bf3b74fc6fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crknnlmp1n8o_1745651057.html", "title": "Campaigners pledge to keep their library open", "title_page": "Ryhall: Campaigners pledge to keep their library open - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Campaigners trying to protect their village library in Rutland have said the county council's budget - just approved - offers them no assurance about its future.\nThe annual budget, which included a council tax rise of 4.99%, was agreed by a majority of Rutland county councillors at a meeting on Thursday night.\nBut the future of Ryhall library remains unclear.\nThe authority says a consultation on its use is yet to conclude and plans will be drawn up after that point.\nRutland County Council has planned a programme, using £950,000 of national grant cash to develop libraries into new \"living well centres\".\nIt is intended that these centres combine community services and make wider information and support for the public much easier to find.\nBut details referring to the programme for Ryhall were left marked TBC - to be confirmed - in the approved budget papers.\nThe council had found that works needed to bring Ryhall library up to standard would exceed the available budget.\nThe council then opened a public consultation on how best to deliver local library services in the village.\nAn action group was set up in January as residents found a county council cabinet paper was recommending the closure of Ryhall library.\nAndrew Nebel, a Ryhall parish councillor, disputed the county council's claim that to update and improve the library and incorporate a living well centre would cost in the region of £250,000.\nHe said the service \"has enough reserves to cover any extra costs\" and basic maintenance of the building, independently assessed, would cost only £10,000 this year and a further £15,000 over the next three years.\nRutland county councillor Christine Wise, who leads on libraries, said there were \"a number of things undecided\" about the library budgets and a consultation on the future of Ryhall library remained open until the end of February.\nA cabinet meeting in April will consider the responses and next steps.\nCampaigners told the BBC they want to ensure there is a full council vote on whether to close the library.\nNebel said without that, \"it would be a political decision by the cabinet, which we think is undemocratic\".", "url": "https://www.bbc.co.uk/news/articles/crknnlmp1n8o"}