{"authors": ["Rob Mayor", "www.facebook.com"], "date_download": "2025-04-26 06:38:21", "date_modify": "2025-04-26 06:38:21", "date_publish": "2025-02-26 06:19:08", "description": "One resident in Washwood Heath, Birmingham, says he has trapped 17 rats in two months.", "filename": "news_articles_c8710jy4538o_1745649501.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a2c7/live/43bace00-f394-11ef-b06c-594e3d22afd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8710jy4538o_1745649501.html", "title": "'Cat-sized rats are attacking our cars'", "title_page": "Birmingham bin strike: 'Cat-sized rats are attacking our cars' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Refuse workers are set to begin an indefinite walk out as residents fear bin strikes are exacerbating a city's rat problem.\nThe Unite union said on Wednesday workers would begin indefinite strike action on 11 March, as people living on Drews Lane in Washwood Heath complain of large \"cat-sized\" rats.\nPeople in the area said they are being left with repair bills due to the rodents chewing through car cables and nesting under bonnets.\nLabour-run Birmingham City Council, which brought in a £24 charge for rat control visits last year, acknowledged missed collections had caused issues.\nResidents have also attributed the problem to nearby HS2 construction work. HS2 said the health and safety of its workforce and the public was its \"number one priority\".\nOne resident told the BBC he had trapped 17 rats in two months while others have found infestations in wheelie bins.\nLouise Baker, a mechanic from Tyseley, said customers had brought in their cars after rats had chewed through the wiring.\nShe told BBC Radio WM: \"A few weeks ago I had a lady with a two-year-old Audi who had her engine management light on.\n\"I picked it up and saw that a rat had eaten through all the wiring.\n\"Last week my parent's neighbour was having a car collected. It had been sitting on their drive for three months. When I opened the bonnet I saw the rats had taken over. [They] had chewed everything under the bonnet.\"\nOpposition parties have described the £24 charge as a \"rat tax\" but the authority said it was cheaper than neighbouring authorities.\n\"The rats are huge - they are like small cats and their tails are really chunky,\" said Kim Blakeman, who has lived on Drews Lane for 16 years.\n\"They are in and out of our recycling bins, and since HS2 has started across the road we've had more of an influx.\n\"The council don't bother litter picking our road anymore. People fly-tip, it's a perfect nesting site and the rats come and feed in our bins.\"\nTeacher Mariya Malik contacted the BBC after a relative's car was damaged by rats chewing cables for a third time.\n\"The car wouldn't start and that cost us around £120. It's not a fortune but £120 when it's not your fault - it's quite upsetting,\" she said.\n\"When you sit in your car in the morning there is just so much anxiety, is it going to start or have the rats attacked again? Fly-tipping isn't helping, the bin strike hasn't helped.\"\nMs Malik's neighbour Ali said he had found a \"rat's nest\" on his car's battery.", "url": "https://www.bbc.co.uk/news/articles/c8710jy4538o"}