{"authors": ["Holly Fleck", "www.facebook.com"], "date_download": "2025-04-26 03:57:51", "date_modify": "2025-04-26 03:57:51", "date_publish": "2025-03-04 13:29:34", "description": "Experts are meeting at the first Hospital Winter Pressures forum on Tuesday to plan for next winter.", "filename": "news_articles_cly28nexdqeo_1745639871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3ea/live/6210d140-f8f5-11ef-beb0-b7d9efbf9716.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly28nexdqeo_1745639871.html", "title": "NI health: Winter pressures were worst 'ever seen', says RCN", "title_page": "NI health: Winter pressures were worst 'ever seen', says RCN - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The pressure on hospitals over the winter period was some of the worst ever seen, according to the executive director of the Royal College of Nursing NI (RCN).\nStaff working in Northern Ireland's emergency departments described being at \"breaking point\" as they dealt with large numbers of patients.\nRita Devlin said health experts need to start looking at solutions to system pressures now or \"we will end up back where we were\".\nIt comes as the first meeting of the Hospital Winter Pressures forum was held on Tuesday.\n\"People have to start making decisions; they may be difficult decisions, but we cannot go back to where we were this December,\" Ms Devlin said.\nThe Health Minister Mike Nesbitt said he was \"really encouraged\" by the turnout at the first meeting, adding that he wants to see \"better come next winter\".\nNesbitt said this is the first of four meetings, and targets will not be set on Tuesday but at the end of the process.\nHowever, Ms Devlin told BBC News NI that she believes planning for next winter should have begun two years ago.\n\"I hope that we will get some idea of what we need to do to deal with the awful issue of corridor care, extra beds and extra wards, and better care for our patients,\" she said.\nMs Devlin said: \"Nursing holds a lot of the solutions to the issues that we have.\"\n\"We need to invest in primary care absolutely; we need to stop the flow into hospital.\n\"People should only be in hospital if they are extremely unwell or if they are in for a certain operation or treatment.\"\nNesbitt said he would work with the funding his department is allocated and \"continue to argue for what I need\".\nA potential £215m of funding was announced in the programme for government.\nNesbitt said if the funding wasn't delivered, it would be a \"terrible condemnation of the executive for raising expectations only to dash them\".\n\"We are talking about people who are living in pain, maybe have been living in pain for years, and now they are suddenly being given hope for the first time in a long time that they may get some relief,\" Nesbitt added.\n\"So it would be worse than cruel to dash those hopes.\"\nDr Michael Perry, vice chair of the Royal College of Emergency Medicine NI, said it is \"not so much winter; it is all year-round pressure\".\n\"We have a large number of patients who have had their medical treatment and are waiting to have care packages and social care; that must be where our focus is,\" Dr Perry said.\n\"I'm asking for money to be spread into community and social care to alleviate the symptoms in my department.\n\"The solution to this is not fixing emergency care; it's fixing the system.\"", "url": "https://www.bbc.co.uk/news/articles/cly28nexdqeo"}