{"authors": ["Oliver Slow", "www.facebook.com"], "date_download": "2025-04-26 06:45:27", "date_modify": "2025-04-26 06:45:27", "date_publish": "2025-03-01 15:28:50", "description": "Cody, 15, says he was hit by a car, then had a knife wielded at him before his bike was stolen.", "filename": "news_articles_c2err1x13zlo_1745649927.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ad8/live/9cf5aa40-f5eb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2err1x13zlo_1745649927.html", "title": "Electric bike: Porth hit and run robbery teen scared to ride again", "title_page": "Electric bike: Porth hit and run robbery teen scared to ride again  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager described how he was hit off his e-motorbike by a car, before a passenger in the vehicle got out, brandished a knife at him, and took his bike.\nCody, 15, now fears for his safety after the incident which he described as \"weird\".\nIt happened when he was riding his bike with a friend in Porth, Rhondda Cynon Taf, at about 17:15 GMT on 11 February.\nSouth Wales Police said two teenage boys, aged 16 and 18, were arrested on suspicion of robbery and have been bailed pending further enquiries.\n\"[The driver] went speeding into me and hit me and my bike,\" Cody said.\n\"I fell on the ground, and he drove into the bike again while I was on the floor.\"\nHe added that a passenger then got out of the car \"with a knife and swiped it at me\".\nCody said he got the motorbike before Christmas, and on the day of the incident was riding with a friend to another friend's house.\n\"We were going down the road and there was a car behind that was very close - I didn't think much of it at first,\" he said.\nHe then said the car sped past him, turned back towards him, before the driver \"went speeding into me and hit me and my bike\".\nThe car hit the bike again while he was lying on the floor, before a passenger got out and wielded a knife at him, Cody added.\nThose involved then took the bike and put it in the boot of the car, he said.\nCody said he ran away before he was helped by a passerby and the police were called.\nMore than two weeks later, Cody said he was still in shock about what happened.\n\"It's changed the way I think about going out on a bike like that. I probably won't go riding my bike again,\" he said.\nCody has set up a fundraiser to try and recoup some of the money he spent on the bike.\nIt was a Sur-Ron electric motorbike worth £3,500, much of which he was paying back in instalments.\nHe does not expect to get it back but hopes action would be taken against those involved.", "url": "https://www.bbc.co.uk/news/articles/c2err1x13zlo"}