{"authors": ["Amy Holmes", "www.facebook.com"], "date_download": "2025-04-26 03:38:21", "date_modify": "2025-04-26 03:38:21", "date_publish": "2025-03-05 00:06:37", "description": "The founder of a support scheme says: \"We will walk with our Ukrainian friends hand in hand.\"", "filename": "news_articles_cew5r4k7ed1o_1745638701.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0127/live/6efa2fa0-f530-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cew5r4k7ed1o_1745638701.html", "title": "How Buckinghamshire became a hotspot for Ukrainian refugees", "title_page": "How Buckinghamshire became a hotspot for Ukrainian refugees - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than 2,100 refugees have moved to Buckinghamshire under the government's Homes for Ukraine scheme, the highest of any local authority area in the UK. How have they settled, what impact have they had, and what do they make of events in the White House and beyond in recent days?\nUp to the end of 2024, there had been 219,400 arrivals into the UK as part of the scheme, although some have since left the country.\nThe Homes for Ukraine, external scheme allowed UK and Irish citizens, and those with settled status in the UK, to sponsor the visa of somebody from Ukraine and host them for a minimum of six months.\nBuckinghamshire Council said it had had more than 1,100 sponsors since the conflict began in 2022, and that there were 433 Ukrainians of school age in education in the area.\nWhile Ukraine has seldom been far from the headlines in the past three years, events have moved very quickly in the past few days.\nThere were unprecedented scenes in the White House last Friday when Ukrainian president Volodymyr Zelensky clashed with Donald Trump and JD Vance in front of the world's media.\nThey culminated in Zelensky being ordered to leave the White House before flying to London where he received a strong show of support from European leaders.\nSarah Graham runs Hilltops Ukrainian Support Community, external, which has helped almost 600 people settle into the area around the Chiltern Hills in Buckinghamshire, three-quarters of whom are now in their own homes.\nShe says that after participating in events in London last week, the group got together last Friday to commemorate the third anniversary of the start of the war.\n\"Sitting with around 200 of our Ukrainian friends, we heard the news of what was unfolding in the Oval Office with feelings of utter dismay,\" she says.\n\"There is so much to be said, so many thoughts and so many emotions, but the message is clear: we will walk with our Ukrainian friends hand in hand.\n\"We want to see an end to the war in Ukraine, but peace has to be sustainable and supported from all sides.\n\"It was very encouraging to see Sir Keir Starmer host the summit on Sunday, with leaders who will do what it takes to achieve lasting peace.\"\nOn the day-to-day issues faced by refugees, Sarah, who was appointed MBE in 2023 for her work, says: \"Through a wide array of initiatives, we foster a strong sense of belonging and mutual care, helping Ukrainians overcome challenges as they rebuild their lives.\"\nIryna Chekmarova, 37, and her daughter live with a host family in Old Amersham, although she hopes they may be able to get their own place soon.\nShe was also dismayed by events in the White House on Friday.\n\"It was total humiliation from the very beginning. Zelensky was brave enough to not use an interpreter. He was brave enough to answer all questions truly,\" she says.\n\"We've been living in this war for almost three years and I feel even more scared and anxious right now about the future of our country.\"\nReferring to criticism Zelensky faced for not wearing a suit to the meeting, she says: \"Even Winston Churchill didn't wear a suit when his country was in the war. I am happy that almost all Europe and Great Britain support Ukraine in this difficult time.\"\nIryna came to Britain without her husband, who was not allowed to leave Ukraine. He makes weapons in a factory in Kharkiv, close to the Russian border.\nShe still visits him, but \"only sees him for a little bit each day\".\nShe says people ask her why she goes back, and while she admits it is \"quite dangerous\", she says she feels a \"brightness and is really happy\" when she does.\nA Healthwatch Bucks, external report reveals that although almost two-thirds of migrants said it was easy to register with a GP, a third had not seen a dentist in the UK and only half had visited an optician.\nAnna Putiata, 38, a project manager who lives in Wendover, says she has had problems finding a GP as she \"needs to find a doctor she trusts and can go to all the time\".\nShe says she experienced health problems when she first arrived in the UK, but now has health insurance through work, which has helped.\nAnna adds that she lacked confidence in English because \"she is surrounded by people who are fluent\" but \"is lucky to have people around to help\" her.\nThe BBC spoke to some of the group at the church.\nOleksandra lives in Haddenham with her husband and two children, one of whom was born here.\nShe says the church is \"very nice and is a big community\" where she has more friends.\nTetiana, who works in the church, hopes to \"maybe\" stay here with her teenage daughter, if she can.\nKateryna, who lives in Aylesbury, says a doctor helped her with a \"hard labour\". She is pleased that her child \"can play with others at playgroup\".\nNadiia says she \"does not want to go back, even if the war ends\".\nShe says her \"dream is to stay here\", as she feels safe in Buckinghamshire.\nBuckinghamshire Council's Conservative leader Martin Tett says: \"We are very proud to have such a strong record on local support provided to Ukrainian guests.\n\"We know how hard it must have been to move to a new country under the circumstances, but through dedicated support officers, the council helps them integrate into their new communities.\"\nHe feels a large number of Ukrainians have settled in the county because of \"the higher number of people in Buckinghamshire who came forward to be sponsors\".\nTett says the authority has \"converted many people's qualifications to UK equivalents to help them\", but adds that that finding employment remains a challenge, so many \"take a job not commensurate with their qualifications and previous employment\".", "url": "https://www.bbc.co.uk/news/articles/cew5r4k7ed1o"}