{"authors": ["Emma Rossiter", "www.facebook.com"], "date_download": "2025-04-26 06:40:06", "date_modify": "2025-04-26 06:40:06", "date_publish": "2025-03-02 14:51:56", "description": "The Conservative leader says she remains opposed to a deal, despite US President Donald Trump signalling support.", "filename": "news_articles_cwyjn92gknlo_1745649606.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/19d9/live/d81f5940-f767-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyjn92gknlo_1745649606.html", "title": "Badenoch: Giving away Chagos Islands not in UK's national interest", "title_page": "Badenoch: Giving away Chagos Islands not in UK's national interest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Conservative leader Kemi Badenoch has said her party will not stop opposing a deal that would hand over the Chagos Islands, despite it receiving a favourable hearing from US President Donald Trump.\nThe proposed agreement would cede the Indian Ocean islands - which house a strategically important joint US-UK military base - to Mauritius, which has claimed sovereignty over them. The military base would then be leased back.\nBadenoch told the BBC's Sunday with Laura Kuenssberg: \"It is not in our national interest to give [them] away and pay for the privilege of doing so.\"\nA Downing Street spokesman said it welcomed that Trump had recognised \"the strength of this deal\".\nNegotiations between the UK and Mauritius were started by the Conservatives in 2022, but an agreement to hand over the archipelago - known officially as the British Indian Ocean Territory - was announced by the Labour government in October.\nIt has prompted criticism since being announced, as it would see the UK lose the islands while providing Mauritius with annual payments to take them over.\nThere were also concerns - voiced by Trump's Secretary of State Marco Rubio - that handing the islands to a nation increasingly affiliated with China posed a \"serious\" national security threat.\nThe government says striking a deal was necessary to secure the future of the joint military base, known as Diego Garcia, while resolving the legal dispute over the ownership of the islands.\nIt also gave Trump a veto over the deal - but the US president said he was \"inclined\" to agree to it during a meeting with Prime Minister Sir Keir Starmer on Thursday.\nHowever, Badenoch has remained adamant that the Tories will not change their views about the deal.\n\"We will not stop our opposition to the surrender of the Chagos Islands, we will continue,\" she said, adding that the financial aid for Mauritius under the terms of the deal was \"taxpayers' money\".\n\"That is money which the prime minister seems to have confirmed is coming out of the defence increase that he has just announced. That's terrible,\" she added.\nThe deal has been put on hold since December while awaiting approval from the Trump administration, and after the then-newly elected prime minister of Mauritius said he had reservations about it.\nAhead of his meeting with the US president, Sir Keir came under fire from Badenoch after newspaper reports claimed that the effective price tag for carrying out the deal had jumped from £9bn to £18bn.\nThe government had earlier said the figures were \"entirely inaccurate\".", "url": "https://www.bbc.co.uk/news/articles/cwyjn92gknlo"}