{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:37:58", "date_modify": "2025-04-26 04:37:58", "date_publish": "2025-02-28 10:49:17", "description": "All of those taken to Tbilisi were Georgian nationals who had been subject to deportation orders.", "filename": "news_articles_cq5zzn81229o_1745642278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ea6/live/3e7e3840-f5c0-11ef-97ab-abb74cabf06c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zzn81229o_1745642278.html", "title": "Thirty-two people deported to Georgia on Irish chartered flight", "title_page": "Thirty-two people deported to Georgia on Irish chartered flight - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thirty-two people were deported from the Republic of Ireland to Georgia on a chartered flight on Thursday night.\nIt was the first operation conducted under a contract signed by the Republic last November for the provision of charter flights for deportations.\nAll of those taken to Tbilisi on the flight were Georgian nationals who had been subject to deportation orders.\nThe group was made up of 28 men, three women and a child who was with their parents.\n\"A central priority for me and this government is that our immigration laws are robust and enforced,\" Irish Justice Minister Jim O'Callaghan said.\n\"People are entitled to have confidence in our immigration system and there must be consequences for individuals who refuse to leave the state when they are ordered to do so.\"\nHe said Thursday's flight was \"a significant start in ensuring that deportation orders are enforced and part of a more effective immigration system generally.\n\"There will be further flights scheduled in the future.\"\nGardai (police), medical staff, an interpreter and a human rights observer were also onboard the flight.\nMr O'Callaghan said when a person's application for asylum is refused or they are found to have no permission to be in the state, they are offered assistance to return home voluntarily.\nIf they do not do so, they are liable to be deported by the Garda National Immigration Bureau, he added.\nThe Irish Department of Justice said access to chartered flights \"has significantly increased the capacity of An Garda Síochána to effect removals\".", "url": "https://www.bbc.co.uk/news/articles/cq5zzn81229o"}