{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:16:04", "date_modify": "2025-05-21 06:16:04", "date_publish": "2025-01-14 00:00:00", "description": "A deal between Israel and Hamas on a ceasefire in Gaza and release of hostages is \"very close\", mediator Qatar says,", "filename": "news_live_c93gddkk3vpt_1747808164.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c93gddkk3vpt_1747808164.html", "title": "Israel-Hamas ceasefire deal 'right on the brink', says Blinken", "title_page": "Israel-Hamas ceasefire deal 'right on the brink', says Blinken - live updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ceasefire deal 'on the brink' - but we're not there yet\nWhat's been described as the \"final stages\" of negotiations on a deal for a ceasefire and the release of hostages in Gaza has been taking place today - but there's been no announcement yet.\nQatari mediators say the last details for a deal between Israel and Hamas are being discussed after all major issues were \"resolved\". But they've warned that both sides could \"still get lost in the details\", allowing a deal to fall through.\nA final deal would unfold in three phases, our Gaza correspondent Rushdi Abualouf says, with three hostages released on the first day and Israel beginning to withdraw troops after that.\nBut there's consternation among hostage families, who've demanded any deal ensures all captives are released.\nBoth Israeli and Hamas officials have expressed optimism that a deal can at last be achieved, while the outgoing US secretary of State Antony Blinken said an agreement was \"on the brink\".\nWe are wrapping up our live coverage for now, but you can continue to follow developments on our site, with more coverage below.\nThanks for joining us.\nWhy are Israel and Hamas fighting in Gaza?\nIsrael and the Palestinians: History of the conflict explained\nThree things that could make a Gaza hostage deal more likely\n'His four children will hug him', family of hostage says\nFamilies of hostages being held in Gaza have been speaking to the BBC World Service’s OS programme to the news that a ceasefire deal could be imminent.\nEyal Kalderon is the cousin of Ofer Kalderon, who was taken by Hamas from the Nir Oz kibbutz along with his two children, who have since been released.\nHe says the children are desperate to be reunited with their father.\n“We are hoping that the deal will be closed soon, and we will reach the moment where we are hugging Ofer.\n\"His four children will hug him, we will take care of him. We are just hoping to see all of the [hostages] here, in Israel.”\nGadi Moses turned 80 while in captivity. His niece Efrat Machikawa says the entire family has been in a state of shock since 7 October – but is holding out hope for his safe return.\n“Do you know anyone who is 80? Can you imagine how terrifying this must be? We’re extremely worried for his condition after 15 months, but we will not lose hope. We are just waiting to hug him.”\nTal Chaimi was killed on 7 October, and his body has never been returned to his family.\nHis cousin Udi Goren says the \"deal must go through until the very last hostage is released, and not just this first phase we are hearing about.\n\"We must make sure that we, Israel, maintain our guarantees.\"\nGazans share optimism to 'start over again'\nAs mediators say negotiations to reach a ceasefire deal are in their final stages, the BBC OS team from the BBC World Service has received messages from people in Gaza with their reactions.\nSeventeen-year-old Sanabel, currently living with her family in her partially destroyed house in Gaza City says: “I can’t believe that I am still alive with this moment of ceasefire in my city - we’ve been waiting for this with bated breath”.\nShe says everyone in Gaza is “feeling happy, cheerful, optimistic to see their best friends, to see their families who were displaced […] to start over again”.\nSanabel adds that the first thing she will do when the war ends is see her best friend who has been displaced, “hug her tightly”, and “make up for every moment” lost during their separation.\nBut despite the optimism, she is worried the ceasefire might not last. “I don’t want a ceasefire for a year or for five months. I want a ceasefire […] for the rest of our lives,\" she says.\nKhalid, who lives in Jabalia, north of the Gaza Strip, says people in Gaza “hope the ceasefire will happen soon because they are suffering more and more”.\nHe says \"the people in the south of Gaza are having a festival […] because they think the ceasefire will be soon,\" and he thinks this is “the real ceasefire”.\nFamilies of kidnapped Israelis say ceasefire deal should include all hostages\nFamilies of Israelis being kept captive in Gaza have demanded that all hostages are released in any ceasefire deal after they held meetings today with Israeli Prime Minister Benjamin Netanyahu.\nIt is understood the proposed ceasefire deal will work in stages, meaning not all hostages will be released straight away.\nSpeaking after meeting Netanyahu, Shay Dickmann, whose cousin was killed in Hamas captivity, says families are \"very disturbed\" that \"we have not yet agreed upon all of the hostages coming home\".\nHe adds: \"We said, and Prime Minister Netanyahu agreed, that time is of the essence and that time does not work with the hostages.\"\nRuby Chen, father of hostage Itay Chen, adds: \"It's time for a deal that includes everybody. That is what we demand and what we expect from the prime minister.\"\nGazans excited and nervous at prospect of deal\nPaul Adams\nDiplomatic correspondent\nAfter the 15 bleakest months of their lives, Gazans are once again daring to hope that the end of their ordeal is close.\n“You can never imagine how excited and nervous people are here,” Asmaa Tayeh told me by text from the house in northern Gaza where she and her family are sheltering.\n“Everyone is waiting as if they will only survive after the announcement,” she added.\nAsmaa is from Jabalia, the Gaza Strip’s largest refugee camp. We told her story back in August - a story of narrow escapes and frequent evacuations.\nWhen the Israeli military returned to Jabalia in October, the family was forced to flee once more, again seeking refuge in her grandparents’ house in al-Nasr, a short distance to the west.\nFierce fighting has raged in Jabalia ever since. If the war does now end, there will be nothing for the family to return to.\n“My whole area is wiped out now,” she told me at the end of December.\nBlinken says he hopes international partners can help run Gaza\nBlinken says from early on, they were working to develop a \"detailed post-conflict plan\".\nThis will be handed to the incoming Trump administration.\nBlinken says they hope international partners can help run Gaza, with input from the UN to oversee the \"international stabilisation and security effort\".\nHe also says partners should contribute troops to focus on \"law and order\".\nSome partners have already agreed, he says, but \"if and only if it is agreed that Gaza and the West Bank are reunified... as part of a pathway to an independent Palestinian state\".\nHe says they may face challenges in the future, as Israel will have to work on its relationship with Gaza.\nI believe we will get ceasefire, says Blinken\nBlinken is now explaining the US's previous drafts for a ceasefire deal, which included an initial six-week ceasefire pause and:\nIsraeli forces pulling back\nHostages starting to come home\nPalestinian prisoners released\nAnd humanitarian aid increased\nThis, he says, would also create space for finalising a \"day-after plan\" - the term for how Gaza would be governed after the war - to allow the full withdrawal of Israeli forces to make the ceasefire permanent.\nOn Sunday, US, Qatar and Egypt put forward a final plan, Blinken says.\n\"The ball is now in Hamas's court,\" he says, as he stresses that the deal is ready to be concluded and implemented.\nBlinken says he believes there'll be a ceasefire. Whether this happens in the final days of the Biden administration or after, he says it will follow closely the deal Biden put forward last May.\nThe more people suffer the less they feel sympathy for other side, Blinken says\nBlinken is now turning his attention to the hostages being held in Gaza and the humanitarian crisis in the besieged strip.\nFor those with loved ones still being held hostage, every day brings anguish about not knowing whether or not they are alive, the secretary of state says, highlighting the people who were taken on 7 October.\nHe says the ongoing war in Gaza has inflicted \"immeasurable\" suffering on the region.\nBlinken notes that tens of thousands of people have been killed in Gaza and nearly the entire population is having to endure hunger. Most of the two million inhabitants have been displaced, many multiple times, he adds.\nThe more people suffer, the less they feel sympathy for the suffering of the other side, he says.", "url": "https://www.bbc.com/news/live/c93gddkk3vpt"}