{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:10", "date_modify": "2025-04-26 03:51:10", "date_publish": "2025-03-05 12:05:00", "description": "The bells had been reduced after a noise complaint but will now return to striking every 15 minutes.", "filename": "news_articles_cvg1ewelxj8o_1745639470.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aa24/live/43b28cf0-f9b0-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1ewelxj8o_1745639470.html", "title": "'Too loud' clock to chime every 15 minutes again", "title_page": "Birkenhead Hall: 'Too loud' clock to chime every 15 minutes again - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The chimes on a historical clock will again ring out every quarter of an hour after being limited for months.\nThe bells at Birkenhead Town Hall had tolled every fifteen minutes for 137 years until they were reduced to every hour in November 2024 after a resident complained they rang \"too loud\" and \"too often\".\nHundreds of people signed a petition calling on the council to reverse its decision.\nCouncillor and Wirral Heritage Champion Jerry Williams said the hammer that strikes the bell had now been nullified to reduce the noise levels, allowing the chimes to return to their usual schedule.\nBirkenhead residents welcomed the return of the chimes.\n\"We like the bells,\" one resident said. \"It reminds me when it's 07:15 and I need to get up - it's nice\".\nThe clocktower above Birkenhead Town Hall, close to Hamilton Square, reaches 60m (200ft) in height.\nIt first started ringing when the town hall opened in 1887 and continued to do so until a resident who lived nearby complained about the volume and frequency of the quarter-hourly tolling of the bells, prompting a council investigation.\nAn officer went to their home and measured the noise, finding the chiming to have breached limits capable of being classed as a nuisance.\nAt the time, a council spokeswoman said a \"compromise\" was reached to move to hourly chimes while the authority considered other options.\nMr Williams said the bells would now ring again from 07:00 into the early evening.", "url": "https://www.bbc.co.uk/news/articles/cvg1ewelxj8o"}