{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:24:20", "date_modify": "2025-05-19 15:24:20", "date_publish": "2017-07-25 00:00:00", "description": "New inspections for Jersey children's services following care inquiry; access to public information law 'strengthened' in Guernsey; Alderney residents could have ultimate say on FAB project; and more", "filename": "news_live_world-europe-jersey-40686465_1747668260.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_world-europe-jersey-40686465_1747668260.html", "title": "BBC Local Live: Channel Islands on Tuesday 25 July 2017", "title_page": "BBC Local Live: Channel Islands on Tuesday 25 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our coverage across the day\nRob England\nBBC News Online\nOur live coverage across the Channel Islands has finished for the day.\nWe'll be back on Wednesday from 08:00 with the latest news, sport, travel and weather.\nDon't forget BBC Channel Islands News on BBC One at 18:30 and 22:30. There will also be news through the night on your BBC Local Radio station.\nCancer charities 'can do more together'\nBBC Radio Guernsey\nThe chairman of a Guernsey cancer charity has said local organisations are working more closely than ever before to achieve their shared goals.\nPeter Atkinson is from the Guernsey Society for Cancer Relief, which aims to provide financial assistance to cancer sufferers and their relatives.\nHe said cancer charities in Guernsey could achieve better results by co-operating, as the society had done with another charity, the Pink Ladies, in sharing the cost of wigs they provided to people who needed them after cancer treatment.\nQuote Message\nI think we are moving towards working more closely together and having a meeting whereby we can exchange views and give more support.\nPeter Atkinson, Guernsey Society for Cancer Relief\nFAB link project 'not approached about possible public vote'\nRob England\nBBC News Online\nThe management team of the FAB link power project has not been approached by the States of Alderney regarding a public vote, a spokesman for the project says.\nThe States will put forward a vote to the public which, if followed by States members, could affect the future of the project if the vote says a majority of people do not support it.\nFAB project development manager Chris Jenner said: \"The FAB Project is currently involved in negotiations with the States of Alderney and their advisors about the existing option agreement between the two parties.\n\"We believe the project will result in significant long-term benefits for the people of the island. These include world-class internet connectivity for islanders via our inter-connector infrastructure, with the benefits this would bring to the local economy.\"\nHighlands College receives 'highest degree results to date'\nBBC Radio Jersey\nStudents from Jersey's Highlands College are celebrating their highest degree results to date, receiving 79 degrees in 11 different subjects.\nThe qualifications were awarded by the University of Plymouth and London South Bank University.\nSome 37% of students achieved first class honours, compared to with 24% in the UK in 2016.\nBen Bennett, head of higher education at Highlands College, said: \"We are proud to be working with many learners who will be the first in their family to gain a university degree.\"\nAurigny warns of fog disruption on Wednesday\nGuernsey States-owned airline Aurigny is warning of potential disruption due to fog expected throughout Wednesday.\nA spokesman said: \"We are still planning to operate as normal at this stage. However, with the possibility of poor visibility, we want to give passengers, due to fly tomorrow, the change to move their booking for free.\n\"They can move onto an earlier flight this evening or to another flight over the next three days.\"\nCricket: Guernsey beat Jersey for first inter-insular win\nJames Law\nBBC Sport Online\nGuernsey have won the women's cricket inter-insular for the first time, beating a youthful Jersey side by 23 runs at the KGV this afternoon.\nPlaying in a Twenty20 format, the Sarnians were bowled out for 123, though skipper Katie Watson took three wickets to restrict Jersey to just 100.\n\"We had 24 players at one session a couple of weeks ago, so we're possibly looking at having a couple teams and that would be great. We're trying to develop the young girls on the island,\" said Guernsey coach Lucas Barker.\nBlood donation rules could change in Jersey\nBBC Radio Jersey\nRules governing who can give blood in Jersey could be changed following a review in the UK.\nAs part of law changes relating to people's sexuality, the UK Government hopes to increase the supply of blood available across the country.\nAt the moment, gay and bisexual men can only donate blood 12 months after they last had sex, external.\nThe law was introduced in an attempt to stop the spread of Aids and other infections from contaminated blood. But the UK Government said recent research had shown that period could be safely reduced to three months.\nEquality campaign groups said it was a step forward in making an inclusive society.\nA spokesman for Jersey's Health and Social Services Department said the island had similar restrictions to the UK, but would be reviewing its guidelines in the light of the change in policy.\nThe change comes into effect in the UK at the start of 2018.\nAlderney FAB vote 'not legally binding' to States members\nBBC Radio Guernsey\nAlderney residents could have the ultimate say on whether the island supports the controversial FAB link project.\nThe island's Policy and Finance Committee intends to put forward a public vote in the form of a plebiscite.\nA plebiscite is similar to a referendum but is not legally binding, so politicians in Alderney could disregard the will of the public.\nDeputy Chairman of Policy and Finance Tony Barnes said it was up to States members, but he would follow the public's lead.\nQuote Message\nI personally believe that I would actually follow the feeling of the electorate. But, of course, if it's a close-run thing, we may have to think further.\nTony Barnes, Deputy chairman, States of Alderney Policy and Finance Committee\nBody found in Guernsey harbour identified as 80-year-old local man\nA body found in St Peter Port Harbour on Sunday has been identified as Gerald William Bisson, Guernsey Police say.\nOfficers said the 80-year-old man was seen near his home in Delancey, St Sampson, at about 14:00 on Saturday and he was seen on CCTV walking alone at about 00:30 on Sunday in the White Rock area of St Peter Port.\nThey are appealing for anyone with information of his whereabouts between these sightings to come forward.\nHe was wearing black slip-on shoes, light grey-coloured trousers, a blue polo shirt, a black jacket and a dark baseball cap.\nOfficers are investigating the cause of death, but it is not being treated as suspicious.\nAnyone with information is asked to call police on 725111 or email CID, external.\nCricket: Jersey youngsters suffer heavy defeat\nJames Law\nBBC Sport Online\nJersey suffered a heavy six-wicket loss to Scotland in their Under-19s World Cup qualifier at Grainville today.\nNeil MacRae's side were all out for just 58 runs after winning the toss and batting first, and though Scotland were 36-4 at one stage, they reached the target with more than 36 overs to spare to condemn Jersey to a second defeat in the opening two days of the tournament.\n\"We just had to bat tight, and we played a few loose shots which obviously cost us,\" captain Harrison Carlyon told BBC Radio Jersey.\n\"Everybody will have a rest tomorrow and then we're just going to come hard, like we did in the first game.\"\nAccess to public information law 'strengthened' in Guernsey\nRob England\nBBC News Online\nPeople in Guernsey's access to public information has been \"enhanced\", according to the States.\nAfter a review of the Access to Public Information, external Code of Practice, which allows information requests to be made of the government, the Policy and Resources Committee has agreed new steps to \"strengthen\" the code.\nThe further agreed steps were:\nAll access to public information questions and responses will be published on the States website: gov.gg\nWork will be carried out to promote awareness of the code across the public service\nWork will be carried out to promote awareness of the code with the general public\nThe Chief Information Officer will be tasked with reviewing any decision where an exemption has been used under the code\nStates of Guernsey Chief Information Officer Colin Vaudin said the code's purpose was to provide \"transparency\" in government, and the additional changes would improve this.\nHe added, where \"inconsistencies\" were found between government departments with regards to holding back information, an internal review process would be put in place to address this.", "url": "https://www.bbc.com/news/live/world-europe-jersey-40686465"}