{"authors": ["Calin Cosmaciuc", "www.facebook.com"], "date_download": "2025-05-19 14:46:23", "date_modify": "2025-05-19 14:46:23", "date_publish": "2015-02-12 00:21:08", "description": "The entrepreneurial Romanians taking tourists on tours exploring the country's traumatic communist past.", "filename": "news_business-31356079_1747665983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80913000/jpg/_80913194_000239098.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31356079_1747665983.html", "title": "The Romanian entrepreneurs making money from communism", "title_page": "The Romanian entrepreneurs making money from communism - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It may be more than 25 years since communism came to an end in Romania, following the violent overthrow of former dictator Nicolae Ceausescu, but feelings still remain raw in the country.\nSuch was the level of repression and grinding poverty under the communist regime that ruled the country from the end of World War Two until December 1989, that most Romanians still don't like to discuss this turbulent part of their history.\nIt was a time of severe food and fuel shortages, and the feared secret police, the Securitate, which by 1985 had 11,000 agents and 500,000 informers. Thousands of people were arrested and killed.\nYet while the wounds haven't healed for many Romanians, the growing number of tourists that today visit Romania, and in particular its capital Bucharest, are keen to find out more about life in the former Socialist Republic of Romania.\nStefan Munteanu, 31, has been organising such tours since 2013, after he invested 2,000 euros ($2,263; £1,480) of savings to set up his business Open Doors.\nHe now organises 10 tours a week, which each attract an average of 15 participants, and cost from 13 euros per person.\nHe says that tourists find out about his business via three main sources - his own website, Tripadvisor, and recommendations from hostels and hotels in Bucharest.\n\"I was only six in 1989 when the communist regime fell, but I do remember the lack of food, the queues at the grocery stores, and the power cuts,\" he says.\n\"Now it is over, but we have to accept that communism was part of our recent history... let's see how we can profit from it.\"\nMr Munteanu says that \"the biggest wow\" for tourists is inevitably the giant parliament building.\nThe grandiose structure and its 1,100 rooms was Ceausescu's most notorious vanity project.\nOriginally called the People's House, it was designed to be both his personal palace, and home to all parts of the communist administration.\nTo make way for the vast building, which is 270m (889ft) long and 240m (787ft) wide, Ceausescu ordered that one fifth of the historic centre of Bucharest be bulldozed.\nHe has photos and old newspapers from the era, one of the former regime's coat of arms, and even a pack of communist-made cigarettes.\nMr Zaharia ends his tour by the former Romanian Communist Party office building where Ceausescu and his wife Elena fled from by helicopter during the 1989 uprising.\nHe says that while most Romanians wouldn't want to go on such a tour, he hopes that this will eventually change.\nOne of the tour guides who is older than most is called Dorin Marian Carlan.\nNow in his 50s, he was a member of the army firing squad that executed Nicolae and Elena Ceausescu after they had been caught near the city of Targoviste.\nWhile no fan of communism, Mr Carkab says he is still uneasy that the couple were shot after a military trial that lasted just one minute and 44 seconds.\nHe tells the BBC: \"I just hope that history won't repeat itself, I mean the communism, but also the faked trial and execution of the Ceausescu's.\"", "url": "https://www.bbc.com/news/business-31356079"}