{"authors": ["News from Elsewhere", "www.facebook.com"], "date_download": "2025-05-19 14:59:22", "date_modify": "2025-05-19 14:59:22", "date_publish": "2015-02-13 11:18:48", "description": "Right-wing MP criticises the Italian navy for recruitment adverts which use an English slogan.", "filename": "news_blogs-news-from-elsewhere-31453590_1747666762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80984000/jpg/_80984362_navy3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_blogs-news-from-elsewhere-31453590_1747666762.html", "title": "Italy: MP chides navy for English recruitment adverts", "title_page": "Italy: MP chides navy for English recruitment adverts - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Italy's defence minister has rebuffed criticism over navy recruitment adverts which used a slogan written in English.\nThe phrase \"Be cool and join the navy\" appeared on a series of recruitment posters, but it has drawn the ire of the right-wing Fratelli d'Italia party, the Ansa news agency reports, external. In parliament, MP Fabio Rampelli said the slogan was \"unacceptable\" and that Defence Minister Roberta Pinotti should be suspended for \"wounding patriotism\". Mr Rampelli began by speaking in English, external, before switching to Italian. \"If I continued like that the Speaker would have stopped me,\" he said. \"I ask myself how it came into the mind of the Italian navy to launch, with our money, a campaign in the English language to recruit young people.\" Mrs Pinotti says the campaign was designed \"in house\" and was meant to appeal to young people who grew up interacting with the whole world over the internet. \"English was chosen because it's a differentiating factor compared to the traditional image of the navy,\" she said, adding that applications have risen by 20% compared to last year.\nWhile the use of English phrases in Italian life isn't rare, using it to recruit for the armed forces has annoyed some social media users. \"Enough with this English,\" says one person, external on the navy's Facebook page, where the adverts have been repeatedly posted since January. Several others describe the choice of language as \"shameful\", and one user adds: \"I'd like the invitation to enlist in the Italian navy expressed in Italian. Or are we a colony?!\"", "url": "https://www.bbc.com/news/blogs-news-from-elsewhere-31453590"}