{"authors": ["Meryl Sebastian", "www.facebook.com"], "date_download": "2025-04-26 08:13:42", "date_modify": "2025-04-26 08:13:42", "date_publish": "2025-02-26 11:18:46", "description": "The accused Shyam Bhartia has denied the allegations as \"baseless, false and disparaging\".", "filename": "news_articles_cp9yxjv8m4ko_1745655222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3a9a/live/cabdb670-f401-11ef-9719-af519b71d153.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp9yxjv8m4ko_1745655222.html", "title": "Shyam Bhartia: Rape case filed against Domino's Pizza franchise owner", "title_page": "Shyam Bhartia: Rape case filed against Domino's Pizza franchise owner  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Indian police have registered a case against leading businessman Shyam S Bhartia and three others for alleged criminal intimidation and rape of an aspiring Bollywood actress.\nBhartia is the founder and chairman of Jubilant Bhartia Group. Its subsidiary Jubilant Foodworks is the largest franchisee for Domino's Pizza outside of the US.\nThe woman, who can't be named under Indian law, accuses Bhartia of intoxicating and then \"brutally\" raping her in Singapore.\nBhartia has denied the allegations as \"baseless, false and disparaging\" in a filing with the Bombay Stock Exchange on Tuesday.\nThe company said Bhartia would fully cooperate with the investigation.\nJubiliant FoodWorks has not responded separately to the BBC's request for comment.\nThe woman said she first complained to the police on 11 November 2024. But her case was registered only on 22 February on orders of the Bombay High Court after it heard her petition.\nThe petition and the police complaint seen by the BBC alleged that the woman first met Bhartia in 2022 at a five star hotel in Mumbai through a co-accused, who allegedly promised to introduce her to people who could help further her career in the entertainment industry.\nShe alleges that Bhartia agreed to invest in her film project and asked her to come to Singapore, giving her his credit card details to book flight tickets.\nIn the petition, the woman also alleged that the co-accused made a video of the rape in Singapore in 2023.\nShe further alleged that she was repeatedly sexually assaulted by Bhartia thereafter that year.\nIn the company's filing with the stock exchange, Jubiliant FoodWorks said the court had made it clear it had not gone into the \"merits of the complaint\". It rubbished the allegations against Bhartia saying they were made with a \"clear mala fide intent against him\".", "url": "https://www.bbc.co.uk/news/articles/cp9yxjv8m4ko"}