{"authors": ["Clara Bullock", "www.facebook.com"], "date_download": "2025-04-26 04:30:10", "date_modify": "2025-04-26 04:30:10", "date_publish": "2025-03-03 06:24:50", "description": "A surgeon has swapped a couple of weeks' of his annual leave to provide healthcare in Cambodia.", "filename": "news_articles_c14jjk5zj2zo_1745641810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47f9/live/e9234cd0-f4fe-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jjk5zj2zo_1745641810.html", "title": "Somerset doctor gives up leave to treat people in Cambodia", "title_page": "Somerset doctor gives up leave to treat people in Cambodia - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A surgeon has swapped a couple of weeks' of his annual leave to provide healthcare in rural Cambodia.\nSomerset NHS Foundation Trust ophthalmologist Indy Sian was part of a team of eye doctors who provided eye surgery to people in the country.\nMany of the people that Mr Sian supported lived through the Khmer Rouge regime in the late 1970s, and had little access to eye care during their lifetime.\n\"It was literally an eye opener, as Cambodia is a developing country and a lot of the equipment they were using was understandably not to the high standard we have here,\" Mr Sian said.\nThe team that went to Cambodia consisted of six surgeons, three scrub colleagues, two opticians, an anaesthetist and a group of local volunteers.\n\"Many of the people we treated were from rural areas. We went out there to provide surgery to people out there who otherwise probably couldn't afford the procedure,\" Mr Sian said.\n\"We did our very best to give all the patients good outcomes, and it was great to see them over the next few days for their follow-ups, as we could track the level of improvement the treatment had made for them – they were so grateful.\"\nMr Sian said he hopes to go out to India and Sri Lanka next, and is talking about possibly going to Syria.\nHe added that work back home in Somerset is \"very busy but fun\".\n\"It's a lovely job,\" Mr Sian said.", "url": "https://www.bbc.co.uk/news/articles/c14jjk5zj2zo"}