{"authors": ["Emily Coady-Stemp", "www.facebook.com"], "date_download": "2025-04-26 04:31:00", "date_modify": "2025-04-26 04:31:00", "date_publish": "2025-03-03 06:15:37", "description": "Volunteers say they want to help the toads get to the freshwater sites they need for breeding.", "filename": "news_articles_c1mnnmzm97go_1745641860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3db/live/8ba7e800-f5d9-11ef-b21f-25997e41ca0d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mnnmzm97go_1745641860.html", "title": "Cuckmere Valley volunteers patrol to stop toad 'massacres'", "title_page": "Cuckmere Valley volunteers patrol to stop toad 'massacres' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volunteers are doing their part to stop a toad \"massacre\" in a Sussex village, as they take to the roads and help migrating amphibians get to their spawning sites.\nDuring toad migration season, the animals come out of hibernation and cross Litlington Road in the Cuckmere Valley.\nThey are aiming for freshwater to spawn, and volunteers from the East Sussex village of Litlington say they want to help them get there safely.\nPenny Aeberhard is behind the organised patrol that is now running, although she says she has been told people have been helping toads across for a long time.\nWith support and advice from Froglife, a national wildlife conservation charity, she has organised a patrol along a 2.5 mile (4km) stretch of road.\n\"There are toads either side of us but we need to be realistic. This is our first year, and we just have to get it as right as we can,\" she said.\n\"After the first night we realised that the big massacres were happening as people are travelling from south to north as they're coming home from work, Monday to Friday,\" Ms Aeberhard said.\n\"They're driving too fast, you have to go at 15-20 mph maximum to avoid these little critters.\"\nBut she said the patrol was \"not for the feint-hearted\" and outlined some of the risks to those taking part.\n\"Too dark, too cold, too wet, too slippery, fall into a pothole, break an ankle or whatever, or get hit by a car,\" she said.\n\"Froglife insists, very rightly, that we look at risk assessment because we don't want squashed people on the roads, as much as we don't want squashed toads.\"", "url": "https://www.bbc.co.uk/news/articles/c1mnnmzm97go"}