{"authors": ["Emily Ford", "www.facebook.com"], "date_download": "2025-04-26 06:19:26", "date_modify": "2025-04-26 06:19:26", "date_publish": "2025-03-01 07:26:28", "description": "Burton Chapel Records co-founder Isra Rodriguez says the industry is shifting towards smaller labels.", "filename": "news_articles_cddy965nlv3o_1745648366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/040f/live/531073d0-f4e5-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy965nlv3o_1745648366.html", "title": "Weymouth record label wants to turn town into music hub", "title_page": "Weymouth record label wants to turn town into music hub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The biggest names in UK music are about to take centre stage at London's O2 Arena for the Brit Awards.\nBut travel a bit further south to a seaside town in Dorset and you'll find musicians who could be vying for prizes in years to come - thanks to a new independent record company.\nAt a time when musicians can produce so much themselves, Burton Chapel Records co-founder Isra Rodriguez says the industry is shifting towards smaller labels.\nAnd as UK streaming reaches a record high and new challenges like artificial intelligence emerge, we look at what it takes to get on the music ladder.\nAt the heart of Burton Chapel Records is a church in Weymouth.\n\"On the ground floor we do the writing and recording and the equipment is upstairs and we've used it for recording videos,\" Isra explains.\n\"It's a cool set up and the sound is very different, very unique.\"\nIsra moved from Venezuela on an internship eight years ago and settled in the town after meeting his wife, Jasmine.\nLooking to pursue his love of music, he approached his church.\n\"They had this small chapel in Burton Road in Weymouth, which is where the name comes from.\"\nIsra started using the chapel, along with Callum Gaughran, now A&R director at the label, who he met through working in marketing.\n\"We would drive into the office together and listen to music and things fell together from there,\" he says.\nThe final piece of the puzzle was George Moir, an indie musician who has been on BBC Introducing's Live Lounge - and happens to be married to Jasmine's sister.\nHe had been approached by Sony and was signed with BMG, but when his contract ended the trio had an idea.\n\"There are artists who have been with a label and dropped, or their contract ends and they're in this sort of limbo,\" Isra explains.\nIt has now been a year since George signed with Burton Chapel Records and they are excited for the future, having signed three more artists.\n\"One of our dreams is to buy the chapel and turn that into our full time space,\" Isra adds.\nIsra looks after the label's day-to-day running, and thinks the industry is shifting towards independent labels.\n\"It would be very normal for a big label to offer a deal where they get 85% and the artist gets 15%, but we do the opposite - it's the artists getting more,\" he explains.\n\"I'd say we have an artist-first approach here, we give them more control.\"\nGeorge agrees and says, after coming from a bigger label, his successes now feel bigger.\n\"They're so hard won and it's a great feeling when you hit a streaming milestone, or hear one of the tracks on the radio,\" he adds.\n\"I feel a lot closer to the fans as well, I'm able to have my fingerprints all over everything.\"\nMark Lippmann's label, Scruff of the Neck in Manchester, began as a hobby - much like Burton Chapel Records.\nIt has since gone on to win a best small label award from the Association of Independent Music (AIB).\n\"It was always my passion and belief in the artists, my vision for what they could achieve,\" Mark explains.\n\"I always hustled to get results for them, whether that was meeting someone who could teach me and open doors, or ringing radio stations - I would always fight for the results.\"\nHaving spent years in the industry, he says it's \"tough and ever-evolving\".\nMark adds: \"With change comes opportunity and chances to innovate, which certainly can favour smaller more agile organisations.\"\nWith almost 200 billion audio streams in the UK last year, according to the BPI,, external streaming consumption has become a measure of success for artists.\nThe association's director of communications, Gennaro Castaldo, says: \"A lot of artists are doing their own thing, using the internet to build an audience, do their own gigs.\n\"But they might reach that tipping point, where they want to find a bigger audience - that's when a record company can help get the distribution.\"\nThe key, he says, is finding a niche: \"Anybody can make music, it's cutting through the noise is the big challenge.\n\"It might be you're into a particular style [of music] there's a real underground interest that wouldn't necessarily be for mainstream, but the artist has really passionate fans who will see them gig.\"\nAt Burton Chapel Records, the team is just getting started, but when it comes to a niche they want to remain focused on their artists.\nIsra continues: \"The big dream would be to get Weymouth into the music scene, there's a lot of talent here.\n\"Growing up, I always wanted to be able to live from the music.\n\"Seeing an artist growing in their career and knowing I helped make that happen, that's why I love doing this.\"", "url": "https://www.bbc.co.uk/news/articles/cddy965nlv3o"}