{"authors": ["David Cowan", "www.facebook.com"], "date_download": "2025-04-26 07:47:56", "date_modify": "2025-04-26 07:47:56", "date_publish": "2025-02-26 23:14:33", "description": "Abu Agila Masud Al-Marimi's trial was due to begin in Washington on 12 May.", "filename": "news_articles_cn4yy7zl8vpo_1745653676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8e0a/live/35e46740-f48a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4yy7zl8vpo_1745653676.html", "title": "Lockerbie bombing: Lawyers bid to postpone Masud trial in US", "title_page": "Lockerbie bombing: Lawyers bid to postpone Masud trial in US - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The trial of a Libyan suspect in the Lockerbie bombing, which was due to start in the United States in May, could be postponed following a request from the prosecution and defence.\nAbu Agila Masud Al-Marimi has been accused of making the bomb that brought down Pan Am 103 in 1988, causing the deaths of 270 people.\nHis trial was due to get under way in Washington on 12 May but the US government and the defence have asked for it to be called off meantime.\nReferred to as Masud by Scottish and American investigators, the Libyan is alleged to have confessed to making the device which exploded in the airliner's hold as it flew from London to New York.\nThe Libyan is in his seventies and has been receiving treatment for what's understood to be a non-life threatening health condition.\nIn December the District Court of the District of Columbia was told that Masud's health condition would cause a delay of 90-120 days.\nProsecutors say that based on \"additional information,\" it appear there will be \"additional delay.\"\nThe lawyers have asked for extra time to prepare a revised pretrial schedule and set a new starting date.\nThe US government is also continuing the process of providing the defence with copies of the material and evidence it plans to use at the trial.\nIf the trial judge grants the request, a status hearing on the case will be held next month.\nThe FBI says Masud was a Libyan intelligence agent who acted alongside Abdelbasset Al-Megrahi, his fellow countryman who was convicted of murdering the 270 victims after standing trial at a Scottish court in the Netherlands more than two decades ago.\nThe bomb was concealed in a radio cassette player in a Samsonite suitcase and then smuggled on board a flight from Malta on the morning of 21 December 1988.\nThe unaccompanied bag was transferred onto a Pan Am feeder flight from Frankfurt to London, where it was loaded onto Pan Am 103.\nMasud is said to have told a Libyan law enforcement official that the country's dictator Colonel Muammar Gaddafi later thanked him for carrying out \"a great national duty against the Americans\".\nThe confession is alleged to have been made in 2012 while Masud was in custody in Libya following the uprising against Gaddafi's regime.\nThe investigation into the Lockerbie bombing has always been a joint Scottish-American inquiry.\nProsecutors from the Crown Office and Procurator Fiscal Service and detectives from Police Scotland have been heavily involved in building the case against Masud.\nA Crown Office spokesperson said: \"We appreciate that the prospect of delay will be frustrating for those affected but we urge them not to feel disheartened.\n\"Scottish prosecutors have a long-standing commitment to pursuing those responsible for the bombing of Pan Am 103.\n\"We will move forward with unwavering determination and continue to support US authorities in the prosecution of Masud.\"", "url": "https://www.bbc.co.uk/news/articles/cn4yy7zl8vpo"}