{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 03:49:53", "date_modify": "2025-04-26 03:49:53", "date_publish": "2025-03-05 13:16:24", "description": "Simon Widdowson's brick-based Shannon class lifeboat design is being considered as Lego's next set.", "filename": "news_articles_ce8m3e6n526o_1745639393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7fa2/live/a8b80440-f9ba-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8m3e6n526o_1745639393.html", "title": "Lego RNLI lifeboat proposal supported by thousands", "title_page": "Lego RNLI lifeboat proposal supported by thousands - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Lego design of an RNLI lifeboat is being considered by the toy giant to become its newest set.\nThe proposal from amateur designer Simon Widdowson has received support from thousands of people.\nHe submitted his design for a brick-based version of a Shannon class lifeboat from the Poole-based charity through the company's Ideas Portal.\nThe website sees people from around the globe suggest new sets for production, with fans voting for their favourites.\nMr Widdowson, from Nottingham, said he created the submission to \"try and raise awareness, and hopefully donations\"\nHe said: \"Being in the Midlands and just about as far away from the coast as is possible in the UK, I needed to do something different.\n\"After supporting the RNLI for years, and using Lego as a way to relax and de-stress after tricky days at work, I wanted to combine the two.\"\nMr Widdowson's proposal sees the 13.6m (44ft7in) long and 4.5m (14ft9in) lifeboat, described by the RNLI as its \"most agile\", shrunk down to brick size.\nThe modular design features a crew cabin, a deck fitted with safety railings and a flying bridge - all in an orange and blue colour scheme.\nIt also includes a mobile slipway that can be used to carry and recover the lifeboat.\n\"When I submitted the project idea, reaching 10,000 supporters seemed like a pipe dream,\" Mr Widdowson said.\nHaving reached the vote milestone at the end of February, the proposal will enter a \"review stage\", beginning in May.\nIn a statement on the designs webpage, Lego said the project would now be \"examined\" by \"key team members\" including designers and product managers.\n\"We'll build concept models and determine if the concept meets our high standards for what it takes to be a Lego product,\" the Billund-based company said.\nIf the design were to reach mass-production, Mr Widdowson would be entitled to 1% of net sales - which he said he would donate to the RNLI.\nSteve Porter, RNLI Manufacturing Manager, said it had been \"great to see the support\" for Mr Widdowson's design.\n\"We know there are many RNLI supporters who would love to see this design brought to life,\" he added.", "url": "https://www.bbc.co.uk/news/articles/ce8m3e6n526o"}