{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:19:17", "date_modify": "2025-04-26 04:19:17", "date_publish": "2025-03-04 06:19:08", "description": "Councillors in Oldham are unhappy because a housing plan earmarks green belt land for development.", "filename": "news_articles_cx2g783znlzo_1745641157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dbf0/live/31e73130-f828-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2g783znlzo_1745641157.html", "title": "Council 'not exiting housing scheme', hints Rayner", "title_page": "Oldham Council 'not exiting housing scheme', hints Rayner - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Housing Secretary Angela Rayner has hinted that Oldham Council will not be pulling out of Greater Manchester's housing plan, even though it has submitted a request to do so.\nLast month the local authority voted to withdraw from the Places for Everyone, external (PfE) scheme after months of debate about building on green belt land and wrote to Rayner to request to be taken out of the scheme.\nThe PfE housing blueprint aims to build 170,000 homes - including 11,500 in Oldham - in all of Greater Manchester's 10 boroughs except Stockport.\nRayner said: \"I want [Oldham Council] to work with us... working together is how we will achieve housing we need across Oldham and across the whole of Greater Manchester.\"\nIn Oldham, the scheme drawn up by the Greater Manchester Combined Authority (GMCA) would see building on land in Beal Valley, Bottom Field Farm, Broadbent Moss, south of Coal Pit Lane, and south of Rosary Road.\nThe PfE has sparked controversy, however, due to the inclusion of green belt land and councillors voted 31-29 to opt out of the scheme.\nLabour, which lost overall control of the authority in last year's local elections, maintained it would be a mistake to withdraw from PfE.", "url": "https://www.bbc.co.uk/news/articles/cx2g783znlzo"}