{"authors": ["Laura May McMullan", "Alex McIntyre", "www.facebook.com"], "date_download": "2025-04-26 06:35:45", "date_modify": "2025-04-26 06:35:45", "date_publish": "2025-02-27 06:10:58", "description": "Members of Bentilee Volunteers urge more people to join and make use of the group's services.", "filename": "news_articles_c5y4en7yrypo_1745649345.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a57b/live/1f0b94c0-f46d-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y4en7yrypo_1745649345.html", "title": "'Stoke-on-Trent lunch club gives me something to look forward to'", "title_page": "'Stoke-on-Trent lunch club gives me something to look forward to' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A volunteer-run hub, which provides lunches, a youth club and furniture, has called for more residents to use it.\nBentilee Volunteers in Stoke-on-Trent has been going for 38 years with users and clients praising its services.\nOrganisers and members have called for more people on the Bentilee housing estate, home to 7,000 residents, to make use of the services.\nLunch club member Nancy Longshaw, 96, told BBC Midlands Today: \"It gives you something to look forward to. You get melancholy if you sit in the house too much.\"\nShe said: \"Everyone is so nice and you always have a laugh over something. It's lovely.\"\nVolunteer Kelly Heames said she had been going to the clubs at the group's Brackenfield Avenue base for the last 20 years and said it helped to get her out the house.\n\"With having anxiety and depression - I need to be out. I can't be sitting indoors so this is perfect for me,\" she added.\nThe hub mainly offers services to tackle loneliness and isolation with a lunch club on twice a week, a youth club four times a week and a group every Wednesday for adults with learning disabilities.\nLunch club organiser Lynne Marshall said many people who attend do not see anyone else for the whole week.\n\"They look forward to it so much and they're getting a healthy two-course meal. It's about community and getting together,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c5y4en7yrypo"}