{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:07:27", "date_modify": "2025-04-26 08:07:27", "date_publish": "2025-02-26 14:16:53", "description": "Michael Derek Cotterill, 82, is sentenced for serious sexual offences against children.", "filename": "news_articles_cjw24p5p6neo_1745654847.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ff7/live/af98d960-f447-11ef-837a-fdc1fd381948.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw24p5p6neo_1745654847.html", "title": "Man jailed for historic child sex offences", "title_page": "Man jailed for historic child sex offences in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man from Guernsey has been jailed for a total of eight years and 10 months for a number of serious sexual offences against children.\nMichael Derek Cotterill, 82, was found unanimously guilty in January of two counts of indecent assault, five counts of inciting a child to commit an act of gross indecency and one further count of common assault on a child.\nHe was sentenced at Guernsey's Royal Court on Tuesday.\nGuernsey Police has acknowledged the bravery and dedication of two women who came forward and reported their experiences.\nThe investigation opened in June 2022, when the police received a report from a woman in her 40s who said she was subjected to sexual abuse by him when aged between seven and nine.\nWhile gathering evidence and conducting inquiries for the case, the force received a further report from a second woman, also in her 40s, who informed officers she had also been sexually abused by Cotterill when she was 12-years-old.\nDet Ch Insp Julie Palmer said: \"No child should ever be subjected to this horrific abuse or have their innocence taken away from them in this way.\n\"I hope these convictions serve as an important message to people who have been victims of crimes such as these: if they come forward, regardless of when the offence occurred, we will relentlessly pursue offenders and do our best to bring justice for victims.\"", "url": "https://www.bbc.co.uk/news/articles/cjw24p5p6neo"}