{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:47:25", "date_modify": "2025-05-21 05:47:25", "date_publish": "2025-01-06 00:00:00", "description": "Emergency services rescue people from submerged cars and inundated homes as floods and snow force roads, railways and schools to close.", "filename": "news_live_c0rne11nxkgt_1747806445.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c0rne11nxkgt_1747806445.html", "title": "Dozens rescued and major incidents declared as UK grapples with floods, snow and ice", "title_page": "Dozens rescued and major incidents declared as UK grapples with floods, snow and ice - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hunker down for another night of bad weather\nImogen James\nLive reporter\nSitting in my London flat, writing about snow days has filled me with some envy as I report on the weather.\nIt's been drab and cold here, but no signs of the extreme weather I've been writing about.\nThere's been snow across Scotland and northern England causing travel chaos, power cuts and many closed schools.\nHeavy flooding elsewhere has seen two major incidents declared and 50 primary school children rescued from a school.\nAnd as we head into another night, there are three active Met Office yellow weather warnings for snow and ice blanketing much of the UK.\nWherever you are, stay safe. We've got this article with more about today's events, and what to expect tomorrow.\nWe're ending our live coverage now, thanks for joining us.\nYour editors today were Rorey Bosotti, Jacqueline Howard and Owen Amos.\nYour writers were myself, Seher Asaf, Thomas Mackintosh, Nabiha Ahmed, Ben Hatton and Ian Aikman.\nGovernment to 'refresh' approach flood defences funding\nThe government is planning to \"refresh\" its approach to funding flood defences to make sure \"challenges facing businesses and rural and coastal communities\" are kept in mind, the environment minister has said.\nSpeaking in the Commons earlier, Emma Hardy said a review of the existing flood funding formula will start this year, with the aim of bringing in a new approach from April 2026.\nShe added: \"Flood defence integrity is at its lowest since 2009/10, with approximately 60,000 properties less well protected than if flood defences were at an optimal condition.\n\"This is why we're investing £2.4 billion over the next two years to build and maintain flood defences.\"\nFire chief in Leicestershire warns residents to stay out of floodwater\nJudi Beresford, the assistant chief fire and rescue officer at Leicestershire Fire and Rescue Service says the situation has \"calmed down a little bit\" from a fire and rescue point of view, but dreadful conditions still exist.\nShe tells the BBC News channel that floodwater is really difficult to predict as water can rise at a tremendous pace, warning residents to stay out of the water and not to drive.\n\"You may think you know an area, but you really don't, particularly when it's under water,\" she says.\n\"If you need to get sandbags, contact your local council. If you get stuck in water, dial 999.\"\nA look ahead: Temperatures dropping widely below freezing overnight\nElizabeth Rizzini\nLead Weather Presenter\nTonight the weather will feel quieter, as the area of low pressure which gave us the snow and rain this morning has cleared eastwards, but it leaves behind it some very cold air and some wintry showers.\nThere will be a widespread frost with temperatures dropping widely below freezing and the risk of ice almost anywhere, not just within the warning areas, but also further east where there has been snowmelt and the ground is still wet from recent rain.\nThere are various warnings in force for snow and ice issued by the Met Office.\nThere’s a warning for Wales, north-west England and parts of south-west and central southern England valid until 10am tomorrow morning. There will be further wintry showers blowing in on a north-westerly wind through the evening and overnight period. These showers could be frequent and fall as sleet or snow especially over the high ground where there could be some accumulations.\nAnother snow and ice warning has been issued for Norther Ireland with possibly 5cm of snow over the Sperrins. This warning is valid until 11:00 tomorrow\nAnother warning for snow and ice covers northern and western Scotland until 11:00. Again there will be wintry showers with accumulations of 5-10cm over 200m.\nThere will be further sporadic wintry showers in the same sort of areas tomorrow but for many it will be dry with some sunshine but just very cold with temperatures no higher than mid-single figures.\nThere is a separate warning in place for possible snow across southern counties of England on Wednesday valid from 09:00 until midnight which could be disruptive and produce as much as 2-5cm of snow fairly widely. At the moment though the forecast for this remains uncertain.\nFifty children rescued from Lincolnshire school\nEarlier we reported that a group of children were trapped in a primary school in Lincolnshire following severe weather.\nWe can now bring you the news that they have been rescued by volunteers and reunited with their parents.\nRescuers, in 4x4 vehicles, drove through flooded roads to take the more than 50 children home, after their school was cut off by water.\nDave Lynch, from Lincolnshire Fire and Rescue, told BBC Radio Lincolnshire that the children \"had a great adventure, and they’re back with their parents now and safe\".\n\"We were flooded with volunteers who served the community across Lincolnshire. They have been fantastic we have successfully got all the kids out.\"\nChildren trapped in Lincolnshire school\nA group of children are trapped in a primary school in Edenham, as emergency services work to get them out, the Lincolnshire Resilience Forum says.\nIn a post on X, it says that the children are \"safe and well\".\nThe Lincolnshire Community Assistance Team adds that they are trapped due to \"major flooding on the main road.\"\nIt isn't clear how many children are trapped, but the assistance team adds that responders are on scene.\nAs we reported earlier, a major incident has been declared in Lincolnshire due to severe flooding.\n'They got to me at just the nick of time' - woman rescued from submerged car\nA little while ago, we shared dramatic footage from Leicestershire, showing a woman being pulled out of a submerged car.\nThe video shows Cimi Kazazi wade through waist-high water in the village of Great Glen, Leicestershire, before carrying the woman out of the car to safety.\nKazazi, owner of The Italian Greyhound restaurant, says he \"didn't think twice\" about going to the aid of the driver, who had become stuck outside his venue at about 07:00 on Monday.\nHe says he took the woman inside his restaurant so she could dry off and recover.\nThe woman, who asked to remain anonymous, adds: \"I have never been in a situation like this before. I was getting freezing and feeling very dizzy.\n\"They got to me at just the nick of time.\"\nShe says people \"have been so supportive. Without them I would have been in hospital.\n\"I can't thank them enough. They have been so wonderful.\"\nLeicestershire Fire and Rescue Service has declared a major incident in response to widespread flooding across Leicester, Leicestershire and Rutland.\nMan stranded in Coventry floodwater\nChloe Hughes\nBBC News\nJohn Mcmellion from Stourport says he has been left stranded without food or drink in floodwater, after his company van broke down.\nHe says he came to a halt on Balsall Street, Coventry, after another car drove through the water opposite him and flooded his engine.\n“I’m in a transit van and it’s up to the door,” he tells BBC Radio CWR.\n“The police have been out to see me and say they can’t do anything about it.\"\nHe adds that the company that own the van said they could not help until the water had subsided.\n“I didn’t pick a coat up today, I wasn't expecting to be stuck anywhere.\"\nDescribing the scene around him, he says: \"I’ve got the River Blythe on my left that I can see is flowing quite freely, and then I’ve got fields on my right with big puddles on, and water just flowing straight off it.\n\"If I actually knew the county well I might’ve chosen a different road.\"\nThe weather warnings about to come into force\nThis afternoon, a fresh spate of weather warnings from the Met Office, the UK's national meteorological service, will kick in.\nIn Scotland, a yellow warning for snow and ice is in place for the west coast, Highlands, the Outer and Inner Hebrides, Orkney, Shetland, Aberdeenshire and Moray.\nThat warning has just begun in the last few minutes and remains in place until midday on Tuesday.\nFrom 17:00, most of Wales, Manchester, the west Midlands and south- and north-west England also face a yellow snow and ice warning. It's in effect until 10:00 on Tuesday.\nThe entirety of Northern Ireland has been under a yellow snow and ice warning from 15:00, lasting until 11:00 on Tuesday.\nMore rescued during major incident in Leicestershire and Rutland\nAs we mentioned in the post below, Lincolnshire has now become the second county to declare a major incident due to heavy flooding after Leicester earlier today.\nFifty-six people have been rescued by emergency services across Leicestershire and Rutland after Leicestershire Fire and Rescue Service received more than 200 calls since the morning.\nCrews have been on the scene for incidents including car flooding, evacuating homes and rising water levels. People are advised to avoid flooded routes and floodwater.\nLeicestershire County Council says it had \"flood gangs\" attending more than 80 sites across the county to assess and put up road closures.\nLeicestershire Police adds the most severely affected areas included Melton, the south of the county and Rutland.\nMajor incident as 56 people rescued from floods", "url": "https://www.bbc.com/news/live/c0rne11nxkgt"}