{"authors": ["Brandon Drenon", "www.facebook.com"], "date_download": "2025-04-26 03:38:13", "date_modify": "2025-04-26 03:38:13", "date_publish": "2025-03-05 01:18:21", "description": "Prosecutors accuse some officers at the youth detention centre of acting as 'referees' as dozens of fights ensued.", "filename": "news_articles_czxneppzvxzo_1745638693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c295/live/b25a44b0-f968-11ef-9d88-a5d67799b762.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czxneppzvxzo_1745638693.html", "title": "Officers charged in 'Gladiator fights' in youth detention centre", "title_page": "Officers charged in 'Gladiator fights' in youth detention centre  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thirty officers have been charged in connection with 'gladiator fights' they sometimes 'encouraged' inside a California youth detention centre, the state's attorney general said.\nCharges against them include child endangerment and abuse, conspiracy, and battery, attorney general Rob Bonta's office announced in a press release on Monday.\nOfficials tallied 69 fights at Los Padrinos Juvenile Hall in Downey, California, from July to December 2023.\nAn investigation into the brawls began after footage from one of the fights was leaked, leading officials to find 143 victims involved, ranging from 12 to 18 years old.\nTwenty-two of the 30 officers charged were arraigned on Monday, meaning they formally faced their charges in court.\nThe other eight officers are scheduled to be arraigned in April.\n\"Officers at Los Padrinos Juvenile Hall have a duty to ensure the safety and well-being of those under their care,\" Mr Bonta said in the press release.\nInstead, he continued, the officers charged were \"overseeing 'gladiator fights' when they should have intervened\".\nThe fights at the youth centre resulted in physical harm to the teens, according to the press release.\nThe leaked video footage - published by the Los Angeles Times in April - shows a teen falling to the ground after sustaining punches and kicks from multiple others.\nThe video shows officers inside standing nearby and watching, and they appear to occasionally laugh and shake hands with the assailants as the fights continue.\n\"Watching the video, the officers look more like referees or audience members at a prizefight, not adults charged with the care and supervision of young people,\" Mr Bonta said at a press conference on Monday.\n\"The officers don't step in, don't intervene and don't protect their charges.\"\nThe LA County Probation Department, which runs Los Padrinos, said in a statement that it \"fully supports and applauds\" the attorney general's office for the indictments.\nThe department also said that all officers involved are on leave without pay.\n\"Our department sought the assistance of law enforcement authorities when misconduct was discovered,\" the statement said.\n\"Since then, we have fully collaborated with our law enforcement partners.\nAt least two of the teens involved have retained a lawyer with plans to sue the county, according to the New York Times.\nOne of the two teens was seen being attacked in the video footage, aged 16 at the time, said the teen's lawyer, Jamal Tooson.\nMr Tooson said the other teen he represents was attacked three times in one day at the facility, leaving the client unconscious and with traumatic brain injury.", "url": "https://www.bbc.co.uk/news/articles/czxneppzvxzo"}