{"authors": ["Jennifer Hughes", "Sean Dunderdale", "www.facebook.com"], "date_download": "2025-04-26 04:05:08", "date_modify": "2025-04-26 04:05:08", "date_publish": "2025-03-03 18:08:27", "description": "Shane says enthusiasts are walking through his fields to get a better view of military jets.", "filename": "news_articles_clyddqqgnwqo_1745640308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1998/live/d2b29380-f4f8-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyddqqgnwqo_1745640308.html", "title": "Farmer urges RAF Waddington plane spotters to 'keep off my crops'", "title_page": "Farmer urges RAF Waddington plane spotters to 'keep off my crops' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A farmer with land next to an RAF base has urged plane spotters to stop trampling through his crops.\nEnthusiasts have flocked to RAF Waddington for Exercise Cobra Warrior, a major military exercise which started on 24 February and ends on 14 March.\nBut farmer Shane said some were \"breaking through fences\" and walking through his fields to get a better view of the aircraft.\nRAF Waddington said it was \"disappointed\" and asked people to \"refrain from trespassing on private farmland.\"\nShane said: \"Everyone's got a right to watch the planes but it becomes a problem when they're breaking through fences for it.\"\nThe farmer said people walking through fields could ruin crops and \"hold us up from doing our jobs\".\n\"Our crops are our money so if everybody could keep to the footpaths that'd be fantastic,\" he said.\nShane added he would make footpaths as accessible as he could, but said it was a \"vicious cycle\" when that attracted more people on to his land.\n\"The local people are normally very respectful so it'd just be nice if everyone did what we're asking them to do.\"\n\"Enjoy the countryside and the planes, but be respectful\", he added.\nA spokesperson from RAF Waddington said: \"We are disappointed to hear of the problems encountered by one of our neighbours.\n\"We understand that many aviation enthusiasts look forward to viewing the visiting aircraft during exercises such as Cobra Warrior and always encourage members of the public to use the Waddington Aircraft Viewing Enclosure which provides a safe and designated space to enjoy aircraft activity at RAF Waddington.\n\"We would also like to reiterate to anyone thinking about visiting the area to be respectful of our neighbours and to refrain from trespassing on private farmland.\"", "url": "https://www.bbc.co.uk/news/articles/clyddqqgnwqo"}