{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:56:25", "date_modify": "2025-04-26 03:56:25", "date_publish": "2025-03-04 15:09:52", "description": "A 17-year-old, accused of murdering a man in Bourne, has given evidence at Lincoln Crown Court.", "filename": "news_articles_cly381x5g8eo_1745639785.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c34/live/d20964a0-f8fd-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly381x5g8eo_1745639785.html", "title": "Teenager claims machete was only a 'deterrent'", "title_page": "Teenager claims machete was only a 'deterrent' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A youth accused of taking a machete to the scene of a murder told Lincoln Crown Court it was only going to be used as a deterrent.\nThe 17-year-old, who cannot be named because of his age, took the weapon to Wellhead Park in Bourne on 26 June last year where Kyle Marshall, 37, suffered stab wounds and bled to death.\nThe court previously heard there had been a disagreement between the two defendants and members of Mr Marshall's family which led to a confrontation.\nReece Bruns, 20, of St Paul's Gardens, Bourne, and the youth both deny the murder of Mr Marshall and a second charge of possessing a bladed article in public.\nThe youth told the court he thought the machete, which he had bought three months prior to Mr Marshall's death, would only be used as a deterrent on the night of the attack.\n\"I never bought it to use for an offence,\" the youth insisted.\nJurors were shown social media footage of the youth displaying the machete and a folding knife on his bed.\nThe youth told the prosecution he found the machete \"appealing\" and \"cool\" but denied he was showing off by sending the videos to friends.\nHe admitted taking the machete from his home on the night of Mr Marshall's death but denied removing a folding knife from his bedroom.\nAsked why he did not leave the park when he heard Mr Marshall was coming, the youth replied: \"I don't know.\"\nHe added: \"Kyle knew where I lived.\"\nMr Bruns has denied deliberately stabbing Mr Marshall with the machete and said he was \"scared for his life\" after being threatened by the older man.\nJurors heard Mr Marshall died at the scene after suffering a stab wound to the heart.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/cly381x5g8eo"}