{"authors": ["Ethan Davies", "www.facebook.com"], "date_download": "2025-04-26 06:33:48", "date_modify": "2025-04-26 06:33:48", "date_publish": "2025-02-27 06:32:26", "description": "The busy Mancunian Way in Manchester is set to shut overnight for four weeks in March.", "filename": "news_articles_c86p3xev6q0o_1745649228.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f419/live/391f1c80-f461-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86p3xev6q0o_1745649228.html", "title": "Mancunian Way: Major road to shut overnight in March for resurfacing", "title_page": "Mancunian Way: Major road to shut overnight in March for resurfacing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Drivers could face traffic disruption as a busy city centre road in Manchester is set to close overnight for weeks as part of a resurfacing project.\nWork on the Mancunian Way will begin on Monday, starting with the eastbound section of the road.\nThe route will be shut to traffic overnight from 19:00 to 05:00 between 3 and 14 March, and then again between 17 and 28 March, Manchester City Council said.\nCouncillor Tracey Rawlins said the works were taking place overnight to limit disruption, but added people should plan their journeys ahead and allow more travel time.\nBuilt in 1976, the Mancunian Way is an elevated motorway that runs along the south of the city and forms part of the Manchester and Salford Inner Ring Road.\nAn estimated 15 million journeys take place along the route each year, and the resurfacing was \"vital\" maintenance for the busy route, a council spokesperson said.\nWork on the eastbound section will extend from River Street to Fairfield Street, in the direction of Ashton Old Road, and the road will shut between 19:00 and 05:00.\nIn the second phase, the westbound section will be resurfaced in the direction of Regent Road, closing overnight during the same times between 17 and 28 March.\nOn weekends the road will be fully open, and work will not take place on Europa League fixture dates.\nAcross the project, closure times will be pushed back to 19:30 on the evenings of 7, 10, 14, and 17 March due to events in the city.\nRawlins said: \"One of the big issues that people have raised with us is that many of our key roads are no longer at the standard they, or we, expect.\n\"This is why over the coming months the council is working to get roads resurfaced as quickly as we can, delivering benefits for motorists and prioritising the needs of our residents.\"", "url": "https://www.bbc.co.uk/news/articles/c86p3xev6q0o"}