{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 07:46:54", "date_modify": "2025-04-26 07:46:54", "date_publish": "2025-02-27 00:00:25", "description": "The actress's career has enjoyed a recent resurgence thanks to a role in the film The Last Showgirl.", "filename": "news_articles_cn4z410dk2ko_1745653614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b9e/live/356546e0-f142-11ef-b121-f964740b4dec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4z410dk2ko_1745653614.html", "title": "Pamela Anderson on missing out on the Oscars", "title_page": "Pamela Anderson on missing out on the Oscars - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pamela Anderson has had her fair share of ups and downs over her career.\nSo that might explain why she's so stoic about missing out on an Oscar nomination for her role in The Last Showgirl.\n“The win is the work,” the Canadian actress told BBC News.\n“You couldn't have told me I'd be here a decade ago, so this is very exciting for me, to even be in the conversation.”\nAnderson, 57, did manage to score nominations at the Golden Globes and Screen Actors Guild Awards for her part in Gia Coppola’s film about a fading Las Vegas dancer.\nBut she is not in the running for the Academy Awards, which take place this Sunday in Los Angeles.\n“I just wish everybody well,” she said.\n“I think anybody, any actor, realises that all of this is about having another chance to be able to perform and share your talent with the world.”\nAnderson rose to prominence on the 1990s TV series Baywatch.\nThe lifeguard drama became the most-watched television show in the world at the time, and it's still the role she's best known for.\nBut in the three decades since she first ran along the California beaches, fans and critics have become acquainted with different parts of Anderson's life story including Playboy covers, a leaked sex tape and many marriages.\nIn 2022, Hulu series Pam & Tommy told the story of how Anderson and now ex-husband Tommy Lee's sex tape was stolen and illegally distributed in the mid-90s.\nAnderson later criticised the series in an interview with Variety, external, describing it as \"shocking\" and calling for the people behind it to apologise to her.\nNow, she's starring in a new film which is also about second chances.\nIn The Last Showgirl, the lead character Shelly, played by Anderson, must plan for her future after her show abruptly closes.\nPlenty of critics have drawn parallels with Anderson’s own life in the spotlight, and she doesn't dispute this.\n“I think that’s what drew me to the project, that it was so relatable on so many levels,” Anderson said of the film.\nShe added that its central theme, of struggling to make your career work as a woman in later middle age, was something \"many generations of women\" had faced.\nIn the film, Shelly is portrayed as having a strained relationship with her daughter Hannah.\nShelly's career as a showgirl means she often works late, causing her to miss important moments like bedtime with Hannah.\nThat, too, is something that Anderson says she can relate to.\nShe shares two sons, Brandon Thomas, 28, and Dylan Jagger, 27, with her ex-husband, Mötley Crüe drummer Tommy Lee.\nShe said that for all working mums, there's \"no proper way\" to be a parent while also following your dreams and pursuing your career.\n“So this movie is, I think, in a very vulnerable space.\n“And it was an interesting role to play with all her imperfections and selfishness and selflessness. And it was a lot of layers and nuances to the character that I could really relate to.”\nThe Last Showgirl has received a mixed reception from critics, though most have praised Anderson's performance.\nThe New York Times called it, external \"sensitive and beguiling\" and described Anderson as \"dazzling\". But the Guardian, external awarded it just one star, calling it \"a big disappointment\" (although a later review bumped that up to three stars, external).\nMany have also described the role as Anderson's \"comeback\". She doesn't reject the term, but says she prefers to see it as \"a new chapter\".\n\"I've always been fascinated with the craft of acting,\" she said. \"[But] my personal life kind of took me off course, and I raised two beautiful boys.\"\nShe's not the only actress to be back in the spotlight this season.\nDemi Moore is nominated for best actress at the Oscars for her role in The Substance, a body horror which has revitalised her career.\n\"I'm really happy for Demi,\" Anderson said. \"I think she's earned her place. And you have to earn it. You have to fight for it.\"\nWith so many strong female protagonists in this year's films, I'm curious what Anderson now thinks of Baywatch.\nThe show has long been criticised for its portrayal of its female characters, who, many argued, were sexualised and denied meaningful plot lines.\n\"I didn't see it like that at all. I thought it was quite innocent and wholesome and, and fun to watch,\" she said.\n\"I always felt like I was surrounded by such incredible people, lifeguards that were also firemen or firewomen. It was really, really, empowering.\"\nAnderson has always been seen to embody a look that rose to prominence in the 90s - skinny, blonde, and enhanced by plastic surgery.\nBut in recent years, she has been sporting a \"no-makeup\" look, choosing instead to embrace her natural appearance.\n\"My beauty routine is rest. And so that's more important to me these days,\" she told me.\nShe said it's not that she's against makeup, but more that she thinks \"there's a time and a place\" for it.\n\"This chapter, for me, has been about self-acceptance and finding out who I am. What are my original thoughts? What do I have to give?\" she said.\n\"I know I have a lot more to give in this world, in this industry too, and I feel like even I have to remember who I am to start with and then hopefully, play characters in films and not in my personal life.\"", "url": "https://www.bbc.co.uk/news/articles/cn4z410dk2ko"}