{"authors": ["Christian Fuller", "www.facebook.com"], "date_download": "2025-04-26 06:39:58", "date_modify": "2025-04-26 06:39:58", "date_publish": "2025-03-02 15:08:51", "description": "Southern Water says the service has helped avoid more than 10,000 unnecessary visits by engineers.", "filename": "news_articles_c1en6l3pjxzo_1745649598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d01b/live/b03250a0-f770-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1en6l3pjxzo_1745649598.html", "title": "Virtual inspector cutting callouts, says water firm", "title_page": "Southern Water: Virtual inspector cutting callouts, says water firm - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A virtual inspector initiative has helped cut more than 10,000 unnecessary callouts by engineers, Southern Water has said.\nOver the last year, specialists based in Worthing, West Sussex, have provided advice online or on the phone on how to cope with practical concerns about its services.\nCommon issues have included problems with water pipes and leaks and assistance in isolating and switching off water supplies, Southern Water said.\nThe firm provides water services to millions of customers across Kent, East and West Sussex, Hampshire and the Isle of Wight.\nIf a customer reports a leak in their home, the virtual inspector service can explain how to close the stop tap before the arrival of an engineer, said the water company.\nThe virtual system also may raise a work request to replace defective equipment directly to the contractor, bypassing the need for an in-person visit, it said.\nLed by Mary Penn, the service has been able to resolve about 90% of jobs, the firm added.\nSouthern Water said the service has saved about 750 days of inspector time across the past 12 months.\n\"We trialled the virtual team around a year ago and it has proved to be a big success, said Ms Penn, adding: \"Since then, we've saved more than 10,000 network site visits.\"\nShe said not all jobs could be handled remotely and the company would still \"rely heavily on the 70 network inspectors out in the field when we need a hands-on approach\".\n\"But this new system, said Ms Penn, \"is making sure our customers receive the right support each time.\"", "url": "https://www.bbc.co.uk/news/articles/c1en6l3pjxzo"}