{"authors": ["Dominic Casciani", "Adam Hale", "www.facebook.com"], "date_download": "2025-04-26 03:46:51", "date_modify": "2025-04-26 03:46:51", "date_publish": "2025-03-05 03:03:33", "description": "The announcement of new support for courts comes as two reports warn the justice system is struggling.", "filename": "news_articles_cn89656e01do_1745639211.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/061c/live/883cdbd0-f9a3-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn89656e01do_1745639211.html", "title": "More funding for judges to tackle record court delays", "title_page": "More funding for judges to tackle record court delays - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ministers have pledged to increase the number of days funded for judges hearing criminal cases in an attempt to cut unprecedented backlogs and delays in Crown Courts in England and Wales.\nThe Ministry of Justice's announcement follows two highly critical reports which found victims of crime were being failed.\nVictims Commissioner Baroness Newlove said some victims were so traumatised by delays they had resorted to drugs, alcohol and self-harm.\nThe funding boosts the total number of sitting days for judges to 110,000 in the new financial year, up from 108,000. But the justice secretary has admitted it is still not enough to handle the record backlog in the courts.\nThere are currently 73,000 unresolved prosecutions, and this number is expected to rise, said Shabana Mahmood.\nSuspects being charged with new offences are regularly told there might not be a trial until 2027, and some courts are already looking for diary space in 2028.\nThe delays - which have been caused by a combination of cuts to courts, the pandemic and then a barristers' strike over pay - have also led to a record 17,000 defendants being held on remand, taking up one-fifth of spaces in the crisis-ridden jails.\nLast November, Baroness Sue Carr, the Lady Chief Justice, told Parliament there needed to be more days given to judges and she had enough judges available to sit for 113,000 days a year in court.\nShe said a cap on sitting days had a \"drastic effect\", with her local leaders having to reschedule cases and cancel work given to part-time judges, who are critical to clearing the backlog.\nA review into how to speed up the criminal courts is ongoing. Mahmood on Wednesday said the increase to the new level in sitting days was \"unprecedented\", but said it would still not be enough to fix the problem.\n\"The sheer number of cases coming into the system means that the demand is very high and the backlog, without further policy change, is still going to rise,\" she told the Today programme.\n\"We are determined to deliver swifter justice for victims, far too many of whom are paying the price for these delays in our courts,\" she added.\nBut two reports have raised questions about how quickly the government is acting.\nVictims Commissioner Baroness Newlove said in a report published on Tuesday that justice felt \"out of reach\" for many victims, which was causing extra trauma.\nOne woman, who had suffered sexual abuse, tried to take her own life after the trial of her attacker was put back.\nBaroness Newlove urged the government to reverse a planned cut of around 4% to crucial victim support services, which she warned were under \"immense pressure\" because delays meant they are dealing with more clients than ever.\n\"With funding cuts looming, we face the very real threat of reduced support,\" she said.\n\"I fear this will drive some victims to give up on seeking justice altogether - a second injustice compounding the first.\"\nSeparately, Parliament's Public Accounts Committee said it was concerned that the MoJ had \"accepted\" court delays getting worse until recommendations from the major review into reforming the courts, led by retired judge Sir Brian Leveson, were implemented.\nThe report said that the courts could not keep up with the rate of new cases arriving at their doors.\nSir Geoffrey Clifton-Brown, the committee's chair, said: \"Our report is a terrible indictment of our criminal justice system and the government urgently need to reorganise it to aspire to that world-class standard for which the UK used to be renowned.\"\nMary Prior KC, chair of the Criminal Bar Association, which represents barristers, said that 110,000 sitting days was the minimum that had been needed since 2022.\n\"We welcome these additional sitting days... but to do our collective best to reduce the backlog we must ask for uncapped sitting days in the Crown Court for at least the next five years.\"\nJoanna Hardy-Susskind, a defence barrister and host of BBC Radio 4 justice series You Do Not Have to Say Anything, said the extra sitting days would only go so far to improve a system where the length of \"queues for justice\" were \"unacceptable\".\n\"This is a lifeboat, and it will help a little - but not for long,\" she told the BBC's Today programme.\nShe added that the state of courtrooms were in \"a pretty dire way\", and funding was also needed for upkeep.\n\"There's not much point in opening courtrooms if I'm sitting there and the ceiling is leaking on my wig - if juror number four is sitting there in a hat and scarf because they're freezing and concentrate on a murder trial or on a rape trial,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cn89656e01do"}