{"authors": ["Vanessa Buschschlüter", "Ione Wells", "www.facebook.com"], "date_download": "2025-04-26 07:36:15", "date_modify": "2025-04-26 07:36:15", "date_publish": "2025-02-27 14:40:11", "description": "The US president said Venezuela had not lived up to its promises on taking back deported migrants.", "filename": "news_articles_c62zzv02r3vo_1745652975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6fad/live/92d0e0f0-f50c-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzv02r3vo_1745652975.html", "title": "Trump cancels oil deal in major blow to Venezuela", "title_page": "Trump cancels oil deal in major blow to Venezuela - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump says he will revoke a licence which allowed Venezuela to export some of its oil to the US despite sanctions.\nThe move is a major blow to the Venezuelan government as the licence provided it, through joint ventures between the state-run oil company and US oil giant Chevron, with a crucial income in dollars.\nTrump said he was revoking the licence - which gave Chevron permission to operate in Venezuela - because the government of Nicolás Maduro had failed to meet \"electoral conditions\" and had not transported \"violent criminals\" deported from the US at a quick enough pace.\nVenezuela called the decision \"damaging\" and said it could increase migration to the US.\nTrump made the announcement on Truth Social, writing that he was \"hereby reversing the concessions that Crooked Joe Biden gave to Nicolás Maduro, of Venezuela, on the oil transaction agreement, dated November 26, 2022\".\nHe did not clarify which concessions he was referring to, but the only licence related to Venezuela granted that day was the one issued by the US treasury authorising Chevron to \"resume limited natural resource extraction operations in Venezuela\".\nThe licence allowed Chevron to operate joint ventures with Venezuela's state-controlled oil company PDVSA, but barred the US company from paying \"any taxes or royalties to the Government of Venezuela\".\nChevron's spokesman Bill Turenne said in a statement on Wednesday that \"Chevron conducts its business in Venezuela in compliance with all laws and regulations, including the sanctions framework provided by US government\".\nIn a recent interview with the Financial Times newspaper, Chevron Chief Executive Mike Wirth argued that if Chevron was forced to pull out of Venezuela, it would allow companies from China and Russia to increase their presence and influence there.\nHe also warned that Venezuela's economy could suffer more if Chevron left the country, which could drive further migration to the US.\nThe Venezuelan opposition, on the other hand, has in the past argued for the licence to be revoked, arguing that it provides the Maduro government with \"a financial lifeline\".\nThe licence was granted in 2022 by the Biden Administration in an attempt to entice the Maduro government to allow free and fair elections.\nIt remained in place even after Venezuela's government-aligned electoral council declared Maduro the winner of the presidential election in July 2024 - a result which has been refuted by the opposition and by a number of countries, including the US, which have recognised Maduro's rival as the legitimate winner instead.\nPresident Trump's announcement came less than a month after his envoy, Richard Grenell, met with Nicolás Maduro in Caracas.\nDuring his visit, Grenell secured the release of six US citizens who had been held in Venezuela, as well as a deal under which the Maduro government sent planes to the US to fetch deported Venezuelans.\nIn his Truth Social post, Trump said \"the regime has not been transporting the violent criminals that they sent into our Country (the Good Ole' U.S.A.) back to Venezuela at the rapid pace that they had agreed to\".\nHe added he was \"therefore ordering that the ineffective and unmet Biden 'Concession Agreement' be terminated\" as of 1 March.\nVenezuelan Vice-President Delcy Rodríguez warned that US sanctions had in the past led to an increase of Venezuelans migrating to the US and that this was likely to happen again.\nStopping undocumented migration has been one of Trump's main priorities since taking office.\nThe announcement had a swift effect on oil prices, which rose more than 1% on Thursday.", "url": "https://www.bbc.co.uk/news/articles/c62zzv02r3vo"}