{"authors": ["Alice Smith", "www.facebook.com"], "date_download": "2025-04-26 04:25:39", "date_modify": "2025-04-26 04:25:39", "date_publish": "2025-03-03 12:03:25", "description": "The town's community hospital is moving on a trial basis to help avoid closures.", "filename": "news_articles_cr728r44y97o_1745641539.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6718/live/4fbf4e50-f5e8-11ef-86a6-15c2bb2c0119.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr728r44y97o_1745641539.html", "title": "Burnham-on-Sea minor injuries unit to move on trial basis", "title_page": "Burnham-on-Sea minor injuries unit to move on trial basis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A minor injuries unit is being relocated to a medical centre on a trial basis in an effort to improve its resilience and reduce unplanned closures.\nAs first reported by Burnham-on-Sea.com, external, the town's community hospital will be moved to nearby Burnham Medical Centre over the coming weeks.\nThe unit in Love Lane has \"experienced a number of short-term, short notice closures\" recently due to staff shortages, health bosses have said.\nAndy Heron, chief operating officer at Somerset NHS Foundation Trust, said maintaining the minor injury unit is \"vital\".\nHe said the unit helps give patients the right support, frees up emergency departments and allows staff to prioritise people with the most serious health conditions.\n\"We're very committed to the teams and services that run the minor injuries unit in Burnham-on-Sea and we know how important these are for local communities,\" Mr Heron said.\n\"We are working with our primary and secondary care teams to consider different ways to deliver a more integrated and resilient same-day urgent care service for local people.\"\nThe service will be open seven days a week from 10:00 to 18:00 GMT for residents.\nMr Heron added: \"Over the coming weeks, our teams will continue to work through the detail of this proposal, and we will update our teams, local people and partners\".", "url": "https://www.bbc.co.uk/news/articles/cr728r44y97o"}