{"authors": ["Brian Farmer", "www.facebook.com"], "date_download": "2025-04-26 04:00:06", "date_modify": "2025-04-26 04:00:06", "date_publish": "2025-03-04 05:28:21", "description": "A legal centre criticises legal action taken by a university that has faced pro-Palestinian protests.", "filename": "news_articles_c3vw5r1x74xo_1745640006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b77c/live/6a1bd820-f7ac-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vw5r1x74xo_1745640006.html", "title": "University of Cambridge Gaza injunction bid worries legal centre", "title_page": "University of Cambridge Gaza injunction bid worries legal centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A legal organisation that offers help to rights campaigners has criticised the University of Cambridge's attempts to prevent protesters causing disruptions.\nLast week, a High Court judge granted an injunction, applied for by the university, aimed at preventing pro-Palestinian demonstrators from disrupting a graduation ceremony.\nThe European Legal Support Centre (ELSC), external has said the injunction the university sought was \"broader\" than comparable orders and would prohibit a \"wide array of conduct\".\nThe university has said any claim that it was trying to \"restrict protest\" was \"ridiculous\".\nLawyers representing the university made the application in the wake of protests in Cambridge following the outbreak of the current conflict in Gaza between Israel and Hamas following the latter's killing of 1,200 people across the border in Israel and the taking of 250 Israeli hostages on 7 October 2023.\nPro-Palestinian campaigners alleged the university had not acted on previous agreements to review investments concerning the arms industry.\nThe university said in response that it was committed to reviewing its \"approach to responsible investment\".\nELSC appointed representation and wrote to Mr Justice Fordham to share its concerns about wider injunctions and he agreed it could \"intervene\" in the litigation.\nGrant Kynaston, barrister for ELSC, said it had only become aware of the university's injunction two days before Thursday's High Court hearing in London.\nIn the ELSC's written argument, Mr Kynaston said the \"scope\" of the order the world-renowned university wanted was \"broader than any comparable newcomer injunction in the university protest context\".\n\"It would potentially affect all those who manifest any speech action or belief 'connected with the Palestine-Israel conflict', whether or not in the context of protest,\" he argued.\n\"It would cover highly symbolic properties in the heart of the University of Cambridge. It would prohibit a wide array of conduct, all of which is said to somehow ground a claim in trespass or nuisance.\"\nHe added that \"severe human rights and equality implications\" were involved in the issues raised in the litigation and the issue \"required determination\" after consideration of \"full legal submissions and evidence\".\nMr Kynaston said ELSC had \"the legal and other resources\" available to \"assist the court\".", "url": "https://www.bbc.co.uk/news/articles/c3vw5r1x74xo"}