{"authors": ["Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 04:23:25", "date_modify": "2025-04-26 04:23:25", "date_publish": "2025-03-03 13:18:22", "description": "The redevelopment is designed to connect Pittville Park and the Brewery Quarter in Cheltenham.", "filename": "news_articles_ckgnxwv3n8do_1745641405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/33dc/live/838844d0-f82c-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgnxwv3n8do_1745641405.html", "title": "Work to turn Cheltenham car park into homes under way", "title_page": "Work to turn Cheltenham car park into homes under way - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work has started on a town centre car park in preparation for the construction of almost 150 new homes.\nThe £50m Arkle Court development will replace North Place car park in Cheltenham, with Wavensmere Homes and Montane Partners commencing work on the site last week.\nThe 3.5 acre site will include 147 homes and apartments, landscaped open space, and the opportunity for a public art installation to be created as part of Cheltenham Paint Festival.\nJames Dickens, managing director of Wavensmere Homes, said construction should take two-and-a-half years.\nGroundworks are scheduled to commence later in the spring, and will begin on the site's eastern boundary with North Place.\nArkle Court was designed by architects Glancy Nicholls to complement Cheltenham's Regency architecture and create a sustainable community.\nThe development will include 75 three-bedroom townhouses and 72 one and two-bedroom apartments, with the first home handovers scheduled to take place in the third quarter of 2026.\nIn addition to open space, there will be vehicle, pedestrian and cycle access from North Place, less than half-a-mile from the town centre.\nThe redevelopment will connect Pittville Park to the Brewery Quarter and beyond.\nMr Dickens, managing director of Wavensmere Homes, said the car park was \"the blight\" on its part of Cheltenham.\n\"The build programme at the moment is around two-and-a-half years,\" he told BBC Radio Gloucestershire.\n\"That obviously will be dependent on market conditions but so far we've had an enormous amount of interest from local people which I'm delighted about.\n\"We will be breaking ground imminently.\"", "url": "https://www.bbc.co.uk/news/articles/ckgnxwv3n8do"}