{"authors": ["Anna Savva", "www.facebook.com"], "date_download": "2025-04-26 06:27:09", "date_modify": "2025-04-26 06:27:09", "date_publish": "2025-02-28 19:01:49", "description": "The price of draft beer could be set to increase in Guernsey due to changes over what constitutes a \"small brewery\".", "filename": "news_articles_c1jppnpxex3o_1745648829.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9e2d/live/573a6b60-f5ca-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jppnpxex3o_1745648829.html", "title": "Draft beer 'could increase in price' due to law change", "title_page": "Draft beer 'could increase in price' due to law change - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The price of the wholesale cost of some draught beers could be set to increase in Guernsey, brewer The Liberation Group has told its customers.\nIt comes after changes to who qualifies as a \"small brewer\" in the States of Guernsey's November budget.\nThis means the pub operator and brewing business now produces too much alcohol to qualify for any discount and may have to pass on price increases to its business customers, it said.\nThe States of Guernsey was contacted to comment on the pricing change.\nIn correspondence seen by the BBC, The Liberation Group told its business customers it faces raising the \"wholesale price\" of some Liberation and Butcombe kegs by between 30 and 50% because of the change.\nThe Liberation Group said it was in active discussions with the States of Guernsey about the change.\nThe threshold for what constitutes a small brewer has been lowered from 200,000 hectolitres to 5,000.\nThe Liberation Group had previously received a 50% tax discount.\nJonon Le Sueur, chair of the Channel Islands branch of the Campaign for Real Ale (Camra), said the change could lead to price rises at the taps.\n\"In real terms, previously the brewery would have paid 30% duty - now it's more like 60 pence a pint duty and that probably will end up being passed on to the consumer,\" he said.\n\"Overhead costs to the pubs are increasing all the time so it is going to be detrimental to the industry as a whole and impact the drinking public.\"\nSome small-scale makers who will be in receipt of an extra 10% tax relief this year are supportive of the changes however.\nGuernsey producer James Meller, of Rocquette Cider, said it would enable his business to remain \"competitive\" alongside bigger producers.\n\"I think the production levels for a small producer was quite high so the law change is wholly appropriate,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c1jppnpxex3o"}