{"authors": ["Matthew Critchell", "www.facebook.com"], "date_download": "2025-04-26 04:00:08", "date_modify": "2025-04-26 04:00:08", "date_publish": "2025-03-04 05:25:54", "description": "More plans about the development at Wickford Station will be released in the spring.", "filename": "news_articles_c0mwr78zn82o_1745640008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07f5/live/0049dc00-f84f-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mwr78zn82o_1745640008.html", "title": "Wickford railway station revamp contracts signed", "title_page": "Wickford railway station revamp contracts signed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Construction workers have been given the green light to rebuild a station ticket office after it was demolished five years ago.\nContracts have been signed for the redevelopment of Wickford railway station in Essex, which currently has rows of hoardings and a temporary ticket office.\nPlans were first unveiled to transform it in 2020 but were derailed by the Covid-19 pandemic, said Greater Anglia.\nThe project will provide a new ticket office, waiting facilities, and toilets.\nTrevor Hammond, the Wickford Independents councillor for Wickford North at Basildon Council, said: \"It's been planned for quite a while. I liked the old ticket office and didn't think it should have been knocked down. It's good we will get another ticket office. It's awful not having one.\n\"I think it's still important to have ticket offices for a number of reasons. Some people may not know where they are going or how to pay for tickets using machines.\"\nMartin Beable, managing director for Greater Anglia, told the Local Democracy Reporting Service the contract for the new station had been signed and more details on the delivery scheme were due to be released in the spring.\nMark Francois, Conservative MP for Rayleigh and Wickford, said he had been campaigning for almost three years to get the station rebuilt.\n\"I warmly welcome the news that a contract to achieve this has now, finally, been signed, between Greater Anglia and Walker Construction,\" he said.\n\"My constituents in Wickford deserve a modern station and I'm pleased that work on this project will now commence in just a few months' time.\"", "url": "https://www.bbc.co.uk/news/articles/c0mwr78zn82o"}