{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:34:19", "date_modify": "2025-05-21 06:34:19", "date_publish": "2025-03-31 00:00:00", "description": "The Kremlin says Putin is open to speaking to Trump, after he threatened US tariffs on Russian oil over stalled Ukraine ceasefire talks.", "filename": "news_live_c70wjz2j04wt_1747809259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/331d/live/527a69c0-0e1d-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c70wjz2j04wt_1747809259.html", "title": "Russia says 'work ongoing' with US after Trump says he is 'angry' with Putin", "title_page": "Russia says 'work ongoing' with US after Trump says he is 'angry' with Putin - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Kremlin plays down Trump's changing message\nBen Hatton\nLive reporter\nThe Kremlin offered a muted response on Monday to Donald Trump's remarks that he’s “very angry” and “pissed off” with Vladimir Putin.\nThe US president, who made the remarks to NBC News over the weekend, also threatened to place tariffs of up to 50% on countries that import Russian oil if a ceasefire deal is scuppered by Moscow.\nIn a daily press briefing, Kremlin spokesman Dmitry Peskov downplayed any deterioration in relations with Washington.\nHe suggested parts of the statement were paraphrased, rather than “direct quotes”, said work on a Ukrainian peace process is “ongoing\", and called talks about a potential maritime ceasefire in the Black Sea a “work in progress”.\nVolodymyr Zelensky, for his part, said on Sunday that Putin “does not care about diplomacy”, and called for further pressure on Russia to end the war.\nWe're pausing our live coverage now. For a deeper dive into some of the issues we've explored today, these posts have you covered:\nUkraine correspondent James Waterhouse looks at the latest in the US-Ukraine rare earth minerals deal, after Trump said Zelensky will have\"big problems\" if he pulls out\nOur colleagues at BBC Monitoring have been examining how Russian media have covered Trump's criticism\nAnd we've been taking a closer look at Trump's threat of\"secondary tariffs\" against Russia\nOr if you'd like to keep updated on further developments, our main story on the Kremlin's comments is here\nRussians using sewage systems to enter frontline town\nVitaliy Shevchenko\nRussia editor, BBC Monitoring\nRussian forces have been using underground sewage systems in an attempt to enter Toretsk, a Ukrainian frontline town in Bakhmut, according to Viktor Trehubov, spokesman for Ukraine’s Khortytsya military command.\n“We received information yesterday about enemy attempts to use underground communications channels to approach our forces from the rear in certain streets,” he told Ukrainian TV. “They are trying to approach us not just from the sides, but also from below.”\nBecause Ukrainian towns and cities heavily rely on central heating, they have are numerous underground tunnels housing heating pipes as well as sewerage.\nEarlier in March, Russian forces claimed to have used a gas pipeline to enter Sudzha in Russia’s own Kursk region and eventually dislodge Ukrainian forces from the town. Later, a similar pipe was installed outside a church in Yekaterinburg in commemoration of the trick, with dozens of Russians lining up to crawl through it, external.\nUkraine and Russia differ on list of energy targets for truce - reports\nBBC Monitoring\nUkraine has agreed with the US on a list of energy facilities which should not be attacked by Russia during the partial ceasefire reached earlier this month, which differs from the list published by Russia, the Yevropeyska Pravda website reported, quoting the Ukrainian Energy Ministry.\nUnlike Russia's list, Ukraine's one includes oil and gas extraction facilities which have suffered the most attacks recently, the website noted.\nIt added that the US had thus far not denied accepting the Russian list.\n\"Ukraine handed over and agreed with the American side the types of facilities for all energy infrastructure as part of an agreement to stop mutual strikes,\" the ministry was quoted as saying.\n\"This applies to the electric power, oil and gas industries, nuclear and coal industries, and power engineering - production of energy equipment,\"\nThe ministry stressed that Washington was aware of these demands and that they were agreed with Washington.\nSince an agreement was reached, both Russia and Ukraine have accused each other of targeting energy infrastructure.\nRussia and Ukraine both report new strikes on energy infrastructure\nVitaliy Shevchenko\nRussia editor, BBC Monitoring\nRussia and Ukraine continue accusing each other of attacking each other’s energy infrastructure, despite US-brokered promises not to do so.\nThis morning, the defence ministry in Moscow said Ukrainian shelling caused a power outage due to a power line breaking in Russia’s Bryansk region. In the same region, Ukrainian drones attacked an electricity substation yesterday evening, the statement said.\n“Continuing deliberate attacks by Ukraine to against Russian energy facilities show that the Kyiv regime is totally incapable of keeping any commitments related to conflict settlement in Ukraine,” the Russian defence ministry said.\nAlso this morning, the head of Ukraine’s north-eastern Kharkiv regional administration, Oleh Sunehubov, said a number of settlements were left without power due to Russian shelling. “Despite the constant danger”, he told Ukrainian TV, emergency workers have restored power to almost 2,000 households.\nAnd in Zaporizhzhia region, the head of the local administration, Ivan Fedorov, said part of the village of Kushuhum was left without power due to a Russian attack late last night.\nZelensky marks third anniversary of Ukrainian liberation of Bucha\nUkrainian President Volodymyr Zelensky has marked the third anniversary of the Ukrainian army retaking Bucha in a post in X.\nThe town outside Kyiv was invaded and occupied by Russian troops in 2022.\n\"Three years ago, our warriors liberated Bucha from the Russian occupiers. And the world saw what the Russian occupation truly is: people killed in the streets, people tortured, graves in the yards of ordinary houses,\" he says.\n\"Since then, no one in the world can say they do not know what Ukraine is defending.\n\"Ukraine is fighting for the lives of its people. It is fighting to ensure that no one, ever again, does on our land what the Russian occupiers did.\n\"Eternal memory to all those whose lives were taken by the Russian war. Eternal gratitude to all our people who are defending Ukraine.\"\nLast year, the BBC's Sarah Rainsford visited Bucha to see how residents were trying to return to normal life - you can read that story on our website\nThere may be 'problems' ahead\nJames Waterhouse\nUkraine correspondent in Kyiv\nIf, as Donald Trump suggests, President Zelensky will have “big problems” if he tries to pull out of America’s rare earth minerals deal, then they may be unavoidable.\nWhy? Well, according to Kyiv, the latest draft of the White House’s proposal includes US demands that have either been undiscussed or previously rejected.\nA leaked version, seen by the BBC, has revealed terms that heavily favour Washington. They include forcing Kyiv to open its government books for inspection and giving the White House the power of a veto on future projects.\nThe idea of trading profits from Ukraine’s natural resources for American security guarantees was first pitched by Zelensky last year, but Trump has played hard ball, insisting that simply the presence of US businesses would be enough to stop Russia from breaking a future ceasefire.\nNevertheless, Ukraine’s leader had said he was willing to sign the deal, until now it seems.\nHe has reiterated his red lines of never recognising America’s financial and military aid to date as a “debt”, as well as never agreeing to a deal that could jeopardise Ukraine’s path to a possible membership of the European Union.\nGiving the US first refusal on future investment projects would break the bloc’s strict competition laws.\nIf joining the NATO alliance is already off the table, Zelensky won’t want to lose the EU too.\nBlack Sea ceasefire a work in progress, says Peskov\nLet's take another look at comments today from Kremlin spokesman Dmitry Peskov.\nAccording to a report from Russian state-owned Tass news agency, Peskov said today that the US-brokered deal for a ceasefire in the Black Sea was a work in progress.\nHe is referring to a naval ceasefire in the Black Sea, agreed by both Russia and Ukraine in separate deals with the US last week.\nPeskov said today that the previous Black Sea Grain Initiative, which was struck in 2022, was \"implemented in the part concerning Ukraine\" but never fulfilled in the part concerning Russia\". Russia pulled out of the deal in 2023.\nHe stressed that \"therefore, all these details are now receiving due attention in the course of our contacts\".\n\"There is still some work to be done,\" Tass reported him as saying, adding he \"cannot go into the full details about the range of issues on the agenda\".\nYou can read more about the Black Sea naval ceasefire deal in our full story\nHere's what Trump has said about ending the war\nEnding the war in Ukraine swiftly was part of Trump's election pitch to voters in the US.\n\"If we win, I think we're going to get it resolved very quickly,\" he said last September when he met Zelensky in New York.\nBut his rhetoric on how quickly he could make a deal has changed over time.\nIn a televised presidential election debate, Trump promised he would \"get it settled before I even become president\".\nThat was an escalation from his previous commitment in May 2023, when he said he could stop the fighting in 24 hours if elected - a claim he repeated several times.\n\"That deal would be easy\", Trump said when campaigning, again repeating a version of this claim several times.\nEarlier this month, just before hitting two months in office, he claimed he was \"being a little bit sarcastic\" when he made the claim he could stop the war in 24 hours.\nRussian state TV tries to explain away Trump's anger\nFrancis Scarr\nBBC Monitoring\nAfter appearing to ignore Trump’s criticism of Putin in its morning news bulletins earlier today, Russian state TV is now seeking to explain away the remarks.\nSince he returned to office in January, the Kremlin-controlled media have been largely favourable towards Trump, sparing him the constant ridicule inflicted on his predecessor Joe Biden.\nOn the 60 Minutes talk show on the country’s most popular channel Rossiya 1, host Yevgeny Popov linked Trump’s comments to domestic politics in the US. He said that the president was keen to “drown out” the so-called Signal-gate scandal around the leak of information from top administration officials concerning missile strikes on Houthi rebels in Yemen.\nHe also said that Trump was desperate to show some “tangible results” by the end of his first 100 days in office, which falls on 30 April, such as a ceasefire in Ukraine.\nOn Time Will Tell, a political talk show on Channel One, there was some rare criticism of Trump, as a pundit referred to a letter signed US mental health professionals written ahead of the 2024 election saying that Trump suffered from “malignant narcissism”.\n“In my view, the man has some problems,” commentator Alexander Artamonov told the show.\nKremlin spokesperson says 'work is ongoing' with the US\nSteve Rosenberg\nRussia editor, reporting from Moscow\nIn Moscow we’ve just got the first official reaction to Donald Trump’s criticisms of Russia this weekend.\nOn his daily conference call with journalists Kremlin spokesman Dmitry Peskov wasn’t going to be drawn into an argument.\n“Part of the statements you mentioned were paraphrased. These were not direct quotes,” Peskov said, referring to an NBC News anchor who had spoken to Trump on the telephone.\n“We continue to work with the American side, primarily on sorting out our bilaterial relations, which had been greatly damaged by the previous [US] administration. And we are also working on several areas regarding the Ukraine peace process,” the Kremlin spokesman continued.\n“Work is ongoing. We have nothing concrete yet that we could or should tell you. This process is drawn out due to its complicated nature. The President remains open to contact with President Trump. A telephone call can be organised quickly if needed.”\nUS might hit Russia with new sanctions if ceasefire not agreed - Finnish president\nFinnish President Alexander Stubb said on Sunday that Trump is running out of patience with Russia and that the US has \"far-reaching\" plans for if it does not agree to a ceasefire.\nStubb was speaking at a news conference the day after a meeting with Trump at his Mar-a-Lago resort in Florida, where the pair reportedly played golf together.\nUkrayinska Pravda, a Ukrainian news website, reports that Stubb told reporters a plan for additional sanctions on Russia could be brought before Congress if Moscow doesn't agree to a ceasefire or breaches its conditions.\nTrump has threatened more sanctions on Russia previously - but at the beginning of March, his administration was also reported to be drawing up a plan to potentially give Russia some relief from the measures.\nSo far, Trump has mostly stuck with the sanctions regime he inherited from the Biden administration. Earlier this month, however, his administration allowed a short-term exemption that let some Russian banks access payment systems for energy-related transactions to lapse, effectively increasing the impact of sanctions.\nTrump threatens tariffs on Russia. But what does that mean?\nOn Sunday, Trump threatened \"secondary tariffs\" on Russia if it doesn't agree to a ceasefire with Ukraine. Let's unpack that a little.\nWhat did Trump say?\n\"If Russia and I are unable to make a deal on stopping the bloodshed in Ukraine, and if I think it was Russia's fault , which it might not be... I am going to put secondary tariffs... on all oil coming out of Russia,\" the US president told NBC News.\n\"That would be that if you buy oil from Russia, you can’t do business in the United States,\" Trump added. \"There will be a 25% tariff on all oil, a 25 to 50-point tariff on all oil.\"\nHe also described it as a \"25% tariff on oil and other products sold in the United States, secondary tariffs\".\nWhat is a secondary tariff?\nWhen a government imposes trade tariffs it means it is taxing the importer of goods. It's effectively an entrance fee for products, usually set at a percentage of their value.\nThis is not the first time Trump has talked about using \"secondary tariffs\". He appears to mean a tariff placed on a country because it does business with another country - in this case Russia.\nSo Trump appears to be threatening to impose a 25% to 50% tariff on products brought into the US from countries that purchase Russian oil. The biggest buyers of Russian oil are China and India.\nWhat change would this make?\nIn March 2022, the US said it was banning the import of almost all Russian energy products. Other Western countries have issued similar sanctions.\nAnd the US has a wider - and highly complex - sanctions regime against Russia. Its intention, in part, is to make it harder for Russia to buy and sell products, and reduce how much money it can make.\nThe secondary tariffs Trump is suggesting would make it harder for Russia to sell oil - as purchasers would be mindful of damaging their trade with the US.\nI don't expect the Kremlin to say 'we're quaking in our boots'\nSteve Rosenberg\nRussia editor, in Moscow\nThere has been no official reaction yet in Moscow to Donald Trump's comments. That may come later in the day. But I don't expect the Kremlin to say \"we are quaking in our boots\". Traditionally, President Vladimir Putin does not take well to threats and ultimatums.\nWhat caught my eye this morning is an article in one of the leading pro-Kremlin papers, Moskovsky Komsomolets. It points an accusatory finger back at President Trump and accuses the US president of not fulfilling his \"obligations\" to stop Ukraine striking Russian energy infrastructure.\nThe newspaper reaches this conclusion: that \"all agreements on the level of President Trump are only worth a few pennies on market day. Moscow is prepared to make a deal with the US president, as 'the leader of the free world', and the undisputed boss of Nato and 'the lord and master of Kyiv'. But right now the leader is not leading, the boss is not bossing and the lord is not directing his vassal.\"\nThat is rare criticism of Donald Trump in the Russian media. He usually gets a good press here. The article ends with a warning: \"If the diplomats cannot move the peace process forward, the military will do all the talking. Putin has made his move, now we wait for Trump's.\"\nWe need to add a note of caution from what we have seen before. What Trump says one day can change dramatically, diametrically by the next.\nThis makes analysing them in real time difficult for us - and possibly for the Kremlin, too.", "url": "https://www.bbc.com/news/live/c70wjz2j04wt"}