{"authors": ["Eleanor Maslin", "Jake Zuckerman", "www.facebook.com"], "date_download": "2025-04-26 04:18:37", "date_modify": "2025-04-26 04:18:37", "date_publish": "2025-03-04 06:25:10", "description": "Dad-of-two Lewis Parker is often mistaken for actor Rupert Grint who played Ron Weasley.", "filename": "news_articles_cqly2wv35k3o_1745641117.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b9d3/live/1e287380-f859-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqly2wv35k3o_1745641117.html", "title": "Spalding stonemason often mistaken for Harry Potter star", "title_page": "Spalding stonemason often mistaken for Harry Potter star - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Most people will never know who their lookalike is - but some might find out they resemble a fictional wizard.\nThat is the case for Lewis Parker, 33, dad-of-two and stonemason from Spalding, who is often mistaken for Rupert Grint, the actor who played Ron Weasley in the iconic Harry Potter films.\nAfter being hired as a lookalike when he finished high school, Lewis channelled his inner Ron Weasley and has attended events including weddings, shop openings and street performances in London.\n\"They say everyone has a lookalike, I'm fortunate to know who mine is,\" Lewis said.\nLewis said his parents first noticed he resembled Ron Weasley when they took him to the cinema to see the first film, Harry Potter and the Philosopher's Stone.\nDespite the success he has had embodying Ron Weasley in the past 10 years, and sometimes Ed Sheeran, Lewis said he was bullied in school for having ginger hair.\n\"It was quite negative for me to want to be Rupert Grint [during school] and I didn't want to add fuel to the fire.\"\nHe said after still being called Ron on nights out as he got older, he decided to join a lookalike agency.\n\"As long as the franchise and magic stays alive and people wish to have Harry Potter themed characters at their events and weddings I will continue to do it,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cqly2wv35k3o"}