{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:24", "date_modify": "2025-05-19 14:23:24", "date_publish": "2015-03-18 22:54:14", "description": "Three Burmese brothers aged one, five and 12 are dead after a neighbour attacked them with a knife in their North Carolina home, say police.", "filename": "news_world-us-canada-31955131_1747664604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81750000/jpg/_81750564_ap-hi026382795.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31955131_1747664604.html", "title": "Three young Burmese boys killed in North Carolina stabbing", "title_page": "Three young Burmese boys killed in North Carolina stabbing - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three brothers aged one, five and 12 are dead after a neighbour attacked them with a knife in their North Carolina home, say police.\nThe boys' elder sister and mother were also hurt in the attack in New Bern.\nOfficers have arrested a man, and they say he and the victims are all Burmese, with a language barrier complicating their investigation.\nThe city of New Bern is home to about 1,900 Burmese refugees, who fled persecution in their home country.\nPolice say the motive of 18-year-old Eh Lar Doh Htoo's is not yet known, but they have charged him with three counts of murder and assault with a deadly weapon with intent to kill.\nMr Htoo used a \"machete-style\" knife in the attack, according to local television station WITN, external.\n\"Any time this happens in any community, any part of town, it's surprising,\" said New Bern Police Chief Toussaint Summers Jr.\nOn Tuesday at about 23:00 local time (03:00GMT Wednesday), police were called to a house where a person was said to be wielding a knife.\nUpon entering the home, they discovered that two of the boys had already died. The third boy died later in hospital.\nDuring the attack, the boys' mother jumped from a second-floor window and ran to a nearby house to seek help, neighbours say.", "url": "https://www.bbc.com/news/world-us-canada-31955131"}