{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 07:43:05", "date_modify": "2025-04-26 07:43:05", "date_publish": "2025-02-26 18:31:03", "description": "The Sue Lambert Trust says a lack of certainty about funding means 140 people may not get help.", "filename": "news_articles_cnvzqzlg89vo_1745653385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/141d/live/a06590f0-f3ac-11ef-adb4-250c787bc8d9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cnvzqzlg89vo_1745653385.html", "title": "Norfolk sexual abuse charity hit by funding doubts", "title_page": "Norfolk sexual abuse charity hit by funding doubts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity that supports victims of sexual abuse and violence said it had cut the number of people it helps by 20% due to funding cuts.\nThe Sue Lambert Trust (SLT), based in Norwich, estimated that almost 140 people would miss out on the support they \"desperately need\".\nIt urged funding bodies - such as the local NHS - to \"fulfil their obligations to support survivors of sexual abuse\".\nOne survivor said the charity had \"changed the direction of my life\" for the better.\nJess contacted the SLT after experiencing vivid flashbacks of the abuse she had suffered during 17 years of marriage.\nOne particularly severe episode convinced her that she needed help.\nShe said: \"I was walking home from work, along a familiar route, and there was nothing unusual or different that triggered me or caused what happened next, to happen. It just came from nowhere.\n\"A severe and terrifying flashback just stopped me dead in my tracks. Panic set in, and I couldn't move or breathe.\"\nShe found out about the SLT and had counselling sessions.\n\"I am so grateful I had the charity to reach out to and change the direction of my life,\" Jess added.\nIn 2024, the SLT helped 636 people like Jess, but the organisation said it was unlikely to receive the same level of funding in 2025.\nThe NHS Norfolk and Waveney Integrated Care Board stopped funding it last year, and the SLT is waiting for a decision on a revised proposal. The board has been approached for comment.\nNorfolk's police and crime commissioner (PCC) also reduced funding for two of the SLT's sister organisations, and the trust feared the same fate awaited it.\nSLT chief executive Clive Evans said without money from government bodies, the charity would not meet local demand.\n\"We're calling on the PCC, NHS and government bodies to stop, think again and fulfil their obligations to support survivors of sexual abuse and sexual violence,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cnvzqzlg89vo"}