{"authors": ["Simon Finlay", "www.facebook.com"], "date_download": "2025-04-26 07:07:52", "date_modify": "2025-04-26 07:07:52", "date_publish": "2025-02-28 05:57:31", "description": "A total of 1,000 new homes are to be built in the Mascalls Court Road area of Paddock Wood.", "filename": "news_articles_c4g00zzplrko_1745651272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7169/live/bc4008d0-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g00zzplrko_1745651272.html", "title": "Road improvement scheme delayed until summer", "title_page": "Paddock Wood: Road improvement scheme delayed until summer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A road improvement scheme in a Kent town has been deferred to make it \"fit for purpose\", a council has said.\nChanges to junctions at Paddock Wood, where 1,000 new homes are being built by three separate developers, were set to be undertaken by Kent County Council (KCC).\nMuch of the £4.7m cost of the scheme at Mascalls Court Road is to be funded by the developers.\nThe improvements to the A228/B2017 and B2017/B2160 junctions will now require a larger roundabout and extra land, KCC has said.\nA new traffic-signalled crossroads design near Mascalls Academy has also proved \"problematic\", according to Local Democracy Reporting Service.\nNew flood mapping by the Environment Agency meant planners now have to find a way of redirecting surface water entering a culvert section.\nPapers before the environment and transport cabinet committee on 25 February said: \"This is a difficult situation, and the way forward is a clear choice of either progressing this amended scheme or not carrying out an improvement at all.\n\"Abandoning the scheme has been rejected because this would result in no mitigation or improved accessibility to support the major housing developments in Paddock Wood delivering nearly 1,000 homes.\"\nVegetation clearance will take place almost immediately to avoid the bird nesting season, the council added.\nConstruction will start this summer and work is estimated to take between four and six months.\nCompletion is expected before March 2026.", "url": "https://www.bbc.co.uk/news/articles/c4g00zzplrko"}