{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:09:26", "date_modify": "2025-04-26 08:09:26", "date_publish": "2025-02-26 13:16:47", "description": "A Wiltshire care provider says the financial situation of the care sector is \"really worrying\".", "filename": "news_articles_cvgd9670qq7o_1745654966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eb4c/live/52c21f50-f37d-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgd9670qq7o_1745654966.html", "title": "Protesters from care sector demand help with new costs", "title_page": "Protesters from care sector demand help with new costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A care provider from Wiltshire has described the financial situation faced by the UK care sector as \"really worrying\", at a rally in Westminster.\nStephen Trowbridge, managing director of Swindon-based First City Nursing, argued recent increases in employer national insurance (NI) contributions, and the resulting wages rises, were compromising the future of social care.\nMore than 3,000 people are believed to have attended the rally to call for NI exemptions for care providers similar to those granted for the NHS.\nThe Department of Health and Social Care said it had \"inherited significant challenges facing social care\" but it was \"committed\" to tackling them.\nSpeaking to BBC Radio Wiltshire, Mr Trowbridge said the sector was at breaking point.\n\"Honestly, I'm really worried. This year, the government has doubled down with the national insurance costs.\n\"The councils, and this is the worry, they're all on our side, but they haven't got the money, and they're not putting it into their budgets, because they can't afford to. Social care are on their own with this one.\n\"And it's not just our sector, the charities, the hospices, if we're not around come April, which there's a big chance that would be the case . I don't know what's going to happen.\"\nMr Trowbridge was one of 53 marchers who made the journey from Swindon on Tuesday morning.\nThe group was marching on behalf of Providers Unite, a national grassroots organisation he says was set up by those across the sector \"who had just had enough\" of the situation.\nHe explained that after years of broken promises to reform the healthcare sector, he felt the group had to march as \"no-one's strong enough or brave enough to fix\" the problem.\nBut in a note of optimism, he noted a number of those taking part \"had managed to get meetings with MPs to start talking about the issue\".", "url": "https://www.bbc.co.uk/news/articles/cvgd9670qq7o"}