{"authors": ["Gurdip Thandi", "www.facebook.com"], "date_download": "2025-04-26 08:06:37", "date_modify": "2025-04-26 08:06:37", "date_publish": "2025-02-26 14:31:47", "description": "Environmental factors are identified as having an impact on people's health in the region.", "filename": "news_articles_c3e41y5n1wno_1745654797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ac0/live/09d93a90-f435-11ef-8241-abbb923a0925.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e41y5n1wno_1745654797.html", "title": "Life expectancy in the West Midlands is below the national average", "title_page": "Life expectancy in the West Midlands is below the national average - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Life expectancy for people in the West Midlands is below the national average, with figures showing an increase in the number of preventable deaths.\nThe West Midlands Combined Authority's (WMCA) State of the Region draft report revealed that between 2021-23, the life expectancy for women was 82.5 years and 78.4 for men – below the England average of 83.1 for women and 79.1 for men.\nMore positively, the figures were an increase on the 2018-20 period for the region of 81.9 years for women and 77.6 for men.\nThe report said: \"By focusing on the socio-economic causes of health inequalities, the region's below-average life expectancy and high levels of preventable deaths can be addressed.\"\nThe report stated Solihull – the most affluent area in the region – had the highest life expectancy, while Sandwell and Wolverhampton, among the most deprived, had the lowest.\nIt also revealed the number of preventable deaths in the West Midlands had increased sharply, particularly during the Covid pandemic.\nEnvironmental factors were also identified as having a major impact on people's health in the region.\nThe report also showed there had been a decline in deaths attributed to particulate air pollution within the West Midlands from 7.5 per cent in 2018 to 6.2 per cent in 2022, but this was still higher than the national average of 5.8 per cent.\nThe West Midlands had the lowest percentage of physically active children and young people at 49 per cent, while obesity rates among reception children were the highest in the country at 10.9 per cent.\nThe report said public services needed to be reformed to become more \"integrated and strongly focused\" on prevention.\n\"[Also] interventions built around the way people live their lives so that the socio-economic causes of health inequalities can be addressed.\"", "url": "https://www.bbc.co.uk/news/articles/c3e41y5n1wno"}