{"authors": ["James Grant", "www.facebook.com"], "date_download": "2025-04-26 04:01:59", "date_modify": "2025-04-26 04:01:59", "date_publish": "2025-03-04 02:28:17", "description": "The drama tells the story of how families fought for justice over their children's birth defects.", "filename": "news_articles_cx2pzl605kzo_1745640119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a48f/live/5fcc1a00-f848-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2pzl605kzo_1745640119.html", "title": "'He was born navy blue': Real-life stories of Toxic Town Netflix series", "title_page": "'He was born navy blue': Real-life stories of Toxic Town Netflix series - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Netflix's new drama Toxic Town revisits one of the UK's biggest environmental scandals: the Corby toxic waste case.\nThe series tells the story of families fighting for justice after children in the Northamptonshire town were born with birth defects, believed to be caused by industrial pollution.\nCorby's steel and iron industry expanded rapidly in the 1930s with the construction of Stewarts and Lloyds steelworks.\nBy the 1970s, half the town worked in the mills, but when the steelworks closed in the 1980s, toxic waste from the demolition process was mishandled, leading to widespread contamination.\nIn 2009, after a long legal battle, the High Court ruled Corby Borough Council was negligent in managing the waste.\nFamilies affected won an undisclosed financial settlement in 2010, held in trust until the children turned 18.\nAlongside the drama, a BBC Radio Northampton podcast series offers a deeper look into the real-life events, using original court transcripts and newly uncovered documents.\nGeorge Angus Taylor was born on 11 March 1992 to parents Fiona and Brian, in Corby.\nBrian had worked at Stewart and Lloyds, a job that left him covered in dust and debris at the end of each shift.\nFiona, a former Boots No7 beauty consultant, vividly remembers George's birth, an event that would change their lives forever.\nBorn \"navy blue\" as a result of pre-foetal circulation issues, he was immediately ventilated and placed in intensive care.\nIt was then Fiona noticed something unusual.\n\"I remember just seeing his little hand; his pinkie ring finger and middle finger,\" she says.\n\"It was like a fist; you know how babies make a fist? Then his index finger; his thumb was sticking out.\n\"I just kept thinking, 'He's here because of me,' and you just look for blame. You look, and the first person you are going to blame is yourself.\"\nAt 14, doctors discovered a tumour in George's hand so large that amputation became a real possibility.\nThe surgery, experimental at the time, was gruelling. \"When I woke up, I was so full of morphine,\" he remembers.\n\"They said it was like climbing Everest with no practice – my body just shut down.\"\nThe experience, particularly the smell, left lasting memories. \"They burn flesh as they [operate]: very quiet sizzling, like sausages in a pan. And that's the smell that still comes to you from time to time.\"\nDespite everything, George was determined to move forward. \"The first time I saw my hand, I wasn't shocked. I wasn't sad. It was better than before.\"\nBut George was not alone. Other children in Corby were born with similar conditions.\nLisa Atkinson was a security guard at the Corby steel mills, where her duties involved outside patrols, checking parking permits, and often having to move dust that had settled over everything.\nOn 27 June 1989, she gave birth to her daughter, Simone, at Kettering General Hospital.\nSimone was born with three fingers on each hand.\nDoctors reassured Lisa, saying the only thing she would not be able to do was play the piano.\nJust as Fiona Taylor did with George, Lisa initially questioned whether she was responsible for her daughter's condition.\n\"There was probably part of me that sat there and went, 'What did I do? Did I do this?'\" she says.\n\"Because I've had a couple of miscarriages before Simone... I always thought maybe I was lucky; maybe I was given Simone... but she wasn't quite perfect. But I was lucky to have had that baby and not the two previous ones.\"\nDespite her initial self-doubt, Lisa \"knew\" she had done nothing wrong, as she had neither drunk nor smoked during pregnancy.\nShe recalls the lack of follow-up care or investigation into her daughter's condition.\n\"You're let out into the world with a child that's a little bit different,\" she says.\n\"But there was nowhere to go. There was no follow-up or anything, no 'We're going to look into it.' So you just deal with it. And you did, because you had to.\"\nLisa quickly adjusted to life with Simone's condition, saying: \"It shocked other people more than it shocked me. I got used to it really, really quickly.\"\nWinning the subsequent legal case against the borough council brought with it overwhelming attention.\n\"I'm not famous, but I feel like that's how famous people must feel... It was crazy.\"\nGrowing up, Simone, now 35, faced relentless bullying.\n\"I had a great family and friends... but [school] was hard. I wasn't a very confident child, and I was an easy target,\" she remembers.\nSimone coped by using humour. She would joke that her mum had chopped off her fingers or that she was part alien, turning her differences into something entertaining.\n\"It was a bit of a front, because if I make a joke about myself, nobody else can. Just accept that's who you are; it's not going to change.\"\nAt 18, she was offered surgery to reshape her hands, but declined.\n\"They admitted they didn't really know if it would help. By then, I'd adapted. I live with daily pain, but I didn't want to risk making things worse.\"\nMeeting her now-husband, she initially hid her hands, subtly positioning herself to avoid detection.\nEventually, she told him - through a long message and sending him a link to the 2020 Horizon documentary about the case.\nHis response? \"It's really not a big deal.\"\nToday, she is grateful for the legal battle her family fought. \"It set me up for life,\" she says.\n\"I was able to start my own life, and I went to university. I've got my own house and my daughter had the best start in life.\"\nLewis Waterfield was born in 1994 with deformities to both hands.\nHis father worked near the contaminated site as a roofer, and his pregnant mother often visited him there.\n\"My dad noticed something wasn't right straight away,\" Lewis recalls.\nAs a child, he endured disruptive hospital stays, including an unsuccessful attempt to graft a toe on to his hand to create a functioning finger.\n\"I've had extensive surgery, but there are limits to what can be done.\"\nDuring the legal battle, Lewis's parents fought to prove a link between industrial pollution and birth defects.\n\"The council, I remember, was dismissive. It felt like we were an inconvenience to them.\"\nNow a senior lecturer in public health at the University of Northampton, Lewis acknowledges how his experiences shaped him.\n\"Every now and then, someone asks about my hands, and it takes me right back.\" he says.\n\"But I don't mind. It's part of who I am.\"\nCorby Borough Council ceased to exist in 2021 when it merged with other authorities to become North Northamptonshire Council.\nIn 2010, its then chief executive, Chris Mallender, issued a formal apology over the scandal.\n\"The council extends its deepest sympathy to the children and their families,\" it said.\n\"Although I accept that money cannot properly compensate these young people for their disabilities and for all that they've suffered to date and their problems in the future, the council sincerely hopes that this apology, coupled with today's agreement, will mean they can now put their legal battle behind them and proceed with their lives with a greater degree of financial certainty.\"\nBBC Radio Northampton's eight-part documentary series In Detail: The Toxic Waste Scandal, is for download from BBC Sounds.", "url": "https://www.bbc.co.uk/news/articles/cx2pzl605kzo"}