{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:34:02", "date_modify": "2025-05-21 07:34:02", "date_publish": "2025-01-14 00:00:00", "description": "A replacement is found for Rob Edwards, who left the club last week following a run of defeats.", "filename": "news_live_c863q3xgel6t_1747812842.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c863q3xgel6t_1747812842.html", "title": "Watch live phone-in as Matt Bloomfield becomes Luton Town manager", "title_page": "Watch live phone-in as Matt Bloomfield becomes Luton Town manager - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Live video stream of the BBC Three Counties Radio phone-in\nLuton Town have announced (now ex-) Wycombe boss Matt Bloomfield will be their new manager, after they parted company with promotion-winning hero Rob Edwards last week.\nThe Hatters were relegated to the Championship after just one season back in the top flight and have struggled to mount a new promotion challenge.\nMiles Blumsom has hosted a special 75-minute phone-in on BBC Three Counties Radio.\nGuests included Bloomfield himself, as well as Kevin Harper from the Luton Town Supporters' Trust and the BBC's Wycombe Wanderers commentator Sam Avery.\nAfter some technical issues at the start, for which we apologise, a live stream of the chat got under way. You can watch it again, using the link above, or listen to the radio programme on BBC Sounds.\nYou can watch last week's programme about the departure of Rob Edwards here.\nMatt Bloomfield unveiled as new Hatters boss\nLuton Town confirmed Matt Bloomfield would be their new manager earlier today and held a media conference this afternoon.\nBloomfield joins the Championship strugglers from Wycombe Wanderers, who are currently second in League One.\nA statement from Luton said the club had \"complied with the compensation requests from Wycombe to bring the 40-year-old to Kenilworth Road, along with his assistant Richard Thomas, first team coach Lee Harrison and senior analyst Ben Cirne\".\nBloomfield took over the reins at Adams Park in February 2023, having previously been in charge at Colchester United.\nTown chief executive Gary Sweet said: \"We have been hugely impressed with his work in leading them back towards the top of League One, and especially how they have done it in such an entertaining way, forging a reputation for front-footed attacking football.\"\nBloomfield: 'A genuine honour to be here'\nIn a statement, external posted on the Luton Town website, incoming manager Matt Bloomfield said it was a \"genuine honour and a privilege\" to be the Hatters' new boss.\n\"I'm really, really proud,\" he said. \"I've met the recruitment team, met Gary [Sweet, chief exec] and spent some time with the board.\n\"The fact that they're all Luton supporters and care so much about their football club shone through, and the fact that they had a real big desire for me to join our football club also shone through.\n\"So I'm incredibly proud and very, very happy to be here.\"\nLuton's local rivals Watford are in Championship action tonight with kick-off at Cardiff City at 19:45 and live commentary on BBC Radio Three Counties (radio only; not streamed on the internet).", "url": "https://www.bbc.com/news/live/c863q3xgel6t"}