{"authors": ["Yasmin Rufo", "www.facebook.com"], "date_download": "2025-04-26 07:43:49", "date_modify": "2025-04-26 07:43:49", "date_publish": "2025-02-26 18:22:30", "description": "Trachtenberg, 39, found fame in television series Buffy the Vampire Slayer, and later Gossip Girl.", "filename": "news_articles_c778rp2je47o_1745653429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5f39/live/2e6a9600-f4e5-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c778rp2je47o_1745653429.html", "title": "Michelle Trachtenberg: Buffy the Vampire Slayer and Gossip Girl star dies at 39", "title_page": "Michelle Trachtenberg: Buffy the Vampire Slayer and Gossip Girl star dies at 39 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Actress Michelle Trachtenberg, who rose to fame as a child star in the 1990s and 2000s, has died aged 39.\nPolice in Manhattan said they responded to an emergency call on Wednesday morning and found Trachtenberg \"unconscious and unresponsive\". She was pronounced dead at the scene.\nThe US actress was best known for playing Buffy the Vampire Slayer's younger sister Dawn Summers, and later took on the role of manipulative socialite Georgina Sparks in Gossip Girl as an adult.\nTrachtenberg made her film debut in Harriet the Spy in 1996, and also appeared in several Nickelodeon productions.\nCo-stars paid tribute to her, describing her as a \"fiercely intelligent\" person who \"cared deeply\" about her work.\nHer family's representatives confirmed her death in a statement.\n\"It is with great sadness to confirm that Michelle Trachtenberg has passed away. The family requests privacy for their loss,\" it said.\nAuthorities said her death was not being treated as suspicious.\n\"Criminality is not suspected. The medical examiner will determine the cause of death. The investigation remains ongoing,\" the NYPD said in a statement.\nTrachtenberg got her start in acting at age nine on the Nickelodeon television series The Adventures of Pete & Pete.\nIn the early 2000s, she was nominated for several acting awards - including a Daytime Emmy Award - for her role in Buffy the Vampire Slayer.\nShe also starred in films including EuroTrip, Ice Princess, Killing Kennedy, and Sister Cities.\nBlake Lively, a Gossip Girl co-star, said everything Trachtenberg did \"she did 200%\".\n\"She laughed the fullest at someone's joke... she cared deeply about her work, she was fiercely loyal to her friends and brave for those she loved, she was big and bold and distinctly herself,\" she wrote on social media.\n\"The real tragedies in life are the ones that blindside you on an idle Tuesday. Hold those you love and have loved dear.\"\nUS comedian Rosie O'Donnell, who starred alongside Trachtenberg in her Harriet the Spy debut, said her death was \"heartbreaking\".\n\"I loved her very much. She struggled the last few years. I wish I could have helped.\"\nJosh Safran, a writer and producer on Gossip Girl, said it was \"an honour and joy to write for Michelle for so many years\", as she had a \"clear voice\" as an actor.\n\"You heard her as you typed,\" he wrote. \"You knew she'd make each line rougher, more real, much funnier - and that made the writing better.", "url": "https://www.bbc.co.uk/news/articles/c778rp2je47o"}