{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 06:50:59", "date_modify": "2025-04-26 06:50:59", "date_publish": "2025-02-28 17:59:08", "description": "Jameel Shariff explores the taboos in acknowledging mental illness in the South Asian community.", "filename": "news_articles_c14jx8g3216o_1745650259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/861e/live/7a2eb3b0-f5ed-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jx8g3216o_1745650259.html", "title": "Birmingham man explores late father's mental health to break stigma", "title_page": "Birmingham man explores late father's mental health to break stigma - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After his father's death, Jameel Shariff decided to sit down with his mother and finally address the patriarch's two-decade struggle with mental health.\nThe journalist, who is from Birmingham and of Indian and East African descent, discussed the cultural taboos in acknowledging mental illness in the South Asian community with mother Husna Shariff.\nHe filmed the conversation, which prompted him to track down his father's psychiatrist to find out more.\nThe 27-year-old said: \"Mental health was part of his life. But it was nothing we ever spoke about until the end of his life.\"\nIbrahim Shariff died in 2021, and Jameel shared the video to Instagram on the fourth anniversary of his death, earlier this month.\nA culture of shame and labelling regarding mental health is a barrier many within the South Asian community still experience.\nJameel, who is a BBC journalist, said while conversations were taking place in recent years about breaking cultural taboos - he found himself in a position where he was yet to address his father's mental health with his mother.\n\"I made this in 2021 to explore cultural stigmas and taboos. But we don't actually see them being broken - we don't see them being done.\n\"I thought to myself I need to actually do this myself.\"\nHis mother, who is from Kenya, and father, from Tanzania, moved to Birmingham in the early 1970s.\nOn 8 February 2021, Ibrahim died at the age of 65 after contracting Covid-19 while in hospital for other health problems.\nThe clip shows 67-year-old Husna telling her son: \"I can't cry in front of my grandchildren, I can't cry in front of you.\n\"I have to be strong for myself.\"\nJameel is shown reflecting on South Asian culture and how it is \"taught that you shouldn't express how you feel.\"\nHusna said: \"Being the man of the house he kept things to himself and wouldn't open up.\n\"If you're going through depression and anxiety people just label you that you're mental.\n\"Are they having arguments at home? Or what's going on? Why is he depressed?\n\"This is Asian culture I would say.\"\nIbrahim visited psychiatrist Dr Vinod Singh for 20 years to treat his mental health issues.\nJameel felt inspired to track him down to find out more about his dad's mental state.\nDr Singh told Jameel: \"He always believed there was something not right and that he needed to have treatment and do the best he can for his family.\n\"It's not usual, it's not very common in the Asian community, particularly the men are very reluctant to come.\"\nHe said there was a \"stigma of letting down the family\", meaning that \"they don't trust the system that is trying to provide the care\".\nJameel added: \"If I knew back then what I know now about mental health I'd be wanting to talk to him a lot more about how he felt.\"", "url": "https://www.bbc.co.uk/news/articles/c14jx8g3216o"}