{"authors": ["Patrick Jackson", "www.facebook.com"], "date_download": "2025-04-26 04:39:25", "date_modify": "2025-04-26 04:39:25", "date_publish": "2025-02-28 09:29:17", "description": "US investigators have established how Oscar-winning actor Gene Hackman and his wife Betsy died.", "filename": "news_articles_cqlyy1rld0ko_1745642365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ee5/live/41fbed40-f684-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqlyy1rld0ko_1745642365.html", "title": "Gene Hackman and wife Betsy Arakawa died of natural causes several days apart, officials say", "title_page": "Gene Hackman and wife Betsy Arakawa died of natural causes several days apart, officials say - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US investigators believe Oscar-winning actor Gene Hackman and his classical pianist wife, Betsy Arakawa, both died of natural causes about a week apart.\nTheir bodies were discovered in their home in the US state of New Mexico on 26 February, 10 days after Hackman is believed to have died.\nIn a press conference on Friday, officials said Hackman died from \"significant heart disease\" on 18 February, according to cardiac data obtained from his pacemaker.\nArakawa died a week earlier on 11 February of complications related to hantavirus pulmonary syndrome, a rare respiratory illness caused by exposure to infected rodents.\nThe medical examiner added that Hackman was also in the advanced stages of Alzheimer's disease, which meant it was \"possible\" he was not aware of his wife's death in the days after.\nHere is what we know about the death of a Hollywood legend known for such films as The French Connection and The Conversation.\nWarning: this article contains details some readers may find upsetting\nThe bodies of the couple and one of their dogs were found by police on Wednesday at their home in Santa Fe, New Mexico, after a maintenance worker called emergency services.\nIn a recording of the 911 call obtained by the BBC, the emotional caller can be heard telling a dispatcher how he found the two bodies.\nHackman, 95, was discovered in a side room near the kitchen while Arakawa, 65, was found in a bathroom, at the property on Old Sunset Trail in Hyde Park.\nThe couple appeared to have been \"dead for quite a while\", said Sheriff Adan Mendoza last month.\nArakawa's body showed signs of \"decomposition\", and \"mummification\" in the hands and feet, a sheriff's detective said.\nHackman's remains \"showed obvious signs of death, similar and consistent\" with those on his spouse.\nA German Shepherd dog owned by the couple was found dead in a bathroom closet near to Arakawa.\nNo cause was given in police statements immediately after the announcement of the deaths.\nThe authorities reported no signs of injury but deemed the deaths \"suspicious enough\" to investigate and did not rule out foul play.\nA carbon monoxide poisoning test came out negative for both Arakawa and Hackman, the Santa Fe Sheriff's office said on Friday.\nNear Arakawa's head was a portable heater, which the detective determined could have been brought down in the event that she had abruptly fallen to the ground.\nAn autopsy and toxicology tests had been requested for both Hackman and Arakawa. Authorities said it could be a few months before the results of those are released.\nThe local utility company found no sign of a gas leak in the area and the fire department detected no indication of a carbon monoxide leak or poisoning, according to the search warrant.\nA prescription bottle and scattered pills lay on the bathroom countertop close to Arakawa's body. Prescription pills found in the home were common medications for thyroid and high blood pressure, according to a search warrant.\nHackman was discovered wearing grey tracksuit bottoms, a blue long-sleeve T-shirt and brown slippers. Sunglasses and a walking cane lay next to his body.\nThe detective suspected that the actor had suffered a sudden fall.\nAt the time, the circumstances of their deaths were deemed \"suspicious enough in nature to require a thorough search and investigation\", the search warrant said, because the worker who called emergency services had found the front door of the property open.\nHowever, the detective observed no sign of forced entry into the home. Nothing appeared out of place inside.\n\"There was no indication of a struggle,\" said Sheriff Mendoza. \"There was no indication of anything that was missing from the home or disturbed, you know, that would be indication that there was a crime that had occurred.\"\nTwo other, healthy dogs were discovered roaming the property - one inside and one out.\nHackman's daughter Leslie Anne Hackman told the Mail Online that her father had been in \"very good physical condition\", external despite his age, and had not undergone \"any major surgeries\" in recent months.\n\"He liked to do Pilates and yoga, and he was continuing to do that several times a week,\" she said. \"So he was in good health.\"\nThe couple, married in 1991, had had a \"wonderful marriage\", she added.\n\"I give credit to his wife, Betsy, for keeping him alive,' she said. '[Betsy] took very, very good care of him and was always looking out for his health.\"", "url": "https://www.bbc.co.uk/news/articles/cqlyy1rld0ko"}