{"authors": ["Alexandra Banfi", "Eleri Griffiths", "www.facebook.com"], "date_download": "2025-04-26 06:56:20", "date_modify": "2025-04-26 06:56:20", "date_publish": "2025-02-28 15:04:28", "description": "Georgina Jones set up Grief Disco events after she lost her 16-month-old son Osian in March 2023.", "filename": "news_articles_c3e44ep45wno_1745650580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c792/live/bb3883d0-f5df-11ef-a452-97c9e2e951dd.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e44ep45wno_1745650580.html", "title": "Grief Disco: The women helping people cope with loss", "title_page": "Grief Disco: The women helping people cope with loss  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who found comfort through dancing after the death of her baby son now holds Grief Disco events to help others.\nGeorgina Jones lost her 16-month-old son Osian in March 2023 after he was born prematurely.\nTwo years on from his death, Georgina, with the help of her friend Leah Sian Davies, holds online and in-person Grief Disco events to help others process their grief.\nMs Jones said she had \"always loved dancing, ever since being a child,\" and \"had the urge to dance after Osian died\".\nMs Jones and Ms Davies met around eight years ago and had always been connected through their love of dance events.\nMs Davies also lost her brother and sister, so when Osian died they decided to process their grief through dance together.\nSpeaking to BBC Radio Wales Breakfast, Ms Jones, who loves house music, said: \"Leah does a lot of grief work anyway, she was my partner in crime.\n\"We went out and we were dancing, and we thought do you think this would help other people through grief? Or is it just us? It was born from that.\n\"Osian gave me Grief Disco when I needed it and it turns out it was what other people needed as well,\" she added.\nAs well as house DJs and dancing, the event will also give opportunities for people to mourn their loved ones.\nThere is a dedication tree where people can hang messages to those who have died and a wind phone, a Japanese tradition where you pick up the phone and talk to someone who has died.\nHowever, Ms Jones acknowledged their Grief Disco events are not for everyone as for some \"it's the last thing they want do while they're grieving\".\n\"Grief is an individual feeling and some people get a bit offended it,\" she said.\n\"When you're rolling in the deep at the beginning of loss, I don't think I was up for dancing. I could barely get in the bath.\n\"So I think people in the early stages of grief, I don't think we're for them,\" she added.\nThe pair decided to make their events sober as alcohol can \"muddy the waters\" when it comes to grieving.\nMs Jones said their discos provide a space for people to grieve but also celebrate the life of their loved one.\nThey also hold online events to give people the space to dance and grieve in the comfort of their own homes.\nShe said: \"People can dance, they can chat, they can sit.\n\"There's not many spaces to process grief that isn't the usual therapy or group setting.\n\"Talking about grief is one thing, but grief is a feeling and an energy – we want to get people to connect through their grief, joy, and sadness.\"\nWhen people come in Ms Jones and Ms Davies hand them a permission slip, which says they have permission to feel joy.\nMs Jones added: \"People who are grieving feel that they have to be sad, they have to feel upset.\n\"But if you burst into tears on the dancefloor, we won't usher you to the toilets - we will sit in that with you, we can hug you, encourage you to take a seat and get a drink.\"\nThe pair are holding their second in-person Grief Disco in Cardiff at The Sustainability Studio on Friday 28 February.", "url": "https://www.bbc.co.uk/news/articles/c3e44ep45wno"}