{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:54:23", "date_modify": "2025-05-19 14:54:23", "date_publish": "2017-07-05 00:00:00", "description": "News, sport, weather and travel updates from across Sussex on Wednesday 5 July 2017.", "filename": "news_live_uk-england-sussex-40498723_1747666463.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-sussex-40498723_1747666463.html", "title": "BBC Live: Sussex - As it happened", "title_page": "BBC Live: Sussex - As it happened on Wednesday 5 July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Controlled explosion in Hove\nA controlled explosion has been carried out after a suspicious package was found in a Hove street.\nIt was found outside the cadet centre in Marmion Road earlier this evening.\nNearby homes were evacuated and the area was cordoned off - but people have now been allowed to return to their homes.\nBomb squad sent to with suspicious Hove package\nA suspicious package has led to the closure of a Hove street.\nIt was found outside the cadet centre in Marmion Road.\nA 100m cordon has been put in place and houses have been evacuated.\nThe bomb squad is en route.\nGP surgery expansion plans unveiled\nBen Weisz\nPolitical reporter, BBC Sussex\nA GP Surgery in Brighton could expand if council plans go ahead.\nUnder proposals unveiled this afternoon, the city council would lease two of its buildings to the Ardingly Court surgery, and borrow £850,000 to help pay for them to be converted.\nThe remaining £813,000 of the moving costs would come from NHS England, and the NHS would repay the council over 20 years.\nIf it moved to the new site, the expanded surgery could take on an extra 3500 patients.\nRecently, there's been a particular problem with GP places in Brighton, where 8 surgeries have announced their closure over the last two years.\nThe plans will be debated by councillors next Thursday.\n'It's been mental torture'\nBob Dale\nBBC Live reporter\nRobert Trigg has been convicted of murdering two of his girlfriends, Caroline Devlin in 2006 and Susan Nicholson in 2011, both in Worthing.\nSusan's parents say at the time they questioned how he could have accidentally killed their daughter in his sleep, as he claimed.\nMan guilty of killing two ex-girlfriends five years apart\nA man has been found guilty of killing two girlfriends five years apart.\nRobert Trigg, 52, was convicted of the manslaughter of Caroline Devlin in 2006, and of the murder of Susan Nicholson in 2011.\nTrigg, of Park Crescent, Worthing, West Sussex, had denied the charges at Lewes Crown Court.\nHMS Shoreham sails into Shoreham\nBob Dale\nBBC Live reporter\nThe Royal Navy’s HMS Shoreham has sailed into its namesake port for a four-day stay.\nThe minehunter, the fifth ship to bear the name, last visited Shoreham in 2016 before undergoing a six-month refit after three years on operations in the Middle East.\nAdur District Council, which awarded the ship the Freedom of Shoreham in 2011, will welcome it back at a reception for the captain and officers.\nQuote Message\nIt’s an honour to welcome HMS Shoreham back to our town, and especially looking as good as new. We have an association going back more than 300 years, so HMS Shoreham is part of our history and we are extremely proud of her.\"\nJoss Loader, Vice-Chairman, Adur District Council\nDuring its stay, HMS Shoreham will welcome invited guests on board for a reception, lunch and tours of the ship before leaving port on Sunday to return to operational duties.\nThe original HMS Shoreham was built in the town and launched in 1694.\nThe current 600 tonne ship, which has a glass fibre hull, was launched in 2001 and has a crew of 34.\n8,000 Lego bricks used to re-create Portman Road\nA nine-year-old football fan has recreated the home of his favourite club in Lego.\nJoe, who lives in Crawley, decided to build a tribute to Portman Road, home of Ipswich Town FC, using about 8,000 bricks.\nDad Phil Bryant's own love affair with the club started in the late '70s during the Bobby Robson era.\n\"Both my kids follow Ipswich now - I have ruined their lives,\" he said.\nIt took Joe about five hours, across a couple of days, to complete the model.\nPolice investigate after windows smashed at school\nPolice are investigating after 43 windows were smashed on the ground and first floors at a school in Sompting.\nIt happened at the rear of the Sir Robert Woodard Academy in Upper Boundstone Lane overnight.\nThe damage is expected to cost thousands of pounds to repair.\nPolice are asking anyone with information to email 101@sussex.pnn.police.uk, external, report details here, external or call 101, quoting serial 219 of 05/07.", "url": "https://www.bbc.com/news/live/uk-england-sussex-40498723"}