{"authors": ["Mark Palmer", "www.facebook.com"], "date_download": "2025-04-26 03:54:28", "date_modify": "2025-04-26 03:54:28", "date_publish": "2025-03-04 17:24:01", "description": "Minister says much more work is needed before high level supervision at Betsi Cadwaladr can stop.", "filename": "news_articles_c201ppzlv4vo_1745639668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2519/live/147fc7d0-f916-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c201ppzlv4vo_1745639668.html", "title": "'Long way to go' for NHS board's special measures", "title_page": "Betsi Cadwaladr: 'Long way to go' for NHS board's special measures - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There is a \"very, very long way to go\" before the highest level of scrutiny can be lowered for a troubled health board covering north Wales, the Welsh government has said.\nBetsi Cadwaladr health board was placed under special measures just over two years ago, with board members removed and finance staff suspended.\nHealth Secretary Jeremy Miles said there had been some progress at Wales' largest health board but much more work had to be done.\nThe Welsh Conservatives said patients were being let down and they lack any confidence things will get better. Plaid Cymru said being in special measures had become \"normalised\" at the health board\nBetsi Cadwaladr has a workforce of 19,000 serving more than 700,000 people across Anglesey, Gwynedd, Conwy, Denbighshire, Flintshire and Wrexham and a budget in excess of £1.8bn.\nIt is receiving the highest level of Welsh government support after a succession of serious failings on patient safety, performance and governance, together with staff shortages and a series of senior executives coming and going.\nIt was previously in special measures from the summer of 2015 to November 2020 and they were re-imposed by the Welsh government February 2023.\nSpeaking in the Senedd on Tuesday, Miles said the organisation had come \"a long way over the last two years\", achieving marked improvements in corporate governance and board leadership\" in year one and a \"real focus\" on quality and safety over the following 12 months.\nMr Miles said that in this third year the focus would be on \"operational grip and control\", \"improving performance and embedding the necessary foundations for the organisation to be successful in the long-term\".\nHowever, without giving a timescale, the health secretary said there was a \"very very long way to go\" before special measures could be removed.\nConservative Senedd leader Darren Millar represents an area covered by the health board, the Clwyd West constituency in north west Wales.\nHe told Senedd members: \"I want to thank all of those NHS staff who are working hard in the system trying to deliver the best quality care that they can.\n\"The reality is that, I am afraid to say, that all too frequently patients in my constituency and other places across north Wales feel let down by this health board and the services that they are receiving.\"\nMr Millar said there was a lack of measurable targets in the Welsh government's response, adding \"what is published by the government and the health board isn't giving us any confidence that things are going to get better\".\nPlaid Cymru health spokesperson Mabon ab Gwynfor said the health board has been in special measures \"for over two thirds of its entire existence, which clearly underlines the extent to which the exceptional has been normalised\".\nHe also expressed concern about vascular care services being withdrawn from Ysbyty Gwynedd, in Bangor.\n\"Now a number of patients are expected to receive their treatment in Stoke, is the outsourcing of services to an English hospital the ambition of this government?\"", "url": "https://www.bbc.co.uk/news/articles/c201ppzlv4vo"}