{"authors": ["Pamela Tickell", "www.facebook.com"], "date_download": "2025-04-26 06:38:00", "date_modify": "2025-04-26 06:38:00", "date_publish": "2025-02-26 06:25:15", "description": "The boat, in service in Hartlepool, is named after lifeboat station pioneer John Sharp.", "filename": "news_articles_cg70zr30k0lo_1745649480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eec4/live/e3074eb0-f368-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg70zr30k0lo_1745649480.html", "title": "New Hartlepool RNLI lifeboat 'John Sharp' enters service", "title_page": "New Hartlepool RNLI lifeboat 'John Sharp' enters service - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity which saves lives at sea has described the \"proud day\" a new £2.45m lifeboat entered service.\nHartlepool RNLI officially started using the all-weather Shannon class lifeboat on Sunday after several weeks of training for the volunteer crew members.\nIt is called \"John Sharp\" after the man who created one of the earliest lifeboat and coastguard stations in the 1700s at Northumberland's Bamburgh Castle, the RNLI says.\nMalcolm Cook, Hartlepool RNLI chairman, said the volunteer crew members had shown \"amazing dedication whilst training on the new boat over recent months and are always ready to respond to anyone in trouble at sea\".\nThe Shannon is 45ft (13.6m) long and needs to be operated by six crew members.\nIt could carry 18 casualties and would still be able to self-right if it capsized, the RNLI said.\nMr Cook said: \"This was a very proud day in the history of the Hartlepool RNLI.\"\nThe new vessel was named in recognition of Dr John Sharp (1722-1792), who also commissioned one of Lionel Lukin's so-called unsinkable boats in 1786, external which helped the North East community to be better equipped when trying to save sailors.\nIt was funded by his descendant, also called John Sharp, a mathematician and investor who died in 2019.\nThe final training exercise before the boat officially entered service was an extended navigational exercise to Bamburgh on Sunday.\nOwner of Bamburgh Castle Francis Watson-Armstrong, who is also a former RNLI crew member, said it was a \"full circle\" moment.\n\"Dr John Sharp was a remarkably dedicated man who was steadfast in his work to make the treacherous waters off Bamburgh safer,\" he said.\nThe lifeboat was placed in service in Hartlepool later that day.\nAn RNLI spokesperson said it would allow volunteer crew members to continue \"saving lives at sea 24/7 365 days a year whenever required\".", "url": "https://www.bbc.co.uk/news/articles/cg70zr30k0lo"}