{"authors": ["Emma Ruminski", "www.facebook.com"], "date_download": "2025-04-26 03:45:52", "date_modify": "2025-04-26 03:45:52", "date_publish": "2025-03-05 06:10:40", "description": "The government is proposing changes to copyright law.", "filename": "news_articles_c3vwpvq02gpo_1745639152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2d99/live/125b1270-f489-11ef-90a8-7944e242c871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vwpvq02gpo_1745639152.html", "title": "Devon artists concerned by planned change to AI laws", "title_page": "Devon artists concerned by planned change to AI laws - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Artists in Devon say they are concerned government proposals to change copyright law could make it easier for Artificial Intelligence (AI) companies to use their work for free.\nThe government has proposed law changes which would allow AI developers to be able to use creators' content on the internet to help develop their models, unless the rights holders elected to \"opt out\".\nThe Devon Artist Network said it was \"very worried\" about the proposals and Devon illustrator Sarah McIntyre said it would be \"disastrous\" for her.\nA consultation on the plans by the Department for Science, Innovation and Technology (DSIT) has closed and a spokesperson said no decisions had been taken yet.\nMs McIntyre, from Bovey Tracey, said she would be impacted if the change was to happen.\nShe said: \"We've always owned our work, that's just a part of British law.\n\"I made this, it's mine and I can earn money from it and if someone else copies it then that's against the law.\n\"But now they are saying everything we've ever created, all our artwork, we have to go back and opt out of it being used to train AI.\"\nMs McIntyre has written to Mel Stride, Conservative MP for Central Devon, and asked for help.\nStride said although AI presented \"significant opportunities for innovation and economic growth\" the government was \"putting the creative industries at risk\".\n\"Labour must press pause on its rushed consultation and rethink its approach to harness the benefits of AI without compromising the success of our creative industries,\" he said.\nAvenda Burnell Walsh from the Devon Artist Network said the group was also opposed to the plans.\nShe said: \"My car is parked on the road all night and day in the public domain but I wouldn't expect to have to say to somebody legally you can't have this car it's mine.\n\"You shouldn't have to say that about your art either, should you?\"", "url": "https://www.bbc.co.uk/news/articles/c3vwpvq02gpo"}