{"authors": ["Naj Modak", "www.facebook.com"], "date_download": "2025-04-26 07:31:27", "date_modify": "2025-04-26 07:31:27", "date_publish": "2025-02-27 17:15:38", "description": "The rural holiday retreat near Pickering will be a \"lifeline\" for those affected, they say.", "filename": "news_articles_c62zz8e2l4no_1745652687.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fd2e/live/af2e0230-f50e-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zz8e2l4no_1745652687.html", "title": "Family of boy with cancer welcomes new North Yorkshire retreat", "title_page": "Family of boy with cancer welcomes new North Yorkshire retreat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The parents of a nine-year-old boy who spent over 300 days being treated in hospital for cancer have described a new rural holiday retreat for families similarly affected as a \"lifeline\".\nRaines Retreat is being built in Allerston, near Pickering, and, once completed, will accommodate up to 27 people.\nKirsty, from York, whose son Ben was diagnosed with Burkitts Lymphoma, said the family had spent \"countless hours\" away from home and the new retreat meant people like them could \"make precious memories together, even after the hardest of times\".\nAmar Naher, from Children with Cancer UK, running the facility, said it would help families escape worries and meet others going through the same things.\nBen was eight years old when he received his diagnosis of Burkitts Lymphoma after he went to hospital with suspected gastroenteritis.\nThe condition affects white blood cells, and develops when part of the immune system, called B-cells, become abnormal.\nKirsty said that when Ben was diagnosed, the family's \"world turned upside down\".\n\"There were times when I couldn't believe it was real life,\" she said.\nDescribing her son as \"the bravest boy\" she knew, Kirsty said being away from home for an extended period of time was \"incredibly difficult\" for everyone, emotionally and financially.\nBut she added that meeting other parents in similar situations on the ward and hearing their experiences had made things \"a little bit less lonely\".\nShe said that was why she believed the new facility in North Yorkshire would be \"a lifeline for families, a place to breathe, connect, and find comfort with others who truly understand, away from the beeping machines and clinical setting\".", "url": "https://www.bbc.co.uk/news/articles/c62zz8e2l4no"}