{"authors": ["Olivia Demetriades", "www.facebook.com"], "date_download": "2025-04-26 03:40:59", "date_modify": "2025-04-26 03:40:59", "date_publish": "2025-03-05 09:12:43", "description": "Inquiries continue after the teenager was shot dead near Stockwell Tube station on Tuesday.", "filename": "news_articles_cx28gxjz27go_1745638859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/166c/live/46c9a640-f9d7-11ef-adf5-bddd64abc471.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28gxjz27go_1745638859.html", "title": "Boy shot dead by 'delivery driver' named by police", "title_page": "Stockwell: Boy shot dead by 'delivery driver' named by police - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 16-year-old boy who died after being shot in south London has been named by the Metropolitan Police as Lathaniel Burrell.\nAn eyewitness to the killing in Stockwell told the BBC the teenager was shot dead by a man dressed as a food delivery driver on a moped.\nLathaniel - who locals have said was a \"very bright\" school pupil - died on Paradise Road, near Stockwell Tube station, at about 14:30 GMT on Tuesday. The Met Police has called it an \"enormously shocking incident\".\nThe eyewitness said two boys came down the stairs at a block of flats when the moped rider took out a gun and fired, adding that the teenager who died was well known in the area and was involved in gangs.\nPatricia, who has lived in Stockwell for 21 years, said: \"The situation is really bad now. I don't go out any more. In the night, I don't feel safe.\n\"I feel so bad for the boy. It's too much for me.\"\nA young woman who lives nearby said: \"This area is not safe at night. There are a lot of teenage boys that cause a lot of trouble who live around here.\n\"They hang around at night, play around with the cops. Things like playing with fireworks and running from the police. But it can get serious. Someone I know got stabbed some time last year.\n\"I think about where the cameras are when I am walking at night, but there are no cameras in that area [of the shooting].\"\nShe added that the attackers had \"no shame - there is a primary school next door\".\nSandra, who also lives nearby, told BBC London on Wednesday: \"It's very sad; we know the family. The dad is very well known round here, who brought up our kids in youth clubs.\n\"It is awful, really sad, and really horrible.\"\nRoisin and Niamh said: \"It feels quite unsafe; we are five girls living in a flat, and to have that on your doorstep is scary.\"\nThey added: \"We're very upset for the whole community, and it's a big shock to the system arriving home from work and having to sign in and out to get into your flat, with police constant over the last 24 hours.\"\nFlorence Eshalomi, Labour MP for Vauxhall and Camberwell Green, told BBC London she wanted people to feel safe within their community.\n\"Stockwell is a vibrant, diverse, close-knit community. We are going to make sure that there is a visible police presence to reassure people,\" she said.\nThe MP added: \"This is a sad, wasted life; this boy could have had so much potential. His future has been robbed.\n\"The family and community will continue to grieve; you can never get over this shock.\"\nDet Ch Insp Sarah Lee said the police need the public's help to come forward with any information: \"We are particularly keen to speak to anyone who has any mobile phone or dash cam footage from the area surrounding Paradise Road.\n\"This is a horrendous crime, which has shocked the local community and beyond. Our thoughts are with Lathaniel's family and friends at this devastating time,\" she added.\nLast May, a man was shot dead about a mile away from Tuesday's shooting.\nJazmel Patterson-Low was 26 years old when he was shot on the Westbury Estate in Lambeth, with police saying his cause of death was a single gunshot wound.\nThe Met said a 25-year-old man was arrested but was released with no further action. No other arrests have been made.\nSonja Jessup, BBC London home affairs correspondent, said it's very rare for teenagers to be killed in shootings in London; a knife is the weapon in most homicides involving young victims.\nOf the 11 young people who lost their lives to violence in the capital last year, 10 were stabbed. One teenager, 15-year-old Rene Graham, was shot.\nThere have also been incidents where young children have been injured in shootings.\nIn November, an eight-year-old girl was seriously injured, along with her father, as they sat inside a car in Ladbroke Grove with her mother and two-year-old sibling.\nIn May, a nine-year-old girl was left with life-changing injuries after she was shot as she ate dinner with her family at a restaurant on Kingsland High Street in Dalston.\nThe fatal shooting of the 16-year-old boy in Stockwell will have caused huge concern in the community, and police will be trying to provide reassurance and, at the same time, persuade people to come forward with information to help them find the killer.\nThis is often challenging, particularly when communities live in fear of gangs or organised crime, or where some may not trust the police.", "url": "https://www.bbc.co.uk/news/articles/cx28gxjz27go"}