{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:30:15", "date_modify": "2025-04-26 07:30:15", "date_publish": "2025-02-27 17:42:00", "description": "Police say Russel Smith approached a special constable from behind before stabbing him in the neck.", "filename": "news_articles_c99nng5ry8ro_1745652615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ca4/live/8c038580-f529-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99nng5ry8ro_1745652615.html", "title": "Preston knifeman stabbed special constable at railway station", "title_page": "Preston knifeman stabbed special constable at railway station - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A knifeman who stabbed a special constable in the neck as he worked on the policing operation for an outdoor BBC festival has been found guilty of attempted murder.\nThe officer, who was telling two music fans how to get from Preston railway station to Moor Park for the Radio 2 in the Park festival, was approached from behind by Russel Smith.\nThe 54-year-old then followed the volunteer officer - who survived the attack on 7 September and has since returned to duty - before pulling a kitchen knife from his trouser pocket and stabbing him.\nSmith, who was also convicted of possessing of a bladed article, is due to be sentenced at Preston Crown Court for both offences on 14 April.\nBritish Transport Police (BTP) said the special constable, who has not been named, \"remains determined to fulfil his role\".\nThe court heard that Smith pulled the knife from his pocket, raised it above his head and then ran towards the officer.\nThe force of the attack caused the special constable to fall forwards.\nAs the wounded officer tried to crawl away, Smith moved towards him again with the knife.\nA colleague who heard the officer's screams ran to help, resulting in Smith backing away.\nThe colleague then used his PAVA spray to restrain the knifeman, who dropped his weapon while another officer handcuffed him.\nThe special constable suffered a wound to his spine, with a BTP spokesperson saying \"it is only by sheer luck that this injury did not cause life-threatening or life-changing injuries\".", "url": "https://www.bbc.co.uk/news/articles/c99nng5ry8ro"}