{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 08:01:29", "date_modify": "2025-04-26 08:01:29", "date_publish": "2025-02-26 17:31:38", "description": "The officer's sister shared the man's details in a WhatsApp group leading to him being confronted.", "filename": "news_articles_c4g092m0k3wo_1745654489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/58c7/live/e2fa11f0-f45d-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g092m0k3wo_1745654489.html", "title": "Merseyside PC leaked sex offender's name after he spied on her sister", "title_page": "Merseyside PC leaked sex offender's name after he spied on her sister - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Merseyside Police officer was handed a final written warning for leaking details of a sex offender's status after he spied on her sister.\nThe PC, who was granted anonymity, had suffered \"trauma\" in her past that made her \"particularly concerned\" about her sister's safety, a police misconduct panel heard.\nHer sister later shared the man's name in a local WhatsApp group and warned residents \"a sex offender was living in the neighbourhood\" - leading to him being confronted.\nMerseyside Police said the officer had \"been reminded of the levels of professionalism we expect and, more importantly, the people of Merseyside deserve.\"\nThe panel heard the officer, referred to as Officer A, had advised her sister to contact the police after being told she had seen a man staring through a window into her home on CCTV footage.\nDespite the incident being reported, Officer A \"found it difficult to get it out of her mind\", she told the hearing at Merseyside Police headquarters in the city centre.\nIn September 2023 she searched for the man on a force intelligence database called Niche - despite an on-screen warning saying any use must be for policing purposes.\nThe man was arrested, and a short time later the officer's sister wrote in the WhatsApp group: \"We are still probably not supposed to share this but we feel everybody had the right to know who is living in our neighbourhood so we can all be extra vigilant, look out for each other and not have our children anywhere near him.\"\nAs a result the man was confronted about being a sex offender by someone who let slip who had written those messages, leading to him making a complaint in February 2024.", "url": "https://www.bbc.co.uk/news/articles/c4g092m0k3wo"}