{"authors": ["Max Matza", "www.facebook.com"], "date_download": "2025-04-26 06:21:03", "date_modify": "2025-04-26 06:21:03", "date_publish": "2025-03-01 05:14:00", "description": "Employees who maintained America's most wild places say they are concerned for public safety and for wildlife.", "filename": "news_articles_czx7kez4vx2o_1745648463.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b71/live/8bf69470-f6ae-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czx7kez4vx2o_1745648463.html", "title": "Cuts to US national parks and forests spark outrage", "title_page": "Cuts to US national parks and forests spark outrage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Trump administration's steep cuts to staff at national parks, forests and wildlife habitats have triggered a growing backlash, as public access and conservation efforts in these remote wild landscapes fade away.\nThe impacts have already been felt by visitors - who are seeing longer park entrance lines, reduced hours at visitor centres, trails closed and dirty public facilities - and workers who not only are worried about their futures as their jobs vanish, but also the state of these outdoor marvels eroding.\nEach season, Kate White and her team typically carry 600lbs (270kg) of litter on their backs out of the Enchantments, a sensitive alpine wilderness located in Washington state that welcomes over 100,000 visitors a year.\nRemote and often covered in snow and ice, staff are needed to maintain backcountry toilets that must be serviced with helicopters, which Ms White says may overflow without proper maintenance.\n\"I'm not totally sure what the plan is to get that done,\" she says.\n\"That's probably gonna be very damaging to the ecosystem in that area, and maybe to the visitor experience.\"\nBut one of the most important parts of her job was to keep people safe - and be there if the worst happened.\nAs a National Forest wilderness ranger for over nine years, she has seen her share of tragedy when hikers or campers are confronted with severe weather and remote and tricky terrain. She has comforted people who have faced life-threatening injuries and even recovered bodies of hikers who died while out in the steep and often icy mountain region.\n\"We were kind of usually first on scene if something were to happen,\" she says.\nOn any typical Saturday in the summer months, she'd speak to an average of 1,000 visitors. She and her team published reports on trail conditions and helped hikers who appeared unprepared - wearing sandals or not carrying enough water - and guided them to easier and safer routes.\nNow, those jobs are gone.\nShe worries what the cuts will mean for the future of public safety and how people experience US parks and forests, especially ahead of the busy spring and summer months when millions travel to visit.\nMass terminations, first announced on 14 February, have led to 5% of the National Park Service staff – around 1,000 workers - being forced out.\nThe cuts have hit the US Forest Service, which maintains thousands of miles of popular hiking trails, even harder. Around 10% of the Forest Service's staff - about 3,400 people, including Ms White and her team - have been fired.\nThe cuts have upended the management of national parks, which get around 325 million visitors annually, as well as national forests, which see about 159 million visitors each year.\nLong queues of cars were stuck outside Grand Canyon National Park over President's Day weekend, one day after the mass firing, due to a lack of toll operators to check people in at the gate. Similar lines of cars have been growing at other parks as well.\nA popular trail outside Seattle was closed indefinitely only hours after the cuts were announced, with a sign at the trailhead explaining that the closure is \"due to the large scale termination of Forest Service employees\" and \"will reopen when we return to appropriate staffing levels\".\nAt Yosemite National Park, the annual \"firefall\" spectacle led to a different kind of display this year when a group, which reportedly included employees, hung an upside-down American flag at the park in protest of the Trump administration's recent deep cuts to staff.\nAndria Townsend, a carnivore biologist who supervised a team of eight people at Yosemite National Park before she was fired in an email, told the BBC she \"100%\" supports the protest.\n\"It's bringing lots of good attention to the issue,\" she says.\nShe says she is especially worried for the future of the endangered species that she had been working to protect.\nMs Townsend studied and attached GPS collars to the Sierra Nevada red fox and the Pacific fisher, which is related to a badger, in attempts to track and preserve the species.\n\"They both are in dire straits,\" she says, with only about 50 fishers and 500 red fox left in the wild.\nStaff at a sister site conducting similar research were also cut.\n\"I don't want to be doom and gloom, but it's really hard to say what the future is now,\" she says.\n\"The future of conservation just feels very uncertain.\"\nLong-time couple Claire Thompson, 35, and Xander Demetrios, 36, have worked for the Forest Service for about a decade, most recently maintaining trails in central Washington state so that hikers could explore the snow-capped Cascade mountains.\nThe email firing them and thousands of other staff cited \"performance\" issues – something they took issue with.\n\"Especially with the amount we've gone above and beyond,\" says Mr Demetrios, explaining that his work in the backcountry had carried significant risk to his safety, and sometimes involved rescuing people from dangerous situations, including one person who had fallen in a river and become hypothermic.\nHe and Ms Thompson have carried heavy equipment through rugged terrain, through foul weather at times, to clear trails and repair bridges and outhouses – and never being paid more than $22 (£17.40) an hour.\n\"It's been hurtful - insulting - to just feel like your work is so devalued, and by people who I'm quite certain have like zero concept of what we do at all,\" Ms Thompson added.\nOutdoor advocates say that travellers currently planning their outdoor vacations to national parks should expect numerous issues, including increased litter, a shortage of lodging and the unavailability of many services they have come to expect.\n\"If the administration doesn't reverse these policies, visitors are going to need to lower their expectations,\" says John Garder of the National Parks Conservation Association (NPCA) in Washington DC.\nSome of these cuts are already being felt: Yosemite has fired their only locksmith, Gettysburg fired the staff who handle cabin reservations for visitors, and hurricane damage to the Appalachian Trail won't get repaired in time for through-hikers trying to complete the 2,200-mile (3,540km) trail.\nMeanwhile, private businesses that operate in and around parks stand to lose out on billions of dollars if visitors drop off, according to the NPCA.\nConcerns are also growing about the absence of park and forest service personnel who assist in wildfire fighting during the dry season.\nWildland firefighters, like Dan Hilden, have so far been exempted from forest service cuts. He says the roles of the people who were terminated are \"completely crucial\" to fire safety. Many directly fight fires, while others are responsible for \"sweeping\" backcountry trails - telling people to leave and ensuring that no one is in danger from expanding fires.\n\"I don't know how we'll be doing that this summer, because we're heavily dependent on them,\" says Hilden, explaining that it takes several days to travel into the wilderness for these sweeps.\n\"Every year things have been getting worse as the staffing issues go. This year is going to be a lot worse.\"", "url": "https://www.bbc.co.uk/news/articles/czx7kez4vx2o"}