{"authors": ["Kostas Koukoumakas", "www.facebook.com"], "date_download": "2025-04-26 04:36:37", "date_modify": "2025-04-26 04:36:37", "date_publish": "2025-02-28 11:49:16", "description": "Fifty-seven people died in the disaster and protests are being held across Greece and beyond.", "filename": "news_articles_cx2gg8le1kpo_1745642197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d6f5/live/2e166ff0-f600-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gg8le1kpo_1745642197.html", "title": "Greeks hold mass protests demanding justice after Tempi train tragedy", "title_page": "Greeks hold mass protests demanding justice after Tempi train tragedy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Greeks have held their largest protests in years and took part in a general strike to mark the second anniversary of a rail disaster that left 57 dead and dozens more injured.\nIn the centre of Athens alone the crowd was put at hundreds of thousands, and big numbers were seen in Thessaloniki, Larissa and Ioannina, as well as many other cities.\n\"For those of us who had children on that train, a part of our soul remained there and will never return,\" said Maria Karystianou, the head of the Tempi victims' association, whose daughter Marthi was among those killed in the tragedy.\nAn inquiry concluded on Thursday that the accident was caused by human error, poor maintenance, and inadequate staffing.\nBy early afternoon, a group of hooded men began to throw rocks and petrol bombs at police, marring the emotional atmosphere close to parliament.\nPolice in riot gear responded with tear gas and water cannon as clashes went on for some time around the centre of the capital, in Ermou, Omonia and Propylaia.\nDozens of people were arrested and the trouble flared up again as evening fell.\nThe violence cast a shadow over the enormous scale of protests in virtually every city in Greece.\n\"I am here in memory of the people who were killed in the train crash. We demand justice,\" said 13-year-old Dimitris who had come with his father Petros Polyzos to the largest rally in Greece, in Syntagma Square in downtown Athens.\nIt was during the night of 28 February 2023 that a passenger train packed with students collided head-on with a goods train near the Tempi gorge in central Greece.\nThe report by Greece's Air and Rail Accident Investigation Authority warned that the safety failings exposed by the crash had not yet been addressed. \"Those children were killed because the train was not safe,\" said the authority's chief Christos Papadimitriou.\nThe Tempi rail disaster shocked Greeks with many accusing their conservative government of doing too little to shed light on the causes of the tragedy. There is a widely held belief that the government has sought to cover up the role of high-ranking officials.\nThe entire centre of Athens was crowded with people of all ages and all walks of life, with many saying they were attending a demonstration for the first time in their lives.\nDmitris and his father were among many protesters in Athens, wearing t-shirts that read \"I have no oxygen - justice to the end\", referring to the 57 who died.\nRallies were being organised in 346 cities, across Greece in Thessaloniki, Ioannina, Patras and Larissa, as well as in cities across Europe, including Brussels, Rome and several cities in the UK.\nThe passenger service from Athens to Thessaloniki was crowded with students returning to university after a holiday for Greek Orthodox Lent when the train collided with a goods train on the same track outside Larisa.\nSeconds afterwards a fireball almost completely destroyed the first two carriages of the train.\nIn Athens, protesters held placards reading \"My child, call me when you arrive\" and \"No cover-up\".\nDina Gazi, 62, held white balloons with the names of those who died in the accident. \"I firmly believe that the government is covering up those responsible for the accident\", she told BBC. \"We demand that all the evidence come to light.\"\nShops in the centre had their shutters down, many with messages of sympathy and support in their windows, and ordinary people did not go to work.\nSchools were closed, flights and trains cancelled, and the only public transport still operating was taking people to and from Syntagma Square.\nTaxi drivers promised to take people to the protest without charge.\nIn a post on Facebook, Prime Minister Kyriakos Mitsotakis said that everyone's thoughts were with the families of the 57 victims who died, as well as with the wounded and those who survived but carried the memory of that night.\n\"Nothing will ever be the same any more,\" he added, speaking of \"fatal human errors coupled with chronic shortcomings of the state\".\nIn office for almost six years, this is the first time since Mitsotakis was elected that he has been in such a difficult political position. He promised to move \"more dynamically and quickly\" to bring about modern and safe trains.\nFor Greeks this mass protest was unusual in that it was unrelated to the economy and their personal finances.\nThursday's inquiry found that millions of euros had been paid out to cover the installation of safety systems along the railway, but that the project remained incomplete due to corruption and bureaucracy.\nRelatives of those killed in the crash believe the goods train may have been carrying contraband fuel on behalf of a smuggling ring.\n\"It is impossible to determine what exactly caused [the fireball], but simulations and expert reports indicate the possible presence of a hitherto unknown fuel,\" the report found.\n\"Serious information went missing because the site of the accident was not sealed,\" experts say, increasing public anger and heightening speculation of a cover-up.\nGovernment spokesperson Pavlos Marinakis denied there was a cover-up and said the allegation was not backed up by the report.\nFurther allegations have surfaced suggesting orders were given to clear the crash site and \"landfill\" it days after the disaster, which meant that evidence disappeared. But Marinakis said the inquiry report concluded that no political directive was give to alter the scene.\nAs he stood in the midst of Friday's protest in Syntagma Square, Pavlos Aslanidis spoke about the death of his 26-year-old son Dimitris in the Tempi accident.\n\"I don't know how I find the strength to stand,\" he told BBC.\n\"My son gives me the strength. Otherwise, I wouldn't be here today demanding justice.\"", "url": "https://www.bbc.co.uk/news/articles/cx2gg8le1kpo"}