{"authors": ["Jade Taylorson & Lynette Horsburgh", "www.facebook.com"], "date_download": "2025-04-26 04:19:19", "date_modify": "2025-04-26 04:19:19", "date_publish": "2025-03-04 06:18:16", "description": "Barbara Thackray has raised more than £30,000 for the hospice that looked after her dying sister.", "filename": "news_articles_c7781enx5vpo_1745641159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/81ec/live/ed777560-f817-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7781enx5vpo_1745641159.html", "title": "Charity runner, 86, still loving her hospice fundraising mission", "title_page": "Charity runner, 86, still loving her hospice fundraising mission - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An 86-year-old charity runner said it was her \"mission\" to ensure other families get the same \"phenomenal\" care that her sister received at a hospice during the final weeks of her life.\nBarbara Thackray, from Altrincham in Trafford, only took up running 10 years ago to raise money for St Ann's Hospice in Cheadle, which had looked after her sister.\nSince then Barbara, who ran her 10th annual 10k race this weekend, has brought in more than £30,000 for the Stockport-based charity.\nThe octogenarian, who runs 10k twice a week, said she planned to keep running and fundraising as long as she can.\nFor this weekend's race along Middlewood Way, near Poynton in Cheshire, Barbara was joined by 22 friends and family members, including her nephew and late sister Audrey Humphreys' son.\nBarbara said: \"My mission is to raise money for St Ann's Hospice so other families can receive the care that we got with my sister.\"\nShe said the hospice provided her sister, who died in 1988 aged 56, and their family with \"phenomenal\" care.\nShe told BBC Radio Manchester: \"It's a wonderful cause and I'm prepared to do whatever I can to help them raise money.\n\"They really do the very, very best for someone who is at the end of life, and their family.\"", "url": "https://www.bbc.co.uk/news/articles/c7781enx5vpo"}