{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:39:35", "date_modify": "2025-04-26 04:39:35", "date_publish": "2025-02-28 09:20:49", "description": "The council was one of 30 councils awarded exceptional financial support to balance its budget.", "filename": "news_articles_cg700kyeyl2o_1745642375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6e5c/live/8dfcd120-f5b0-11ef-a811-33641fc5bb1f.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg700kyeyl2o_1745642375.html", "title": "Medway Council approves budget with 4.99% council tax rise", "title_page": "Medway Council approves budget with 4.99% council tax rise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Medway Council has approved a 4.99% council tax rise as part of its 2025/26 budget to meet the growing cost of providing essential services.\nOfficials said this includes social care for children and adults, those who are at risk of homelessness and services for children and young people with special educational needs and disabilities (SEND).\nThe council said it spends more than £1.1m every day for these services.\nAt a full council meeting on Thursday, councillors agreed to invest a further £40.339m in its children and adult social care and education services, including £17.5m extra funding for Medway's schools.\nThis year, Medway Council received an extra £11m from the Local Government Settlement for 2025/26, and this amount has been incorporated in its 2025/26 budget.\nCouncillors also agreed to invest almost £6.8m more directly into adult social care, another £4.6m into children's social care, £2m more on SEND and a further £1.7m to provide temporary accommodation for those at risk of homelessness in the next financial year.\nMedway was one of 30 councils awarded the Exceptional Financial Support scheme, meaning it can borrow more than £18m in 2025/26 from central government.\nAt the meeting, it was also agreed to increase council tax by 4.99% which equates to an increase of £1.68 per week for a Band D property, to a total of £1,842.32 per year.", "url": "https://www.bbc.co.uk/news/articles/cg700kyeyl2o"}