{"authors": ["Sarah Booker-Lewis", "Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 04:18:18", "date_modify": "2025-04-26 04:18:18", "date_publish": "2025-03-04 06:37:43", "description": "The council says these changes aims to address inequality and falling pupil numbers.", "filename": "news_articles_cvgenz6653mo_1745641098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5583/live/d0f90520-f844-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgenz6653mo_1745641098.html", "title": "Proposed changes to school admissions approved", "title_page": "Brighton: Proposed changes to school admissions approved - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has approved plans to change school admission arrangements in an attempt to address falling pupil numbers in Brighton.\nThe changes include reserving up to 5% of admission places in each of the city's community secondary schools for children from single-school catchment areas and prioritising children eligible for free school meals, up to 30% of admissions.\nLabour-led Brighton & Hove City Council voted through the changes with support from some Greens and independent councillors, while the Conservatives voted against the recommendations.\nThe proposed changes will affect children starting in year seven in September 2026.\nDeputy council leader Jacob Taylor said admission arrangements in Brighton & Hove had been largely unchanged for the past 18 years.\n\"These carefully considered decisions will allow us to build a better future for children and young people in Brighton and Hove,\" he said.\nThe authority will be changing the published admission numbers (PANs) at Longhill High School from 270 to 210, at Blatchington Mill School from 330 to 300 and at Dorothy Stringer School from 330 to 300, according to the Local Democracy Reporting Service.\nIt will also amend the catchment area boundaries for Longhill High, Dorothy Stringer School and Varndean School.\nFour preferences, rather than three, would be offered when applying for a secondary school place.\nConservative councillor Anne Meadows said: \"We understand the need to reduce places as the number of children going to our schools is declining.\n\"The 30% for each school to take free school meals children, plus an additional 5% as part of the open admissions, is premature, impetuous and rash.\"", "url": "https://www.bbc.co.uk/news/articles/cvgenz6653mo"}