{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:13:04", "date_modify": "2025-05-21 04:13:04", "date_publish": "2025-02-09 00:00:00", "description": "The US president says it will apply to all countries \"without exceptions\".", "filename": "news_live_cd7dwq87zvqt_1747800784.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cd7dwq87zvqt_1747800784.html", "title": "Trump announces 25% tariffs on all steel and aluminium imports", "title_page": "Trump announces 25% tariffs on all steel and aluminium imports - live updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A flurry of Trump comments, decisions and orders flood the US on Monday\nPhil McCausland\nReporting from New York\nThe US was hit with a wave of breaking news over the past few hours after a series of comments, decisions and orders were made and issued by President Donald Trump.\nHere's a quick recap of what has occurred in US politics today:\nTrump issued a 25% steel and aluminum tariff on all countries, raising fears of a potential trade war and increased consumer costs.\nThe president pardoned former Illinois governor Rod Blagojevich years after the Democrat was found guilty of political corruption charges\nActing Deputy Attorney General Emil Bove, a Trump appointee, told prosecutors to drop corruption charges against New York City Mayor Eric Adams - a Democrat who has met with Trump recently\nTrump gave his own deadline for the release of all Israeli hostages and threatened to end the fragile ceasefire in Gaza if Hamas didn't give in to his demands. However he said he had not yet talked to Israel about his idea for a deadline\nAnother executive order issued by Trump promoted the use of plastic drinking straws, rather than paper ones, rejecting sustainability efforts to reduce their use\nA federal judge in Massachusetts blocked the Trump administration's attempt to cut funding to the National Institutes of Health, which critics alleged risked necessary medical research and health centres\nEarlier, in what some experts considered a rebuke of the US Constitution, Vice-President JD Vance claimedthat US judges do not have the authority to stymie the Trump administration's executive power\nThese are just a few of the many news lines to come of out of the United States tonight. You can find more of our reporting on Trump's tariff decision here. You can read about Blagojevich's pardon here, and click here to read about Vance's comments that rattled some US Consitution experts.\nWe also have the latest on the status of Adams' case here, and keep up with the latest Gaza developmements here.\nWe're now pausing our live coverage. Thanks for joining us.\nCanadian leaders slam Trump tariffs\nCanadian leaders have been sharply critical of Trump’s new tariff plan, saying it will cost jobs on both sides of the border.\n“Today’s news makes it clear that perpetual uncertainty is here to stay,” says Candace Laing, the head of the Canadian Chamber of Commerce.\n“Businesses and investors already feel on shaky ground with the 30-day tariff pause, and now our steel and aluminium industries - critical to the shared success of both the American and Canadian economies - are first into the fire,” Lang said in a statement.\nDoug Ford, the Conservative Party premier of Ontario, was one of the first Canadian politicians to criticise Trump after the US president outlined his plan yesterday.\nToday he wrote that the tariffs will hurt American business “by raising prices and costing American workers their jobs.\n“America loses. Canada loses. China wins,” he posted.\nCanada is the leading importer of steel into the US, and the industry is heavily concentrated in Ontario, the country’s most populous province.\nDemocrats search for ways to counter Trump\nAnthony Zurcher\nNorth America correspondent\nDemocrats in Congress have been under increasing pressure from their constituents to find some way to derail Donald Trump’s push to slash government agencies, terminate programmes and advance conservative policies with the swipe of his presidential pen.\nAccording to the New York Times, congressional offices have received tens of millions of calls, swamping phone systems and overwhelming staff.\nOver the past few weeks, state-level Democrats have been filing lawsuits to try to block some of Trump’s executive orders – such as rescinding birthright citizenship, freezing federal grants and loans, and banning gender treatment for children.\nSenators Elizabeth Warren and Chis Murphy have generated media coverage with their public rallies to protest Trump’s actions.\nOn Wednesday, top congressional Democrats tried to show they were on the job, too. Hakeem Jeffries, the House minority leader, announced the creation of a “Rapid Response Task Force and Litigation Working Group” to oppose Trump’s actions.\nAnd Senate minority leader Chuck Schumer unveiled a website for federal workers to submit evidence of unlawful activities by Trump officials in their agencies.\nNew task forces and complaint boxes only go so far, however.\nDemocrats in Congress could have a better opportunity to make waves in the coming months, when Republicans will probably need their help to pass bills to keep the government running.\nThat’s when Democratic leaders might finally have some solid ground on which to fight.\nProsecutors told to drop corruption case against New York City mayor\nThe US justice department has told prosecutors to drop corruption charges against New York City Mayor Eric Adams.\nIn a memo seen by the BBC's US news partner CBS, Acting Deputy Attorney General Emil Bove, who was appointed by President Donald Trump to the role after defending him in Trump's criminal trial, instructed federal prosecutors in the Southern District of New York to end the case.\nAdams was indicted on five charges of bribery, conspiracy and campaign finance violations in September. He has pleaded not guilty.\nHe is accused of accepting illegal campaign funds and thousands of dollars in luxury travel benefits from Turkish businessmen and an official in exchange for his influence as mayor.\nProsecutors are yet to indicate whether they intend to drop the case as requested.\nAdams has spent time with President Trump and members of the administration and indicated his willingness to work with the White House on federal immigration raids, despite local sanctuary city laws that bar him from doing so.\nThe New York City mayor said he had not discussed his case when he met with the president.\nTrump says Musk will target Education Department in the next '24 hours'\nWhile we were bringing you that flurry of breaking news from Donald Trump in the Oval Office, a pre-recorded interview with the president was airing on Fox News.\nSpeaking with reporter Bret Baier, Trump claimed Elon Musk has guardrails with his work at Doge - he says the billionaire reports straight to the president, and Trump says he trusts Musk.\nTrump said Musk's unofficial Department of Government Efficiency (Doge) will turn its focus to the Education Department in the next 24 hours.\n\"I'm going to tell him very soon, like maybe in 24 hours to go check the Department of Education,\" Trump said. It's worth noting that this interview was recored on Sunday, and it is unclear if Trump has since ordered Musk to do this.\nDemocrats have accused Musk of personally benefiting from some of the changes that the Trump administration is trying to push through, such as the proposed closure of the US Agency for International Development (USAID).\nOn Saturday, a federal judge blocked Doge from accessing the personal financial data of millions of Americans in Treasury Department records.\nPeter Mandelson - the UK's new ambassador to the US - speaks to the BBC\nThe BBC's Sarah Smith spoke with new British Ambassador to the US, Peter Mandelson, earlier today. They discussed what the US-UK relationship will look like under a new Trump administration.\nMandelson acknowledged the relationship between the two countries is \"unique\" and said he wants to build on it.\n\"Each of us wants to grow our economies, and I think that what we need to do is to build a technology and investment relationship between the US and the UK that's fit for the 21st century,\" Mandelson said. \"So I'm looking at that very carefully indeed, and that's where I want to focus and make my plan.\"\nMandleson also noted Trump has \"a very strong or clear mandate for change in the United States\" and that might dictate how the UK approaches issues.\n\"Now that doesn't mean to say that we're going to agree in Britain with every single detail in what he does, but we have to respect and understand what drives him, what his mandate is to do, and how his allies need to adjust sometimes,\" he said.\n\"And I believe that given the relationship that we have, we can always make our views known... directly and privately, Mandelson added. \"We have a strong relationship that enables us to influence the president and his policies, where necessary.\"\nRead more on BBC's interview with Mandelson here.\nAmericans could face price hikes on canned goods due to steel tariffs\nNatalie Sherman\nNew York business reporter\nNew tariffs on steel could bring unexpected costs to consumers, experts say.\nFor example, it could lead to higher prices for canned goods at the grocery store, according to Robert Budway, president of the Can Manufacturers Institute, a US business group representing can-makers.\nThat's because about 70% of the steel used in the US to make cans for food and other drink is imported today, coming in from countries such as Germany, the Netherlands and Canada.\nHe said prices were already high for that kind of steel, the result of significant cutbacks in production in the US since 2018, when Trump announced tariffs to protect steel the first time.\nMany can-makers have won \"exclusions\" from those tariffs, over the objections of steel-makers, an acknowledgement by the government of the gap in US offerings.\n\"While the president may believe that these tariffs are protecting the steel industry, they certainly are undermining our food security and our supply resiliency for American canned food, which Americans rely on every day for delicious and convenient and affordable ways to feed their family,\" Mr Budway says.\nTrump says Hamas has until 12 o'clock on Saturday to release hostages\nTrump has given his own deadline for the future of the Gaza ceasefire deal.\n\"As far as I'm concerned, if all of the hostages aren't returned by Saturday at 12 o'clock - I think it's an appropriate time - I would say, cancel it and all bets are off and let hell break out,\" he said from the Oval Office.\nIt is unclear whether Trump meant midday on Saturday or midnight. It is also unknown which time zone he may have been referring to.\nTrump added that he expects all the hostages to be released, \"not in drips and drabs\".\nAsked by the BBC whether he intends for Israel to retaliate against Hamas when he says \"all hell will break out\", Trump said: “You’ll find out, and they’ll find out to. Hamas will find out what I mean.”\nWhen pressed on whether the US would be involved, Trump said: “We’ll see what happens.”\nHe also said it was \"just my deadline\", and he hadn't yet mentioned it to the Israeli prime minister.", "url": "https://www.bbc.com/news/live/cd7dwq87zvqt"}