{"authors": ["Marc Ellison", "www.facebook.com"], "date_download": "2025-05-19 14:46:27", "date_modify": "2025-05-19 14:46:27", "date_publish": "2015-02-19 16:35:21", "description": "When Police Scotland bosses gave evidence to a committee of MSPs about the force's stop-and-search data they revealed that 20,086 records were lost because a computer programmer \"pressed the wrong button\". But in a world of back-ups, and back-ups to the back-ups, could that really happen?", "filename": "news_uk-scotland-31539723_1747665987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81114000/gif/_81114635_delete_thinkstock.gif", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-31539723_1747665987.html", "title": "How easy is it to accidentally delete thousands of police records?", "title_page": "How easy is it to accidentally delete thousands of police records? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If today's meeting failed to resolve the stop-search debate, it did at least reveal the smoking gun behind the release of \"inaccurate\" data - or more accurately, the smoking geek.\nYes, you read that correctly.\nAssistant Chief Constable Wayne Mawson told members of the justice committee that 20,086 stop-search records were corrupted last year - the source of the recent furore over consensual searches on children - as a result of \"a computer programmer pressing the wrong button\".\nHe explained: \"They [the records] had been properly put on the system by the officers as a result of stopping and searching people, but we lost the outcome of it as a computer programming error.\"\nACC Mawson went on to say that the \"vast majority\" of that data was now back on the system - manually inputted, it has to be assumed.\nNow, as a former computer programmer myself, I question this.\nEven if it were that easy to delete thousands of records with one keystroke, most database management systems have a way to retrieve data - and, even if they didn't, why weren't back-ups made?\nIf \"Joe Public\" accidentally hit the delete button on their computer, they might turn to the IT whizz in the high street techie shop for help \"un-deleting\".\nAnd we know the police do some great investigative work catching the criminals found hiding in the dark side of the web.\nBut the computer system of Police Scotland appeared incapable of adequately storing 20,000 plus records.\nThe response by ACC Mawson must have done very little to assuage MSP Elaine Murray, who had originally asked how we can trust any data released by Police Scotland.\nHowever, credit must be given to Chief Constable Sir Stephen House who held his hand in the air, apologised, and acknowledged to the committee that his wording at last Friday's Scottish Police Authority meeting could have been \"more explicit\".\nSir Stephen told the watchdog that the police had been forced to hand over \"inaccurate\" stop-and-search data to the BBC by the Information Commissioner.\nBut following our stories which contradicted this claim, Police Scotland then issued a statement saying they had actually decided to proactively release the data on external legal advice.\nThroughout the Justice sub-committee meeting there was to be many a thrust and parry between MSP Alison McInnes and Sir Stephen.\nThe latter became increasingly testy when it was put to him that \"trust in the police was ebbing fast\".\nSir Stephen responded by saying \"I made a mistake… if I was hiding things, we wouldn't be attending SPA meetings\".\nAnd yet it's hard to take such a statement at face value when creative calculus was used to address the long-rumoured existence of targets around stop and search in Scotland.\nSir Stephen declared that if you divided the number of searches in 2014 by the number of police officers, you'd find that a single officer conducted 0.8% of one search last year.\nFunnily enough there was no mention of the two Inverclyde officers who conducted 1,631 and 1,086 searches last year, or another officer in East Ayrshire who had performed 1,091.\nPredictably though, while the hour-long meeting failed to bring about any resolution, it did at least un-muddy the waters a little and identify further areas for improvement.\nIf there are no back-ups to a system that loses data then my advice would be to mark that pesky keyboard button in red, and encase it in unbreakable glass to avoid any future errors.", "url": "https://www.bbc.com/news/uk-scotland-31539723"}