{"authors": ["Harriet Heywood", "www.facebook.com"], "date_download": "2025-04-26 06:38:08", "date_modify": "2025-04-26 06:38:08", "date_publish": "2025-02-26 06:22:04", "description": "While thankful for the support, one hospice says help is also needed to pay salaries.", "filename": "news_articles_c0l1z0yyp4jo_1745649488.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c15f/live/b16449d0-f3b3-11ef-8093-8707b98f6d80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0l1z0yyp4jo_1745649488.html", "title": "East of England hospices receive part of £100m funding boost", "title_page": "East of England hospices receive part of £100m funding boost - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hospices say they need more financial help to pay staff salaries, despite a £100m pledge for the sector from government.\nThe capital grant was welcomed by palliative care sites in the East of England, including St Helena Hospice in Colchester.\nChief executive Mark Jarman-Howe said the money would provide \"short-term budget relief\", but said funds were also needed for salaries \"which is where we need urgent help\".\nHe said hospices had to plan for additional National Insurance contributions from April as well as above inflation national minimum and living wage rises.\nHealth Secretary Wes Streeting made the funding announcement after hospices revealed how they had reduced their number of beds due to financial pressures.\nThe government said the capital grant was \"the biggest investment in a generation\" and would go towards improving buildings, equipment and accommodation.\nSt Helena Hospice is expected to receive £237,083.\nMr Jarman-Howe welcomed the grant but said: \"We cannot use this funding for salaries which is where we need urgent help.\"\nKevin Clements, chief executive of East Anglia's Children's Hospices in Suffolk, Cambridgeshire and Norfolk, echoed calls for a long-term funding model.\n\"This couldn't be more important for the children and families we care for,\" Mr Clements said.\nShe said with only 15% of total income coming from government, the \"public's donations and fundraising are more important to us than ever\".\nJames Sanderson, chief executive at Sue Ryder, said: \"We are encouraged by the prime minister's commitment to further improvements to end-of-life care in the upcoming 10-year plan for the NHS, and hope today's welcome boost indicates a long term commitment from this government to people at the end of life, which is so greatly needed.\"\nLiz Searle, chief executive of Keech Hospice in Bedfordshire, said the funding was \"extremely welcome\".\nBut she also said money was still needed to help pay staff.", "url": "https://www.bbc.co.uk/news/articles/c0l1z0yyp4jo"}