{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:14", "date_modify": "2025-05-19 15:38:14", "date_publish": "2015-02-24 11:40:50", "description": "More than 1,000 operations are thought to have been cancelled at a hospital which has been on \"black alert\" since January, hospital bosses say.", "filename": "news_uk-england-devon-31604096_1747669094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81214000/jpg/_81214906_80085270.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-devon-31604096_1747669094.html", "title": "Derriford Hospital cancels 1,000 ops during 'black alert'", "title_page": "Derriford Hospital cancels 1,000 ops during 'black alert' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "More than 1,000 operations are thought to have been cancelled at a hospital in Devon that has been on \"black alert\" since January.\nPlymouth Hospitals Trust said routine operations including hernia repair and knee and hip replacements had been cancelled at Derriford Hospital.\nThe Royal Devon and Exeter Hospital has increased its alert from red to black.\n\"Black alerts\" are also in place at the Royal Cornwall Hospitals Trust and Yeovil Hospital in Somerset.\nThe alert means a hospital's services are overwhelmed by demand.\nKevin Baber, chief operating officer for Plymouth Hospitals NHS Trust, said: \"In January we cancelled about 700 operations either on the day of surgery or in advance.\n\"I would expect February to be the same, so it will be over 1,000 and we're very sorry about that.\"\nMr Baber said: \"The patients that have attended our A&E department have needed to. We have not seen large numbers of patients attending who are inappropriate attenders.\"\nHe said he \"could not answer\" when the trust would not be on \"black alert\".With a fourth South West trust on black alert, the crisis afflicting the region's health service is deepening. The Royal Devon and Exeter (RD&E) and Yeovil are foundation trusts - a status awarded only to higher performing hospitals - yet even they are struggling to cope.\nThe fact that so many frail older people are in hospital adds to the strain. Latest figures show, in a single week, 361 patients couldn't be discharged from the RD&E because the care they needed wasn't in place.\nSally Mountjoy, BBC South West correspondent\nWith a fourth South West trust on black alert, the crisis afflicting the region's health service is deepening. The Royal Devon and Exeter (RD&E) and Yeovil are foundation trusts - a status awarded only to higher performing hospitals - yet even they are struggling to cope.\nThe fact that so many frail older people are in hospital adds to the strain. Latest figures show, in a single week, 361 patients couldn't be discharged from the RD&E because the care they needed wasn't in place.\nWhat is a black alert?\n•The NHS uses a national internal alert system based on the colours green, amber, red and black to rank how busy a local health and social care system is\n•Black alert status occurs when a hospital cannot cope with the number of people coming into the accident and emergency department because not enough people are being discharged\n•It effectively means the hospital does not have enough bed capacity to cope\nHe said the status remained so it could continue to \"focus on getting people home from hospital when they're ready to leave\".\n\"Some of the steps we have taken to reduce pressure include increasing the number of clinicians working in and supporting the emergency department, including a GP working during peak times and more social workers in the department to help discharge people,\" he added.\nThe local authority, Cornwall Council is funding a recruitment campaign for more care workers in response to the crisis.\nIn Somerset, Yeovil District Hospital said it was contacting those patients whose appointments had been cancelled.\nPaul Mears, chief executive, said 14 operations had been cancelled on Monday and Tuesday.\nTorbay Hospital has been on red alert for the past week and Dorset County Hospital is also on red alert - one level below black.", "url": "https://www.bbc.com/news/uk-england-devon-31604096"}