{"authors": ["George King", "www.facebook.com"], "date_download": "2025-04-26 07:27:58", "date_modify": "2025-04-26 07:27:58", "date_publish": "2025-02-27 19:41:00", "description": "Rogue trader Adam Fox, 35, is ordered to repay over £10,000 in compensation after pleading guilty.", "filename": "news_articles_cz7vvrx7vq4o_1745652478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c556/live/067dbc30-f535-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz7vvrx7vq4o_1745652478.html", "title": "'Manipulative' Suffolk gardener conned customers out of £35k", "title_page": "'Manipulative' Suffolk gardener conned customers out of £35k - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"manipulative\" rogue trader who conned his customers out of £35,000 has been given a suspended jail sentence and ordered to pay thousands of pounds in compensation.\nAdam Fox, of Primrose Hill, in Haverhill, Suffolk, defrauded 12 clients while operating under the name Foxy Landscaping and Gardening Maintenance.\nThe 35-year-old had previously pleaded guilty to fraudulent trading by a sole trader between August 2021 and October 2022.\nAt Ipswich Magistrates' Court, Fox was given a 12-month sentence, suspended for 24 months, and told he must repay more than £10,000 in compensation.\nThe court heard how Fox would ask customers for a 50% deposit, often totalling thousands of pounds ahead of carrying out any works.\nThe father-of-three would then either fail to complete the projects for which he had received payment or perform the tasks but to a \"poor quality\".\nOne victim employed Fox to do £10,000 worth of work in her garden, which she asked to be completed by June 2022 in time for a prom event for her daughter.\nShe paid a 50% deposit of about £5,000 upfront but said Fox would often leave early and the paving slabs he did lay turned out to be \"faulty\".\nHis workmanship was described as being so bad that she ended up having to pay out £14,000 for the work to be rectified, which finally took place in January 2023.\nOn another occasion, after taking a large payment from a customer, he repeatedly told them the delivery of the materials required for the job had been delayed.\nHis customer, however, grew suspicious and visited the suppliers of the materials herself, before being informed Fox had never actually placed an order with them.\nThe court was also told how another victim had been left feeling \"stupid\" and \"angry at herself\", having previously written articles about how to spot a rogue trader.\nAnother had told Suffolk Trading Standards they felt \"embarrassed\" after being scammed and \"no longer trusted any tradespeople because of Fox's behaviour\".", "url": "https://www.bbc.co.uk/news/articles/cz7vvrx7vq4o"}