{"authors": ["Kelly Ng", "www.facebook.com"], "date_download": "2025-04-26 04:32:46", "date_modify": "2025-04-26 04:32:46", "date_publish": "2025-03-03 03:58:13", "description": "Known as the 'man with the golden arm', James Harrison's blood contained a rare antibody that saved millions of lives.", "filename": "news_articles_c5y4xqe60gyo_1745641966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1410/live/93bba290-f7df-11ef-b5e9-ab8b0c7fd430.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y4xqe60gyo_1745641966.html", "title": "Australian whose blood saved 2.4 million babies dies", "title_page": "James Harrison: Australian whose blood saved 2.4 million babies dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the world's most prolific blood donors - whose plasma saved the lives of more than two million babies - has died.\nJames Harrison died in his sleep at a nursing home in New South Wales, Australia on 17 February, his family said on Monday. He was 88.\nKnown in Australia as the man with the golden arm, Harrison's blood contained a rare antibody, Anti-D, which is used to make medication given to pregnant mothers whose blood is at risk of attacking their unborn babies.\nThe Australian Red Cross Blood Service who paid tribute to Harrison, said he had pledged to become a donor after receiving transfusions while undergoing a major chest surgery when he was 14.\nHe started donating his blood plasma when he was 18 and continued doing so every two weeks until he was 81.\nIn 2005, he had the world record for most blood plasma donated - a title he held until 2022 when he was overtaken by a man in the US.\nHarrison's daughter, Tracey Mellowship, said her father was \"very proud to have saved so many lives, without any cost or pain\".\n\"He always said it does not hurt, and the life you save could be your own,\" she said.\nMellowship and two of Harrison's grandchildren are also recipients of anti-D immunisations.\n\"It made [James] happy to hear about the many families like ours, who existed because of his kindness,\" she said.\nAnti-D jabs protect unborn babies from a deadly blood disorder called haemolytic disease of the foetus and newborn, or HDFN.\nThe condition occurs at pregnancy when the mother's red blood cells are incompatible with that of their growing baby.\nThe mother's immune system then sees the baby's blood cells as a threat and produces antibodies to attack them. This can seriously harm the baby, causing severe anaemia, heart failure, or even death.", "url": "https://www.bbc.co.uk/news/articles/c5y4xqe60gyo"}