{"authors": ["Nicola Bryan", "www.facebook.com"], "date_download": "2025-04-26 06:49:47", "date_modify": "2025-04-26 06:49:47", "date_publish": "2025-03-01 08:59:34", "description": "Two academics share their experiences of alexithymia, which translates as \"no words for emotions\".", "filename": "news_articles_cg4ky5qgrlpo_1745650187.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e10/live/31a78fc0-ee1a-11ef-adce-87a43514d3f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg4ky5qgrlpo_1745650187.html", "title": "'Why I struggle to name my emotions'", "title_page": "Alexithymia: 'Why I struggle to name my emotions' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When most of us are stressed out we're able to intuitively name the emotion because of the way it makes us feel.\nBut when Dr Krysia Waldock is struggling it can take a bit longer for the penny to drop.\nThat's because they are one of up to 10% of the population, external that experiences alexithymia.\nThe word alexithymia derives from Greek and translates roughly as \"no words for emotions\".\nPeople who experience the phenomenon, which is not widely known about, can have difficulties expressing their emotions, recognising their emotions and telling the difference between different emotions.\n\"For me, a lot of the time it's struggling to know how I feel,\" said Dr Waldock.\n\"So something will happen, I'll know that there is a feeling, but I don't know what it is and it'll take me a while, if at all, to figure out what I'm feeling.\"\nIdentifying stress can be particularly challenging.\n\"Sometimes when I'm stressed or anxious, for example, I feel it in my body, feel it in my jaw a lot, I'll bump into things, drop things... I'll know something's out but I won't necessarily put two and two together,\" they said.\n\"So it will either take a very long time for me to put it together or it just will not be put together at all.\"\nDr Waldock, who uses they/them pronouns, is autistic. Research suggests autistic people are up to five times more likely to experience alexithymia compared to the general population.\n\"For me, it's part of being autistic and neurodivergent,\" they said.\nAlexithymia is closely related to interoception, which is the ability to interpret and label internal signals from your body such as when you are hungry, tired or need to go to the toilet.\nDr Waldock said on occasion they do not experience hunger cues so eat at set times to ensure they do not miss meals.\nDr Waldock is a research assistant at Swansea University and is currently working on a project that aims to better understand autistic people's reproductive health experiences throughout their life.\nTheir colleague, the project's research officer Dr Rebecca Ellis, also has autism and alexithymia.\nDr Ellis said the experience of alexithymia differed from person to person and was also more common among people with anxiety and depression.\nSome people have always had alexithymia whereas others acquire it through trauma, she said.\nShe said she struggled to tell the difference between feeling anxious and excited.\n\"Both of them can feel quite similar and quite uncomfortable as well,\" she said.\n\"If I went on a rollercoaster I'm just sat there worried so why would I go on it?\"\nShe also finds it hard to tell if she is apprehensive or looking forward to something.\n\"That's a big ball of confusion for me,\" she laughed.\n\"So even if it's a lovely social event that I'm looking forward to... I'm always kind of feeling a little bit positive and maybe a little bit negative about it.\"\nBoth Dr Ellis and Dr Waldock have found ways of working with their alexithymia.\nDr Ellis said asking others questions about how they are able to identity their emotions could be useful.\n\"It can be something that you can learn to get better at,\" she said.\n\"You can get an understanding of your emotions and feelings.\"\nDr Waldock uses an app called How We Feel which lists different feelings and definitions which they can use to help identify how they are feeling.\nBoth agreed being given a non-judgmental heads up from those close to them when they were acting differently could be useful.\nThere are no set diagnostic criteria for alexithymia so why is having a term like this useful?\n\"I think it allows you to be kinder to yourself,\" said Dr Ellis.\n\"Having that term not only means that more people than just yourself are experiencing it, but it also means that you and others can understand it a bit better too.\"\nDr Waldock agreed.\n\"As I've started learning about what it means to be autistic, and that includes experiences like alexithymia, it's really helped me get to know myself a bit better,\" they said.\n\"Growing up I was the square peg in the round hole scenario consistently whereas now I've stopped trying to push myself into that wrong hole as much.\"", "url": "https://www.bbc.co.uk/news/articles/cg4ky5qgrlpo"}