{"authors": ["Eleanor Maslin", "www.facebook.com"], "date_download": "2025-04-26 04:10:47", "date_modify": "2025-04-26 04:10:47", "date_publish": "2025-03-04 19:42:16", "description": "Glyphosate, is used by South Kesteven District Council (SKDC) to treat weeds on hard surfaces.", "filename": "news_articles_ce8yz0ezjy8o_1745640647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c398/live/d29cba40-f919-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yz0ezjy8o_1745640647.html", "title": "South Kesteven District Council plans to cut use of weedkiller", "title_page": "South Kesteven District Council plans to cut use of weedkiller - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council plans to cut back the use of a weedkiller after it was linked to safety concerns.\nThe pesticide glyphosate, used by South Kesteven District Council (SKDC) to treat weeds, has been linked to cancer and is harmful to wildlife, including bees, according to Pesticide Action Network UK (PAN).\nA SKDC report said the manufacturer of the product used by the council confirmed it \"is not harmful to animals or aquatic life if diluted and applied according to the manufacturer's instructions\".\nA recommendation will go to the council's cabinet for the continuation of SKDC's strategy to reduce the use of glyphosate on land it is responsible for maintaining.\nA report to a joint meeting of the Environment Overview Scrutiny Committee and the Rural and Communities Committee on Tuesday said SKDC's use of glyphosate was \"already minimal\".\nThe council's sustainability and climate change manager Serena Brown said in the report: \"When used responsibly glyphosate may have a lower environmental impact when compared to alternative herbicides which may require more frequent applications or have a higher toxicity.\n\"A complete ban could hinder the council's efforts to maintain tree populations, protect biodiversity and ensure successful amenity tree establishment and woodland creation.\"", "url": "https://www.bbc.co.uk/news/articles/ce8yz0ezjy8o"}