{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:50:39", "date_modify": "2025-04-26 06:50:39", "date_publish": "2025-03-01 07:40:12", "description": "Lyndon Longhorne, from Crook, says it has been \"one of the toughest things\" he has set himself.", "filename": "news_articles_cy83e489ejdo_1745650239.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d5b3/live/60d36950-f602-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83e489ejdo_1745650239.html", "title": "Crook Paralympian aiming to set triathlon record", "title_page": "Crook Paralympian aiming to set triathlon record - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Paralympian is aiming to become the first quadruple amputee to complete an Ironman Triathlon in less than 24 hours.\nLyndon Longhorne, from Crook, near Bishop Auckland, County Durham, will have to do a 2.4-mile (3.8km) swim, 112-mile (180km) bike ride, and 26.2-mile (42.2km) run as part of the challenge in September.\n\"This has been one of the toughest things that I ever set myself to do. Mentally, physically, it's pushing me on every level at the minute,\" Mr Longhorne, 29, said.\nThe swimmer represented Team GB in the 2020 Tokyo Paralympics before retiring from professional swimming last year.\nWhen he was just eight months old, Longhorne contracted meningitis, which caused him to lose his legs, right hand, and left fingers.\n\"Obviously, that's not stopped me,\" he said.\n\"It's just about showing that you have got the will power to push yourself forward.\"\nMr Longhorne's grandfather introduced him to swimming at the age of one - and by nine years old he was already competing.\nWatching the 2008 Beijing Olympics inspired him to become a Paralympic athlete.\n\"Little did I know that it was going to take about 12 years to actually get to that point,\" Mr Longhorne said.\n\"It's over a 100,000 hours probably that you've done in the water, to just get to that point of saying 'do you know what, I have reached the top level'.\"\nHe carried the Olympic torch during the relay for the London 2012 Games and made his debut Paralympic appearance at Tokyo 2020, finishing seventh in the 100m freestyle.", "url": "https://www.bbc.co.uk/news/articles/cy83e489ejdo"}