{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:37:48", "date_modify": "2025-04-26 07:37:48", "date_publish": "2025-02-27 13:59:46", "description": "Culture secretary Lisa Nandy was told about Reading FC's issues by Earley and Woodley MP Yuan Yang.", "filename": "news_articles_c14jjkv758eo_1745653068.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/65c6/live/3731dc20-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jjkv758eo_1745653068.html", "title": "Nandy 'appalled' by Badenoch's football regulator comments", "title_page": "Nandy 'appalled' by Badenoch's football regulator comments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The culture secretary has said she was \"appalled\" by Conservative leader Kemi Badenoch saying the planned new football regulator would be \"a waste of money\".\nLisa Nandy was told by Labour MP for Earley and Woodley Yuan Yang about the importance of establishing a regulator to secure the future of clubs, such as Reading FC, in a debate in the House of Commons.\nNandy said she would support Yang in \"the good fight for football fans\", adding: \"Like her, I was appalled by the comments of the leader of the opposition.\"\nBadenoch previously said she had spoken to people in the industry who \"don't think it's going to work\", adding: \"So why are we doing it?\"\nThe Football Governance Bill, which will establish a first independent regulator for the professional men's game in England, was initially tabled under the former Tory government in March 2024.\nIt was then reintroduced by the new government in October and is currently making its way through the House of Lords before being debated by MPs in the Commons.\nYang said the legislation was being \"held up\" by Conservative peers.\n\"I've been appalled to hear that the leader of the opposition sees an independent regulator as a waste of money,\" she said.\n\"Fans and staff in Reading will be able to tell the minister the importance of the need for a regulator, so will she visit the stadium in my constituency to meet with them in person?\"\nNandy replied: \"I would be delighted to support my honourable friend as she continues to fight the good fight for football fans in her constituency, and like her I was appalled by the comments of the leader of the opposition.\n\"The independent football regulator began life under the last government, it was in their manifesto, it was in our manifesto and we were elected on behalf of millions of football fans to deliver it.\"\nBadenoch previously said: \"I'm opposed to it personally and the party is looking at how we can improve the bill because we don't have the numbers in the Commons or even in the Lords to stop it.\n\"These are things which ended up becoming cross-party consensus, but are they actually making things better?\n\"People feel that a football regulator will help smaller clubs in towns and so on. That's why they're doing it.\n\"I understand the problem that they're trying to solve. I just don't think a football regulator will do it and I've always said so.\"", "url": "https://www.bbc.co.uk/news/articles/c14jjkv758eo"}