{"authors": ["Miles Davis", "www.facebook.com"], "date_download": "2025-04-26 06:51:46", "date_modify": "2025-04-26 06:51:46", "date_publish": "2025-02-28 17:36:09", "description": "Devon, Torbay and Plymouth councils have backed the idea of a strategic authority for all of Devon.", "filename": "news_articles_c5ymm1remmgo_1745650306.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cee7/live/7623b2c0-f5ed-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymm1remmgo_1745650306.html", "title": "Plans for three new councils and mayor for Devon", "title_page": "Plans for three new councils and mayor for Devon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Devon could be carved up into three unitary authorities with one elected mayor, according to the latest plans for local government reorganisation and devolution.\nSeven district councils have backed plans for the South Hams, West Devon, Teignbridge and Torbay to form one authority, with Plymouth expanding its borders as another unitary authority then Exeter, East Devon, Mid Devon, North Devon and Torridge joining up for a third.\nExeter has not signed up to the plan and its leader said he would continue to make the case for it standalone.\nDevon, Torbay and Plymouth councils have all backed the idea of a strategic authority for all of Devon with one elected mayor.\nThe government announced plans for a major redesign of local government across England in December.\nIt wants to sweep away all district and county councils and have only unitary authorities which would then band together to form strategic regional authorities with a directly-elected mayor.\nAll local councils in Devon have been asked to work together to come up with one plan for the reorganisation of local government.\nPaul Arnott, leader of East Devon District Council, said: \"Led by the geography, by certain economic causes as well - we've put together those geographies.\n\"They may well change as we move forward.\"\nBut the leader of Exeter City Council, Phil Bialyk, said he would \"continue to build the case for a unitary authority that includes the city of Exeter and is based on sensible geographical boundaries which are still being worked on\".\nBialyk said: \"We believe our proposals will be key to coordinating public service delivery, driving regeneration and strengthening community leadership and identity, for residents in the city and wider region.\"", "url": "https://www.bbc.co.uk/news/articles/c5ymm1remmgo"}