{"authors": ["Louise Cowie", "www.facebook.com"], "date_download": "2025-04-26 04:05:20", "date_modify": "2025-04-26 04:05:20", "date_publish": "2025-03-03 17:39:22", "description": "Sara Spencer underwent an investigation and was cleared of expressing her personal beliefs inappropriately.", "filename": "news_articles_c20d12lr7p4o_1745640320.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d172/live/d6eac440-f840-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20d12lr7p4o_1745640320.html", "title": "Trainee midwife suspended over anti-abortion views", "title_page": "Trainee midwife suspended over anti-abortion views - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A student midwife who was put on special leave from a placement with NHS Fife after posting her anti-abortion views on social media says she was worried her career was over before it had even begun.\nSara Spencer, 30, underwent a fitness to practice investigation and was cleared of expressing her personal beliefs inappropriately.\nThe mother-of-three, who is a US citizen, wants health boards to be more aware of freedom of speech rights.\nNHS Fife said the matter had been handled by Edinburgh Napier University, where Ms Spencer is studying.\nThe 30-year-old joined a private social media group for midwives and trainees which has thousands of members and responded to a question about whether midwives might opt out of providing terminations.\nShe shared the official guidance on conscientious objection and that she was anti-abortion.\nIn one comment, Ms Spencer said: \"Given that my moral beliefs include a foetus is a child and it it wrong to kill children, there is no circumstance in which I would not object to abortion.\"\nShe told BBC Scotland News: \"I was really happy to engage and present my views and kind of try to explain them.\n\"I knew I was engaging in a very emotive topic but I don't think I was quite prepared to be pulled aside at work by my line manager a week later.\"\nHer university put her on special leave from a community placement with NHS Fife and she was subject to a fitness to practice investigation.\n\"I felt like it brought back memories of being bullied and ostracised in grammar school,\" she said.\n\"Just three months into my training I felt like I was being told you're not welcome.\"\nIt was found that the 30-year-old had no case to answer and she was allowed to return to her studies in July.\nWhen she returned she successfully completed a hospital placement where she said she was welcomed by staff.\nNow on maternity leave, Ms Spencer hopes to return to her studies next year.", "url": "https://www.bbc.co.uk/news/articles/c20d12lr7p4o"}