{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:47:42", "date_modify": "2025-04-26 06:47:42", "date_publish": "2025-03-01 12:04:31", "description": "The arts group says plans will be integrated with Hugh Town's new cultural centre and museum.", "filename": "news_articles_cgkmmdmr407o_1745650062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1bab/live/65cc2020-f506-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmmdmr407o_1745650062.html", "title": "Culture on Scilly event plans under way as museum takes shape", "title_page": "Culture on Scilly event plans under way as museum takes shape - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cultural events and projects are being planned for the Isles of Scilly as the redevelopment of a town hall takes shape, an arts group has said.\nCulture on Scilly, funded by Arts Council England, said it would be working with newly formed charity Scilly Arts and Heritage on plans for St Mary's new museum and cultural centre.\nThe former town hall will be refurbished using £4.6m from the National Lottery Heritage Fund to house the Isles of Scilly museum and a performing arts venue.\nLydia Bassett, director at Scilly Arts & Heritage, said: \"We are working together and coming up with some really great ideas for events all year round.\"\nShe added: \"We're really excited to be working with Culture on Scilly this year as we plan for the opening of the town hall next spring.\n\"We still plan to keep working across all five islands once the new Cultural Centre and Museum is open, bringing live performances to the brilliant spaces on Tresco, Bryher, St Agnes and St Martins.\"\nCulture on Scilly said it was \"on the brink of announcing its 2025 programme of events on the islands\".\nIt said it had brought 15 shows to the Isles of Scilly across the last 12 months.\nThe group said it was providing arts access to young people on the islands and collaborations with schools had helped to build younger audiences.\nMs Bassett said the museum was set to open in 2026.", "url": "https://www.bbc.co.uk/news/articles/cgkmmdmr407o"}