{"authors": ["Lucy Tegg", "www.facebook.com"], "date_download": "2025-04-26 04:10:54", "date_modify": "2025-04-26 04:10:54", "date_publish": "2025-03-04 19:29:43", "description": "The Bluebird cafe in Wedmore hands out grants to local good causes to celebrate anniversary.", "filename": "news_articles_cpv44ln1wxyo_1745640654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ade2/live/64eca240-f5da-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv44ln1wxyo_1745640654.html", "title": "Wedmore cafe marks anniversary with charity giveaway", "title_page": "Wedmore cafe marks anniversary with charity giveaway - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Somerset cafe and music venue is celebrating its second anniversary by giving away grants to local good causes.\nBluebird Café and Bar in Wedmore, Somerset, first opened at the end of May 2023, and hosts live music events, comedy nights and quizzes.\nIt is also a hub for local groups like the WI and Men's Shed to meet.\nOne of the cafe owners, Ian Scott, said: \"The local community has continued to support us this year and we are delighted to again be able to give money back to support local worthwhile causes.\"\nThe venue said its aim is to support its community and emerging local musicians by offering grants to sports teams, schools, youth organisations and health groups.\nLast year, on its first anniversary, café owners Andy Daintree and Ian Scott donated grants worth £10,000.\nThis year, they plan to distribute funding to the successful applicants during a presentation evening at the Bluebird on Thursday 22 May.\nMr Daintree said: \"The concept of the Bluebird is 'community at our heart'.\n\"Our principle is to support the local community wherever we can, by being a place local groups can meet or individuals, groups and families can come and enjoy the friendly welcoming atmosphere.\"", "url": "https://www.bbc.co.uk/news/articles/cpv44ln1wxyo"}