{"authors": ["Edward Rowe", "www.facebook.com"], "date_download": "2025-04-26 04:26:58", "date_modify": "2025-04-26 04:26:58", "date_publish": "2025-03-03 11:16:28", "description": "Henry Maina is a software engineer originally from Kenya, now living in Gloucester.", "filename": "news_articles_c8d4154vq07o_1745641618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1dfb/live/e55b0480-f80f-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d4154vq07o_1745641618.html", "title": "Man living in UK for 30 years in legal bid to bring family", "title_page": "Man living in UK for 30 years in legal bid to bring family - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man from Kenya who has lived in the UK for 30 years is taking the next step in a long and expensive legal battle to bring his wife and family here.\nHenry Maina got married in 2020 and said he had spent £25,000 trying to bring his family together, including his daughter and his wife's two sons from a previous relationship.\nThe family is now taking the case to the Upper Tribunal court after their appeal was rejected.\nThe Home Office said they could not comment on individual cases while a legal process was ongoing.\nMr Maina, who is a software engineer living in Gloucester, said being apart from his family was \"devastating\" as they were \"virtually living two lives.\"\nHe and his wife Mary Njeri Kiarie met in Kenya in 2019, getting married in 2020 in the UK - but Mrs Njeri Kiarie had to return to Kenya when her visa expired.\nThe couple have since had a daughter but have not lived together for five years.\n\"It's been difficult, us virtually living two lives, them over there and me over here,\" Mr Maina said, adding it had been a stressful time for the whole family.\n\"Jayna, my little one, sometimes she cries over the phone, she wants to come here and be with me.\"", "url": "https://www.bbc.co.uk/news/articles/c8d4154vq07o"}