{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 03:46:42", "date_modify": "2025-05-21 03:46:42", "date_publish": "2025-04-07 00:00:00", "description": "The US president revealed details while sitting alongside the Israeli prime minister at the White House.", "filename": "news_live_c1menr8xnk9t_1747799202.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b430/live/fda8d2a0-13ea-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1menr8xnk9t_1747799202.html", "title": "Trump says the US is having direct talks with Iran", "title_page": "Trump says the US is having direct talks with Iran - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trump says high-level meeting with Iran will happen Saturday\nUS President Donald Trump met with Israel's Prime Minister Benjamin Netanyahu, the first world leader to visit the White House since Trump announced a wave of tariffs on global trading partners last week.\nHere are the key takeaways from the day:\nTrump says the US is engaged in direct talks with Iran, adding they have a \"very big meeting\" on Saturday\nHe says that Iran \"can't have a nuclear weapon\", and that Iran will be in \"trouble\" if the talks don't progress well\nTrump also says the US and Israel are working on a deal to return the hostages from Gaza, after a fragile ceasefire with Hamas broke down\nNetanyahu says they are working on Trump's \"vision\" for Gaza, after Trump again suggests taking \"the Palestinians and move them around to different countries\". The US president calls Gaza an \"important piece of real estate\"\nOn tariffs, Trump says he has no plans to pause the measures - find the latest updates on our tariffs live page\nWe're now ending our live coverage of Netanyahu's visit. But you can stay up to date on the US talks with Iran here.\nWhat just happened?\nNetanyahu and Trump just finished taking questions in the Oval Office from reporters. Here's what happened:\nTrump announced that the US will have direct talks with Tehran this Saturday over Iran's nuclear ambitions.\nThe US president told reporters a deal with Iran \"would be really great\" and said the meeting between the two countries would happen at \"almost the highest level\".\nNetanyahu told reporters the US and Israel are working on another deal to release the hostages and described Trump as a \"good partner\" in the attempts to free the hostages.\nDespite the conversation's focus on happenings in the Middle East, Trump couldn't avoid tariffs and told reporters many countries want to negotiate deals with the US. He cited Japan as an example, but he also emphasised China will see an additional 50% tariff if it doesn't rescind reciprocal tariffs.\nStick with us and we'll bring you the latest.\nTrump doesn't answer directly when asked about tariffs on Russian goods\nTrump is asked about a meeting with Russian President Vladimir Putin, and why the US has not announced tariffs on Russian goods.\nHe doesn't directly answer the question, but says that the reason the US is not implementing tariffs in Russia is because \"we're not doing business with Russia\".\nHe adds that he is \"not happy\" with Russia or \"all the bombing that's been going on for the last week or so\".\nTrump again talks about moving Palestinians \"around to different countries\"\nTrump calls Gaza an \"incredible piece of important real estate\", and says that a United States peace force \"controlling and owning\" the Gaza Strip would a good thing.\nHe again suggests taking \"the Palestinians and move them around to different countries\" - which would add to a painful history of forced displacement.\nIn their place, Trump says he would create \"a freedom zone\" in Gaza.\nAt the moment, the Gaza Strip is \"a great location that nobody wants to live in\", he says.\nHouthi attacks to continue until they stop firing at US ships, Sec Hegseth says\nTrump moves on to discuss US attacks on the Houthis, he says \"we've really damaged them\".\nThe president says that \"we've put a major hurt on\" on the Iranian backed armed group in Yemen.\nHe adds that they \"they don't know what to do\" and claims the US has killed \"many of their leaders and their experts\", including missile-production specialists.\nTrump then hands over to Secretary of Defense Pete Hegseth, who says the attacks on Houthis will continue until they agree to stop firing on US ships in the Red Sea.\nHe says they have also told Iran to not support the Houthis.\nTrump says \"big meeting\" coming with Iran over nukes\nTrump is speaking again, addressing the subject of Iran's nuclear ambitons.\nHe says they are having direct talks with Tehran over the issue, adding that they will have a \"very big meeting\" on Saturday.\nTrump says \"doing a deal would be preferable to doing the obvious\" - without spelling out what exactly that means.\nBut he does say that this \"obviously\" is not what he and Israel want to \"be involved with\" if it can be avoided. Trump notes that the situation is getting into \"very dangerous territory\".\nHe adds that it would be in Iran's best interest for the talks to be successful.", "url": "https://www.bbc.com/news/live/c1menr8xnk9t"}