{"authors": ["Elise McGinley", "www.facebook.com"], "date_download": "2025-04-26 03:38:32", "date_modify": "2025-04-26 03:38:32", "date_publish": "2025-03-04 22:55:09", "description": "Hannah Howie was a year away from getting married when a revelation from the past turned her life upside down.", "filename": "news_articles_cgl0zzj299jo_1745638712.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ab1/live/0b9aaec0-f919-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgl0zzj299jo_1745638712.html", "title": "A family tree BRCA gene revelation may have saved my life", "title_page": "A family tree BRCA gene revelation may have saved my life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hannah Howie was a year away from getting married when a revelation from the past turned her life upside down.\nThrough research into her ancestry and family tree, her brother-in-law made an alarming discovery.\nLuke Emerton found that a number of women on the paternal side had died from breast cancer at a young age - including Hannah's grandmother.\nThis led to the 34-year-old having genetic testing and finding out she had a faulty gene, which dramatically increases the risk of certain cancers.\nLuke told BBC Scotland News how he stumbled upon the discovery.\nHe said: \"We were trying to pull together a family tree for Hannah's dad for his birthday and we found there was a line of female relatives on her dad's side who had died of breast cancer at a young age.\n\"We clocked it with her gran, Agnes, who died at 33.\n\"Then we started noticing a pattern.\"\nHe said the enormity of his discovery had yet to hit home.\nLuke said: \"Looking back, it's so strange how all of this has come from that one gift.\n\"I'm so glad we found out this way and that Hannah knows about it and can act on decreasing the risk.\n\"The fact she has been able to pre-empt all of this is incredible.\"\nProf Zosia Miedzybrodska, of the University of Aberdeen, described BRCA 2 as a \"huge gene\" and said it could mutate and go wrong \"in many ways\".\nAnd she said the percentage difference between male and female cancers was \"quite significant\".\n\"The risk increase for a woman with breast cancer is anywhere up to 85%,\" she said.\n\"For prostate cancer it's 27% and for male breast cancer it's 10%.\n\"The only way you know if you have the faulty BRCA 2 gene is if there is a history of breast, prostate or ovarian cancer in the family.\"\nCruise ship entertainer Hannah booked an appointment to discover if she had the gene, which also dramatically increases the risk of ovarian cancer.\nShe told BBC Scotland News: \"I had to find out if I had the faulty BRCA 2 gene.\n\"Some people don't want to know but for my sanity, I really had to know.\"\nA few weeks later, in November 2023, it was confirmed that Hannah had the BRCA 2 gene.\nShe immediately switched to survivor mode.\nHannah added: \"When I heard the news, there were so many treatment options available.\n\"I knew I had to pick the one that would give me the most longevity in my life.\n\"The life I lead is too good to let it go.\"\nThe entertainer said she had little doubt about what to do.\nShe said: \"The doctor explained the biggest risk averter would be going for a double mastectomy and reconstructive surgery.\n\"If I go for this option, the breast cancer risk drops from 85% to 5%.\n\"It was a no-brainer for me. It was what I had to do.\"\nHannah is due to go for a double mastectomy next week to remove the breast tissue and reduce her risk of breast cancer.\nThis will be followed by reconstructive surgery in the next few months.\nBreast cancer surgeon Dr Liz O'Riordan said: \"The reason we can't say the percentage of BRCA 2 is 0% after the surgery is because it's impossible to know if we have removed all breast tissue.\n\"It's like removing seeds from an orange. You can't be certain you've got them all.\n\"Even after surgery, our patients are told to be hypervigilant in checking themselves.\n\"You can't be too careful when checking your body for any lumps or bumps.\"\nHannah, who is just a year older than her late gran was when she died, is receiving her treatment through the NHS.\nShe is being supported by her husband, Graeme McLean, who she married in December last year.\nHannah said: \"I had started thinking about children.\n\"If I have them, I run the risk of passing the gene onto them.\n\"Did I really want the possibility of my future children having to go through the same as me?\"\nHannah, who is from Edinburgh but now lives in Motherwell, said she was overwhelmed at the thought of that happening.\nShe added: \"That's when I decided I would start taking my life day-by-day, hour-by-hour and minute-by-minute.\n\"I had to for my sanity.\"\nTo cope with the life-altering development Hannah has written and starred in a cabaret called A Funeral for My Boobs.\nShe said: \"I know it's something many would look at negatively.\n\"Looking at it positively has really helped me come to terms with it.\n\"I call it A Fun-eral for My Boobs because to me it just feels like I'm welcoming the next chapter of my life.\"\nIn the meantime, she said she is thankful for the \"geekiness\" of her brother-in-law whose research changed everything.\nShe said: \"Mentally and physically, knowing has been a huge game-changer.\n\"I've had to rethink my entire future but knowing this has allowed me to pre-empt and prepare for it.\n\"That's a luxury not a lot of people have.\"", "url": "https://www.bbc.co.uk/news/articles/cgl0zzj299jo"}