{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:42:33", "date_modify": "2025-04-26 07:42:33", "date_publish": "2025-02-26 19:46:34", "description": "In Gloucestershire, Princess Anne praises the community's \"quite extraordinary\" response to flooding.", "filename": "news_articles_cly6z4133g3o_1745653353.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d34c/live/54792e30-f47a-11ef-996c-13462f77b475.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6z4133g3o_1745653353.html", "title": "Lydney: Princess Anne 'shocked' by Storm Bert flood damage", "title_page": "Lydney: Princess Anne 'shocked' by Storm Bert flood damage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents in a storm-hit town have said the Princess Royal was left \"shocked\" by the devastation caused to their homes by flooding.\nPrincess Anne visited Lydney, in the Forest of Dean, which saw around 50 homes flooded in November 2024 during Storm Bert.\n\"She couldn't believe it. She was saying: 'How can you live in this?',\" said 82-year-old Carol Pritchard, who told the princess she is still living in a caravan due to damage in her house.\n\"Your response has been quite extraordinary,\" the Princess Royal told residents and business owners.\nMs Pritchard said she had been flooded seven times since January 2008, with Storm Bert causing the most devastation - leaving 3ft (91cm) of water downstairs in her home.\nMrs Pritchard invited Princess Anne, who was holding a black umbrella, to come into her home to see the impact, which she accepted.\nSpeaking afterwards, Mrs Pritchard said: \"I wanted to show her exactly what I am up against, all the time.\n\"She was shocked. She couldn't believe it.\n\"It will be put back together again, but I'm convinced it will happen again.\"\nMrs Pritchard was initially living in temporary accommodation following the floods.\nBut the properties were booked for Christmas, meaning she had to buy the caravan to live in with her cocker spaniel Alfie, 14, in December.\n\"It's estimated that I will be back in my home in around May,\" she added.\nThe 74-year-old princess was welcomed to the high street where a number of shops and businesses are still boarded up due to damage.\nShe was shown repairs and building work at businesses, including a dance studio, and joined a reception of emergency services and council workers in a room used for respite during Storm Bert.\nAt the conclusion of her visit, the princess unveiled a plaque which will be placed on the bridge when repairs are completed, and gave a short speech paying tribute to the community for their support of each other.\n\"Your response has been quite extraordinary,\" she said.\n\"I hope that people will learn the right lessons and give you the help you so clearly need.\n\"There is no doubt that the very distinct place that Lydney is has its advantages in terms of your ability to cope.\"", "url": "https://www.bbc.co.uk/news/articles/cly6z4133g3o"}