{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:49:15", "date_modify": "2025-05-21 07:49:15", "date_publish": "2025-03-28 00:00:00", "description": "In response, a White House National Security Council spokesperson says governance in Ukraine is determined by its constitution and people.", "filename": "news_live_crrdrw9gx8vt_1747813755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ccc6/live/20d7c260-0b9c-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_crrdrw9gx8vt_1747813755.html", "title": "Ukraine war live updates: Putin suggests interim government for Ukraine with UN support", "title_page": "Ukraine war live updates: Putin suggests interim government for Ukraine with UN support - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pressure mounts on Russia, as Ukraine accuses Putin of derailing path to peace\nImogen James\nLive reporter\nWe're now pausing our live coverage on the war in Ukraine, after Russian President Vladimir Putin last night suggested there should be an interim government in Ukraine, under the support of the UN.\nHe said that elections could then be held to hand power to a \"capable government\" to begin peace talks.\nMeanwhile, European leaders argued for more pressure on Russia to bring about an end to the war.\nThe head of Ukrainian President Volodymyr Zelensky's office says Russia is \"trying to derail the path to peace by choosing to continue the war\".\nOn the ground fighting continues, as one person was killed in Russian strikes on Donetsk, the regional leader says. The air force adds that 163 drones were shot down overnight.\nAttacks on Russia continued, with its air force claiming to intercept 78 Ukrainian drones.\nFor more, international editor Jeremy Bowen has explained more on why Europe will struggle to guarantee Ukraine's security. Thanks for joining us.\nRussia claims to have 'strategic initiative' on Ukrainian frontline\nRussian President Vladimir Putin has claimed that Russian forces have the \"strategic initiative\" along the Ukrainian front line and says his army have a reason to believe that they \"will finish them off\".\nSince the full scale invasion three years ago, Russian forces have slowly expanded the amount of territory they control.\nMost of this is in the east of Ukraine, but Ukrainian forces have recently successfully recaptured a village in the Luhansk region.\nIn addition, Russia crossed the border to the north of Ukraine's second-biggest city, Kharkiv, in May 2024. Several villages were seized and thousands of civilians fled.\nUkrainian forces eventually held firm and even though the city of Kharkiv has come under repeat attacks from glide bombs fired by Russian warplanes, it remains beyond the range of Russian artillery.\nThe Russian advance towards Pokrovsk is the most notable change in control of the front line near Donetsk for several months, but innovative tactics by Ukrainian forces have inflicted significant losses of troops and equipment, slowing the offensive.\nUkraine in maps: Tracking the war with Russia\nPutin again denies legitimacy of Ukrainian government, despite martial law\nOnce again, Putin is denying the legitimacy of Ukraine's President Volodymyr Zelensky.\nThis time, he has called for an interim government, supervised by the UN. Putin refuses direct peace talks with Zelensky \"because of his illegitimacy\".\nZelensky said previously that Putin had initially tried to replace him with the wealthy head of a pro-Russian party, Viktor Medvedchuk, who was accused of treason in Ukraine, and is now in Russia.\nUkraine is currently under martial law - the replacement of civilian government by military rule - which keeps being extended as the war continues. This means elections cannot be held.\nPresident Zelesnky's time in office should have ended but he cannot call an election whilst under martial law. He has promised to hold one as soon as the conflict is over.\nOur Ukraine correspondent, James Waterhouse, has looked into what is keeping Zelensky in power despite his expired term\nWhat has Putin said?\nPutin has suggested an interim government in Ukraine under the support of the UN, and adds that elections could then be held to hand power to a \"capable government\" to begin peace talks.\nThe Russian president suggests the UN's supervision would be in place \"in order to hold a democratic election [in Ukraine], in order to bring in a competent government trusted by people\".\nHe also says that Russia will then hold talks about a peace treaty with that government, and \"sign legitimate documents which would be recognised worldwide and be reliable and stable\", according to Russian state media agency Tass.\nCiting examples of the UN's involvement in East Timor, New Guinea and parts of former Yugoslavia, Putin says \"such practice does exist\".\nHe adds: \"Technically, it is possible to discuss the possibility of introducing interim governance in Ukraine under the UN auspices with the United States, with European countries, naturally, with our partners and friends.\"\nPutin calls for interim government in Ukraine as pressure for peace mounts\nImogen James\nLive reporter\nHours after European leaders agreed to go further to secure peace in Ukraine, Russia’s President Vladimir Putin has suggested an interim governance in the country under the support of the UN.\nThe Russian president says the transitional governance under UN support could pave the way towards talks on the end of the conflict.\nHe adds that the government would be supervised by the UN until an election could be held to hand power to what he calls a \"capable government\".\nYesterday in Paris, it was announced by the leaders of the UK and France, in a meeting of the \"coalition of the willing\" that more pressure would be put on Putin to end the war. UK Prime Minister Keir Starmer accused Vladimir Putin of \"playing games and playing for time\".\nStarmer argued for a deadline to broker a ceasefire deal, and said Europe must go further to support the peace process, including increasing sanctions.\nAs talks continue, so does the war. Overnight, Russia launched strikes in Dnipro, Nikopol, Pokrovsk and Marhanetska, damaging an infrastructure facility, according to the local governor.\nRussia's defence ministry says it intercepted 78 drones from Ukraine.\nOur team of writers and correspondents across the region will bring you the latest updates and analysis as pressure mounts for a path to peace.", "url": "https://www.bbc.com/news/live/crrdrw9gx8vt"}