{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:10:53", "date_modify": "2025-04-26 08:10:53", "date_publish": "2025-02-26 12:14:26", "description": "Mark Williamson used a teenage chatroom in what a judge calls a \"deliberate piece of targeting\".", "filename": "news_articles_cvgel4we750o_1745655053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/539c/live/65beecb0-f435-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgel4we750o_1745655053.html", "title": "Washington man caught at Sunderland station meeting girl for sex", "title_page": "Washington man caught at Sunderland station meeting girl for sex - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man was caught waiting at a train station for a 14-year-old girl he had wanted to meet for sex, a court has heard.\nMark Williamson, 47, thought he was talking to the teenager in a chatroom but it was actually a decoy profile run by online child abuse hunters, Newcastle Crown Court heard.\nWilliamson was confronted by the group outside Sunderland station having deluged the girl with sexual messages before inviting her to meet him there.\nHe was jailed for two and a half years after admitting attempting to engage in sexual communications with a child and arranging the commission of a child sexual offence.\nWilliamson was posing as a 19-year-old when he began messaging the \"girl\" on a chatroom for teenagers on Chat Avenue on 16 November, prosecutor Stuart Graham said.\nHe quickly became sexual, telling the \"girl\" she was \"stunning\" and asking for pictures of her legs and feet, the court heard.\nWilliamson, of The Gables in Washington, Sunderland, said he wanted to travel to Portsmouth where he believed the \"girl\" lived and take her to a bed and breakfast for sex.\nWhen the \"girl\" said she feared sex would hurt, he said he would be \"gentle\" but it would be their \"secret\", the court heard.\nHe also sent her pictures of his crotch while asking for pictures of her in return, Mr Graham said.", "url": "https://www.bbc.co.uk/news/articles/cvgel4we750o"}