{"authors": ["Patrick O'Hagan", "www.facebook.com"], "date_download": "2025-04-26 07:54:50", "date_modify": "2025-04-26 07:54:50", "date_publish": "2025-02-25 12:56:46", "description": "West Berkshire Council is in discussions with neighbouring local authorities over joining forces.", "filename": "news_articles_cly6zj3338yo_1745654090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/86e7/live/6d380070-f373-11ef-80a6-edca8054bafc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6zj3338yo_1745654090.html", "title": "West Berkshire Council bids for devolution merger", "title_page": "West Berkshire Council bids for devolution merger - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council is in discussions with a number of its neighbours about the possibility of joining forces as it looks into different options to deliver local government reorganisation.\nWest Berkshire is talking to Berkshire's five other councils - Bracknell Forest, Reading, Slough, Windsor and Maidenhead, and Wokingham councils, as well as South Oxfordshire and Vale of White Horse in Oxfordshire, as part of a government shake-up of local government, external.\nIt said merged authorities could pool resources and provide a better service to residents.\nWest Berkshire Council's leader Jeff Brooks said: \"In Berkshire we are no stranger to reorganisation, having seen the county council disbanded through local government reforms almost 30 years ago.\"\nMr Brooks continued: \"We evolved successfully then to meet the challenges of the time and we shall do so again now - together with, and on behalf of, local people.\"\nWest Berkshire provides services to about 170,000 people but the government wants councils to be much bigger, covering a population of 500,000 instead.\nThe government also wants local authorities to provide it with initial proposals by 21 March, before handing over final plans by the end of November.", "url": "https://www.bbc.co.uk/news/articles/cly6zj3338yo"}