{"authors": ["Charlotte Gallagher", "www.facebook.com"], "date_download": "2025-04-26 04:02:38", "date_modify": "2025-04-26 04:02:38", "date_publish": "2025-03-04 00:01:37", "description": "Khalid Abdalla says he will be interviewed by police after the rally in January.", "filename": "news_articles_cy05jeq2rv2o_1745640158.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1dc/live/0fe8ad60-f86f-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05jeq2rv2o_1745640158.html", "title": "Khalid Abdalla: The Crown actor faces police interview over pro-Palestinian rally", "title_page": "Khalid Abdalla: The Crown actor faces police interview over pro-Palestinian rally - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Actor Khalid Abdalla says he has been told to attend a police interview following a pro-Palestinian protest in January.\nAbdalla, who played Dodi Fayed in Netflix series The Crown, said on social media he had received a letter from the Metropolitan Police on Thursday.\nThe Metropolitan Police confirmed to the BBC that eight people had been \"invited to be interviewed under caution at a police station\" as part of an \"ongoing investigation into alleged breaches of Public Order Act conditions on Saturday 18 January\".\nIn an Instagram post, Abdalla said it remained to be seen if charges would result, adding that \"the right to protest is under attack in this country\".\nAbdalla, who also starred in United 93, The Kite Runner and The Day of the Jackal, is one of Hollywood's most outspoken actors on the Gaza-Israel war. He has publicly called for a permanent ceasefire.\nThe actor has attended several pro-Palestinian demos, including the one on 18 January he will be interviewed by the police about.\nAnd he was a signatory to the Artists for Palestine UK open letter to the BBC in February, criticising the corporation's decision to pull a documentary about children's lives in Gaza after it discovered its 13-year-old narrator was the son of a Hamas official.\nAbdalla is not the first public figure to face a police interview following the January rally.\nThe former Labour leader Jeremy Corbyn and former shadow chancellor, John McDonnell, have already been questioned by officers.\nThe Met has not identified the pair but said at the time that two men, aged 75 and 73, had subsequently been \"released pending further investigations\".\nA static rally involving several thousand people took place in Whitehall after police blocked plans to hold a march from Portland Place, near the headquarters of the BBC.\nPolice said conditions had been clearly communicated that those taking part in the protest should remain in Whitehall.\n\"Despite this, a large group made its way from Whitehall into Trafalgar Square and in some cases attempted to go further.\"\nPolice said that a number of people in that group have been arrested on suspicion of breaching the conditions - and that so far, 21 had been charged.", "url": "https://www.bbc.co.uk/news/articles/cy05jeq2rv2o"}