{"authors": ["Kevin Connolly", "www.facebook.com"], "date_download": "2025-05-19 14:23:11", "date_modify": "2025-05-19 14:23:11", "date_publish": "2015-03-16 11:02:54", "description": "Israeli Prime Minister Benjamin Netanyahu is fighting for his political survival in Tuesday's elections, but despite his party lagging in polls he may well still emerge the victor, says the BBC's Kevin Connolly.", "filename": "news_world-middle-east-31902940_1747664591.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81668000/jpg/_81668415_81668414.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31902940_1747664591.html", "title": "Israel election: An end or new era for Netanyahu?", "title_page": "Israel election: An end or new era for Netanyahu? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The coming week promises to be one of the most eventful and most unpredictable in the long and bumpy political life of Benjamin Netanyahu.\nThe man revered by his supporters as a global statesman and sniffily dismissed by one Israeli newspaper as \"former furniture salesman\" will know by the end of it if he is to remain prime minister of Israel.\nHe triggered Tuesday's election - the second in two years - after he decided that his right-of-centre coalition government was not working.\nThe plan was for a swift return to office at the head of a reshuffled coalition.\nThe final polls before voting day suggest that things may not be going to plan.\nThey give the Zionist Union - an alliance of Yitzhak Herzog's Labour Party and the Hatnuah movement headed by former Foreign Minister Tzipi Livni - a clear lead over Mr Netanyahu's Likud.\nThat does not necessarily spell disaster for Mr Netanyahu. He could finish second and still be invited to form the next government if Israel's President Reuven Rivlin decides after consulting other party leaders that he is best-placed to do so.\nWorse still perhaps would be an outcome so close that President Rivlin decides that the right and left should come together in some sort of government of national unity.\nThat would involve Mr Netanyahu and Mr Herzog rotating the job of prime minister - a bitter prospect for the Likud leader, who talks of government by the Left as a kind of doom-laden apocalyptic nightmare.\nThe strange thing is that the prospect of defeat has crept up on Mr Netanyahu.\nIt is hard to pinpoint when the momentum began to shift - there was certainly no game-changing individual moment of drama. There was no head-to-head debate, for example.\nThe closest we came was a rather awkward broadcast in which Israeli Channel 2 was switching directly from an interview with Yitzhak Herzog who was in the studio to a second, separate appearance by Mr Netanyahu, who was joining by video-link.\nFor a few minutes, a giant Netanyahu loomed over a life-sized Herzog as the presenter encouraged the prime minister to ask his opponent a question.\nIt may have irritated Mr Herzog and amused the audience but it fell some way short of the kind of exchange that might have helped undecided voters to make up their minds.\nBut because his image features so heavily in his party's poster and video effort, it has still felt like a presidential campaign.\nThe opposition leader Yitzhak Herzog said: \"This is a referendum on many issues that bother Israeli public, we're a very vibrant democracy and people sometimes forget that. But yes, it's a referendum whether we will continue having Netanyahu or change, which I represent.\"\nAnyone writing about an election the day before polling is bound to be a little cautious but it really is true that no-one should write Mr Netanyahu off.\nHe is a known quantity - only the founder of the state, David Ben-Gurion, has served longer as prime minister. And he is seen as being strong on his signature national security issues like the Iranian nuclear threat.\nHis intelligence minister, Yuval Steinitz, told me: \"Netanyahu is an extremely capable, experienced and competent leader... If he had to choose between being loved but not appreciated or being appreciated but not so much loved he would prefer to be appreciated for his performances and capabilities.\"\nBut other video visions of Mr Netanyahu are available too.\nTo the producers of the waspish satirical TV show Wonderful Country he is a rather slick song and dance man.\nIn one of their most memorable programmes the actor portraying him (complete with luxuriant comb-over) mugged his way through a big production number in which giant cartoon pistachio ice-creams appeared on screen dancing along.\nThat was a not-very-subtle reference to persistent stories that the Netanyahus have something of a taste for high-living at the taxpayer's expense.\nThe bill for pistachio ice-cream at an official residence was much-discussed for a while.\nTo his supporters that was the liberal media again having a go at a man who has the courage and determination to protect his country's interests on the global stage whatever the wider world might think.\nThe voters will choose between those different interpretations this week.\nMr Netanyahu's fate hangs in the balance - but only a fool would write him off just yet.\nThis long election campaign got more interesting as polling approached - it may get more interesting still after all the votes are counted.", "url": "https://www.bbc.com/news/world-middle-east-31902940"}