{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:38:37", "date_modify": "2025-04-26 03:38:37", "date_publish": "2025-03-04 22:51:27", "description": "The 65-year-old singer said he decided to halt touring due to his age.", "filename": "news_articles_c0rzvv1njjno_1745638717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b846/live/d0f8a830-f90e-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rzvv1njjno_1745638717.html", "title": "Edwyn Collins announces final tour", "title_page": "Singer Edwyn Collins announces final tour - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Edwyn Collins will stop performing live after a farewell tour later this year.\nThe 65-year-old singer - best known for 1995 hit single A Girl Like You - said he decided to halt touring due to his age, but would continue to record new material.\nIn 2005 he went into a coma after having a stroke and two haemorrhages, but recovered and was able to resume his music career.\nThe Edinburgh-born singer first gained attention in the 1980s with influential indie-pop band Orange Juice, before embarking on a solo career later in the decade.\nCollins told BBC Scotland News he had decided the run of dates in September and October would be his last because \"I'd be a very old man by the time the next one [tour] rolled around, and that's not for me.\"\nThe singer added that he would miss \"the audience love, my beautiful band and crew\".\nHe said he would keep making music as \"I can't stop writing and recording. For fun, you know?\".\nCollins was left unable to walk, talk or read after the stroke and haemorrhages in 2005, and spent several months in hospital after a surgical scar became infected with the MRSA bug.\nHowever, he recovered enough to release a further five albums, including the forthcoming Nation Shall Speak Unto Nation - his 10th overall release.\nThe 11-track album was recorded at his Clashnarrow Studio in Helmsdale, the Sutherland village where he has lived for many years with his wife Grace.", "url": "https://www.bbc.co.uk/news/articles/c0rzvv1njjno"}