{"authors": ["Vanessa Buschschlüter", "www.facebook.com"], "date_download": "2025-04-26 08:06:27", "date_modify": "2025-04-26 08:06:27", "date_publish": "2025-02-26 14:37:02", "description": "Millions of people in Chile had their routines disrupted by an almost nationwide power cut.", "filename": "news_articles_c3w182z9868o_1745654787.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eb34/live/9880f150-f446-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w182z9868o_1745654787.html", "title": "Chile power cut: 'We were trapped like sardines in the dark'", "title_page": "Chile power cut: 'We were trapped like sardines in the dark' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than eight million households across Chile were left without power on Tuesday afternoon after an electricity transmission line failed, cutting off the electricity supply to much of the country.\nIn the capital, Santiago, the entire underground train system was suspended almost immediately. Thousands of people had to be evacuated and stations were plunged into darkness.\n\"We were like sardines in the dark,\" one passenger described the moment their underground train stalled.\nMany of those who had been in lifts inside the stations when the power cut happened had to be freed by firefighters.\nOne woman in her 70s was trapped in a lift between two floors in a building in Santiago.\nShe told local media that she had \"kicked the door\" of the lift to draw attention to her plight and her screams eventually alerted the concierge.\n\"I'm brave, I told myself 'I'm not going to die here',\" she said.\nVideos shared on social media also showed metro passengers using their mobile phones' flashlights to find their way out of dark stations.\nAccording to Metro de Santiago, the evacuation of the underground was completed 90 minutes after the power cut - but disruption caused by the outage carried on for many more hours.\nThe 150 extra buses deployed to ferry passengers were not nearly enough to make up for the suspension of the metro, which transports an average of 2.3m passengers every day.\nLong queues formed at bus stops, where passengers grew increasingly angry when packed buses did not stop.\nTheir numbers soon swelled with workers sent home early because most offices were paralysed by the lack of electricity.\n\"The power went out at 3:00pm, so we had no power at all,\" one shopkeeper in Santiago said. \"People started closing up at around 4 or 5pm.\"\nTraffic in the capital was further disrupted by the failure of several traffic lights.\nA truck collided with a car at one crossing where the traffic lights were out and there were reports of at least one other accident also caused by the lack of functioning traffic lights.\nWith the gridlock getting worse, thousands of people were forced to walk to their destinations in summer temperatures of around 30 Celsius (86 Fahrenheit).\nOne of them, Sharon Ortiz, a 28-year-old waitress, told AFP news agency that the public transport system had \"collapsed\".\n\"I got to work two hours late, I got stuck in the middle of the Costanera [shopping centre] and from there I had to walk,\" she said.\nSome people hitched lifts on the back of trucks.", "url": "https://www.bbc.co.uk/news/articles/c3w182z9868o"}