{"authors": ["Steve Beech", "Tom Oakley", "www.facebook.com"], "date_download": "2025-04-26 06:54:03", "date_modify": "2025-04-26 06:54:03", "date_publish": "2025-02-28 16:18:50", "description": "Charles Hanson has been on trial at Derby Crown Court charged with multiple offences.", "filename": "news_articles_ce8mmm7vl00o_1745650443.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/113e/live/9cb88a20-f5ff-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8mmm7vl00o_1745650443.html", "title": "TV auctioneer cleared of assaulting wife", "title_page": "Charles Hanson: TV auctioneer cleared of assaulting wife - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "TV auctioneer Charles Hanson has been cleared of assaulting his wife and using controlling or coercive behaviour against her.\nThe Bargain Hunt and Antiques Road Trip expert was found not guilty of coercive control and assault allegations relating to his wife Rebecca Hanson.\nOn Friday, a jury returned a unanimous not guilty verdict on all counts following a trial at Derby Crown Court.\nMr Hanson, 46, of Ashbourne Road in Mackworth, Derby, had been accused of using violence towards his wife over a 10-year period, including pushing, scratching and grabbing her.\nThe celebrity auctioneer's parents, who were sitting in the front row of the public gallery, wept and hugged their son after he was discharged from the dock.\nJudge Martin Hurst thanked the jurors for their care in considering the case.\nHe then told Mr Hanson: \"You have been found not guilty. That is the end of the case. You will hear no more about it and you are free to go.\"\nJurors deliberated for about four and a half hours before acquitting the antiques expert.\nSpeaking outside court following the hearing, Mr Hanson said being cleared was \"a delight\".\nHe added: \"[The last 18 months] have been extremely upsetting.\n\"I've missed my children and quite simply I can now get back to my life, and I relish that.\n\"I've experienced a long time of upset and I always believed in justice, and here we are today, the sun is shining and I can start my life again.\n\"[The trial has] been very impactful and I'm very lucky that my parents have stood by me from start to finish. Without my family it would have been a very testing time.\n\"To anyone who knows me, who's believed in me, who's supported me, who's messaged me, to everybody out there - thank you.\"", "url": "https://www.bbc.co.uk/news/articles/ce8mmm7vl00o"}