{"authors": ["Danai Nesta Kupemba in London and Emery Makumeno in Kinshasa", "www.facebook.com"], "date_download": "2025-04-26 07:32:12", "date_modify": "2025-04-26 07:32:12", "date_publish": "2025-02-27 16:38:34", "description": "Videos show chaotic scenes with bodies on the streets in Bukavu, a city recently captured by the rebels.", "filename": "news_articles_c8d4467y5dno_1745652732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4aa9/live/8370b050-f51a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8d4467y5dno_1745652732.html", "title": "DR Congo conflict: Gunfire and explosions at rebel rally in Bukavu", "title_page": "DR Congo conflict: Gunfire and explosions at rebel rally in Bukavu - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gunfire and explosions have ripped through a rally held by rebel leaders in a city they recently captured in eastern Democratic Republic of Congo.\nVideos show chaotic scenes with bodies on the streets after the crowd fled the rally in Bukavu, the second-biggest city in the east, in panic.\nCasualty figures are unclear, but AFP news agency has quoted a hospital source as saying that at least 11 people have been killed and 60 others are wounded.\nThis was the first rally that the Rwanda-backed rebels were holding in Bukavu since taking the city from government forces earlier this month following a rapid advance through the region.\nThe rebels accused President Felix Tshisekedi's government of orchestrating the attack.\nHowever, Tshisekedi blamed it on \"a foreign army\" that he said was operating in the east.\nThe rally had earlier been addressed by Corneille Nangaa, the head of the alliance of rebel groups that includes the Rwanda-backed M23.\nHe promised the crowd that the rebels would bring safety and security to the city.\n\"There will be special units and patrols that will take place in all the communes,\" he was quoted as saying by Reuters news agency.\nIt is believed that Nangaa and Bertrand Bisimwa of M23 had already left when the attack took place at Bukavu's main square.\nIn a statement, Nangaa said that two people had been apprehended in connection with the attack, and a search was under way for other suspects.\n\"This cowardly and barbaric act will not go without consequences,\" he said.\nThe rebels have been advancing through eastern DR Congo since January, seizing Bukavu and Goma, the biggest city in the region.\nThe fighting has forced about 500,000 people from their homes, worsening an already dire humanitarian crisis, according to the UN.\nThe African Union and the UN have called for a ceasefire and for the rebels to withdraw from areas they now control.\nRwanda used to deny backing the M23, but recently it has adopted a more defensive line, saying fighting near the border between DR Congo and Rwanda is a threat to its security.\nUN experts have previously estimated that between 3,000 and 4,000 Rwandan troops are in eastern DR Congo.", "url": "https://www.bbc.co.uk/news/articles/c8d4467y5dno"}