{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 07:27:08", "date_modify": "2025-04-26 07:27:08", "date_publish": "2025-02-27 20:44:29", "description": "Officer X, based in Worcestershire, made searches on his brother-in-law on police systems in 2011.", "filename": "news_articles_cp9yykj81xeo_1745652428.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f115/live/b5be2590-f549-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp9yykj81xeo_1745652428.html", "title": "PC to keep job after gross misconduct verdict", "title_page": "West Mercia PC to keep job after gross misconduct verdict - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer has been allowed to keep his job after a panel decided he had committed gross misconduct by carrying out searches on his ex brother-in-law on West Mercia Police systems.\nThe man, known only as Officer X, based in Worcestershire, broke down in tears as he was given a final written warning at Wednesday's conclusion.\nThe three-day hearing detailed allegations that he had carried out searches into his ex-wife, as well has his ex brother-in-law, who was sentenced to 10 years in prison for raping a child.\nThe searches took place in April 2011.\nA panel of three decided that West Mercia Police had not proven, on the balance of probabilities, that Officer X had carried out eight other searches without a policing purpose.\nHowever, Assistant Chief Constable Grant Will said the one incident was enough for them to conclude that the officer had breached police standards on orders and instructions, confidentiality, and discreditable conduct.\nHe described the searches as \"an abuse of position\".\nHe said the officer would be under a final written warning for four years, and added that the decision was consistent with \"maintaining public confidence\" in the police.\nThe panel was also told that Officer X had received a written warning in 2024, after taking part in a \"childish\" sweepstake on when a female officer would leave a department that dealt with sex offenders.\n\"I have had a considerable time to reflect and never wish to find myself in this position again,\" the officer said.\n\"I was clearly a very different person then,\" he added.\nThis news was gathered by the Local Democracy Reporting Service, which covers councils and other public service organisations.", "url": "https://www.bbc.co.uk/news/articles/cp9yykj81xeo"}