{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:53:35", "date_modify": "2025-04-26 07:53:35", "date_publish": "2025-02-25 13:52:10", "description": "Man sentenced to five years for Wiltshire rape in 2021.", "filename": "news_articles_cwygjdj9pevo_1745654015.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3cc2/live/2bcb3bb0-f374-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygjdj9pevo_1745654015.html", "title": "Dorset rapist jailed after woman recorded attack on phone", "title_page": "Dorset rapist jailed after woman recorded attack on phone - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been jailed after a woman recorded him raping her on her mobile phone.\nStephen Appleby, 61, of Diana Way, Corfe Mullen, Dorset, was sentenced to five years in prison when he appeared at Bournemouth Crown Court on Monday.\nThe incident took place in Wiltshire on 5 September 2021. The victim's mobile footage was used as evidence at Appleby's trial, which resulted in a guilty verdict in December.\nIn a statement read to the court, the victim said: \"This is a lifetime sentence for me and one I will carry forever.\"\nShe added she felt \"great relief\" knowing she was believed.\n\"I am going to gain some freedom in knowing that Stephen will be sent to prison.\n\"However, I know this freedom will only last as long as his sentence,\" she said.\nWiltshire Police's Det Sgt Roxanne Whitton thanked the victim for her \"huge courage to report the incident\".\nShe added during the long judicial process, the victim was supported by police officers, Horizon and independent sexual violence advisors.\n\"I hope this sentence will be a solace for her and that she can continue her journey in moving on and learning to enjoy her life again.\n\"I also hope that the sentence sends a message to people who have been a victim that you are not alone, report to the police and we will listen and we can signpost you to other support,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cwygjdj9pevo"}