{"authors": ["Rob Trigg", "Andy Giddings", "www.facebook.com"], "date_download": "2025-04-26 07:41:04", "date_modify": "2025-04-26 07:41:04", "date_publish": "2025-02-27 12:01:52", "description": "Shropshire council says the £215m road will reduce congestion and journey times in the town.", "filename": "news_articles_cr722zpz902o_1745653264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d0d5/live/c31a1d30-f4f8-11ef-a2a8-e1b826ae43ce.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr722zpz902o_1745653264.html", "title": "Protests as council sets out case for Shrewsbury relief road", "title_page": "Protests as council sets out case for Shrewsbury relief road - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A planned relief road would be a major economic boost to Shrewsbury, Shropshire Council has said.\nIt has published a revised business case for the North West Relief Road, which estimates the scheme would cost £215m.\nEnvironmental campaigners held a protest before it was presented to a meeting at Shrewsbury's Guildhall on Thursday.\nOpposition parties announced earlier this month they would scrap the scheme if they take control of the authority after May's local elections.\nThe draft Full Business Case updates a similar document published in November and sets out the possible benefits of the relief road.\nThe council said it would reduce congestion in the town and shorten the average journey time across northern Shrewsbury by 17 minutes.\nIt said this would also free up space on the roads for public transport and make it easier to walk and cycle.\nThe council's business case estimated that for every £1 spent on the scheme, it would deliver economic benefits worth £3.88.\nIt said this ranked the transport scheme among those categorised as being \"high value in the country\".\nThe leader of the Conservative-run authority, Lezley Picton, said the draft document made a \"very strong case to the UK government for support and investment\".\nShe also said the £38m of government money already spent on the plans would be wasted if it did not go ahead.\nBut because local council elections are due to be held in May, there will be no chance for councillors to discuss the Full Business Case before the summer.\nOpposition councillors attending the meeting on Thursday said they were furious the document was published 35 minutes before it was due to be held.\nSome said they only discovered it had been published during the meeting.\nLiberal Democrat, Labour and Green groups have all said they want the scheme scrapped, claiming it is too expensive and will not solve traffic problems.", "url": "https://www.bbc.co.uk/news/articles/cr722zpz902o"}