{"authors": ["Tom Espiner", "www.facebook.com"], "date_download": "2025-04-26 06:14:34", "date_modify": "2025-04-26 06:14:34", "date_publish": "2025-03-02 00:52:04", "description": "People are being \"priced off\" the railways, one group says, as ticket prices in England and Wales rise by 4.6%", "filename": "news_articles_cp9yy0zzjd1o_1745648074.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9024/live/c1c4c9b0-f5e5-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp9yy0zzjd1o_1745648074.html", "title": "Rail fares: Ticket prices rise by 4.6% in England and Wales", "title_page": "Rail fares: Ticket prices rise by 4.6% in England and Wales - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The latest increase in rail fares in England and Wales is set to pile \"further misery on hard-pressed households\", a campaign group has said.\nFrom Sunday, regulated rail fares in England and Wales have risen by 4.6% and the price of most railcards has increased by £5.\nThe government says fares need to rise so it can invest in the rail system, but Transport Secretary Heidi Alexander acknowledged passengers were \"frustrated\" by delays and cancellations.\nThe Campaign for Better Transport said people were being \"priced off the railways\" by fare increases.\nThe rail fare rise for regulated tickets includes most season tickets covering commuter routes in England, which can cost thousands of pounds.\nSome off-peak returns on long-distance journeys, and flexible tickets for travelling in and around cities will also rise.\nTrain operators set their own prices for unregulated fares, but these tend to increase by a similar amount to regulated fares, including on lines that have already been renationalised.\nAbout 45% of train fares are regulated in England, Wales and Scotland, but the 4.6% rise relates to travel in England and Wales, external only.\nIn Scotland, rail fares are set to increase by 3.8% in April.\nIn Northern Ireland, the nationalised Translink service said no decision had yet been taken by the Department for Infrastructure on whether rail fares will go up in 2025.\nThe cost of most railcards has also gone up by about £5, from about £30, but disabled railcards remain the same price.\nThe Campaign for Better Transport said the fare increases would add to the pressure on households, coming on top of higher food and energy costs.\nMichael Solomon Williams, head of campaigns at the group, said high ticket prices were the \"number one barrier to getting more people travelling by rail\", and called on the government to bring down fares as part of rail reforms.\n\"People are being hit hard,\" he told the BBC. \"People want to take the train and they're being priced off the railways.\n\"At the same time fuel duty's being frozen. Government has the choice, it can choose to intervene.\"\nThe campaign group said out of 40 commuter routes into London, annual season tickets for three will top £6,000 for the first time, with 10 others already there.\nAnnual season tickets from Canterbury and Southampton into London will go up by more than £300 to £7,100 and £7,477 respectively.\nAdrian Rose, 50, from Sittingbourne in Kent says hiking rail fares when they are already \"crazily expensive\" is not justifiable.\nFor him and his wife and two daughters to drive from Kent to see relatives in Newcastle is no more than £100 in fuel for the family, whereas to go by train can cost more than £400 if booking close to the departure date.\n\"The cost is prohibitive,\" he says.\n\"I would happily take the train, but for over four times the cost? I could have a week's holiday for that money.\"\nBut Celia Downie, who uses the train regularly for work and leisure, says she will continue to do so \"however much it costs\", because \"I can work on the train and I believe it is environmentally proper to do so\".\nBut the 68-year-old from Bristol, who has a Senior Railcard, also believes prices are too high for families and says sometimes the experience of cramped carriages is \"absolutely appalling\".\nHeidi Alexander said she understood passenger frustration that fares keep rising \"despite unacceptable levels of delays and cancellations\".\nHowever, she said it was the lowest absolute increase in fares for three years.\n\"We inherited a railway that was not fit for purpose, and I know it will take time for trust to be restored, with trains turning up on time, when and where they're needed.\"\nAlex Robertson, chief executive of watchdog Transport Focus, said its research had found a \"a clear mismatch between ticket prices and the service people receive\".\n\"This needs to change,\" he added, saying that passengers \"rightly expect... to see improvements for the money they have paid\".", "url": "https://www.bbc.co.uk/news/articles/cp9yy0zzjd1o"}