{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:19:50", "date_modify": "2025-05-19 15:19:50", "date_publish": "2015-02-11 12:28:08", "description": "Controversial plans for a cable car up the Malvern Hills with a cafe at the highest point are proposed.", "filename": "news_uk-england-hereford-worcester-31409970_1747667990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80930000/jpg/_80930639_looking-down.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-hereford-worcester-31409970_1747667990.html", "title": "Malvern Hills cable car and beacon-top cafe plan proposed", "title_page": "Malvern Hills cable car and beacon-top cafe plan proposed - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Controversial plans for a cable car up the Malvern Hills with a cafe at their highest point have been proposed.\nMalvern for All, a not-for-profit company, is proposing building a cable car running from the Rose Bank Gardens in Great Malvern to just below the summit of the Worcestershire Beacon.\nThe eight mile (13km) hill range is an Area of Outstanding Natural Beauty, protected by an act of Parliament.\nThe Malvern Hills Conservators will consider the plans on Thursday.\nThe conservators were established under the Malvern Hills Act in 1884 and manage over 1,200 hectares (3,000 acres) of land on the hills and commons in and around the town.\nRoger Sutton, from Malvern for All, said it plans to use a park and ride system to ferry visitors to the cable car.\n\"We have done our sums on the extra money the visitors would bring into the town and we reckon it's worth £1.5m to local shopkeepers,\" he said.\nThe Mayor of Malvern, Julian Roskams, believes a cable car would \"spoil the hills\".\n\"The idea of bringing an extra half a million visitors into the town with an already creaking infrastructure I don't think really adds up,\" he said.\nMalvern Hills Conservators said more than 70 people had contacted their office about the plan, with all but two voicing \"very strong opposition\".\nDirector Stephen Bound said comments had come in \"thick and fast\" both from people born in Malvern and those who have moved there largely because of the beauty of the hills.\n\"Both groups are incredibly concerned about the impact that buildings and pylons will have on this special landscape and on the sense of wilderness that they value so highly,\" he said.", "url": "https://www.bbc.com/news/uk-england-hereford-worcester-31409970"}