{"authors": ["Indy Almroth-Wright", "www.facebook.com"], "date_download": "2025-04-26 03:39:38", "date_modify": "2025-04-26 03:39:38", "date_publish": "2025-03-05 11:10:30", "description": "The four turbines are said to be capable of generating enough electricity for 5,200 homes.", "filename": "news_articles_c1d4n1kendpo_1745638778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3f0/live/a0449df0-f9ab-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4n1kendpo_1745638778.html", "title": "Dorset: Quarry wind farm in Wareham starts generating power", "title_page": "Dorset: Quarry wind farm in Wareham starts generating power - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A four-turbine wind farm built in a quarry has become the first of its kind to begin generating power in Dorset.\nAlaska Wind Farm at Masters Quarry in East Stoke, near Wareham is said to be capable of providing enough electricity for about 5,200 homes each year.\nAfter being tested one by one for several weeks, energy firm Infinergy said the second hand 125m (410ft) Vestas turbines, bought from a wind farm in Belgium, are up and running.\nThe wind farm has taken over 20 years to become a reality and is expected to be operational until 2045.\nThe project is a partnership between the renewable energy developers and landowner, Will Bond.\nA spokeswoman for Infinergy said: \"We are delighted to see it up and running.\n\"When you are working on a project for over 20 years you wonder if there is a time when you will ever get there... but we have done it.\"\nShe added the project had seen a number of challenges including the construction stage of the turbines taking longer than anticipated due to grid connection delays.\nThe only other working wind turbine in Dorset is thought to be the single 60m (196ft) turbine at Rogershill Farm, Bere Regis, built in late 2012.\nPortWind, a large-scale wind farm off the Devon and Dorset coast, is being planned by Norwegian firm Source Galileo.\nIt could see 132 turbines erected about 22 km (14 miles) off the coast connected to the grid through a substation at Chickerell near Weymouth, Dorset.\nThe energy firm claims the offshore farm would be able to produce enough electricity for more than three million homes.", "url": "https://www.bbc.co.uk/news/articles/c1d4n1kendpo"}