{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:35:14", "date_modify": "2025-05-21 05:35:14", "date_publish": "2025-01-05 00:00:00", "description": "Flood alerts are issued after snow disruption in Liverpool, Manchester and Lancashire.", "filename": "news_live_cx2vdq4vgdvt_1747805714.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cx2vdq4vgdvt_1747805714.html", "title": "Fresh disruption after more snow in north-west England", "title_page": "Fresh disruption after more snow in north-west England - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all for now - thanks for joining us\nWe're pausing our coverage at this stage, but rest assured we'll be back with more updates if weather conditions deteriorate again.\nThanks for following this page. You can read more weather updates from around the region and the wider UK on the BBC News website.\nAlso, listen to BBC Radio and a range of podcasts across BBC Sounds.\nSnowy scenes in Stockport\nThese were the snowy scenes in a rural part of Stockport this morning.\nFootprints and tyre tracks were seen in the snow down a country road in Mellor.\nRail services and replacement buses hit by snow\nPeople travelling on Merseyrail's Ormskirk line are advised to make alternative travel arrangements where possible with no rail services or replacement buses running between Maghull and the town.\nReplacement buses have been requested but due to the poor weather conditions none are currently available, the operator said.\nServices on the network in Cheshire are also affected.\nFlooding on the Chester Line between Hooton and Capenhurst means train services will be terminated at - and started back from - Hooton. A rail replacement bus service is operating.\nAnd part of the Ellesmere Port line is blocked due to a tree on the line at Port Sunlight. Train services will be terminated at Rock Ferry and a rail replacement bus service also in place there.\nFor the latest information visit the Merseyrail website, external\nLiverpool John Lennon Airport to re-open\nLiverpool John Lennon airport is to re-open from 10:30, officials have said.\nThe airport was closed due to snow and teams have been working to clear the runway.\nIn a statement on X, external, the airport said the terminal is now \"fully open\" but the \"runway remains closed for snow clearing\" but \"anticipated\" the full opening time would be at 10:30.\nCouncil services disrupted in Wirral\nThere is disruption to a number of council services in Wirral following heavy snowfall, the council has said in a post on X, external.\nAll special educational needs transport has been cancelled and families are being contacted directly.\nSome schools are closed and parents will be advised through email or their own social media channels, the authority said.\nBin collections were also suspended today and street cleansing services will not take place.\nSchools closed again due to snow and ice\nSeveral schools have been forced to close in Lancashire again due to the fresh snowfall\nLancashire Council Council said more than 15 sites had been shut for the day in Nelson, Burnley and Rossendale.\nA college in Oldham has also shut its doors.People are urged to check their local council website for more information.\nRegionwide yellow warning in place for snow and ice\nA yellow weather warning is in force for snow and ice across the wider region.\nThe Met Office, external said it began at 17:00 on Monday and is active until 10:00.\nFurther afield, it also covers parts of the West Midlands, Wales and the the South West.\nLucky the spaniel puppy enjoys frolic in snow\nStewart Whittingham\nBBC News, Manchester\nOn only his only second time seeing snow, my cocker spaniel puppy barked and then nervously licked the thick layer of white stuff in our garden in Manchester earlier.\nLike many, we awoke to find a fresh dusting of snowfall in the southern suburb of Northenden.\nWearing his green coat to keep out the chill, Lucky raced after his yellow ball.\nBut he then decided the snow was more interesting as he gave it a chomp before racing away to eat some of a fading snowman which had collapsed from yesterday's shennanigans.\nIt was then quickly back inside to dry off his paws.\nSnow closes Liverpool John Lennon Airport\nLiverpool John Lennon Airport has closed while snow is being cleared.\nThe hub also said de-icing would need to take place, with the airport expected to re-open at 10:00.\nPosting on X, external, a statement said: \"Safety is our uppermost priority so thank you for your patience whilst we clear the concrete surfaces and runway before re-opening.\"\nFallen tree blocks Merseyside road\nJenny Coleman\nBBC News, Liverpool\nThis was the scene along Okell Drive in Halewood, Knowsley, earlier, where a fallen tree is blocking the way.\nSeveral vehicles have crashed through the trunk after it obscured the road on a dark bend near to the Halewood Triangle Park.\nI saw a car and a van hit it while I was there at 7:45.\nMerseytravel buses have been rerouted but other bus companies which use the route are unaware and are turning around in a nearby car park.\nThankfully nobody was injured and the police are aware.\nRail service hit by flooding on the tracks\nSome Merseyrail services near Chester have been cancelled due to flooding.\nThe firm said \"due to flooding between Hooton and Capenhurst, train services will be terminated at and started back from Hooton\".\nA rail replacement bus service is operating between Chester and Hooton, calling at all stations.\n'Act now' flood warnings remain in place\nThe Environment Agency has said several \"act now\" flood warnings remain in place in parts of Cheshire.\nThey cover the River Bollin and Agden Brook in Little Bollington, and the Sankey Brook in Dallam, Warrington.\nThere are also less severe alerts in place for the River Mersey in Greater Manchester, where conditions appear to be improving.\nNorth West weather coverage\nWe're going to pause this live page now - but please rest assured we will bring you news of any significant developments.\nIn the meantime, thank you for joining us, and sending in your updates and photographs.\nIf you are heading out, please take care!", "url": "https://www.bbc.com/news/live/cx2vdq4vgdvt"}