{"authors": ["Oscar Edwards", "Rowenna Hoskin", "www.facebook.com"], "date_download": "2025-04-26 08:07:38", "date_modify": "2025-04-26 08:07:38", "date_publish": "2025-02-26 14:14:19", "description": "The Prince and Princess of Wales also went to Pontypridd to learn how the community is dealing with floods.", "filename": "news_articles_c7vzd98955yo_1745654858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9bd6/live/20b7ff80-f45d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7vzd98955yo_1745654858.html", "title": "Prince and Princess of Wales visit Pontypridd after flooding", "title_page": "Prince and Princess of Wales visit Pontypridd after flooding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Prince of Wales and Catherine, Princess of Wales, have been baking Welsh cakes to mark the upcoming St David's Day.\nThey visited Pontypridd on Wednesday to learn how the community is coping following recent devastating flooding.\nThe visit to Rhondda Cynon Taf, delayed by almost an hour due to train disruptions, marks the couple's first visit to Wales together since Catherine announced last March she had begun cancer treatment, following the King's own cancer diagnosis.\nThe princess has made a gradual return to public duties since completing chemotherapy last summer.\nAt The Welsh Cake Shop the prince and princess rolled out dough, as Prince William asked owner Theresa Conner: \"Is it thick enough?\"\nThe royal couple's skills were honed when they appeared with TV baking queen Mary Berry on A Berry Royal Christmas show, and Prince William praised her influence.\nWith flour stuck to the sleeve of his maroon sweater, he smiled and said: \"Well I don't know, my stunning baker skills, Mary Berry taught me everything I need to know.\"\nThe couple made their cakes on a hot plate, keeping an eye on them and turning them after five minutes.\nMadison Conner, daughter of the shop owner told them: \"They're perfect, they're great - they're bangin'.\"\nPrince William and Catherine also met residents in the town who had been affected by recent storms.\nStorm Bert hit in late November and caused serious damage when the River Taff burst its banks and brought widespread flooding to Pontypridd, which had previously been badly hit by Storm Dennis in 2020.\nA few weeks after Bert, Storm Darragh brought extremely high winds to the region.\nBarbershop owner Josh Downes, who runs the Lost Boys Club, in Pontypridd, was among those whose businesses were flooded.\nOn Wednesday he chatted to William and Catherine telling them how he had lost thousands of pounds of stock to flooding.\nRecalling what had happened Mr Downes told the couple: \"I could see all my stuff floating around and had to get in there. And as I opened the door it all came crashing in.\"\nAfterwards Mr Downes said he and the couple had discussed what had been done since 2020.\n\"[It was] more of a conversation about how we keep flooding and how much stress it must be causing owning a business in Ponty[Pontypridd] with the constant worry of flooding on your mind,\" he said.\nCafe owner Enrico Orsi said: \"William was very empathetic to how it must be for us, juggling the stress of, essentially what is climate change, and the uncertainty of what can happen in the winter here, which we all know.\n\"And he said he is going to look into it for us.\"\nDuring their trip the prince and princess also visited butcher Kevin Kidner privately at his home.\nThe 61-year-old, who runs his business from the town's market, was alerted to last year's flooding by a neighbour.\nGavin Hailes, 41, brought his sons Ralphie, 12, and Joseph, aged eight, to try to meet the royal couple.\nHe said they arrived early to get to the front and then waited through hail and rain before the sun came out as the prince and princess arrived.\nMr Hailes said the flood did not affect them personally but said it was \"horrific\" and \"devastating\" for Pontypridd which was hit twice by floods.\nLisa Maunder, 46, said she was \"really proud to have them come to Pontypridd\".\n\"It lifts the spirits of everyone,\" she said. \"[Pontypridd] is a bit of a dying town so I think it's a nice thing to have people come here, spend money and look after all the businesses.\"\nPatricia Thomas said her grandson Harrison was able to give Catherine a sunflower as she walked past.\nThe princess asked him how to grow them, to which he responded \"you plant them\".\nPrince William also reminisced with people in the crowd about his visits to the town 20 years ago, and another when he was very young about 40 years ago.", "url": "https://www.bbc.co.uk/news/articles/c7vzd98955yo"}