{"authors": ["Dan Moffat", "www.facebook.com"], "date_download": "2025-04-26 07:48:09", "date_modify": "2025-04-26 07:48:09", "date_publish": "2025-02-26 23:00:09", "description": "Sonia James, who lives on the third floor, cannot use the stairs and is stranded in her flat.", "filename": "news_articles_ckgyrjp006jo_1745653689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c21b/live/a6f33fb0-f45d-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgyrjp006jo_1745653689.html", "title": "Swansea residents stuck in flats for six days due to broken lift", "title_page": "Swansea residents stuck in flats for six days due to broken lift - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman said she has been driven \"stir crazy\" after being left stuck in her flat for almost a week because of an out of order lift in her building.\nSonia James is one of a number of residents at the Ty Derw retirement housing complex in Sketty, Swansea, that have been impacted.\nThe 63-year-old has arthritis, fibromyalgia, high blood pressure and asthma, and cannot use the stairs in her building.\nThe housing association in charge of the building, Caredig, said it was conscious of the impact on residents, and was working to resolve the fault as quickly as possible.\nMs James, who lives alone on the third floor, said the lift had been out of order since Friday afternoon.\n\"On Friday they told us it would be fixed by Saturday afternoon, then that became Monday, and then we were told it would be Wednesday, but it's still not fixed.\n\"There's a few of us in the building who have mobility problems which means we can't use the stairs, so we are just stuck in our flat.\"\nMs James has carers who visit her every day, and said they had been helping to bring her food and supplies.\n\"They help me three times a day, at morning, lunch, and in the evening, and they've been really helpful,\" she said.\n\"On Saturday, I had my shopping delivered from a supermarket, and two of my neighbours had to help the delivery driver bring the food up, so I really appreciate all the help I'm being given.\n\"But it has had an impact on me physically and mentally, the weather has been quite nice over the past few days, and I'm trying to lose a bit of weight which is hard because of my disabilities, so being stuck in the flat has been horrible.\n\"I pay full rent, just under £800 a month, of which a proportion of that is for service charges, and a part of that is to cover our lift.\"\nRobert McVey, who is in his 70s, said it felt like he was \"stranded\" in his apartment.\n\"I've got a walking aid, and there's no way I can walk up and down those stairs.\n\"I'm angry about it. It's not the first time it's happened.\"\nA spokesperson for Caredig, the housing association which looks after the Ty Derw complex, said: \"Since Friday, our contractors have identified the cause of the fault in the lift and replacement parts are on order, which we anticipate our engineers will be able to fit on 27 February.\n\"We apologise for any inconvenience as we take the health and wellbeing of tenants very seriously. As well as seeking to resolve the fault as quickly as possible, we have been in regular contact with those who live in Ty Derw.\n\"We have not been made aware of anyone who needs assistance to leave their flat, but we will, of course, endeavour to find a way of helping anyone who does, to do so safely.\"", "url": "https://www.bbc.co.uk/news/articles/ckgyrjp006jo"}