{"authors": ["Bongi Msimanga", "www.facebook.com"], "date_download": "2025-04-26 07:06:46", "date_modify": "2025-04-26 07:06:46", "date_publish": "2025-02-28 06:14:44", "description": "David Czarnetzki found the likelihood of treatment being funded varied dramatically across England.", "filename": "news_articles_clynvjgynp8o_1745651206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9cf1/live/37222610-f2d7-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynvjgynp8o_1745651206.html", "title": "NHS funding 'postcode lottery' affecting thousands of patients", "title_page": "NHS funding 'postcode lottery' affecting thousands of patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A retired police officer has said he faces the possibility of selling his home to fund ongoing pain relief treatment he used to get for free on the NHS.\nDavid Czarnetzki, from Shropshire, has a chronic back condition and for six years received treatment on the NHS using radio waves to deaden specific nerves.\nSince his treatment funding was stopped, the 76-year-old has paid £6,000 to continue privately and claims he is a victim of an NHS \"postcode lottery\" affecting thousands of patients across England.\nShropshire, Telford and Wrekin Integrated Care Board (ICB) said it was inappropriate to comment on individual cases, but that applications for non-routine funding were carefully considered.\nOut of the 42 ICBs across England, 29 replied to his Freedom of Information request.\nThe responses, seen by the BBC, showed the Shropshire ICB approved less than 2% of requests between January 2020 and December 2023, while in Gloucestershire 69% were accepted.\n\"It's staggering that you're more likely to get funding for certain treatment depending on where you live,\" Mr Czarnetzki said.\nHis investigation showed about 45,000 applications by GPs were denied in that period, although the true figure could be much higher with 13 ICBs failing to provide data.\n\"It's been heartbreaking seeing David go through excruciating pain,\" his partner Christine Williams said.\n\"I feel helpless and despite the challenging circumstances David continues to fight for change not just for himself but for tens of thousands across the nation.\"\nPresented with the data, the Department of Health said the NHS was \"broken\" but the government had a \"10-year plan to build a health service fit for the future\".\nMr Czarnetzki was diagnosed with arachnoiditis in 2012, a painful condition that causes inflammation around the spinal cord and spinal nerve roots.\nRadio frequency ablation injections helped ease the pain, and initially, he was prescribed them through his GP to have at a local hospital.\nThe procedure uses radio waves targeting nerves to stop a pain signal being sent to the brain.\nFrom 2013, however, the funding system changed, moving the money from hospitals to community commissioners.\nIt meant GPs had to make special requests for treatments not routinely covered by the NHS.\nICBs took over the role from Clinical Commissioning Groups in 2022.\nTreatments covered by an IFR can be anything from certain cancer drugs to specialised surgery.\nThe ICB panel is made up of clinicians, public health experts and lay members led by an independent chair.\nBut the application process can take months and application success rates vary dramatically.\n\"In the old system I used to get injections every six to nine months, but overnight my life was turned upside down,\" Mr Czarnetzki said.\nThe application made by his GP and consultant was turned down in 2018 and he was refused the chance to appeal at the time, although the clinicians asked the ICB to reconsider.\nRadio frequency ablation injections are offered in many parts of the country, but it is unclear how many applications for that specific procedure have been granted.\nMr Czarnetzki was instead offered strong pain killers, eight tablets a day. Concerned about the long-term effects of taking so many opioids, he later chose to go private.\nHis investigation revealed his local ICB had one of the lowest rates of approving funding requests in England - just three out of 176.\nWhile the Gloucestershire ICB ranked the highest with 69%, neighbouring Bristol, North Somerset and South Gloucestershire ICB, like Shropshire, approved just 2%.\nHowever, Gloucestershire, which faced thousands more requests than Shropshire, was not simply an outlier.\nLincolnshire ICB approved 65% of requests, while Bath & North East Somerset and Dorset ICBs both also approved more than 50%.\nMr Czarnetzki said: \"The reason I'm telling my story is because I'm worried about the 45,000 or so people in England who have been denied the care their GPs feel they need.\"\nHis partner said she could not bear to watch him suffer and see his mobility affected, knowing others might be afforded identical treatment.\nBoth pensioners, the couple fear they could lose their home in Church Stretton if they need to continue funding private treatment.\nThe Shropshire, Telford and Wrekin ICB said applications were carefully considered by a panel for evidence that a patient's condition was \"exceptional\", as per its policy.\nIt added that it had to ensure the most effective use of funds.\nIt is also under huge pressure financially. In January, it said it was on track for a deficit of between £20m and £30m by the end of the financial year, and was drawing up an action plan.\nThe ICB said patients were entitled to a review of the panel's decision, but Mr Czarnetzki said his experience meant he did not have faith in the appeals process, adding that he had also struggled to get his complaints heard.\nAs part of a damning report into the overall state of the NHS in England, Lord Darzi said the roles and responsibilities of ICBs needed to be clarified, external as their interpretation varied across the country.\nThe watchdog that should be assessing them has currently \"paused\" that element of its work.\nThe Care Quality Commission told the BBC the decision would \"free up capacity to carry out more assessments to modify its current assessment framework\".", "url": "https://www.bbc.co.uk/news/articles/clynvjgynp8o"}