{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 06:52:02", "date_modify": "2025-04-26 06:52:02", "date_publish": "2025-02-28 17:23:54", "description": "Rhianan Rudd, 16, took her own life five months after terrorism charges against her were dropped.", "filename": "news_articles_ce988ekzl7yo_1745650322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0f2/live/b7649110-f5e2-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce988ekzl7yo_1745650322.html", "title": "Rhianan Rudd: Groomed girl who died was charged without 'full evidential picture'", "title_page": "Rhianan Rudd: Groomed girl who died was charged without 'full evidential picture' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prosecutors charged a girl with terrorism offences without the \"full evidential picture\" of her exploitation by a far-right extremist, an inquest has heard.\nRhianan Rudd became the youngest girl in the UK to be charged with terror offences after downloading bomb-making guides and making verbal threats to \"blow up a synagogue\", Chesterfield Coroner's Court was told.\nAfter charges against her were discontinued, Rhianan was found dead in a children's home in Nottinghamshire in May 2022, at the age of 16.\nNick Price, former prosecutor in the counter-terrorism unit of the Crown Prosecution Service (CPS), said: \"Material was outstanding which ideally we have would have possessed.\"\nThe inquest into Rhianan's death was previously told she was groomed by neo-Nazi Chris Cook, from the US, who sent her \"racially-motivated links\" to read.\nHer mother, Emily Carter, referred her daughter to the deradicalisation programme Prevent in September 2020, and Rhianan, who was autistic, was later investigated by counter-terrorism police and MI5.\nOn 20 October 2020, police and MI5 had decided Rhianan would not be arrested because it was \"believed to risk some impact on her mental health\", and \"could possibly lead to further self-harm and suicide attempts\".\nBut after Rhianan was admitted to hospital that same day after carving a swastika on to her forehead, the court was told a decision was made the following day to arrest her due to \"new information and a risk to others\".\nGiving evidence on Friday, Mr Price detailed the events around Rhianan's charge in April 2021, a case review a few months later in October and the eventual dropping of charges in December of that year.\nThe inquest heard Rhianan, from Bolsover in Derbyshire, was arrested at Sheffield bus station after breaching conditions of her bail on 15 April 2021. She was charged the same day with six terrorism offences.\nRhianan went to live at Bluebell House Residential Home as part of her bail conditions.\nCharges were dropped in late December in 2021, after a Home Office unit that deals with modern slavery and trafficking made a formal finding that she was a victim of exploitation.\nBut the court heard the referral to the Home Office was not made by police after they began investigating Rhianan in autumn 2020.\nRather, the inquest heard it was only made at the instigation of defence lawyers – four days after she was charged in April 2021.\nMr Price, of the CPS, was asked about the National Referral Mechanism (NRM) – a framework that identifies potential victims of modern slavery including human trafficking and forced servitude.\nFamily lawyers have said Rhianan should have been referred in this way and treated as a victim of grooming.\nOn the initial arrest in October 2020, Mr Price said: \"It was very early stages for us.\"\nHe told the court there \"was no evidence they were aware of\" that there had been a \"geographical move\", which would usually be considered in cases of modern slavery.\nBut he added the CPS could not make the referral and it was down to others like the police to do this.\nAsked about the charge and the knowledge of Rhianan being a victim of grooming, Mr Price said the special crown prosecutor had \"already been reviewing evidence\" to make a charging decision.\nHe added the MI5 investigation that highlighted Chris Cook – described in court as a far-right neo-Nazi extremist from the US – was not initially known to the CPS.\n\"Material was outstanding which ideally we have would have possessed... relevant material was not considered because it wasn't available to be considered,\" he said.\n\"We were approached on a urgent basis by the police through circumstances we heard – the fact Rhianan breached her bail conditions and was arrested in Sheffield – those are the circumstances.\n\"We were trying to understand the full evidential picture.\"\nJesse Nicholls, on behalf of Rhianan's family, asked if the CPS was aware that charging Rhianan would have a \"significantly negatively impact\" on her mental health, including because she was autistic.\nMr Price said: \"We would, as experienced prosecutors, be absolutely aware of the impact that criminal proceedings have on young people, particularly on those with the characteristics described.\"\n\"After the charging decision, there was a lot of material given to us as the year went on,\" he added.\nThe court heard a case review in October 2021 took account of new developments, which included Rhianan's autism diagnosis. The review considered the \"evidential matters\", but the CPS still said it was \"in the public interest\" not to drop the charges.\nThe following month, the CPS received information indicating that Rhianan was \"on the balance of probabilities a victim of criminal and sexual exploitation\", which meant the case was \"carefully re-reviewed\", the court was told.\nHer charges were dropped, the court heard, because of her autism diagnosis and \"other material\" which demonstrated her vulnerabilities and \"passed doubt on the legitimacy of her intention\".\nThere \"no longer remained a realistic case of prosecution\", the inquest was told.\nThe inquest continues.\nIf you have been affected by any of the issues in this story, support is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/ce988ekzl7yo"}