{"authors": ["Nikhil Inamdar", "www.facebook.com"], "date_download": "2025-04-26 04:38:39", "date_modify": "2025-04-26 04:38:39", "date_publish": "2025-02-28 10:14:06", "description": "At least 25 people are still missing in a remote part of the country's north.", "filename": "news_articles_c36wwld19gzo_1745642319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/885b/live/0b6af040-f5b8-11ef-accd-233028a2e09e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c36wwld19gzo_1745642319.html", "title": "Dozens missing in Indian Himalayas avalanche", "title_page": "Uttarakhand: Dozens missing in Indian Himalayas avalanche - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least 25 road workers remain trapped after a massive avalanche struck a remote border area in the northern Indian state of Uttarakhand, officials say.\nSenior district official Sandeep Tiwari told BBC Hindi that 32 workers had been rescued and moved to an army camp nearby.\nThe avalanche hit a Border Roads Organisation (BRO) camp in the village of Mana, which shares a border with Tibet, officials say.\nOfficials said rescue operations were continuing in extreme weather amid heavy snowfall.\nUttarakhand Chief Minister Pushkar Singh Dhami wrote on X that rescue work was being carried out by the Indo-Tibetan Border Police (ITBP), the BRO and other teams.\nAmbulances and emergency teams have been dispatched, but treacherous conditions continue to pose challenges for rescuers.\nFootage posted, external on X by ITBP showed rescuers carrying people on stretchers and walking through several feet of snow - even as more snow continued to fall.\nColonel Ankur Mahajan, a commander with the BRO, told the Hindustan Times newspaper that those who had been rescued were receiving treatment \"but the extent of their injuries is unclear\".\nGaurav Kunwar, a former village council member of Mana, told BBC News that details of the incident were sketchy.\n\"No-one lives there permanently. It's a migratory area and only labourers working on border roads stay there in the winter. There's also some army presence there. We've heard that it has been raining in the area for two days. The road workers were in a camp when the avalanche hit.\"\nEarlier on Friday, the India Meteorological Department warned of heavy rainfall and snow in the northern Indian states of Himachal Pradesh and Uttarakhand as well as Jammu and Kashmir.\nOrange alerts have also been issued for snowfall in several districts of Himachal Pradesh and Jammu and Kashmir.", "url": "https://www.bbc.co.uk/news/articles/c36wwld19gzo"}