{"authors": ["Rachel Grant", "www.facebook.com"], "date_download": "2025-04-26 04:25:44", "date_modify": "2025-04-26 04:25:44", "date_publish": "2025-03-03 12:03:23", "description": "The artist, best known for The Singing Butler, was found dead at his apartment in the south of France.", "filename": "news_articles_c5y02wxgrzlo_1745641544.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7798/live/e8a9cc70-f832-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y02wxgrzlo_1745641544.html", "title": "Scottish painter Jack Vettriano dies aged 73", "title_page": "Scottish painter Jack Vettriano dies aged 73 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scottish painter Jack Vettriano, best known for his painting The Singing Butler, has died at the age of 73.\nHis publicist said the artist was found dead at his apartment in Nice, in the south of France, on Saturday.\nIt is understood there are no suspicious circumstances surrounding his death.\nVettriano was a self-taught artist whose most famous work became the UK's best-selling art print and set a Scottish record when it was auctioned in 2004.\nHe was born Jack Hoggan on 17 November 1951 in Methil, Fife, and left school at 15 to become a mining engineer. He later moved into personnel management.\nFor his 21st birthday, he was given a set of watercolour paints and then spent much of his spare time teaching himself to paint.\nHe drew inspiration from works at Kirkcaldy Galleries, studying paintings from artists such as Samuel Peploe and William McTaggart so intently that he feared arousing the suspicions of gallery staff.\nHis breakthrough came in 1989 when he submitted two paintings to the Royal Scottish Academy's annual show and both sold on the first day, inspiring him to become a full-time artist.\nHis works garnered international acclaim, leading to exhibitions in cities including London, Hong Kong, Johannesburg and New York.\nVettriano was often dismissed by critics, who variously described his work as \"brainless erotica\", \"mere wallpaper\" and \"crass male fantasy\".\nBut in an interview with the Radio Times, he responded: \"They don't like an artist who is as popular as me because it takes away part of their authority. If they want to ignore me, let them.\n\"I have what I want and that is the support of the public.\n\"That means far more to me than the approval of a bunch of well-educated art buffs.\"\nHe was appointed an OBE for services to visual arts in 2003.\nHis best-known work, The Singing Butler, depicts an elegant couple dancing on a storm-swept beach accompanied by their butler and maid.\nIt sold at auction in 2004 for £744,800 - a Scottish record at the time - and reproductions of the painting were the best-selling art print in the UK.\nIt was reimagined by Banksy for Crude Oil (Vettriano) - a painting now owned by Blink-182 star Mark Hoppus and expected to fetch between £3m and £5m at auction in London on Tuesday.\nDespite being shunned by galleries earlier in his career, Vettriano's self-portrait The Weight went on long-term display in the Scottish National Portrait Gallery when it reopened after a renovation in 2011.\nThe first major retrospective of his work was held in the Kelvingrove Art Gallery and Museum in Glasgow in 2013.\nIt attracted more than 136,000 visitors during its five-month run and was said at the time to be the most successful commercial exhibition ever staged in Glasgow.\nA further retrospective was held at Kirkcaldy Galleries in 2022, focusing on his formative years and early career.\nVettriano created a portrait for one of three giant murals of Billy Connolly installed in Glasgow in 2017 as part of a BBC programme marking the comedian's 75th birthday.\nAmong those who acquired Vettriano paintings were Jack Nicholson, Sir Alex Ferguson, Sir Tim Rice and Robbie Coltrane.\nHe has spoken publicly about his struggles with his mental health and his dependence on alcohol and drugs.\nVettriano's publicist said that his passing \"marks the end of an era for contemporary Scottish art.\n\"His evocative and timeless works will continue to captivate and inspire future generations.\"\nFirst Minister John Swinney paid tribute to the artist and offered his condolences to his family.\n\"I am very sorry to hear the news that Jack Vettriano has died,\" he wrote in a post on X.\n\"He made a unique and evocative contribution to artistic life in Scotland in such compelling style.\"\nThere are few artists who have such instant recognition outside the world of art or who are loved and loathed in equal measures.\nFrom the moment Jack Hoggan invented Jack Vettriano, submitted two paintings to the Royal Scottish Academy and sold both in a day, he set in motion the commercial pull and establishment disdain which would follow him throughout his career.\nThe commercial success and record prices only further antagonised the critics who dismissed his work as \"colouring in\".\nThe first major retrospective of his work in Kelvingrove Art Gallery in 2013 had not just a separate room with a warning for his more explicit paintings but a gift shop which did a roaring trade in spin-off merchandise.\nWould he have traded some of that success for a fairer review of his work?\nI think he would.\nWhen I first met him 25 years ago, he was keen to dismiss any criticism as art establishment snobbery. What ordinary people thought of his work was all that mattered.\nEach time I met him, more and more people had made that clear by attending his exhibitions in their thousands or buying prints and postcards.\nThe last time – on home turf at Kirkcaldy Art Galleries where he'd once studied the colourists – was especially emotional.\n\"I'm not just happy, I'm proud,\" he told me, \"to have done that without any tuition and be back here where it all started.\"\nSelf-made, self-starting, Jack Vettriano gave a large section of the public what they wanted and the world is a little less colourful for his passing.", "url": "https://www.bbc.co.uk/news/articles/c5y02wxgrzlo"}