{"authors": ["Edward Sault", "www.facebook.com"], "date_download": "2025-04-26 07:07:34", "date_modify": "2025-04-26 07:07:34", "date_publish": "2025-02-28 06:04:34", "description": "Stanley Booker, who survived \"brutal interrogations\" by the Nazis in World War Two, dies aged 102.", "filename": "news_articles_cj0qqmz274lo_1745651254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e53f/live/1711a2f0-f508-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0qqmz274lo_1745651254.html", "title": "Tributes paid after last Buchenwald airman dies", "title_page": "Stanley Booker: Tributes paid after last Buchenwald airman dies - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tributes have been paid to a 102-year-old RAF veteran who survived \"brutal interrogations\" by the Nazis during World War Two.\nFormer squadron leader Stanley Booker, from Christchurch in Dorset, died in January and a memorial service is taking place later.\nHe was 22 years old when his aircraft was shot down over northern France in June 1944 and was the last of the \"lost airmen of Buchenwald\".\nMr Booker, who was born in Gillingham, Kent, was imprisoned until May 1945 and later received an MBE for his post-war work with British intelligence.\nHe was one of 168 Allied airmen imprisoned at the notorious Buchenwald concentration camp in Germany.\nMr Booker was also held by the Gestapo in Paris and later at Stalag Luft III.\nHis daughter, Pat Vinycomb, who lives in Christchurch, said: \"The German guards were so brutal to the prisoners, and some of them were murdered and beaten to death in front of their eyes.\n\"They had to also witness some prisoners being hung.\n\"The men didn't know what this concentration camp was, and it was horrendous.\"\nAged 17, Mr Booker signed up as an RAF apprentice - he trained as an observer in Wales, and later at Bomber Command in Abingdon, Oxfordshire, before joining 10 Squadron as a navigator flying on Halifax bomber aircraft.\nWhen Mr Booker's aeroplane was shot down over France, while on a mission to take out railway lines, the aircraft's pilot and wireless operator were killed, while other crew members escaped by parachute.\nHe went on to find refuge with the French resistance but was betrayed to the Gestapo by a Belgian traitor.\nIn 2021, in an interview with armed forces charity SSAFA, Mr Booker said of the experience: \"I saw this old chappy in the field, and I had damaged my knee and knew I couldn't walk too far.\n\"I went up to him and said, in my best schoolboy French, that I was an English officer, and could he help me... and he put his arms around me and gave me a great big kiss.\"", "url": "https://www.bbc.co.uk/news/articles/cj0qqmz274lo"}