{"authors": ["Katherine Sellgren", "www.facebook.com"], "date_download": "2025-05-19 15:28:48", "date_modify": "2025-05-19 15:28:48", "date_publish": "2015-02-05 03:34:10", "description": "Many students at UK universities are subjected to unfair changes in courses, according to the consumer group Which.", "filename": "news_education-31129767_1747668528.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80775000/jpg/_80775986_students.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_education-31129767_1747668528.html", "title": "Students 'subjected to unfair course changes'", "title_page": "Students 'subjected to unfair course changes' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Some UK students are subjected to unfair changes to courses, according to the consumer group Which.\nWhich issued Freedom of Information requests to 141 UK universities for documents setting out the institutions' right to vary courses after enrolment.\nOf the 131 who responded, 40 were considered by Which to have policies that demonstrated bad practice while eight needed an improvement in terms.\nUniversities UK said it was engaging with new guidance for the sector.\nWith undergraduates now paying up to £9,000 a year on tuition fees, the higher education world is increasingly seen by students as a consumer market.\nWhich is calling on universities to address unfair terms \"as a matter of urgency\".\nIt suggests the higher education sector comes together to create a standard consumer-friendly format for student contracts.\nIt also calls on the Competition and Markets Authority to check which universities are complying with its new guidance on how consumer law applies to the sector.\nThe report says that variations to degree courses once students have enrolled \"pose a significant risk of detriment\".\nAnd course providers need to \"ensure the impact on their student body of any potential changes is at the centre of their policies\".\nIt adds: \"In our view, variations to courses should only be allowed where the change is beneficial to students, or necessary in response to an event outside the provider's control that it could not plan for.\"\nWhich executive director Richard Lloyd said: \"It's worrying to see such widespread use of unfair terms in university contracts.\n\"Students deserve to know what they can expect from a course before signing up, so that they can be confident they will get what they pay for.\n\"With tuition fees higher than ever before, we want universities to take immediate action to give students the protection they're entitled to.\"\nNicola Dandridge, chief executive of Universities UK, said that the most recent national student survey showed student satisfaction was at a record high.\nMs Dandridge said her group was engaging with the Consumer and Markets Authority (CMA) on its draft guidance to universities and would support its members to ensure they were compliant with it.\nShe added: \"Universities frequently offer modules related to the research expertise of particular members of staff.\n\"This is an important part of what is unique about the university experience, but does mean that modules offered may sometimes be subject to change.\n\"Universities need to clearly state to potential students when this is the case to allow them to make informed decisions.\"\nA spokesman for the CMA said it would \"carefully review\" the Which findings.\n\"The CMA plans to publish its final advice in the next few weeks and will make clear by when it expects universities to have reviewed their terms and practices and made any necessary changes to ensure compliance with consumer law.\n\"The CMA will subsequently review compliance, and the Which findings will help to inform this work.\"", "url": "https://www.bbc.com/news/education-31129767"}