{"authors": ["Chloe Parkman", "www.facebook.com"], "date_download": "2025-04-26 06:47:28", "date_modify": "2025-04-26 06:47:28", "date_publish": "2025-03-01 12:11:43", "description": "The event will recreate Force 135 who were responsible for the liberation of the Channel Islands.", "filename": "news_articles_cvg5528zjlyo_1745650048.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5343/live/7cfbb200-f5cf-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg5528zjlyo_1745650048.html", "title": "Guernsey Liberation Day re-enactment of when island was freed", "title_page": "Guernsey Liberation Day re-enactment of when island was freed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Organisers of the 80th anniversary of Liberation Day say a performance will recreate the moment Guernsey was freed from occupation.\nThe re-enactment, organised by the Guernsey Military History Company, will take place from the Albert Pier at 17:00 GMT on 9 May.\nThe performance will recreate the arrival of Force 135, the British military task force who were responsible for the liberation of the Channel Islands from German occupation.\nRussell Doherty, organiser of the re-enactment, said it would be \"a moving tribute\" to those who lived through the occupation and allow all generations to connect with \"this pivotal moment in Guernsey's history\".\nOrganisers said the performance would include HMS Medusa and Rummy III, with Guernsey Petroleum Distributors Ltd (GPD) sponsoring the fuel for the visiting craft.\nMat Broughton, from GPD, said it was hoped the event would give islanders a \"real sense of what it was like when British forces arrived to restore our freedom 80 years ago\".\nDeputy Sue Aldwell, committee for education, sport and culture, said: \"We're thrilled to have this re-enactment as part of the wider Liberation Day celebrations.\n\"Islanders will also get to experience performances from the Bugles and Drums of the Stedfast Association and 40s vocal duet The Vibettes to add to the atmosphere.\"", "url": "https://www.bbc.co.uk/news/articles/cvg5528zjlyo"}