{"authors": ["Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 06:18:56", "date_modify": "2025-04-26 06:18:56", "date_publish": "2025-03-01 07:15:36", "description": "Shane Hedges was sacked by the force last summer but the panel's findings were published on Friday.", "filename": "news_articles_c1jpxrjdl7yo_1745648336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7fd9/live/ec15b880-f614-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpxrjdl7yo_1745648336.html", "title": "Police officer who called himself 'Mr Angry' sacked", "title_page": "Thames Valley Police officer who called himself 'Mr Angry' sacked - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer found to have coerced a woman into sex and who referred to himself as \"Mr Angry\" has been sacked.\nFormer detective constable Shane Hedges, who was based at Thames Valley Police's (TVP) headquarters in Kidlington, Oxfordshire, also turned up outside the woman's house to see when she returned home.\nA panel found that Mr Hedges \"had the upper hand\" over the woman \"and using sex was part of the control\" in July, but TVP published its findings on Friday.\nMr Hedges was found guilty of gross misconduct and was also found to have sent more than 20,000 text messages to the woman on his work phone.\nThe panel found the woman \"allowed sexual acts…to happen because of [Mr Hedges'] coercive, controlling and overbearing behaviour\".\n\"[The woman] gave clear evidence that she was frightened of the officer when he was angry. Even the officer referred to himself as 'Mr Angry' and the text messages reflect this,\" the panel said.\nIt also found he waited outside her home to see if and when she returned and subjected her to \"belittling and insulting name calling\".\nThe panel said there is \"increasing awareness\" of \"coercive, controlling and overbearing behaviour\" in society.\n\"There is no doubt that reputational harm will be caused to TVP by an officer conducting himself in this way,\" it found.", "url": "https://www.bbc.co.uk/news/articles/c1jpxrjdl7yo"}