{"authors": ["Eleanor Lawrie and Michael Buchanan", "www.facebook.com"], "date_download": "2025-04-26 07:37:41", "date_modify": "2025-04-26 07:37:41", "date_publish": "2025-02-27 14:04:07", "description": "The number of people sleeping rough in England has risen by a fifth in a year, according to new snapshot estimates.", "filename": "news_articles_cr422n2wrn1o_1745653061.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c214/live/d036bc10-f50e-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr422n2wrn1o_1745653061.html", "title": "Rough sleeping in England rises for third year in a row", "title_page": "Rough sleeping in England rises for third year in a row - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The number of people sleeping rough in England has risen by a fifth in a year, according to new snapshot estimates.\nThere were 4,667 people sleeping on the streets, according to official statistics recorded on a single night last autumn - a near-record high and the third annual rise in a row.\nWhile London continues to have the highest number of rough sleepers, the problem is growing faster in the rest of England, the Ministry of Housing data shows.\nThe government says it has inherited an \"acute and entrenched housing crisis\".\nAlex has been sleeping rough in the Cambridgeshire town of Wisbech for two years.\n\"I was kicked out by my mum. She had a three-bedroom house but my brother and sister turned 16 and the house got split and I lost out,\" he says.\nRough sleeping has risen by 22% in the east of England, and Alex describes homelessness in Wisbech as a \"social epidemic\".\nThe true extent of homelessness in countryside towns like Wisbech is often under-reported, with people bedding down in fields, sheds, cemeteries, and on sports pitches.\nRough sleepers here are at the mercy of the extreme hot and cold weather and vulnerable to assault, while there are often fewer services available to help them.\nAgriculture is one of the main industries here, but the work is often low paid and seasonal, meaning it is easy for people to miss mortgage or rental payments and become homeless.\n\"One of the main factors is having enough income to privately rent. Landlords like to see a contract with 40 hours [a week] on it so they know they are going to get their income,\" explains John Heathorn, an outreach worker at local homelessness charity the Ferry Project.\nHis charity currently houses more than 40 vulnerable people, and has a substantial waiting list.\nJohn himself slept in a local cemetery for more than a year after struggling to find regular employment.\n\"It was one of the most terrifying and humiliating times of my life. I lost all [my] self-respect, self-esteem. There were times where I didn't know if I would wake in the morning, where I didn't know if I wanted to,\" he says.\n\"It really upsets me people are still sleeping rough today, I know what comes with it. I've had a lot of trauma in my life but nothing compares to being homeless, the not knowing, one day rolling into the next.\"\nThe Ferry Project has seen the demographic of its homeless clients change notably since the Brexit vote and its aftermath.\nWhile they were once 70% eastern European, they are now approximately 70% British.\nOne of their current clients, roofer David, had been sleeping in a shed for six months after breaching the terms of his tenancy agreement.\n\"I had a duvet and I was lying on concrete. It was freezing, I couldn't sleep, I just had to walk around, I was getting about two hours [sleep] a night if that. I hit the drink, and it took everything away from me,\" he says.\nAccording to the official snapshot data, the number of rough sleepers hailing from the UK rose by almost a quarter last year, compared with a 7% rise in people from the EU.\nEvery English region saw an increase in rough sleeping, apart from the North West, where the numbers fell very slightly.\nYorkshire and the Humber had the biggest percentage rise of 43%, while the East and West Midlands both saw a rise of more than a third.\nRough sleeping has risen by 164% since the snapshot was introduced in 2010 and is 2% below its 2017 peak.", "url": "https://www.bbc.co.uk/news/articles/cr422n2wrn1o"}