{"authors": ["Caroline Gall", "Sophie Millward", "www.facebook.com"], "date_download": "2025-04-26 06:34:39", "date_modify": "2025-04-26 06:34:39", "date_publish": "2025-02-27 06:24:05", "description": "Annasley Park hopes to finish her her 3,000-mile challenge from Spain to the Caribbean next month.", "filename": "news_articles_cn04y6rde03o_1745649279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/450f/live/c3c7cf50-f469-11ef-aeb3-bb556fdec0fe.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04y6rde03o_1745649279.html", "title": "Former Herefordshire cyclist's 3,000 mile Atlantic challenge", "title_page": "Former Herefordshire cyclist's 3,000 mile Atlantic challenge - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former professional cyclist has swapped tarmac for open water and taken on a 3,000 mile challenge.\nAnnasley Park from Herefordshire is attempting to row solo across the Atlantic, from Gran Canaria to Barbados, and raise hundreds of thousand of pounds for charity.\nShe set off on 1 February and aims to reach the finish line by late March.\nShe capsized not long after setting off and was finding the rowing tough, she said, but was determined to keep going. She was joined by a pod of dolphins at one point but has also dealt with swells of up to 4m (13ft).\n\"Being out in the middle of the Atlantic on my own, a lot of people say it must be quite lonely but I think a lot of people should experience this..,\" she said.\n\"A lot of the time we wake up and reach for our phones and scroll on social media or check our emails and we're immersed in what other people are needing or wanting or doing.\n\"I have to really tune in to my inner guru in a way and trust myself and have confidence in my ability which I lack.\"\nMs Park, who finished second in the 2017 cycling Matrix Fitness Grand Prix Series, is hoping to raise £300,000 for BBC Children in Need, The MS Society, the Alnwick Garden and the Clocktower Foundation.\nShe managed to speak to her family during her journey and the support had been amazing and kept her going, she said.\nOne of the first things she planned to do when back on dry land was have a shower and wash her hair and \"feel a little bit more human again\".", "url": "https://www.bbc.co.uk/news/articles/cn04y6rde03o"}