{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:28:22", "date_modify": "2025-04-26 07:28:22", "date_publish": "2025-02-27 18:58:34", "description": "The incinerator could be built in Portland, part of the Jurassic Coast UNESCO World Heritage Site.", "filename": "news_articles_cy4vvpm379do_1745652502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f782/live/a170f840-f532-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vvpm379do_1745652502.html", "title": "Portland incinerator permit granted as judicial review looms", "title_page": "Portland incinerator permit granted as judicial review looms - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A proposed incinerator near Dorset's Jurassic Coast has been granted an environmental permit by the Environment Agency (EA).\nThe energy recovery facility, planned for land at Portland Port, was given the go-ahead by the government in September, despite initially being refused by Dorset Council.\nCampaigners opposed to the scheme have been granted a judicial review of the planning decision, which will be heard at the High Court on 12 March.\nThe EA said the environmental permit would not impact the outcome of the legal challenge.\nThe agency said Powerfuel Portland had met all of the necessary criteria for the environmental permit for the proposed incinerator.\nConditions have been set in the permit on emissions and their monitoring, operation of the plant and the amount and type of waste to be accepted.\nThe permit limits the waste to domestic municipal solid waste and commercial and industrial waste unsuitable for recycling.\nA spokesperson said: \"We have carefully considered all of the submissions we received during the various consultations and we thank everyone who took the time to contact us with their views.\"\nDorset Council leader Nick Ireland had previously urged the Department for Environment, Food and Rural Affairs (Defra) to instruct the EA to pause the permit in light of its own review of waste infrastructure.\nBut Mary Creagh, Parliamentary Under-Secretary of State for Nature, said it was not appropriate for Defra to comment on the decision, adding that the planning process was not linked to the EA's remit.", "url": "https://www.bbc.co.uk/news/articles/cy4vvpm379do"}