{"authors": ["Holly Phillips", "www.facebook.com"], "date_download": "2025-04-26 08:06:29", "date_modify": "2025-04-26 08:06:29", "date_publish": "2025-02-26 14:36:26", "description": "The alert follows a recent operation by police and trading standards in Lincolnshire.", "filename": "news_articles_ce8vjmry24po_1745654789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b203/live/cb5b0c70-f444-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vjmry24po_1745654789.html", "title": "Warning over dangerous 'super vapes' seized in Lincolnshire", "title_page": "Warning over dangerous 'super vapes' seized in Lincolnshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A warning has been issued about the dangers of illegal \"super vapes\".\nEuropean Safety Gate – a rapid alert system for dangerous products – has issued a product alert for the R&M Tornado Vape, which contains 30,000 puffs.\nIt carries 30ml of liquid – 15 times the legal amount – and has the equivalent amount of nicotine as 375 king-sized cigarettes.\nThe warning comes after super vapes were seized from a shop in Boston, Lincolnshire, last week.\nMore than 90,000 illicit cigarettes and 300 vapes were confiscated from seven shops in Boston, Spalding and Holbeach during Lincolnshire Police's Operation Nivada.\nIt was one of the largest seizures of illegal tobacco in the county to date and included the super vapes – products described as acutely poisonous and highly addictive.\nAndy Wright, a trading standards officer at Lincolnshire County Council, said: \"The popularity of disposable vapes shows no sign of waning, but residents need to be fully aware of the health hazards that huge capacity super vapes like these pose.\n\"Worryingly, these products are not adequately labelled and, with their eye-catching branding, often end up in the hands of vulnerable young people.\"\nMr Wright said trading standards would continue to work with police against illegal vapes and \"clamp down on the traders who peddle them\".", "url": "https://www.bbc.co.uk/news/articles/ce8vjmry24po"}