{"authors": ["Chris Young", "www.facebook.com"], "date_download": "2025-04-26 04:38:53", "date_modify": "2025-04-26 04:38:53", "date_publish": "2025-02-28 09:51:03", "description": "The business, in a public car park, was expanded with a second container in April, reports say.", "filename": "news_articles_c4g99d7wd5yo_1745642333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/95c1/live/9b78e530-f5b2-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g99d7wd5yo_1745642333.html", "title": "Bradford shipping container planning application refused", "title_page": "Bradford shipping container planning application refused - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bradford Council has rejected a retrospective planning application to extend a shipping container unit in a public car park.\nThe unit in the Orange Street car park, off Leeds Road, had been operating as a chai café until it was converted into a 24-hour drive thru vape shop.\nThe business was made up of a single shipping container before a second container was added to the front of the structure in April.\nCouncil officers said allowing the extension to remain in place would lead to the car park \"being used solely for the proposed business and not the wider area\".\nAccording to the Local Democracy Reporting Service, a retrospective application to for the extension was submitted by Assad Mahmood Khan late last year.\nThe site has previously been the subject of planning disputes.\nIn 2020, a container was installed next to the council-owned car park and converted into a café.\nRetrospective plans for the café were twice refused by Bradford Council. Highways officers said the car park was created for use by Leeds Road businesses and customers, and not to benefit one specific business.\nHowever, in late 2021, a government planning inspector overturned the local authority's decision, arguing the area was not \"at capacity\" for parking when they visited the site.\nThe café has since closed and reopened as a shop.\nDespite advertising itself as a drive thru, there does not appear to be any such facilities at the shop, which fronts onto the public car park.\nThe retrospective planning application included little detail of why an extension was needed.\nRefusing the plans, officers said the car park was for local businesses and residents, not \"direct use for any trading purposes\".\nThey said the loss of public car parking spaces would be \"unacceptable\".\n\"The proposed development fails to provide suitable and sufficient accommodation within the site for the parking, loading/unloading of vehicles,\" they added.", "url": "https://www.bbc.co.uk/news/articles/c4g99d7wd5yo"}