{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:20:02", "date_modify": "2025-05-21 06:20:02", "date_publish": "2025-04-01 00:00:00", "description": "As a host of household bills increase, the government stresses that the minimum wage and state pensions are rising at the same time.", "filename": "news_live_c1wdnj81qw4t_1747808402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/211f/live/986587a0-0f01-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1wdnj81qw4t_1747808402.html", "title": "Council tax and energy bills rise: We answer your questions", "title_page": "Council tax and energy bills rise: We answer your questions - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bill rises pinch wallets before Trump's tariffs land\nAdam Goldsmith\nLive reporter\nAs the new financial year looms, increases to a number of household bills - including council tax, energy and water bills - have come into place. We’ve got full details on the seven swelling costs.\nBusiness Secretary Jonathan Reynolds has accepted the impact this is likely to have on the public's pocket, but emphasised that millions of Britons will be getting a pay rise after the minimum wage also saw a boost.\nThe Conservatives, though, say the prime minister is \"not serious\" about these numbers; leader Kemi Badenoch accused the government of hammering the businesses that pay these wages - citing an upcoming increase to employer National Insurance contributions.\nAll of this comes before US President Donald Trump announces his much-awaited tariffs on what he has termed \"liberation day\" tomorrow.\nChancellor Rachel Reeves has warned that the UK should brace for impact - we have a live page running on what you can expect.\nBut, before that arrives, our cost of living correspondent Kevin Peachey has been answering your questions - including on why these bills are rising in the first place.\nWe're now closing this live page. Should you have any more queries, here's some handy guides to help you through:\nThree ways to cushion the blow of bill rises\nFor those with children, some information on child benefit - how much it will go up by and who can claim\nDisposable income forecast to grow modestly\nBy Ben Chu\nThe Office for Budget Responsibility (OBR) has a forecast for a measure of average UK incomes which takes into account most tax increases and government benefit changes.\nIt also takes into account rises in bills - including water, energy and broadband - which are reflected in the general rate of consumer price inflation.\nThis measure is called “real household disposable income per person” and the government has made delivering growth in this measure over the Parliament one of its key “milestones”.\nIn the current financial year of 2025-26, the OBR expects average incomes, according to this measure, to grow by £212 to £24,959 - an increase of 0.9%.\nThis would be faster than the 0.3% average annual growth of incomes in the last Parliament, but still modest by the standards of growth seen in most Parliaments since the 1950s.\nWill the minimum wage rise cancel out the increase in bills?\nBy Ben Chu\nThe government has suggested the squeeze in living costs due to today’s bill rises will be, to some extent, offset by its decision to increase the minimum wage.\nThe Low Pay Commission estimates that in 2024, external there were around 1.9 million jobs paid at or below the minimum wage, equivalent to around 6.5% of all jobs.\nThose in this group will benefit from the increase to both the National Living Wage (for those 21 and over) from £11.44 to £12.21 per hour and the National Minimum Wage (for those aged 18 to 20) from £8.60 to £10 per hour from today.\nThe government says, external for someone working full time on the National Living Wage, this is equivalent to an annual increase of £1,400 a year in pay.\nThis might be enough to cancel out an individual’s bill increases from today, although it would depend on their particular circumstances, such as the size of their energy bill, their local council and water provider, and whether or not they drive a car.\nAlso, this increase does not apply to the roughly 27 million UK jobs which are paid above the minimum wage.\nAnd the Office for Budget Responsibility (OBR) has forecast, external that the government’s decision to increase employer's National Insurance contributions from 6 April, will put downward pressure on the pay of most workers, contributing to a stalling of average inflation-adjusted earnings in 2026 and 2027.\nThe OBR says this is because it expects employers to “pass on” the costs of the rise to their employees in the form of lower pay than they would otherwise have received.\n'I just live day to day', single parent says\nThe charity Citizens Advice is warning that single parents in particular may find themselves struggling as a result of the rising bills.\nThat’s because, the charity says, these groups often find that a larger proportion of their money is taken up by essential spending.\nLaura Roan is a single mum with two daughters, and works part-time in Asda. She tells the BBC how she regularly dips into her overdraft, while also using emergency credit on her energy meter.\n\"I got paid last Friday and it has all gone. I just live day to day,” she explains.\nAnd, Laura says that without her mum's help, \"there would be some days when I would not have any electric\".\nLaura’s not alone; the charity warns that single-adult households like hers are more likely than others to be spending 20% or more of their post-housing income on bills, which leaves them more exposed to price shocks.\nAre wages rising faster than prices?\nBy Anthony Reuben\nThis morning, Business Secretary Jonathan Reynolds told BBC Breakfast: “We know the pressures are there, but for the first time we are starting to see living standards rise, wages rise faster than inflation.”\nThe most recent wages figures we have from the Office for National Statistics are from January, , externalwhen average earnings adjusted for rising prices were up 1.7% from a year earlier.\nThat average increase was worth about £12 a week (just over £600 a year), although clearly it does not take into account the significant increases in bills that are coming in from today.\nAnd it’s not the first time that wages have risen faster than prices. It has been happening since the middle of 2023, when the Conservatives were still in government.\nGym members feeling the strain of rising costs, owner warns\nJordan Kenny\nNewsbeat politics reporter\nSome business owners have been telling the BBC that they will be impacted too. One of those is Robyn, who is used to feeling the strain at The Fitness Bar, an independent gym she owns in Brighton.\nBut it’s not heavy weights she’s bracing for today. Instead, it’s the increasing cost of running her business.\n“It’s a double whammy of worry,” Robyn tells BBC Newsbeat, “because if our costs go up, we have to pass that on to our members.”\nRobyn tells us her personal best is deadlifting 150lbs (68kg) but it’s the pounds her members spend that she’s thinking about today.\n“We don’t know what financial pressure they’re going to be under with their cost of living going up,” Robyn says.\n“There will be members who might look to cancel and it leaves us in quite a worrying position for the future.”\nRising council tax means money is 'getting tighter and tighter'\nTarah Welsh\nHousing reporter\nYou've been telling us how the changes are going to affect you. Teaching assistant Julie, who lives in a semi-detached house in Trafford, Greater Manchester, says her council tax is rising by £220 a year.\nHer local council - Trafford Council - is raising the tax by 7.5%, citing rising homelessness as a factor. It is one of six councils which have been allowed to bypass the normal 5% cap on increases.\n\"Everything else is going up and it's getting tighter and tighter,\" Julie tells the BBC.\nThe teaching assistant says she understands that councils need to house families but says they should \"have a look at housing people in all of the empty properties\" to save some cash.\nThe BBC looked at Trafford Council's spending data and found it's spending more than £3m on temporary accommodation, with a large portion of that on local hotels and B&Bs.\nSome families are living for long periods in hotels without kitchen facilities or are sharing bathrooms with strangers in houses in multiple occupation properties.\nA lack of affordable homes, rents rising faster than household benefit levels and evictions have contributed to homelessness, which is at the highest level in England since records began.\nHow the housing crisis is driving up council tax\nIs cash a better way to budget?\nKevin Peachey\nCost of living correspondent\nJames says: \"I get £150 in cash out every week. It's amazing how it helps you budget things. Why don't more people try it?\"\nThere is evidence of people turning to notes and coins to help them budget.\nAlthough cash use was hit during the pandemic, it has made a bit of a comeback, with many people taking the same view as James.\nHowever, there are areas in which this doesn't work.\nShopping around for a better deal on essential bills is often something done online, and may require signing up to a direct debit payment. Rewards, or money off, are often also available to those who pay by card.\nSo, it may well be that using a mix of ways to pay works best - but questions remain about access to cash and internet services among the vulnerable.\nThat brings our Your Voice, Your BBC News special to an end - stick with us in this feed and we'll bring you more on the increase in household bills.\nWhat about the minimum wage increase?\nKevin Peachey\nCost of living correspondent\nDavid and Steve are among those pointing out that incomes are rising, including via an increase of the minimum wage.\nThey are correct to say it is not all doom and gloom today.\nThere is an increase in the minimum wage - up to £12.21 an hour for over 21s - and there are increases too for younger workers and apprentices.\nOfficial figures show that average wages have been rising faster than prices. The state pension and benefits will also go up from next week.\nThis will certainly help pay some of those bills, and you won't see the impact directly until you look at your bank balance in the coming weeks.\nThe Treasury is also pointing to moves to freeze fuel duty and ensure the main rates of tax - income tax, VAT and employees' National Insurance - do not go up during this Parliament, as evidence of the support billpayers are receiving.\n'No light at the end of the tunnel'\nLet's go back now and look at some more reader comments today:\nFor the decent hard working citizens of this country its a miserable place to live currently. I have spent the last couple of weeks trying to find ways of saving some money on the raft of bills that have landed on my mat. I have little or no disposable income left. So basically you are working to pay bills with no light at the end of the tunnel, mental health issues? It's going to be a Tsunami! Mary\nWhat about we pensioners? Council tax, water rates, car tax, phone, internet all up around 10%, state pension up 4.3% thanks to the triple lock otherwise Labour would have cut that as well as removing our WFA. Poverty will affect millions of middle earners, never mind the vulnerable at each end of society. Anonymous\nI get £150 in cash out every week. It's amazing how it helps you budget things. I would say I comfortably save £100 a week in that way. People should try it. James\nMy grandparents are really anxious about their bills rising. Like many who spend most of their income on life's basics, they will experience an inflationary increase to their regular outgoings each month of approximately 6%. Bobby\n'You can't shop around for water'\nKevin Peachey\nCost of living correspondent\nColin Smith asks whether we simply have to accept water bill increases because we can't shop around?\nWater services are different, because the 'switch for a better deal' advice simply doesn't, ahem, hold water.\nThere is plenty of debate over why water bills are going up so much (remember some suppliers wanted bigger increases).\nBut there are things you can do to keep your costs down, even though you can't shop around.\nExperts say getting a water meter fitted can reduce bills if you have relatively low usage. Water-saving shower heads, or similar, are available free from some companies.\nThen, there is the WaterSure scheme, which means the bill is capped for people on certain benefits, who have a medical condition, or who have a certain number of school-age children at home. You do need to apply for this help though, external.\nWhy are bills going up?\nKevin Peachey\nCost of living correspondent\nTashi and Chris are among those asking: \"Why are bills going up?\"\nThis is a very simple question, but I'm afraid the answer isn't straightforward. There are a host of reasons why bills are rising.\nOn energy, it's the consequence of an increase in wholesale prices paid by suppliers, often owing to global events.\nCouncils and water companies, meanwhile, say there's a desperate need to raise bills to pay for investment in services.\nSome bill increases are always scheduled for this time of year, to match the rate of rising prices - inflation.\nSo another question is: what can you do about it?\nConsumer groups are urging people to shop around, claim everything they are entitled to, and cut back where possible. We have a guide to help you here.\n'I’m not the poorest but I’m still really struggling'\nSome more comments from you as a range of household bills increase today:\nWe see these headlines a lot but I feel we rarely see people in my position. There are people like me who are just above that line of being poor and we don’t really get the help and support in terms of benefits. I’m not the poorest but I’m still really struggling. Erin Faulkner, Oxford\nAs a registered manager of a not-for-profit nursing home for people with complex mental health needs, the changes taking place today are catastrophic. The upcoming employer National Insurance contribution rise, plus an increase in living wage, along with energy, insurance and cost of living could potentially end ours and other providers' service provision. We continue to try to assist staff with wage rises, but we cannot compete with the NHS... It's a stressful and worrying time for people in my position and working in the care sector. Paula Jones, Merseyside\nMy pension went up £27 a month, yippee. My council tax bill arrived the other day with nearly a 10% increase, so the licensed bandits stole £22 of my pension increase! My broadband just increased £17, so I am running on empty before any other bills arrive. Jamie Cooksey\n'What about those on maternity leave? Childcare costs mean I can't go back to work'\nWe're just going to take a quick break from answering your questions this afternoon - in the meantime here are some more of your comments on the household bill increases:\nYes prices are increasing but most are doing so relatively slowly in comparison with house (and other) insurance. My quote for this year is up by 35% - price comparison websites show this sort of increase is across the board. Martin Blanchard\nWhy are they ignoring those on maternity leave?... I am not entitled to benefits as I ordinarily earn a good wage, however this just simply is not enough. We don’t all have a partner earning enough to cover everything and the cost of childcare negates the option to simply go back to work early. Hannah Brecke\nI'm a uni student working part time in hospitality. It's a busy takeaway in Cardiff and because of the minimum wage increases my managers have had to reduce stock and get rid of certain items on the menu. It's too costly to keep due to the rising bills and food costs, not to mention the upcoming rise in National Insurance contributions affecting how much they earn. It also leans into how many hours I get as full timers take priority, meaning I could be missing out. George\nWill my wage rise be eaten away by tax?\nKevin Peachey\nCost of living correspondent\nRichard Kendall asks about frozen tax thresholds, which mean pay rises can see people drawn into paying higher rates of income tax.\nThis is what is known as fiscal drag - not a phrase you'll overhear much in the bar or gym, but it is important.\nIt means that while income tax rates haven't risen, the income levels at which they are paid have been frozen, and will continue to be so until 2028.\nThere have been rumours that the freeze could be extended, but there are no concrete plans for that as yet.\nSo, more people are being dragged into paying higher rates of tax, or simply having a greater proportion of their income taxed.\nTaking a closer look at your pay slip is worthwhile, and it needs to be considered when looking at your personal budget. Experts say studying exactly how much post-tax income is coming in, and looking at it alongside your spending, is never a waste of time.\nAnd it may require you to trim some of your spending. Shopping around, or cancelling unused subscriptions are a good start, experts say.\nAre pensioners facing a harder hit?\nKevin Peachey\nCost of living correspondent\nLyn Nailer is one of many people asking whether pensioners will suffer the most from these bill rises?\nOne important point to stress here is that different people, in different areas of the country, will be affected in different ways.\nWater and energy bills vary depending on where you live, and the different nations of the UK have different rules on council tax and more.\nBut the state pension is UK-wide, and the good news for Lyn is that it will be going up by more than the rate of price rises from next week. The triple lock means it will increase by 4.1%.\nDoes everyone get the full state pension? No.\nDoes the increase mean pensioners' finances won't be stretched? Of course not.\nBut when asked about how people will cope, ministers are inevitably pointing to this increase as evidence of how the government is helping out.\nWhat's happening with the energy standing charge?\nKevin Peachey\nCost of living correspondent\nDavid Bosworth and Jeff Rumble are among those asking about the energy standing charge applied to bills.\nThis is a household cost which many people feel is unfair - not least because there is nothing you can do about it.\nStanding charges are the fees charged to all billpayers to cover the cost of being connected to a gas and electricity supply. They are unaffected by the amount of energy that a household uses.\nAfter rising sharply in recent years, the average electricity standing charge actually fell from today - although it rose slightly for gas. More significantly, it varies considerably depending on where you live.\nThe energy regulator, Ofgem, is considering reform that would allow people a choice of ways to pay - but stresses that these costs will still need to be covered.", "url": "https://www.bbc.com/news/live/c1wdnj81qw4t"}