{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:27:24", "date_modify": "2025-04-26 04:27:24", "date_publish": "2025-03-03 10:47:59", "description": "Three people three people have been taken to hospital.", "filename": "news_articles_c2419dy8zj3o_1745641644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb79/live/d93f2640-f819-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2419dy8zj3o_1745641644.html", "title": "M11 near Cambridge closed after serious multi-vehicle crash", "title_page": "M11 near Cambridge closed after serious multi-vehicle crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Part of a motorway has been closed after a serious multi-vehicle collision in Cambridgeshire\nThe M11 northbound was shut between junction 10 at Whittlesford and junction 11 for the A10/south Cambridge while emergency services responded to the incident.\nThe southbound carriageway was also closed to allow an air ambulance to land, National Highways said.\nA spokesperson for the East of England Ambulance Service said three people were taken to Addenbrooke's Hospital in Cambridge by road ambulance.\nThree vehicles were thought to be involved in the incident.\nA Cambridgeshire Police spokesperson told the BBC: \"We were called at 08:35 GMT today (3 March) with reports of a collision involving multiple vehicles on the northbound carriageway of the M11 between Cambridge and Duxford.\"\nThree ambulances, a rapid response vehicle, a paramedic car, a Hazardous Area Response Team vehicle and East Anglian Air Ambulance were sent to the scene.\nFire Crews from Cambridge and Sawston, along with the south roaming fire engine and a crew from Bishop's Stortford in Hertfordshire, also attended.\nNational Highways said traffic was being diverted via the exit and entry slip roads.", "url": "https://www.bbc.co.uk/news/articles/c2419dy8zj3o"}