{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 06:37:42", "date_modify": "2025-04-26 06:37:42", "date_publish": "2025-02-26 06:31:48", "description": "The bird is one of the most endangered, but its numbers in eastern England are increasing.", "filename": "news_articles_cx2gjjk0kgjo_1745649462.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/83fd/live/0ac3ca40-f388-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gjjk0kgjo_1745649462.html", "title": "Project to save endangered stone-curlew bird marks 40 years", "title_page": "Project to save endangered stone-curlew bird marks 40 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A conservation project in the East of England that has helped increase the population of one of the country's most threatened birds is marking its 40th anniversary.\nIn 1985 the number of breeding pairs of stone-curlews had reduced to fewer than 150 nationwide, with about a third based in eastern England.\nThe Royal Society for the Protection of Birds (RSPB) started attempts to increase their numbers that year by conserving, restoring and creating nesting habitats in Suffolk, Norfolk and Cambridgeshire.\nIts conservation officer Tim Cowan said there were now 226 breeding pairs locally, which he described as \"remarkable\".\nStone-curlews were once widely found throughout England, but due to a gradual loss and deterioration of preferred nesting sites in the 19th and early 20th centuries their numbers dropped.\nThe birds are very specific about where they nest - they enjoy open, bare or sparsely vegetated ground with light, stone-based soils.\nIn the East of England their preferred nesting habitat is semi-natural grass heathland that is heavily grazed and they will also nest on spring sown arable fields.", "url": "https://www.bbc.co.uk/news/articles/cx2gjjk0kgjo"}