{"authors": ["Sarah Rainsford", "Thomas Mackintosh", "www.facebook.com"], "date_download": "2025-04-26 04:39:38", "date_modify": "2025-04-26 04:39:38", "date_publish": "2025-02-28 09:14:14", "description": "The Pope has been battling pneumonia for two weeks and suffered an \"isolated\" breathing crisis on Friday.", "filename": "news_articles_cd655917g6qo_1745642378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9a81/live/3b4efab0-f5a7-11ef-bcea-7b70a14a5556.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd655917g6qo_1745642378.html", "title": "Pope Francis in 'stable' condition after breathing crisis, Vatican says", "title_page": "Pope Francis in 'stable' condition after breathing crisis, Vatican says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pope Francis, who has been battling pneumonia for two weeks, is in a stable condition following an \"isolated\" breathing crisis on Friday, the Vatican has said.\nThe 88-year-old experienced an episode of vomiting and a \"sudden worsening of his respiratory condition\" in hospital last night, and received gas through a face mask to help him breathe.\nThe Vatican said on Saturday evening that the Pope had not suffered further breathing crises and had responded well to oxygen therapy.\nIt did not share a prognosis, but said the pontiff remained \"alert and well oriented\".\nIn a statement, the Vatican said the Pope received the Eucharist this afternoon \"then dedicated himself to prayer\".\nHe alternated between an oxygen mask and \"long periods of high-flow oxygen,\" it added.\nIt said the Pope did not show signs of an increased white blood cell count, which can indicate infection or inflammation, and that his blood flow and circulation \"remained stable\".\nThe Pope also continued to eat and actively cooperated with regular \"respiratory physiotherapy,\" it said.\nEarlier, the Vatican said the Pope had a \"peaceful night\" and was resting, with an official adding: \"I think he had coffee this morning.\"\nVatican sources had said the Pope's doctors needed 24 to 48 hours to determine whether there had been any damage or setback to his overall condition.\nIn an earlier statement on Friday evening, the Vatican said the Pope had \"an isolated crisis of bronchospasm which, however, led to an episode of vomiting with inhalation and sudden worsening of the respiratory condition\".\nThat health update came after a couple of days in which Vatican statements had been slightly more positive, talking of a \"slight improvement\" in the pontiff's condition.\nHe was given Communion on Friday morning.\nIn an earlier medical update, the Vatican stressed that the Pope would remain in Rome's Gemelli Hospital because of the \"complex\" clinical picture.\nThe level of detail from Vatican officials about the Pope's latest crisis is extraordinary.\nThis is now the longest the Pope has been in hospital – and the longest period in which he's been out of public sight – since he took over from Pope Benedict in 2013.\nThat makes many Roman Catholics nervous.\nPreviously, Italian TV channels were reporting that the Pope was \"no longer critical\", as that word disappeared from Vatican health updates recently and the Pope's health slipped down the news agenda.\nNow it's back on the front pages, although news of the Ukrainian president's brutal dressing down in the Oval Office was the biggest story.\n\"Another crisis, Anxiety for the Pope\" was Il Messaggero's headline, which also speaks of \"prayers and tears\" among Catholics gathered for evening prayers outside St Peter's Basilica.\n\"Vomit and breathing crisis: Anxiety for the Pope returns\" was the headline in Il Giornale.\nThe Pope was admitted to hospital on 14 February after experiencing breathing difficulties for several days.\nHe was first treated for bronchitis before being diagnosed with pneumonia in both lungs.\nThe pontiff is particularly susceptible to pneumonia, an infection of the lungs that can be caused by bacteria, viruses or fungi, after he contracted pleurisy – an inflammation of the lungs – as a young man and had a partial lung removal.\nThe leader of the Roman Catholic Church has been admitted to hospital multiple times during his 12-year tenure, including being treated for bronchitis at the same hospital in March 2023.\nFrom Argentina, Pope Francis is the first Latin American, and first Jesuit, to lead the Roman Catholic Church.", "url": "https://www.bbc.co.uk/news/articles/cd655917g6qo"}