{"authors": ["Henry Zeffman", "Harry Farley", "www.facebook.com"], "date_download": "2025-04-26 03:51:18", "date_modify": "2025-04-26 03:51:18", "date_publish": "2025-03-05 11:58:36", "description": "The briefing that Rachel Reeves will make large spending cuts this month is very significant.", "filename": "news_articles_c9degwx4p4jo_1745639478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eaa3/live/ce194950-faab-11ef-815c-cf37b1275dcf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9degwx4p4jo_1745639478.html", "title": "Reeves's proposed cuts will trigger big political arguments", "title_page": "Reeves's proposed cuts will trigger big political arguments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The government briefing that Rachel Reeves will make large spending cuts this month is very significant, in several different ways.\nFirst, it confirms what had been rumoured - that the Office for Budget Responsibility (OBR), the independent forecaster, believes that the chancellor's 'headroom' has been eliminated.\nThis is the £10bn worth of leeway which, as of last October, the OBR believed the government had before breaking its self-imposed borrowing rules.\nWhy has that headroom disappeared? The government's clear view is that this is because of global factors - tariffs being imposed by President Trump, broader uncertainty emanating from the new US administration, persistent inflation in the UK and elsewhere, and the rising cost of government borrowing.\nBut there will be a big political argument about this.\nThe Conservatives will contend that the cost of government borrowing was rising even before President Trump took office and that the tax rises in Reeves's Budget in October were a major factor, as well as in stunting growth.\nRelatedly, it is worth stressing that this month was not meant to be a big economic moment for the government.\nOver recent years, a fiscal rhythm has developed where there is one Budget a year and then a second (spring or autumn) statement which also contains significant tax and spend measures and is akin to a mini-budget.\nReeves wanted to end that, with an autumn Budget and then a much more limited event in spring at which the OBR published updated forecasts but the government did not respond with major economic measures.\nGovernment sources say that this will not be a fiscal event because it will not include tax rises, only spending cuts.\nYet the Charter for Budget Responsibility, recently updated by the Labour government, said that it was committed to one major fiscal event a year in order to \"give families and business more certainty\" not only about tax but \"spending changes\" too.\nThe government did reserve the right to change that approach \"in the case of an economic shock\".\nDoes that mean the government believes the effect of President Trump has been an economic shock?\nThere are clear political sensitivities in where the cuts are likely to fall. The Labour Party has many factions and ideological nuances but all of its MPs are committed to a generous welfare state and many will be antsy at the prospect of welfare cuts.\nThose in government are adamant, though, that the numbers - which are rising fast - of claimants and the amount being spent by government are simply unsustainable.\nThere will be reform as well as cuts - Reeves has identified what she sees as \"perverse incentives\" in the system.\nIn a preview of the potential rows to come, one Labour MP, speaking on the condition of anonymity, was critical, saying: \"There is always money for war, yet none left for the most vulnerable to lift them out of hardship.\"\n\"Austerity is a choice. Poverty is a political choice,\" they added.\nHowever others, including from the left of the party, said they recognised the welfare system was \"old fashioned\" and needed reform.\n\"We have people who can work but don't just automatically because the system is inflexible,\" one said.\nNotably the next target for cuts appears to be the civil service.\nPrivately ministers and officials have been dismayed by the quality of the Whitehall machine.\nThe government is expected to demand major reductions in the numbers of civil servants, though this is unlikely to take the form of a specific numerical target.\nMinisters are also understood to have discussed major changes to the machinery of government, namely how government departments are organised, though this work is considered unlikely to come to fruition this month.", "url": "https://www.bbc.co.uk/news/articles/c9degwx4p4jo"}