{"authors": ["Lyndsey Telford", "www.facebook.com"], "date_download": "2025-04-26 03:49:28", "date_modify": "2025-04-26 03:49:28", "date_publish": "2025-03-05 13:37:10", "description": "Belfast Trust counsel says being accountable for failures \"doesn't necessarily mean losing your job\".", "filename": "news_articles_c62zgy5n1d5o_1745639368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a20d/live/44901680-f9c2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zgy5n1d5o_1745639368.html", "title": "Muckamore inquiry hears trust reject calls for dismissals", "title_page": "Muckamore inquiry hears trust reject calls for dismissals  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The health trust that runs Muckamore Abbey Hospital has said it is understandable that the families now see \"no good\" in the health and social care system.\nIn its closing statement to the public inquiry into abuse of patients at the Antrim-based facility, counsel for the Belfast Trust said relationships needed to be rebuilt.\n\"Whilst it's perhaps entirely understandable given how let down those families feel, that they should at present see no good or nothing positive in the care provided to their loved ones by the health and social care system, it is a dreadful indictment,\" Joseph Aiken KC said.\nThe Belfast Trust has apologised to all patients and their families for the abuse that occurred at Muckamore.\nMr Aiken added that \"a way must be found to try and rebuild those vitally important relationships which must endure long after the public inquiry has completed its work\".\nHe repeated the trust's apology for the abuse.\nHe said the trust also apologised for the behaviour of other staff who, while themselves did not directly abuse patients, may have witnessed it, failed to intervene and allowed it to go unchallenged.\n\"Further, the Belfast Trust acknowledged that the individual failings of the staff who abused patients or of the staff who failed to report and escalate abuse that they witnessed also meant that an important aspect of the governance system in place and operated by the Belfast Trust failed to prevent abuse, failed to detect abuse when it occurred, or when witnessed failed to escalate the fact that it had occurred,\" he said.\nEach of those instances, he added, were \"systems failures\" within the organisation.\nMr Aiken further said that being accountable for failures that occur \"doesn't necessarily mean losing your job\".\nHe said it was hoped that the inquiry panel would appreciate that most health and social care staff do not get up in the morning with the intention of \"making mistakes in their work, or of letting down the people they care for, or frustrating or upsetting the families of their patients\".\n\"Further, that being accountable for failures that occur doesn't necessarily mean losing your job, it can mean rolling up your sleeves and trying to make things better,\" he said.\nHe said abuse that was occurring on some wards in the hospital in 2017, as indicated in CCTV footage, was not known to more senior staff there or \"other individuals beyond Belfast Trust regularly on the wards at that time\".\nHe said when the abuse was identified, it was dealt with \"robustly\" .\nMr Aiken added that a large number of Belfast Trust staff at various level were engaged over a long period in trying to manage \"a very difficult situation that emerged and developed\".\n\"It has caused much pain to patients and their families, and the Belfast Trust has apologised for that,\" he added.\n\"But the extremely difficult situation has also caused much pain to good people working in Belfast Trust.\"", "url": "https://www.bbc.co.uk/news/articles/c62zgy5n1d5o"}