{"authors": ["David McKenna", "www.facebook.com"], "date_download": "2025-04-26 03:58:35", "date_modify": "2025-04-26 03:58:35", "date_publish": "2025-03-04 13:05:52", "description": "A councillor has blamed \"selfish individuals\" for the problems on the road in South Kesteven.", "filename": "news_articles_crrdqdev00ro_1745639915.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c0be/live/e001c180-f8e7-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrdqdev00ro_1745639915.html", "title": "Litter clean-up under way at A1 'grot spots'", "title_page": "Litter clean-up under way at A1 'grot spots' in Lincolnshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work is under way to remove rubbish dumped by motorists along a stretch of the A1 in Lincolnshire.\nSouth Kesteven District Council said the project was being funded from a £60,000 budget agreed in a cross-party vote to tackle \"specific grot spots\".\nThe affected area includes stretches from South Witham up through Colsterworth, Grantham and Claypole.\nIt comes after discarded drinks cans, fast-food wrappers and plastic prompted complaints from residents.\nCouncillor Rhys Baker, cabinet member for waste and the environment, said the initiative marked \"a significant investment\" towards keeping the road network clean and safe.\nHowever, he added: \"The simple truth is that we wouldn't need to do this if it wasn't for the actions of selfish individuals who illegally throw their waste and litter out of the vehicle window, impacting our countryside and threatening our wildlife.\"\nIn order to carry out the work safely, the council said it had struck a partnership with roadworks contractors to allow litter-picking teams to be deployed at night in designated areas where roadworks were taking place.\nThe authority said it had invested in new bins for A1 laybys in the district, which it said were emptied three times a week.\nOfficials previously said the cost of tackling litter on the A1 was taking money away from other services.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/crrdqdev00ro"}