{"authors": ["Seb Cheer", "www.facebook.com"], "date_download": "2025-04-26 03:56:46", "date_modify": "2025-04-26 03:56:46", "date_publish": "2025-03-04 14:55:44", "description": "Officers say they faced \"significant disorder\" after the Hartlepool v York City match on Saturday.", "filename": "news_articles_cm2jzll5eggo_1745639806.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d637/live/45c76470-f906-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzll5eggo_1745639806.html", "title": "Football fan claims 'police brutality' on train after Hartlepool v York City match", "title_page": "Football fan claims 'police brutality' on train after Hartlepool v York City match - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A football fan has branded the actions of officers on a train carrying a large number of supporters as \"uncontrollable police brutality\".\nImages on social media showed officers appearing to remove fans from the train, following a National League match between Hartlepool United and York City on Saturday.\nThe 17:53 Grand Central service was \"packed\", fans said, as it was the first train available for them to travel home after the match.\nBritish Transport Police said officers used an incapacitant spray to protect themselves and other passengers when faced with \"significant disorder\".\nFans said it escalated when the train was waiting to leave, as those on board saw that four or five officers had a York fan on the ground, on the platform.\nOne man, who was on the train with his two sons, told the BBC that officers then boarded and \"walked along the carriage pepper-spraying people indiscriminately\".\n\"It was uncontrollable police brutality from start to finish, from anyone and everyone,\" he said.\nSpeaking on the condition of anonymity, he said: \"We've taken three times the number of fans to Halifax and not had any issues.\n\"It was out of control.\"\nBoth football clubs and the York City Supporters Trust had released a joint statement on Friday urging fans to \"enjoy the game responsibly,\" after the same fixture last year was overshadowed by trouble.\nA dedicated York City liaison officer, from North Yorkshire Police, was on the train at the time of the disorder.\nA teenage fan who also wanted to stay anonymous said the York-based officer was a \"credit to North Yorkshire Police\".\n\"I tried to chat with her [during the disorder] and she actually listened, which was a change from the other officers.\"", "url": "https://www.bbc.co.uk/news/articles/cm2jzll5eggo"}