{"authors": ["Sally Bowman", "www.facebook.com"], "date_download": "2025-04-26 03:45:53", "date_modify": "2025-04-26 03:45:53", "date_publish": "2025-03-05 06:10:37", "description": "The former dairy farmers have planted one of the country's largest agroforestry projects.", "filename": "news_articles_c3w182lg1yjo_1745639153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ad3/live/2a032a30-f938-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w182lg1yjo_1745639153.html", "title": "The Nottinghamshire farmers who swapped their dairy cows for trees", "title_page": "The Nottinghamshire farmers who swapped their dairy cows for trees - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A couple have swapped their organic dairy farm for an agroforestry project - planting thousands of fruit and nut trees alongside food and fodder crops.\nDebra and Tom Willoughby, from Normanton-on-Soar in Nottinghamshire, found themselves sinking deeper into debt because milk prices did not meet their costs.\nThey have now switched to create one of the country's biggest agroforestry projects, covering 100 hectares (247 acres).\nThe Willoughbys have planted 11,900 trees - mostly apples for juicing, but also pears, plums, walnuts and hazelnuts.\nThey were able to take advantage of the locally administered Trees for Climate, external fund, which paid for the saplings, tree guards and planting along with ongoing maintenance.\nIn future the farm will be eligible for government agroforestry grants, external of £849 per hectare.\nThe grants are intended to support farmers to improve soil, water and air quality as well as to reduce flooding and contribute to the UK's net zero targets.\nAfter starting dairy farming in 1995, the couple said the last few years had been tough, and by December 2023, they had had enough.\nThey started to plan their exit by planting apple trees three years ago, and said their business had since become more resilient.\nMrs Willoughby says the milk price per litre was never enough to cover their investments in the dairy.\nIn 2023 they were paid 45 pence per litre but calculated it would need to climb to 55 pence for them to make a living.\n\"When things were good, they were really good, but you'd never quite get out of debt,\" Mrs Willoughby explained.\n\"The milk price would drop, and we'd be back to having to borrow money again. And we didn't feel that we'd ever get out of it.\n\"We're lucky. The owner here is very supportive, so we don't have to be worried doing a long-term project like this.\n\"It is a long-term investment.\"\nAgroforestry - the process of combining agriculture and trees - has many advantages, according to the Soil Association, external.\nThe charity says planting trees, shrubs and hedges on farms can give farmers healthier soil and higher yields, as well as creating vital homes for wildlife.\nMeanwhile, below ground, tree roots can help reduce soil erosion, soak up flood water, and improve fertility through mycorrhizal fungus, external.\nFarmers also benefit from growing more than one product to sell.\n\"At those times when there is a drought and one crop doesn't come, then you've got two crops in the field that you can harvest,\" added Mrs Willoughby.\nMr Willoughby said nurturing crops and livestock alongside trees was nothing new.\n\"In the olden days there used to be sheep and pigs underneath apple trees in traditional orchards,\" he said.\n\"Apples have been grown for centuries, and they're an important crop, but we seem to have lost that in our modern farming systems.\"", "url": "https://www.bbc.co.uk/news/articles/c3w182lg1yjo"}