{"authors": ["Samantha Granville", "www.facebook.com"], "date_download": "2025-04-26 04:02:27", "date_modify": "2025-04-26 04:02:27", "date_publish": "2025-03-04 01:55:25", "description": "The \"9-5\" singer met Dean outside a laundromat on the first day she arrived in Nashville as an 18-year-old aspiring singer.", "filename": "news_articles_c241vp9yv1mo_1745640147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b142/live/8ebc93b0-f89a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c241vp9yv1mo_1745640147.html", "title": "Dolly Parton's husband, Carl Dean, dies aged 82", "title_page": "Dolly Parton's husband, Carl Dean, dies aged 82 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Carl Dean, the longtime husband of country music icon Dolly Parton, died on Monday at the age of 82.\nDean, who was famously private throughout his nearly 60-year marriage to Parton, died in Nashville, Tennessee, according to a statement she posted on social media.\n\"Carl and I spent many wonderful years together. Words can't do justice to the love we shared for over 60 years. Thank you for your prayers and sympathy,\" the statement read.\nThe 9-5 singer met Dean outside a laundromat on the first day she arrived in Nashville as an 18-year-old aspiring singer.\nParton, 79, recalled their first meeting, saying, \"I was surprised and delighted that while he talked to me, he looked at my face (a rare thing for me). He seemed to be genuinely interested in finding out who I was and what I was about.\"\nTwo years later, on May 30, 1966, the couple exchanged vows at a private ceremony in Ringgold, Georgia.\nThroughout their marriage, Dean remained out of the public eye, choosing instead to focus on his asphalt-paving business in Nashville.\nThough he largely stayed out of the limelight, Dean continued to influence Parton's work, most notably inspiring her classic hit Jolene.\nShe told US media in 2008 that the song was about a bank teller who developed a crush on Dean.\n\"She got this terrible crush on my husband,\" Parton said. \"And he just loved going to the bank because she paid him so much attention. It was kinda like a running joke between us—when I was saying, 'Hell, you're spending a lot of time at the bank. I don't believe we've got that kind of money.' So it's really an innocent song all around, but sounds like a dreadful one.\"\nParton and Dean's relationship remained such a mystery that rumours started that he did not exist - but Parton joked about that.\n\"A lot of people say there's no Carl Dean, that he's just somebody I made up to keep other people off me,\" she said to the Associated Press in 1984.\nParton and Dean had no children together.\nHe is survived by his siblings, Sandra and Donnie, Parton's statement said.", "url": "https://www.bbc.co.uk/news/articles/c241vp9yv1mo"}