{"authors": ["Eleri Griffiths", "www.facebook.com"], "date_download": "2025-04-26 03:50:46", "date_modify": "2025-04-26 03:50:46", "date_publish": "2025-03-05 12:27:59", "description": "The Hollywood actor has helped 900 people in south Wales with their debts for a new documentary.", "filename": "news_articles_cvg1ewdgk7no_1745639446.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/62e9/live/0baf1db0-f9b4-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1ewdgk7no_1745639446.html", "title": "Michael Sheen buys £1m worth of people's debts", "title_page": "Michael Sheen buys £1m worth of people's debts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hollywood actor Michael Sheen has written off £1m-worth of people's debts, using £100,000 of his own money.\nSheen started a debt acquisition company to help 900 people in south Wales.\nIt has been documented in a new Channel 4 show called Michael Sheen's Secret Million Pound Giveaway, external, due to air next week - five months after the closure of Port Talbot's last blast furnace, which marked the end of traditional steelmaking in south Wales.\nThe show aims to reveal how some banks and finance companies profit from society's most vulnerable.\nIt comes two months after Sheen announced he was funding a new theatre company to fill the gap left by the folding of National Theatre Wales.\nIn 2021, Sheen declared himself a \"not-for-profit\" actor, pledging to use all the money he earns for good causes.\nThe 56-year-old, who has starred in films such as Frost/Nixon and The Damned United, also sold his houses to make sure the 2019 Homeless World Cup went ahead in Cardiff.\nAppearing on the One Show on Tuesday, the actor explained how exactly the system of debts work.\nIt sees people's debts get put into a bundle, with a debt-buying company then able to buy those bundles at a lower price.\nDespite the money being owed by people remaining the same, the companies that own the debt can then sell them for less and less money.\nSheen said he was able to set up a debt acquisition company with £100,000 of his own money to buy £1m worth of debt because it had come down in value.\nAlthough the system was \"bizarre\" and he initially had \"no idea\" how it worked, Sheen said \"it seemed like a good thing to do\".\nThe company was not set up in Sheen's name and he had to be at \"arm's length from it\".\nHe did not know the identity of people's debts he paid off, he only knew where they lived and the kind of debt it was.\nSheen added: \"I would never know who they are - I still don't know who they are.\"\nDuring the making of the documentary, the process became far more complicated than he anticipated.\n\"I thought I would only work on this for a few weeks or a month or something, and it turned into two years, because we had to do it secretly,\" he said.\nSheen added that setting up the company took so long that at a one point he felt like he wasn't going to be able to keep doing it.\nHis mindset changed after filming in a cafe in his hometown of Port Talbot as the local steelworks prepared to close.\n\"The woman who worked at the cafe we were filming in told me the story of the men sitting on every table in tears, who were losing their jobs,\" he said.\n\"And I just thought - then, it really hits home, I just thought anything I can do [to help]\".\nThe hour-long documentary will air on Channel 4 on Monday 10 March - five months after the last remaining blast furnace was closed in Port Talbot - which brought an end to the traditional method of steelmaking in south Wales.\nAs a result, Tata Steel announced that 2,800 jobs were going to be cut which created uncertainty and stress for many families.\nCurrently, Sheen confirmed that he has helped 900 people with their debts across south Wales.\nHe added that due to the \"stigma\" around discussing money, some people might not even realise their debts have been paid off, and therefore he urged people to check their accounts.", "url": "https://www.bbc.co.uk/news/articles/cvg1ewdgk7no"}