{"authors": ["Bob Dale", "www.facebook.com"], "date_download": "2025-04-26 08:04:14", "date_modify": "2025-04-26 08:04:14", "date_publish": "2025-02-26 15:55:12", "description": "Businesses face 12 months of disruption as two sinkholes are repaired in Godstone.", "filename": "news_articles_c99ny2eglpko_1745654654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/63fa/live/2019bf50-f43f-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99ny2eglpko_1745654654.html", "title": "Godstone sinkhole road closures could crucify us, trader says", "title_page": "Godstone sinkhole road closures could crucify us, trader says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The owner of a garage in a village where two large sinkholes appeared has expressed concern over the affect of road closures on businesses.\nThe holes appeared in the centre of Godstone, Surrey, overnight on Monday last week, with the largest hole reaching 65ft (20m) long.\nHomes have been evacuated and a public meeting on Wednesday heard it could take up to 12 months to repair the road.\nGarage owner Shane Fry told BBC Radio Surrey disruption over that time \"could crucify a business\".\nHe said: \"Trying to work out logistics of how we stay open has been extremely difficult.\n\"We can deal with anywhere between 15 and 20 cars a day. It's fairly hectic on a normal week.\"\nBut he added he was hopeful things would improve quickly.\n\"Once we get through the logistics of how our businesses can sustain a normal day I think it'll just become the new norm,\" he said.\n\"And once everyone gets used to it, businesses will carry on surviving.\"\nTandridge District Council's leader, Catherine Sayer, said she believed Surrey County Council understood from the meeting how important it was to improve access and signage for businesses that were affected.\nThe district council, which is also housing some families in emergency accommodation, said with a timescale in place, long-term plans can now be made.\n\"I know some of the residents have sourced Airbnbs that would match the price the council has to pay for Travelodge accommodation,\" she said.\n\"It costs us £500 a week to house a family in a Travelodge.\"", "url": "https://www.bbc.co.uk/news/articles/c99ny2eglpko"}