{"authors": ["Chris Gee", "www.facebook.com"], "date_download": "2025-04-26 03:49:22", "date_modify": "2025-04-26 03:49:22", "date_publish": "2025-03-05 13:41:07", "description": "A Bolton shop owner is ordered to pay £12,000 over serious food safety breaches found in 2023.", "filename": "news_articles_cwynrz4k9z4o_1745639362.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1a74/live/ec862050-f9b3-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynrz4k9z4o_1745639362.html", "title": "Bolton: Rat-infested food shop fined over 'dire and disgusting' state", "title_page": "Bolton: Rat-infested food shop fined over 'dire and disgusting' state - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rat-infested shop where bags of dried foods were found teeming with live insects has been fined for operating under \"dire and disgusting conditions\".\nMaje Worldwide, an African goods shop on Newport Street in Bolton town centre, was inspected by council officers in October 2023 after complaints about smells coming from it.\nThey found the store was in a filthy condition, as vermin had gnawed through walls , there was evidence of an insect infestation and food debris left on the floor.\nOwner James Chidume pleaded guilty to nine food safety offences and was fined £2,000, and ordered to pay Bolton Council £10,000.\nWhen officers visited the shop, they described the conditions as some of the worse they had ever encountered, a Bolton Council spokesperson said.\nThey said the store was found to have a strong offensive odour and was in a filthy condition.\nBags of dried foods were contaminated with live insects, while the premises had no running hot water and there was no evidence of adequate cleaning and disinfection practices being carried out.\nThe shop's owner was immediately served with legal notice and Mr Chidume voluntarily closed the business due to the imminent health risk.", "url": "https://www.bbc.co.uk/news/articles/cwynrz4k9z4o"}