{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:34:59", "date_modify": "2025-05-19 15:34:59", "date_publish": "2015-02-04 11:47:32", "description": "China's central bank has cut the level of funds banks must hold in reserve in an effort to boost growth in the world's second-largest economy.", "filename": "news_business-31129473_1747668899.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/77633000/jpg/_77633656_110046541.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31129473_1747668899.html", "title": "China cuts bank reserve ratio to boost lending", "title_page": "China cuts bank reserve ratio to boost lending - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "China's central bank has cut the level of funds banks must hold in reserve in an effort to boost growth in the world's second-largest economy.\nThe reserve requirement ratio has been cut by 0.5 percentage points to 19.5%.\nThe central bank said it was trying to increase the banking industry's support for small and rural enterprises, construction of water projects and other activity.\nLast month, official figures showed China's economy grew by 7.4% in 2014.\nThat was the slowest rate of growth for 24 years.\nThe rate cut is the first since May 2012, although there have been cuts for select small lenders.\nIn September, China's central bank was reported to have injected 500bn yuan (£50bn) into the five biggest state-owned banks over concerns about slowing economic growth.\nAt the time economists said the move could have a similar effect to a cut in the reserve requirement.\nFears of a slowdown in the global economy have been fuelled by the falling price of oil since last August, which itself has been prompted by a slowdown in demand in China - the second largest consumer of oil in the world.\nThere are also concerns over the levels of indebtedness in China and worries that a housing bubble is developing in the country.\nNeil Mellor, currency strategist at Bank of New York Mellon said the move by the central bank had been \"brewing for a while\".\n\"There's a good chance we'll see more. I certainly wouldn't preclude rate cuts. China is facing the difficult task of trying to move from a heavy-growth and commodity-using economy to a consumer, service sector-oriented economy,\" he added.\n\"I'm still sceptical they will be able to bring down that credit and housing bubble without collateral damage, such as a rather big hit to growth.\"\nSurveys released earlier this week suggested that China's manufacturing sector remained under pressure in January.\nThe official Purchasing Managers' Index (PMI) for the manufacturing sector fell to 49.8, down from 50.1 in December. A reading below 50 indicates a contraction.\nThat echoed a private HSBC/Markit PMI survey, which fell to 49.7 in January.", "url": "https://www.bbc.com/news/business-31129473"}