{"authors": ["James Turner", "www.facebook.com"], "date_download": "2025-04-26 03:48:21", "date_modify": "2025-04-26 03:48:21", "date_publish": "2025-03-05 14:55:03", "description": "Councillors have blamed the loss of a rural services delivery grant and the rising cost of drainage.", "filename": "news_articles_c07zdlrlmdmo_1745639301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8016/live/c4e5b010-f9c7-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zdlrlmdmo_1745639301.html", "title": "Boston council tax rise approved amid 'challenging' times", "title_page": "Boston council tax rise approved amid 'challenging' times - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People in Boston will have to pay 2.99% more for borough council services.\nCouncillors approved a proposed budget on Monday, after leader Anne Dorrian described it as \"extremely challenging\" due to rising costs.\nA Band D home will pay £223.65 per year, a rise of £7.56.\nLincolnshire County Council and the police and crime commissioner have also approved increases, meaning a Band D home is set to pay about £2,167 in total council tax, before the addition of parish council levies.\nPresenting the borough council's report, Councillor Sandeep Ghosh said the challenges were \"driven not by worldwide events, as we have previously seen, but by government and policy changes\".\n\"This means we are receiving significantly less government support than in previous years with the removal of the rural services delivery grant,\" he added.\nGhosh referred to internal drainage board levies as an \"ever-increasing pressure\" and noted a rise of £102,000 for 2025-26.\nThe total bill for the levies would rise to £2,927,050, a 45% increase since 2021-22, he said.\nMeanwhile, the portion of the bill dedicated to the Boston Town Area Committee will rise by 72p to £81.09 a year for a Band D home, according to the Local Democracy Reporting Service.\nLincolnshire County Council approved a 2.99% rise in its portion of council tax, which will rise to £1,625.85 per year for a Band D property, while the police precept will rise to £318.15.\nLast month, borough councillors voted to increase council tax support in order to \"ease the financial burden\" on struggling families.\nDorrian said the move would \"lift approximately 400 families out of poverty\".\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c07zdlrlmdmo"}