{"authors": ["Brandon Drenon", "www.facebook.com"], "date_download": "2025-04-26 07:35:57", "date_modify": "2025-04-26 07:35:57", "date_publish": "2025-02-27 15:01:14", "description": "A US bird flu epidemic has resulted in the deaths of tens-of-millions of poultry and strained the country's egg supply.", "filename": "news_articles_cq6yy9e368vo_1745652957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6370/live/a7b36a10-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq6yy9e368vo_1745652957.html", "title": "Trump administration unveils bird flu plan as egg prices soar", "title_page": "Trump administration unveils bird flu plan as egg prices soar - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US Department of Agriculture (USDA) has announced a $1bn (£792m) plan to help US farmers combat a raging bird flu epidemic that has required them to kill millions of chickens and pushed the cost of eggs to an all-time high.\nOfficials said they will budget $500m for biosecurity measures, roughly $100m for vaccine research and development, and $400m for farmer financial relief programs.\nMore than 35 million birds have been killed in response to bird flu outbreaks in commercial flocks this year, according to USDA data, external.\nThe bird culling has caused the average price for a dozen eggs in the US to hit $5 in January, a 53% increase from 2024 - and the USDA said prices could rise an additional 41%.\nThe Trump administration said it will provide commercial egg farms with best practices and consulting services for free, and pay up to 75% of the costs to address vulnerabilities to help prevent the spread of bird flu.\nTo address the threat of an egg shortage for US consumers, the government said it was willing to consider temporarily importing eggs that meet US safety standards.\nThe USDA also said it will eliminate regulations that they say raise the cost of eggs.\nThe policy changes are not expected to have an immediate effect on egg prices, USDA secretary Brooke Rollins told the BBC's media partner CBS News.\n\"This is more of a long-term solution, but what I can say is that those prices should start coming down maybe this spring, this summer as we work to implement some of those bigger-picture solutions,\" Rollins said.\nSoaring egg prices in the US have had some surprising knock-on effects.\nIn New York City, where a dozen eggs can fetch $14, some stores have reportedly started successfully selling single eggs - called \"loosies\" - to those unwilling to shell out for a full dozen.\nIn February, thieves in Pennsylvania stole over 100,000 eggs worth $40,000 from the back of a lorry.", "url": "https://www.bbc.co.uk/news/articles/cq6yy9e368vo"}