{"authors": ["Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:07:07", "date_modify": "2025-04-26 07:07:07", "date_publish": "2025-02-28 06:06:43", "description": "The proposals include a new Staffordshire unitary council, and a new mayoral strategic authority.", "filename": "news_articles_cvg11krvnqdo_1745651227.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e0b2/live/ce4aeba0-f550-11ef-bf48-f1af4855b062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg11krvnqdo_1745651227.html", "title": "Staffordshire County Council to discuss devolution proposals", "title_page": "Staffordshire County Council to discuss devolution proposals - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Outline plans to create two new councils in Staffordshire will be put forward at an upcoming county council cabinet meeting.\nThe proposal includes a new mayoral strategic authority to cover the whole county, including Stoke-on-Trent, and a new Staffordshire unitary council to provide services in areas currently run jointly by the county, district and borough councils.\nIt will be considered on 5 March.\nThe government announced in December, external it wanted to have the largest shake-up of local government in 50 years with its white paper on devolution.\nIt would see more money and powers coming to areas with a mayor, and two-tier council systems being dismantled and replaced with unitary authorities which would provide all services.\nCouncils in Staffordshire have been asked to submit outline plans for reorganisation to the government by 21 March.\nLeader of Staffordshire County Council Alan White said two-tier local government worked in the county.\n\"It strikes the right balance between countywide strategic services and local council services that meet the needs of our different communities.\"\n\"The government are clear however, that they want to see this replaced with fewer, bigger unitary councils in the future.\"\nHe said the proposal aimed to unlock extra powers and funding from Westminster, to boost the local economy.", "url": "https://www.bbc.co.uk/news/articles/cvg11krvnqdo"}