{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:07:46", "date_modify": "2025-04-26 04:07:46", "date_publish": "2025-03-02 22:02:03", "description": "See all the looks as celebrities arrive for Hollywood biggest night.", "filename": "news_articles_cdrx55zkv6xo_1745640466.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f06/live/00daed50-f7df-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrx55zkv6xo_1745640466.html", "title": "Oscars red carpet fashion: Demi Moore, Cynthia Erivo and more in pictures", "title_page": "Oscars red carpet fashion: Demi Moore, Cynthia Erivo and more in pictures - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stars turn on the style on Oscars red carpet - in pictures\nPublished\n2 March 2025\nThe fashion is almost as important as the films at the Oscars, and Hollywood's finest walked the red carpet in an array of eyecatching outfits before Sunday's ceremony in Los Angeles.\nThey included Wicked star Cynthia Erivo, who wore a shade of her character Elphaba's green in an elaborate velvet ballgown.\nErivo missed out on the prize for best actress, but won the award for best nails.\nCo-star Ariana Grande, who was nominated for best supporting actress, wore a striking champagne Schiaparelli gown.\nHowever, it was perhaps a little impractical - so she changed before performing to open the show with Erivo.\nBest actor contender Timothee Chalamet brought a splash of bright colour in a daffodil Givenchy tux.\nDemi Moore radiated Hollywood style in her jewelled silver gown. She was nominated for best actress for The Substance.\nShe lost out to newcomer Mikey Madison, who paid homage to another sex worker fable, Breakfast at Tiffany's, in a baby pink and black column Dior gown and a Tiffany's necklace from the 1910s - very reminiscent of Audrey Hepburn.\nEmilia Perez star Selena Gomez also went for classic figure-hugging glamour.\nZoe Saldana chose a maroon duvet-dress with a jewel-encrusted bustier. She won best supporting actress for Emilia Perez.\nBest actor nominee Colman Domingo has been a style icon all awards season, and said the choice of red for his custom Valentino jacket represented love.\nAndrew Garfield, dapper in a brown suit, was among the Oscar presenters.\nThe Substance actress Margaret Qualley sported a backless Chanel gown and a backwards diamond necklace.\nBritish star Felicity Jones, nominated for best supporting actress for The Brutalist, wore a slinky metallic custom Armani Privé creation.\nMore on the Oscars 2025:\nLIVE: Follow reaction to the Oscars\nROUND-UP: Anora sweeps the board\nHIGHLIGHTS: A payback kiss, a surprise win, and defying gravity\nWINNERS: Full list of tonight's awardees\nANORA: 'I didn't want to be in a bad stripper film'\nMORE: How to watch the winning films\nJeff Goldblum, who was in Wicked, sported a floral shirt and real flowers on his white dinner jacket, and was accompanied by wife Emilie Livingston.\nMonica Barbaro, nominated for best supporting actress for playing Joan Baez in A Complete Unknown, wore a Dior gown with voluminous skirt.\nA Complete Unknown co-star Elle Fanning had a lace-layered Givenchy dress with long black ribbon belt.\nMichelle Yeoh won best actress in 2023, and wore a blue Balenciaga gown as she joined her Wicked cast-mates this year.\nRachel Zegler, who will soon be seen in a remake of Snow White, wore a strapless studded sheer Dior gown.\nBritish actress Raffey Cassidy, who appears in The Brutalist, had a flowing gown tied with a giant bow.\nBest supporting actor nominee Jeremy Strong wore an olive suit with quirky matching tie as he returned to the red carpet, three decades after he watched the stars from the bleachers as a young fan.\nAna de Armas, who presented an award, wore a sleek black dress with intricate jewelled halter neck.\nDouble Oscar winner Emma Stone went for the flapper look in a shimmering Louis Vuitton dress.\nNosferatu star Lily-Rose Depp wore a sheer floral lace Chanel creation.\nMiley Cyrus also brought goth glam to the red carpet in a beaded black Alexander McQueen gown with halter neck and lace gloves.\nBritish actress Yasmin Finney, known for Heartstopper and Doctor Who, was framed by tall feathers attached to her dress.\nBlackpink singer Lisa sported a dramatic flowing floor-length black-and-white jacket and shirt by Markgong with a red floral brooch. She later performed Live and Let Die in a segment paying tribute to the James Bond films.\nHalle Berry sparkled in a mirrored mosaic effect design.\nFour-time Oscars host Whoopi Goldberg was back as an award presenter this year. Designer Christian Siriano described the reflective look of her dress as like \"liquid water\".\nBest actor winner Adrien Brody's traditional suit had bird-shaped style beading on his shoulder.\nGrammy-nominated singer Omar Apollo wore a netted veil along with black-and-white spotted shirt and scarf.\nWicked actor Bowen Yang, who announced the Oscar nominations in January, opted for floral embellishments on his jacket along with a frilled pink shirt.\nBy Ian Youngs, Scarlett Harris and Matthew Tucker.\nLIVE: Follow BBC coverage of the ceremony\nRECAP: How the Oscars unfolded this year\nBEST MOMENTS: A payback kiss, a surprise win, and defying gravity\nWATCH: Highlights of the show in 180 seconds\nFASHION: See the best looks from the red carpet\nWINNERS: Full list of tonight's awardees\nMORE: How to watch the winning films\nRelated topics", "url": "https://www.bbc.co.uk/news/articles/cdrx55zkv6xo"}