{"authors": ["Maia Davies", "www.facebook.com"], "date_download": "2025-04-26 04:07:56", "date_modify": "2025-04-26 04:07:56", "date_publish": "2025-03-02 21:28:18", "description": "Emily Damari, 28, lost two fingers while being taken captive during the 7 October 2023 attacks.", "filename": "news_articles_c4ge7lzj75mo_1745640476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f6c1/live/caaee020-f774-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ge7lzj75mo_1745640476.html", "title": "Emily Damari: Hostage says scars show 'strength' ahead of surgery", "title_page": "Emily Damari: Hostage says scars show 'strength' ahead of surgery - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A British-Israeli hostage released by Hamas after 15 months in captivity has said her scars represented \"freedom, hope and strength\" as she underwent a series of surgeries for her injuries.\nEmily Damari, 28, was shot in the hand as she was dragged from her home in southern Israel during Hamas's 7 October 2023 attack, causing her to lose two fingers.\nShe said an operation in Gaza had left her in \"intense pain\" for a year and a half, and that a scar from an \"open, festering wound\" did not heal for months due to the conditions in which she was held.\nAhead of her treatment, Ms Damari said she had \"fully embraced\" the pain and injuries because of what they symbolise to her.\nMs Damari was held by Hamas in Gaza for 471 days prior to her release. She was one of the first hostages to be freed as part of a ceasefire deal struck between the Palestinian armed group and Israel after 15 months of fighting.\nShe was taken from her home in Kibbutz Kfar Aza, near the Gaza border, on the morning of Hamas's unprecedented attack.\nMs Damari was also shot in the leg, and previously said she had only received an out-of-date bottle of iodine to treat her wounds while in captivity.\nThe 28-year-old said the complex operations on her hand and leg in Israel's Sheba Medical Center had gone \"much better than expected\".\nShe said the scar on her hand was \"looking better\" and that the pain, caused by \"the nerves being sewn together\" in Gaza, had gone.\nNow, with the help of physiotherapy, she hoped to have improved use of her hand.\nBut Ms Damari noted that her recovery would take time and her hand would \"never fully recover\".\nShe said the conditions in which hostages were being held were \"unimaginable\".\n\"It was shocking but not surprising to see how emaciated some of the other hostages were when they came out,\" she reflected.\n\"Hamas has created hell on Earth,\" she said, adding that there were others whose mental and physical health was \"in much worse shape\" than hers. She called for the release of all remaining hostages without delay.\nMs Damari's mother, who grew up in Beckenham in south-east London, added that her daughter had been \"sewn up like a pin-cushion\" in Gaza.\n\"It is nothing short of a miracle that she did not contract a life-threatening infection,\" said Mandy Damari.\nMs Damari said she was \"so excited\" to visit the UK with her mother once she had healed and the remaining hostages are released.\n\"I have so many people that I want to thank personally for helping me get my life back.\"\nThe pair have been invited to Downing Street by UK Prime Minister Sir Keir Starmer, who previously spoke to Ms Damari over the phone.\nDuring that conversation, she said she had been held at United Nations facilities during her captivity. The UN's Gaza agency has called for an independent investigation into the allegation.\nIn total, 251 hostages were taken by Hamas when it attacked Israel on 7 October 2023, and a further 1,200 people were killed.\nThe attack triggered a war which has devastated Gaza. Israel's military offensive killed at least 48,365 people, according to the territory's Hamas-run health ministry.\nThe first phase of a ceasefire came into force on 19 January, allowing the release of 33 Israeli and five Thai hostages in exchange for about 1,900 Palestinian prisoners.", "url": "https://www.bbc.co.uk/news/articles/c4ge7lzj75mo"}