{"authors": ["Christopher Mace", "www.facebook.com"], "date_download": "2025-04-26 03:45:13", "date_modify": "2025-04-26 03:45:13", "date_publish": "2025-03-05 06:22:26", "description": "Jude Peters has gone from racing in his bedroom to becoming a professional driver in the space of two years.", "filename": "news_articles_cvg1pk2ve88o_1745639113.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b0f3/live/8b083680-f371-11ef-8402-45d3cf1c2dcb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1pk2ve88o_1745639113.html", "title": "Teenager swaps racing games for competing on the track", "title_page": "Teenager swaps racing games for competing on the track - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jude Peters is about to race a car that can do 160mph even though he has never driven on a road.\nThe 16-year-old, from Malmesbury, Wiltshire, was a sim racer, but has gone from racing in his bedroom to a real endurance racing contract in just two years.\nHis contract with Team Virage in the Ligier European Series will see him compete at famous European circuits, including Le Mans and Silverstone.\n\"My dream goal was just to be able to do endurance racing, and now I'm doing that at the most iconic tracks in the world,\" he said.\nJude's rise to professional racing has been rapid.\nJust two years ago he had never driven a racing car of any kind, nor taken part in competitive karting, which is the usual pathway.\nHe had been racing for years at home with a basic simulator set up in his bedroom - a racing wheel and some pedals that plug into a PC.\nKnowing how much Jude loved sim racing, his parents booked him onto the simulator experience at the Ginetta Race Cars HQ near Leeds.\nHe was immediately quicker than the factory driver.\nGinetta invited Jude to take part in a competition for its Junior Scholarship, which he won, giving him a partly-funded drive in the Ginetta Junior Championship.\nThe next step, the Ligier European Series, is the first on the endurance racing ladder and Jude's new team, Virage, has won the championship for the last three seasons.\nHe was at the Paul Ricard circuit last week to test his new car.\n\"It's a difficult career to get into and there are so many people that want to,\" said Jude.\n\"For the people that make it, it's a small percentage, but it's a goal I have and I'd like to get to the top.\"\nJude's mum, Kirsty, watched nervously through her fingers as her son competed in the Ginetta series.\n\"I was terrified the whole time,\" she said.\n\"Jude has put in a lot of time, a lot of dedication and a lot of hard work, and this hasn't come easy to him.\n\"We've become his managers, supporting him in making sure he eats the correct food, making sure he's exercising, booking accommodation, doing the PR.\n\"It feels like it can be a full time job.\"", "url": "https://www.bbc.co.uk/news/articles/cvg1pk2ve88o"}