{"authors": ["Fan Wang", "www.facebook.com"], "date_download": "2025-04-26 07:07:59", "date_modify": "2025-04-26 07:07:59", "date_publish": "2025-02-28 05:08:26", "description": "The incident happened during a public event where the K-pop star hugged 1,000 fans.", "filename": "news_articles_cly226jj0pgo_1745651279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b2d3/live/bf4b8590-f593-11ef-869c-0723920a6778.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly226jj0pgo_1745651279.html", "title": "BTS: Japanese woman under investigation for kissing Jin", "title_page": "BTS: Japanese woman under investigation for kissing Jin - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Japanese woman who unexpectedly kissed K-pop boy band BTS's Jin at a fan event last year has found herself under investigation by South Korean police.\nPolice have called for the woman - who is currently in Japan - to come forward for questioning on charges of sexual harrassment in a public space.\nThe incident happened during the K-pop idol's first public event in Seoul last June, which saw him hug 1,000 fans. Instead of just hugging the star, the woman appeared to have kissed his face, with Jin responding by turning his face away.\nThe kiss angered other BTS fans, one of whom filed a criminal complaint against her, leading police to launch an investigation.\nOn 13 June, 2024, the day after he was discharged from the army, Jin, whose real name is Kim Seok-jin, held a fan event where he hugged 1,000 fans and performed songs in front of 3,000 others.\nDuring the three-hour long \"hugathon\", fans who won the chance to embrace him queued up and went on stage one by one to meet the 33-year-old star.\nBut one of them caused an uproar when she appeared to kiss Jin's face.\nClips of the moment went viral on the internet. Videos show that Jin, taken aback by the move, tried to turn his head while hugging the woman before quickly moving on to the next fan. Fans could also be seen reacting angrily to her actions.\nShe later wrote on her blog later that she kissed him \"on his neck\" and \"the skin was very soft\".\nThe woman's identity has not been revealed but police added that they had identified her with the assistance from their Japanese counterparts.\nThe BBC has reached out to BTS' agency HYBE for comment.\nJin is the first BTS member to have been discharged from military duty. He was followed by J-Hope who was discharged in October. The other five - V, RM, Jimin, Jungkook and Suga - are still serving and the band is expected to reunite only in June 2025.\nK-pop idols are known for having a close relationship with their fanbases through various communication channels and events. It's common for artists to communicate with fans through social media livestream chats and in-person events to cultivate loyal fans.\nBut fans and agencies have increasingly been aware of some toxic fan cultures as well. For example, many artists have been vocal about the stress caused by \"sasaeng fans\", who are overly obsessed with their idols that would stalk and harass the artists.", "url": "https://www.bbc.co.uk/news/articles/cly226jj0pgo"}