{"authors": ["Stuart Maisner", "www.facebook.com"], "date_download": "2025-04-26 04:24:45", "date_modify": "2025-04-26 04:24:45", "date_publish": "2025-03-03 12:31:39", "description": "The A259 is open again westbound on Brighton seafront but remains closed eastbound.", "filename": "news_articles_c4g02j7392lo_1745641485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/073b/live/138c07f0-f824-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g02j7392lo_1745641485.html", "title": "Brighton road partially reopens outside fire-damaged hotel", "title_page": "Brighton road partially reopens outside fire-damaged hotel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A busy Sussex city centre seafront road has partially reopened 10 days after a warning of \"catastrophic collapse\" of a hotel that had been devastated by fire.\nTraffic has resumed in both lanes on the A259 westbound in Brighton, but diversions remain eastbound.\nThe Royal Albion Hotel was partially destroyed in July 2023 after a fire broke out in the building, believed to have been caused by a discarded cigarette.\nTrevor Muten, cabinet member for transport at Brighton & Hove City Council, said: \"Until urgent demolition work has been carried out to make the structure safe we can't open more of the road.\"\nMuten said: \"I want to thank residents, businesses and visitors for their understanding and patience as we work to restore access and get movement in the city centre back to normal.\"\nA council spokesperson said: \"We've concluded that given the position of the pedestrian island on the road outside the hotel, there is insufficient space to install a contraflow which would allow traffic in both directions.\"\nThe council said it would work with Britannia Hotels (the Royal Albion Hotel's owner) and the contractors to get the rest of the road reopened \"as soon as possible\".", "url": "https://www.bbc.co.uk/news/articles/c4g02j7392lo"}