{"authors": ["George King", "www.facebook.com"], "date_download": "2025-04-26 06:36:50", "date_modify": "2025-04-26 06:36:50", "date_publish": "2025-02-26 06:42:52", "description": "The UK Airprox Board hears the two aircraft came within 500ft of each other over a town.", "filename": "news_articles_c07zkd5k5eeo_1745649410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b73/live/96a3cc20-f3b2-11ef-9963-97f48f5bf5d5.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zkd5k5eeo_1745649410.html", "title": "Military plane narrowly avoided glider crash over Suffolk", "title_page": "Military plane narrowly avoided glider crash over Suffolk - report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An RAF transport plane and privately operated glider narrowly avoided crashing into each other during an \"extremely close encounter\", investigators said.\nThe near-miss occurred above Bury St Edmunds in Suffolk as a Boeing C-17 Globemaster III transport plane headed to land at the US Air Force base of RAF Mildenhall on 17 July 2024.\nThe pilot spotted an ASH 31 glider ahead of its position before \"rapidly disconnecting the autopilot\" and performing a hard left turn to avoid a mid-air crash at about 15:30 BST.\nThe UK Airprox Board, external concluded there had been a \"serious risk of collision\" as the aircraft came within 500ft (150m) of each other, assessing it as Category A - the highest possible risk.\nC-17s are used by the Royal Air Force and the United States Air Force and have a maximum take off weight of 265,350kg (585,000lb).\nASH 31 gliders are single seat aircraft with a wingspan of either 18m or 21m and a maximum take off weight of 700 kg (1,543 lb).\nDuring the investigation it was established the glider pilot had switched off their transponder in order to save battery, having been airborne for over six hours.\nHowever, in doing so, neither the pilot of the C-17 nor air traffic control at Lakenheath were able identify the glider was flying within the same airspace.\nThis, coupled with the glider having \"incompatible\" electronic equipment, also meant the ASH 31 pilot could not detect the C-17 ahead of time.\nInvestigators ruled this had \"limited the effectiveness of recognised barriers to mid-air collision\" in what is \"one of the busiest military airfields\" in the UK.\nThey did, however, acknowledge the glider pilot \"had done all possible\" to avoid the collision upon seeing the C-17.", "url": "https://www.bbc.co.uk/news/articles/c07zkd5k5eeo"}