{"authors": ["Eleanor Storey", "www.facebook.com"], "date_download": "2025-04-26 08:07:50", "date_modify": "2025-04-26 08:07:50", "date_publish": "2025-02-26 14:02:36", "description": "The comment allegedly came while a silent vigil was being held in Norfolk.", "filename": "news_articles_crrd5ggvlz8o_1745654870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f129/live/9cf35c60-f071-11ef-9b94-9bfa8e4c254d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd5ggvlz8o_1745654870.html", "title": "Police close investigation into councillor's alleged 'Nazi' comment", "title_page": "Police close investigation into councillor's alleged 'Nazi' comment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police investigation into an alleged incident in which a councillor was said to have shouted \"Nazis\" at a group of women holding a silent vigil has been dropped.\nCharlie Caine, who represents the Green party on Norwich City Council, has been issued \"words of advice\" by Norfolk Police.\nThe organisers of a vigil for Afghan women claimed the councillor yelled at them at an event being held in support of Afghan women on 1 February, calling them \"Nazis\" and \"transphobes\".\nThe councillor, who is a transgender man, has been contacted by the BBC for comment but has yet to respond so far.\nA spokeswoman for Norfolk Police told the Local Democracy Reporting Service: \"Officers gave a person words of advice and the investigation will now be closed.\"\nMembers of the Norwich Women's Rights Group and Women's Rights Network Norfolk were at the vigil.\nThe groups believed the alleged comment was made because they had previously raised concerns about the alleged impact of \"trans ideology\" on women and girls.\nHowever, they stressed the vigil, held outside The Forum, was not related to trans issues.\nThe councillor has publicly opposed the groups in the past.\nA spokesman for the Green Party previously said: \"We can confirm that this matter has been referred to the Green Party and will be reviewed in line with process.\n\"We cannot comment on individual disciplinary cases.\"", "url": "https://www.bbc.co.uk/news/articles/crrd5ggvlz8o"}