{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 03:47:38", "date_modify": "2025-04-26 03:47:38", "date_publish": "2025-03-04 18:21:23", "description": "The victim's widower is selling their house as living there is \"unbearable\" without her.", "filename": "news_articles_c15qwwwpv88o_1745639258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/181b/live/fe5a9240-f916-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qwwwpv88o_1745639258.html", "title": "Bus driver sentenced over Northampton pedestrian death", "title_page": "Bus driver sentenced over Northampton pedestrian death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bus driver who killed a 75-year-old woman after driving through a red light at a pedestrian crossing has been given a suspended sentence.\nTimothy Pott, 55, pleaded guilty to causing the death of Brenda Hawes by dangerous driving in the St James area of Northampton a year ago.\nHe was sentenced to 24 months' imprisonment, suspended for 16 months at Northampton Crown Court.\nMs Hawes' husband of 55 years told the court it was \"almost unbearable at times to live in our home on my own\".\nThe court heard that Pott, of Ecton Park Road in Northampton, was driving a single-decker Stagecoach bus along St James Road at about 08:30 GMT on 26 February 2024 when he failed to stop at a red light.\nThe vehicle hit Ms Hawes, who was walking on a pedestrian crossing on her way to the charity shop where she volunteered.\nNorthamptonshire Police said she died at the scene \"despite the efforts of the emergency services\".\nIn his victim impact statement, her husband said: \"I still have times when my emotions take over. I miss her, our love and companionship in the 60 years since I met her at ballroom and old-time dancing lessons.\n\"We continued dancing until she died – going to tea dances twice a week.\n\"We all miss her greatly for her love and helpfulness. She worked at the RVS shop at Northampton General Hospital for 17 years and did voluntary work at three charity shops at various times.\"", "url": "https://www.bbc.co.uk/news/articles/c15qwwwpv88o"}