{"authors": ["Christopher Mace", "www.facebook.com"], "date_download": "2025-04-26 04:18:22", "date_modify": "2025-04-26 04:18:22", "date_publish": "2025-03-04 06:34:46", "description": "Forest View school is dedicating its library to Roy Mills, who fought at Imjin River.", "filename": "news_articles_cx2rrv82wx3o_1745641102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0bf6/live/00fdf710-f8ce-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2rrv82wx3o_1745641102.html", "title": "Gloucestershire school library named after Korean War veteran", "title_page": "Gloucestershire school library named after Korean War veteran - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A school library is being dedicated to a British veteran of the Battle of Imjin River.\nRoy Mills, from Cinderford, was the last surviving member of the Glorious Glosters - a name given to the Gloucestershire Regiment who fought at Hill 235, now known as Gloster Hill, in South Korea.\nForest View Primary School in Mr Mills' hometown will name its library after him, after his death in October 2024.\nThe 6.25 Foundation, an American charity that honours the legacies of Korean War veterans, is donating £4,000 to the school's library.\nStaff at the school were initially surprised at being offered a donation to the library.\n\"We received an email back in December from 6.25 Foundation and we initially thought it wasn't real,\" said head teacher Ben Lyons.\n\"But we did some research and ran our checks, and Mr and Mrs Koo from the foundation are joining us at the ceremony and making that kind and very generous donation.\n\"Roy Mills was from Cinderford, his daughter Sally was a teaching assistant here for many years, so it's great.\"\nHe added: \"We've also been teaching particularly the older children more about Roy's story and the Korean War.\"", "url": "https://www.bbc.co.uk/news/articles/cx2rrv82wx3o"}