{"authors": ["Pauline McLean", "www.facebook.com"], "date_download": "2025-04-26 06:24:38", "date_modify": "2025-04-26 06:24:38", "date_publish": "2025-02-28 22:55:02", "description": "The actor plays architect Martyn in the new Amazon Prime thriller Fear.", "filename": "news_articles_c5y0l5954p5o_1745648678.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b78c/live/bca502c0-f5f8-11ef-9de2-8d109cf4aecf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0l5954p5o_1745648678.html", "title": "Martin Compston: 'Vegas is lovely but so is Greenock'", "title_page": "Martin Compston: 'Vegas is lovely but so is Greenock' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's more than two decades since Martin Compston was cast as the lead in the film Sweet Sixteen, catapulting him from school in Greenock to the Cannes Film Festival.\nHe's barely been out of work since, appearing in Monarch of the Glen, Red Road, A Guide to Recognising Your Saints and Line of Duty.\nNow 40 and with a family of his own, he divides his time between Greenock and Las Vegas.\nSo the part of architect Martyn in the new Amazon Prime thriller Fear was a perfect fit as it let him work from home.\n\"It's a joy when something like that comes in and you read it and realise it's set in Glasgow and you can work from home.\n\"It's one of the brilliant things about this job, getting to travel the world. But you always want to make stuff that the home squad is proud of.\"\nThe three-part thriller is based on the novel Fear by Dirk Kurbjuweit and adapted for the small screen by Mick Ford.\nIt concerns a family leaving London for a new life but finding very unsettling things happening around their new home, not least the neighbour in the basement played by Solly McLeod.\n\"Everyone can relate to the issue of neighbours,\" says Martin.\n\"All these tiny things – like moving your bins, or parking your car, can become huge in this world and if you throw the things we throw at it…\"\nThe cast includes Daniel Portman (Game of Thrones), Anjli Mohindra (Vigil) and Scottish veterans Maureen Beattie and James Cosmo.\n\"I've been lucky enough to work with James a few times and he's a legend,\" says Martin.\n\"You believe all the relationships. And that's a big credit to the director and the casting director.\"\nThe film was made entirely on location in the Park Circus area of Glasgow. The grand town house commanding views across the city plays as important a character in the series as any of the cast.\n\"Even for us, exploring five levels of the house was fascinating and then there was a secret level above that where the servants would be, and a coach house. It was a wonderful spot to film.\n\"As an industry its great to see how we've grown and how we've cornered the market for gritty drama and urban decay but we have beautiful parts of Glasgow which we've not seen on screen.\n\"When I was younger I would go on school trips from Greenock to Kelvingrove art gallery and I'd look at those houses and wonder who lived up there. I've found out it's a lot of Celtic and Rangers players and it was funny trying to do an intense scene and one of my heroes would be out walking their dog.\"\nFear is just the latest show which has allowed Martin to work on his home turf. He's also filmed two seasons of The Rig at FirstStage Studios in Edinburgh, as well as the drama Mayflies and his light-hearted travel series Scottish Fling.\n\"I've been really luck to be able to film all these roles in Scotland, meaning I can get home to Greenock at the weekend,\" he says.\n\"A warm Vegas night under the stars is lovely but the view we have from the couch in Greenock where you see these huge cruise ships coming in from all over the world is also amazing.\"\nMany of his recent jobs have been for streaming companies like Amazon Prime, which makes Fear and premiered the first episode at the Glasgow Film Festival.\n\"There would have been a time a couple of years ago when they would have premiered this in London,\" says Martin.\n\"But the fact that we're here and part of the film festival, having a Glasgow premiere for a Glasgow audience. It's been a joy to watch our industry grow and be a part of that. And long may that continue.\"\nHis next job is ITV thriller Red Eye.\n\"I'm under no illusions how lucky I am to be given the chance to lead these big shows,\" he says.\n\"There's a lot of running around pretending to be a tough guy.\"\nWhich sounds a lot like DI Steve Arnott of AC-12 in Line of Duty, which drew to a close in 2021 after six seasons.\nHe and fellow cast members Vicky McClure and Adrian Dunbar are still close and he frequently catches up with creator Jed Mercurio in the US.\n\"I speak to Vicky daily, he says, \"and I'm going to the Brits with her. I speak to Adey about football on a weekly basis\".\nBut as to a return of the series?\n\"We're all working on different projects so it's about getting time when we're all free and having a story to tell,\" he says.\n\"In another world we'd have pumped out series after series because people were clamouring for it. We'd love to do it at some point but I've just started this, Jed is in America, Adey is booked up, Vicky is booked up.\n\"The most important thing is to have a story to tell. Jed will only do it when he hits on something which gives us a reason be back. Not just for the sake of it.\"", "url": "https://www.bbc.co.uk/news/articles/c5y0l5954p5o"}