{"authors": ["Samantha Granville", "www.facebook.com"], "date_download": "2025-04-26 06:48:28", "date_modify": "2025-04-26 06:48:28", "date_publish": "2025-03-01 11:16:44", "description": "After leaving Hollywood, Gene Hackman retired in Santa Fe, New Mexico, where he became a fixture in the community.", "filename": "news_articles_c36w7e4kglzo_1745650108.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eed4/live/e20eee70-f6a9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c36w7e4kglzo_1745650108.html", "title": "Pilates, painting and bike rides: Gene Hackman's life in Santa Fe", "title_page": "Pilates, painting and bike rides: Gene Hackman's life in Santa Fe - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gene Hackman was a normal person in Santa Fe. And he really loved that.\nResidents in the New Mexico city say they were excited to welcome such a massive celebrity to the community when he and his wife Betsy Arakawa arrived more than 20 years ago, but they treated him like anyone else.\n\"He wasn't famous here\" was the phrase I heard when asking residents about why the movie star chose to call New Mexico's capital home. They describe a down-to-earth, chatty man who supported local businesses and enjoyed its flourishing arts scene.\nEveryone here has a story to tell about Hackman, who was found dead alongside his wife and their dog at their home in the quiet desert city earlier this week.\nHackman was a lover of the arts and a painter himself, so he fit in well: Santa Fe is known for its iconic adobe architecture and is home to more than 250 galleries.\nEverything in Santa Fe is colourful, from the woven tapestry hanging on shop walls to the clothes people wear and even their personalities.\nThere are murals in almost every alley and metal street art lining the roads.\nHackman immediately got involved with local art museums, most notably sitting on the board of directors at the Georgia O'Keeffe museum, while Arakawa had a luxury home-goods store, and collaborated with artists on various projects.\nHackman's paintings are displayed prominently at local restaurants, and there are a few lucky residents who have them hanging in their home.\nOne of those people is Stuart Ashman, the executive director of the Artes de Cuba gallery.\nMr Ashman first met Hackman at a community arts meeting. He was running late and there was one seat left when he arrived: next to the Hollywood star.\nThey shook hands and that started two decades of friendship.\n\"He was so down to earth that you didn't realize that you were talking to a celebrity. He was more interested in you than in telling you about himself,\" Mr Ashman said.\nWhile both men supported the arts community, their real bond came through Pilates workouts when they took back-to-back private lessons.\nWhen asked who was better, Mr Ashman laughed. \"I think we're both pretty bad,\" he said. \"Our teacher said I was lazy and he was older and stiffer.\"\nMr Ashman said Hackman often got in trouble for being too much of a chatterbox.\n\"Gene, are you going to workout or do you just want to talk to Stuart today?\" Mr Ashman recalls their Pilates teacher asking.\nEvery week, Mr Ashman, who raised chickens, would bring a dozen eggs to Hackman.\nThen one day, he showed up with a huge landscape painting as repayment to Mr Ashman, who didn't want to accept it. But Hackman insisted and said a painting for eggs is \"a very fair deal\".\nWhen Hackman wasn't at Pilates or riding his bike through the beautiful landscape, he loved to spend time at his home in the hills above the city, his friends said.\nPerched on a 12-acre plot, the property has panoramic views of the surrounding mountains, with vistas stretching as far as Colorado.\nHackman purchased the home in the 1980s before starting expansive renovations. He wanted this home to have meaning, so he worked with an architect to blend Pueblo, Colonial, and Spanish Baroque architectural styles to pay homage to Santa Fe's rich cultural history.\nArakawa also enjoyed her secluded life in Santa Fe. People I spoke to said she was a talented pianist and smart business woman.\nThe only person who liked working out more than Hackman was Betsy. They said she was in incredible shape, always attending exercise classes.\nVictoria Murphy, a real estate agent and actress, saw him around town on several occasions.\n\"I was in the middle of the street as I was crossing in the crosswalk, and he started to go through the stop sign at that time, and then suddenly saw me stopped, waved, smiled, held up both hands, you know, like in a surrender,\" she recalled. \"And I just smiled and kept going.\"\nAt a local restaurant in town, customers told me they'd see him at the grocery store, or shopping on the high street.\nDavid, the general manager of a shop in downtown Santa Fe where Hackman was a long-time patron, was holding back tears, remembering his friend and client.\n\"Since he lived here, he wanted to use his money towards the local people. He always bought Seiko watches from my store for his friends and family.\n\"He invested in local restaurants and grocery stores, and showed up to openings for art museums. It obviously wasn't because he needed the money, but because he loved the local flare,\" he said.\n\"We lost a great Santa Fein.\"", "url": "https://www.bbc.co.uk/news/articles/c36w7e4kglzo"}