{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 08:10:39", "date_modify": "2025-04-26 08:10:39", "date_publish": "2025-02-26 12:27:22", "description": "Dennis Meredith says he is horrified by the plan to cut £30,000 from the Royal and Derngate's grant.", "filename": "news_articles_cn8rxpn3302o_1745655039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c64d/live/ca801f20-f42b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8rxpn3302o_1745655039.html", "title": "Northampton theatre could close after budget cut, says councillor", "title_page": "Northampton theatre could close after budget cut, says councillor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A councillor has warned that a county could lose its biggest theatre if a planned funding cut goes ahead.\nThe Royal and Derngate in Northampton is set to lose £30,000 of its grant from West Northamptonshire Council.\nDennis Meredith, a Liberal Democrat member of the authority, told councillors: \"Every year, you pick on the Derngate.\"\nThe council said it \"greatly valued\" the venue but had to \"make difficult decisions\".\nThe Royal, a traditional repertory theatre, opened in 1884. The Derngate, a modern flexible auditorium, staged its first performance next door almost a hundred years later.\nThey were merged into one complex in 2005.\nWest Northamptonshire Council's budget for the next financial year, which was agreed last week, external, included a measure to cut £30,000 from the venue's £300,000 subsidy.\nMeredith, a former Mayor of Northampton, said he was \"quite horrified\" by the proposal and said the theatre was putting on plays \"on a shoestring\".\nHe told the Conservative-controlled council: \"Every single year, you pick on the Derngate.\n\"If you're not careful, we're going to lose the Derngate, and that is a fact.\"\nA spokesperson for the Royal and Derngate said: \"Annual grant funding from both Arts Council England and West Northamptonshire Council contributes an important 15% of annual income at Royal and Derngate, with the theatre earning the remaining 85% from tickets sales, bars sales and other activities.\n\"Any decrease in funding is always of concern but we are very grateful for the ongoing support of our stakeholders and funders who help us to continue delivering the level of work of which we are so proud.\"", "url": "https://www.bbc.co.uk/news/articles/cn8rxpn3302o"}