{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:06:26", "date_modify": "2025-04-26 07:06:26", "date_publish": "2025-02-28 06:17:22", "description": "The 4.99% increase was agreed by Liberal Democrat and Labour councillors, while Conservatives opposed.", "filename": "news_articles_c8x441q28wko_1745651186.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ad7c/live/b17049e0-f536-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x441q28wko_1745651186.html", "title": "Westmorland and Furness Council tax rise 'protects services'", "title_page": "Westmorland and Furness Council tax rise 'protects services' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors have approved a tax rise of 4.99%.\nThe Liberal Democrat-led Westmorland and Furness Council said the move would \"protect frontline services in tough financial times\".\nLabour councillors joined Liberal Democrats to vote in favour, while Conservatives voted against the proposals.\nThe authority hopes to raise £184.52m through the council tax rise, which will result in a band D tax of £1,918.97 - an increase of £91.71 on the previous year.\nThe increase, from 1 April, consists of a 2.99% general increase and a further 2% ringfenced to pay for adult social care.\nA public consultation on the proposals found 69.3% of 353 respondents were against the general increase of 2.99%.\nDeputy leader councillor Andrew Jarvis told the council chamber he recognised the increase would be \"difficult\" for many residents, the Local Democracy Reporting Service said.\nHe added: \"I recognise the majority of those who responded to the consultation were against this scale of increase.\n\"However, we must ensure that the financial position of this council is sustainable.\n\"Cuts invariably hit the most vulnerable residents hardest, so...I can confirm this means we will maintain all our frontline services.\n\"There are no cuts to services.\"", "url": "https://www.bbc.co.uk/news/articles/c8x441q28wko"}