{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:31:36", "date_modify": "2025-04-26 07:31:36", "date_publish": "2025-02-27 17:09:22", "description": "Dualla Abdi stabbed Tyreece Scott in January last year and was caught because of his Louis Vuitton bag.", "filename": "news_articles_c5y00g71k14o_1745652696.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2c88/live/27318d60-f537-11ef-a372-9f83dba237c1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y00g71k14o_1745652696.html", "title": "Hounslow dealer identified by designer bag given life for murder", "title_page": "Hounslow dealer identified by designer bag given life for murder - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A drug dealer has been jailed for life for the \"callous and cowardly\" killing of a rival after police identified him by his designer Louis Vuitton bag.\nDualla Abdi, 21, disposed of his clothes but not the valuable bag after he fatally stabbed Tyreece Scott in Hounslow, west London, in January last year.\nAbdi, from Acton, was found guilty of murder and having a blade, and was jailed for life with a minimum term of 22 years.\nHis accomplice and getaway driver Ben Laing, 24, from Feltham, was also found guilty of murder and jailed for life with a minimum term of 22 years.\nAt their Old Bailey sentencing, members of Tyreece Scott's family spoke of the young man they knew as \"kind, gentle and loyal\", with \"big hopes and dreams\".\nHis mother Lynette Phillip said she struggled to understand how and why her son was attacked in such an \"evil, cold and callous\" way.\nShe told the court: \"Tyreece was 6ft 3in and despite his size he was the gentlest person I know. He was loving, kind, loyal and funny, and he had the most amazing cheeky smile.\n\"Ty was only 24 years old and he had his whole life ahead of him. He had so many dreams and aspirations.\"\nPointing to a photograph of his coffin, she said: \"This picture is the outcome of what carrying a knife leads to and the daily consequences of knife crime.\n\"I hope that one day no other person will have to feel the way I do and have to bury their child before their time because of callous and cowardly people like Dualla Abdi and Ben Laing.\"", "url": "https://www.bbc.co.uk/news/articles/c5y00g71k14o"}