{"authors": ["Greig Watson", "www.facebook.com"], "date_download": "2025-04-26 08:01:22", "date_modify": "2025-04-26 08:01:22", "date_publish": "2025-02-26 17:35:26", "description": "The procurement process starts to find the suppliers who will run the technology for the trials.", "filename": "news_articles_c0jgny6ll83o_1745654482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f15c/live/85bec110-f440-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jgny6ll83o_1745654482.html", "title": "Contactless rail tickets scheme trial moves closer", "title_page": "Contactless rail tickets scheme trial moves closer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A trial of a contactless payment system for rail travel in the East Midlands and Yorkshire has moved a step closer.\nThe tap-and-go scheme, similar to that used in London, will use GPS data to calculate the best fare for on the day journeys.\nThe government has now confirmed it has started the procurement process to find the suppliers who will run the technology for the trials.\nWhile the pilot is expected to include Derby, Nottingham and Leicester, the routes further north have not been confirmed, officials said.\nThe successful bidders will work alongside Northern and East Midlands Railways to deliver the trials, which are expected to use a bespoke app to track location and journeys, and provide a barcode for staffed inspections.\nRail Minister Lord Hendy said: \"We've seen the success that contactless ticketing has on making journeys easier to navigate and attracting more people to our railways.\n\"It's only right that we now look to expand contactless ticketing to other major cities across the North and Midlands, ensuring they can reap the economic benefits that simpler ticketing offers and that passengers are having a better experience.\"\nJacqueline Starr, chief executive officer of Rail Delivery Group, said: \"We are proud to support the pay-as-you-go trials in Yorkshire and the East Midlands.\n\"This is another step in making fares and ticketing easier for everyone.\n\"We are committed to developing a simpler fare system that not only meets passengers' expectations but also supports the long-term growth of rail travel, making customers experience of the railway better.\"\nIt is hoped the initial payment system will be in place by the end of the year, officials said.\nEarlier this year saw the latest phase in the rollout of non-GPS contactless ticketing at 53 stations across the South East.\nIn the first six months of contactless ticketing being available at the first six stations, more than 268,000 entries and exits were made using contactless cards or mobile devices, the government said.\nThe Department for Transport is also working closely with Greater Manchester and the West Midlands to develop their proposals for rolling out contactless ticketing even further.", "url": "https://www.bbc.co.uk/news/articles/c0jgny6ll83o"}