{"authors": ["Joe Willis", "www.facebook.com"], "date_download": "2025-04-26 07:27:02", "date_modify": "2025-04-26 07:27:02", "date_publish": "2025-02-27 21:09:52", "description": "Key parts of the Harrogate Station Gateway plan are not subject to legal action, councillors told.", "filename": "news_articles_clyrr53dkygo_1745652422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0395/live/2b5b62f0-c92f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyrr53dkygo_1745652422.html", "title": "Gateway works 'can start despite legal challenge'", "title_page": "Harrogate Station Gateway works 'can start despite legal challenge' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council chiefs are set to give the go-ahead for work to start on the £12m Harrogate Station Gateway scheme despite an ongoing legal challenge from local businesses.\nNorth Yorkshire Council bosses said key elements of the project were not subject to the legal action brought by campaign group Get Away.\nCouncillor Keane Duncan, executive member for highways, told councillors at a full meeting this week that the challenge \"will not halt construction\".\nHe said: \"We are fighting this challenge as strongly and as robustly as we can. We're preparing to fight the case in the High Court.\"\nGet Away says the council did not consider the project's wider impact or consult fully with the public, meaning issuing traffic regulation orders (TROs) would be illegal.\nBut Duncan said the authority could proceed with elements of the scheme that fall outside of the TROs, including work on Station Parade, the One Arch underpass and changes to the traffic signals.\n\"A report will be taken to the executive at the earliest opportunity to enable construction to happen,\" he said.\n\"It's important we see this project through. To secure £12m of investment, to deliver vital improvements in Harrogate, but most importantly, to defend the democratic decision we have taken and protect the democratic process we're all part of.\"", "url": "https://www.bbc.co.uk/news/articles/clyrr53dkygo"}