{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:33:45", "date_modify": "2025-05-19 15:33:45", "date_publish": "2017-08-21 00:00:00", "description": "Nearly 70 Senegalese nationals have been \"expelled\" from The Gambia, detained South African was \"tired of eating human flesh\", and other updates.", "filename": "news_live_world-africa-40828861_1747668825.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_world-africa-40828861_1747668825.html", "title": "Africa highlights: Monday 21 August 2017, as it happened", "title_page": "Africa highlights: Monday 21 August 2017, as it happened - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scroll down for Monday's stories\nWe'll be back tomorrow\nThat's all from the BBC Africa Live page today. Keep up to date with what's happening on the continent by listening to the Africa Today podcast or checking the BBC News website.\nA reminder of today's wise words:\nQuote Message\nWhen the nose is being beaten the eyes shed tears.\"\nAn Ijaw proverb sent by Edema Fuludu in Warri, Nigeria\nAnd we leave you with this photo of Desnoces, a fashion design student in Grand-Bassam in Ivory Coast. He is the only boy in his sewing class. He says sometimes people are surprised to see him there, but he does not mind. He wants to become a great fashion designer.\nThis Instagram post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on Instagram\nThe BBC is not responsible for the content of external sites.\nSkip instagram post\nAllow Instagram content?\nThis article contains content provided by Instagram. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of instagram post\nMorocco arrests over bus sex attack\nBBC World Service\nPolice in Morocco have arrested four suspects in connection with the sexual assault of a young woman on a bus in the commercial capital, Casablanca.\nWhen a video of the attack circulated on social media it shocked the nation. The film showed six bare-chested teenagers touching and tormenting their victim, who'd been stripped half-naked. She screamed for help, but nobody intervened and the bus kept going.\nThe attack has focused renewed attention on the harassment of women in public places in Morocco. A sit -in protest is planned for Wednesday in Casablanca.\nFour in SA court over 'cannibalism'\nSophie Ribstein\nBBC Africa, Johannesburg\nFour suspects have appeared briefly in a court in South Africa to face charges of murder and conspiracy to commit murder after they were accused of cannibalism.\nTwo of them are traditional healers. Some of them use body parts for ritual purposes.\nThe arrests followed the confession of a man who walked into a police station in Estcourt, a small rural town in KwaZulu-Natal, declaring to officers that he was \"tired of eating human flesh\".\nWhen policemen questioned him‚ the man produced part of a human leg and a hand.\nHe then led investigators to a house where more body parts were found.\nA police spokesperson told the BBC that it is possible that the four young men, aged between 22 and 32 years-old, are part of a bigger syndicate and investigations are still continuing.\nA team of forensic experts has been called in order to identify the mortal remains, as it is not clear whether the body parts belong to one or several victims.\nPeople whose relatives had disappeared in Estcourt and surrounding areas have been urged to contact the police.\nA month ago in Durban, the biggest city in KwaZulu-Natal, a man was arrested in possession of a human head, which was concealed in a backpack.\nIt is believed he was trying to sell it to a traditional healer.\nSee earlier post for more details\nCourt upholds ban on IAAF's ex-marketing consultant\nNick Cavell\nBBC Africa Sport\nThe Court of Arbitration for Sport has upheld a life-time ban for Senegal’s Papa Massata Diack, a former marketing consultant for athletics' world governing, the AAF.\nHe is also the son of Lamine Diack, who was IAAF president between 1999 and 2015.\nThe two men have denied accusations they took bribes in order to help cover-up a Russian athlete's failed doping test.\nPapa Massata was charged alongside Russians Valentin Balakhnichev and Alexei Melnikov in December 2015 with multiple breaches of anti-doping rules relating to Liliya Shobukhova.\nIn February last year they took their case to the Court of Arbitration for Sport, sport's highest legal authority, which has now dismissed their appeals and upheld the life-time bans that were imposed by the IAAF.\nLagos: The megacity set to triple by 2050\nAfrica’s population is expected to double by 2050, reaching 2.5 billion people.\nOn a continent where nearly two-thirds of the population is already under 25, this vast new baby boom could do one of two things - either provide a huge workforce to transform African economies and lift millions out of poverty, or create an even bigger migration problem and lead many more young people into the hands of extremists.\nThe BBC is reporting this week from Kenya, Niger, Ethiopia and Nigeria, which is set to become the world’s third most populous country in the next 30 years, and where many rural people are now moving into urban areas, especially the commercial capital, Lagos.\nProtests in Togo against president\nArwa Barkallah\nBBC Afrique, Dakar\nOpposition leaders in Togo have called on their supporters to maintain pressure on the government following massive demonstrations at the weekend against the Gnassingbe family, which has ruled the West African state for 50 years.\nAccording to the authorities two protesters were killed in the second city, Sokode. The protest organisers seven people died at the hands of security forces across the country.\nThe protest centres on calls for a return to the 1992 constitution, which imposed presidential term limits.\nThe constitution was changed in 2002, allowing to president to serve an indefinite number of terms.\nIt is unclear how many people demonstrated, but images on social media suggest that tens of thousands marched.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThere are reports that several opposition militants have been arrested.\nThere have also been allegations that soldiers have been going house-to-house today in Sokode and the capital, Lome, beating up people.\nPresident Faure Gnassingbe has been in power since 2005. He succeeded his father, who took power in a military coup in 1967.\nRound-the-clock guard for former al-Shabab leader\nThe Somali government has put restrictions on the movements of Mukhtar Robow (Abu Mansur), the former al-Shabab deputy leader, who recently handed himself over to the government, the privately owned Dhacdo.com website is reporting.\nMr Robow formally defected from the militant Islamists last Tuesday at a press conference in the capital Mogadishu.\nDhacdo.com reports that since his arrival in Mogadishu, Mr Robow has been staying at the heavily guarded Habar Khadijo building. The building also houses the National Intelligence and Security Agency (Nisa).\nThe government has now assigned a round-the-clock guard for Mr Robow.\nThe paper reports that Nisa has placed restrictions on which parts of Mogadishu the al-Shabab co-founder can visit. The security agency is also reported to have told Mr Robow that he cannot receive visitors without giving it 48 hours in order to enable the agency to run background checks on them. Dhacdo.com reports that a Nisa official has told them that Mr Robow has not left the Habar Khadijo building for the past two days.\nWhile some people have praised the government for putting these restrictions on the former Islamist commander, others believe this could discourage potential al-Shabab defectors, Dhacdo.com reports.\nAid agencies 'struggling' in South Sudan\nCatherine Byaruhanga\nBBC Africa, Kampala\nThe president of the International Committee of the Red Cross, Peter Maurer, has told the BBC that aid agencies can't cope with the extent of the crisis in South Sudan.\nOver four million people have fled their homes as a result of the country's civil war and the majority of the population rely on food aid.\nSpeaking after visiting South Sudan, Mr Maurer said aid agencies were buckling under the pressure.\nHe called for an intensified effort to find a political solution, saying there was no military solution to the conflict which broke out in 2013 between forces loyal to President Salva Kiir and his sacked deputy Riek Machar.\nHe also expressed concern about the availability of cheap weapons in the country.\nBurundian troops 'killed in Somalia'\nSeven Burundian peacekeepers have been killed in an ambush in Somalia by al-Shabab, a news site allied with the militants has reported.\nAl-Shabab carried out a mortar and landmine attack on the troops as they were travelling yesterday on a road linking the town of Jowhar to Balad in Middle Shabelle region, Calmada news site quoted residents as saying.\nBurundian troops are in Somalia as part of an African Union force fighting the al-Qaeda-linked militants in Somalia.\nThere has been no independent confirmation of the allegation.\nThe AU force, known by the acronym Amisom, has not mentioned the attack on its Twitter account, but it has announced the arrival of a new contingent of Burundian troops.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nSenegalese nationals 'expelled' from The Gambia\nNearly 70 Senegalese nationals have been expelled from The Gambia into Senegal's Casamance region, BBC Afrique is reporting.\nThe measure comes only three days after a meeting held by the interior ministers of the two states in the Senegalese capital, Dakar.\nSenegal played a key role in helping President Adama Barrow take power in January, forcing long-serving ruler Yahya Jammeh to go into exile.\nThe expulsions took place after undocumented Senegalese nationals were arrested by immigration authorities during spot checks in Banjul and its suburbs.\nLast Wednesday, Gambian Interior Minister Mai Ahmad Fatty was in talks with his Senegalese counterpart Abdoulaye Daouda Diallo in a bid to work out a joint strategy to tackle cross-border crime, including drug trafficking and potential terror threats.\nGambia's immigration director, Buba Sanyang, ordered the expulsions without allowing those detained to appeal, BBC Afrique is reporting.\nIt quotes a Gambian government source as saying that the expulsions are not a reflection of President Barrow's immigration policy.\nAccording to the source, no officials from the justice and interior ministries were consulted over the expulsions.\nBefore the expulsions, relations between Banjul and Dakar have been cordial. President Barrow was initially sworn in as president in Dakar, and Senegal sent troops to The Gambia to force Mr Jammeh out of power.\nMr Barrow defeated Mr Jammeh in elections, ending his 22-year rule.\nHowever, Mr Jammeh tried to cling to power, alleging that the result was rigged.\nGrace Mugabe immunity 'half-expected'\nPumza Fihlani\nBBC News\nThe mother of the 20-year-old Gabriella Engels, who was allegedly assaulted by Zimbabwe’s First Lady Grace Mugabe last week, has told me that she is disappointed with the South African government.\nMrs Mugabe was granted diplomatic immunity, which meant she could travel back home on Sunday with her husband, Robert Mugabe, who was in South Africa for a summit of regional leaders.\n“I half-expected it but when you hear the news it still comes as a shock,” Debbie Engels said.\n“We are saddened by the news and I am angry with the government for protecting their political allies’ interests over the safety of their citizens,” she added.\nMs Engels says they will continue to fight and they want Mrs Mugabe to answer to the assault charge in court.\nShe said her daughter was traumatised following the alleged assault in a hotel in Sandton, a an upmarket suburb north of Johannesburg, on the night of 13 August.\n“It’s very difficult for her to make peace with what happened to her. She wants to forget about it and live her life. The stories that people have been saying about her being a drug dealer and this and that have really hurt her,\" Debbie Engels said.\n\"I know my daughter. She’s not an angel, but I know her and I know that she would never do that stuff that people have said about her,\" she added.\nSince the story broke there have been a few posts by supposed supporters of Mrs Mugabe accusing the 20-year-old of a range of things, including that she had been the one who attacked the first lady.\nSuspected cannibals arrested in South Africa\nThree people suspected of cannibalism have been arrested in South Africa after one of them apparently walked into a police station and said: \"I am tired of eating human flesh,” local media reports.\n“When he was questioned, he produced part of a human leg and a hand,\" police spokeswoman Col Thembeka Mbhele said., external\nThe man was arrested, along with two other people, following investigations in the area around Estcourt town in KwaZulu-Natal province, she added.\n“It is alleged that the suspects raped, killed and cut up the body of a woman, which they then consumed. The allegations by the suspect are that they would rape and kill the victims before they could cut them into pieces and eat their parts,” Col Mbhele was quoted by the News24 site as saying, external.\nThe former head of the police's Investigative Psychology Section, Gerard Labuschagne, said people who ate human body parts were often in the throes of psychotic episodes, the IOL news site reported.\n“They are usually experiencing audio and/or visual hallucinations - hearing voices or seeing things that aren’t there - and having bizarre thoughts like ‘I must eat this body part as it will make me powerful’,\" he was quoted as saying, external.", "url": "https://www.bbc.com/news/live/world-africa-40828861"}