{"authors": ["Jennie Aitken", "www.facebook.com"], "date_download": "2025-04-26 06:27:59", "date_modify": "2025-04-26 06:27:59", "date_publish": "2025-02-27 11:53:01", "description": "A delegation of local leaders has taken a document detailing plans to transform the city.", "filename": "news_articles_cdrxy7njyj6o_1745648879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a94a/live/59200ce0-f46d-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrxy7njyj6o_1745648879.html", "title": "Plan to unlock Stoke-on-Trent prosperity delivered to No 10", "title_page": "Plan to unlock Stoke-on-Trent prosperity delivered to No 10 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A delegation from Stoke-on-Trent has visited Downing Street to deliver an ambitious plan to transform the city's economy and \"unlock prosperity\".\nThe 19-page Future 100 prospectus was drawn up by the city council in consultation with business leaders, academics and MPs.\nIt sets out five \"missions\" to improve standards of living, opportunities and aspirations for citizens.\n\"It's not about going to ministers with a begging bowl but about showing we stand ready to do our bit for the country and deliver change,\" said Stoke-on-Trent Central MP Gareth Snell.\nAccording to Stoke-on-Trent City Council leader Jane Ashworth, deep-rooted problems holding back growth in the city stemmed back to austerity and lack of investment in infrastructure.\nTargets in the prospectus include reducing the number of children living in poverty, creating 5,000 jobs and building 5,000 homes, all by 2030, with the support of targeted government investment.\nAshworth said she was confident the delegation and prospectus could convince the government \"we are capable, ready, willing and able to make a real difference\".\n\"Investment is Stoke-on-Trent is good not only for the city but for the country,\" she added.\nStakeholders involved in the city vision include Staffordshire police, the University Hospitals North Midlands trust, academy trusts and local charities, but private employers are not on the list.", "url": "https://www.bbc.co.uk/news/articles/cdrxy7njyj6o"}