{"authors": ["Guy Delauney", "www.facebook.com"], "date_download": "2025-04-26 07:42:19", "date_modify": "2025-04-26 07:42:19", "date_publish": "2025-02-26 21:03:11", "description": "Dodik's trial had been widely seen as a test for the Balkan nation's weak central government.", "filename": "news_articles_cdrxy1zp8mxo_1745653339.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/752d/live/efa77ba0-f470-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrxy1zp8mxo_1745653339.html", "title": "Bosnian-Serb leader sentenced to jail in landmark trial", "title_page": "Milorad Dodik: Bosnian-Serb leader sentenced to jail in landmark trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A one-year prison sentence and a six-year ban on holding public office might seem like a heavy penalty for a politician.\nBut the Bosnian-Serb leader Milorad Dodik made light of the verdict at the Court of Bosnia and Herzegovina.\nThe president of the country's majority-Serb Republika Srpska region told supporters at a rally in the regional capital Banja Luka there was \"no reason to worry\".\nHis conviction on charges of ignoring the rulings of the international High Representative was \"nonsense\", he said.\nDodik said he had \"learned to deal with more difficult things\" and called on the crowd in Republika Srpska's de facto capital to \"be cheerful\".\nThe verdict was the culmination of a long-running conflict between Dodik and the international High Representative for Bosnia and Herzegovina, Christian Schmidt.\nSchmidt is still the supreme authority in Bosnia, 30 years on from the Dayton Agreement which ended the Bosnian War of the 1990s.\nThe high representative has the power to impose or annul laws – and sack officials ranging from judges to political leaders.\nOne former holder of the post, Paddy Ashdown, the former leader of the UK's Liberal Democrats, sacked almost 60 Bosnian-Serb officials in a single day in 2004, in a crackdown on their protection of war criminals.\nBut the high representative's powers have been used much more sparingly in subsequent years, as Bosnia's international supporters stepped back in the hope that local leaders would work together to create a viable and prosperous country.\nThe strategy has not been a success. Ethno-nationalist leaders remain entrenched in a country which is divided into two \"entities\" – the majority-Serb Republika Srpska and the Federation, where the population are mostly Bosniaks and Croats.\nThe central government is weak – and there is little incentive for parties to cooperate. Instead, their guiding philosophy is simple and self-interested: divide, rule and profit.\nAs a result, the country is struggling with low wages, a sluggish economy and a constant flow of emigration by talented people seeking a better future elsewhere.\n\"Bosnians of all ethnicities are united by their disdain for their own leaders,\" says Toby Vogel, co-founder of the Democratisation Policy Council think tank.\n\"They would love not to vote for these guys, but it's structurally almost impossible for cross-community politicians and parties to emerge.\"\nInstead, leaders like Dodik get elected, time after time. The leader of the SNSD party has previously served as the Serb representative of the three-person national presidency and first became prime minister of Republika Srpska in 1998.\nA constant theme of his leadership has been the threat to trigger the secession of the majority-Serb region.\nDodik and his government have consistently worked to undermine Bosnia's national institutions, introducing a series of laws to withdraw Republika Srpska from the armed forces, judiciary and tax system.\nSuch efforts eventually pushed the high representative to take action and annul the secessionist legislation.\nChristian Schmidt warned that a renewal of conflict was possible, but insisted that he would \"not sit still while others seek to dismantle [decades] of peace, stability and progress\".\nDodik apparently viewed that as a challenge. He approved a law declaring that Republika Srpska would no longer recognise Schmidt's rulings. The high representative had already annulled the legislation – and made it a criminal offence to contradict his decisions.\nThat led to the prosecution of the Bosnian-Serb leader – with prosecutors calling for a maximum five-year prison sentence and 10-year ban from holding elected office. Dodik warned he would take \"radical measures\" if found guilty.\nHis conviction has not brought any fireworks so far. At this point, Dodik is insisting that he will not appeal. Instead, Republika Srpska's government is once again proposing legislation to withdraw from national institutions – including the court which passed the guilty verdict.\nBut Dodik is facing problems beyond Bosnia's borders. The US and UK have imposed sanctions on him and his family for corruption - threatening the unity of Bosnia and Herzegovina - and connections with Russia.\nToby Vogel believes that is more likely to threaten the Bosnian-Serb leader than the court conviction.\n\"The conflict with the high representative will intensify,\" he says. \"But Dodik might well be running out of road.\"\n\"He is running out of cash to pay his bloated administration… and he can no longer raise money on international markets. So, he is in very deep trouble indeed.\"\nNone of this will be much comfort to the long-suffering people of Bosnia and Herzegovina. They are still enduring the interminable wait for the prosperity promised by ethno-nationalists like Dodik. This latest court battle shows how distant that prospect remains.", "url": "https://www.bbc.co.uk/news/articles/cdrxy1zp8mxo"}