{"authors": ["Gurdip Thandi", "www.facebook.com"], "date_download": "2025-04-26 07:31:55", "date_modify": "2025-04-26 07:31:55", "date_publish": "2025-02-27 16:53:08", "description": "The funds will help small businesses and charities in the region to invest in and develop staff.", "filename": "news_articles_c5yxxkglrqyo_1745652715.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9851/live/4d8acd10-f522-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxxkglrqyo_1745652715.html", "title": "Goldman Sachs pledges £1.5m to support West Midlands apprentices", "title_page": "Goldman Sachs pledges £1.5m to support West Midlands apprentices - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Goldman Sachs has pledged £1.5m to a West Midlands apprenticeship fund to help businesses in the region to develop their staff.\nThe investment bank announced it would be committing funds from its apprenticeship levy to the West Midlands Combined Authority (WMCA) levy transfer scheme.\nThe money will help small and medium-sized businesses, charities and social enterprises to invest in and develop staff.\nWest Midlands Mayor Richard Parker said the WMCA's apprenticeship levy scheme , externalhad already raised £50m, funding 4,800 apprentices in the region.\nParker added more residents could get access to apprenticeships and smaller businesses could train workforces for the future following the boost in funding.\n\"Only by working together can we tackle one of the biggest problems faced by our region, unemployment, particularly among young people,\" he said.\n\"Goldman Sachs has already shown their dedication to the region with their offices in Birmingham, but now they are showing how they are supporting our residents too.\"\nThe investment firm established its Birmingham office in 2021 and now has more than 450 employees in the city, moving to a permanent office at One Centenary Way last year.\nGurjit Jagpal, head of Goldman Sachs Birmingham, said they were proud to support the expansion of apprenticeships in the region.\n\"This reflects our ongoing commitment to Birmingham and our belief in the importance of digital and workplace skills,\" he said.\n\"The depth and quality of talent in the region has been a differentiator since we opened our Birmingham office,\" he said, \"and we look forward to continuing to engage positively with local communities to invest in talent across all levels of experience.\"", "url": "https://www.bbc.co.uk/news/articles/c5yxxkglrqyo"}