{"authors": ["George King", "Sarah Lilley", "www.facebook.com"], "date_download": "2025-04-26 07:06:54", "date_modify": "2025-04-26 07:06:54", "date_publish": "2025-02-28 06:10:46", "description": "The Bishop of St Edmundsbury and Ipswich, Martin Seeley, says retirement feels \"really strange\".", "filename": "news_articles_c0q1wk99y7yo_1745651214.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4c09/live/a9493a60-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1wk99y7yo_1745651214.html", "title": "Church of England bishop sad to retire after decade in Suffolk", "title_page": "Church of England bishop sad to retire after decade in Suffolk - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Bishop of St Edmundsbury and Ipswich said hanging up his clerical collar after dedicating nearly 50 years to the Church of England felt \"really strange\" and \"quite sad\".\nThe Right Reverend Martin Seeley, who was ordained and made a deacon back in 1978, is retiring after spending 10 years serving as the area's ordinary.\nThe 70-year-old was relieved of his duties during a ceremony at Bury St Edmunds Cathedral.\n\"Suffolk has been my life and love for 10 years and living in Suffolk and Ipswich has been a gift - I have absolutely loved it,\" he said, while speaking to BBC Suffolk.\n\"But, when we finish, we can't stay where we are and so I have to move out of Suffolk.\n\"So, I am conscious of the friendships, relationships, and wonderful things I have been involved in... and it's quite hard.\n\"I am currently in the midst of packing and so I am coming across all these things that bring it all back.\"\nDuring the decade Bishop Seeley spent in the county, Donald Trump was elected US president on two occasions and the world also experienced the coronavirus pandemic.\nHe was also at the helm for Queen Elizabeth II's Platinum Jubilee, as well as her death, and also King Charles III's coronation in 2023.\n\"You forget how much has happened in those 10 years and it's been a very complex 10 years in many ways,\" he said.\n\"I started with Trump and I am ending with Trump.\"\nHe recently said that \"radical change\" was required within the Church of England following a report which documented a cover up of child abuse.\nBishop Seeley, who also sat in the House of Lords, officially said goodbye to the Church of England and the county at a special event held in Bury St Edmunds.\nIt concluded in symbolic fashion, with him removing his \"clobber\", handing back \"the bishop's crook\", and walking out of the cathedral, hand-in-hand with his family.", "url": "https://www.bbc.co.uk/news/articles/c0q1wk99y7yo"}