{"authors": ["Alex Pope", "www.facebook.com"], "date_download": "2025-04-26 04:12:50", "date_modify": "2025-04-26 04:12:50", "date_publish": "2025-03-04 12:20:07", "description": "Police say Ellie Austin, 22, from Hatfield, has been held accountable in the \"incredibly sad case\".", "filename": "news_articles_cn8r1rzg2zyo_1745640770.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3b2/live/4499b250-f8e4-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8r1rzg2zyo_1745640770.html", "title": "Hatfield woman sentenced for crash that killed unborn baby", "title_page": "Hatfield woman sentenced for crash that killed unborn baby - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman has been given a suspended 20-week prison sentence and banned for a year after her careless driving resulted in a pregnant woman losing her baby.\nThe crash happened on 1 May in Codicote, near Welwyn Garden City, Hertfordshire.\nEllie Austin, 22, of Birchwood Close, Hatfield, pleaded guilty at St Albans Magistrates' Court to two counts of causing serious injury by careless driving.\nPolice said she had been made accountable for the \"incredibly sad case\".\nThe crash involved a red Fiat 500 and a silver Ford Fiesta at about 22:00 BST.\nA pregnant woman in her 30s lost her baby following the collision.\nPC Joe Massey, from the Bedfordshire, Cambridgeshire and Hertfordshire Road Policing Unit, said: \"This was an incredibly sad case, and my thoughts remain with the family.\n\"Ellie Austin has been held accountable for her actions. Driving carelessly will not be tolerated in Hertfordshire and those who commit such offences will be dealt with.\"\nAustin's jail sentence was suspended for 18 months.\nAfter her driving ban has been completed, she will be required to take an extended driving test before she can get her licence back.\nAustin was also ordered to complete 70 hours of unpaid work and pay a £154 victim surcharge and £85 in court costs.", "url": "https://www.bbc.co.uk/news/articles/cn8r1rzg2zyo"}