{"authors": ["Laura Gozzi", "Thomas Mackintosh", "www.facebook.com"], "date_download": "2025-04-26 04:25:38", "date_modify": "2025-04-26 04:25:38", "date_publish": "2025-03-03 12:04:47", "description": "Where does a weekend of European support for Ukraine leave Zelensky's US relations after White House row?", "filename": "news_articles_c62k9rr2wgvo_1745641538.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0a71/live/0f1ba7f0-f844-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62k9rr2wgvo_1745641538.html", "title": "Zelensky, Trump and Europe: Where does a weekend of frantic talks leave them?", "title_page": "Zelensky, Trump and Europe: Where does a weekend of frantic talks leave them? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukrainian President Volodymyr Zelensky is back in Kyiv after three frantic days - which began with him being ordered to leave the White House following a tense and public showdown with Donald Trump and JD Vance on Friday.\nHe found a warmer welcome in London on the weekend, where he was greeted by the prime minister outside Downing Street, visited the King, and received a strong show of support from European leaders at a summit on Sunday - a sharp contrast to the scenes in the Oval Office.\nAfter the London summit, Sir Keir Starmer suggested European leaders would form a \"coalition of the willing\" to defend Ukraine - but details of who would contribute what were scarce.\nHere's the latest on Zelensky's relationship with Trump, and Europe's plans to guarantee Ukraine's security.\nIn a series of social media posts on Saturday morning, President Zelensky said Ukraine and the US needed to be \"honest and direct with each other\" to understand their shared goals - and he wanted America to \"stand more firmly\" on their side.\nAppearing on Fox News hours after leaving the White House, Zelensky said the confrontation was a \"really tough situation\" and took the chance to thank Americans and Donald Trump. He also stopped short of an outright apology despite calls from US lawmakers for him to do so.\nWhile Trump hasn't commented directly on the angry exchange over the weekend, most Republican figures have expressed their support for Trump and Vance.\nNational Security Adviser Mike Waltz - who was in the Oval Office during Friday's heated meeting - compared the Ukrainian leader to an \"ex-girlfriend\", while Speaker Mike Johnson called for Zelensky to quit.\nHowever, moderate Republican Nebraska Congressman Don Bacon said it was \"a bad day for America's foreign policy\" and Alaska Senator Lisa Murkowski said she is \"sick to my stomach as the administration appears to be walking away from our allies and embracing Putin\".\nPosts on social media in support of Zelensky poured in shortly after he left the White House on Friday evening. Among the notable exceptions were Italy's Giorgia Meloni, who wants to preserve her excellent relations with the Trump administration, and Hungary's Viktor Orban, who praised Donald Trump for \"standing bravely for peace\".\nBy the time the London summit came around on Sunday, there was a sense that concrete action had to follow words of support – with most leaders careful to highlight that they still considered US support essential.\nAt the end of the summit, Starmer outlined a four-point plan for peace which included the continuation of military aid to Ukraine, a commitment for Ukraine to be present at peace talks, boosting Ukraine's defence capabilities to deter future Russian aggression, and developing a \"coalition of the willing\" to defend Ukraine, including sending troops to Ukraine.\nStarmer said that the idea of sending troops to Ukraine - which would include boots on the ground and planes in the air - had the backing of several parties, but he was careful to leave it to individual countries to discuss the matter internally.\nScandinavian countries have already signalled they would be open to the idea. Denmark's Prime Minister Mette Frederiksen said she was keeping an \"open mind\" on the proposal, while Sweden's Ulf Kristersson said his country was ready to provide Ukraine with security guarantees – if it had the backing of the US.\nItaly's Giorgia Meloni would much rather push for another summit that includes the US than discuss a European contingent in Ukraine – a possibility which she says \"perplexes\" her.\nAnd Poland – which has long been one of Kyiv's most vocal supporters – has already ruled out sending soldiers, although it put few boundaries on humanitarian and military aid to Ukraine.\nEuropean leaders will now have a few days to digest the latest developments before they meet again in Brussels on Thursday for a special meeting on defence, at which Commission chief Ursula von der Leyen will present what she has called \"a comprehensive plan on how to rearm Europe\".\nOn Sunday night, the French newspaper Le Figaro, external reported that President Emmanuel Macron and Starmer have proposed a potential one-month truce between Russia and Ukraine, \"in the air and at sea\".\nDetails of any agreement are scarce and the idea put forward by the French remains just that. Under the hypothesis, both sides would agree a truce for four weeks in the air, on the sea and around energy infrastructure. But, Macron has suggested it would not cover fighting on the ground along the front line, as it would be too hard to monitor.\nBut on Monday morning, the UK's armed forces minister played down the idea of a truce insisting that \"no agreement has been made on what a truce looks like\".\nLuke Pollard told Times Radio, external: \"We are working together with France and our European allies to look at what is the path to how... we create a lasting and durable peace in Ukraine.\"\nAny truce would have to be agreed by Russia and there is no evidence yet they are willing to do that.", "url": "https://www.bbc.co.uk/news/articles/c62k9rr2wgvo"}