{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 04:41:44", "date_modify": "2025-04-26 04:41:44", "date_publish": "2025-03-02 07:06:20", "description": "Our weekly round-up of pictures shows life across the city as spring rears its sleepy head.", "filename": "news_articles_cd7ede4lnxzo_1745642504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16f6/live/34af0ec0-f7af-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ede4lnxzo_1745642504.html", "title": "Bristol in pictures: Sunsets, signs of spring and Ashton Gate", "title_page": "Bristol in pictures: Sunsets, signs of spring and Ashton Gate - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We are only just into March but the first signs of spring have been seen in and around Bristol with a few days of rare sunshine.\nThe past week also included international rugby action at Ashton Gate, the vicar at one of the city's key churches stepping down, and a cancer breakthrough at the Bristol Royal Infirmary.\nMore than 1,000 people also went to an open day in Horfield.\nInternational action: England A took on Ireland A at Ashton Gate last weekend, with the red rose men winning the contest 28-12.\nShoots of spring: Blossom has been appearing in trees across the city's parks in this week's sustained sunshine, such as here in Victoria Park in south Bristol\nTime to reflect: On Monday, the city marked three years since Russia's full-scale invasion of Ukraine. Crowds marched through the streets and there was a poignant photo exhibition in Broadmead Shopping Centre, showing how once-thriving communities have been affected by the war.\nMoving forward: Doctors have made a breakthrough at the Bristol Royal Infirmary as they announced a new-start up firm that could revolutionise cancer scans. Astral Systems has developed technology that can now make radioisotopes - used to pinpoint the growth of cancer in patients - in hospitals on demand.\nSaying goodbye: After 12 years as vicar of \"the fairest, goodliest and most famous parish church in all England\", Canon Dan Tyndall announced this week he will be leaving St Mary Redcliffe Church. Mr Tyndall, who will give his final service at Redcliffe on 13 July, said the role has been \"a huge privilege, a real honour, and great fun\".\nFit to burst: Families enjoyed a fun-filled open day at Horfield Leisure Centre last weekend, as the facility celebrated its recent refurbishment by welcoming more than 1,000 people through its doors.", "url": "https://www.bbc.co.uk/news/articles/cd7ede4lnxzo"}