{"authors": ["Galya Dimitrova & PA Media", "www.facebook.com"], "date_download": "2025-04-26 07:54:23", "date_modify": "2025-04-26 07:54:23", "date_publish": "2025-02-25 13:21:55", "description": "The former PM hopes his work for Prostate Cancer Research will encourage more men to get tested.", "filename": "news_articles_cj0q228ry5yo_1745654063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ae5/live/0549dc90-f373-11ef-80a6-edca8054bafc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0q228ry5yo_1745654063.html", "title": "Rishi Sunak 'honoured' to become prostate cancer ambassador", "title_page": "Rishi Sunak 'honoured' to become prostate cancer ambassador - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former prime minister Rishi Sunak has said he is \"honoured\" to become a prostate cancer charity ambassador.\nHe will support Prostate Cancer Research's campaign to introduce a national screening programme for men at high risk of the disease.\nHe met workers developing a new blood test at the laboratories of British cancer diagnostics company Oxford BioDynamics last week.\nThe EpiSwitch PSE test is said to be able to detect prostate cancer with 94% accuracy, which the charity called a \"significant improvement\" on the most commonly used prostate-specific antigen test.\nFormer Conservative leader Sunak, who is the MP for Richmond and Northallerton, said he wanted to \"support the charity's mission to revolutionise diagnosis and treatment\".\n\"Men tend to ignore pain hoping it'll go away rather than going to see the GP, and that's a part of the reason why prostate cancer is now the most commonly diagnosed cancer in males in the UK,\" he said.\n\"We can do something about that. It is clear from a trial that I funded when I was in office, that early detection saves lives.\"\nHe added he hoped his work for the charity would encourage more men to get a screening test \"which will hopefully prevent further needless deaths\".\nLast month in the House of Commons, he pressed the government to consider increasing screenings for high-risk groups.\nIain Ross, executive chairman of Oxford BioDynamics, said more than nine out of 10 men who received a positive EpiSwitch PSE result would have prostate cancer confirmed.\nThis can \"significantly cut\" the number of \"expensive and unnecessary MRI scans\" and invasive prostate biopsies, he added.\nOliver Kemp, chief executive of Prostate Cancer Research, called Sunak's support \"invaluable\".\n\"Rishi's advocacy will help us drive forward innovative research, challenge health inequalities, and ensure that more lives are saved,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cj0q228ry5yo"}