{"authors": ["Ethan Davies", "www.facebook.com"], "date_download": "2025-04-26 08:04:21", "date_modify": "2025-04-26 08:04:21", "date_publish": "2025-02-26 15:52:28", "description": "Developers win approval to build 115 new homes on the site but residents say it is a much-needed store.", "filename": "news_articles_cvgely18wp7o_1745654661.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c8f4/live/038a2f80-f455-11ef-a11e-f9aa15b912e1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgely18wp7o_1745654661.html", "title": "Anger as 'under-served' Manchester area to lose B&M to housing", "title_page": "Anger as 'under-served' Manchester area to lose B&M to housing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to build 115 homes on the site of a B&M store in an area of Manchester \"under-served\" by shops have been criticised by councillors and residents.\nThe proposal for the large store next to Mauldeth Road rail station in Ladybarn was approved at a planning committee meeting on 20 February.\nIt was the second attempt by developers Triple Jersey Ltd to build on the site after its first proposal was withdrawn in the face of strong opposition.\nHowever, Labour councillor Murtaza Iqbal told the Manchester City Council planning committee \"we can and should expect better\".\n\"We are under-served with just one [shop] already, and Tesco just over the border in Didsbury,\" he said.\n\"It's not the removal of a shop, it's the removal of something people rely on.\"\nHe said the scheme must provide benefits for the community and not only \"profits for developers\".\nCouncil officer Des Jones, however, said the authority could not prevent the application going through over affordable housing worries, as Triple Jersey had '\"voluntarily\" included eight affordable homes.\nLegislation states they are only legally required to do so if a project is expected to make 20% profit.\nSpeaking after the planning permission was granted, 74-year-old Jean Smith, who has lived on Mauldeth Road for 48 years, said she and her husband already have a \"horrendous time with parking\".\nNeighbour Vivien Powell, 75, also had worries about parking, and said she felt for the B&M employees affected.\nShe said: \"I've been right against it. I enjoy going to that shop, I know the staff there.\"\nCouncillors voted eight to three in favour to approve the application.", "url": "https://www.bbc.co.uk/news/articles/cvgely18wp7o"}