{"authors": ["Anttoni James Numminen", "Nathan Turvey", "www.facebook.com"], "date_download": "2025-04-26 08:10:49", "date_modify": "2025-04-26 08:10:49", "date_publish": "2025-02-26 12:19:36", "description": "New traffic signals also planned for busy area of the town to reduce queuing.", "filename": "news_articles_ce34lpnzwnno_1745655049.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/be08/live/2fe18400-f434-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce34lpnzwnno_1745655049.html", "title": "Whitby: Swing Bridge could be 'flexibly pedestrianised'", "title_page": "Whitby: Swing Bridge could be 'flexibly pedestrianised' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Whitby Swing Bridge could be \"flexibly pedestrianised\" if plans to improve the area are approved this week.\nNorth Yorkshire Council will discuss proposals to install new traffic lights at the A171 New Bridge and Spital Bridge junction.\nThe bridge itself, which was built in 1909 and links the east and west sides of the town, would be made more pedestrian-friendly.\nConstruction would start from April if the council gives the plan the go-ahead.\nThe crossing over the River Esk often becomes crowded during peak visitor times and there have been previous trial closures to traffic.\nLocal business owner Alex Boyd told BBC Radio York that he welcomed the proposals - but had concerns about the impact four months of work would have on him and other traders in the area.\n\"From what I've seen I think it's quite a nice idea, obviously we might lose a little bit of trade in the sense of people driving past through the day, but most of our 'pull-ins' are at night-time anyway\", he said.\nMr Boyd added that projects like the Market Place improvements had been \"rumbling on for years\" so he would \"see how it goes\".\nThe businessman also had concerns about the disruption the works would cause heading into the busy summer season.\n\"I think they're going to have to be sensible and maybe look at everything with us, and work together to minimise the impact on, not only my business, but the businesses surrounding us\", Mr Boyd added.\nAccording to a report prepared for the meeting on Friday, there is a \"practical need to signalise the junction of New Bridge, Spital Bridge, Helredale Road and Larpool Lane\".\nIt said without doing so, it would be \"very difficult\" to proceed with the remainder of the Harbourside scheme.\nThe £2.3m project was proposed and funded through the Whitby Town Deal and is made up of five further proposals across the town, all of which were part of a consultation in 2023.\nMore than 64% of those consulted said they were in favour of introducing traffic signals at Spital Bridge Junction, the report adds.\nOfficers acknowledged that signalising the junction would improve conditions for drivers exiting on the side roads and for pedestrians but would introduce queuing on New Bridge and Helredale Road.\nIt added that \"the average queuing on the signalised junction as a whole would be increased, however, queuing on the Spital Bridge arm would decrease\".\nWhitby Town Council said it supported the proposal in principle and welcomed the introduction of the additional signal-controlled crossing points.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/ce34lpnzwnno"}