{"authors": ["Genevieve Tudor", "Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:40:21", "date_modify": "2025-04-26 04:40:21", "date_publish": "2025-03-02 07:30:17", "description": "Staff at Oswestry Museum were instrumental in discovering the letters were between two men.", "filename": "news_articles_cx299217n1go_1745642421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9cd3/live/4f9a0fe0-f5e4-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx299217n1go_1745642421.html", "title": "Big screen hopes for the story of gay WW2 lovers", "title_page": "Big screen hopes for the story of gay WW2 lovers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I'm a gay filmmaker and I felt a need to tell that story.\"\nSoldiers Gilbert Bradley and Gordon Bowsher sent each other hundreds of love letters during World War Two, a time when those in the armed forces could be shot for having gay sex.\nTheir story emerged in 2017 and the letters, displayed at Oswestry Museum in Shropshire, caught the eye of American director and producer, Andy Vallentine.\nAfter acquiring the rights and turning the men's story into an award-winning short film in 2022 he is now pitching the tale as a feature-length film.\n\"I had a strong connection with my grandfather who was a glider pilot in WW2,\" he said.\n\"Taking my love of history and of WW2 and the respect that I have for my grandfather, and then also being a gay filmmaker who wants to tell gay stories, I was like: 'This is a perfect combination.\"\nIn 1939, Gilbert Bradley was stationed at Park Hall Camp in Oswestry.\nHe was already in love with Gordon Bowsher who he had met on a houseboat holiday in Devon in 1938.\nMr Bowsher was stationed at various locations across the country.\nIn one letter Mr Bowsher urges his lover to \"do one thing for me in deadly seriousness. I want all my letters destroyed. Please darling do this for me. Til then and forever I worship you.\"\nAlthough the couple wrote throughout the war, the letters stopped in 1945.\nPerhaps most poignantly, one of them contained the lines: \"Wouldn't it be wonderful if all our letters could be published in the future in a more enlightened time. Then all the world could see how in love we are.\"\nMr Vallentine said after seeing the BBC article he flew to Oswestry to meet museum creator Mark Hignett who had been instrumental in gathering the letters and also discovering that they were between two men.\nGordon Bowsher had only used the inital G in his letters.\nMr Vallentine convinced Mr Hignett to give him the rights to Gilbert and Gordon's story for a feature film.\n\"For me, what is the most unique aspect, is just the amount of letters that Gilbert kept,\" said Mr Vallentine.\n\"Gay people have been around always, we have always been here… mostly we've been in the closet, most gay people would burn letters or destroy them out of fear of discovery.\n\"It's just such a important historical moment in the broad gay community that we have this insight into what a relationship looked like for these men at that time.\"", "url": "https://www.bbc.co.uk/news/articles/cx299217n1go"}