{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 06:13:12", "date_modify": "2025-04-26 06:13:12", "date_publish": "2025-03-02 06:24:47", "description": "Terry McSpadden's family hope the birth of his grandson could prompt new leads.", "filename": "news_articles_c3w18j672jqo_1745647992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fd85/live/8ac949d0-f5c3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w18j672jqo_1745647992.html", "title": "Missing Wisbech man's family hope want justice 18 years on", "title_page": "Missing Wisbech man's family hope want justice 18 years on - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a man who has been missing for 18 years said they hoped the birth of his grandson would lead to new information.\nTerry McSpadden, from Wisbech on the Norfolk-Cambridgeshire border, was 24 when he was last seen on 2 March 2007.\nHis son Charlie is due to become a father.\nThe family and detectives suspect he was murdered and his daughter Kayce Burton urged anyone with information to contact police.\nThe 22-year-old said she only had one vivid memory of her dad, bathing and splashing her with water.\n\"I just feel like it's time someone came forward and actually told the truth and gave us answers,\" she said.\n\"It's a life-changing thing for anybody, but growing up, I really do want more answers now.\"\nTerry had been working as a window fitter and his family said he doted on his two children who were aged four and 18 months at the time.\nThe night before he disappeared he had been drinking with friends in The Locomotive pub in Wisbech.\nHe was seen on CCTV withdrawing money from a cash machine at Tesco at 01:00 GMT, and buying goods in the store.\nHe never turned up at work that Friday morning.\nIn 2013, a crown court judge threw out a murder prosecution on grounds of insufficient evidence. Three years later, Norfolk Coroner's Court ruled Terry likely died the day he disappeared.\nSince then, Norfolk Police has had no new leads to investigate.\nHis mother Helen Thrower, 64, said: \"This anniversary, Christmas, kids birthdays; it's all a nightmare.\n\"You're stuck in limbo all the time because you don't know where he is, what happened to him, why it happened and it's just horrendous.\"\nIn the next few days, Mr McSpadden's son Charlie and his partner Amelia are expecting their first child, a son they are already calling Albie.\n\"It's going to be a happy time, but it's going to be a sad time because we will all be thinking Terry should be here,\" said Mrs Thrower.", "url": "https://www.bbc.co.uk/news/articles/c3w18j672jqo"}