{"authors": ["Cemlyn Davies", "www.facebook.com"], "date_download": "2025-04-26 03:55:20", "date_modify": "2025-04-26 03:55:20", "date_publish": "2025-03-04 16:13:31", "description": "Eluned Morgan speaks as Russia welcomes the US decision to pause military aid for the country.", "filename": "news_articles_c17qwrw8gkxo_1745639720.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d11f/live/e88feee0-f90e-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qwrw8gkxo_1745639720.html", "title": "Wales' Ukraine support unwavering - first minister", "title_page": "Wales' Ukraine support unwavering - first minister pledges - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales' support for Ukraine will continue to be \"unwavering\", the first minister pledged in the Senedd.\nEluned Morgan's comments came as the United States paused military aid for Ukraine - an announcement welcomed by Russia.\nThe leader of the Conservatives in Cardiff Bay, Darren Millar, said his group stood \"full square\" behind Ukraine.\nPlaid Cymru's leader raised concerns about the UK government's decision to boost defence spending by cutting the international aid budget. Rhun ap Iorwerth said the move should be reversed.\nMorgan told Senedd members she was \"pleased that our support for Ukraine and its people has been, and will continue to be, unwavering\".\n\"I am truly proud that Wales has given full support to Ukraine, from the moment Ukraine was illegally and brutally invaded by Vladimir Putin.\n\"Let me be clear, there can be no justification for the invasion of Ukraine, and we must stand full square behind President Zelenskyy and the people of Ukraine.\"\nLater, during questions to the first minister on Tuesday afternoon, the Welsh Conservative group leader Darren Millar said his Senedd members \"stand full square behind Ukraine in the face of the illegal invasion by Russia of its sovereign territory and that will not waver\".\nLast Tuesday Keir Starmer announced a multi-billion-pound increase in defence spending to be funded by slashing the international aid budget.\nThe decision, which prompted the resignation of International Development Minister Anneliese Dodds, was questioned in the Senedd on Tuesday by Plaid's leader Rhun ap Iorwerth.\n\"As the principled Labour MP Anneliese Dodds set out when resigning as international development minister last week, the cut will likely lead to a UK pull out from numerous nations at a time when Russia has been aggressively increasing its global presence.\n\"Cutting international influence will be costly.\nWhilst the first minister I'm sure will agree with me that the debate around increased defence spending has taken on a new significance in light of the new global context, does she also agree with me that that shouldn't be at the expense of international aid and that the international aid budget cuts announced by Keir Starmer should be reversed?\"\nDefence is not devolved and is the responsibility of the UK government.", "url": "https://www.bbc.co.uk/news/articles/c17qwrw8gkxo"}