{"authors": ["Steve Jones", "www.facebook.com"], "date_download": "2025-04-26 07:06:34", "date_modify": "2025-04-26 07:06:34", "date_publish": "2025-02-28 06:16:06", "description": "A new tribute to women's rights campaigner Florence White is due to be unveiled in Bradford.", "filename": "news_articles_ce8vvz03r9yo_1745651194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16d9/live/e25eece0-f52d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8vvz03r9yo_1745651194.html", "title": "Blue plaque unveiled for women's rights campaigner", "title_page": "Bradford: Blue plaque unveiled for women's rights campaigner - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A blue plaque is set to be unveiled in tribute to \"one of Bradford's most forward-thinking women\".\nFlorence White has been described as a \"committed\" women's rights and pensions campaigner who helped lower the pension age for unmarried women.\nA plaque for her previously stood at the entrance to the Bradford Mechanics Institute Library from 2007 to December 2023, but the front of the building was damaged when a car crashed into it.\n\"Like a lot of great Bradfordians, Florence White was doing things way ahead of her time,\" said Bradford Civic Society chair Si Cunningham.\nThe plaque - the twelfth of its kind in the city - was due to be unveiled in the same location on Kirkgate as its original on Friday morning.\nThe plaque will be unveiled by a representative from the West Yorkshire Pension Fund.\nBorn in Bradford in 1866, Ms White went on to become secretary of the South Bradford Liberal Party.\nDr Lauren Padgett, assistant collections curator at Bradford Museums and Galleries, described her as a \"committed women's rights and pension campaigner\".\nAccording to Dr Padgett, Ms White, who was never married, held an inaugural meeting which resulted in the founding of the National Spinsters' Pensions Association at the old Mechanics' Institute on Bridge Street in April 1935.\n\"As Secretary for the South Bradford Liberal Party, her eyes were opened to the impoverished plight and financial precarity of unmarried older Bradford women.\n\"They faced fewer and lower paid job opportunities and were often unpaid carers for others. The few that could make health insurance contributions often died before they could receive their benefit of a pension at the age of 65.\"\nAfter several years of campaigning, the government lowered the pensionable age for all women to 60 in 1940.\nMr Cunningham said the pension reform \"was probably a pre-cursor to a lot of the privileges enjoyed by many women today\".", "url": "https://www.bbc.co.uk/news/articles/ce8vvz03r9yo"}