{"authors": ["Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:05:21", "date_modify": "2025-04-26 07:05:21", "date_publish": "2025-02-28 06:31:18", "description": "Castel Froma Neuro Care says the sale will not have an effect on availability for patients.", "filename": "news_articles_cj0qq774p2qo_1745651121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/01ee/live/b06a1af0-f52a-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0qq774p2qo_1745651121.html", "title": "Leamington Spa charity to sell part of site to fund community hub", "title_page": "Leamington Spa charity to sell part of site to fund community hub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity that cares for patients with complex neurological conditions is selling one of its Victorian buildings.\nCastel Froma Neuro Care has two sites in Leamington Spa, Lillington House and Helen Ley House. It will sell the older part of Lillington House.\nThe charity said it would help to create a new community hub for patients in a different part of its grounds.\nIt added that inpatient beds would not be affected, and a \"permanent endowment\" on Lillington House ensures that profits from the sale would be reinvested to benefit patients.\nThe charity has submitted a planning application for the community hub, which would be on the site of the old stables at Lillington House.\n\"This will create a welcoming hub where those with neurological conditions or acquired brain injury can more easily and clinically appropriately access our specialist services,\" said Caroline Wilson, its chair.\n\"We want to make sure we offer the best places to meet the needs of residents for decades to come, ensuring we offer the NHS maximum value for money.\"\nLillington House has 56 bedrooms for inpatients. The part that is being sold is more than 100 years old.\nMs Wilson said problems included \"frequent lift breakdowns, leaking roof and heating and hot water system problems\".\nThe charity will keep the site's Princess Alice Wing, which has 31 bedrooms.\nIts other site, Helen Ley House, will also remain. It has 46 beds, including eight new bedrooms.\nThe charity said there had been six to eight vacancies at Helen Ley in the recent months, and these, combined with the new bedrooms, would \"more than accommodate\" the reduction in beds at Lillington House.", "url": "https://www.bbc.co.uk/news/articles/cj0qq774p2qo"}