{"authors": ["Jack Silver", "www.facebook.com"], "date_download": "2025-04-26 07:59:47", "date_modify": "2025-04-26 07:59:47", "date_publish": "2025-02-25 11:21:16", "description": "But Jerry Saunders says he doubts he will restock hens as he could end up in the same situation.", "filename": "news_articles_clyn9v783y0o_1745654387.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d4d/live/9d3bf980-f363-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyn9v783y0o_1745654387.html", "title": "Devon bird flu cull farmer 'overwhelmed' by £30k crowdfunder", "title_page": "Devon bird flu cull farmer 'overwhelmed' by £30k crowdfunder - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Devon poultry farmer who had 5,000 hens culled because of bird flu has been \"overwhelmed\" after a crowdfunder raised £30,000 in less than a week.\nJerry Saunders, who runs Orchard Organic in Stokeinteignhead, said he had been through \"every emotion\" since his flock was culled but public support had been \"beyond words\".\nHe said the money would be \"the difference between ruin and survival\" for the farm, adding: \"We are so so lucky to have such a strong community.\"\nHowever, Mr Saunders said he \"couldn't see\" himself continuing to farm hens as he could be \"in this situation again in 12 months or two years' time\", but the money would \"allow us to breathe\" until he figured out what to do next.\nMr Saunders said government compensation would only have allowed the farm to restock about half of its birds, if they chose to.\nHe said he and his wife had been able to keep their campsite and farm school open, but had been forced to make two permanent members of staff redundant.\nMr Saunders said: \"I'm still at the numb stage where the farm is empty and we're trying to make plans.\"\nHe said the donations, totalling more than 1,200 from all over the world, were \"just amazing\".\n\"All of this will just allow us to breathe,\" he said.", "url": "https://www.bbc.co.uk/news/articles/clyn9v783y0o"}