{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:33", "date_modify": "2025-05-19 15:38:33", "date_publish": "2017-07-03 00:00:00", "description": "International Trade Secretary Liam Fox tells MPs \"some elements of our media would rather see Britain fail than Brexit succeed\", during question time in the Commons.", "filename": "news_live_uk-politics-parliaments-40482282_1747669113.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-politics-parliaments-40482282_1747669113.html", "title": "Fox criticises media over Brexit reporting", "title_page": "Fox criticises media over Brexit reporting - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What did Liam Fox say to MPs about the media and Brexit?\nHouse of Commons\nParliament\nInternational Trade Secretary Liam Fox attacked the BBC and other media organisations for preferring to see \"Britain fail than see Brexit succeed\".\nLeave-supporting Dr Fox made the comments in response to concerns that negative media coverage was undermining efforts to make trade deals with countries outside the EU.\nConservative Nigel Evans said during the morning questions session that there were good prospects for trade deals, \"but every time I open a newspaper or listen to the radio or TV the story is done very negatively\".\nMr Evans put it to the international trade secretary that this was \"wrong and undermines the work he's doing\".\nLiam Fox responded: \"Some elements of our media would rather see Britain fail than Brexit succeed.\"\nThe BBC rarely reports positive economic news without adding \"despite Brexit\", Dr Fox said.\nPeer to peer learning\nFinancial inclusion debate\nHouse of Lords\nParliament\nMinister Lord Bates now concludes the debate for the government.\nHe says that the government will publish its position on this issue soon, and tells peers that the UK must be aware of the pace of change in technology - which he calls \"frenetic\".\nThe minister also mentions new abilities for \"peer to peer learning,\" which he says may need a nuanced definition in this chamber.\nWhat's the money of the future?\nFinancial inclusion debate\nHouse of Lords\nParliament\nShadow minister Lord Stevenson of Balmacara responds to the debate for the opposition.\nSpeaking of the future, Lord Stevenson says the system of day to day finance is not going to change but the way it happens is going to be \"radically different\".\n\"Physical notes and money will probably not survive coming financial revolution,\" he says, and urges the government to ensure there is a balanced and proportionate legal and regulatory framework in place to deal with this.\nHe also calls for \"high level\" broadband to be introduced in the country, saying \"if we are going to have this then it has to be done well\".\nFood banks 'an absolute disgrace' - new Midlothian MP\nGlobal trade debate\nHouse of Commons\nParliament\nLabour's Danielle Rowley gives her maiden speech as the first woman to represent Midlothian.\nSpeaking on the debate, she says that she will defend the rights of EU nationals living in her constituency and in the rest of the UK.\nShe says that the prevalence of food banks in her area is \"an absolute disgrace\" and goes on to tell the government to remember that the purpose of benefits is to give a hand up not a handout.\nDanielle Rowley says that she is going to follow a message of hope for good jobs and good wages.\nA Tudor comparison from Lincoln\nGlobal trade debate\nHouse of Commons\nParliament\nLincoln's new Labour MP Karen Lee regales her new colleagues with stories from her city's historic and more recent past.\nShe says that from the development of the first tank in World War I \"by a determined group of engineers\" to the \"recent runaway success\" of Lincoln City FC when last year they became the first non-league club to reach the FA Cup's quarter finals in 103 years, Lincoln has a \"proud history of going the extra mile\" she says.\nShe uses the history of her town again when drawing comparisons between Henry VIII and the government - comparing the Tudor monarch's looting of Lincoln cathedral with the effects of austerity.\nLabour welcomes domestic violence bill\nDomestic violence debate\nHouse of Lords\nParliament\nShadow minister Baroness Gale addresses the debate from the Labour frontbench and reiterates a point made by many peers on the issue of stalking.\nShe says there is a need for specialist understanding, training and services to deal with these crimes and to help and protect victims.\nLabour welcomes the proposed domestic abuse bill, she says, adding that she hopes it will be a real opportunity to change the way in which we identify and respond to domestic violence and not just a consolidation of current legislation.\nSupport for victims \"must go further than the justice system\", she says - saying that there must be support for access to mental health services, bank accounts, and welfare provisions.", "url": "https://www.bbc.com/news/live/uk-politics-parliaments-40482282"}