{"authors": ["David Gritten", "www.facebook.com"], "date_download": "2025-04-26 04:26:08", "date_modify": "2025-04-26 04:26:08", "date_publish": "2025-03-03 11:38:57", "description": "Several others were hurt in the rare attack by a member of Israel's Druze community.", "filename": "news_articles_cgm1jl2g4lwo_1745641568.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b934/live/0e8a0760-f825-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1jl2g4lwo_1745641568.html", "title": "Israeli police say one killed in Haifa bus station knife attack", "title_page": "Israeli police say one killed in Haifa bus station knife attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Israeli man has been killed and four other people have been wounded in what police say was a terrorist stabbing attack in the northern Israeli city of Haifa.\nPolice said an Israeli Druze man attacked civilians with a knife after getting off a bus at HaMifratz Central station. He was shot dead at the scene by a security guard.\nThe victim who died was named as Hassan Dahamsha, 70, from the predominantly Arab town of Kafr Kanna. Paramedics said three of the wounded - a 15-year-old boy, and a man and a woman in their 30s - were in a serious condition.\nThe attacker was from Shfaram, another mainly Arab town, and had recently returned from abroad, police said, without specifying a motive.\nIsraeli Druze leaders condemned the rare attack by a member of their community.\nThe Druze are an ethnic and religious group whose faith is an offshoot of Shia Islam. About 150,000 live in Israel and the occupied Golan Heights, comprising about 1.5% of the population.\nWitnesses and security officials said the perpetrator of Monday morning's attack travelled to Haifa on a bus from Shfaram, which is about 10km (6 miles) east of the city.\n\"A bus arrived, and someone got off with a knife, shouted 'Allahu Akbar' ['God is greatest' in Arabic], and started stabbing people indiscriminately,\" one woman told the Haaretz newspaper.\nA security officer was cited as saying the attacker stabbed three people waiting at the station and then went to a security checkpoint, where he stabbed an elderly man before being shot dead by the guard.\nA police spokesman said the attacker had been abroad for the past few months and had returned to Israel in February.\nIsraeli media named him as Yitro Shaheen, 20, and reported that he had German citizenship and had lived in Germany.\nIsraeli Prime Minister Benjamin Netanyahu said: \"My wife Sara and I send our deepest condolences to the family of the man who was murdered in the shocking terrorist attack in Haifa.\n\"We will continue to fight everywhere against those who seek to murder us and we will defeat them.\"\nThe spiritual leader of Israel's Druze community, Sheikh Mowafaq Tarif, also condemned the attack. But he added: \"Before passing judgment, it is important to wait for a thorough investigation and full clarification of the facts by the security forces.\"\nDruze lawmaker Hamad Amar of the right-wing Yisrael Beiteinu party insisted that the attack \"does not reflect the true spirit of the Druze community in Israel, which is a full partner in defending the state and its values\".\nShfaram's mayor, Nahid Khazem, also said the town's residents were deeply shocked by the \"despicable crime\" in Haifa.\n\"His extended family say that he was mentally unstable, but I have no documents to confirm this,\" he told Haaretz.\nThere was no immediate claim from any armed groups, but Hamas described the attack as \"heroic\" and a \"natural response\" to what it called Israeli crimes against Palestinians.\nIt comes amid deadlock between Hamas and Israel over moving forward with the six-week-old Gaza ceasefire deal.\nIsrael stopped aid from entering Gaza after Hamas rejected what Netanyahu's office said was a US proposal for an extension to the first phase, which ended on Saturday night.\nHamas accused Israel of reneging on the deal and said the second phase should go ahead as agreed.", "url": "https://www.bbc.co.uk/news/articles/cgm1jl2g4lwo"}