{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:34", "date_modify": "2025-05-19 15:17:34", "date_publish": "2015-03-03 16:24:36", "description": "Police in the Lothians warn it is only \"a matter of time\" before someone is killed by thieves speeding in cars stolen during house break-ins.", "filename": "news_uk-scotland-edinburgh-east-fife-31713111_1747667854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81374000/jpg/_81374283_dsc_7535.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-edinburgh-east-fife-31713111_1747667854.html", "title": "Police warning over speeding stolen cars in Edinburgh", "title_page": "Police warning over speeding stolen cars in Edinburgh - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Police in the Lothians have warned it is only \"a matter of time\" before someone is killed by thieves speeding in cars stolen during house break-ins.\nThieves have been breaking into homes and stealing car keys then using the vehicles to break in to commercial premises.\nPolice Scotland said nearly 50 houses and business premises had been targeted in the last week.\nIt comes as Operation Barrel was launched to crackdown on break-ins.\nDet Supt Pat Campbell, of Police Scotland, said: \"The recent rise in these crimes is extremely worrying. If this trend continues, it will be a matter of time before a member of the public is injured or killed.\n\"It is believed that the majority of these individuals responsible for committing these crimes are young men who have a complete disregard for their actions and to the potential serious consequences of driving stolen vehicles at speed.\n\"We will use everything we have at our disposal to target the individuals involved in committing these crimes which is having a huge impact on victims, their families and the entire community.\"", "url": "https://www.bbc.com/news/uk-scotland-edinburgh-east-fife-31713111"}