{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:04", "date_modify": "2025-04-26 03:55:04", "date_publish": "2025-03-04 16:40:15", "description": "Police say they have been made aware of the incident in woodland near Newton Stewart.", "filename": "news_articles_c07zddpd2x1o_1745639704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/67ec/live/dda57370-f912-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zddpd2x1o_1745639704.html", "title": "Possible lynx sighting near Newton Stewart under investigation", "title_page": "Possible lynx sighting near Newton Stewart under investigation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An investigation has been launched after reports of a possible lynx sighting in the south of Scotland.\nPolice said they had been made aware of the incident in woodland near Newton Stewart at about 12:00 on Wednesday 26 February.\nThe sighting was reported to police on Friday who said officers were working with partners to establish the full circumstances.\nThe force added that if there were any further sightings the public should not approach the animal and contact police on the 101 number.\nThe incident in Galloway comes after a number of lynx were illegally released in the Cairngorms.\nThey were spotted in the national park on two separate occasions in early January before being captured near Kingussie south of Aviemore a few days later.\nOne of the lynx - a male - died after capture but three females are looking for a new home after completing 30 days quarantine at Edinburgh Zoo.\nThe Royal Zoological Society of Scotland (RZSS) described their release as \"highly irresponsible\".\nPolice were first alerted to that incident on 8 January and the RZSS, which runs a wildlife park nearby, used cage-type traps baited with venison and quail, a small game bird, to capture the cats.\nThey were all caught by 10 January.\nLynx were once a native species in Scotland, but they died out several hundred years ago.\nThere are suspicions the Cairngorms lynx are abandoned pets, or were let go by people who want to see the animals reinstated to wooded hills and glens.\nHowever, First Minister John Swinney has ruled out the legal reintroduction of lynx into the wild in Scotland.", "url": "https://www.bbc.co.uk/news/articles/c07zddpd2x1o"}