{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:37", "date_modify": "2025-05-19 14:45:37", "date_publish": "2015-03-01 14:15:53", "description": "The father of a man who was injured in an explosion in south Armagh says he should find out this week if his eye can be saved.", "filename": "news_uk-northern-ireland-31683352_1747665937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81316000/jpg/_81316987_frankmccabe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31683352_1747665937.html", "title": "Crossmaglen explosion: Francis McCabe's family 'hopeful'", "title_page": "Crossmaglen explosion: Francis McCabe's family 'hopeful' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The father of a man who was injured in an explosion in south Armagh has said he should find out this week if his eye can be saved.\nFrancis McCabe Junior suffered injuries to his chest and face in the blast outside Crossmaglen on Wednesday.\nSinn Féin President Gerry Adams said the booby-trap bomb was designed to intimidate.\nMr McCabe's father, Frank, said medical staff were more hopeful about his condition.\n\"At the moment he's back at home, he was more afraid of getting infections in the hospital,\" he said.\n\"His wife's a nurse so she is able to do all the necessary stuff.\n\"Tomorrow (Monday) he's to meet the specialist who carried out the operation on his eye.\n\"The next day he's to meet another specialist.\n\"It's to do with the injuries behind his eye and at that point they should know if they can save the eye or not, so we'd be more hopeful that we were initially.\"\nSpeaking at a republican commemoration near Crossmaglen on Sunday, Mr Adams said: \"Those who placed the bomb didn't care who they killed.\n\"Their intention was to intimidate and terrorise and coerce those in south Armagh who have been taking a stand against the criminal gangs.\"\nHe said: \"In recent years the criminal gangs have grown bolder and more dangerous and better organised.\"\nMr Adams, who represents North Louth in the Dáil, the Irish parliament, said republicans were \"not involved in criminal actions along the border or indeed anywhere else\".", "url": "https://www.bbc.com/news/uk-northern-ireland-31683352"}