{"authors": ["Adam Brimelow", "www.facebook.com"], "date_download": "2025-05-19 14:58:37", "date_modify": "2025-05-19 14:58:37", "date_publish": "2015-03-07 03:29:19", "description": "A former NHS boss who says he was sacked for raising patient safety concerns has called for an apology and a \"comparable\" job.", "filename": "news_health-31772025_1747666717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81449000/jpg/_81449290_71401446.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_health-31772025_1747666717.html", "title": "NHS 'whistleblower' demands apology and comparable job", "title_page": "NHS 'whistleblower' demands apology and comparable job - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A former NHS boss who says he was sacked for raising patient safety concerns has asked the health secretary for an apology and a \"comparable\" job.\nIn a letter to Jeremy Hunt, ex-United Lincolnshire Hospitals Trust boss Gary Walker argues he is a whistleblower whose actions have been vindicated.\nBut he says he has been blacklisted from working for the health service.\nThe Department of Health in England says it will be looking carefully at the issues raised in the letter.\nGary Walker's letter says that, as chief executive of United Lincolnshire Hospitals Trust, he warned senior health officials that patients would come to harm if it was forced to comply with NHS targets.\nThe letter sets out, point-by-point, why he believes he is a whistleblower, and how - in his view - this led to his dismissal and being blacklisted by the NHS.\nHe goes on to argue that his actions were vindicated by events, as evidence grew of rising death rates and a high number of safety incidents, but says he was \"gagged\" by a compromise agreement, which he broke two years ago.\nMr Walker cites recent reports that looked into whistleblowing from the health select committee of MPs and Sir Robert Francis QC as supporting his call for an apology and \"practical redress\".\nHe writes: \"The practical redress you offer will need to be individual to those who raised concerns and the harm they suffered but I would expect that whistle-blowers simply want an apology and a job that is comparable to the one they were forced from.\"", "url": "https://www.bbc.com/news/health-31772025"}