{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:25:26", "date_modify": "2025-05-19 15:25:26", "date_publish": "2017-08-07 00:00:00", "description": "The latest news, sport, travel and weather for the East Midlands on Monday 7 August 2017.", "filename": "news_live_uk-england-derbyshire-40832612_1747668326.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-derbyshire-40832612_1747668326.html", "title": "Latest updates: East Midlands Live", "title_page": "Latest updates: East Midlands Live on Monday 7 August 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Car park fire: Dozens of vehicles damaged\nQuentin Rayner\nEast Midlands Today chief news reporter\nThe owner's of the car park in Stoney Street in Nottingham's Lace Market said drivers should be able to collect their vehicles tonight - if the fire service gives them the go ahead.\nDriver Jon Morley suspects his car will be a write-off.\nIt's thought one car caught fire, destroying several others and damaging another 30.\nNottinghamshire Fire Service is investigating the cause of the blaze.\nWeather: Rain on its way\nAlexandra Hamilton\nBBC weather presenter\nCloud will thicken this evening and overnight. A band of rain, which could be heavy at times, will move northwards in the early hours.\nLows of 11C (52F).\nIt’ll be cooler tomorrow with showery rain expected on and off throughout the day. It’ll be cloudy with the chance of some thunder. Highs of 15C (59F).\nWoman sues council over Bakewell footpath fall\nGavin Bevis\nBBC Local Live\nA pensioner from London is suing Derbyshire County Council after she tripped over on a path in Bakewell and broke both her wrists.\nAccording to papers issued at the High Court, the 65-year-old stumbled on \"raised and broken tarmac\" on a footpath between Coombs Road and the River Wye bridge that had left an 'exposed edge\".\nThe woman is seeking damages of at least £300,000, claiming her movement has been restricted since the 2014 fall.\nDerbyshire County Council declined to comment but says it will deal with the case through court proceedings.\nBurglar 'crept through window and stole phone'\nGavin Bevis\nBBC Local Live\nA burglar stole a mobile phone from a house in Oakwood after getting in through an open downstairs window, police have said, external.\nThe theft took place in Lydstep Close between 02:00 and 10:45 on Saturday 15 July.\nPolice have now released photos of a man they want to speak to in connection with the burglary.\nMan arrested on suspicion of attempted murder\nBen Truslove\nBBC News Online\nA 34-year-old man has been arrested on suspicion of attempted murder after a woman was seriously injured in Nottingham.\nShe remains in QMC but her injuries are not thought to be life threatening.\nIt follows an incident in Coniston Avenue in the early hours of Friday.\nThe man remains in police custody.\nEx-Rams boss McClaren fancies Hearts job\nGavin Bevis\nBBC Local Live\nCould former Derby County boss Steve McClaren be heading for the Scottish Premier League?\nThe 56-year-old, who was sacked by the Rams for a second time in March, has been linked with the vacant managerial position at Hearts.\nBBC Sport says McClaren, pictured below dancing to YMCA, has registered interest in the role, and will be on the club's final shortlist, to be compiled this week.\nHospitals trial billing non-British patients\nAmy Woodfield\nBBC Local Live\nHospitals in Nottingham are taking part in a trial that's hoping to curb what's known as \"health tourism\".\nPatients attending their first appointment at maternity and fracture clinics will be asked to provide documents to prove their identity and that they're UK residents - those who aren't eligible for free treatment will be sent a bill.\nThe hospitals have confirmed that no one will be refused treatment.\nArrests and bans in Spice crackdown\nGavin Bevis\nBBC Local Live\nPolice say they made at least five arrests, external in Derby city centre over the weekend as part of a crackdown on the use of formerly legal highs such as Spice and Black Mamba.\nDerbyshire Police said its officers had also used police powers to banish at least ten users from the city centre for 48 hours.\nThe drugs, known as synthetic cannabinoids, are currently a major priority for forces around the country following complaints they lead to \"zombie-like\" or erratic behaviour in users.\nMissing man could be in Wales\nAmy Woodfield\nBBC Local Live\nThe family of this man are \"growing increasingly concerned\" for his safety...\nGarry Llewellyn from Broughton Astley has been reported missing.\nDespite living in Leicestershire it's thought the 41-year-old could have travelled to Llangollen in North Wales.\nHe's been described as speaking with a Welsh accent and having a stammer.\nYour Questions: What will happen to the Cemex site in Attenborough?\nMaryam Qaiser\nBBC Local Live\nOne of our readers used Your Questions to ask: What is happening with the gravel pit on Long Lane, Attenborough, now Cemex has closed? Has it been purchased by a developer?\nCemex has confirmed that the site of the old sand and gravel processing plant next is still owned by the firm but is no longer operating.\nA spokesman said: \"This area is being considered for development but would of course be subject to a planning application, should this option be pursued.\n\"However the main part of the Attenborough site which is a designated Site of Special Scientific Interest (SSSI) is leased to and managed by Nottinghamshire Wildlife Trust.\"\nThirteen cars damaged in car park fire\nAmy Woodfield\nBBC Local Live\nThe fire at a car park in Stoney Street in Nottingham is now out - one crew remains at the scene and an investigation into the cause is under way.\nI've been told six cars in the basement of the multi-storey caught fire but 13 have been damaged in total.", "url": "https://www.bbc.com/news/live/uk-england-derbyshire-40832612"}