{"authors": ["Katie Waple", "www.facebook.com"], "date_download": "2025-04-26 08:03:03", "date_modify": "2025-04-26 08:03:03", "date_publish": "2025-02-26 16:36:39", "description": "Men's Matter a social group in Windsor is on a mission to support the wellbeing and health for men.", "filename": "news_articles_c20dgy1m6xjo_1745654583.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/901d/live/c395aa50-f43e-11ef-837a-fdc1fd381948.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20dgy1m6xjo_1745654583.html", "title": "'We are there for older men' says Berkshire social group", "title_page": "'We are there for older men' says Berkshire social group - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A social group that has been running for 10 years was inspired by a housing association men's meeting.\nMen's Matter in Windsor, Berkshire, is run by Tim Walker who said he felt lonely due to poor health but wasn't afraid to ask for help.\nThe group now meets weekly in both Windsor and Maidenhead and have annual day trips which have included Bletchley Park, Brookfields Museum and the Watercress steam train line.\nMr Walker said: \"We want to help older men enjoy their retired years.\"\nMr Walker explained that in 2015 his health was quite poor but he went to a housing association meeting.\nHe said: \"There was a room full of senior gentleman, probably about 15 -20 men and the housing association people asked us if we would be interested in forming a support group.\n\"We said 'yes' because it sounded like a good idea.\"\nHe said during that meeting \"they talked to us about men in sheds\" meaning men who make things in sheds or run allotments.\n\"Part of our discussion was 'are we going to be an active group or a sedentary group?' And we went for the latter,\" he added.\nThe weekly meetings are two hours long, during the first hour there is either a guest speaker or a general knowledge quiz.\nMr Walker explained the quizzes help support the men's memories and make them think.\nHe explained: \"We've had a handful of men referred to us through the NHS Social prescribing network with early-onset dementia.\n\"Which is why we are very conscious that we need to encourage them to think, use their memories as well as be part of the social discussion.\n\"It is quite sad that a lot of men during their working life, their job is their focus and when they retire they don't seem prepared for it.\"\nThe number of men aged over 65 who live alone in the UK is set to rise by 65% to more than 1.5 million by 2030.\nMr Walker added: \"You can quite quickly lose contact with your former workmates, a lot of men do experience loneliness but would never admit to it.\"\nThe group are holding an event at Maidenhead Library on 19 March between 13:30 - 16:30 GMT which will see 27 exhibitors offer advice and services.", "url": "https://www.bbc.co.uk/news/articles/c20dgy1m6xjo"}