{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 06:34:33", "date_modify": "2025-04-26 06:34:33", "date_publish": "2025-02-27 06:25:20", "description": "Organisers say there is more of an appetite for smaller-scale festivals.", "filename": "news_articles_c984y081n50o_1745649273.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dc8c/live/e0092c30-f460-11ef-9d52-1b1b29dc5f7f.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c984y081n50o_1745649273.html", "title": "Nozstock festival to return as a one-day event", "title_page": "Herefordshire's Nozstock festival to return as a one-day event - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The organisers of Herefordshire's Nozstock music festival, which came to end last year, have announced a special one-day event in the summer.\nThe festival in Bromyard, which began as a barbecue event at a family farm in 1998, stopped last year with creative director Ella Nosworthy citing the struggles larger festivals were facing.\nBut, she said they now planned a one day music event, Into the Valley, on 19 July.\nThe ethos remained the same, she said, but it was just returning on a smaller scale.\n\"It's only three stages, it's not the full 12 stage extravaganza that people are used to but it is going to be a nice day of like-minded people coming together to enjoy good music,\" she said.\n\"The feel and the vibes is the same and it's exciting to be doing something, definitely.\"\nThe independent festival run by the Nosworthy family has hosted live music, comedy and family entertainment, with crowds of up to 5,000 people in attendance.\nMs Nosworthy said smaller events were still successful, but people did not have the money for longer festivals.\n\"I think people struggle to afford three-day festivals and take the time off work and I think a one-dayer feels a lot more achievable for a lot of people and there's certainly been a lot of interest in this one.\n\"I just think it's the right decision for us as an organisation and for the festival industry as a whole, one-dayers just do seem to be where the appetite is.\"", "url": "https://www.bbc.co.uk/news/articles/c984y081n50o"}