{"authors": ["Jude Winter", "www.facebook.com"], "date_download": "2025-04-26 06:19:29", "date_modify": "2025-04-26 06:19:29", "date_publish": "2025-03-01 07:14:53", "description": "The Full Circle Centre was built after a successful bid for a Youth Investment Fund grant.", "filename": "news_articles_c9q4408n71eo_1745648369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/886b/live/ff865840-f509-11ef-8a81-19610c927464.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q4408n71eo_1745648369.html", "title": "New £1.2m Scout and Guides centre set to open", "title_page": "Shelton Lock: New £1.2m Scout and Guides centre set to open - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A brand new £1.2m Scout and Guide Group centre is set to open in Derby.\nThe 1st Shelton Lock Scout and Guide Group's new building, called the Full Circle Centre, is due to officially open at a celebration event on Saturday.\nThe group said its former wooden home, which was built in 1963, became \"unviable\" so they decided to build the Full Circle Centre in Sinfin Avenue, which is bigger and has more room for outdoor adventures.\nTo mark the opening, young people will run through colourful ribbons instead of a traditional ribbon cutting ceremony.\nAs well as being unviable, the group said the old wooden building had a lease that was \"uncertain\".\nWith the support of Derby City Council, the group found new land in Sinfin Avenue with a long-term lease and successfully bid for a Youth Investment Fund grant of more than £1.2m to build the site.\nThe Full Circle Centre includes solar panels, underfloor heating, an air source heat pump and sustainable rainwater system that collects rainwater from the roof and other surfaces that can be recycled for watering plants and toilet flushing.\nThe building also has accessible doors, toilets, pathways, a kitchen that has lowered work surfaces and a \"unique\" feature ceiling installation.\nSue Baker, chair of trustees for 1st Shelton Lock Scout and Guide Group, said the Youth Investment Fund has been \"game changing\" and \"made our dreams a reality\".\nMs Baker added: \"Everyone is so excited about our brand-new home and looking forward to many new adventures for generations to come.\"", "url": "https://www.bbc.co.uk/news/articles/c9q4408n71eo"}