{"authors": ["Dominic Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:25:35", "date_modify": "2025-04-26 07:25:35", "date_publish": "2025-02-28 00:00:55", "description": "It gives general practices a big funding boost, as well as reducing red tape and targets.", "filename": "news_articles_cd7ee895nr0o_1745652335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cd88/live/88d52290-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7ee895nr0o_1745652335.html", "title": "GPs in England strike deal to help end '8am scramble' for appointments", "title_page": "GPs in England strike deal to help end '8am scramble' for appointments - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Patients will be able to book more appointments online and request to see their usual doctor under a new contract agreed with England's GPs, the government has said.\nThe deal gives an extra £889m a year to general practices, as well as a reduction in red tape and targets that ministers hope will mean doctors are freed up to see more patients.\nThe Labour government made manifesto promises to bring back \"family\" doctors and end the early morning phone \"scramble\" for appointments.\nThe doctors' union, the British Medical Association (BMA), says the deal is an important first step in restoring general practices.\nHowever, doctors also want the government to commit to talks about a completely new national contract for GPs within this parliament.\nGP surgeries are seen as the front door to the NHS but for years now, doctors have been warning about the pressure their service is under.\nPatients have felt it too, with some people facing long waits for appointments.\nLong waiting times for routine GP appointments have led to the now familiar \"8am scramble\" for a same-day appointment.\nMany GP surgeries open their telephone lines at 8am, meaning that if you want an on-the-day appointment, you have to phone on the dot at 8am.\nIt is a frequent source of complaints from patients who often find themselves held in long queues, only to be told all the appointments have been booked up.\nNot all surgeries work like this though, with others operating telephone call-back services or online triage so that patients can be prioritised.\nThe new contract says patients should be able to arrange appointments online throughout working hours, freeing up the phones for those who need them most, and making it easier for practices to triage patients based on medical need.\nThe new agreement for the next 2025-26 financial year will see the total value of the contract grow by 7.2%.\nThe total figure includes almost £800m to cover rising costs, such as staff wages, repairs and maintenance of buildings and more patients.\nOther measures include a greater flexibility for surgeries when it comes to employing different healthcare staff.\nGPs will get paid more to carry out routine childhood vaccinations.\nThrough cutting what the government describes as \"box-ticking targets\", ministers say GPs will be freed up to take the first steps towards ending the \"8am scramble\" for an appointment.\nHealth and Social Care Secretary Wes Streeting says that these are the first steps in fixing what he describes as \"a broken NHS\".\n\"Over the past decade, funding for GPs has been cut relative to the rest of the NHS, while the number of targets for GPs has soared,\" he said.\n\"That's why patients are struggling to get an appointment.\n\"This government is cutting the red tape that ties up GPs' time and backing them with an extra £889m next year.\n\"In return, more patients will be able to request appointments online and see their regular doctor for each appointment.\"\nDr Katie Bramall-Stainer, who chairs the BMA GPs' committee, says this contract is a good start, but more work is needed.\n\"We have shown that we want to work in good faith with this government and build on this new beginning – what we now need is certainty about our collective future.\n\"We know the Treasury will be announcing its funding plans for this Parliament this spring, and we need to see a new substantive GP practice contract for England in the upcoming comprehensive spending review.\"\nDr Bramall-Stainer told BBC Breakfast general practice had been pushed to \"desperation point\" over the last 15 years - with \"thousands\" of GPs leaving.\nShe explained the \"first signs of green shoots\" patients might see following the new agreed measures would include being able to get to know their doctor and local staff and surgeries advertising for more staff.\nShe indicated patients would \"potentially\" begin to notice a difference in six to 12 months but insisted that, although a step in the right direction, these new measures are \"nowhere near a solution\".\nDr Steve Taylor, a locum GP in Manchester and spokesperson from the lobbying group Doctors' Association UK, said he fears much of the extra money will have to go towards national insurance contributions, staff and running costs.\nDr Taylor said: \"The new GP contract goes a small way to fix some of the significant issues for GP practices, in that it prevents further declines in funding with a small percentage increase.\"\nBut a much larger investment will be needed to build for the future, he added.\nDr Dean Eggitt, a GP in Doncaster and ex-executive member of the doctors' union, the BMA, said he was disappointed with the new contract.\n\"There is little in this contract that is going to help patients access care quicker than they do already because it hasn't managed to address the underlying issue of national insurance contributions and the vast sums of money that will need to go towards that,\" he added.\nMeanwhile, Azeem Majeed, London GP and professor of primary care and public health at Imperial College London, said overall, the contract was a positive development.\n\"It is good that an agreement has been reached. But a lot of work still needs to be done to improve the lives of patients, GPs and other primary care staff.\n\"The priority should be recruiting more nurses and GPs to help increase appointments,\" he said.\n\"But it will take some time for people to see improvements from this investment.\"", "url": "https://www.bbc.co.uk/news/articles/cd7ee895nr0o"}