{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:15", "date_modify": "2025-05-19 15:38:15", "date_publish": "2015-01-30 05:10:32", "description": "A koala who shot to fame after being pictured receiving treatment for burnt paws has been returned to the wild, says the expert who treated him.", "filename": "news_world-australia-31052633_1747669095.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80665000/jpg/_80665217_koalacin1538jeremy6_1_15(681).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-australia-31052633_1747669095.html", "title": "'No more room service' as Jeremy the koala returns to the wild", "title_page": "'No more room service' as Jeremy the koala returns to the wild - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A young koala who became a social media sensation after being pictured receiving treatment for his burnt paws has been released back into the wild.\nThe animal, nicknamed Jeremy, was injured in bushfires in Australia's Adelaide Hills earlier this month.\nHe has since made a complete recovery, says Aaron Machado, who operates the clinic that treated the animal.\n\"The only thing he has to do now is get used to not having any more room service,\" Mr Machado told the BBC.\nThe koala was nicknamed after Jeremy Sparrow, a fire service volunteer who rescued him earlier this month.\nJeremy was treated for burns to the paws at the Australian Marine Wildlife Research and Rescue Organisation (AMWRRO) in Port Melbourne.\nA photograph of him, lying flat on his front with all four paws soaking in a medical solution, was widely shared on social media.\nMr Machado, the president of AMWRRO, said it was important to make sure the koala's wounds did not get infected, given that it has a \"very poor, if not obsolete, immune system\".\n\"It's one thing having a burn, another thing having an infected burn,\" he said.", "url": "https://www.bbc.com/news/world-australia-31052633"}