{"authors": ["Grant Williams", "www.facebook.com"], "date_download": "2025-04-26 03:59:01", "date_modify": "2025-04-26 03:59:01", "date_publish": "2025-03-04 06:15:27", "description": "The land at Wealdstone South, north London, needs to be cleared before 149 new homes are built.", "filename": "news_articles_cly6r8pvm43o_1745639941.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/43ba/live/703c8fb0-f81a-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6r8pvm43o_1745639941.html", "title": "Harrow fly-tipping: Byron Quarter site to cost £350,000 to clear", "title_page": "Harrow fly-tipping: Byron Quarter site to cost £350,000 to clear - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A north London council will have to spend almost £350,000 to remove tonnes of \"industrial scale waste\" that has been dumped on land earmarked for development, it has been revealed.\nHarrow Council's planning committee has approved plans to build 149 new homes on the site of a former driving school in Wealdstone South which until 2023 had been used to park special needs minibuses.\nThe council-owned site has been the subject of continuous fly-tipping in recent years, it was heard during a council meeting.\nHarrow Council's Labour opposition party accused the authority of not securing the site over the past 18 months, but the Conservative leadership said there was a limit to what it could do.\nAddressing the leadership at the meeting, leader of the Harrow Labour Group, councillor David Perry, said: \"You are about to increase council tax by 4.99%.\n\"Of that increase, the first £348,000 raised will, in the coming weeks, go towards clearing an absolute dump of a site at the old driving school where tonnes and tonnes and tonnes of waste has been fly-tipped, dumped and left to rot for months on end.\"\nHe added: \"Furthermore, the pond on that site is now likely contaminated and, given the sheer volume of waste, there is likely to be potentially dangerous and hazardous building and construction material on that site.\"", "url": "https://www.bbc.co.uk/news/articles/cly6r8pvm43o"}