{"authors": ["Chloe Harcombe", "Ross Pollard", "www.facebook.com"], "date_download": "2025-04-26 04:35:48", "date_modify": "2025-04-26 04:35:48", "date_publish": "2025-02-28 12:09:10", "description": "The former world number one spent the day with a group of snooker fans at Apsley House in Bristol.", "filename": "news_articles_cdjyyy43rxvo_1745642148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/51f8/live/cb96f730-f4f8-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyyy43rxvo_1745642148.html", "title": "Steve Davis: Snooker legend surprises fans with visit in Bristol", "title_page": "Steve Davis: Snooker legend surprises fans with visit in Bristol - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of adults with learning disabilities have spent the day with their snooker \"hero\" as part of a surprise visit.\nRetired snooker player Steve Davis dropped in to Apsley House in Bristol to play with residents who are huge fans of the sport.\nStaff at the supported living space, which is home to 14 residents, organised the visit of the former world number one.\n\"It's really nice to meet people because then all of a sudden you stop being their hero and you become their friend, which is far more important,\" Mr Davis said.\nPaul has been living at Apsley house since 1993.\nHe is a keen snooker player and frequently practices his skills at the pool table in the dining room.\nHe used to watch Mr Davis play on TV and said he was shocked to see his \"hero\" walk through the door on Wednesday.\n\"He's a legend... I couldn't believe it,\" Paul said.\nFellow resident Adrian first got into snooker 11 years ago and has participated in local tournaments.\n\"What I like about pool is you get to meet different people,\" he said.\n\"I met Steve Davis today and he's a top man, a top snooker player and also he's very good at doing his BBC commentary on the snooker.\"\nAdrian added that he was \"glad\" to have played a game with the \"legend\".", "url": "https://www.bbc.co.uk/news/articles/cdjyyy43rxvo"}