{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:19", "date_modify": "2025-05-19 14:47:19", "date_publish": "2015-03-05 22:41:19", "description": "The Palestine Liberation Organisation votes to end security co-operation with Israel which dates back to the 1993 Oslo Accords.", "filename": "news_world-middle-east-31753946_1747666039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81435000/jpg/_81435567_025761745-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31753946_1747666039.html", "title": "PLO votes to end historic Israeli security agreement", "title_page": "PLO votes to end historic Israeli security agreement - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Palestine Liberation Organisation (PLO) has voted to end a security co-operation agreement with Israel which dates back to the Oslo Accords of 1993.\nThe decision, by the Palestinians' representative body, must be sanctioned by the president before taking effect.\nIf approved, it would mean ending intelligence sharing on militant groups such as Hamas.\nThis move is a sign of the worsening relationship between Israel and the Palestinian Authority.\nOn Thursday the PLO said its executive committee would meet to implement the decision taken at the central council's meeting in the West Bank town of Ramallah.\nObservers say the announcement is being seen as a retaliatory move after Israel cut off tax transfers, a key source of funds for the Palestinian Authority.\nIsrael suspended tax transfers after the Authority's decision to join the International Criminal Court (ICC) in January. The tax freeze has left the government unable to pay thousands of government employees.\nPalestinian sources say that the decision is final and that it is not a way of pressuring Israel into releasing the tax.\nIsrael has yet to respond to the decision.", "url": "https://www.bbc.com/news/world-middle-east-31753946"}