{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:25:05", "date_modify": "2025-05-21 07:25:05", "date_publish": "2025-05-19 00:00:00", "description": "A Mexican Navy ship crashed into the Brooklyn Bridge in New York on Saturday, killing two cadets and injury 22 others.", "filename": "news_live_cd90l5gvqznt_1747812305.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/90af/live/7a7e5130-34e1-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cd90l5gvqznt_1747812305.html", "title": "Brooklyn Bridge crash live: National Transportation Safety Board gives updates", "title_page": "Brooklyn Bridge crash live: National Transportation Safety Board gives updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Here's what the NTSB said\nThe NTSB has concluded its press conference. Here's what we learned from Michael Graham, board member of the NTSB, and Brian Young, the investigator-in-charge:\nThe Mexican ship Cuauhtémoc arrived in New York on 13 May and began moving out to sea on 17 May at around 8:20PM (0120BST) local time\nAt 8:24PM, the ship requested assistance from nearby tugboats. Shortly after, the masts struck the underside of the Brooklyn Bridge in the East River before coming to a complete stop at 8:27PM\nThere is no significant structural damage to the Brooklyn Bridge, which connects the boroughs of Manhattan and Brooklyn, the NTSB said\nThe NTSB has not interviewed crew members, but they are in talks with Mexican government officials to gain access to the ship, any recording devices, and to be able to talk to crew members\nSome cadets have already left New York and returned to Mexico, but 94 crew members are still on the ship, Graham said, attributing the figures to New York City officials\nThe investigation could take up to two years to complete, but the NTSB will issue a preliminary report in 30 days\nInvestigators confirmed that two young Mexican Navy cadets died in the crash\nWe are ending our live coverage of this news conference, but you can stay up to date on this story below:\nMexico mourns Navy cadets killed in Brooklyn Bridge ship crash\nWhat has the Mexican Navy said?\nMexico's Navy Secretary Raymundo Pedro Morales Ángeles said in a statement that the results of any investigation would be followed with \"total transparency and responsibility\".\nThe Navy's commander, Admiral Pedro Raymundo Morales, said all the crew members well enough to travel would be taken back to their homeland soon.\nWe learnt in today's news conference that 179 cadets - of the 277 sailors aboard as of Satruday - left the ship to return to Mexico on Sunday night.\nTwo Mexican sailors, América Sánchez and Jair Maldonado Marcos, killed in crash\nTwo young Mexican Navy cadets died after the ship they were travelling on crashed into the Brooklyn Bridge on Saturday evening.\nAmérica Sánchez, 20, and 23-year-old Adal Jair Maldonado Marcos were among the 277 crew members on board the Cuauhtémoc when it crashed.\nAccording to Mexican media, Sánchez was one of the cadets who was standing on top of the rigging at the time of the accident.\nThe family of América Sánchez have called the crash \"illogical\". They spoke to journalists from their home state Veracruz, which you can watch below:\n179 crew members left the country yesterday, NTSB says, with remainder still on the ship\nSome more lines from the NTSB now.\nGraham said he has heard reports that New York officials had said there had been a power outage on the ship before the crash - but he doesn't know where they got this information, adding that investigators don't know that as they haven't looked at the engine yet. Officials said they would be looking at the engine as part of their review.\nGraham also said 179 cadets left the ship to return to Mexico on Sunday night, with the remaining crew living on the ship for now.\nThe ship and crew are currently docked on the east side of Manhattan, and the ship will later be towed to a repair facility, Young told the news conference.\nWhat happened with the crash?\nOn Saturday evening, a Mexican Navy ship crashed into the Brooklyn Bridge in New York City, leaving two sailors dead and several others injured.\nThe Cuauhtémoc, a training ship, had 277 people on board and is believed to have lost power before the crash.\nHere's what happened:\nThe ship crashed into the iconic bridge at around 20:30PM EDT (01:30BST)\nPolice said the Cuauhtémoc's mast height was 48.2m (158ft). The New York transport department's website says the bridge has a 135ft clearance at its centre\nAll three masts collapsed. Footage from the scene shows some crew members hanging from its sails after the collision\nThe ship was on an annual celebratory journey for Mexican Navy cadets and had planned to make several stops, including in New York and Scotland before reaching its final destination in Iceland\nEmergency officials towed the ship away from the bridge", "url": "https://www.bbc.com/news/live/cd90l5gvqznt"}