{"authors": ["Ellie Brown", "www.facebook.com"], "date_download": "2025-04-26 06:18:42", "date_modify": "2025-04-26 06:18:42", "date_publish": "2025-03-01 07:21:51", "description": "Coventry City Council have approved a £330,000 cash injection for the 2025 festival.", "filename": "news_articles_c86pj9v1y7yo_1745648322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bb38/live/a8566c80-f5fa-11ef-a576-211c964a64b2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pj9v1y7yo_1745648322.html", "title": "Coventry's Godiva Festival needs review, says council Tory group", "title_page": "Coventry's Godiva Festival needs review, says council Tory group - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of Coventry councillors want a review of the city's annual Godiva Festival, which they think should cover its own costs.\nThe opposition Conservative group said the council-run event was \"over-inflated\" at a meeting this week.\nThey proposed to axe a £330,000 cash injection from the council to cover a shortfall for this year's show.\nBut the council's leader said the authority reviewed the event every year and hit back at the group's criticism of the music festival.\nThe cash boost was agreed as part of the ruling Labour group's budget at the meeting on Tuesday.\nIt comes after last year's concert saw a drop in ticket sales, causing a £200,000 overspend by the cash-strapped council.\nSpeaking at Tuesday's meeting, deputy Conservative group leader Peter Male labelled the cash boost a \"bailout\" and called for a review.\n\"The Conservative group has decided that now is the time to review the future of the Godiva Festival and propose to direct this bailout elsewhere,\" he said.\n\"What started as a community event promoting local talent, has morphed into a larger event with spiralling costs and declining ticket sales.\n\"Why should council taxpayers pick up the tab?\"\nCouncil leader George Duggins said he did not think the group's plans were \"coherent or cogent\".\n\"After each year we sit down and number crunch, so the review of Godiva Festival is certainly ongoing so I don't think there's anything that we wouldn't agree with there,\" he said.\n\"It's constantly reviewed, it's like everything else that we do.\"\nThis news was gathered by the Local Democracy Reporting Service which covers councils and other public service organisations.", "url": "https://www.bbc.co.uk/news/articles/c86pj9v1y7yo"}