{"authors": ["Gem O'Reilly", "www.facebook.com"], "date_download": "2025-04-26 06:50:26", "date_modify": "2025-04-26 06:50:26", "date_publish": "2025-03-01 07:57:49", "description": "Aziz Isa Elkun, from north London, spent seven years not knowing whether his mother was alive.", "filename": "news_articles_crmjndmmnmno_1745650226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/af3a/live/f44ca640-f45b-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjndmmnmno_1745650226.html", "title": "Uyghurs in London: 'I've spoken to my mum after nine years'", "title_page": "Uyghurs in London: 'I've spoken to my mum after nine years' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Aziz Isa Elkun, from north London, spent seven years not knowing whether his mother was alive. On a random day in April last year, he received an anonymous video call from her, which he said was monitored by the Chinese Foreign Affairs Department.\nAziz, 54, said his mother Hepizikhan, who is an Uyghur Muslim, was placed in a Chinese camp in the Xinjiang province in 2018 and has since been released.\nChina is accused of has detaining more than a million Uyghur Muslims in Xinjiang since 2016 – but the government calls them \"re-education camps\" and denies all allegations of abuse.\nAziz is calling on the government to allow his 82-year-old mother to come to the UK, where he can care for her.\nThe Chinese Embassy was contacted for comment but did not respond.\nRecalling the moment they spoke for the first time since 2017, Aziz said: \"She was crying so much and was so grateful to speak to me.\n\"I believe the call was monitored by the Chinese police, so we had to be careful what we said.\n\"I was asking her about her health and she was asking about the family.\"\nHe has been able to speak to his mother four times since April 2024, with the last call in January 2025.\nHe believes the Chinese police were monitoring the calls.\n\"Every day I feel depressed that I can't speak to my mother properly,\" Aziz said. \"I don't know how to express how this makes me feel.\"\nFive years ago the BBC interviewed Aziz, and he said that he did not know if his mother was alive in the camp.\nAn exile from Xinjiang and an academic, Aziz has written about the treatment of Uyghur Muslims by the Chinese government, and protested against it.\nHe was forced to leave Xinjiang in 1999 because of his activism and came to London in 2001. Aziz is now a British citizen and lives in the capital with his wife and three children.\nA BBC investigation in 2022 found that the camps in Xinjiang used violence and torture to drive Uyghurs away from their Islamic beliefs.\nDr Joanne Smith Finley, reader in Chinese studies at Newcastle University, said: \"Aziz's case is a microcosm of the bigger story.\n\"What we've seen is a campaign of what I describe as state terrorism.\n\"The state has used a system of terrorist acts, including mass internment, formal imprisonment, and forced labour for Uyghur Muslims to create a climate of horror so that everyone is afraid and will practise loyalty to the Chinese Communist Party.\n\"People have been burning their Qurans and cutting contact with relatives who may be faithful abroad.\"", "url": "https://www.bbc.co.uk/news/articles/crmjndmmnmno"}