{"authors": ["John Wimperis", "www.facebook.com"], "date_download": "2025-04-26 08:04:43", "date_modify": "2025-04-26 08:04:43", "date_publish": "2025-02-26 15:33:54", "description": "Congestion in Bath is a \"pressing concern\" for many residents, a council leader says.", "filename": "news_articles_c8e7d759l19o_1745654683.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b4e9/live/3671ead0-f385-11ef-bdb2-df3b1e28059d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e7d759l19o_1745654683.html", "title": "\"Broader solution\" to Bath traffic sought after bus gate plan axed", "title_page": "\"Broader solution\" to Bath traffic sought after bus gate plan axed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wider solutions to address a neighbourhood's traffic-choked roads are being sought after a controversial plan to install a bus gate was dropped.\nLocals had voiced strong opposition to the bus gate at a crossroads in Bath and a health centre warned it could \"severely impact\" patient access, external.\nThe leader of Bath and North East Somerset Council, Kevin Guy, is now \"exploring a broader solution that addresses the traffic concerns across Walcot, Larkhall, and Lambridge\", in the north-east of the city.\nThe bus gate had been intended to improve congestion as part of a liveable neighbourhood programme.\nThe gate would have been installed at the crossroads where Camden Road and Eastbourne Avenue meet Fairfield Road and Tyning Lane, according to the Local Democracy Reporting Service.\nThese roads run near the busy London Road, a key route into the city.\nIn a letter to locals, Mr Guy said: \"The issue of through-traffic avoiding the busy London Road and using residential streets remains a pressing concern for every resident I've spoken to.\"\nBut he said the bus gate was cancelled because it could lead to ''traffic challenges\".\nFairfield Park Health Centre in Bath, which has about 14,000 patients on its books, had said the plan was \"poorly thought-out\".\nMr Guy said the council remained committed to its liveable neighbourhood programme to make its streets \"safer, greener, and more enjoyable places to live\".\n\"We also want to encourage more people to choose public transport, and bus-priority measures (such as bus gates) enable more efficient and reliable services,\" he said.\nMr Guy added that parts of Bath have already seen \"real benefits\" from liveable neighbourhood measures, including \"less traffic, improved walking, cycling, and wheeling routes, and a stronger sense of community\".\nThe council was granted £9.5m in funding for its liveable neighbourhood programme by the West of England Combined Authority in September 2024.", "url": "https://www.bbc.co.uk/news/articles/c8e7d759l19o"}