{"authors": ["Michael Fitzpatrick and Catherine Doyle", "www.facebook.com"], "date_download": "2025-04-26 06:25:40", "date_modify": "2025-04-26 06:25:40", "date_publish": "2025-02-28 21:52:39", "description": "A man in his 70s who was murdered in what police called a \"senseless attack\" has been remembered.", "filename": "news_articles_cy4lvpw4ynvo_1745648740.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a0a/live/efa7edb0-f619-11ef-bc15-b928e72b39da.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4lvpw4ynvo_1745648740.html", "title": "Vigil held for pensioner murdered in Dungannon", "title_page": "Vigil held for pensioner murdered in Dungannon - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vigil has been held in Dungannon, County Tyrone, for a pensioner who was murdered in the town on Thursday night.\nThe victim, aged in his 70s, was found with serious injuries following an assault at a flat in the Corrainey Park area. He later died.\nPolice have said no arrests have been made so far.\nOn Friday night, more than 100 people gathered close to the block of flats where the man lived.\nSupt Peter Stevenson told a news conference the victim \"was found seriously injured on the living room floor of the property\".\n\"The man was a resident in the area for more than 20 years,\" he added.\n\"Officers are at the scene today and are working to establish the full circumstances that led to this senseless attack.\"\nOn Friday night, friends and neighbours left flowers and candles near the scene of the assault, while prayers were also said.\nMatthew Kozowski said he had known the victim for more than 16 years.\nHe said he was \"very sad\" and described him as a \"gentleman\".\n\"He never complained about nothing, he always told me positive things.\n\"He always had a full packet of sweeties for my children.\"", "url": "https://www.bbc.co.uk/news/articles/cy4lvpw4ynvo"}