{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:19:56", "date_modify": "2025-05-19 15:19:56", "date_publish": "2015-02-15 01:17:20", "description": "Taxi, by dissident Iranian director Jafar Panahi, wins top prize at the Berlin Film Festival, while British stars Charlotte Rampling and Sir Tom Courtenay win acting honours.", "filename": "news_entertainment-arts-31475783_1747667996.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81017000/jpg/_81017553_81017551.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31475783_1747667996.html", "title": "Berlin Film Festival: Panahi's Taxi wins Golden Bear", "title_page": "Berlin Film Festival: Panahi's Taxi wins Golden Bear - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A film by dissident Iranian director Jafar Panahi has won the Golden Bear, the Berlin Film Festival's top prize.\nTaxi is Panahi's third film since he was banned from making films by the Iranian authorities and forbidden from travelling in 2010.\nIt was filmed covertly as the director drove a taxi around Tehran.\nBritish stars Sir Tom Courtenay and Charlotte Rampling won best actor and actress for their roles as a married couple in Andrew Haigh's 45 Years.\nTaxi sees Panahi share his thoughts on contemporary Iran with passengers in the back of his cab, using a mounted dashboard camera to evade the scrutiny of the Iranian authorities.\nIt was one of 19 films vying for the prestigious Golden Bear award, including more high-profile fare from directors such as Wim Wenders, Terence Malick and Peter Greenaway.\n'Love letter'\n\"Instead of allowing his spirit to be crushed and giving up, instead of allowing himself to be filled with anger and frustration, Jafar Panahi created a love letter to cinema,\" said Black Swan director Darren Aronofsky, who headed this year's jury.\n\"His film is filled with love for his art, his community, his country and his audience.\"\nOwing to his travel ban, Panahi was unable to be in Berlin for the award ceremony, but his niece, Hana Saeidi, was on hand for a tearful acceptance of the statuette.\n\"I'm not able to say anything, I'm too moved,\" said Ms Saeidi, who appears in the film.\nIn 2011, the Iranian film-maker was made a jury member, but was once again unable to attend because of travel restrictions. An empty chair was left onstage as a reminder of his absence.\nIn an earlier statement, Panahi told festival organisers: \"I'm a filmmaker. I can't do anything else but make films. Cinema is my expression and the meaning of my life. Nothing can prevent me from making films.\"\nSpeaking to Iran's Ilna news agency after his win, Panahi said: \"I'm really happy for me and for Iranian cinema\", but added \"no prize is worth as much as my compatriots being able to see my films\".", "url": "https://www.bbc.com/news/entertainment-arts-31475783"}