{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 08:07:43", "date_modify": "2025-04-26 08:07:43", "date_publish": "2025-02-26 14:05:59", "description": "Oxfordshire County Council currently funds 20 advanced pathways across the county.", "filename": "news_articles_c39v127verjo_1745654863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b0f0/live/2bed4d20-f439-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39v127verjo_1745654863.html", "title": "SEND education scheme funding doubled by council", "title_page": "Oxfordshire SEND education scheme funding doubled by council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than £2m of funding has been announced for additional bespoke education programmes for children with special educational needs and disabilities (SEND).\nOxfordshire County Council currently funds 20 advanced pathways across the county, with the extra money now doubling that number.\nThe initiative, developed within mainstream schools, provides teachers with the ability to deliver small group support for children with SEND.\nDr Claire Brenner, from Oxfordshire's SEND Parent Action group, said the additional funds were \"obviously good news\" as the schemes \"really do work\".\nShe told the BBC: \"Really importantly, you don't need to go through the rigmarole of getting one of these education plans in order to access it.\n\"The schools have the autonomy to decide which children need it which is really vital if you want to make sense of what is actually accessible to everybody, rather than just those who are able to fight their way through the process.\"\nBut Dr Brenner questioned the scale of the new investment, saying: \"What I don't understand is why they're not rolling it out to all 400 schools in Oxfordshire, rather than just doubling it.\n\"It feels like a sandbag trying to fix an entire flood - I'm happy I've got one sandbag, but we need to fix the entire flood.\"\nThe advanced pathway initiative was first introduced in 2021 and will now be rolled out into a further 20 schools.\nKate Gregory, the council's SEND chief, said: \"More children with special educational needs and disabilities will now be able to access the right support at the right time, thanks to this commitment.\"\nShe said the scheme could save the council up to £65,000 in costs per student.\n\"It has the potential to offer considerable savings in addition to the positive results that we're seeing,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c39v127verjo"}