{"authors": ["Gavin McEwan", "www.facebook.com"], "date_download": "2025-04-26 04:34:58", "date_modify": "2025-04-26 04:34:58", "date_publish": "2025-02-28 12:37:33", "description": "Herefordshire Council is seeking a contractor for the works in Hereford.", "filename": "news_articles_cr722g4p4vdo_1745642098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/06a9/live/79c49520-f5ca-11ef-9b68-05a34bb37cf3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr722g4p4vdo_1745642098.html", "title": "Hereford set for £7m active travel improvements", "title_page": "Hereford set for £7m active travel improvements - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cycling and walking schemes in Hereford are set to benefit from a £7m investment.\nHerefordshire Council has opened a tender for a principal contractor to install active travel improvements along Holme Lacy Road and the Straight Mile, running from Ross Road in the south of the city to the Rotherwas industrial zone.\nThe council said it expected work to begin in June and be completed by next March.\nThe work will be partly paid for out of Herefordshire's £20m award from the previous government's Levelling-Up Fund, external.\nWhen the award was announced early last year, the council said the scheme was intended to encourage local residents and workers in the area to walk or cycle to work.\n\"There will be a series of improvements along the Holme Lacy Cycleway to encourage more and safer active travel to work and local services,\" it said.\nThe plans include a cycle track, partly segregated from pedestrians and part-shared.\nA signal-controlled crossing will be built for cyclists under the railway bridge, while there will priority crossings for cyclists at Putson Avenue, Hinton Road, Chestnut Drive and Hinton Avenue.\nA new pedestrian crossing will also be created on the stretch between St Clare's Court and Lower Bullingham Road.\nThe tender closes to bids on 7 April.", "url": "https://www.bbc.co.uk/news/articles/cr722g4p4vdo"}