{"authors": ["Alex Boyd", "www.facebook.com"], "date_download": "2025-04-26 06:44:49", "date_modify": "2025-04-26 06:44:49", "date_publish": "2025-03-01 16:29:06", "description": "US support is crucial, Zelensky says hours after the bust-up with Trump at the White House.", "filename": "news_articles_cvgeqr0vg0no_1745649889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47aa/live/db6a6070-f6b5-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgeqr0vg0no_1745649889.html", "title": "Zelensky wants US to 'stand more firmly' on Ukraine's side", "title_page": "Zelensky wants US to 'stand more firmly' on Ukraine's side  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ukrainian President Volodymyr Zelensky said he wanted the US to \"stand more firmly on our side\" after a fiery White House exchange with US President Donald Trump on Friday.\nAfter arriving in the UK to take part in a European leaders' summit, Zelensky urged the US to continue its support for Ukraine despite \"the tough dialogue\" between the two sides.\nIt came after a war of words at the Oval Office in which Trump told Zelensky to make a deal with Russia \"or we are out\" and US Vice-President JD Vance accused him of being ungrateful.\nOn Saturday, Zelensky thanked UK Prime Minister Sir Keir Starmer for \"meaningful and warm meeting\" and said a £2.26bn ($2.8bn) loan to Kyiv had been agreed.\n\"The funds will be directed toward weapons production in Ukraine.\n\"I thank the people and government of the United Kingdom for their tremendous support from the very beginning of this war.\n\"We are happy to have such strategic partners and to share the same vision of what a secure future should look like for all.\"\nEarlier, Zelensky published a thread of 14 posts on X in which he reiterated calls for US security guarantees to form part of any \"just and lasting\" peace deal to end the war with Russia.\nHe noted that Trump wanted to end the war, which began with Russia's full-scale invasion of Ukraine on 24 February 2022, but added that no-one wanted peace more than Ukraine.\nThe ill-fated White House meeting was intended to precede the signing of a deal to give the US access to Ukraine's deposits of rare earth minerals. Instead, Zelensky was told to leave early before it could be signed.\nTrump later told reporters that Ukraine's president \"overplayed his hand\" in the exchange and that he would need \"to say 'I want to make peace'\" to restart talks with the US.\nEuropean leaders rallied behind Zelensky, but Nato's secretary general said he must \"find a way\" to restore his relationship with Trump.\nOn Saturday, Zelensky said Ukraine was ready to sign the minerals agreement as \"the first step toward security guarantees\" from the US - a line he has maintained for days, but which Trump has refused to agree to.\n\"But it's not enough, and we need more than just that,\" he added. \"A ceasefire without security guarantees is dangerous for Ukraine.\"\nHe added: \"All Ukrainians want to hear a strong US position on our side. It's understandable the US might look for dialogue with [Russian President Vladimir] Putin.\n\"But the US has always spoken about 'peace through strength.' And together we can take strong steps against Putin.\"\nIn Russia, the Kremlin's foreign ministry spokeswoman called Zelensky's visit to Washington a \"complete diplomatic failure of Kyiv\".\nMaria Zakharova said the Ukrainian president is \"obsessed\" with prolonging the war, and repeated Russia's insistence to annex all territories currently occupied by Russia.\nAhead of the London summit, where European leaders will further discuss efforts to secure a peace deal, Zelensky met UK Prime Minister Sir Keir Starmer who said he retained \"unwavering support for Ukraine\".\nSpeaking inside his office, Sir Keir told Zelensky he was \"very, very welcome here in Downing Street\" and reiterated that the UK would stand with Ukraine \"for as long as it may take\".\nHe added: \"A lasting peace for Ukraine based on sovereignty and security for Ukraine - so important for Ukraine, so important for Europe and so important for the United Kingdom.\"\nSenior political figures from across Europe have also rallied behind Ukraine after Friday's extraordinary scenes in the US.\nThe leaders of Germany, France, Spain, Poland and the Netherlands were among those who posted social media messages backing Ukraine - with Zelensky responding directly to each one to thank them for their support.\nFrench President Emmanuel Macron posted: \"There is an aggressor: Russia. There is a victim: Ukraine. We were right to help Ukraine and sanction Russia three years ago - and to keep doing so.\"\nGermany's outgoing Chancellor Olaf Scholz wrote that \"no-one wants peace more than the citizens of Ukraine\", with his replacement-in-waiting Friedrich Merz adding that \"we stand with Ukraine\" and \"we must never confuse aggressor and victim in this terrible war\".\nSpeaking to the BBC on Saturday, Nato chief Mark Rutte said he had spoken to Zelensky twice following the White House meeting, and told him \"we have to respect\" what Trump has done for Ukraine so far.\nHe referenced the first Trump administration's approval for the sale of Javelin anti-tank missile systems which allowed Ukraine to \"fight back\".\nPutin launched the war two years after Trump had left office.", "url": "https://www.bbc.co.uk/news/articles/cvgeqr0vg0no"}