{"authors": ["Joanna Durrant", "www.facebook.com"], "date_download": "2025-04-26 06:29:14", "date_modify": "2025-04-26 06:29:14", "date_publish": "2025-02-27 11:08:41", "description": "Ayla, 18, and mum Sarah will host the support group now its founder is stepping down after 20 years.", "filename": "news_articles_cy83x33927do_1745648954.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ec0c/live/b249fa00-f423-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83x33927do_1745648954.html", "title": "Teen to help run Cirencester anorexia group to give others 'hope'", "title_page": "Teen to help run Cirencester anorexia group to give others 'hope' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager who overcame \"crippling\" anorexia is helping run a support group to show others \"they can come out the other side\".\nPat Ayres MBE, 80, founded the Cirencester Eating Disorders Support Group in 2003 after helping her own daughter through the illness, but is now stepping back.\nAyla and her mother Sarah are taking up the reins because they just \"couldn't imagine it not being there for other people\".\nThe eighteen year old said she wanted to help with the running of the group because young people \"in the depths of their illness need someone who will get it\".\nHer illness emerged during lockdown when she was \"bombarded\" daily on social media with new diets to try.\nAyla said she when she returned to school after lockdown she was always looking for new ways to restrict food.\nShe became so unwell she spent several months in hospital and missed more than a year of education.\nAnorexia has one of the highest mortality rates, external of any mental illness.\nSarah said she felt helpless as she watched her daughter's condition deteriorate.\n\"It felt like a bomb had gone off in our lives,\" she said.\n\"But to go along to the group and see people who had been through it and come out the other side just gave us that hope.\"\nSarah said she wanted to take on running the group because \"'it was just such a valuable resource when we were struggling.\"\nShe added: \"I couldn't imagine it not being there for other people.\"\n\"It is quite scary to open up to someone because they are going to try and stop you but honestly that is what you need. You need help,\" Ayla said.\n\"When you have an eating disorder you feel like you are going insane. So when I went to the group, I was like 'it's not just me'.\"", "url": "https://www.bbc.co.uk/news/articles/cy83x33927do"}