{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:39:13", "date_modify": "2025-04-26 03:39:13", "date_publish": "2025-03-04 21:21:10", "description": "Speaking in the Commons, Jim Allister said many companies have stopped trading with Northern Ireland.", "filename": "news_articles_cgm1wzm8kvwo_1745638753.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4257/live/de081b20-f939-11ef-9335-49fc611b7783.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1wzm8kvwo_1745638753.html", "title": "Goods 'flowing relatively smoothly' between NI and GB - Benn", "title_page": "Windsor Framework: Goods 'flowing relatively smoothly' between NI and GB - Benn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hilary Benn has rejected suggestions that Northern Ireland's economy is being \"crippled\" by post-Brexit trading arrangements, amid warnings over an \"all-Ireland economy\".\nThe Northern Ireland Secretary acknowledged the Windsor Framework is \"not perfect\" but argued the UK and European Union have shown they can work through issues in a \"constructive and pragmatic way\".\nHe added most goods are \"flowing relatively smoothly\" between Great Britain and Northern Ireland as he responded to numerous concerns raised by unionist MPs during a House of Commons debate.\nLeading the debate, Traditional Unionist Voice (TUV) leader Jim Allister said \"the whole purpose of the protocol was and is to build an all-Ireland economy\".\nHe said that it was designed \"to dismantle the economic links from Great Britain to Northern Ireland, to enhance the links with the Irish Republic, and thereby to create stepping stones out of the United Kingdom into an all-Ireland for Northern Ireland\".\nThe Windsor Framework is an amended version of Northern Ireland's original Brexit deal, the Protocol.\nIt effectively keeps Northern Ireland inside the EU's single market for goods.\nThe MP for North Antrim claimed that many companies have stopped trading with Northern Ireland since the Protocol was put in place.\nHe added: \"Why? Because of the bureaucracy, because you have to make statutory customs declarations, because you have to have them checked, because you have to employ extra staff to do all of that.\n\"And many, particularly of the smaller sectors, companies have simply said, 'not going to do it'.\"\nUlster Unionist Party (UUP) MP Robin Swann said a business in his South Antrim constituency had told him that \"bureaucracy wise, administration wise, it's actually easier for a supplier in Scotland to supply into Japan than it is across the 14-mile stretch of water into Northern Ireland\".\nDemocratic Unionist Party (DUP) MP Sammy Wilson said: \"The additional paperwork which is involved all adds to costs, makes the economy less competitive, and therefore makes it more difficult for the Northern Ireland economy to be viable.\"\nResponding on behalf of the UK government, Benn said: \"We needed to have a system in place for managing a unique set of circumstances and the system that we have is the inevitable result of leaving the European Union - that's where this all began, if it hadn't happened we wouldn't be meeting and having this discussion this evening.\"\nHe asked that, \"given that most goods are flowing relatively smoothly between Great Britain and Northern Ireland, how it can be argued that we're facing those difficulties?\"\n\"I would just make the point if one goes to the port, the lorries come off and most of them go on their way, the goods are moving and that is contrast to the argument that [Allister] put towards the end of his speech where I think he used the phrase 'cripple the Northern Ireland economy',\" he added.\n\"I say to him, I haven't seen any evidence that the Northern Ireland economy, which by the way has the lowest unemployment in the whole of the United Kingdom, is being crippled by the matters we're discussing this evening.\"", "url": "https://www.bbc.co.uk/news/articles/cgm1wzm8kvwo"}