{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:09:31", "date_modify": "2025-04-26 08:09:31", "date_publish": "2025-02-26 13:08:33", "description": "Villagers in Skidby, East Yorkshire, set up the scheme during Covid - but the phone is still in use.", "filename": "news_articles_c5yr7llele2o_1745654971.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eaaf/live/22bd99b0-f440-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yr7llele2o_1745654971.html", "title": "Phone box 'library' shut down by telecoms firm KCOM", "title_page": "Phone box 'library' shut down by telecoms firm KCOM - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A community library housed in a village phone box is having to close because the telephone is still in use.\nVolunteers set up the book swap scheme in Skidby, East Yorkshire, during the Covid lockdown in 2020.\nBut telecoms company KCOM has placed a sign in the box asking people not to put books on the shelves as it \"poses a serious fire risk\".\nVillager Kerry Almond said the library would be \"missed\" because it was a \"nice way to get rid of books you've read and feel like you're putting a bit into the community\".\nThe organisers said they would remove the books and were hoping to find a new home for them with the help of the parish council.\nKCOM said that because the phone box was active \"we are regulatory obliged by Ofcom to make sure it is in working order in case anyone needs to make a call, including in 999 emergencies\".\nThe Hull-based firm is famed for its distinctive cream, rather than red, phone boxes. For decades, it was the only locally owned network to maintain its independence from the national operator that became BT.\nA spokesperson for KCOM added: \"We are keen to work with the local community to see if there are other solutions to creating a book space.\"\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c5yr7llele2o"}