{"authors": ["Tim Parker", "www.facebook.com"], "date_download": "2025-04-26 03:49:01", "date_modify": "2025-04-26 03:49:01", "date_publish": "2025-03-05 14:01:27", "description": "Political leaders are trying to agree a way forward on council reorganisation.", "filename": "news_articles_cwynj24j772o_1745639341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02b6/live/35b01ac0-f9c2-11ef-bce9-d39859b1c2ba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynj24j772o_1745639341.html", "title": "Leicestershire council bosses set to debate political shake-up", "title_page": "Leicestershire council bosses set to debate political shake-up - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council leaders in Leicestershire are due to meet to try to find a way forward on how the county's political map could be redrawn.\nLeicestershire County Council and the leaders of seven districts and boroughs are to discuss proposals for future council boundaries when they meet on Thursday.\nIt follows a row between the county council and the smaller authorities over a lack of collaboration in developing plans.\nThe leader of Melton Borough Council, Pip Allnatt, who speaks for the districts and boroughs, said he wanted to \"get on with the job\".\nAllnatt said \"despite the tight timetable, there's still plenty of time for lots of engagement with stakeholders, the public and each other\" before final proposals have to be submitted in November.\nThe districts and boroughs, alongside Rutland County Council, are promoting a plan to split Leicestershire into two single-tier councils.\nNorth Leicestershire and Rutland would serve the area currently covered by Charnwood, North West Leicestershire, Melton and Rutland County councils.\nSouth Leicestershire would be a separate council covering the current Blaby, Harborough, Hinckley and Bosworth and Oadby and Wigston boroughs and districts.", "url": "https://www.bbc.co.uk/news/articles/cwynj24j772o"}