{"authors": ["Ian Youngs", "www.facebook.com"], "date_download": "2025-04-26 03:49:43", "date_modify": "2025-04-26 03:49:43", "date_publish": "2025-03-05 13:23:13", "description": "The Good Omens author says allegations of sexual assault made by a former nanny are \"invented\".", "filename": "news_articles_c5y07w7nyxzo_1745639383.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5605/live/39fd06b0-f9c2-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y07w7nyxzo_1745639383.html", "title": "Neil Gaiman says nanny's allegations are 'a sham'", "title_page": "Neil Gaiman says nanny's allegations are 'a sham' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Author Neil Gaiman has described allegations of sexual assault made against him by a former nanny as \"a sham\" and \"invented\".\nThe Good Omens writer has filed a response to a lawsuit that was lodged against him and his ex-wife Amanda Palmer in February.\nScarlett Pavlovich accused Gaiman of raping and assaulting her while she was working for his family in New Zealand in 2022, and is seeking at least $7m (£5.6m) damages.\n\"In no uncertain terms, Pavlovich's accusations are false,\" his filing said. \"The sexual scenarios she describes deliberately in graphic detail are invented. Any sexual conduct that occurred was in all ways consensual.\"\nGaiman's legal papers also included WhatsApp messages which he says back up his case, in which Ms Pavlovich thanked him for a \"lovely lovely night\" and told him their relationship was \"consensual\".\nThe British author's lawyers also said New Zealand police \"thoroughly investigated\" Ms Pavlovich's claims but found \"no merit\" in them and declined to file charges.\nIn her lawsuit, Ms Pavlovich said she was befriended by Palmer when she was 22 and homeless in New Zealand. She was repeatedly assaulted by Gaiman after she started working for the couple, she claims.\nMs Pavlovich alleges the former couple violated laws on federal human trafficking, with complaints of assault, battery and inflicting emotional distress against Gaiman and negligence against Palmer.\nMs Pavlovich first made her allegations public in a Tortoise Media podcast in summer 2024, and was also one of eight women who made claims of assault, abuse and coercion to New York Magazine in January.\nIn response to that article, Gaiman said: \"I'm far from a perfect person, but I have never engaged in non-consensual sexual activity with anyone. Ever.\"\nA spokesman for Palmer has said: \"While Ms Palmer is profoundly disturbed by the allegations that Mr Gaiman has abused several women, at this time her primary concern is, and must remain, the wellbeing of her son and therefore, to guard his privacy, she has no comment on these allegations.\"\nMs Pavlovich filed a lawsuit against Gaimain and Palmer in Wisconsin, and against Palmer in Massachusetts and New York.\nAs well as insisting her allegations are untrue, Gaiman's lawyers say US courts do not have authority to adjudicate her lawsuit because the alleged assaults happened in New Zealand.", "url": "https://www.bbc.co.uk/news/articles/c5y07w7nyxzo"}