{"authors": ["Dan Martin", "www.facebook.com"], "date_download": "2025-04-26 07:36:08", "date_modify": "2025-04-26 07:36:08", "date_publish": "2025-02-27 14:51:23", "description": "A murder trial hears the accused teenager said he \"didn't mean to batter\" 80-year-old Bhim Kohli.", "filename": "news_articles_c9vymz4d91yo_1745652968.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a700/live/5bc53910-f469-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vymz4d91yo_1745652968.html", "title": "Bhim Kohli: Murder accused boy admitted to fatal attack in messages, jury told", "title_page": "Bhim Kohli: Murder accused boy admitted to fatal attack in messages, jury told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A boy accused of murdering an 80-year-old man in a park later sent messages admitting to carrying out the attack, a court has heard.\nBhim Kohli died the day after being assaulted while walking his dog in Franklin Park, yards from his home in Braunstone Town, Leicestershire, on 1 September last year.\nA 15-year-old boy, who cannot be named because of his age, is on trial at Leicester Crown Court accused of murder and manslaughter.\nOn Thursday, jurors heard messages retrieved from the boy's mobile phone, including one which said: \"I didn't mean to batter him.\"\nThe court heard a string of texts, Snapchat and WhatsApp messages sent by the boy between the attack on Mr Kohli and his death the following day.\nThey were sent to various contacts, before he was arrested, while hiding in a bush at 21:38 GMT the day after the attack, jurors were told.\nIn reply to a message saying an 80-year-old had been \"smacked up\" in the park, the boy wrote: \"I did that. I watched him pull a knife on a girl.\n\"I didn't mean to batter him. It was one hit and then my anger turned in.\n\"I regret it, man, I do. I'm sorry for everything.\"\nIn another message, the boy, who the court heard had been repeatedly searching the internet for news about the attack, told a contact he had \"banged\" a man.\nA further message from the boy read: \"Feds know it was me. Got my name and picture.\"\nJurors were told the boy sent another message saying he was going \"on the run\".\nHis mother sent him numerous texts saying she loved him and asking him to stop running before he was detained.\nThe court was previously told the male defendant racially abused Mr Kohli before kicking and punching him during an \"intense attack\".\nThe boy, who was wearing a balaclava, also slapped Mr Kohli around the face with his slider shoe while he was on his knees, the court heard.\nProsecutors added the girl, accused of manslaughter, encouraged the violence and filmed the attack on her phone while laughing.\nShe denies the charge.\nEarlier on Thursday, jurors were shown a recording of a police interview with a 13-year-old boy, which was carried out on 4 September last year.\nHe was part of a group in the park with the defendants, the court heard.\nThe boy told police the female defendant had seen Mr Kohli in the park, and said he had previously hit one of her friends with a stick.\nThe 13-year-old - who gave his evidence behind a screen - said the two defendants then approached Mr Kohli - at which point he and two other girls in the group ran away.\nJurors heard Mr Kohli was discovered by two of his children \"on the ground and in obvious pain\".\nMr Kohli, the court heard, had told his daughter he had been punched in the face, kicked, and racially abused.\nHis cause of death was given as a neck injury causing spinal cord damage, and the court was told he had a number of other injuries, including fractured ribs.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/c9vymz4d91yo"}