{"authors": ["Catriona Aitken", "www.facebook.com"], "date_download": "2025-04-26 06:24:41", "date_modify": "2025-04-26 06:24:41", "date_publish": "2025-02-28 22:47:31", "description": "Cinematographer Lol Crawley reflects on how his childhood in Wales inspired him into the film industry.", "filename": "news_articles_ckgnnjw0dezo_1745648681.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a8b2/live/9493a1c0-f51b-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgnnjw0dezo_1745648681.html", "title": "The Brutalist cinematographer: From Welsh hills to Oscar nominee", "title_page": "The Brutalist cinematographer: From Welsh hills to Oscar nominee - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cinematographer Lol Crawley has had a front row view of the evolution of the entertainment industry over a career spanning more than 25 years.\nFrom listening to Bob Dylan \"on a Welsh hillside\" and studying A-level photography, to shooting some of the most iconic landscapes in modern film.\nHis much-acclaimed latest film, The Brutalist, is about a Hungarian-Jewish Holocaust survivor who emigrates to the US.\nAnd as he prepares to attend his first Oscars as a nominee, Crawley looks back on his \"formative\" years in Wales with fondness.\nHe was born in Shrewsbury and grew up in Llansantffraid-ym-Mechain, Powys, and loved watching films with his father.\n\"I remember insisting he woke me up to watch An American Werewolf in London. I was probably a bit too young for it... but I really wanted to see a horror movie,\" he recalled.\nThe launch of Channel 4, and in particular, a series called Road Dreams about road trips across America, was also \"really influential\".\nLike many Welsh children, he was exposed to a lot of music and really connected with it.\n\"For me, there's a really big crossover between music and film. When I'm operating a handheld camera, there's a kind of rhythm and a partnership with the performer,\" he said.\nHe continued: \"There's a real beauty and a gentleness to the landscape [in Wales] and I'm drawn to landscapes.\"\nA cinematographer, also known as the director of photography, is in charge of the look of the film, Crawley explained.\nThey work closely with the director and across the grip department, the lighting department and the camera department.\n\"Each day, we'll have a certain number of scenes that we really have to make,\" he said.\nThe Brutalist - the story of a Hungarian-Jewish Holocaust survivor who emigrates to the US, directed by Brady Corbet and starring Adrien Brody, Felicity Jones and Guy Pearce - was filmed in Budapest over 33 days on a budget of about $10m.\n\"[It] sounds like a lot, but considering how big the film is in scope, and how long it is, it's a fairly modest schedule and budget,\" he said.\nEach day, the actors would spend time with the director on set, as Crawley sat quietly in the corner, working out how best to shoot scenes.\n\"It's about movement of the actors and the camera, what is the focal length, how many shots do we need to tell this part of the story, and how am I going to light it,\" he said.\nBut, he said, budget did not determine success, as The Brutalist had proven.\nCrawley himself has already been awarded a Silver Frog at Polish cinematography festival Camerimage, won an award at the British Society of Cinematographers, scooped the Robby Müller Award in Rotterdam, and picked up the BAFTA for best cinematography - not to mention the film's host of other recognitions.\n\"If it's a well-written story, well executed and if the performances are as fine as this, you can make a movie for a million dollars,\" he said.\nHe said audiences \"living in troubling times in America\" connect with the film's themes such as \"abuse of power, art versus commerce, antiquity versus modernity\".\n\"You look at the statue of liberty at the beginning of the movie and it's upended, it's untethered... the statue of liberty is supposed to represent the very best of what America can be in terms of providing a safe haven and a new life for people,\" he said.\n\"We're betraying that at the moment, in my opinion.\"\nHe added it was \"unapologetic event cinema\", at three-and-a-half hours long, and shot on film.\nThough he regularly rubs shoulders with A-list talent, he is not immune to being star-struck.\n\"I'm a huge Bob Dylan fan and I have been since I was like 10 years old, growing up on this hillside in Wales listening to the albums my dad had. I've worked with him twice now and each time I'm in awe and just find myself staring at him,\" he said.\n\"And I went to the [Oscars] nominees dinner, and it's like 'hello Ralph Fiennes, hello Kate Blanchett' - this is pretty wild.\"\nOn his bucket list is a sci-fi or space film, \"as long as it's an exploration of the human mind at the same time\" and not \"spectacle cinema for the hell of it\".\nAs for returning to Wales, he has ventured over to show his wife where he grew up and reunite with friends, but would \"like to get back more, for sure\".\n\"It would be remarkable to come back and film something in Wales, and there's a thriving film industry as well now, so who knows?\"\nFor now, he plans to \"embrace\" the \"rollercoaster\" of the Oscars.", "url": "https://www.bbc.co.uk/news/articles/ckgnnjw0dezo"}