{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 04:22:23", "date_modify": "2025-04-26 04:22:23", "date_publish": "2025-03-03 14:08:15", "description": "The funding round was led by California-based TCV, whose investments include Facebook and Airbnb.", "filename": "news_articles_c9deq495vdlo_1745641343.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1617/live/af4c3420-f825-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deq495vdlo_1745641343.html", "title": "Cloudsmith: Belfast IT firm raises £18m from US investors", "title_page": "Cloudsmith: Belfast IT firm raises £18m from US investors  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Belfast IT company Cloudsmith has raised $23m (£18.2m) from US investors which it will use to grow its workforce and invest in product development.\nThe funding round was led by California-based TCV, whose notable investments include Facebook and Airbnb.\nCloudsmith was founded by Alan Carson and Lee Skillen who worked for the New York Stock Exchange technology operation in Belfast.\nThe firm's technology lets companies easily update and send software securely around their business using the cloud.\nThe investment is Cloudsmith's second major fundraising following an £11m deal in 2021.\nThat helped the company grow from around 20 employees to almost 100 with the aim of getting to 145 this year.\nAround 75% of the firm's revenues come from US-based customers.\nIts CEO Glenn Weinstein said: \"We are lucky to have really good cyber security talent here in Belfast – that has proven to be critical to Cloudsmith's growth.\n\"Today's announcement means Cloudsmith has created something very special right here in Belfast that serves the world.\n\"Belfast is a great place for tech start-ups and I do see a strong connection between Silicon Valley and what's happening right here in the city.\"", "url": "https://www.bbc.co.uk/news/articles/c9deq495vdlo"}