{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:01:42", "date_modify": "2025-04-26 08:01:42", "date_publish": "2025-02-26 16:01:05", "description": "The child who died was unvaccinated during an outbreak that has infected more than 120 people.", "filename": "news_articles_clyderx4v8go_1745654502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c447/live/d35ab770-f455-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyderx4v8go_1745654502.html", "title": "US measles outbreak kills child in Texas", "title_page": "US measles outbreak kills child in Texas - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rapidly spreading outbreak of measles in Texas has killed one person, health officials said on Wednesday.\nIt marks the first mortality from measles in the US in nearly a decade.\nThe victim was an unvaccinated child who died in a Texas hospital after testing positive for measles, according to the state's health department.\nThe Texas Department of State Health Services reported on Tuesday that it was aware of 124 cases diagnosed since the outbreak began last month, up from 90 on Friday. Almost all cases - 101 - were in patients 17 and younger.\nSpeaking at the first cabinet meeting of US President Donald Trump's current term on Wednesday, Health Secretary Robert F Kennedy Jr claimed that there had been two deaths.\nHowever, Katherine Wells, the director of the public health department in Lubbock, Texas, where the death occurred, clarified later that there has only been one.\nThe US Department of Health and Human Services did not respond to a request for comment from the BBC clarifying the number of deaths.\nThe US declared that measles had been \"eliminated\" in 2000, but the country has seen outbreaks in recent years amid a rise in anti-vaccine sentiment. The last US measles death was in 2015, according to the Infectious Diseases Society of America.\nThe current outbreak is centred in north-west Texas, with measles also recently found across the state's border in New Mexico, as well as Alaska, California, Georgia, New Jersey, New York City and Rhode Island, according to the Centers for Disease Control (CDC).\nCurrently, there are nine cases reported in New Mexico, four of whom are children.\nKennedy, a vaccine sceptic in the past, said that measles outbreaks were common and there have been four measles outbreaks so far in the US this year. The CDC defines an outbreak as three or more related cases.\nHe also said his department was monitoring the current outbreak closely.\nA measles infection can have particularly devastating complications for pregnant women and young children, including pneumonia, neurological impairment, hearing loss and death.\nSurvivors are at risk of developing a degenerative brain and nervous system disease known as subacute sclerosing panencephalitis (SSPE).\nThere were 285 cases of measles reported in the US for all of last year, the highest number since 1,274 in 2019.\nSo far, 18 people in the current outbreak have had to go to hospital, according to the Texas health department. Kennedy said altogether 20 people were in hospital to quarantine.\nFive people in Texas who were infected had been vaccinated, the department also said.\nNew Mexico's congressional delegation pushed Kennedy to urgently address the current outbreak, urging him to \"launch a vaccination promotion campaign\" and rehire recently fired federal health workers, among other measures, in a letter on Monday.\n\"Just last Friday, two dozen employees at the CDC charged with training public laboratory staffers and supporting outbreak response efforts were fired,\" the state's two senators and three House members, all Democrats, wrote.\n\"Those firings will worsen outbreaks and ultimately threaten the health of all Americans in the face of the next public health emergency.\"\nMeanwhile, areas affected by the outbreak are hosting free vaccination clinics, with the city of Lubbock, where the child victim died, holding hours-long clinics each day this week.\nThe Texas outbreak is believed to have started in a rural Mennonite community with low vaccination rates, according to CBS News, the BBC's US partner, and local media.\nMost US children receive two immunisation shots to protect against the illness, which together are 97% effective in protecting against measles, according to the CDC.\nVaccination rates in Texas are 94.3%, according to the CDC, which is below the 95% level that the Infectious Diseases Society of America says is needed to also protect those who are not immunized, commonly called \"herd immunity\".\n\"Measles was rare in the United States, but outbreaks are occurring in areas where vaccination rates have fallen,\" the American Academy of Pediatrics said in a statement. \"Most children who get measles are not up to date on recommended vaccines or are not old enough to get measles vaccine.\"", "url": "https://www.bbc.co.uk/news/articles/clyderx4v8go"}