{"authors": ["Clare Worden", "www.facebook.com"], "date_download": "2025-04-26 06:37:08", "date_modify": "2025-04-26 06:37:08", "date_publish": "2025-02-26 06:35:49", "description": "Viktoria, 10, has an IQ of 136 and has skipped a year but is struggling to get a high school place.", "filename": "news_articles_cd65ype76v4o_1745649428.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/644e/live/a6b6cdd0-eec9-11ef-a008-9b0f78309005.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65ype76v4o_1745649428.html", "title": "Family to appeal Wisbech school place refusal for 'gifted' girl", "title_page": "Family to appeal Wisbech school place refusal for 'gifted' girl - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A family is to appeal a decision not to offer their gifted daughter a place at a nearby secondary school.\nSvetlana's daughter Viktoria, 10, who lives near Wisbech on the Norfolk-Cambridgeshire border, has skipped a school year and is due to attend high school in September.\nThe local school - Marshland High in West Walton near Wisbech - said there was no place available for her this year because it was already oversubscribed.\nIn Norfolk there has been a 15% increase in the number of students being educated out of their chronological year group in the past three years.\nViktoria has an IQ of 136 which means she has significantly higher intellectual abilities than the average 10-year-old.\nShe says she enjoys her current school and has been looking forward to the prospect of going to high school.\n\"I want to move up with my friends and also to move up academically,\" she said.\n\"Then I wouldn't have to redo the same year because I would already know everything that's happening, there won't be anything new for me.\"\nFigures from Norfolk County Council show there were 97 children being educated out of their chronological year group in 2022, increasing to 112 in 2024.\nThe increase relates to children born in the summer whose admission to reception is delayed rather than children like Viktoria who skip a year.\nSvetlana said she was advised by the Norfolk Admissions Service, external to contact prospective schools directly to explain the situation.\nThe family live a five-minute walk from Marshlands High School, part of West Norfolk Academy Trust, and had hoped to secure a place there.\nSvetlana said she was told by the head teacher they should apply for a place for the 2026 academic year.\nViktoria has had assessments with Potential Plus UK, external, the operating name of the National Association for Gifted Children.\nIt concluded that Viktoria had the cognitive and emotional development of a 13 year-old and recommended that she go to high school with her current classmates.\nSvetlana said: \"It is very stressful. You can't predict what is going to happen. It's cost a lot as we have sought legal advice.\n\"Right now we are in the stage that we have submitted an official complaint to the Department for Education and we are just waiting to see what the next step is.\"", "url": "https://www.bbc.co.uk/news/articles/cd65ype76v4o"}