{"authors": ["Faisal Islam", "www.facebook.com"], "date_download": "2025-04-26 04:35:32", "date_modify": "2025-04-26 04:35:32", "date_publish": "2025-02-28 12:24:46", "description": "A deal to avoid further trade barriers appears very much on the cards, but challenges remain.", "filename": "news_articles_cedll3282qzo_1745642132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/687c/live/11f68090-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cedll3282qzo_1745642132.html", "title": "US-UK trade deal: Would an agreement change anything?", "title_page": "US-UK trade deal: Would an agreement change anything? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US-UK trade deal warmly suggested by President Donald Trump should help insulate the UK from the direct impact of global trade tensions.\nIt signals that the White House has accepted the statistical logic that the US and UK have a balanced trade position.\nEssentially each country roughly exports the same amount of goods to one another. Indeed, rather helpfully, according to the US numbers it exports more.\nThere is no general case that the UK is, in the words and logic of the president, \"ripping off\" or \"screwing\" the US, as he has suggested of many other countries and the EU.\nSo a deal to avoid the further trade barriers is very much on the cards.\nBut this is not the wideranging US-UK free trade agreement to lower almost all existing tariffs, that was the subject of so much debate in the Brexit era.\nIt is important to remember that the wider deal was never properly prioritised by Trump's own team, because, as they told me, they never truly believed that the UK would find it in its interest to make the necessary hard break from the EU.\nIt is difficult to see that the UK government would want to further aggravate farmers, or its own base, by putting US farm imports or NHS pricing on the table.\nIn addition, on goods trade, the government is already prioritising its \"Brexit reset\" - a food standards deal, and some customs arrangements to bring down newish trade barriers with the European Union. Tellingly, the top official on that negotiation was in the Oval Office.\nThe narrower \"economic deal\", as it was termed by Sir Keir Starmer, centres around technology and what the UK has referred to as the \"further integration of our two countries' tech sectors\".\nPerhaps the best analogy is that the tech expertise held within the London-Oxford-Cambridge triangle could become for a booming AI-driven Silicon Valley what London's financial City became to New York's Wall Street. The fact that Vice President and big tech ally JD Vance will be leading some of the US negotiation is key here.\nThis strategy will have consequences. Trump's team are already railing against digital services taxes.\nThe UK's digital services tax was introduced in 2020 and imposes a 2% charge on revenues made by big tech firms running social media, internet search engines or online marketplaces.\nWhile the £700m-£1bn a year it raises in the UK is smallish beer, since the UK and France introduced a hit to big tech's revenues, many other countries have followed suit.\nThe White House wants to \"stop the contagion\", and that could mean persuading the UK to lower or abolish it. Chancellor Rachel Reeves advocated raising it from 2% to 12% just four years ago.\nLikewise the vice president in the Oval Office mentioned US tech firms being unfairly affected by what he called \"freedom of speech\" issues.\nThis appears to be a reference to the Online Safety Act. This aims to make social media firms and search engines protect children and adults in the UK from illegal, harmful material, although some have argued it risks stifling free expression online. My understanding is that, right now, movement may be less likely here.\nThe prize will be integration into the massive investments from the best capitalised tech companies in the world.\nCould the UK start to attract back some of the investments lost to Dublin, for example? Would the EU stand back and allow the UK to develop as an offshore hub for US tech companies to service the whole of Europe?\nThere are two other significant issues. It is not unknown for warm words in the Oval Office to be somewhat contradicted by actions soon after. While sat next to the PM, President Trump described the EU's levying of VAT as a trade restriction, seemingly unaware that the UK does exactly the same thing.\nAnd even if it avoids direct new tariffs from President Trump, the open UK economy would be affected by any wide-ranging trade war involving most of the G7 and other countries.\nThat is still on the cards. Not only would that collapse world growth and potentially spike up inflation again, but could upend entirely the workings of the World Trade Organization.\nThe PM says the UK doesn't have to choose between the US and other allies, but it may appear like that to them.\nThe strategy appears to be to become the Switzerland of global economics. Neutrality in a world of trade turmoil, not so much sat on a fence, but tiptoeing along a rather wobbly one.", "url": "https://www.bbc.co.uk/news/articles/cedll3282qzo"}