{"authors": ["Paul Njie & Basillioh Rukanga", "www.facebook.com"], "date_download": "2025-04-26 04:17:26", "date_modify": "2025-04-26 04:17:26", "date_publish": "2025-03-04 07:39:59", "description": "Gen Brice Nguema said he was responding to people's \"many appeals\" to run for president next month.", "filename": "news_articles_cy87g9xnjdpo_1745641046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1fd/live/14458920-f8c2-11ef-a7c3-9ba138beafd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy87g9xnjdpo_1745641046.html", "title": "Gabon election: Junta leader Nguema declares bid for presidency", "title_page": "Gabon election: Junta leader Nguema declares bid for presidency - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gabon's military leader Gen Brice Oligui Nguema has announced his intention to run for president in next month's election.\nNguema seized power in 2023 in a coup that ended the long-standing rule of the Bongo family. He then pledged to hand over power to civilians.\nThe country has however since passed a new constitution and electoral code that critics argue were designed to favour a bid for the presidency by the junta leader.\nNguema told the Gabonese people on Monday that he had decided to run in the 12 April election \"after careful reflection and in response to your many appeals\".\nAddressing supporters during a heavy downpour in the capital, Libreville, he declared his readiness to change the fortunes of the oil-rich country.\n\"I am a builder and I need your courage, your strength, to build this country,\" the the coup leader, who had just turned 50, said.\nThe announcement followed months of speculation about his intentions to officially occupy the country's top seat.\nOn Saturday, Nguema told the military in a meeting that he was aware of their desire to see him run in the election and urged them to vote.\nHe told the defence forces he had heard their calls. \"I listened to you and, believe me, I understood you,\" adding, \"I will get back to you within the next few days\".\nThere has been speculation that Nguema had left the army, as a requirement to run for the presidency – but that has since been denied by his spokesman.\nA Facebook page associated with Nguema clarified on Monday that he was required to abandon his military uniform temporarily while running for election.\nThe page, Infos CTRI Officiel, said that he would have to permanently leave the military if he won the election. \"If he's not elected, he will return to the barracks,\" it said.\nThe Nguema-led junta is credited for ending 55 years of the Bongo dynasty.\nAli Bongo had ruled for 14 years before he was toppled. He took office after the death of his father, Omar Bongo, who had been president for 41 years.\nLast month, the president of neighbouring Equatorial Guinea, Obiang Nguema Mbasogo, encouraged the Gabonese people to support Nguema for a better future for their country.\nSome opposition and civil society groups in Gabon have however been urging the military leader to honour his word and leave power to civilians after the transition.\nDespite Gabon's oil wealth and vast forests, one third of its 2.4 million people live below the poverty line, according to the UN.", "url": "https://www.bbc.co.uk/news/articles/cy87g9xnjdpo"}