{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:19:53", "date_modify": "2025-05-19 15:19:53", "date_publish": "2015-02-02 10:37:31", "description": "Users of the Highland Council-run Corran Ferry in west Lochaber are facing increases in ticket prices.", "filename": "news_uk-scotland-highlands-islands-31090048_1747667993.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/78808000/jpg/_78808224_corranrogerdavies.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-31090048_1747667993.html", "title": "Highland Council plan Corran Ferry ticket price rises", "title_page": "Highland Council plan Corran Ferry ticket price rises - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Users of the Highland Council-run Corran Ferry are facing rises in ticket prices.\nThe local authority has suggested increasing fees by 4% per annum in each of the next three years.\nIt said the rises would help it to cover the costs of operating the small car ferry on Loch Linnhe in west Lochaber.\nThe council's community services committee will be asked to approve the prices at a meeting on Thursday.\nHighland Council's plans for the future running of the service drew criticism last year.\nThe local authority covers the cost of the service.\nBut in November it said the arrangement breached European state aid and competition rules and put potential private operators at a disadvantage.\nIt had sought advice from the Scottish government's state aid unit on whether its running and funding of the ferry service complied with EC regulations.\nThe local authority said the advice warned that there were \"inherent risks attached\" to the current arrangement.\nIt hopes Transport Scotland will take over responsibility for the Corran Ferry.\nThe Free Crossing for Corran campaign said in December it was seeking legal counsel.\nMSP John Finnie and former Highland Council leader Dr Michael Foxley also criticised the local authority's position on the service.\nThe Corran Ferry allows access to and from the communities of Ardgour, Morvern and Ardnamurchan via a narrow stretch of Loch Linnhe.\nIt is also used by people and businesses on Mull, who first travel to the mainland on the Fishnish-Lochaline ferry.\nThe Corran Ferry and Fishnish-Lochaline services also offer tourists an alternative to the Oban to Mull ferry.", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-31090048"}