{"authors": ["Rowenna Hoskin", "www.facebook.com"], "date_download": "2025-04-26 04:10:45", "date_modify": "2025-04-26 04:10:45", "date_publish": "2025-03-04 19:48:45", "description": "Oakwood Theme Park, which opened in 1987, employed up to 200 people.", "filename": "news_articles_c778vdj21zxo_1745640645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/31f5/live/43501e70-f9ac-11ef-b257-2b725ccbdd87.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c778vdj21zxo_1745640645.html", "title": "Oakwood Theme Park: Pembrokeshire venue shuts down immediately", "title_page": "Oakwood Theme Park: Pembrokeshire venue shuts down immediately - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales' largest theme park has announced it will shut down with immediate effect after almost 40 years.\nDue to a drop in visitor numbers, Oakwood Theme Park owners Aspro Park said \"future investment is unsustainable\" and it would not be opening for the 2025 season.\nThe company added: \"All possible avenues have been explored to avoid the closure, and we fully recognise the impact of the closure on the local community and the loss that will be felt as a result.\"\nOakwood, in Pembrokeshire, opened in 1987 and almost closed in 2008.\nBut a £25m investment rescued the park, which employed up to 200 people, according to its LinkedIn profile.\nThe park added that \"unrelenting economic challenges\" from electricity costs, ride parts and food and drink inflation, as well as changes to national insurance thresholds affected the decision.\nAspro Parks said this was the first time it had closed a park or attraction in its \"entire history\".\nIt added: \"Unfortunately, we could no longer see a sustainable way forward and will seek to improve our other parks using the assets and where possible team elsewhere.\"\nThe owners said they felt \"sadness\" for the loss of \"a rite of passage for many young visitors\".\nThe Treasury said, while it was a commercial decision, \"we understand this will be a concerning time for workers at Oakwood Theme Park and their families\".\nIt added that the Budget meant \"more than half of employers will either see a cut or no change in their National Insurance bills\".\nRollercoaster enthusiast and Oakwood superfan Ryan Hackett said he was \"gutted\" at the news of the closure.\nMr Hackett, 64, from Milford Haven, has been on the Megafobia ride at the park 6,200 times and was hoping to reach 7,000 rides over the coming season.\n\"As a rollercoaster enthusiast, it's the last thing you want to see - a park closure,\" he said.\n\"I just hope there's a buyer. I joked on social media earlier - can someone lend me £100m?\n\"My phone has been ringing all evening from other rollercoaster enthusiasts from all over the UK and everyone is devastated.\"\nSamuel Kurtz, Carmarthen West and South Pembrokeshire Member of the Senedd, said the park's closure was \"deeply sad\" and it had a \"special place in the hearts of many\".\nThe Welsh government said: \"We stand ready to offer support to the workforce affected by this decision.\"\nFirst Minister Eluned Morgan urged Aspro Parks \"to do everything possible to support their employees\" including \"exploring redeployment opportunities within their wider business\".\nThe theme park made headlines across the UK in 2004 when Hayley Williams, 16, died after falling 100ft (30m) from the top of the Hydro rollercoaster.\nAn inquest into her death in 2006 heard a safety bar designed to restrain passengers as the ride plummeted down a near-vertical chute at 50mph had not been lowered before it started.\nBut an unlawful killing verdict was ruled out by a coroner who said there was no evidence of gross negligence by anyone involved.\nBut two years later Oakwood Leisure, which ran the park at the time of the accident, was fined £250,000 after admitting staff had failed to ensure passengers were safely restrained on the high-speed ride.", "url": "https://www.bbc.co.uk/news/articles/c778vdj21zxo"}