{"authors": ["Matt Taylor", "Emma Snow", "www.facebook.com"], "date_download": "2025-04-26 04:40:30", "date_modify": "2025-04-26 04:40:30", "date_publish": "2025-03-02 07:22:34", "description": "Sheila Hawkins says she has noticed difficulties in buying practical and stylish clothes.", "filename": "news_articles_cdxq67ql5eeo_1745642430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/39a6/live/081a0c30-f376-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxq67ql5eeo_1745642430.html", "title": "Wheelchair user calls for more accessible clothing", "title_page": "Leicester: Wheelchair user calls for more accessible clothing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A wheelchair user from Leicester is calling for the fashion industry to make clothing more accessible.\nSheila Hawkins, 66, who went to college after she retired and studied fashion, says she has noticed difficulties in buying practical and stylish clothes as a wheelchair user.\nShe was diagnosed with muscular dystrophy, external 33 years ago and decided to run an online survey to highlight the difficulties faced when buying accessible clothes.\nIt received about 100 responses and found impractical clothing designs are not the only issue, with changing rooms also providing an issue for people with disabilities.\n\"Some shops are really difficult; they're very narrow,\" Ms Hawkins said.\n\"You get stuck between rails, things like that.\n\"They're too small, or there isn't anything wide enough to sit on to be able to try things on.\"\nWhen it comes to clothes, Ms Hawkins said an example of inaccessibility was an A-line skirt \"that rides up and shows more than you want necessarily\".\nShe added that pockets are sometimes placed in the wrong place, which makes them \"useless\", as items will fall out.\nMs Hawkins said one person told her \"just because we're disabled, we don't want to be dowdy\".\nShe added: \"The thing that struck me was how passionately people felt about it and how they wanted to choose and buy and wear clothes that made them feel good and represented themselves.\"\nMs Hawkins said she hoped to influence fashion designers to make modifications to their clothing to make them more accessible to people like her.", "url": "https://www.bbc.co.uk/news/articles/cdxq67ql5eeo"}