{"authors": ["Neve Gordon-Farleigh", "www.facebook.com"], "date_download": "2025-04-26 04:00:19", "date_modify": "2025-04-26 04:00:19", "date_publish": "2025-03-04 05:21:00", "description": "Ruth Martin says the race started in 1445 and has become \"quintessentially Olney\" since its revival.", "filename": "news_articles_c7890k1re2po_1745640019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/64e4/live/ebec9330-f865-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7890k1re2po_1745640019.html", "title": "Olney pancake race: How did a 550-year-old tradition start?", "title_page": "Olney pancake race: How did a 550-year-old tradition start? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The run itself dates back to 1445, external and while no-one knows how it started, it has taken place every year since it was revived in 1948.\nOne story suggests a housewife dashed to church after hearing the Shriving Bell while still clutching her frying pan and pancake.\nAnother suggests the gift of pancakes was a bribe to make the Shriving Bell ring sooner and signal the beginning of the day's holiday.\nThe Shriving Bell was, external rung on Shrove Tuesday in a bid to call people to church to confess.\nIn 1948, the vicar of Olney, the Reverend Canon Ronald Collins, decided to revive the tradition after he found old photographs of women running with frying pans, while clearing out a cupboard.\nHe called for volunteers to take part and 13 showed up on the day.\nKeeping the tradition alive, while the country was in the midst of the Covid-19 lockdown in 2021, a solitary pan-bearer took part so the consecutive annual run would not be broken.\nRuth Martin, one of the current organisers, says there are not many details of why the race started or the history behind it.\n\"I kind of love the [story of the] housewife running down the street. It's my favourite one and it sums up what we are doing... the madness of all these women running down the main road,\" she said.\n\"It's got to link back to something quite quirky.\"\nThe race is \"ladies only\" and is open to those, external aged 18 and over.\nRules state women need to have lived in Olney for at least three months or work there.\nIf you have won it three times you cannot enter again.\nIn last year's race, organisers said there was a \"record-breaking\", external field of 44 runners and this year they expected 42 participants.\nPeople taking part must come prepared with, external a skirt, frying pan and their own pancake and will be given a headscarf and apron before the race begins.\nOnce runners are lined up, they must toss their pancake at two points during the race, at the start and finish.\nImportantly, real pancakes are used during the race and Ms Martin said they were most certainly not glued to the pan.\n\"You can bring whatever pancake you like. You can make it yourself or you can buy it. It's entirely up to you,\" she said.\nShe said organisers did not take it \"that far\" and make sure everyone's pancake were the same.\n\"We give you the pan, so the pan is consistent.\"\nThe course, which is 415 yards (380m), starts as soon as the Shriving Bell is rung at St Peter and St Paul's.\nRunners start from the pedestrian crossing by the market and make their way to the church door.\nMs Martin, who has lived in Olney for more than four years, said the streets are lined with spectators three to four deep.\nShe said: \"It's just something that's quintessentially Olney... I wanted to be part of the community when we moved here... everybody gets behind it and really loves it and some people take it really seriously.\n\"It's our thing and it just feels really special. When you look at the pictures... it's so fantastic to be carrying it through generations.\"\nThe event is sponsored and any money raised goes to support the church which turns 700 years old this year.\nAfter the race, competitors gather for the Shriving Service at Olney's parish church, external.\nAfter the race made a comeback in 1948, Nellie Bosworth was the first winner, and since then, several women have won the race three times.\nMs Martin said last year's Olney winner was able to complete the course in 63 seconds.\nDuring the 40-minute church service, the winner's presentation takes place, with the first place runner receiving a prize of £100.", "url": "https://www.bbc.co.uk/news/articles/c7890k1re2po"}