{"authors": ["Farouk Chothia", "www.facebook.com"], "date_download": "2025-04-26 06:13:28", "date_modify": "2025-04-26 06:13:28", "date_publish": "2025-03-02 03:04:28", "description": "Scandal surrounds King Misuzulu's attempts to take a third wife - and to divorce his first one.", "filename": "news_articles_cx2e63930qxo_1745648008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5d35/live/5739e5d0-f630-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2e63930qxo_1745648008.html", "title": "Zulu King Misuzulu's love life shocks South Africa as he opts for divorce", "title_page": "Zulu King Misuzulu's love life shocks South Africa as he opts for divorce - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The love life of South Africa's Zulu king has the country agog - and has scandalised his socially conservative subjects as he messes with tradition by seeking a divorce.\nPolygamy is part of Zulu culture, but King Misuzulu kaZwelithini has taken the unusual step of going to court to divorce his first wife, Queen Ntokozo kaMayisela.\n\"Everyone was puzzled. People were not expecting the king to go so far as to file for divorce,\" Prof Gugu Mazibuko, a cultural expert at South Africa's University of Johannesburg, told the BBC.\n\"In Zulu culture, there is no divorce. You are not supposed to chase away your wife,\" she said.\nRegarded as the \"lion of the nation\", the Zulu king is the custodian of age-old traditions that place marriage and polygamy at the heart of royal success.\nHis role within South Africa may only be ceremonial, but he remains hugely influential, with a yearly government-funded budget of several million dollars.\nThe monarch - who grew up in neighbouring Eswatini, studied in the US and came to the throne in 2021 - seems to court controversy.\nHis coronation was challenged in court by his elder half-brother, who has been trying to snatch the crown from him.\nHis second marriage appears to be shaky, his attempt to take a third wife hit the buffers and there are also reports of another dalliance with a young princess.\nHowever, the 50-year-old's troubled personal life used to be discussed in hushed tones - that is until he filed divorce papers in December.\nProf Mazibuko acknowledged that historical records appeared to suggest that a Zulu monarch in the 20th Century had divorced one of his queens, but it had been a \"top royal secret\", given royal divorce is not the norm.\n\"If a marriage does not work out, the wife will still live in the king's homestead. She will be given her own space. She will not have a relationship with the king, but she and her children will be well-cared for.\"\nIt was just before his accession to the throne - following the sudden death of his father and mother four years ago - that the then-Prince Misuzulu married Ntokozo Mayisela.\nThe two were already a couple and had two children together, but according to another cultural expert, Prof Musa Xulu of the University of Zululand, the decision to marry appeared be be hurried.\n\"It seems as though he felt he could not be a king without a wife,\" he told the BBC.\nQueen kaMayisela came from an \"ordinary family\" - as many of the wives of Zulu kings do - in a small mining town in KwaZulu-Natal province.\nIt was as a cabaret singer performing at a restaurant in the coastal city of Durban that she caught the royal eye, the academic said.\nHer senior status in the family was made clear at the king's state coronation in December 2022 when she sat by his side.\nBut her position is now under threat, with the monarch saying in court papers that they have not lived as husband and wife for at least year and their marriage has irretrievably broken down.\nThe palace followed this by sending out invitations for the king's wedding to a new bride, Nomzamo Myeni, set to take place in late January. The bride-price, known as lobola, had already been paid in cattle - a prized asset in Zulu culture.\nQueen kaMayisela did not take any of this lying down, instituting separate court action to halt the wedding, which was postponed as a result.\nHer argument was that the king - known to his subjects as \"Ingonyama\", meaning Lion - would be committing the offence of \"bigamy\" without first \"converting\" his civil marriage to her into a traditional Zulu marriage.\nBut the judge threw out her case, saying she had had a \"turnaround\" in attitude as she had already agreed her husband could take other wives.\nHe noted the monarch had already done so - marrying Nozizwe kaMulela, the MD of Eswatini Bank, in 2022.\nProf Mazibuko explained that polygamy was not initially part of Zulu culture, in fact the first two kings were bachelors.\nBut it was embraced by their successors - King Misuzulu is the ninth monarch of the Zulu nation - and has become part of Zulu culture.\n\"That's how we build families, especially the royal family,\" Prof Mazibuko said.\nQueen kaMulela comes from an influential family in Eswatini and the marriage was apparently arranged to strengthen the ties between the royal families.\nYet it is unclear whether the pair are still in a relationship, as the high-powered banker has not been spotted at Zulu cultural events for a while - with speculation their final marriage rituals have not been completed.\nThe current king's various marriage problems seem to stem from the fact that tradition has not been properly followed.\nIn the case of the first wife, he opted for a modern-day marriage, without a traditional wedding.\n\"For a marriage to be perfected under Zulu custom, there has to be a public gathering, with song and dance,\" Prof Xulu said.\n\"You, as the bride, must lead with a solo song and the bride-maids dance with you, and you carry a spear which you give to the king - and then there is no going back.\"\nThis has left Queen kaMayisela without the protection of tradition - and only the offer of monthly maintenance of $1,100 (£850) for a year, though she was likely to demand more before returning to the life of a commoner, Prof Xulu said.\nIn the case of the second wife, the academic said lobola had been paid in January 2022, but royal insiders suggest the king felt \"those who went to pay didn't have the authority to do so\" - plus this union has not been marked with a public ceremony.\nThe fortunes of the would-be third wife, Nomzamo Myeni, remain unclear as the king failed to marry her in January despite the court giving the go-ahead.\nProf Xulu said that in Zulu culture a \"postponed\" marriage usually never takes place.\nThough Ms Myeni is still being seen with the king, accompanying him to a state event last week where she was referred to as a queen, external, suggesting their wedding may take place once the king's divorce goes through.\nYet as a commoner she would bring no powerful connections with her, which may be why one of the monarch's aides recently confirmed to local media there was \"a new queen-to-be\" - Sihle Mdluli, who hails from the royal family of a small ethnic group in South Africa.\nProf Xulu said he would not be surprised if at some point a powerful rival faction within the royal family launched a fresh bid to dethrone him by asking the courts to rule that he is not \"fit and proper\" to be king.\nThe monarch's half-brother, Prince Simakade Zulu, who is the late king's eldest son, has long coveted the crown, but his backers were outmanoeuvred by Misuzulu's allies in succession discussions.\nPresident Ramaphosa later gave Misuzulu a \"certificate of recognition\", paving the way for him to be funded by the government.\nBut Prince Simakade's supporters did not give up - going to the High Court to declare his state coronation \"unlawful\" - and won.\nThe court ruled that President Ramaphosa had failed to comply with the law, which required him to order an investigation into objections to Misuzulu's accession.\nThe status quo remains, pending the outcome of an appeal.\nThe scandals have the potential to weaken the king's position should it come to another tussle for the crown.\nThough Prof Mazibuko noted there had always been fierce competition for the Zulu crown - except these days it takes place in court instead of a bloody battlefield.\n\"He is not the first king to go through a lot,\" she said. \"I hope he survives, and everything settles down.\"", "url": "https://www.bbc.co.uk/news/articles/cx2e63930qxo"}