{"authors": ["Sarah Smith", "www.facebook.com"], "date_download": "2025-04-26 07:25:50", "date_modify": "2025-04-26 07:25:50", "date_publish": "2025-02-27 22:56:17", "description": "\"What a beautiful accent,\" the US president said of the British leader. Sarah Smith breaks down their White House meeting.", "filename": "news_articles_c1kjj032d8do_1745652350.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/72cf/live/1646fa20-f56f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjj032d8do_1745652350.html", "title": "Starmer charms Trump, but any deals will have to wait", "title_page": "Analysis: Starmer charms Trump, but any deals will have to wait - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "In Donald Trump's White House, the vibes really matter. The personal relationships he develops with other leaders can affect how those nations are treated.\nSo it was vital for British Prime Minister Keir Starmer to not only master the details of their discussions on Thursday but also to build a rapport with the US president.\nThe invitation from King Charles clearly set the right tone. Trump looked truly flattered that he would become the first person to enjoy a second state visit to the UK.\n\"And that's a great honour, because it's never happened before,\" the US president said at the start of their joint news conference. \"I really do call it an honour, but it's not for me, it's for our country. It's respect for our country.\"\nBut the very diplomatic language deployed by Sir Keir over the war in Ukraine – like praising Trump for creating the conditions in which a ceasefire is being discussed – could not disguise significant disagreements over what a peace deal may end up looking like.\nWhile Trump says he feels he can trust Russian President Vladimir Putin to stick to any deal, Sir Keir talked of the need to make sure that any truce endures and does not favour the aggressor.\nThe prime minister's message about increasing defence spending in the UK was clearly very welcome - but he did not walk away with any commitment from the US to participate in ongoing security guarantees for Ukraine once a peace deal has been signed.\nThe two men first met in the Oval Office just before lunch. But the friendly body language and warm atmosphere of that moment did not seem quite so pronounced when they emerged after lengthy talks about three hours later.\n\"You are a very tough negotiator… I'm not sure I like that, but okay,\" Trump told Sir Keir as they appeared before reporters after their meeting. And he did not seem to be entirely joking.\nOn the prospect of trade tariffs being imposed on UK exports to the US, the prime minister did seem to have made some progress.\nTrump said Sir Keir had worked hard and \"earned whatever they pay him over there\" in making the case for a trade deal between the two countries instead. That would count as a significant victory for Britain, though any proposed deal would inevitably require lengthy and detailed negotiations.\nBefore this meeting it was unclear how the Labour leader's serious and sober demeanour would go down with the bombastic American president.\nBut carefully worded praise and flattery set the tone for the PM's first visit to the White House, with Sir Keir saying next to his US counterpart that \"the UK has a true friend in the Oval Office\".\nAnd he was speaking Trump's language when he highlighted how the two countries were ranked one and two in the world as investment destinations, and for golfers too.\nTrump responded enthusiastically to the promise of a new chapter in an historic partnership. \"What a beautiful accent,\" he quipped when the prime minister finished his remarks. \"I'd have been president 20 years ago if I had that accent.\"\nThere also appeared to be genuine respect toward the president over the issues on which the two leaders see eye to eye. On other significant matters, they seemed to have agreed to disagree. Which is probably as much as Sir Keir could hope for.\nTomorrow it is Volodymyr Zelensky's turn in the Oval Office. A week after Trump called him a dictator, he distanced himself from that description - and his opinion of the Ukrainian president seemed to have softened.\n\"I think we're going to have a very good meeting tomorrow morning. We're going to get along really well.\"", "url": "https://www.bbc.co.uk/news/articles/c1kjj032d8do"}