{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 07:04:44", "date_modify": "2025-04-26 07:04:44", "date_publish": "2025-02-28 06:40:05", "description": "National Grid says it is moving the project to its \"preferred\" location in Kent.", "filename": "news_articles_c3w11djn022o_1745651084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c34d/live/d55d5870-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w11djn022o_1745651084.html", "title": "National Grid gets backing to move energy from Suffolk to Kent", "title_page": "National Grid gets backing to move energy from Suffolk to Kent - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "National Grid will proceed with moving a major energy project away from Suffolk after it got backing from a regulator.\nOfgem previously said the Nautilus project, external should be built in the county, due to cost constraints.\nHowever, National Grid proposed to move the project, which would see a new subsea cable between the UK and Belgium, to its preferred location in the Isle of Grain in Kent.\nFollowing agreement from Ofgem and the independent National Energy System Operator (NESO), National Grid said it would press ahead with the move.\nGareth Burden, construction director of National Grid Ventures, explained the Isle of Grain had \"always been\" its preference for Nautilus.\n\"Now that Ofgem has approved this location, we can release Nautilus' connection in Leiston,\" he said.\n\"We have no plans to build Nautilus in Suffolk or to use the connection agreement for an alternative project.\"\nAccording to National Grid, Nautilus could connect up to 1.7 gigawatts (GW) of offshore wind to each country through a subsea cable.\nA final decision over whether it can be built will be made by the government and if approved, it could power 1.4 million UK homes.\nThe decision to move Nautilus to Kent meant a convertor station planned close to Saxmundham will no longer be built.", "url": "https://www.bbc.co.uk/news/articles/c3w11djn022o"}