{"authors": ["Daniel Sandford", "www.facebook.com"], "date_download": "2025-04-26 03:48:38", "date_modify": "2025-04-26 03:48:38", "date_publish": "2025-03-05 14:34:27", "description": "Zhenhao Zou raped 10 women in the UK and China, but police fear it may be a fraction of his crimes.", "filename": "news_articles_c8rkj8k6my8o_1745639318.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7aaf/live/b31d4a50-f9db-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkj8k6my8o_1745639318.html", "title": "'Depraved and cowardly’ rapist Zhenhao Zou may have attacked 50 more women", "title_page": "'Depraved and cowardly’ rapist Zhenhao Zou may have attacked 50 more women - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Warning: This article contains distressing details and descriptions of rape\nWhen he was arrested in January 2024, serial rapist Zhenhao Zou was living on the 39th floor of an expensive block of London flats with views across the city.\nA PhD student from China, he had been studying at University College London (UCL) and was paying more than £4,000 a month in rent.\nPolice found his bedroom had been equipped with hidden cameras and discovered a wardrobe stocked with alcohol, ecstasy and an industrial chemical that the human body turns into the \"date rape\" drug GHB. He had a pipette for carefully measuring doses of the dangerous liquid.\nBut detectives also found 1,277 videos on his electronic devices. At least some were filmed by Zou showing him raping unconscious women.\nThe footage had been filmed in both the UK and China. Police were able to charge him with multiple assaults on women in both countries - including the rapes of women who have never come forward and have never been identified.\nDuring his trial at Inner London Crown Court, jurors had to watch footage found on Zou's devices of nine of the rapes. Zou, now 28, claimed he had been sleeping with five different women a month and taking cocaine, ketamine, ecstasy and what he called \"liquid E\" - the \"date rape\" drug GHB.\nHe admitted that having sex with unconscious women was one of his fantasies, but he claimed the women in the videos found on his phone and cameras were \"acting\" - helping, he claimed, to bring his rape fantasies to life in exchange for money and gifts.\nHowever, the jury ultimately decided he was a serial rapist who had been drugging young women and filming the attacks.\nZou has now been found guilty of 11 rapes of 10 different women - two who have been identified and another eight who have yet to be traced - across two different continents.\nDetectives say they fear he may have raped as many as 50 more women.\n\"This man may well turn out to be one of the most prolific sexual predators that we've ever seen in this country,\" Commander Kevin Southworth, from the Metropolitan Police, told the BBC.\nMany of the women he raped were completely unconscious. One - who we are calling Ms L - said she woke up to find Zou raping her before she drifted back into unconsciousness. Another - who we are calling Ms N - only discovered Zou had secretly filmed himself raping her when detectives found the video in his flat, eight months after she had first reported him.\n\"I think he is a devious and Machiavellian individual,\" Commander Southworth told the BBC.\nHe said Zou would meet women socially, or through social media, and then take them back to his flat where he would ply them with drink laced with drugs.\n\"He would commit those sexual assaults while they're incapacitated and possibly even while they're asleep and completely unaware,\" added Commander Southworth.\nZou - who comes from Dongguan City, in southern China, close to Hong Kong - grew up in a wealthy family who owned several properties in China and were able afford the hefty fees for his higher education in the UK. His nickname was Pakho, the name some of the women he later raped knew him by.\nAt the age of 20 he moved to Northern Ireland to finish the final two years of his mechanical engineering degree at Queen's University, Belfast (QUB).\nIn September 2019, he then moved to London to study a Masters in mechanical engineering at UCL, but returned to China the following year during the Covid-19 pandemic.\nWhile there, in November 2020, he used an obscure messaging app to download what amounted to an instruction manual on how to drug and rape young women. One advert police found on his phone had the words \"effects guaranteed\" splashed across pictures of sleeping, naked women.\nOn his telephone police also found seven videos of him raping women in China. They were referred to in court as Females B, C, D, E, F, G, H. Five of the women looked completely unconscious in the videos. One, Female G, appeared to wake briefly while Zou was raping her, but struggled to maintain consciousness. Female H could be heard snoring.\nAnother woman, Female D, was unconscious when the rape began but came round and repeatedly told Zou \"please, no\", while trying to fight him off. The videos were so disturbing that the judge, Rosina Cottage KC, made sure the jurors watched them as little as possible. Detectives have not been able to track down the women in China.\nAlthough some of his victims were raped in China, Zou could be put on trial in the UK because he was resident here.\nSaira Pike, from the Crown Prosecution Service, said it was important to bring justice for the unknown females who Zou could be seen raping in videos.\n\"It was really important that we fight for them,\" she said. \"I was determined to go forward with that and not use the fact that we couldn't identify the females as a deterrent from getting justice for them.\"\nBut Zou did not only rape women in China.\nTwo of the most distressing videos showed the rape of Female A at Zou's student accommodation in Bloomsbury, central London. Police have never been able to establish who Female A is, and it is unclear if she was raped before or after Zou's trip to China during the pandemic.\nAt the start of the first video, Female A was seen to be unconscious, but woke and pleaded with Zou to stop. \"I hate you,\" she can be heard saying.\n\"It's pointless,\" Zou replied. \"The sound insulation here is very good.\"\nThe second video is similar. Both had been filmed on a tiny spy camera the size of a thumb, placed on a shelf on the other side of the room.\nWhen detectives first found the videos they could not extract the sound. At first Zou insisted the woman in the video was fully consenting to sex. But just before the trial, detectives managed to recover the sound, showing Female A was clearly under the influence of drugs or alcohol, and that she was begging him to stop.\nZou then changed his story, telling the jury it was \"rape role play\" and the young woman had been acting.\n\"Zou is plainly a depraved and cowardly individual who's preyed on his victim survivors in the most despicable manner,\" Commander Southworth said.\nPolice have never been able to trace Female A. However, two women did give evidence against Zou during the trial.\nMs N, a young Chinese student, described how she first met Zou in May 2023. He had been helping her with maths. A few days later, they both went to a party at another flat in his luxury block, the UNCLE building, in Elephant and Castle. After the party, he persuaded her to go back to his flat where he plied her with drinks.\nThe court heard Zou then dragged her into his bedroom where he raped her.\nSome of their conversation in the flat was recorded on a spy camera beside Zou's bed, which was triggered by a motion sensor.\n\"Finish the drink,\" Zou kept saying on the video. \"Finish the drink. It should not be wasted.\"\nMs N does not remember much after drinking the large glass of vodka. She reported the rape to the police soon afterwards, but unsure of the law, and she says discouraged by the officers' response - including a poor translation of her 999 call - she decided not to pursue the allegation.\nThe Metropolitan Police have said it was regretful victims did not get the best translation. \"There is undoubtedly some learning from the first response that these victims received,\" Commander Southworth added.\nEight months after Ms N first spoke to police, detectives contacted her again, telling her they had found the videos of Zou plying her with drink, and photographs on his phone showing her being raped.\nZou was found guilty of 11 charges of raping 10 women, three counts of voyeurism, three counts of possessing a controlled drug with intent to rape, and one count of false imprisonment.\nThe jury found him not guilty of charges of possessing MDMA, Ketamine and Xanax with intent to rape. They also found him not guilty of two charges of possessing extreme pornography depicting rape.\nCommander Southworth added: \"We have video evidence of as many as potentially 50 further victim survivors who we are desperate to trace so that we can establish what has happened to them.\"\n\"Such is the insidious nature of this offending, I think there is a possibility that many more victim survivors may not even know that he has raped them,\" he added.\nDetectives are asking any woman who may have spent any time alone with Zou - whether in China or in the UK - to come forward.", "url": "https://www.bbc.co.uk/news/articles/c8rkj8k6my8o"}