{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:38:11", "date_modify": "2025-04-26 03:38:11", "date_publish": "2025-03-05 01:11:24", "description": "A row over remarks by US Vice-President JD Vance about peacekeepers for Ukraine makes headlines on Wednesday.", "filename": "news_articles_cx28geez0x1o_1745638691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0873/live/c6d53130-f95d-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28geez0x1o_1745638691.html", "title": "'Vance's slur' and 'Entry level hosting'", "title_page": "Newspaper headlines: 'Vance's slur' and 'Entry level hosting' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Time for a look at the papers.\nMany lead on Volodymyr Zelensky's message on social media yesterday, aiming to salvage his relationship with Donald Trump. The Daily Mail says the Ukrainian leader has offered an \"olive branch\" to the US president. \"Zelensky bows to Trump pressure\" is the Daily Telegraph's take. The Financial Times says Kyiv has shown \"contrition\", and is ready to sign a minerals deal with Washington. The Times says Sir Keir Starmer advised Zelensky to do everything he could to rebuild relations. The I paper leads on the the Defence Secretary, John Healey, flying to Washington to meet his US counterpart on Thursday, to attempt to rescue ceasefire plans.\nThe Daily Express says British military veterans have called the US Vice-President, JD Vance, a \"clown\", external for his comments about a potential European peacekeeping force for Ukraine, made up of what he called \"random countries\" that had not fought a war in 30 or 40 years. \"How dare you\" , externalsays the Daily Mirror. The Daily Star calls him \"JD Dunce\", external, and points out that \"636\" British soldiers died in Afghanistan and Iraq while fighting alongside the US. Writing in The Sun, the author and former SAS soldier, Andy McNab, says the vice-president's comments are an \"insult\" to those \"killed on active duty\". Vance says he did not mention the UK in his remarks.\nThe Guardian highlights a report that suggests almost one in 10 women who died at the hands of men in the UK over the past 15 years were killed by their sons. The study examined 2,000 legally completed cases and gathered data from freedom of information requests to police - as well as media reports. The minister for violence against women and girls, Jess Phillips, tells the paper that the report highlights \"the appalling scale of femicide\".\nAccording to the Times, experts from University College London say that replacing \"five-yearly health checks\" for over 50s with a daily pill could reduce the risk of heart attacks and strokes, external. Their editorial, published in the British Medical Journal, argues that offering a \"polypill\" - which combines a statin and three blood pressure drugs - could work better as a preventative strategy. The authors highlight previous research estimating that such a tablet could prevent about 80% of heart attacks and strokes in people aged over 55. The British Heart Foundation tells the Times it's \"too early to call for polypills to replace the NHS health check\".\nMany of the papers carry pictures of the King aboard a Royal Navy aircraft carrier. The Daily Telegraph says it's the first time in almost 40 years that a monarch has visited a British warship at sea, external. The Sun says King Charles III told personnel gathered in the hangar of HMS Prince of Wales that their deployment came \"amidst new challenges in an everchanging and more unpredictable world\". The I says the King was \"jovial\" and wore \"military uniform\" to inspect sailors, and that he watched a fighter jet land on the deck. Buckingham Palace said the visit was not linked to the geopolitical situation, and that the monarch's diary was planned months in advance.", "url": "https://www.bbc.co.uk/news/articles/cx28geez0x1o"}