{"authors": ["Angie Brown", "www.facebook.com"], "date_download": "2025-04-26 06:57:44", "date_modify": "2025-04-26 06:57:44", "date_publish": "2025-02-28 13:58:31", "description": "It is is among dozens of images of the royal family which have gone on display in Edinburgh.", "filename": "news_articles_c3e44gynj5wo_1745650664.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ddc5/live/e2230d60-f5d2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e44gynj5wo_1745650664.html", "title": "Andy Warhol screenprint of Queen Elizabeth II goes on display in Edinburgh", "title_page": "Andy Warhol screenprint of Queen Elizabeth II goes on display in Edinburgh - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A screenprint of the late Queen Elizabeth II by artist Andy Warhol is among dozens of images of the royal family which have gone on display in Edinburgh.\nRoyal Portraits: A Century Of Photography is due to run until 7 September at The King's Gallery in the Palace of Holyroodhouse, having previously been exhibited at Buckingham Palace.\nThe exhibition chronicles the evolution of royal portrait photography from the 1920s until the coronation of the King in 2023, with more than 90 prints, proofs and documents from the Royal Collection and the Royal Archives.\nMany images are being shown in Scotland for the first time and all the photographs are original vintage prints.\nThe earliest surviving colour print of a member of the royal family was taken by Madame Yevonde, a pioneer of the craft in 1935, showing Princess Alice, Duchess of Gloucester - and sister-in-law to King George VI and Edward VIII - on her wedding day.\nAmong the photographs in the exhibition are those taken to mark milestone birthdays, including \"coming of age\" images of Princess Anne to mark her 21st birthday in 1971, which were taken by Norman Parkinson in Frogmore House gardens.\nSome of Cecil Beaton's most memorable photographs taken over 60 years are on show, including original coronation portraits of Queen Elizabeth II.\nA dramatic image of her in the countryside at Balmoral taken by Julian Calder in 2010 shows her wearing the mantle of the Order of the Thistle and was inspired by paintings of clan chiefs.\nThe Queen Mother's famed 1939 shoot in Buckingham Palace gardens, dressed in gowns designed by Norman Hartnell, is also on display.\nImages of Princess Margaret, taken by her husband Lord Snowdon before and after their marriage in 1960, form another section of the exhibition.", "url": "https://www.bbc.co.uk/news/articles/c3e44gynj5wo"}