{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:18", "date_modify": "2025-05-19 15:38:18", "date_publish": "2015-02-09 14:37:05", "description": "Confidentiality was fundamental to an examination of a UVF murder on the streets of Belfast, the High Court is told.", "filename": "news_uk-northern-ireland-31306101_1747669098.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79259000/jpg/_79259341_bobby_moffett.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31306101_1747669098.html", "title": "Bobby Moffett murder: Confidentiality 'fundamental' in IMC report", "title_page": "Bobby Moffett murder: Confidentiality 'fundamental' in IMC report - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Confidentiality was fundamental to an examination of a UVF murder in Belfast, the High Court has been told.\nBobby Moffett, 43, was shot dead on Belfast's Shankill Road in May 2010.\nLawyers for the secretary of state said those who co-operated with a body that probed the killing received privacy guarantees.\nThe victim's sister wants a judge to direct that all information gathered by the Independent Monitoring Commission be given to the coroner for an inquest.\nThe IMC, which is now defunct, scrutinised paramilitary activity in Northern Ireland.\nMonths after the murder, which happened in front of shoppers and children, the IMC issued a special report declaring his murder was sanctioned by the UVF's leadership.\nThe international body concluded that Mr Moffett was targeted due to his perceived flouting of UVF authority, and to send a message to the organisation and the community that this authority was not to be challenged.\nIn its report the commission described the killing as a public execution, but declined to say that it amounted to a breach of the terror grouping's ceasefire.\nSo far only an edited version of the report has been supplied for the purposes of holding an inquest.\nMr Moffett's sister, Irene Owens, is seeking a judicial review that would compel the secretary of state to release the dossier in full.\nHer lawyers argue that anything less undermines the coroner's ability to oversee a human rights-compliant inquest.\nThey contended that the IMC only reached its conclusion following a thorough investigation.\nAccording to their case, significant documentation was compiled on firm conclusions about who planned, sanctioned and carried out the murder.\nThe commission has been constrained from revealing everything it found out, it was claimed.\nHowever, in court on Monday counsel for the secretary of state set out reasons why full disclosure had not taken place.\n\"The premium placed on confidentiality in this context has been described by the Independent Monitoring Commission itself as fundamental to its work,\" the lawyer said.\n\"Though it's now defunct, that's a principle that lives on.\"\nHe said assurances given to those who participated were legally underpinned.\n\"There's the strongest legitimate expectation on the part of those who participated in these enterprises that the confidentiality guarantees would be maintained.\"\nThe lawyer also confirmed the secretary of state reconsidered the situation after legal proceedings were initiated, but decided to maintain the position.\nThe case continues.", "url": "https://www.bbc.com/news/uk-northern-ireland-31306101"}