{"authors": ["Matthew Hill", "www.facebook.com"], "date_download": "2025-04-26 03:48:20", "date_modify": "2025-04-26 03:48:20", "date_publish": "2025-03-05 14:56:17", "description": "A doctor who has seen more than 21,000 patients is one of a number from overseas, figures show.", "filename": "news_articles_ckgz30m192jo_1745639300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3c0/live/960fb4c0-f8dc-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgz30m192jo_1745639300.html", "title": "How migrant workers are saving the NHS from crisis", "title_page": "How migrant workers are saving the NHS from crisis - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New figures show hospitals across the West Country are being kept running partly thanks to migrant workers.\nAbout 25% of staff at Bristol's Southmead and Swindon's Great Western Hospital are from overseas. This equates to about 1,375 jobs in GWH and 3,250 roles in Southmead, according to NHS data.\nHealth chiefs have said they are \"extremely grateful\" to oversea workers who fill vacancy gaps across the NHS.\nOphthalmologist Dr Amey Tamhane is one of thousands of migrant staff who have joined Somerset NHS Foundation Trust in recent years, and has since cared for more than 21,000 patients.\nHe moved his family to Yeovil in 2019 after being recruited in India. He said the experience had been \"smooth\".\nDr Tamhane, a father-of-two, said: \"The hospital in general has helped me a lot in terms of my clinical workload as well as the management part regarding the visas and immigration so it was really beneficial for me to progress in my career.\"\nNew data shows 23% staff are from overseas at Royal United Hospital in Bath and at Somerset NHS Foundation Trust. Meanwhile at Gloucestershire Hospitals, the figure is 17%.\nIt is worth noting the figures are self-reported by staff but do give a good indication of nationalities.\nEm Wilkinson-Brice, director for staff experience and leadership development for NHS England, said they wanted to get the \"balance\" right and that work was ongoing to train people domestically.\n\"We are an incredibly diverse country and that's reflective in our workforce too and I am so very glad we have so many internationally educated staff working in our NHS,\" she said.\n\"There is an ambition to make sure we have got the balance right so that we are domestically recruiting and training.\"\nMs Wilkinson-Brice added that she wanted to make sure the door was always open to people from abroad.\n\"There will be a refresh of the long-term workforce plan ... Of course we want to make sure we have got good training routes for people from the UK but we would always want to make sure we are welcoming of people from overseas,\" she said.\nThere are signs that recruiting doctors from abroad may be reducing.\nYeovil hospital has been responsible for international recruitment across the south west of England for several years. The hospital has just decided to step back from recruiting for the region, instead leaving it up to individual hospitals.\nDanny Mortimer, chief executive of NHS Employers, said: \"Health services in the South West and across the UK are hugely grateful to colleagues from around the world who have chosen to work in NHS services and teams.\n\"The new government has confirmed that it will update the workforce plan this year published under the previous administration which set out plans to grow domestic training numbers across all professions, including medicine, to support its ten-year plan for health.\"", "url": "https://www.bbc.co.uk/news/articles/ckgz30m192jo"}