{"authors": ["Enda McClafferty and Finn Purdy", "www.facebook.com"], "date_download": "2025-04-26 08:08:36", "date_modify": "2025-04-26 08:08:36", "date_publish": "2025-02-26 13:35:10", "description": "The secretary of state defended the government's decision to explore the possibility of formal engagement.", "filename": "news_articles_c1enzy4jzx2o_1745654916.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/45e6/live/65f20dd0-f439-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1enzy4jzx2o_1745654916.html", "title": "Paramilitaries 'won't be paid to leave'", "title_page": "Paramilitaries 'won't be paid to leave' - Hilary Benn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Northern Ireland Secretary Hilary Benn has insisted paramilitaries will not be paid by the government to \"disband\".\nBut he defended the government's decision to explore the possibility of formal engagement with paramilitary groups.\nIn a joint move, London and Dublin are to appoint an independent expert to assess whether there is merit in beginning a process which could bring about the disbandment of paramilitary groups.\nIt followed a recommendation from the Independent Reporting Commission (IRC) which was set up to monitor paramilitary activity.\nTUV leader Jim Allister also criticised the plan in the House of Commons on Wednesday describing the independent expert as the \"nursemaid for paramilitaries\".\nHe claimed such groups had \"taken successive governments for a ride\" over talk of transitioning and \"pocketed millions along the way\".\n\"When is this pandering going to come to an end?\" he asked.\nSDLP leader Claire Hanna also questioned the move and warned against a \"pay day for paramilitaries\".\nBut Benn ruled out any potential payoff for paramilitary groups.\nHe told MPs: \"There is no question of paying anybody any money to disband.\"\nHe also defended the decision to appoint an independent expert to carry out a \"scoping exercise\" to find out if it was worth having a formal engagement process.\n\"The fact is that 26 years after paramilitaries should have left the stage they are still here and are still causing harm to communities,\" he said.\n\"The proposal from the IRC is to go and inquire are there some who do want to leave the stage and if there is merits in having a process.\"\nNaomi Long said that formal engagement has been tried before and \"has not worked\".\nSpeaking on the BBC's Talkback programme, the Alliance leader said the situation now is \"a number of organised groups who have transitioned themselves into organised crime\".\n\"Our response has to take account of that,\" she said.\nShe added that the suggestion that the government might enter formal engagement with these groups would \"give them a form of legitimacy that they would not offer for example to a burglar, to a drug dealer, to an extortionist, to a racketeer, to a fraudster\".\nFollowing a meeting with Benn on Wednesday, Tánaiste Simon Harris said they would proceed with appointing an independent expert to carry out a scoping exercise.\nHarris said it would assess \"whether there is merit in, and support for, a formal process of engagement to bring about paramilitary group transition to disbandment\".\n\"We stressed our common understanding that there is no predetermined outcome to this work, that the process is in no way about providing funding to paramilitary groups, and that policing and criminal justice efforts to tackle paramilitary and organised crime of course need to be maintained in full,\" Harris added.\nEarlier, Mitchell Reiss, a former US Special Envoy to Northern Ireland and a commissioner on the panel of the IRC, said that paramilitarism had \"proved more persistent and pernicious\" than people imagined at the time of the 1998 Good Friday Agreement.\nDescribing paramilitarism as a \"blight on certain communities\", he said that it had continued to impact economic growth and a \"sense of a shared community\" in Northern Ireland.\nHe said that \"transition has not worked in its current configuration\".\nReiss said that the direct engagement would enable an \"[assessment] of these group's willingness to disband\", adding that it would be a \"scoping exercise\".\nHe said the IRC's hope was that this process of engagement \"will come back with a recommendation to the governments as to whether or not they want to set up a formal negotiating process that can move these people off the pitch\".\n\"It's more complicated than them just going away, as wonderful as that would be.\"\nReiss said the IRC has been \"consistently clear that we're not talking about paying people to go away\".\nUlster Unionist Party MLA Doug Beattie said that paramilitaries \"shouldn't exist\".\nHowever, he said that the people in these groups are \"people who want to do something positive for their community\", people who are \"inactive\" and \"those who want to line their pockets with money and criminality\".\n\"The reality then... is there has to be different ways of dealing with these groups.\"\nBeatie said that the government's approach should involve \"policing and justice\" alongside \"community transition\".", "url": "https://www.bbc.co.uk/news/articles/c1enzy4jzx2o"}