{"authors": ["Marcus White", "www.facebook.com"], "date_download": "2025-04-26 08:09:25", "date_modify": "2025-04-26 08:09:25", "date_publish": "2025-02-26 13:16:59", "description": "First Bus workers begin further walkouts in Portsmouth, Fareham and Gosport.", "filename": "news_articles_cy83x2g27e1o_1745654965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5470/live/147ec760-f108-11ef-9208-a935898fa355.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83x2g27e1o_1745654965.html", "title": "More bus strikes in pay and conditions dispute", "title_page": "Hampshire: More bus strikes in pay and conditions dispute - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bus workers have begun more strikes in a dispute over pay and conditions.\nFirst Bus Solent services in Portsmouth, Fareham and Gosport have been affected by a series of walkouts since December.\nThe Unite union said bus services would be \"close to zero\" from 25-27 February, 3-7 March and 10-11 March.\nIn January, Unite said drivers and supervisors had voted to reject a \"two-year pay deal worth 4.8% in the first year\".\nDespite the rejection, First Bus paid the increase to staff from Sunday.\nIt said: \"Our people deserve a pay rise, and they have been waiting since August last year while negotiations have taken place with Unite.\n\"This is part of a pay offer that represents a 35.9% pay increase since 2021, which is significantly ahead of inflation.\n\"The implementation of this pay deal in no way interferes with our ongoing collective bargaining arrangements with Unite on pay, and we will engage with them again in future negotiations.\"\nHowever, Unite accused the firm of trying to impose the deal.\nGeneral Secretary Sharon Graham said: \"To pay barely above the minimum wage for a skilled and high-pressure job is utterly unacceptable.\n\"To now attempt to impose a pay deal already rejected by our membership is an act of desperation and cowardice.\"\nThe union has also accused First Bus of using \"the threat of fire and rehire to take the terms and conditions\" from staff during the Covid pandemic.", "url": "https://www.bbc.co.uk/news/articles/cy83x2g27e1o"}