{"authors": ["Elaine Dunkley", "Kate McGough", "www.facebook.com"], "date_download": "2025-04-26 06:30:26", "date_modify": "2025-04-26 06:30:26", "date_publish": "2025-02-27 10:29:17", "description": "The latest figure of 987,000 16-24-year-olds not in work, education or training has risen by 110,000 in a year.", "filename": "news_articles_c5ymvnrn0deo_1745649026.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b11f/live/bae809d0-f4e2-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymvnrn0deo_1745649026.html", "title": "Number of young people not in work or education hits 11-year high", "title_page": "Number of young people not in work or education hits 11-year high - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More young people were not in work, education or training at the end of 2024 than at any point in the past 11 years, new data suggests.\nThe latest Office for National Statistics (ONS) figures suggest 987,000 16-24-year-olds were not in work, education or training between October and December.\nThat is 13.4%, or almost one out of every seven people in that age range.\nThe government says every young person will be given the chance to \"earn or learn\" under its Youth Guarantee initiative.\nYoung men are more likely than young women to be not in education, employment or training (Neet), according to the latest ONS estimates.\nIn October to December 2024, an estimated 14.4% of all male 16-24-year-olds were Neet, compared with 12.3% female.\nBut numbers overall are rising too.\nThe October to December 2024 figure of 987,000 was up by 110,000 in a year.\nAt a community centre in Toxteth, Liverpool, Niall, 22, tells BBC News he sees many of his friends \"throwing their potential away\", as he did from the age of 16 to 20.\nNiall became Neet after getting in with the \"wrong people\", he says.\n\"I'd go out partying or doing drugs, spending time just doing drugs to try and escape,\" he says.\n\"So obviously I had to get off all that stuff.\"\nYoung people have too few community centres and often grow up around those not \"doing the right things\", Niall says.\nOn universal credit while he looks for work, Niall has been inspired by those who helped him to become a youth worker himself.\n\"I feel great about the future now,\" he says.\n\"I wouldn't enjoy going back to that lifestyle now, because I know what comes of it.\n\"I've put so much work into myself now that I want to build something.\"\nYoung people not in employment can be unemployed - which means they are actively seeking work - or defined as economically inactive - meaning they are not seeking work.\nMost young people who are Neet fall into the economically inactive category, with 595,000 young people economically inactive in the latest stats, compared to 392,000 who were unemployed.\nThose working with young Neet people say poor mental health is one of the key issues preventing them finding work.\nIn 2023, almost one out of every five (19.5%) had a mental-health condition, according to the latest yearly Department for Education figures.\nThe King's Trust charity, founded by King Charles III when he was Prince of Wales to help young people find a job or start a business, published its annual Youth Index survey on Thursday.\nMost of the 4,285 16-25-year-olds across the UK surveyed in November and December felt anxious about their future on a daily basis.\nAnd of the 460 who were Neet:\nalmost one out of every three (31%) said they would like to work but poor mental health prevented it\none out of every two (50%) said being unemployed made them feel hopeless about the future\nalmost one out of every five (19%) said they were applying for jobs every day without success\nEvery year, the Merseyside Youth Association helps more than 5,000 young people gain life skills and qualifications.\nThey are resilient and aspirational but facing an increasingly complex range of barriers to work, Gill Bainbridge, who has been the chief executive for over a decade, says.\nAnd around half of those on the charity's Talent Match programme, which aims to help young Neet people into work or training, have special educational needs.\n\"You might have a young person who is on the autistic spectrum, who also struggled with their mental health, who therefore has low confidence,\" Ms Bainbridge says.\n\"They haven't then succeeded in school, so it becomes a multi-layered set of issues that you really need to work at with a young person in the long term to start to unravel and address it step by step.\"\n\"Unfortunately, young people who are not looking for work are not going to be in contact with the job centre,\" she says.\n\"There's significant scarring effects for young people when they're out of work or education long-term.\n\"And it's also important for the government's economic growth goals to get more young people in work and helping to grow the economy.\"\nThe government recently relaxed some of the rules around apprenticeships for young people - but Dr Barry would like to see it guarantee that Level 2 or 3 apprenticeships will be available to them.\nMore supported internship and help for schools and colleges to prepare young people for work could also help bring Neet numbers down, she says.\nA Department for Work and Pensions official said it was \"determined that no young person gets left behind\".\n\"Our Get Britain Working White Paper will transform job centres and will ensure every young person is given the opportunity to earn or learn through our Youth Guarantee, while we significantly expand mental-health support for young people,\" they said.", "url": "https://www.bbc.co.uk/news/articles/c5ymvnrn0deo"}