{"authors": ["Richard Daniel", "Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:00:03", "date_modify": "2025-04-26 04:00:03", "date_publish": "2025-03-04 05:30:06", "description": "Sue MItchell says corpses are not being collected and the authorities \"need to take action\".", "filename": "news_articles_cx2eqw550npo_1745640003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a484/live/bd0d7570-f851-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eqw550npo_1745640003.html", "title": "Oulton Broad resident fears bird flu behind dead swans", "title_page": "Oulton Broad resident fears bird flu behind dead swans - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A wildlife enthusiast is concerned bird flu could be behind the deaths of several swans near an inland waterway and testing needs to be carried out.\nAt least four carcasses have been found at Oulton Broad near Lowestoft, Suffolk, over the past three weeks, which Sue Mitchell feared could be a result of the disease.\nShe reported the birds to the Department for Environment, Food and Rural Affairs (Defra), but it had not been able to get to the birds.\nEast Suffolk Council told the BBC its teams would collect them and inform Defra afterwards.\n\"They said they would collect it and test it, or at least the first one, but it hasn't happened,\" Ms Mitchell said.\nHowever, she was told that due to the location of the birds close to the water, Defra's teams would be unable to access them.\nShe was instead encouraged to contact the council, but feared if the birds were not collected and had died of bird flu, it could spread to others.\n\"They need to take action; they ask the public to report it,\" she said.\n\"There's people having their whole flocks of chickens culled because of bird flu and then we've got these instances here and nobody is acting at all.\"\nPaul Rice is the yacht station manager for the council at Oulton Broad and said the swan population numbers had recently increased.\nHe was aware of the reports, but had not received any request \"to deal with them in the way we normally would with bird flu\" and could not comment on their cause of death without tests.\n\"The swans that I've seen, especially the ones in this area which we see on a regular basis, look as healthy as I've ever seen them,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cx2eqw550npo"}