{"authors": ["Antonia Matthews", "www.facebook.com"], "date_download": "2025-04-26 04:17:35", "date_modify": "2025-04-26 04:17:35", "date_publish": "2025-03-04 07:15:45", "description": "Residents were evacuated and people in neighbouring windows advised to close windows.", "filename": "news_articles_c89yexggpq4o_1745641055.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b2c/live/b012ee60-f908-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89yexggpq4o_1745641055.html", "title": "Cardiff large blaze engulfs Riverside supported accommodation", "title_page": "Cardiff large blaze engulfs Riverside supported accommodation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents were evacuated after a large blaze broke out at a supported accommodation unit.\nSouth Wales Fire and Rescue Service said it was called to a large fire at the unit run by not-for-profit organisation and housing provider Pobl in the Riverside area of Cardiff just before midnight on Monday.\nNobody was injured, but all 21 residents were evacuated during the blaze, in which parts of the roof of the building were damaged.\nNeighbours on Fitzhamon Embankment were also advised to close windows and doors as smoke was blown towards Cardiff Bay.\nCrews left the scene in the early hours of Tuesday, with an investigation now taking place.\nLorraine Griffiths, assistant director of Pobl, said while they were disappointed about the damage to their building, everyone was \"safe and well\".\nDirector of support Nick Taylor added: \"We can confirm that Dyfrig House, our supported accommodation service on Fitzhamon Embankment in Cardiff was evacuated overnight on Monday 4th, Tuesday 5th March, due to a fire on the premises.\n\"All 21 residents were successfully evacuated to a nearby scheme managed by Pobl and have now been rehoused with support from the local authority.\"\nHe thanked emergency services and said it was too early to say when residents may be able to return.", "url": "https://www.bbc.co.uk/news/articles/c89yexggpq4o"}