{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:04:05", "date_modify": "2025-04-26 08:04:05", "date_publish": "2025-02-26 16:05:45", "description": "David Lupton denies murdering Rhys Howell with a knife at their shared flat in Skegness last August", "filename": "news_articles_cly35kvn8j2o_1745654645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4734/live/9bcc6310-f457-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly35kvn8j2o_1745654645.html", "title": "Murder accused acted in self defence Lincoln Crown Court told", "title_page": "Murder accused acted in self defence Lincoln Crown Court told  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man accused of murdering his flatmate has told a jury he was defending himself from a machete attack.\nDavid Lupton, 60, is alleged to have repeatedly slashed at Rhys Howell, 57, with a knife which he kept next to his bed at their shared home in Skegness.\nLincoln Crown Court heard Mr Howell died from a stab wound to the heart and was found slumped against a wall outside the property in Grosvenor Road on 19 August.\nThe prosecution claim Mr Lupton was not acting in reasonable self defence and lost his temper with his flatmate.\nGiving evidence Mr Lupton said that on the day of his death Mr Howell made a number of visits to his top-floor flat after losing his keys.\nDuring the final occasion he claimed Mr Howell pushed him and tried to punch him.\n\"I launched a counter punch, the palm of my hand,\" Mr Lupton said, \"and held him down, to stop him attacking me.\"\nHe told the jury a few moments later Mr Howell returned and burst into his room.\n\"I saw a machete coming at my head with Rhys stood behind it,\" he said.\n\"The first one was a big swing then he was continually going at me with the machete.\n\"I just lashed out, I was in shock, attempting to get him away.\"\nMr Lupton said he managed to push Mr Howell backwards.\n\"I looked for something to defend myself and saw the knife on the headboard,\" he said.\n\"I held the knife out in front of me so he could get a clear look at it and see I was armed,\" Mr Lupton said. \"But it had no effect. I was fending the blows off from the machete.\"\nMr Lupton said the incident lasted no longer than 30 seconds and ended when Mr Howell dropped the machete and went down the first floor stairs.", "url": "https://www.bbc.co.uk/news/articles/cly35kvn8j2o"}