{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:57:59", "date_modify": "2025-05-19 14:57:59", "date_publish": "2015-02-27 10:45:34", "description": "A man who was found guilty of raping a young boy at a nursery and of sexually abusing a girl is jailed for eight years.", "filename": "news_uk-scotland-highlands-islands-31656934_1747666679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80676000/jpg/_80676440_80676439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-31656934_1747666679.html", "title": "Man who raped three-year-old boy at nursery jailed", "title_page": "Man who raped three-year-old boy at nursery jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A man who was found guilty of raping a young boy and sexually abusing a girl has been jailed for eight years.\nMark Maclennan, 30, of Bath, also admitted possessing and taking indecent images of children.\nThe boy, who was three at the time, was raped at a nursery in the Lochaber area where Maclennan had worked.\nThe girl was abused on numerous occasions in Stirling, Dunblane and Dunfermline, when she was aged between 12 to 15.\nHe has been jailed at the High Court in Edinburgh.\nPolice Scotland and Highland Council have welcomed the sentence.\nJudge John Morris QC told MacLennan that the crimes had been of a \"particularly vile nature\" and that only a substantial prison sentence would be appropriate.\nHe added: \"Both of these young people were entitled to feel safe.\"\nThe judge said MacLennan's female victim had been profoundly affected and the parents of the little boy had expressed concerns about his subsequent behaviour.\nMacLennan, who was also found guilty of having thousands of indecent images of children on a laptop that he donated to the nursery, was placed on the sex offenders' register indefinitely.\nA charge of sexually abusing a girl at the nursery when she was aged between four and five was found not proven by the jury.\nDuring the trial at the High Court in Glasgow in January a taped interview with the boy was played to the jury.\nIn the video recording the three-year-old was questioned by police officers about the incident and said: \"Don't like Mark.\"\nThe rape happened some time between 1 August 2012 and 23 May 2013.\nThe girl, who is now 19, said Maclennan touched her on a number of occasions over a period of almost three years, including at a pantomime costume fitting. The abuse happened between October 2007 and July 2010.\nDet Insp Alicen Winston, of Police Scotland's public protection unit, said: \"This case initially came to police attention following the bravery displayed by the family of a child victim who reported Mark Maclennan, then working at a private nursery in the Highland area, to social work services.\n\"This matter was then subsequently reported to Police Scotland.\n\"The resulting police investigation identified a number of other young victims and established a sickening course of conduct involving sexual abuse and the collating of indecent images involving children.\"\nBill Alexander, director of care and learning at Highland Council, added: \"You cannot underestimate how difficult and traumatic this must have been for parents to face such disclosures from their children and report these to the authorities.\n\"Their bravery enabled swift and effective action by authorities to prevent this man from continuing to harm children.\n\"Fortunately, experiences like this are rare, and there are safeguards in place. But we all need to remain vigilant, as people who abuse children may actively seek to get themselves into positions of trust.\"", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-31656934"}