{"authors": ["Christian Fuller", "www.facebook.com"], "date_download": "2025-04-26 06:41:48", "date_modify": "2025-04-26 06:41:48", "date_publish": "2025-03-02 12:20:52", "description": "Robin Sider BEM was first elected to represent Shepperton as a councillor in 1999.", "filename": "news_articles_c2019qvw1w0o_1745649708.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11a9/live/bde62580-f6cd-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2019qvw1w0o_1745649708.html", "title": "Spelthorne: Tributes paid following death of former mayor", "title_page": "Spelthorne: Tributes paid following death of former mayor  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tributes have been paid following the death of a former mayor in Surrey.\nRobin Sider BEM was first elected to represent Shepperton as a councillor in 1999 and held the position until his retirement in 2023.\nHe was elected mayor of Spelthorne in 2002 and again in 2012.\nPaying tribute, Spelthorne Borough Council leader Joanne Sexton said Mr Sider was a \"true local legend\".\nMr Sider held a number of community roles, including governor at The Matthew Arnold School in Staines, president of Spelthorne Schools Sports Association and chair of a scout group in Shepperton.\nIn 2014, he was awarded the British Empire Medal (BEM) for services to the Shepperton community.\nHe was also made an honorary aldermen of the borough of Spelthorne in 2023 for his service and dedication to Spelthorne, the council said.\nMs Sexton said Mr Sider was a \"true champion for Shepperton and Spelthorne\".\nShe said: \"Even after stepping down from his role, his passion never faded as he continued to support local groups and good causes with the same warmth and generosity that defined him.\n\"His legacy will live on in the community he loved so much.\"\nCouncil chief executive, Daniel Mouawad, added: \"He was to many, Mr Shepperton.\"\nThe council's flag will be flown at half-mast in tribute.", "url": "https://www.bbc.co.uk/news/articles/c2019qvw1w0o"}