{"authors": ["Angus Cochrane", "www.facebook.com"], "date_download": "2025-04-26 04:31:51", "date_modify": "2025-04-26 04:31:51", "date_publish": "2025-03-03 06:07:22", "description": "For the first time, Syrians fleeing civil war have a chance of returning home. But do those settled on Bute want to?", "filename": "news_articles_c4gezvjnn4jo_1745641911.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f2d9/live/f98eeb70-f78c-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gezvjnn4jo_1745641911.html", "title": "'We can finally return to Syria, but this island is our home'", "title_page": "'We can finally return to Syria, but this island is our home' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bute, a small island off Scotland's west coast, has welcomed more than 100 Syrian refugees over the past decade.\nFleeing civil war, they ended up more than 2,000 miles away in Rothesay, a sleepy town of 4,000 people.\nThey have raised children and set up successful businesses, with many now UK citizens.\nThe fall of Bashar Al-Assad's regime in Syria last year has given those who fled a glimmer of hope of returning.\nBut it has also posed the question of where home truly lies.\nThe first group of Syrian refugees arrived in Rothesay, Bute's largest settlement, in December 2015.\nSince then the town has welcomed 125 Syrians, with 17 babies born to those families.\nMounzer Darsani arrived in February 2016 with his wife and children.\nHe was forced to leave behind his barbershop, the Orient Salon, in Damascus following the outbreak of war in 2011.\nWhen he arrived in Scotland the food and culture was alien. His English was limited to a few basic phrases and he didn't even know what an \"island\" was.\nHe also carried the trauma of a war which led to the deaths of more than half a million people, and forced 12 million to flee.\n\"Many people died in jail when I was there, many people killed in the street - for nothing,\" Mounzer says.\n\"Even now I can't imagine I am here.\"\nAlthough Assad was toppled by rebel forces last year, fighting continues in parts of the country, with infrastructure ruined and a stable future far from certain.\nMounzer quickly settled in Scotland with the help of locals in Rothesay - former strangers he now considers \"family\".\nThe barber runs two salons, one on Bute and one on the mainland in Greenock. Both are named Orient Salon.\nFor the first time since 2011, he is planning to return to his homeland - not a permanent move, but a visit to reunite with relatives he has not seen in more than a decade.\nMounzer wants to show his children the place where he once had a \"beautiful\" life.\n\"My kids have all their lives here,\" he says. \"They came too young and they don't have any memories [of Syria].\"\nHaving become a popular holiday resort in the early 19th century, the Isle of Bute once had a population of about 12,000. It is now home to about 6,500 people, with 4,000 in Rothesay.\nYoussef Al Najjar arrived in 2017 after fleeing Aleppo with his wife Khadijeh and son Taim, now aged nine.\nSince then the family has welcomed Jad, now six, and Laureen, now four - both born and raised in Scotland.\nYoussef, a chef, says his children are \"very happy\" in Rothesay.\n\"Everybody is very friendly... I never have any problems,\" he tells BBC Scotland News.\nIn the centre of the town stand the handsome ruins of Rothesay Castle, surrounded by a moat.\nWalking along the shore, or climbing high up the slopes rising from the harbour, a sense of stillness is unescapable. A safe haven, separated by water from the outside world.\nIt's a perception repeatedly raised by the island's Syrian contingent - Bute is quiet, and most importantly, safe.\nYoussef lost two sisters-in-law and a cousin in the civil war.\n\"I'm not going back to Syria because lots of my family died there,\" he says. \"My kids were born here, and we're very happy here.\"\nMost of the Syrian refugees who came to Bute have moved on, many relocating to Inverclyde or Glasgow.\nAbout 35 have happily settled, including Yahya Fasi, 25, who fled Damascus as a child with his parents and two siblings.\n\"I left my friends and my school,\" he says. \"It was very painful for me.\"\nYahya has taken over the running of Helmi's bakery, a much-loved shorefront café set up by former refugees Tasnim Helmi and her husband Mohamed, who have since expanded the business to the mainland.\nYahya arrived during the pandemic in 2020. Since then he has worked as a barber, baker and football coach, while making and selling artwork on the side.\nThe first shock was the weather, he says, though he loved the ferry - the only way on or off the island.\nUnderlining his local credentials, he now gripes about cancellations and delays.\n\"People here are so friendly,\" Yahya says. \"And that's the main reason why we love Bute.\"\nLike many young Syrians, he struggles to see a future to return to in his homeland.\n\"All my life is here now,\" he says. \"It's very hard to go to Syria and build again.\"\nFreezing rain greeted the first batch of refugees taking the ferry from Wemyss Bay to Rothesay in December 2015.\nFortunately, locals proved more accommodating.\n\"There was a lovely welcome for the people arriving here,\" says Angela Callaghan, who runs Bute Oasis, a second-hand shop and food bank.\n\"You just cannae imagine what they've been through.\"\nYet there were undoubtedly grumbles from some in the community about the new arrivals, prompting an excoriating editorial in The Buteman newspaper condemning \"narrow-minded bigotry\".\n\"Ninety-five percent of people on the island were very happy to welcome them, and that wee 5% were a bit iffy,\" says Angela. \"But they aren't any more.\"\nShe says the Syrians won over any unsure neighbours \"through their kindness\".\n\"They welcomed their neighbours, they asked them in for something to eat,\" Angela tells the BBC. \"It's the way that they do things - family orientated.\"\nResidents in Rothesay are quick to speak of their pride in the Syrians.\nThey have become \"locals the same as anybody else\", Angela adds.\nReflecting on his time on Bute, Mounzer says a decade of happy memories have helped him cope with the horrors of war.\n\"I am too lucky because I have two countries, two citizenships, and I can live anywhere I want,\" he says.\n\"But I prefer here because my best time I spent here, with very good people.\"", "url": "https://www.bbc.co.uk/news/articles/c4gezvjnn4jo"}