{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:43:43", "date_modify": "2025-05-19 14:43:43", "date_publish": "2015-02-14 23:58:09", "description": "Foreigners will be banned from owning land in South Africa under new proposals outlined by President Jacob Zuma.", "filename": "news_world-africa-31471427_1747665823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80976000/jpg/_80976359_80976335.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31471427_1747665823.html", "title": "South Africa's Zuma outlines land reform plans", "title_page": "South Africa's Zuma outlines land reform plans - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Foreigners will be banned from owning land in South Africa under new proposals outlined by President Jacob Zuma.\nLocals will have limits set on the size of their farms under the proposals.\nMr Zuma first announced them in a state of the nation speech on Thursday overshadowed by violence in parliament.\nTwo decades after the end of apartheid, land is still concentrated in the hands of a largely white minority, and remains a sensitive issue.\nThe government is under growing pressure to put more land in the hands of the country's black majority.\n\"Land has become one of the most critical factors in achieving redress for the wrongs of the past,\" said Mr Zuma, elaborating on the plans on Saturday.\n\"In this regard, the regulation of land holdings bill will be submitted to parliament this year.\"\nIn the future, foreigners will only be allowed to lease land, not to own it, he said, adding that local farmers would not be able to own more than 12,000 hectares.\nThat is presumably aimed at white farmers who still own much of the best farmland a generation after the end of racial apartheid, says the BBC's Andrew Harding in Johannesburg.\nThere are many reasons for the slow pace of change in the country, says our correspondent, and these new proposals will face strong legal challenges from farmers who argue that smaller plots will not be commercially viable.\nBut the governing African National Congress is looking for votes, and is wary of being outflanked by more radical voices calling for white-owned land to be seized without compensation, he adds.", "url": "https://www.bbc.com/news/world-africa-31471427"}