{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:51:35", "date_modify": "2025-05-19 14:51:35", "date_publish": "2015-02-26 05:34:24", "description": "The UN's human rights chief warns that Myanmar's treatment of minorities and free expression is undermining recent reforms.", "filename": "news_world-asia-31635566_1747666295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81250000/jpg/_81250054_81250052.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31635566_1747666295.html", "title": "United Nations warns on Myanmar reform 'set back'", "title_page": "United Nations warns on Myanmar reform 'set back' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The UN's human rights chief has warned that Myanmar's treatment of minorities and suppression of free speech is setting back its political reforms.\nZeid Ra'ad al-Hussein said Myanmar (also known as Burma) was continuing to jail critics and quash peaceful protest despite promising to stop.\nHe warned politicians against fanning the \"flames of prejudice\" to win votes in the coming election.\nA quasi-civilian government took power in 2011 after decades of military rule.\nThe UN rights chief said that the transition was seen by the world \"as a story of promise and hope\".\n\"But recent developments relating to the human rights of minorities, the freedom of expression and the right to peaceful protest are calling into question the direction of that reform and even threatening to set it back,\" he said.\nHe cited the persecution of Myanmar's Rohingyas, a Muslim minority group, and a case last week when 14 members of the Michuankan community were jailed for peacefully protesting against the alleged confiscation of their land by the military.\n\"Myanmar had promised to end the era of political prisoners, but now seems intent on creating a new generation by jailing people who seek to enjoy the democratic freedoms they have been promised.\"\nHe also raised concern over the recent violent clashes between the military and rebels in the north-eastern Kokang region, where more than 130 people have been killed.\nTies between Myanmar and UN rights officials have been tested in recent weeks.\nMyanmar has accused Yanghee Lee, the UN's special rapporteur on Myanmar, of interfering in its internal affairs after she highlighted discrimination against Rohingyas.", "url": "https://www.bbc.com/news/world-asia-31635566"}