{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 04:19:27", "date_modify": "2025-04-26 04:19:27", "date_publish": "2025-03-04 06:16:42", "description": "Liverpool City Council hopes to boost the economic fortunes of the oldest Chinatown in Europe.", "filename": "news_articles_cj67rl2wrkpo_1745641167.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e7b1/live/cff87ce0-f877-11ef-a40e-1dcee1447ad7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj67rl2wrkpo_1745641167.html", "title": "Liverpool Chinatown revamp plan consultation opens", "title_page": "Liverpool Chinatown revamp plan consultation opens - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A plan to revamp and improve Liverpool's 200-year-old Chinatown has been put out for public consultation.\nThe city-centre neighbourhood has seen declining fortunes in recent years with reduced footfall - partly attributed to the effects of the pandemic - and stalled developments.\nLiverpool City Council said it hoped planned improvements, including a centrepiece of two stone lions donated by the Chinese Consulate General in Manchester, would increase visitor numbers.\nThe council will host a community information event at The Black-E event centre on Great George Street between 10:00 and 15:00 GMT.\nPlanned work also includes providing better pedestrian access, making improvements to a children's playground, and creating a commemorative memorial garden.\nThere will also be a red maple wishing tree and a flower mat near the two lions.\nMing Wang, secretary general of the Merseyside Chinese Association Joint Action Group, said: \"We look forward to witnessing the transformation of our beloved Chinatown, more footfall to Chinatown, followed by better business, more investment and more visitors from around the world.\"", "url": "https://www.bbc.co.uk/news/articles/cj67rl2wrkpo"}