{"authors": ["Grace Dean", "www.facebook.com"], "date_download": "2025-04-26 04:04:25", "date_modify": "2025-04-26 04:04:25", "date_publish": "2025-03-03 19:06:32", "description": "Author Chimamanda Ngozi Adichie tells the BBC's Emma Barnett about her experience of writer's block.", "filename": "news_articles_c89yp2xjzjko_1745640265.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/420e/live/5bb0cef0-f854-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89yp2xjzjko_1745640265.html", "title": "Chimamanda Ngozi Adichie on 'terrifying' writer's block during pregnancy", "title_page": "Chimamanda Ngozi Adichie on 'terrifying' writer's block during pregnancy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chimamanda Ngozi Adichie says the writer's block she experienced after becoming pregnant with her first child was \"terrifying\".\n\"It's a really frightening place to be, because writing is the thing that gives me meaning,\" the acclaimed Nigerian author, 47, tells the BBC's Emma Barnett.\n\"I'm not sure that it was just entirely physiological but something changed, and I just could not get back into that magical place where I can write fiction.\"\nAdichie had her first child, a daughter, in 2016. Last year, she had twin boys, now 11 months old.\nWhile she was pregnant, she had a \"very foggy feeling\" and \"couldn't think as clearly,\" she says.\n\"I'm a person for whom thinking clearly is so important, and so to be in that kind of place emotionally is very frightening,\" she says.\nAdichie is now releasing her first novel in more than a decade, Dream Count.\nThe book tells the story of four women navigating lives that aren't going to plan.\n\"I couldn't write for a while, and then I started writing again,\" she says.\nAdichie is known for work that explores themes including feminism, gender and immigration. The novelist's 2012 Ted Talk We Should All Be Feminists helped push her to greater prominence, and was even sampled by Beyoncé on her 2013 song Flawless.\nIn a wide-ranging interview with the BBC, she speaks about topics including parenthood, grief and artificial intelligence (AI).\nAdichie's beliefs about gender have led her to reflect on how she'd like to bring up her sons. \"I'm determined to raise good men,\" she says.\n\"I want to raise my boys to be emotionally comfortable, to be in touch with emotion, to not be afraid of emotion, and also to not be afraid of fear,\" she continues.\nCompared to girls, Adichie believes boys don't have many \"wholesome\" role models. \"This space is just occupied by noxious characters and ideas,\" she says.\nThe writer adds that she wants her sons to be \"the kind of boys that never start a fight but if you bring a fight to them, they will beat you up\".\nAs well as having her three children, since writing her last novel, Adichie has also lost both of her parents.\n\"Grief recedes but only in waves and then, at some point, it comes back,\" she says.\nAdichie was surprised by how physical grief felt. \"Your heart really is very heavy, you feel as though your body is somehow no longer able to carry the weight of your heart,\" she says.\nThe novelist says that grieving for her mother, who died suddenly on her father's birthday in 2021, had a role in shaping her new novel.\nWhen she started writing the book - after her mother died - \"I did not think I was writing about my mother,\" she says. But when she had nearly finished, she reread the manuscript and realised there was \"so much about mothers and daughters\" in it, even though she hadn't been conscious of this while writing.\n\"I felt very strongly that, in some ways, my mother had opened the door for me to get back into this magical place that means that I can write fiction,\" Adichie says. \"I kind of thought that she's comforting me, and it was actually deeply emotional for me to make that realisation.\"", "url": "https://www.bbc.co.uk/news/articles/c89yp2xjzjko"}