{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:51:35", "date_modify": "2025-05-19 14:51:35", "date_publish": "2015-02-13 03:43:57", "description": "Nearly 50 soldiers are killed in three days of fighting between government troops and Kokang ethnic rebels in Myanmar, state media report.", "filename": "news_world-asia-31450420_1747666295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80978000/jpg/_80978837_98079218.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31450420_1747666295.html", "title": "Myanmar clashes with rebels 'kill 47 soldiers'", "title_page": "Myanmar clashes with rebels 'kill 47 soldiers' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nearly 50 soldiers have been killed in a week of fighting between government troops and Kokang ethnic rebels in Myanmar, state media report.\nThe Global New Light of Myanmar newspaper said air strikes had been used in the response to the flare-up in Shan state, near the Chinese border.\nThe BBC's Myanmar correspondent, Jonah Fisher, says it is the heaviest fighting in at least two years.\nIt comes as the government tries to sign a peace deal with rebel groups.\nThere are reports that thousands of people have been leaving the area to escape the fighting.\nChina said on Tuesday that some people had crossed over into its southern Yunnan province, and that they were being looked after.\nAnalysis: Jonah Fisher, Myanmar correspondent\nThe Kokang are a Han Chinese ethnic group, and their armed wing a remnant of the Burmese Communist Party which fragmented in 1989.\nFor years they have run a largely autonomous strip of land on Myanmar's north-eastern border with China.\nThis dramatic upsurge in fighting appears to have been triggered by the return of one of their leaders - Phone Kya Shin - from five years of exile in China.\nIn 2009, Phone Kya Shin was forced to flee by Burmese troops - but he has now returned promising to restore the rights of the Kokang people.", "url": "https://www.bbc.com/news/world-asia-31450420"}