{"authors": ["Kelly Morgan & Sophie Parker", "www.facebook.com"], "date_download": "2025-04-26 03:57:15", "date_modify": "2025-04-26 03:57:15", "date_publish": "2025-03-04 14:17:01", "description": "The 5km event, the first in the South West, started off with just 30 runners – now there are more than 400.", "filename": "news_articles_c0kg3yz74nxo_1745639835.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a26/live/b50e8890-f852-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg3yz74nxo_1745639835.html", "title": "Parkrun in Swindon celebrates 15 years with 430 runners", "title_page": "Parkrun in Swindon celebrates 15 years with 430 runners - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Almost 430 runners and 66 volunteers came out to celebrate the 15th anniversary of a town's parkrun.\nLydiard parkrun in Swindon – one of many free, Saturday morning-timed 5km runs across the world – was the first to start in the South West.\nOne of Lydiard's directors, Emma Sperring, helped set up the first event and is still volunteering 15 years later. \"People are passionate about it,\" she said.\nOn Saturday, which was marked with balloons and cake, one runner was completing a 400th run and another a 300th – with many more recording their personal bests.\nThe runs are timed – although walking is allowed – with participants collecting a token at the end which is used to give them their time.\nOne woman taking part on Saturday said: \"I started running when I was 50 and parkrun was part of that.\n\"It introduces you to the running world and I'm now a member of a running club. It just opens up a world of staying fit and healthy in an endurable way.\"\nOver the past 15 years, Lydiard parkrun, external has had 26,130 participants who have covered a distance of 1,135,500 km, or more than 700,000 miles.", "url": "https://www.bbc.co.uk/news/articles/c0kg3yz74nxo"}