{"authors": ["Claire Quinn", "www.facebook.com"], "date_download": "2025-04-26 03:44:52", "date_modify": "2025-04-26 03:44:52", "date_publish": "2025-03-05 06:36:10", "description": "UNTOLD: The Museum has unveiled plans to create a state-of-the-art museum across two sites in Belfast and Enniskillen.", "filename": "news_articles_c07zd81vnz8o_1745639092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ab1/live/47056d40-f907-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zd81vnz8o_1745639092.html", "title": "New museum hopes to tell heritage of Irish in the British Army", "title_page": "New museum hopes to tell heritage of Irish in the British Army - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new museum hoping to tell the 350-year history of Irish soldiers and their families in the British Army has been awarded £250,000 from the National Lottery Heritage Fund.\nUNTOLD: The Museum has unveiled plans to create state-of-the-art centres across two sites in Belfast and Enniskillen.\nThe Belfast galleries are set to open in the summer of 2027 in the restored listed linen warehouse at 28 Bedford Street in Belfast.\nA second phase will focus on redeveloping the existing galleries at Enniskillen Castle.\nArtefacts which are currently housed across six individual collections, including Victoria Crosses, will now be consolidated as part of the project.\nThese include the Inniskillings Museum, Royal Irish Fusiliers Museum, Royal Ulster Rifles Museum, Royal Irish Regiment Museum, Collections and Archives of the Royal Irish Regiment, and Collections and Archives of the North Irish Horse.\nDisbanded regiments from what is now the Republic of Ireland will also be included in the story.\nAnnouncing the Heritage Fund support, Hugh Crossey, chairman of UNTOLD: The Museum said it would \"hopefully inspire people to see things differently and make meaningful connections across generations\".\n\"Education will be at the heart of all the exhibitions, offering our visitors the chance to explore the lives of the Irish men and women who rose above divisions of class, politics and religion and overcame extremes of hardship to make an indelible mark on our history,\" he said.\nDr Laura Patrick, the regimental heritage officer of the Royal Irish Regiment, said she and her colleagues wanted to \"address a difficult conversation\" and look at the \"human experiences behind the often facelessness of the British Army\".\n\"What did the soldiers sign up for, why did they sign up, what did they do, and what did they come home to because that wasn't always the most pleasant experience for a lot of them especially in the south,\" Dr Patrick said.\n\"We want to create a space with people for people – a safe space for them to come and debate and explore this fascinating and difficult story.\n\"It's just about using that rather unique heritage to explore what we have in common as opposed to what separates us for a change which is always an issue here in Northern Ireland.\n\"It's about education and it's about preserving that heritage for future generations.\"", "url": "https://www.bbc.co.uk/news/articles/c07zd81vnz8o"}