{"authors": ["Dominic Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:02:29", "date_modify": "2025-04-26 04:02:29", "date_publish": "2025-03-04 01:25:07", "description": "Levels look set to accelerate rapidly, particularly in lower-income countries.", "filename": "news_articles_cy87d2g81yxo_1745640149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a397/live/8a5263c0-f842-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy87d2g81yxo_1745640149.html", "title": "More than 50% of adults predicted to be obese by 2050 worldwide", "title_page": "More than 50% of adults predicted to be obese by 2050 worldwide - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than half of all adults and a third of children, teenagers and young adults around the world are predicted to be overweight or obese by 2050.\nThe findings come in a new study of global data published in The Lancet, external journal, covering more than 200 countries.\nResearchers warn that obesity levels are predicted to accelerate rapidly during the remainder of this decade, particularly in lower-income countries.\nHowever, experts say that if governments take urgent action now, there is still time to prevent what they describe as a \"profound tragedy\".\nBy 2021, almost half the global adult population - a billion men and 1.11 billion women aged 25 or older - were overweight or obese.\nThe proportion of both men and women living with these conditions has doubled since 1990.\nIf trends continue, global rates of overweight and obese adults would rise to about 57.4% for men and 60.3% for women by 2050.\nIn terms of raw numbers, China (627 million), India (450 million) and the USA (214 million) will be the countries with the biggest populations of overweight or obese people in 2050.\nHowever, population growth means that forecasters are predicting the number in sub-Saharan Africa will rise by more than 250% to 522 million.\nNigeria, in particular, stands out, with the predicted number projected to more than triple - from 36.6 million in 2021 to 141 million in 2050. That would make it the country with the fourth-largest population of adults who are overweight or obese.\nThe authors acknowledge the study does not take into account the impact that new weight loss medications might have - and they could play a significant role in the future.\nExperts say if governments take urgent action now, there is still time to prevent what could be a disaster for vulnerable healthcare systems.\nThe research was led by Prof Emmanuela Gakidou, from the Institute for Health Metrics and Evaluation (IHME), at the University of Washington in the US.\nShe said: \"[Governments] can use our country specific estimates on the stage, timing, and speed of current and forecasted transitions in weight to identify priority populations experiencing the greatest burdens of obesity who require immediate intervention and treatment, and those that remain predominantly overweight and should be primarily targeted with prevention strategies.\n\"The unprecedented global epidemic of overweight and obesity is a profound tragedy and a monumental societal failure,\" she added.", "url": "https://www.bbc.co.uk/news/articles/cy87d2g81yxo"}