{"authors": ["Magazine Monitor", "www.facebook.com"], "date_download": "2025-05-19 14:59:24", "date_modify": "2025-05-19 14:59:24", "date_publish": "2015-02-20 16:57:02", "description": "A collection of some of the best reads from the BBC News website this week.", "filename": "news_blogs-magazine-monitor-31488480_1747666764.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81109000/jpg/_81109738_weekendish_index_image.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_blogs-magazine-monitor-31488480_1747666764.html", "title": "Weekendish: The best of the week's reads", "title_page": "Weekendish: The best of the week's reads - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A collection of some of the best reads from the BBC News website this week, with an injection of your comments.\nFrozen food used to be disgusting. Even prisoners refused to eat it. That was until Clarence Birdseye had a lightbulb moment. He was on a fishing trip in Labrador. That place is cold, really cold. So cold that when he caught a fish and pulled it out of the water, it froze. When he thawed out the trout it was delicious - far better than usual. He worked out that it was to do with the speed of the freezing. A slow freeze allowed the hydrogen bonds of ice to form larger crystalline shapes. But a freeze that happened in seconds generated much smaller crystals that did less damage to the food itself. Clarence went on to be known as Captain Birdseye, made millions and changed the way we eat immensely.\nCreating Cold\nJohn Wojtowicz was a romantic - that's why he tried to rob a bank to finance his lover's gender reassignment surgery. \"This sounds like the kind of mad, crazy guy you wish you had met, but not in the bank,\" tweets Martyn Cox, external. As one of his terms for the release of his hostages, Wojtowicz demanded they deliver his wife from King's County hospital: \"His name is Ernest Aron. It's a guy. I'm gay.\" This was a pretty big deal in 1972. After a 14-hour siege Wojtowicz was eventually arrested and sentenced to 20 years in jail. Many tweeters said this should be made into a film. Well, it was. When the film Dog Day Afternoon was made about the event, John was still in prison. But he gave the money he got for his story to Aron, who finally had surgery and became Liz Eden. A Storyville documentary also followed him for 10 years.\nThe man who robbed a bank for love\nEarlier in the week we heard from people who pay the top rate of tax who are happy to pay it. The founder of the soap shop, Lush, says it was just too complicated to dodge tax. He spent three days trying to work out one avoidance scheme. That's three days he could have spent on his business. And the founder of Phones 4u says paying tax is a moral issue. They both agree that their attitude puts them in the minority of wealthy people. \"If there weren't so many shocking people these wouldn't be considered modern heroes, but they ARE\" tweets media audience researcher Jeremy Nye, external. In a similar vein, Chief Executive of a bike part distributor Dominic Langan tweets, external: \"It's like tax is optional?\" Politics professor Christopher May tweets, external that it's \"good that some higher rate tax payers distancing themselves from sociopaths who want benefits but not cost of state\".\nThe rich people who say they are happy to pay their taxes\nOmid says he is in the most beautiful prison in the world. He's an asylum seeker in a holding camp in Papua New Guinea. Until mid-2013, Omid was a journalist in Iran. He fled the country under the threat of arrest, paying traffickers a small fortune to take him to Australia. He set off from Indonesia, heading for Christmas Island, a tiny Australian territory. When he got there he was relocated to an overcrowded detention centre on Manus Island in Papua New Guinea, where he has been stuck for the last 18 months. Omid is not alone - about 1,000 asylum seekers are detained on Manus. The policy is controversial and that was reflected in reactions on Facebook, external. Sandip Koley points out that \"every Australian is a migrant except aboriginal people\" while Bev Regan replies \"I'm 5th generation Aussie from pom heritage and I take offence to be labelled a migrant\".\nAustralia's 'beautiful prison' in Papua New Guinea\nThis week people in some countries ate pancakes in preparation for the beginning of Lent. In Brazil, meanwhile, people prepared by putting on the biggest party in the world. One person from the UK auditioned to dance in the Carnival parade in Rio de Janeiro, and got in. She learnt a lot of Portuguese in her training, including \"adhesive bras\", \"blister tape\" and even \"camel toe\". But then \"ice-packs\", \"anti-inflammatories\", \"physiotherapy\" and, worst of all, \"total inactivity\". Yep, she fell in Samba. Which amused her Brazilian friends, because \"fall in Samba\" can also mean to fully let go and dance wildly to the music. Once they stopped marvelling at the poetry of it they took her to an Ubanda healer who communicated with the spirits on her behalf. Credit to the spirits or to her physiotherapist, that week she was dancing again - with just two weeks to regain fitness for the parade.\nConfessions of a British Carnival dancer\nHow times change. There used to be protests against Tesco stores opening. Now there are protests against Tesco stores closing. Following a decline in market share (still a hefty 29%) and an accounting scandal, Tesco said it will close 43 shops and scrap plans to open another 49. Jon Kelly went to one of these 49 ghost shops in Chatteris, Cambridgeshire. A day after the article was published there was a protest in Kirkcaldy over the closure of their Tesco. Vice's Chris McCall went along, external. One customer told Chris she'd seen people crying over the store closure. A previous Kirkcaldy event was addressed by no less a figure than the local MP, former Prime Minister Gordon Brown. And then, a few days later the Guardian reported that, back in Chatteris, Tesco are paying £20,000 for a \"community fund\" which they insist isn't compensation. The Guardian predict, external Tesco will pay more around the country as some of the other 49 towns with ghost stores start negotiating. None of this answers the more prosaic question people were asking - where are we going to shop now?\nThe ghost Tesco stores", "url": "https://www.bbc.com/news/blogs-magazine-monitor-31488480"}