{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:24", "date_modify": "2025-05-19 15:22:24", "date_publish": "2015-03-06 02:01:51", "description": "Three Rio de Janeiro police officers speak to Beth McLoughlin about their daily life coping with Brazil's \"public security crisis\".", "filename": "news_world-latin-america-31727562_1747668144.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81392000/jpg/_81392494_tenenteveigakids-3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-latin-america-31727562_1747668144.html", "title": "Brazil 'security crisis': The Rio police on the front line", "title_page": "Brazil 'security crisis': The Rio police on the front line - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In Brazil, more than 50,000 people are murdered each year - including scores of police officers. In Rio de Janeiro alone, 114 police were killed in 2014, according to the civilian police union Sindpol.\nThe human rights group Amnesty International says , externalthere is a \"public security crisis in Brazil\". It is calling for a national plan to drive down the murder rate.\nAs well as calling for action against the use of lethal force by police, Amnesty also points out the difficulties officers face, on and off duty.\nBeth McLoughlin spoke to three officers about their experiences and concerns.\n\"When I joined myself, I fell in love with the work, bringing the police closer to the community. A lot of military police come from favelas (shantytowns) themselves. My father was born in a favela, but some people still think think that it's only criminals who live there.\n\"In the past, women officers weren't accepted but there is less resistance now.\n\"I change into my [civilian] clothes here [at the UPP base] and don't go home in my uniform. That's not through lack of pride [in the uniform], but for safety. But I see myself as a member of the military police 24 hours a day. Some of my friends accept this and others don't. We have seen the some of the worst things in life and these things stay with you.\n\"Of course I am afraid. The fear keeps me alive. For the next 16 years at least, I have to stay alive for my son's sake. We have to use our fear in our favour.\"\n\"If you thought about the danger, you would give up.\n\"My father was a police sheriff. The law is the same for everyone, it's non-negotiable. But people are influenced by their environment, like I was by my father. There are some crimes anybody could commit, it's just a question of circumstances.\n\"The state shouldn't kill citizens. But we are only human, and sometimes if your emotions get the better of you, you will lose control. But this will put you on the same level with the criminals.\n\"Military police officers get only six months' training and investment [in the UPP force] is not what it should be. But low salaries are not to blame for corruption. I tell my officers: do what you believe in, don't think about the salary.\n\"We have heroes here as well as psychopaths. We have people who would save the life of a man he doesn't even know and who would probably badmouth about him afterwards.\"\n\"I was born in the Vila Cruzeiro favela, and all my uncles were in the police. When I was six, I used to cycle around dressed up in a military police uniform with a white helmet and a plastic pistol. You couldn't do that now as the area is dominated by organised crime.\n\"I work at the police homicide division in Rio, interviewing suspects, witnesses, and victims' families, and I teach at the Police Academy. Our work is preventative, understanding crimes and their causes.\n\"The hours are long, but I would hate to wake up one day and not be in the police. If you do what you love, it's not work.\n\"We have a saying that a police officer can't make a mistake. He is a different kind of professional. The wrong decision could put someone in jail or a cemetery.\n\"I have faith that one day, police officers will no longer be hunted by criminals, and we will live in a society with more tolerance on both sides.\"", "url": "https://www.bbc.com/news/world-latin-america-31727562"}