{"authors": ["Gabriel Gatehouse", "www.facebook.com"], "date_download": "2025-05-19 15:34:50", "date_modify": "2025-05-19 15:34:50", "date_publish": "2015-01-30 00:06:03", "description": "When Greece's new leader gave his victory speech, flags were flying high. Supporters from across Europe celebrated an event which they are hoping will change the continent.", "filename": "news_magazine-31021797_1747668890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80660000/jpg/_80660011_greece-podemos-624afp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_magazine-31021797_1747668890.html", "title": "The middle-class voters who can't resist Karl Marx", "title_page": "The middle-class voters who can't resist Karl Marx - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Greece's new Prime Minister, Alexis Tsipras, gave his victory speech flags were flying high. Supporters of his left-wing Syriza party gathered from across Europe to celebrate an event which they are hoping will change the continent.\nTheir euphoria seemed tinged with apprehension. Old friends embraced and kissed as they recognised each other on the square.\nPerhaps they were comrades from the early days, when Syriza was struggling to attract more than a few percent of the vote. I say the early days, but that was only five years ago. Things are changing fast.\n\"It's the beginning of a new era,\" said Poppy Kotsiandi, a little uncertainly, putting a protective arm around her teenage son.\n\"What do you do?\" I asked. Poppy didn't quite fit the image I had of a typical Syriza voter.\n\"I'm freelance,\" she said, evasively, \"in advertising.\" Work is scarce.\n\"There will be tough times ahead,\" mused her friend Yanis, a studious-looking man in middle age who said he sold life insurance for a living.\nWhere were the firebrands? Where the militant Marxists? Why were these polite, middle-class professionals waiting for Alexis Tsipras to sweep onto the stage and usher in the first ever radical leftist government in the European Union?\nThey were what would, in any prosperous nation, constitute the political middle ground.\nBack in 2001, that arch-centrist, Tony Blair, said: \"The kaleidoscope has been shaken. The pieces are in flux.\"\nHe was speaking a few weeks after 9/11 - a different era. Today, it is the European consensus that lies in broken shards upon the pavements of Athens.\nTo give you an idea of how fractured and confused politics is in Greece right now, let me recount a conversation I had with a Greek journalist before the election who was explaining to me why he wasn't planning to vote Syriza.\nThe reforms imposed upon Greece by the International Monetary Fund (IMF) and the EU - while painful - were a necessary step, he said, to shake the country out of a state of moribund corruption.\n\"You probably think I'm really right wing,\" he added, apologetically. \"I'm not, honestly, I'm very centrist. I love Marx.\"\nIn that context, can it be surprising that Syriza has chosen as its coalition partner not the communists - who you'd think might be their natural bedfellows - but a group called Independent Greeks?\nThey're a centre-right anti-immigration party whose only common ground with Syriza is their shared opposition to the policies of austerity. On pretty much everything else they disagree.\nBut Syriza needs to move fast, and a fractious coalition is going to be the least of their worries. Greece is about to start negotiations with its creditors. Neither side knows what the rules are anymore.\nBut in essence, here's the deal - a coalition of radical left groups that believes capitalism is a bad thing now runs a country that owes around 280 billion euros (£210bn; $320bn) to institutions that are wedded to the economics of the free market and whose credo is austerity.\nFor each side to come out of this confrontation intact, both will have to compromise. Failing that, one of the two will break. And the EU could be the one to crack.\nIn other European capitals, that thought fills many with dread. But not all. Athens has become a beacon for thousands of leftists, who are flocking to Greece to be part of what they hope is the beginning of a revolution.", "url": "https://www.bbc.com/news/magazine-31021797"}