{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:03:19", "date_modify": "2025-04-26 04:03:19", "date_publish": "2025-03-03 21:30:35", "description": "The 26-year-old had not been seen since leaving a nightclub in the early hours of Friday morning.", "filename": "news_articles_c0mwremmepdo_1745640199.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/feeb/live/e97696e0-f875-11ef-a40e-1dcee1447ad7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mwremmepdo_1745640199.html", "title": "Bristol: Body found in search for Luis Piovesana", "title_page": "Bristol: Body found in search for Luis Piovesana - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A body has been found in the search for a missing 26-year-old man, police have said.\nA huge search effort had been launched in Bristol after Luis Piovesana disappeared in the early hours of Friday morning after leaving The Jam Jar in St Judes, Bristol.\nAvon and Somerset Police said a body was discovered by a dive team which was searching the River Frome in the Napier Road area of Eastville at 18:00 BST on Monday.\nA spokesman said while formal identification had not yet taken place, detectives had met Mr Piovesana's family and updated them.\n\"Our thoughts remain with them during this incredibly difficult time and they continue to be supported by specialist officers,\" they said.\nAt a press conference on Monday afternoon Det Insp Pete Walker of Avon and Somerset Police said Mr Piovesana had called 999 for help in the minutes after he went missing.\nHowever the call had dropped out after 34 seconds, with officers unable to contact him again. He was later seen on CCTV, moving around the Eastgate Retail Park.\nMr Piovesana's disappearance sparked a huge search effort over the weekend, with more than 100 police officers and staff involved as well as dozens of volunteers.", "url": "https://www.bbc.co.uk/news/articles/c0mwremmepdo"}