{"authors": ["John Greenwood", "www.facebook.com"], "date_download": "2025-04-26 06:30:15", "date_modify": "2025-04-26 06:30:15", "date_publish": "2025-02-27 10:44:13", "description": "Councillors divided over whether renovated historic venue should 'stand on its own two feet'.", "filename": "news_articles_cgm11100z80o_1745649015.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/59ae/live/b35fbfa0-f4fb-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm11100z80o_1745649015.html", "title": "Halifax: 'Piece Hall's council subsidy should be cut'", "title_page": "Halifax: 'Piece Hall's council subsidy should be cut' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councillors have called for public funding to be withdrawn from a major heritage site.\nThe Piece Hall in Halifax, which was renovated into a retail, events and concert venue in 2017, received around £450,000 from Calderdale Council in 2022/23.\nGreen Party councillors suggested the local authority pull its subsidy for the Grade I-listed building during Calderdale's budget meeting earlier this week.\nBut the Labour-run council said it would continue to support the Piece Hall.\nThe council's budget for the next financial year, which included a 4.99% council tax rise and an increase in some parking charges, was passed on Monday night.\nPresenting his party's proposals, councillor Martin Hey said the money saved would help fund measures to tackle climate change.\nHe was supported by Liberal Democrat councillors, who also raised the issue last autumn, the Local Democracy Reporting Service said.\nTheir party leader, councillor Paul Bellenger said: \"That's one of the things I would definitely like to see cut.\n\"I think now the Piece Hall has gained so much recognition nationally and internationally it's about time it stood on its own two feet.\"\nHowever, deputy leader Scott Patient told the meeting that the venue was a \"brilliant building\" and \"protecting it (was) absolutely key\".\nHis Labour colleague, councillor Silvia Dacre, said: \"I'm sad that before the Piece Hall has even had the opportunity to present a business case to request an extension of our investment, the Green Party has decided it is not value for money.\n\"I just wonder whether they have talked to any of the businesses in Halifax who benefit from the Piece Hall effect?\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/cgm11100z80o"}