{"authors": ["Paul Barltrop", "www.facebook.com"], "date_download": "2025-04-26 04:23:59", "date_modify": "2025-04-26 04:23:59", "date_publish": "2025-03-03 12:50:31", "description": "The population of the region's towns and cities are growing, with the biggest rise in Swindon.", "filename": "news_articles_cdx2kgl0rjqo_1745641439.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0362/live/fc125500-f81b-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdx2kgl0rjqo_1745641439.html", "title": "Migrants say multicultural town is 'very welcoming'", "title_page": "Immigration: Migrants say multicultural town is 'very welcoming' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "New census data shows a region's population has reached record levels, in part due to immigration.\nThe West of England's biggest rise has been in Swindon, where immigration has increased by 30% in 20 years. One in five of its residents were born outside the UK.\nMany who have moved to the region work in health and social care, as well as IT, though thousands also come to study.\nSudha Sri Nukana who migrated from India with her husband Vamsa to work in IT said Swindon is \"very welcoming for new people\".\n\"When I came for the first time In 2010, I hardly [knew anyone], but I never felt as a stranger in Swindon because I am always welcomed by many communities here,\" she added.\nWhile all parts of the West of England have grown, the biggest increases have been seen in towns and cities.\nLatest government figures show a decline in the number of National Insurance Numbers (NI) being issued to people born in the EU and an increase in those for people born in Africa and Asia.\nThe shift has been described as a result of \"the post-Brexit immigration system\", by Dr Ben Brindle, researcher at Oxford University's Migration Observatory, external.\nCensus returns from 2001 and 2021 show Bristol's population rose by 24%.\nIt also asks people about their country of birth; the proportion of the city's residents not born in the UK has risen to 19%.\nBut the West saw the biggest rise in Swindon, where a fifth (20%) were born overseas.\nThe data shows that people from India now make up Swindon's biggest community.\nMrs Nukana, who is also a conservative councillor for Rodbourne Cheney, described the people of Swindon as \"kind and generous\".\n\"I've never felt alone because people are always there to support each other.\n\"The people here are so kind and the smiley faces [they have] when you go out for a walk and the way they approach you is inclusive,\" she said.\nSince Brexit the numbers coming to the UK from the EU have tumbled, instead employers often recruit from Asia.\nThe trend can also be seen in the region's NHS.\nA quarter of doctors in the South West of England's hospitals were born overseas. For nurses the figure is higher, with most being born in Asia.\nHowever, recent changes to immigration policy have made it more difficult for people to bring loved ones over to the UK on a family visa.\nHenry Maina, who is originally from Kenya, has been fighting to bring his wife over to live with him in Gloucester for 25 years.\n\"It's been difficult, us virtually living two lives, them over there and me over here,\" Mr Maina said, adding it had been a stressful time for the whole family.\nThe Home Office said it cannot comment on individual cases while a legal process is ongoing.", "url": "https://www.bbc.co.uk/news/articles/cdx2kgl0rjqo"}