{"authors": ["Katy Prickett", "www.facebook.com"], "date_download": "2025-04-26 04:00:00", "date_modify": "2025-04-26 04:00:00", "date_publish": "2025-03-04 05:34:25", "description": "Watches made by Lorenz Beha are scarce due to his untimely - and violent - death, an expert says.", "filename": "news_articles_c4gmr362p53o_1745640000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fba1/live/e21e7780-f859-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gmr362p53o_1745640000.html", "title": "Murdered Norwich watchmaker's rare timepieces sell for £190", "title_page": "Murdered Norwich watchmaker's rare timepieces sell for £190 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two pocket watch movements linked to a Victorian man bludgeoned to death in a robbery have been sold at auction.\nGerman-born Lorenz Beha, a 28-year-old watchmaker from Norwich, was travelling between two Norfolk villages in 1853 when he was attacked on a country road.\nAuctioneer Elizabeth Talbot, a director of TW Gaze, said the movements showed he was \"such a master of his craft\", despite his young age.\nThe lot was sold for £190, above the estimated price of between £50 and £70.\nThe lot comes from a collection of clocks and watches begun by Henry Potter Stevens, external (1875-1965) and continued by his son Humfrey.\nMr Beha was a travelling watchmaker and jeweller who had a shop in St Stephen's Plain, Norwich, at the time of his murder.\nHis body was found by several people after they uncovered a trail of blood leading to a hedge, the Diss-based auction house said.\nNational newspapers at the time reported his murder, including the extreme violence used by his attacker.\nLocal labourer William Thompson was accused of the crime and incriminating evidence, such as his blood-splattered trousers, several watches marked L Beha, as well as cash, were discovered at his home.\nMrs Talbot said: \"There was nothing in the records we've found that suggest the two men knew each other.\n\"But as an artisan manufacturing in gold and metalworks, Beha would have been identified as much better off.\n\"The workman who clonked him must have believed him to be a target who would yield some treasures.\"\nThompson was executed in public the following April at Norwich Castle, which was then the county jail.\nPublic hangings continued there until 1867. The last private execution was held inside in 1951, according to the auction house.\n\"So the movements also have a link to what used to happen at the castle, which we now take for granted as a wonderful historical place,\" she added.\nThe lot sold for more than double the estimated price.\n\"The fact they made so much more was a real bonus,\" Mrs Talbot said.\n\"Hopefully they have gone to someone who appreciates the regional nature of them.\"", "url": "https://www.bbc.co.uk/news/articles/c4gmr362p53o"}