{"authors": ["Imran Rahman-Jones", "www.facebook.com"], "date_download": "2025-04-26 08:14:57", "date_modify": "2025-04-26 08:14:57", "date_publish": "2025-02-26 11:04:33", "description": "Experts have questioned the company's explanation that it is due to the two words being similar.", "filename": "news_articles_c5ymvjjqzmeo_1745655297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2952/live/180c6870-f41d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymvjjqzmeo_1745655297.html", "title": "Apple AI tool transcribed the word 'racist' as 'Trump'", "title_page": "Apple AI tool transcribed the word 'racist' as 'Trump' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Apple says it is working to fix its speech-to-text tool after some social media users found that when they spoke the word \"racist\" into their iPhones it typed it out as \"Trump.\"\nThe tech giant has suggested the issue with its Dictation service has been caused by a problem it has distinguishing between words with an \"r\" in them.\n\"We are aware of an issue with the speech recognition model that powers Dictation and we are rolling out a fix today,\" an Apple spokesperson said.\nHowever an expert in speech recognition told the BBC this explanation was \"just not plausible.\"\nPeter Bell, professor of speech technology at the University of Edinburgh, said it was more likely that someone had altered the underlying software that the tool used.\nVideos shared online, external show people speaking the word \"racist\" into the Dictation tool.\nSometimes it is transcribed correctly - but on other occasions it is turned into \"Trump\", before being quickly restored to the correct word.\nThe BBC has not been able to replicate the mistake, suggesting Apple's fix is already taking effect.\nProf Bell said Apple's explanation of phonetic overlap did not make sense because the two words were not similar enough to confuse an artificial intelligence (AI) system.\nSpeech-to-text recognition models are trained by inputting clips of real people speaking alongside an accurate transcript of what they say.\nThey are also taught to understand words in context - for example, they could distinguish the word \"cup\" from \"cut\" if it was within the phrase \"a cup of tea\".\nProf Bell says the situation with Apple is unlikely to be a genuine mistake with its data because its English language model would be trained on hundreds of thousands of hours of speech, which should give it a high level of accuracy.\nFor \"less well-resourced languages\" he said it could be an AI training issue.\nBut he said in this case: \"it probably points to somebody that's got access to the process.\"\nA former Apple employee who worked on its AI assistant Siri told the New York Times:, external \"This smells like a serious prank.\"", "url": "https://www.bbc.co.uk/news/articles/c5ymvjjqzmeo"}