{"authors": ["Danielle Codd", "www.facebook.com"], "date_download": "2025-04-26 06:25:18", "date_modify": "2025-04-26 06:25:18", "date_publish": "2025-02-28 22:28:05", "description": "Funding to protect flats from fire does not apply to buildings under 11m (36ft) or five storeys high.", "filename": "news_articles_c14n6ngkrzeo_1745648718.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/25c1/live/cd03a9d0-f438-11ef-8b93-e929161a3c61.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14n6ngkrzeo_1745648718.html", "title": "Flat owner hit with £65,000 fire safety cladding bill as block too short for funding", "title_page": "Flat owner hit with £65,000 fire safety cladding bill as block too short for funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Flat owners are being hit with huge bills for fire safety work because their blocks are not tall enough to qualify for funding announced after the Grenfell Tower fire.\nThe previous government launched the Building Safety Act after the 2017 fire which killed 72 people. But the rules do not apply to buildings under 11m (36ft) or five storeys high.\nSome lawyers claim the new law was \"rushed\" but the government says it covers the majority of leaseholders and it will continue to review the legislation.\nParamedic Tom DeRonde received a £65,000 bill because his flat is in a three-storey building and says he faces bankruptcy.\n\"I had to take a month off work with stress. There's not been a day when I've not thought about cladding,\" he told the BBC.\nIt is estimated there are 1.3 million leasehold flats in low-rise blocks, under 11m high in England, according to the End Our Cladding Scandal campaign.\nTom bought his flat in Luton in 2018 with money he had saved from serving in the army. He said when he came home to a bill for £65,000 he was \"absolutely shocked\".\nThe invoice from his landlord was his legal share of the costs to make the building fireproof. \"I thought it was a typo to be honest,\" said Tom.\nThen he learnt the building's height meant he was a \"non-qualifying leaseholder\" and would be liable to pay for fire safety work.\n\"The government says for buildings under 11m, the risk can be mitigated by other means, like using fire alarms and sprinkler systems but in my case, that's not true,\" explained Tom.\n\"I've had two fire assessments both saying the cladding is dangerous and needs to be removed, and the price, which they also said would be lower for smaller buildings, is extortionate. I can't pay,\" he added.\nAfter complaining to the building's owners, Tom expects the bill to be reduced but is yet to find out by how much.\nTom had planned to sell the flat to buy a family home but can't. \"It's ruining my life and I'm facing bankruptcy,\" he said.\nThe Department for Housing told the BBC that owners of buildings under 11m should not pass on the costs of fixing historical safety defects to leaseholders.\nBut the law does not prevent people like Tom being billed for unlimited amounts of money when the developers are no longer around or landlords cannot afford the remediation costs.\nLiz Ramsden is an expert in leasehold property at Knights and told the BBC she believes the Building Safety Act was drafted too quickly.\n\"The intention was that no leaseholder would have to pay but in reality we are finding a lot of leaseholders are having to pay huge sums of money.\n\"There was very little consultation and because of that we have these gaps in the legislation and people are falling through,\" she said.\nEven in buildings above 11m the rules fail to protect many leaseholders.\nHomeowners with Islamic mortgages or three or more properties also do not benefit from the full protections.\nThis is something Martin Batty, who has an Islamic mortgage, only discovered when he put his one-bedroom flat up for sale.\nHe said his lawyer explained the way Islamic home purchase plans are structured - to comply with Sharia law which does not allow paying interest - means he falls outside the scope of the act.\n\"It feels really unfair. I feel like I'm being discriminated against,\" he said.\n\"To find out that I'm a non-qualifying leaseholder just because I've got an Islamic home purchase plan is a huge kick in the teeth. It's really upsetting and is a huge let down.\"\nThe government told the BBC Islamic interest free loans secured against properties were very rare.\nBut Martin said he can't sell his flat because mortgage providers will not lend against it and solicitors won't advise on non-qualifying leases.\nLawyer Mrs Ramsden said: \"There's been a 40% drop in leasehold transactions because of problems with the act. It urgently needs to be looked at so we can make it work better for everybody.\"\nA government spokesperson told the BBC it would consider changes to the Building Safety Act and review how it can offer greater protection from costs.", "url": "https://www.bbc.co.uk/news/articles/c14n6ngkrzeo"}