{"authors": ["Tanya Gupta", "www.facebook.com"], "date_download": "2025-04-26 03:51:48", "date_modify": "2025-04-26 03:51:48", "date_publish": "2025-03-05 11:30:06", "description": "Police issue CCTV images of Christine Fish, 55, who is missing from her Market Drayton home.", "filename": "news_articles_c5y9ke11n9xo_1745639508.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f4a/live/11aa52b0-f9b0-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y9ke11n9xo_1745639508.html", "title": "Friend pleads with missing Shropshire woman to make contact", "title_page": "Friend pleads with missing Shropshire woman to make contact - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The friend of a woman missing from her home in Market Drayton has urged her to \"make contact with somebody\".\nSpeaking to BBC Shropshire, Sian Rushton said missing Christine Fish was a \"brilliant lady, so caring, so kind\" and everyone looking for her was concerned.\nWest Mercia Police have issued CCTV images of Ms Fish, 55, who has been missing from her home since last Wednesday, and was last seen in Shrewsbury on Friday.\nHer friend said Ms Fish could walk for miles, so just because she was seen in Shrewsbury did not mean she was still there now.\nAppealing to her friend, she said: \"Chris, if you're listening to this or you can hear it please reach out to somebody.\n\"We saw the CCTV. We know you're alive and well, but you need to contact somebody, even if you walk into a church, it's a passer-by or a dog walker - please just make contact.\n\"You know where I am. You know my number. Please just get in touch.\"\nMs Rushton, from Market Drayton, urged all members of the public, including people with CCTV, cameras or Ring doorbells to watch out for her and contact police if they saw her.\nDet Sgt Alex Sullivan said: \"We, along with Christine's family, are growing increasingly concerned for her welfare and ask that you contact us with any detail, however small you feel that may be\".", "url": "https://www.bbc.co.uk/news/articles/c5y9ke11n9xo"}