{"authors": ["Nathan Briant", "www.facebook.com"], "date_download": "2025-04-26 07:50:46", "date_modify": "2025-04-26 07:50:46", "date_publish": "2025-02-25 15:26:36", "description": "Judge Case finds some of the father's evidence was implausible following the hearing in Slough.", "filename": "news_articles_c20131qpzxzo_1745653846.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c70d/live/e9ac11b0-f386-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20131qpzxzo_1745653846.html", "title": "Abusive husband in Berkshire routinely raped wife, judge finds", "title_page": "Abusive husband in Berkshire routinely raped wife, judge finds - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A husband routinely raped his wife after forcing her to take cocaine in the home they lived in with their three children, a judge found.\nThe Royal Borough of Windsor and Maidenhead brought the case to court after the mother and the children left the family home and were moved to a confidential address last year.\nFamily court judge Richard Case found the father strangled his wife until she lost consciousness in the summer of 2013 and other serious abuse continued over the years.\nJudge Case found the father's evidence at times \"lacked all plausibility\".\nHe also lied under oath when he claimed his wife had frequently assaulted their children, the judge said.\nThe father was also found to have coerced his wife into taking cocaine from 2023 \"as a means of facilitating non-consensual sexual activity\" on a weekly or fortnightly basis.\nHe was also found to have taken pictures of his wife taking cocaine and then attempted to further coerce her by threatening to disclose them.\nTheir children's attendance at school was found to be poor by authorities and their home smelled of cannabis, Slough's family court heard.\nThe father was found to have been abusive to social workers and police and told one council worker that she would be \"destroyed\".", "url": "https://www.bbc.co.uk/news/articles/c20131qpzxzo"}