{"authors": ["Giancarlo Rinaldi", "www.facebook.com"], "date_download": "2025-04-26 03:38:44", "date_modify": "2025-04-26 03:38:44", "date_publish": "2025-03-04 22:40:27", "description": "The company says it could create 100 new jobs by converting the site on a Dumfries retail park.", "filename": "news_articles_c3rn9pvp9xvo_1745638724.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9ac3/live/bee37970-f90b-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rn9pvp9xvo_1745638724.html", "title": "Supermarket giant Sainsbury's eyes up Dumfries Homebase site", "title_page": "Supermarket giant Sainsbury's eyes up Dumfries Homebase site - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Supermarket giant Sainsbury's has lodged a bid to allow it to open a new store in the south of Scotland.\nThe company wants to take over a unit previously occupied by Homebase on the Cuckoo Bridge Retail Park in Dumfries.\nHowever, conditions in place in the area - designed to protect the town centre - currently limit sales to only non-food bulky goods.\nSainsbury's has submitted an application to modify that restriction in order to allow it to convert the site into a supermarket which it said would create 100 new jobs.\nHomebase went into administration last year and the Dumfries site subsequently closed with the loss of about 25 jobs.\nHowever, Sainsbury's - which does not currently have a store in the town - could step in to give it a new use.\nIt said that if given the go-ahead it could \"enhance convenience for shoppers, foster healthy competition, increase consumer choice, and contribute positively to the local economy\".\nAt the end of August 2024, Sainsbury's announced expansion plans to open several new supermarkets at a variety of locations across Scotland, England and Northern Ireland in old Homebase stores.", "url": "https://www.bbc.co.uk/news/articles/c3rn9pvp9xvo"}