{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:12", "date_modify": "2025-05-19 15:22:12", "date_publish": "2015-03-06 10:41:10", "description": "A DUP councillor who told a Stormont committee she was \"bullied\" by a party advisor has been summoned to a disciplinary hearing, reports suggest.", "filename": "news_uk-northern-ireland-31763729_1747668132.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80141000/jpg/_80141406_jennypalmer.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31763729_1747668132.html", "title": "DUP councillor Jenny Palmer 'summoned to disciplinary hearing'", "title_page": "DUP councillor Jenny Palmer 'summoned to disciplinary hearing' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A DUP councillor who told a Stormont committee she was \"bullied\" by a party advisor has been summoned to a disciplinary hearing, reports suggest.\nJenny Palmer is accused of bringing the party into disrepute, the Belfast Telegraph reports.\nShe made the remarks at the Social Development Committee in January.\nIt is holding an inquiry into allegations in a BBC Spotlight programme of political interference in the Housing Executive.\nThe Lisburn councillor told the committee that Mr Brimstone had said: \"You do what the party wants, or there's no point in you being on the board of the Housing Executive.\"\nShe told the committee about a meeting with party members, including leader Peter Robinson, Lagan Valley MP Jeffrey Donaldson and Mr Brimstone.\nShe said that Mr Robinson had asked her what he needed to do \"to put this right\".\nAccording to Mrs Palmer, she told him she wanted a public apology and Mr Robinson and Mr Brimstone agreed.\n\"Everyone in the room agreed that, we all gave each other big hugs and we went out the door,\" she said.\n\"Five drafts later we're still fighting over that apology.\"\nIn a previous hearing, Mr Brimstone told the committee that he did not \"believe\" he had asked Mrs Palmer to change her vote.\n\"I want to be careful that I don't get into the internal workings of the party, but I'm quite content to make it clear that I never set out to cause anyone any offence or discomfort,\" he said.\nJenny Palmer occupies a unique position in recent DUP history, by opening to intense media scrutiny the internal workings of a party that values secrecy almost as much as it values votes.\nRemarkably, she's been able to do so while remaining a party member. That may be about to change.\nSome in the hierarchy favoured moving against the previously little-known Lisburn councillor as soon as she went public to the BBC Spotlight programme to claim that DUP special adviser Stephen Brimstone told her how to vote at a board meeting of the Housing Executive.\nIn the immediate aftermath of the programme, party leader Peter Robinson said he could reach no conclusion about whose version to believe.\nBut recent exchanges between Mrs Palmer and DUP assembly member Sammy Wilson during the Social Development Committee's hearings to investigate the allegations hinted strongly that any such doubts about who to back have long since disappeared.\nThe committee's deliberations are coming to an end. The DUP and Mr Brimstone may not fare well in its conclusions, and it has already been a publicity nightmare for the party.\nIt is a gamble, but the DUP may feel there's nothing more to be gained from restraint where Jenny Palmer is concerned.\nIt is a reminder for her - and any other members who may find themselves in a similar position in the future - that there is a price to be paid for breaking rank.", "url": "https://www.bbc.com/news/uk-northern-ireland-31763729"}