{"authors": ["Tom Edwards", "www.facebook.com"], "date_download": "2025-05-19 15:08:56", "date_modify": "2025-05-19 15:08:56", "date_publish": "2015-03-02 17:27:02", "description": "How many more times can HS2 launch a plan for Euston station?", "filename": "news_uk-england-london-31701436_1747667336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81350000/jpg/_81350031_81350030.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-london-31701436_1747667336.html", "title": "HS2 'U-turn' leads to uncertainty in Euston", "title_page": "HS2 'U-turn' leads to uncertainty in Euston - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The redevelopment of Euston station is meant to be the jewel in the high speed train line HS2's crown.\nBut the plans have changed so many times, it's becoming very difficult to keep up.\nNow, it seems the plan is to go back to elements from the original scheme which involves platforms for the high speed lines being placed to the west of the station.\nThis has also been called a \"lean to\" and an \"eyesore\" by local campaigners.\nThe existing station would, it seems, be developed but it would be done in stages and take much longer than originally envisaged.\nThe local newspaper the Camden New Journal, external calls the move an \"astonishing triple U-turn\".\nThe local Labour council does not want HS2, but if it goes ahead it wants a big redevelopment at Euston.\nCouncillor Sarah Hayward, leader of Camden Council, said: \"Government ministers promised that the community would be consulted on options for a comprehensive redevelopment of the station.\n\"Instead we've been presented with a fait accompli that extends the end date of the building works from 2026 to nearly 2040 and does nothing to deal with the current substandard station.\n\"Sadly, although I'm shocked, I'm not surprised and we'll need to work out the next steps. If this scheme goes ahead, Camden will be blighted for decades and there'll be no extra jobs or homes at Euston station.\"\nLast week HS2 told the Camden New Journal: \"All the parties involved are currently looking at the best approach to deliver a redeveloped Euston station that positively transforms the area while minimising the impact on residents and passengers.\n\"The phased delivery option will reduce construction impact, minimise disruption to existing passengers, deliver HS2 on time, on budget and help provide long-term benefits and opportunities for the community.", "url": "https://www.bbc.com/news/uk-england-london-31701436"}