{"authors": ["Shannen Headley", "Tania Sangha", "www.facebook.com"], "date_download": "2025-04-26 06:35:48", "date_modify": "2025-04-26 06:35:48", "date_publish": "2025-02-27 06:08:19", "description": "Sport England has launched a £250m scheme to provide funds to projects to help\nget people moving", "filename": "news_articles_cr426v63g7qo_1745649348.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/131c/live/55279670-f455-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr426v63g7qo_1745649348.html", "title": "West Midlands: Cricket club gave new lease of life say members", "title_page": "West Midlands: Cricket club gave new lease of life say members - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Members of an over-50's walking cricket club say the sport has given them a new lease of life.\nMadhu Patel, 71, attends two training sessions a week at Tipton Leisure Centre, in the West Midlands, and described them as a \"massive opportunity\" to get fit after two knee operations.\nSport England has provided the club with equipment and will be funding other projects in the Black Country to encourage exercise - 34.8% of adults in the region are classed as inactive.\nThe organisation has launched a £250m scheme to provide funding to 53 high-need areas in England to remove barriers to physical activity and to help people from lower socio-economic backgrounds as well as Black and Asian communities.\nCommunity cricket development officer Pravin Patel runs the 90-minute walking cricket sessions, which he started at the centre in 2023.\nHe told BBC Midlands Today that he had encouraged people to sign up to be more active after the pandemic.\n\"Cricket was the easiest sport to pick, and it's also one you can play with any ability,\" he said.\"\nMr Patel also runs a class dedicated to women on Fridays.\n\"The majority [of members] are South Asian ladies, and in the past they've had this taboo of not playing sports, but when it came to cricket, I've got 45 ladies on the books.\"\nAmong them is Mrs Patel, who said: \"I've had two knee operations, and this has given me an opportunity to continue with my fitness, and now I'm thinking, I can carry on and sustain this.\n\"We've all retired, so we have plenty of time on our hands to keep fit, to be motivated, and to do all the wonderful things with all these wonderful people.\"\nMembers said they enjoyed the physical and social benefits of the training sessions.\nUma Patel, 72, said the sessions helped her get out of the house, meet people do something she really enjoyed.\nPravin Patel, 65, added: \"I used to play cricket when I was at school so when I started here it brought me back memories.\"", "url": "https://www.bbc.co.uk/news/articles/cr426v63g7qo"}