{"authors": ["Lee Trewhela", "www.facebook.com"], "date_download": "2025-04-26 03:54:51", "date_modify": "2025-04-26 03:54:51", "date_publish": "2025-03-04 16:54:47", "description": "Street trading will be banned but \"beach services\" to be allowed on certain conditions.", "filename": "news_articles_cdjyx98xledo_1745639691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f4b/live/aad98a20-f909-11ef-bc87-ad84b3fde561.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyx98xledo_1745639691.html", "title": "Council to allow some beach trading to continue", "title_page": "Council to allow some beach trading to continue at Perranporth - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A parish council in Cornwall has agreed to backtrack on a policy banning all seasonal seafront traders.\nPerranzabuloe Parish Council has agreed to allow \"beach services\" - such as hair braiders, henna tattooists and face painters - to continue trading on certain conditions.\nThe council had announced a ban on all street trading on the approach to Perranporth beach to ensure \"a fair and competitive business environment\".\nBut at the end of a public discussion on Monday, it said it would grant a limited number of licences to beach traders.\nMembers of the finance and operations committee agreed that three licences per year would be allowed, which must be applied for each year in advance with operators based within zoned areas.\nThe licences would be granted before 1 April for traders to operate from June to the middle of September.\nAny applicant must hold public liability insurance, have an enhanced DBS check and be risk assessed.\nFurther details are set to be discussed at a full council meeting on 24 March, as reported by the Local Democracy Reporting Service.\nCouncillor Rob Cooke, who is not on the finance committee, spoke as a member of the public.\nHe said: \"I believe that they [street traders] do offer a service to the community and to our visitors which is valuable.\"\nPerranporth resident Rory Jenkins added: \"The sentiment I get is a lot of people are saying this is part of the experience and they would like some traders to be there.\n\"My two seven-year-old kids think it's epic to go down and get a temporary tattoo, and it's part of that summer experience.\"", "url": "https://www.bbc.co.uk/news/articles/cdjyx98xledo"}