{"authors": ["Nadine Yousif", "www.facebook.com"], "date_download": "2025-04-26 07:08:01", "date_modify": "2025-04-26 07:08:01", "date_publish": "2025-02-28 03:59:07", "description": "The leader of the Canadian province campaigned on the need to fight US President Donald Trump's threatened tariffs.", "filename": "news_articles_c62zzd3zp50o_1745651281.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5efc/live/3ba6ace0-f581-11ef-8b82-7194daf6b455.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zzd3zp50o_1745651281.html", "title": "Ontario's Doug Ford wins rare third consecutive majority to lead province", "title_page": "Ontario's Doug Ford wins rare third consecutive majority to lead province - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of Ontario, Doug Ford, has vowed to push back at US President Donald Trump after securing a third term in office as premier of Canada's most populous province.\n\"Donald Trump thinks he can break us,\" he told the cheering crowds in Toronto, but the US president was mistaken, he added. \"Canada is not for sale.\"\nFord, who has led Ontario since 2018, called the snap election to get a clear mandate to fight US President Donald Trump over tariffs he threatens to impose on Canadian goods.\nThe indications on Friday morning were that his Progressive Conservatives had won more than 80 seats out of 124 in the legislature.\nThe left-wing New Democratic Party came second, forming the official opposition, while the Liberals were in third place.\nFord pushed back in his election campaign against Trump's persistent references to Canada as the 51st US state, sporting a cap saying \"Canada is not for sale.\"\nIn his victory speech at a convention centre in Toronto, he said: \"Donald Trump thinks he can break us. He thinks he can divide and conquer, pit region against region.\n\"Donald Trump doesn't know what we know. He is underestimating us. He is underestimating the resilience of the Canadian people, the Canadian spirit.\"\nThe election was called by the Canadian Broadcasting Corporation (CBC) 10 minutes after polls closed on Thursday evening.\nVoter turnout appears to be near historic lows. As of 23:00 local time (04:00 GMT) with 97% of polls reporting, just over 44% of Ontarians had cast ballots in the election.\nThat is essentially tied with the lowest ever turnout of 44% in 2022.\nFord ran his campaign under the slogan \"Protect Canada\", reflecting his view that Canada needs to stand firm against US tariff threats.\nFord has appeared regularly on US television news networks in recent months as a de-facto spokesman for Canada's position in its fight against the tariffs.\nPresident Trump said on Thursday that the tariffs he planned to impose on Canada and Mexico would go ahead next week, after he delayed them a month in exchange for security assurances at the shared borders.\nAround 75% of Canadian exports go to the US, and economists have warned that the tariffs would be devastating for Canada's economy while raising costs for Americans.\nOntario is home to a large automotive sector that is deeply intertwined with the US - car parts often make several trips back and forth across the US-Canada border before a vehicle is fully assembled and sold.\nFord has suggested that 500,000 of Ontario's 16 million people could lose their jobs if the US follows through on the blanket 25% tariffs.\nHe has called for strong retaliation, suggesting Canada cut its energy supply to the US and calling for provincial liquor stores to pull American booze from their shelves.\nHe has also proposed the idea of \"Fortress Am-Can\" - a slogan to sell Trump on a stronger energy alliance between the two countries in a bid to avoid tariffs altogether.\nOpposition parties have criticised Ford for calling the snap election, accusing him of taking advantage of the rift in US-Canada relations to boost his own popularity. They also questioned the decision to push for a costly election amid economic uncertainty.\nFord has also been the subject of numerous controversies, including an ongoing criminal investigation into a deal to sell a piece of environmentally protected land for real estate development.\nAt a speech to supporters on Thursday, Bonnie Crombie, leader of the Ontario Liberals, said that while the party fell short of forming a government it should be \"very proud\" of the seats it gained.\n\"People counted us out. Tonight, you proved them wrong,\" said Crombie, who failed to win her own seat. She vowed to continue on as leader.\nThe last time a government in Ontario formed three consecutive majorities was under Leslie Frost, a Progressive Conservative leader who won his third and final term in 1959.", "url": "https://www.bbc.co.uk/news/articles/c62zzd3zp50o"}