{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:31:12", "date_modify": "2025-04-26 04:31:12", "date_publish": "2025-03-03 06:13:06", "description": "The water sports centre, which has been closed since 2020, has been taken over by a community group.", "filename": "news_articles_c0kggn3vjmdo_1745641872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea0a/live/ad645d90-f541-11ef-ae0b-6f48bf49ce47.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kggn3vjmdo_1745641872.html", "title": "Hengistbury Head activity centre revived by community group", "title_page": "Hengistbury Head activity centre revived by community group - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A water sports and activity centre that has been closed for five years is to be revived by a community group.\nHengistbury Head Outdoor Activity Centre, on Christchurch Harbour, shut in March 2020 after the building was deemed unsafe for public use.\nThe facility, which was primarily used for water sports, previously handled more than 15,000 activity sessions a year.\nIt was brought back into direct ownership by BCP Council in 2021 and has now been leased to community group Hengistbury Head Outdoors (HHO).\nThe group was set up as a charitable community benefit society in 2023 and the centre is already being used by community groups.\nHHO has now been granted a 99-year lease through a Community Asset Transfer, and aims to redevelop the centre into a modern, more accessible facility by January 2026.\nThe lease means it can benefit from a government grant of almost £670,000 from the Department of Housing, Communities and Local Government (DCLG) towards refurbishments and repairs - on the condition it can raise a further £155,000.\nThe money must also be spent by December, and work has already begun on the waterfront, grounds and facilities required for the centre to reopen safely.", "url": "https://www.bbc.co.uk/news/articles/c0kggn3vjmdo"}