{"authors": ["Christian Fuller", "www.facebook.com"], "date_download": "2025-04-26 06:40:17", "date_modify": "2025-04-26 06:40:17", "date_publish": "2025-03-02 14:12:21", "description": "The cannabis plants are believed to hold a street value of about £300,000, Kent Police said.", "filename": "news_articles_cgm1jv4zkxno_1745649617.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4174/live/302c5750-f763-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1jv4zkxno_1745649617.html", "title": "Maidstone police seize 1,000 cannabis plants from warehouse", "title_page": "Maidstone police seize 1,000 cannabis plants from warehouse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nearly 1,000 cannabis plants have been seized by police from a warehouse in Kent.\nPolice were called to reports of suspicious activity near St Peter's Street in Maidstone on Wednesday after gas engineers undertaking repairs in the area found a suspected cannabis cultivation.\nOfficers discovered four tents filled with cannabis plants and a sophisticated ventilation and heating system inside a building, Kent Police said.\nThe plants, which have been seized for destruction, are believed to hold a street value of about £300,000.\nTwo men are understood to have left the scene on foot towards Maidstone East railway station prior to officers' arrival at about 20:20 GMT, police said.\nIt is thought they may have got into a silver Mercedes near the corner of Buckland Hill and St Peter's Street.\nAn investigation is under way to identify and locate those responsible for the cultivation, Kent Police said.\nOfficers are appealing to the public for help to identify two people who may be able to assist with enquiries.\nThe men are described as white and of a medium build, with thinning hair.\nOne was wearing a short-sleeved grey t-shirt and no shoes, police said.\nAnyone with information is urged to contact the force.", "url": "https://www.bbc.co.uk/news/articles/cgm1jv4zkxno"}