{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 04:06:22", "date_modify": "2025-04-26 04:06:22", "date_publish": "2025-03-03 16:43:35", "description": "Marcin Majerkiewicz is due to stand trial for the murder of 67-year-old Stuart Everett.", "filename": "news_articles_clydq5wx5z5o_1745640382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/608a/live/e8154b40-f84b-11ef-b5bf-275f2ed479cc.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clydq5wx5z5o_1745640382.html", "title": "Stuart Everett: Man's body parts found in six places, jury told", "title_page": "Stuart Everett: Man's body parts found in six places, jury told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man's dismembered remains were found in six different locations across Greater Manchester, a murder trial jury has heard.\nStuart Everett, 67, is believed to have died between 27 and 28 March last year and was subsequently cut up.\nMarcin Majerkiewicz, 42, has denied the murder of Mr Everett, as well as an alternative charge of manslaughter, and is due to stand trial at Manchester Crown Court.\nA jury was sworn in earlier and was warned by the trial judge, Mr Justice Cavanagh, that some of the evidence would be \"distressing\".\nThe prosecution is due to formally open its case on Tuesday and the trial is estimated to last for up to four weeks.\nJudge Cavanagh told the six women and six men of the jury they were there to try an \"important and major case\" which could \"excite strong emotions\".\n\"Some of the evidence will be distressing, however you must keep a cool head,\" he said.\nThey were told the victim and the defendant both lived at a house in Winton, Salford.\nBen Campbell, prosecuting, told the jury panel the remains of Mr Everett, who was also known as Roman Ziemacki, were recovered in Kersal Dale, Linnyshaw Colliery Woods, Boggart Hole Clough, Blackleach Reservoir, Worsley Woods and Chesterfield Close.", "url": "https://www.bbc.co.uk/news/articles/clydq5wx5z5o"}