{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:15", "date_modify": "2025-05-19 15:29:15", "date_publish": "2015-02-09 12:48:33", "description": "A vicar who posted a link to an article that blamed Israel for the 9/11 attacks is banned from using social media for six months.", "filename": "news_uk-england-surrey-31298113_1747668555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80696000/jpg/_80696095_80696094.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-surrey-31298113_1747668555.html", "title": "Vicar gets social media ban for 9/11 Israel Facebook post", "title_page": "Vicar gets social media ban for 9/11 Israel Facebook post - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A vicar who posted a link to an article that blamed Israel for the 9/11 attacks is to keep his job but has been banned from using social media for six months.\nThe Reverend Stephen Sizer, vicar of Christ Church, in Virginia Water, Surrey, used Facebook to highlight an article that said the official narrative of the atrocity was \"absurd\".\nThe Bishop of Guildford said his \"anti-Zionist agenda has become a liability\".\nHe said Dr Sizer also agreed to refrain from commenting on Middle East issues.\nThe Diocese of Guildford launched an investigation after the Church of England vicar posted a link to an article entitled \"9/11 Israel did it\", and reportedly wrote: \"It raises so many questions.\"\nDr Sizer later removed the link and apologised for sharing the material, which he said was \"ill-considered and misguided\".\nHis comments appeared in the same week as the 70th anniversary of the liberation of Auschwitz.\nThe Right Reverend Andrew Watson told a press conference at Guildford on Monday: \"Many who more moderately support the Palestinian cause and share his critique of a particular brand of Christian fundamentalism, themselves find Stephen's actions to be increasingly unhelpful and counter-productive, a fact he himself now recognises.\n\"It is therefore my decision that Stephen's work in this area is no longer compatible with his ministry as a parish priest.\"\nBishop Andrew added: \"In order for Stephen to remain in parish ministry, I have therefore asked for and received from him a solemn undertaking, in writing, that he is to refrain entirely from writing or speaking on any themes that relate, either directly or indirectly, to the current situation in the Middle East or to its historical backdrop.\"\nDr Sizer has a history of disputes with Jewish community leaders over blog postings on Israel and Zionism, according to BBC religious affairs correspondent Caroline Wyatt.\nIn a statement on the Diocese of Guildford's website, external, on 30 January, Mr Sizer said he had \"never believed Israel or any other country was complicit in the terrorist atrocity of 9/11\".\nAlmost 3,000 people died in the 9/11 attacks in the US in 2001.", "url": "https://www.bbc.com/news/uk-england-surrey-31298113"}