{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:53:32", "date_modify": "2025-04-26 07:53:32", "date_publish": "2025-02-25 13:56:29", "description": "Kate Mitchell, 42, was unlawfully killed in Kenya, according to a Newcastle coroner.", "filename": "news_articles_c1jpggy962jo_1745654012.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8df2/live/66c8e910-f379-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpggy962jo_1745654012.html", "title": "BBC worker in Kenya was killed in hotel room, coroner says", "title_page": "BBC worker in Kenya was killed in hotel room, coroner says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A BBC charity worker was killed in a Kenyan hotel room by an intruder who then jumped or fell to his death from eight floors up, an inquest has heard.\nKate Mitchell, 42 and originally from Whitley Bay, North Tyneside, suffered a head injury and was strangled in November 2021 in Nairobi, Newcastle Coroner's Court heard.\nMs Mitchell had worked for BBC Media Action, the organisation's international development charity, as a project manager in Ethiopia, South Sudan and Zambia.\nAs a coroner concluded she was unlawfully killed, the charity said its \"thoughts and condolences\" were with Ms Mitchell's family and loved ones.\nThe inquest heard Ms Mitchell had reluctantly left Addis Ababa due to the civil war in Ethiopia and was deployed to the Kenyan capital as a safer option.\nIt also heard she was found in her room of the Ibis hotel on the eighth floor and that a male intruder had gained entry and attacked her.\nCoroner Karin Welsh said: \"That man either fell or jumped from the eighth floor bedroom window and he also was found deceased.\n\"That's the totality of the information we have been able to glean from Nairobi.\"\nA post-mortem examination carried out when Ms Mitchell's body was returned to the UK found she died from a head injury and pressure on the neck.\nMs Welsh concluded that she was unlawfully killed.\nShe passed on her condolences to Ms Mitchell's family and the coroner told her brother Pete Mitchel: \"I know you still have questions, I hope they are answered for you.\"", "url": "https://www.bbc.co.uk/news/articles/c1jpggy962jo"}