{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:43:50", "date_modify": "2025-05-21 07:43:50", "date_publish": "2025-03-28 00:00:00", "description": "Nasen Saadi killed Amie Gray and seriously injured her friend Leanne Miles during a random attack last May.", "filename": "news_live_c981z7rr44lt_1747813430.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c981z7rr44lt_1747813430.html", "title": "Nasen Saadi jalied for at least 39 years for Bournemouth beach stabbings of Amie Gray and Leanne Miles", "title_page": "Nasen Saadi jalied for at least 39 years for Bournemouth beach stabbings of Amie Gray and Leanne Miles - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A recap on what's happened today\nNasen Saadi has been jailed for life with a minimum of 39 years for the murder of Amie Gray and the attempted murder of Leanne Miles\nThe pair had been sitting on a beach in Bournemouth when they were attacked last May\nSaadi, a criminology student, was described in court as a \"social misfit\" who had a \"grievance against women\"\nCCTV footage showed Saadi stepping on to the beach, before repeatedly stabbing the pair and leaving them to bleed to death\nIn an exclusive interview with the BBC, Sian Gray said her wife \"didn't die on that beach, she still lives on\"\nFutsal tribute 'for Amie'\nAmie Gray had been an avid player of futsal - a form of indoor football - and played with Dorset Futsal Club.\nShe was ambitious and wanted to get the girls' team into the national league.\nOn the night of her murder, she had been at a training session before heading to the beach.\nHer teammates described her as being \"so strong\" and \"comfortable being completely herself\".\nIn a video released in her memory, club chairman Michael Wootten said she had been an \"inspirational leader, teammate and friend\" who would never be forgotten.\nLeanne Miles describes beach attack\nIn a video played during the murder trial, Leanne Miles described how she pleaded for her life for the sake of her children.\nSpeaking from her hospital bed, three days after the attack, she said: \"I just remember we turned around, and I looked at this boy.\n\"He went towards me first - because I remember Amie saying: 'What are you doing? Get off her.'\"\nShe then lost sight of her friend as they fled, but heard her saying: \"Get off me\".\nShe continued: \"He came back on to me and he was continuously stabbing me.\n\"I said: 'Please stop, I've got children.' And then I think that's when he started to go, he walked away.\"\nTimeline of a killer\nUsing CCTV, police were able to track Nasen Saadi's movements around Bournemouth.\n21 May 2024\n12:25 - Saadi travels by train from Croydon to Bournemouth. He is wearing a dark jacket with a light stripe across the chest,\n14:40 - He is seen arriving in the seaside town at 14:40.\n15:17 - He checks in to a Travelodge in the West Cliff area of Bournemouth. He stays there for two nights.\n23 May 2024\n14:22 - Saadi is seen checking into the Silver How Hotel. This guesthouse is slightly closer to Durley Chine Beach.\n24 May 2024\n11:32 - Using his own bank card, Saadi buys orange juice and crisps at a Nisa convenience store in West Cliff.\n22:40 - Saadi pulls his hood over his head and leaves the Silver How Hotel.\n23:06 - He is seen walking up and down the promenade at Durley Chine Beach. He is wearing the same dark jacket with a light stripe across the chest as seen in previous days.\n23:38 - Saadi steps onto the sand and stabs Amie Gray and Leanne Miles, who are sat by a fire chatting. Paramedics arrive about ten minutes later, after a call from Ms Miles.\n23:44 - Saadi is seen leaving the beach.\n23:51 - He returns to the Silver How Hotel.\n25 May 2024\n00:24 - Amie Gray is pronounced dead by paramedics.\n09:09 - Saadi leaves the Silver How Hotel for Bournemouth railway station in a taxi.\n11:48 - He gets off a train at Riddlesdown, Croydon.\n28 May 2024\nPolice arrest Saadi at his aunt’s home in Croydon on suspicion of murder and attempted murder.\nSaadi asked 'how to get away with murder'\nNasen Saadi had been studying criminology and criminal psychology at the University of Greenwich.\nLecturer Dr Lisa-Maria Reiss said he had asked her about pleading self-defence to murder and DNA evidence during a seminar which had not covered these topics.\nShe said: \"He asked me what DNA is left behind and if the police is able to trace that DNA.\n\"I asked him: 'You're not planning a murder, are you?'\"\nDr Reiss' partner, special officer Pavandeep Singh Aneja, gave a talk to the students on policing in November 2023.\nHe said Saadi had asked questions \"on DNA, how to get away with murder, these types of things\".\nAmie Gray's wife tells BBC: 'I dont want hate to consume me'\nIn an exclusive interview with the BBC, Sian Gray said getting justice for her wife Amie was important.\nShe sat in the public gallery every day during Nasen Saadi's murder trial at Winchester Crown Court in December.\n\"I wanted to see him and him to look at me, to know the pain that he's caused and the lives that he's ruined,\" she said.\n\"I felt like I was representing her, like I was standing up to him, not letting her die.\"\nJudge: 'You thought you had committed the perfect crime'\nGiving her summary of the attack, judge Mrs Justice Cutts said, whilst Saadi’s choice of victims had been random, she was “satisfied that you had long planned and prepared to kill”.\n“Your preparations included finding the right location to murder someone and to avoid detection.\n“You had also clearly decided the beach was the place to locate your victim.\"\nReferring to evidence of him carrying out internet searches for whether it was easier to run on pebble or sandy beaches, she said: “You were clearly thinking of how to approach and run from your victim.\n“You chose Amie Gray and Leanne Miles because you had a grievance of society as a whole, and of women.\"\nShe added: “No doubt you thought you had committed the perfect crime.”\nKiller was 'social misfit' that went under radar\nCharles Sherrard KC, defending, said Nasen Saadi had \"never been in trouble in his life\" and that he was \"very much under the radar\".\n\"There can never be an excuse, but we've tried as best we can to understand and to try and explain.\n\"Nasen has both recognised his guilt and demonstrated a willingness to attend therapy.\"\nHe said Saadi had \"repressed socially-induced trauma\" from a combination of rejections and humiliation over many years.\n\"To put it another way, a social misfit,\" he said.\nHe went on to say Saadi had no friends at school and had never had a girlfriend.\nQuoting Saadi, Mr Sherrard said: \"I never got noticed when I did a good thing, people have only noticed me when I have done a bad thing.\"\nMr Sherrard added: \"And that perhaps is the nearest one can get to an explanation.\"", "url": "https://www.bbc.com/news/live/c981z7rr44lt"}