{"authors": ["Justin Rowlatt", "www.facebook.com"], "date_download": "2025-04-26 08:03:18", "date_modify": "2025-04-26 08:03:18", "date_publish": "2025-02-26 16:22:17", "description": "The government has been told that the public will need to change how we drive and heat our homes.", "filename": "news_articles_cpv4m3x1ldgo_1745654598.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d676/live/0c2a83f0-f43d-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4m3x1ldgo_1745654598.html", "title": "Heat pumps and EVs - how to fight climate change from home", "title_page": "Heat pumps and EVs – how to fight climate change from home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Households will need to make significant changes to their lifestyles to help the UK reach net zero by 2050, says the government's independent climate advisers.\nIn its latest advice, known as the carbon budget, the Climate Change Committee (CCC) says by 2040, 80% of cars should be electric and one in two homes have a heat pump.\nHere are some of the ways it says you can cut greenhouse gas emissions:\nDecarbonising home heating will be essential if the country is going to reach its legally binding net zero target by 2050.\nOur homes are the second biggest source of the UK's greenhouse gas emissions after transport, and 80% of those emissions are from gas boilers. The proportion has been increasing as the country generates more electricity from low-carbon technologies like renewables and nuclear.\nThe CCC is backing heat pumps as the main replacement for gas boilers and rules out using hydrogen.\nIt says only about 60,000 UK homes installed a heat pump in 2023. It wants that figure to be 450,000 by 2030 and 1.5 million by 2035.\nHowever, it recognises that is going to be difficult. A key problem is heat pumps are typically more expensive than gas boilers, even after the government's £7,500 grant. And because they heat water to a lower temperature than boilers, they work better in well-insulated homes with larger radiators or underfloor heating.\nThe committee says the government needs to consider schemes to help lower income households cover at least some of the costs of these changes.\nThe hope is that as boilers break down, consumers will replace them with heat pumps. The report doesn't recommend a ban on new boilers but says by 2035 all new heating systems should be low carbon.\nA quarter of UK emissions come from transport – excluding aviation – making it another priority for carbon cuts. But the CCC is less worried about how these will be achieved.\nThat is because it believes continuing reductions in the cost of batteries and other technologies mean electric cars and vans (EVs) could be cheaper to buy than petrol and diesel vehicles as soon as next year. This is significantly cheaper when you take into account running costs. It believes we will naturally choose them when we're looking for a new car.\nIn 2023, 16% of new cars were fully electric - the government says that will be 55% by 2027 and 95% by 2030.\nThe CCC says government will need to support the rollout of the charging network, and that the cost of charging needs to fall and payment be simplified.\nIt expects the switchover will become increasingly rapid, partly because it believes it will become more difficult to buy petrol and diesel, as it is expected there will be fewer petrol stations by 2040.\nWe are going to need to change our diets, the CCC says. That is because agriculture is the fourth highest emitting sector in the UK economy and nearly two-thirds (63%) of those emissions are from livestock.\nHowever, the CCC is careful not recommend restrictions on what we eat. Instead, it anticipates the current slow drift towards more plant-based foods will continue in the years to come. By 2040 it estimates we will be eating 25% less meat and 20% less dairy.\nMeat products will initially be replaced by existing alternative protein products like plant-based burgers, but in later years it expects us to start eating more \"alternative proteins\". These include oils and meat grown from animal cells in bio-reactors - fermentation tanks like you might see in a brewery. The first product using these cultivated meats for animal consumption went on sale earlier this month.\nOur changing diets will mean cattle and sheep numbers will need to fall by 27% as a result, it says. That will allow a shift towards woodland creation, the restoration of the country's peatlands and allow more land to be used to grow energy crops.\nUK farmers will need to be supported during this transition, it advises, and the government will need to be careful to ensure that low-carbon UK food is not just replaced by higher-carbon products imported from abroad.\nAviation is currently the sixth biggest source of UK emissions, but by 2040 the CCC reckons it will be the biggest.\nIn the past the committee has advised government there should be no expansion of UK airports without a clear plan to cut emissions from the sector. The government is expected to announce its support for a new runway at Gatwick on Thursday, so is likely to be relieved the CCC has dropped that recommendation from this latest carbon budget.\nBut it says the aviation industry will need to pick up the tab for the costs of decarbonising the sector. That is going to require technological innovation – more efficient jets and electric planes – and the increasing use of sustainable aviation fuels (SAF).\nSAF is made from plant products or by combining captured CO2 with hydrogen. Just 1% of jet fuel is currently SAF, but the CCC expects that to rise to 17% by 2040.\nAny emissions the industry cannot eliminate will need to be offset by what the CCC calls \"engineered removals\". That means using technologies to take CO2 out of the atmosphere and store it permanently underground.\nAll of which is going to be expensive and will drive up ticket prices. The CCC expects those higher prices will slow down the increase in passenger numbers in years to come. However, it still expects a 28% increase in passenger numbers by 2050 – with UK residents taking a total of 402 million flights a year.\nIt has a warning though. If all that new tech doesn't cut emissions as much as the industry is expecting, the government may need to impose limits on flight numbers.", "url": "https://www.bbc.co.uk/news/articles/cpv4m3x1ldgo"}