{"authors": ["Evie Lake", "www.facebook.com"], "date_download": "2025-04-26 07:53:06", "date_modify": "2025-04-26 07:53:06", "date_publish": "2025-02-25 14:19:30", "description": "Teesdale Mountain Rescue Team is one of the teams who searched for missing woman Jenny Hall.", "filename": "news_articles_cly6zzg585po_1745653986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7ec0/live/fe7912a0-f377-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6zzg585po_1745653986.html", "title": "Thousands donated to mountain rescue team after Jenny Hall search", "title_page": "Thousands donated to mountain rescue team after Jenny Hall search - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A mountain rescue team has received more than £7,000 since the conclusion of the search for a missing 23-year-old woman.\nJenny Hall, from Tow Law, County Durham was last seen leaving her home on 18 February with her body found on Sunday after five days of searching areas around Eggleston and Hamsterley.\nSince Sunday, Teesdale and Weardale Search and Mountain Rescue Team (TWSMRT) has been inundated with donations from the public.\nJane Ascroft, deputy team leader for TWSMRT, said the team was \"incredibly touched\".\nThe search for Ms Hall focused on the running trails she often used and her body was found in a very remote area in Teesdale just after 09:30 GMT on Sunday.\nDurham Police said it was not treating her death as suspicious and a file was being prepared for the coroner.\nTWSMRT ended up bringing in 15 other mountain rescue teams from across the country to support the search alongside the force.\nA spokesperson for Durham Police said the force \"would not have been able to cover the amount of miles as quickly as we did in our bid to reunite Jenny with her family\" without the \"invaluable\" help from the mountain rescue.\n\"The outcome was not what we were hoping for and our thoughts remain with Jenny's family, but we are particularly thankful to TWSMRT who, along with 15 other highly-skilled mountain rescue teams, provided expert advice and worked closely alongside officers on the ground in difficult weather and terrain,\" they said.\nMs Ascroft said there had been a \"huge emotional impact\" on the team which volunteers were \"all trying to catch up with now\".\n\"We are always relieved to be able to provide closure for the families on these kind of jobs,\" she added.\nThe deputy team leader, who also works as an accountant, said some team members took three days off of work to focus on the search.", "url": "https://www.bbc.co.uk/news/articles/cly6zzg585po"}