{"authors": ["Jamie Coulson", "www.facebook.com"], "date_download": "2025-04-26 03:45:02", "date_modify": "2025-04-26 03:45:02", "date_publish": "2025-03-05 06:27:43", "description": "Around one in five staff working at hospitals in Leeds are non-British, according to workforce data.", "filename": "news_articles_crrd7vdj749o_1745639102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e534/live/63a821d0-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd7vdj749o_1745639102.html", "title": "Overseas staff 'invaluable' at hospitals in Leeds", "title_page": "Overseas staff 'invaluable' at hospitals in Leeds - senior doctor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Overseas staff working for hospitals in Leeds are \"invaluable\" in the day-to-day running of health services, according to the trust's chief medical officer.\nDr Magnus Harrison described international recruitment as a \"two-way street\" that helped to fill gaps in the organisation but also offered good career opportunities.\nAround one in five Leeds Teaching Hospitals NHS Trust staff are non-British workers, which is broadly in line with the NHS average in England.\nThe government said recruiting talent from around the world made the NHS \"stronger\", but added it was also committed to developing \"home-grown talent\".\nIn total, about 22,000 members of staff work across seven hospital sites in Leeds, representing at least 129 different nationalities.\nThe vast majority are British, with about 4,500 from other countries.\nDawood Sidique, who moved to Leeds from Pakistan three years ago, works on an urgent care ward at St James's University Hospital.\nThe 32-year-old charge nurse described his job as \"superb\" and said he partly chose the UK because he wanted to work for the NHS.\n\"It was very difficult to decide which country to go to, but in the end I decided for the UK because there are more learning opportunities here,\" he said.\n\"If somebody is coming from a different country, different culture, different tradition, different people, it's difficult – but I haven't faced any problems as people are wonderful.\"\nNHS England has about 1.5m staff, according to workforce data, with more than 311,000 non-British.\nWhile many overseas staff are recruited to fill vacancies, others come to the UK for training opportunities or fellowships.\nDr Mohammad Yousef, 31, was sponsored by the King Hussein Cancer Centre in Jordan to spend a year at St James's University Hospital for anaesthetics training.\n\"Back In Jordan they trust the NHS,\" he said.\n\"They send doctors to get the experience and to get that experience back and practise it on our patients.\"\nDr Harrison said it would be \"really difficult\" to run some of the trust's services if it didn't have international staff.\n\"We have areas where we struggle to recruit, and our overseas colleagues help fill those gaps for us,\" he said.\n\"It's a two-way street – we benefit but hopefully our overseas colleagues benefit as well.\"\nSarah Dodsworth, Royal College of Nursing (RCN) regional director, said international nurses played a \"vital and valuable\" role but the NHS had become \"over reliant\" on overseas workers.\n\"The route to adequate staffing is to ensure that nursing is an attractive profession,\" she said.\n\"This can only be achieved by ensuring fair pay, addressing staffing shortfalls and attracting students.\"\nThe Nuffield Trust think tank echoed the RCN viewpoint and asked the government to look for \"bold solutions to shore up our domestic supply of healthcare workers\".\nImmigration explained: Migrants, refugees, and visas defined\nA Department of Health and Social Care spokesperson said: \"The NHS has always drawn on talent from around the world.\n\"The service is stronger for it and millions of patients are grateful for the skilled and compassionate care they have received from staff from overseas.\"\nThey added: \"This government is also committed to developing our own home-grown talent and giving opportunities to more people across the country to join our NHS by training thousands more doctors and nurses.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/crrd7vdj749o"}