{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:29", "date_modify": "2025-04-26 03:51:29", "date_publish": "2025-03-05 11:50:53", "description": "Annabel Mackey was discovered unresponsive in Kingsley Pond in Hampshire in September 2023.", "filename": "news_articles_c62zgvgvqgeo_1745639489.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8adb/live/f48f4760-f9a7-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62zgvgvqgeo_1745639489.html", "title": "Mother in court for murder of two-year-old found in pond", "title_page": "Mother in court for murder of two-year-old found in pond - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman has appeared in court charged with the murder of her two-year-old daughter, who died after being found in a village pond.\nAnnabel Mackey was discovered unresponsive in Kingsley Pond, near Bordon, on 10 September 2023, after she was reported missing. She died in hospital a day later.\nHer mother, Alice Mackey, 42, of Gibbs Lane, Oakhanger, appeared at Basingstoke Magistrates' Court to face one count of murder.\nShe has since been remanded in custody and is due to appear at Winchester Crown Court on Friday.\nAnnabel's father previously released a tribute to his daughter, describing her as a \"shining star\" who will be \"loved forever\".\nAppearing in court, wearing a pink hoody and jeans, Alice Mackey spoke only to confirm her name, address and date of birth.\nShe is charged in connection with Annabel's death, after the toddler went missing from her home on Forge Road, Kingsley, on Sunday 10 September 2023.\nPolice later cordoned off a house on the road, which is about 1,500ft (460m) from the large pond along a rough track.\nAlice Mackey's parents sat in the public gallery during the short hearing.\nIn relation to the murder charge, district judge Stephen Apted said: \"That's a charge that can only be dealt with in the crown court, so I am going to send your case to Winchester Crown Court.\n\"This court is prohibited from hearing any bail applications, so I will remand you in custody to your appearance at the crown court.\"", "url": "https://www.bbc.co.uk/news/articles/c62zgvgvqgeo"}