{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 07:34:19", "date_modify": "2025-04-26 07:34:19", "date_publish": "2025-02-27 15:52:42", "description": "Rhianan Rudd was the UK's youngest female terror suspect before charges were dropped and she was found dead.", "filename": "news_articles_c4g77e57q17o_1745652859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/780e/live/afad0d80-f51f-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g77e57q17o_1745652859.html", "title": "Rhianan Rudd: Groomed girl under MI5 probe was 'fixated on Hitler' before death", "title_page": "Rhianan Rudd: Groomed girl under MI5 probe was 'fixated on Hitler' before death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A schoolgirl who was groomed online by a far-right extremist in the US became \"fixated\" on Adolf Hitler and wanted to \"blow up a synagogue\" before she took her own life, an inquest has heard.\nRhianan Rudd, 16, downloaded bomb manuals, guides on guerrilla warfare and media glorifying white supremacy and Nazism, Chesterfield Coroner's Court was told.\nHer mother referred her to the deradicalisation programme Prevent - but she was later arrested by counter-terrorism officers and then placed under investigation by MI5.\nThe court heard several months after the charges were dropped, Rhianan was found dead at a children's home in Nottinghamshire on 19 May 2022.\nAged 15, she was the youngest girl charged with terror offences in the UK, before the prosecution was discontinued.\nBefore the inquest evidence began, a statement paying tribute to Rhianan was read out on behalf of her mother, Emily Carter.\nIn it, she said her daughter had a love of horses and cats and had a passion for cooking, which was \"one of the times she was the happiest\" and that art became an outlet \"when she couldn't say something\".\nBut Ms Carter said Rhianan - who was autistic - became \"fixated\" on things due to her condition, and said: \"Her being groomed was huge and I saw her change and it had a huge impact on her.\"\nAn email was read out from Rhianan's mother to Counter Terrorism Policing East Midlands (CTPEM) requesting help from the Prevent programme.\nIt said: \"I need help with my 15-year-old daughter. She has a very unhealthy outlook on fascism – she also has massive dislikes for certain races and creeds.\n\"I have done my best to deter her from any such ideologies, but it seems to be falling on deaf ears. I would like some help on the matter.\"\nThe subsequent referral form said this started off as an interest in world wars, but then turned towards a \"fixation on Hitler\" and admiration for him.\n\"She classes herself as a fascist and has quite a lot of hate towards other races,\" the form stated.\nMs Carter said they were waiting for hospital treatment for Rhianan's mental health. The court also heard Rhianan had a \"history of self-harm\".\nA report by CTPEM, in September 2020, outlined that a joint assessment had taken place and said \"it does not meet the criteria for [a criminal investigation]\", but if \"things escalated\" then it would be referred back to them.\nEdward Pleeth, counsel for the inquest, read out another report from CTPEM later that month, which detailed that Rhianan had told her mother she \"wants to go to a synagogue and blow it up\", and has spoken about \"slitting people's throats\".\nThe report said: \"[We need] to ascertain her online presence i.e. who is she speaking to? Is she being coerced by anybody in her way of thinking?\"\nDisclosure from MI5 was read to the court, which showed Rhianan was speaking to Chris Cook, a 23-year-old neo-Nazi from the US who sent her \"racially-motivated links\" to read.\nThe inquest was told the then-partner of Rhianan's mother, American Dax Mallaburn, also had an influence which was \"not known\" to Ms Carter.\nThe inquest heard a student at Rhianan's school provided a statement to senior staff, in which she repeated a desire to \"blow up a synagogue\".\nIn October 2020, Supt Stephen Riley, head of CTPEM, told the court two police officers attended Rhianan's home in Bolsover, Derbyshire, seizing a USB memory stick and a diary from her.\nAnalysis found PDF manuals on how to make a bomb and material of a far-right nature.\nCPTEM then passed the information on to MI5, which opened an investigation.\nThe court was told on 20 October 2020, during a meeting, that police and MI5 had decided Rhianan would not be arrested because it was \"believed to risk some impact on her mental health\" and \"could possibly lead to further self-harm and suicide attempts\".\nBut after Rhianan was admitted to hospital in Chesterfield that same day after \"carving a swastika\" on to her forehead, the court was told a decision was made the following day to arrest her due to \"new information and a risk to others\".\nDespite Rhianan being assessed by Prevent after her mother made a referral in September 2020, her case was closed after a criminal investigation began the following month. At that stage her case was deemed to be beyond the remit of the deradicalisation scheme.\nThe inquest heard after Rhianan was arrested on 22 October 2020, MI5 discussed with the police officer running the investigation whether an \"exception\" on Prevent could be made for Rhianan, but the detective had said it could not.\nSupt Riley said the detective was \"following the guidance that was available in 2020\".\nCharges against Rhianan were dropped in late December in 2021, after a Home Office unit that deals with modern slavery and trafficking made a formal finding that she was a victim of exploitation.\nBut the court heard the referral to the Home Office was not made by police after they began investigating Rhianan in autumn 2020.\nRather, the inquest heard it was only made at the instigation of defence lawyers after she was charged in April 2021.\nSupt Riley was questioned about whether there had been a missed opportunity for police to make a referral in November 2020, but he said that was not the case.\nThe inquest heard in 2020, counter-terrorism officers did not receive training about modern slavery referrals, even though the relevant legislation had been in force since 2015.\nThe inquest continues.\nIf you have been affected by any of the issues in this story, support is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/c4g77e57q17o"}