{"authors": ["Emma Petrie", "www.facebook.com"], "date_download": "2025-04-26 04:10:04", "date_modify": "2025-04-26 04:10:04", "date_publish": "2025-03-02 18:32:14", "description": "Abbey Walk car park in Grimsby features abstract reliefs sculpted by artist Harold Gosney.", "filename": "news_articles_c2ljk0wxwq4o_1745640604.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c394/live/06f4a440-f782-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ljk0wxwq4o_1745640604.html", "title": "Grimsby car park's 1960s artworks being preserved with 3D scanner", "title_page": "Grimsby car park's 1960s artworks being preserved with 3D scanner - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work has begun to preserve \"important\" artworks on a multi-storey car park that is earmarked for demolition.\nAbbey Walk car park in Grimsby, which was built in 1969, has been closed since May 2024 because of structural issues caused by water penetrating some of its beams.\nThe pillars of the car park feature modernist reliefs by artist and sculptor Harold Gosney, which North East Lincolnshire Council has said it will attempt to conserve before the four-storey structure is removed and replaced with a ground-level car park.\nA conservation team is using 3D technology to scan the artworks and create a digital model so they can be reprinted in the future, the authority has said.\nThe four abstract concrete reliefs depict parts of a car, which were inspired by drawings in the handbook of the artist's Austin Cambridge estate car, and were installed when the building was constructed.\nThere are 40 concrete panels on the structure, each featuring one of four designs in a repeated fashion.\nThe council hopes to save all four original artworks if it is financially viable and safe to remove them.\nCouncillor Stewart Swinburn said: \"This is a great opportunity to preserve one of the most important artworks in the borough.\n\"With this 3D scan, we can ensure the amazing work by Mr. Gosney is something that generations will see and learn about,\" he added.\nThe University of Lincoln's conservation team said they were using a handheld scanner to collect a series of images, known as frames, in a process called tracking. The frames would then be merged together in a computer software to form a 3D model.\nThe authority said a planning application for the demolition of the car park had been submitted and was being processed.\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c2ljk0wxwq4o"}