{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:29:23", "date_modify": "2025-04-26 04:29:23", "date_publish": "2025-03-03 07:03:58", "description": "Madeleine Sumption, of the Migration Observatory at Oxford University, answers your questions.", "filename": "news_articles_cpq27zv9nvpo_1745641763.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ece/live/4081f2d0-ead0-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq27zv9nvpo_1745641763.html", "title": "Lincolnshire: Your questions on immigration answered", "title_page": "Lincolnshire: Your questions on immigration answered - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC East Yorkshire and Lincolnshire has looked at immigration and migration across the country, and the impact it is having on communities, public services and society.\nA complex topic, the BBC aims to cut through the rhetoric and get to the facts, going beyond the headlines and politics to put the issue into context.\nWe asked for your questions on the matter.\nHere is a selection answered by Dr Madeleine Sumption MBE, who is the director of the Migration Observatory at Oxford University. It provides impartial, independent and evidence-based analysis of data on migration and migrants in the UK to inform media, public and policy debates.\nJenny Lewis, from Grantham, wants to know how many people from abroad work in heath care, and if the NHS and social care could survive without them.\nIn response, Dr Sumption said the NHS relied quite heavily on overseas doctors and nurses, as does the social care sector.\nShe said it was difficult to imagine a scenario with no overseas recruitment, but added it would depend on what else we did as a country.\n\"For example, whether we increase the number of domestic nurses that we train – or if you look at the care sector – whether the government improves pay and conditions.\"\nDavid Bedford, 59, from Lincolnshire, wants to know what percentage of Eastern Europeans work in the NHS.\nDr Sumption says while there is no specific data on Eastern European workers, if you look at the health and care sectors together, one in six workers come from overseas - making health \"slightly more reliant\" on overseas workers than other industries.\nRay Bennett, from Little Carlton, asks why people are risking their lives in small boats to get to the UK, rather than claiming asylum in the first safe country they get to?\nDr Sumption says: \"In terms of the risks, one thing that is quite interesting is that people are willing to take quite extraordinary risks… to make that journey.\"\nShe says if you look at the numbers coming to the UK in small boats as a share of overall migration \"it's actually quite low\".\nHowever, she adds: \"That doesn't mean we shouldn't be talking about it.\"\n\"What's happening on the small boats is a dangerous form of migration – the costs are higher, so I think it's reasonable there has been more of a focus on it.\"\nSteve Wright, 75, from Lincolnshire, suggests migrants on benefits are \"costing the country a fortune\".\nDr Sumption: \"If you look at the total cost of migration and the benefits in terms of the taxes that people pay, it seems migrants pay more or less the amount of taxes it would take to provide them with benefits and other public services.\n\"It does, of course, vary quite a lot, so those on low incomes are much more likely to be net recipients from the system. At the same time, those who are earning a lot are paying a lot of tax and subsidising others.\"", "url": "https://www.bbc.co.uk/news/articles/cpq27zv9nvpo"}