{"authors": ["Robert Plummer and Nadine Yousif", "www.facebook.com"], "date_download": "2025-04-26 06:57:26", "date_modify": "2025-04-26 06:57:26", "date_publish": "2025-02-28 14:14:42", "description": "President Trump continues to play global disruptor while the world does its best to engage with him.", "filename": "news_articles_cy7xxlr2pggo_1745650646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8494/live/069167d0-f5d0-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xxlr2pggo_1745650646.html", "title": "Donald Trump: 11 things the president and his team did this week", "title_page": "Donald Trump: 11 things the president and his team did this week - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "President Donald Trump continued to play the global disruptor this week, while the rest of the world did its best to engage with him.\nHis sixth week in office saw developments at home and abroad, as the US president hosted foreign leaders at the White House, including the UK's Prime Minister Sir Keir Starmer.\nThe wars in Ukraine and Gaza also loomed large, in sometimes surprising ways.\nA tense exchange between Trump and Ukrainian President Volodmyr Zelensky capped the week off on Friday, resulting in their White House meeting being cut abruptly short.\nIf you are after a catch-up, here is a reminder of 11 major moves from the Trump administration this week.\nOne of the most remarkable moments of the week was an angry exchange between Zelensky and Trump at the Oval Office that unfolded in front of the world's news cameras.\nDuring what was supposed to be a prelude to the two leaders signing a minerals deal, the conversation between the two soured, and culminated with the US president telling his Ukrainian counterpart to make a deal with Russia \"or we are out\".\nThe exchange first became heated after US Vice-President JD Vance told Zelensky that the war had to be ended through diplomacy. Zelensky then asked what kind of diplomacy, to which Vance accused him of being disrespectful and of \"litigating\" the situation in front of the media.\nIt escalated quickly from there. Trump told Zelensky that he should be \"thankful\" for the US support his country has received in its fight against Russia, and that he was \"gambling with World War Three.\"\nThe Ukrainian president was then told to leave the White House by National Security Adviser Mike Waltz and Secretary of State Marco Rubio, and a joint news conference with Trump and Zelensky was cancelled.\nIn a Truth Social post afterwards, Trump said \"Zelensky disrespected the US in its cherished Oval Office.\"\n\"He can come back when he is ready for peace,\" Trump said.\nAhead of that meeting, Ukraine and the US had drafted a deal that would give the US access to Ukraine's deposits of rare earth minerals.\nZelensky had said he hoped the \"preliminary\" agreement with the US would \"lead to further deals\", but confirmed no American security guarantees had been agreed yet.\nNotably, Trump on Thursday appeared to walk back his harsh criticism of Zelensky, whom he called a \"dictator\" last week. Asked about it on Thursday, Trump replied: \"Did I say that? I can't believe I would say that.\"\nBut Friday's meeting, which ended up being cut short even before the two parties had begun negotiations, ended with no deal signed.\nWhat we know about US-Ukraine minerals deal\nWhat minerals does Ukraine have?\nTrump held his first cabinet meeting on Wednesday. Among those present was the president's billionaire adviser Elon Musk, who is not actually a cabinet member.\nA big topic was the plan by Doge - the so-called Department of Government Efficiency, which Musk runs - to cut the size of the federal bureaucracy.\nOn the same day of the meeting, a memo was sent to federal agencies asking them to submit plans for \"a significant reduction\" in their staff by 13 March.\nMusk, tariffs and tensions - takeaways from Trump's first cabinet meeting\nPart way through their opening remarks, Sir Keir reached inside his jacket pocket and pulled out an official letter from King Charles - an invitation for a second state visit.\nTrump appeared to be genuinely taken aback for a few seconds, asking: \"Am I supposed to read it right now?\"\nAfter taking a minute to read the letter, Trump said he accepted the invite and that it would be an \"honour\" to visit the \"fantastic\" country.\nStarmer charms Trump, but any deals will have to wait\nTrump said he would invite the Philadelphia Eagles to the White House to celebrate their recent Super Bowl win, despite rumours that the champions might decline the invitation.\n\"Absolutely, they'll be extended an invitation,\" Trump said in the Oval Office on Tuesday. \"They deserve to be down here, and we hope to see them.\"\nThe Eagles skipped a visit to the White House when they won in 2018, but the team plans to attend the event this year, US media reported.\nTrump to invite Philadelphia Eagles to White House after Super Bowl win", "url": "https://www.bbc.co.uk/news/articles/cy7xxlr2pggo"}