{"authors": ["Galya Dimitrova", "Allen Sinclair", "www.facebook.com"], "date_download": "2025-04-26 06:46:29", "date_modify": "2025-04-26 06:46:29", "date_publish": "2025-03-01 13:27:55", "description": "The Hawk Conservancy Trust says Stilton the steppe eagle is \"friendly\" and \"confident\".", "filename": "news_articles_ce8mgznpxreo_1745649989.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fe06/live/1952cd50-f69d-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8mgznpxreo_1745649989.html", "title": "Endangered steppe eagle settles in Andover conservancy trust", "title_page": "Endangered steppe eagle settles in Andover conservancy trust - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An endangered eagle has been settling into his new Hampshire home.\nVisitors to The Hawk Conservancy Trust near Andover have been meeting Stilton the steppe eagle, who got his name in line with the charity's 2024 cheese-based naming theme.\nBird team member Jennie Marshall said he was \"confident\" and \"really friendly to work with\".\nMs Marshall said it was important to connect the public to endangered species in support of conservation.\nAs a steppe eagle, Stilton is dark brown, about 81cm (32 inches) tall, and could reach a weight of 4.9kg (11lbs), which is about the same as a Yorkshire Terrier.\nBirds of this migratory species have a wingspan extending up to two metres ( 7ft).\nThey are named after their preferred breeding habitat - the Steppe region of Eastern Europe and Central Asia.\nThe steppe eagle is globally endangered, external and its population is estimated to have declined by about 60% since 2010.\nThe trust said habitat loss and electrocution on powerlines were \"the big problems\".\nThe charity hopes Stilton will join experiences and flying displays in time for the start of the summer programme on 29 March.\nMs Marshall said he was \"very talkative\" to anybody who walked past his aviary.\n\"He's very confident in himself as well,\" she added.\nShe said she was training him most days.\n\"He's learning his new surroundings... and to do that, we need some trust between us.\"\nShe said his role fitted with the mission of the trust.\n\"You're not necessarily going to be this close with a steppe eagle in the wild,\" Ms Marshall said.\n\"It is really important to us to connect the public to endangered species... so they are more likely to, in the future, support us and other conservation.\"", "url": "https://www.bbc.co.uk/news/articles/ce8mgznpxreo"}