{"authors": ["Hugh Casswell", "www.facebook.com"], "date_download": "2025-04-26 07:04:40", "date_modify": "2025-04-26 07:04:40", "date_publish": "2025-02-28 06:41:54", "description": "Nottinghamshire County Council is set to relocate to new offices in March.", "filename": "news_articles_cp8yydqlr19o_1745651080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9d66/live/143e80c0-f53f-11ef-938c-4727a1e64ce2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8yydqlr19o_1745651080.html", "title": "Last council meeting held at historic Nottinghamshire County Hall", "title_page": "Last council meeting held at historic Nottinghamshire County Hall - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "County Hall has been at the heart of Nottinghamshire politics for decades and serves as a major landmark by the banks of the River Trent.\nOn Thursday, however, it hosted the final full council meeting before the county council relocates to new offices - called Oak House - near Hucknall.\nThe Conservative-run authority said its historic base had become too expensive to run, and would need upwards of £50m of investment in order to bring it up to modern environmental standards.\nIt is not yet known what will become of County Hall in the future, but the council said the building would be \"preserved\".\nThe council first started planning for what would become County Hall in the 1930s, having previously been based at the Shire Hall in Nottingham.\nWork started on site in 1938, but construction was halted after the outbreak of World War Two, and the building was still incomplete when some council staff eventually moved there in 1946.\nThe original designs were significantly altered after the war due to financial restraints and labour shortages.\nMost notably, a huge bell tower, which would have been three times taller than County Hall itself, was scrapped.\nSeveral concrete annexes were added in the 1960s and 70s, one of which was demolished in 2016, with the others due to follow suit in the coming months.\nOver the years the building has hosted royal visits and countless civic ceremonies.\nIn 2022, a major fire caused by a faulty light fitting caused extensive damage to the first-floor corridor where the council's executive members work.\nRepair work cost more than £1.8m, with the cost met by insurance.\nIn 2023, parts of the building were used for the filming of BBC series Sherwood.\nAs the seat of local government for the county, however, it has regularly been the setting for real-world political drama, and Thursday's meeting was no different.\nThe annual budget setting saw clashes over a 4.84% increase to council tax, with several councillors trading insults, prompting calls from the chairman to moderate language.\nThe Conservatives argued they have limited the impact on bills by not putting them up by the maximum allowed, and said they had balanced affordability with the demand for services.\nLeader of the Ashfield Independents, Jason Zadrozny, called the tax rise \"insulting\" and accused the Conservatives of \"picking the pockets\" of residents.\nLabour, meanwhile, proposed an amendment to the budget which would have involved spending more on flood defences and children's services, paid for by selling Oak House.\nLabour group leader Kate Foale said the new headquarters was \"unfit for purpose\" and had become a \"vanity project\".\nThe amendment was defeated, with Conservatives arguing Oak House will save money in the long-term through reduced operating costs.\nThe budget - and tax rise - was ultimately confirmed.", "url": "https://www.bbc.co.uk/news/articles/cp8yydqlr19o"}