{"authors": ["Ana Faguy", "www.facebook.com"], "date_download": "2025-04-26 07:50:44", "date_modify": "2025-04-26 07:50:44", "date_publish": "2025-02-25 15:33:28", "description": "Glossip has had nine execution dates postponed, and eaten his \"last meal\" three times.", "filename": "news_articles_c2417q5y2z0o_1745653844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d31a/live/3a0677b0-f38f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2417q5y2z0o_1745653844.html", "title": "Richard Glossip: Supreme Court orders new trial for Oklahoma death row inmate", "title_page": "Richard Glossip: Supreme Court orders new trial for Oklahoma death row inmate - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US Supreme Court has ordered a new trial for Richard Glossip, an Oklahoma man on death row.\nThe court ruled 5-3 in favour of Glossip, reversing an Oklahoma Court of Criminal Appeals ruling.\nThe move comes after the state's Republican attorney general joined Glossip in calling for a new trial.\nGlossip, 62, was convicted in the 1997 murder of the owner of an Oklahoma City motel where he worked. He has had nine execution dates postponed, and eaten his \"last meal\" three times.\nJustice Sonia Sotomayor wrote in Tuesday's opinion for the court: \"We conclude that the prosecution violated its constitutional obligation to correct false testimony.\"\nShe was joined in the ruling by fellow liberal justices Elena Kagan and Ketanji Brown Jackson. Brett Kavanaugh and Chief Justice John Roberts, both conservatives, also joined the opinion.\nJustice Amy Coney Barrett, another conservative, agreed with the opinion but said she would have sent the case back for more proceedings.\nJustice Neil Gorsuch did not join in the case.\nDon Knight, an attorney for Glossip, called the ruling \"a victory for justice and fairness in our judicial system\".\nThe defence lawyer said Glossip will be given the chance to have a fair trial \"that he has always been denied\".\nIt will be up to Oklahoma prosecutors to determine how to proceed with his case.\nGlossip has maintained his innocence for 27 years.\nHis boss, Barry Van Treese, owner of the Best Budget Inn motel in Oklahoma City , was beaten to death with a baseball bat in 1997.\nGlossip's colleague, Justin Sneed, was convicted of the killing, but said Glossip had told him to carry out the murder.\nSneed confessed to the murder but was able to evade execution by accepting a plea deal that involved testifying that Glossip paid him $10,000 to do it.\nGlossip admitted to assisting Sneed in covering up the murder after it happened, but denied knowing of any plan to kill Van Treese.\nIt has since emerged that prosecutors did not disclose that Sneed, a methamphetamine addict, had been treated for a serious psychiatric condition.\n\"Had the prosecution corrected Sneed on the stand, his credibility plainly would have suffered,\" Justice Sotomayor wrote.\n\"That correction would have revealed to the jury not just that Sneed was untrustworthy ... but also that Sneed was willing to lie to them under oath.\"\nGlossip was first convicted in 1998, but that was overturned in 2001. He was convicted again three years later.\nIn 2015, just a few steps away from the execution chamber, his execution was halted to review the lethal injection drugs.\nIn 2023, the Supreme Court intervened after Oklahoma's attorney general and Glossip asked for a new trial.\nA number of big names have backed Glossip's efforts in the past including Pope Francis, Kim Kardashian and Sir Richard Branson.", "url": "https://www.bbc.co.uk/news/articles/c2417q5y2z0o"}