{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:58:22", "date_modify": "2025-04-26 06:58:22", "date_publish": "2025-02-28 13:42:13", "description": "Mussie Imnetu died in hospital four days after he was kicked and punched in the street.", "filename": "news_articles_c4geegxk81xo_1745650702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0c2a/live/43337660-f5d5-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4geegxk81xo_1745650702.html", "title": "Mussie Imnetu murder: Chef's killer Omar Wilson jailed for life", "title_page": "Mussie Imnetu murder: Chef's killer Omar Wilson jailed for life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who attacked an acclaimed chef near the Notting Hill Carnival and left him dying in the street has been jailed for life.\nCharity worker Omar Wilson, 31, punched and kicked Mussie Imnetu during a row outside a restaurant in Queensway, west London, on 26 August last year.\nMr Imnetu, 41, who had worked under chefs including Gordon Ramsay and Marcus Wareing, was said to have been \"heavily intoxicated\" at the time of the attack and died in hospital four days later.\nSentencing the defendant at the Old Bailey to a minimum prison term of 18 years, Judge Philip Katz said: \"You could not control your temper... you could have walked away.\"\nDuring the trial, the jury had been shown CCTV footage showing Wilson approaching Mr Imnetu and headbutting him.\nAbout a minute later, Wilson punched Mr Imnetu five times in the head, causing him to fall to the ground.\nWilson continued to punch Mr Imnetu repeatedly while he was on his hands and knees, then kicked him in the head.\nJudge Katz told Wilson: \"It needs to be clearly understood that unlawful street violence of this sort impacts on the confidence of members of the public to go out and enjoy themselves.\n\"The culpability of those involved in such brazen conduct is significantly raised.\"\nHe continued: \"Only a few seconds after punches were aimed by both of you, you tripped Mussie and he fell to the ground... As he knelt, you rained further punches down on his head.\"\nJudge Katz told Wilson that instead of walking away, \"you stood up, raised your leg and kicked him hard to the head.\n\"Kicking someone to the head when they are defenceless on the ground is abhorrent.\"\nIn the aftermath of the attack, Wilson told an associate he \"crossed the line\", the jury previously heard.\nIn a message, he admitted: \"There's a monster in me, man, and it's just like sometimes it comes out.\n\"And I think I've messed up now, I've messed up, everything's finished.\"\nFollowing his arrest two days after the attack, Wilson, from Leytonstone in east London, told police he had struck the victim in self-defence and claimed Mr Imnetu was behaving erratically, harassing girls, and had a bottle as a weapon.\nBut Judge Katz said the defendant's evidence that he believed Mr Imnetu had hit with him a broken bottle was \"a deliberate lie\".", "url": "https://www.bbc.co.uk/news/articles/c4geegxk81xo"}