{"authors": ["Bob Dale", "www.facebook.com"], "date_download": "2025-04-26 08:01:45", "date_modify": "2025-04-26 08:01:45", "date_publish": "2025-02-26 17:20:31", "description": "Martin Chessman and Jeremy Rose died in a multiple-vehicle crash on the morning of 27 January.", "filename": "news_articles_crmj79pmj71o_1745654505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16f6/live/acc75a20-f458-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmj79pmj71o_1745654505.html", "title": "Family tributes paid to two men killed in Shepperton car crash", "title_page": "Family tributes paid to two men killed in Shepperton car crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The families of two men who died in a crash have paid tribute to them.\nMartin Chessman, 58, and Jeremy Rose, 51, were killed in a multiple-vehicle collision in Shepperton, Surrey, shortly after 07:00 GMT on 27 January.\nIn a statement issued through police, Mr Chessman's family said he \"made the most out of this life and will be sorely missed by all who knew and loved him\".\nMr Rose's family said he \"was a much-loved son, brother and friend that has spent many years working in the film industry\", who \"will be sorely missed\".\nMr Chessman, who lived in Ashford but was originally from Chertsey, was described as \"a loving partner, father, brother, son, uncle and friend\".\nHe is survived by his children, Adam and Jessica, his wife Diana and three siblings, Julie, Peter and Lisa.\n\"Martin's generosity knew no bounds and he would always make time in his day if someone needed him,\" said his family in the statement.\n\"His great sense of humour and charismatic nature always managed to bring out a smile in everyone - no matter the circumstances - and he was someone that you could approach with absolutely anything.\n\"Martin simply brought joy to the world.\n\"He had a great love for music and was a massive Crystal Palace fan, being a season ticket holder for as long as anyone can remember.\n\"Martin really made the most out of this life and will be sorely missed by all who knew and loved him.\"", "url": "https://www.bbc.co.uk/news/articles/crmj79pmj71o"}