{"authors": ["Ana Faguy", "www.facebook.com"], "date_download": "2025-04-26 06:56:21", "date_modify": "2025-04-26 06:56:21", "date_publish": "2025-02-28 15:01:53", "description": "Thousands of workers have been fired by the Trump administration as part of its effort to slash the federal workforce.", "filename": "news_articles_clydd7zeye7o_1745650581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b6dc/live/23cd9710-f5d5-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clydd7zeye7o_1745650581.html", "title": "US judge says mass firings of some federal workers likely illegal", "title_page": "US judge says mass firings of some federal workers likely illegal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A California judge has said the mass firings of probationary employees by the Trump administration were likely unlawful.\nThe ruling said the Office of Personnel Management (OPM) had told thousands of employees across a handful of federal agencies they were fired using authority the agency does not have, US District Judge William Alsup ruled.\n\"[OPM] does not have any authority whatsoever, under any statute in the history of the universe, to hire and fire employees at another agency,\" he said. \"They can hire and fire their own employees.\"\nIn court the government argued OPM asked, not ordered, the agencies to fire these employees.\nThey also argued that probationary employees are not guaranteed employment and that only the highest performing and mission-critical employees should be hired.\nGovernment workers have been the target of the Trump administration's efforts to reduce the federal workforce in the name of cutting costs.\nMany employees affected by the firings are probationary employees - usually those in their first or second year in a job - though they can sometimes be long-time employees who were recently promoted.\nThere are some 200,000 probationary employees in the federal workforce.\nJudge Alsup ordered OPM to revoke its directives to multiples agencies - including the Department of Veterans Affairs, the National Park Service, and the Defence Department - to terminate employees.\nHe issued a temporary restraining order which puts a momentary pause on the government's actions until a judge revisits the matter in the coming weeks.\nThe case began after a coalition of labour unions and non-profit organisations sued the government, arguing OPM unlawfully fired individuals by falsely claiming workers were performing poorly.\nEverett Kelley, the National President of the American Federation of Government Employees, called the ruling a victory for Americans were were \"illegally fired\" from their jobs by an agency with \"no authority to do so\".\n\"These are rank-and-file workers who joined the federal government to make a difference in their communities, only to be suddenly terminated due to this administration's disdain for federal employees and desire to privatize their work,\" he said.\nOPM declined the BBC's request for comment.", "url": "https://www.bbc.co.uk/news/articles/clydd7zeye7o"}