{"authors": ["Paul O'Hare and Steven Godden", "www.facebook.com"], "date_download": "2025-04-26 06:56:39", "date_modify": "2025-04-26 06:56:39", "date_publish": "2025-02-28 14:40:13", "description": "Demi Hannaway died in May 2021 after being the subject of physical and mental abuse at the hands of Andrew Brown.", "filename": "news_articles_cdxqq32wvw7o_1745650599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7365/live/ec3e7e30-f5bc-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxqq32wvw7o_1745650599.html", "title": "New investigation ordered into abuse victim's death", "title_page": "Demi Hannaway: New investigation ordered into abuse victim's death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scotland's most senior law officer has ordered a fresh investigation into the death of a woman who was abused by her partner.\nDemi Hannaway, from Airdrie, died in May 2021 after being the subject of physical and mental abuse at the hands of Andrew Brown.\nHer family said they were \"over the moon\" at the move, which was confirmed during a meeting with Lord Advocate Dorothy Bain KC.\nThey previously said Police Scotland were too quick to conclude that the 23-year-old had killed herself.\nDemi's mother Helen Simpson told BBC Scotland News: \"We are just overwhelmed at the moment.\n\"It has been a long fight but, finally, our daughter's voice has been heard.\"\nThe lord advocate said: \"I understand the huge loss felt by everyone who loved Demi and their desire to know what happened to her.\n\"The details of Demi's passing have been discussed with her parents.\n\"In recognition of their ongoing concerns, I have instructed a reinvestigation by a team of specialist prosecutors to ensure that every aspect of this tragedy is addressed.\"\nMs Bain added she valued meeting the family and hearing their views.\nShe added: \"We will remain in contact with them and continue to provide updates as the reinvestigation progresses.\"\nBBC Scotland News previously told how the family lodged a 32-point formal complaint to the force which highlighted its serious concerns over the police response.\nThe issues identified include:\nOfficers taking an hour to arrive at Demi's home.\nClaims that Brown told a police officer it was \"all his fault\".\nEvidence, they say, of a violent struggle in the house.\nThe mother-of-two's phone was also found, by her family, under her bed smashed with the sim card missing after officers left.\nBrown, 33, was jailed for three years and seven months at Airdrie Sheriff Court last May after admitting threatening and abusive behaviour.\nAfter his conviction, Ms Simpson described him as a \"danger to women\" and said the charge should have been upgraded to culpable homicide.\nThe couple first met in 2016 and moved in together after she became pregnant with their first child.\nPolice Scotland initially ruled Demi's death was non-suspicious.\nBut it later emerged she had made a call to a friend asking him to get Brown out of their house hours before she died at about 06:00 on 13 May 2021.\nDemi's sister, Caitlin, later accessed her phone and uncovered images showing injuries caused by Brown.\nThese included pictures of bruising around her eye and neck that Demi had photographed before her death.\nThere were also messages from Brown calling her a \"cancerous cow\" and telling her he \"hoped she would die\".\nDemi's father, John, said they had no idea about the abuse during the pair's relationship and said she had \"sung his praises\" when they were together.\nFriends also came forward to share their experience of the pair's relationship as part of the initial three-year Crown Office investigation.\nBrown was jailed for 43 months, but the family believes his sentence should have been longer.\nThe issue of suicides after prolonged domestic abuse has featured in a number of high profile cases south of the border.\nThese include the death of Kiena Dawes, whose former partner Ryan Wellings was jailed in January for assault and coercive behaviour.\nAnd last year the parents of Roisin Hunter Bennett, who killed herself after suffering domestic abuse, called on coroners to have more understanding of the impact of coercive control.\nBut there are also rarer cases where domestic abuse killings are staged as suicide.\nCampaigners want police to treat all sudden unexpected deaths where the victim has suffered domestic abuse as potential femicide.\nA Home Office report in 2015 looked at 32 unexpected deaths that police had concluded were not suspicious but were then re-examined by forensic pathologists.\nTen transpired to be killings and a further five were suspicious and required further investigation.\nStuart Munro, the solicitor representing Demi's family, said they were confident the reinvestigation would \"allow the truth to finally be told\".\nHe added: \"They are overjoyed to know that, at last, there is the prospect of Demi receiving justice.\n\"Two young kids have been left without a mother because of this.\"\nMr Munro, of Glasgow-based Livingstone Brown, said it was likely the reinvestigation would take a number of months.\nAssistant Chief Constable Steve Johnson acknowledged the significant impact Demi's death continues to have on her family and friends.\nHe added: \"Police Scotland is committed to supporting them with answers to the questions they have around her death.\n\"This remains an extremely difficult time for the family, but I want to reassure them that officers from our professional standards department are working hard to address their complaints about how the investigation was handled as quickly as possible and will respond to them as soon as that work is complete.\n\"We must ensure that Demi's family are the first to receive that response, so it would be inappropriate to comment further at this stage.\"\nIf you have been affected by the issues in this story, help and support is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/cdxqq32wvw7o"}