{"authors": ["Shehnaz Khan", "www.facebook.com"], "date_download": "2025-04-26 06:40:48", "date_modify": "2025-04-26 06:40:48", "date_publish": "2025-03-02 13:40:31", "description": "The exhibition will portray the lived experiences of a South Asian family from 1968 to 2010.", "filename": "news_articles_cq8y0djd2xko_1745649648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e69/live/f4508fe0-f766-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq8y0djd2xko_1745649648.html", "title": "New exhibition to celebrate Coventry's South Asian communities", "title_page": "New exhibition to celebrate Coventry's South Asian communities - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new exhibition celebrating the heritage of South Asian communities in Coventry is to open later this year after receiving funding.\nStories That Made Us: Roots, Resilience, Representation, will open at the Herbert Art Gallery & Museum on 14 November.\nCulture Coventry Trust announced on Wednesday it had received a £131,350 grant from The National Lottery Heritage Fund to support the project.\nMarguerite Nugent, the trust's cultural director, said they could bring stories from the city's South Asian communities to life in a way that acknowledged the \"deep cultural impact\" they had made.\n\"It's about building bridges between communities and we hope this will lead to a deeper understanding of our shared history,\" Ms Nugent added.\nAccording to the 2021 census, about 18.5%, external of Coventry's population identified as Asian or Asian British, but Herbert said they were \"often underrepresented\" in public collections or exhibitions.\nThe exhibition will portray the lived experiences of a South Asian family in the city from 1968 to 2010, drawing on Coventry Archives' Virk Collection and Hardish Virk's Stories That Made Us Collection.\nIt will include photographs, books, magazines, vinyl records and other memorabilia.", "url": "https://www.bbc.co.uk/news/articles/cq8y0djd2xko"}