{"authors": ["Samantha Jagger", "www.facebook.com"], "date_download": "2025-04-26 06:17:52", "date_modify": "2025-04-26 06:17:52", "date_publish": "2025-03-01 07:34:45", "description": "Two mums who lost children to cardiac arrests are providing young people with free heart screenings.", "filename": "news_articles_ce98npxv3dko_1745648272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a829/live/ce5ffe10-f4ff-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce98npxv3dko_1745648272.html", "title": "Grieving mothers' heartbreak fuels Cumbria heart campaign", "title_page": "Grieving mothers' heartbreak fuels Cumbria heart campaign - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two mothers who met over the \"horrific heartbreak\" of losing their two children to cardiac arrest are working together to provide free screenings.\nDonna Parker's daughter Vicky Parker, 30, died in August 2023. The mother-of-two, from Dalton-in-Furness, Cumbria, had an undiagnosed heart condition.\nTwo weeks later, Lesley Mease's son Wilson Shepherd, 25, who lived a few miles away in Barrow, also died.\nThe two women said they had a \"life sentence of heartbreak\" but added they \"were meant to meet\" and encourage young people to get their hearts screened.\nDescribing the moment the two mums met, Mrs Parker said she looked into Miss Mease's eyes and \"it was like looking in a mirror... there was an emptiness there\".\n\"She has the same look I have in my eyes,\" she said, adding: \"It is the most strange feeling.\n\"The same time that Lesley found her son at home was the same time that Vicky's funeral started.\n\"I said to Lesley that we were meant to meet. Obviously not in the way we want to meet but it's the way we have.\"\nMiss Mease described Wilson as \"young, fit, healthy and well\".\nShe said her son was a keen triathlete and had just achieved a first class honours degree in electrical and electronic engineering.\n\"Sadly, he did not get the chance to finish his masters,\" she said.\n\"Not in a million years did I think this would happen to my son.\n\"There was no warning, no symptoms - it has been truly horrific, excruciatingly painful and a life sentence of heartache.\".", "url": "https://www.bbc.co.uk/news/articles/ce98npxv3dko"}