{"authors": ["Mansur Abubakar", "www.facebook.com"], "date_download": "2025-04-26 04:23:49", "date_modify": "2025-04-26 04:23:49", "date_publish": "2025-03-03 13:02:05", "description": "A total of 25 people are arrested for either not fasting or selling food during the fasting month.", "filename": "news_articles_c7890jkn3g2o_1745641429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/97cc/live/accf8540-f82e-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7890jkn3g2o_1745641429.html", "title": "Kano's Islamic police arrest Nigerian Muslims for eating in public during Ramadan", "title_page": "Kano's Islamic police arrest Nigerian Muslims for eating in public during Ramadan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Islamic police in the northern Nigerian state of Kano have arrested Muslims seen eating and drinking publicly, as well as those selling food at the start of Ramadan, when Muslims are supposed to fast from dawn until dusk.\nThe deputy commander of the Hisbah, Mujahid Aminudeen, told the BBC that 20 people had been arrested for not fasting and five for selling food, and that the operations would continue throughout the month, which began on Saturday.\n\"It is important to note that we don't concern ourselves with non-Muslims,\" he said.\nMr Aminudeen said any \"disrespect\" for Ramadan would not be condoned.\n\"It's heart-breaking that in such a holy month meant for fasting, adult Muslims would be seen eating and drinking publicly. We won't condone that and that's why we went out to make arrests,\" he said.\nHe said all 25 had been charged in a Sharia court and would be punished accordingly.\nThe Hisbah official added that they sometimes get tip-offs when people are seen eating.\n\"We do get calls from people who are enraged after seeing people eating in public and we act fast by going to the area to make arrests.\"\nHe also confirmed the arrest of other people who were seen with \"inappropriate haircuts\", wearing shorts above the knee and tricycle drivers mixing male and female passengers.\nLast year, those arrested for not fasting were freed after promising to fast, while the relatives or guardians of some of them were summoned and ordered to monitor them to make sure they fast.\nThose arrested this year were not so lucky as they will have to face the court.\nJust over two decades ago, Sharia, or Islamic law, was introduced to work alongside secular law in 12 of Nigeria's northern states that have a majority Muslim population. Sharia does not apply to the Christian minorities living in the states.\nRamadan, the ninth month of the Islamic calendar, has a special significance in Islam.\nIt is during this month that Muslims believe the first verses of the Quran - Islam's holy book - were revealed to Prophet Muhammad.\nFasting is one of the Five Pillars of Islam, which lay the basis for how Muslims are required to live their lives. The fast is observed during daylight hours.\nRamadan usually last 29 or 30 days, and is expected to end on Sunday 30 March.", "url": "https://www.bbc.co.uk/news/articles/c7890jkn3g2o"}