{"authors": ["Aisha Iqbal", "www.facebook.com"], "date_download": "2025-04-26 06:50:37", "date_modify": "2025-04-26 06:50:37", "date_publish": "2025-03-01 07:41:30", "description": "Manston Surgery in Leeds has turned things around since two previous inspections, a watchdog finds.", "filename": "news_articles_crmj70lje19o_1745650237.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9021/live/5c3e1360-f439-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmj70lje19o_1745650237.html", "title": "GP surgery taken out of special measures", "title_page": "Leeds Crossgates GP surgery taken out of special measures - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A GP surgery which was previously put in special measures after being deemed \"inadequate\" has had its rating upgraded after making \"significant improvements\", a health watchdog has said.\nManston Surgery in Crossgates, Leeds, was given two warning notices in January last year by the Care Quality Commission (CQC) over concerns about care and leadership standards.\nIn a follow-up visit in May, CQC inspectors said they had found further evidence of poor management which they said affected the safety of patients.\nHowever, a new report from the regulator said following its latest inspection in November, things had improved sufficiently for it to be upgraded to \"good\".\nThe surgery has more than 8,000 patients on its books and also operates another branch, Scholes Surgery, which was included in the latest inspection and ratings.\nThe CQC's new evaluation highlighted the work done to improve care and leadership, adding that there had also been notable improvements around effectiveness and responsiveness.\nSheila Grant, the CQC's deputy director of operations in the North, said that while there were some areas that \"still needed improvement\", including around \"safe recruitment and medicines management\", surgery bosses were \"aware of these issues\".\nThey were being supported by another GP practice and other local stakeholders to address those issues, Ms Grant said.\nWhile some new safety systems still needed work to become embedded, Ms Grant said that efforts were being made to ensure that happened, especially using patient feedback.", "url": "https://www.bbc.co.uk/news/articles/crmj70lje19o"}