{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:55:10", "date_modify": "2025-04-26 03:55:10", "date_publish": "2025-03-04 16:35:51", "description": "Two men and a 17-year-old boy deny murdering Lewis Bell in Stockton in September.", "filename": "news_articles_c234g4yjm4lo_1745639710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/77f2/live/18741b00-f8eb-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c234g4yjm4lo_1745639710.html", "title": "Stockton man 'chased down and killed in drug feud'", "title_page": "Stockton man 'chased down and killed in drug feud' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man was chased down and stabbed to death as he pleaded for his life during a feud over drugs, a murder trial has heard.\nLewis Bell, 26, was fatally knifed in the back on Hills Drive in Stockton in September, Teesside Crown Court heard.\nLiam Matthews, 26, and Sean McLeod, 23, both of no fixed abode, and a 17-year-old who cannot be named all deny murder.\nOpening the case, prosecutor Peter Makepeace KC said the killing centred around a crack cocaine den on Norton Road in Stockton.\nHe said Mr Bell, a drug user, had \"become a nuisance\" and was suspected of robbing other visitors of their drugs as they left the crack house, causing \"reputational damage\" to the dealers inside.\nThe three defendants all had links to the house and security was a \"very real concern\", Mr Makepeace said.\n\"The business needs protection not only from the obvious risk of the police and law enforcement but, perhaps more importantly, from other dealers who may want to tax the operation, that is raid the premises and steal the money and drugs that may be kept there,\" he told jurors.\nAt about midnight on 19 September, Mr Bell was captured on CCTV running away from the crack house with the three defendants chasing behind, the court heard.\nMr Makepeace said he appeared to be \"running for his life\".\nMr Bell was knocked the ground and \"viciously\" attacked, the prosecutor said, adding he was \"beleaguered\" as he was \"assailed by further blows\".\nMr Bell could be heard \"begging for his life\" and repeatedly shouting \"please\" and \"it's gone in my heart\".", "url": "https://www.bbc.co.uk/news/articles/c234g4yjm4lo"}