{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:54:25", "date_modify": "2025-04-26 07:54:25", "date_publish": "2025-02-25 13:21:23", "description": "Employers count the cost of a triple whammy of National Insurance, business rates and wage rises.", "filename": "news_articles_cx2ey7g9z5no_1745654065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a212/live/c9881f10-f371-11ef-8402-45d3cf1c2dcb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2ey7g9z5no_1745654065.html", "title": "Tax and wage hikes to cost restauranteur '£270,000 per year'", "title_page": "Tax and wage hikes to cost restauranteur '£270,000 per year' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A restaurant owner has said he will have to find an extra £270,000 this year to cover forthcoming tax rises and increased staffing costs.\nEamon McCusker employs 116 staff across three sites in Belfast - two Chubby Cherub restaurants and AMPM in Upper Arthur Street.\nLike most employers in Northern Ireland, he faces a rise in National Insurance bills, a hike in minimum wage levels and an increase in business rates from April.\nHe said the additional costs have left the hospitality industry facing \"really tough decisions\".\nThe restauranteur said businesses like his would have to either raise their prices, cut their opening hours, forego investment or a combination of all three.\n\"It equates to us having to find an additional £270,000 a year - just to stay static,\" he told the Good Morning Ulster programme.\n\"That's with the caveat that there are no supplier increases - which of course there will be.\"\nChancellor Rachel Reeves announced the National Insurance hike in her last budget, saying the government needed to raise money to secure public finances.\nNational Insurance contributions help to fund the NHS and pay the UK's benefits bill, including the cost of state pensions.\nThe contributions are paid by both employers and their staff, but in April it is only employers' National Insurance contributions that will rise - from 13.8% to 15%.\nAt the same time. the minimum wage for workers aged over 21 will rise from £11.44 to £12.21, with apprentices and 18 to 20-year-olds also seeing an increase.\nBusiness organisations have warned the changes could lead to job losses as employers cut back on staff costs in order to manage their bills.\nSome pharmacies in Northern Ireland have appealed to the government for help covering the costs.\nMr McCusker has run AMPM for the past 23 years but said the rising costs of running a restaurant have made it a tough trade in which to make money.\n\"There's kind of an assumption made within our industry that because you're busy, you're profitable. That is actually not true,\" he said.\n\"Viable businesses are going to have to close if they do not focus on profitability.\"\nThe restaurateur explained it was a difficult time to consider raising the prices that they charge customers because \"the affordability just isn't there\".\nHe said venues risk \"pricing ourselves out of the market\" if they charge too much when people are still struggling with the cost of living.\nHe added the one thing restaurants can control is their opening hours - only operating at profitable times - but this also can have negative consequences.\n\"Industry colleagues are going to close Mondays, Tuesdays and Wednesdays,\" he said.\n\"So what you'll be left with is a soulless city, a soulless hospitality industry, a reduction in tourism and you will have the inability to grow.\"\nHe argued that the cost rises were \"reductive policies\" which stifled progress.\n\"They are policies that are actually going to force people like me to basically hold off on investment, not only just physically on capital spend, but also in training and creating a better product and a better service and investing in your people.\"\nThe rising cost of doing business is also hitting retailers hard.\nShop owner Peter McBride estimates his staff costs will rise by about £800,000 this year.\n\"It's just really, really hard to sustain,\" he said.\nHe has been in the industry for 37 years, having bought the convenience store he worked part-time in as a student in 1988.\nHe now owns 16 Spar shops, mainly across counties Tyrone and Fermanagh, and in total he employs 540 staff.\nMr McBride said he was not overly concerned by the rise in the minimum wage as that is a hike they expect every year.\n\"You need to pay fair wages and get fair work,\" he said.\n\"The biggest issue is generally with the National Insurance because not only did the government increase the rate that you pay it at, they also decreased the threshold.\"\nAt the moment businesses pay National Insurance on all employees' earnings above £9,100 a year, but in April that threshold will fall to £5,000.\n\"With 540 staff across the group, it's coming in around a 10% increase which is running at £800,000 extra this year,\" Mr McBride said.\n\"Another way of putting it is it's £15,000 per week and that's massive for what's really still a local convenience store business.\"\nAnalysis by Clodagh Rice, BBC News NI business correspondent:\nWe have known these increases have been coming since last year's Budget, but what is only becoming clearer as we edge closer to April is how employers will react.\nThey face difficult decisions - to cut jobs or staff hours? To put prices up? To put investment plans on hold?\nWhile businesses are resilient and will work to find a solution, the impact of pausing or cancelling expansion plans will restrict economic growth.\nThe timing of the increases will also be felt sharply by sectors still facing soaring food and energy costs, higher interest rates, as well as those still recovering from the pandemic.\nFor some, it could be the final straw which makes them decide to close altogether.", "url": "https://www.bbc.co.uk/news/articles/cx2ey7g9z5no"}