{"authors": ["Daniel Sandford", "Victoria Cook", "www.facebook.com"], "date_download": "2025-04-26 03:49:42", "date_modify": "2025-04-26 03:49:42", "date_publish": "2025-03-05 13:23:20", "description": "Video evidence shows Zhenhao Zou could have as many as 50 victims, the Met Police says.", "filename": "news_articles_cwyjxv1j9g8o_1745639382.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/20fc/live/e67b6d10-f9da-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyjxv1j9g8o_1745639382.html", "title": "Zhenhao Zou: London student guilty of multiple counts of rape", "title_page": "Zhenhao Zou: London student guilty of multiple counts of rape - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A PhD student who has been convicted of drugging and raping 10 women \"may turn out to be one of the most prolific sexual predators that we've ever seen in this country\", according to the lead detective on the case.\nChinese national Zhenhao Zou, 28, attacked two women who have been identified and another eight who have yet to be traced, his trial at Inner London Crown Court heard.\nThe University College London (UCL) student filmed nine assaults as \"souvenirs\", and kept a trophy box of victims' belongings including jewellery and clothing.\nJudge Rosina Cottage said Zou was a \"dangerous and predatory\" offender and warned him he faces a \"very long\" jail term when he is sentenced on 19 June.\nThe Met Police's Cdr Kevin Southworth said the video evidence showed there may be as many as 50 further victims, whom they are \"desperate to trace\".\n\"Such is the insidious nature of these offences, I think there is a possibility that many more victim survivors may not even know that he has, in fact, raped them,\" he said.\nFollowing the trial and as a result of the media coverage, the Met confirmed that one woman had already been in touch about Zou.\nAs well as 11 counts of rape, Zou was found guilty of voyeurism, possession of extreme pornographic images and false imprisonment.\nThe crimes he has been convicted of took place between 2019 and 2024.\nHidden cameras were discovered by the Met Police in his bedroom, as well as ecstasy and an industrial chemical the human body turns into the \"date-rape\" drug GHB.\nSeven of the rapes happened during the pandemic in China. The evidence of those attacks was videos shown to the jury that Zou kept of him having sex with unconscious and semi-conscious women. Police have never identified them.\nFour of the rapes took place in London. Two women were identified and gave evidence; the other two rapes were of the same woman, but she has never been tracked down.\nJurors had to watch footage of nine of the rapes during court proceedings, appearing visibly upset and being given regular breaks as the material was shown.\nSome of the attacks were filmed at his flats in Bloomsbury and Elephant and Castle, others at an unknown location in China.\nThe prosecutions relating to attacks in China were possible because foreign nationals who are living in the UK can be charged with an offence committed abroad that is also illegal in the country where it took place.\nIn his defence, Zou told the jury he had discussed sexual preferences with one of the women he filmed, and she had said she liked \"uniform role play\".\n\"We specifically discussed the kinds of role play I like, which was rape role play,\" he said. He told the court this was how the videos came to be made.\nThe Met Police has launched an appeal to find any other victims.\n\"If you're a woman who's in any way had a one-on-one encounter with this man Zou, then we would like to hear from you,\" Cdr Southworth said.\nThe force said it was particularly keen to hear from women from the Chinese student community who may have met Zou and were living in and around London between 2019 and 2024.\nThe Met said it would also like to speak to potential victims who may have met Zou while he was living in China. Reports to the force can be made online via the Major Incident Public Portal, external.\nSaira Pike from the Crown Prosecution Service said: \"I'd like to express my heartfelt thanks to the courageous women who came forward to report Zhenhao Zou's heinous crimes.\n\"They have been incredibly strong and brave – there is no doubt that their evidence helped us to secure today's verdict.\n\"Zou is a serial rapist and a danger to women.\"", "url": "https://www.bbc.co.uk/news/articles/cwyjxv1j9g8o"}