{"authors": ["Iolo Cheung", "www.facebook.com"], "date_download": "2025-04-26 04:02:46", "date_modify": "2025-04-26 04:02:46", "date_publish": "2025-03-03 22:47:20", "description": "The story of a coach driver pictured at the heart of a Covid controversy.", "filename": "news_articles_cj67rpn2z6ro_1745640166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c87d/live/97076b90-f876-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj67rpn2z6ro_1745640166.html", "title": "'I was one of the Wuhan Covid bus drivers - and I'd do it again'", "title_page": "'I was one of the Wuhan Covid bus drivers - and I'd do it again' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It's five years since he had his face splashed across the news, and Andy Simonds still gets asked about the image - anxious expression, hands gripping the wheel, as a medic in a hazmat suit is seated behind him.\n\"I've seen people on social media question 'how is he, is he alive?' 'Is he dead?' 'What happened to the poor driver?',\" he says now with a wry smile.\nThe job that day? Transporting passengers who had just landed in the UK from Wuhan, China to a secure medical facility - at a time when coronavirus fears were spreading rapidly.\nThe saga for Andy, 62, who now lives in Newport, even included a call from chief medic Chris Whitty offering him advice.\nOn 29 January 2020, Andy was called in to his manager's office at Horseman Coaches, the Reading-based company where he worked.\nCoronavirus fears were already sweeping through China, and an urgent evacuation flight had been arranged to bring stranded Brits home from the virus epicentre, Wuhan.\nAndy was told the company had agreed to transport those passengers from RAF Brize Norton, where they would be landing, to a secure quarantine facility on the Wirral, Merseyside.\nAlthough he and his colleagues tentatively agreed – thanks in part to a £100 bonus on offer – there were still \"concerns\" regarding what was a relatively unknown virus at the time.\n\"So that evening, I went home and phoned 111,\" said Andy.\n\"They said someone would get back to me.\"\nShortly afterwards, he was called by none other than England's Chief Medical Officer Sir Chris Whitty.\n\"At the time I didn't know who he was, and he answered the questions and doubts that my colleagues had, and reassured me,\" he said.\n\"The following morning I went to work, told my colleagues, and we were all happy to do it.\"\nOn 31 January – a day after the first confirmed Covid cases in the UK – Andy and his colleagues arrived at Brize Norton in a \"relaxed mood\", having been assured of the low risk.\nBut as they awaited the passengers from Wuhan, more medical staff, police officers, military personnel and government officials started arriving, and the gravity of the situation dawned on them.\n\"When the officials came in, it was then a reality situation, especially when the briefing was given to us, and I realised this is serious,\" said Andy.\n\"On a personal level, it turned my stomach – it was 'oh, this is real'.\"\nSetting off from Oxfordshire, the convoy of coaches was immediately caught in a media storm as cameras captured their departure.\nThe pictures sparked controversy online, with social media users questioning why the bus drivers had no protective masks or clothing, while the medics sat behind them were fully kitted in protective suits.\nThe reality, says Andy, was safer than it appeared.\n\"Having [the medic] sat behind me, it was like Darth Vader being there, because of the breathing through the apparatus,\" he said.\n\"It was amusing. We had conversation.\n\"He was basically there to react if there was an emergency on the back of the coach. It was proactive, rather than reactive.\"\nThe passengers were seated at the back of the coach, and Andy had a window open – a precaution which only later became standard Covid prevention practice.\n\"Whilst there was a lot of questions – why hasn't he got a mask on? – we didn't perceive there to be a risk,\" Andy added.\n\"And to this day, touch wood, I've never had Covid.\"\nIt was not long before Andy saw the picture of himself at the wheel – though again, his seemingly worried expression at the time was not quite what it seemed.\n\"When I saw the picture my first thought was, 'you miserable so and so',\" he says.\n\"But I was just focusing on the road. We had media, paparazzi, all lined on both sides, flash guns going off.\n\"And my thought was, 'wow, what's going on here?'. Because we didn't realise what impact it was going to have.\"\nAfter arriving at Arrowe Park Hospital that evening, Andy and his fellow coach drivers were put up in a hotel, still oblivious to the extent of the media attention.\n\"It was only the next day that we started seeing it on the breakfast news and we realised the impact it was having nationwide,\" said Andy.\nStill in the previous day's clothes, the drivers went to a nearby retail park to pick up supplies but were recognised, and had to flee through the back exit of a store.\n\"We did feel, not at risk, but uncomfortable – we didn't want the confrontation,\" said Andy.\n\"We were just doing our jobs.\n\"We returned to the hotel with explicit instructions not to leave, because of the potential risk in causing more uproar.\"\nBy 23 March, the UK also found itself in coronavirus lockdown, as the trickle of cases from early in the year became a full scale pandemic.\nWith overseas travel grinding to a halt, Andy left his job as a coach driver later that year and retrained as a telecommunications engineer.\nHe also moved back to his family's homeland, settling in Caerleon, Newport.\n\"It's a completely different way of life – I've got the mountains up the road, the sea just down the road,\" he said.\n\"I wish I'd done it sooner.\"\nThere are no regrets, however, when it comes to looking back on the role he played in one of the Covid pandemic's big early moments.\n\"It was an adverse time, but we came through it,\" says Andy.\n\"And I'd do it again.\n\"If I was in that situation, I'd want someone to transport me back home and make me safe.\n\"Wherever we had to repatriate people across the world in certain incidents, someone would have to do that job.\n\"So I don't feel any negatives as to how I did it, and why I did it.\"", "url": "https://www.bbc.co.uk/news/articles/cj67rpn2z6ro"}