{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:51", "date_modify": "2025-05-19 14:47:51", "date_publish": "2015-02-24 14:17:01", "description": "India's Hindu nationalist BJP is to be part of a coalition government for the first time in Muslim majority Jammu and Kashmir.", "filename": "news_world-asia-india-31598836_1747666071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81203000/jpg/_81203714_79888825.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-india-31598836_1747666071.html", "title": "Kashmir: India's BJP and PDP announce coalition", "title_page": "Kashmir: India's BJP and PDP announce coalition - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "India's ruling Bharatiya Janata Party (BJP) will be part of a coalition government in Indian-administered Kashmir, two months after polls there produced no clear winner.\nThe BJP and the People's Democratic Party (PDP) announced the deal after talks in the capital, Delhi.\nIt is the first time the Hindu nationalist BJP have been in government in India's only Muslim majority state.\nThe party won 25 seats and the PDP 28 in the 87-member state assembly.\nVotes were counted on 23 December after five rounds of voting during the previous month.\n\"We have had discussions over several weeks and fortunately, we have agreed a deal,\" PDP chief Mehbooba Mufti told reporters.\nMs Mufti, who appeared alongside BJP chief Amit Shah, said her father and PDP candidate for chief minister Mufti Mohammad Sayeed would soon meet Prime Minister Narendra Modi. The details of the agreement would be shared after that, she said.\nIndian media reports, quoting sources, say Mr Sayeed is expected to be sworn in as chief minister on 1 March.\nThe disputed Kashmir region is claimed by both India and Pakistan.\nIt has been a flashpoint for more than 60 years and the rivals have fought two wars over the region.\nThe politics of Kashmir has long been dominated by the PDP and another regional party, the National Conference.\nThe BJP has never been a serious contender in the predominantly Muslim Kashmir valley, given its hard-line views on the state's relationship with India.\nBut in the run-up to the assembly elections Prime Minister Modi - who won national elections in May - campaigned extensively in the Hindu majority Jammu region and other parts of Kashmir, promising to bring jobs and development.", "url": "https://www.bbc.com/news/world-asia-india-31598836"}