{"authors": ["Shehnaz Khan", "www.facebook.com"], "date_download": "2025-04-26 03:43:40", "date_modify": "2025-04-26 03:43:40", "date_publish": "2025-03-05 08:23:44", "description": "The victim died at the scene in Wolverhampton, with a second man also injured, police say.", "filename": "news_articles_cm2jzp2e4q0o_1745639020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a217/live/e0bbd260-f99a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzp2e4q0o_1745639020.html", "title": "Man shot dead in Wolverhampton 'victim of targeted attack'", "title_page": "Man shot dead in Wolverhampton 'victim of targeted attack' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man shot dead in Wolverhampton is believed to have been the victim of a targeted attack, police say.\nOfficers were called to Eastfield Grove at about 15:20 GMT on Tuesday.\nThe victim, a man in his 20s, died at the scene.\nWest Midlands Police have now confirmed a second man was injured in the shooting and was receiving treatment in hospital.\nThe force, which said it has launched a major investigation, has urged people with mobile phone, doorbell or dashcam footage from around the time of the shooting to contact them.\n\"We appreciate that the location is very close to local schools and our officers and partners have been in regular contact with the school to offer support, advice and guidance, a spokesperson said.\n\"Detectives and local officers have been in the area this afternoon to speak with parents who may have witnessed part of yesterday's events or may have been affected by the incident.\"\nNearby Eastfield Primary School was put into lockdown as a precaution following the shooting, as it happened at the end of the school day as pupils were preparing to go home, the city council confirmed.\nA spokesperson said the lockdown stayed in place for 40 minutes to \"ensure the safety of pupils and staff\".\nPat McFadden, MP for Wolverhampton South East, said he was \"shocked\" to hear of the shooting in his constituency and urged people to help police \"in any way they can\" to assist the investigation.\n\"The community has to be reassured, because they are in a state of shock after such a violent murder in our local streets,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cm2jzp2e4q0o"}