{"authors": ["Emma Stanley", "www.facebook.com"], "date_download": "2025-04-26 06:51:41", "date_modify": "2025-04-26 06:51:41", "date_publish": "2025-02-28 17:39:19", "description": "A plan to transform housing in Blackpool's most deprived areas does not go far enough, councillor says.", "filename": "news_articles_cn4yye2nw1wo_1745650301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ff4d/live/cd698050-f5d4-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4yye2nw1wo_1745650301.html", "title": "Blackpool's £90m housing revamp plan not ambitious enough", "title_page": "Blackpool's £90m housing revamp plan not ambitious enough - councillor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A £90m plan to regenerate deprived areas in central Blackpool \"doesn't go far enough\", the leader of the Conservative group on the council has said.\nThe authority was awarded the funding from the government last year to demolish about 400 properties, which are no longer fit for purpose, and replace them with up to 280 bigger new homes.\nConservative councillor Paul Galley said the scheme needed to be \"far more ambitious\".\nBut Labour MP for Blackpool South, Chris Webb, said the project was \"a brilliant first step in transforming Central Drive\".\nThe first phase of the housing regeneration work will likely focus on one of Blackpool's most deprived areas - the area south of the town centre, between Chapel Street and Rigby Road to Park Road, and the Promenade and Central Drive corridor, the council said.\nThe exact area has not been confirmed yet.\nBut Galley told BBC Radio Lancashire: \"There's a big chunk in there that talks about adding plazas to Central Drive and this feels more like gentrification than actually regeneration and supporting people.\n\"What's needed is a scheme that's far more ambitious, but also connects the private sector into it - sole traders, small business individuals, people who want to invest.\n\"This is just relying on a big government grant than only covers a small fraction of what's required.\n\"I don't think they go far enough.\"\nHowever, Webb said the Central Drive area had been \"desperately needing this kind of transformation for decades, pretty much since I've been in this town in the mid-eighties\".\n\"This is a great first step for the town working with the council but also working with private business to start investing in that area for that partnership to turn that £90m into £400m,\" he added.\n\"For me there is no reason why Central Drive can't look like Didsbury.\n\"That's the ambition, we have to be bold.\n\"We've got the first outline coming out soon, so we know exactly where it's going to be.\"\nBlackpool Council leader Lynn Williams said: \"We have arrived at a really important milestone for the central housing regeneration project that is so vitally needed in our town.\n\"Whilst we have outlined already the wider area that needs housing regeneration we now need to start narrowing down that area so we can move the project forward and continue to deliver what we have promised to deliver for our town.\n\"Whilst I am very proud of our ambition for housing in Blackpool I know and recognise that some people will not welcome this news initially. I understand that and am committed to supporting those who will find this news unsettling as much as we possibly can.\n\"Housing regeneration in Blackpool must happen, we need to provide modern housing that meets our community's needs and once we have a decision on the red line we can get on with doing that.\"", "url": "https://www.bbc.co.uk/news/articles/cn4yye2nw1wo"}