{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 06:47:33", "date_modify": "2025-04-26 06:47:33", "date_publish": "2025-03-01 12:06:46", "description": "The committee organising the event say they have not been able to raise the money they need to run the airshow.", "filename": "news_articles_c99np3jjpe3o_1745650053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1a0e/live/fcbe4200-f692-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99np3jjpe3o_1745650053.html", "title": "Teignmouth Airshow cancelled over funding issues", "title_page": "Teignmouth Airshow cancelled over funding issues - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Devon airshow which is usually attended by thousands of people has been cancelled for this year, its organisers have announced.\nThe Teignmouth Airshow Committee posted a letter on Facebook, external saying the \"tough decision\" had been made to call off this year's event due to funding problems.\nOrganisers said the free-to-attend summer show, which was founded in 2019, was \"drastically short\" of the £90,000 it needed to operate.\nHowever, the committee said it was determined to bring back the airshow in 2026 and would be exploring new fundraising and sponsorship opportunities.\n\"Unfortunately, the Teignmouth Airshow Committee have made the tough decision that Teignmouth Airshow will not be going ahead this year,\" the committee said.\n\"This [decision] has not been made lightly and we understand the disappointment it will bring to the thousands of people who were looking forward to attending this summer.\"\nPrevious editions of the show have featured displays from the Red Arrows and other RAF aircraft including Typhoons and Lancasters.\nOrganisers said the 2024 event was attended by thousands of people and cost £95,000 to host, with the money coming mainly from donations, fundraising events and sponsorship.", "url": "https://www.bbc.co.uk/news/articles/c99np3jjpe3o"}