{"authors": ["Paul Glynn", "www.facebook.com"], "date_download": "2025-04-26 07:31:44", "date_modify": "2025-04-26 07:31:44", "date_publish": "2025-02-27 16:59:29", "description": "Morgan Freeman describes the actor as \"incredibly gifted\" while Clint Eastwood said he was \"extremely saddened\" by the news.", "filename": "news_articles_c4g776e670vo_1745652704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/edd5/live/d64a2670-f52a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g776e670vo_1745652704.html", "title": "Gene Hackman: Daughters and Clint Eastwood lead tributes to star", "title_page": "Gene Hackman: Daughters and Clint Eastwood lead tributes to star - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gene Hackman's daughters and granddaughter say they are \"devastated\" and will \"miss him sorely\", as they led tributes to the movie star who has died aged 95.\nHackman was found dead along with his wife Betsy Arakawa and their dog at his home in New Mexico, US. No cause of death was given, but police said the situation was \"suspicious enough\" to merit investigation.\nIn a statement, daughters Elizabeth and Leslie, and granddaughter Annie said: \"He was loved and admired by millions around the world for his brilliant acting career, but to us he was always just dad and grandpa.\"\nMorgan Freeman who co-starred with Hackman in the 1992 movie Unforgiven - for which Hackman won an Oscar - described the actor as \"incredibly gifted\", external while the movie's director Clint Eastwood said he was \"extremely saddened\", external by the news.\nRalph Fiennes - nominated for an Oscar this year for Conclave - paid tribute to the late actor, external with a black and white portrait of a smiling Hackman, simply titled Gene Hackman 1930-2025.\nViola Davis called Hackman \"one of the greats\", external while Tom Hanks posted on Instagram, external that: \"There has never been a 'Gene Hackman Type.' There has only been Gene Hackman.\"\nThe Prince of Wales also issued a statement saying, external he was \"so sad to hear the news\".\n\"Hackman was a true genius of film who brought each and every character to life with power, authenticity and star quality,\" added Prince William, who is also president of Bafta.\nHackman's 1978 Superman co-star Valerie Perrine labelled him \"a genius\", while the Guardian's film critic said his death \"marks the end\" of the era of American new wave cinema.\nThe Godfather director Francis Ford Coppola, who worked with Hackman on the 1974 mystery thriller The Conversation, called Hackman \"a great artist\".\nIn a statement posted on Instagram, external, Coppola said: \"Gene Hackman a great actor, inspiring and magnificent in his work and complexity.\n\"I mourn his loss, and celebrate his existence and contribution.\"\nHackman, who won two Oscars for his work on The French Connection and Clint Eastwood's Western Unforgiven, played more than 100 roles across his career.\nThey included supervillain Lex Luthor in the Christopher Reeve-starring Superman movies in the 1970s and 1980s.\nPerrine, who acted opposite Hackman as his character's on-screen girlfriend Eve Teschmacher, described the late actor as \"a genius\" and one of the \"greatest to grace the silver screen\".\nShe posted on X, external: \"His performances are legendary. His talent will be missed. Goodbye my sweet Lex Till we meet again.\"\nHackman appeared alongside Hollywood heavyweights including Al Pacino in 1973's Scarecrow, Gene Wilder in 1974's Young Frankenstein and Warren Beatty and Diane Keaton in 1981's Reds.\nHe also starred in the hit movies Runaway Jury and Wes Anderson's The Royal Tenenbaums.\nThe British Academy of Film and Television, external, said it was \"saddened\" to hear of Hackman's death, describing him as a \"much-celebrated\" actor with an \"illustrious\" career.\nSpanish actor Antonio Banderas described it, external as being \"a very sad day for the cinema's family\".\nHank Azaria, the actor best known for voicing characters in The Simpsons, said, external \"it was an honour and an education working with Gene Hackman\" on 1996's The Birdcage.\n\"Mike Nichols said of his genius character acting: 'He always brought just enough of a different part of the real gene to each role he played.' Sending all my love to his family and friends.", "url": "https://www.bbc.co.uk/news/articles/c4g776e670vo"}