{"authors": ["Laura Coffey", "www.facebook.com"], "date_download": "2025-04-26 07:04:47", "date_modify": "2025-04-26 07:04:47", "date_publish": "2025-02-28 06:38:09", "description": "HS2 says it will transform journeys, but a farmer who has lost land is not happy.", "filename": "news_articles_cx2rrjkkw4po_1745651087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/862f/live/8cd916d0-f59e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2rrjkkw4po_1745651087.html", "title": "Farmer losing land to HS2 questions value of 'pointless' line", "title_page": "Farmer losing land to HS2 questions value of 'pointless' line - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A farmer who had his land compulsory purchased to make way for HS2 said if England was going to benefit then it would have been worth it, but described the line as \"pointless\".\nStephen Adkins is a fifth generation farmer at Greatworth Hall, a mainly arable farm with a flock of 200 breeding ewes as well as offices, workshops and a cafe.\nThe high-speed rail line will link London and Birmingham and crosses south Northamptonshire.\nHS2 Ltd said: \"HS2 will transform journeys between the UK's two largest cities and free up space for more local services on the existing main line.\"\nThe farm managed 700 acres, including 400 around the farmhouse, but HS2 has taken possession of 180 acres of that.\nThe farm has received some compensation for the compulsory purchase of their land but some negotiations are ongoing.\nMr Adkins said: \"What they've left us with is not only 180 acres gone straight through the middle of our farm but the bits that are left the other side [of the route] are triangular and odd shaped and they've affected what we can do with them.\n\"We've had to put them down to grass as they don't really make sense to have in an arable rotation.\"\nHe added: \"What we're going through is horrible and the sacrifice we're making would actually be more bearable if the country as a whole did benefit from it, and I know that sounds very grand, but honestly that's how I feel about it.\n\"One of the biggest issues we have is we feel it's a pointless railway.\"\nRosie Jeffries is Mr Adkin's daughter.\nShe said: \"It's just working out how the future looks as the next generation to come and take over a severed farm that's got a railway running straight through the middle of it.\"", "url": "https://www.bbc.co.uk/news/articles/cx2rrjkkw4po"}