{"authors": ["Kelly Ng", "www.facebook.com"], "date_download": "2025-04-26 03:54:00", "date_modify": "2025-04-26 03:54:00", "date_publish": "2025-03-03 07:24:51", "description": "Aurimas Mockus sounded a distress signal after hitting a cyclone 740km from Australia’s east coast.", "filename": "news_articles_c20d1k1gjjvo_1745639640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bbb4/live/71ac2410-f800-11ef-8de2-8721900e2019.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20d1k1gjjvo_1745639640.html", "title": "Rower rescued days before completing trans-Pacific feat", "title_page": "Rower rescued days before completing trans-Pacific feat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An adventurer who tried to row across the Pacific Ocean from the United States to Australia has been rescued just days before he reached his final destination.\nLithuanian rower Aurimas Mockus sounded a distress signal late on Friday after he was stranded by a cyclone, and surrounded by towering waves and strong winds packing up to 100 km/h (62 mph), local media reported.\nAuthorities made radio contact with Mr Mockus the next day when he was about 740km east of Mackay, a city on Australia's east coast in the Coral Sea.\nBy the time he was rescued on Monday morning, the 44-year-old had spent nearly five months alone at sea.\nMr Mockus is getting medical treatment on an Australian warship, which will take him to Sydney, the Australian navy said.\nHe was attempting to become one of few rowers who have crossed the Pacific alone and without stopping.\nAmong them are Britons Peter Bird and John Beeden, who achieved the feat in 1983 and 2015 respectively, and Australian Michelle Lee in 2023.\nMr Mockus started his 12,000km-long journey in October from San Diego in southern California. Brisbane was meant to be his destination.\nHe rowed for an average of 12 hours a day, according to local reports.\nHe regularly updated his progress on Instagram. In the latest post published a day before he called for help, Mr Mockus reported that he had crossed the Chesterfield Islands, a cluster of French coral islands about 1,500km east of Australia.\n\"The highlight is that I successfully sailed the reefs of Chesterfield Islands. And further as God allows... The most important thing is to hold back the next few days,\" he wrote.\nTropical Cyclone Alfred, which derailed Mr Mockus's plan, is forecast to hit Australia's eastern states of Queensland and New South Wales in the coming days.", "url": "https://www.bbc.co.uk/news/articles/c20d1k1gjjvo"}