{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:40:07", "date_modify": "2025-04-26 06:40:07", "date_publish": "2025-03-02 14:46:54", "description": "Nine supporters were arrested ahead of the Hartlepool United v York City match on Saturday.", "filename": "news_articles_cdjy9gde72ko_1745649607.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f50/live/94bb3480-f76c-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjy9gde72ko_1745649607.html", "title": "Nine football fans arrested at Hartlepool Utd v York City match", "title_page": "Nine football fans arrested at Hartlepool Utd v York City match - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nine football fans were arrested at a match between Hartlepool United and York City on Saturday, according to Cleveland Police.\nEight York City fans and one home fan were arrested for a series of offences ahead of the fixture in Hartlepool.\nTwo were arrested on suspicion of being drunk and disorderly and one on suspicion of trying to enter the ground while intoxicated.\nAnother was arrested on suspicion of possession of a flare and one on suspicion of a verbal homophobic public order offence.\nA further four fans were arrested at Hartlepool railway station.\nIn January 2024, police, home and York City fans clashed when the teams met in Hartlepool, leading to eight arrests.\nYork City Supporters Trust issued a statement ahead of the match on Saturday urging supporters to \"represent their clubs in the right way—back your team, respect the citizens of Hartlepool and fellow fans, and enjoy the game responsibly\".\nCleveland Police had said there would be a policing presence at the stadium and in the town before the match.\nA spokesperson said a dispersal order was also in place \"to help support the policing operation to reduce disorder and anti-social behaviour\".\nAccording to York City Football Club, 775 York fans attended the National League away game, which the club won 1-0.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cdjy9gde72ko"}