{"authors": ["David Deans", "Cemlyn Davies", "www.facebook.com"], "date_download": "2025-04-26 07:36:17", "date_modify": "2025-04-26 07:36:17", "date_publish": "2025-02-27 14:36:57", "description": "Treasury minister says there could be \"opportunities\" for Welsh defence industry, which employs 20,000.", "filename": "news_articles_cpwddq1gnzeo_1745652977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f3ff/live/59d19340-f515-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpwddq1gnzeo_1745652977.html", "title": "Extra defence cash could be spent in Wales - minister", "title_page": "Extra defence cash could be spent in Wales - minister - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wales could benefit from plans to boost the UK's spending on defence, a treasury minister has said.\nPrime Minister Sir Keir Starmer said he would boost military budgets to 2.5% of GDP by 2027, funded by cuts to foreign aid.\nOn a visit to Airbus, in Newport, Darren Jones said it was a \"great opportunity for the UK economy, including here in Wales\".\nFinance Secretary for Wales, Mark Drakeford, said he expects a \"share\" of the extra cash to be spent in the country.\nMore than 160 companies supporting the defence sector have operations based in Wales, employing over 20,000 people.\nFirms include BAE Systems, which has a munitions facility in Monmouthshire, and General Dynamics, which is constructing its AJAX armoured vehicles in Merthyr Tydfil.\nOn Thursday Jones and Drakeford visited Airbus's complex on the outskirts of Newport, which provides security systems for the Ministry of Defence and other private companies.\nThe treasury minister is on a tour of the UK ahead of the spending review - a major announcement which will set out how the government allocates cash for public services.\nAsked if Wales could benefit from the defence announcement the chief secretary to the Treasury, told BBC Wales: \"Yes.\n\"Potentially we are spending more money on defence companies and defence technologies, which is a great opportunity for the UK economy, including here in Wales.\"\nHe said there would be \"plenty\" of opportunities for businesses and workers at firms including Airbus.\n\"We've got the strategic defence review happening at the moment, the spending review will be concluded in June. Once we've done all of that, decided the strategy and the budget we will then just be getting on with spending that money.\"\nDrakeford said: \"Wales already makes a larger proportionate contribution than other parts of the UK to our armed forces.\n\"We would certainly be able to see Wales get its share of a very important additional investment.\"\nAsked how he felt about the cuts to international aid to fund the military, the former first minister added: \"There are some very difficult decisions.\n\"The world is changing around us and not changing in a way where it is easy to see how the pieces will all eventually fall.\"\nHe said Sir Keir faced a \"difficult balancing act\".", "url": "https://www.bbc.co.uk/news/articles/cpwddq1gnzeo"}