{"authors": ["Seb Noble", "www.facebook.com"], "date_download": "2025-04-26 07:53:11", "date_modify": "2025-04-26 07:53:11", "date_publish": "2025-02-25 14:16:29", "description": "Council members voted by a majority of just four to pass the local authority's budget.", "filename": "news_articles_c05mlgp5qm9o_1745653991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b620/live/e04644d0-f366-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05mlgp5qm9o_1745653991.html", "title": "Cornwall Council approves £50m savings plan", "title_page": "Cornwall Council approves £50m savings plan  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Proposals to close a £50m gap in Cornwall Council's budget for the next financial year have been narrowly approved.\nThe authority agreed to increase council tax bills by 4.99%, as well as making efficiency savings and cuts to some services to help balance its books.\nHowever, the Conservative-run administration insisted it would be spending an additional £22m on protecting vulnerable adults and children in future.\nMembers voted by a majority of just four to pass the budget at a meeting of the full council.\nCouncillors voted 39 for the plans, 35 against, with three abstentions.\nThe council previously warned of the difficulty it had faced balancing its books for the 2025/26 financial year.\nIt criticised the government for the removal of the rural services delivery grant, but the Labour government insisted it had provided all councils with additional revenue this year.\nOther measures in the budget included a 100% council tax premium on second homes, which the authority hoped would raise about £23m to help with its financial plight.\nPlanned cuts to its handyperson service and proposals to reduce opening hours at some of its recycling centres were reversed, however.\nThe authority also pledged to fund a business case study to argue for safety improvements on the A30 near Launceston.\nDavid Harris, deputy leader and portfolio holder for resources, said authority leaders had faced a \"perfect storm\", with increased demand and rising costs of statutory services such as adult social care and providing home-to-school transport.\nHe insisted: \"We've done our best; we could do no more in the end.\n\"Happy is the wrong word. But I am happy with the budget given the circumstances.\"\nJulian German, leader of the council Independent group, criticised the lack of action on affordable housing.\nHe said: \"That there is no use of the second homes' council tax for local needs properties in this budget is a betrayal.\"", "url": "https://www.bbc.co.uk/news/articles/c05mlgp5qm9o"}