{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 12:57:14", "date_modify": "2025-05-20 12:57:14", "date_publish": "2023-08-14 00:00:00", "description": "Updates from across the African continent.", "filename": "news_live_world-africa-66073409_1747745834.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-africa-66073409_1747745834.html", "title": "Africa Live this week: 14-20 August 2023", "title_page": "Africa Live this week: 14-20 August 2023 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "DR Congo camp for homeless hit by deadly fire\nElettra Neysmith\nBBC World Service newsroom\nA fire at a camp for hundreds of displaced families in the eastern Democratic Republic of Congo has killed at least seven children.\nThe camp houses families from Bushushu, a village on Lake Kivu that was destroyed by deadly floods and landslides in May.\nThe blaze is said to have started in the middle of the camp before spreading, destroying hundreds of huts.\nSeveral adults are being treated for burns.\nThe UN estimates around 3,000 families were left homeless after the floods in the Kalehe region of eastern DR Congo, an area already plagued by armed insurgencies.\nLibya's rival central banks reunite after civil war\nMike Thomson\nBBC World Service newsroom\nLibya's central bank has been become a single institution again, nearly a decade after it was split in two owing to the country's civil war.\nIt had been divided - like the country's government - into rival branches in the east and the west.\nIts division made it difficult for Libya to have a coherent monetary policy and contributed to the sharp fall in its currency, the dinar.\nLibya has been plagued by violence and political chaos since the overthrow and killing of long-time leader Muammar Gaddafi in 2011.\nMedals for Ethiopia in dramatic women's 10,000m final\nAmeyu Etana\nBBC Afaan Oromoo\nGudaf Tsegay won Ethiopia’s first World Athletics Championships gold in Budapest in dramatic fashion on Saturday night after 10,000m race leader Sifan Hassan fell about 20m from the finish line.\nIt was a clean sweep for Ethiopia, with world record-holder Letesenbet Gidey taking the silver and Ejgayehu Taye the bronze.\n\"It was good race with an amazing finish,\" said Tsegay, who clocked 31 minutes and 27.18 seconds.\nHassan, a Dutch Ethiopian-born athlete, was moving to the outside as Tsegay - the reigning world 5,000m champion - approached. After her fall, Hassan eventually got back on her feet and finished in 11th place.\nShe was consoled by the other athletes, with Gidey immediately going back to hug her.\n\"I think I got pushed, but what can I do? It’s sport, it can happen,\" Hassan told BBC Sport after the race about her disappointment.\nDespite running for the Netherlands, Hassan also has fans in Ethiopia particularly because of her support for those campaigning for more rights for the country's large ethnic Oromo group, which has felt marginalised for many years.\nHassan and Tsegay are set to face each other again during the 5,000m race later at the championships in Hungary.\nScroll down for this week's stories\nWe're back on Monday morning\nThat's all from the BBC Africa Live team for this week. Join us again from Monday morning at bbc.com/africalive.\nThere will be an automated news feed until then, plus you can get the latest updates on the BBC News website or listen to the Focus on Africa podcast.\nA reminder of Friday's wise words:\nQuote Message\nIf you claim to be as big as a banana leaf, a little breeze will be enough to bring you down.\nA Krio proverb sent by Amara Rogers in Koidu Town, Sierra Leone\nClick here to send us your African proverbs.\nWe leave you with a photo of a tannery worker using traditional methods to process leather in Nigeria - it's one of our favourites of the past week:\nPopular Tunisian rapper reaches Italy on migrant boat\nBBC Monitoring\nThe world through its media\nA popular Tunisian rapper has illegally emigrated to Italy amid a deepening economic crisis in the North African country.\nJunior Hassen, external, whose songs have been viewed close to 15 million times on YouTube, made the potentially deadly boat crossing to Sicily last week.\nNews outlet Mosaique FM said the rapper had reached the southern Italian city of Palermo after travelling with a group of migrants from his hometown, Sousse.\nSocial media users have circulated footage that they believe shows Hassen, real name Hassen Sassi, crossing the Mediterranean on a small boat with other Tunisian migrants. But the footage has not been independently verified.\nTunisia's dire economic crisis has pushed many people to take desperate measures in hopes of better lives abroad. Earlier this year, a Tunisian football club suspended its activities after 32 of its players emigrated to Europe.\nTunisia has become the main departure point for African migrants trying to cross the Mediterranean to Europe. Tunisians in growing numbers have also opted for sea journeys on the world's deadliest migration route.\nHow does it feel to be skinny-shamed?\nAshley Lime\nBBC News, Nairobi\nSkinny-shaming is defined as the act of mocking, criticising or belittling another person because of their perceived weight being below the acceptable weight in the community.\nI’ve been skinny-shamed myself - and I've been looking into the phenomenon for the BBC World Service's What in the World podcast.\nI was recently told in Uganda I wouldn’t qualify for bride price because of my size.\nIn some communities, thinness can be linked to sickness, like HIV and Aids, and fatness can be linked to happiness and wealth.\nIt affects men as well as women. Solomon Buchi, who’s 27 and from Nigeria, says being told he was \"too skinny for a man\" by a girl he was interested in, and other comments like this, have left him feeling like \"less of a man\".\nThese remarks can impact mental health. Ugandan psychologist Leona Buhenzire says both skinny-shaming and fat-shaming can cause body dysmorphic disorders, anorexia and bulimia.\n\"People who have been skinny-shamed can struggle with poor feeding habits, eating junk food and feeling anxiety over what they eat,\" she adds.\nShe highlights that in some rural parts of Uganda, where big is beautiful, young brides can be force-fed to make them put on weight.\nListen to What in the World to find out more\nNigerians deny sextortion that led to teen's death\nTwo Nigerian brothers on Thursday pleaded not guilty to charges relating to operating an international sexual extortion racket that pushed a 17-year-old boy in Michigan, US, to take his life.\nSamuel Ogoshi, 22, and Samson Ogoshi, 20, were extradited to the US on 13 August.\nJoint investigations by the FBI and the Nigerian Economic and Financial Crimes Commission implicated them in the sextortion ring that targeted more than 100 minors and adults.\nIn a 13 August press briefing, Mark Totten, the US attorney for the Western District of Michigan, disclosed plans to extradite a third suspect, 19-year-old Ezekial Ejemeh Robert.\nMr Robert and the Ogoshi brothers are facing three charges, including conspiracy to sexually exploit minors, conspiracy to distribute child pornography and conspiracy to commit stalking through the internet.\nSamuel Ogoshi faces the fourth count of sexual exploitation and attempted sexual exploitation of a minor resulting in the teenager's death.\nProsecutors allege that Samuel, posing as a young woman on the Instagram social media app, convinced the teenage boy to send him a sexually explicit photo.\nHe is then accused of blackmailing the boy into sending him $1,000 (£786) and continuing to blackmail him even after he sent $300. Samuel is accused of encouraging the boy to go through with his threat to take his life due to the blackmail, resulting in his eventual death in March 2022.\nZimbabwe deports SA journalists before election\nBBC Monitoring\nThe world through its media\nZimbabwean authorities have deported four people who flew into the country to cover next week's general election.\nFormer South African Broadcasting Corporation (SABC) broadcaster Chris Maroleng - who is the executive director of Good Governance Africa in the Southern African Development Community region - and three of his colleagues were denied clearance to cover the election and informed of their deportation on Thursday.\nGovernment spokesperson Nick Mangwana said Zimbabwe was deporting foreign journalists who misrepresented their real purpose to be in the country to immigration authorities, adding:\nQuote Message\nIf you are an election observer, say so, we accredit such. If you are a journalist, say so, we accredit such. If you make misrepresentations to the immigration officer, you may find yourself on the next plane home.\"\nMr Maroleng, however, insists that his team had followed all the rules to get accreditation.\nIn total, Zimbabwe's electoral body has only accredited 15 foreign journalists - but is accepting more than 3,500 local observers, over 130 foreign monitors, and more 370 local reporters.\nHalted aid starved hundreds in Ethiopia's Tigray region - spokesman\nGirmay Gebru & Mercy Juma\nBBC News, in Mekelle and Nairobi\nA senior official in Ethiopia's northern Tigray region has told the BBC that at least 1,400 people have starved to death since international food aid was suspended.\nGebrehiwet Gebrezgabher said the number of dead could be much higher.\nThe UN World Food Programme and the US aid agency, USaid, halted food relief to the region several months ago because donations were being stolen.\nTigray was hit by acute food shortages when a brutal conflict broke out in 2020 between the Ethiopian government and the Tigray People's Liberation Front. Six million people were affected.\nThe conflict ended last year with a peace deal brokered by the African Union.\nThe WFP told the BBC it was accelerating efforts to resume food aid, and ensuring that the most stringent processes were place to best serve those most in need.\nRead more on this story here", "url": "https://www.bbc.com/news/live/world-africa-66073409"}