{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:32:09", "date_modify": "2025-04-26 07:32:09", "date_publish": "2025-02-27 16:40:11", "description": "PC Ian Brotherton, 32, was handed a six-month prison sentence, suspended for 18 months.", "filename": "news_articles_cge11r8r907o_1745652729.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74ba/live/b594db20-c9e5-11ef-b056-6f0ecb5a0ddb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge11r8r907o_1745652729.html", "title": "Enfield: Met Police officer sentenced over moped driver's death", "title_page": "Enfield: Met Police officer sentenced over moped driver's death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Metropolitan Police officer who struck and killed a moped rider in north London while driving to an emergency callout has avoided jail.\nPC Ian Brotherton, 32, was driving at 47 mph (75 km/h) in a 30mph (50 km/h) zone when his marked police vehicle crashed into 26-year-old Cristopher De Carvalho Guedes on 12 October 2023 in Enfield.\nThe officer, from east Hertfordshire, denied causing death by dangerous driving but admitted the lesser alternative of causing death by careless driving.\nAt the Old Bailey on Thursday, Brotherton was handed a six-month prison sentence, suspended for 18 months.\nHe was also sentenced to 150 hours of unpaid work and disqualified from driving for 30 months.\nJudge Mark Lucraft KC acknowledged the defendant's remorse, but said: \"As a trained police driver driving in connection with your duties your driving must be judged according to those standards.\"\nThe Crown Prosecution Service (CPS) said Brotherton was driving a marked police van on Southbury Road around 3pm on 12 October 2023, while responding to an emergency call using blue lights and sirens.\nAs he approached a set of traffic lights showing red at the junction with Baird Road, he did not stop or brake and proceeded across the junction, striking a moped.\nThe rider, Mr De Carvalho Guedes, was thrown from the moped and suffered significant injuries.\nHe was treated at the scene by paramedics and taken to the Royal London Hospital, where he later died, the CPS added.\nMr Guedes' family attended his sentencing by video link from Brazil and described him in a statement as a \"joy\", \"irreplaceable\" and a talented footballer.\nThey called for the officer to be dismissed for the \"30-second\" error that changed their lives.\nRachael Taylor, from the CPS, said: \"PC Ian Brotherton was a police response driver and had undertaken training, which included how to safely approach and negotiate traffic lights showing red when engaged on an emergency call.\n\"But his driving on that day fell below the standard expected of an officer trained to be on London's roads in such circumstances.\"\n\"It is only right that he has been held to account for his actions, which led to this tragic death,\" she added.\nMitigating, Robert Morris said: \"This is something Mr Brotherton thinks about each and every day.\n\"This is a tragic incident and it unfortunately had such a devastating impact on Mr Guedes and his family. Mr Brotherton wishes he could turn back time and do things differently on that day.\"\nMr Morris added: \"He was responding to something he thought was a genuine emergency. He believed his sirens, his lights would have been noticed by other road users.\n\"He got that terribly wrong.\"", "url": "https://www.bbc.co.uk/news/articles/cge11r8r907o"}