{"authors": ["Galya Dimitrova", "www.facebook.com"], "date_download": "2025-04-26 04:31:19", "date_modify": "2025-04-26 04:31:19", "date_publish": "2025-03-03 06:12:05", "description": "Four farmers talked about the pressures they face and their concerns about inheritance tax changes.", "filename": "news_articles_cy0ddk6xe04o_1745641879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e4ab/live/b3f2e900-f529-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy0ddk6xe04o_1745641879.html", "title": "Dorset: Meeting hears inheritance tax 'last straw' for farmers", "title_page": "Dorset: Meeting hears inheritance tax 'last straw' for farmers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Farmers have described changes to inheritance tax as a \"last straw\" for many.\nAt a public event in Bridport, Dorset, a panel of agricultural experts discussed the pressures impacting their industry.\nTim Gelfs, chair of Dorset NFU, said he had \"never found out why food production has never had support from government\", a government spokesperson said it \"will invest £5bn into farming over the next two years\".\nChanges to inheritance tax include applying the tax to inherited agricultural assets worth more than £1m for the first time.\nOne of the panellists, Trevor Cligg, owns Pipplepen Farm in South Perrott.\nHe moved out of dairy farming and only raises beef cattle, sheep and has 60 acres of arable land.\nHe said: \"For a long time, farmers do not feel valued by the government.\n\"Things have been getting more and more regulated.\"\nMr Cligg said that for every £1 of subsidy, farmers spent £7 back into the economy on upgrading equipment and investing in units.\nBut he said farmers now questioned whether they should do that because \"then somebody in the family drops dead, and we've got to pay £1m in tax - we can't afford it\".\n\"So that's really going to hamper investment which will reduce productivity and efficiency,\" he added.\nThe changes to inheritance tax were announced by Chancellor Rachel Reeves as part of the budget in the autumn.\nThe move prompted anger among farmers and led to national protests.\nFrom April 2026, agricultural assets worth more than £1m will be subject to a 20% inheritance tax - half the usual rate.\nThe government says no tax would be payable on the first £325,000 above the limit, bringing the untaxed total to £1.325m.\nBut Rebecca Hill, who runs the North West Farm in Winterborne Kingston, said \"the current regime\" was \"discriminatory\" against those who were divorced, single or had lost their partners.\n\"An exact same business with two partners will pay £300,000 less than my business,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cy0ddk6xe04o"}