{"authors": ["John O'Kane & David Hunter", "www.facebook.com"], "date_download": "2025-04-26 04:07:32", "date_modify": "2025-04-26 04:07:32", "date_publish": "2025-03-03 00:00:17", "description": "Former IRA leader Brendan Hughes tells the BBC the conflict in NI was \"a total waste\" of more than 3,500 lives.", "filename": "news_articles_c0rzqd2vynro_1745640452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ff6/live/62dd3970-f449-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rzqd2vynro_1745640452.html", "title": "Inside the IRA: War crime, bank jobs and jail breaks", "title_page": "Inside the IRA: War crime, bank jobs and jail breaks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former IRA leader who plotted bank robberies and jail breaks has told the BBC that being condemned to die made him realise what the group's victims had gone through.\nBrendan Hughes, who is originally from County Tyrone, said he believes the IRA intended to make him one of the Disappeared – killing him and burying him in a secret grave.\nMr Hughes described the practice as \"a war crime\" that \"should never have happened\".\nIn a wide-ranging interview, the former IRA leader told BBC Spotlight that the Northern Ireland conflict was a \"total waste\" of life.\nHughes said the IRA passed a death sentence on him in 1975 after he carried out an armed robbery for personal gain.\n\"Suddenly you realise the position that other people were in, the position that you had been putting people in all these years, that there was a threat over their very existence.\n\"I didn't want to be disappeared. I never agreed with that.\n\"The disappearing of people is a war crime. It should never have happened.\"\nThe Disappeared are those who were abducted, murdered and secretly buried by republicans during Northern Ireland's Troubles.\nDespite extensive searches, the bodies of four of the victims have yet to be found.\nHughes, who said he was never involved in Disappeared cases, survived the assassination attempt on him.\nHe tried to steal more money to buy his way out of the death sentence but was captured by Gardaí (Irish police) and jailed for 20 years.\nSpeaking to Spotlight, he detailed the planning of a helicopter hijacking which saw three republican prisoners escape from Mountjoy Prison in the Republic of Ireland in 1973.\nHowever, he insisted he was not glorifying violence by taking part in the two-part film, called 'Those Who Want Me Dead'.\n\"I'm telling my story to tell people who I am, what I am and where I am today, and where I am today, I would not do any of those things,\" he said.\n\"I'm not prepared to lift one finger in a violent way ever again. Never will.\n\"I see war as the most futile and destructive thing that man ever created.\"\nHughes, who is in his late 70s, offered an apology to those impacted by his actions during the Troubles.\nHe said he had come to realise the long-term implications he had on the lives of \"ordinary, innocent and decent people.\"\nThe former IRA leader said he wanted to engage with a truth commission to give victims answers about the 30-year conflict in Northern Ireland.\n\"It wasn't worth leaving one family without a father or a brother or a sister.\n\"It was a total waste, absolute total waste of energy, of life, of resources,\" he said.\nHis interview for Spotlight comes amid government efforts to repeal the controversial Legacy Act.\nIntroduced by the previous Conservative government, the legislation introduced a ban on inquests and civil actions related to incidents during the conflict in Northern Ireland.\nIt also sought to offer a conditional amnesty for people suspected of Troubles-related crimes in exchange for co-operating with a new Independent Commission for Reconciliation and Information Recovery (ICRIR).\nThe High Court in Belfast later ruled parts of the legislation, including such an amnesty, would be in breach of the European Convention on Human Rights.\nHughes said he would engage with such a body - if there were no repercussions for doing so.\n\"I'm prepared to sit down with anyone, anytime, anywhere and talk about this – in the right forum.\n\"If the victims say that's the forum and there's no repercussions for anyone for doing this, that's where I want to be.\n\"The first requisition for reconciliation is truth,\" he said.\nA number of victims' groups and political parties in Northern Ireland objected to the Legacy Act.\nThey argued that the act denied justice to those bereaved and injured during the Troubles, with some calling for the ICRIR to be scrapped.\nThe government previously said the commission would continue operating, but new legislation would be brought forward to \"reform and strengthen\" the ICRIR's \"independence, powers and accountability\".", "url": "https://www.bbc.co.uk/news/articles/c0rzqd2vynro"}