{"authors": ["Nathan Standley", "www.facebook.com"], "date_download": "2025-04-26 04:02:26", "date_modify": "2025-04-26 04:02:26", "date_publish": "2025-03-04 02:11:07", "description": "The University and College Union says 5,000 jobs are already being cut and the sector is \"on its knees\".", "filename": "news_articles_cddy2l9lmjpo_1745640146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a1e3/live/981a5670-f85b-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddy2l9lmjpo_1745640146.html", "title": "Thousands more university jobs at risk, union warns", "title_page": "Thousands more university jobs at risk, union warns - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Up to 10,000 university jobs could be at risk this academic year because of the \"unprecedented crisis\" in higher education, the union representing staff has said.\nThe University and College Union (UCU) said 5,000 job cuts had already been announced, but thousands more roles could be at risk because of gaps in university funding.\nUniversities UK, which represents 141 institutions, said vice-chancellors had faced \"extremely tough decisions\", and called for \"sustained action\" from the government to bring financial stability to the sector.\nThe Department for Education (DfE) said the government had \"inherited a sector facing serious financial risk\" and taken \"tough decisions\" to address it.\nMany universities have been impacted by falling numbers of international students - who bring in more revenue since they pay higher fees than domestic students - following the introduction of stricter visa restrictions last year.\nOne of those is the University of Sheffield, which has said it wants to save £23m in staffing costs, including both academics and other roles such as admissions and student-support officers.\nThe university said it was \"carefully managing staff vacancies and offering a voluntary severance scheme to help avoid the need for compulsory redundancies\".\nBut Jenny Hughes, whose job in digital support is involved in the restructure, said she and her colleagues were still \"really worried\".\n\"We don't know if in six months' time we're going to have jobs - and if we do, where they will be or what we'll be doing,\" she said.\n\"We've got people who work directly with students - and they're not able to make promises to them about what's going to happen in the future.\"\nLinguistics lecturer Robyn Orfitelli, Sheffield's UCU branch president, said the cuts would have \"huge ramifications on the type of education students coming to the University of Sheffield can get\".\nShe said students were not being given enough information about the possible impact of the cuts.\nStudents in Sheffield told BBC News they were worried about losing lecturers despite paying higher tuition fees.\nStudent Mark said fees were \"horrible\", but that \"no one should lose their job\".\nHistory student Sam said he believes fees are \"high enough\", adding: \"I have no idea where the money's going.\n\"I don't get how I pay nine grand, and I have 200 course mates who also pay nine grand, and I still have six hours a week of contact time with the staff.\"\nA University of Sheffield official said it was \"firmly committed to supporting our colleagues and continuing to work constructively with our trade unions, whilst protecting our excellent research, teaching and student experience\".\nOverall, the university sector comprises about 206,000 academic and 246,000 non-academic staff, according to the latest data from the Higher Education Statistics Agency.\nAnd financial problems are affecting universities in every part of the UK, despite different funding models in each nation.\nStudents from Scotland do not pay fees, because of government grants, while students in England pay £9,250 per year - rising to £9,535 next year as the government tries to boost income for the sector.\nThose fees will be the same for students in Wales, where Cardiff University said it would need to cut 400 full-time jobs to tackle a funding shortfall, as well as closing some courses, with nursing, music and modern languages among the subjects at risk.\nAnd in Northern Ireland, where universities are funded by a mix of £4,750-a-year fees and government grants, Queen's University Belfast faced criticism in February over its decision to open a campus in India while planning to cut up to 270 jobs.\nUCU general secretary Jo Grady said higher education was \"on its knees\" and an emergency fund was needed to protect jobs and courses in the short term before a new funding model could be developed.\nA DfE official said the government was \"committed to boosting the sector's long-term financial sustainability and restoring universities as engines of opportunity, aspiration and growth\".\nAdditional reporting by Rahib Khan", "url": "https://www.bbc.co.uk/news/articles/cddy2l9lmjpo"}