{"authors": ["Mark Smith", "www.facebook.com"], "date_download": "2025-04-26 07:51:49", "date_modify": "2025-04-26 07:51:49", "date_publish": "2025-02-25 14:51:31", "description": "Associated Newspapers Limited acknowledges its claim that Dale Vince supported Hamas \"was untrue\".", "filename": "news_articles_c14jn0331yeo_1745653909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aee3/live/1b655ce0-f36c-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jn0331yeo_1745653909.html", "title": "Dale Vince settles High Court libel claim with Daily Mail owner", "title_page": "Dale Vince settles High Court libel claim with Daily Mail owner - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The green energy entrepreneur Dale Vince is to receive £40,000 in damages from the publisher of the Daily Mail after settling a High Court libel claim.\nMr Vince took legal action against Associated Newspapers Limited (ANL) in December over an article published in October, which falsely alleged he supported Hamas, which is proscribed as a terrorist organisation by the UK and others.\nHis lawyers told the High Court the article, which was published online and in the Mail on Sunday, was \"highly defamatory\" and had caused \"serious harm to his reputation\".\nLawyers for ANL apologised, saying the publisher acknowledged the allegation \"was untrue and that Mr Vince does not support Hamas in any way\".\nMr Vince's lawyer, Annabell Hood, told the court on Monday the 63-year-old had previously been \"falsely accused\" of supporting Hamas in a separate article published by the Daily Mail and online in March 2024.\nThat case was settled last year, with ANL apologising and paying damages, which Ms Hood said Mr Vince had donated to charity.\nThe settlement also included \"an undertaking by the defendant not to publish similar allegations in the future\".\nBut Ms Hood said that a second article, written by Dan Hodges, was published in October that \"falsely alleged that Mr Vince had supported or defended the terrorist acts of Hamas\".\nShe said the publication of that article caused Mr Vince significant distress, because he reasonably expected a national newspaper to comply with its undertaking.\nLizzie Greene, for ANL, said the publication of the article was \"an error which should not have happened\".\n\"The defendant acknowledges that the allegation made in Mr Hodges' article about Mr Vince is untrue and that Mr Vince does not support Hamas in any way.\n\"We formally retract and withdraw the allegation.\"\nMs Hood said that Mr Vince, who founded Stroud-based green energy company Ecotricity, and who is also the co-owner of National League football team Forest Green Rovers, intended to also donate the latest awarded damages to charity.\nFollowing the hearing, Mr Vince said ANL \"broke a promise not to repeat a false allegation\".\nHe said: \"Their cash is on the way to Gaza again. People that support Palestinian rights are not terrorists and free speech is not the freedom to be dishonest.\"\nA settlement occurs in High Court libel cases when both parties reach an agreement before the court delivers a final judgement.\nUnder the terms of the settlement, ANL will also pay £30,000 of Mr Vince's legal costs and will publish an apology online and in The Mail on Sunday within 14 days.", "url": "https://www.bbc.co.uk/news/articles/c14jn0331yeo"}