{"authors": ["Danny Fullbrook", "www.facebook.com"], "date_download": "2025-04-26 06:14:29", "date_modify": "2025-04-26 06:14:29", "date_publish": "2025-03-02 01:20:04", "description": "The series stars Jodie Whittaker and Aimee Lou Wood as real-life mothers fighting for justice.", "filename": "news_articles_cd654e1ddy7o_1745648069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/63c5/live/ebd7b730-f5ea-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd654e1ddy7o_1745648069.html", "title": "Netflix shines light on Toxic Town true story of Corby scandal", "title_page": "Netflix shines light on Toxic Town true story of Corby scandal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Many of the stars of Toxic Town had not heard of the scandal the drama is based on, but are hoping the Netflix retelling will bring it into the spotlight.\nThe show follows the real-life battle of families in Corby, Northamptonshire, whose children were born with defects in the 1980s and 90s.\nIn court it was argued that toxic airborne pollutants from the town's demolished steelworks had harmed unborn babies.\nActor Brendan Coyle, who was born in Corby, admitted he had been unaware of the story, but said there was excitement in his hometown to see it told to the world.\n\"One of the mothers has been in touch... It's kind of the talk of the town. People are excited about it,\" he said.\n\"For them, the mothers and these children, to have their story told... it's amazing. It's something that's been buried for a long time in terms of people's perception.\"\nIn the drama, the Downton Abbey star plays Roy Thomas, a fictional Corby borough councillor.\nThe 62-year-old actor explained that, like many in the town, his family had moved from Scotland to work at the Corby Steelworks, which in 1979, just before its closure, had about 10,000 employees.\n\"When I was born in Corby, 80% of the population of that town had been born in Scotland,\" he said.\n\"My granny and granddad came down from Bellshill, which is a mining community outside Glasgow. They never lost their accent because you're in amongst it, you know?\"\nMembers of his family, including his brother, still live and work in the area.\n\"My brother asked 'Is there any craic in this?'\" he laughed.\n\"On the surface it's very bleak... but in the documentary [the Horizon programme on the case] you see the women they talk to and there's great spirit and humour and great craic.\n\"I think Jack [Thorne, writer of the drama] has captured that brilliantly.\"\nFor executive producer Annabel Jones, humour was an important part of the storytelling.\nShe said: \"Corby is known for its sense of humour; known for its warmth. I wanted to make sure that comes across through the characters as well, because I want it to feel true to Corby.\n\"I didn't want it to feel that people didn't have a sense of hope at that time.\"\nThe Emmy and Bafta-winning Welsh producer first heard about the scandal while in lockdown during the pandemic.\nA friend, from Corby, told her about the case while they were on a masked-up walk in a park.\nShe recalled: \"I was absolutely gobsmacked that, firstly, I have never heard of this story, and secondly, why have I never heard of this story?\n\"This really needs to be pulled into the public consciousness; we need to be made aware so things like this don't happen again.\"\nFrom that point, the 53-year-old began speaking to as many people involved in the case as possible to ensure their stories were told story accurately.\nOne of the nuances of the adaptation is the Corby accent, which Coyle compared to a \"diluted\" Scottish accent.\nHe said: \"It's an odd one but I can recognise it anywhere. I've been on a tube before and been like 'Are you from Corby?' There is nothing like it.\"\nThe executive producer added: \"It's such a particular accent because obviously Corby has lots of different influences... We did work with lots of accent coaches to try and perfect it.\n\"Jodie Whittaker really worked hard. It was probably the thing she was most nervous about. When she met with Susan she very kindly reassured her and told her she'd done a good job.\"\nOther members of the cast met or emailed the people they played to help craft their performance.\nHowever, this was not an option for Robert Carlyle. The man he portrayed, Corby borough councillor Sam Hagen, died in October 2022, a year before filming began.\nTo help, the production team sourced hours of video footage in which the real-life politician told his story.\nCarlyle, who starred in The Full Monty, said: \"He's got a straight kind of voice; a slightly higher kind of Glasgow man that talks like that... I thought... 'That just sounds like my dad.'\n\"I thought 'There's elements here of my dad in Sam' and that was my way in.\"\nThe Trainspotting actor described his character as \"a hero with a small h\" who \"fundamentally wants Corby to succeed\".\nCarlyle said: \"He was determined to make the best of his life down there to try and regenerate this town. He's the kind of man who made sure the traffic lights are working correctly and there's a zebra crossing in the right place.\n\"He does the right thing. It's lovely; a lot of my characters aren't like that. It's nice to have a chance to play somebody who is inherently good.\"\nKinnear did not speak to the real-life lawyer while preparing for the role.\nHe said: \"The choice of casting me means they were taking it in a slightly different way. I knew they were creating a version of Des in terms of age; in terms of look; in terms of lots of other things\"\nThe real Des Collins, however, thought the Bond actor's portrayal was very close to the truth: \"He got me down to a tee. He was more me than I am,\" he said.\n\"I ended up on a couple of occasions, having seen it, saying 'Oh, I wish said that' and then I realised it wasn't me doing it, it was Rory Kinnear pretending to be me.\"\nThe actor hopes the drama will get people talking. \"As the sibling of a disabled person myself, one is well aware that they are not at the forefront of public interest,\" he said.\n\"What excites me about this is, not just the story itself, but the fact Netflix are doing it and it's a departure for them to do a four-part series like this of this subject matter.\n\"You could well imagine this being on late on BBC2 or Channel 4, and 250,000 loved it and watched it, but it doesn't have any impact.\n\"I think Netflix's ambition with it is to make sure it's something everybody watches, talks about and is made aware of.\"", "url": "https://www.bbc.co.uk/news/articles/cd654e1ddy7o"}