{"authors": ["Nadine Yousif", "www.facebook.com"], "date_download": "2025-04-26 06:24:45", "date_modify": "2025-04-26 06:24:45", "date_publish": "2025-02-28 22:42:18", "description": "Prosecutors said the man targeted the six-year-old and his mother over their Muslim faith following the Israel-Hamas war.", "filename": "news_articles_cyveq30lmdlo_1745648685.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c1b9/live/9ca9fa70-f61b-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyveq30lmdlo_1745648685.html", "title": "Illinois landlord found guilty for murder of Palestinian-American boy", "title_page": "Illinois landlord found guilty for murder of Palestinian-American boy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Illinois landlord has been found guilty of murder and hate crime charges for fatally stabbing a Palestinian-American child in 2023 and severely wounding his mother.\nProsecutors said Joseph Czuba, 73, targeted the family over their Muslim faith following the Israel-Hamas war.\nPolice found six-year-old Wadea Al-Fayoume and his mother, Hanan Shaheen, with severe stab wounds inside a house she rented from Czuba in a Chicago suburb on 14 October, 2023. The boy later died in the hospital.\nCzuba had pleaded not guilty, but jurors convicted him after deliberating for less than 90 minutes.\nWarning: This story contains details some readers may find upsetting\nAfter the verdict, the boy's father, Odai,told reporters in Arabic: \"I don't know if I should be pleased or upset, if I should be crying or laughing.\"\n\"I feel like this decision came a little too late,\" he said.\nJurors heard testimony from a number of witnesses, including Al-Fayoume's mother.\nMs Shaheen testified that she rented rooms from Czuba in suburban Chicago, and had no problems with him at first.\nBut tensions escalated after Hamas attacked Israel on 7 October, 2023, with Czuba expressing anti-Muslim views and asking her to move out of the home, where he also lived.\nA few days after that conversation, Czuba forced his way into her room and stabbed her with a knife more than a dozen times, Ms Shaheen testified.\n\"He told me 'You, as a Muslim, must die,'\" she said.\nAfter she retreated to call for help, Ms Shaheen said Czuba attacked her son. Prosecutors said the child had been stabbed 26 times. He died from the injuries shortly after the attack.\nPolice testified that they found Czuba outside the house after the attack, with blood on his body and hands.\nLawyers for Czuba defended him by arguing that pieces of evidence linking him to the crimes were missing. His ex-wife testified in the trial, and said he rarely had violent outbursts in their 30-year marriage.\nBut jurors found him guilty of the crimes after a short deliberation. Czuba faces life in prison without parole. Sentencing is scheduled for May.\nThe young boy had celebrated his sixth birthday just a few weeks before he was killed.\n\"He loved his family, his friends. He loved soccer, he loved basketball,\" the executive director of the Chicago office of the Council on American-Islamic Relations (CAIR), Ahmed Rehab, said at the time.", "url": "https://www.bbc.co.uk/news/articles/cyveq30lmdlo"}