{"authors": ["Emily Ford", "www.facebook.com"], "date_download": "2025-04-26 03:59:06", "date_modify": "2025-04-26 03:59:06", "date_publish": "2025-03-04 06:12:59", "description": "The seal reportedly spent at least 20 minutes \"wrestling\" with the eel before eating it.", "filename": "news_articles_c1mng2zkne9o_1745639946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df00/live/36ce3c70-f837-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mng2zkne9o_1745639946.html", "title": "Seal seen capturing and eating eel in sea off Portland Bill", "title_page": "Seal seen capturing and eating eel in sea off Portland Bill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A seal has been spotted \"wrestling\" a large eel for its lunch.\nBiology teacher Dr Jeremy Rowe filmed the seal after spotting it with something in the water off Portland Bill, Dorset, on Saturday.\nDr Rowe had been birdwatching on a nearby cliff when he saw the kerfuffle through his telescope about 500m (1,640ft) away.\nHe said: \"I've never seen anything like it.\"\nDr Rowe spent about 20 minutes watching the seal capture and then eat the eel, which looked about 1.5m (5ft) long.\nHe explained: \"I used to be a marine coastal warden and I enjoy birdwatching, I go diving, so I enjoy being by the coast.\n\"My wife and I were walking and I was doing some birdwatching, when through my telescope I see this seal wrestling with a big eel.\n\"By the time I got my scope out, I could see it had managed to catch it and subdue it, but it was struggling.\"\nDr Rowe said the seal was not able to close its jaw around the eel, which meant it would keep dipping underwater and then reappearing.\nHe continued: \"The tide was just starting to come in so the seal was drifting with the water. It had to stop swimming at one point because it was busy battling, so it just gave up and floated.\nSince posting the video online, the teacher from Dorchester says many locals have commented and believe it was the female grey seal called Fiver., external", "url": "https://www.bbc.co.uk/news/articles/c1mng2zkne9o"}