{"authors": ["Malcolm Prior", "www.facebook.com"], "date_download": "2025-04-26 07:57:50", "date_modify": "2025-04-26 07:57:50", "date_publish": "2025-02-25 12:06:54", "description": "The environment secretary is met with blaring tractor horns as he tries to win over farmers.", "filename": "news_articles_c2ljdvqegkeo_1745654270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3f5e/live/06d34540-f37f-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ljdvqegkeo_1745654270.html", "title": "Environment Secretary Steve Reed speech disrupted by farm inheritance tax protesters", "title_page": "Environment Secretary Steve Reed speech disrupted by farm inheritance tax protesters - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Farmers protesting at government changes to agricultural inheritance tax rules have briefly disrupted a minister's speech at a national conference.\nEnvironment Secretary Steve Reed was met with horns from tractors parked outside and protesters who silently unfurled banners in front of him as he outlined farming reforms, which included plans to focus on food production and make the industry more resilient to disruption.\nReed told the hundreds gathered at the National Farmers' Union (NFU) conference that he could not give them \"the answer many of you want on inheritance tax\" but he understood the strength of feeling in the room.\nNFU president Tom Bradshaw told the annual conference on Tuesday the inheritance tax changes were \"morally wrong and economically flawed\".\nUnder the government's planned changes, from April 2026, inherited agricultural assets worth more than £1m, which were previously exempt, will be liable to the tax at 20% - half the usual inheritance tax rate.\nOther allowances could mean a couple who are married or in a civil partnership could pass on a farm worth as much as £3m.\nThe government has previously said that the changes will only impact the wealthiest 500 farms each year, a number disputed by farmers unions which estimate up to 70,000 farms could be affected overall.\nMr Bradshaw, whose speech was also briefly interrupted by two protesters who appeared to be urging people to be vegan, said the government had broken promises made before the election and had increased the mental health pressures on farmers, calling for it to correct the tax policy \"urgently'.\n\"We will fight this family farm tax until ministers do the right thing,\" he said.\n\"Frankly, this government needs a reset moment with farming, where they face up to the reality of how much the industry is struggling.\"\nMany farmers argue that while they are asset rich, for example in terms of their land or livestock, they are cash poor and the proposed changes would mean they would have to sell up in order to pay the tax.\nIn his speech, Reed had also outlined plans for a 25-year farming roadmap and food strategy, which would put food production at its core and make farm businesses more resilient to challenges such as severe flooding, drought and animal disease.\nHe said it would ensure farming is a \"sector which recognises restoring nature is not in competition with sustainable food production, but is essential to it\".\nAs farmers outside the conference centre sounded their tractor horns, he announced measures including extending the seasonal worker visa scheme for five years, support for precision breeding and new technology.\nHe also announced new requirements for government catering contracts to favour \"high quality, high welfare products that British producers are well placed to meet\".\nEarlier in the day, a multi-generational farming family - Martin Towler, his daughter and son-in-law, Hazel and Tom Church, and their five-year-old son Bertie - went to the Treasury to handover a collection of pre-loved farming toys donated by farmers who might be hit by the government's proposed changes to agricultural inheritance tax.\nThe family have been farming Scald End Farm, a mixed beef and sheep farm in north Bedfordshire, since the 1940s but they all now also have to work off farm to supplement their income.\nThey say the impact of the proposed inheritance tax changes will leave them facing a £400,000 bill and the prospect of selling off so much of the 210-acre farm that it would become unviable as a business.\nShadow environment secretary Victoria Atkins has said the Conservatives would reverse the inheritance tax on farmers \"straight away\".\nDuring Tuesday's conference in Westminster - the first time it has been held outside Birmingham for years - Reed, took questions from the audience.\nThere was clear anger among those questioning him on the tax changes and he was told many older farmers \"were wishing their lives away\" and now felt they would benefit their families by dying before the 2026 tax change.\nReed said he would not comment on individual circumstances. He pointed out farmers would still have to pay at half the rate of others and would have ten years to do so.", "url": "https://www.bbc.co.uk/news/articles/c2ljdvqegkeo"}