{"authors": ["Kath Stanczyszyn", "Clare Lissaman", "www.facebook.com"], "date_download": "2025-04-26 03:57:22", "date_modify": "2025-04-26 03:57:22", "date_publish": "2025-03-04 14:08:08", "description": "Refuse workers are among protesters as the council is expected to make spending cuts of about £148m.", "filename": "news_articles_c9degevz999o_1745639842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8c41/live/49363620-f8ea-11ef-808b-234dabc32b78.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9degevz999o_1745639842.html", "title": "Hundreds protest over Birmingham City Council cuts ahead of budget", "title_page": "Hundreds protest over Birmingham City Council cuts ahead of budget - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Striking bin workers and residents opposed to service cuts are among hundreds of people protesting outside Birmingham City Council's headquarters ahead of a key budget meeting.\nThe council is expected to sign off about £148m of spending cuts, which will impact services including adult social care, bin collections and libraries.\nJohnny, who is among about 350 refuse workers involved in strike action, said proposed changes meant his pay would be cut by £8,000 a year when he was already \"struggling\".\nThe council said it was working to ensure its finances would be in a more stable position next year.\nThe authority added that it had made a \"fair and reasonable\" offer to Unite over the bin strikes.\nThe council effectively declared itself bankrupt in September 2023, and had to find at least £300m in savings and sell assets worth £750m by April 2026.\nRefuse workers, who are members of Unite, are concerned over the scrapping of a waste recycling and collection officer role, which the union described as \"safety-critical\".\nIt is among many proposals included in the budget being considered on Tuesday.\nThe council has said all its routes and working practices were risk-assessed and the restructure was in line with national practice.\nDave and Johnny told BBC Radio WM they would both lose £8,000 a year in pay as a result of proposed changes.\nJohnny, who said his rent was £8,000 a year, told the BBC : \"I went to the food bank twice in the last five years on my current salary.\"\nDave said after paying bills, including his mortgage and council tax: \"I will just have enough for food and that's it.\n\"You shouldn't have to live like that, should you?\"\nHe added they were sorry for the inconvenience the industrial action had caused residents but said workers \"had to stand up for what's right\".", "url": "https://www.bbc.co.uk/news/articles/c9degevz999o"}