{"authors": ["Adam Moss", "www.facebook.com"], "date_download": "2025-04-26 04:13:13", "date_modify": "2025-04-26 04:13:13", "date_publish": "2025-03-04 11:45:13", "description": "Police say he subjected her to \"a sadistic campaign of sexual and emotional abuse\".", "filename": "news_articles_cwyd32j8v95o_1745640793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1dcd/live/757df980-f835-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyd32j8v95o_1745640793.html", "title": "Nottingham rapist jailed for life after victim recorded attacks", "title_page": "Nottingham rapist jailed for life after victim recorded attacks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rapist has been jailed for life after his victim recorded his attacks on her mobile phone.\nNottinghamshire Police said Leon Bryan, 36, subjected her to \"a sadistic campaign of sexual and emotional abuse\".\nHe was convicted of three counts of rape, one of sexual assault, a charge of making a threat to kill and one of coercive and controlling behaviour after a trial at Nottingham Crown Court in November.\nBryan, of Bethnal Walk in Bulwell, Nottingham, returned to the court for sentencing on Friday.\nHe was given a life sentence with a minimum term set of 13 years and 246 days for the three rape charges.\nBryan received six years for sexual assault, six years for making a threat to kill and four years for controlling or coercive behaviour.\nAll the terms will be served concurrently.\nHe will also be placed on the sex offenders register and subject to an indefinite restraining order, preventing him from contacting his victim.\nSpeaking after the sentencing, Det Con Harry Cooper said: \"The victim in this case deserves immense credit for the bravery she showed, both while the abuse was happening and afterwards too by reporting it to the police.\n\"The audio clips she managed to record of Bryan's crimes were harrowing in the extreme for our investigating officers to hear, while I imagine it would've been the same for the jury too.\n\"Despite denying doing anything wrong and making the woman relive everything that happened to her again during the trial, the jury thankfully saw through Bryan's lies and saw him for the despicable person he is.\"", "url": "https://www.bbc.co.uk/news/articles/cwyd32j8v95o"}