{"authors": ["Alex Blake", "www.facebook.com"], "date_download": "2025-04-26 03:45:54", "date_modify": "2025-04-26 03:45:54", "date_publish": "2025-03-05 06:10:34", "description": "Kerry Sharpe says serving seven years as an MLC enlightened her on the work that goes into politics.", "filename": "news_articles_cz03914d7emo_1745639154.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8967/live/3cbe6420-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz03914d7emo_1745639154.html", "title": "Seven years in Tynwald an 'eye opener' for former MLC", "title_page": "Seven years in Tynwald an 'eye opener' for former MLC - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Serving on the Isle of Man's Legislative Council was an eye opening experience, a former member has said.\nKerry Sharpe secured 12 votes in Tuesday's vote by MHKs, leaving her one shy of a majority and bringing to an end her seven-year political career.\nGary Clueit, Kirstie Morphet and Peter Reid became the newest faces on the Council, joining returning member Rob Mercer for a five-year term.\nLooking back on her time on the Council, Ms Sharpe said: \"I can say with my hand on my heart that I've done my best over the last seven years.\"\nSharpe said, as an overall experience, she said it had been enlightening to discover \"how hard members of Tynwald work\".\n\"Until you've actually been a member you don't realise how much work goes into it,\" she said.\n\"People really put their heart and souls into the role, it's been an eye opener for me.\"\nMs Sharpe was appointed as the Isle of Man's Children Champion in 2022, which she said fed into research she was already conducting for a book about how the island has cared for its children over the past 150 years.\n\"Being children's champion I then bizarrely became part of the story that I am telling,\" she said.\nLooking ahead, the former MLC said she was aiming to to finish the book by the end of the year, and while her time in politics had come to an end she would \"still be fighting the good fight\".\nIt took members of House of Keys two rounds of voting to fill the four vacancies on the Council, and the successful candidates are set to to be sworn in at a ceremony next week.", "url": "https://www.bbc.co.uk/news/articles/cz03914d7emo"}