{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:56", "date_modify": "2025-05-19 14:47:56", "date_publish": "2015-03-02 00:57:18", "description": "An ex-minister in Peru is charged with involvement in the killing of a journalist during the Shining Path rebel insurgency in the 1980s.", "filename": "news_world-latin-america-31689001_1747666076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81329000/jpg/_81329729_011a709f-ee01-4f32-8081-5c9fdad33a2a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-latin-america-31689001_1747666076.html", "title": "Peruvian ex-minister charged with journalist's murder", "title_page": "Peruvian ex-minister charged with journalist's murder - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A prosecutor in Peru is seeking a 25-year prison term for a former minister accused of ordering the murder of a journalist in November 1988.\nDaniel Urresti, a former army general, says he is innocent and the accusation against him is politically motivated.\nHugo Bustios had been investigating human rights abuses in the Peruvian highlands when he was killed.\nTwo former soldiers were convicted of his murder. One of them accused Mr Urresti of involvement.\nMr Bustios was a correspondent for the national magazine Caretas in the highland town of Huanta, the centre for the guerrilla war between government forces and Shining Path rebels.\nHe was shot and then killed by a grenade in November 1988 while investigating abuses committed by both sides.\nMr Urresti says he is innocent and suggested the charges could be politically motivated.\nPresident Ollanta Humala, himself a retired army lieutenant colonel noted publicly that the charges were announced less than a week after Mr Urresti joined the governing Nationalist Party.\nMr Urresti was one of the government's most popular ministers until he stood down last month and is expected to stand in the presidential elections in 2016.", "url": "https://www.bbc.com/news/world-latin-america-31689001"}