{"authors": ["Esme Ashcroft", "www.facebook.com"], "date_download": "2025-04-26 04:18:35", "date_modify": "2025-04-26 04:18:35", "date_publish": "2025-03-04 06:26:29", "description": "Alice says the approach of Gloucestershire Police destroyed her self confidence.", "filename": "news_articles_c62xdj4kx47o_1745641115.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/71b3/live/09f5cd00-ef84-11ef-85a9-c7d843fd355b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62xdj4kx47o_1745641115.html", "title": "Woman claims Gloucestershire Police menopause discrimination", "title_page": "Woman claims Gloucestershire Police menopause discrimination - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police employee says she was unfairly discriminated against due to her menopause symptoms.\nAlice, who asked not to be named, said Gloucestershire Police failed to make adjustments which would have made it easier for her to carry out her duties and threatened her with performance-monitoring measures.\nThe non-uniform employee, who has since left, is calling for the police to make changes and offer greater support to women living with the menopause.\nGloucestershire Constabulary said it \"always listens to and takes seriously\" employees' concerns.\nAlice took up her final role with the police in 2020. Within a year her menopause symptoms escalated, causing acute pain across her body which left her unable to carry out basic tasks such as cooking, gardening or getting dressed on her own.\nShe said she also became forgetful and suffered \"brain fog\".\nThese issues were raised with her line manager, she added, and she asked for the flexibility to work from home as the noise and environment of the office was making it difficult for her to do her job, but this was denied.\nInstead, she was given a leaflet on the menopause.\nAlice said things got worse in 2022 when she was threatened with having her performance monitored, despite having previously won awards for her work.\nShe said her manager also told her it might be time for her to \"leave the department\" during an informal meeting.\nAfter twice taking time off sick due to the stress and symptoms, she handed in her notice in 2023 despite having no job to go to.\nAlice said she felt she had no option but to leave, and claims she is still living with the emotional impact of how she was treated by the constabulary.\n\"It really pummelled my self-confidence and all of my faith in my skills,\" she added.\n\"I felt like what they had done was [to] completely wipe me out. They laid waste to me, and the organisation really didn't acknowledge what had happened and the severity of the outcome of it.\"", "url": "https://www.bbc.co.uk/news/articles/c62xdj4kx47o"}