{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 03:57:02", "date_modify": "2025-04-26 03:57:02", "date_publish": "2025-03-04 14:29:13", "description": "Council leader Lee Carter says a unitary council merger would not be in the interests of residents.", "filename": "news_articles_c39vzx0we42o_1745639822.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5846/live/5fda36a0-f8ff-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vzx0we42o_1745639822.html", "title": "Telford council chief says Shropshire merger is 'no-go'", "title_page": "Telford council chief says Shropshire merger is 'no-go' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of Telford & Wrekin Council has said a merger with neighbouring Shropshire Council is a \"no-go\".\nIt comes after the government invited all councils in two-tier areas – where there are both county and district councils, and neighbouring small unitary authorities – to set out plans for devolution and reorganisation.\nGuidelines from the government said new councils should aim for a population of 500,000 or more.\nThe Telford & Wrekin unitary authority has a population of 185,600, while Shropshire has 323,600, meaning a merger would take the total just over half a million.\nTelford's council leader Lee Carter told the full council on Thursday such a move would not be in the interests of residents.\n\"The possibility of Telford & Wrekin potentially merging with Shropshire is an absolute no-go, let me be quite clear on that,\" he said.\n\"I have no particular care who the messenger is,\" he said. \"There will simply never be a deal to be done.\"\nHe listed reasons why he believed Telford & Wrekin was different to Shropshire.\nThey included \"outstanding children's services, free parking and green waste collection, and the lowest council tax in the Midlands\".\nCarter said he would \"undoubtedly have to take part in discussions about local government reorganisation\" but his discussions would use a \"simple test\" - whether residents would see improved services.\n\"There is nothing in a reunification with Shropshire that offers benefits to our residents\", he said.", "url": "https://www.bbc.co.uk/news/articles/c39vzx0we42o"}