{"authors": ["Zac Sherratt", "www.facebook.com"], "date_download": "2025-04-26 07:42:58", "date_modify": "2025-04-26 07:42:58", "date_publish": "2025-02-26 18:44:57", "description": "Laura Winham, 41, was found dead in her flat in Woking by her mother and brother in May 2021.", "filename": "news_articles_clyj4edrppzo_1745653378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3824/live/96262e10-f46a-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj4edrppzo_1745653378.html", "title": "Woking council apologises after body lay in flat for three years", "title_page": "Woking council apologises after body lay in flat for three years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has apologised after one of its tenants lay dead in her Surrey flat for more than three years.\nLaura Winham, 41, was found dead in her flat in Woking by her mother and brother in May 2021.\nFollowing the conclusion of the inquest into Ms Winham's death on Tuesday, Woking Borough Council apologised for failings within its housing service.\n\"The tragic events that led to her death and the missed opportunities to discover her body should never have been allowed to happen,\" said Louise Strongitharm, the council's strategic director for communities.\nMs Winham was a vulnerable woman with schizophrenia who had twice been sectioned and had cut ties with her family because she thought they were trying to harm her.\nThe inquest heard how Ms Winham's body was \"mummified and almost skeletal\" when it was found at her council flat in Devonshire Avenue.\nHer cause and time of death could not be determined but a calendar in the flat was crossed off until 1 November 2017.\nMs Winham's mother and brother found her remains after trying to make contact when her father's health was deteriorating.\nCoroner Karen Henderson said Woking Borough Council, its former property manager New Vision Homes, the Department for Work and Pensions (DWP) and Surrey County Council had all missed opportunities to help Ms Winham.\nResponding, Ms Strongitharm said: \"We would like to extend our deepest sympathies to Laura's family.\n\"Woking Borough Council accepts the coroner's findings and those of the Surrey Safeguarding Adult Review, which identified failings within our housing service alongside shortcomings by other agencies. For that we are truly sorry.\"\nMs Strongitharm said the council is committed to addressing the issues raised and has begun to implement changes.", "url": "https://www.bbc.co.uk/news/articles/clyj4edrppzo"}