{"authors": ["Rebecca Brahde", "www.facebook.com"], "date_download": "2025-04-26 07:05:28", "date_modify": "2025-04-26 07:05:28", "date_publish": "2025-02-28 06:29:25", "description": "The final update of the five-year Island Plan will go before Tynwald members for approval in March.", "filename": "news_articles_cjry8wnpv9xo_1745651128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/097e/live/f87656e0-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjry8wnpv9xo_1745651128.html", "title": "Isle of Man government outlines priorities in Island Plan updates", "title_page": "Isle of Man government outlines priorities in Island Plan updates - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An updated roadmap outlining six strategic priorities for the government before the 2026 general election is set to be debated by Tynwald members next month.\nPlans to deliver £50m of public sector efficiency savings, along with initiatives to increase housing occupancy and address the need for homes are among the key goals.\nFirst published in 2022, the Island Plan has been updated annually, with the latest changes creating the final iteration of the document for the current administration.\nChief minister Alfred Cannan said the actions in the update showed the government was \"responding to the world around us\", and \"continually refining\" how to reach goals.\nThe document also includes the introduction of a system of registration for employment agencies and immigration advice services would be set up to ensure those who work on the island have the right to do so.\nImproving travel connectivity has been highlighted as another core aim, with efforts to secure core air routes to London, north-west England and Dublin on long-term deals with airlines set to continue before looking at other routes.\nWork to improve energy security would also continue in the year ahead, with offshore and onshore energy projects underway and plans to integrate solar energy generation on the government estate set to begin.\nThe government document also outlines plans to increase the minimum salary levels required to for some work visas routes, and make a decision on the island's approach to introducing a new health surcharge.\nOther measures aimed at boosting the economy include developing artificial intelligence capabilities, growing the tourism sector, and work on high street renewal through the local economy strategy,\nThe document will be put forward for Tynwald approval in March.", "url": "https://www.bbc.co.uk/news/articles/cjry8wnpv9xo"}