{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:30:17", "date_modify": "2025-04-26 04:30:17", "date_publish": "2025-03-03 06:22:43", "description": "Memorial gardens are planned in Hull and East Yorkshire following the discovery of bodies and ashes.", "filename": "news_articles_cx2865xplllo_1745641817.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b5e/live/f9954670-f5ff-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2865xplllo_1745641817.html", "title": "Hull Legacy funeral home inquiry: Families consulted on memorials", "title_page": "Hull Legacy funeral home inquiry: Families consulted on memorials - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families affected by a criminal investigation into a former funeral home are to be consulted on designs for memorials.\nHumberside Police removed 35 bodies and a quantity of ashes from the premises of Legacy Independent Funeral Directors in March 2024 following a report of \"concern for care of the deceased\".\nA memorial garden is planned to hold the recovered ashes in Northern Cemetery in Hull. A second garden is planned at Lelley Fields Crematorium, near Preston, in the the East Riding of Yorkshire.\nHull City Council said an architect had been working closely with staff at the two sites to come up with designs \"that fit in with the character and appearance of both facilities\".\nTracy Meyerhoff, from the city council, said: \"We're continuing to support people who are still dealing with this distressing situation.\n\"It's really important that they are involved in shaping these permanent memorials, so we've been hearing from them about the type of things they'd like to have.\"\nThe Legacy investigation identified 163 families linked to ashes found at the funeral home, with some being taken by families to conduct their own ceremonies.\nThe Northern Cemetery memorial would be called The Forget-Me-Not Garden. It would be the final resting place for the ashes of almost 100 people.\nAccording to the proposals, an above-ground vault would hold 25 sets of ashes, which have yet to be identified, so family members who come forward in the future would be able to take them.\nAshes would not be scattered at Lelley Fields.\nA series of events are due to be held in Hull and the East Riding during April to gather feedback on the designs.\nIn January, police passed a file containing more than 13,000 exhibits to the Crown Prosecution Service, which will consider whether to bring charges.\nA 46-year-old man was arrested on 9 March last year on suspicion of prevention of a lawful and decent burial, fraud by false representation and fraud by abuse of position.\nA 54-year-old woman was arrested in July on suspicion of money laundering offences.\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cx2865xplllo"}