{"authors": ["Richard Stead", "www.facebook.com"], "date_download": "2025-04-26 06:48:51", "date_modify": "2025-04-26 06:48:51", "date_publish": "2025-03-01 10:23:37", "description": "Traders plead with Stockport Council to rethink new car parking charges at 21 sites in the borough.", "filename": "news_articles_cvgpexpmm32o_1745650131.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/de4c/live/10d19a70-f685-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgpexpmm32o_1745650131.html", "title": "Stockport car parking charges will 'reduce footfall'", "title_page": "Stockport car parking charges will 'reduce footfall' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shopkeepers fear car parking charges set to be introduced in April will \"reduce footfall\" in their villages.\nThe charges will apply in local centres across Stockport where its currently free to park.\nSeveral traders in Marple Bridge and Woodley have pleaded with the council for a rethink, urging them to find cash from other parts of their budget.\nStockport Council said: \"Introducing parking charges is never an easy decision and we fully understand the impact on residents.\"\nThe charges will be introduced at 21 car parks including in Reddish, Cheadle Hulme, High Lane and Davenport.\nDrivers will be charged 50p for an hour rising to £2.40 for ten hours.\nThe council said a key principle for the introduction of charges is to support its approach to tackling climate change by encouraging active travel.\nBut Paul Dutson, who runs a delicatessen store in the village of Marple Bridge, said: \"It's been rather secretive and around 90% of our trade is to local people.\"\nCaron Gardner, who owns the Browse ladieswear boutique in Marple Bridge, is concerned about charges being introduced at the nearby Brabyns Brow car park.\nShe said: \"We are just not going to get the footfall, we are going to lose people who just want to nip into the village to browse.\"\nRichard Noble, who runs the Town Street Fryer fish and chip shop, said he relies on people parking for a short time to pick up their food.\n\"We need customers to be able to park without having to go to a machine and pay for a ticket.\n\"It'll just deter people from coming to Marple Bridge.\"", "url": "https://www.bbc.co.uk/news/articles/cvgpexpmm32o"}