{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:59:48", "date_modify": "2025-04-26 03:59:48", "date_publish": "2025-03-04 06:01:03", "description": "Industrial action begins at Newcastle University, in the face of 300 potential job losses.", "filename": "news_articles_cd7egw1139do_1745639988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3177/live/a37abc60-f8df-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7egw1139do_1745639988.html", "title": "University staff begin 14 days of strike action", "title_page": "Newcastle University staff begin 14 days of strike action - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Staff at a city centre university have begun 14 days of strike action amid job losses.\nA £35m shortfall has led to Newcastle University approving a £20m reduction in its salary bill - the equivalent of about 300 jobs.\nThe University College Union (UCU) general secretary Jo Grady said \"thousands of jobs are set to disappear\" across the sector which, she said, would be \"hugely damaging to students\".\nNewcastle University said it was \"extremely disappointed by the start of the industrial action\", but recognises it is \"not a decision that colleagues take lightly\".\nKyra Helberg, 27, who is a PHD student and lecturer of Medical History said she was \"seriously concerned\".\n\"The job cuts make me question if I have a future in this industry,\" she said.\nSenior lecturer in Linguistics Geoff Poole, 55, said: \"It's a scary and frustrating time, we're talking about the end of people's careers.\"\nNewcastle University said structural underfunding, rising costs and shifts in international student markets had led to the current economic challenges.\nIt wanted to work \"constructively\" with unions to \"build a more sustainable future\", while also supporting \"colleagues throughout this challenging time\", it said.\nA spokesperson said: \"The challenges we are facing are being felt by universities across the UK.\"\nMs Grady said UK higher education was \"on its knees, with thousands of jobs set to disappear from across the sector\" and some courses being cut.\n\"This will be hugely damaging to students,\" she said.\nThe UCU was \"fighting to protect jobs and course provision for current students, and future generations\", she added.", "url": "https://www.bbc.co.uk/news/articles/cd7egw1139do"}