{"authors": ["Steve Beech", "www.facebook.com"], "date_download": "2025-04-26 03:46:21", "date_modify": "2025-04-26 03:46:21", "date_publish": "2025-03-05 06:00:29", "description": "The future is looking brighter for a community-run Peak District pub which has a new tenant", "filename": "news_articles_crlx3ezg832o_1745639181.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0424/live/9b6c54a0-f92c-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlx3ezg832o_1745639181.html", "title": "New tenant for closure-threatened community pub", "title_page": "New tenant for closure-threatened community pub - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new tenant has been found for a community-owned Peak District pub which locals feared might close.\nThe Anglers Rest in Bamford has been described as the \"beating heart\" of the village, but big increases in utility bills meant its trustees had become increasingly concerned about its viability.\nVillagers started a campaign to raise £30,000 to keep it open in the short-term so a new tenant could be found.\nSelf-proclaimed \"troubleshooter\" Rick Ellison, who has saved four pubs and four hotels which were closed or closing in Buxton and the Peak District, offered to help.\nThe building is registered as an \"asset of community value\", and Mr Ellison said he was now leasing the pub from the Bamford Community Society.\nThe Anglers Rest was taken over by the community in 2013 and has been run with a mix of paid staff and volunteers.\nIt also hosts a post office and separate cafe.\nBut it has struggled recently with less money being spent in the pub as a result of an increase in the cost of living.\nBut Mr Ellison is confident for the pub's future.\n\"It's got Bamford community behind it,\" he added. \"They've really given it all.\"\nThe pub is closed while building work is being carried out, and 40-year-old Rick is optimistic.\n\"It's an exciting project, but it's been an exciting project for the community for a long time.\n\"It got to the stage where they were really struggling, so if I can help it and get it back on its feet, then that's great.\n\"We are kitting it out with a new bar, working with local suppliers and local breweries. We are really excited for the future.\"", "url": "https://www.bbc.co.uk/news/articles/crlx3ezg832o"}