{"authors": ["Bethan Bell", "www.facebook.com"], "date_download": "2025-04-26 04:29:04", "date_modify": "2025-04-26 04:29:04", "date_publish": "2025-03-02 08:24:16", "description": "In 1965, the nation was united in following an escaped golden eagle's short period of liberty.", "filename": "news_articles_clyj48q54djo_1745641744.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/19ab/live/5d678d30-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj48q54djo_1745641744.html", "title": "On a wing and a glare: When an escaped eagle Goldie entranced London", "title_page": "On a wing and a glare: When an escaped eagle Goldie entranced London - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Twelve days in 1965 saw the general public gripped by the exploits of a fugitive bird, a golden eagle that had escaped from London Zoo in Regent's Park.\nThe bird, in an inevitable shorthand created by the press, was given the sobriquet \"Goldie\", as he became headline news.\nHe had managed to swoop from his cage when the keeper who cleaned out the enclosure was a little lax in ensuring he'd closed the door properly.\nGoldie spent his freedom soaring above the park, with brief forays into other parts of the capital.\nDrivers caused traffic jams as they slowly circled the park, gazing at the sky; reporters attempted to capture the bird with a variety of novel methods, the Royal Navy was consulted, firefighters and the Civil Defence Service were roped in to help.\nThe early days of 1965 were bitterly cold, with a low of -7.4C recorded in London at the beginning of March. There was heavy snowfall, occasional blizzards and a biting easterly wind.\nIn terms of what was going on, Winston Churchill died, Harold Wilson survived a vote of no confidence as prime minister and the second Beeching Report into the railways was published.\nThe Kray twins were arrested and both the Righteous Brothers and Cilla Black were in the top 10 with You've Lost That Lovin' Feelin'.\nMalcolm X was assassinated and US President Lyndon B Johnson widened his country's involvement in the Vietnam War.\nCrowds, many with a newfound (self-proclaimed) expertise in ornithology, braved the wintry weather to gather with picnics to observe, and, less wholesomely, to throw snowballs at the eagle.\nThousands wrote letters to suggest ways of capturing Goldie, including \"get a gun that shoots a net\" and \"use archers to fire drugged meat into the air\".\nOne woman, it was reported, turned up with a giant telescope \"handed down from Trafalgar by some nautical ancestor\".\nAnd a BBC news reporter grasped the rare opportunity to try to woo him from the skies by whistling a magic pipe.\nExperts were largely unbothered by Goldie's continued refusal to return to the zoo, knowing he would come down \"once he gets hungry\".\nA zoo-keeper explained: \"The crowds are too big. He's just under observation today. We are keeping vigil.\"\nThe hordes of people going to the park were more trouble.\nOne park-keeper was heard to grumble it was \"like a great big bank holiday scene\".\nCouples with \"baskets of bottled beer and blankets\", children wildly misidentifying pigeons and press photographers resignedly legging it around the grass in an attempt to get their shot all added to the chaos.\nThe Times described a \"fashionable Sunday excursion\" where the \"crowd streamed from every gate of the park, and with upturned faces and loud voices had intimate discussions about Goldie's mating habits, his digestion, and his ferocity\".\nThe bird-keepers from the zoo said if they could stop Goldie eating for another two or three days they might have a reasonable chance of luring him down when the park was less congested.\nAnd this philosophy of letting Goldie stay where he was until he was hungry seemed to be a good one - until he started to show hitherto unsuspected initiative.\nThe giant bird - he had a wing span of six feet - first set his sights on a Cairn terrier.\nThe dog's owner, it was reported, managed to scare Goldie away by vigorously waving copies of the Times and the Express at him - although why she had two daily papers with her was never addressed.\nThe fierceness of the defence obviously stayed with Goldie - he later saw a poodle and hastily flew away.\nNot so lucky, though, were the Muscovy ducks that graced the pond of the US ambassador's residence in Regent's Park, Winfield House.\nGoldie's duck meal, however, was disturbed by a helpful reporter, who thought he would throw his coat over the eagle in an attempt to delay him on the ground and facilitate his capture.\nGoldie just soared off into the snow-laden wind, leaving behind half a duck - and a jacket soiled with a bird's displeasure.\nThe coat-thrower was not the only news reporter hoping to become part of the story.\nFor the BBC, John Timpson - best known for presenting the Today programme - turned up with an instrument he had, with astonishing foresight, picked up while covering the Queen's recent trip to Ethiopia.\nHe described his \"Ethiopian bird pipe\" as having two mouthpieces, one of which would produce a sound that would make a bird raise one leg, and the other mouthpiece the other leg.\nBlowing on both sides, he explained, should cause the golden eagle to fall from the skies in a sort of daze.\nSo he gave it a go.\nA fairly reedy warble emerged, which Goldie ignored.\nThe methods used by exasperated zoo-keepers included trying to dazzle the bird with a fire brigade searchlight before nabbing him when he was distracted.\nHowever, as reported by the Mirror: \"The ploy failed when Goldie's eagle-eye spotted the turn-table... He seems to be having the time of his life.\"\nEfforts to capture him were further hindered by members of the public, \"shouting and flapping their winter coats\" to warn Goldie - whom they assumed wanted to stay on the loose - when they thought a tamer was getting too close.\nGoldie would escape again, for five days in December 1965. Once again, he managed to nip out as the zoo-keeper left after cleaning his enclosure.\nThis time people were asked to stay away from Regent's Park.\nGoldie's mate, Regina, had her own adventure when she was snatched the following February by student pranksters at Manchester University who sawed through a padlock to access the cage.\nThey had, it later transpired, thought they had taken Goldie.\nRegina was found in a tea-chest punctured with airholes outside the student union before being taken back to London.\nThe jokers were described as \"stupid, irresponsible clots\".\nRegina enjoyed a raw beef late-night snack and was back to share her travails with Goldie by breakfast time.\nGoldie was eventually sent to a bird of prey centre in Newent, Gloucestershire, where he died in 1986.", "url": "https://www.bbc.co.uk/news/articles/clyj48q54djo"}