{"authors": ["Nadine Yousif", "www.facebook.com"], "date_download": "2025-04-26 04:06:10", "date_modify": "2025-04-26 04:06:10", "date_publish": "2025-03-03 17:02:35", "description": "Robert Crimo III entered the guilty plea moments before opening arguments in his trial.", "filename": "news_articles_c78e7gjz387o_1745640370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d72f/live/a1ab67f0-f84d-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c78e7gjz387o_1745640370.html", "title": "Illinois man pleads guilty to 4 July Highland Park mass shooting", "title_page": "Illinois man pleads guilty to 4 July Highland Park mass shooting - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Illinois man has pleaded guilty to a deadly shooting at a 2022 Independence Day parade in a Chicago suburb that killed seven and injured dozens.\nIt is a surprise reversal for Robert Crimo III, who previously pleaded not guilty to first degree murder and attempted murder charges.\nCrimo, 23, entered his guilty plea on Monday moments before opening arguments were due to begin in his trial.\nHe is accused of shooting at celebrating crowds from a roof in downtown Highland Park, about 30 miles (50 kilometres) north of Chicago.\nAuthorities had arrested him on the day of the shooting after a manhunt.\nCrimo pleaded guilty before Judge Victoria Rossetti in a Lake County circuit courtroom, and did not say anything else before he was dismissed.\nAccording to the Chicago Tribune, the suspect's mother briefly interrupted after he pleaded guilty, resulting in the judge warning her that she could be kicked out of the courtroom.\nHis trial was expected to last a month, with testimony from survivors and police.\nCrimo faces seven murder counts and a mandatory sentence of life in prison without parole.\nHe is due to be sentenced on 23 April.\nProsecutors said they also turned over thousands of pages of evidence, including a videotaped interrogation during which police say the suspect had confessed to the shooting.\nThe victims killed in the shooting were Katherine Goldstein, 64; Jacquelyn Sundheim, 63; Stephen Straus, 88; Nicolas Toledo-Zaragoza, 78; Eduardo Uvaldo, 69; and married couple Kevin McCarthy, 37, and Irina McCarthy, 35.\nMore than 40 others were injured, with victims ages ranging from their 80s to an eight-year-old boy who was left paralysed.\nProsecutors during the trial said Crimo had disguised himself in women's clothing before he accessed a rooftop and opened fire on parade-goers.\nHe then left the area, dropping his semi-automatic weapon.\nAuthorities said Crimo had driven for more than two hours to Wisconsin after the shooting before he was caught by police.\nPolice recovered 83 spent shell casings, as well as rifle magazines, from the scene of the shooting.", "url": "https://www.bbc.co.uk/news/articles/c78e7gjz387o"}