{"authors": ["Sara Dafydd", "www.facebook.com"], "date_download": "2025-04-26 07:26:49", "date_modify": "2025-04-26 07:26:49", "date_publish": "2025-02-27 22:13:52", "description": "Last month it was confirmed that the humanities courses at the campus will be moved to Carmarthen.", "filename": "news_articles_c1d44kzw950o_1745652409.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/75bb/live/1df31570-f555-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d44kzw950o_1745652409.html", "title": "Lampeter University 'Long-term decline' in students", "title_page": "Lampeter University 'Long-term decline' in students - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A university campus facing financial pressures has seen undergraduate student numbers fall from 562 in 2015-16 to 92 this year, an official has said.\nProf Elwen Evans, vice-chancellor of University of Wales Trinity Saint David (UWTSD), spoke at a meeting to discuss the future of the university's Lampeter campus in Ceredigion, attended by about 300 people.\nUWTSD has said it had been \"clear\" the Lampeter campus is not closing, but it is looking at different ways to hold events linked to education.\nHowever, last month it was confirmed the humanities courses at the campus will be moved to Carmarthen, a move that has been highly criticised.\nProf Evans said there was a \"long-term decline\" in undergraduate students, and people must \"face the reality\" that fewer students are choosing Lampeter to study due to \"location\" and \"transportation\".\nShe added one of the \"fundamental misconceptions\" is the belief the university is closing the campus, which Prof Evans emphasised has \"been no part of our plan\".\nSpeaking of the \"existential crisis\" facing universities in general, she said there are \"significantly fewer\" students in Wales going into higher education than the rest of the UK.\nShe also said the university is wholly dependent on student fees. \"We have no reserves. We have no money saved,\" she said.\nThose at the meeting heard the cost of running the campus in Lampeter, which is located in the centre of the town and has a population of around 3,000, is £2.7m a year, but Prof Evans said student income is \"way less than that\".\nEmotions were high in the meeting, which was chaired by Member of the Senedd for Ceredigion Elin Jones.\nResponding to questions from students about their experience, Prof Evans said it was important for students to \"be in a more vibrant, fuller and bigger environment\".\nOne international student said she was \"shocked\", adding it was \"more disappointing\" than having to cancel her wedding last year.\nAfter the meeting, Prof Evans said the decision to relocate humanities studies to the Carmarthen campus was to preserve the subject and keep the Lampeter site open before undergraduate numbers decline.\nShe added it was aimed at keeping the campus \"alive and vibrant\" while maintaining humanities provision - and \"the absolute opposite of putting a nail in any coffin\".\nAsked whether the university had \"let [student] numbers dwindle over the years\", Prof Evans said they had looked at the data and taken steps when she came into the role after being appointed in May 2023.\n\"I'm dealing with what's in front of me, and I am hoping that I can drive the change that we need to achieve - both to make the humanities thrive in Carmarthen, but also to make this wonderful campus vibrant as well,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c1d44kzw950o"}