{"authors": ["Zoie O'Brien", "Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 06:20:07", "date_modify": "2025-04-26 06:20:07", "date_publish": "2025-03-01 06:36:55", "description": "Women and girls from Afghanistan share the realities of living under oppressive Taliban rule.", "filename": "news_articles_cy0dxnxlndjo_1745648407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6703/live/e7c90560-f5ed-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy0dxnxlndjo_1745648407.html", "title": "New Ipswich exhibition giving Afghan women and girls a voice", "title_page": "New Ipswich exhibition giving Afghan women and girls a voice - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Women from Afghanistan have shared their stories of living under Taliban rule for a new exhibition.\nWindow to the Soul Afghanistan launched on Friday, at Jerwood DanceHouse in Ipswich, and will be displayed for four weeks.\nThe project team spent the last year creating a secure platform for women still in Afghanistan, and those who had left, to share their stories of life before and after the Taliban\nNageena, 17, who fled Afghanistan and moved to England three years ago, worked on the project and said she missed her home.\nThe Taliban, a hardline Islamist group, took control of Afghanistan in 2021 and under its rule women and girls have been subject to strict and oppressive laws.\nNageena and her family fled Afghanistan the day the group took over, which she said was \"a very bad day\".\nShe still has family there and said her female relatives, over the age of 12, were not allowed to attend school due to the Taliban's ban.\nShe stressed the importance of education and said it was \"not only about what boys and men can do\".\nNow living in Suffolk, Nageena is studying a college hairdressing course, but she admitted she still thought about her home.\n\"I miss my country because it is my home, but I can't go home,\" she continued.\n\"When I think about my country I feel very broken in my heart and it's very sad for us.\"\nShe said the exhibition had made her feel brave and that she was capable of anything.\nHannah Aria is a local artist who helped set up the exhibition.\n\"I started off working with refugees in Ipswich,\" she explained.\n\"As you gain more connections with people, you connect with the stories and then you want to do something positive to help.\"\nShe was introduced to a contact in Afghanistan and through them, met others who shared their stories.\nThe exhibition makes use of virtual and augmented reality to tell the stories of \"people from Afghanistan in an amazing game-like format\", Ms Aria said.\nShe added the exhibition aimed to apply for more funding to expand it further and tell more stories in the future.\n\"We want to change the world,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cy0dxnxlndjo"}