{"authors": ["Liam Barnes", "www.facebook.com"], "date_download": "2025-04-26 03:49:17", "date_modify": "2025-04-26 03:49:17", "date_publish": "2025-03-05 13:42:29", "description": "She also went missing from home days before a bail hearing was due, an inquest hears.", "filename": "news_articles_cm2jzgg97l6o_1745639357.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a2e0/live/2138b6e0-f9b0-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzgg97l6o_1745639357.html", "title": "Girl took overdose days before terror charges made", "title_page": "Rhianan Rudd: Girl took overdose days before terror charges made - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A girl took an overdose days before she was charged with terrorism offences, an inquest heard.\nRhianan Rudd was 15 when she took an overdose at her Bolsover home on 10 April 2021, eight days before a bail hearing was due to take place.\nChesterfield Coroner's Court heard on Wednesday how a Derbyshire County Council social worker had warned of \"the potential for a future incident\" the day before and said proceedings against her were \"a primary concern\".\nAfter being charged, Rhianan was remanded to Bluebell House Residential Home in Nottinghamshire, where she took her own life on 19 May 2022, months after the charges had been dropped.\nThe court heard from Tom Carty, who took over Rhianan's case in November 2020, shortly after she had been arrested.\nHe made a number of home visits which examined her mental health relationship with her family and her feelings on her upcoming bail date, which was set to take place on 18 April.\nOn one occasion he had recorded in documents that Rhianan expressed a wish to be deradicalised, describing her views as \"cringe\", but on another she felt she was \"far too into this now\" to change.\nRhianan, who had a history of self-harm, was also reported to have felt that \"nobody cares for her\", with her mental health in early 2021 described as \"low\".\nOn 9 April, Mr Carty carried out a home visit where he wrote in documents that she was \"clearly very low in mood, and the impending bail date is really upsetting her\".\n\"I worry Rhianan will feel more and more disillusioned about life, as the process does not recognise the mental health impact upon her,\" he wrote.\n\"There is the potential for another incident.\"\nOn 10 April, Derbyshire County Council was told Rhianan had been taken to hospital in Chesterfield after taking an overdose.\nThe court heard her intention had been to take her life, before she told her mother, Emily Carter, and an ambulance was called.\nMr Carty said he was concerned Ms Carter was \"feeling lost\" as to how to look after Rhianan and had wanted her to go to a secure unit.\nAfter a home visit on 12 April, he wrote that the events on 10 April \"could have been far more serious than they were\" and he warned of another potential incident.\n\"Rhianan is a clever individual and coupled with her potential needs around autism spectrum disorder [ASD] there could be a major incident that ends Rhianan's life,\" he wrote.\nMr Carty told the court his view at the time was against taking her to a home despite the concerns.\n\"That's a last resort,\" he said.\n\"I think a secure environment would have been a negative experience for Rhianan.\"\nOn 15 April, Rhianan absconded from home and was arrested by police at Sheffield bus station for breaching bail conditions.\nShe was then charged with terrorism offences, with Mr Carty acting as her appropriate adult during a virtual hearing, where she was remanded into the care of the county council.\nWhen asked if her bail hearing was concerning Rhianan when she overdosed and absconded, Mr Carty said: \"I believe that was a primary worry at the time.\"\nRhianan was taken to Bluebell House where Mr Carty told the court her mood and condition improved.\nDespite six reported self-harm incidents up to 17 August, he said she had been \"consistently\" making progress since leaving home and that self-harm was \"decreasing\".\nWhen questioned about the discovery of two diaries - which included drawings of hanging bodies, a swastika made from her own blood, and expressions of suicidal wishes alongside plans to attend anime conventions - he said Rhianan had become better at expressing her feelings to staff and trusted them to help her.\n\"I know there's a bit of a duality [in having concern and reporting improvements], but we could see the progress,\" he said.\nAfter a visit in August the court heard Rhianan told Mr Carty she wished to stay at the home, which he said was the best place for her.\n\"I think that loving, therapeutic relationship that they had with her brought about these [positive] changes,\" he said.\nThe court heard Mr Carty reported to colleagues Rhianan's mental health improved after the criminal charges against her were removed, which followed her being identified as a victim of exploitation in the period before her arrest.\nOn 1 March 2022, he told Rhianan that he had handed in his notice and she would be getting a new social worker.\n\"I think she was sad about me leaving, and I was equally sad about ending my working relationship with her,\" he said.\nAfter handing over her case and the rest of his workload on 22 March, Mr Carty was invited to a lunch by Rhianan the following day, where he said she offered to pay for his meal, gave him chocolates and hugged him.\nHe said he turned down her offer to pay but accepted the gift and the hug, and when asked to compare the Rhianan he left to the child he had initially met, he said she had changed dramatically.\n\"Rhianan had a clear plan for the future,\" he said. \"I thought when I left, I had left Rhianan in a much better place than when I found her.\"\nThe inquest continues.\nIf you have been affected by any of the issues in this story, support is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/cm2jzgg97l6o"}