{"authors": ["Konul Khalilova", "www.facebook.com"], "date_download": "2025-05-19 14:47:53", "date_modify": "2025-05-19 14:47:53", "date_publish": "2015-02-28 00:04:51", "description": "A century before Islamist gunmen attacked France's satirical magazine Charlie Hebdo, a similar magazine was being read by Muslims in the Russian empire.", "filename": "news_world-europe-31640643_1747666073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81273000/jpg/_81273235_crete.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31640643_1747666073.html", "title": "How Muslim Azerbaijan had satire years before Charlie Hebdo", "title_page": "How Muslim Azerbaijan had satire years before Charlie Hebdo - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "More than 100 years before militant Islamist gunmen murdered journalists at France's satirical magazine Charlie Hebdo, another magazine very similar in style was playing an important role among the Muslim populations of both the Russian and Persian empires.\nAzerbaijani weekly magazine Molla Nasreddin was revolutionary for its time, bravely ridiculing clerics and criticising the political elite as well as the Russian Tsar and the Shah of Persia.\nFounded in 1906, it pulled no punches in tackling geopolitical events and also promoted women's rights and Westernisation.\nThe editor-in-chief of the magazine was Jalil Mammadguluzadeh (known as Mirza Jalil), a famous Azerbaijani writer, who was also a well-known novelist.\nIn his book, The Dead, the main protagonist is a drunken atheist, treated as a madman for telling the truth about his backward society, where girls as young as nine are forced to marry 50-year-old men.\nThe magazine's title, Molla Nasreddin, came from the name of the naive but wise mullah, famous throughout the Middle East for his anecdotes.\nOn the cover of the first issue, Molla Nasreddin is shown waking \"the sleeping nations of the East\".\nFor more than 20 years, the magazine bearing his name would present the world to its readers through the medium of cartoons and text.\n\"The magazine's first issue exploded like a bomb,\" renowned writer Ebdurrehimbey Haqverdiyev recalled in his memoirs.\n\"Mullahs were saying that the magazine should not enter the house of any Muslim. If it does, they said, grab it with tongs and throw it down the toilet.\"\nMirza Jalil said his magazine was a product of its time, when the majority of the population was illiterate, ruled by the Russian and Persian empires and directed by religious leaders.\nIt was published in the Azerbaijani language (initially in Arabic script but later in Latin, with the start of the Soviet regime) but occasionally in Russian, too.\nThe following two cartoons are particularly forthright in the way they compare negatively the product of education at religious, \"Asian schools\" with the results from secular, European institutions.\nBut mocking clerics and campaigning for women's rights came with its own risks.\nMullahs in Persia issued a fatwa calling for Mirza Jalil's death. He was attacked in the Georgian capital, Tbilisi, where the magazine was published, and constantly threatened. The city was then the cultural capital of Russia's South Caucasus.\n\"Had I published the magazine not in Tbilisi but in Baku or Yerevan [capital of modern-day Armenia where Azerbaijanis made up the majority of the population at the time], they would have destroyed my office and killed me,\" Jalil explained.\nFor many of its readers, the magazine opened a window on world politics, but in satirical language.\nThe cartoon below shows the Ottoman sultan, who was fighting to recover the island of Crete from the Greeks, being given a shower by the \"Great Powers\".\nThe magazine campaigned for women's rights and played an important part in women in Azerbaijan being granted the right to vote in 1919, at around the same time as women in the UK and US.\nSifting through old copies of the magazine in Azerbaijan's National Library, it becomes clear how daring the writers and illustrators of Molla Nasreddin were.\nIn a 1929 edition, a cartoon was published of the Prophet Mohammad, although without depicting his face.\nBy this time Azerbaijan was a Soviet state and publication was taking place in the capital, Baku. Nevertheless, the majority of the population were still conservative Muslims.\nThe cartoon features a dialogue between Jesus and Muhammad and shows people drinking at Christmas.\nIt clearly poked fun at Muslims who drank, despite their religion prohibiting consumption of alcohol.\nBut the magazine was not to last.\nBy the early 1930s, the authorities told Mirza Jalil to change its name to Allahsiz (Godless) and follow the principles of Soviet ideology.\nUnable to accept Soviet censorship, his relationship with the magazine came to an end.", "url": "https://www.bbc.com/news/world-europe-31640643"}