{"authors": ["Faisal Islam", "www.facebook.com"], "date_download": "2025-04-26 03:38:25", "date_modify": "2025-04-26 03:38:25", "date_publish": "2025-03-05 00:01:12", "description": "Cuts to areas including welfare will be put to the official forecaster ahead of the Spring Statement.", "filename": "news_articles_c1lpjqg2mp5o_1745638705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d13/live/121ef330-f9c0-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1lpjqg2mp5o_1745638705.html", "title": "Chancellor set to cut welfare spending by billions", "title_page": "Chancellor set to cut welfare spending by billions - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The chancellor has earmarked several billion pounds in draft spending cuts to welfare and other government departments ahead of the Spring Statement.\nThe Treasury will put the proposed cuts to the government's official forecaster, the Office for Budget Responsibility (OBR), on Wednesday amid expectations the chancellor's financial buffer has been wiped out.\nSources said \"the world has changed\" since Rachel Reeves's Budget last October, when the OBR indicated she had £9.9bn available to spend against her self-imposed borrowing rules.\nThe OBR's forecast is likely to see that disappear because of global factors such as trade tariffs, as well as higher inflation and borrowing costs in the UK.\nThe Treasury will on Wednesday inform the OBR of its \"major measures\" -essentially changes to tax and spending in order to meet the chancellor's self-imposed rules on borrowing money.\nThe government has committed to get debt falling as a share of the economy during the course of this Parliament, and to only borrow to fund investment, not to cover day-to-day spending.\nSuch rules, put in place by most governments in wealthy nations, are designed to maintain credibility with financial markets. Reeves has repeatedly said her rules are \"non-negotiable\".\nThe spending cuts drafted by the Treasury will help plug the gap that has emerged in recent months, ahead of the OBR publishing its forecast and Reeves giving a statement on 26 March.\nThe Treasury has blamed several global factors, including trade tariffs and the war in Ukraine for pushing up government borrowing costs.\n\"Clearly the world has changed a lot since the autumn Budget. People are watching that change happen before their eyes,\" a government insider told the BBC.\n\"The Office for Budget Responsibility will reflect that changing world in its forecasts later this month and a changing world will be a core feature of the chancellor's response later this month.\"\nInsiders expect \"politically painful\" new welfare cuts that are designed to reduce the huge growth in health-related benefits, which will be outlined in a forthcoming speech from Work and Pensions Secretary Liz Kendall.\nAsked on Wednesday if welfare cuts were the right approach, Justice Secretary Shabana Mahmood told the BBC Radio 4's Today programme there had been a \"huge rise in the welfare budget\" and there were \"too many\" young people not in work, education or training.\n\"There's a moral case here for making sure that people who can work are able to work and there's a practical point here as well, because our current situation is unsustainable,\" she added.\nReeves has previously pledged \"fundamental\" reform of the welfare system, with concerns over rising spending on health-related benefits.\nLast year, the government spent £65bn on sickness benefits, external - a 25% increase from the year before the Covid pandemic. That figure is forecast to increase to around £100bn before the next general election.\nSome of that is a legacy of Covid, but ministers have complained about incentives which encourage some to \"game the system\".\nPeople on universal credit must show evidence they have applied for jobs, or face sanctions - but people out of work who also qualify for sickness benefits both get more money and are not necessarily required to seek work.\nSteve Wright, Fire Brigades Union general secretary, said any welfare cuts \"would be an outrageous attack on the poorest and most vulnerable\".\nThe chancellor will argue she hasn't changed her plans and that the government was always going to \"fix welfare to get people back to work\" and \"make the NHS more productive\".\n\"Headroom or no headroom, the chancellor is determined to push through the change we need to make Britain more secure and prosperous, with the whole government making that argument in the coming weeks,\" an insider told the BBC.\nThis week, US President Donald Trump imposed tariffs on its three biggest trading partners: Canada, Mexico and China.\nTrump has indicated that the UK could avoid border taxes, but Reeves has told the BBC that even if the UK is not hit by tariffs, a global trade war would lower growth and raise inflation.\nUncertainty over the war in Ukraine also remains, with the UK deciding to boost defence spending by cutting international aid.\nIn the run-up to the Spring Statement, Cabinet Office minister Pat McFadden and Health Secretary Wes Streeting will also outline a significant efficiency drive within the civil service, which they hope will lead to significant headcount and cost savings.\nIt is understood that the euro area economy stagnating and lower UK productivity numbers have affected the OBR's forecast.\nBut there have also been concerns raised about the impact of Reeves's previously announced tax rises on businesses, which are set to take effect in April, on the UK economy.\nInflation, which measures the rate of price rises over time, is expected to rise in the coming months as households are hit with increases to energy, water and council tax bills.", "url": "https://www.bbc.co.uk/news/articles/c1lpjqg2mp5o"}