{"authors": ["Barbara Plett Usher in Port Sudan & Natasha Booty in London", "www.facebook.com"], "date_download": "2025-04-26 04:02:30", "date_modify": "2025-04-26 04:02:30", "date_publish": "2025-03-04 01:11:58", "description": "Children as young as one have been subjected to horrific sexual violence, a UN report finds.", "filename": "news_articles_cvgpdxk853jo_1745640150.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50b9/live/82f3b540-f895-11ef-9902-69cbd80fa0ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgpdxk853jo_1745640150.html", "title": "Sudan civil war: One-year-olds among those raped, UN says", "title_page": "Sudan civil war: One-year-olds among those raped, UN says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Armed men are raping and sexually assaulting children as young as one during Sudan's civil war, says the UN children's agency, Unicef.\nSo traumatised are the survivors that some say they have attempted to end their lives.\nMass sexual violence has been widely documented as a weapon of war in the country's nearly two-year conflict.\nBut Unicef's report is the first detailed account about the impact of rape on young children in Sudan.\nA third of the victims were boys, who typically face \"unique challenges\" in reporting such crimes and seeking the help they need.\nUnicef says that, although 221 rape cases against children have been officially reported since the start of 2024, the true number is likely to be much higher.\nSudan is a socially conservative country where huge societal stigma stops survivors and their families from speaking out about rape, as does the fear of retribution from armed groups.\nThe Unicef report provides an appalling window into the abuse of children in the country's civil war.\nPerhaps its most shocking revelation is that 16 of the victims were under the age of five years, including four infants.\nUnicef does not say who is responsible, but other UN investigations have blamed the majority of rapes on the paramilitary Rapid Support Forces (RSF), saying RSF fighters had a pattern of using sexual violence to terrorise civilians and suppress opposition to their advances.\nThe RSF, which is fighting this war against its former allies, the Sudanese Armed Forces, has denied any wrongdoing.\n\"Children as young as one being raped by armed men should shock anyone to their core and compel immediate action,\" said Unicef executive director Catherine Russell.\n\"Millions of children in Sudan are at risk of rape and other forms of sexual violence, which is being used as a tactic of war. This is an abhorrent violation of international law and could constitute a war crime. It must stop.\"\nAccording to evidence presented by international human rights groups, victims in the RSF's stronghold of Darfur were often targeted because they were black African rather than Arab, apparently with the aim of driving them out of Sudan.\nThe UN humanitarian response for Sudan is already underfunded. Recent cuts in US aid are expected to reduce programmes to help the victims even further.\nHarrowing details in Unicef's report underscore the dire situation.\n\"After nine at night, someone opens the door, carrying a whip, selects one of the girls, and takes her to another room. I could hear the little girl crying and screaming. They were raping her,\" recalls Omnia (not her real name), an adult female survivor who was held by armed men in a room with other women and girls.\n\"Every time they raped her, this girl would come back covered in blood. She is still just a young child. They only release these girls at dawn, and they return almost unconscious. Each of them cries and speaks incoherently. During the 19 days I spent there, I reached a point where I wanted to end my life.\"\nUnicef says the attacks included armed men storming homes and demanding that the girls be surrendered, raping some of them in front of their loved ones.\nVictims were sometimes left with serious injuries and unwanted pregnancies.\nIn addition to the 221 rapes reported by Unicief were an additional 77 cases of sexual assault against children - mostly attempted rape.\nAs a fractured nation at war, Sudan is one of the most challenging places on earth to access services and frontline workers.\n\"The sheer scale of sexual violence we have documented in Sudan is staggering,\" said Mohamed Chande Othman, chair of the UN's fact-finding mission when its previous report was published in October.\nThe vast number of people displaced by the war has made women and children more vulnerable to attack – three out of four school-age girls are out of school, the UN says.\nThe devastating outcome of these crimes is aggravated by the fact that victims have few places to turn to for medical help, because many medical facilities have been destroyed, looted or occupied by the warring parties.\nRecent US aid cuts may be endangering even the limited services available to protect children.\nUnicef has been providing safe spaces for children through a network of local activists who have set up what are known as Emergency Response Rooms to deal with the crises in their communities.\nThe activists relied quite heavily on US aid, and most have been forced to shut down, according to a Sudanese coordinating committee that monitors them.\nMore broadly, the UN organization dedicated to protecting women's rights says local organisations led by women are vital in delivering support to survivors of sexual violence. But they receive less than 2% of the total funding of the UN's Sudan Humanitarian Fund.\nThe BBC learned that at least one of these local groups, known as \"She Leads\", was forced to close when US funding was stopped.\nIt was not a big expense, measured in the tens of thousands of dollars, but enabled case workers to reach around 35 survivors a month, said Sulaima Elkhalifa, a Sudanese human rights defender who runs a government unit on combatting violence against woman and helped organize the private initiative.\nThose who have been raped by armed men \"don't have the luxury of being depressed,\" she told the BBC.\nThe demands of war – finding food, needing to flee – leave no space to deal with trauma, she added.", "url": "https://www.bbc.co.uk/news/articles/cvgpdxk853jo"}