{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:48:59", "date_modify": "2025-04-26 06:48:59", "date_publish": "2025-03-01 10:07:31", "description": "Those behind the purchase say they have had \"unbelievable support to pull off a win\" for the town.", "filename": "news_articles_c3rnwgv0nz3o_1745650139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9332/live/827fc840-f478-11ef-996c-13462f77b475.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnwgv0nz3o_1745650139.html", "title": "Ulverston community hub The Spot set to open in old auction mart", "title_page": "Ulverston community hub The Spot set to open in old auction mart - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An old auction mart is set to become a community hub after it was bought by volunteers.\nMore than £400,000 was raised to secure the building on Victoria Road, Ulverston, following a \"rough run\" of community space closures.\nThe Old Mart Group (OMG) said The Spot would be the new home for the Ulverston Food Project charity from next year.\nZoe Mander, of OMG, said \"we've had unbelievable support to pull off a win\" for the Cumbrian town.\nThere are also plans to create a small hall, meeting rooms and festival workshop space after renovations.\nMs Mander, who is also vice chair of the Ulverston Resilience Group, said groups had been left \"scrabbling for space\" due to closures.\nUlverston has lost nine \"essential and well-used community spaces\" over the last decade, according to OMG.\n\"The town's had such a rough run of closures from Lanternhouse to the Parish Rooms, leaving everyone scrabbling for space,\" Ms Mander said.\n\"Now we get to make good the dream of having a new place bought by the community for the community, our Spot.\"\nThe process to purchase the building started in 2023, but the government fund OMG had planned to apply for closed as they were about to submit a bid.\n\"It felt like that might be the end of it but everyone rallied and we've had unbelievable support to pull-off a win for Ulverston,\" Ms Mander said.\nLocal businesses, Ulverston BID and the town council also contributed, while more than £5,300 was raised through crowdfunding.", "url": "https://www.bbc.co.uk/news/articles/c3rnwgv0nz3o"}