{"authors": ["Emma Glasbey", "David Spereall", "www.facebook.com"], "date_download": "2025-04-26 04:14:05", "date_modify": "2025-04-26 04:14:05", "date_publish": "2025-03-04 11:30:34", "description": "Four other men convicted of laundering criminals' cash after lengthy trial at Leeds Crown Court.", "filename": "news_articles_cdxqlq76ev3o_1745640845.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/662f/live/f4929ba0-f90b-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxqlq76ev3o_1745640845.html", "title": "Socialite James Stunt cleared of money laundering after trial", "title_page": "Socialite James Stunt cleared of money laundering after trial - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Socialite James Stunt has been cleared of taking part in a £200m money laundering operation.\nFour other men were convicted in the biggest prosecution of its kind ever brought before a British judge.\nDuring a five-month trial, Leeds Crown Court heard that the group was involved in an operation to launder criminals' cash and turn it into untraceable gold.\nGregory Frankel, Daniel Rawson, Haroon Rashid and Arjun Babber will be sentenced at a later date.\nMr Stunt, the former son-in-law of Formula 1 tycoon Bernie Ecclestone, stood trial accused of allowing his prestigious Mayfair office to be used as \"a trusted hub for money laundering\" but denied the offence and was found not guilty by a jury.\nMr Stunt clapped his hands with relief in the dock as the verdict was delivered.\nHe told reporters as he left court: \"I always maintained my innocence.\n\"I'm very thankful to the jury for seeing through the evidence and doing their job.\"\nRawson collapsed to the floor in tears as he was convicted by a unanimous verdict.\nNeither Frankel, Rashid or Babber were in court as guilty verdicts were delivered against them.\nArrest warrants have been issued for the trio, who are believed to have fled the country.\nThey are due to be sentenced, alongside Rawson, on Friday.\nSpeaking after the verdicts, ACC Pat Twiggs of West Yorkshire Police said: \"This was a sophisticated operation designed to launder a substantial amount of money connected to criminal activity in a number of regions across the UK.\n\"I have no doubt whatsoever that this cash is linked to organised crime activity, including drugs and wider criminality and I am pleased that we successfully demonstrated that to the court.\n\"By doing so we have uncovered a wider network of criminality and managed to cause significant disruption to their activities.\"\n\"At no point during our investigation did anyone come forward to claim any of the money that we seized.\"", "url": "https://www.bbc.co.uk/news/articles/cdxqlq76ev3o"}