{"authors": ["Henri Astier", "www.facebook.com"], "date_download": "2025-05-19 15:28:44", "date_modify": "2025-05-19 15:28:44", "date_publish": "2015-02-05 00:14:31", "description": "Henri Astier reports from Paris on France's attempts to stop Islamist recruitment in prisons after the Paris attacks last month.", "filename": "news_world-europe-31129398_1747668524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80790000/jpg/_80790477_025425634-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31129398_1747668524.html", "title": "Paris attacks: Prisons provide fertile ground for Islamists", "title_page": "Paris attacks: Prisons provide fertile ground for Islamists - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For anyone trying to recruit people to the cause of radical Islam, a French jail would be an ideal place to start.\nAs many as 60% of France's 70,000 prisoners have Muslim origins, and their backgrounds and criminal records make many ripe for radicalisation.\n\"They have been broken by educational failure, family breakdown, and unemployment. They are very fragile people,\" says Missoum Chaoui, a Paris Muslim leader who has worked as prison chaplain for 17 years.\nAmong the French criminals believed to have turned to extremism while behind bars is Amedy Coulibaly, a man of Malian descent who shot dead a policewoman and four Jews in two of last month's three deadly attacks in the Paris area.\nCoulibaly forged the links that would turn him into a jihadist while in jail for robbery in 2005.\nAt Fleury-Merogis prison, he later told police interrogators, he met one of France's most dangerous inmates, Djamel Beghal.\nAn al-Qaeda-linked militant, Beghal was then serving a 10-year sentence in Europe's largest prison for a plot to bomb the US embassy in Paris. Although Beghal was being kept in isolation, Coulibaly says he was able to befriend him.\nCoulibaly was also introduced to another follower of Beghal, Cherif Kouachi. The three then met after their release.\nEventually Coulibaly, Cherif Kouachi and his brother Said co-ordinated the attacks that killed 17 people in January. The Kouachi brothers shot dead 12 people at Charlie Hebdo magazine, shouting \"Allahu Akhbar\".\nThe justice ministry has warned against using Coulibaly's story to portray French jails as breeding grounds for militants. \"No-one can really tell whether he was radicalised in prison or outside,\" ministry spokesman Pierre Rance says.\nMr Rance also points out that, of 167 people detained in France on terror charges and regarded as radical Islamists, only 15% had been incarcerated before.\nClearly, extremists gain more recruits through personal contact or online than in prisons.\nNevertheless, Justice Minister Christiane Taubira admitted after the attacks in January that radicalisation in detention was a \"major issue\".\nIt is also far from new. Over the past 20 years, a number of major attacks have been blamed on one-time petty criminals who found religion in French prisons.\nKarim Mokhtari, who spent six years in jail for armed robbery and now works with young offenders in prison, says he can tell who is becoming radicalised by their acute sense of victimhood.\n\"They say, 'the French never gave us a chance. They hate us. They are locking us up. These people are unbelievers. I do not have to apologise for what I have done because they shut me out',\" he says.\nIn some cases, Mr Mokhtari says, this turns into talk of \"fighting the infidels\".\nThat message of grievance and \"us against them\" finds a ready audience in a prison.\n\"People are easy to indoctrinate because that is what they like to hear,\" says David Daems, a guard and spokesman for the main union of prison staff, FO-Penitentiaire.\nIt is not just Muslims who are susceptible, Mr Daems adds.\nHe once saw a detainee with no foreign ancestry turn into a fundamentalist before his very eyes: \"First he converted, grew a beard and wore a robe; then his language became aggressive and he refused to speak to female staff. In the end he performed circumcision on himself.\"\nUnion spokesman David Daems notes that it involves only those detained on terror charges whereas he believes a radical serving time for other offences can be just as dangerous.\n\"The problem of radicalisation is not being tackled in its entirety, both terrorist and non-terrorist,\" he says.\nAnd there are varying degrees of radicalism, too. Activist Karim Mokhtari notes that many French youths have travelled to Syria or Iraq seeking heroic martyrdom, only to find that a jihadist's life is not all it is cracked up to be.\nWould-be warriors have written home with complaints such as: \"My iPod has stopped working. I want to go back!\"\nBut once they come home, they are deemed to have committed a serious crime under France's anti-terror laws governing anyone returning home from a war zone.\nAnd then, Mr Mokhtari says, if the faint-hearted are locked up with hardened fighters there is \"even more radicalisation within the group\".\n\"When you bring [militants] together you reinforce them. When you scatter them, you enable them to find new recruits,\" says criminologist Alain Bauer.\nThe challenge for a prison system trying to tackle radicalisation is that there is no easy answer.", "url": "https://www.bbc.com/news/world-europe-31129398"}