{"authors": ["Joshua Nevett", "www.facebook.com"], "date_download": "2025-04-26 04:16:10", "date_modify": "2025-04-26 04:16:10", "date_publish": "2025-03-04 09:35:46", "description": "The deputy PM says the UK will continue \"dialogue\" with the US after it suspended military aid to Ukraine.", "filename": "news_articles_cdx25nqldeqo_1745640970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/471e/live/df330f90-f8d6-11ef-8a06-7ba4024a445c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdx25nqldeqo_1745640970.html", "title": "UK won't be derailed by Ukraine US aid freeze, says Angela Rayner", "title_page": "UK won't be derailed by Ukraine US aid freeze, says Angela Rayner - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sir Keir Starmer will not be \"derailed\" in working to end the war in Ukraine after the US paused military aid to the country, the deputy prime minister has said.\nAngela Rayner said the prime minister was \"laser focussed on getting peace\" and would continue \"dialogue\" with both President Donald Trump and Europe.\nShe said this was \"a very serious moment\" in the war and stressed the UK, along with its European allies, were focused on supporting Ukraine.\nThe US president made the decision to freeze US military support for Ukraine on Monday, after a meeting with members of his top team.\nSir Keir Starmer spoke to Donald Trump on Monday night, Downing Street has said.\nIt is thought the call was before the US president paused military aid to Ukraine.\nNo 10 would not comment directly on the pause without seeing the details of the announcement, and did not say whether Sir Keir had been given any guidance from the US before the move.\nDowning Street also said Sir Keir had spoken to Ukrainian President Volodymyr Zelensky on Monday afternoon.\nThe prime minister updated Zelensky on his discussion with President Trump last night and said it was \"vital that all parties worked towards a lasting and secure peace for Ukraine as soon as possible\", a No 10 spokeswoman said.\nThe US is by far the biggest individual donor of military aid to Ukraine, providing weapons, equipment and financial support.\nThe US has committed about $66bn (£52bn) in security assistance to Ukraine since Russia launched its full-scale invasion of the country in 2022. The UK has committed £7.8bn in military support during the same period.\nThe US decision to pause military aid came hours after Trump criticised President Zelensky for saying the end of the war with Russia is \"very, very far away\".\nThe pair had an explosive spat in the Oval Office last Friday, with Trump telling Zelensky he was \"gambling with World War Three\" by refusing to consider a ceasefire without US security guarantees.\nZelensky left the White House before a proposed deal on sharing Ukrainian minerals with American companies could be signed.\nOn Monday, the White House announced it was \"reviewing\" the delivery of ammunition and other equipment to Ukraine to \"ensure that it is contributing to a solution\".\nThe order to pause all current American military aid to Ukraine takes effect immediately, and includes all US military equipment not currently in Ukraine, including weapons in transit and at depots in Poland.\nThe pause will affect more than $1bn (£790m) in arms and ammunition, including rockets, anti-tank weapons, and armoured vehicles of the kind Ukraine has relied on in its effort to repel Russian forces.\nThe pause in aid will heap more pressure on Zelensky to sign the minerals deal and agree to peace talks without the US security guarantees he has been seeking.\nRussia has tentatively welcomed the pause in US aid to Ukraine, with Kremlin spokesman Dmitry Peskov calling it a \"solution which could really push the Kyiv regime to a peace process\".\nFedir Venislavsky, a member of the Ukrainian Parliament's defence committee, said his country had a weapons stockpile that would last six months \"without consistent help from the US\".\nIn an interview with Fox News, US Vice-President JD Vance said the door was open for Ukraine to return to negotiations if Zelensky was \"willing to seriously talk peace\".", "url": "https://www.bbc.co.uk/news/articles/cdx25nqldeqo"}