{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:35:12", "date_modify": "2025-05-21 07:35:12", "date_publish": "2025-01-22 00:00:00", "description": "The Tory leader brands Labour's Children's Wellbeing and Schools Bill an \"act of vandalism\"; Keir Starmer says it protects at-risk children.", "filename": "news_live_cx25vmm5067t_1747812912.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cx25vmm5067t_1747812912.html", "title": "Kemi Badenoch challenges Keir Starmer on schools bill at PMQs", "title_page": "Kemi Badenoch challenges Keir Starmer on schools bill at PMQs - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This week's PMQs covered education, education, and education\nKeir Starmer faced Prime Minister's Questions today and was grilled by the leader of the opposition, Kemi Badenoch, on the government's new schools bill which is making its way through Parliament.\nBadenoch described the the Children’s Wellbeing and Schools Bill as \"educational vandalism\" and accused the government of letting trade unions run the education department.\nStarmer defended the bill and repeatedly told the Commons the bill would protect children and prevent abusers from taking children out of school - in light of 10-year-old Sara Sharif being taken out of school four months before she died.\nThe prime minister also told MPs the bill would set up breakfast clubs for children and limit the expense of school uniforms.\nThe proposed changes to academy freedoms and pay in the Children’s Wellbeing and Schools Bill has come under the most scrutiny - you can read more about that here.\nWe'll be back next week, same time, same place. Thanks for following along.\nDid English schools rise up international rankings under Tories?\nBy Lucy Gilder\nEarlier at PMQs, Kemi Badenoch spoke about the previous government’s record on education.\nShe said: \"Between 2009 and 2022, the OECD found children in England rose up global league tables, in maths, reading and science\".\nThe Programme for International Student Assessment (PISA) is a worldwide study run by the Organisation for Economic Co-operation and Development (OECD). It measures the performance of 15-year-olds in mathematics, reading, and science.\nEngland did move up the global league table in the latest 2022 results but that does not tell the whole story.\nIf you look at England’s PISA scores across maths and science, they decreased in 2022 compared with 2009.\nAnd a government report on the latest PISA results, external said England’s scores for mathematics and reading had “declined significantly since 2018 but remained significantly above the OECD average in each case”.\nMany other OECD countries saw declines in maths and reading performance compared with 2018. The report said it’s not possible to determine how the Covid-19 pandemic affected performance in the latest Pisa assessments.\nHas Wales fallen down international education league tables?\nBy Tamara Kovacevic\nEarlier at Prime Minister’s Questions, when Kemi Badenoch was criticising the government’s schools policy, she said in \"Wales which has been under Labour control for two decades… educational outcomes have tumbled down international league tables\".\nThis is true, according to the latest figures from the Programme for International Student Assessment (PISA) - a worldwide study which measures the performance of 15-year-olds in mathematics, reading and science.\nIt found that Wales - where education is devolved - had fallen to its lowest level ever in tests in those subjects in 2022.\nWelsh scores were also below the average score for the OECD, external (an international grouping of countries) in all three subjects and the lowest of all UK nations.\nWhat is in the government's schools bill?\nVanessa Clarke\nEducation correspondent\nThis week's PMQs saw Keir Starmer and Kemi Badenoch clashing over the Children's Wellbeing and Schools Bill - which covers policies from free breakfast clubs in all primary schools to limiting the number of branded uniforms items.\nIn primary schools only three items will be allowed, in secondary schools it will be four.\nThe bill also contains huge changes to safeguarding. The day it was introduced to Parliament was the same day that 10-year-old Sara Sharif’s father and step-mother were sentenced to life in prison for her murder. Four months before her death, Sara was taken out of school to be home-educated.\nIt proposes that teachers should be more involved in decisions around safeguarding and a register of children who are not in school. If a child's home environment is assessed as unsuitable or unsafe, local authorities will also have the power to intervene.\nToday, the prime minister repeatedly pointed out that the bill will benefit families by providing breakfast clubs, restricting branded uniform items and helping children out of school.\nBut the focus and criticism was on its academy proposals, which includes a proposal that failing schools run by local authorities will not be automatically forced to become an academy.\nThe bill is expected to become law in the spring - so the debate may rumble on for some time.\nDespite concessions, parts of schools bill still concern some academies\nVanessa Clarke\nEducation correspondent\nThe Children’s Wellbeing and Schools Bill is wide-ranging but its proposed changes to academy freedoms and pay has come under the most scrutiny.\nAt the moment, academies have the power to decide how much to spend on teacher salaries so they can recruit and retain teachers.\nThe original wording of the bill would have changed this but for the last few weeks Education Secretary Bridget Philipson has repeated the line \"there will be a floor, no ceiling\" on pay.\nLast night the government agreed to amend the wording in the bill. Instead academies will have to have \"due regard\" to the national pay agreements.\nThe Confederation of School Trusts welcomed the changes this afternoon - but say there are still parts of the bill that concern them, including potential conflicts of interest on admissions and restrictions on bringing people with specialist subject knowledge (but not a specific formal teaching qualification) into the classroom.\nKemi Badenoch told the Commons today that the bill implies \"doctors are not sufficiently qualified to teach biology, that Olympic medallists can not teach PE\", and asked why the prime minister was closing routes into teaching.\nBut the prime minister said that was not right and to say there should be qualified teachers in our schools \"should not be extraordinary or opposed\". \"We can debate academies,\" he added - but asked for MPs not to vote against the whole bill.\nJenkin tackles Starmer on borrowing and tax cuts\nA question now from Tory MP Sir Bernard Jenkin, who asks about Labour's economic policy.\nHe asks when Labour will realise that raising taxes, raising borrowing and raising public spending, will not deliver growth - instead saying the only way to deliver growth is by cutting taxes and regulation.\nStarmer replies by listing economic successes in their first six months in government.\nHe says the ONS says UK has highest investment in 19 years, that the UK is the second best place to invest in the world, and that wages are up and inflation is down.\nDavey focuses on social care\nLib Dem leader Ed Davey asks about the social care commission - and why, before she starts on that commission, the chair Baroness Casey is also going to chair the \"rapid audit\" into grooming gangs.\nStarmer replies that Casey is well placed to run the grooming gangs audit because of her wealth of experience.\nIt does not affect her work on adult social commission, he says. The audit is expected to take three months.\nDavey says the PM is not making social care a \"priority\".\nConservatives regard their education record as a success story\nHenry Zeffman\nChief political correspondent\nKemi Badenoch probably caught many MPs, including Keir Starmer, by surprise by focusing on schools at PMQs.\nBut this issue has been bubbling towards the surface for some weeks.\nIt's not surprising Badenoch would want to defend the Conservative approach to education. \"It’s one of the few clear success stories we have to tell\", was the view of one shadow cabinet minister I spoke to this week.\nBut what is more potent is the charge that the government’s education reforms disrupt a \"cross-party consensus\" which began when Tony Blair’s Labour government introduced academy schools.\nThis is causing significant anxiety among MPs generally on the right of the Labour Party who are proud of academies and - mostly in private - support what Michael Gove and other Conservative education secretaries did to extend them.\n\"I think this is mad and so do lots of my friends,\" one MP elected in 2024 told me last week.\nThese are generally MPs who are loyal to the government anyway. They would not vote against this legislation. It is midway through clearing the House of Commons comfortably.\nYet there still can be uncomfortable bumps along that road for Starmer - as today’s PMQs showed.\n'Educational vandalism' says Badenoch. You've got a nerve, replies Starmer\nBadenoch says the PM needs to get out more and speak to schools, calling the schools bill \"educational vandalism\".\nSpeaking about removing the single word grading by Ofsted, she says it's the same old Labour, offering \"bad outcomes for all children, excellence for none\".\nThe opposition leader calls it a \"tragedy in the making\" and claims it was not in the Labour Party manifesto.\nStarmer says they are committed to academies and increasing standards and says Badenoch has a \"nerve\" to speak about educating children with special needs.\nStarmer says it was an \"appalling situation\" for schools for special needs under the Conservative government.\nStarmer says children will benefit - Badenoch says it will be trade unions\nBadenoch says education standards in England went up under the Tories. She says everyone is asking, who is benefiting from these changes, as it's not teachers, or parents and \"definitely no children\".\nInstead, it's the trade unions who are benefiting from the change, she adds.\n\"Why is the education secretary letting trade unions run her department?\" Badenoch asks.\nTo growing cheers from the Labour benches, Starmer says the bill benefits children who need breakfast clubs, families who can't afford uniforms, and children who are being abused.\nWill this mean schools can't hire from armed forces?\nBadenoch says Starmer is talking \"nonsense\".\nShe repeats the claim the bill cuts teachers' pay, and asks why is the PM closing down routes into teaching?\nFor example, she says the head of year 11 at Michaela School, which she has praised, came from the armed forces. Badenoch claims that with Labour's new rules they would have never been able to hire him.\n\"Those are the academy freedoms I'm talking about. This bill would have blocked that veteran from teaching.\n\"The bill implies that doctors are not sufficiently qualified to teach biology, that Olympic medallists can't teach PE.\n\"Why is the prime minister closing down routes into teaching when they should be opening up more?\"\nStarmer replies that she knows that's not right.\n\"Look at the provisions in the bill - but to say there ought to be qualified teachers in our schools should not be extraordinary or opposed...\n\"They championed maths, we didn't have enough maths teachers in our secondary schools and I want every single child to have the best possible education.\"\nBadenoch says bill could lead to teachers' pay cuts\nKemi Badenoch continues to criticise the schools bill, which she says will \"horrify\" teachers.\nThe Conservative Party leader says the bill will cut pay for 20,000 teachers, and asks Starmer whether he knows the bill will cut some teachers' pay.\n\"His Education Secretary (Bridget Phillipson) says there is not a ceiling for pay.\n\"They're all shaking their head, they clearly haven't read the bill, she hasn't read the bill either because clause 45 means teachers' pay will be capped.\"\nStarmer says the bill is about child protection and \"closes the gap that is urgently needed for children who have not returned to school since Covid\".\n\"To vote against the bill is a disgrace on all of them,\" Starmer adds.\nBadenoch brings up Wales - but Starmer says bill will improve standards\nBadenoch goes on to says reforms from the last Conservative government were not introduced by the devolved administration in Wales - and says Welsh educational outcomes have \"tumbled\".\n\"Welsh educational outcomes have tumbled down international league tables, poor children in England now do better than wealthier children in Wales.\n\"This bill denies children the guarantee that their failing schools will be turned into a better academy.\"\nStarmer says: \"We introduced academies. We're committed to them. We're driving standards up.\"\nHe adds the schools bill is important because it sets up breakfast cubs for children, limits expense of school uniforms, and protects children.\nFor context - the measures in the Children's Wellbeing and Schools Bill, which is going through Parliament, include:\nAll councils being required to hold a register of children who are not in school\nA unique number for every child, in the same way every adult has their own national insurance number\nParents no longer having an automatic right to take their children out of school for home education if the young person is subject to a child protection investigation or suspected of being at risk of significant harm\nLocal authorities having the power to intervene and require school attendance if any child's home environment is assessed as unsuitable or unsafe\nAll teachers will be part of the same core pay and conditions framework whether they work in a local authority-run school or an academy", "url": "https://www.bbc.com/news/live/cx25vmm5067t"}