{"authors": ["Andy Trigg", "www.facebook.com"], "date_download": "2025-04-26 04:05:13", "date_modify": "2025-04-26 04:05:13", "date_publish": "2025-03-03 17:51:28", "description": "Stuart Layden has had two previous convictions quashed, one due to a procedural error.", "filename": "news_articles_c2kgqyk1qg2o_1745640313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b4f/live/029ba2f0-f849-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kgqyk1qg2o_1745640313.html", "title": "Man accused of Great Yarmouth murder faces possible third trial", "title_page": "Man accused of Great Yarmouth murder faces possible third trial  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who has been convicted twice for murder - and had both convictions quashed - may have to stand trial for a third time, the Supreme Court has heard.\nStuart Layden was among five people convicted of murdering Ian Church, 40, outside the Bricklayers Arms pub in Great Yarmouth, Norfolk, in 2012.\nCourt of Appeal judges overturned his conviction in 2015 - and in 2023 quashed a second conviction due to a procedural error.\nAt a hearing earlier, David Perry KC, for the Crown Prosecution Service (CPS), asked Supreme Court judges to allow another retrial – claiming Court of Appeal judges had prioritised court processes over a fair trial.\nMr Layden, formerly of South Quay, Great Yarmouth, was first handed a life sentence for Mr Church's murder in April 2013.\nHe successfully appealed against the conviction in March 2015 and was rearraigned for a new trial six months later.\nMr Layden was again found guilty in May 2016 and was sentenced to almost nine years in prison.\nIn 2022, he applied to the Criminal Cases Review Commission (CCRC) to look at concerns around the timing of his retrial.\nA defendant must be rearraigned - asked how they plead - within two months of an appeal.\nIn 2023, three appeal judges concluded he was not properly arraigned before a retrial at Norwich Crown Court in 2016.\nFollowing the ruling, the CPS said it would consider appealing.", "url": "https://www.bbc.co.uk/news/articles/c2kgqyk1qg2o"}