{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:05", "date_modify": "2025-05-19 15:38:05", "date_publish": "2015-02-24 15:23:37", "description": "A dog breeder, thought by the RSPCA to be a major figure in British dog fighting, is jailed and banned from keeping animals.", "filename": "news_uk-england-manchester-31593184_1747669085.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81206000/jpg/_81206187_81206186.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-manchester-31593184_1747669085.html", "title": "'Big player' in UK dog fighting jailed after RSPCA probe", "title_page": "'Big player' in UK dog fighting jailed after RSPCA probe - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A dog breeder, thought to be a \"big player\" in British dog fighting, has been jailed and banned from keeping animals.\nJohn Psaila, from Wigan in Greater Manchester, admitted 14 offences including training animals to fight and possessing equipment for fights.\nThe RSPCA described his home in Thornvale, Abram as a \"training school\" for fighting dogs.\nPsaila, 49, was jailed for 121 days at Wigan and Leigh Magistrates' Court.\nHe was charged under the Animal Welfare Act 2006 and the Dangerous Dogs Act 1991.\nThe RSPCA launched an investigation after being tipped off that he was involved in organised dog fighting and an allegation he was preparing to take a dog to a fight.\nInspectors found two pit bull type dogs called Ziggy and Tip - and a treadmill on which to train them - after carrying out a warrant on 9 June 2014 at his address and at another property in Lowton Street, Radcliffe.\nThe RSPCA described his home as a \"training school\" for fighting dogs. Inspectors also found weighing scales, home veterinary kits with medication and muscle-building powder along with breaking sticks, which are used to separate dogs during a fight.\nTony Stock, prosecuting, told the court Psaila had been an active member of the dog-fighting fraternity, involved in highly organised fights.", "url": "https://www.bbc.com/news/uk-england-manchester-31593184"}