{"authors": ["Richard Madden", "www.facebook.com"], "date_download": "2025-04-26 07:35:05", "date_modify": "2025-04-26 07:35:05", "date_publish": "2025-02-27 15:09:43", "description": "An election for the first mayor of Hull and East Yorkshire will be held on 1 May.", "filename": "news_articles_c14jjkyxk46o_1745652905.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/425a/live/d8d3ec20-f50a-11ef-a276-596f7e6218f8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jjkyxk46o_1745652905.html", "title": "Hull and East Yorkshire mayor 2025: Candidates", "title_page": "Hull and East Yorkshire mayor 2025: Candidates - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Six candidates have officially thrown their hat into the ring to become the first elected mayor for Hull and East Yorkshire.\nIn September, the government approved a devolution deal for the region which will see the creation of a combined authority comprising of Hull City Council and the East Riding of Yorkshire Council.\nThe mayor will lead the new authority and oversee decision making on issues such as housing and transport which would otherwise be made in Westminster.\nNominations for the candidates will officially open on 18 March before voting takes place on Thursday 1 May.\nThe candidates who have so far been declared, listed by surname alphabetically, are:\nLuke Campbell - Reform UK\nRowan Halstead - Yorkshire Party\nAnne Handley - Conservative\nKerry Harrison - Green\nMargaret Pinder - Labour\nMike Ross - Liberal Democrats\nUnder the devolution deal, Hull and East Yorkshire will be given an additional £13m a year from government.\nHull City Council and East Riding of Yorkshire Council will retain their independence and continue their work as normal, alongside the combined authority.\nDeputy Prime Minister Angela Rayner previously said the changes were about \"rebalancing the power between Westminster and our communities\".\n\"This agreement will ensure local people will have a seat at the table as we drive forward our plans to deliver economic growth, and unleash the potential of towns and cities which have been neglected for far too long,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c14jjkyxk46o"}