{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:04:38", "date_modify": "2025-05-19 15:04:38", "date_publish": "2017-07-10 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across Cumbria on Monday 10 July 2017.", "filename": "news_live_uk-england-cumbria-40542877_1747667078.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-cumbria-40542877_1747667078.html", "title": "BBC Local Live: Cumbria", "title_page": "BBC Local Live: Cumbria for Monday 10 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nMartin Lewes\nReporter\nIt's been a day dominated by the announcement that the Lake District will be the first British national park to become a World Heritage site.\nBut there's been other news:\nA Lake District rescue team told how members have to be lowered 600 feet down a gully to rescue a group of walkers after one of their number was hit by a falling stone;\nAnd firefighters at Sellafield announced a date for a 24-hour strike in a pay dispute; the company said it had arranged cover with a third party.\nWe'll be back to do it again from 08:00 tomorrow.\nAs always, if you want to pass on news you think we should know, or share a photo with the county, you can email them to us, send them using Twitter where we're @BBC_Cumbria, external or head to our Facebook page, external.\nHave a very good evening.\nFriends warn on Lake District heritage site announcement\nThe Friends of the Lake District have warned that the designation of the national park as a world heritage site, external may have damaging consequences.\nThe environmental organisation said it welcomed the announcement, external, but: \"We have some concerns that the resultant increase in publicity and awareness of the Lake District may lead to more unsustainable tourism, and not just an increase in international flights.\n\"Of more direct significance to Cumbria, we could see an increase in car journeys and a greater threat of inappropriate developments.\"\nBus company plans to run services in Eden valley\nStagecoach says it will be running three trips a day Monday to Friday between Appleby and Penrith from September.\nEarlier this year another firm, Grand Prix Services, said it was no longer viable for them to run a bus through the area. Stagecoach says the services will be during off-peak times.\nCommon land farmers say heritage status needs cash support\nAn organisation representing a number of Cumbria's hill farmers says the World Heritage Site status given to the Lake District, external underlines the need for continuing government financial support.\nOne of the main reasons the international organisation added the area to the 1,000 other places on the list was because of its tradition farming methods and the importance of these in maintaining the landscape.\nJulia Aglionby, director of the Foundation for Common Land, said, external: \"The price commoners receive for their livestock does not reflect the benefits they provide society and the 17m visitors who come to the Lake District each year.\"\nShe said maintaining the ancient system where farmers share grazing on the commons required continuing support.\nSellafield fire fighters set date for pay strike\nFirefighters at Sellafield have set a date for a strike in a dispute over pay.\nThe crews, members of the GMB union, say a pay offer would leave them 5% behind inflation since 2009.\nThey've said they'll strike for 24 hours from 06:01 on 24 July.\nA statement from Sellafield Ltd said: \"We have a commercial agreement in place with a third party provider to ensure fire safety standards are maintained.\"\nFirst Cumbrian patients stride out on robot knee\nPatients in Cumbria who need artificial legs are being offered knee joints controlled by a computer.\nSensors in the knee joint monitor the wearer's steps and adjust the movement to cope with ramps and steps.\nJohn Miller, seen here with staff members Nikki Tebbutt and Neil Wallace, was the first patient to complete a four-week trial period with the microprocessor-controlled knee, external.\nHe said: \"I used to fall about eight or nine times a month but I’ve not fallen once since I got the new knee.\"\nFell scrambler 'could have died' in rock fall rescue\nRescue team members say a woman who was hit by a falling rock while trying to scramble up a Lake District valley could have died.\nKeswick Mountain Rescue volunteers were helped by members of the Wasdale and the RAF Leeming teams after the group of four people called for help from Great End in Seathwaite on Saturday.\nThe rescuers had to descend 600ft into the gully, external, and it was six hours until the last of the group was helped to safety.\nThe woman was able to to walk down with assistance, but a team spokesman said the incident could have had \"fatal consequences.\"\nWhat makes a world heritage site?\nMartin Lewes\nReporter\nThe Lake District was awarded World Heritage status yesterday but what does that mean?\nUnesco, which is part of the United Nations, started listing World Heritage sites in 1972 after a number of nations said they feared some could be lost through neglect or destruction, external.\nPlaces can be listed, or \"inscribed\", for reasons of their cultural importance, or their natural features such as wildlife or landscape. The qualification is \"outstanding universal value\".\nYears of research and a huge and detailed report, external were compiled as part of the Lake District application to Unesco\nBeing listed as a World Heritage Site will not automatically bring the national park authority any extra powers or money.\nBut it's likely to be cited in battles over planning applications or applications for grants.", "url": "https://www.bbc.com/news/live/uk-england-cumbria-40542877"}