{"authors": ["Peter Harris", "www.facebook.com"], "date_download": "2025-04-26 03:46:19", "date_modify": "2025-04-26 03:46:19", "date_publish": "2025-03-05 06:02:13", "description": "Universities UK says the government must ensure stability in the number of visas that can be issued.", "filename": "news_articles_c0mw88149n7o_1745639179.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a7e2/live/2a904bd0-f934-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw88149n7o_1745639179.html", "title": "Reliance on foreign students risks university income 'instability'", "title_page": "Reliance on foreign students risks university income 'instability' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Universities could face \"instability\" if they rely on income from international students to balance their books, an industry group has warned.\nOf the 129,000 students studying at north-east of England institutions in 2022-23, 37,000 were from overseas.\nUniversities UK said the government must ensure stability in the number of visas that can be issued.\nThe Department for Education (DfE) said it had taken \"tough decisions to bolster universities' financial sustainability\" but many would need to change their business models.\nThe amount universities can charge UK students for tuition has been frozen at £9,250 since 2017 but will rise this year.\nThere is no cap on charges for students from overseas so fees can be much higher and have become a vital income stream.\nBut student visa rules were tightened by the last Conservative government to try to reduce immigration and that led to a fall in applications last summer.\nUniversities UK chief executive Vivienne Stern said: \"We've had a period of about a decade where the government has refused to allow the income they get from teaching home students to rise in line with inflation.\n\"International fee income has become the main ingredient in keeping universities financially above water.\"\nThe DfE said international students made a \"positive impact\" not only in higher education but on the economy and society in general.\n\"Against the backdrop of the dire economic situation we inherited, this government has taken tough decisions to bolster universities' financial sustainability as we seek to fix the foundations of higher education to deliver change for students,\" a spokesperson said.\n\"This government remains committed to restoring universities as engines of opportunity, aspiration and growth.\"", "url": "https://www.bbc.co.uk/news/articles/c0mw88149n7o"}