{"authors": ["Mark Smith", "Maheen Rasul", "www.facebook.com"], "date_download": "2025-04-26 07:36:16", "date_modify": "2025-04-26 07:36:16", "date_publish": "2025-02-27 14:45:09", "description": "As Muslims prepare for the holy month of Ramadan, Ayaan is taking part for the first time.", "filename": "news_articles_cx207g2ggnqo_1745652976.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a3b/live/90b0cee0-f442-11ef-8f19-430fec9d0afd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx207g2ggnqo_1745652976.html", "title": "Ramadan: Highnam boy, 10, 'excited' and nervous about taking part", "title_page": "Ramadan: Highnam boy, 10, 'excited' and nervous about taking part - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As millions of Muslims around the world prepare for the holy month of Ramadan, 10-year-old Ayaan says he is both excited and nervous about taking part for the first time.\n\"I'm excited for the experience of actually doing it, but it's scary because we only eat two meals a day during Ramadan,\" he says.\nHis mother, Fozia, says he had some practice last year when he did not eat snacks or lunch while at his primary school in Highnam, near Gloucester. This year, she expects him to be more tired and to therefore struggle with his energy levels.\n\"Possibly the [lack of] food and water will affect you,\" Fozia says to Ayaan. \"Because of that you will feel quite tired, so when you do come home from school it's absolutely fine to have a nap. School is quite a busy day.\"\nLast year, Ayaan's non-Muslim school friends asked him lots of questions during Ramadan about why he was not eating with them.\n\"Eventually, two of my friends asked how hard Ramadan was, what is it like not eating and drinking for 30 days. I told them we do eat two meals a day, otherwise we wouldn't survive. So they do ask me about it sometimes, and I do tell them.\"\nAyaan says he does not get annoyed being asked about what he is doing.\n\"I do like answering questions, but sometimes when I am really tired I say 'can you ask me later', because I don't want to be rude saying 'no I don't want to answer your questions'.\"", "url": "https://www.bbc.co.uk/news/articles/cx207g2ggnqo"}