{"authors": ["Alex McIntyre", "www.facebook.com"], "date_download": "2025-04-26 07:37:19", "date_modify": "2025-04-26 07:37:19", "date_publish": "2025-02-27 14:30:20", "description": "The council confirms it has scrapped plans to replace the TikTok sensation trader's pitch.", "filename": "news_articles_cy4vv0lzmgmo_1745653039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ab19/live/b6741f00-f510-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vv0lzmgmo_1745653039.html", "title": "TikTok's Spudman wins fight to save Tamworth pitch from flowerbed", "title_page": "TikTok's Spudman wins fight to save Tamworth pitch from flowerbed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "TikTok sensation Spudman will be returning to his town centre pitch after plans to replace it with a flowerbed were scrapped.\nBen Newman's regular pitch on St Editha's Square in Tamworth, Staffordshire, was due to be removed as part of the current work to improve the area.\nThe street vendor said a new place offered to him had not been suitable and he posted a number of videos to his millions of followers to voice his frustration.\nFollowing an outcry on social media and an online petition signed by more than 100,000 people, Tamworth Borough Council agreed to change the plan to allow Mr Newman to return to his original pitch.\nDean said the council acknowledged the issue had caused concern and was \"determined\" to learn from the experience.\n\"We value the contribution of all our local traders who bring character and vitality to our town centre, and very much look forward to traders once again back on the square when the works are complete,\" she continued.\nMr Newman, who was granted freedom of the borough of Tamworth last year, had previously said in a video posted on 14 February that losing his pitch left him feeling \"destroyed\".\n\"The amount we've done, and that's what I get. I get a flowerbed on my pitch,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cy4vv0lzmgmo"}