{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:44:50", "date_modify": "2025-04-26 03:44:50", "date_publish": "2025-03-05 06:39:28", "description": "Florida's attorney general has directed investigators to issue search warrants and court summonses.", "filename": "news_articles_cy9dx5d1g5lo_1745639090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb72/live/99a203d0-f94b-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9dx5d1g5lo_1745639090.html", "title": "Florida opens criminal investigation into Tate brothers", "title_page": "Florida opens criminal investigation into Tate brothers - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Florida has launched a criminal investigation into British-American influencers Andrew and Tristan Tate, who flew to the state last week from Romania, where they faced rape and human-trafficking charges.\nFlorida's attorney general, James Uthmeier, said investigators have issued search warrants and subpoenas as part of a \"now-active\" inquiry.\nIn the US, the brothers also face a civil suit from a woman alleging they coerced her into sex work, and then defamed her after she gave evidence to Romanian authorities. They strongly deny all the allegations against them.\nA former kickboxer and self-described misogynist who appeared on UK TV show Big Brother, Andrew Tate has millions of followers online.\nAndrew, 38, and his brother Tristan, 36, face separate charges in the UK of rape and human trafficking. They deny those allegations too.\nUthmeier, a Republican, said in Tuesday's statement: \"Last week, I directed my office to work with our law enforcement partners to conduct a preliminary inquiry into Andrew and Tristan Tate.\n\"Based on a thorough review of the evidence, I've directed the Office of Statewide Prosecution to execute search warrants and issue subpoenas in the now-active criminal investigation into the Tate brothers.\"\nThe Tate brothers' lawyer Joseph McBride released a statement later Tuesday on the investigation.\n\"Today, Attorney General James Uthmeier threw ethics law out of the window when he publicly took a side in an ongoing Florida lawsuit where Andrew and Tristan Tate are suing a Florida woman for orchestrating a sophisticated plot to use sex as a weapon to ruin their lives,\" the statement read in part.\nMr McBride called the attorney general's comments \"inflammatory\" and \"biased\".\nThe Tates were first arrested in Romania in December 2022, with Andrew accused of rape and human trafficking and Tristan suspected of human trafficking. They moved to Romania from the UK several years ago.\nThey both denied the charges and spent several months under house arrest. A year later, in August 2024, they faced new allegations including sex with a minor and trafficking underage persons, all of which they deny.\nThe Tates are understood to be required to return to Bucharest at the end of March to satisfy prosecutors' terms; however, it is too early to say whether they will comply.\nPolice in the English county of Bedfordshire are still seeking Andrew's extradition on separate and unrelated allegations of rape and human trafficking, as well as tax evasion.\nIn the UK, four British women have filed a civil case against Andrew Tate in the country's High Court, alleging he raped and coercively controlled them, charges they also deny.\nThose plaintiffs said it was clear he would not face criminal prosecution in Romania and appealed to UK authorities to take action.", "url": "https://www.bbc.co.uk/news/articles/cy9dx5d1g5lo"}