{"authors": ["Caroline Hawley", "www.facebook.com"], "date_download": "2025-04-26 03:57:20", "date_modify": "2025-04-26 03:57:20", "date_publish": "2025-03-04 14:05:23", "description": "Nine-year-old Rami was badly hurt in a strike which killed his brother - now he's learning to walk again.", "filename": "news_articles_cwyjj3knjkmo_1745639840.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/09d0/live/9ade40e0-f8e9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyjj3knjkmo_1745639840.html", "title": "Gaza war: Injured Palestinian boy takes first steps in Jordan", "title_page": "Gaza war: Injured Palestinian boy takes first steps in Jordan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Rami Qattoush's mother beams with pride, as her nine-year-old son tentatively kicks a football for the first time since his injury.\nIt is a huge milestone in his recovery, since he travelled to Jordan last month after getting Israeli military approval to leave Gaza.\nRami dreams of playing football one day, like Cristiano Ronaldo. But he is still in pain and quickly tires, having to sit down on a plastic chair, exhausted from the effort.\nHis bandaged legs - one of them splinted - are badly scarred and withered.\nEvery step forward is hard.\nDoctors in Gaza had urged the family to agree to have both of his legs amputated. But his eight-year-old brother, Abdul Salam, had already lost his lower right leg due to his injuries and their mother, Islam, begged the surgeons to save Rami's limbs.\nWarning - This article contains distressing content\nThe boys had been fast asleep in the family's third-floor flat in Maghazi in central Gaza when, their mother says, an Israeli air strike targeted the building next door, raining rubble and shrapnel on the children.\nRami's 12-year-old brother, Mustafa, was killed, his body blown to pieces.\nHis heart, pierced with shrapnel, was only found two days later, Islam says. The family gave it a separate burial.\nThe UN says at least 14,500 children are reported to have been killed and many more badly wounded in the war between Israel and Hamas in Gaza, which began after Hamas gunmen attacked Israel on 7 October 2023, killing around 1,200 people.\nMedical evacuations from Gaza are critical, it says, external, because the healthcare system there has been devastated. Only 20 of the territory's 35 hospitals are partially functional and there are shortages of essential medicines and equipment.\nAn estimated 30,000 Gazans – like Rami and Abdul Salam – have been left with life-changing injuries which will require years of rehabilitation, according to the World Health Organization, external.\nIt has helped facilitate the evacuation of hundreds of patients since 1 February when the Rafah crossing with Egypt reopened for them. But it says that between 12,000 and 14,000 people – among them 4,500 children – still need to be brought out for treatment.\n\"The war has exacted a horrific toll on Gaza's children,\" the UN Children's Fund (Unicef) said when a ceasefire deal was announced in January.\nRami endured several surgical procedures without painkillers, anaesthesia or antibiotics, his mother told the BBC. His wounds became so infected that they were crawling with maggots. Doctors did not think his legs could be saved.\n\"Rami was in such pain, he was screaming 'God, you've taken my brother, now take me too!'\" Islam says.\nAnd then, in January, a rare chance came up - for Rami and his mother to be evacuated to Jordan for treatment at a specialised hospital for reconstructive surgery, run by Médecins Sans Frontières (MSF) in Jordan's capital, Amman.\nIt is currently treating 13 children from Gaza, but has the capacity to take in dozens more.\n\"It's the only hospital I know of providing physical and mental rehabilitation for victims of war,\" says Marc Schakal, MSF programme manager for Jordan, Syria and Yemen. \"It's multi-disciplinary care, not just surgery.\"\nRami has a psychologist, surgeon and physiotherapist. He is also being fed, clothed, and taught at MSF's small \"School of the Future\", a bright prefabricated building in the grounds of the hospital. After missing so much education, he is a keen learner.\nBut he has also been missing his father Mohammed and his brother, Abdul Salam - who needs a prosthetic leg but wasn't able to leave Gaza with him.\nThey're grateful for their treatment, but both he and his mother want to return home as soon as they can.\n\"Gaza is beautiful,\" Rami told me. \"In Gaza before the war, we used to have medical treatment, but then the aid stopped.\"\nWith the facilities and expertise at the MSF hospital, he's now making quick progress.\n\"He arrived in a wheelchair,\" says his physiotherapist, Zaid Alqaisi, who has formed a strong bond with Rami while helping him to walk again.\n\"He's very motivated. He wants to get back to his friends and his family. He wants to make his dad proud.\"\nHe also wants to swim again in the sea in Gaza.\nBut many more operations lie ahead, and Rami and his mother have no idea when they will return home.\nNot knowing if they will be allowed back into Gaza is another huge stress for all of the Palestinian patients on top of their trauma, according to psychologist Zainoun al-Sunna.\nBut Rami is strong and determined. When he breaks down in tears thinking of Mustafa, he reassures me it's \"OK\".\nAnd when he and his mother manage to get through to his family in Gaza on a video call, Rami is eager to show them how he can now stand on his own two feet.\nHis father cheers him on, saying: \"Rami, you're a hero.\"\nAnd now his family have another reason to celebrate – Rami's brother, Abdul Salam, and his father have just been given permission by Israel to leave Gaza for Jordan as well.\nIn the weeks to come, he should be fitted with a new leg, allowing both injured boys to relearn how to walk.", "url": "https://www.bbc.co.uk/news/articles/cwyjj3knjkmo"}