{"authors": ["Katharine Da Costa", "www.facebook.com"], "date_download": "2025-04-26 03:59:37", "date_modify": "2025-04-26 03:59:37", "date_publish": "2025-03-04 06:10:42", "description": "Critics say the government is failing Afghans at risk of deportation back to the Taliban-led country.", "filename": "news_articles_c3vwwdzgedqo_1745639977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0ec/live/9218c760-f834-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vwwdzgedqo_1745639977.html", "title": "Afghan man criticises Home Office delays to reunite family in UK", "title_page": "Afghan man criticises Home Office delays to reunite family in UK - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Afghan man has urged the Home Office to fast-track applications to reunite family members who face an imminent risk of being deported back to the Taliban-led country.\nMuhammad Khan has been living in Oxfordshire since being resettled in the UK in 2021.\nHis family escaped to neighbouring Pakistan, but the government there is threatening to deport thousands of Afghans with a deadline of 31 March for those awaiting relocation to third countries.\nThe Home Office said it was \"working at pace\" to process referrals.\nAfter more than three years apart, the 31-year-old engineer had been hopeful he would soon be reunited with his wife and two young children after the government announced the Afghan Citizens Resettlement Scheme (ACRS) separated families route would open for applications.\nBut six months on, Mr Khan is still waiting for a Home Office decision.\nHe said he felt powerless, explaining: \"I can't do anything for my kids, for my wife, I'm feeling disappointed by this government that we are being forgotten.\"\nWhile in Pakistan, his wife has no legal access to work and their children are not allowed to go to school.\nThe family fears if they are deported back to Afghanistan they will be targeted by the Taliban.\n\"There is no future for my daughter over there and maybe the Taliban would force me to bring back my husband and our life is not secure over there,\" Mr Khan's wife, who wishes to remain anonymous, told the BBC during a video call.\nWhen the scheme was launched last July, Minister for Migration and Citizenship Seema Malhotra said there was an \"urgency\" to reunite families who had helped the UK.\nShe said: \"It is our moral duty to ensure that families who were tragically separated are reunited and are not left at the mercy of the Taliban.\n\"Afghans did right by us and we will do right by them, ensuring our system is fair and supports those most at risk and vulnerable.\"\nA freedom of information request made by Refugee Legal Support at the end of last year found that of the 2,511 applications received by the Home Office before the October deadline, only 88 had been successful and 361 had been refused.\n\"Every day that people are left in limbo, the government is failing them,\" said Freya Morgan, a supervising lawyer at Refugee Legal Support.\nShe said the government needed a clear policy on the timeframe of when decisions would be made and how they would be communicated.\n\"It also needs to be clear as to how it will prioritise cases because everyone's family reunion is important but there are people who are at real and imminent risk,\" she added.\nOlly Glover, Liberal Democrat MP for Didcot and Wantage, has been supporting Mr Khan's case.\nHe said: \"The delays are very frustrating and not really what we expected so I really call on the government to focus on processing these applications properly.\"\nMost of the 30,000 Afghans who have come to the UK were evacuated in August 2021 as part of Operation Pitting.\nThey were mostly British nationals, as well as people who worked with the UK in Afghanistan and their family members, who are eligible under the Afghan Relocations and Assistance Policy.\nAfter its withdrawal from Afghanistan, the UK pledged to resettle up to 20,000 vulnerable Afghans in the coming years under the ACRS.\nAbout 12,400 people had arrived under the scheme by the end of September 2024.\nWendy Chamberlain MP, chair of the all party parliamentary group for Afghan women and girls, said: \"Too many families remain separated by a slow, opaque and bureaucratic process.\n\"Meanwhile for thousands of others, the promise of safety on our shores has never materialised, with the threat of deportation from Pakistan looming over them.\n*The programmes put in place three and a half years ago have simply not achieved what they intended to.\"\nShe said she had written to the Home Office raising the issues and urging officials to \"engage with us and our networks as soon as possible\".\nA Home Office spokesperson said it did not routinely comment on individual cases.\nThey added: \"We are working at pace to process referrals made under the Separated Families Pathway of the Afghan Citizens Resettlement Scheme and we have already begun to see arrivals and families be reunited.\"", "url": "https://www.bbc.co.uk/news/articles/c3vwwdzgedqo"}