{"authors": ["Oscar Edwards", "www.facebook.com"], "date_download": "2025-04-26 04:10:51", "date_modify": "2025-04-26 04:10:51", "date_publish": "2025-03-04 19:35:39", "description": "Rhys Salcombe was part of the Dune: Part Two team that won the best visual effects award.", "filename": "news_articles_c89yee9384zo_1745640651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6393/live/82e39e80-f92b-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89yee9384zo_1745640651.html", "title": "Oscars: Welsh winner played off stage before making speech", "title_page": "Oscars: Welsh winner played off stage before making speech - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Oscar winner has said it was \"a shame\" to be played off stage before he had a chance to make his acceptance speech.\nRhys Salcombe, from Aberystwyth, Ceredigion, was part of the Dune: Part Two team that scooped the award for best visual effects.\nOscar winners are usually given a 45-second timer as they accept the award and on this occasion his colleagues spoke first.\nRhys told BBC Radio Wales Drive he was glad they \"got the chance\" after some had missed out on previous occasions.\nRhys, a Welsh-Canadian visual effects artist, said his passion for film developed in the beautiful landscape of Ceredigion.\n\"Being in the countryside, being able to experience nature in that way. It really instils that love of capturing the beauty in the camera as much as possible,\" he said.\nThe Ysgol Penglais schoolboy was exposed to film from a \"young age\" through his parents.\n\"I honed my skills and, from there, it's just the luck you need to get in the industry,\" he said.\nThe whole experience has been a \"bit of a blur\" and he admitted his achievement was yet to fully sink in.\nRhys said it was \"special\" to represent the team on stage along with three of his colleagues.", "url": "https://www.bbc.co.uk/news/articles/c89yee9384zo"}