{"authors": ["Cherylann Mollan", "www.facebook.com"], "date_download": "2025-04-26 06:24:14", "date_modify": "2025-04-26 06:24:14", "date_publish": "2025-03-01 01:23:29", "description": "The chinar is a symbol of the Kashmir valley's landscape and a major tourist draw.", "filename": "news_articles_cvgee5ywq2vo_1745648654.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ed86/live/b5181dc0-f59a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgee5ywq2vo_1745648654.html", "title": "The race to save Kashmir's iconic chinar trees", "title_page": "The race to save Kashmir's iconic chinar trees - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Was it pruning or felling?\nThe alleged chopping of centuries-old chinar trees, external in Indian-administered Kashmir has sparked outrage, with locals and photos suggesting they were cut down, while the government insists it was just routine pruning. The debate has renewed focus on the endangered tree and efforts to preserve it.\nThe chinar is an iconic symbol of the Kashmir valley's landscape and a major tourist draw, especially in autumn when the trees' leaves light up in fiery hues of flaming red to a warm auburn.\nThe trees are native to Central Asia but were introduced to Kashmir centuries ago by Mughal emperors and princely kings. Over the years, they have come to occupy an important place in Kashmiri culture.\nBut rapid urbanisation, illegal logging and climate change are threatening their survival, prompting authorities to take steps to conserve them.\nThe Jammu and Kashmir government has been geotagging chinar trees in an effort to keep track of them and their health. The project involves attaching a QR code to each tree with information about its location, age and other physical characteristics.\n\"We are 'digitally protecting' chinar trees,\" says Syed Tariq, a scientist who's heading the project. He explains that information provided by the QR code can help locals and tourists get to known more about a tree, but it can also help counter problems like illegal or hasty cutting of them.\nThe project has geotagged about 29,000 chinar trees so far, with another 6,000–7,000 still left to be mapped.\nDespite its heritage value, there was no proper count of these trees, says Mr Syed. While government records cite 40,000, he calls the figure debatable but is certain their numbers have declined.\nThis is a problem because the tree takes at least 50 years to reach maturity. Environmentalists say new plantations are facing challenges like diminishing space. Additionally, chinar trees need a cool climate to survive, but the region has been experiencing warmer summers and snowless winters of late.\nBut on the bright side, these trees can live for hundreds of years - the oldest chinar tree in the region is believed to be around 700 years old. A majority of the trees are at least a few centuries old and have massive trunks and sprawling canopies.\nThe trees received maximum patronage during the Mughal period, which stretched from the early 1500s to the mid-1800s. Many of the trees that exist in the valley were planted during this period, Mr Syed says.\nThe Mughal kings, who ruled many parts of erstwhile India, made Kashmir their summer getaway due to its cool climate and beautiful scenery. They also erected \"pleasure gardens\" - landscaped gardens famous for their symmetry and greenery - for their entertainment.\nThe chinar enjoyed pride of place in these gardens and the trees were usually planted along water channels to enhance the beauty of the place. Many of these gardens exist even today.\nAccording to government literature, in the 16th Century Mughal emperor Akbar planted around 1,100 trees in one such pleasure garden near the famous Dal Lake in Srinagar, but about 400 have perished over the years due to road-widening projects and diseases caused by pests.\nEmperor Jahangir, Akbar's son, is said to have planted four chinar trees on a tiny island in Dal Lake, giving it the name Char Chinar (Four Chinars) - now a major tourist draw. Over time, two trees were lost to age and disease, until the government replaced them with transplanted mature trees in 2022.\nInterestingly, the chinar is protected under the Jammu and Kashmir Preservation of Specified Trees Act, 1969, which regulates its felling and export and requires official approval even for pruning. The law remains in force despite the region losing statehood in 2019.", "url": "https://www.bbc.co.uk/news/articles/cvgee5ywq2vo"}