{"authors": ["Alexandra Bassingham", "www.facebook.com"], "date_download": "2025-04-26 04:29:59", "date_modify": "2025-04-26 04:29:59", "date_publish": "2025-03-03 06:30:40", "description": "Sport England has announced plans to boost physical activity levels in more than 50 communities.", "filename": "news_articles_c2417q45n8eo_1745641799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e2bc/live/7ecbc2f0-f462-11ef-bc71-6ff62e3f49fb.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2417q45n8eo_1745641799.html", "title": "Project to boost activity levels in deprived areas", "title_page": "Swindon: Project to boost activity levels in deprived areas - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Children in deprived areas are half as likely to be physically active than those in wealthier ones, according to a Sport England study.\nIn response, the public body has announced that it will be supporting communities in 53 \"high-need\" areas, including Swindon, Wiltshire, through projects to make sport more accessible and to boost health and wellbeing.\nSport England said the impact of physical inactivity costs the NHS billions of pounds a year and deepened \"long-term health inequalities\".\nA spokesperson for Wiltshire and Swindon Sport (WASP) said the group was \"really excited to be working with Sport England and our communities to address physical activity inequalities in our town\".\nSport England said its research had shown that just 34% of children meet physical activity guidelines in deprived communities, compared to 62% in more affluent areas.\nIt said the situation disproportionately affected women, people from lower socio-economic backgrounds, and black and Asian communities.\nThe amount of funding being made available to each region will be announced in the coming months, with projects being led locally over a number of years.", "url": "https://www.bbc.co.uk/news/articles/c2417q45n8eo"}