{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:35:10", "date_modify": "2025-05-19 15:35:10", "date_publish": "2015-02-05 03:18:57", "description": "Tens of thousands of people have used an official electoral registration website as MPs call for voter registration to extended to election day itself.", "filename": "news_uk-politics-31133406_1747668910.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80806000/jpg/_80806245_07b3d152-c354-4d69-b31e-1edce1c1a25f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31133406_1747668910.html", "title": "Record numbers apply online for electoral registration", "title_page": "Record numbers apply online for electoral registration - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tens of thousands of people have used an official voter registration online portal, breaking previous records, the Cabinet Office has said.\nSome 81,015 people used Gov.uk to apply to be put on the electoral register, external, the Cabinet Office tweeted, external.\nEvents were held across the UK to encourage online registration.\nMeanwhile, MPs called for to be able to register to vote on an election day itself to help address the growing deficit in democratic engagement.\nThe Commons Political Reform Committee said such a step should be considered by 2020 to \"re-energise\" elections.\nCampaign group Bite The Ballot hoped to register 250,000 people on a single day, either through the online system or by post, by holding a series of rallies in workplaces, universities and schools.\nPeople have to be on the electoral register by 20 April to be able to vote in the general election on 7 May.\nCampaigners have warned that the move to individual voter registration last year - in which people have to sign up individually and cannot be registered by another member of their household or student halls - risks disenfranchising a million people.\nOn Thursday, the previous record for the number of voters registered on Gov.uk website - 51,449 - was smashed.\nPeople have been able to use Gov.uk to apply to be on the electoral register since June, a Cabinet Office spokesman said.\nYou can register once you are 16 although you will only be able to vote on 7 May if you are 18 or over on the day.\nIf you are a citizen of another EU member state or Commonwealth country living in the UK, and unsure whether you are entitled to vote in the general election or local elections check the Electoral Commission website., external\nYou can register to vote online through the government's gov.uk portal, external. The process takes five minutes and you will need your national insurance number.\nIf you are unsure whether you are already registered or want to update your details, contact your local electoral registration officer to find out. You can also register to vote by post.\nElection 2015: Can registration drive help turnout?\nThe Commons Political Reform Committee also called for votes for 16 and 17 year olds, online voting and general elections to be held at weekends to help boost turnout.\nThe cross-party committee said the government should consider making registration automatic or allowing people to sign up close to or even on polling day.\nWays of increasing registration among target groups, such as 18-24 year olds, UK citizens living abroad and people with disabilities must also be a priority, it said.\n\"We are recommending that the government consider some radical changes, like online voting, holding elections at the weekend and letting voters register to vote on election day, because we believe a serious problem needs serious answers,\" Graham Allen, the Labour MP who heads the committee, said.\n\"If we do not take urgent action to make elections more accessible to the public and convince them it is worth voting, we will be facing a crisis of democratic engagement.\"\nAlthough overall turnout increased at the 2010 election, the proportion of 18-24 year olds voting was much lower than other groups, prompting calls for online voting to be piloted - a move backed recently by Commons Speaker John Bercow.\nBite The Ballot said National Registration Day was an opportunity for people to show that \"they wanted more from their democracy\".\n\"As this year's campaign is taking place during the handover from 'head of household' to individual registration, it's never been more important to make people aware of the power they hold as engaged, active, registered citizens,\" said Michael Sani, the co-founder of the organisation.\n\"It's a day for all of us, as citizens, to celebrate our democratic rights. But it's also a chance to prove to decision-makers that we hold a stake in society.\"\nThe Electoral Commission, which is holding its own registration drive, said 40% of people were not aware they could register online in about five minutes.\n\"Online registration has made it much easier for people to register to vote, so it's vital everyone knows it exists,\" said Jenny Watson, who chairs the commission.\n\"Don't let your friends and family miss out from having their say in May's election because they didn't know how to register or missed the deadline.\"\nThe watchdog has joined up with technology giant Facebook to send a notification to the social media site's 35 million active UK users to alert them about online registration.", "url": "https://www.bbc.com/news/uk-politics-31133406"}