{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:40", "date_modify": "2025-05-19 15:30:40", "date_publish": "2015-02-09 15:11:44", "description": "Ali Smith's How to be Both, winner of the Goldsmiths Prize for original fiction and the Costa novel award, is shortlisted for the 2015 Folio Prize.", "filename": "news_entertainment-arts-31297677_1747668640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80881000/jpg/_80881790_smith1_reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31297677_1747668640.html", "title": "Ali Smith novel How to be Both up for £40,000 Folio Prize", "title_page": "Ali Smith novel How to be Both up for £40,000 Folio Prize - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ali Smith's How to be Both, winner of the Costa novel award and Goldsmiths Prize for original fiction, has been shortlisted for another honour.\nThe novel, which tells of a teenage girl in the present day and an Italian artist in the 1460s, is one of eight titles up for the 2015 Folio Prize.\nWorks by Ireland's Colm Toibin, US writer Ben Lerner and Kenya's Yvonne Adhiambo Owuor also make the shortlist.\nThe £40,000 prize is open to English-language writers from around the world.\nThe inaugural Folio Prize was won last year by Tenth of December, a short story collection by American writer George Saunders.\nThis year's winner will be announced on 23 March.\nAnalysis: Rebecca Jones, arts correspondent\nThis is a much more diverse shortlist than the one announced last year, which was dominated by American novelists. It features five women and three men, from Kenya, India, Ireland and Britain as well as the United States.\nFormer literary prize winners including Inverness-born Ali Smith and Colm Toibin rub shoulders with less familiar names such as Akhil Sharma. Born in Delhi and now living in New York, it took him 13 years to write Family Life, which is his second novel and explores the immigrant experience.\nIn drawing up the shortlist, the judges said they paid no attention to a writer's biography, their track record or where they came from. The chairman, writer William Fiennes, said it was really important to \"open up the space for marginalised voices,\" but he was not sure that The Folio Prize was the place to do that.\nSo on this occasion he was interested only in \"rewarding excellence.\"\nBut he did add that if the shortlist \"had turned out to be eight white men from Brooklyn, we would have all felt a bit sheepish.\" His comments made publishers and journalists laugh as the eight titles were announced at the British Library.\nFiennes went on to say that all the books that had been selected explore huge and varied themes, including \"war, grief, family life, love, loss, the making and the mystery of art\".", "url": "https://www.bbc.com/news/entertainment-arts-31297677"}