{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:03:23", "date_modify": "2025-05-21 05:03:23", "date_publish": "2025-01-23 00:00:00", "description": "Ariana Grande was nominated for best actress in a supporting role, but Wicked missed out on best adapted screenplay.", "filename": "news_live_c93lyk9nl25t_1747803803.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c93lyk9nl25t_1747803803.html", "title": "Emilia Pérez leads Oscar nominations with Wicked and the Brutalist close behind", "title_page": "Emilia Pérez leads Oscar nominations with Wicked and the Brutalist close behind - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A record-breaking morning for Netflix\nThis year's Oscars nominations are out and it's been a record-breaking morning for the Netflix film Emilia Pérez.\nIts 13 nominations make it the most nominated foreign film in Oscars history beating Roma in 2019 and Crouching Tiger, Hidden Dragon in 2001 - they both received 10.\nHere's a recap of the top lines from the morning's ceremony in Los Angeles, which was a stripped back affair due to the recent wildfires which have devastated the region\nThe 13 categories Emilia Pérez was nominated for include: best picture, cinematography, sound, editing, picture, visual effects and best song\nKarla Sofía Gascón has been nominated for best actress for her role in the film, the first transgender person to be nominated for an acting prize at the Oscars\nWicked is the year's second most nominated film, picking up 10 nominations including best score, costume design, production design and film editing\nIts lead actresses Cynthia Erivo and Ariana Grande are up for best actress and supporting actress respectively\nThe nominees in full for best picture are: Anora, The Brutalist, A Complete Unknown, Conclave, Dune: Part Two, Emilia Perez, I'm Still Here, Nickel Boys, The Substance and Wicked\nWe're bringing our live coverage to a close now, but you can read more on this year's Oscar nominations in our news story.\nThe 97th Academy Awards will take place in Los Angeles on 2 March.\nWhere does this leave the best picture race?\nSteven McIntosh\nEntertainment reporter\nBest picture is seen as wide open this year, with several films which could feasibly take the top prize.\nFollowing the Oscar nominations, Conclave is arguably slightly weaker than was previously thought, having missed a best director nomination for Edward Berger.\nEmilia Pérez might have the most nominations, and it is certainly a contender, but it's a divisive film which has almost as many detractors as fans, which could harm its chances.\nPerhaps one of the strongest contenders is The Brutalist, which got into pretty much every major category it was expected to and has had a strong showing at other ceremonies. It is stronger after the Oscar nominations.\nBut don't count out Anora. It won the top prize at the Cannes Film Festival last year, and although it has struggled to pick up wins elsewhere, it has such wide support that it could benefit from the preferential ballot system.\nIn best picture, voters rank the films in order of preference, which means a widely liked film which picks up lots of second and third placements can have a better chance of winning than a film with a smaller number of people who put it in first place.\n'I wish my parents were alive to celebrate with me' - Isabella Rossellini\nThe news of Oscar nominations is still sinking in for some actors.\nIn the last few minutes, Fernanda Torres - who has been nominated for best actress for I'm Still Here - posted a video on Instagram thanking the film's crew and her children, as well as the public for watching the film.\nIsabella Rossellini, who has been nominated for best supporting actress for her performance in Conclave, says in a post on Instagram that \"with this joy in my mind [I] can't help lingering in the beyond to David Lynch\". The American filmmaker died last week.\n\"I wish my parents were alive to celebrate with me this great honour,\" she says.\nWhere can I watch the Academy Awards ceremony?\nWith the nominations now out of the way, we can look forward to 2 March for the 97th Academy Awards ceremony in Los Angeles.\nIn the UK, the ceremony will be available on ITV, and if you're in America, you'll be able to tune in to your local ABC station or stream it on Hulu.\nIf you'll be viewing the event from elsewhere, the Oscars has a list of where you can watch it., external\nBaby pics and champagne in Paris - Oscar nominees react to news\nWe're getting more reactions to today's Oscar nominations from Wicked director Jon M Chu and A Real Pain actor Kieran Culkin.\nChu says that the nominations came in at around 05:00 am for him and he \"couldn't be more proud of our crew\".\nIncluded alongside his reaction are pictures of best supporting actress nominee Ariana Grande and best actress nominee Cynthia Erivo as young children with the caption \"someone tell these little girls they're nominated for an Oscar\".\nKieran Culkin's wife, Jazz Charton, has also shared a picture of her Oscar-nominated husband pouring champagne to celebrate the nomination during a visit to Paris.\nAnd best actor nominee Adrien Brody posted photos of his parents from 1957 on Instagram, saying that representing the \"hardships and yearnings of so many\", including the struggles of his own family, has \"rekindled my own sense of being and belonging\".\nThe 2025 Oscars may not see performances like 'I'm Just Ken'\nFor many, the highlight of the Academy Awards ceremony are the performances from nominees.\nTypically, nominees in the best original song category will perform throughout the night. Last year's ceremony saw Ryan Gosling perform Barbie's I'm Just Ken, and Jon Batiste's performance of It Never Went Away from the Netflix documentary American Symphony.\nHowever, this year's ceremony will be different, with a move away from live performances and a focus on the songwriters in the wake of the LA wildfires.\n\"We will celebrate their artistry through personal reflections from the teams who bring these songs to life,\" Academy president Janet Yang and Bill Kramer, CEO of the Academy of Motion Picture Arts & Sciences, wrote to members.\n\"All of this, and more, will uncover the stories and inspiration behind this year’s nominees.”\nDebate around 'category fraud'\nSteven McIntosh\nEntertainment reporter\nOne issue that rolls around every awards season is whether or not certain actors should be considered the lead or supporting characters in their films.\nZoe Saldaña’s nomination in best supporting actress is perhaps the most notable example this year. She appears on screen for 44% of Emilia Perez’s run time, more than her co-star Karla Sofía Gascón (40%).\nAnd yet, Gascón is nominated as the film’s lead, while Saldaña is in supporting. But in fairness, the film’s narrative arc centres on Gascón’s titular character.\nEqually, many fans feel supporting actor nominee Kieran Culkin should be considered the lead character in his film, A Real Pain. The Succession actor is the heart and soul of the film in many ways and is on screen for nearly 65% of its screen time. His co-star Jesse Eisenberg, who’s only slightly ahead with nearly 70% screen time, is competing as the lead.\nAlso fairly close together in screen time are Wicked’s lead actress Cynthia Erivo (54%) and supporting actress contender Ariana Grande (45%). At the opposite end of the scale, Conclave’s Isabella Rossellini is nominated in best supporting actress for just under eight minutes of screen time.\nDemi Moore 'overwhelmed' by nomination\nSteven McIntosh\nEntertainment reporter\nWe've just had a statement through from Demi Moore, who is nominated for best actress for her performance in the body horror The Substance.\n\"Being nominated for an Oscar is an incredible honour and these last few months have been beyond my wildest dreams,\" she says.\n\"Truly there are no words to fully express my joy and overwhelming gratitude for this recognition. Not only for me but for what this film represents. I am deeply humbled.\"\nThe nomination caps an incredible comeback for Moore who has already won a Golden Globe for her role.\nBut her nomination comes during an extremely difficult period for Los Angeles following the recent wildfires, something Moore references in her statement.\n\"This is a time of incredible contrasts and right now, my heart is with my friends, family, neighbors, and community here in LA,\" she says.\n\"The fires have devastated so many lives but to see the way our community has united leaves me in awe of the resilience and compassion that defines us, and this moment is a reminder of how incredible we are when we stand together.\"\nRecord breakers in best actress\nSteven McIntosh\nEntertainment reporter\nThere are several interesting things to note in the best actress category this year.\nKarla Sofía Gascón becomes the first transgender person to be nominated for an acting prize at the Oscars. She is up for lead actress for her role in Emilia Pérez.\n(One caveat: Elliot Page was nominated for Juno in 2008, but that was more than a decade before the actor transitioned.)\nIn the same category, Wicked star Cynthia Erivo becomes the first black British woman to score two Oscar nominations for acting.\nAnd, for the first time in 47 years, all five of the women nominated for best actress appear in best picture-nominated films - although that's partly because the category was expanded to 10 slots a few years ago.\nEmilia Pérez's Karla Sofía Gascón responds to nomination\nThe film Emilia Pérez has swept through the Oscar nominations this year, including in the best actress category for Karla Sofía Gascón's performance.\nResponding to the news of her nomination, she says in a post on X, external: \"Thank you so much.\"\n\"I take refuge in the Lotus of the Wonderful Law,\" she goes on to say - phrase linked to Nichiren Buddhism, which the actress has been preactising for more than 20 years.\n'I cannot stop crying, to no one’s surprise' - Ariana Grande\nAriana Grande says she \"cannot stop crying\" after being nominated for an Oscar in the best supporting actress category.\nGrande, who plays Glinda in the film Wicked, writes on Instagram: \"I'm humbled and deeply honored to be in such brilliant company and sharing this with tiny Ari who sat and studied Judy Garland singing Somewhere Over the Rainbow just before the big, beautiful bubble entered.\"\nThe singer-actress gave a shout out to co-star Cynthia Erivo, who she called \"my Elphie, my sister, my dear\".\n\"You deserve every flower (tulip) in every garden. I love you unconditionally, always.\"\nThe singer-actress also thanked director Jon M Chu, her family and expressed how proud she is of her Wicked family.\nFamily connections in the best actress category\nAs we reported earlier, Fernanda Torres has been nominated for best actress for her role in I'm Still Here, making her only the second Brazilian to get a nod for the award.\nYou'd have to go back to 1999 to see the last time a Brazilian was nominated in this category.\nAnd who was the Brazilian who got that nomination?\nFernanda Montenegro, Fernanda Torres' mum, for her role in Central Station.\nInterestingly, Walter Salles directed both films mother and daughter were nominated for.\nTorres will be looking to become the first Brazilian to win the award, after her mum lost out to Gwyneth Paltrow for her role in Shakespeare in Love.\nConclave's director misses out\nSteven McIntosh\nEntertainment reporter\nThe biggest surprise in the directing category is the absence of Edward Berger, who directed the screen adaptation of Robert Harris's novel Conclave.\nDespite its healthy number of nominations overall, its miss in this category significantly weakens the film's campaign and arguably makes a best picture win less likely.\nMany thought Berger was a guaranteed nominee after some Academy voters expressed regret that he wasn't nominated for his last film, All Quiet on the Western Front.\nInstead, the nominees in this category include Jacques Audiard (Emilia Pérez), Sean Baker (Anora), James Mangold (A Complete Unknown) and Golden Globe winner Brady Corbet (The Brutalist).\nAnd many will be pleased to see the expected nomination for Coralie Fargeat (The Substance) follow through, which means there is once again a woman in a category which has historically been male-dominated.\nBig surprises in best picture\nSteven McIntosh\nEntertainment reporter\nAwards pundits had largely coalesced around which 10 films would make it into best picture. But interestingly, the top category threw up a couple of genuine (but welcome) surprises.\nOne film which has made it is the excellent Nickel Boys - an adaptation of Colson Whitehead's novel about two young men who are sent to an abusive reform school in the 1960s.\nWhile Fernanda Torres pulled off her nomination in best actress, the inclusion of her film I'm Still Here in best picture is a pleasant surprise. The Brazilian film is likely to have been particularly strong with international voters.\nSo what has missed out? Many were predicting A Real Pain and Sing Sing would make it into this category. They are the big snubs here, but the good news for their devotees is they are well represented in other categories.\nFernanda Torres clinches fifth spot in best actress\nAll four of the locks made it in here – including Demi Moore, who continues her astonishing comeback thanks to her performance in body horror The Substance.\nShe is joined by fellow frontrunners Mikey Madison (Anora), Cynthia Erivo (Wicked) and Karla Sofía Gascón (Emilia Pérez).\nAll four sailed in with ease and it would have been a huge upset if any had missed. The big debate in this category was who would score the fifth spot.\nUltimately, the answer was Fernanda Torres (I’m Still Here), a film which is clearly strong as it has also shown up in best picture unexpectedly.\nTorres gives a quiet and understated performance as a Brazilian woman in the 1970s who investigates the disappearance of her congressman husband.\nWatch: The London braider behind Elphaba's Oscar-nominated wig\nEarlier, we shared the nominees for best makeup and hairstyling.\nAmong the professionals getting a nod from the Academy for their work is Marie-Josee Mampuya Yonda, the braider behind Elphaba's wig in the Wicked film.\nThe braider noted the wig Cynthia Erivo was originally supposed to wear had braids which were too thick, with the production calling on Yonda and her team of braiders to create a new one in just three days.\n\"I wouldn't lie, I was trembling, I was scared, I was worried,\" she told the BBC earlier this month. \"But I said, 'I can do it'.\"\n'I nearly spilt my tea', Wallace & Gromit creator tells the BBC\nWe're just hearing from Oscar nominees Nick Park and Merlin Crossingham whose film Wallace & Gromit: Vengeance Most Fowl, has been nominated for best animated feature film.\nPark tells the BBC the nomination is a \"surprise and real privilege\" while Crossingham says: \"I nearly spilt my tea,\" when hearing the news before adding that \"we all had a huge cheer and celebration\".\nThe creators say they spent 15 months working on the film with a crew of 260 people, whom they describe as an \"army of artists\".\nThe pair said they are happy Wallace and Gromit's appeal has spanned generations of families - young and old alike - and that the awards ceremony is shining a light on stop motion animation.\nAsked whether the beloved characters will be attending the Oscars, the creators say they are preparing their outfits now.\nWho has missed out?\nSteven McIntosh\nEntertainment reporter\nMany fans were keeping their fingers crossed for Pamela Anderson to make it into best actress for The Last Showgirl, which sees her give a vulnerable and powerful performance as an ageing Las Vegas performer.\nShe showed up unexpectedly at other ceremonies including the SAG and Golden Globe nominations, but has ultimately missed out at the Oscars.\nMarianne Jean-Baptiste was another victim of the busy best actress category, missing out on a nomination for her performance in Mike Leigh's Hard Truths.\nBut it's also worth reflecting on how quickly Angelina Jolie's campaign ran out of steam this season, after also missing SAG and Bafta nominations.\nJust a few weeks ago, Jolie was considered a dead-cert for the category for her portrayal of opera singer Maria Callas, and her fans were ready for a comeback on the awards stage.\nBut voters clearly weren't keen on Pablo Larraín's film, which scored just one nomination for cinematography.\nDaniel Craig misses the best actor category\nSteven McIntosh\nEntertainment reporter\nThe big snub in best actor is Daniel Craig – who misses out for his performance in Queer, in which he plays a gay man in 1950s Mexico City.\nThere had been rumblings he would miss this category after he also failed to score a Bafta nomination on his home last week.\nQueer has been divisive with audiences, many of whom were turned off by the second half which sees the plot veer off in a bizarre direction as Craig's character ventures into the jungle in search of a rare plant.\nInstead, the nominees in this category included Adrien Brody (The Brutalist), Timothée Chalamet (A Complete Unknown), Colman Domingo (Sing Sing) and Ralph Fiennes (Conclave).\nCraig was widely considered to be the competing for the fifth spot with Sebastian Stan, who has ultimately made it in for his portrayal of Donald Trump in The Apprentice.\nStan’s nomination was far from certain, as he has two films in the race this year, which can sometimes harm an actor’s campaign due to vote splitting.\nMany voters likely chose to vote for him in The Apprentice to keep the film in the conversation following Donald Trump's election in the US.", "url": "https://www.bbc.com/news/live/c93lyk9nl25t"}