{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:23:02", "date_modify": "2025-05-19 15:23:02", "date_publish": "2015-02-17 06:49:53", "description": "Papers praise the investigation into Su Rong, saying it shows top officials are not exempt from the corruption crackdown.", "filename": "news_world-asia-china-31499477_1747668182.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81052000/jpg/_81052087_su.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-china-31499477_1747668182.html", "title": "China media: Su Rong", "title_page": "China media: Su Rong - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Corruption charges against former senior official Su Rong show that the authorities are investigating more senior officials, papers say.\nSu Rong has been expelled from the Communist Party for corruption and faces prosecution, the Central Commission for Discipline Inspection (CCDI) said in a statement on Monday.\nThe top anti-corruption body states that the former vice-chairman of the parliamentary advisory body abused his position to receive \"large sums of illegal bribes\", which resulted in \"huge losses of government assets\".\nSeveral papers, including the Beijing News, external and the Beijing Youth Daily, external, have noted the \"strong-wording\" used in the CCDI's statement.\nThe CCDI said some officials \"blatantly accept bribes and confer official ranks for money\" and \"support and wilfully permit relatives to use their status to interfere in politics\".\nThe Beijing News notes that the choice of some \"fiery words\" in the statement reflects the authorities' determination to fight corruption.\n\"The CCDI has sounded out what was on everybody's mind, so now people have nothing much to add,\" notes the editorial.\nThe Beijing Times, external agrees that the choice of strong words was \"deliberate to sound a warning\" to other officials.\nLyu Pin, a professor at the China Central Party School, however, tells the People's Daily, external that despite the \"high-pressure tactic\", lower ranking officials in some regions are \"still turning a deaf ear\" and some are even \"getting bolder in their corrupt behaviour\".\nAdmitting that the fight against corruption is \"complex and challenging\", the Communist Party's flagship paper stresses that the authorities have \"strategised their moves\" for the year, \"casting nets everywhere\" to capture violators.\nTurning to economic news, papers are confident that China remains a \"charming\" investment destination after fresh data shows a sharp increase in foreign investment.\nForeign direct investment (FDI) in China soared by 29.4% in January from a year earlier, coupled with a 31.8% \"spike\" of new foreign-funded companies, the official Xinhua News Agency, external reports.\nThe Global Times, external notes that the stronger-than-expected inflow of capital has come amid slower economic growth.\n\"The share of investment shows us that the FDI has shifted from manufacturing to services. It shows that the latter has huge potential, especially since China is losing its competitive edge on labour-intensive manufacturing due to the rising labour, land and environmental costs,\" JP Morgan Chief China Economist Zhu Haibin tells the paper.\nThe People's Daily, external says the uptrend shows that China is still \"charming\" to foreign investors who have confidence in the quality of economic growth and investment environment.", "url": "https://www.bbc.com/news/world-asia-china-31499477"}