{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 04:09:20", "date_modify": "2025-04-26 04:09:20", "date_publish": "2025-03-02 19:10:03", "description": "The deal is worth up to £1.6bn and will involve recruiting 200 additional staff.", "filename": "news_articles_c74knzk9x8zo_1745640560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4706/live/130c8670-f81e-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c74knzk9x8zo_1745640560.html", "title": "Belfast: Thales missile factory to supply 5,000 air defence missiles to Ukraine", "title_page": "Belfast: Thales missile factory to supply 5,000 air defence missiles to Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Thales missile factory in Belfast is to supply 5,000 air defence missiles to Ukraine, the prime minister has announced.\nThe deal is worth up to £1.6bn and will involve recruiting 200 additional staff.\nThales is a French-owned company which is one of Europe's biggest arms manufacturers.\nThe order is for lightweight multirole missiles (LMMs) which Ukrainian forces are already using.\nPrime Minister Sir Keir Starmer announced the order as he laid out a four point plan to \"reach peace and defend Ukraine\".\nEast Belfast MP and DUP leader Gavin Robinson said the order is \"hugely significant\" given the \"turbulence\" in international relations and the acknowledgement of the \"skill and ingenuity\" of the Thales team.\nA £162m contract announced in September last year saw 650 LMMs supplied to Ukraine as an initial order to ramp up production, with the first deliveries in December.\nThe new order is much bigger: it is worth an initial £1.16bn with the potential for around a further £500m of work to be added in collaboration with a Ukrainian industry partner.\nThe partner firm will manufacture launchers and command and control vehicles for the missiles in Ukraine.\nRobinson said there is no point talking about international principles and values \"if you're not prepared to stand up for them\".\n\"We're giving the tools to make sure a sovereign country has the ability to stand against an international aggressor in Russia, a country that decided to walk over the border, destroy cities, villages and towns and kill civilians,\" he said.\nRobinson added that the defence spend is \"encouraging\" for the industry and the Northern Ireland economy.", "url": "https://www.bbc.co.uk/news/articles/c74knzk9x8zo"}