{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:59", "date_modify": "2025-05-19 14:47:59", "date_publish": "2015-02-28 21:39:40", "description": "Tens of thousands of people march in Moscow to honour Russian opposition politician Boris Nemtsov, who was shot dead on Friday.", "filename": "news_world-europe-31677506_1747666079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81323000/jpg/_81323257_i2mc4pbv.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31677506_1747666079.html", "title": "Boris Nemtsov murder: Tens of thousands march in Moscow", "title_page": "Boris Nemtsov murder: Tens of thousands march in Moscow - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tens of thousands of people have marched through central Moscow to honour opposition politician Boris Nemtsov, who was shot dead on Friday.\nThey carried portraits of Mr Nemtsov and banners saying \"I am not afraid\".\nHe had been due to lead an opposition march on Sunday but his killing turned the event into a mourning rally.\nMr Nemtsov's allies have accused the Kremlin of involvement, but President Vladimir Putin condemned the murder as \"vile\" and vowed to find the killers.\nOpposition supporters gathered at a point not far from the Kremlin before marching past the spot on Great Moskvoretsky Bridge where Mr Nemtsov was killed. Some chanted \"Russia without Putin!\"\nSeveral thousand people also marched in St Petersburg.\nThere has been no official figure on turnout yet, with estimates ranging from 16,000 to 70,000.\nMany people carried the national flag and flowers to lay at the scene of the killing, which was already piled with tributes. A few were holding Ukrainian flags.\nSome of the placards read: \"He died for the future of Russia\" and \"They were afraid of you, Boris\".\nMaria Glazacheva, a 22-year-old student in Moscow who joined the march, told the BBC: \"Boris was a good and honest man. Moscow is a sad place today.\"\nAt the scene: Sarah Rainsford, BBC News, Moscow\nThe mood was sombre as the crowd gathered. Many were carrying flowers to place at the spot where Boris Nemtsov was killed. They had placards displaying his photograph, and slogans that included a play on Mr Nemtsov's name so that it read: \"Fight on!\"\nAs the crowd turned the corner and flooded on to the embankment, they began to chant. Quietly at first, but more loudly as they approached the Kremlin: \"Russia without Putin\" and \"Putin, leave!\"\nThese were extraordinary scenes right at the heart of Russia's capital. The police were out in force, but the march was peaceful. Many in the crowd were carrying their national flag, with a black ribbon tied to it.\nThey said they wanted to show that they are patriots too. That criticising those in power does not make you an enemy of the state. People told me that - like Boris Nemtsov - they just want to see a different Russia.\nWho was Boris Nemtsov?\nNemtsov killing polarises society\nRussian and world reaction\nOpposition politician Ilya Yashin told Associated Press the killing was \"a political murder aimed at frightening the... part of the population that supported Nemtsov and did not agree with the government. I hope we won't get scared\".\nAnother opposition figure, Gennady Gudkov, told Reuters: \"If we can stop the campaign of hate that's being directed at the opposition, then we have a chance to change Russia. If not, then we face the prospect of mass civil conflict.\"\nPro-Kremlin activists from the group Anti-Maidan had said they would not disrupt the march.\nRussia's Investigative Committee said it was looking into a number of possible motives for Mr Nemtsov's murder.\nThey include his opposition to the Ukraine conflict, Islamic extremism - Mr Nemtsov had Jewish ancestry although he had become Orthodox Christian - and an opposition \"sacrifice\" of its leader to destabilise the state and undermine the president.\nPresidential spokesman Dmitry Peskov said Mr Putin had noted \"that this cruel murder has all the makings of a contract hit and is extremely provocative\".\nThe investigators offered a reward of three million roubles ($48,000) for information leading to the killers.\nApril 2003 - Liberal politician Sergey Yushenkov, external assassinated near his Moscow home\nJuly 2003 - Investigative journalist Yuri Shchekochikhin, external died after 16-day mysterious illness\nJuly 2004 - Forbes magazine Russian editor Paul Klebnikov, external shot from moving car on Moscow street, died later in hospital\nOctober 2006 - Investigative journalist Anna Politkovskaya, external shot dead outside her Moscow apartment\nNovember 2006 - Former Russian spy Alexander Litvinenko, external died nearly three weeks after drinking tea laced with polonium in London hotel\nMarch 2013 -Boris Berezovsky, former Kremlin power broker turned Putin critic, found dead in his UK home", "url": "https://www.bbc.com/news/world-europe-31677506"}