{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:55:48", "date_modify": "2025-04-26 07:55:48", "date_publish": "2025-02-25 12:33:33", "description": "The UK Department for Transport commits up to £5m with that sum matched by the Scottish government.", "filename": "news_articles_c05mlp43gnqo_1745654148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/18af/live/6a25f7c0-f36e-11ef-add3-5160ab1f5b9d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05mlp43gnqo_1745654148.html", "title": "Funds confirmed for Borders Railway extension study", "title_page": "Funds confirmed for Borders Railway extension study - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A funding package has been confirmed to allow a feasibility study into extending the Borders Railway to go ahead.\nThe UK Department for Transport has committed up to £5m towards the project with that sum matched by the Scottish government.\nThe funding had previously been agreed through the Borderlands Growth Deal but the new UK Labour government wanted to carry out a spending review before releasing its share.\nIt paves the way to appoint a project manager to assess the \"benefits and challenges\" of extending the line beyond Tweedbank and on to Carlisle.\nThe news comes ahead of the 10th anniversary of the opening of the line between Edinburgh and the Borders later this year.\nBoth the Scottish and UK governments agreed in 2021 to provide £10m towards exploring the feasibility of progressing the line from Tweedbank to Carlisle.\nHowever, it has taken four years for the funding package to be finally unlocked.\nUK government Scotland Office Minister Kirsty McNeill said: \"It's great news that the UK Department for Transport has now confirmed up to £5m towards feasibility work to explore the potential to extend the Borders Railway from Tweedbank to Carlisle.\n\"We look forward to working with deal partners as the feasibility work progresses.\"\nScotland's Transport Secretary Fiona Hyslop said the Scottish government remained committed to providing £5m towards taking the project forward.\n\"We welcome the news that the UK government will now match our commitment of up to £5m for a feasibility study to extend the Borders Railway and are supportive of partners securing a project manager with the technical expertise to deliver the project well,\" she said.", "url": "https://www.bbc.co.uk/news/articles/c05mlp43gnqo"}