{"authors": ["Jonathan Beale", "www.facebook.com"], "date_download": "2025-04-26 06:54:07", "date_modify": "2025-04-26 06:54:07", "date_publish": "2025-02-28 16:16:32", "description": "Donald Trump will not get involved in security guarantees for Ukraine, but can Europe fill the gap?", "filename": "news_articles_czjeejw9z4zo_1745650447.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f763/live/65e7ada0-f5e6-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czjeejw9z4zo_1745650447.html", "title": "Ukraine war: Can Europe deter Russia without US military?", "title_page": "Ukraine war: Can Europe deter Russia without US military? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump appears to have more confidence in the capabilities of Britain's armed forces than some of his own generals - or, for that matter, many of Britain's retired military top brass.\nWhen asked at his news conference with the UK prime minister about US security guarantees for Ukraine, Trump said: \"The British have incredible soldiers, incredible military and they can take care of themselves.\"\nHowever, the US president did leave the question hanging in the air as to whether the UK military could take on Russia.\nIn public, senior US military officers are quick to praise the professionalism of Britain's armed forces. But in private, they're often highly critical of recent cuts to their size, especially to the British Army, which now has just over 70,000 regular troops.\n\"Too small\" is what one very senior US general said in a private briefing on a visit to the UK.\nAccording to the International Institute of Strategic Studies, Russia's military expenditure is now higher than Europe's total defence spending, in terms of purchasing parity power. It's increased by 41% and is now the equivalent of 6.7% of GDP. In contrast, the UK will be spending just 2.5% by 2027.\nPresident Trump's comments underscore the reality that he's not contemplating putting American troops on the ground in Ukraine to police any ceasefire. Any US presence will be economic, to exploit mining interests.\nHe suggests that that in itself might be a deterrent to Russia attacking again. But even his administration thinks there must be some hard power too - provided by others. It'll be up to European nations to do that. The question is not just whether Europe has the will: does it have the numbers too?\nThe short answer is no. That is why Sir Keir Starmer has been pressing for additional US security guarantees from the world's most powerful military.\nBritain is not alone in cutting its armed forces in response to the end of the Cold War. That trend in Europe is slowly being reversed, with more nations increasing defence spending.\nBut Europe, on its own, would not be able to provide a force of 100-200,000 international troops, which Ukrainian President Volodymyr Zelensky suggests would be needed to deter Russia from attacking again.\nInstead, Western officials have said they're thinking of a force of up to 30,000 troops. European jets and warships would help monitor Ukraine's airspace and shipping lanes.\nThat force would be focused on providing \"reassurance\" at key sites - Ukraine's cities, ports and nuclear power stations. They would not be placed anywhere near the current front lines in Eastern Ukraine. European fighter jets and warships would also monitor Ukraine's air space and shipping lanes.\nBut these same Western officials acknowledge that this would not be enough, hence the calls for a US \"backstop\" - \"to have the confidence that whatever forces are deployed will not be challenged by Russia\" and to \"give the prime minister confidence that he can deploy British forces safely\".\nOfficials believe that, at the very least, the US could provide oversight to any European forces with a \"command and control element\" and US fighter jets ready to respond from its airbases in Poland and Romania. Europe cannot match American space-based surveillance or intelligence-gathering capabilities.\nIt could also agree to continuing to supply Ukraine with weapons.\nWhile Europe has recently overtaken the US in terms of the proportion of Western weapons supplied to Ukraine, one Western source said the US had provided \"the cream\" - such as long range missiles and air defence systems.\nEuropean nations also do not have the necessary enablers to conduct large-scale military operations on their own. The supply of Western weapons to Ukraine has been dependent on US logistics.\nNato's bombing campaign over Libya in 2011 also highlighted deficiencies - with European nations supposedly taking the lead, but still dependent on US support. Allies relied on US refuelling tankers and US targeting.", "url": "https://www.bbc.co.uk/news/articles/czjeejw9z4zo"}