{"authors": ["Andrew Dawkins", "www.facebook.com"], "date_download": "2025-04-26 06:47:25", "date_modify": "2025-04-26 06:47:25", "date_publish": "2025-03-01 12:13:39", "description": "Tributes are paid following the death of Pam Coe, who was at the players' entrance for two decades.", "filename": "news_articles_cd92lk7wv54o_1745650045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8a4f/live/d926e040-f68d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92lk7wv54o_1745650045.html", "title": "Shrewsbury Town FC staff member 'gave warmest of welcomes'", "title_page": "Shrewsbury Town FC staff member 'gave warmest of welcomes' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tributes have been paid to a Shrewsbury Town football club staff member who stood on the players' entrance for more than 20 years, following her death from cancer.\nPam Coe would greet everyone \"with the biggest of smiles\" and always give players \"the warmest of welcomes and be on hand to treat them to a hot drink or biscuit\", the League One club said.\nShrewsbury are asking fans to take part in a minute's applause during the 71st minute of the next home game against Bristol Rovers on Tuesday.\nEx-player Dave Edwards said she was a \"big part of the Salopian family who will be hugely missed\".\nShrewsbury Town said they were \"heartbroken to announce our much-loved staff member\" had passed away and the players' entrance at the Croud Meadow \"simply isn't going to be the same without Pam\".\nThe club stated as well as being an integral figure on a home match day, she travelled to away games and helped \"our medical staff and kitman load and unload all their equipment\".\n\"A woman who truly loved Shrewsbury Town, she was the first person players, staff and officials met on a home matchday,\" the club said.\n\"Everyone at the football club is going to miss her dearly.\"\nShrewsbury defender Morgan Feeney said on the social media platform: \"Pam was the kind of person who'd always make sure everyone else was alright before herself.\n\"Her kindness and smile will be missed by everyone at the club.\"\nCrewe Alexandra's former Town defender Mickey Demetriou said on X: \"Thoughts are with you and your family Pam, you always made everyone feel so welcome every time they see you.\"\nFormer Shrewsbury Town defender Matthew Pennington, who now plays for Blackpool, said: \"Pam was one of the heartbeats of the club and a lovely woman who helped myself, my wife and our families feel at home during our time in Shropshire.\"", "url": "https://www.bbc.co.uk/news/articles/cd92lk7wv54o"}