{"authors": ["Kerri-Ann Roper", "www.facebook.com"], "date_download": "2025-04-26 03:50:19", "date_modify": "2025-04-26 03:50:19", "date_publish": "2025-03-05 12:52:23", "description": "Dear Viv will be produced by World of Wonder, the media company behind the Drag Race franchise.", "filename": "news_articles_cgq97dnk5zxo_1745639419.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9e68/live/c729f890-f9b8-11ef-9509-b3ecaa172155.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgq97dnk5zxo_1745639419.html", "title": "The Vivienne: Documentary 'to celebrate Drag Race UK star's life and legacy'", "title_page": "The Vivienne: Documentary 'to celebrate Drag Race UK star's life and legacy' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new documentary to celebrate the \"life and legacy\" of drag star The Vivienne is in production, it has been announced.\nJames Lee Williams, who won the first series of RuPaul's Drag Race UK, died aged 32 in January.\nDear Viv is being made by World of Wonder, the production company behind the internationally popular Drag Race franchise.\n\"We want to celebrate The Vivienne's extraordinary life and work so everyone can experience her incredible talent, sass and enormous heart,\" said World of Wonder co-founders and executive producers Randy Barbato and Fenton Bailey.\n\"Although her stay here on Earth was far too brief, it is with tremendous admiration and affection that we share her legacy in Dear Viv,\" they added.\nThe programme, which will premiere on streaming service WOW Presents Plus later this year, will feature archive footage, letters from fans, and interviews with many of The Vivienne's loved ones, including fellow UK Drag Race star Baga Chipz.\nOther drag performers Michael Marouli and Danny Beard - the stage name of Daniel Curtis - will also appear in the documentary.\nThe producers said they hoped to \"sensitively trace James's journey from humble beginnings in North Wales to their meteoric rise on RuPaul's Drag Race UK\".\nWilliams, who grew up in Colwyn Bay before moving to Liverpool, won the show's first series in 2019 and went on to finish third in the 2023 edition of ITV's Dancing On Ice.\nThe Vivienne performed as the Wicked Witch of the West in a UK and Ireland tour of The Wizard Of Oz musical and then reprised the role last year at the Gillian Lynne Theatre in London's West End.\nLast week The Vivienne was honoured with a posthumous icon award at the inaugural Metro Pride Awards.", "url": "https://www.bbc.co.uk/news/articles/cgq97dnk5zxo"}