{"authors": ["Laura O'Neill", "www.facebook.com"], "date_download": "2025-04-26 03:44:23", "date_modify": "2025-04-26 03:44:23", "date_publish": "2025-03-05 07:24:02", "description": "Two men were stabbed during \"large-scale\" disorder in the Toxteth area of Liverpool, police say.", "filename": "news_articles_c0rzv20j97no_1745639063.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1d8f/live/02747eb0-f9c4-11ef-9e3a-ef9ebe93cf17.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rzv20j97no_1745639063.html", "title": "Extra stop and search powers after two stabbed in 'large scale' disorder", "title_page": "Extra stop and search powers after two stabbed in 'large scale' disorder - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Extra stop-and-search powers have been introduced in part of a city after two men were stabbed during \"large-scale\" disorder.\nOfficers were called to Granby Street in the Toxteth area of Liverpool at 21:00 GMT on Wednesday, Merseyside Police said.\nA 24-year-old man was stabbed in the chest and a second man, 48, suffered a laceration to his face.\nDetectives said a section 60 order, which gives officers enhanced powers to stop and search people suspected of carrying weapons or planning any criminality, will be in place in parts of Toxteth until just before 23:00 GMT.\nDetectives are speaking to people in the area and watching CCTV to establish what happened, police said.\nThe 24-year-old victim is in a serious but stable condition in hospital, while the 48-year-old is described as stable.\nThe Section 60 order, which applies to males and females aged 14-60, covers within the boundaries of Upper Parliament Street, Lodge Lane, Sefton Park Road, Ullet Road, Park Road to the junction with Upper Parliament Street.\nDet Insp Stuart McLoughlin said there would be a \"highly visible\" police presence \"to reassure people in the Toxteth area following incidents of criminality and violence\".\n\"We would ask anyone who was in the area of Granby Street who saw or heard anything or believes they captured something significant on their dashcam, mobile phone or doorbell camera to contact us as a matter of urgency,\" he said.\nHe urged people to \"avoid speculating, particularly on social media\" about what had happened and come forward if they had information.", "url": "https://www.bbc.co.uk/news/articles/c0rzv20j97no"}