{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:41:22", "date_modify": "2025-04-26 04:41:22", "date_publish": "2025-03-02 07:11:35", "description": "A story from the trial of men accused of being involved in a golden toilet theft was popular.", "filename": "news_articles_c30mm0g7rndo_1745642482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bc6f/live/d89d3490-f5e2-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c30mm0g7rndo_1745642482.html", "title": "Weekly round-up: Five stories from the south you may have missed", "title_page": "Weekly round-up: Five stories from the south you may have missed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A story from a trial looking at whether three men stole or conspired to transfer a £4.8m golden toilet from Blenheim Palace was among our most read this week.\nWe have picked five stories from the past seven days in Hampshire, the Isle of Wight, Dorset, Berkshire and Oxfordshire to keep you up to date.\nThieves stole a £4.8m solid gold toilet from Blenheim Palace in an \"audacious raid\" which took just five minutes, a court has heard.\nThe toilet was plumbed in and fully functioning as part of an art exhibition at the Oxfordshire stately home in September 2019.\nMichael Jones, 39, from Divinity Road, Oxford denies a charge of burglary. Fred Doe, previously known as Frederick Sines, 36, from Windsor, and 41-year-old Bora Guccuk, from west London, have pleaded not guilty to conspiring to transfer criminal property.\nTheir trial at Oxford Crown Court was told the toilet was most likely broken up and was never recovered.\nBMW has confirmed it is delaying the reintroduction of electric vehicle production at its Oxford Mini plant.\nThe vehicle manufacturer said \"multiple uncertainties facing the automotive industry\" had led to its decision to pause work on the £600m upgrade of its plant in Cowley.\nIt said it had decided not to accept a related £60m grant from the government but remained in \"close dialogue\".\nThe UK automotive industry has been in a long-running debate with the government over its targets for electric vehicle production.\n\"The patience and the care they had for me, when I was so vulnerable, I have never had anything like it in my entire life.\"\nTori is one of hundreds of young people in Southampton who have been helped out of homelessness by the charity No Limits.\nWhilst the charity doesn't provide direct housing, it advocates for young people and provides a support network, as well as shower and laundry facilities on site.\nIt is partly funded by Comic Relief - which has just announced at least £1m of grants for charities across the country thanks to a donation by prize-draw company Omaze.\nTributes have been paid to a 102-year-old RAF veteran who survived \"brutal interrogations\" by the Nazis during World War Two.\nFormer squadron leader Stanley Booker, from Christchurch in Dorset, died in January and a memorial service is taking place on Friday.\nHe was 22 years old when his aircraft was shot down over northern France in June 1944 and was the last of the \"lost airmen of Buchenwald\".\nMr Booker, who was born in Gillingham, Kent, was imprisoned until May 1945 and later received an MBE for his post-war work with British intelligence.", "url": "https://www.bbc.co.uk/news/articles/c30mm0g7rndo"}