{"authors": ["Pauline McLean", "www.facebook.com"], "date_download": "2025-04-26 03:53:41", "date_modify": "2025-04-26 03:53:41", "date_publish": "2025-03-03 07:56:48", "description": "The actress has brought her film of 'Long Day's Journey Into Night' to the Glasgow Film Festival.", "filename": "news_articles_cdrx5n1ynreo_1745639621.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ba9/live/82ef5cd0-f803-11ef-bd63-43b586fa3f07.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrx5n1ynreo_1745639621.html", "title": "Jessica Lange: 'At a certain age in the eyes of Hollywood you are finished'", "title_page": "Jessica Lange: 'At a certain age in the eyes of Hollywood you are finished' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Since her debut in the 1976 remake of King Kong, Jessica Lange has never shied away from hard work.\nA double Oscar winner for 1982's Tootsie, and 1994's Blue Sky, she's starred in roles as eclectic as The Postman Always Rings Twice, Cape Fear, Rob Roy, Big Fish and Broken Flowers.\nOn television she played Joan Crawford in Feud, took home an Emmy for Grey Gardens and a stash of awards for one of the many roles she played in the American Horror Story franchise.\nBut she's also a familiar figure on the stage – in London and on Broadway – where she's appeared in classics A Streetcar Named Desire, The Glass Menagerie and Mother Play.\nAnd it's that ability to cross between stage and screen, classic plays and pulp fiction, which means that everything she attaches herself to is guaranteed a loyal audience.\nHer latest film is an adaptation of Eugene O'Neill's Long Day's Journey into Night. The Pulitzer Prize winning play was written in 1940 but not staged until after O'Neill's death in 1956.\nA semi-autobiographical work dedicated to his wife, O'Neill described it as \"play of old sorrow, written in tears and blood.\"\n\"It has not been an easy project to get off the ground,\" Lange admits.\n\"This is a throwback to another kind of filmmaking and another kind of storytelling but in my mind this is the greatest American play ever written.\n\"It has this universality, this emotional depth. You'd be hard pressed not to relate to something in it, especially in the world we live in now.\"\nShe plays Mary Tyrone, the matriarch of an American family who's addicted to morphine since the birth of her sons, who struggles with loneliness and fears about her boys' health.\n\"Mary Tyrone is one of these parts which mean the world to me,\" says Lange.\n\"It may sound corny but I love her. It's thrilling as an actor to have a part like this.\"\nShe's played the role twice before on stage and it's the 2016 Broadway version, directed by Jonathan Kent, which has been brought to the screen.\nFilming wrapped in 2022 but it's only now that Lange and co-star Ed Harris have been able to premiere it in Dublin and Glasgow.\nShe arrived at the Glasgow Film Festival on Friday just as Tim Roth, who appeared in the opening film Tornado, departed.\nThe two actors were in the 1995 film Rob Roy, she as Mary McGregor, wife of Liam Neeson's Rob Roy, and he as the villainous Archibald Cunningham.\nAnd while Roth's abiding memories were of his war with the Highland midgie, Lange recalls a much more pleasant experience.\n\"It was such a marvellous time, up in the Highlands where I'd never spent time before and it was extraordinarily beautiful,\" she says.\n\"I had the whole family here and the kids had a whole life of their own going on.\n\"It was a very special time and I liked the film. Some locations and some projects you think, 'oh Christ why did I bother doing that?' and others you think 'that was something very special'.\"\nHer next projects will also focus on women. She's set to star in the film adaptation of Joan Didion's 2005 memoir The Year of Magical Thinking.\nAnd she's also keen to explore an extraordinary chapter in the life of the German actress Marlene Dietrich.\nIt focuses on the period when she moved to America and took US citizenship and the programme will reunite her with Feud and American Horror Story creator Ryan Murphy.", "url": "https://www.bbc.co.uk/news/articles/cdrx5n1ynreo"}