{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:43:03", "date_modify": "2025-04-26 07:43:03", "date_publish": "2025-02-26 18:34:09", "description": "At least 72 children died after being given a drug contaminated with HIV and viral hepatitis.", "filename": "news_articles_c0kg5mry1m1o_1745653383.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9c08/live/b7cca930-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg5mry1m1o_1745653383.html", "title": "Contaminated blood scandal: Former pupils face school trust in court", "title_page": "Contaminated blood scandal: Former pupils face school trust in court - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former pupils of a school where disabled children were infected with contaminated blood are seeking damages from its trust at the High Court.\nAt least 72 children died after being given a drug contaminated with HIV and viral hepatitis at Treloar's school in Hampshire in the 1970s and 1980s.\nLead claimant Gary Webster told the BBC: \"We trusted our doctors, we looked up to our doctors... we find it disgusting.\"\nThe men are hoping to win the right to pursue a claim from Treloar Trust, though the trust believes the government should pay.\nIn the mid-1970s when a new treatment for haemophilia became available, blood plasma used to make the drug was imported from overseas, most notably the US.\nBatches were widely contaminated with hepatitis A, B, C and later HIV.\nTreloar's, near Alton, once had a specialist NHS haemophilia centre on site.\nThe surviving pupils, known as the Treloar's Boys, have suffered life-long ill health and life-affecting consequences, including physical and psychological harm, their lawyers say.\nThe school was condemned in an inquiry into the UK-wide infected blood scandal last year.\nTreloar's Boys have applied for a group litigation order against the trust.\nMr Webster, who was at the school from 1975 to 1983 and is representing 36 former pupils, said: \"I was there for eight years and I was constantly - unbeknown to me at the time - used as a guinea pig, and this was without any parental consent… by doctors who weren't employed by the NHS but were actually employed by the Treloar Trust.\n\"That's why we believe that Treloar Trust should take part responsibility for this tragedy.\"\nAdrian Goodyear, who was a pupil from 1980 to 1989, added: \"What we're here for today is to get them to at least come to our side of the fence to confess... their role in this tragedy, because it is a scandal.\"\nHe said that \"thus far they've not really engaged with us in the way that we hoped they would\".", "url": "https://www.bbc.co.uk/news/articles/c0kg5mry1m1o"}