{"authors": ["Pamela Tickell", "www.facebook.com"], "date_download": "2025-04-26 06:38:11", "date_modify": "2025-04-26 06:38:11", "date_publish": "2025-02-26 06:21:30", "description": "Charlie Robert's step-father was not properly assessed for risk, a safeguarding review finds.", "filename": "news_articles_c3d8589kd94o_1745649491.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6a41/live/db3606e0-f37c-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d8589kd94o_1745649491.html", "title": "Authorities 'not curious enough' about Darlington boy killer", "title_page": "Authorities 'not curious enough' about Darlington boy killer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Authorities were not curious enough about a man who went on to murder his partner's toddler, a safeguarding review has found.\nChristopher Stockton, 38, killed 22-month-old Charlie Roberts at the boy's Darlington home in January 2024 by fatally shaking him.\nA review found police checks showed no indication Stockton presented any risk to the child but \"further exploration of his role in the family was missing\", while Charlie's mothers assertions about her boyfriend were \"not challenged\".\nThe Darlington Safeguarding Partnership said steps were being taken to learn from the review.\nStockton and Charlie's mum Paula Roberts, 41, started a relationship in early 2023.\nHe moved into her home just seven days before Charlie was fatally injured, a trial late last year heard.\nStockton had been in sole charge of Charlie for just 18 minutes before an ambulance was called for the toddler, who was later found to have had catastrophic bleeding in his brain.\nThe Local Child Safeguarding Practice Review (LCSPR) into Charlie's death was commissioned to help agencies and individuals learn lessons and improve the way they work, the Darlington Safeguarding Partnership said.\nSeveral recommendations were made including \"ensuring all men associated with the family [or] adult caregivers\" were \"fully considered\".\nDarlington Borough Council social workers knew about Stockton because of a statutory investigation into suspicious bruises on Charlie in the months before his death, \"but there was no engagement with him or understanding about him and his relationship with the children\", the review said.\nThe review added that was a \"poor decision\" and that there should have been \"greater curiosity about him\".", "url": "https://www.bbc.co.uk/news/articles/c3d8589kd94o"}