{"authors": ["Cormac Campbell", "www.facebook.com"], "date_download": "2025-04-26 04:18:07", "date_modify": "2025-04-26 04:18:07", "date_publish": "2025-03-04 06:41:19", "description": "The road would link the main A1/N1/M1 Belfast to Dublin road with the A2 Warrenpoint to Newry dual carriageway.", "filename": "news_articles_cx2ggjk7n23o_1745641087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a37b/live/79db5f20-f904-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2ggjk7n23o_1745641087.html", "title": "Newry: Will new road be 'key infrastructure' or 'insanity'?", "title_page": "Newry: Will new road be 'key infrastructure' or 'insanity'?  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some people say it will be a \"key piece of infrastructure\", while others call parts of the plans \"insanity\".\nNow a public consultation on the Newry Southern Relief Road has come to an end.\nThe road would link the main A1/N1/M1 Belfast to Dublin road with the A2 Warrenpoint to Newry dual carriageway.\nIf it goes ahead, the project is expected to cost between £110m and £130m, much of which is due to come from the Belfast Region City Deal (£93.4m, external).\nThose in favour of the road say it will reduce congestion in Newry city centre, stimulate the economy, and improve access to Warrenpoint port.\nBut opponents have raised concerns about a fixed bridge crossing Newry Ship Canal, while residents of the rural Flagstaff and Fathom areas do not want a major road sweeping through the countryside.\nMichael Savage from Newry Chamber of Commerce spoke to BBC News NI in the centre of Newry, standing by a stretch of road that perhaps best represents the rationale for the relief road.\nA junction there sees HGV traffic from Belfast, Dublin, and everywhere trying to make its way through the relatively narrow Kilmorey Street on its way to and from Warrenpoint port.\n\"From day one the chamber has been fundamentally behind the delivery of this very key piece of infrastructure for this region,\" Mr Savage said.\n\"We fully support the southern relief road, and we want it delivered as quickly as possible.\n\"It's about relieving the lungs of the people of Newry and removing thousands of HGV vehicles coming from Warrenpoint port out of the city centre and also creating great access for the development of our port to the eastern seaboard and the A1 corridor between Belfast and Dublin.\"\nMr Savage said it would take thousands of HGV movements each year out of the city centre.\nThe preferred route is around 2.5 miles (4km) long, but the geographical layout of Newry means it is far from straightforward.\nThat is because the Warrenpoint dual carriageway effectively runs flush with the shoreline on the County Down side of Carlingford Lough.\nTo get to the Belfast-Dublin road (on the Armagh side of the lough), the new route must rise quickly up the steep inclines of Flagstaff and Fathom, with a river and canal in between.\nAs a result, not everyone is happy with the plan.\nBrian Clelland, a member of the Newry 2020 campaign group, which was originally established to drive plans for a City Park, takes issue with the plan for a fixed bridge across the ship canal.\nHe said it would block the canal, which is nearly 300 years old and is the oldest working canal in Ireland.\n\"The Southern Relief Road in its current form will block that permanently, so they'll destroy access to Newry for tall ships and, in fact, most masted vessels,\" he said.\n\"It's also well known that the Dublin government is building the Narrow Water bridge just outside Warrenpoint, and the insanity of it is that they are spending millions to have a beautiful opening bridge that would allow tall ships up, but the Southern Relief Road that is being built by Stormont is building a fixed bridge that would block tall ships.\"\nThe new Infrastructure Minister Liz Kimmins is from Newry, and in the past she has spoken, external about her preference for a lifting bridge over Newry Canal as part of the project.\nA Department for Infrastructure spokesperson said: \"The minister will... consider responses as part of the consultation process, including whether or not to move forward to public inquiry.\"\nThey said Kimmins was unavailable for interview.", "url": "https://www.bbc.co.uk/news/articles/cx2ggjk7n23o"}