{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:50:03", "date_modify": "2025-04-26 06:50:03", "date_publish": "2025-03-01 07:59:37", "description": "The area says it is set for world-class performances as it takes its turn to be London's Borough of Culture.", "filename": "news_articles_cx2gg7qvnj8o_1745650203.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ad15/live/8e71f4a0-f501-11ef-9808-4d9b058d1a40.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gg7qvnj8o_1745650203.html", "title": "Wandsworth unveils Borough of Culture 2025 events", "title_page": "Wandsworth unveils Borough of Culture 2025 events - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wandsworth is set for \"world-class performances and grassroots creativity\" as it celebrates its turn as London's Borough of Culture.\nAmong the highlights include Clapham Grand's 125th anniversary celebrations and Liberty, a flagship festival celebrating deaf, disabled, and neurodivergent artists.\nThe scheme is part of a cultural policy from the mayor of London, and is supported by Arts Council England and the National Lottery Heritage Fund.\nCroydon was the previous London Borough of Culture and held a year of music and arts events from April 2023.\nThe council said that among the highlights of its events are Strictly Wandsworth on 26 April, which will bring together 200 dancers from 22 local organisations in an event created by Jeanefer Jean-Charles MBE, who was co-ordinated mass movement displays including for the London 2012 Olympic Games and Queen's Platinum Jubilee Pageant.\nIn June, Wandsworth Arts Fringe (WAF) will be showcasing new collaborations and focusing on accessibility, through grants supporting up to 30 projects and events in libraries, parks, and community hubs.\nWandsworth Heritage Festival will look at the borough's connection with the arts and offer a series of walks, talks, exhibitions, and performances in June and July such as folklore in the borough's flora and fauna, archive tours storytelling and craft workshops.\nLater in the year Urban Flow, a silk banner procession involving 100 performers and digital art, will take place on 13 September, as well as a food festival in Tooting.\nTo mark the Clapham Grand's 125th anniversary, a Palace of Varieties event will be held on 26 November, celebrating its history of variety and entertainment and exploring the history of queer culture in the borough.", "url": "https://www.bbc.co.uk/news/articles/cx2gg7qvnj8o"}