{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:43:48", "date_modify": "2025-05-19 14:43:48", "date_publish": "2015-02-14 01:23:41", "description": "Canadian police say they have foiled an imminent plot to carry out a mass shooting in the Halifax area and have made three arrests.", "filename": "news_world-us-canada-31467662_1747665828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81004000/jpg/_81004179_025863281-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31467662_1747665828.html", "title": "Canada Halifax: Police say they foiled shooting plot", "title_page": "Canada Halifax: Police say they foiled shooting plot - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Canadian police say they have foiled a plot to carry out a mass shooting in the Halifax area on Saturday.\nThree suspects were arrested and a fourth reportedly shot himself dead after police surrounded his home.\nAt least two suspects had intended \"to go to a public venue... with a goal of opening fire to kill citizens, and then themselves\", police said.\nJustice Minister Peter MacKay described those involved as \"a group of murderous misfits\".\n\"Based on what we know so far, it would have been devastating, mass casualties would have been a real possibility,\" he said.\n\"The attack does not appear to have been culturally motivated, therefore not linked to terrorism.\"\nBrian Brennan, commanding officer of the Nova Scotia Royal Canadian Mounted Police, said the plot had involved a 19-year-old man from the Halifax suburb of Timberlea and a 23-year-old woman from the US state of Illinois.\nThe two, he said, had had access to firearms.\nWhen police went to arrest the 19-year-old man he killed himself, a senior police official told AP news agency.\nA 20-year-old Canadian man was arrested along with the woman at Halifax Stanfield International Airport. The fourth suspect, a 17-year-old Canadian boy, was arrested at a house.\nThe roles of the latter two suspects was still to be determined by investigators, police said.", "url": "https://www.bbc.com/news/world-us-canada-31467662"}