{"authors": ["Chris Dearden", "www.facebook.com"], "date_download": "2025-04-26 03:49:24", "date_modify": "2025-04-26 03:49:24", "date_publish": "2025-03-05 13:38:52", "description": "Maria Rosanova Eftimova slipped while attempting to climb rocks with friends on 22 February.", "filename": "news_articles_ckgy5vv8y7eo_1745639364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c32b/live/6b9a2a70-f9bf-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgy5vv8y7eo_1745639364.html", "title": "Woman died climbing on mountain rocks - inquest", "title_page": "Tryfan: Woman died climbing on mountain rocks - inquest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 28-year-old woman died after falling about 65ft from Tryfan mountain in Eryri National Park, an inquest has heard.\nMaria Rosanova Eftimova, a structural civil engineer, from St Helens, Merseyside, slipped while attempting to climb rocks with friends on 22 February.\nCoroner Kate Roberston stated that despite rescue crews and paramedics attending the scene, Ms Eftimova died before she could be taken to hospital.\nIn a tribute, Victoria Critchley, said she was \"ambitious, bright and cherished, whose vibrant personality, energy and aura touched and uplifted all around her\".\nTryfan is one of the highest mountains in Eryri National Park – and is often described as a peak that marks the line between hiking and mountaineering and is difficult to navigate in a traditional manner, especially in poor weather.\nWith no marked footpaths to the summit, it requires using hands and scrambling skills to reach the top.\nIt was used as a training ground to test oxygen equipment and safety techniques before the first ever successful climb of Everest in 1953.\nChris Lloyd, chairman of Ogwen Valley Mountain Rescue Organisation, said people should \"check the weather forecast and make sure you are suitable equipped\" before venturing on the mountains.\nAt the opening of the inquest in Caernarfon on Wednesday, Ms Robertson said Ms Eftimova had attempted to reach a ledge for a handhold to lift herself up, but her heel slipped, which caused her to fall a \"considerable distance\".\nA post mortem examination showed that Ms Eftimova, who is originally from Sofia, in Bulgaria, had suffered severe head injuries, including a fractured skull.\nShe added: \"I send my sincere condolences to all Maria Eftimova's family and friends.\"\nThe inquest was adjourned to be continued at a future date.", "url": "https://www.bbc.co.uk/news/articles/ckgy5vv8y7eo"}