{"authors": ["Alastair Fee", "www.facebook.com"], "date_download": "2025-04-26 04:31:06", "date_modify": "2025-04-26 04:31:06", "date_publish": "2025-03-03 06:14:27", "description": "Lily Lambert, a call handler at South Central Ambulance Service, receives abuse every day.", "filename": "news_articles_c8711y8gxwpo_1745641866.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6e19/live/8fa51530-f5f8-11ef-9de2-8d109cf4aecf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8711y8gxwpo_1745641866.html", "title": "South Central Ambulance 999 call handler receives death threats", "title_page": "South Central Ambulance 999 call handler receives death threats - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An emergency call handler has revealed the abuse she receives from people she is trying to help, including threats to \"kill\" and \"stalk\" her.\nLily Lambert has worked for South Central Ambulance Service (SCAS), based in Otterbourne, Hampshire, for three years and said she faces vitriol from the public every day.\nViolence and abuse against paramedics and emergency call handlers is on the rise, the BBC recently found.\nThe ambulance service said staff were encouraged to report verbal assaults to the police.\nThe service covers Hampshire, Oxfordshire, Buckinghamshire and Berkshire.\nMs Lambert said it was her first job since leaving school, adding: \"People say they're going to come to my house and kill me, people saying they're going to stalk me, calling me all sorts of names that I can't repeat.\n\"Some shifts it will be every call... it does get to you.\"\nThere were almost 45,000 physical and verbal assaults recorded on ambulance frontline and operations staff across England between 2019 and 2023, recent figures revealed.\nGemma Robinson, head of emergency operations at SCAS, said they had a \"three strikes\" approach.\n\"We will ask people twice to stop being offensive, if they continue after the second warning we will terminate the call - which takes people to a recorded message explaining why,\" she said.\n\"We don't tolerate abuse but we have to understand that people aren't always in the best place when they're calling us.\"\nSCAS has not got an official record of how many of these calls are abusive, but recognises it is a problem.\nControl room staff receive training, which includes managing difficult calls.\nThey are also encouraged to have a debrief with their team leader, who can help decide if further support is needed.", "url": "https://www.bbc.co.uk/news/articles/c8711y8gxwpo"}