{"authors": ["Aurelia Foster", "www.facebook.com"], "date_download": "2025-04-26 06:35:59", "date_modify": "2025-04-26 06:35:59", "date_publish": "2025-02-27 06:06:56", "description": "Sir Sadiq Khan launches a growth plan to increase productivity and create jobs in London.", "filename": "news_articles_c1w0ey39ew0o_1745649359.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ddb8/live/88dcfeb0-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1w0ey39ew0o_1745649359.html", "title": "London Growth Plan: Mayor Sadiq Khan aims to boost capital's economy", "title_page": "London Growth Plan: Mayor Sadiq Khan aims to boost capital's economy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to \"turbocharge\" economic growth in the capital will create 150,000 jobs and make Londoners better off, according to the mayor of London.\nAlong with London Councils - a cross party group of local authority representatives - Sir Sadiq Khan is set to pledge to increase growth, which fell after Brexit, the Covid-19 pandemic and changes in working habits, as part of his London growth plan.\nIndustrial hubs in outer London, plans for rent-controlled key-worker homes and public transport upgrades, will be part of the plans, the mayor said.\nCity Hall's Conservatives said the mayor had so far \"suffocated\" economic ambition in London and that it took the figures in the plans with a \"pinch of salt\".\nAccording to the London Growth Plan, external, the first priority is to increase the growth productivity rate to 2% (from the current 0.12%) each year until 2035, providing an extra £27 bn in tax revenue for the Treasury.\nThis would be \"the key to higher wages, higher living standards and increased investment in public services\", the mayor's office said.\nUnder the plans, to be announced at Imperial College, 20% of Londoners on the lowest incomes will be 20% better off after their housing costs.\n\"This growth plan provides a golden opportunity to turbocharge growth and unlock London's full potential - for the benefit of all Londoners and the whole country,\" Sir Sadiq said.\nHarnessing sectors such as as AI, life sciences, robotics, clean tech, quantum computing, as well as the creative industries, will help to achieve this, the mayor added.\nThe proposals include:\nSupporting \"industrial innovation corridors\", such as WestTech Corridor, external, , externalspanning White City, Old Oak Common and Park Royal and the Thames Estuary\nA potential new fund to provide loans to high-growth small and medium-sized businesses\nA \"talent strategy\" to help create 150,000 high-quality jobs\nNew rent-controlled key worker homes to help London retain essential workforce\nWorking with central government to extend and upgrade the public transport network, including the Docklands Light Railway extension to Thamesmead, the Bakerloo line extension and the West London Orbital rail service\n£21m of additional funding for high streets and town centre regeneration this year\nThe mayor said: \"If our London growth plan materialises, it means the average Londoner will be £11000 better off in ten years' time.\n\"Also, the treasury gets an extra £27bn a year, which means more money for hospitals, for school and for our communities.\"\nLondon Councils said the plan \"sets out our ambitions to unleash growth in the industries of the future, deliver new housing and infrastructure... helping more people to get into work and get the skills they need to progress\".\nThe Federation of Small Businesses (FSB) welcomed the proposals, describing them as \"ambitious and upbeat\", while the group Business LDN said the plans \"rightly focus on unlocking the city's full potential\".\nHowever, Alessandro Georgiou, economic spokesperson for City Hall's Conservatives group on the London Assembly, dismissed the plans and criticised the mayor's financial strategy.\n\"It's rich for the mayor to suddenly be talking up hopes of growth in London when his party's budget has suffocated it so far.\n\"Labour's national insurance rise is hitting Londoners in their pocket, costing their jobs, and hammering businesses across our capital.\"\nCity Hall said it would also call for more government investment and for greater devolved powers as well as more freedom to fund the capital's priorities.\nThe pro-devolution think tank Centre for London said the plans were only possible with greater financial freedom and the ability to keep more money generated in the city.\nIts chief executive officer, Antonia Jennings, said: \"To be able to compete with the likes of Paris, New York, Tokyo and Hong Kong, we need greater fiscal devolution.\"\nMs Jennings added that while New York currently retained 50% of the tax revenues raised within the city, London kept just 7%.\n\"Not all decisions for local economies are best made in Whitehall - London's government must be given the fiscal tools to do the same.\"\nA Ministry for Housing, Communities and Local Government spokesperson said the government was \"committed to driving growth across the country, including London\".\n\"We welcome the mayor's proposals to drive economic growth and will continue working with the Greater London Authority on their long-term plans to increase prosperity in the capital.\"\nThe spokesperson added that the English Devolution White Paper, external sets out to remove \"any unnecessary or dated provisions\" and ensure any incoming legislation supported growth in the capital.", "url": "https://www.bbc.co.uk/news/articles/c1w0ey39ew0o"}