{"authors": ["Sharon Hartley and Rumeana Jahangir", "www.facebook.com"], "date_download": "2025-04-26 06:18:44", "date_modify": "2025-04-26 06:18:44", "date_publish": "2025-03-01 07:20:46", "description": "She says her experience has motivated her to switch from farming to training as a medical tattooist.", "filename": "news_articles_cj0qq93pd2qo_1745648324.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/885f/live/47c01330-f500-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0qq93pd2qo_1745648324.html", "title": "Inskip woman's cow accident inspires her to give medical tattoos", "title_page": "Inskip woman's cow accident inspires her to give medical tattoos  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who needed facial reconstruction after a cow jumped on her is now offering free medical tattoos to burns victims and breast cancer patients.\nDarcie Rowlandson, from Inskip in Lancashire, was 19 when she was struck by one of her herd during a thunderstorm in summer 2023.\nDespite concerns about how she would look, she said medics at Royal Preston Hospital \"did an amazing job of fixing my face\".\nShe told BBC Radio Lancashire that her experience inspired her to switch from farming to training as a medical tattooist.\nMs Rowlandson had previously bought and reared her own calves while working on a dairy farm as a teenager.\nBut it was while bringing one of them in from a thunderstorm that she tripped over, which \"scared the cow\", she said.\n\"I kept hold of it stupidly and it jumped over my face so I got facial scarring from a freak accident.\"\nThe injuries meant she required surgery during a three-day stay in hospital.\n\"In a weird way, it's kind of nice this accident has happened because I would never have even thought to do medical tattooing, because I didn't even know it was a thing.\"\nMedical tattoos are often used for patients who have had breast reconstruction and to camouflage scars.\nMs Rowlandson, now 20, offers free tattoos as part of her \"As Before\" salon service in Wilmslow and Blackpool where one of her clients, Becky, recently received treatment to cover up scars following a breast reduction.\n\"It's not like they're on show to anybody,\" Becky said.\n\"But occasionally it's quite nice to wear something a little more skimpy, so I don't like the scars showing out of the back of a swimsuit.\n\"As I get more confident in my body that I'm now getting used to, actually I think 'I don't like that scar, I now need to make a change to get my skin back to how it looked before I had the surgery'.\"\nShe said the medical tattoo boosted her \"mental confidence\", adding: \"Looking in the mirror, you can see whatever you want whether it's there or not.\n\"But mentally, it is under your clothes and if you know that it's what you want it to be, then you're much more confident outwardly.\"\nMs Rowlandson said her parents were proud of her work, adding: \"In a way I'm just so glad I've fallen into it.\n\"I am quite proud of how resilient I am and how I can change someone else's life, possibly in their own confidence.\"", "url": "https://www.bbc.co.uk/news/articles/cj0qq93pd2qo"}