{"authors": ["Joshua Askew", "www.facebook.com"], "date_download": "2025-04-26 03:56:48", "date_modify": "2025-04-26 03:56:48", "date_publish": "2025-03-04 14:54:36", "description": "The University Hospitals Sussex NHS Foundation Trust is under police investigation.", "filename": "news_articles_c05m74zp28vo_1745639808.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/40ce/live/81ae8970-f8f5-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c05m74zp28vo_1745639808.html", "title": "Sussex NHS Foundation Trust reduces waiting list by 18.5%", "title_page": "Sussex NHS Foundation Trust reduces waiting list by 18.5% - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An NHS trust covering parts of East Sussex and West Sussex said it has reduced its waiting list by 18.5%.\nThe University Hospitals Sussex NHS Trust said the number of \"people waiting for a planned hospital appointment, treatment or service\" fell from 149,000 to 121,500 in the 12 months to December 2024.\n\"Clearly, too many people are waiting too long to access hospital services,\" said chief executive Dr George Findlay, adding: \"I wish to apologise to everyone who continues to wait for treatment at one of our hospitals.\"\nBut he said it was important to \"acknowledge and commend the hard work and innovations of our teams in Sussex\".\nDr Findlay said hospital teams had been working evenings and weekends to see \"as many patients as safely and swiftly as possible\".\nThis meant the trust was seeing nearly a fifth more people in its hospitals than before the COVID pandemic, he continued.\nThe trust said it achieved the reduction by improving how waiting lists were managed and communication with patients.\nIt said it also worked differently with providers, helped more patients be seen in the community, increased activity and had more outpatient appointments.\nDr Findlay said he was \"exceptionally proud to work alongside so many compassionate, skilled and dedicated colleagues\".\nHe thanked them \"for everything they are doing to reduce waiting times and provide excellent care, day in, day out for our patients\".", "url": "https://www.bbc.co.uk/news/articles/c05m74zp28vo"}