{"authors": ["Aisha Iqbal", "www.facebook.com"], "date_download": "2025-04-26 07:53:30", "date_modify": "2025-04-26 07:53:30", "date_publish": "2025-02-25 13:59:37", "description": "City council says that people struggling with bills will have access to extra financial help.", "filename": "news_articles_c93kqqgv4zzo_1745654010.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8646/live/c0d19440-f36d-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kqqgv4zzo_1745654010.html", "title": "Bradford: Council tax 'hardship fund' launched", "title_page": "Bradford: Council tax 'hardship fund' launched - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Families in Bradford could receive a one-off grant to help offset a 10% increase in their council tax bills.\nThe money will come from a new £1.2m \"hardship fund\" created by Bradford Council following its announcement of the higher-than-average hike in local taxes.\nThe £30 boost for low income families would be applied automatically for those already receiving council tax support, with new claimants also eligible until the money runs out.\nSusan Hinchcliffe, leader of Bradford Council, said it would offer some \"crucial extra support\" for vulnerable families already affected by the cost of living crisis.\nThe local authority's decision-making executive will meet next week to rubber stamp the council tax increase.\nBradford Council - which escaped effective bankruptcy last year - has already received special permission from the government to allow it to raise its local levy by double the normal maximum of 4.99% to help ease its ongoing financial woes.\nThe new hardship fund could potentially help up to 40,000 households with £30 grants. Of those, 29,000 already qualify.\nFamilies living in Band A properties in Bradford - 40% of all homes in the district - will see their bills increase by £113.34 annually. The hardship grant effectively gives those eligible a 25% discount on that rise.\nHinchcliffe said: \"People in receipt of council tax relief are the most vulnerable to changes in income and we want to ease the burden on them of a council tax rise.\n\"No council takes the decision to raise council tax lightly as we know this will add to the cost of living for residents, but we are facing huge costs and demand for services, particularly social care for children and adults, and we have a responsibility to make sure the council's finances balance. It's cold comfort I know but, even with this increase, the council tax Bradford Council charges will still be below average nationally.\"\nEligible households will get a one-off £30 award automatically credited to their council tax account, and they don't have to apply.\nTo be eligible, you must already be getting rebates on your bills and be of working age as of March 31, 2025, for existing claimants.\nThe council says new claimants of working age who apply for the standard rebate will also be eligible for the one-off payment.\nThe authority is also putting £500,000 into more support services for welfare benefit and debt advice services over the next two years.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c93kqqgv4zzo"}