{"authors": ["Henri Astier", "www.facebook.com"], "date_download": "2025-04-26 04:22:21", "date_modify": "2025-04-26 04:22:21", "date_publish": "2025-03-03 14:13:36", "description": "Ex-Fifa head Sepp Blatter and French football great Michel Platini were cleared in 2022, but prosecutors appealed.", "filename": "news_articles_ce349pj3e5do_1745641341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fa49/live/f16d5e50-f830-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce349pj3e5do_1745641341.html", "title": "Sepp Blatter and Michel Platini back in Swiss court in Fifa fraud case", "title_page": "Sepp Blatter and Michel Platini back in Swiss court in Fifa fraud case - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Fifa president Sepp Blatter and French football legend Michel Platini are back in court in Switzerland to face accusations of fraud.\nIn 2022, the pair were acquitted in a trial over a payment of 2m Swiss francs (£1.6m) made to Platini and authorised by Blatter in 2011.\nBoth men denied wrongdoing and said the transfer was belated payment for Fifa advisory work by Platini, who formerly led European football's governing body Uefa.\nBut the Swiss federal prosecutor appealed against the decision. The new trial is expected to last until Thursday, with a verdict due on 25 March.\nThe pair appeared before an appeals court in Muttenz, near Basel, on Monday. Blatter, 88, reaffirmed that he was innocent.\n\"When you talk about falsehoods, lies and deception, that's not me. That didn't exist in my whole life,\" he told the court.\nA lawyer for Platini, 69, said the lower court that acquitted the pair in 2022 had been \"right to find that the disputed payment of 2m francs was lawful\".\nPlatini had an illustrious playing career and is a three-time winner of the Ballon d'Or - Europe's highest individual football award.\nHe captained France to victory at the 1984 European Championship and won the 1985 European Cup with Juventus. He went on to coach the French national team and became Uefa president in 2007.\nIn 2015, prosecutors accused the pair of deceiving Fifa about payments made to Platini.\nIn his testimony at the first trial, Blatter said that he had asked Platini to work as his adviser in 1998. He added that at the time, Fifa could not afford the 1m Swiss francs annual fee requested by Platini.\nThey instead settled on partial payment, with the outstanding balance to be paid at a later date. Platini said during the trial: \"I trusted the president, and knew he would pay me one day.\"\nHe stopped working for Fifa in 2002 but initially did not pursue the payment as he told the court he had not needed the money at the time, and - according to Blatter - Fifa was \"broke\". In January 2011, however, Platini felt he was in a position to send an invoice and the money was paid after approval by Blatter.\nFollowing an investigation launched in 2015, Swiss prosecutors accused Blatter and Platini of forgery and fraud.\nAlso in 2015, Fifa suspended both men from football for ethics breaches - originally for eight years, although their exclusions were later reduced.\nIn 2022, Switzerland's federal criminal court in Bellinzona cleared the two after accepting their account of a \"gentlemen's agreement\" for the payment.\nSwiss businessman and sports administrator Blatter joined Fifa in 1975, became general secretary in 1981 and then president of world football's governing body in 1998.\nHe remained in the role for 17 years until resigning amid corruption investigations. Platini later withdrew his own candidacy for president.", "url": "https://www.bbc.co.uk/news/articles/ce349pj3e5do"}