{"authors": ["Daniel Holland", "www.facebook.com"], "date_download": "2025-04-26 06:26:42", "date_modify": "2025-04-26 06:26:42", "date_publish": "2025-02-28 20:22:03", "description": "Gateshead Council leader Martin Gannon says he should have been more clear about the checks.", "filename": "news_articles_ce34v1j7y0ko_1745648802.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d4e/live/568765e0-f608-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce34v1j7y0ko_1745648802.html", "title": "Gateshead flyover checks were 'almost weekly'", "title_page": "Gateshead flyover checks were 'almost weekly' - council leader - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council leader has said he should have been \"more clear\" about checks to a flyover shut on safety grounds.\nThe A167 structure in Gateshead has been closed to traffic since mid-December due to concerns about the structural integrity of two of its supporting pillars.\nGateshead Council leader Martin Gannon had claimed in January it had been inspected \"on a weekly basis\" due to its age, but the local authority admitted it was \"not always\" that frequent.\nGannon has now said: \"I should have said 'almost weekly' and should probably have been clear about what I meant by inspection.\"\nThe council told the Local Democracy Reporting Service: \"There have been periods when inspection work has taken place every week, sometimes several days in a week.\n\"There have also been weeks when no inspection work has taken place, as our structural engineers were satisfied that the structure was stable and they were effectively managing any issues arising.\"\nThe authority added that \"numerous daily inspections were undertaken during periods of works\" and a structural engineer carried out further \"regular, routine inspections of the structure, to ensure its structural integrity, and to update the council on any potential problems where action needed to be taken\".\nRegarding his claims about \"weekly\" inspections of the flyover, Gannon said he had been aware \"for years, as has anyone who drives around Gateshead, that there have been issues about the concrete falling off it and spalling\".\n\"As a consequence of that I knew it had to be regularly checked,\" he said.\n\"Whether it was weekly or fortnightly, it was not a programme – it was constant.\n\"Each one of those surveys came back and were reporting on the structural integrity, not the spalling of concrete, but the structural integrity of the structure.\n\"The assurances from those on every occasion, although we had a limited lifespan, was that there was no need to take any immediate interventions.\"\nThe costs and timescales of the flyover's demolition programme are yet to be confirmed, though it is hoped there will be an update in time for the next cabinet meeting on 18 March.", "url": "https://www.bbc.co.uk/news/articles/ce34v1j7y0ko"}