{"authors": ["Jaroslav Lukiv", "www.facebook.com"], "date_download": "2025-04-26 04:34:03", "date_modify": "2025-04-26 04:34:03", "date_publish": "2025-03-03 01:04:49", "description": "They say the move violates the ceasefire deal - Israel says it acted because Hamas was stealing aid supplies.", "filename": "news_articles_c70e6rye9nxo_1745642043.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8318/live/c8df1ad0-f7c4-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70e6rye9nxo_1745642043.html", "title": "Arab states and UN condemn Gaza aid blockade by Israel", "title_page": "Arab states and UN condemn Gaza aid blockade by Israel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Several Arab states and the UN have condemned Israel for blocking the entry of all humanitarian aid into the Gaza Strip.\nEgypt and Qatar said the Israeli move on Sunday violated a ceasefire deal, while UN humanitarian chief Tom Fletcher described it as \"alarming\".\nIsraeli Prime Minister Benjamin Netanyahu said his country acted because Hamas was stealing the supplies and using them \"to finance its terror machine\".\nHe also accused the Palestinian group of rejecting a US proposal to extend the ceasefire in Gaza, after it expired on Saturday. Israel said it had approved the proposal.\nA Hamas spokesman said Israel's blockade was \"cheap blackmail\" and a \"coup\" against the ceasefire agreement.\nIn a statement on Sunday, Qatar's foreign ministry said it \"strongly condemns\" the Israeli decision, describing it as \"a clear violation of the ceasefire agreement\" and \"international humanitarian law\".\nIn Egypt, the foreign ministry accused Israel of using starvation as \"a weapon against the Palestinian people\", the AFP news agency reported.\nBoth Qatar and Egypt helped to mediate the ceasefire agreement in Gaza.\nMeanwhile, Saudi Arabia expressed its \"condemnation and denunciation\" of the Israeli aid blockade, the foreign ministry said.\nTom Fletcher, UN Under-Secretary-General for Humanitarian Affairs, wrote in a post on X: \"International humanitarian law is clear: We must be allowed access to deliver vital lifesaving aid.\"\nNetanyahu said Israel had decided to act \"because Hamas steals the supplies and prevents the people of Gaza from getting them.\n\"It uses these supplies to finance its terror machine, which is aimed directly at Israel and our civilians, and this we cannot accept.\"\nHamas has previously denied stealing humanitarian aid in Gaza.\nNetanyahu also said Hamas was refusing to accept a temporary extension of the ceasefire proposed by US President Donald Trump's envoy, Steve Witkoff.\nThe first phase of the ceasefire came into force on 19 January and expired at midnight on Saturday.\nNegotiations on phase two, meant to lead to a permanent ceasefire, the release of all remaining living hostages and the withdrawal of Israeli forces from Gaza, were due to have started weeks ago - but have barely begun.\nThere are believed to be 24 hostages alive, with another 35 presumed to be dead.\nPhase three is meant to result in the return of all remaining bodies of dead hostages and the reconstruction of Gaza, which is expected to take years.\nHamas has previously said it will not agree to any extension of phase one without guarantees from the mediators that phase two will eventually take place.\nAs the first phase of the deal expired on Saturday, Netanyahu's office said Israel had agreed to Witkoff's proposal for the ceasefire to continue for about six weeks during the Muslim holy month of Ramadan and Jewish Passover periods.\nIf, at the end of this period, negotiations reached a dead end, Israel would reserve the right to go back to war.\nWitkoff has not made his proposal public. According to Israel, it would begin with the release of half of all the remaining living and dead hostages.\nWitkoff is said by Israel to have proposed the temporary extension after becoming convinced that more time was needed to try to bridge the differences between Israel and Hamas on conditions for ending the war.", "url": "https://www.bbc.co.uk/news/articles/c70e6rye9nxo"}