{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:40:15", "date_modify": "2025-04-26 07:40:15", "date_publish": "2025-02-27 12:29:07", "description": "The college's principal says he is \"committed to minimising any impact on the curriculum\".", "filename": "news_articles_cd92q5pq1y2o_1745653215.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4943/live/d89b7400-f52b-11ef-9621-af4ff1a2bf4c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92q5pq1y2o_1745653215.html", "title": "Up to 50 jobs at Truro and Penwith College could be at risk", "title_page": "Up to 50 jobs at Truro and Penwith College could be at risk - union - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Up to 50 jobs at a college group in Cornwall could be at risk due to \"significant financial challenges\", a teaching union has said.\nIn an email to parents and carers, Truro and Penwith College principal Martin Tucker said the college was facing \"financial pressures\" as a result of rising costs and a \"strategic review of operations\" was under way.\nAlison Chapman, from the University and College Union, said papers she had received from the college \"suggests there may be up to 50 jobs on the line, perhaps more\".\nIn response, Mr Tucker said he could not give an exact number, but 50 jobs \"is an approximate figure I can give, but we will be updating our staff on a regular basis\".\nMs Chapman questioned why there would be possible redundancies when the college's reserves had grown from £38m to £59m over the last five years, but went from a surplus of £200,000 in 2021 to a deficit of more than £4m.\nMr Tucker said the college, which has campuses in Truro, Penzance and Bodmin, currently has £6m reserves but they could not be used to remove the deficit budget and cuts were needed.\nHe said: \"These efficiencies will take place right across the college and every level of teaching, lecturing, management and support.\"\nHe said the college would not reduce what it delivered but would \"deliver it more efficiently\" to return to an operational surplus within the next two years.\nIn an email to parents and carers Mr Tucker said he was \"committed to minimising any impact on the curriculum\".\nThe principal said he had met teaching unions earlier this week and was set to have another meeting next week.", "url": "https://www.bbc.co.uk/news/articles/cd92q5pq1y2o"}