{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 04:41:34", "date_modify": "2025-04-26 04:41:34", "date_publish": "2025-03-02 07:07:07", "description": "Border collie cross Bella \"can recognise when a young person is feeling a bit sad\", her owner says.", "filename": "news_articles_c93kq2ngp6lo_1745642494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/efd7/live/768349a0-f5c6-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kq2ngp6lo_1745642494.html", "title": "Bath farm's therapy dog helps 3,000 struggling teens", "title_page": "Bath farm's therapy dog helps 3,000 struggling teens - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For six years, therapy dog Bella has been befriending teenagers at a farm that offers five-day stays to help them cope with difficulties at school.\nThe border collie cross has now helped 3,000 teenagers at charity-run Hill House Farm in Box, near Bath, having started at just 12 weeks old.\nOwner Julie Tonks, the farm's therapeutic lead, said Bella \"can recognise when a young person is not feeling so great or a bit sad\".\n\"She'll just go and put herself next to that young person, and it might just be a paw on a leg, or putting her head on their lap,\" Ms Tonks said.\n\"I feel she gives so much and sometimes she can give what nobody else can give to them,\" she added.\nThe farm is one of several run by the charity Jamie's Farm.\nThe teenagers invited to stay may be struggling in school with behaviour, attendance, confidence or mental health issues.\nThey are given the chance to help with the running of the farm while also receiving therapeutic support.\nMs Tonks said Bella is around young people for most of their time at the farm, but it is during the therapeutic work – often in the form of \"walk and talk\" sessions – where her companionship skills are most visible.\n\"She's quite playful, but she's also quite intuitive as well,\" Ms Tonks said.\nAmani Salim, 18, from west London, was in Year 10 and struggling to engage with school when she met Ms Tonks and Bella at Hill House Farm.\nNow studying for further qualification in sport and playing football with the Queens Park Rangers women's reserve squad, she said she had noticed \"a big change in herself\" after the farm stay.\n\"I really didn't want to go,\" she said, \"and when I got there, I was just really overwhelmed by the number of people just looking at me.\"", "url": "https://www.bbc.co.uk/news/articles/c93kq2ngp6lo"}