{"authors": ["David McKenna and Patrycja Boryka", "www.facebook.com"], "date_download": "2025-04-26 04:40:49", "date_modify": "2025-04-26 04:40:49", "date_publish": "2025-03-02 07:13:55", "description": "Polish migrants explain why they came to Lincolnshire in search of a better life.", "filename": "news_articles_cly37mexj5lo_1745642449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f410/live/52d674e0-f752-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly37mexj5lo_1745642449.html", "title": "Migrant stories: From Poland to Lincolnshire for a better life", "title_page": "Migrant stories: From Poland to Lincolnshire for a better life - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"My home is where my family is, and the people that I love,\" says Maciej Michalski, who came to the UK in 2006.\nOriginally from Bydgoszcz, a city in northern Poland, he stayed with his sister in Sleaford after losing a well-paid job in security.\n\"I was really scared,\" he admitted. \"I didn't know what I would find here, but after a few days I had a job at a recycling company.\nAfter working for about four months, Mr Michalski said he had earned enough money to rent his own house and buy a trailer, so that he could bring his family and their possessions \"over for a better life\".\nHe added: \"I had a small child and my wife couldn't go to work to help. In Poland, just one person working isn't enough - unless you get help, or live with your parents.\n\"The Polish economy at the time, it was hard to find something good.\"\nHe said that despite the upheaval, there were many benefits to living in the UK, including being able to afford the rent on a house, run a car and enjoy days out as a family.\n\"That was impossible in Poland,\" he added.\nGregory Lesiak, 40, who is now a HGV technician, originally came over on his own in 2007.\n\"I never planned to emigrate from Poland – I came over here for two weeks and the second week my brother-in-law asked if I could help him out, and that's how I started my first job at a recycling plant.\"\nIt was the same place where Mr Michalski still works and the two men became friends.\nMr Lesiak said for him the decision to stay in the UK was really easy as he earned more money in a week than he could in a whole month in Poland.\n\"I thought 'hold on a second' there is a different world out there.\"\nMr Lesiak, who is originally from Tychy in southern Poland, met his partner Magdalena during a trip back home, and eventually asked her to come and live with him in Lincolnshire.\n\"I was excited, so I said yes,\" Magdalena added. \"He is a good man.\"\nAnd despite being late to pick her up from the airport, they are now happily married with two children and living in Sleaford.", "url": "https://www.bbc.co.uk/news/articles/cly37mexj5lo"}