{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:51:32", "date_modify": "2025-05-19 14:51:32", "date_publish": "2015-03-04 00:45:51", "description": "The Colombian authorities arrest the captain of a Chinese ship on its way to Cuba after finding undeclared gunpowder and cannon shells aboard.", "filename": "news_world-latin-america-31723157_1747666292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81388000/jpg/_81388501_5f8344f8-c13c-4314-8364-9241a36d6e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-latin-america-31723157_1747666292.html", "title": "Colombia detains Cuba-bound Chinese ship carrying arms", "title_page": "Colombia detains Cuba-bound Chinese ship carrying arms - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colombian officials have detained the captain of a Chinese ship bound for Cuba for illegally carrying explosives and other arms.\nThe ship was stopped over the weekend in the Caribbean port of Cartagena, the attorney general's office said.\nAbout 100 tonnes of gunpowder, almost three million detonators and some 3,000 cannon shells were found on board the Da Dan Xia, officials said.\nBut according to the ship's records, it was carrying grain products.\nWu Hong, the Chinese captain, would be charged with weapons trafficking, he added.\nChinese foreign ministry spokeswoman Hua Chunying said the captain had not violated any international rules.\n\"It is completely normal military trade co-operation,\" she said.\nMs Hua said China was \"communicating with the parties on this matter\".\nThe Da Dan Xia is operated by China's largest shipping company, Cosco Shipping.\nIt was impounded and searched for 48 hours before the order to arrest the captain was given.\nColombian media reported that the ship was also carrying pipes used in mining and had stopped in Cartagena to unload them.\nAccording to the reports, counter-narcotics police searched it after they had received a tip-off about the munitions on board.\nThe ship was due to make another stop in the Colombian port of Barranquilla before sailing on to Cuba, its itinerary suggested.\nThe Cuban authorities have not yet commented.\nThe incident comes almost two years after a North Korean crew was detained in Panama for illegally transporting war material from Cuba to North Korea through the Panama canal.\nMost of the crew and the ship were allowed to return to North Korea six months later after its owners agreed to pay a fine.\nThe ship's captain, the first officer and the political officer were later absolved of a charge of endangering public security.", "url": "https://www.bbc.com/news/world-latin-america-31723157"}