{"authors": ["Brian Farmer", "www.facebook.com"], "date_download": "2025-04-26 07:28:05", "date_modify": "2025-04-26 07:28:05", "date_publish": "2025-02-27 19:36:18", "description": "A judge bars pro-Palestinian campaigners from disrupting a Cambridge University degree ceremony.", "filename": "news_articles_cn4yyy2nvxro_1745652485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1717/live/08d82130-f4d8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn4yyy2nvxro_1745652485.html", "title": "Cambridge University earns win in Gaza protest High Court fight", "title_page": "Cambridge University earns win in Gaza protest High Court fight - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A High Court judge has barred pro-Palestinian campaigners from disrupting a Cambridge University graduation ceremony.\nMr Justice Fordham imposed an injunction covering a ceremony due to take place on Saturday, following an application by lawyers representing the university.\nThey had raised longer-term concerns about ceremonies being disrupted, but failed to persuaded the judge to impose a wider injunction.\nA union had condemned the university legal action as a \"shameful\" attack on democratic rights.\nProtest camps were set up in Cambridge following the outbreak of conflict in Gaza, between Israel and Hamas, in late 2023.\nPro-Palestinian campaigners had alleged that Cambridge University had not acted on previous agreements to review investments in relation to the arms industry.\nThe university previously said it was committed to reviewing its \"approach to responsible investment\".\nLawyers told Mr Justice Fordham in London how protests had disrupted a number of degree ceremonies.\nThey asked him to make an order covering four university premises in Cambridge, which would last until 2030.\nBarrister Yasser Vanderman, who led the university's legal team, said some \"defendants\" formed part of a \"well organised\" group with \"strong and committed\" views on the conflict.\nThe university wanted \"injunctive relief\" to \"restrain threatened acts of trespass and nuisance\", he said.\nMr Vanderman asked for an injunction to last five years - with annual reviews - arguing that given the \"long-standing nature\" of the Gaza conflict, such a time-frame was reasonable.\nBut the judge said he was not prepared to make any \"final\" order - or any order lasting five years.\nHe granted an injunction focused on a ceremony due to take place at Senate House, external, on Trinity Street, on Saturday.\nThe judge said only a limited order, which would last until 23:00 GMT on Saturday, was justified. He said he aimed to reconsider the case in the near future.\nNo protesters were at Thursday's hearing in London and none were represented by lawyers. The university took the legal action against \"persons unknown\".", "url": "https://www.bbc.co.uk/news/articles/cn4yyy2nvxro"}