{"authors": ["Oscar Edwards", "www.facebook.com"], "date_download": "2025-04-26 04:06:15", "date_modify": "2025-04-26 04:06:15", "date_publish": "2025-03-03 16:56:14", "description": "A pre-recorded was published on social media video to mark St David's Day in Wales.", "filename": "news_articles_cy0dkjpe3k7o_1745640375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0923/live/f927f390-f84d-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy0dkjpe3k7o_1745640375.html", "title": "Prince William's Welsh should be better, says language professor", "title_page": "Prince William's Welsh should be better, says language professor - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Cardiff University language professor says he expected Prince William to do more than \"read for a few seconds from an autocue\" during his St David's Day Speech.\nDr Dylan Foster Evans, head of the School of Welsh, described Prince William's Welsh as \"halting\", meaning slow and hesitant, during an appearance on the BBC Radio 4 Today programme.\nHe had pre-recorded a social media video to mark the day Wales's patron saint is honoured and to \"celebrate Wales – its history, culture and incredible people\".\nIt is understood the prince has been using the language-learning app Duolingo to learn the language, but is not currently having formal lessons.\nPrince William's speech followed a trip to Wales with his wife, Catherine, the Princess of Wales.\nThe pair baked Welsh cakes and spoke to people in Pontypridd about how they were coping following the recent flooding.\nIn his message, translated to English, he said: \"Hello. Today, on St David's Day, we come together to celebrate Wales – its history, its culture, and its incredible people.\n\"From its breath-taking landscapes to its language, Wales continues to inspire.\n\"Today, we will celebrate everything that is magical about Wales.\n\"To the people of Wales and everybody around the world, Happy St David's Day.\"\nDr Evans said many people would have been \"pleased and impressed\" to hear William speaking Welsh, but added that the prince has had enough time to prepare for the role.\n\"It's been known [for a long time] that he will be the Prince of Wales. Welsh does have an official status in Wales since 2011 so maybe we should expect a bit more,\" he said.\nThe prince has previously revealed that he was using the Duolingo app to lean some conversational Welsh.\nThis is in contrast to his father, King Charles, who had formal lessons in the Welsh language whilst studying at Aberystwyth University.\nThe lessons took place ahead of his investiture as the Prince of Wales in July that year at Caernarfon Castle.\nWilliam has not had an investiture since his father announced he had created his eldest son and heir as Prince of Wales during his first televised address as monarch, the day after the death of Queen Elizabeth II in 2022.", "url": "https://www.bbc.co.uk/news/articles/cy0dkjpe3k7o"}