{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:31:34", "date_modify": "2025-04-26 06:31:34", "date_publish": "2025-02-27 08:42:49", "description": "Although he did not become an actor until his 30s, Hackman became one of Hollywood's most bankable stars.", "filename": "news_articles_cjm9ndw9xeeo_1745649094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9315/live/9c90f070-6f61-11ef-9274-898a88078355.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjm9ndw9xeeo_1745649094.html", "title": "Gene Hackman: One of Hollywood's greatest 'tough guys'", "title_page": "Actor Gene Hackman: One of Hollywood's greatest 'tough guys' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gene Hackman, who has died aged 95, started his acting career later in life but became one of Hollywood's most bankable stars.\nHackman was found dead along with his wife Betsy Arakawa and their dog at his home in New Mexico, US. No cause of death was given, but police said the situation was \"suspicious enough\" to merit investigation.\nHackman had an illustrious five-decade career as an actor.\nHe won two Oscars and was nominated for another three, playing violent men, yet was equally at home in comedy.\nHe was once described as having the face of a truck driver, and was suited to character as well as leading roles. Having shot to fame in Bonnie and Clyde at the end of the 60s, he was rarely out of work - in films like The French Connection, Mississippi Burning and Superman.\nBut he retired from acting in 2004 on the advice of his heart doctor, and rarely gave an interview again - opting for a quiet life in New Mexico with his second wife, Betsy.\nEugene Allen Hackman was born in San Bernardino, California, in 1930 and led a peripatetic childhood.\nHis parents divorced, and he was palmed off on various relatives until settling with his maternal grandmother in Danville, Illinois.\nHis father left the family when Hackman was still in his teens.\n\"When young Gene was 13, his father abandoned the family, driving away while his son was out playing in the street,\" reported The New York Times' late writer Robert Berkvist, external.\nHe went on: \"As his father passed by, Mr Hackman recalled years later, he gave him a wave of the hand.\n\"'I hadn't realised how much one small gesture can mean,' he once said. 'Maybe that's why I became an actor.'\"\nHackman's mother died in 1962 - she burned to death in 1962, after setting fire to her mattress with a cigarette while drunk.\nAs a teenager, Hackman was keen to branch out and lied about his age to join the Marines at the age of 16, serving nearly five years.\nHe was stationed in China where he worked as a radio operator, which led to later work as a disc jockey.\n\"I have trouble with direction,\" he once said of his short military career, \"because I have trouble with authority. I was not a good Marine.\"\nAfter briefly studying journalism and TV production at the University of Illinois, Hackman left to enrol at the Pasadena Playhouse in California in the 60s, where he and classmate Dustin Hoffman were voted the \"least likely to succeed\".\nUndeterred by this vote of no confidence, both actors decamped to New York where they shared a flat with another aspiring thespian, Robert Duvall.\nHackman managed to pick up a few minor stage roles, supplementing his income by taking on a variety of odd jobs.\nHe would often relate the story of how he was spotted by a former drill sergeant outside a New York hotel while he was working as a doorman.\nRecognising his former charge, the sergeant exclaimed that he knew Hackman would never amount to anything.\nThere was also a stint as an overnight cleaner in New York's Chrysler Building, something Hackman later described as the worst job he ever had.\nThere were parts in light comedies both off and on Broadway, which led first to minor television roles and then to some film work.\nHis first movie role was in the 1964 film Lilith, starring Warren Beatty.\nImpressed by his performance, Beatty cast Hackman as his brother, Buck Barrow, in Bonnie and Clyde in 1967.\nHackman received an Oscar nomination for best supporting actor and was nominated again for I Never Sang for My Father in 1970.\nBut then came The French Connection.\nIt was the part that made him.\nHe played the part of the maverick narcotics agent Jimmy \"Popeye\" Doyle who pursues a French drugs dealer, most notably in a famous sequence on the New York subway.\nIt brought him an Academy Award for best actor, and he reprised the role in The French Connection II in 1975.\nGene Hackman never looked back.\nWhether it was for critically-acclaimed movies such as The Conversation and Night Moves, or popular blockbusters like The Poseidon Adventure, he became a reliable box-office draw.\nOne of the great screen tough guys, he effortlessly switched to comedy in Young Frankenstein and played the sleazy supervillain Lex Luthor in Superman and Superman II.\nHackman was so upset about the producers' treatment of the director, Richard Donner, that he refused to take a part in the next sequel, although he later appeared in Superman IV: The Quest for Peace.\nThe 80s was another successful decade, notably for his appearance in Mississippi Burning, for which he was again nominated for a best actor Academy Award.\nIt was a powerful performance as an FBI agent, tasked, along with a rookie colleague, with investigating the racist murder of black civil rights workers in the early 60s.\nDirector Alan Parker referred to Hackman as \" a very intuitive and instinctive actor\".\nAnother Oscar for best supporting actor came in 1993 for Unforgiven - a Clint Eastwood Western - in which he played a sadistic sheriff, Bill Daggett.\nThe film also won best picture. The awards came three years after Hackman required bypass surgery following a heart attack.\nThere was a leading role as Edward \"Brill\" Lyle, the computer genius in the 1998 film, Enemy of the State, where he starred alongside Will Smith in a frightening tale of government surveillance.\nHackman's hard-edged screen persona made him ideal for the intelligent but ruthless characters in film adaptations of John Grisham novels - such as The Firm and Runaway Jury - in which, for the first time, he and former flatmate Dustin Hoffman appeared on screen together.\nHis versatility, and the luxury of being able able to choose scripts, led in 2001 to another great performance, in the offbeat comedy The Royal Tenenbaums, which drew rave reviews.\nBut he chose to bow out from acting in the political satire, Welcome to Mooseport in 2004.\nExplaining his decision, he told Reuters, external he didn't want to risk going out on a sour note.\n\"The business for me is very stressful. The compromises that you have to make in films are just part of the beast,\" he said, \"and it had gotten to a point where I just didn't feel like I wanted to do it any more.\"\nA decade later, he did briefly come out of retirement to narrate two documentaries about the history of the US Marine Corps - but otherwise stuck to his plan.\nAfter quitting acting, he gained a new reputation as a writer of historical fiction.\nHe co-wrote four books with Daniel Lenihan, Wake of the Perdido Star (1999), Justice for None (2004), Vermillion (2004) and Escape from Andersonville (2008).\nHe went on to deliver two solo writing efforts, Payback at Morning Peak (2011) and Pursuit (2013).\nHe spoke about why he had taken to his new job.\n\"I like the loneliness of [writing], actually. It's similar in some ways to acting, but it's more private and I feel like I have more control over what I'm trying to say and do,\" he told Reuters.\n\"There's always a compromise in acting and in film, you work with so many people and everyone has an opinion (laughs).\n\"But with the books, it's just Dan and I and our opinions. I don't know that I like it better than acting, it's just different. I find it relaxing and comforting.\"\nHackman married Faye Maltese in 1956. The couple had three children but divorced in 1986.\nFive years later he married Betsy Arakawa, who ran an upmarket furniture store in Santa Fe, New Mexico.\nGene Hackman made more than 80 films, and still managed to become both a proficient golfer and respected painter.\nHe was also a mean performer on the racetrack, driving Formula Ford cars and taking part in the 1983 Daytona Endurance Race.\nThroughout his career, he gave few interviews and eschewed the celebrity lifestyle.\n\"If you look at yourself as a star,\" he said, \"you've already lost something in the portrayal of any human being.\"", "url": "https://www.bbc.co.uk/news/articles/cjm9ndw9xeeo"}