{"authors": ["Julian O'Neill", "www.facebook.com"], "date_download": "2025-04-26 07:54:16", "date_modify": "2025-04-26 07:54:16", "date_publish": "2025-02-25 13:37:23", "description": "The UK and Irish governments are to appoint an independent expert to see if\nthere is merit to the idea.", "filename": "news_articles_clyzeed04w7o_1745654056.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/584b/live/d62c7420-f39c-11ef-9171-13a46257ded9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyzeed04w7o_1745654056.html", "title": "Disbandment talks could legitimise illegal groups, warns Long", "title_page": "Disbandment talks could legitimise illegal groups, warns Long - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Government plans to explore formal engagement with paramilitary groups could give them \"legitimacy in our communities\", Justice Minister Naomi Long has warned.\nLong said the move is \"absolutely flawed\", adding that engaging and platforming paramilitary groups \"could undo a lot of good work\".\nIt comes after the UK and Irish governments are to appoint an independent expert to assess whether there is merit and support for the idea which will help bring about the disbandment of paramilitary organisations.\nSecretary of State Hilary Benn said it was not \"the start of a formal process itself\" or an alternative to \"the existing law enforcement and criminal justice measures\".\n\"I also want to be clear that no financial offer will be made to paramilitary groups or to the individuals involved in them in exchange for an end to violence and ongoing harms,\" Benn said.\nThe proposal was suggested by the Independent Reporting Commission (IRC), which monitors police and government efforts to tackle paramilitarism.\nThe UK government said in 2023 the idea was under serious consideration.\nSpeaking at a press conference , Naomi Long said the plans by the government could give credibility to organisations that her department and others were working to \"de-legitimise\".\n\"So to engage with those people and to give them a platform and a credibility that, quite frankly, we would not offer to any other criminal gang seems completely contrary to what we're trying to achieve,\" she said.\nIn an interview with BBC Radio Ulster's Evening Extra programme, Long said these organisations have had \"many\" opportunities over 27 years to choose criminality or change their direction completely, and many of them \"transitioned into organised crime gangs\".\n\"Why would we give these organisations a legitimacy in our communities when what we have been working at persistently over recent years is to get to the point where we are at today?\n\"Where 79% of people in our communities recognise that these people are criminals.\"\nDuring the press conference, Long said: \"The only conversation to be had with paramilitaries at this time is to tell them to exit the stage.\n\"That should have happened a long time ago and I believe that's the only conversation to be had.\"\nMonica McWilliams from the Independent Reporting Commission (IRC) told BBC Radio Ulster's Evening Extra programme that unless an independent expert makes the assessment \"then we will be exactly in the same place in 10 years' time\".\nMs McWilliams said she \"can understand\" how Long \"thinks that this won't work\", but added that \"doing nothing isn't an option\".\n\"Our understanding is that there is an appetite amongst Republicans and Loyalists to move off the scene.\"\nMs McWilliams said the scoping exercise \"is going to be evidence based, the groups themselves are going to have to volunteer no one is going to impose it\".\nShe added that in the IRC report there is seven different criteria, and groups will be judged on that, as part of the independent expert's work.\nMs McWilliams said a report will be then be produced by the expert for the UK and Irish governments in a year's time.\n\"We will be in a much better place in a years time knowing exactly who is doing what and the 'clear blue water' that Naomi talks about will then be in place.\"\nThe IRC's latest report was published on Tuesday - it described the appointment as \"a vital step in the journey towards completing the goal of ending paramilitarism in Northern Ireland once and for all\".\nMultiple republican and loyalist organisations remain active almost 30 years after the Good Friday Agreement.\nDissident republican groups, such as the New IRA, who oppose the peace deal, continue to target police officers.\nAlso, groups aligned to the Irish National Liberation Army (INLA), the Ulster Volunteer Force (UVF) and Ulster Defence Association (UDA) are heavily involved in criminality.", "url": "https://www.bbc.co.uk/news/articles/clyzeed04w7o"}