{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:04:30", "date_modify": "2025-04-26 07:04:30", "date_publish": "2025-02-28 06:57:40", "description": "There can be no excuse for using racist words, Assistant Chief Constable Matt Boyle says.", "filename": "news_articles_cewkk8k7w7zo_1745651070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5ce5/live/9cde9f10-f557-11ef-b7da-bf3b74fc6fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkk8k7w7zo_1745651070.html", "title": "Greater Manchester Police officer sacked for racist remark", "title_page": "Greater Manchester Police officer sacked for racist remark - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police officer who made an \"appalling\" racist remark about a colleague has been sacked.\nPC Scott Dixon, 35, used the racist term last summer in Bury police station when officers were discussing an ongoing professional standards investigation into alleged discriminatory behaviour, Greater Manchester Police (GMP) said.\nThe force said it was reported by a colleague and referred to the Independent Office for Police Conduct (IOPC), which investigated and recommended there were grounds for gross misconduct.\nGMP found the case of gross misconduct was proven at a misconduct hearing and Mr Dixon was dismissed and barred from policing.\nMr Dixon argued the comment was not used in a malicious manner and was made while he was tired from successive extended night shifts.\nAssistant Chief Constable Matt Boyle said: \"What PC Dixon said was appalling, which he accepts.\n\"There can be no excuse for using racist words.\"\nHe said the officer's reaction to the investigation was \"totally at odds\" with the force's stance and Mr Dixon had \"decided to display the behaviour we're so keenly rooting out\".\nSince adopting the Angiolini recommendations, external a year ago, discriminatory language and behaviour would not be tolerated, Mr Boyle said.\nLady Elish Angiolini's recommendations, following her inquiry into the police failures that led to the abduction, rape and murder of Sarah Everard by serving officer Wayne Couzens in 2021, included stamping out sexist, misogynistic and racist \"banter\" in every police force.", "url": "https://www.bbc.co.uk/news/articles/cewkk8k7w7zo"}