{"authors": ["Andrew Dawkins", "www.facebook.com"], "date_download": "2025-04-26 06:40:49", "date_modify": "2025-04-26 06:40:49", "date_publish": "2025-03-02 13:37:47", "description": "The auction takes place at an event featuring entertainment inspired by BBC drama This Town.", "filename": "news_articles_cg701g22l3no_1745649649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3592/live/aa5856b0-f75d-11ef-8fce-3183a71a7f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg701g22l3no_1745649649.html", "title": "Signed Ozzy Osbourne guitar raises £15k for Acorns hospice", "title_page": "Signed Ozzy Osbourne guitar raises £15k for Acorns hospice - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An electric guitar signed by rock legend Ozzy Osbourne has fetched £15,000 in an auction at a dinner for charity.\nThe 2024 Gibson SG went under the hammer at the event, which raised £179,570 on the night for Acorns Children's Hospice.\nThe Specials singer Neville Staple headlined an evening of entertainment at the ICC in Birmingham, inspired by BBC drama This Town.\nThe electric guitar donated by Osbourne was also signed by artists who performed at the Black Sabbath frontman's Rock and Roll Hall of Fame induction ceremony, including Jack Black, Chad Smith of the Red Hot Chili Peppers and Billy Idol.\nOsbourne and Black Sabbath are reuniting to play a one-off fundraising concert in the city on 5 July.\nAcorns is set to benefit, alongside fellow charities Cure Parkinson's and the Birmingham Children's Hospital.\nThe hospice, with bases in Birmingham, Walsall and Worcester, is supported by Aston Villa, and Osbourne has been a lifelong fan of the club.\nIn the past year, the charity has cared for more than 780 children across the West Midlands and supported over 1,000 families.\nIts dinner event on Friday featured recreated sets from the drama by Steven Knight, which was set in the West Midlands during the 1980s.\nThe evening included special appearances from Knight and some of the show's cast, including Levi Brown, Ben Rose and Eve Austin.\nAcorns said money raised in its This Town Gala Dinner would help it to continue its \"life-changing care for children with life limiting and life-threatening conditions across the West Midlands and support for their families\".", "url": "https://www.bbc.co.uk/news/articles/cg701g22l3no"}