{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:07", "date_modify": "2025-05-19 15:32:07", "date_publish": "2015-02-26 13:18:22", "description": "A former Syrian doctor admits having a hoard of explosive ingredients and instructions on how to prepare bombs in Edinburgh.", "filename": "news_uk-scotland-edinburgh-east-fife-31641497_1747668727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81260000/jpg/_81260210_faris_alkhori.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-edinburgh-east-fife-31641497_1747668727.html", "title": "Man found with bomb-making equipment at Edinburgh flats", "title_page": "Man found with bomb-making equipment at Edinburgh flats - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A former Syrian doctor has admitted having a hoard of explosive ingredients and instructions on how to prepare bombs in Edinburgh.\nFaris al-Khori, 62, had chemicals, ball bearings, bolt, nuts and a bag of toxic beans which can be used to produce the poison Ricin.\nThe haul was found after firefighters attended a 999 call over a Muirhouse tower block rubbish chute fire.\nMr Al-Khori was remanded in custody ahead of sentencing next month.\nAfter the blaze was extinguished, fire crews forced entry to the flats to check no-one was inside but when they entered a property where Al-Khori was a tenant they found items that gave them \"cause for concern\".\nFirefighters discovered mustard jars containing white powder and one marked \"weed killer\".\nAl-Khori had a small quantity of a highly-volatile explosive which the forensic explosives laboratory refused to take as it was so dangerous.\nThe High Court in Edinburgh heard a bomb scene manager was requested along with chemical, biological, radiological and nuclear advisors and the building was evacuated.\nA search was carried out at a further block in Leith where al-Khori lived with his wife and a further haul of material was recovered. A further evacuation was later carried out at the block which was sealed off.\nAl-Khori admitted the items belonged to him and said acetone that was recovered was used to clean carpets and peroxide found was for clearing up after pigeons.\nHe said a quantity of fertiliser was used for plants on the balcony, although there were none there when police searched the premises.\nHis wife said he carried out \"wee tests\" and bought items from the internet retail giant Amazon.", "url": "https://www.bbc.com/news/uk-scotland-edinburgh-east-fife-31641497"}