{"authors": ["Laura Kuenssberg", "www.facebook.com"], "date_download": "2025-04-26 04:34:01", "date_modify": "2025-04-26 04:34:01", "date_publish": "2025-03-03 02:34:46", "description": "The Ukrainian president is standing firm after his Oval Office clash with Donald Trump, says the BBC's Laura Kuenssberg.", "filename": "news_articles_c0rz178el8go_1745642041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9814/live/ee4eeed0-f805-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rz178el8go_1745642041.html", "title": "Zelensky bruised but upbeat after diplomatic whirlwind", "title_page": "Zelensky bruised but upbeat after diplomatic whirlwind - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Bruised but motivated,\" was how one of Volodymyr Zelensky's entourage described how they had been feeling, as a small group of journalists crammed into what felt like an even smaller room at Stansted Airport.\nThe British state had done its best to give the Ukrainian president \"all bells and whistles\" when he arrived in the UK for a summit with 18 world leaders after his dressing down by Donald Trump and JD Vance on Friday night, a government source told me.\nHe shared an embrace with Sir Keir Starmer outside No 10, where he was greeted with spontaneously cheering crowds, and met with King Charles for tea.\nBut it was telling that in the 90 minutes before his plane's wheels went up as he heads back home, Zelensky wanted to go on the record to make his arguments to the world - this time speaking only in Ukrainian - to make sure he was not misunderstood.\nHaving been slammed in the White House, then feted in the UK, his mood, in public at least, was not downhearted.\n\"If we don't keep our spirits up, we're letting everyone down,\" he said.\nHe made positive noises about Sir Keir and French President Emmanuel Macron's plan to grab hold of the plans for peace before presenting them to the US, for Europe to up its game, developing its own more convincing security guarantees.\nZelensky told me he would be prepared to give Donald Trump one of his demands - to sign the minerals deal that would give the US access to some of Ukraine's resources.\nBeyond that, despite all the pressure of a three-year war, under all the demands from the White House which, fairly or not, has the power to protect or abandon his country, on Sunday night Zelensky stood firm.\nHe told us it was wrong at this stage to discuss giving up territory Russia has captured, and it was too early to be \"talking about lines\", which the prime minister had mentioned earlier.\nHe would not apologise to Trump or express regret for anything that happened in the Oval Office, which at the moment, the US president's camp is repeatedly calling for.\nEven the boss of Nato called for Zelensky to find a way to reset his relationship with the US leader.\nYet in the stuffy room at Stansted, there was not much in Zelensky's tone that suggested he was interested in making nice.\nHe said he had travelled for hours to get to the White House - his visit was a mark of respect. He also said he would never \"insult anybody\" and the conversation as it erupted had not been a positive for anyone.\nZelensky chose his words very carefully. He tried to an extent to avoid a post-mortem of what went on. He was not rude about Trump - he barely mentioned him by name - and suggested tensions would pass.\nIf you watched the full horror of what happened in the Oval Office you may well not blame Zelensky for feeling it's simply not for him to say sorry.\nIf you listen to him talk about what has happened to his country, you can understand why it feels so impossible at this stage for him to acknowledge compromises might have to come to end the war.\nWatching him in person talk about the violence and the suffering that has been unleashed, you sense his total disbelief that anyone might not see the world his way, where Russia's aggression means Putin must not be spared punishment, and his people should be protected at all costs.\nBut the reality? Neither Zelensky nor any Western leader so far has persuaded Trump to adopt that moral clarity on this war. And even if it's painful, without a willingness to compromise, it's hard to see an end to this war.\nZelensky is though, a master communicator - genuine, doubtless, but also a performer by trade.\n\"Our freedoms and values are not for sale,\" a message of no surrender Zelensky wanted to communicate, along with a willingness to sign the minerals deal.\nHe again expressed his thanks for the backing of the US and other countries. But don't forget right now, for all of the encounters we have with the leaders involved in public, there are so many more between them and their teams behind closed doors.\nJust when our conversation was coming to an end, a suggestion that Macron and Sir Keir were proposing a month-long truce as part of their plan for peace reached my phone.\nDid President Zelensky know and would he agree such a deal, I asked.\n\"I am aware of everything,\" he joked, getting a laugh in the room, then offering handshakes and photos on his way out to the plane.\nHe may have wanted to have had the last word at the end of a dramatic and difficult weekend. But the conversation about this conflict has many weeks, if not many months to run.", "url": "https://www.bbc.co.uk/news/articles/c0rz178el8go"}