{"authors": ["Joe Tidy & Tom Singleton", "www.facebook.com"], "date_download": "2025-04-26 08:06:24", "date_modify": "2025-04-26 08:06:24", "date_publish": "2025-02-26 14:43:55", "description": "ByBit is offering financial rewards to anyone who can spot criminals attempting to launder the stolen crypto.", "filename": "news_articles_ckgdy5e3neko_1745654784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/07d4/live/d4e1d0d0-f44e-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgdy5e3neko_1745654784.html", "title": "Crypto sleuths join hunt for $1.5bn stolen in biggest ever heist", "title_page": "Crypto sleuths join hunt for $1.5bn stolen in biggest ever heist - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A company which fell victim to what's thought to be the world's biggest ever theft is seeking to recover some of its losses by crowdsourcing online bounty hunters.\nLast week, hackers believed to be from North Korea's notorious Lazarus Group stole $1.46bn (£1.1bn) of cryptocurrency from ByBit, a crypto trading platform.\nThe criminals are trying to rapidly cash out the hoard through a complex online money laundering process.\nByBit is now offering cash rewards to anyone who spots and prevents them from cashing out.\n\"Join us on war against Lazarus\" the company's CEO Ben Zhou posted online with a link to a new website, external offering a bounty to anyone who can help.\nCryptocurrencies are stored in public wallets anyone can look up so it's possible to follow the money as the criminals split it into smaller chunks and send it through various channels to obscure its origins.\nThe new website has a live leader board showing companies and individuals who have successfully located some of the coins.\nThe bounty scheme gives 5% of the sum identified to individuals who successfully persuade a company that has control of the funds to freeze the money.\nIt's also awarding 5% to the companies that take action.\nThe website is already displaying millions of dollars in payments to successful crypto sleuths.\n\"We have assigned a team to dedicate to maintain and update this website, we will not stop until Lazarus or bad actors in the industry is eliminated,\" Mr Zhou said.\nCrypto investigation firm Elliptic described it as a \"really positive innovation.\"\n\"There are a lot of very talented blockchain investigators out there who will now be motivated to track down these stolen funds, and to help to seize them,\" said Tom Robinson, from Elliptic.\nHowever Louise Abbott, crypto fraud partner at Keystone Law, suggested the heist would still \"negatively impact the perception of trust\" in what she said was already a \"volatile\" industry.\n\"If such a hack can occur on this scale in the world's second largest exchange, it can certainly happen again,\" she said.", "url": "https://www.bbc.co.uk/news/articles/ckgdy5e3neko"}