{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:55:55", "date_modify": "2025-04-26 07:55:55", "date_publish": "2025-02-25 12:26:09", "description": "The move follows calls for its scope to be widened to include Crown Office decisions not to prosecute anyone.", "filename": "news_articles_c5y922jd8w1o_1745654155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0273/live/78b72cb0-f36d-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y922jd8w1o_1745654155.html", "title": "No change to Sheku Bayoh death inquiry remit", "title_page": "No change to Sheku Bayoh death inquiry remit - Forbes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The remit of the Sheku Bayoh inquiry will not be extended to include Crown Office decisions not to prosecute anyone, the deputy first minister has confirmed.\nKate Forbes said she had considered a request from Mr Bayoh's family to extend the terms of reference but ruled it would not be in the public interest - a decision his family called a \"cowardly betrayal\".\nThe 31-year-old died on 3 May 2015 after being restrained by six police officers on Hayfield Road in Kirkcaldy, Fife.\nThe inquiry is examining the circumstances of Mr Bayoh's death in police custody, the subsequent investigation and whether race was a factor.\nBut the deputy first minster, who expressed her \"deepest condolences\" to Mr Bayoh's relatives, turned down the submission.\nShe said: \"The inquiry's terms of reference were announced in May 2020, and I have decided it is not in the public interest to extend the remit almost five years later and after evidential hearings have concluded.\n\"I hope that it is now possible for the chair to deliver his independent findings and recommendations as soon as possible.\"\nMr Anwar criticised the decision, saying Forbes should \"hang her head in shame\" over it.\nHe added: \"The deputy first minister claims she was conscious of the family's wish to see the decisions and actions of all justice agencies involved in this case fully scrutinised.\n\"If that really was the case, then why did she not her extend the terms of reference, rather than caving into pressure by her fellow cabinet minister the Solicitor General and Police Scotland, both of whom have vested interests in ensuring the real truth never emerges.\"\nForbes emphasised that a public inquiry was not permitted to determine or rule on civil or criminal liability.\nShe added: \"I am confident that the terms of reference, as announced in 2020, are sufficiently broad to allow the chair to present a substantial report with detailed findings and recommendations – including on the investigation and the extent to which Mr Bayoh's actual or perceived race was a factor.\"\nThe inquiry was announced in November 2019 and began a year later. It has cost more than £20m so far.\nThe chair of the inquiry, Lord Bracadale, has pledged to complete his final report as soon as possible.\nHe said: \"Scottish ministers have decided not to extend the terms of reference for the inquiry, rejecting Mr Bayoh's families' request.\n\"I recognise that this decision will disappoint Mr Bayoh's families.\n\"They are at the heart of this inquiry, and I want to reassure them that the existing terms of reference have been thoroughly examined over 122 days of evidential hearings.\"\nThe inquiry will now work to confirm the timescales for closing submissions, which were postponed pending the deputy first minster's decision.", "url": "https://www.bbc.co.uk/news/articles/c5y922jd8w1o"}