{"authors": ["Shivani Chaudhari", "www.facebook.com"], "date_download": "2025-04-26 03:46:39", "date_modify": "2025-04-26 03:46:39", "date_publish": "2025-03-05 05:35:32", "description": "Race director Andrew Martin says he will be posting the correct ribbons to all finishers soon.", "filename": "news_articles_cx2enn06276o_1745639199.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1eab/live/58653b70-f91a-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2enn06276o_1745639199.html", "title": "Chelmsford Half-Marathon organiser sorry over medals mix-up", "title_page": "Chelmsford Half-Marathon organiser sorry over medals mix-up - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The organiser of a half-marathon has apologised and offered to replace finishers' medals after their ribbons were printed with the wrong year.\nThousands of runners took part in the Chelmsford Half-Marathon in Essex on Sunday, but received medals with ribbons marked \"2024 Finisher\", as first reported by Essex Live., external\nRace director Andrew Martin said it was down to \"a silly error on my behalf which I will never make again\".\nOne runner posted a picture of his medal on social media, writing, \"They had one job to do!\" while another person joked, \"Jeez. How slow are you?\"\nAnother commenter said: \"It's funny and novel. The important thing is the event gets better every year.\"\nMr Martin said the event had gone well, with 1,820 places selling in 24 hours.\nBut he said: \"We had the medal mess-up as well, which is completely my fault - I hold my hands up.\n\"[It was a] genuine human error on my part. It was just the ribbon.\"\nHe emailed runners acknowledging the \"massive blunder\", explaining he had ordered the medals for the event halfway through 2024 but had given the wrong year.\n\"When I checked the medals four weeks ago and shared a photo of the medal on socials, I did not spot the wrong date on the ribbon,\" he said.\nHe said he would place an order for the correct ribbons and post them out to all 2,350 finishers.\nMr Martin said this would cost between £3,000 and £3,500, mainly due to postage.\nApart from the medals mix-up, he said the event had been a great success with thousands of pounds raised for charity.\nHe said there was an \"amazing turn-out for the event and it is a fantastic event for the local economy\".", "url": "https://www.bbc.co.uk/news/articles/cx2enn06276o"}