{"authors": ["Grace Wood", "www.facebook.com"], "date_download": "2025-04-26 06:49:43", "date_modify": "2025-04-26 06:49:43", "date_publish": "2025-03-01 09:07:14", "description": "Joseph Rowntree's legacy lives on in city where his factory was, 100 years after his death.", "filename": "news_articles_c93nnkvkl7wo_1745650183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e884/live/c4e8e490-f50a-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93nnkvkl7wo_1745650183.html", "title": "How chocolate entrepreneur's values shaped York", "title_page": "How chocolate entrepreneur's values shaped York - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From Fruit Pastilles to parks, chocolate entrepreneur and philanthropist Joseph Rowntree, who died 100 years ago this week, has an enduring legacy.\nIn York, the Rowntree name has been given to a park, theatre, caravan site and school but the story began in Pavement in a flat above a grocer's shop.\nBorn to Joseph (senior) and Sarah Rowntree in 1836, Joseph went to Bootham School before becoming an apprentice in his father's grocer's shop.\nHis brother Henry Isaac began the confectionary company, which Joseph took over when Henry died in 1883, aged 45.\nUnder Joseph's management the business began to make a profit and by 1898 it was selling internationally and operating sugar and cocoa estates in Dominica and in Jamaica.\nToday, the educational charity the Rowntree Society has acknowledged how the firm benefited from slavery and forced labour in its global supply chains.\nIn 1902 the family began building New Earswick, a model village for the workers at their new factory complex on the outskirts of the city.\nBy 1923, it employed more than 7,000 people in York.\nFollowing this, three trusts were set up: The Joseph Rowntree Foundation, The Joseph Rowntree Charitable Trust and the Joseph Rowntree Reform Trust.\nThe three organisations still exist today, continuing Rowntree's work campaigning and researching into poverty, housing conditions, education and political reform.\nExecutive director of the Rowntree Society Nick Smith says the city would be \"a very different place without that legacy\".\n\"There's so much you wouldn't know has a Rowntree connection.\n\"He was an absolute pioneer in ethical business practices and it's really difficult to have this distinction between what he did at the factory at the Rowntree company and what he did outside, because as far as Joseph was concerned, it was all part of the same project.\"\nRowntree's factory provided medical support to workers, including doctors, dentists, psychologists and social workers.\n\"We've got a document from 1916 that talks about what they do in the factory and if someone didn't turn up for work for a few days in a row they would send one of these social workers out to visit their home and to find out if there were reasons why they weren't turning up and what the company could do to help them.\n\"Sometimes that might be a loan of money or even a grant to help them with the situation or put them in touch with the medical staff at the factory,\" he says.\nThey also provided workers with pension schemes, sporting facilities and recreational activities.\nInspired by his Quaker faith, Rowntree was deeply concerned with poverty and believed the solution was for employers to provide better pay and conditions for their workers, says Mr Smith.\n\"He was really concerned with finding the solutions to poverty and inequality. He wanted to know what the root causes were.\n\"There's a very famous quote he said about the soup kitchen that was set up by his father: 'The soup kitchen in York never has difficulty in obtaining adequate financial aid but an inquiry into the extent and causes of poverty would enlist little support.' And so that's what he was really pushing for.\"\nHis son Seebohm continued the work by undertaking a poverty study of York.\n\"One of the key takeaways from that was that the people are in poverty, not due to some moral failing, but because they're not paid enough,\" says Mr Smith.\n\"A lot of the welfare state that got built in this country was influenced directly from the work that Joseph and his son Seebohm were doing.\n\"It does feel that kind of gig economy we have now and some of those working conditions go against what the Rowntrees were arguing, campaigning for and doing.\n\"They didn't just talk about it or campaign for it. They did it and then they would go to business conferences and explain what they were doing in their factory.\"", "url": "https://www.bbc.co.uk/news/articles/c93nnkvkl7wo"}