{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:50:50", "date_modify": "2025-04-26 03:50:50", "date_publish": "2025-03-05 12:23:05", "description": "Stuart Harding committed sex crimes against three women and two children at locations in Orkney.", "filename": "news_articles_c981w6ejpk7o_1745639450.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/974d/live/860c9a10-f9be-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981w6ejpk7o_1745639450.html", "title": "'Manipulative' Orkney sex offender jailed for 15 years", "title_page": "'Manipulative' Orkney sex offender jailed for 15 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"manipulative\" serial sex offender has been jailed for 15 years for a campaign of abuse involving women and girls in Orkney.\nStuart Harding, 35, committed sex crimes against three women and two children.\nHarding, of Birsay, denied a series of charges during an earlier trial at the High Court in Edinburgh, but was found guilty of 12 offences, including five or rape and two of attempted rape.\nJudge Lord Summers said he had been convicted of a series of serious sexual crimes.\nHarding began his offending in 2012 when he assaulted and raped a woman at a property in Kirkwall.\nHe went on to subject a second woman to rapes in 2015. Harding attacked the third woman in 2016.\nHe sexually assaulted and repeatedly tried to rape a 12-year-old schoolgirl at a car park near a beach.\nHarding also provided another girl, who was aged 15, with alcohol and had sex with the underage victim.\nAdvocate depute Catriona MacLeod, prosecuting, told jurors during Harding's trial that there was \"clear and compelling evidence\" of his guilt.\nDefence solicitor advocate Iain McSporran KC told the court that Harding continued to deny the offences.\nHe said: \"He very firmly believes he has suffered a miscarriage of justice.\"\nHarding, who followed the sentencing through a TV link from prison, was told that he would also be placed on the sex offenders register for an indefinite period.", "url": "https://www.bbc.co.uk/news/articles/c981w6ejpk7o"}