{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:44", "date_modify": "2025-05-19 15:30:44", "date_publish": "2015-01-30 06:29:23", "description": "Northern Ireland Secretary of State Theresa Villiers is due to chair a meeting of Stormont party leaders as part of the process for implementing the deal reached just before Christmas.", "filename": "news_uk-northern-ireland-31045864_1747668644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80658000/jpg/_80658269_villierstheresa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31045864_1747668644.html", "title": "Stormont House Agreement: Theresa Villiers to meet party leaders", "title_page": "Stormont House Agreement: Theresa Villiers to meet party leaders - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland Secretary of State Theresa Villiers will chair a meeting of Stormont party leaders later on implementing the Stormont House deal.\nThe five main parties reached broad agreement on 23 December on a number of key issues.\nIt followed 12 weeks of discussion between the British and Irish governments.\nMs Villiers said she was encouraged by the progress made so far in putting the Stormont House Agreement into practice.\n\"I think it's going well,\" she said.\n\"The agreement was a big step forward for Northern Ireland but everyone accepts that the important thing is implementing it.\n\"The executive is pressing ahead with its side of the deal.\n\"It's particularly welcome that they've agreed a final budget, I know that they're working very hard on getting the assembly legislation on welfare back up and running.\n\"We in the UK government are pressing ahead with our corporation tax devolution bill and we're both, on both sides, working together on matters like getting new structures set up on the past.\"", "url": "https://www.bbc.com/news/uk-northern-ireland-31045864"}