{"authors": ["David Wilson", "www.facebook.com"], "date_download": "2025-04-26 03:48:45", "date_modify": "2025-04-26 03:48:45", "date_publish": "2025-03-05 14:27:20", "description": "The future of the 188-year-old building has been the focus of much debate since its closure in 2016.", "filename": "news_articles_cvg1e9lvd91o_1745639325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/82cf/live/aab8ade0-f9c8-11ef-9f72-45b1d71715b1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1e9lvd91o_1745639325.html", "title": "Austins: Stormont funds purchase of Derry department store", "title_page": "Austins: Stormont funds purchase of Derry department store - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former department store in Londonderry that traded for more than 180 years before its closure is to be bought and redeveloped with more than £1m of government funding.\nAustins closed in 2016 after going into liquidation.\nThe business began in 1830 when Thomas Austin came to Derry, opening a drapery shop in the corner of the Diamond.\nCommunities Minister Gordon Lyons said a grant of £1.2m from his department would allow Derry's Inner City Trust to complete the purchase of the building.\n\"The investment of £1.2m is the first step in the regeneration of this iconic building located at the heart of the Historic Conservation Area,\" Lyons said.\nThe future of the 188-year-old building has been the focus of much debate since its closure.\nIn November 2014 the listed building was sold to the City Hotel Group. The receiver then sold the trading side of the business.\nMore than 50 workers lost their jobs when it closed in 2016.\nIn 2023 a taskforce was set up by Derry City and Strabane District Council to work with the owners to safeguard the buildings future.\nThe Inner City Trust works to inject commercial and social life into Derry's city centre.\nRev Robert Miller, chair of the trust, said the funding announcement marked a significant step forward in the rescue and revitalisation of one of the city's most iconic buildings.\n\"This restoration will not only breathe new life into an important historic building but will also strengthen the Department for Communities' Public Realm Scheme and the transformative ambitions of the Derry City and Strabane District Council's City Deal,\" he said.\n\"It sends a clear message of confidence to other investors that our city is a place of progress, innovation and opportunity.\"\nDerry's built heritage, the trust chair said, was \"a cornerstone of our identity\".\nSDLP councillor John Boyle, a member of the council's taskforce, said: \"It will be an enormous undertaking to breathe life back into the Austin's building, but I am confident that the Inner City Trust, with their track record, are well placed to take the next steps to achieve that goal.\"", "url": "https://www.bbc.co.uk/news/articles/cvg1e9lvd91o"}