{"authors": ["Phil Corrigan", "www.facebook.com"], "date_download": "2025-04-26 04:18:31", "date_modify": "2025-04-26 04:18:31", "date_publish": "2025-03-04 06:28:24", "description": "Hanley residents fear the licence would exacerbate anti-social behaviour around the area.", "filename": "news_articles_c4ge71pvgy1o_1745641111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/31bb/live/4f45dac0-f868-11ef-b078-a3b33258a20b.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ge71pvgy1o_1745641111.html", "title": "Hanley residents object to supermarket's alcohol licence bid", "title_page": "Hanley residents object to supermarket's alcohol licence bid - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People living near a new convenience store say they fear existing anti-social behaviour will increase in their area if the supermarket is granted an alcohol licence.\nOwner Harem Mohamed Amin is applying for a licence for Hanley Supermarket, in Stoke-on-Trent, to sell alcohol between 06:00 and 23:00, seven days a week.\nResidents' objections detail how the area, around Lichfield Street, Hanley, is already plagued with drinkers who cause problems and fear an alcohol licence would make things worse.\nIn his application, Mr Amin said he would install CCTV cameras and train staff to mitigate any risk.\nBut 88-year-old June Turner, who lives nearby, said a shop entry near her home is already used as a \"drinking den\" and a \"public convenience\".\nIn her objection, she wrote: \"How much sleep will us residents get if you allow the application to go through?\n\"Cars will be stopping virtually outside my front door, the noise and disruption will be unbearable for the residents of this quiet street.\n\"We already have to endure people using the entry next to me as a public convenience, what will it be like if you allow them to serve alcohol until 11pm each evening?\"", "url": "https://www.bbc.co.uk/news/articles/c4ge71pvgy1o"}