{"authors": ["Emily Hudson", "www.facebook.com"], "date_download": "2025-04-26 03:52:51", "date_modify": "2025-04-26 03:52:51", "date_publish": "2025-03-03 09:50:45", "description": "A £10,000 library opens at Mason Moor Primary School after backing from the National Literacy Trust.", "filename": "news_articles_cvg55wjxx3po_1745639571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bdcb/live/344b4170-f5ce-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg55wjxx3po_1745639571.html", "title": "Southampton school celebrates new library amid reading 'crisis'", "title_page": "Southampton school celebrates new library amid reading 'crisis' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A £10,000 library has opened at a school amid warnings of a \"national crisis\" in reading levels from the National Literacy Trust.\nThe charity is working to open libraries in every primary school in the country after it found one-in-seven schools don't have one, and in deprived areas it's one-in-four.\nMason Moor Primary School in Southampton has benefitted from investment by the trust to create a new library space.\nHeadteacher Faye Bauck said it's at the \"heart of a school\", so it's walked through and used every day, every lunchtime and after school by children and parents.\n\"We live and breathe books,\" she added.\nCharlie is one of the pupils who said the old space was \"squished\" and there was no room to read but added that the new library was \"organised and spacious\".\nThe school is now considering signing up to another scheme, Schoolreaders, where volunteers come in and hear children read a book of their choice.\nOne of the areas the scheme is most successful is on the Isle of Wight, where 60 volunteers are signed up, visiting nearly two thirds of primary schools.\nAdults spend time listening to children on a one-to-one basis, working on pronunciation and comprehension of the words.\nDawn Haig-Thomas, the co-ordinator of the island team, said too many children were leaving Island primary schools not at the recommended reading level: \"It will impact every area of their life if they can't read timetables or government forms or job applications.\n\"But the good news is [that]10 minutes twice a week, with an adult helping them, can really turn things around.\n\"We've seen children who couldn't read at all enjoying a whole book six months later.\"", "url": "https://www.bbc.co.uk/news/articles/cvg55wjxx3po"}