{"authors": ["Gemma Sherlock", "www.facebook.com"], "date_download": "2025-04-26 07:06:44", "date_modify": "2025-04-26 07:06:44", "date_publish": "2025-02-28 06:13:39", "description": "Founders of a new Blackburn mosque says support from the community has been \"overwhelming\".", "filename": "news_articles_cz03l5er87go_1745651204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1ce0/live/3b6df5a0-f4fd-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz03l5er87go_1745651204.html", "title": "Blackburn mosque with museum and community hub 'a dream come true'", "title_page": "Blackburn mosque with museum and community hub 'a dream come true' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family behind a new mosque which also houses a museum have said it is \"a dream come true\" to open after a major fundraising effort.\nAl-Buraq Masjid and community hub has opened its doors in Blackburn, Lancashire.\nGenerations of the Zabier family have led the project, which has been seven years in the making.\nTabarik Zabier, 44, said he hoped it would \"unite people in peace and harmony\" and it was open to all of the community, regardless of religious backgrounds.\nHe added: \"The last seven years have been gruelling, they have been very hard, there have been many different challenges, financially and with the building, but equally it has been an absolute pleasure.\n\"To see the gratitude on my father's face and to finally welcome this to the community is just fantastic\".\nThe project to build the mosque off Devonport Road, began in 2018 but the build was halted due to the coronavirus pandemic.\nThe Zabier family, along with friends and community members, began a fundraising campaign called Team Buraq which included cycling challenges and walks to Mount Snowdon.\nMore than 22 Islamic artefacts, with some pieces dating back hundreds of years ago, are featured in the Islamic Museum inside the mosque.\n\"This is a first of its kind so we are very excited that we have this opportunity for people to see these artefacts,\" added Tabarik.\nThe mosque features a prayer hall and a women's zone and will be able to carry out funerals and marriage ceremonies.\nThere are also plans to run a foodbank within the hub.", "url": "https://www.bbc.co.uk/news/articles/cz03l5er87go"}