{"authors": ["Mike Wendling and Kayla Epstein", "www.facebook.com"], "date_download": "2025-04-26 07:25:04", "date_modify": "2025-04-26 07:25:04", "date_publish": "2025-02-28 01:16:11", "description": "The release of Tate and his brother came after discussions between US and Romanian officials.", "filename": "news_articles_cly22wdedqeo_1745652304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ce18/live/95908110-f557-11ef-b7da-bf3b74fc6fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly22wdedqeo_1745652304.html", "title": "Andrew Tate: Did the White House lobby help end his travel ban?", "title_page": "Andrew Tate: Did the White House lobby help end his travel ban? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Andrew and Tristan Tate, the controversial British-American social media influencers accused of rape, human trafficking and money laundering, have been freed from travel restrictions in Romania after several high-level White House officials took an interest in their case.\nIt's unclear what, if any, role Donald Trump's administration may have played in their release, but one of Trump's top envoys is said to have raised the case with Romania's Foreign Minister Emil Hurezeanu at a security conference in Munich earlier this month.\nAndrew Tate rose to fame after appearing on the UK reality show Big Brother, and later making a series of extreme and controversial statements about women and politics on social media.\nThe pair ran a webcam business and were charged with human trafficking and rape along with two Romanian female suspects in June 2023.\nThey also face separate, unrelated allegations of rape and human trafficking in the UK, and civil suits in the US and UK. They deny all the allegations, which their US lawyer calls \"defamatory and unequivocally false\".\nOn Thursday the brothers arrived in Florida after previously being banned from leaving Romania while the case against them is pending.\nLawyers for the pair say they will return to Bucharest for court hearings.\nWhen asked about the Tates at the White House on Thursday, President Trump said: \"I know nothing about that.\"\nBut the brothers have been the subject of recent high-level discussions between the US and Romania.\nRomanian officials say US counterparts brought up the brothers' case with the Romanian government earlier this month, a story first reported by the Financial Times.\nAnd Trump special envoy Richard Grenell raised the issue again at a security conference in Munich.\nHurezeanu said the Tates were mentioned during that conversation, but denied being pressured to release the pair.\nThe Tate brothers are Trump supporters and also have ties to figures in his administration.\nOne of Tate's lawyers now works as White House liaison to the US justice department.\nPaul Ingrassia was part of a team representing the Tate brothers in a defamation lawsuit they filed in Florida against several of their alleged victims.\nIngrassia also acted as Tate's publicist and says he got the influencer onto a show hosted by Tucker Carlson, the former Fox News host.\nHe has praised Tate in online posts. In one dating from July 2023, he called Tate \"an extraordinary human being\" who was offering \"a dying West some hope for renewal\".\nIngrassia did not respond to a request for comment on Thursday.\nThe Tates have also been talked about by several people in Trump's orbit, including Donald Trump Jr and Elon Musk.\nTrump Jr once called Tate's detention in Romania \"absolute insanity\".\nMusk reinstated Andrew Tate's account, which had been banned on X, and suggested, perhaps in jest, that Tate would make a good UK prime minister.\nJoseph McBride, a lawyer representing the Tates in a defamation case they have filed against several of their accusers in Florida, said in a statement: \"They feel secure in America for several reasons, the primary one being that Donald Trump is the president.\"\nThe statement alleged that the Tates and others are victims of \"weaponised legal systems\" and \"politically motivated prosecutions\".\nMcBride did not respond to questions on whether White House officials played any role in the removal of travel restrictions against the Tate brothers.\nThe views of the Tate brothers lie at one of the manosphere's extreme edges. Andrew Tate himself has made no secret of his self-described misogynist – women-hating – and sexist views.\nOn podcasts and online clips he talks about how women are property, how men shouldn't allow girlfriends to go out without them or talk to other men.\nIn extremely graphic language, he's described violence against women and talked about how sexual assault victims bear responsibility for rape.\nTate and his brother at the same time sell a glamorous lifestyle of expensive properties, cigars and luxury cars that includes self-improvement messages directed at young men - an image that garnered him a large audience before he was booted off most mainstream social media platforms.\nHe told the BBC in a 2023 interview: \"I preach hard work, discipline. I'm an athlete, I preach anti-drugs, I preach religion, I preach no alcohol, I preach no knife crime. Every single problem with modern society I'm against.\"\nLike many other extreme influencers, in the face of criticism he often claims his posts are satire or jokes, mocking his detractors as his messages spread further, propelled by online outrage.\nThe pair's supporters were thrilled with his release and eager to proclaim their innocence, despite the outstanding charges against them.\nFour British women who have filed a civil lawsuit against Andrew Tate meanwhile issued a statement calling on UK authorities to \"take action\", saying they were \"in disbelief and feel re-traumatised by the news\".\nAnd support for the Tates is far from universal among Trump supporters and American conservatives, many of whom moved to immediately distance themselves from the brothers.\nRon DeSantis, the governor of Florida, where Tates landed on Thursday, said of their activities: \"Florida is not a place where you're welcome with that type of conduct.\"\nThe state's attorney general later said he would open a preliminary inquiry into the Tates, external and said Florida has \"zero tolerance for human trafficking and violence against women\".\nIn the conservative Washington Examiner, podcaster Brady Leonard wrote, external: \"Tate's obnoxious, misogynistic brand is toxic to everyone besides electorally insignificant corners of social media.\"\nMatt Lewis, a US conservative political commentator who has been critical of Trump in the past, said advocating on behalf of Tate \"fits in with the ethos of the Maga world right now, which is: 'let's be tough guys'\".\n\"But I also think it speaks to a legitimate problem, which we have seen in the last couple decades, a problem with men...where there's an epidemic of loneliness, a sense the world is passing them by, a sense that modernity has made it harder to be successful as a husband and a father. I think that's had some real psychic effects,\" he said.\n\"There's a pretty good contingency of Trump's supporters who are probably going to welcome this guy and probably even see him as a victim of persecution.\"", "url": "https://www.bbc.co.uk/news/articles/cly22wdedqeo"}