{"authors": ["Nikhil Inamdar", "www.facebook.com"], "date_download": "2025-04-26 07:07:57", "date_modify": "2025-04-26 07:07:57", "date_publish": "2025-02-28 05:45:09", "description": "The two sides discussed ways to further strengthen the Indo-EU strategic partnership.", "filename": "news_articles_c0eggy1104po_1745651277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/123e/live/1024ec50-f5ac-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0eggy1104po_1745651277.html", "title": "Ursula von der Leyen: EU Commission chief says free trade deal with India could come this year", "title_page": "Ursula von der Leyen: EU Commission chief says free trade deal with India could come this year - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The head of the European Commission, Ursula von der Leyen said EU and India were pushing to get a free trade agreement during this year.\n\"I am well aware it will not be easy. But I also know that timing and determination counts,\" von der Leyen said in Delhi, adding that such an agreement would be the largest deal of this kind anywhere in the world.\nThe EU Commission chief is in India accompanied by the entire College of Commissioners - the first such visit after the European parliamentary elections in June 2024.\nShe met Prime Minister Narendra Modi on Friday.\nSpeaking in the Indian capital, she said the two sides wanted to deepen trade and investment collaboration in wide ranging areas like semiconductors, AI and cleantech.\nIndia and EU relaunched talks on a long pending free trade agreement in 2021 and are set to hold another round in March.\nAn India-EU summit is also being held later in the year.\nVon der Leyen also said that India and EU were pushing for renewed cooperation in security and stability and were exploring a future 'Security and Defence Partnership' with India similar to the partnerships with Japan and South Korea.\nBrussels is keen to expand its relationships in the Indo-Pacific as cracks deepen between the US and Europe over trade tariffs and Ukraine following Donald Trump's return to the White House.\nTrump has said he is planning to hit goods made in the European Union with tariffs of 25%, claiming the bloc was created to \"screw the US\".\nThe European Union said it would react \"firmly and immediately against unjustified tariffs\".\nGiven the backdrop, analysts say strong trade and security relations with India have become more important than ever for the EU.\nA trade deal has proven difficult so far due to differences in areas like agriculture and manufacturing.\nDespite renewed negotiations \"the two sides have little to show for the talks thus far\", Observer Research Foundation (ORF), a think tank, said in a note.\nHowever, some 6,000 EU companies operate in India and the bloc is India's largest trading partner in goods, with bilateral trade reaching $135bn (£107bn) in 2022-23, nearly doubling in the last decade.\nAfter years of scepticism about free trade deals, India is now actively signing agreements and negotiating with multiple countries and blocs.\nIndia and the UK restarted free trade talks this week, nearly a year after negotiations were paused ahead of general elections in both countries.\nLast year, India signed a $100bn free trade agreement with the European Free Trade Association (EFTA) - a group of four European countries that are not members of the European Union - after almost 16 years of negotiations.", "url": "https://www.bbc.co.uk/news/articles/c0eggy1104po"}