{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:15", "date_modify": "2025-05-19 14:26:15", "date_publish": "2015-04-12 09:56:26", "description": "Estonian President Toomas Ilves calls for a permanent Nato force to be stationed in his country, amid concerns over Russian intentions in the region.", "filename": "news_world-europe-32274170_1747664775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82263000/jpg/_82263707_82263706.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-32274170_1747664775.html", "title": "Estonia President Toomas Ilves seeks permanent Nato force", "title_page": "Estonia President Toomas Ilves seeks permanent Nato force - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Estonian President Toomas Ilves has called for a permanent Nato force to be stationed in his country.\nMr Ilves told the UK's Daily Telegraph newspaper, external that Estonia felt threatened by Russian military flights and exercises in the area, as well as by belligerent rhetoric from Moscow.\nCurrently the sole Nato contingent in Estonia is a 150-strong US infantry company, stationed temporarily.\nNato has pledged a 5,000-strong task force to defend vulnerable members.\nAccording to Nato's founding charter, if a member country of the alliance is attacked every other member would be obliged to go to war in its defence.\nBut the 1997 Nato-Russia Founding Act, external forbids the presence of permanent bases in eastern and central Europe.\nThe Russian government meanwhile has said that it is concerned over moves by Finland and Sweden towards closer ties with the Nato.\nNordic defence ministers - also including Norway, Denmark and Iceland - agreed on Friday that Russia's recent behaviour was the gravest challenge to European security and that northern Europe must be prepared for a possible crisis.\nBut in a statement, the Russian foreign ministry warned that this could undermine co-operation in the region that had been developed over several decades.\nFinland - which borders Russia - and Sweden are not Nato members but have increased co-operation with the alliance.\n\"One hundred and fifty soldiers is not a lot, so we do think that further stationing of troops at a higher number is only reasonable,\" he said.\n\"We get exercises [by Russia] that take place behind our borders that have 40,000 to 80,000 soldiers. Yet we are accused of escalating the situation... and Russia says that it will have to take counter-measures.\"\nThe Estonian president suggested that Russian troops could reach the Estonian capital Tallinn - just 218km (135 miles) from the Russian border at Narva - in just four hours.\nNato has said that a 5,000-strong rapid response force, pledged at the alliance's summit in Wales last September, could be deployed within 48 hours to protect Eastern European members in the event of Russian aggression.\n\"It's a great idea but it probably is, in terms of the realities, just too late,\" said Mr Ilves.\nEstonia has a standing army of just 5,300 troops and relies on Nato to police its airspace.\nIn early 2014 Nato quadrupled its policing mission, external over the Baltic states from four to 16 fighter jets, a tiny fraction of Russia's combat aircraft numbers.", "url": "https://www.bbc.com/news/world-europe-32274170"}