{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:56:55", "date_modify": "2025-05-19 14:56:55", "date_publish": "2015-02-03 13:46:10", "description": "MLAs at Stormont vote to extend the National Crime Agency's powers to Northern Ireland after the SDLP changed its position and supported the move.", "filename": "news_uk-northern-ireland-31115866_1747666615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80756000/jpg/_80756846_nationalcrime.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31115866_1747666615.html", "title": "National Crime Agency: MLAs vote to extend powers to Northern Ireland", "title_page": "National Crime Agency: MLAs vote to extend powers to Northern Ireland - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "MLAs at Stormont have voted to extend the National Crime Agency's powers to Northern Ireland.\nThe vote was passed after the SDLP changed its position and supported it. Sinn Féin has criticised the move.\nBoth parties originally opposed the NCA's extension because of concerns over the agency's accountability.\nHowever, the SDLP has now said that a series of new measures proposed by the UK government means they can back its full introduction in Northern Ireland.\nIt is understood the NCA will be subject to the same Code of Ethics that applies to the Police Service of Northern Ireland (PSNI).\nThe police ombudsman will also have full power to investigate the body.\nIt is also believed the NCA's director general will be accountable to the Policing Board on matters relating to Northern Ireland.\nThe NCA began operating in the rest of the UK in 2013, but up until now its full powers have not been extended to Northern Ireland because of opposition from nationalist politicians.\nIts acceptance required cross-community support at Stormont.\nSpeaking in the assembly, SDLP deputy leader Dolores Kelly said her party was voting in favour of the motion, following negotiations with the Department of Justice, the NCA and the PSNI on additional accountability procedures.\n\"We are pleased with the level of accountability that we have secured,\" she said, adding that her party had \"shown leadership\".\nMrs Kelly listed the accountability measures as a code of ethics, and a role for the police ombudsman and the human rights advisor of the Policing Board.\nUlster Unionist Danny Kennedy welcomed the \"very clear and distinct support, some would say at long last, by the SDLP\".\nHe said there was no doubt the NCA was needed, citing police claims that there were \"at least 140 criminal gangs\" operating in Northern Ireland.", "url": "https://www.bbc.com/news/uk-northern-ireland-31115866"}