{"authors": ["Lynette Horsburgh", "www.facebook.com"], "date_download": "2025-04-26 08:09:59", "date_modify": "2025-04-26 08:09:59", "date_publish": "2025-02-26 12:37:13", "description": "Numerous failings in hospital care contributed to baby Ida Lock's death in 2019, an inquest is told.", "filename": "news_articles_cj921w480x7o_1745654999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/174d/live/e33138b0-f3c7-11ef-9fb3-b1bec12bffd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj921w480x7o_1745654999.html", "title": "Ida Lock inquest: 'No intentional deceit' over baby's hospital care report", "title_page": "Ida Lock inquest: 'No intentional deceit' over baby's hospital care report - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hospital where failures contributed to a newborn baby's death produced an \"inadequate\" and \"self-congratulatory\" internal report citing no issues with her care, an inquest has heard.\nIda Lock died a week after suffering a serious brain injury due to a lack of oxygen around the time of her birth in November 2019 at Royal Lancaster Infirmary.\nAt an inquest in Preston, the hospital's former head of midwifery said there had been \"no intentional deceit\" when she failed to inform Ida's parents she had signed off an internal report praising delivery room staff.\nIda's parents said the differences between the hospital's report and the Healthcare Safety Investigation Branch's were like \"night and day\".\nThe hearing at County Hall was told that an April 2020 report from the watchdog - now known as the Health Services Safety Investigations Body - had identified numerous failings in Ida's care which had contributed to her death.\nIn its report, the Healthcare Safety Investigation Branch (HSIB) concluded that midwives had failed to identify an abnormally slow foetal heart rate.\nThe inquest has also previously heard that two midwives and a junior doctor had failed to carry out a \"simple resuscitation\"\nIn stark contrast with the HSIB report, the hospital's internal \"root cause analysis\", carried out in January 2020, found no issues and praised the \"great cohesion and communication\" shown by staff in the delivery suite.\nAfter reading the two reports about their baby daughter, Sarah Robinson and Ryan Lock complained to University Hospitals of Morecambe Bay NHS Foundation Trust (UHMBT), which runs the hospital.\nIn June 2020 they had a meeting with Carol Carlile, who was then the hospital's head of midwifery.\nNow known as Carol Bell, she told them she was not going to make excuses, acknowledged that Ida's care had not been good enough, and said the delivery team should not have been congratulating themselves.\nGiving evidence at the inquest, Mrs Bell said: \"On reflection I wasn't the best person to go into the complaints meeting because I had signed off the root cause analysis.\"\nCounsel to the inquest, Sophie Cartwright KC, asked: \"When you gave your account to the family, did you not think you should have been saying you were part of the team that reviewed that self-congratulatory root cause analysis?\n\"So the family understood the head of midwifery sat in front of them had been part of the system that had approved a report that was wholly inadequate?\"\nMrs Bell replied: \"Yes, I should.\"", "url": "https://www.bbc.co.uk/news/articles/cj921w480x7o"}