{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:04", "date_modify": "2025-05-19 15:36:04", "date_publish": "2015-02-20 10:44:01", "description": "A former care worker admits trying to murder three colleagues by adding bleach to drinks at a West Midlands care home.", "filename": "news_uk-england-birmingham-31550919_1747668964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/77401000/jpg/_77401907_de53-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-birmingham-31550919_1747668964.html", "title": "Care worker Melissa Swift admits 'bleach' murder attempt", "title_page": "Care worker Melissa Swift admits 'bleach' murder attempt - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A care worker has admitted trying to murder three colleagues by adding bleach to drinks at a West Midlands care home.\nFormer special constable Melissa Swift was arrested after 25 residents and seven staff at Goldfield Court in West Bromwich were taken to hospital.\nSwift, 23, from West Bromwich, admitted three charges of attempted murder and two counts of making threats to kill at Birmingham Crown Court.\nShe will be sentenced on 17 April.\nShe also sent anonymous letters to two other members of staff threatening to kill them, including one to her older sister, Lulla Swift.\nAdrian Keeling, prosecuting, said: \"It's the case she intended to poison three of her colleagues at Goldfield Court, and made threats to kill on two other individuals.\"\nThree of her colleagues drank the liquids and fell ill with food poisoning symptoms. The women sought medical treatment and recovered from their symptoms after a few days.\nPoliced seized more than 400 drink and food items from Goldfield Court, which were either sent to be tested at force laboratories or destroyed.\nDet Ch Insp Michaela Kerr said they did not know what Swift's motive was.\nThe force confirmed she had previously served as a special constable with West Midlands Police.\n\"Melissa deceived her colleagues and hatched a plan to cause ill to those she worked with as a result of some malice, for which we have never truly discovered the cause,\" the detective said.\n\"She not only thought out a way of poisoning her workmates but also followed the plan through and administered bleach to their drinks, leaving them in the usual staff fridge where she knew they would go.", "url": "https://www.bbc.com/news/uk-england-birmingham-31550919"}