{"authors": ["Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 03:59:00", "date_modify": "2025-04-26 03:59:00", "date_publish": "2025-03-04 06:15:37", "description": "Several business owners say they are worried that parking restrictions could threaten their future.", "filename": "news_articles_cly6r4zl01ro_1745639940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47d2/live/dc800350-f86f-11ef-b078-a3b33258a20b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly6r4zl01ro_1745639940.html", "title": "Everton stadium parking row leads to changes", "title_page": "Everton stadium parking row leads to changes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool City Council has amended its plans to restrict parking around Everton's new stadium following complaints.\nThe authority previously announced restrictions would come into force within a 30-minute walking radius of the Bramley-Moore Dock site all year round, not just on matchdays.\nSeveral local business owners said they believed the planned changes would cause substantial damage and even lead to some companies going bust.\nNow the council has said it will amend some of the restrictions, including by extending the time visitors can park from one hour to two.\nA petition calling for the Experimental Traffic Road Order (ETRO) to be scrapped had been signed by nearly 19,000 people.\nBusinesses told the BBC the parking restrictions have already had a big negative impact on bookings.\nJoseph Burns, whose family owns the Ten Streets Social restaurant, said: \"It really will ruin our business if they don't change this and if they don't change it quickly.\"\nCouncil leader Liam Robinson said the authority had \"listened\" to local business owners and residents.\n\"We understand the concerns being raised by businesses, residents and fans and we've wasted no time in assessing the necessary amendments that can be introduced as quickly as possible,\" he said.\nWhen the ETRO was introduced the council said businesses could apply for 10 parking permits at an annual cost of £50 each.\nNow it will consider requests from businesses that want more than 10 permits on a \"case-by-case basis\".\nIt will also introduce permit parking in the Pumpfields area, and discussions are ongoing about pay-and-display meters.\nThe council said it would also make changes to match-day parking restrictions after a test event on 17 February - including improved signage and a review of how road closures are communicated.\nIt said the amendments could take two to three months to come into effect.\nThe council said the ETRO would remain under review over the next 18 months and further changes could follow.\nCouncillor Dan Barrington, cabinet member for transport, said: \"A key aim of the Experimental Zone is tackling the problem of commuter parking 365 days a year, as well as illegal and unsafe parking on double yellow lines and pavements.\n\"These issues impact the area all year round and it's vital we get this right to support its economic development and to tackle congestion, especially as more businesses set up here and more residential schemes are developed.\"", "url": "https://www.bbc.co.uk/news/articles/cly6r4zl01ro"}