{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:26:47", "date_modify": "2025-04-26 07:26:47", "date_publish": "2025-02-27 22:16:53", "description": "The police said no arrests have been made following the death of the man who was aged in his 70s.", "filename": "news_articles_c0eggr9gg0go_1745652407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1c24/live/198487c0-f605-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0eggr9gg0go_1745652407.html", "title": "Murder investigation over death at Dungannon flat", "title_page": "Murder investigation over death at Dungannon flat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A murder investigation has been launched after a pensioner died in a flat following a serious assault in Dungannon, County Tyrone, on Thursday.\nThe victim, aged in his 70s, was found with serious injuries at a property in the Corrainey Park area of the town at about 20:00 GMT.\nEmergency services had been called to the Lisnahull Estate but the man died at the scene.\nIn an update on Friday afternoon, police said no arrests have been made so far.\nSupt Peter Stevenson said the man \"was found seriously injured on the living room floor of the property\".\n\"The man was a resident in the area for more than 20 years,\" he added.\n\"Officers are at the scene today and are working to establish the full circumstances that led to this senseless attack.\"\nThe Police Service of Northern Ireland (PSNI) remain at the scene but the police cordon has been shortened to let residents in and out of the Lisnahull estate on the edge of Dungannon town centre.\nThe Northern Ireland Ambulance Service said it received a call at 20:13 GMT and despatched one rapid response paramedic, two emergency crews and an advanced paramedic.\nSDLP councillor Karol McQuade said: \"The public are concerned that this has taken place in their town, nobody expects something like this to happen on their doorsteps, but I have spoken to police and would urge people to remain calm.\n\"I would also ask people to remember there is a grieving family at the centre of this, and not to share rumours or videos on social media and to give the police space to carry out their investigations.\n\"Anyone with any information should come forward to the PSNI.\"\nIndependent councillor Barry Monteith said people's thoughts are with the man who lost his life and \"all those who loved him\".\nHe also urged people to be cautious about repeating things they hear about the killing.\n\"There are a number of different rumours and things going round online and I just urged people to be careful what you share,\" he said.\nSinn Féin councillor Deirdre Varsani said locals are \"very concerned\" by the news.\n\"Generally people get upset and unnerved when there are incidents close to their homes,\" she told BBC News NI.\nShe urged members of the public to avoid \"unhelpful\" commentary and to \"stick to the basic facts\".\n\"We are aware of instances on social media, even last night, there were names being bandied about and they were not the correct names,\" she said.\n\"That is just extremely worrying behaviour because that just adds to the difficulties of these challenging situations.\"", "url": "https://www.bbc.co.uk/news/articles/c0eggr9gg0go"}