{"authors": ["Ruby Gregory", "www.facebook.com"], "date_download": "2025-04-26 07:07:48", "date_modify": "2025-04-26 07:07:48", "date_publish": "2025-02-28 05:59:41", "description": "An estate earmarked for redevelopment as part of London 2012 is still facing uncertainty.", "filename": "news_articles_ckgzz1z1epxo_1745651268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/aa3e/live/e5ce3060-f4e8-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgzz1z1epxo_1745651268.html", "title": "Carpenters Estate in London's Olympic Park: Refurbishment costs rise", "title_page": "Carpenters Estate in London's Olympic Park: Refurbishment costs rise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An east London council has decided to go against recommendations from councillors who raised concerns over increased costs to the regeneration of a housing estate which was part of the London 2012 Olympic legacy.\nNewham councillors had raised financial concerns for the Carpenters Estate project in Stratford after the estimated borrowing costs jumped from £845m to £1.4bn in two years.\nCouncillor Joshua Garfield said he was concerned future generations would be left with a huge debt however Newham's mayor, Rokhsana Fiaz, said the council was trying to get other investment.\nThe estate aims to deliver about 2,300 homes across a 28-acre site, of which 50% plan to be affordable social rent homes.\nA council report, which was approved by cabinet members on 4 February, said the project had been hit by inflation, costs on new building safety requirement and an increase to the total number of homes.\nDue to these challenges, the report said the total build programme would need to be extended from 11 to 14 years.\nOn 18 February, overview and scrutiny members called-in the approval of the report, arguing it needed greater scrutiny and accountability as the project raised \"serious\" financial and ethical concerns.\nA call-in allows councillors to scrutinise an executive decision which has not yet been implemented, but can result in a decision being reconsidered by cabinet.\nMr Garfield, who was moved from his home on the estate when he was a child to make way for the regeneration, had concerns over the impact borrowing rates could have on the council's finances.\n\"I worry by the time our successors are sitting here, the only thing the General Fund will be paying for is temporary accommodation and this interest.\n\"There will be no other money in the budget, and we simply cannot leave that legacy for those that proceed us.\"\nThe committee decided to send the original decision back to cabinet for reconsideration, and came up with a list of recommendations which included providing at least twice-yearly updates on the project and to consider different funding strategies such as selling some or part of the estate.", "url": "https://www.bbc.co.uk/news/articles/ckgzz1z1epxo"}