{"authors": ["Helen Bushby", "www.facebook.com"], "date_download": "2025-04-26 06:56:19", "date_modify": "2025-04-26 06:56:19", "date_publish": "2025-02-28 15:05:05", "description": "The High Court says Ofcom's rulings over two shows hosted by Sir Jacob Rees-Mogg were unlawful.", "filename": "news_articles_c86pp6wq1xno_1745650579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c3a3/live/c453e7c0-f5df-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86pp6wq1xno_1745650579.html", "title": "GB News wins Ofcom legal challenge over Jacob Rees-Mogg shows", "title_page": "GB News wins Ofcom legal challenge over Jacob Rees-Mogg shows - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "GB News has won its judicial review of decisions made by TV watchdog Ofcom, that two shows hosted by Sir Jacob Rees-Mogg breached the broadcasting code.\nThe High Court judgment, external by Mrs Justice Collins Rice concluded that Ofcom's rulings were unlawful. It is the first time the watchdog has lost such a case.\nThe judgement said Ofcom's initial rulings - that the 9 May and 13 June 2023 broadcasts were in breach of its codes on \"due impartiality and due accuracy in news\" - were unlawful.\nGB News CEO Angelos Frangopoulos said the decision \"vindicates GB News' position as the fearless defender of free speech in the United Kingdom\", while Ofcom said it \"accepted the court's guidance\".\nMr Frangopoulos added: \"I call on the government and Parliament to consider the seriousness of this fundamental failure by Ofcom.\"\nThe judge's ruling stated: \"I am minded to quash the two decisions in this case, and remit them to be reconsidered by Ofcom, subject to whatever further procedure may be fairly indicated.\"\nThe court found that Ofcom had misapplied Rule 5.3, external of the code, saying the provision only applies to \"news programmes\" and not to current affairs shows, such as the one Sir Jacob hosts.\nThe decisions had been made as part of five GB News rulings by Ofcom in March last year, including three about shows hosted by Esther McVey and Philip Davies.\nOfcom's rulings had said the State of the Nation shows hosted by Sir Jacob, external broke rules stating politicians should not usually front news coverage.\nThe Ofcom code says a politician can't be a newsreader, interviewer or reporter in a news programme \"unless, exceptionally, it is editorially justified\". They can, however, front current affairs shows.\nAt the time, Sir Jacob was the Conservative MP for North East Somerset.", "url": "https://www.bbc.co.uk/news/articles/c86pp6wq1xno"}