{"authors": ["Asha Patel", "www.facebook.com"], "date_download": "2025-04-26 06:38:14", "date_modify": "2025-04-26 06:38:14", "date_publish": "2025-02-26 06:20:57", "description": "Bassetlaw District Council said efforts were being made to find the dogs' owners.", "filename": "news_articles_cg70zrmk9jko_1745649494.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3458/live/ec4ddd50-f394-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg70zrmk9jko_1745649494.html", "title": "'Disbelief' as caged dogs abandoned at Retford nature reserve", "title_page": "'Disbelief' as caged dogs abandoned at Retford nature reserve - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A dog owner has been left in \"disbelief\" after finding three caged dogs abandoned at a nature reserve.\nPaula Clarkstone said the dogs were \"dirty and bedraggled\" when she came across the cage at Idle Valley Nature Reserve in Retford, Nottinghamshire, on Monday.\nBassetlaw District Council's dog warden was called to the site, and the animals were taken to kennels.\nThe authority said the dogs were in good health, and would be available to be rehomed if they were not claimed within eight days.\nMs Clarkstone said the dogs appeared to be friendly, bonded to one another and well-fed, but seemed \"neglected in other ways\".\n\"It was awful because I've got dogs myself - it was just disbelief really. All afternoon I was thinking about them,\" the 55-year-old said.\nShe believes whoever left the dogs at the nature reserve would have known they would be found quickly.\n\"I just want them to find a lovely home where they're happy and somebody looks after them like I do with my dogs.\n\"If their fur wasn't matted like it was, I probably would've taken them home myself and then rung the dog warden - but I've already got four at home,\" Ms Clarkstone added.\nErin McDaid, head of communications at Nottinghamshire Wildlife Trust - which runs the nature reserve - said the site was a \"totally inappropriate\" place to leave pets.\n\"I must admit, 30 years at the wildlife trust, there's not much left that shocks me any more, but I was very shocked to hear about the incident.\n\"As a dog owner myself, I was quite upset and I'm sure many people were including visitors who saw the dogs abandoned,\" he said.\nA spokesperson for the council added: \"This is a really sad situation for the dogs, but we're pleased to say they are in good health, have been given a good clean-up and are being cared for at our appointed kennels.\n\"This time gives the owner of the dogs an opportunity to come forward and claim their pets, should they be able to provide proof of ownership.\n\"All three dogs have been scanned for microchips and our environmental health officers are currently using this data, as well as information from members of the public, to try and find their owner.\n\"Should the dogs not be claimed within the eight-day period, they will be available to be rehomed.\n\"Sadly, this is not a unique occurrence and we are called to situations like this on a regular basis.\"", "url": "https://www.bbc.co.uk/news/articles/cg70zrmk9jko"}