{"authors": ["Esme stallard", "www.facebook.com"], "date_download": "2025-04-26 07:25:29", "date_modify": "2025-04-26 07:25:29", "date_publish": "2025-02-28 00:47:57", "description": "Funding agreed at UN conference in Rome that would attempt to tackle the rapid loss of biodiversity", "filename": "news_articles_cg5ddnmnypvo_1745652329.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e85e/live/2c237270-f564-11ef-9279-b57707d390a5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg5ddnmnypvo_1745652329.html", "title": "Nations salvage funding deal to reverse wildlife decline", "title_page": "Nations salvage funding deal to reverse wildlife decline - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The world's nations have agreed a funding plan at UN talks in Rome for reversing the decline of nature.\nCountries were eventually able to overcome deep divisions which had led to the breakdown of negotiations last year in Colombia.\nIt is hoped that the deal will help countries to reach their goal of raising $200bn (£159bn) by 2030 for biodiversity action.\nThe current rate of species decline is so great globally that many scientists warn humans could be causing the \"sixth mass extinction\" on Earth.\nThe extinction rate of species globally has been rapidly accelerating, external over the last 50 years as animals and plants struggle to survive in the face of increased threats from human activities and climate change.\nIn 2022, recognising that dramatic action was needed, countries agreed a landmark deal to halt this decline of nature and agreed to protect 30% of the world's land and seas.\nIn order to achieve this goal countries agreed that $200bn (£159bn) a year would be mobilised by 2030, but according to the latest data from the OECD only $15bn (£12bn) has been raised.\nIt was hoped that at last year's UN biodiversity summit in Colombia, known as COP16, countries would come up with a new plan to close this significant funding gap.\nBut the negotiations broke down in dramatic fashion after the talks ran so far into overtime delegates had to leave to catch scheduled flights home.\nCountries reconvened this week in Rome and after three days of, at times tense, discussion they managed to agree on a new strategy in the late hours of Thursday evening.\nThe deal agreed includes:\ncalling on countries to have national funding strategies\na commitment to having a permanent fund for nature\ndedication of funding for indigenous groups\nMany negotiators said they saw the agreement as a success for international cooperation in the face of increased global trade disputes.\nNot all countries were present at the talks and the US was notably missing.\nInitial reaction from environmental charities suggested they were happy that an agreement had been reached but reiterated the need to see actual money delivered.\nJill Hepp, biodiversity policy lead at Conservation International, said: \"While this is a moment to celebrate, we also need to see action and innovation immediately following these decisions.\"\n\"No matter where you live or work, our food, water, livelihoods and economies all depend on a thriving natural world,\" she said.\nIt is estimated that over half of global GDP is dependent on nature, and up to 4 billion people rely on the world's ocean resources and forests.\nDespite getting an agreement many nations have still failed to submit their strategies for tackling biodiversity loss in their own countries - the deadline for which was last year. The UK submitted its plan on Thursday.\nThe Joint Nature Conservation Committee (JNCC), the UK government's advisory body on nature conservation, estimated in 2023 that only 6.5% of the country's land is adequately protected.", "url": "https://www.bbc.co.uk/news/articles/cg5ddnmnypvo"}