{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:41:37", "date_modify": "2025-04-26 04:41:37", "date_publish": "2025-03-02 07:07:37", "description": "The church's safe was stolen 10 years ago and its register set alight, meaning years of records are missing.", "filename": "news_articles_cevxem4227ko_1745642497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/28ef/live/6264e8f0-f5b9-11ef-8c2a-43d22b661d81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevxem4227ko_1745642497.html", "title": "Community call-out for Somerset village wedding history", "title_page": "Community call-out for Somerset village wedding history - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Villagers will be marking the VE Day anniversary this year by holding a wedding exhibition at their church.\nOrganisers are on the hunt for information on any marriages at St Michael and All Angels Church in Stoke St Michael, Somerset.\nThe church's safe was stolen 10 years ago and its register was set alight, meaning its records between 1995 and 2014 are missing. It is hoped the gaps can be filled.\nVillager Sarah Stewart said a couple got married the day before VE Day in 1945 at the church, and the wedding dress from that day will be on display.\nMs Stewart, who is organising the event, said a bridesmaid dress from that wedding would also be shown.\nShe added she had recently come into possession of her own mother's wedding dress from the 1950s, and wanted to do something special with the collection.\nMs Stewart said she hoped people who got married in the period of the missing records would come and share their history.\nShe said: \"We've got a beautiful little church, and it's got a lot of history, and unless you go and have a look around and find out these things... then you don't really know what's going on.\"\nAs well as information on marriages, organisers want donations of mannequins and tailor's dummys for the displays.\nThe event will take place from 31 May.", "url": "https://www.bbc.co.uk/news/articles/cevxem4227ko"}