{"authors": ["Sonja Jessup", "www.facebook.com"], "date_download": "2025-04-26 06:35:54", "date_modify": "2025-04-26 06:35:54", "date_publish": "2025-02-27 06:07:21", "description": "More than 8,500 Londoners help the police create a charter on how the policy should be used.", "filename": "news_articles_cp3yje49qnzo_1745649354.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1bd5/live/ee43f630-f47f-11ef-96b5-cb16e833b61d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yje49qnzo_1745649354.html", "title": "Stop and search: Young people help the Met build new charter", "title_page": "Stop and search: Young people help the Met build new charter - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Davarel Gordon thinks he was just 12 years old when he was first stopped and searched by police.\n\"The first time it happens you're in shock. There wasn't any communication, I didn't understand what was going on.\n\"Then it happens over and over again, it becomes annoying. From the age of 15, 16, I was in the house all the time, because if I left the house, I knew I was going to end up getting stopped and searched.\"\nNow aged 20, he's among 80 young people who were invited to New Scotland Yard to help the Metropolitan Police launch a new set of commitments on how the controversial tactic of stop and search should be used, external.\nThe new charter comes almost two years after the force was severely criticised in the Casey review for \"over policing and under protecting\" black Londoners, and told that there should be a \"fundamental reset\" of the tactic.\nAccording to recent government analysis of the tactic,, external black people are more than four times likely to be stopped and searched by police.\nThe Met says this charter has been put together after 18 months of engagement with more than 8,500 Londoners of all ages, ethnicities and backgrounds through a series of surveys and events held in each of London's 32 boroughs.\nIt includes commitments around the communication and tone that officers use when carrying out stop and search, improved training and supervision, and better handling of complaints.\nMet Commissioner Sir Mark Rowley said the charter was not about doing less stop and search, it was about \"doing it better by improving the quality of encounters, informed by the views of the public it is intended to protect\".\nDeputy Assistant Commissioner Ade Adelekan, who leads the project, said stop and search was \"extremely important in saving lives, but when done poorly, it has the ability to burn through trust like nothing we know, so it's critical we reset our relationship\".\nThe Met says the tactic has been effective in fighting crime, with about 17,500 weapons seized over the past four years as the result, including at least 3,500 in 2024.\nMr Gordon says despite his negative experience, he believes it is a necessary policing tool.\n\"Even if they're taking three, four, knives off the streets, that's three or four lives that could have been saved.\"\nHowever, he says he wants to see a more targeted use of the tactic, and believes he and his friends became a focus because of the way they dressed.\n\"We weren't up to any trouble, but we were all wearing the same jacket,\" he said.\nHe added that he remembered feeling \"very awkward, very scary\" when three adult officers surrounded him as a young teenager.\nSir Mark previously raised concerns that some officers were worried about using stop and search, and told the London Assembly's Police and Crime Committee earlier this month that use of the tactic had halved in the last three years in London.\n\"If we are to take the fight to those intent on causing serious violence, fear and intimidation across London then stop and search must form part of that effort,\" he said.\n\"If we allow its contentious nature and the concerns associated with it to force us into doing less of it, then only the criminals win.\"\nMr Gordon says the main change he would like to see improved is aftercare and empathy.\n\"There's not enough of that. They need to remember we are people. Just make sure the person is ok.\"\nPaul Leslie, the chief executive of the charity Rights and Equalities in Newham said stop and search had been \"targeted negatively at black and Asian boys in particular, but black and Asian communities overall\".\n\"I think the outcomes of stop and search have not been proven in terms of crime reduction, so there needs to be a better correlation between those two things,\" Mr Leslie said.\nMr Adelekan said the force recognised it needed the help of Londoners to change.\n\"This hasn't been a tick box exercise. If it was, we would have delivered this 18 months ago,\" he said.\n\"We went wherever people would talk to us, and we went to knock on doors that we knew people didn't really want to speak to us in some organisations, and we consulted with those people.\"\nDoreen Sinclair-McCollin, chief executive of Elevated Minds, which works with young people, said she was confident the charter genuinely reflected the charity's views.\n\"A lot of the words come directly from the young people,\" she said. \"I've not seen that before, where they sat, listened, talked.\"\nShe said she wanted the use of the tactic to be \"positive\" and \"done fairly\".\nMr Leslie agreed, although he said there would be challenges.\n\"I think it's a tall order, we are dealing with a range of cultural and embedded behaviours that I think will take some time to unpick, but my starting point is one of optimism.\"\nMr Gordon, who helps mentor young people in the charity, Fight 4 Change, believes there will be some scepticism about the reforms, but said he thought the charter stood a much better chance of success than previous promises from police.\n\"Working together is the best way to get forward,\" he said.\n\"If you want them (police) to treat you a certain way, you should show them how to treat you, so they're able to learn from that.\"\nThe Mayor of London, Sadiq Khan, said: \"This charter was co-produced with communities and is part of the Met's ongoing work to build a Met that is anti-racist, inclusive and representative of the city it serves.\n\"Improved training, community engagement, and enhanced oversight will improve the way this vital power is used in our community.\n\"Londoners will rightly judge this charter by its results, and I will continue to monitor its delivery to ensure it is both effective and fair so that we can build a safer and fairer London for everyone.\"", "url": "https://www.bbc.co.uk/news/articles/cp3yje49qnzo"}