{"authors": ["John Watson", "www.facebook.com"], "date_download": "2025-04-26 04:20:18", "date_modify": "2025-04-26 04:20:18", "date_publish": "2025-03-03 15:46:06", "description": "A football club is helping \"a band of friends and brothers\" who have experienced child loss.", "filename": "news_articles_cj0q9vg282eo_1745641218.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/314b/live/e26a7140-f830-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0q9vg282eo_1745641218.html", "title": "Blackburn Rovers Dads team helps grieving fathers with child loss", "title_page": "Blackburn Rovers Dads team helps grieving fathers with child loss - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A football club set up to help fathers who've experienced the loss of a child has brought men together \"under a banner of something we've all gone through\", one dad has said.\nEvery week, members of Blackburn Rovers Dads FC get together for a free game, run by qualified coaches from Blackburn Rovers Community Trust, where they are also offered support and guidance.\n\"We come together as a group and as a little band of friends and brothers and just have some time together,\" Stephen Chapman said.\nFounder Sarah Bernasconi-Parsons, from Maggie's Stillbirth Legacy - a charity that supports bereaved families - said she had the idea to set up the team because \"men and sports goes hand in hand\".\n\"To come together and support each other through something that everyone's still going through in their own way, that's what matters the most,\" Mr Chapman said.\nHe added that he \"loved\" to talk about the little girl he lost because \"it fills me with pride\".\nHe said the team gave him \"a sense of normality\" through something that had been \"really, really tough\".\n\"It's a new normal almost after going through a loss,\" he said.\n\"Having somewhere like this to look forward to every single week, it excites me.\n\"The fact that my club is doing something within my community to help support me through something I've been through is fantastic.\"\n\"When I first lost of my daughter I felt I couldn't talk to anybody,\" another member of the team, Brian Price, said.\n\"When I was at work, because I'm a welder, I used to just put my helmet down and cry my eyes out for a good hour or so.\"\nHe said new members would always be welcome on the team.\n\"We're here, we'll listen and we'll talk to you,\" he said.\n\"It's always good to talk when people hit milestones, like when it would have been the child's birthday or when it's been anniversaries,\" another dad, Alex Hamer, added.\n\"So it gives us a good opportunity to get things off our chest.\n\"You never expect to go through anything like that in your life.\"", "url": "https://www.bbc.co.uk/news/articles/cj0q9vg282eo"}