{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:28", "date_modify": "2025-05-19 14:26:28", "date_publish": "2015-03-19 03:23:29", "description": "British military personnel have started training members of the Ukrainian army engaged in fighting against pro-Russian rebels, the BBC learns.", "filename": "news_uk-31956657_1747664788.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81767000/jpg/_81767550_026274263-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31956657_1747664788.html", "title": "Ukraine crisis: British trainers assist Ukrainian military", "title_page": "Ukraine crisis: British trainers assist Ukrainian military - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "British military personnel have started training members of the Ukrainian army fighting pro-Russian rebels, the BBC has learned.\nThe 35 trainers are working in the southern city of Mykolaiv and will spend about two months in the country.\nThey will train forces in eastern Ukraine in medicine and defensive tactics and give non-lethal equipment.\nThe Ukrainian PM said he \"truly appreciated\" the support, while the deployment was criticised by Russia.\nThe deal was announced by Prime Minister David Cameron last month.\nIt is the first time a Western nation has conducted a long-term military training programme in Ukraine since its war against pro-Russian rebels began last year.\nAccording to a report in the Wall Street Journal, external, the Pentagon has delayed a training programme for Ukrainian soldiers because it fears it could give Russia a reason to end the the current peace deal.\nA ceasefire took effect on 15 February following an agreement reached in Minsk, Belarus, and has largely held despite sporadic shelling.\nThe British government is also supplying first aid kits, sleeping bags and night-vision goggles as part of its pledge to provide assistance and more British teams are expected to arrive in Ukraine over the coming weeks.\nBBC correspondent Tom Burridge said the deployment of dozens of military instructors was a symbolic move that would not alter the military balance of the war.\nThe Ukrainian Prime Minister Arseniy Yatsenyuk welcomed the assistance in his country, which he said was defending \"peace and stability\" in Europe.\nHe told the BBC the trainers would \"help increase the durability of the Ukrainian military\".\nMr Yatsenyuk said he saw the help as a \"first step\" and expected further assistance would come from other EU countries and the US, adding: \"Please help us to defend our country and your peace.\"", "url": "https://www.bbc.com/news/uk-31956657"}