{"authors": ["Pamela Bilalova", "www.facebook.com"], "date_download": "2025-04-26 06:39:21", "date_modify": "2025-04-26 06:39:21", "date_publish": "2025-03-02 16:03:52", "description": "Shepherds Inn owner Stephen Wilcock says there is \"so much rubble\" at the pub in Langwathby.", "filename": "news_articles_c62k9w3g4r6o_1745649561.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/304d/live/7e81af70-f774-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62k9w3g4r6o_1745649561.html", "title": "Car crashes into 500-year-old Cumbria inn", "title_page": "Car crashes into 500-year-old Cumbria inn - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The owner of a centuries old, listed village pub which was badly damaged when a car crashed into it has spoken of his shock and finding debris strewn across the restaurant area.\nThe Shepherds Inn in Langwathby, near Penrith, has been closed since the crash at about 04:00 GMT on Wednesday.\nStephen Wilcock, who runs the pub, said it had been a shock to see \"so much rubble\".\nCumbria Police said the 17-year-old driver of the car had been arrested on suspicion of aggravated vehicle taking and dangerous driving, but had been released pending investigation.\n\"It's a good job there was no one in the restaurant and that it wasn't open, the amount of damage that's been done,\" Mr Wilcock said.\n\"It's a shock to see so much rubble. You'd think a lorry has come through the wall, rather than a car.\n\"In the winter you do all your renovations, your painting and you get ready for busy times and then part of is destroyed.\"\nThe closure meant a number of charity events had to be cancelled, although there are plans to reopen on Monday.\nMr Wilcock said there had been lots of support from the community since the crash.\n\"We're very grateful for that.\"", "url": "https://www.bbc.co.uk/news/articles/c62k9w3g4r6o"}