{"authors": ["Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 06:44:20", "date_modify": "2025-04-26 06:44:20", "date_publish": "2025-03-01 17:21:24", "description": "The Wilderness Centre is often used by schools as a destination for residential trips.", "filename": "news_articles_c99nne03g0yo_1745649860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9395/live/9319fc30-f5ee-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c99nne03g0yo_1745649860.html", "title": "Community group plans to buy Forest of Dean outdoor centre", "title_page": "Community group plans to buy Forest of Dean outdoor centre - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A local community group has put in a bid to buy an \"iconic\" outdoor learning centre.\nWylderne Bioregioning, a community benefit society based in the Forest of Dean, announced on Friday it had secured funding to buy The Wilderness Centre in Mitcheldean.\nDr Daniel Sturdy bought the centre from Gloucestershire County Council in 2014 but it was put on the market in 2023, initially for £1.5m.\nWylderne Bioregioning has put in a bid for the market value of the site, last assessed in February 2023, on behalf of the community.\nThe community benefit society was created in October 2023, in response to The Wilderness Centre being put up for sale.\nIt was sold by the county council 11 years ago due to budget cuts, and an attempt to keep it in the local community was \"narrowly outbid\", Wylderne Bioregioning said.\n\"We are grateful to our financial backers and to the Forest of Dean District Council, both of whom believe in our vision for the Wilderness,\" said Simon Dawson, one of four directors of Wylderne Bioregioning.\n\"This iconic place which has provided so many children across the Forest and Gloucestershire with their first formative nights away from home for over five decades, we hope will now forever be secure in community hands.\"", "url": "https://www.bbc.co.uk/news/articles/c99nne03g0yo"}