{"authors": ["Alex Pope", "www.facebook.com"], "date_download": "2025-04-26 03:52:00", "date_modify": "2025-04-26 03:52:00", "date_publish": "2025-03-05 11:19:48", "description": "Brickz Museum will open in Milton Keynes next month and will be aimed at \"small and big children\".", "filename": "news_articles_cq5z34wnv72o_1745639520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/33eb/live/d4a177d0-f901-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5z34wnv72o_1745639520.html", "title": "Five million pieces of Lego to be shown in Milton Keynes museum", "title_page": "Five million pieces of Lego to be shown in Milton Keynes museum - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A museum featuring about five million Lego bricks is set to open to inspire \"small and big children\".\nBrickz Museum will open to the public in Milton Keynes on 8 April.\nSabrina Kelley, a volunteer working on the project, said it aimed to \"tell the story and show items even the biggest Lego enthusiasts might not have seen before\".\nThe museum will explain the story of the company that was founded in Denmark in 1932.\nMs Kelley said the museum, on Secklow Gate West, was not affiliated to the Danish company and was working to become a charity.\nIt is the mastermind of Jason Joiner, the man behind the National Film and Sci-Fi Museum and The Pixel Bunker, which are both housed in the same building.\n\"It's his collection with some items on loan\", Ms Kelley said.\n\"It's dedicated to all things Lego. It will explain its history, from when it started with wooden toys to showing off three main themes – the past, the present and the future – and show items even Lego enthusiasts might not have seen before.\n\"We're trying to get a balance from everyone having a great experience, showing what you can do with Lego but also [inspiring] small and big children.\"", "url": "https://www.bbc.co.uk/news/articles/cq5z34wnv72o"}