{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:34:17", "date_modify": "2025-04-26 07:34:17", "date_publish": "2025-02-27 15:53:15", "description": "Graham Trinder was holding an air rifle when he was fatally shot by a police officer in Swindon in 2020.", "filename": "news_articles_cddyy30n62zo_1745652857.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b3d0/live/93e84030-f513-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cddyy30n62zo_1745652857.html", "title": "Swindon: Police officer feared for life before shooting man", "title_page": "Swindon: Police officer feared for life before shooting man - inquest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An armed police officer who fatally shot a man carrying an air rifle opened fire because he feared for his life, an inquest has heard.\nThe officer had responded to a call reporting a fight between two men when he shot father-of-two Graham Trinder, 57, on 8 November 2020 on Summers Street in Swindon.\nThe officer, referred to in court as AL/1, told Wiltshire and Swindon Coroner's Court: \"I was terrified, the most scared I've been in my career to date. I thought I was going to die.\"\nMr Trinder had been drinking with neighbours when a dispute broke out shortly before 02:00 GMT, which resulted in him fetching an air rifle from his home, the inquest jury has previously been told.\nMr Trinder, known as Tommy, was holding a .22 air rifle outside his home when he sustained a single gunshot wound to the chest. He was pronounced dead at the scene.\nAL/1 explained that when he got the scene shortly after 02:00 he noticed a second police car arriving and one person in the street.\nMr Trinder then came out of a house carrying a \"long-barrelled rifle with a scope,\" AL/1 said.\nThe officer described the weapon as looking like a large-calibre hunting rifle and said he did not hear anyone shouting it was an air rifle before he opened fire.\nHe said he had been \"shocked\" at seeing the weapon and added: \"It doesn't happen in the UK. People don't walk around with guns in the street.\"\nAL/1 told the inquest he drew his gun, pointed it at Mr Trinder and started shouting at him to put the gun down.\nAsked how many times he gave the warning, he replied: \"I can't … two, three, four, maybe, I don't know.\"\nThe officer said Mr Trinder took a \"proper stable shooting position\" then brought the weapon towards him \"in a deliberate aimed action\".\nAL/1 said he thought that he was going to be killed as the weapon came round towards him and decided to fire.", "url": "https://www.bbc.co.uk/news/articles/cddyy30n62zo"}