{"authors": ["Chris Young", "www.facebook.com"], "date_download": "2025-04-26 04:40:17", "date_modify": "2025-04-26 04:40:17", "date_publish": "2025-03-02 07:35:35", "description": "The West Yorkshire Fire Service vehicles will be sent to the war-torn country in early April.", "filename": "news_articles_cvgdp5l31yno_1745642417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9490/live/5968e540-f6a8-11ef-b898-07ecc7bad187.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgdp5l31yno_1745642417.html", "title": "West Yorkshire Fire Service to donate engines to Ukraine", "title_page": "West Yorkshire Fire Service to donate engines to Ukraine - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Four fire engines from West Yorkshire will be donated to Ukraine to help deal with the devastation caused by the Russian invasion.\nCouncillors from across West Yorkshire agreed to donate the vehicles at a meeting of West Yorkshire Fire Authority on Thursday.\nA further two engines will be sent to UK charities that support veterans.\nA report to members said the Ukraine State Emergency Service had been \"under significant pressure since the current conflict began in February 2022\".\nThe report said 396 fire stations and 1,676 fire vehicles had been destroyed in the war-torn country since the invasion.\nNinety-one firefighters had been killed and a further 349 injured.\n\"In the same period, the work of Ukrainian firefighters has grown significantly in response to the ongoing destruction of property, with approximately 217,000 buildings destroyed or damaged and 5,000 people rescued from fires and collapsed buildings,\" the report said.\nMembers of the authority were told that the service was in the process of replacing 58 of its older vehicles, with 10 of them being kept for training and others auctioned off.\nBut the services planned to donate some of the vehicles to help fire services in Ukraine.\nThe vehicles would be sent over in early April, according to the Local Democracy Reporting Service.\nTwo other engines will be donated to Brooklands Museum Volunteer Fire Service and South East Fire and Rescue, which is a volunteer group made up of military veterans and emergency services staff.\nOriginally, six engines were due to be sent to Ukraine in April, but logistics meant only four could be sent from West Yorkshire.\nThe remaining two will be kept in the UK, to be sent at a future date if needed.", "url": "https://www.bbc.co.uk/news/articles/cvgdp5l31yno"}