{"authors": ["Jude Sheerin", "www.facebook.com"], "date_download": "2025-04-26 06:32:05", "date_modify": "2025-04-26 06:32:05", "date_publish": "2025-02-27 08:37:42", "description": "Authorities say there was no sign the couple had sustained any injuries, but no cause of death has been given.", "filename": "news_articles_cewkkkvkzn9o_1745649125.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b390/live/ca99bfc0-f52a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkkkvkzn9o_1745649125.html", "title": "Gene Hackman: Death of actor and wife 'suspicious enough' for investigation, police say", "title_page": "Gene Hackman: Death of actor and wife 'suspicious enough' for investigation, police say - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Oscar-winning actor Gene Hackman and his wife appeared to have been dead for \"quite a while\" when the couple and their dog were found on Wednesday afternoon at their home in the US state of New Mexico, police say.\nHackman, 95, was discovered in a side room near the kitchen of the house in Santa Fe, while his wife Betsy Arakawa, a 65-year-old classical pianist, was found in a bathroom.\nAuthorities reported no signs of injury but deemed the deaths \"suspicious enough\" to investigate and have not ruled out foul play. No cause of death was given.\nIn a wide-ranging career, Hackman won two Academy Awards for The French Connection and Unforgiven.\nThree of Hackman's children from a previous marriage confirmed the death of their father and Ms Arakawa in a statement to the BBC.\n\"He was loved and admired by millions around the world for his brilliant acting career, but to us he was always just Dad and Grandpa. We will miss him sorely and are devastated by the loss,\" Elizabeth, Leslie and Annie Hackman said.\nWarning: This story contains details some readers may find upsetting\nThe Santa Fe County Sheriff's office confirmed the deaths.\n\"On 26 February, 2025, at approximately 1:45pm, Santa Fe County Sheriff's deputies were dispatched to an address on Old Sunset Trail in Hyde Park where Gene Hackman, his wife Betsy Arakawa, and a dog were found deceased,\" the office said.\nIn a news conference on Thursday afternoon, Sheriff Adan Mendoza said: \"It sounds like they had been deceased for quite a while, and I don't want to guess in reference to how long that was.\"\nHe added: \"There was no immediate sign of foul play. Haven't ruled that out yet.\n\"This is an investigation, so we're keeping everything on the table.\"\nA sheriff's detective who responded to the scene said that they believed the couple had been dead for some time because of Ms Arakawa's \"decomposition\" and \"mummification\" in the hands and feet.\n\"The male decedent also showed obvious signs of death, similar and consistent with the female decedent,\" said the search warrant.\nNear Ms Arakawa's head was a portable heater, which the detective determined could have been brought down in the event that she abruptly fell to the ground.\nAuthorities say they have requested carbon monoxide and toxicology tests for both Hackman and his wife, and that a cause of death has not yet been determined as they await the results of the autopsy.\nA prescription bottle and scattered pills were on the bathroom countertop close to her body. The couple's German Shepherd dog was found dead in a bathroom closet near to Ms Arakawa.\nHackman was discovered wearing grey tracksuit bottoms, a blue long-sleeve T-shirt and brown slippers. Sunglasses and a walking cane were next to the body.\nThe detective suspected that the actor had fallen suddenly.\nThe circumstances of their death were \"suspicious enough in nature to require a thorough search and investigation\", said the search warrant, because the person who called emergency services found the front door of the property open.\nBut the detective observed no sign of forced entry into the home. Nothing appeared out of place inside. Neither was there any indication that belongings had been rummaged through, or that any items had been removed.\nTwo other, healthy dogs were discovered roaming the property - one inside and one outside.\nThe couple's 2,300 sq ft ranch-style home, part of a gated community, was valued at around $1m, according to tax records.\nHe won the best actor Oscar for his role as Jimmy \"Popeye\" Doyle in William Friedkin's 1971 thriller The French Connection, and another for best supporting actor for playing Little Bill Daggett in Clint Eastwood's Western film Unforgiven in 1992.\nA relative latecomer to Hollywood, Hackman's breathrough came in his thirties, when he was nominated for an Oscar for portraying Buck Barrow in 1967's Bonnie and Clyde - opposite Warren Beatty and Faye Dunaway - and again for I Never Sang for My Father in 1970.\nBoth films saw him recognised in the supporting actor category. He was also nominated for best leading actor in 1988 for playing the FBI agent in Mississippi Burning.\nHe played more than 100 roles during his career, including supervillain Lex Luthor in the Christopher Reeve-starring Superman movies in the 1970s and 1980s.\nHackman featured opposite many other Hollywood heavyweights including Al Pacino in 1973's Scarecrow and Gene Wilder in 1974's Young Frankenstein.\nHis last big-screen appearance came as Monroe Cole in Welcome to Mooseport in 2004, after which he stepped back from Hollywood for a quieter life in New Mexico.", "url": "https://www.bbc.co.uk/news/articles/cewkkkvkzn9o"}