{"authors": ["Jayne McCubbin", "www.facebook.com"], "date_download": "2025-04-26 06:18:50", "date_modify": "2025-04-26 06:18:50", "date_publish": "2025-03-01 07:18:00", "description": "How a \"posh boy from the south\" forged a lifetime friendship with a northern mill worker.", "filename": "news_articles_cedlldp6wg4o_1745648330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4f21/live/fdbf6a20-f5e9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cedlldp6wg4o_1745648330.html", "title": "The unlikely 50-year friendship that started in a Lancashire mill", "title_page": "The unlikely 50-year friendship that started in a Lancashire mill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fifty years ago, a young, posh, boarding school-educated photographer called Daniel Meadows went to Lancashire intent of capturing the last breaths of a dying industry.\nBut while he was there, he struck up a surprising friendship.\nStanley Challenger Graham was the man who ran the engine powering 1,000 looms at Bancroft Shed in Barnoldswick, one of the last steam-powered weaving sheds in the UK.\nIn fact, engineer Stanley is the last surviving mill worker to feature in an exhibition of the images Daniel took, which have resurfaced at the Four Corners Gallery in London and will return to Lancashire later this year.\nAnd Daniel and Stanley's friendship has lasted to this day.\nBancroft Shed was one of the last remaining steam powered cotton weaving mills in the country, its buildings and machinery having remained largely unchanged since its construction during World War One.\nAgainst the backdrop of a declining industrial landscape, Daniel began documenting the life at the mill and speaking to the people who worked there.\nDaniel's camera and microphone captured the sights and sounds of the mill from 1975 to 1980 as he worked as photographer-in-residence across the towns of Nelson, Colne, Barnoldswick and Earby.\nFrom Stanley the engineer to retired weaver Bessie Dickinson and flue cleaner Charlie Sutton, he created a portrait of Bancroft Shed's workers and their disappearing trades.\n\"It was the time of the Sex Pistols. Concorde,\" he said. \"And all these wonders of modernity and yet I found myself up there in the Pennines and I was next door to something that looked like it had come out of Dickens.\n\"And Stanley was like the high priest of steam.\"\nIn contrast, Daniel said he was \"a posh boy from the south\".\n\"There is no point in being in the north of England and trying to pretend you are anything other,\" he said. \"Because that's what they call you whether you are or not.\"\nStanley said they were indeed like chalk and cheese, but that didn't stop their friendship blossoming.\n\"Daniel was brought up being taught how to play croquet,\" he said. \"The first time I ever come across croquet, I thought that it should be restricted to consenting adults over 40. I've never seen something so violent in my life.\"\nStanley said the family \"kind of adopted\" Daniel.\n\"My wife Vera used to cut his hair and cook for him and the kids loved him.\"\nDaniel said: \"He and I would be sat in the engine house chatting and then he'd take me to the office and he'd say Vera, one extra for tea.\"\nStanley opened up his world to Daniel.\n\"I'd never met people like this,\" Daniel said. \"They were like prophets out of the Old Testament. Jeremiah characters. Shaking their stick at modernity, because they knew these jobs were going. They knew it was the end.\"", "url": "https://www.bbc.co.uk/news/articles/cedlldp6wg4o"}