{"authors": ["Tom MacDougall", "www.facebook.com"], "date_download": "2025-04-26 06:57:29", "date_modify": "2025-04-26 06:57:29", "date_publish": "2025-02-28 14:14:34", "description": "Night Run's membership has doubled and women attending say they have been harassed by men.", "filename": "news_articles_c3w11gzl72wo_1745650649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df5b/live/5f5d3a50-f5d1-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w11gzl72wo_1745650649.html", "title": "Women's running group set up after harassment", "title_page": "Doncaster: Women's running group set up after harassment - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two women who set up a female-only running group because they did not feel safe exercising after dark said membership has doubled since the start of the year.\nJade Pollitt and Sian Swift welcomed 22 people to the first monthly session of the Night Run in Doncaster, and expect around 50 at the next meet-up.\nThe group meets at the Keepmoat Stadium at 18:00 GMT tonight (28 February) for a non-competitive 5km run.\nMs Swift said members had told them they \"just wanted to feel safe\" and they were \"creating a community of women in the same position\".\nThe club is sponsored by local sportswear brand Werkhaus.\nMs Pollitt said that she had faced harassment whilst running, including an incident when a man stopped his car to ask where she was going and for her phone number.\n\"Stuff like that really puts you off from going outside and running on your own. We spoke to the other women that have joined the group to ask why, and it's always in a similar vein,\" she said.\nMs Swift said she also felt anxious during runs, so took her dog with her and avoided darker streets.\nMs Pollitt added that some men would be \"surprised\" by how many women felt unsafe.\n\"Speak to your mum, your sister, cousins, women you work with - you'd be shocked by the response you'd get.\"\nShe explained she understood \"not all men\" were a threat, but the majority of the group had said a man had harassed them at some point.\nThe pair hoped the group, which is free and open to all abilities, would continue to grow and give more women confidence whilst exercising.\nMs Swift said they were planning to host a group 5km on the last Friday of every month, but members were using a WhatsApp group to organise extra informal sessions.\n\"We want the momentum of that to keep building,\" she said.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here., external", "url": "https://www.bbc.co.uk/news/articles/c3w11gzl72wo"}