{"authors": ["Nathan Hemmingham", "www.facebook.com"], "date_download": "2025-04-26 04:29:24", "date_modify": "2025-04-26 04:29:24", "date_publish": "2025-03-03 07:02:07", "description": "Madeleine Sumption, of the Migration Observatory at Oxford University, answers your questions.", "filename": "news_articles_cjevw2p34vzo_1745641764.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7dbf/live/73f82030-f5ed-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevw2p34vzo_1745641764.html", "title": "Economic impact of immigration in Hull and East Yorkshire", "title_page": "Economic impact of immigration in Hull and East Yorkshire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC East Yorkshire and Lincolnshire has looked at immigration across the country, and the impact it is having on communities, public services and society.\nA complex topic, the BBC aims to cut through the rhetoric and get to the facts, going beyond the headlines and politics to put the issue into context.\nWe asked for your questions on the matter. Here is a selection answered by Dr Madeleine Sumption MBE, who is the director of the Migration Observatory at Oxford University.\nThe Observatory provides impartial, independent and evidence-based analysis of data on migration and migrants in the UK to inform media, public and policy debates.\nDr Guy Clayton, 58, from East Yorkshire, asks: If net migration was taken back to zero, would the UK retirement age need to change by much to maintain the region's overall current economic output and job numbers?\n\"It may to some extent, population aging is a huge problem for the UK, particularly for public finances – and migration makes some difference to this, but actually the difference is surprisingly small.\n\"So you would need very high levels of migration sustained over long periods in order to have any meaningful impact on the number of working people as a share of the overall population.\"\nLeo Hazlerigg, 56, from East Yorkshire, asks: What is the net economic impact of immigration on Hull and East Yorkshire?\n\"Overall, the economic impact of migration is actually thought to be surprisingly small.\n\"There are some benefits and there are also some pressures. For example, we often see a small benefit on public finances and on the NHS due to the number of workers, but there are also some costs.\n\"For example, we've seen that migration is one factor that has contributed to rising housing costs.\"\nSandra Walker, 64, from East Yorkshire, asks: Please can I have the annual cost for one illegal immigrant, one elderly person in a care home and one prison inmate? My point is the true cost is denied to the public. Are we being given the truth?\n\"This is something that is unfortunately quite difficult to measure – the government don't know either and that's because we don't know how many people are in the UK without legal status.\n\"We'd expect the costs to be relatively small – so if someone is here without status they may be working off the books so not paying income tax, but then they are also not eligible for benefits or health care.\"", "url": "https://www.bbc.co.uk/news/articles/cjevw2p34vzo"}