{"authors": ["Jason Lewis & Toby Paine", "www.facebook.com"], "date_download": "2025-04-26 06:54:09", "date_modify": "2025-04-26 06:54:09", "date_publish": "2025-02-28 16:13:38", "description": "Southampton and Portsmouth city councils reveal plans to cut costs aafter budget announcement.", "filename": "news_articles_c4gdd180jldo_1745650449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4827/live/e85104a0-f5ee-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdd180jldo_1745650449.html", "title": "Southampton and Portsmouth councils approve 4.99% tax rise", "title_page": "Southampton and Portsmouth councils approve 4.99% tax rise - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Both Southampton and Portsmouth City Council have approved a 4.99% council tax rise from April.\nPortsmouth City Council said that the increase, which is the maximum permitted by government, is expected to raise £5.1m for the council.\nWhile in Southampton, councillors said the budget will rely on savings made by \"transforming how the council operates\".\nBoth councils have seen increasing cost pressures, particularly in social care and temporary accommodation.\nSouthampton's Labour-led city council set a balanced budget on Wednesday, with all opposition groups voting against it, according to the Local Democracy Reporting Service.\nThose same groups voiced fears that the authority had not yet made it out of its financial mire.\nBut council leader, councillor Lorna Fielker, called the budget \"a return to long-term financial sustainability.\"\nCabinet member for finance, councillor Simon Letts, said it was the first time in 14 years that the medium-term financial strategy was balanced over its full five-year period.\nHe also confirmed that exceptional financial support (EFS) had been extended for a second year by the government.\n\"I think we are now going to go on to an era where we will be able to invest in Southampton and its citizens rather than remove services and make cuts,\" Letts said.\nLiberal Democrat group leader councillor Richard Blackman said the situation now was very different to 12 months ago when there was \"uncertainty\" and \"fear\" in the chamber.\nConservative group leader Cllr Peter Baillie said the budget needed \"favourable\" winds to survive the year \"unscathed\".", "url": "https://www.bbc.co.uk/news/articles/c4gdd180jldo"}