{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:39:45", "date_modify": "2025-04-26 06:39:45", "date_publish": "2025-03-02 15:49:47", "description": "She is the daughter of Winnie Ewing, one of the SNP's most iconic figures who died in 2023.", "filename": "news_articles_c4g029l2j49o_1745649585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/31b4/live/5d9c42c0-f779-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g029l2j49o_1745649585.html", "title": "SNP veteran Annabelle Ewing will not stand in next election", "title_page": "SNP veteran Annabelle Ewing will not stand in next election - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Veteran SNP politician Annabelle Ewing, who is also one of Holyrood's deputy presiding officers, has announced she will not run for re-election in 2026.\nMs Ewing, a former minister in previous SNP governments, said it has been an \"honour\" to represent Cowdenbeath but she will not be seeking renomination.\nShe is the daughter of Winnie Ewing, one of the party's most iconic figures who died in 2023. Ms Ewing described her mother as a \"trailblazer for women\" and a \"heroine\".\nThe MSP was first elected to represent the Mid Scotland and Fife region from 2011 to 2016, before then representing Cowdenbeath.\nShe previously served as MP for Perth from 2001 to 2005.\nScotland's First Minister John Swinney thanked Ms Ewing for her contribution over the years.\nIn a post on X, he wrote: \"I am sorry to see Annabelle standing down and thank her for the significant contribution she has made @ScotParl and @scotgov.\n\"I wish her well in all that lies ahead.\"\nMs Ewing said it was \"an honour\" to represent Cowdenbeath in the Scottish Parliament.\n\"My admiration for the grit, determination and community solidarity of my constituents is unbounded,\" she said.\n\"So, it is very hard indeed to inform my constituents of my decision not to seek nomination as SNP candidate in the May 2026 Scottish Parliamentary elections.\"\nShe thanked her staff and party members \"who have ensured that the dream shall never die\".\nMs Ewing said she would continue to stand up for her constituents in parliament until she stands down next year.\n\"I will also continue to stand up for my country and to make the case through rational and gentle persuasion for Scottish independence,\" she added.\n\"As my late mother Winnie Ewing famously said: 'Stop the world - Scotland wants to get on.'\"\nA number of MSPs from across the political parties have already announced their intention to step down, including former first minister Humza Yousaf.\nMs Ewing's announcement comes days after the SNP's Gordon MacDonald said he would not contest Edinburgh Pentlands again.\nAnd earlier in the week, Conservative MSPs Edward Mountain and Liz Smith said they would not seek re-election.", "url": "https://www.bbc.co.uk/news/articles/c4g029l2j49o"}