{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:54:06", "date_modify": "2025-04-26 07:54:06", "date_publish": "2025-02-25 13:49:52", "description": "The Botley West solar farm proposal is currently being considered by the Planning Inspectorate.", "filename": "news_articles_clyj42pd15go_1745654046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/733a/live/02d42630-f3b6-11ef-8093-8707b98f6d80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyj42pd15go_1745654046.html", "title": "Botley West solar farm brings 'positive and negative' impacts", "title_page": "Botley West solar farm brings 'positive and negative' impacts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council's views on plans to build one of Europe's largest solar farms have been drafted ahead of being submitted to the government's Planning Inspectorate.\nWest Oxfordshire District Council's submission regarding the Botley West Solar Farm proposal was discussed by the authority's Development Control Committee at a meeting on Monday.\nThe document sites the scale of the project as creating a \"potential for significant and widespread positive and negative impacts\".\nBotley West is a proposed £800m solar farm, covering about 1,000 hectares (2,471 acres) of Oxfordshire countryside, with 90% of it owned by Blenheim Estates.\nThe project is considered a Nationally Significant Infrastructure Project, meaning the application must be considered by the government, not local councils.\nAs part of the planning process, relevant parties, including the local authorities in which the development sits, can submit their response to the plans.\nAhead of the committee meeting, Andy Graham, leader of West Oxfordshire District Council, said the authority would submit a \"well-considered, evidence-based response\".\n\"By taking this approach, we can make a properly informed and impactful submission that will carry more weight,\" he said.\nMr Graham added the council had \"worked closely with local communities\" in forming its response.\nThe authority's drafted submission predominantly discusses the environmental impact of the proposed solar farm.\nIt questions the use of greenbelt land around Oxford, adding the development would \"result in a fundamental change to the landscape character\" in an area that is currently \"attractive rural countryside\".\nPhotovolt Development Partners (PVDP) submitted its plan for the site to the Planning Inspectorate in November.\nPVDP has said, if approved, the facility would generate 840MW of renewable energy to the National Grid - enough to power the equivalent of 330,000 homes.\n\"There's a bit of democratic deficit here,\" Calum Miller, the MP for Bicester and Woodstock, said.\n\"This is a national strategic infrastructure project but as a result the decision will be taken a long way away from the residents of the area that will be most affected.\n\"I want to see their voices reflected, in particular when it comes to the community benefits that should go alongside any renewables project,\" he added.\n\"The amount that's been offered by the developers in my view is derisory.\"", "url": "https://www.bbc.co.uk/news/articles/clyj42pd15go"}