{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:58:56", "date_modify": "2025-04-26 03:58:56", "date_publish": "2025-03-04 12:50:38", "description": "Brie McCann suffers from a rare heart condition called Ebstein's anomaly.", "filename": "news_articles_cjrylyry9l1o_1745639936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e486/live/b5f19550-f8f1-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjrylyry9l1o_1745639936.html", "title": "'Time running out' for girl after cancelled heart op", "title_page": "'Time running out' for girl after cancelled heart op - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A family say they have been \"left in the dark\" over a heart transplant for their daughter - three months after planned surgery was cancelled hours before it was due to take place.\nJodie McCann said \"time is running out\" for Brie, 5, who suffers from a rare heart condition called Ebstein's anomaly.\nBrie was to undergo the first of two planned heart surgeries last December, but doctors at Great Ormond Street Hospital in London felt she was too unwell to proceed with the operation.\nThe family were told the schoolgirl required a heart transplant instead, but there has been no progress since then. Jodie told BBC Scotland News her daughter's condition has been \"deteriorating\".\nGreat Ormond Street Hospital said it was \"deeply sorry\" for the worry caused to Brie and her family and that it was working to place her on the list for a transplant.\nJodie, from Robroyston in Glasgow, told the BBC's Good Morning Scotland programme the family travelled to London for the surgery on 12 December last year.\nHowever, around two hours before the operation was supposed to take place they were told it could not go ahead.\nJodie said the possibility of surgery not going ahead - and that a heart transplant would be required instead - had only been mentioned once previously, during a brief phone call.\nJodie explained: \"We waited in a room for ages because we were told the consultant and the surgeon wanted to speak to us. The exact words that were used were 'we don't want to do the surgery today because we don't want to unalive your daughter. The only thing that we can do now is look for a heart transplant.'\n\"At that moment the heart transplant team entered the room. In that time as well, they stated they had been sitting on the fence for a while [about the operation] but we weren't kept in that loop. It was a massive shock. After that we were sent up the road.\"\nEbstein's anomaly, external is a congenital heart disease where a person has trouble with the tricuspid valve, which helps control blood flow in the right side of the heart.\nIt can causes a variety of different health problems, with Brie suffering breathlessness, constant coughing, dizziness, fatigue and having a swollen tummy, partly because her heart and liver are larger than normal.\nBoth Great Ormond Street and NHS Greater Glasgow and Clyde health board told BBC Scotland News they had been communicating with the family since the cancellation.\nThat is disputed by the McCann family, who say they have been \"left in the dark\" regarding both the initial decision and follow-up plans.\nJodie recalled: \"Brie had a pre-assessment the day before surgery and had five hours of tests. Brie's also autistic so it was really hard going for her. They didn't even mention at that time that the surgery might not go ahead.\"\nJodie said she has been told by local doctors it is now \"months not years\" for her daughter's life expectancy without a transplant, but the family have been warned it could take years to go ahead unless Brie's condition is upgraded to urgent.\nGreat Ormond Street Hospital said it was continuing to work with the McCann family \"to get Brie onto the heart transplant list\" as soon as possible.\nThe hospital's Dr Matthew Fenton said: \"For every child we care for, our staff always have their best interests at the heart of all decision making.\n\"Unfortunately, Brie was not well enough for our team to perform surgery safely.\"\nA spokesperson for NHS Greater Glasgow and Clyde sad it was continuing to offer support to the family.\nThey said: \"We know this is an extremely challenging and distressing time for the family, and we recognise the importance of us continuing to provide support to them through the multidisciplinary cardiac team at the Royal Hospital for Children.\n\"Today we have again offered to meet with the family to discuss how we make best use of this local support and to keep them fully informed of the next steps in their daughter's care.\"\nHowever Jodie said Brie is \"getting worse day by day.\"\nShe added: \"I need to save my daughter's life. That's what I want to fight for.\"", "url": "https://www.bbc.co.uk/news/articles/cjrylyry9l1o"}