{"authors": ["Ammar Ebrahim", "www.facebook.com"], "date_download": "2025-04-26 07:34:39", "date_modify": "2025-04-26 07:34:39", "date_publish": "2025-02-27 15:37:35", "description": "Tom Binet defends his decision not to consult the public on plans to restructure the health service.", "filename": "news_articles_c7577rp7n4ro_1745652879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50a2/live/d24b1290-f50d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7577rp7n4ro_1745652879.html", "title": "Jersey health minister has no plans to consult public", "title_page": "Jersey health minister has no plans to consult public - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jersey's health minister has defended his decision not to consult the public on plans to restructure the health service.\nEarlier this year deputy Tom Binet revealed plans to separate the health service from government, with a new board running it through a separate fund.\nAt a debate on Tuesday some States members said they were shocked public opinion hadn't been sought on the plans.\nBinet told the BBC after the debate public consultation on the restructure was not needed.\nHe said: \"Do people want me to consult on matters that aren't appropriate for public consultation and delay things or do they want me to get on with the job? For my part I came into this job to get on with things.\n\"I'm working as hard as I can to get as much done as I can. My inbox is full of people moaning about the health service and I'm determined to make some changes to make that health service improve for people.\"\nBinet said he had already spoken to \"professionals, charities, care homes, home care, general practitioners\" about the plans and described this as \"pretty comprehensive\".\nDeputy Jonathan Renouf, who sits on the health and social security panel said: \"It's all very well to want to get on and do it, but we want to make sure we are doing things right and the only way to do that is by putting the plans under scrutiny, some of that is done by politicians but the public have a right to do it as well.\n\"That's a fundamental part of democracy and this minister has a disparaging view of that process.\"\nRenouf also highlighted to the States Assembly that in July 2024 the health minister had sent a letter to the hospital review panel saying a public consultation would happen., external\nBinet said this was an \"oversight\" as he didn't think a consultation needed to happen.", "url": "https://www.bbc.co.uk/news/articles/c7577rp7n4ro"}