{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:10", "date_modify": "2025-05-19 15:36:10", "date_publish": "2015-02-09 09:33:08", "description": "A school in Dorset announces it will be partially closed for two days due to staff illness.", "filename": "news_uk-england-dorset-31206404_1747668970.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80854000/jpg/_80854711_80853010.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-dorset-31206404_1747668970.html", "title": "St. Aldhelm's Academy partially closes over staff sickness", "title_page": "St. Aldhelm's Academy partially closes over staff sickness - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A school in Dorset has announced it will be partially closed for two days due to staff illness.\nPoole's St Aldhelm's Academy told parents it would close to Years 7, 8, 9 and 10 on Friday \"due to staff shortage and for health and safety reasons\".\nThe Diocese of Salisbury, which part-sponsors the school, said nine staff members were absent due to illness.\nIt said it was working to recruit supply teachers and has apologised to parents for the closure.\nPoole councillor Janet Walton said nine teachers have flu but using supply teachers was \"not sustainable\".\nThe school will remain open to Year 11 and sixth form pupils.\nBournemouth West MP Conor Burns, who held meetings with parents over the weekend, believes the staff illness is a \"symptom\" of wider problems at the school.\n\"I think staff morale is on the floor, good teachers are leaving. The sponsorship arrangements have clearly not worked,\" he said.\n\"The young people tell me they are seeing substitute teachers who are just holding the class together rather than advancing learning.\"\nKerry Manning, who has three children at the school, said she only read about Friday's closure in a Facebook post by the school at 21:00 on Thursday.\n\"It's really frustrating. I don't believe it is all down to staff sickness - there is a lot more in the bigger picture.\n\"There is no consistency, good teachers have left the school. It's not fair on the children - they deserve a decent education and this community deserves a decent school.\"\nReverend David Price, chairman of the governors, said families were \"naturally worried\".\nHowever, he said they should be confident the school was \"seeking the best way forward\".\nA spokesman for the Diocese of Salisbury said it was currently working as an \"interim\" sponsor of the school until a permanent one is found - after its permanent role ended in 2014.\n\"Throughout, our primary concern has always been the welfare and attainment of students, and we remain committed to working with any future permanent sponsor to ensure as smooth a transition as possible,\" he said.\nSchools minister Nick Gibbs confirmed Ambitions Academies Trust was being lined up to take over St Aldhelm's.\nThe school was put in special measures after it was rated as inadequate in an Ofsted report, external last October.", "url": "https://www.bbc.com/news/uk-england-dorset-31206404"}