{"authors": ["Stewart Whittingham", "www.facebook.com"], "date_download": "2025-04-26 03:52:29", "date_modify": "2025-04-26 03:52:29", "date_publish": "2025-03-03 10:13:02", "description": "The £40m investment will \"breathe life back into the town centres\", the government says.", "filename": "news_articles_cn7vzjmp5z6o_1745639549.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0ee5/live/a806dda0-f802-11ef-bd63-43b586fa3f07.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn7vzjmp5z6o_1745639549.html", "title": "Oldham and Rochdale get £40m regeneration windfall", "title_page": "Oldham and Rochdale get £40m regeneration windfall - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two towns in Greater Manchester are to get £20m each from the government that will go towards building thousands of new homes, a new market and college classrooms.\nOldham and Rochdale will benefit from funding from the Ministry of Housing, Communities and Local Government (HCLG) which will also be used to boost job skills and more affordable homes for local people.\nLocal Growth Minister Alex Norris said that money enabled the two towns to tackle issues that really matter to the region, rather than a \"one-size fits all approach\".\nOldham Council leader councillor Arooj Shah said the investment was a \"gamechanger\", while Rochdale Borough Council leader councillor Neil Emmott said he was \"delighted\".\nThe government's \"plan for change, external\" focuses on six \"milestones\" it aims to achieve by the next general election, including raising living standards and building 1.5m homes in England.\nIn Oldham, funding will help build up to 2,000 new homes across four sites, including the Prince's Gate development site, and improve the town's private rented sector stock and quality.\nThe One Oldham Fund - which pools resources for the voluntary, community, faith and social enterprise (VCFSE) sector in the town - will receive funding, and millions will also be invested in sports education and facilities, the HCLG said.\nIt added Oldham town centre's retail offering would be maximised by supporting traders from Tommyfield Market to relocate into the Spindles shopping centre, the development of an outdoor market in George Square and the redevelopment of vacant retail units.\nShah said the \"huge cash investment\" would help restore \"pride and hope to our borough\" and would \"supercharge the ambitious regeneration plans we have for the borough\".\nShe said: \"This £20m of investment into Oldham really is a gamechanger.\"", "url": "https://www.bbc.co.uk/news/articles/cn7vzjmp5z6o"}