{"authors": ["Joshua Askew", "www.facebook.com"], "date_download": "2025-04-26 08:13:10", "date_modify": "2025-04-26 08:13:10", "date_publish": "2025-02-26 11:27:34", "description": "Officers found the weapons hidden in the footwell of an SUV travelling to the UK from France.", "filename": "news_articles_clyzepy7k9yo_1745655190.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8b55/live/4e708b50-f434-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyzepy7k9yo_1745655190.html", "title": "Firearms, ammunition and drugs seized at border", "title_page": "Dover: Firearms, ammunition and drugs seized at border - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Firearms, ammunition and drugs have been seized from a vehicle attempting to enter the UK.\nA submachine gun, skorpion guns and pistols were among the 13 confiscated weapons, while 5kg of heroin was also discovered in Dover, the National Crime Agency (NCA) said.\nOfficers found the items, which also included 300 rounds of ammunition, inside a custom-built section of the SUV's footwell as it entered the country from France.\nKasha Sanderson, 39, of Wick, Bristol, has been charged with importation of firearms, ammunition and Class A drugs in connection to the seizure.\nDaren Nicholls, NCA senior investigating officer, said it was a \"significant seizure of deadly firearms that were destined for the UK criminal marketplace\".\n\"Our investigation to track down the organised criminals responsible for this attempted importation continues at pace,\" he said.\n\"Stopping the availability of firearms to UK-based criminals is a top priority for the NCA, and we work closely with domestic and international partners to do this.\"\nThe NCA said that tests were ongoing to verify if the weapons were viable.\nSanderson is due to appear at Canterbury Crown Court next month.", "url": "https://www.bbc.co.uk/news/articles/clyzepy7k9yo"}