{"authors": ["Nick Thorpe &", "Hafsa Khalil", "www.facebook.com"], "date_download": "2025-04-26 04:37:38", "date_modify": "2025-04-26 04:37:38", "date_publish": "2025-02-28 11:08:04", "description": "The brothers face rape and human trafficking charges, which they deny.", "filename": "news_articles_c3e44qev1dvo_1745642258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4177/live/1e36a0f0-f5bf-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e44qev1dvo_1745642258.html", "title": "Minister questions why Tate brothers were allowed to leave Romania", "title_page": "Minister questions why Tate brothers were allowed to leave Romania - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Romania's Justice Minister Radu Marinescu has called for a public explanation into why controversial social media influencers Andrew and Tristan Tate were allowed to leave the country on Thursday.\nThe brothers - who are currently facing charges including human trafficking in Romania - had been under a travel ban for more than two years before it was lifted, allowing them to fly to the US.\nMarinescu has asked the special prosecution service, Diicot, to \"conduct any investigation necessary to uncover the truth promptly, correctly, and impartially\".\nAndrew, 38, and his brother Tristan, 36, have strongly denied the allegations against them.\nThe brothers are dual US-UK citizens, and were first arrested in Romania in 2022, where they are accused of human trafficking and forming an organised group to sexually exploit women. Andrew Tate is also accused of rape.\nThey spent several months under house arrest in Romania, before prosecutors announced on Thursday that the travel ban had been lifted and the pair's US passports had been returned to them.\nDespite this, investigations into their alleged crimes have not been dropped and they are expected to return to Romania.\nIn the US they also face a civil case from a woman who alleges the brothers coerced her into sex work, and then defamed her after she gave evidence to Romanian authorities.\nThe brothers also face separate charges in the UK of rape and human trafficking.\nOn Friday, four British women who have accused Andrew Tate of rape and coercive control urged the UK government to \"immediately request Tate's extradition from the US to the UK to face justice\".\nThey said in a joint statement that if it did not, \"it won't just be us it will be failing, but all British victims of alleged sexual violence\".\nThey added: \"We do not doubt the home secretary's personal commitment to victims of sexual violence, but we need action, not words.\"\nThe brothers' exit has sparked concerns that Romanian prosecutors felt political pressure from the Trump administration. On Thursday, the US president said he knew nothing about their release.\nRomania's justice minister said the Tate brothers \"risk pre-trial detention\" if they fail to return to Romania to face continued investigation in the cases against them.\nBut international human rights lawyer Silvia Tabusca, who has been following the proceedings, does not believe the brothers will return to Romania.\nShe told the BBC Andrew Tate was \"technically correct\" when, upon arriving in Florida, he said there was no live indictment against him and his brother, because a second case has not yet been presented to a judge.\nIn December 2024, the Court of Appeals in Bucharest ruled that an original indictment - the first case - which was issued in June 2023 could not proceed to trial in its current form.\nIn August, Romanian authorities began a second investigation over new allegations of trafficking of minors, sexual intercourse with a minor and money laundering.\nWhen both cases have been submitted to the court, they will become live.\n\"It's actually a sort of lull in the two cases against them,\" Ms Tabusca explained.\n\"A big question mark hangs over whether they will ever return there to face trial, what the US government would do in such a situation, and what pressure the UK government is putting on the US to extradite them to the UK to face trial on another set of charges there.\"\nRomania's justice minister said the Tate brothers \"risk pre-trial detention\" if they fail to return to Romania to face continued investigation in the cases against them.\n\"There are legal mechanisms in place to resolve this situation,\" Marinescu said, which could be a reference to the extradition treaty between the US and Romania.\nCalls for a public explanation of why their travel ban was lifted comes as many Romanians express concern that there appears to be one law for the rich and influential, and another for ordinary citizens.", "url": "https://www.bbc.co.uk/news/articles/c3e44qev1dvo"}