{"authors": ["Georgina Rannard", "www.facebook.com"], "date_download": "2025-04-26 07:33:35", "date_modify": "2025-04-26 07:33:35", "date_publish": "2025-02-27 16:02:47", "description": "The pea-sized brain was found in the skull of a 20-year-old man killed in the volcanic eruption.", "filename": "news_articles_cgr2n8xx5gyo_1745652815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f937/live/23cb9850-f532-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgr2n8xx5gyo_1745652815.html", "title": "Man's brain turned to glass by Vesuvius volcano ash cloud", "title_page": "Man's brain turned to glass by Vesuvius volcano ash cloud  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nearly 2,000 years after a young man died in the Vesuvius volcanic eruption, scientists have discovered that his brain was preserved when it turned to glass in an extremely hot cloud of ash.\nResearchers found the glass in 2020 and speculated that it was a fossilised brain but did not know how it had formed.\nThe pea-sized chunks of black glass were found inside the skull of the victim, aged about 20, who died when the volcano erupted in 79 AD near modern-day Naples.\nScientists now believe a cloud of ash as hot as 510C enveloped the brain then very quickly cooled down, transforming the organ into glass.\nIt is the only known case of human tissue - or any organic material - turning to glass naturally.\n\"We believe that the very specific conditions that we have reconstructed for the vitrification [the process of something turning into glass] of the brain make it very difficult for there to be other similar remains, although it is not impossible,\" Prof Guido Giordano from Università Roma Tre told BBC News.\n\"This is a unique finding,\" he said.\nThe brain belonged to a man killed in his bed inside a building called the Collegium on the main street of the Roman city Herculaneum.\nThe fragments of glass found by the scientists range from 1-2 cm to just few millimetres in size.\nThe massive eruption of Vesuvius engulfed Herculaneum and nearby Pompeii where up to 20,000 people lived. The remains of about 1,500 people have been found.\nScientists now think the hot ash cloud descended from Vesuvius first, probably causing most of the deaths.\nA fast-moving current of hot gas and volcanic matter, also called a pyroclastic flow, followed, burying the area.\nExperts believe the ash cloud turned the man's brain into glass because the pyroclastic flow would not have reached high enough temperatures or cooled quickly enough.\nThe process of glass formation requires very specific temperature conditions and rarely occurs naturally.\nFor a substance to turn to glass, there must be a huge temperature difference between the substance and its surrounding.", "url": "https://www.bbc.co.uk/news/articles/cgr2n8xx5gyo"}