{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:06", "date_modify": "2025-05-19 14:52:06", "date_publish": "2015-02-27 12:41:09", "description": "The people of Lesotho vote on 28 February in an early general election, called as part of regional efforts to dissipate political tensions in the impoverished mountain kingdom after a coup was thwarted last year.", "filename": "news_world-africa-31643701_1747666326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81287000/jpg/_81287123_abc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31643701_1747666326.html", "title": "Will Lesotho election be peaceful?", "title_page": "Will Lesotho election be peaceful? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The people of Lesotho vote on 28 February in an early general election, called as part of regional efforts to dissipate political tensions in the impoverished mountain kingdom after a coup was thwarted last August.\nThe country - an enclave within South Africa - is home to some two million people - known as Basotho - more than 50% of whom live below the poverty line. The country also suffers Africa's third-highest Aids/HIV rate.\nThe last election (2012) saw the Democratic Congress party (DC) - led by ex-prime minister Bethuel Pakalitha Mosisili - win the largest number of seats (48), but fail to get a majority.\nThree parties - All Basotho Convention (ABC - 30 seats), Lesotho Congress for Democracy (LCD - 26 seats) and Basotho National Party (BNP - 5 seats) - formed the country's first coalition government.\nBut squabbling over power between Prime Minister Thomas Thabane (ABC), Deputy Prime Minister Mothetjoa Metsing (LCD) and Sports Minister Thesele 'Maseribane (BNP) set the scene for the coalition's failure.\nAnd Mr Thabane's anti-corruption drive seems to have been the last straw. Mr Metsing - the subject of a corruption probe - declared in June 2014 that he would oust Mr Thabane. The latter responded by suspending parliament.\nThe security forces have always played a part in politics in Lesotho resulting in a number of coups.\nIn August 2014, the military - known to have ties to Mr Metsing - attacked police headquarters in the capital Maseru. The prime minister - known for his ties to the police - fled to South Africa after a tip-off from his soldier bodyguards.\nMr Metsing took over the reins in Mr Thabane's absence. Both he and the army denied that there had been a coup, but South Africa said \"the activities of the Lesotho Defence Force thus far bear the hallmarks of a coup d'etat\".\nA government spokesman warned that South Africa would not tolerate \"such unconstitutional change of government\", but said taking military action was a \"last resort\".\nSouth African Deputy President Cyril Ramaphosa is the Lesotho facilitator for regional bloc Southern African Development Community (Sadc).\nHe has worked hard to reconcile the parties, convincing them to sign the Maseru Security Accord. He also succeeded in getting them to agree to bring the general election forward by two years under the Maseru Facilitation Accord.\nAny Basotho national over 18 who has been registered to vote may do so, but this only applies within Lesotho. The electoral law says only public officers employed by the government abroad are eligible to vote abroad.\nThere will be 3,000 polling stations with 779 male and 337 female candidates to vote for.\nAdvance voting for those on duty on 28 February - security personnel etc - took place on 21 February.\nLesotho has adopted a mixture of First-Past-The-Post (FPTP) and Proportional Representation (PR). The National Assembly's 120 seats are allocated in an 2:1 ratio between the FPTP and the PR components.\nEighty seats will be allocated based on constituency votes; one candidate for each constituency. Forty seats will be allocated to reflect the share of the national vote.\nThe upper house of parliament, the Senate, has 33 members - 22 principal chiefs and 11 other members appointed by the ruling party. The king's role is mainly ceremonial and he can be removed by the council of chiefs.\nSadc countries have sent 475 police officers to help keep peace during the election. Meanwhile soldiers have been ordered to remain in their barracks on election day.\nBoth Sadc and African Union are sending observers. And political leaders have reportedly signed an electoral pledge that they \"will uphold respect and the constitution of Lesotho as well as accepting the final results of the elections\".\nBBC Monitoring, external reports and analyses news from TV, radio, web and print media around the world. You can follow BBC Monitoring on Twitter , externaland Facebook, external.", "url": "https://www.bbc.com/news/world-africa-31643701"}