{"authors": ["Simon Jack", "www.facebook.com"], "date_download": "2025-04-26 04:06:45", "date_modify": "2025-04-26 04:06:45", "date_publish": "2025-03-03 00:05:57", "description": "Jes Staley wants to overturn a decision by the UK regulator banning him from holding a senior role in the City.", "filename": "news_articles_crlxjn7879lo_1745640405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7dda/live/352d2250-f805-11ef-bd63-43b586fa3f07.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crlxjn7879lo_1745640405.html", "title": "Ex-Barclays boss with Epstein links seeks to clear his name", "title_page": "Ex-Barclays boss with Epstein links seeks to clear his name  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former boss of Barclays, who was ousted from the bank over his links to convicted sex offender Jeffrey Epstein, will seek to clear his name in court this week.\nJes Staley was forced out in November 2021 after UK regulators ruled he had failed to accurately disclose the nature and length of his relationship with Epstein to the Barclays board.\nThe episode cost Mr Staley, a man with a glittering and rewarding career in investment banking, £18m in pay and bonuses and, more importantly, his reputation.\nMr Staley is seeking to overturn a decision by the Financial Conduct Authority in 2023 banning him from holding a senior position in financial services.\nJes Staley had been disciplined by regulators in 2018 over his attempts to unmask a whistleblower he felt was unfairly trying to smear a colleague. But the crucial blow to his position at Barclays was his insistence that his relationship with Epstein was \"not close\" and had ended before he took up the top job at the UK bank.\nA cache of emails released by his former employer JP Morgan suggested the relationship was in fact very close.\nEmail exchanges describe time spent together at Mr Epstein's properties in New York and on his private island in the US Virgin Islands.\nA now infamous email thread shows Mr Staley remarking to Epstein \"that was fun, say hi to Snow White\". Epstein replies \"what character would you like next? To which Mr Staley replies \"beauty and the beast!\".\nThere are also allegations that he and Epstein stayed in contact indirectly after he took the Barclays job. Mr Staley's lawyers insist that any such moves were initiated by Epstein and Mr Staley made no attempt to contact Epstein.\nAll of this will be aired in a court that will call former regulators and executives as witnesses and many have questioned why Mr Staley, who is now 68 and extremely wealthy, would want this publicity all over again.\nJes Staley is a tough and fiercely proud man. He enjoyed a very successful career on Wall Street and many thought he was destined to take over at the helm of his old employer JP Morgan – the biggest investment bank in the world.\nInternally he was popular with most of his banking colleagues. His ill-fated attempt to unmask a whistleblower he thought was smearing an old colleague, was seen by some – but not all – as evidence of fierce loyalty to his own troops.\nThat willingness to go into battle will be on show in the coming days, but seems unlikely to restore his reputation or future position to the one he enjoyed before he was shown the door at Barclays.", "url": "https://www.bbc.co.uk/news/articles/crlxjn7879lo"}