{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:50", "date_modify": "2025-05-19 15:37:50", "date_publish": "2015-02-09 20:50:04", "description": "Parents of children at an East Sussex school put into special measures are offered alternative places in London schools.", "filename": "news_uk-england-sussex-31323526_1747669070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80660000/jpg/_80660224_school.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-sussex-31323526_1747669070.html", "title": "Failing Bexhill St Mary's School pupils offered London places", "title_page": "Failing Bexhill St Mary's School pupils offered London places - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Parents of children with speech, language and communication difficulties at an East Sussex school put into special measures have been offered alternative places in London schools.\nOfsted inspectors have rated St Mary's School and Sixth Form College, in Bexhill, East Sussex, as inadequate, external,\nTen London authorities have written to parents offering \"alternative good quality provision\".\nThe school said it had not had any notification of the letters.\nThe parents have until the end of the week to decide if they want to move their children from St Mary's.\nThe letter said: \"The south London boroughs of Bromley, Bexley, Croydon, Merton, Wandsworth, Sutton, Lewisham, Greenwich, Kingston and Richmond are working together to ensure that the children in our boroughs are receiving a good quality of education.\"\nThe letter said the authorities were \"disappointed with the decline in quality of the school and have grave reservations about their ability to turn the school around\".\nThe parents were told: \"We would be happy to work with you to find good quality provision.\"", "url": "https://www.bbc.com/news/uk-england-sussex-31323526"}