{"authors": ["Naj Modak", "www.facebook.com"], "date_download": "2025-04-26 06:18:23", "date_modify": "2025-04-26 06:18:23", "date_publish": "2025-03-01 07:28:50", "description": "Emergency workers share how they balance fasting for Ramadan with their demanding jobs.", "filename": "news_articles_cn04w360nkzo_1745648303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/36aa/live/ccf710d0-f613-11ef-b599-299506faa8db.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04w360nkzo_1745648303.html", "title": "Yorkshire emergency workers on balancing Ramadan fasting with work", "title_page": "Yorkshire emergency workers on balancing Ramadan fasting with work - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Emergency workers who are observing Ramadan this month have spoken of the challenges of balancing up to 30 days of fasting with meeting the demands of their jobs.\nRamadan began 10 to 12 days earlier this year, on Friday evening in the UK, because the Muslim calendar year is shorter than the 365 days of the Gregorian calendar year.\nDuring the month, Muslims will not eat or drink between dawn and sunset to devote themselves to their faith and come closer to Allah, or God.\nEmma Ward, a firefighter for North Yorkshire Fire & Rescue Service, said her job involved training in the gym every day, and then carrying heavy equipment.\nShe said: \"Something takes over during Ramadan, it doesn't feel like you're starving all day.\"\nMs Ward, who has been a firefighter for nine years, said she converted to Islam three years ago and that fasting for the first time was \"surprisingly easy\" for her - despite the strenuous job.\nShe said she tried to take her leave during Ramadan, but otherwise made sure to get up to eat and stay hydrated before sunrise.\nDuring daylight hours she craved fruit and cereal - as well as her morning coffee.\nShe said it \"really makes you appreciate how little food that you need\" and said it made her feel better after the first few days, giving her more energy and focus.\nGulshan Ditta has been a police officer with North Yorkshire Police for five years.\nMs Ditta admitted fasting was \"difficult and a challenge\", saying: \"But the whole purpose of Ramadan is to take you out of your comfort zone so you can emphasise with the hardships that people go through and it makes you more reflective.\"\nShe said her role was demanding and sometimes she had to break her fast a little later than planned, which could take a physical toll.\nShe said she missed samosas the most during fasting.", "url": "https://www.bbc.co.uk/news/articles/cn04w360nkzo"}