{"authors": ["Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 04:18:21", "date_modify": "2025-04-26 04:18:21", "date_publish": "2025-03-04 06:36:58", "description": "Sharmila Bayliss, from Lewes, is undertaking the challenge to raise funds for Citizens Advice.", "filename": "news_articles_cy4v8dgvdkgo_1745641101.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9c6a/live/a56c4180-f842-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4v8dgvdkgo_1745641101.html", "title": "Lewes woman to trek to Everest base camp for charity", "title_page": "Lewes woman to trek to Everest base camp for charity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Lewes woman is to undertake the challenge of trekking to Mount Everest's base camp to raise funds for charity.\nSharmila Bayliss, 56, volunteers for Citizens Advice and is no stranger to taking on extreme challenges.\nTwo years ago, she hiked 62 miles (100km) in the Sahara Desert, raising £7,000 for Martlets in the process.\nMs Bayliss said although she was \"petrified\" of the freezing temperatures and altitude sickness, she was determined to do something exceptional to inspire people to donate to Lewes District Citizens Advice.\nMs Bayliss said she had worked hard to get \"super fit\" for the trek.\n\"Unfortunately, if you're unlucky to get altitude sickness, then it's pretty much game over,\" she said.\n\"There's not a lot that you can do because you obviously have to stay medically safe.\"\nThe former dentist said due to the cost of living crisis, Lewes District Citizens Advice had been inundated with calls.\nShe says it is vital they raise funds to maintain services and support to thousands of people every year.\n\"Citizens Advice is an invaluable service. At the moment, I can't tell you how busy we are with people phoning us with issues such as homelessness and rental costs,\" she said.\n\"It's become a mission of mine because when you are volunteering, you see the effect of Citizens Advice and the help it gives to people and how it changes their lives.\"\nSarah Archer, chief executive, adds Lewes District Citizens Advice is local and independent charity that supports people across Lewes District.\nMs Bayliss is set to travel to Nepal on 22 March.", "url": "https://www.bbc.co.uk/news/articles/cy4v8dgvdkgo"}