{"authors": ["Robbie Meredith", "www.facebook.com"], "date_download": "2025-04-26 07:58:09", "date_modify": "2025-04-26 07:58:09", "date_publish": "2025-02-25 11:57:59", "description": "A proposal to allow the use of Irish in court was contained in the New Decade New Approach deal in January 2020.", "filename": "news_articles_c1lpvn6369po_1745654289.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e506/live/20b008c0-f377-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1lpvn6369po_1745654289.html", "title": "Irish language NI court ban set to be lifted due to 18th Century law repeal", "title_page": "Irish language NI court ban set to be lifted due to 18th Century law repeal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Irish language is set to be used in court in Northern Ireland due to the repeal of a law that is almost 300 years old.\nA proposal to allow the use of Irish in court was contained in the New Decade New Approach deal in January 2020.\nBut it required the repeal of a penal law from 1737 which made it \"a criminal offence to use any language other than English\" in court.\nAccording to the Northern Ireland Office (NIO), Secretary of State Hilary Benn has now signed the commencement order which repeals the act.\nThe move has been welcomed by the president of the Irish language organisation Conradh na Gaeilge, Ciaran Mac Giolla Bhein.\n\"This same legislation was repealed in England and Wales well over 150 years ago,\" he told BBC Radio Ulster's Good Morning Ulster programme.\n\"It brings into focus the historical context in which we're talking about a revival of the Irish language,\" he said.\n\"The reason we need a revival is because Irish was identified as the chief target in the colonial process.\"\nHe said there was a deliberate process to try to make Irish \"extinct\".\n\"We need to understand where we've come from, to understand the particular nature of the support that we need,\" he said.\nSinn Féin assembly member Aisling Reilly described the repeal of the law as \"a hugely significant moment for Gaels in the north\".\n\"For Irish speakers, this is another positive step in the right direction as the energetic revival of the language continues at pace,\" she added.\nHowever, TUV leader Jim Allister MP said: \"The repeal of the ban on Irish in our courts is a regressive move in terms of equality, justice and finances.\n\"The change will result in the legal profession becoming more a cold house for the unionist community who are already underrepresented in the sector.\"\nSpeaking on BBC Radio Ulster's Evening Extra programme, Irish-speaking solicitor Niall Murphy said that \"today is a momentous day\".\nHe added that the penal law was \"a very regressive, malicious set of laws\".\n\"That it has taken almost 300 years to have that struck from the statutory record is lamentable but we have to welcome the positives and today is a very positive day for the Irish speaking community.\"\nThe Identity and Language (Northern Ireland) Act was passed in Westminster in 2022.\nIt enabled many of the language changes agreed by politicians in New Decade New Approach in 2020 to go forward.\nBut parts of the legislation passed in 2022 have to be \"commenced\" in Parliament.\nThat is what the secretary of state is now doing regarding the use of the Irish language in court.\nIn a letter to Conradh na Gaeilge, Benn said that while he would commence repeal of the 1737 Act, the implementation would be a matter for the Executive.\nIn a statement, the NIO said: \"The provision to repeal the 1737 Act is part of the Identity & Language (Northern Ireland) Act 2022, which is for the Northern Ireland Executive to implement.\n\"Implementation of the Identity & Language Act will help enshrine respect and tolerance for all of Northern Ireland's diverse identities, cultures and traditions.\"\nBBC News NI has asked the Department of Justice if Justice Minister Naomi Long has to issue guidelines before Irish can be used in legal proceedings in Northern Ireland.\nA spokesperson for the Northern Ireland Department of Justice said that the Justice Minister \"welcomes the long overdue repeal of the 1737 Act\" and that is an \"important recognition of the importance of Irish to many in our community\".\n\"It will not, however, change the common law position that English is the working language of the courts\", they added.\nAlliance Executive Office spokesperson Paula Bradshaw said that the move is \"belated but welcome\".\nBradshaw called on the first and deputy first minister to \"move forward with the Identity and Language Act in its entirety, and not least with the appointment of the three relevant Commissioners\".\n\"There is no excuse for further delay\", she added.\nCuts to an Irish language bursary scheme were among the reasons the Stormont executive collapsed in 2017.\nThe Department for Communities, under the then minister Paul Givan, cut funding to the Líofa Gaeltacht Bursary Scheme.\nAlthough the funding was subsequently restored, the then deputy first minister Martin McGuinness said the £50,000 cut was part of the reason for his resignation.\nThe New Decade New Approach deal in January 2020, which then paved the way for the restoration of the Executive, included a number of measures for the Irish language and Ulster-Scots.\nThat included the creation of a new Office of Identity and Cultural Expression and two separate language commissioners.\nOne commissioner is to be appointed to \"recognise, support, protect and enhance the development of the Irish language in Northern Ireland\".\nThe other is to \"enhance and develop the language, arts and literature associated with the Ulster Scots/Ulster British tradition\".\nBut the role of the Ulster British commissioner has been questioned.\nAnd despite the New Decade New Approach deal being agreed five years ago, the commissioners have yet to be appointed.\nHowever, simultaneous translation services in Irish and Ulster-Scots can now be used in the Northern Ireland Assembly.\nIn 2024, an Assembly committee heard evidence conducted entirely through the medium of Irish for the first time.", "url": "https://www.bbc.co.uk/news/articles/c1lpvn6369po"}