{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 15:01:19", "date_modify": "2025-05-20 15:01:19", "date_publish": "2023-07-27 00:00:00", "description": "Researchers believe this month will be the hottest ever recorded - even with several days to go.", "filename": "news_live_world-66323843_1747753279.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1643A/production/_130549119_italyheatwave-index-reuters.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-66323843_1747753279.html", "title": "Climate change threat 'existential' says Joe Biden, as world faces hottest July", "title_page": "Climate change threat 'existential' says Joe Biden, as world faces hottest July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How heat officers are tackling extreme temperatures\nMadeline Halpert\nUS reporter\nChief heat officers are a new and rare phenomenon - there are only three in the entire United States - but experts say they are becoming key figures on the front line of climate change.\nOver the past few years, the cities of Miami, Los Angeles and Phoenix have all hired the officials. They are tasked with both short- and long-term tasks: protecting the most vulnerable residents during heat emergencies and brainstorming how to make cities more resilient to high temperatures in the future.\nIn Phoenix, where temperatures have soared above 110F (43C) for nearly a month, chief heat officer David Hondula has had his work cut out.\n“I've been on the phone and sending more text messages than I can remember in my life. There’s this constant coordination and engagement and creativity and brainstorming,” he told the BBC.\nAt the weekends, Hondula has been heading out with his team on the city’s trailheads to warn residents about the heat to try to prevent dangerous mountain rescues.\nIn the background, he’s also working on implementing the city’s tree planting programme to shield residents from heatwaves in the future.\n“There's a lot of work to do ahead of us,” Hondula said.\nHow can technology help tackle climate change?\nMatt McGrath\nEnvironment correspondent\nTechnology is not a silver bullet for the climate crisis - but it does offer significant hope.\nIn East London, Mission Zero have developed what they say is a better, more cost-effective way of extracting carbon dioxide gas from thin air.\nThe start-up is one of a handful benefitting financially from some of the richest companies in Silicon Valley.\nElsewhere, many governments have long-standing plans to use nature to remove carbon - namely by planting trees.\nIn west Wales, this has led to an influx of speculators keen to buy farmland that can be turned into forests.\nBut Hefan Jones, who farms cattle near Carmarthen, has serious concerns: \"It would effectively turn parts of Wales into a carbon dumping ground so that other sectors could carry on business as usual it seems.\"\nThere are also growing concerns that relying on trees to remove carbon from the atmosphere over the next 100 years is a flawed concept - scientists argue the carbon needs to come out of the air right now.\nExperts are divided about removing carbon from the atmosphere - as it might distract from plans to reduce emissions - but there's a growing recognition that both approaches are needed.\nClimate change still reversible, says expert\nAs we've been reporting, scientists say July is \"virtually certain\" to be the world's warmest month on record.\nOne of the authors of today's report, Christ Hewitt, the director of climate services at the World Meteorological Organization has been speaking to the BBC.\nHe predicts that the at least one of the next five years will be the hottest on record, and says it's likely one of those years will temporarily exceed the threshold of 1.5C above pre-industrial average temperatures.\nLimiting warming to 1.5C is a target built into the Paris Agreement and is seen as key to avoiding the most dangerous impacts of climate change.\nThe limit was partly designed to avoid crossing so-called \"tipping points\" - thresholds beyond which changes could accelerate and become irreversible in different parts of the Earth's climate system, such as the collapse of the Greenland Ice Sheet.\nHewitt notes that we are already seeing global mean temperatures above the 1.5C threshold, but these are temporary, for \"days or perhaps weeks\", rather than the long-term periods referred to in the Paris Agreement. But as the planet warms \"we are getting closer\" to the threshold, he says.\nIs the warming we are now seeing reversible? \"Yes\" he says. But he adds: \"We need to take dramatic and drastic action as soon as possible.\"\nRead more: Really simple guide to climate change\nTackling the 'silent killer' of heat\nMadeline Halpert\nUS reporter\nExperts and chief heat officials in the US told the BBC that local governments face a host of challenges in trying to combat extreme temperatures.\nExtreme heat has been called a “silent killer” because it claims thousands of lives each year, though the threats are not always immediately visible to the public.\nThis poses challenges for tracking down and protecting the most vulnerable Americans.\n“It's not like with a hurricane, or a storm surge or forest fire, where you know where the damage is,” said Jane Gilbert, Miami’s chief heat officer. “An elderly single woman living alone in an apartment, we may not find her until it’s too late.”\nClimate scientists say that though summers will likely only get hotter, local governments often lack the resources to tackle the problem until it’s too late.\n“This is not your grandmother’s heat any more,” said Ashley Ward, director of Duke University’s Heat Policy Innovation Hub.\n“When we do the examination of this heat season, I think we're going to find how woefully unprepared we are and how much we lack the infrastructure to respond.”\nNYC subways are like an underground sauna\nPratiksha Ghildial\nReporting from New York\nAt the underground subway station this morning, while waiting for my train, I could feel an unusually hot waft of air hit my face like it does in a sauna.\nPeople were using paper fans to cool themselves and everybody breathed an audible sigh of relief when the air conditioned coach arrived.\n“It feels like the world is ending,” said Jessica, a subway cleaning worker, who has lived all her life in New York.\nHer job requires her to be in a non-airconditioned environment most of the time.\n“It’s horrible, it’s torturous. I try to take cooling and water breaks when I can.”\nAfter weeks of relentless heat in the south-west, now millions of Americans in the north-east of the country are experiencing dangerously high temperatures.\nCities have put out heat advisories - including asking citizens to limit outdoor activity and seek medical advice if necessary.\nAuthorities in cities like New York say they have opened “cooling centres” in public libraries and community centres - particularly for vulnerable people without air-conditioning.\nSome of these also welcome pets. It was also announced that swimming pools in the city will operate with extended hours.\nTemperatures are expected to peak in the region on Friday.\nTexas can lead the way on green energy, says San Antonio mayor\nWe are hearing now from the San Antonio Mayor Ron Nirenberg - he's not affiliated with either major party.\nHe praises the policies of the president, and highlights some of the steps that his city has made towards its climate goals.\nHe says the ending of the use of coal is imminent, and will come in well ahead of schedule.\nMayor Nirenberg also notes that 75% of the city are communities of colour, who are disproportionally affected by the changing climate.\nSustainability and green energy are no longer four letter words in the state of Texas, he says.\nHe says San Antonio has become the fifth largest solar producer in the United States - and says communities across Texas have committed to becoming “greener and more equitable”.\n\"The state best known for oil and gas production can help lead the way to a greener tomorrow,\" he says.\nPhoenix mayor says they need long term solutions\nThe Mayor of Phoenix, Kate Gallego (who's a democrat) now joins virtually. The city has faced 27 days of temperatures above 110F (43 C).\nShe starts by saying that Phoenix is known for heat but \"this summer has been unprecedented\".\nKate adds: \"Phoenix is on the front line of climate change. A large part of our effort is getting our residents inside as much as possible.\"\nShe explains that Phoenix have been focused on this since \"day one\".\nShe says declaring the heat a disaster from Congress would improve the impact and help to build \"long term solutions\".\nBiden begins by talking about record temperatures across the US\nJoe Biden is talking about the current heatwave, saying: \"We're here today ... to talk about the existential threat of climate change - and it is a threat.\"\nHe says: \"I don't know anyone who honestly believes that climate change is not a problem.\"\nBiden explains that tackling climate change is politically divisive because many Republicans won't say extreme weather is being caused by it.\nHe says that adds to the battle to get legislation through.\nBiden adds that extreme heat is costing America \"$1bn a year\".\nOver 150 million Americans under heat alert at present\nJon Donnison\nReporting from Washington DC\nWith 40% of Americans, over 150 million people, currently living under some kind of heat alert, this announcement from President Biden is timely.\nHere, outside the White House itself, temperatures are expected to rise to 37C (98.6F) this afternoon, but that’s positively mild compared to elsewhere in the US.\nThe measures being put forward by the President today include better protection for workers during hot spells, especially those who work in construction or farming.\nThere will be another $7 million (£5.4 million) to improve the nation’s weather forecast and $152 million (£118.1 million) to increase water storage capacities in drought stricken western states.\nBut the criticism will be that these measures deal with the symptoms of climate change rather than the causes and that, faced with a congress inclined to drag its feet on the introduction on measures to significantly reduce US carbon emissions, President Biden has not acted quickly or effectively enough.\nBiden to announce new measures to deal with heatwaves\nWe're going to turn our attention to the US shortly, where millions of Americans are facing extreme heat across the southwest.\nWe're expecting to hear from President Joe Biden, who is is set to announce measures to relieve the situation - according to a White House press release this will involve improving weather forecasts and making drinking water more accessible.\nClimate activists and some Democrats have pushed Biden to declare a climate “emergency,” but so far the White House has resisted.\nKarine Jean-Pierre, the White House press secretary, has described the heat wave as “a difficult time” and said Biden was treating climate change with “the urgency it requires.”", "url": "https://www.bbc.com/news/live/world-66323843"}