{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:13", "date_modify": "2025-05-19 15:29:13", "date_publish": "2017-08-21 00:00:00", "description": "The latest news, sport, travel and weather for Herefordshire and Worcestershire on Friday 25 August 2017.", "filename": "news_live_uk-england-hereford-worcester-40978856_1747668553.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-hereford-worcester-40978856_1747668553.html", "title": "BBC Local Live: Herefordshire & Worcestershire", "title_page": "BBC Local Live: Herefordshire & Worcestershire on Friday 25 August 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watch: Today's weather for the West Midlands\nCharlie Slater\nBBC Weather presenter\nA wet start for some of us - here's how the rest of Wednesday is looking.\nYou can also find updated weather forecasts at any other time via the BBC Weather website.\nMarket place's £1.5m transformation approved\nPlanning permission has been given on a £1.5m project to transform Angel Place in Worcester city centre.\nThe regeneration will see the refurbishment of the main entrance to Crowngate Shopping Centre, in Friary Walk, which is already home to retailers including New Look, Mothercare and Vision Express.\nThe plans will complete the regeneration of Angel Place as a market place and public square, the council says.\nFresh image issued of wanted man\nA fresh image of a man wanted on suspicion of a serious sexual offence and wounding with intent to cause grievous bodily harm, external has been issued by police.\nWest Mercia Police is warning the public not to approach Ashley Shearon, who's 48, but to contact them if they see him.\nA49 collision: Tractor pulling hay and 4x4 involved\nThe fatal collision on the A49 last night involved a 4x4 and a tractor pulling a trailer with hay on it, the ambulance service says.\nIt happened at 21:45 on the A49 between Bryn Garth and Much Birch, near to the Axe & Cleaver pub.\nWest Midlands Ambulance Service says the driver of the 4x4 died at the scene and a 34-year-old woman, who was a front seat passenger, was taken to Hereford County Hospital with facial injuries.\nThe 49-year-old tractor driver was \"clearly distressed but... uninjured\", a spokesman said.\nTrial of 'roundabout camper' postponed\nThe trial of a Hereford woman who has been sleeping in public places for months, including the main roundabout in Hereford and the bandstand in Ross-on-Wye, has been postponed until 11 September.\nSamantha Lamputt is charged with breaking a criminal behaviour order.\nMan jailed for starting huge fire at market\nKevin Reide\nReporter, Midlands Today\nA man has been sentenced to five years in prison for a fire at Birmingham's Wholesale Market in 2015.\nStephen Wilkinson, 60, of Mickleton Close, Redditch, had earlier this month been found guilty of arson reckless as to whether life was in danger, having set fire to a pile of boxes, causing damage to the venue totaling more than £500,000.\nHe had worked at the market from the age of 15.\nWilkinson is set to be released on licence upon serving two and a half years.\nAt its peak, 40 firefighters tackled the severe blaze at the site in Pershore Street, Digbeth.\nMilitary wives choir to sing at cathedral\nThe Military Wives Choir will sing in Worcester as part of a national tour of cathedrals.\nThe choir, made up of wives and partners of Armed Forces personnel and women from the wider military community, will perform at Worcester Cathedral on 22 November.\nSlideshow: Leaves, fruit and fields\nBBC Weather Watchers\nThere may not be the glorious sun about we enjoyed on the bank holiday, but BBC Weather Watchers have still been busy with their cameras.\nThanks to J at Severn Ridge, Johnqa, Happysnapper71 and Wendywoo for these photos\nQuo to headline Sunshine Festival\nStatus Quo will be rocking all over Upton-upon-Severn at next year's Sunshine Festival, the organisers have announced.\nA crowd of 6,000 people attended the three-day music event this year, which came to an end over the bank holiday weekend.\nHospice given the go-ahead for £5m extension\nA hospice has been given planning permission for a £5.3m extension and redevelopment.\nSt Richard's Hospice will go ahead with the redevelopment of its site at Wildwood Drive, in Worcester, to help it meet \"the ever-increasing need for hospice care\".\nThe redevelopment will involve a new reception area, larger rooms suitable for exercise based groups, an occupational therapy kitchen, more counselling rooms and a bigger social and eating area.\nQuote Message\n“We are already at full capacity and the demand is set to rise sharply with our aging population and people living longer with multiple illnesses such as heart failure, Parkinson’s, and motor neurone disease as well as cancer\nJune Patel, St Richard's Hospice", "url": "https://www.bbc.com/news/live/uk-england-hereford-worcester-40978856"}