{"authors": ["Will Jefford", "www.facebook.com"], "date_download": "2025-04-26 07:30:10", "date_modify": "2025-04-26 07:30:10", "date_publish": "2025-02-27 17:49:17", "description": "Coventry City Council says it will not receive the £1m it is owed.", "filename": "news_articles_c5y99kgd4l7o_1745652610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b8a3/live/6da60360-f506-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y99kgd4l7o_1745652610.html", "title": "City of Culture creditors will not be repaid", "title_page": "Coventry City of Culture creditors will not be repaid  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Creditors who are collectively owed more than £4.2m by the Coventry City of Culture Trust will not be repaid, an administrator has said.\nThe trust was created in October 2015 to oversee Coventry's bid and subsequent holding of the huge event throughout 2022 and 2023.\nHowever, it collapsed amid financial trouble in February 2023, with debts of hundreds of thousands of pounds owed to creditors, including Coventry City Council and West Midlands Police.\nAdministrators have recouped about £550,000, but have now moved to dissolve the organisation, meaning most creditors will not be paid back.\nThe report, authored by joint administrator Mike Kienlen, head of restructuring and insolvency at Armstrong Watson, confirmed the administration period ended on Thursday.\nThe company, which used forensic accountants during its investigation, also confirmed it would not pursue legal action against the trust, after an agreement was made with a committee of creditors.\nThe \"risks and costs\" of doing so \"outweigh any potential benefit\", the firm said.\nAs well as £1m owed to the council, the trust also owed £1.5m to arts organisation Assembly Festival and £505,000 to West Midlands Police.\nA spokesperson for the city council said it was continuing to comply with the Charity Commission, which was also completing an investigation into the trust.\n\"The administration of the trust and the now confirmed loss of our loan, alongside the losses of a range of other creditors, is bitterly disappointing and is not the outcome anyone wanted to see,\" they said.\n\"We know the loan was spent on maintaining cultural activity in the city and ensured payments to both suppliers and to major and smaller cultural bodies that had provided content and events.\"\nOn top of the larger loan, other funds of tens of thousands of pounds were also paid to the trust by Culture Coventry, The Albany Theatre and Coventry University.", "url": "https://www.bbc.co.uk/news/articles/c5y99kgd4l7o"}