{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 07:05:48", "date_modify": "2025-04-26 07:05:48", "date_publish": "2025-02-28 06:21:11", "description": "Dudley Zoo and Castle will provide the 70% discount to people claiming Universal Credit.", "filename": "news_articles_cvg11p02030o_1745651148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b3e9/live/cda9df60-f4fd-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg11p02030o_1745651148.html", "title": "West Midlands zoo offers discounted entry to benefits claimants", "title_page": "West Midlands zoo offers discounted entry to benefits claimants - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A zoo in the West Midlands is trialing discounted tickets to people who claim Universal Credit, to help families with lower budgets enjoy the facilities.\nDudley Zoo and Castle will also provide the 70% discount to people claiming Working Tax Credit, Child Tax Credit, Employment and Support Allowance, Income Support and Jobseeker's Allowance.\nThe £6 tickets can only be purchased online, for entry between 1 March and 31 March.\nCustomers will need to show benefit payment proof, named ID and a booking confirmation on arrival.\nFamilies are able to purchase up to six tickets per household for entry between 10:00 GMT and 12:00 GMT, said the zoo.\nTo qualify, customers must have received a benefit payment within the last month.\nDirector Derek Grove said: \"As a charity, we want everyone to be able to have the opportunity to visit and not only see the fantastic animals and castle our 40-acre site houses, but also discover more about the wonderful natural world around us.\n\"We're trialling this offer to ensure the zoo is available to as wide a range of family budgets as possible, and we would be delighted if it enabled people to visit us who wouldn't otherwise be able to.\"\nTickets for the scheme, which are limited to a certain amount per day, cannot be purchased at the gate.\nCustomers are not required to enter the zoo at the exact time on the ticket, but must enter the zoo between the stated entry and before the last admission.", "url": "https://www.bbc.co.uk/news/articles/cvg11p02030o"}