{"authors": ["Bea Swallow", "Dawn Limbu", "www.facebook.com"], "date_download": "2025-04-26 04:17:31", "date_modify": "2025-04-26 04:17:31", "date_publish": "2025-03-04 07:28:15", "description": "Luis Piovesana's sister says \"We are completely devastated, he has passed away\".", "filename": "news_articles_c30m7pg1n05o_1745641051.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c07c/live/f70047a0-f908-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c30m7pg1n05o_1745641051.html", "title": "Luis Piovesana's family 'devastated' after body found in river", "title_page": "Luis Piovesana's family 'devastated' after body found in river - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The sister of a missing Bristol man has said her family is \"devastated\" after confirming his body was found by police divers on Monday.\nMore than 100 officers had been involved in the search for Luis Piovesana, 26, along with friends and family.\nAvon and Somerset Police said the family had been updated after the body was found by officers searching the River Frome in the Napier Road area of Eastville at 18:00 BST on Monday.\nIn a social media post Lubjana Piovesana said: \"Luis has been found. We are completely devastated, but he has passed away.\"\nAvon and Somerset Police said: \"At around 6pm today (Monday 3 March), a dive team was searching the River Frome in the Napier Road area of Eastville, Bristol, when they located a body.\n\"While formal identification has not yet taken place, detectives have met with Luis' family and updated them.\n\"Our thoughts remain with them during this incredibly difficult time and they continue to be supported by specialist officers.\"\n02:55 on Friday 28 February – Mr Piovesana was last seen by friends getting into a taxi outside the Jam Jar in Little Ann Street, St Jude's.\n03:03 – He then made a 999 call to police, lasting 34 seconds. Attempts were made to call him back, police say, but these went unanswered and so a text was sent to his phone asking him to confirm if he was safe. Officers then tried to establish where the call had been made from.\n03:04 – Police received a call from a member of the public concerned about a man walking near Junction 2 of the M32. Officers went to the scene but did not find the man, and police say they are \"keeping an open mind\" about whether this relates to Mr Piovesana.\n03:15 – 03:30 – CCTV footage released by police shows Mr Piovesana in multiple locations at Eastgate Retail Park. The last confirmed sighting of him was near the Click and Collect facility at the back of the Tesco Extra car park.\nHis bag, phone and wallet were later found discarded at the retail park by a friend using a tracking app linked to his phone, with CCTV footage later showing him abandoning the items.\n07:37 - Mr Piovesana is reported missing and an investigation is launched.\n18:00 on Monday 3 March - A police dive team find a body while searching the River Frome.\nMr Piovesana, originally from Birmingham, was last seen on CCTV at about 03:30 GMT on Friday at Eastgate Retail Park.\nHe had travelled there via a taxi from the Jam Jar venue on Little Ann Street, St Jude's, just a 10-minute drive away.\nMs Piovesana, 28, flew from Austria to Bristol to join the search efforts for her brother on Monday, alongside 50 friends and volunteers.\nHis family spent the weekend tirelessly searching for him, and urged people to check their gardens, sheds, dashcams and doorbell footage for any sign of him.\nA close friend of seven years, Harry Wall, described Mr Piovesana as an \"incredible guy who could light up a room\".\nHe said: \"His energy could just be felt, he never struggled to get on with people. We love and miss him dearly\".\nHe added Mr Piovesana \"hadn't displayed any behaviour to show he was feeling in a bad way\" prior to his disappearance.", "url": "https://www.bbc.co.uk/news/articles/c30m7pg1n05o"}