{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:21", "date_modify": "2025-05-19 15:30:21", "date_publish": "2017-08-09 00:00:00", "description": "Bringing you the latest news, sport, travel and weather for the Channel Islands on Wednesday 9 August 2017.", "filename": "news_live_world-europe-jersey-40824398_1747668621.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_world-europe-jersey-40824398_1747668621.html", "title": "BBC Local Live: Channel Islands on Wednesday 9 August 2017", "title_page": "BBC Local Live: Channel Islands on Wednesday 9 August 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our coverage across the day\nWe'll be back on Thursday from 08:00 with the latest news, weather, travel and sport.\nDon't forget BBC Channel Islands News on BBC One at 18:30 and 22:30.\nThere will also be news through the night on your BBC Local Radio station.\nSteroid awareness campaign to make users aware of dangers to health\nRob England\nBBC News Online\nHigh blood pressure, blood clots and heart attacks are just a few of the potential side effects a new steroid awareness campaign hopes to draw users attention to in Guernsey.\nThe island's misuse of drugs advisory group is teaming up with local gyms to target steroid users or those considering using them.\nThe campaign is focusing on anabolic steroids, which are manufactured drugs used to enhance athletes performance by mimicking the effects of the male hormone testosterone.\nThey are different from Corticosteroids, which are also referred to by healthcare professionals as Steroids, which are prescribed to fight inflammation and are used to treat symptoms such as rheumatoid arthritis, asthma and eczema.\nQuote Message\nThe psychological effects can include aggressive or manic behaviour, mood swings, hallucinations and delusions. Like many other substances, anabolic steroids are addictive. I would encourage anyone who would like any further advice or help to contact their GP or Drug Concern.\"\nNikki Brink, Deputy Director, Public Health\nNew 'female wing' for Guernsey prison opens tomorrow\nRob England\nBBC News Online\nNew female accommodation at Guernsey Prison will be officially opened on Thursday.\nThe facilities were first recommended by Her Majesty’s Inspector of Prisons in 2009, but at the time they were considered \"not economically viable\".\nA States spokeswoman said women had \"tended to be marginalised\" within the system, which was largely designed for men.\nShe added, due to the low numbers of women in Guernsey prison, they lacked the opportunity to access the full regime available for vocational skills and experience and it was hoped the new facilities would enable offenders to access support to help reduce re-offending.\nThe new accommodation was created from two unused areas of the prison and is hoped to provide a \"safe environment\".\nBusinesses 'need to adapt' in Jersey to manage population control\nBBC Radio Jersey\nJersey's assistant chief minister has said businesses \"need to adapt\" to manage population control.\nSenator Paul Routier has been speaking as the number of working licences is cut by 283.\nThe chief minister's department said it is part of new measures to reduce the number of foreign workers businesses can employ on the island.\nSenator Routier says businesses have to make jobs more appealing to local workers.\nQuote Message\nThere's a culture change that needs to happen. I accept the unsocial hours of working in bars is very, very difficult. But businesses themselves need perhaps to change their culture of the way they work, tailor their hours to how much people want to work.\"\nSenator Paul Routier, Assistant Chief Minister, States of Jersey\nDairy 'struggling to cope' with increased demand for Guernsey butter\nEuan Mahy\nBBC Radio Guernsey\nDemand for salted Guernsey butter is 37% up on the same period last year, meaning the Dairy's struggling to supply local wholesalers.\nThe Guernsey Dairy general manager Andrew Tabel says they're unable to increase supply and will continue to produce four and a half tonnes per week.\nHe appealed to customers not to buy more salted butter than they need.\nQuote Message\nAt the minute we have a unique problem which is challenging us, but it's also a good news problem, it's good for the island and good for the local dairy industry. The popularity of our butter is such that we've actually sold 37% more butter this year than the same period over the first six months of last year.\"\nAndrew Tabel, General Manager, Guernsey Dairy\nCricket: Jenner cleared to represent Jersey\nJames Law\nBBC Sport Online\nSussex batsman Jonty Jenner has been cleared to play for Jersey in the World Cricket League in September by the International Cricket Council (ICC).\nJenner was 12th man for England's first Test against South Africa which, under ICC rules, would normally prevent him from playing for Jersey for two years.\nHowever the Jersey Cricket Board (JCB) has been given dispensation to pick the 19-year-old for the tournament.\nJersey coach Neil MacRae is expected to announce his full squad on Friday.\nPedestrian involved in collision on Queen's Road dies\nThe 71-year-old man involved in a collision on Queen's Road, St Helier on Friday has died in hospital.\nThe pedestrian has been named as John Reidy.\nThe States of Jersey Police say his next of kin have been informed and are being supported by Family Liaison Officers.\nAnyone who saw the collision, which also involved a white Peugeot car near to the entrance of Mount Edgcumbe Flats is asked to contact police.\nMissing man found\nRob England\nBBC News Online\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nRoads closed for Battle of Flowers\nTwitter\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post 2\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post 2\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post 3\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post 3\nCT Plus to operate extended services in Guernsey for North Show\nRob England\nBBC News Online\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nJersey Post 'met targets' set by regulator\nBBC Radio Jersey\nJersey Post says it has met all targets set by the Channel Islands Competition Regulator (CICRA) for the second quarter of 2017.\nIn June, CICRA highlighted concerns that Jersey Post had failed to meet three of its nine quality of service targets last year.\nThe failures were attributed to the amount of mail which should have been delivered the day after it had been posted.\nSince then Jersey Post says it has made a 63% improvement in next day mail coming into the island between December 2016 and June this year, its best performance since August 2015.", "url": "https://www.bbc.com/news/live/world-europe-jersey-40824398"}