{"authors": ["Caroline Robinson", "www.facebook.com"], "date_download": "2025-04-26 06:35:09", "date_modify": "2025-04-26 06:35:09", "date_publish": "2025-02-27 06:15:41", "description": "Volunteer groups in Devon and Cornwall are trying to encourage more people to read for fun.", "filename": "news_articles_cpvme19g7gpo_1745649309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7e15/live/887c0ec0-e9ec-11ef-bd23-93fd6373c807.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpvme19g7gpo_1745649309.html", "title": "Can book fans turn the page on decline in reading?", "title_page": "Can book fans turn the page on decline in reading? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From venturing to Middle Earth to solving crime with Poirot, reading can be a form of escapism and relaxation.\nBut, according to statistics recorded in 2024, half of UK adults rarely pick up a book to read for enjoyment, some 8% fewer than in 2015.\nVolunteer groups in Devon and Cornwall are hoping to address the decline with a number of initiatives.\nFrom a silent reading club in Plymouth to \"book fairies\" who hide interesting reads around Cornwall, book lovers aim to open a new chapter on the story of people's relationship with reading.\nMost imagine reading to be a solitary pastime but a group in Plymouth has found fellowship through enjoying books together.\nMembers of the Silent Book Club, which meet in venues around Plymouth, bring their favourite books to read quietly for an hour before chatting and sharing recommendations.\nThe club has its roots in the USA where it was formed by Guinevere de la Mare, with her friend Laura Gluhanich, in 2012.\nFrom its beginnings in San Francisco it has grown to have more than 1,500 chapters in 54 countries, including Plymouth in Devon.\nMs de la Mare said when she started the club she was working full time, had a young child and did not have time for the \"homework\" that came with ordinary book clubs.\n\"I found, especially being a mum, taking an hour to sit on the couch and read a book ...there's that guilt that's associated with that.\"\nShe said her favourite thing about the club was it allowed people to \"unapologetically carve out time to do something that they love\".\nAlice Nichols said it was her second time attending the club which meets at various venues in Plymouth three times a month.\n\"I was like, great, people who share my interests so I came, it was fantastic and everyone was so welcoming, I had so much fun so I'm just going to keep coming.\"\nAnother reader, Keeleigh Forest, said she had tried other book clubs but they did not work for her.\n\"They all tend to read the same book and it's not always a great vibe. But here you can bring whatever you're reading,\" she said.\n\"If you've got an audiobook just bring your earphones, but you make great friends, all like-minded people, and it's absolutely brilliant. I wish we met more often.\"\nResearch by The Reading Agency, external, a charity encouraging leisure reading, including audiobooks and e-books, found those who considered themselves readers reported higher levels of social connection, sleep, better concentration and higher empathy.\nCarina Spaulding, the agency's head of research and evaluation, said data in a 2024 report showed reading as an activity in itself helped people feel more connected to others.\nShe said the greatest barrier to reading was a lack of time, but other factors included time spent on social media, lack of enjoyment and poor mental health.\nDr Steve Minton, associate professor in applied psychology at the University Of Plymouth, said people might automatically link the recent decline in reading to social media.\nBut he thought the \"endemic factors of poverty and access to books\" affected potential readers of all ages with library closures a significant factor.\nDr Minton said between 2016 and 2024, more than 180 UK libraries had closed, which meant access to books was more reliant on the voluntary sector.\n\"I praise volunteers and the people who are giving their time to book clubs,\" he said.\n\"I can't help but lament the closure of public libraries which have a very important community function.\"\nThe Reading Agency found low confidence in reading was a barrier for UK adults with 11% finding reading \"always\" or \"usually\" difficult. This rose to 22% in young adults (16 -24-year-olds).\nThe charity Read Easy provides one-to-one coaching for adults who are unable to read but want to learn.\nRegional adviser Lindsay Alderton said not being able to read impacted people and their families as it was harder to find secure work.\nShe said people were also less able to support children or grandchildren and everyday activities, such as shopping or using the internet, could be difficult.\n\"In our experience, struggling to read can significantly affect a person's confidence and sense of wellbeing, and limit their capacity to participate fully in their community,\" said Ms Alderton.\nIn Cornwall, a group of \"fairies\" are helping give people greater access to books.\nUnlike the fairies found in story books, they do not have wings or leave money in exchange for teeth, but instead hide books in public places for people to find.\nKate Pearson, a fellow Cornish book fairy, became involved after finding a book on a bench while out with her children.\n\"I was so thrilled to get that book and so excited that I reached out and contacted Carys and said how do I get involved in this?\"\nShe added hiding children's books was her favourite: \"I dropped a book, I was waiting for a ferry ... a mother found it with her child and they sat and read it together .... it gives you a little bit of a nice warm feeling.\n\"I think that people connect through books quite often, I think for those people out there who are a bit lonely it is a way of connecting with other people.\"", "url": "https://www.bbc.co.uk/news/articles/cpvme19g7gpo"}