{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:50", "date_modify": "2025-05-19 15:31:50", "date_publish": "2015-02-20 02:01:11", "description": "Eurozone finance ministers are said to be edging closer towards a deal with Greece over its bailout, but crisis talks are continuing.", "filename": "news_business-31545115_1747668710.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81120000/jpg/_81120505_81120501.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31545115_1747668710.html", "title": "Greece bailout deal edges closer as ministers talk", "title_page": "Greece bailout deal edges closer as ministers talk - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Greece and its eurozone creditors appear to be nearing a bailout deal as finance ministers meet in Brussels.\nA draft agreement is being discussed to secure the agreement of all partners.\nThe European Union's economics commissioner, Pierre Moscovici, tweeted from the emergency meeting to say they were making progress.\nNegotiators on both sides said Greece and creditors had agreed a draft text that could form the basis for final agreement on extending the bailout.\nThe development comes after a day of negotiations in Brussels between Germany and Greece about the Greek request for more help.\nGermany's Wolfgang Schaeuble and Greece's Yanis Varoufakis met IMF managing director Christine Lagarde and Jeroen Dijsselbloem, the Dutch finance minister who heads the Eurogroup.\nThe Eurogroup meeting was delayed by four hours as the finance ministers worked in clusters where details of the statement were discussed.\nEarlier on Friday, Mr Dijsselbloem said the situation was quite complicated: \"It will take some time, but there is still reason for some optimism, but it is still very difficult.\"\nThe EU president, Donald Tusk, has rejected a Greek request for a further eurozone summit to be scheduled for Sunday if no deal is concluded today.\nFailure to reach an agreement could leave Greece with little over a week before it runs out of money.\nArriving for the Eurogroup meeting, Mr Varoufakis said he hoped there would be a deal struck on Friday.\n\"The Greek government has not just gone the extra mile, but the extra 10 miles, and now we are expecting our partners not to meet us halfway, but a fifth of the way... Hopefully at the end of this, we come out with some white smoke,\" he said.\nMeanwhile, French President Francois Hollande reiterated that Greece belonged in the eurozone and there were no plans for it leaving, following talks in Paris with German Chancellor Angela Merkel.\n\"Greece is in the eurozone and it must remain in the eurozone,\" he told a joint news conference with Mrs Merkel.\nMrs Merkel said German politicians were \"very much geared towards Greece remaining in the euro\", adding that the Greek people had \"made a lot of sacrifices\" to do so.\nHowever, she said there was a need for \"significant improvements in the substance\" of the Greek request ahead of a vote in the German parliament next week.", "url": "https://www.bbc.com/news/business-31545115"}