{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:25:36", "date_modify": "2025-05-19 14:25:36", "date_publish": "2015-04-03 02:30:40", "description": "People travelling by rail over Easter should \"think twice\" because of widespread engineering works, Transport Secretary Patrick McLoughlin says", "filename": "news_uk-32172510_1747664736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82104000/jpg/_82104569_trainworks.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-32172510_1747664736.html", "title": "Easter travel disruption likely on rail and roads", "title_page": "Easter travel disruption likely on rail and roads - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "People travelling by rail over Easter should \"think twice\", Transport Secretary Patrick McLoughlin has said.\nHe told the Evening Standard, external large-scale rail engineering work may make journeys more difficult.\nSeveral major rail routes are affected, particularly the London to Scotland West Coast main line, parts of Kent and lines running through Reading.\nThe RAC, external said four million motorists were expected to travel on Good Friday and some 4.5 million on Easter Sunday.\nArriva Trains, external said passengers in Wales travelling to London would face delays due to engineering works.\n\"There will be alternatives and we've lifted almost all motorway roadworks to help,\" Mr McLoughlin said.\nMore than 550 miles of roadworks have been put on hold over the weekend by Highways England, external, formerly the Highways Agency.\nFor safety reasons the speed restrictions will remain in place but the roadworks, on England's motorways and major A roads, will not resume until Tuesday.\nMr McLoughlin said \"an army of 14,000 workers\" would be working around the clock over the Easter weekend to upgrade train lines.\n\"But if you are travelling between Friday and Monday night please check your journey first, it may be that you'll think twice about how you travel.\n\"I'm sorry if it is more difficult - but my promise is that the work is essential and when it's done the benefits will be worthwhile.\"\nOne passenger travelling on the sleeper train from Inverness to London Euston told the BBC that the delays were worse than expected.\nShe said that passengers had been expecting a 90-minute delay after receiving a warning email a few weeks ago. However, after being diverted down the East Coast line, passengers faced a \"long wait at Wembley\", she said, where engineering works were taking place.\nBreakdown company Green Flag said 54,000 call-outs were expected over the weekend, with one puncture every minute. It said the M4 was likely to be one of the worst-congested roads.\nThe coach company National Express, external said it planned to provide 33,000 extra seats to cope with the extra demand from passengers.\nAccording to the travel group Abta, 1.8 million Britons are heading abroad over the weekend, with Spain and Florida among the top destinations.\nHeathrow Airport, external said it was expecting a record-breaking Easter weekend with more than 800,000 passengers passing through.\nThe airport, which expects a 40% rise in the number of families travelling with small children, has called in 150 extra staff members.\nGatwick Airport, external will see some 480,000 passengers between Good Friday and Easter Monday - an increase of about 11% on Easter last year.", "url": "https://www.bbc.com/news/uk-32172510"}