{"authors": ["Alex Dunlop", "Mariam Issimdar", "www.facebook.com"], "date_download": "2025-04-26 04:32:33", "date_modify": "2025-04-26 04:32:33", "date_publish": "2025-03-03 05:28:32", "description": "Ukrainian supporters turn up at Sandringham in support of Zelensky who was meeting King Charles.", "filename": "news_articles_c93klklwkr5o_1745641953.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ebc9/live/4e524180-f7f0-11ef-8bd7-b5fd0484620c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93klklwkr5o_1745641953.html", "title": "Supporters on Zelensky's Sandringham visit with King Charles", "title_page": "Supporters on Zelensky's Sandringham visit with King Charles - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The president of Ukraine's meeting with King Charles at his Norfolk home has been welcomed by local people and Ukrainians living in the county.\nVolodymyr Zelensky was in London at a summit prior to his trip to the Royal Sandringham Estate on Sunday, where he had an hour-long private audience with the King.\nHis visit followed a political fall-out between him, President Trump and Vice President JD Vance in the Oval Office on Friday.\nMore than 30 people waving Ukrainian flags gathered on the estate to await Zelensky's arrival, and the BBC spoke to some of them.\nOlena Batista, 42, lives in King's Lynn. The housing association worker has been in the UK for almost 22 years, but since the invasion of Ukraine, her parents - who live near Lviv - have spent more time with her in Norfolk.\nMs Batista expressed her thanks to the people of the UK \"for their military and humanitarian support\" for her country.\nShe said the King meeting Zelensky was \"very, very important\".\n\"All other Ukrainian people living here are really, really grateful,\" she said.\n\"The gesture from King Charles is really important for us, because it is showing solidarity with Ukraine. It's amazing what he's done.\"\nAlison Cook and Robert Warwicker, two friends who live in a village nearby, decided to show their support by coming to Sandringham after they heard Zelensky was visiting.\nMs Cook said: \"It seemed like an opportunity not to be missed really.\n\"Having seen what's been going on in the press in recent days especially, we just wanted to come along and show or support.\"\nNeither have any affiliation with Ukraine, and Mr Warwicker said the fall-out between the leaders had left him feeling \"rather helpless\".\nHe said it was \"a sense of right and wrong\" that had prompted him to turn up.", "url": "https://www.bbc.co.uk/news/articles/c93klklwkr5o"}