{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 03:46:31", "date_modify": "2025-04-26 03:46:31", "date_publish": "2025-03-05 05:42:03", "description": "Stephen Grime KC says cross-examining mothers in court was the worst aspect of the case.", "filename": "news_articles_cm2n0km8gp8o_1745639191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5487/live/7dc8ee00-f8f9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2n0km8gp8o_1745639191.html", "title": "Corby toxic waste case KC says quizzing mums 'made things worse'", "title_page": "Corby toxic waste case KC says quizzing mums 'made things worse' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The barrister who represented Corby Borough Council in the toxic waste court hearings, external says the questions he put to parents of children with birth defects \"probably made things worse\".\nStephen Grime KC has spoken out for the first time about his role in the case for a BBC audio documentary series released to coincide with the release of a Netflix TV drama based on the story.\nMr Grime said cross-examining mothers had been \"the worst aspect\" of the case.\nA group of Corby parents took the council to court in 2010 over birth deformities linked to the clear-up of the town's steelworks.\nDuring the court hearings, Mr Grime told the High Court the numbers of children with deformities in Corby was \"normal\" for the town's size.\nHe also told the court there was a danger in being seduced by the idea of \"clusters of cases\".\nLooking back for the BBC series In Detail: The Toxic Waste Scandal, Mr Grime said the \"worst aspect was having to cross-examine mothers of the children - women who suffered deeply.\n\"In some instances, I had to suggest to them that their memories about the dust or what the lorries were doing - things like that - were wrong.\"\nHe added that his role was particularly difficult \"when one knows very well that the witness you have is an honest person who's had a terrible time; whose child is injured; whose whole family's had a terrible time.\n\"The questioning probably did make things worse.\"\nHe revealed that he had since read some parts of the court transcript but \"this is one bit that I just haven't felt that I wanted to go back to because I feared I would find that maybe I had been somewhat brusque or somewhat difficult when maybe I shouldn't have been.\n\"But you can't change things after so very long.\"", "url": "https://www.bbc.co.uk/news/articles/cm2n0km8gp8o"}