{"authors": ["Gavin Kermack", "Malcolm Boyden", "www.facebook.com"], "date_download": "2025-04-26 04:29:20", "date_modify": "2025-04-26 04:29:20", "date_publish": "2025-03-03 07:10:17", "description": "Hereford's Chloe, 11, celebrates her win in Spain and admits she is better than her dad now.", "filename": "news_articles_cvg17e4z115o_1745641760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6326/live/d206eaf0-f7fd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg17e4z115o_1745641760.html", "title": "Hereford schoolgirl, 11, celebrates golf world championship win", "title_page": "Hereford schoolgirl, 11, celebrates golf world championship win  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An 11-year-old girl who got her first taste of golf four years ago is celebrating after becoming a world champion.\nChloe got hooked on the game after her father took her to the local driving range and, last week, she came first in her age category in the World Junior Golf Championship, external in Marbella, Spain.\nChloe, who practises at Herefordshire Golf Club, held her nerve to see off other golfers from countries including Spain, Portugal and Vietnam to bring home the trophy.\n\"I just tried concentrating and focusing on my golf,\" she said.\nChloe, whose favourite golfer is Charley Hull, fell in love with the sport from the moment she first hit a ball.\n\"I loved it straight away but I love it even more now,\" she said.\n\"I practise really hard, I practise every day.\"\nShe freely admits she is now better than her dad, Lee.\n\"We're immensely proud of Chloe as a family,\" Lee told BBC Hereford & Worcester.\n\"She works so hard, she practices most days and her development has been quite quick.\n\"Four years ago she started with a handicap of 54 and she's quickly moved that down to single figures.\"", "url": "https://www.bbc.co.uk/news/articles/cvg17e4z115o"}