{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:55:12", "date_modify": "2025-05-19 14:55:12", "date_publish": "2017-07-05 00:00:00", "description": "News, sport, weather and travel updates from across Kent on Wednesday 5 July 2017.", "filename": "news_live_uk-england-kent-40498722_1747666512.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-kent-40498722_1747666512.html", "title": "BBC Live: Kent - As it happened", "title_page": "BBC Live: Kent - As it happened on Wednesday 5 July - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Appeal for witnesses after delivery drivers robbed\nFour men are wanted by Kent Police after they reportedly robbed two delivery drivers in Edenbridge.\nThe incident occurred in Field Drive between 18:15 - 18:20 BST on Thursday 8 June.\nThe men are reported to have approached and threatened two delivery drivers before stealing furniture.\nThe suspects are described as aged between 20 and 30 years old.\nOne of the men was described as white, with short, curly, ginger hair and wearing black shorts and a black top. They were last seen running towards Woodpecker Close.\nThief hijacked car\nBob Dale\nBBC Live reporter\nPolice are looking for a man who abducted a driver and stole cash from him, leaving the victim tied up in his car.\nThe driver, a man in his 60s, was approached as he drove down the Broadway in Minster-on-Sea, on the Isle of Sheppey.\nThe attacker made him drive to a cul-de-sac near Kent Avenue, where he took the money and left him with his hands tied to the steering wheel.\nDetectives have issued a CCTV image of a man they'd like to speak to in connection with the incident.\nPetition against Tunbridge Wells homes plan\nKathryn Langley\nBBC Live reporter\nMore than 1,400 people have signed a petition against the building of 13,000 new homes in Tunbridge Wells.\nThe plans from the council would see the town expand over 20 years but they face a challenge of where to build them.\nA new garden city of 5,000 houses could be part of the solution.\nAppeal over Edenbridge furniture robbery\nKathryn Langley\nBBC Live reporter\nFour men are being sought by police after two delivery drivers were robbed in Edenbridge.\nThey're reported to have threatened them in Field Drive before stealing furniture.\nIt happened at about 18:15 BST on Thursday 8 June.\nThe men, who were aged between 20 and 30, were last seen running towards Woodpecker Close.\nOne of them is said to have short, curly, ginger hair and he was wearing black shorts and a black top.\nCricket: Kent v Northamptonshire latest\nOliver Turner\nSports reporter, BBC Radio Kent\nRecords continued to tumble at Beckenham in day two of Kent's County Championship match against Beckenham.\nSean Dickson became only the second Kent player to hit a triple tonne in his knock of 318 and set the club's highest post-war innings in the process.\nDickson also shared a club record 382-run partnership with Joe Denly before the latter was out for 182.\nKent eventually declared on 701-7, their highest total on home soil.\nNorthamptonshire did rally towards the end of the day, ending on 180-1 after Ben Duckett joined the game's century club.", "url": "https://www.bbc.com/news/live/uk-england-kent-40498722"}