{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:20", "date_modify": "2025-05-19 15:22:20", "date_publish": "2015-03-06 13:19:55", "description": "A school rated as outstanding during the so-called \"Trojan Horse\" affair is being put into special measures by Ofsted.", "filename": "news_uk-england-birmingham-31761546_1747668140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81441000/jpg/_81441876_shs2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-birmingham-31761546_1747668140.html", "title": "Trojan Horse: Small Heath School rated 'inadequate'", "title_page": "Trojan Horse: Small Heath School rated 'inadequate' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A school rated as outstanding when inspected during the \"Trojan Horse\" affair in Birmingham is to be put into special measures by Ofsted.\nSmall Heath School was now said to be \"inadequate\", while staff morale was \"very low\" and tensions were damaging its progress.\nHowever, inspectors also spoke of a \"broad and rich\" curriculum and robust moves to appoint staff.\nThe city council said it was working to \"secure leadership\".\nThe anonymous \"Trojan Horse\" letter sent to the city council in 2013 claimed that a socially-conservative group of Muslims was trying to get its own members on to governing bodies and oust head teachers.\nAfter an inspection in April last year, Ofsted had said that the quality of the school's leadership and management was \"outstanding\" under the previous long-serving headteacher, Peter Slough,\nHowever, after inspections in January, it said that the current headteacher, Shanaz Khan, had \"not provided a clear vision or inspiration for improvement\".\nThe new head has been in post at Muntz Street since September following Mr Slough's retirement and \"since the end of the last academic year, three other senior leaders have left\", the watchdog said.\nThe report said: \"The current tensions between the school's new senior leaders, including the headteacher, and longer-established senior and middle leaders, are damaging the school's progress and capacity to improve.\"", "url": "https://www.bbc.com/news/uk-england-birmingham-31761546"}