{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:35:09", "date_modify": "2025-05-19 15:35:09", "date_publish": "2015-02-05 03:16:40", "description": "The educational background of the House of Commons is unlikely to change much after the general election, according to a charity's study.", "filename": "news_uk-politics-31140623_1747668909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80792000/jpg/_80792081_80792079.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31140623_1747668909.html", "title": "Privately educated MP numbers 'unlikely to change after election'", "title_page": "Privately educated MP numbers 'unlikely to change after election' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The educational background of the House of Commons is unlikely to change much after the election, a study suggests.\nThe Sutton Trust education charity said 31% of new parliamentary candidates with a \"reasonable chance of winning\" on 7 May had been privately educated.\nThe figure is 33% in the current Parliament, and compares with 7% of the UK's population as a whole.\nSome 55% of the candidates went to the leading Russell Group of universities, with 19% attending Oxford or Cambridge.\nThe trust examined the backgrounds of 260 prospective Parliamentary candidates - those replacing serving MPs for the same party, or people standing in target seats where they were assessed as having a reasonable possibility of winning.\nOf the Conservative candidates, 49% went to private school, compared with 52% of the party's incumbents.\nFor Labour, the figure was 19%, up from 10% among its current representation.\nThe trust said it did not have enough Lib Dem candidates to compare with the party's current figure of 41% private pupils.\nEight of the 25 UKIP candidates considered (36%) went to private school, but the representatives of Nigel Farage's party were also the least likely to have gone to university, with 35% not attending.\nSir Peter Lampl, chairman of the Sutton Trust, said: \"This research shows that the next House of Commons is unlikely to reflect any more social diversity than the current crop of MPs.\n\"It underlines the importance of enabling bright young people from low and middle-income backgrounds to get to the best schools and universities if they are to have a chance to play a part in making the decisions that affect all of our lives.\"", "url": "https://www.bbc.com/news/uk-politics-31140623"}