{"authors": ["Shannen Headley", "Kath Stanczyszyn", "www.facebook.com"], "date_download": "2025-04-26 07:31:54", "date_modify": "2025-04-26 07:31:54", "date_publish": "2025-02-27 16:55:11", "description": "Wendy and Paul won £50,000 at Mecca Bingo in Wednesbury on Valentine's Day.", "filename": "news_articles_c4g99wq8ywzo_1745652714.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e104/live/1ba980f0-f510-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g99wq8ywzo_1745652714.html", "title": "West Midlands couple's £50k Valentines bingo date night win", "title_page": "West Midlands couple's £50k Valentines bingo date night win - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wendy was disgruntled when her husband Paul suggested bingo for their Valentine's Day date night - but that would all change when she landed the £50,000 jackpot prize.\nThe 61-year-old, who visited Mecca Bingo in Wednesbury, said that while she had hoped for a more romantic night, the evening's events had left her speechless.\nPaul suffered a stroke 13 years ago and Wendy became his full-time carer, leading them to \"live a life of struggle\" that the couple feel they are being repaid for at long last.\nAfter 34 years together - which was also Wendy's final winning number - they are finally able to afford their long-awaited Caribbean cruise.\nWendy told BBC Radio WM she used to take her mother-in-law to play bingo every week, but had been unable to go in recent years.\n\"Bingo is in the blood,\" she said. \"We hadn't been in such a long time but the atmosphere was absolutely lovely.\n\"I was expecting something a bit more romantic to be fair, but when I got inside I wasn't disappointed.\"\nPlaying the National Bingo Game, Wendy dabbed off all the numbers on her ticket within the first 16 numbers called, triggering the jackpot.\nThe caller came and checked Wendy's ticket, but she said they still did not know how much they had won.\nSpeaking about the moment she was told, she said: \"For the first time in my 61 years on the planet I couldn't speak - which is rare for me.\n\"It still hasn't sunk in. We're working class people, we've always worked hard, and Paul had a stroke at such a young age which was devastating.\n\"Life was a struggle. But I feel somebody somewhere has given me luck and has repaid us somehow for being good people. I feel honoured.\"", "url": "https://www.bbc.co.uk/news/articles/c4g99wq8ywzo"}