{"authors": ["Harriet Heywood", "www.facebook.com"], "date_download": "2025-04-26 08:03:01", "date_modify": "2025-04-26 08:03:01", "date_publish": "2025-02-26 16:38:22", "description": "A man is due in court on Thursday after the death of father-of-eight Granville Graham, aged 58.", "filename": "news_articles_c8j08dydl97o_1745654581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a0b2/live/ebcb4a50-f459-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j08dydl97o_1745654581.html", "title": "Man charged with murder of Cambridge father-of-eight", "title_page": "Man charged with murder of Cambridge father-of-eight - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been charged with the murder of a father-of-eight whose family described him as a \"special soul\" and a \"talented barber and singer\"\nGranville Graham, 58, died at Chesterton Road, Cambridge, at 01:18 GMT on Tuesday after reports of a stabbing.\nLiam Rush, 30, also of Chesterton Road, has been charged with murder and is due to appear at Huntingdon Magistrates' Court on Thursday.\nMr Graham's family said his death \"left a hole in our hearts and the hearts of communities in Cambridge, London and Jamaica\".\nMr Graham, of Chesterton Road, had nine sisters, one brother, eight children, one grandchild and \"countless family and friends who loved him dearly,\" they added in a tribute released through Cambridgeshire Police.\n\"Granville, talented barber and singer, was a special soul with an infectious, happy-go-lucky spirit that brightened the lives of everyone around him.\n\"Known for his incredible sense of humour, he could effortlessly make others laugh.\n\"His selflessness and willingness to help anyone in need made him a true source of support for many.\"\nA post-mortem examination is due to take place on Monday.", "url": "https://www.bbc.co.uk/news/articles/c8j08dydl97o"}