{"authors": ["Gladys Kido in Nairobi & Wedaeli Chibelushi in London", "www.facebook.com"], "date_download": "2025-04-26 03:48:50", "date_modify": "2025-04-26 03:48:50", "date_publish": "2025-03-05 14:11:34", "description": "The market, in a camp for displaced people, was attacked for roughly two hours, a local official says.", "filename": "news_articles_c1en05g83e6o_1745639330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/72c8/live/d52df5c0-f9c4-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1en05g83e6o_1745639330.html", "title": "El-Fasher shelling: Dozens feared dead in Sudan after attack on Abu Shouk market", "title_page": "El-Fasher shelling: Dozens feared dead in Sudan after attack on Abu Shouk market - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dozens of people in the Sudanese state of North Darfur are feared dead following heavy shelling on a camp for displaced people.\nThe paramilitary Rapid Support Forces (RSF) attacked a crowded market at Abu Shouk, a camp on the outskirts of the city of el-Fasher, for roughly two hours on Tuesday evening, a local official told the BBC.\nThe camp is home to over half a million displaced people and the assault on its market is the second in three days.\nEl-Fasher is the last major town in Darfur under army control and has been under siege by the RSF for almost a year.\nTuesday's attack on Abu Shouk took place at the busiest time of day. The camp's population are mostly Muslims, who are observing the holy month of Ramadan, and many were out shopping at the market, preparing to break their fast for the day.\nThe shelling caused several injuries, ranging from mild to severe, Dr Ibrahim Nadyan, a medic at el-Fasher's last functioning hospital, told the BBC.\nAbu Shouk was also shelled by the RSF on Sunday, in an attack that that killed six civilians, local health volunteers said.\nThe RSF has not commented on either Sunday or Tuesday's attack.\nSince it erupted in April 2023, the war has killed tens of thousands of people, forced millions from their homes and left many facing famine.\nBoth the RSF and the army have been accused of committing atrocities, with the RSF accused of committed a genocide in Darfur against the region's non-Arabic groups.\nThe conflict has split the country, with the army controlling the north and the east, while the RSF holds most of the Darfur region in the west and parts of the south.\nIn recent weeks, the army has retaken parts of Khartoum and surrounding areas from the RSF.", "url": "https://www.bbc.co.uk/news/articles/c1en05g83e6o"}