{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:15:56", "date_modify": "2025-04-26 06:15:56", "date_publish": "2025-03-01 20:44:02", "description": "Police were called to the \"sudden death\" of a man, aged in his 60s, in Bournemouth on Friday.", "filename": "news_articles_czxn421n7z5o_1745648156.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/947a/live/61e79660-f6dc-11ef-964d-6ddbc94ea841.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czxn421n7z5o_1745648156.html", "title": "Bournemouth: Murder arrest as man dies after reports of assault", "title_page": "Bournemouth: Murder arrest as man dies after reports of assault - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man has been arrested on suspicion of murder following the death of another man three days after an assault outside a hotel.\nPolice were called to the \"sudden death\" of man, aged in his 60s, at an address in Redhill Avenue, Bournemouth, just after 20:00 GMT on Friday.\nIt was reported the man was assaulted outside the Bournemouth Carlton Hotel in East Overcliff at about 13:00 on Tuesday, said Dorset Police.\nThe arrested man, who is 46 and from Bournemouth, remains in police custody.\nAn investigation has started to establish the full circumstances of the death, said the force.\nCordons remain in place at the address in Redhill Avenue and in East Overcliff to allow the scenes to be examined.\nDet Insp Shaun Inkpen said: \"A full investigation has been launched and we are supporting the victim's family as our inquiries continue.\"\nHe asked witnesses to the reported assault on Tuesday to contact police.\nThere would be an increased police presence in the area as investigative work continues, said Det Insp Inkpen, urging anyone with information or concerns to speak to an officer.\n\"I would like to add this investigation is in the very early stages and I am keeping an open mind as to the circumstances of the death,\" he added.", "url": "https://www.bbc.co.uk/news/articles/czxn421n7z5o"}