{"authors": ["Megan Bonar", "www.facebook.com"], "date_download": "2025-04-26 07:47:39", "date_modify": "2025-04-26 07:47:39", "date_publish": "2025-02-26 23:54:20", "description": "Argyll and Bute Council has shortlisted four options for the location of the new school.", "filename": "news_articles_ce30nrnpwygo_1745653659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5940/live/ecefd110-f4f1-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce30nrnpwygo_1745653659.html", "title": "The island split over where to build a new high school", "title_page": "The island split over where to build a new high school - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For decades, children on Mull have been divided by the location of the island's only high school.\nPupils living in the north of Scotland's fourth largest island go to school in Tobermory, its main settlement.\nBut most of those living over an hour-and-a-half's drive away in the south face having to leave their families and catch a ferry to Oban on the Scottish mainland, where they stay in boarding school hostels during the week.\nWith Tobermory High School falling into a state of disrepair and plans being made to build a multi-million pound replacement, many of those in the south see it as a chance to put right what they regard as being a historical injustice.\nThey are campaigning for the new school to be based in a more central location such as Craignure, which is home to the main ferry port and the island's hospital.\nThis would allow pupils from both ends of the island to attend the same school - so children in the south would be able to stay at home once they reach secondary school age.\nBut some parents in the north of the island want the new school to be built close to the site of the existing high school in Tobermory.\nArgyll and Bute Council has shortlisted four options for the location of the new school, and had been due to make a decision on Thursday - but the vote has been delayed until a special meeting of the council on 7 March.\nThe new development will be a replacement for the current high school, meaning wherever it is built it will be a campus made up of a nursery, primary and secondary school.\nChoosing any location apart from Tobermory would leave the town with no school.\nMany community members had hoped that a \"split option\" would be made available allowing a central high school to be built as well a new primary school and nursery for the community of Tobermory, but the council says that is too expensive.\nMarion MacLean lives in Tobermory and her two daughters currently attend the high school.\nWhile the decision won't directly impact on her family, Marion feels this is the \"one chance to get it right for every child that lives on the island\".\nWhile she feels it is important not be \"remiss of the feelings\" of families in the Ross of Mull, she has concerns about the impact on the village she has called home all her life.\nShe told BBC Scotland News: \"Tobermory can't lose its primary school.\n\"It would have a huge impact on the businesses on the high street, and I think we would lose that community feel of having the children around the town during the day.\"\nFour miles off the main road through the Ross of Mull is the village of Carsaig, which is home to Amy Simpson and her daughters Daisy, six, and Rosie, four.\nAmy said that if the council's preferred option of a new school in Tobermory is selected she would feel forced to leave her village when her kids reach secondary school age, rather than be separated from them if they had to board in Oban.\nShe added: \"We love our life here, we have become an integral part of our community.\n\"We don't want to leave and we don't want to take our kids out of this community, this is where they were born and where they are growing up.\"\nFifty miles south of Tobermory, a journey which takes around an hour-and-a-half in a car due to the single track roads, is the village of Bunessan.\nRob Claxton-Ingham, who lives on a croft with his husband, said the future was uncertain as he doesn't know where his foster child will attend secondary school.\nAs things stand, she faces travelling and boarding in Oban every week - like all children on the south of the island.\nHe told BBC Scotland News: \"As a foster carer, our child has faced separation and loss already from her birth family and has had to transition to us as her substitute carers.\n\"The thought of her transitioning again at the age of 11 to a school, over the sea, where she has to get a ferry, where she won't get our day-to-day support, is hard.\"\nRob said high school has always been \"an issue\" for the community, and people have \"learned to be as ok as they can be with it\".\n\"But this situation is developing something new and it really hurts that Argyll and Bute Council could develop something new and, actually while doing that plan, to continue excluding people at this end of the island,\" he added.\nRebekah MacLean and her four kids also live in the village of Bunessan.\nHer youngest children attend the local primary school, but for her secondary-aged children things are a little bit more complicated.\nShe said: \"For me, what I am seeking is equality across the island for all children whether that's primary age, early education or secondary students.\n\"One key aspect of that is the secondary school being centrally based, so all the children can attend and no child has to be put in the position of choosing between education and family.\"\nRebekah has managed to make arrangements for her son, Jude, 15, to stay with a family friend in Tobermory during the week so he is slightly closer to home, while her daughter, Acacia, 14, is home-schooled.\nJude is also in favour of a centrally-located school so that when it comes to his siblings' time to go to high school, they can stay at home and have a less uninterrupted education than him.\nHe said: \"I do worry that because I have to travel so far, I have less time in school.\n\"I want to be an engineer, that requires straight As.\n\"I worry I won't be able to get those because I have to travel so much and I'm maybe behind in class.\"\nIt is clear that the debate on where the new school should be built is an issue that is consuming islanders.\nEverywhere you go, everyone has an opinion on it.\nArgyll and Bute Council said: \"Building a new 2-18 campus on Mull is Argyll and Bute Council's single biggest investment, estimated at £43m.\n\"Following extensive community engagement and detailed assessments, councillors will consider a report recommending a preferred site on 27 February with a motion already tabled to hold a special meeting to consider the issue on 7 March.\"", "url": "https://www.bbc.co.uk/news/articles/ce30nrnpwygo"}