{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:12:27", "date_modify": "2025-04-26 04:12:27", "date_publish": "2025-03-04 12:20:12", "description": "Five East Lancashire towns will get money for projects such as youth clubs and community services.", "filename": "news_articles_cr7292kgn34o_1745640747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/85e4/live/802c8c10-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr7292kgn34o_1745640747.html", "title": "East Lancashire towns get up to £20m cash boost", "title_page": "East Lancashire towns get up to £20m cash boost - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Five East Lancashire towns are to each receive up to £20m towards youth clubs, cultural venues and community services.\nAccrington, Burnley, Darwen, Nelson and Rawtenstall are among 75 areas of the UK that will be given a share of a £1.5bn government pot to improve deprived neighbourhoods.\nA local board of residents, businesses and campaigners will be set up in each town to decide how the money is spent.\nDeputy Prime Minister Angela Rayner, said: \"For years, too many neighbourhoods have been starved of investment, despite their potential to thrive and grow.\"\nThe boards will be presented with options of where the cash can be spent, such as repairs to pavements or neighbourhood watch schemes, according to the Ministry of Housing, Communities and Local Government.\nRayner said each town's \"understanding of their own neighbourhood\" would mean local people can decide where the money is spent.\nLocal Growth Minister Alex Norris, said \"when our local neighbourhoods thrive, the rest of the country thrives too\".\nHe added: \"That's why we are empowering communities to take control of their futures and create the regeneration and growth they want to see\".\nMoney will be available from April, and the projects are expected to be up and running in 2026.\nThe scheme follows on from the long-term plan for towns under Rishi Sunak's government, which had also pledged funding for the same areas.\nThe Conservatives criticised the funding plans as \"wasteful pet projects\".\n\"Local areas are feeling increased pressure due to immigration, increased council tax and Labour changing the local government finance settlement to benefit urban areas over rural areas,\" Shadow Housing Secretary Kevin Hollinrake said.\n\"Labour erased the phrase 'levelling up' from government and instead of delivering for local communities are now spending taxpayer cash on wasteful pet projects this country can't afford.\"", "url": "https://www.bbc.co.uk/news/articles/cr7292kgn34o"}