{"authors": ["Hafsa Khalil", "Vitaliy Shevchenko", "www.facebook.com"], "date_download": "2025-04-26 08:01:14", "date_modify": "2025-04-26 08:01:14", "date_publish": "2025-02-25 10:28:58", "description": "The proposal to give the US access to minerals would also include those from territories taken from Ukraine.", "filename": "news_articles_c4gdx7488g5o_1745654474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/68b0/live/357e4590-f391-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdx7488g5o_1745654474.html", "title": "Putin offers Russian and Ukrainian rare minerals to US", "title_page": "Putin offers Russian and Ukrainian rare minerals to US - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Russian President Vladimir Putin said he is open to offering the US access to rare minerals, including from Russian-occupied Ukraine.\nThis comes after US President Donald Trump has repeatedly pushed for Ukraine to give up some of its minerals in exchange for support, in a deal which is currently being finalised, according to a Ukrainian minister.\nIn a state TV interview on Monday, Putin said he was ready to \"offer\" resources to American partners in joint projects, including mining in Russia's \"new territories\" - a reference to parts of eastern Ukraine that Russia has occupied since launching a full-scale invasion three years ago.\nThe proposal could also see the two countries collaborating on aluminium extraction and supply to the US to stabilise prices, he added.\nIn his televised interview, Putin countered Trump's push to access Ukraine's mineral deposits, saying they were ready to work with \"foreign partners\" including companies on mining minerals.\nPutin said a potential US-Ukraine deal on rare minerals was not a concern and that Russia \"undoubtedly have, I want to emphasise, significantly more resources of this kind than Ukraine\".\n\"As for the new territories, it's the same. We are ready to attract foreign partners to the so-called new, to our historical territories, which have returned to the Russian Federation,\" he added.\nHe also suggested that Russia and the US could collaborate on aluminium production in Krasnoyarsk, in Siberia, where one Russian aluminium maker, Rusal, has its largest smelters.\nThe televised comments followed a cabinet meeting on Russia's natural resources.\nOn Tuesday, Kremlin spokesman Dmitry Peskov told journalists the proposal opened up \"quite broad prospects\", adding that the US needed rare earth minerals and Russia had \"a lot of them\".\nOffering the US access to minerals is an eye-catching move by Putin, given how much pride the Kremlin has taken in keeping Russia's natural wealth in Russian hands. In 2023 Putin accused the West, particularly the US, of trying to \"dismember\" Russia to gain access to its natural resources.\nPutin's intervention comes as Ukraine has been facing growing pressure from the Trump administration to sign a deal for access to its mineral deposits.\nKyiv estimates that about 5% of the world's critical raw materials are in Ukraine. However, some of the mineral deposits have been seized by Russia in the three years since its invasion of Ukraine.\nTrump said earlier this month that the US military and economic aid to Ukraine amounted to about $500bn (£396bn), and he wants the US to have access to Ukrainian minerals of that value.\nZelenzky has disputed that figure and is also said to want any deal to include security guarantees.\nOn Monday Ukraine's deputy prime minister for European and Euro-Atlantic integration, Olga Stefanishyna, said negotiations on such a deal \"have been very constructive, with nearly all key details finalised\".\nSimilarly - albeit in a different approach to the US - the European Union has also proposed a partnership with Ukraine that would give it access to minerals in what the the European Commissioner for industrial strategy, Stéphane Séjourné, called a \"win-win\".", "url": "https://www.bbc.co.uk/news/articles/c4gdx7488g5o"}