{"authors": ["Nic Marko", "www.facebook.com"], "date_download": "2025-04-26 08:06:26", "date_modify": "2025-04-26 08:06:26", "date_publish": "2025-02-26 14:49:48", "description": "Hartlepool's council says the idea will improve transport but the mayor calls it \"unworkable\".", "filename": "news_articles_cwyde0gw4q7o_1745654786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/21cd/live/9e0114d0-f440-11ef-8f19-430fec9d0afd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyde0gw4q7o_1745654786.html", "title": "Hartlepool's bus franchise calls rejected by Tees Valley Mayor Ben Houchen", "title_page": "Hartlepool's bus franchise calls rejected by Tees Valley Mayor Ben Houchen - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Calls to franchise local bus services have been rejected by the Tees Valley mayor for being too expensive.\nHartlepool Borough Council wrote to the combined authority urging it to award exclusive contracts to private firms as part of efforts to improve public transport.\nLabour councillor Karen Oliver, who proposed the motion, said it would \"make a real difference\" to residents.\nMayor Ben Houchen, Conservative, rejected the idea and said it would be \"gambling taxpayers' money\".\nUnder a franchised system, exclusive contracts are awarded to private firms to operate services in a specified region or along certain route with the local transport authority specifying where and when they run.\nThose who support bus franchising argue it can improve public spending efficiency, as transport authorities can use money from profitable routes to subsidise those that do not make money.\nBut Houchen disagreed and said the taxpayer would have to pay for the new system.\n\"Franchising buses would mean years of costly bureaucracy, handing hundreds of millions to companies like Arriva and Stagecoach, and a significant tax increase on local people - something I've promised never to do,\" he said.\n\"Instead of gambling taxpayers' money on a vague, unworkable idea, we're delivering real improvements now [such as] £1 fares for young people and targeted funding for new services where it's needed most.\"", "url": "https://www.bbc.co.uk/news/articles/cwyde0gw4q7o"}