{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:22:12", "date_modify": "2025-04-26 04:22:12", "date_publish": "2025-03-03 14:19:58", "description": "Jordan Kavanagh also punched her in the face and kicked their young puppy so hard it became sick.", "filename": "news_articles_cp8vyp0v4kro_1745641332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/747d/live/7c9fffa0-f84f-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8vyp0v4kro_1745641332.html", "title": "Man jailed for kicking pregnant partner in stomach", "title_page": "Limavady; Man jailed for kicking pregnant partner in stomach - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who kicked his partner in the stomach on the night she told him she was pregnant has been jailed for 18 months, with the same period on licence.\nJordan Kavanagh, 29, from Rathbrady Road, Limavady in County Londonderry, also grabbed his partner by the throat and punched her in the face while her mother was trying to help her, a court in Londonderry was told.\nHe also kicked an 11-week-old puppy during the attack on 13 December 2023.\nSentencing at Londonderry Crown Court, Judge Neil Rafferty described the case as \"disgraceful and upsetting.\"\nThe judge praised the victim for taking the case and said she had been \"totally vindicated\".\nThe court heard on the night of 13 December 2023, Kavanagh had accused his girlfriend of stealing his beer and in a fit of anger kicked their 11-week-old puppy so hard the dog was sick.\nKavanagh then told the injured party to leave or he would kill her before threatening her with a pair of scissors.\nThe defendant was said to have calmed down and hugged the victim before dragging her across the room.\nHe then kicked her in the stomach and said he would kill the baby before he would let her hold it.\nWhen the victim's mother was taking her to hospital, Kavanagh got into the vehicle and grabbed his girlfriend by the throat while punching her in the face.\nWhen she was getting out of the vehicle he told her if she contacted police he would burn her out.\nPolice were called and Kavanagh was arrested.\nJudge Rafferty said it had been \"an appalling assault on the young woman\", adding the attack on the puppy was \"brutal and repugnant\".", "url": "https://www.bbc.co.uk/news/articles/cp8vyp0v4kro"}