{"authors": ["Adam Laver", "www.facebook.com"], "date_download": "2025-04-26 08:15:13", "date_modify": "2025-04-26 08:15:13", "date_publish": "2025-02-26 10:55:36", "description": "Teenagers who used a pistol and machetes as they chased a rival through the streets are jailed.", "filename": "news_articles_c204k3zp72xo_1745655313.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/af1b/live/b7091570-f433-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c204k3zp72xo_1745655313.html", "title": "Leeds gang who chased teen and tried to shoot him jailed", "title_page": "Leeds gang who chased teen and tried to shoot him jailed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gang members who tried to gun down a rival on a residential street as children looked on were thwarted when their pistol jammed.\nArmed with the gun and machetes, four teenagers had pursued and tried to shoot their 17-year-old victim in the Gipton area of Leeds on 7 July last year.\nKamahl Johnson, 19, of Grange Crescent, Chapeltown, and Zane Gatewood, 18, of Pawson Street, Wakefield, were each sentenced to seven years and two months in custody at Leeds Crown Court on Tuesday.\nA 17-year-old was sentenced to seven years and five months and a 16-year-old was given a term of four years and nine months. Neither can be named, as they under 18 years old.\nDuring the Sunday afternoon chase, a shot was fired at the victim, but the bullet lodged in the barrel of the converted blank-firing pistol, according to West Yorkshire Police.\nThe force said the victim had fled into a nearby shop and escaped through the back door.\nOfficers were deployed and detained the teenagers in the Harehills area of Leeds.\nThe 16-year-old was found hiding in a garden with a machete in his waistband, while the three others were in another garden on the same street.\nA second machete was found in a dog kennel in the garden where the three had been found.\nA converted blank-firing handgun along with four rounds of 9mm ammunition was found in a black Louis Vuitton man bag in a neighbouring garden, police said.\nCCTV showed that the 17-year-old had the handgun at the time.", "url": "https://www.bbc.co.uk/news/articles/c204k3zp72xo"}