{"authors": ["Sean Coughlan", "www.facebook.com"], "date_download": "2025-04-26 04:04:29", "date_modify": "2025-04-26 04:04:29", "date_publish": "2025-03-03 18:59:27", "description": "What can we expect from the new TV series from the Duchess of Sussex?", "filename": "news_articles_ce8y0ld2ngyo_1745640269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/60d1/live/0851ff60-f848-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8y0ld2ngyo_1745640269.html", "title": "Five things we learned from Meghan's interview about her Netflix series", "title_page": "Five things we learned from Meghan's interview about her Netflix series - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Duchess of Sussex's lifestyle TV series has launched on Netflix on Tuesday morning, but an interview with People magazine, external in the US has already given an insight into what's on the menu.\nHere are some of the things we have learned:\nWith Love, Meghan is an eight-episode series of cookery, gardening and chats with famous friends.\nThat doesn't always mean fine dining, as the interview says Chinese take-away food is a favourite in their Californian home.\n\"But even when I get take-out, I will try to plate it beautifully,\" says Meghan.\nFor those already feeling unworthy, she says: \"The series is about doing what you can do... and doing it with love.\"\nThey go out to eat too. \"We go to a lot of dinners, and not just in people's homes or private rooms; we just go into the restaurant... I really love that we can just have fun.\"\nPerhaps more reassuringly, Prince Harry and their five-year-old son Prince Archie are keen on fried eggs, says Meghan, who reveals she's usually up at 6.30am.\n\"I love making breakfast for my family,\" she says.\nBut don't expect to see much of Prince Harry in this series, apparently there's only a glimpse towards the end of the series. As the title suggests, this is about Meghan.\nThis series seems to be seeing Meghan going back to her pre-royal roots, when she had a lifestyle blog, The Tig.\nBut Meghan doesn't see herself as an influencer.\n\"I see myself as an entrepreneur and a female founder... and if the brand ends up influential, then that's great.\"\nWe know that she's launching a new lifestyle product range called As Ever, in a partnership with Netflix, so there could be some entrepreneurial overlaps.\n\"It's almost like a honeymoon period again,\" says Meghan.\nMeghan makes working on the show sound almost like a rekindling of their first romance, for her and Harry.\n\"I see this spark in his eye when he sees me doing the thing that I was doing when he first met me,\" she says.\nThe thing in question was all the work on the blog.\n\"Scribbling away, writing newsletters, fine-tuning edits and just really being in the details of it.\n\"I think he loves watching as much as I love doing that creative process. It's just been fun.\n\"This is who I've always been.\"\nThere was a previous podcast, called Archetypes, which faced some tough criticism. The magazine says her new podcast with Lemonada Media is launching this spring.\nMeghan has had to face plenty of hostility over the years. And in this interview she talks about responding to constant public scrutiny, including over the development of this latest venture.\n\"There are tons of twists and turns - even with the name,\" she says.\n\"I was figuring it out in real time.\"\nShe added: \"I appreciate everyone who gave me the grace to make mistakes and figure it out and also to be forgiving with myself through that.\n\"It's a learning curve.\"\nIn terms of their own current media consumption: \"We love Shrinking, we just finished Black Doves, and we're excited for the new season of The White Lotus,\" she said.\nWhile their last Netflix series was raking over their departure from lives as working royals, this latest series is not expected to go into their disputes with the palaces or the Royal Family.\nInstead this will be a more upbeat offering, full of expensive kitchens, flowers and sunny views from their new lives in California. It's looking ahead and not back.\nBut for the people of one faraway corner of southern England, there is a nod to their Sussex titles.\n\"It's our shared name as a family, and I guess I hadn't recognised how meaningful that would be to me until we had children,\" she says.\n\"I love that that is something that Archie, Lili, H and I all have together.\n\"It means a lot to me.\"", "url": "https://www.bbc.co.uk/news/articles/ce8y0ld2ngyo"}