{"authors": ["Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 06:53:00", "date_modify": "2025-04-26 06:53:00", "date_publish": "2025-02-28 16:52:19", "description": "A 19-year-old man is the latest person due to appear in court, Norfolk Police says.", "filename": "news_articles_c9dej1d5866o_1745650380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f012/live/0edf8db0-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9dej1d5866o_1745650380.html", "title": "Police charge fifth person in Norwich flat stabbing investigation", "title_page": "Police charge fifth person in Norwich flat stabbing investigation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A fifth person has been charged in connection with the fatal stabbing of a 19-year-old man.\nKalvin Taylor was found dead on 21 September, eight days after he was stabbed inside a flat on Lefroy Road, in Mile Cross, Norwich.\nPolice said Soulay Fornah, 19, of Acorn Walk, Southwark, London, was charged with murder on Friday.\nHe is due to appear at Norwich Magistrates' Court on 21 March. Four other people have already appeared in court in connection with Mr Taylor's death.\nLeon Bangura, 20, of Old Kent Road, London; Adam Dugdale, 55, of Shorncliffe Avenue, Norwich and Carrie-Anne Hall, 51, of Lodge Breck, Norwich, have all been charged with murder.\nPolice said Mr Bangura has additionally been charged with two offences of being concerned in the supply of Class A drugs, possession with intent to supply and possession of a bladed article in a public place.\nMatthew Holmes, 51, also from Norwich, is accused of assisting an offender. He has been released on bail.\nA provisional trial date has been set for 28 April, although the defendants are yet to enter a plea.\nA post-mortem examination found Mr Taylor, who was from London, died from a single stab wound to the chest.", "url": "https://www.bbc.co.uk/news/articles/c9dej1d5866o"}