{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:25:56", "date_modify": "2025-04-26 04:25:56", "date_publish": "2025-03-03 11:49:43", "description": "Kim Avis is already serving 15 years in jail for sex offences and trying to evade justice.", "filename": "news_articles_c2er3vdz41yo_1745641556.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/32e0/live/6a27a310-f81c-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2er3vdz41yo_1745641556.html", "title": "Inverness rapist who faked his death has sentence extended", "title_page": "Inverness rapist who faked his death has sentence extended - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A rapist who tried to evade justice by fleeing Scotland then faking his own death in the US has had his prison sentence extended.\nKim Avis, a market trader from Inverness, was on bail when he flew to Los Angeles in February 2019.\nHe faked a fatal swimming accident on a Californian beach but was later arrested and returned to Scotland where he was convicted of rape and sexual abuse offences and jailed for 15 years.\nAvis has had two months added to his sentence after he was found guilty of possessing a personal communication device at HMP Edinburgh in May last year.\nNine days after arriving in the US in 2019, Avis's son reported him missing at Monastery Beach, telling the local sheriff's office that his father had gone for an evening swim.\nThe beach is near Carmel-by-the-Sea on Big Sur, a rugged and mountainous stretch of Californian coastline.\nBut the authorities became suspicious after they were made aware that Avis was facing charges of sexual attacks against women and girls in the Highlands.\nFive months after he disappeared, US Marshals traced Avis in Colorado Springs - more than 1,300 miles (2,092km) away from where he was reported missing.\nThe following week, in July 2019, he was arrested.\nAvis was returned to Scotland, where he was held in prison until his trial in May 2021.", "url": "https://www.bbc.co.uk/news/articles/c2er3vdz41yo"}