{"authors": ["Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 03:44:40", "date_modify": "2025-04-26 03:44:40", "date_publish": "2025-03-05 06:59:15", "description": "Firefighters say careless parking can have \"catastrophic\" consequences.", "filename": "news_articles_cy83k3j72m2o_1745639080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6dfc/live/2bcb58f0-f8e9-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy83k3j72m2o_1745639080.html", "title": "West Sussex Fire Service urges drivers to park cars mindfully", "title_page": "West Sussex Fire Service urges drivers to park cars mindfully - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Firefighters have urged drivers to be mindful of how they park after a crew was delayed by \"inconsiderate\" parking.\nWest Sussex Fire and Rescue Service was called to a fire at a substation in Lancing on Monday, but they were delayed by vehicles parked \"carelessly\" in Chester Avenue.\nA spokesperson for the service said: \"When responding to an emergency, every second counts and inconsiderate parking can impact the time it takes for us to attend the scene of an emergency.\n\"Fortunately, nobody was injured because of this incident, but the consequences of careless parking can be catastrophic.\"\nThe fire service said it regularly sees vehicles parked in front of the appliance bay doors of its fire stations, particularly at Partridge Green Fire Station in Horsham.\n\"Some of our fire engines are about one-and-a-half widths of a standard car, and this can make it difficult to manoeuvre around vehicles,\" they said.\nThey reminded drivers to park close to the kerb, ensure the vehicle and its wheels are straight, fold in wing mirrors and only park on one side of the road on narrow streets.\nDrivers should also leave extra room at tight junctions and abide by the Highway Code and road markings, they said.", "url": "https://www.bbc.co.uk/news/articles/cy83k3j72m2o"}