{"authors": ["Ruth Green", "www.facebook.com"], "date_download": "2025-04-26 06:14:35", "date_modify": "2025-04-26 06:14:35", "date_publish": "2025-03-02 00:42:23", "description": "Posing as an 18-year-old, BBC reporter Ruth Green quickly finds groups selling weapons openly.", "filename": "news_articles_cgm18g19013o_1745648075.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ec92/live/9cdd25e0-f6bf-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm18g19013o_1745648075.html", "title": "'I'm not tech-savvy - but within hours I could buy an illegal knife on social media'", "title_page": "Knife crime: 'I'm not tech-savvy - but within hours I could buy an illegal knife on social media' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "I'm 48, use social media occasionally, and I'm not very tech-savvy. Until recently I'd never used Telegram.\nBut last year, after meeting the family of Ronan Kanda - the 16-year-old who was killed in a case of mistaken identity by two other teenagers who'd bought a sword and machete online - I decided to figure out how easy it was to buy a knife from social media.\nIt seemed like the children in the case were able to buy huge, deadly weapons with shocking ease.\nSo in spring 2024, I set up several social media accounts in the name of a fake 18-year-old man. He is a Londoner who is friends with a group of young men who carry knives. He thinks he needs one too, to protect himself, and he knows larger knives are more intimidating.\nI got myself a separate mobile so my new searches would not impact my usual browsing algorithms. I started searching for knives, liking and following accounts which offered content.\nThe groups contained images of young men posing with knives, videos of close-ups of the blades, and some had videos of knife fights. Very quickly my new social media accounts started showing me more similar content.\nA familiar pattern emerged. Knives were being advertised in posts on Instagram, Snapchat and TikTok, with sellers directing buyers in their bio to their Telegram channels - encrypted groups where videos, photos and prices of knives for sale were openly shared.\nWithin hours of starting my searches I found and joined my first Telegram group selling banned weapons. There were zombie knives, machetes, switchblades and swords.\nTwenty-two-inch machetes cost £40 and 24-inch zombie knives were £50 - with new stock arriving soon. The seller was based in Walsall and promised delivery to the Birmingham area for £5. Days later, a message went up saying the machetes and zombie knives had sold out.\nThen a poll went up, asking \"Should I get stab-proof vests?\" Fifty-six subscribers answered. A few weeks later, stab vests were available to buy.\nWithin a few weeks I found more than 10 social media accounts offering illegal knives for sale. It didn't take long for me to learn the slang used for terms like knife seller, flick knife and zombie knife.\nKnives were offered in a range of colours - gold, silver, red and blue being the most common. Sellers uploaded photos of their parcels, naming the courier companies they were using to \"guarantee quick delivery\". In some groups buyers had written reviews after receiving their knives - \"banging quality these\" and \"vouched - nice one bro\".\nThere were deals too. One group offered discounts on bulk buying, £5 off second orders, and the chance for members to win knives and knuckledusters for free. As far as I could see, none of the groups were doing any kind of age verification.\nSome were closed down during the nine months I observed them on Telegram, including one called Shanks R Us. But most of them stayed active the whole time.\nMany routinely posted that they were out of stock, and apologised for the inconvenience.\nIn September 2024, the government introduced legislation making it an imprisonable offence to own or sell zombie-style knives and machetes. This added them to a long list of prohibited knives.\nIt's clear they are now getting harder to get a hold of.\nIn one group, the admin says they are getting zombie knives manufactured and shipped from abroad - Malaysia, Pakistan and China - and it's taking longer than usual. The admin brags that \"all [their] shipments land\", and now they're focusing on \"bulk stock for the future… meaning the knives should be cheaper\".\nBut despite this, the trade is still going strong. On 14 February, I see a message on a group that's grown from zero to 600 members in just a few months reading: \"Happy Valentine's Day to da ladies out there, grab your mans a tool for Valentine's Day, make sure he's safe.\"\nMany of the knives being sold are clearly illegal - but some aren't.\nThe sale of legal knives over Telegram is not technically forbidden, as you don't need a licence or registration to sell them. It is, however, illegal to publish material encouraging the use of a knife as a weapon.\nIn spring 2025, the Home Office intends to launch a consultation into a registration scheme for selling knives online - which would require sellers of all knives, including regular kitchen knives, to sign up.\nThe Offensive Weapons Act states that there should be a system in place for age verification on sale and for delivery, but there's no evidence that this takes place in the social media groups I've been in.\nI contacted the social media platforms to ask what they were doing to curb this harmful content.\nSnapchat said selling weapons, including knives, was explicitly banned on the platform and that it actively worked to remove such content.\nIt said action was taken against violators of the policy - like disabling accounts. It also said it supported police investigations and had a team working around the clock to respond to authorities' data requests.\nSimilarly, TikTok said the trade of dangerous weapons was prohibited and that in the third quarter of 2024, 96% of clips that breached guidelines were removed before being reported. It said sharp knives, regardless of size, were not allowed to be sold on TikTok Shop.\nIt added it worked closely with government and police to understand changes in knife crime, and assisted police enquiries.\nI reached out to Meta too - which hasn't yet provided a comment. Previously a spokeswoman told the Times that the promotion and sale of weapons on Meta's platforms was banned, and that such content was removed when found.\nShe added that in 2024, Meta met other tech firms, the Home Office, Ofcom and officials to understand how to work together to tackle the issue.\nTelegram said the sale of illegal goods was forbidden by its terms of service and its hundreds of moderators use custom AI and machine learning tools to monitor public parts of the platform. It said it responds to user reports and removes millions of pieces of harmful content.\nIn addition, the platform said it aids police in investigations and will disclose the IP address and phone number of criminals who breach its terms of service in response to a \"valid legal request\". It also said it is in \"constant contact\" with Ofcom and the Home Office.\nMurdered teen Ronan Kanda's sister told the BBC that his murderer \"didn't have any problems collecting his knife from his local post office\".\nHis mother, Pooja, was adamant that the online sale of bladed articles had played a \"crucial role\" in the tragedy. \"A 16-year-old managed to get these weapons online and sold these weapons to other people,\" she said.\nFollowing his death the government has announced a series of new measures known as Ronan's Law, including stiffer sentences for selling knives to under-18s.\n\"Out of tragedy comes a light,\" said Pooja. \"The light we all need.\"\nBut she stressed \"there's so much more we can do.\"\nRight now, it's still incredibly easy to buy lethal blades on social media.", "url": "https://www.bbc.co.uk/news/articles/cgm18g19013o"}