{"authors": ["Tom Gerken", "www.facebook.com"], "date_download": "2025-04-26 04:31:40", "date_modify": "2025-04-26 04:31:40", "date_publish": "2025-03-03 06:10:56", "description": "It will look into how the social media platform uses the data of 13 to 17-year-olds to recommend content.", "filename": "news_articles_c62xxz141plo_1745641900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9098/live/81615920-f75b-11ef-a766-bffe669032d0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62xxz141plo_1745641900.html", "title": "TikTok investigated by UK watchdog over use of children's data", "title_page": "TikTok investigated by UK watchdog over use of children's data - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK data watchdog has launched what it calls a \"major investigation\" into TikTok's use of children's personal information.\nThe Information Commissioner's Office (ICO) will inspect the way in which the social media platform uses the data of 13 to 17-year-olds to recommend further content to them.\nJohn Edwards, the Information Commissioner, said it would look at whether TikTok's data collection practices could lead to children experiencing harms, such as data being leaked or spending \"more time than is healthy\" on the platform.\nTikTok told the BBC its recommender systems operated under \"strict and comprehensive measures that protect the privacy and safety of teens\".\nIt added that the platform also has \"robust restrictions on the content allowed in teens' feeds\".\nMr Edwards said TikTok's algorithm \"feeds\" on personal data gleaned from user profiles, preferences, links clicked and how long they spend watching a particular video - making it subject to UK rules.\nIn addition to the probe into TikTok, the ICO is also checking the age verification processes of Reddit and Imgur, an image-sharing platform.\nThe investigation will look into whether the companies are complying with both the UK's data protection laws, and the children's code.\nThe code is set to design principles for online platforms aimed at protecting children in the UK. Platforms which collect UK children's user data must minimise the amount they gather and take extra care when processing it.\nThe ICO's investigations into Reddit and Imgur will focus on how the platforms check the ages of their users and their enforcement of age checks.\nOfcom said in October Reddit had overtaken X as the UK's fifth most popular platform.\nImgur, meanwhile, says on its website that it reaches more than 250 million people a month. However, it does not state in which countries their users are based, so there is no figure for the number of people using it in the UK.\n\"I don't want to pre-judge how we might look at the Imgur and Reddit matters, but if there are age limits for accessing services, then the platforms have to enforce those in some ways,\" the Information Commissioner told the BBC.\n\"There are a number of different technologies and techniques that are available, I would say, and the degree of rigor, I think, depends in part upon the kinds of risks, the likelihood that children will be accessing those sites.\n\"I guess a baseline would be: self-declaration is probably not going to cut it if there is content on the site or services on the site that are unsuitable for children under the age of 13.\"\nA Reddit spokesperson told the BBC that 95% of their users are adults but that they \"have plans to roll out changes this year that address updates to UK regulations around age assurance\".\nImgur has not responded to the BBC's request for a comment.", "url": "https://www.bbc.co.uk/news/articles/c62xxz141plo"}