{"authors": ["Oscar Edwards", "Alexandra Bánfi", "www.facebook.com"], "date_download": "2025-04-26 06:31:06", "date_modify": "2025-04-26 06:31:06", "date_publish": "2025-02-27 09:54:53", "description": "Three pelvic floor experts set up a podcast to break down the stigma attached to female incontinence.", "filename": "news_articles_c80yyy12p75o_1745649066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/811d/live/d2736dd0-f4db-11ef-a18f-394b1249001d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c80yyy12p75o_1745649066.html", "title": "Bladder weakness: Women 'scared to laugh' due to incontinence", "title_page": "Bladder weakness: Women 'scared to laugh' due to incontinence - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Women should not fear laughing, jumping or sneezing, health experts who are raising awareness of incontinence say.\nRuth Astbury, a therapeutic and hormone coach in Denbighshire, and two pelvic health physiotherapists in Gwynedd, Faye Cunningham and Lizzie Evans, will share their experiences on their new podcast Oops! I Peed My Pants.\nWomen spend about £23,000 on hygiene products for incontinence during their lifetime, they said.\nThey blamed a lack of education on how to properly perform pelvic floor exercises to strengthen the muscles that support the bladder, bowel and womb.\nFaye works for the NHS but also has a private clinic and said the people coming through her door are \"embarrassed\" by their bladder weakness.\nShe told Radio Wales Breakfast about a third of women in the UK suffer with bladder weakness.\n\"They're feeling frustrated they've done pelvic floor exercises but nobody has taught them to do them properly,\" she said.\nThe team hope the podcast will remind listeners that urinary incontinence is avoidable.\nThey want women to feel that simple things that we do in life such as \"laughing, sneezing, or jumping shouldn't be a risk\".\n\"When I went through my perimenopause I had no idea bladder urgency was an issue. Urgency tends to be the first symptom,\" Ruth said.\nFor Faye, it was stress incontinence that first affected her during a gym session.\n\"I had to rush to a class and you know when you need the loo but you ignore it because you're rushing, I lifted the barbell and it was just too much,\" she said.\nThe pair have been able to treat their urinary incontinence but they said many women still stay silent.\n\"Even if you have a minor leak you can go to your GP. This is a medical condition,\" said Faye.\n\"They screen out anything nasty and then send you out to an appropriate specialist, to a physiotherapist like me or an incontinence nurse.\"\nThe first episode is out on the 27 March and the hosts want to put women's stories at the \"centre of the podcast\".\n\"We encourage women to send in their stories anonymously then we read them out at the start of the podcast,\" said Ruth.\nThe stories will even get a rating from the hosts with a unique scoring system.\n\"We score them out of 10 with the pee-o-meter,\" said Faye, adding that her own story was rated a very solid eight.\nBut this light-hearted discussion around the subject of incontinence is exactly what the hosts are trying to achieve.\n\"We want to normalize this and educate people so that they don't have that experience that I had where they feel super embarrassed,\" said Faye.", "url": "https://www.bbc.co.uk/news/articles/c80yyy12p75o"}