{"authors": ["Robbie Meredith and Jayne McCormack", "www.facebook.com"], "date_download": "2025-04-26 03:44:48", "date_modify": "2025-04-26 03:44:48", "date_publish": "2025-03-05 06:42:00", "description": "New language laws for Northern Ireland were passed in the Identity and Language (Northern Ireland) Act 2022", "filename": "news_articles_c8e7446e04ro_1745639088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/31c8/live/c6c5ee90-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e7446e04ro_1745639088.html", "title": "UN criticises failure to appoint language and culture commissioners", "title_page": "UN criticises failure to appoint language and culture commissioners - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A failure by the executive to appoint commissioners for the Irish language and Ulster-Scots has been criticised by a United Nations (UN) committee.\nThe UN Committee on Economic, Social and Cultural Rights (CESCR) also criticised \"inadequate funding\" for cultural and language rights.\nNew language laws for Northern Ireland were passed in the Identity and Language (Northern Ireland) Act 2022.\nBut an Irish language commissioner and a commissioner for the Ulster-Scots and Ulster British tradition have not yet been appointed.\nThe roles, along with an Office of Identity and Cultural Expression, were originally promised in the New Decade, New Approach deal in 2020.\nBut the office has not been set up, and there are no commissioners yet in place.\nThe president of the Irish language and culture group Conradh na Gaeilge, Ciarán Mac Giolla Bhéin, welcomed the UN report.\nHe said he hoped commitments previously agreed by the Democratic Unionist Party and Sinn Féin to appoint an Irish language commissioner would soon be delivered.\n\"I hope we'll have them in place before the end of this [Stormont] mandate, I do not for the life of me understand what the delay is,\" he told BBC News NI.\nMr Mac Giolla Bhéin said Irish language campaigners were deeply disappointed that a timetable for the appointment was not spelled out in the executive's programme for government but insisted that organisations would continue to put pressure on politicians to appoint someone to the role.\nThe commissioners are meant to monitor the services public bodies deliver to Irish and Ulster-Scots speakers.\nProposals from the language commissioners have to be approved by the first minister and deputy first minister before taking effect.\nCESCR is a body of 18 independent experts that monitors how states are implementing international agreements on social and cultural rights.\nIts latest report, which has just been published, monitors the UK government's actions and those of the devolved governments, including Northern Ireland.\n\"The committee regrets that the institutions created to protect and promote the Irish language and to promote and develop the Ulster-Scot tradition have not yet been established,\" the committee's report said.\nIt recommends that the executive \"expedite the establishment of the institutions and policies envisaged for the protection and promotion of the Irish language and Ulster-Scots culture and heritage.\"\nA penal law dating from 1737, which prohibited the use of languages other than English in court, was recently repealed.\nIt cleared the way for Irish to be used in legal proceedings in Northern Ireland.\nBut there has been political disagreement over cuts to cross-border funding for the Irish language.\nThat led to a recent strike by some Irish language organisations and activists.\n\"The committee is concerned at the inadequate funding for culture and culture-related activities, which hampers the right of all to participate in cultural life, to express one's own identity, values and way of life without fear of discrimination,\" the UN report said.\nMr Mac Giolla Bhéin said the UN committee was \"echoing what we have been saying, not just with recent announcements around cuts to Foras na Gaeilge, but this something that's been 20 years in the making.\"\n\"We have way more kids now enrolled in Irish medium education, we've much deeper demand for services across the whole strata of society, yet groups are expected to do more and more with less and less,\" he said.\n\"That isn't sustainable, groups are really staring into the abyss as things stand.\n\"We welcome that the report has highlighted this but more importantly it needs to be on the radar of Stormont to ensure a solution is found urgently to address this crisis.\"\nThe UN Committee also highlighted other rights in its report, including expressing concern about the controversial Troubles Legacy Act and recommending \"access to safe abortion services\".\nIt also called for more schemes to help women, people with disabilities, young people, ethnic minorities and migrants into employment.\nWhile it cannot force the UK government or the Northern Ireland Executive to act, the governments will have to report to the UN committee on what steps they are taking to implement its recommendations.", "url": "https://www.bbc.co.uk/news/articles/c8e7446e04ro"}