{"authors": ["David McKenna", "www.facebook.com"], "date_download": "2025-04-26 04:05:28", "date_modify": "2025-04-26 04:05:28", "date_publish": "2025-03-03 17:26:40", "description": "John Hardie, who was employed as a tutor at schools in Hull, has been banned indefinitely.", "filename": "news_articles_cdjy9p3y3d0o_1745640328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea29/live/90f983a0-f853-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjy9p3y3d0o_1745640328.html", "title": "Teacher who tried to spy on girl in McDonald's toilets struck off", "title_page": "Teacher who tried to spy on girl in McDonald's toilets struck off - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teacher who attempted to spy on a girl in the toilets at a fast-food restaurant has been struck off.\nJohn Hardie, 41, admitted following the girl into the female toilets at a branch of McDonald's, in Cottingham Road, Hull, in 2019, in an attempt to watch her carrying out a private act.\nThe Teaching Regulation Agency panel, which published its findings last week, heard the incident had been sexually motivated.\nThe panel found his behaviour amounted to unacceptable professional conduct and he was prohibited from teaching indefinitely.\nThe hearing, which took place on 4 February, heard that Mr Hardie was caught on CCTV in McDonald's leaving the male toilets as the girl entered the female toilets.\nHe was then seen to hesitate before following her in, before returning to the main restaurant area.\nIn a police interview in 2019, Mr Hardie admitted there had been \"an element of sexual curiosity\", the report, external stated.\nIn October 2019, he was issued with a sex offender notification requirement until October 2021 after accepting a police caution for attempted voyeurism.\nThe panel heard Mr Hardie had been engaged on a self-employed basis to undertake small groups and one-to-one tuition, working for Hull City Council and a number of local schools, including Winifred Holtby Academy and Wolfreton School and Sixth Form College.\nAt the time of the incident, he was working for Newland School for Girls, although the incident took place \"outside the education setting\".\nVicky Callaghan, the head teacher at Newland School for Girls, told the BBC: \"Mr Hardie was working for the school as a part-time, self-employed tutor.\n\"He was immediately suspended from duty and his services terminated.\n\"We reassure our school community that there was absolutely no suggestion of any improper behaviour at the school.\"\nIn a statement, Hull City Council confirmed that Mr Hardie was also employed at Newland School for Girls in 2014 and 2015 while under local authority control, before the school became an academy in 2017.\nOutlining its decision, the panel found all of the allegations proven, which it said amounted to unacceptable professional conduct and conduct that may bring the profession into disrepute.\nThe order means Mr Hardie is prohibited from teaching indefinitely and cannot teach in any school, sixth-form college, relevant youth accommodation or children's home in England.\nThe BBC has contacted the other named schools, as well as the Department for Education.\nListen to highlights from Hull and East Yorkshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cdjy9p3y3d0o"}