{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 04:30:44", "date_modify": "2025-04-26 04:30:44", "date_publish": "2025-03-03 06:19:38", "description": "About 31,000 trees are planted in the Chew Valley to help boost biodiversity and combat flooding.", "filename": "news_articles_cz03d18erp0o_1745641844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dbdd/live/15501270-f79d-11ef-81b5-6f876420d457.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz03d18erp0o_1745641844.html", "title": "Bristol volunteers plant record number of trees in woodland", "title_page": "Bristol volunteers plant record number of trees in woodland - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volunteers say they have broken their record for the number of trees planted in a single day in a bid to restore woodland and enhance biodiversity.\nGreat Avon Wood, situated in the Chew Valley near Bristol, is a 113-acre (46-hectare) partnership project involving the Avon Needs Trees and the Forest of Avon Trust.\nOn 23 February, the team planted 1,100 trees to help create new hedgerows and expand the landmark woodland between Bristol and Bath.\nThe mix of native trees would fight climate change, provide a crucial space for nature, and help to combat the risk of increased flooding in the local area, those involved said.\nAvon Needs Trees is a charity creating new, permanent woodland throughout the Bristol-Avon River catchment to tackle climate and nature emergencies.\nMore than 31,000 trees have been planted on the site since 2023, with a new heritage trail walking path set to open later this year.\nVarious species have been planted to ensure biodiversity thrives, including field maple, hawthorn, white willow, hornbeam and hazel varieties.\nThe latest milestone event was made possible by a dedicated team of volunteers from the environment directorate team from the West of England Combined Authority (WECA), which has also financially contributed to the project.", "url": "https://www.bbc.co.uk/news/articles/cz03d18erp0o"}