{"authors": ["Gareth Gordon and Raymona Crozier", "www.facebook.com"], "date_download": "2025-04-26 06:36:53", "date_modify": "2025-04-26 06:36:53", "date_publish": "2025-02-26 06:42:32", "description": "Agriculture Minister Andrew Muir plays down postponement after he asked to see finalised document.", "filename": "news_articles_c4g7p7yxlpwo_1745649413.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4dc3/live/85681cf0-f43d-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g7p7yxlpwo_1745649413.html", "title": "Stormont: Programme for government postponement ‘storm in a teacup’", "title_page": "Stormont: Programme for government postponement ‘storm in a teacup’ - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Agriculture Minister has said the reaction to a decision to postpone the agreement of a long-delayed programme for government is \"a storm in a teacup\".\nAndrew Muir said the meeting was pushed back after he asked to see the finalised document before signing but he was \"confident\" it could be agreed on Thursday.\nThe meeting was due to be held on Wednesday morning but it emerged late on Tuesday night that further work is required, with the SDLP's Matthew O'Toole calling the delay a \"farce\".\nSpeaking in the House of Commons, Northern Ireland Secretary Hilary Benn said he hoped the programme for government would be agreed \"as soon as possible\".\nIt comes after the draft document was agreed in September 2024 and sent out for public consultation.\nSpeaking on BBC News NI's Good Morning Ulster, Alliance MLA Muir said there is a meeting scheduled for Thursday morning and he was \"confident\" the programme for government will be agreed then.\n\"The only ask from myself - and I think it's a perfectly reasonable ask - is that the finalised document would be received before the meeting so we could consider it.\"\nMuir said the draft finalised document was circulated on Friday afternoon, with a deadline of Tuesday for ministerial feedback.\nHe said he has not seen the finalised document since feedback was submitted, but hopes to be able to give it \"proper consideration\" on Wednesday.\nSpeaking in the House of Commons on Wednesday, Benn said he hoped to see progress soon.\nHe was responding to a call for him to intervene from Ulster Unionist Party (UUP) MP Robin Swann.\n\"I hope very much that the programme for government will be agreed as soon as possible,\" Benn said.\n\"It is the responsibility of the Northern Ireland Executive and I look forward to reading it.\"\nSocial Democratic and Labour Party (SDLP) MP Colum Eastwood emphasised that it has been a year since the executive was re-established and it \"has still been unable to agree a programme for government\".\n\"Does the secretary of state agree with me, on behalf of the people of Northern Ireland, it's time they get on with it?\" he said.\nIn response, Benn said he was \"confident another meeting will be arranged\".\nOne source played down the significance of the delay saying \"there's no showstoppers in this\".\n\"It's a process story,\" added the source, \"but there's no sugar coating a postponement and the media is entitled to ask questions.\"\nNevertheless this development does raise obvious questions about the four-party coalition's ability to govern cohesively.\nThere had previously been an expectation that the programme for government would be agreed before the anniversary of Stormont's return earlier in February but that that did not happen.\nSpeaking at the Galgorm on Wednesday as part of an Irish Football Association event, Gordon Lyons, of the Democratic Unionist Party (DUP), said he believed the delay was a \"process issue\".\nHe added that he expected \"an executive meeting within the next 24 hours\".\nSpeaking on Wednesday, leader of the assembly's opposition Matthew O'Toole said it was \"disappointing\" that the Alliance party were responsible for the final delay.\n\"Nobody expected the executive to work miracles, but delivering a budget or programme for government on time shouldn't be too much to ask,\" the SDLP assembly member said in a statement.\n\"This farce typifies the dysfunction we have seen since the return of the Stormont institutions last year,\" O'Toole added.\nPreviously O'Toole had criticised the lack of clear targets in the document and called on ministers to specifically address reducing waiting list times.\nTUV leader and North Antrim MP Jim Allister described the situation as \"the latest episode in the Stormont farce\".\nHe said there were \"always excuses but the reality is this is an unworkable system of government\".\nAnalysis by Jayne McCormack, BBC News NI political correspondent\nLate-night messages to the media to say an important executive meeting had been postponed - with little explanation - after plans were already in place to sign off a major document would, in a previous iteration of this executive, spelt big trouble.\nBut within minutes of this news breaking, parties were at pains to call it nothing more than a storm in a teacup and talk it down.\nThe picture then became clearer: the issue appeared to be with the process of getting it over the line as opposed to anything in the document.\nWith some parties saying they only got the final version from the executive office late last week, Alliance wanted more time to consider the programme for government before signing it off.\nNow that is a complaint we have heard before - concerns about being bounced at the last minute by the bigger parties.\nWith this document already long overdue, it's yet another reminder of how slow and difficult it can be to operate within a four-party mandatory coalition.\nIn short, while it's not anything remotely resembling a crisis, to some it looks more like incompetence.\nIt's been a while since the last programme for government was approved.\nNorthern Ireland's devolved government was restored in February 2024 after the DUP ended a two-year boycott over post-Brexit checks on goods going between Northern Ireland and Great Britain.\nThe last time an executive managed to get one over the line was during the Assembly's fourth term between 2011 and 2015.\nOne was also agreed in 2016 and went out to public consultation.\nHowever before it could be passed, the then Sinn Féin Deputy First Minister Martin McGuinness resigned in January 2017 and power sharing collapsed.", "url": "https://www.bbc.co.uk/news/articles/c4g7p7yxlpwo"}