{"authors": ["Christine Jeavans", "www.facebook.com"], "date_download": "2025-04-26 04:34:10", "date_modify": "2025-04-26 04:34:10", "date_publish": "2025-03-03 00:47:26", "description": "The UK death rate reached a record low last year, according to exclusive analysis of death certificate data carried out for BBC News.", "filename": "news_articles_c8j09vn2x2ko_1745642050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ca50/live/75b03d10-f514-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j09vn2x2ko_1745642050.html", "title": "UK death rate 'reaches record low'", "title_page": "UK death rate 'reaches record low' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The UK death rate reached a record low last year, according to exclusive analysis carried out for BBC News.\nMortality experts looked at death certificates registered in 2024 and found that deaths per head of the population had returned to pre-pandemic levels and were slightly below the previous record in 2019.\nHowever, the new figure puts the UK back on its long-term trend of only gradual improvement.\nThe research was carried out by analysts from the Continuous Mortality Investigation (CMI) at the Institute and Faculty of Actuaries.\n\"This is five years of basically flat mortality improvement, it's pretty poor by historical standards,\" said Stuart McDonald from the CMI.\nThere was also a \"concerning\" rise in the death rate at young working ages, he said.\nA Department of Health spokesperson said the government was \"shifting focus from sickness to prevention\".\nThe registered death rate in the UK steadily halved from 1974 to 2011 largely driven by improvements in tackling heart disease, including smoking prevention and medical advances.\nFrom 2011 to 2019 the improvements drastically slowed, then changed direction during Covid as thousands more people died than normal. The first post-pandemic year of 2022 also saw high numbers of extra deaths.\nTo calculate the record low 2024 UK figure of 989 deaths per 100,000 people, analysts at the CMI used provisional weekly death registration figures for the four nations of the UK.\n\"Clearly, it's very good news that our mortality rate is lower in 2024 than it was,\" says Dr Veena Raleigh, epidemiologist at health think tank The King's Fund, external. \"But if you look at the broader canvas then it's not so good.\"\nAlthough similar countries also experienced a slowdown since 2011, the UK's has been more severe and our life expectancy is at the \"bottom of the pack of comparable countries,\" she says, adding that nations such as Spain returned to pre-pandemic levels by 2023.\nResearchers point to a variety of reasons behind the slowdown since 2011. Some of the \"low hanging fruit\" of improvements in heart disease and cancer, such as the cut in smoking rates, had already happened, making further gains harder.\nAt the same time, the UK saw rising risk factors, including obesity, poor diet and low levels of exercise, against a backdrop of widening social inequality and pressure on the NHS.\nSome academics argue that austerity cuts to public services after the 2008 financial crash had a strong impact on life expectancy, while others say it's not possible to prove this directly.\nDementia and Alzheimer's disease is the leading cause of death in England and Wales, according to the latest official figures, external. Heart disease, lung disease, strokes, lung cancer also feature highly, along with flu in some years.\n\"Cardiovascular disease remains a leading killer in the UK,\" said Prof Bryan Williams OBE, chief scientific and medical officer at the British Heart Foundation.\n\"The plateau we have seen in reducing the number of deaths... is a serious cause for concern, made worse by the impact of the pandemic on an already overstretched health service.\"\nHe added that early deaths from cardiovascular disease had grown in the most deprived areas of England and called for \"urgent government action\" in its prevention, detection and treatment.\nOverall death rates are largely a reflection of older people's health as more than three-quarters of UK deaths happen over the age of 70.\nSo the main trend is driven by what is happening to people in this age group.\nBut the CMI found \"really significant differences\" at younger ages says Stuart McDonald, with a \"concerning\" upward trend in mortality among 20-44-year-olds.\n\"For this age group, death rates have actually been going up slightly, even before the pandemic. If we go back to 2011 we can see a slight increase in death rates year-on-year.\"\nThe CMI took weekly provisional death registration data from the Office for National Statistics, external, for England and Wales, National Records of Scotland, external and Northern Ireland Statistics and Research Agency, external and calculated the 2024 rate.\nThe rate is age-standardised, which means that you can make comparisons with other years even though the UK population as a whole is getting older.\nChanges to the death registration process, external may mean that more 2024 deaths are registered in 2025 than was the case for the previous year, but the CMI says this is not the main explanation for the return to the pre-pandemic trend.", "url": "https://www.bbc.co.uk/news/articles/c8j09vn2x2ko"}