{"authors": ["Chloe Hughes", "www.facebook.com"], "date_download": "2025-04-26 07:06:04", "date_modify": "2025-04-26 07:06:04", "date_publish": "2025-02-28 06:19:07", "description": "The ban covers the entirety of the Wolverhampton, Dudley, Sandwell, and Walsall.", "filename": "news_articles_cwynnxpd31jo_1745651164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d7a/live/7ea812a0-f544-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynnxpd31jo_1745651164.html", "title": "Black Country street racing ban to continue", "title_page": "High Court allows Black Country street racing ban to continue - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An injunction banning street racing in the Black Country has been permitted to continue, a council has said.\nThe injunction, led by the City of Wolverhampton Council, prohibits people from participating in street racing as a driver, rider or passenger, as well as from promoting, organising or publicising gatherings, or participating as a spectator.\nAnyone breaching the injunction - which covers the whole of Wolverhampton, Dudley, Sandwell, and Walsall - could be imprisoned, fined, or have assets seized.\nThe authority said permission was given at the High Court on Wednesday.\nThe full and final injunction was originally granted by the High Court in February 2024, with the order and power of arrest remaining in force until at least 2027, subject to the annual review.\nA further annual review will be held by the court in about 12 months' time.\nEvidence was presented to the court to support its continuation.\nPardip Nagra, Wolverhampton anti-social behaviour team leader, said the injunction had reduced racing, and led to seven people being found in contempt of court over the last 13 months.\nPC Mark Campbell from West Midlands Police said there had been a 38% decrease in street racing complaints in the Black Country between 2023 and 2024.\nMr Justice Ritchie permitted the continuation with minor amendments to the injunction's wording.\n\"I find that the order has been very effective in protecting the public, catching criminals, bringing them before the court quickly, and giving them a punishment which seems to be working,\" he said.\n\"This action has probably saved lives and very probably prevented injuries - and the councils and police should be congratulated on doing it.\"\nThe injunction will remain in place in its current form until the revised order comes into effect in the coming weeks.", "url": "https://www.bbc.co.uk/news/articles/cwynnxpd31jo"}