{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:45:30", "date_modify": "2025-05-21 07:45:30", "date_publish": "2025-05-20 00:00:00", "description": "First Minister Eluned Morgan takes questions in the Senedd.", "filename": "news_live_cglee987k7yt_1747813530.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5295/live/30d2cfa0-3560-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cglee987k7yt_1747813530.html", "title": "First Minister's Questions from the Senedd: 20 May 2025", "title_page": "First Minister's Questions from the Senedd: 20 May 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Illegal high-speed electric bikes\nLabour's Jenny Rathbone asks \"what work is the Welsh government doing with relevant stakeholders to crack down on illegal high-speed electric bikes?\"\nEluned Morgan replies \"we recognise the danger illegal high-speed e-bikes pose to vulnerable road users and riders, and are committed to keeping public spaces safe. While road traffic law is not devolved, we are working with road safety partners and the active travel board to find effective solutions.\"\nJenny Rathbone adds, \"the police have told us that they are occasionally doing raids and stopping these very dangerous vehicles and confiscating them, but more needs to be done. These are bikes that have been souped up to travel at much greater speeds than for 20 mph. I see them myself when I am travelling along the road on a bike. So, when they are seized, I want to know what happens to them. In line with reduce, reuse, recycle, what discussions may you have had with the police and local authorities to see if these bikes could be reverted to their original purpose, which is to enable vulnerable people who may have difficulty using a pedal bike to be able to get around, particularly travelling up hills?\"\nThe first minister replies, \"we really welcome initiatives like the one introduced by South Wales Police and their partners, in which they work together to enforce against anti-social illegal riding, and they deliver training and awareness courses at the same time. So, we want to make sure we work with them and make sure that illegal e-bikes that pose those risks are tackled, and that we work with partners to make sure that, where possible, we can revert them to the initial condition that they were in.\"\n'Anguish' following change in the issuing of death certificates\nLlyr Gruffydd, Plaid Cymru MS for north Wales, asks the first minister to \"outline how the recent statutory change in the issuing of death certificates has impacted the Welsh NHS\".\nHe warns that the new legislation that requires senior doctors in England and Wales to independently scrutinise every death is leading to long and unacceptable delays for some families to receive a death certificate for a family member before bodies can be released for funeral arrangements.\nHe says \"it's sometimes six, seven or up to eight weeks, from some of the cases that I've seen, after the person has passed away. Now, that, of course, leads to increased anguish, where families can't proceed with the financial, the legal or the practical arrangements that need to be put in place, the emotional toll is significant as well, and, of course, it's especially pertinent for faith communities for whom a quick burial is of the utmost importance.\"\nEluned Morgan replies \"I absolutely sympathise. When you've gone through a loss like that, and then you have to wait, I think that is really, really difficult for families. I think it's probably worth reminding people why this is happening. This is happening because the changes as a result of many high-profile reviews, including the Shipman inquiry, meant that people - and after that big, long inquiry - said that you need additional safeguards to the death certification process. So, there is a little bit of bedding in. It has taken longer than we've hoped. The latest median time from death to registration has remained stable now at 11 days, down from 14. I still think it's too long, but it's definitely coming down. And what we do have is a strategic oversight group that is moving things on, and are making changes, to try and see if we can reduce that further.\"\nThe death certification reforms came into effect on 9 September 2024, , externaland are designed to provide better safeguards against medical negligence.\nUnder the new system, which was brought about partly in response to Harold Shipman's murders, , externalGPs no longer issue death certificates independently.\nAfter a GP completes a medical certificate of cause of death (MCCD), an independent medical examiner reviews it.\nOnce approved, the certificate is sent to the registrar, who officially records the death.\nThe process means GPs have to give access to a patient's records in order for the medical examiner to decide if they agree with the MCCD.\nImpact of immigration white paper on social care?\nPlaid Cymru MS Cefin Campbell asks \"what assessment has the Welsh government made of the impact of the UK government's immigration white paper on social care in Mid and West Wales?\"\nHe says the immigration plan \"fails to recognise the contribution that migrant workers and overseas students make to our economy, and represents a further lurch to the right from a prime minister determined to dance to Nigel Farage’s tune\".\nEluned Morgan says the Welsh government is analysing the immigration white paper and its impact on all sectors, including social care.\nShe adds, \"our overseas workers in our social care sector are appreciated, and they do make a great contribution, and a significant contribution, to our workforce. They bring diversity, they bring experience, they bring sympathy and skills into our sector\".\nShe says that in Hywel Dda health board, one in every 10 of the workforce comes from overseas, but almost 50 per cent of dentists and GPs come from overseas.\nThe white paper proposes care workers on sponsored visas would need to remain in the UK for 10 years before gaining the right to live and work here indefinitely - double the current requirement of five years.\nThe proposal was announced in a speech by the prime minister last week, where he warned the UK risks becoming an \"island of strangers\".\nSir Keir Starmer did not set a precise target, but the Home Office estimated the new policies could lead to a 100,000 drop in immigration per year by 2029.\nAccording to Social Care Cymru, around 88,000 people work in Wales' care sector, with approximately 15% to 20% coming from overseas.\n'Labour is botching its response to the damage of Brexit'\nOn the new deal between the UK and the EU, Plaid Cymru leader Rhun ap Iorwerth says \"I'm pleased that there is some acceptance now of the harm of Brexit, but it's not bold enough in its response to that reality\".\nHe says \"with its so-called 'partnership in power' and promise of two Labour governments working together in the interest of the people of Wales, I would have expected the first minister to have been sighted on the deal in advance and to have been given an opportunity to influence the prime minister, especially given that parts of the deal involved areas of devolved responsibility. But, in yet another signal that Wales's voice matters little to UK Labour, the first minister has admitted, I heard her myself, she was again sidelined, including on those aspects of the deal that fall under the jurisdiction of this Senedd.\"\nHe asks, \"why does she continue to allow Keir Starmer to treat the Welsh government, this institution and the people of Wales with such contempt?\"\nEluned Morgan replies, \"It's really important for us to recognise that this is a good deal for Wales, and the priorities that we set out, that we've worked up a long time ago, that we've worked through with relevant departments of government in Whitehall, have actually been taken on board. If you look at what's happened in relation to SPS: bringing down export barriers, making sure that those defence opportunities come our way, making sure that the issues surrounding steel were considered and making sure that the youth exchange and energy issues were addressed, those were things that were all on our list of things that we wanted to see, and I am delighted to see that they've been respected. The fact is, we weren't there at the final signing, no, because we are a part of the United Kingdom, and they're the lead nation. You may not like that, as a nationalist, but I am keen to remain a part of the United Kingdom, and that's the way it works.\"\nSPS is Whitehall speak for sanitary and phytosanitary and translates to animal and food rules.\nDescribing herself as a \"euro-enthusiast,\" Eluned Morgan says she was \"gutted\" that the UK left the EU, but wanted \"as close as possible a deal with the European Union in order for our country and our nation to thrive\".\nRhun ap Iorwerth accuses her of wavering from her belief that Wales would benefit from membership of the single market and the custom union.\n\"We have a first minister who says she's a euro-enthusiast, but that's in words only,\" he says.\n'Dreadful' deal between UK and EU\nFresh from his party's conference in Llangollen, Darren Millar, leader of the Welsh Conservatives in the Senedd, raises the topic of the new deal struck between the UK and the EU.\nHe says \"let's be clear about what this deal means: free movement back, payments to the EU back, EU rules back, our fishing industry here in Wales betrayed, an unacceptable mobility scheme, billions of taxpayers' money going back to Brussels, being forced to accept EU rules and decisions from the European court, and European fishing boats in Welsh waters, in British waters, for at least the next 12 years. First Minister, you've got a responsibility to stand up for Wales and represent us. Why on earth have you welcomed this absolutely dreadful deal?\"\nEluned Morgan replies that the \"Tories botched Brexit\".\nShe elaborates, \"you promised the people of Wales that they would be better off as a result of Brexit. You said the NHS would be getting more money as a result of Brexit. The people of Wales have had their eyes opened and they've realised that they were told untruths in relation to what they were promised at the Brexit referendum. The fact is that what we will see now is much better opportunities for jobs in this country because people will be able to export to the EU for the first time without that red tape that occurred before. We have seen a £700 million drop in exports to the EU since Brexit. That was your group that promoted that, and that really means real jobs affecting real people in our communities. I am proud that we are moving ahead and that we have got lots of very significant things that will benefit Wales as a result of the third trade deal that has been made within two weeks by the UK government.\"\nSex education in schools\nLlywydd Elin Jones conducts a ballot to determine the names of members who may table questions to the first minister.\nConservative Natasha Asghar raises the topic of the provision of sex education in schools.\nShe refers to \"Bridgend County Borough Council’s quite horrific stance on sexual choking, and how it is indeed taught in schools\".\nThe council created a PowerPoint presentation that appeared to endorse strangulation during sex that was intended to be used in schools.\nThe slides included the sentence: \"It is never OK to start choking someone without asking them first.\"\nBridgend county council have said it was part of a \"draft version\", never shown to children and the slides were dropped following feedback from professionals.\nNatasha Asghar asks \"do you agree with me today that this is wholly unacceptable as a saga, and has been a colossal waste of time and money, and that efforts should be better spent on tackling important issues within our schools, like the proliferation of pornography amongst young people instead?\"\nFirst Minister Eluned Morgan replies \"I agree with you: there is absolutely no place for that kind of instruction within our schools. And I want to be absolutely clear that any materials condoning, or being seen to condone any form of harmful sexual behaviour, including non-fatal strangulation, are completely unacceptable in any school.\"", "url": "https://www.bbc.com/news/live/cglee987k7yt"}