{"authors": ["Rebecca Brahde", "www.facebook.com"], "date_download": "2025-04-26 06:33:24", "date_modify": "2025-04-26 06:33:24", "date_publish": "2025-02-27 06:54:47", "description": "Proposed changes to the Proceeds of Crime Act include modernising laws to include digital assets.", "filename": "news_articles_ckgyr7yykr3o_1745649204.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2105/live/aa6a29e0-f450-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgyr7yykr3o_1745649204.html", "title": "Views sought on plans to update Manx anti-money-laundering laws", "title_page": "Views sought on plans to update Manx anti-money-laundering laws - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Proposals have been put forward to modernise laws tackling financial crime on the Isle of Man to include technologies such as crypto and digital assets.\nThe Department of Home Affairs has launched a consultation on its plans to update the Proceeds of Crime Act 2008 with three draft bills.\nUnder the proposed changes, it would also be made obligatory to report suspicions of money-laundering to the financial intelligence unit.\nJustice and Home Affairs Minister Jane Poole-Wilson said the updates would \"play a pivotal role in providing the legislative basis for us to properly combat financial crime\".\nThe changes also include plans to reduce the period of time for a confiscation order to be made after a defendant has failed to surrender assets, as well as increasing the threshold level for exemption from £250 to £1,000.\nThe would raise the value below which some transactions can be carried out by certain businesses in operating an account for a customer without committing an offence.\nThe department said while the existing 2008 legislation was \"vital\" in tackling money laundering and countering the financing of terrorism, it needed \"modernisation to meet changing international standards\" and keep up with new technologies.\nPoole-Wilson said: \"'The economic and fiscal stability of the island is key to its future success, as is our ability to continue to be part of the wider world of respected and responsible financial jurisdictions\".\nThe proposed changes would be covered in the Draft Proceeds of Crime (Miscellaneous Amendments) Bill 2025, Draft Proceeds of Crime (Amendment) (Forfeiture of Money held in Bank and Building Society Accounts) Bill 2025, and Draft Proceeds of Crime (Amendment) (Unexplained Wealth Orders) Bill 2025.\nThe consultation is available online until 27 March, external.", "url": "https://www.bbc.co.uk/news/articles/ckgyr7yykr3o"}