{"authors": ["Kevin Hay", "www.facebook.com"], "date_download": "2025-04-26 03:59:34", "date_modify": "2025-04-26 03:59:34", "date_publish": "2025-03-04 06:10:44", "description": "A wheelchair user backs calls for work to narrow the gap between train and platform at Saltash.", "filename": "news_articles_crkn2p5zmd4o_1745639974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2af8/live/3de0d810-f837-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crkn2p5zmd4o_1745639974.html", "title": "Wide gap at Cornwall rail station should be fixed", "title_page": "Wide gap at Cornwall rail station should be fixed - wheelchair user - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It puts you in a position of frustration and makes you feel terrible on the inside.\"\nThat is how wheelchair user Scott Stonebridge described being unable to board the train at his nearest railway station in Saltash, Cornwall, due to the large gap between the train and the platform.\nMr Stonebridge - who has Motor Neurone Disease (MND) and travels to London to participate in scientific studies into his condition - was among those backing calls for work to improve the station.\nNetwork Rail, which operates the railway network, said it was working with local authorities to source funding to make the London-bound platform at Saltash \"compliant with current standards for platform heights\".\nMr Stonebridge said being unable to board a train at his local station was \"exasperating\".\nHe said the gap between the platform and train was too wide and steep for the use of a ramp.\n\"It puts you in a position of frustration and makes you feel terrible on the inside,\" he said.\n\"It makes you feel having a disability puts you in a box and you don't feel like anybody else.\"\nDue to the lack of wheelchair access, Great Western Railway (GWR), which manages the station, is obliged to pay for a taxi to take Mr Stonebridge to Plymouth where he is able to board a train.\nHowever, Mr Stonebridge said it added time and made his journey to London more exhausting.\nSaltash Town Council said it would work with Network Rail to seek funding for improvements at the railway station.\nIt said many people were unable to board trains on Platform 2 because of the access problem.\nSaltash mayor Julia Peggs said the wide gap also affected able-bodied people.\n\"It's anybody with children in pushchairs; elderly people who can't push themselves on there,\" she said.\n\"I'm quite a short person and I find real difficulty getting on the train myself and I can't do it if I have a suitcase.\n\"It's not just people that have a disability.\"", "url": "https://www.bbc.co.uk/news/articles/crkn2p5zmd4o"}