{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:47", "date_modify": "2025-05-19 15:37:47", "date_publish": "2015-02-13 11:47:49", "description": "European Union leaders call for stricter checks on travellers entering the passport-free Schengen area, in response to last month's Paris attacks.", "filename": "news_world-europe-31453478_1747669067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80983000/jpg/_80983474_485238765.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31453478_1747669067.html", "title": "EU needs stricter border checks to disrupt terrorists, say leaders", "title_page": "EU needs stricter border checks to disrupt terrorists, say leaders - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "European Union leaders have called for stricter checks on travellers entering the passport-free Schengen area, in response to last month's Paris attacks.\nAt a meeting in Brussels on Thursday they agreed on a need to strengthen measures to \"disrupt terrorist travel\".\nChecks would be carried out on \"individuals enjoying the right of free movement\" against anti-terrorism databases, a statement said, external.\nEU travellers can often avoid extensive ID checks under the Schengen agreement.\nThe agreement abolished internal borders, enabling passport-free movement between 26 European countries. The United Kingdom and Republic of Ireland are not involved.\nSpain had suggested that the agreement might have to be amended to permit more border checks on people suspected of having terrorist links.\nBut European Commission President Jean-Claude Juncker said the Commission saw no need to revise the Schengen rules for now.\nIt was agreed that more could be done under the existing framework to monitor travellers entering or leaving the Schengen zone without changing the agreement or undermining the right to free movement.\nCountries would \"proceed without delay to systematic and co-ordinated checks'' on anyone whose movements are flagged as suspicious by databases that use unspecified \"common risk indicators\", the statement said.\nEuropean Parliament President Martin Schulz endorsed tighter controls, but said there were red lines he and other lawmakers would refuse to cross.", "url": "https://www.bbc.com/news/world-europe-31453478"}