{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 06:51:44", "date_modify": "2025-04-26 06:51:44", "date_publish": "2025-02-28 17:36:31", "description": "Loganair is awarded the contract for the island's patient transfer system for the next three years.", "filename": "news_articles_c74kz9kdpevo_1745650304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/570b/live/2ba8c4f0-f5f8-11ef-9de2-8d109cf4aecf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c74kz9kdpevo_1745650304.html", "title": "Airline retains Isle of Man's patient transfer service contract", "title_page": "Airline retains Isle of Man's patient transfer service contract - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Loganair will continue provide the Isle of Man's patient transfer services for non-urgent hospital appointments in the UK for next three years, Manx Care has confirmed.\nThe regional airline already has the current contract for the service, which sees the Manx government arrange air transport to Liverpool for those receiving treatment in the UK.\nThe health care body's chief executive Teresa Cope said the air links offered \"vital connectivity\" for residents who need treatment that cannot be given on island.\nLoganair chief executive Luke Farajallah said those travelling for health reasons \"expect the very best care from their airline and the team was \"determined\" to deliver it.\nThe operator took over the service following the collapse of Flybe in 2020, with about 15,000 patient transfer journeys taken each year.\nThe government has contracts with several hospitals, predominantly in the North West of England, which deliver specialist treatment not available on the island, such as transplants, burn care and specialised cancer treatment.\nThe contract, which was awarded after a tender process, involves a minimum daily return service from Monday to Friday, providing flights mainly to and from Liverpool John Lennon Airport.", "url": "https://www.bbc.co.uk/news/articles/c74kz9kdpevo"}