{"authors": ["Nick Eardley", "www.facebook.com"], "date_download": "2025-04-26 07:39:11", "date_modify": "2025-04-26 07:39:11", "date_publish": "2025-02-27 13:26:01", "description": "President Trump has repeatedly claimed that the US has given over $300bn to Ukraine, but he is incorrect.", "filename": "news_articles_crew8y7pwd5o_1745653151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94e6/live/84381380-f460-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crew8y7pwd5o_1745653151.html", "title": "How much has the US given to Ukraine?", "title_page": "How much has the US given to Ukraine? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Support for Ukraine has become a key issue since Donald Trump returned to the White House.\nPresident Trump has made a number of claims about how much the United States has spent compared to European countries.\nBut some of his claims are questionable - with no evidence to back them up.\nPresident Trump has made this claim on a number of occasions - including when he hosted France's President Macron in the White House this week.\nShort answer: Figures suggest the actual spend is much lower.\nBBC Verify can find no evidence to back up the claim. There are different calculations on US spending in or related to Ukraine - and they produce a much lower figure.\nThe Kiel Institute is a German-based think tank tracking support going into Ukraine. It calculated that the United States spent $119.7bn (£94.3bn) on aid between January 2022 and December 2024.\nOthers have reached a higher figure - but with a broader definition of what counts as spending on Ukraine.\nThe US Department of Defense has provided a figure looking at all spending on Operation Atlantic Resolve - a response to Russia's invasion of Ukraine.\nIt says $182.8bn has been \"appropriated\" - a figure that covers US military training in Europe and replenishment of US defence stocks.\nEither way, both figures are considerably lower than claimed by the president.\nWe asked the White House about the basis for the $350bn claim. So far, it hasn't provided an explanation.\nThe United States is, by some margin, the largest single donor to Ukraine. But Europe combined has spent more money than the United States, according to the Kiel Institute.\nThe figure includes aid directly from the European Union, but also from bilateral deals from European countries, both inside and outside the EU. It includes military, financial and humanitarian aid.\nThey calculate that between 24 January 2022 and the end of 2024, Europe as a whole spent $138.7bn on Ukraine. In the same period, the United States spent $119.7bn, according to their figures.\nNATO secretary general Mark Rutte made a similar argument, adding Canada into his calculation.\nMr Rutte said February 2025: \"In 2024, NATO Allies provided over 50 billion euros in security assistance to Ukraine – nearly 60% of this coming from Europe and Canada.\"\nWe asked for NATO's figures, but they said they were classified.\nPresident Macron is correct, according to Kiel figures specifically on financial aid. But they suggest President Trump also has a point; the US has sent more grants, while the EU sent more loans.\nHowever, again, there are different figures out there.\nThe European Union says EU countries have provided around $145bn in aid so far and that just 35% of that has been loans. Like the United States Department of Defence, the EU has used a broader definition of what counts as aid to Ukraine.\nEU loans will have been on generous terms - so Ukraine will be repaying less interest than it would normally. In some cases, Ukraine isn't expected to pay anything, with repayments coming from revenues from frozen Russian assets.\nWhat we can say is that aid to Ukraine has been a mixture of loans and grants, external.\nBut the UK contributions are much smaller than the United States.\nThat raises a question for the UK and other European countries; if the United States withdraws a large part of its funding to Ukraine, can other states make up the difference?\nThat would require a significant increase in their contributions.\nAdditional reporting: Thomas Spencer and Tamara Kovacevic", "url": "https://www.bbc.co.uk/news/articles/crew8y7pwd5o"}