{"authors": ["Patrick Jackson", "www.facebook.com"], "date_download": "2025-04-26 07:25:07", "date_modify": "2025-04-26 07:25:07", "date_publish": "2025-02-28 00:56:41", "description": "The US leader plays down earlier frictions and predicts a \"very good meeting\" on Friday.", "filename": "news_articles_cqjdd2ej4peo_1745652307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/879b/live/d0eb21e0-f564-11ef-9d3f-a98e005b5459.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdd2ej4peo_1745652307.html", "title": "Trump commends Zelensky ahead of White House talks", "title_page": "Ukraine Russia war: Trump commends Zelensky ahead of White House talks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump has said he has a \"lot of respect\" for Ukrainian President Volodymyr Zelensky, on the eve of their talks at the White House.\nAsked by the BBC if he would apologise for recently calling him a \"dictator\", he said he could not believe he had said this. He also called Zelensky \"very brave\".\nTrump was speaking after talks with UK Prime Minister Sir Keir Starmer about ending the war between Ukraine and Russia.\nHe predicted a \"very good meeting\" with Zelensky on Friday, saying efforts to achieve peace were \"moving along pretty rapidly\".\nThis week's meetings come after the Trump administration shocked its Western partners by holding the first high-level US talks with Moscow since Russia invaded Ukraine just over three years ago.\nAmerica's new president had appeared to blame Zelensky for the war and chided him for not starting peace talks earlier.\n\"You've been there for three years,\" he had said last Tuesday. \"You should have ended it... You should have never started it. You could have made a deal.\"\nBut this Thursday, speaking after meeting Sir Keir, Trump told reporters asking about his forthcoming talks with Zelensky: \"I think we're going to have a very good meeting tomorrow morning. We're going to get along really well.\"\nAsked by the BBC's Chris Mason if he still thought Zelensky was a \"dictator\", he replied: \"Did I say that? I can't believe I said that.\"\nZelensky will be hoping to win some kind of security guarantees for his country that would underpin any peace deal that may be negotiated.\nAsked about these on Thursday, Trump only said he was \"open to many things\" but he wanted to get Russia and Ukraine to agree a deal before deciding what measures might be put in place to enforce it.\nOn his visit on Friday, Zelensky is expected to sign a deal that will give the US access to Ukraine's rare earth mineral resources.\nTrump suggested that the presence of US mining concerns in Ukraine would act as a deterrent against future Russian attacks on Ukraine.\n\"It's a backstop, you could say,\" he said on Thursday. \"I don't think anybody's going to play around if we're there with a lot of workers and having to do with rare earths and other things which we need for our country.\"\nThe British prime minister had said earlier that the UK was prepared to send troops to Ukraine after the war as part of a peacekeeping force but only if the US, Nato's leading member, provided a \"backstop\".\nAsked if the US would aid British peacekeepers if they were attacked by Russia, Trump said: \"The British have incredible soldiers, incredible military and they can take care of themselves. But if they need help, I'll always be with the British, okay?\"\nNato's Article 5 holds that Nato members will come to the defence of an ally which comes under attack.\nPraising Trump's \"personal commitment to bring peace\" in Ukraine, Sir Keir said the UK was \"ready to put boots on the ground and planes in the air to support a deal\".\n\"We're focused now on bringing an enduring end to the barbaric war in Ukraine,\" he said.\nBut, he added, it must not be a peace deal \"that rewards the aggressor or that gives encouragement to regimes like Iran\".\nAsked whether Vladimir Putin was trustworthy, the UK prime minister said his views on the Russian president were well-known.\nAsked in turn why he seemed to trust Putin and Sir Keir did not, Trump said: \"I know a lot of people that you would say no chance that they would ever deceive you, and they are the worst people in the world.\n\"I know others that you would guarantee they would deceive you, and you know what, they're 100% honourable, so you never know what you're getting.\"\nEU foreign policy chief Kaja Kallas, who had been due to meet US Secretary of State Marco Rubio in Washington before he cancelled the talks \"due to scheduling issues\", told BBC News that Putin and Russia did \"not want to have peace\".\n\"For any peace agreement to function, it needs the Europeans as well as Ukrainians on board,\" she added.", "url": "https://www.bbc.co.uk/news/articles/cqjdd2ej4peo"}