{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:35:52", "date_modify": "2025-05-21 05:35:52", "date_publish": "2025-01-05 00:00:00", "description": "Reform UK leader Nigel Farage says just because he has support from Musk, they \"don't have to agree on everything\".", "filename": "news_live_cly4j1gpd5yt_1747805752.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cly4j1gpd5yt_1747805752.html", "title": "Musk's grooming gangs attack on Jess Phillips a 'disgraceful smear' says Streeting", "title_page": "Sunday with Laura Kuenssberg: Musk's grooming gangs attack on Jess Phillips a 'disgraceful smear' says Streeting - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's a wrap\nWe're closing our Sunday with Laura Kuenssberg coverage soon but here's a summary of the first show of 2025:\nHealth Secretary Wes Streeting said that Elon Musk's attack on safeguarding minister Jess Phillips over grooming gangs is a \"disgraceful smear\"\nIt comes after Musk said Phillips \"deserves to be in prison\" after she rejected a request for the Home Office to order a public inquiry into child sexual exploitation in Oldham, saying the council should commission a local inquiry instead\nStreeting also defended his plans to reform adult social care whilst insisting \"it's going to take time to turn the NHS around\"\nReform UK leader Nigel Farage said that despite his support from Musk, they \"don't have to agree on everything\"\nHe said that people are angry about the \"mass rape scandal\" and the economy - stating that mass migration \"is making us poorer\"\nChris Philp, the shadow Home Secretary, denied that the Tories are now \"playing politics\" by calling for public inquiry over grooming gangs, despite his party's denial of one while in office\nIf you missed out on any of the action, you can click Watch & listen above or head to BBC iPlayer to catch up with today's show.\nThanks for following our coverage, see you next week!\nAreas of tension between Farage and Musk emerge\nHarry Farley\nPolitical correspondent\nNigel Farage’s defence of Elon Musk is part of a burgeoning relationship between the pair. They were recently pictured together in Donald Trump’s Florida resort of Mar-a-Lago. And there are rumours of a large donation that the billionaire Musk “may well” – Farage said – give to Reform UK.\nBut Musk’s benefits to Reform UK go beyond just money. As Farage told Laura Kuenssberg this morning, “he makes us look cool” for some young people.\n“I think he's a hero,” Farage said.\nBut for all the friendly words, there are areas of tension in the relationship between Reform UK and Elon Musk.\nOne example is over Tommy Robinson, whose real name is Stephen Yaxley Lennon. Musk has called for the far-right agitator to be released from prison. Farage is determined to distance himself from Robinson and wants him nowhere near his political party.\nFarage tried to shrug any differences off, saying just because Musk supports Reform, “doesn't mean I have to agree with everything he says\".\nBut it’s one area where the blossoming friendship between Musk and Reform UK could run into difficulties.\n'Jenrick just got more and more extreme' - Kasumu\nSam Francis\nPolitical reporter\nAs we reported in the post below, Samuel Kasumu warned that Robert Jenrick’s “extreme” comments on migration could lead to MPs being killed.\nSpeaking to the BBC after his appearance on Sunday with Laura Kuenssberg, Kasumu says: “We lost David Amess and Jo Cox when public debate around migration was charged – but the public discourse then was not as bad at what Jenrick has said.”\nKasumu, a former adviser to Tory prime minister Boris Johnson, said Jenrick had started off “sensible on migration” but since “his leadership bid he’s just got more and more extreme”.\n“Now he’s trying to demonise people coming over here legally”.\nFormer Tory advisor raises concerns over Robert Jenrick\nShortly before the end of the programme, panellist Samuel Kasumu addressed an earlier question Laura asked Chris Philp about comments by shadow Justice Secretary Robert Jenrick.\nLaura asked Philp whether he justified Jenrick’s language in a series of tweets in which he claimed the UK had “imported hundreds of thousands of people from alien cultures who possess medieval attitudes towards women”.\n\"I don’t think that Elon Musk or Nigel Farage are the most dangerous individuals in our country,\" Kasumu says. \"I think Robert Jenrick has the potential to be the most divisive person in our political history.\"\n\"I think some of his words over the last 12 months may result in some people maybe even dying, he has the potential to incite hatred in ways I’ve never seen.\"\nWhat was said on the show\nHere's a quick recap of the main points from today's programme.\nReform UK leader Nigel Farage was quizzed about his party's growing membership, with Farage telling Laura that his \"ultimate goal\" is to win the next election.\nThe issue of grooming gangs and his friend Elon Musk's recent comments on the scandal was also raised. Farage said free speech had its limits but that he believed in it, even when its offensive.\nHealth Secretary Wes Streeting was up next and said Musk's attack on safeguarding minister Jess Phillips was \"disgraceful\" and that if the businessman wants to help stop violence against women, then he should focus on making X a safe space online.\nHe defended the Labour government's record so far, saying unpopular decisions have been made but what ultimately matters is whether people think the country is in a better place at the next election.\nFinally, Shadow Home Secretary Chris Philp defended the Tories against a claim they are \"playing politics\" by calling for a public inquiry into grooming gangs after having rejected one while in power.\nPhilp says suggestion Tories didn't follow up on grooming gangs inquiry is 'nonsense'\nIf the issue of grooming gangs was so important to you, why did the government not follow up on recommendations from the \"enormous\" independent inquiry? Laura asks.\nPhilp says he doesn't think this is true, and repeats his point about a taskforce being set up set up by Rishi Sunak.\nLaura points out that the author of the inquiry said the Tories did not follow up on recommendations.\nNow that Musk and Reform UK have brought the issue of a national inquiry back up, you are talking about the issue again, Laura points out, adding that it seems like \"pretty blatant politicking\" on a very sensitive issue.\nPhilp says that is \"nonsense\".\n'Are the Tories playing politics?': Laura questions Chris Philp\nLaura is now speaking to Chris Philp, the shadow Home Secretary.\nShe begins by asking him about his party's denial of a public inquiry over grooming gangs while they were in government and asks if the Tories are now \"playing politics\" by calling for one.\nPhilp says that several things have changed since then, including that a grooming gangs taskforce, set up under Rishi Sunak, that has led to over 500 arrests but had uncovered that issues remained.\nHe also says that when the previous request for a public inquiry was made, a national inquiry was running that was looking partially at the issues but that had not been, in retrospect, robust enough.\n'Unpopular decision have been made, what matters most is delivery'\nStreeting says that \"on every front, the country has been left in a massive mess\". He repeats that it will take time to turn the UK around.\nHe adds that he knows unpopular decisions have been made, but that this has been done \"in order to get the NHS back on track\".\nAfter a few tries, Laura can get a word in - saying that \"when the country looks at what Labour's doing, they think that looks pretty terrible\". She asks if Streeting can explain exactly what Labour is doing.\nHe replies quickly, saying that what matters most is delivery. He stresses that \"people will think that the country is in a better place at the next election\".\nIt's going to take time to turn the NHS around, Streeting says\nMoving to his plans to reform adult social care, Streeting says you can't turn 14 years of failure around in six months.\n\"We went into this winter without strikes, and with big boosts on vaccines\", he says.\n\"But it's going to take time to turn the NHS around\", he adds.\n\"We have banged the drum hard\" that the NHS needs investment but also needs reform otherwise annual winter crises will come as regularly as the \"Coca Cola van and John Lewis ads\", he adds.\n'Social media platforms have role to play to help tackle violence' - Streeting\nKeeping to Elon Musk's comments, Laura says it is not a \"normal situation\" for the tech billionaire to claim the PM is complicit in the \"rape of Britain\" - can you still work with this man? she asks.\nStreeting says that if Musk wants to help tackle violence against women and girls then online platforms have got a role to play in keeping people safe online.\nStarmer's government are people who have done more than most ever do to lock up rapists, paedophiles and other \"scumbags\", he adds.\nMusk's attack on Jess Phillips 'a disgraceful smear', Streeting says\nLaura is now interviewing Health Secretary Wes Streeting, asking him to respond to Musk's comments about safeguarding minister Jess Phillips, calling her a \"rape genocide apologist\".\nHe describes the remarks as a \"disgraceful smear\", prompting Laura to ask whether it is best to tell the billionaire businessman to back off or to ignore him?\nHe replies that the best response is to make sure the most important voices of grooming victims are the focus.\nElon Musk important for Reform UK popularity, Farage says\nFarage says he has stuck with Trump through thick and thin and that if you're loyal to him, he's loyal to you.\nSpeaking again about Elon Musk, Farage says that whether or not he gives Reform UK money, he makes the party look cool with young people.\nLastly, Laura asks whether the reason he won't criticise Musk is because he might give him money, to which he says free speech is important and that he doesn't agree with everything Musk says.\nKuenssberg questions Farage on bond with Donald Trump\nLaura moves the conversation to Farage's relationship with US President-elect Donald Trump.\nThe Reform UK leader says Trump is prepared ahead of retuning to the White House and has a plan, which is quite radical. He describes the Republican as calmer compared to his first term in office.\nThis might be the last American president with a \"deep emotional to these islands\", Farage adds.\nFarage argues Trump's return to the White House will see an end to the war in Ukraine while he dismisses the American's threats to impose tariffs on imports - saying it's all avoidable.\nIs what Musk said about Starmer acceptable?\nLaura re-asks the question - is what Musk said about Starmer acceptable?\nFarage responds that if it turns out that the PM, did, when he was the Director of Public Prosecutions, not prosecute the case out of fear of what it would do to public relations, then it would be fine for him to be criticised.\nHe says the fact that Musk supports him and Reform doesn't mean they have to agree on everything.", "url": "https://www.bbc.com/news/live/cly4j1gpd5yt"}