{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:22:15", "date_modify": "2025-05-21 04:22:15", "date_publish": "2025-04-06 00:00:00", "description": "The US president has also threatened China with an additional 50% tariff on goods imported into America.", "filename": "news_live_ce3qnyr7y94t_1747801335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fee9/live/485b22f0-13c6-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_ce3qnyr7y94t_1747801335.html", "title": "Trump not considering pausing tariffs despite global turmoil", "title_page": "Trump not considering pausing tariffs despite global turmoil - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trump passes on pausing tariffs as global turmoil deepens\nUS President Donald Trump has said he's not considering a pause on new tariffs, saying he wants to allow time for negotiations with other countries.\nAsked specifically in the Oval Office about a potential break - reports which were refuted earlier by the White House, who called it \"fake news\" - Trump was direct: \"We're not looking at that.\"\nThe closing figures might not have looked dramatic over on Wall Street, but there were big swings throughout the day - a sign that investors are still feeling very nervous about how White House policies might play out, our business reporter Natalie Sherman writes.\nEuropean and Asian markets both slumped for another consecutive trading day, as US tariffs continue to send shockwaves through global supply chains.\nThe US president also reiterated his threat of additional 50% tariffs on Chinese goods if Beijing did not walk back from its 34% counter tariffs - that must be done, he says, by midday tomorrow.\nThe White House later told AFP news agency that with the incoming 34% rate and the additional 50% threat, the total extra tariffs on China this year could rise to 104% (the exact rate will be dependent on the product).\nIn response (to the response), China's US embassy spokesman tells CBS News, the BBC's US partner, that \"pressuring or threatening China is not a right way to engage\".\nOur live coverage is wrapping up, but you can stay up to date by reading our news stories:\nTrump threatens new 50% tariffs on China\nWild market swings as tariffs rattle US economy\nBig tech stocks wobble\nSome of the stocks for the so-called \"magnificent seven\" - which is made up of Nvidia, Alphabet, Amazon, Apple, Microsoft, Meta, and Tesla - sank on Monday as Donald Trump threatened further tariffs on China.\nThe group has accounted for a large chunk of the more than $5tn (£3.9tn) the S&P 500 index has lost in value in recent trading sessions, Reuters news agency reports.\nTesla shares slumped 2.6%, while Apple was down 3.7%.\nThe biggest boosts today came from Nvidia, which was up more than 3%, and Amazon.com, which added 2.5%.\nTech analyst Dan Ives says Apple has the biggest exposure to American tariffs on Chinese goods because most iPhones are assembled in China, according to Reuters.\nApple secured exemptions to US tariffs on China during Trump's first term.\nHowever, analysts are unsure if it can secure waivers this time despite announcing earlier this year that it planned to invest more than $500bn (£369bn) in the US over the next four years.\n'Threatening Beijing not right way to engage with us' - Chinese embassy\nChina will firmly safeguard its legitimate rights and interests, China's US embassy tells CBS News, the BBC's US partner.\nIn response to Donald Trump's threat of imposing 50% additional tariffs on Beijing, China says the White House is demonstrating a \"typical move of unilateralism, protectionism and economic bullying\".\nSpokesman Liu Pengyu goes on to say China has issued its position on opposing Washington's \"abuse of tariffs\" to demonstrate \"our serious and just attitude\".\nEarlier, Trump gave Beijing the deadline of midday Tuesday to remove its 34% counter-tariff.\nThe Chinese spokesman stresses that these kinds of threats are \"not [the] right way to engage with us\".\n\"China will firmly safeguard its legitimate rights and interests.\"\nWatch below to see how other countries are reacting to US tariffs:\n'Unforced error' and 'uncertainty': How a dramatic day played out on Wall Street\nNatalie Sherman\nNew York business reporter\nAfter two days of massive declines, Wall Street got a breather. Sort of.\nThe closing figures might not have looked dramatic, but there were big swings throughout the day - a sign that investors are still feeling very nervous about how White House policies might play out.\nIn early morning, for example, the S&P jumped more than 5% in a matter of minutes, amid rumours of a possible pause, which the White House quickly denied.\n\"That is enormous,\" notes Howard Silverblatt, senior index analyst at S&P Dow Jones indices, who says he's rarely seen such dramatic turns during his more than 40-year career on Wall Street.\n\"There's a lot of uncertainty here and that's what's driving the market.\"\nMike Mussio, president of FBB Capital, says the situation - which has sent the S&P 500 back to levels last seen roughly a year ago - was \"frustrating\" for investors.\n\"This feels like kind of an unforced error in terms of policy.\"\nTrump: I'm not considering pause on new tariffs\nUS President Donald Trump says he is not considering a pause on new tariffs to allow for negotiations with other countries.\nEarlier, there were reports that Washington would impose a 90-day pause, these claims were promptly refuted by the White House who called it \"fake news\".\nAsked directly about a potential pause, he tells reporters in the Oval Office: \"We're not looking at that. We have many, many countries that are coming to negotiate deals with us, and there are going to be fair deals.\"\nThe US president went on to reiterate his threat of additional 50% tariffs on Chinese goods if Beijing did not walk back from its retaliatory plans by tomorrow (Tuesday).\nWe will eliminate trade deficit with USA - Israeli PM\nWe've just been hearing an update from President Trump and Israeli Prime Minister Benjamin Netanyahu, who as we've been reporting have been meeting in the White House today.\nThe Israeli PM says they will eliminate the trade deficit with the US, adding he thinks it's the right thing to do.\nNetanyahu says that they intended to take down trade barriers and that Israel can be a model of other countries.\nHe says he recognises the problems the US has with the system as it currently stands.\nYou can follow the latest updates on Trump's meeting with Netanyahu in our other live page, currently being run by our colleagues in Washington DC and New York.\nWhat does the US import from China?\nNatalie Sherman\nNew York business reporter\nWhen President Trump entered the White House in January, about two thirds of goods sent from China to the US were already facing tariffs, as a result of actions he took during his first term.\nHis moves then hit items like solar panels, washing machines and other kinds of machinery. But many key consumer products, like iPhones, toys, and clothing, had been spared.\nThat has not been true this time around.\nStarting in February, Trump put in place a new, 10% levy on all goods from the country, which he increased to 20% in March. It has left businesses like the toymakers I spoke to in March reeling.\nAnd that was before last week, when he said he would raise the tariff to another 34 percentage points.\nSome key strategic items, such as pharmaceuticals, semiconductors and lumber, were spared from the tariffs that action.\nBut the announcement means the vast majority of imports from China - which accounted for more than $400bn in trade last year, making it America's top source of imports after the European Union and Mexico - are facing a tariff rate of at least 54% - which Trump has now threatened to raise again by another 50 percentage points.\nMore nations seek dialogue with Trump as tariffs loom\nFurther countries have been reaching out to the US in order to reach a deal before higher custom tariffs on roughly 60 nations are due start on Wednesday 9 April.\nBangladesh's interim leader Muhammad Yunus has written a letter to US President Donald Trump to ask for a three-month pause to the tariffs he has imposed on them, a statement from their government said on Monday.\nLast week, the US announced 37% tariffs on the country, which is the world's second largest garment manufacturer.\nIn the letter, Yunus also said his country \"will take all necessary actions to fully support [Trump's] trade agenda\".\nMeanwhile, Japan's Prime Minister Shigeru Ishiba has said he held a call with Trump in which \"both sides decided to designate cabinet members to take charge and continue discussions\". Currently, Japan faces 26% tariffs.\nUS Trade Representative Jamieson Greer is due to tell the Senate Finance Committee on Tuesday that nearly 50 countries have reached out to him to discuss the new tariffs, according to a written testimony seen by Reuters news agency.\nGreer says Argentina, Vietnam and Israel are among these nations.\nEU is prepared to use 'every tool' to defend its single market\nWhile we've been reporting on events in the US, EU trade ministers have been meeting in Luxembourg today to discuss how they will move forward.\nAs a reminder, the EU is facing a higher tariff rate of 20% after having been dubbed one of the \"worst offenders\" by Donald Trump.\nToday, European Commissioner for Trade and Economic Security Maros Sefcovic says the EU is \"prepared to use every tool in our trade defence arsenal to protect [the] EU single market\".\nIrish Trade Minister Simon Harris has called today's meeting \"really useful\" as he underlines that unity within the group is \"extremely strong\".\nEarlier, we touched on some of the comments from the bloc's chief, Ursula von der Leyen, who says the EU is \"always ready for a good deal\".\nZooming out: Taking goods, services and investment into account, the EU and the US are each other's largest trading partners by far\nIsrael hopes to lessen the impact of US trade war\nAnthony Zurcher\nReporting from the White House\nBenjamin Netanyahu is visiting the White House right now, just four days after Donald Trump shocked the global economy with his aggressive tariff announcement – which includes 17% on Israeli exports to America.\nThis meeting gives the Israeli prime minister a chance to make an in-person case that those tariffs should be lower.\nIsrael recently dropped its own tariffs on American imports, although that move did not prevent it from being targeted in the president’s new trade policy.\nIf Trump is willing to listen – and cut a deal with Israel - it could provide an early example of how, through concessions and personal appeals, a country could extricate itself from the ongoing American trade warfare.\nIf there’s some kind of big announcement, however, it won’t happen in a formal press conference. The one scheduled for this afternoon was cancelled by the White House – without explanation – about an hour before its scheduled start time.\nInstead, the two men will answer questions from the smaller press pool during their sit-down in the Oval Office.\nThe White House has said more than 50 world leaders have reached out to Trump in the past few days to engage in negotiations. With just two days until those US tariffs go into effect, they are sure to be watching closely to see if anything concrete comes from today’s US-Israel talks – and what lessons they can learn from them.\nIf there any tariffs developments to report, we'll have that live here. But our Washington team is also covering Trump and Netanyahu's meeting live\nA brief guide to what's been happening\nWhen did this start? After Trump announced a large increase in US tariffs last Wednesday.\nAnd a tariff is... A tax paid to the government to bring goods into the country. Most countries have some tariffs. The US's were relatively low, but Trump has increased them significantly.\nWhy did he do this? Trump's been saying he wants to do this for decades. The US buys more physical goods than it sells, and he claims this is unfair and threatens security. Tariffs, he says, will bring more jobs to the US.\nBut most experts disagree... Most economists argue trade barriers such as tariffs reduce growth, and that such a quick and dramatic shift in tariff policy will make trade and investment harder.\nAnd how do other countries feel? Not great. Many have threatened to retaliate by increasing tariffs on US goods entering their countries.\nThis affects stock markets because... Companies are facing higher costs to move their products across the world. There's also great uncertainty - it's not clear what Trump, or the countries he's putting tariffs on, will do next, making investment decisions more challenging.\nAnd stocks are what exactly? To own a stock is to own a share of a company - the more you have, the more of the company you own. A stock market is where people buy and sell these shares. So when a stock market index falls, it means the value of those companies have dropped.\nGlobal stock markets tumble\nMarkets worldwide have tumbled since US President Donald Trump announced fresh tariffs on imports from nearly all economies.\nAsia-Pacific stocks from Shanghai to Tokyo and Sydney to Hong Kong plunged on Monday by levels not seen in decades.\nIn Europe, the biggest stocks continued to slide - as is the case in the US, where trading is still open.\nThe impact on the UK's FTSE 100, America's S&P 500, Germany's Dax and Japan's Nikkei has been wide-ranging.\nHere's an overview of each drop:", "url": "https://www.bbc.com/news/live/ce3qnyr7y94t"}