{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:32:03", "date_modify": "2025-05-19 15:32:03", "date_publish": "2015-02-27 19:26:29", "description": "An ambulance boss fell out with the chief of police over Hillsborough because he \"refused to sing from the same hymn sheet\", the inquests hear.", "filename": "news_uk-england-merseyside-31664843_1747668723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80520000/jpg/_80520350_77198528.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-merseyside-31664843_1747668723.html", "title": "Hillsborough inquests: Police and ambulance chiefs 'fell out'", "title_page": "Hillsborough inquests: Police and ambulance chiefs 'fell out' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An ambulance boss fell out with the chief of police over Hillsborough because he \"refused to sing from the same hymn sheet\", the inquests heard.\nEx-South Yorkshire ambulance chief Albert Page agreed he could not work with chief constable Peter Wright.\nPolice statements blaming \"drunken Liverpool fans... didn't tally\" with what his officers reported, Mr Page told the Warrington hearings.\nMr Wright had tried to \"safeguard the interests of the force\", Mr Page said.\nWhile a major incident could have been declared at the ground as the match was kicking off at 15:00, he said the ambulance service's overall response to the disaster had been \"excellent\".\nNinety-six Liverpool supporters died after crushing at the FA Cup semi-final between Liverpool and Nottingham Forest at Sheffield Wednesday's Hillsborough stadium on 15 April 1989.\nMr Page led South Yorkshire Metropolitan Ambulance Service (SYMAS) at the time.\nThe jury heard about a meeting he requested with Mr Wright a few days after the disaster.\nHe said he \"liked\" Mr Wright and was used to having one-to-ones with him, but at this meeting the chief constable was joined by two colleagues and appeared to be \"effectively under a lot of pressure and was trying to safeguard the interests of the force\".\nThe jury heard Mr Page had seen \"public statements\" made on behalf of the police about the causes of the disaster that \"didn't tally\" with what his own staff were saying.\nOne claim was that no fans had died in a tunnel that led to the pens where the tragedy unfolded, but Mr Page said he heard a \"different message from ambulance officers\".\nRajiv Menon QC, who represents a group of bereaved families, said Mr Page had also \"read reports, quoting police sources, which were effectively blaming the disaster on drunken Liverpool fans\".\nMr Page said there had been \"the suggestion in the media that they were full of of alcohol\".\n\"My people were saying that there were very, very few people in the fatality stage that had strong smells of alcohol on them.\"\n\"[Mr Wright] said at the end of the conversation, 'That's our position, that's our stance... that's what we will have to stand by'.\n\"I said 'Well, it's pointless continuing with this meeting'. I don't think I ever met him again.\"", "url": "https://www.bbc.com/news/uk-england-merseyside-31664843"}