{"authors": ["Caroline Gall", "Tom Edwards", "www.facebook.com"], "date_download": "2025-04-26 07:37:59", "date_modify": "2025-04-26 07:37:59", "date_publish": "2025-02-27 13:58:06", "description": "Marcus Meade was killed by armed police after a five-hour stand off at his home in Redditch.", "filename": "news_articles_c5ymm6dypypo_1745653079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47ad/live/4513fb70-f4ff-11ef-9808-4d9b058d1a40.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5ymm6dypypo_1745653079.html", "title": "Redditch: Funeral held for Marcus Meade shot by police on Christmas Eve", "title_page": "Redditch: Funeral held for Marcus Meade shot by police on Christmas Eve - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The funeral of a man who was shot dead by police on Christmas Eve has been held.\nMarcus Meade, 39, died after a five-hour standoff with West Mercia Police at his home on Fownhope Close, Redditch, Worcestershire. Officers were called to reports the father of two was in possession of a knife.\nHis death is being investigated by the Independent Office for Police Conduct (IOPC), and the force said it could not comment while the investigation was under way.\nMore than 130 mourners, many wearing blue, as requested by Mr Meade's family, were at the funeral at The Assemblies of the First Born Church in Lozells, Birmingham, on Thursday. \"It was a beautiful service,\" said family friend Charlie Williams.\nThe service, which lasted almost two hours, started with the song One Love by Bob Marley, followed by several hymns and readings.\nEmotional tributes were paid to Mr Meade from his siblings, as well as his parents, Deborah Clarke and Anthony Meade.\nSpeaking before the funeral, Ms Clarke, who is recovering from a stroke and confined to a wheelchair, had said: \"This is wrong; we should not be burying my son... All he needed was help.\"\nThe service was conducted by Bishop Dr Desmond Jaddoo, the chair of the Justice 4 Marcus Meade campaign. He said afterwards: \"There was a lot of emotion in the room, and importantly, people remembered what Marcus meant to them – and I think that's important.\n\"It just shows that demonstration of hope and unity that's there. It's about love – and that's what matters most in circumstances like this. What happened to Marcus does not define who he was.\"\nMr Williams added after the service: \"This is what everyone heard in those tributes today, the fun he had with his sister, stuff like carrying his neighbour's bags – we really got to hear what kind of person he was.\n\"It was beautiful to see his family all come together, from all over the country.\"\nIn January, more than 100 people attended a vigil close to Mr Meade's home to pay tribute to him.\nEarlier this month, the IOPC said it would be considering if his race was a factor in the shooting after Mrs Clarke and Anthony Meade raised several complaints about police actions on the day of their son's death.\nSome of the concerns included a decision by the force not to suspend the officers involved, as well as how police communicated with a member of the family at the scene during the incident and the way they communicated with the family straight after his death.\nPolice were called to Mr Meade's home at about 14:00 GMT to reports of a concern for welfare.\nMr Meade, originally from Birmingham, was believed to be alone at the time and suffering a mental health episode when he was shot once in the chest after police entered his home at about 19:40 GMT.\nThe IOPC previously said they tried to negotiate with Mr Meade and that officers used distraction devices and at least one Taser before the fatal shot was fired.\nIn a statement, West Mercia Police said: \"We continue to express our sincere condolences to the family and friends of Marcus Meade; our thoughts remain with everyone affected by this tragic incident.\n\"The Independent Office for Police Conduct continues to carry out an independent investigation, and it would not be appropriate for us to comment further at this time; however, we will do so when we are able.\"", "url": "https://www.bbc.co.uk/news/articles/c5ymm6dypypo"}