{"authors": ["Naj Modak", "www.facebook.com"], "date_download": "2025-04-26 03:40:21", "date_modify": "2025-04-26 03:40:21", "date_publish": "2025-03-05 10:12:37", "description": "Prices for an adult full-year season ticket at Leeds City Council-run greens could double.", "filename": "news_articles_c4gdeeg40yyo_1745638821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/924e/live/43d6b600-f91c-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdeeg40yyo_1745638821.html", "title": "Leeds crown green bowls fans 'heartbroken' at price rise plan", "title_page": "Leeds crown green bowls fans 'heartbroken' at price rise plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crown green bowling enthusiasts in Leeds could be priced out of the sport if plans to increase the cost of season tickets for the city's council-owned facilities go ahead, one club has warned.\nLeeds City Council, which is trying to find nearly £275m in savings over the next five years, launched a consultation in January into proposals to close almost half the city's greens.\nFollowing feedback, the council has since drawn up revised plans allowing more of the city's greens to stay open, but which also included doubling the cost of an adult full-year season ticket.\nLaura Fulleylove, from Harehills Park Bowling Club, said: \"The news from our members is that they quite clearly cannot afford it.\"\nOut of 61 council-owned bowling greens, Leeds City Council had originally planned to close 30 to save the authority £140,000 a year on its annual maintenance costs of £360,000.\nBut in January, the authority announced a temporary reprieve, saying it would instead maintain the 30 facilities until the end of the 2025 summer season.\nIt said that following a public consultation process and \"productive dialogue\" with crown green bowling enthusiasts, it had drawn up revised proposals, which it hoped would put provision in Leeds on a more secure financial footing.\nThose proposals included doubling the cost of an adult full-year season ticket from £45 to £90 from the start of April 2025 and setting the clubs a target of having at least 20 adult full-year season ticket holders per summer green by the end of September - rising to 26 by the end of September 2028.\nThose clubs which did not meet that target would have to make up the resulting shortfall in the season ticket revenue themselves, the council said.\nMeanwhile, the clubs would also be required to cover their own electricity and water costs, the vast majority of which are currently paid by the authority.\nLeeds City Council said the proposals would not only generate savings and additional revenue, but also increase participation in the sport by placing the responsibility to recruit new players on the clubs.", "url": "https://www.bbc.co.uk/news/articles/c4gdeeg40yyo"}