{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 14:30:56", "date_modify": "2025-05-20 14:30:56", "date_publish": "2023-07-31 00:00:00", "description": "Updates from across the African continent.", "filename": "news_live_world-africa-66073088_1747751456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1603E/production/_130647109_gettyimages-1235270436.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_world-africa-66073088_1747751456.html", "title": "Africa Live this week: 31 July-6 August 2023", "title_page": "Africa Live this week: 31 July-6 August 2023 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New head of top Libyan council elected\nBBC World Service\nA new head of the High Council of State in Libya has been elected in a development that may further complicate efforts to restart its stalled political process.\nMohammad Takala defeated the incumbent Khaled al-Meshri to take over as president of the Tripoli-based consultative body.\nThe body was set up in 2015 as part of the UN-backed roadmap towards a new democratic future for Libya, after the fall of Muammar Gaddafi and the violent unrest that followed.\nThe election of Mr Takala may lead to a shift in political alliances in Libya, as he is a close ally of the interim Prime Minister Abdul Hamid Dbeibah.\nNigeria's coach makes history with AfroBasket title\nSamba Cyuzuzo\nBBC Great Lakes\nRena Wakama has become the first female coach to lead a team to victory in a women's AfroBasket championship final.\nThe milestone came after Nigeria beat Senegal 84-74 in front of a sell-out crowd in Rwanda’s capital, Kigali.\nWakama's first AfroBasket title is also Nigeria's fourth in a row - matching Senegal’s record that began in the 1970s.\n\"It has been a long year for me. I asked God for a sign, and this trophy was the biggest of them all,” Wakama said later.\nSenegal trailed Nigeria from early in the first quarter and a late dash for points in the fourth quarter was not enough to make up the difference.\nIfanya Okoro was Nigeria’s top scorer with 16 points. Senegal’s point guard Ciarra Dillard outscored her by three.\nIn the third-fourth place play-off, Mali beat hosts Rwanda 89-52.\nTwo Senegal opposition figures now able to run for president\nParliament in Senegal has restored the right of two opposition figures to stand in next year's presidential election.\nIt voted to allow people who've been convicted but then pardoned or amnestied to run for public office.\nThat clears the way for Khalifa Sall and Karim Wade, who were prevented from standing in 2019.\nSenegal's most prominent opposition leader, Ousmane Sonko, is facing criminal charges that would stop him from running to replace President Macky Sall, who cannot stand for a third term.\nRead more about Ousemane Sonko:\nSenegalese opposition leader charged - again\nBodies of African woman and child found after shipwreck\nBBC World Service\nItaly's coastguard says it's recovered the bodies of an African woman and her child after two boats carrying 90 migrants sunk off the island of Lampedusa.\nFifty-seven people were rescued but more than 30 others are missing.\nSurvivors told Italian media that the boats had set off from the Tunisian port of Sfax.\nMore than 2,000 migrants have arrived in Lampedusa in the past few days.\nRead more on this story here.\nScroll down for this week's stories\nWe're back on Monday\nThat's all for now from the BBC Africa Live team - we'll be back on Monday morning at bbc.com/africalive.\nUntil then you can find the latest updates at BBCAfrica.com and listen to the Focus on Africa podcast for stories behind the news.\nA reminder of our wise words of the day:\nQuote Message\nThe water that lets the fish swim is the same water that boils him.\nAn Eton proverb from Cameroon sent by Odile Kouna Artaxet in Tarbes, France\nClick here to send us your African proverbs.\nAnd we leave you with this photo of victorious Cameroonian long-jumpers Appolinaire Yinra and Raymondo Nkwemy Tchomfa on Tuesday - it's one of our favourites this week:\nSudan to launch mass measles vaccination drive\nBBC Arabic's Sudan Lifeline radio\nSudan's health ministry says it will immunise children against measles across the country, where more than three million people have been forced from their homes since fighting began in April.\n\"Most of the displacement camps offer vaccination services through traveling medical teams,\" says Health Minister Haitham Ibrahim. The doses were provided by the UN's children fund, Unicef.\nWhite Nile and Sennar are likely to be the first states targeted. Remote areas including Darfur, which has seen some of the worst fighting, are also said to be a priority even though staffing levels are at 60% because of a lack of funding.\nIt's not clear how they will contend with ongoing fighting between Sudan's rival military forces, or if they've been granted safe passage to do their job.\nSome regions have been more challenging than others, Mr Ibrahim tells the BBC.\n\"[In] Al-Gezira state the vaccination service covers 90% of the children including internally displaced people. In some states the vaccination services dropped from 60% to only 47%.\"\nMeasles is a serious concern, with 1,000 cases detected across seven states and a number of child deaths, he says.\nSlow Somali sprinter hits back at critics\nMuhyadin Roble\nEditor, BBC News Somali\nSomali novice sprinter Nasra Abubakar Ali, who's faced ridicule online, says she was chosen to compete by her university association and was suffering from a sprained leg when she raced this week.\nAli was competing in the 100m at the World University Games in China on Wednesday. Brazil's Gabriela Silva Mourão won the race with a time of 11.58 seconds while Ali finished last on 21.81 seconds.\nShe defended her performance in a Facebook interview with journalist Munasar Mohamed, saying the backlash she's received is unfair and her efforts should be considered courageous:\n\"I was heavily criticised for my performance despite the fact that I was injured... I made an attempt. If I had succeeded, they would have cheered me,\" she added.\nSince Wednesday's race, the chairwoman of the Somali Athletics Federation has been accused of abusing her power and defaming Somalia and suspended from her position.\nThe Association of Somali Universities said it had not appointed any athlete to compete in the event, a press release on its Facebook page said.\nNiger cuts diplomatic ties with France, US, Togo, Nigeria\nNkechi Ogbonna\nBBC News\nNiger's military junta has cut ties with Nigeria, Togo, the US and France following failed talks with a delegation from the regional bloc, Ecowas, that were aimed at resolving the political stand-off after President Mohamed Bazoum's ousting last week.\nJunta member Col Amadou Abdramane made the announcement on state TV on behalf on the coup leaders, recalling Niger's ambassadors from those four nations.\nA delegation led by Nigeria’s former military head of state, Gen Abdulsalami Abubakar, met some members of the military junta on Thursday but left after just a few hours without any sign of progress.\nThe Nigerian President and Ecowas head, Bola Tinubu, has yet to respond to Niger's cutting of diplomatic ties.\nWest African defence chiefs are set to conclude a three-day meeting in Nigeria on possible military interventions to pursue should diplomacy fail.\nUN human rights office shuts in Uganda\nAfter 18 years of operating in Kampala, the UN's human rights mission will close on Saturday because the Ugandan government has ended its mandate.\nSub-offices in Gulu and Moroto, in northern Uganda, have already closed.\nIt comes after Uganda passed some of the world's harshest anti-LGBT laws against the advice of local and international rights groups, including the UN.\nIn a statement on Friday, UN High Commissioner for Human Rights Volker Türk said he was urging the government to ensure Uganda's national human rights body can function effectively and independently, as the main body tasked with human rights oversight in the country.\nMr Türk said the majority of 54 NGOs that were \"arbitrarily suspended\" in 2021 remain closed, and Uganda's amended computer misuse law could limit free expression even more.\nHe also expressed deep concern about the run-up to elections in 2026, saying human rights defenders, civil society actors and journalists in Uganda were operating in an increasingly hostile environment.\nExplaining its decision to end the mandate of the UN's human rights office earlier this year, Uganda's foreign ministry assured the UN of its \"commitment to the protection and promotion of human rights\", and the presence of \"strong national human rights institutions and a vibrant civil society\".", "url": "https://www.bbc.com/news/live/world-africa-66073088"}