{"authors": ["Pallab Ghosh", "www.facebook.com"], "date_download": "2025-04-26 03:58:16", "date_modify": "2025-04-26 03:58:16", "date_publish": "2025-03-04 13:16:00", "description": "Experiments on mice could see hairy, genetically modified elephants living in the Arctic, a US company claims.", "filename": "news_articles_c0jg4n776evo_1745639896.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/926f/live/88e17a50-f921-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jg4n776evo_1745639896.html", "title": "Mice experiment as step to create mammoth-like elephants", "title_page": "Mice experiment as step to create mammoth-like elephants - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Genetically engineered woolly mice could one day help populate the Arctic with hairy, genetically modified elephants and help stop the planet warming.\nThose are the startling claims being made by a US company that said on Tuesday it had created mice with \"mammoth-like traits\". Colossal Biosciences' eventual goal is to engineer mammoth-like creatures that could help stop arctic permafrost from melting.\nCriticism has flooded in, including that engineering mammoth-like creatures is a big stretch from making mice hairier, as well as being unethical, and that the whole project is a publicity stunt.\nBut the company says it has been misjudged and that the mouse is an important tool on the path to restoring Earth's depleted nature.\nColossal Biosciences says that the experiments with hairy mice was a step towards genetically modifying elephants to be hairy and better able to withstand the cold.\nIts stated goal is to create herds of what it calls mammoth-like creatures to live in the arctic tundra. The company says the creatures' grazing habits would encourage grasslands to flourish and reduce the amount of carbon dioxide being released from melting permafrost.\nCarbon dioxide is a greenhouse gas which is one of the main drivers of global warming.\nBut critics say there are significant scientific challenges to overcome before these changes in mice can be tried out on elephants.\nColossal's co-founder and CEO, Ben Lam, told BBC News that the woolly mice marked a big step forward.\n\"We are on track to have the first cold adapted elephant by 2028 and that would mean having the first embryos by the end of 2026,\" he said.\n\"Over time we are going to have this entire lineage of cold adapted elephants that we can put back into the wild that can interbreed\"\nIn response, the Colossal researchers say they feel misjudged. Their mouse is a tool, they say, with which to test whether different genetic alterations they have planned are effective and safe before they try them out on elephants.\n\"Validation that this works is really exciting for this project,\" says the firm's chief science officer, Prof Beth Shapiro.\nShe adds that the firm has other research programmes running in parallel, such as studying embryo development and creating artificial wombs for the genetically modified elephants to grow in, and which the company says will ensure that they achieve their target of creating cold adapted elephants in a few years.\nProf Shapiro firmly disputes the allegation that the work is pointless. She says that the firm's plan to reintroduce extinct species, such as the Dodo and Tasmanian Tiger, as well as the mammoth, will fill ecological niches that have been lost, and so restore biodiversity and benefit the environment.\nThe genetic tools it is developing in the meantime are already helping species at risk of extinction, she adds. These include developing a vaccine for elephants against a deadly virus; the creation of genetically modified marsupials in Australia known as quoll to be resistant to neurotoxins produced by the cane toad; and reintroducing genetic diversity in the pink pigeon in Mauritius.\nAnd Prof Shapiro says that elephants won't suffer. The team is developing techniques to screen only viable embryos, and she believes that they won't be treated as outcasts either.\n\"We really are only going to be changing a few letters in their DNA code. The elephants will be born to mothers who are not going to see them as freaks because they are going to be very much the same as them, just a lot more hair and can survive colder climates\".", "url": "https://www.bbc.co.uk/news/articles/c0jg4n776evo"}