{"authors": ["Sarah Spina-Matthews", "www.facebook.com"], "date_download": "2025-04-26 06:56:29", "date_modify": "2025-04-26 06:56:29", "date_publish": "2025-02-28 14:50:10", "description": "There are currently \"major issues\" on roads outside many schools, North Yorkshire Council says.", "filename": "news_articles_ce8yy732p7go_1745650589.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1b2d/live/8d64e0a0-f5e1-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8yy732p7go_1745650589.html", "title": "Safety fears spark North Yorkshire schools speed limits review", "title_page": "Safety fears spark North Yorkshire schools speed limits review - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Speed limits outside every school, nursery and college in North Yorkshire - some of which currently remain as high as 60mph (96km/h) - are set to be reviewed due to safety concerns.\nNorth Yorkshire Council said it would review the limits near all 400 education sites, starting with the 16 schools located on roads with a 60mph limit.\nThe council said it had already cut the 60mph limit outside Cundall Manor School to 40mph (64 km/h), while the limit outside Appleton Wiske Primary School had been cut to 20mph (32 km/h).\nCouncillor Keane Duncan, executive member for highways and transportation, said there were \"major issues\" on the roads around schools, particularly at drop-off and pick-up times.\nThe councillor said that while some new limits could be implemented quickly, some roads would need calming measures introduced which would require public consultation.\n\"That inevitably takes longer - the design can be quite complex,\" Duncan explained.\n\"We're starting where the speeds are the highest, then we're working through the 50, 40 and 30 zones.\"\nHe added that the \"presumption is in favour of lower speed limits where we can\".", "url": "https://www.bbc.co.uk/news/articles/ce8yy732p7go"}