{"authors": ["Julia Gregory", "www.facebook.com"], "date_download": "2025-04-26 03:50:07", "date_modify": "2025-04-26 03:50:07", "date_publish": "2025-03-05 13:05:00", "description": "Education bosses also want to see improvement in maths as part of their strategy for schools.", "filename": "news_articles_c8rkpp03132o_1745639407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5f32/live/f4e2e4e0-f913-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8rkpp03132o_1745639407.html", "title": "Guernsey education bosses aim to improve school attendance", "title_page": "Guernsey education bosses aim to improve school attendance - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Education bosses in Guernsey want to see improvements in school attendance to pre-pandemic levels and better results in maths.\nThe government said challenges also included \"embedding\" the use of digital technology to enhance learning.\nThe targets follow the committee for education, sport and culture's publication of its 2024 education strategy report, external which celebrated a \"significant rise\" in literacy levels and good ratings for schools inspected by Ofsted.\nThe first group of teachers have also graduated from a new on-island teacher training programme and have started their careers in Guernsey.\nThe government said it had spent £83.2m on education in the year to December 2023.\nIt said school attendance had improved to 94% in primary schools, 86% in secondaries and at special schools, but was still below pre-Covid 19 levels.\nAchievement in maths had dropped from 2022-23 when 57% of pupils gained a grade 4 or above in maths at GCSE to 52% last summer.\nDirector of education Nick Hynes said: \"Delivering positive outcomes for all learners will help them to meet their aspirations and importantly also help to secure future success as island communities.\"", "url": "https://www.bbc.co.uk/news/articles/c8rkpp03132o"}