{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:24:58", "date_modify": "2025-05-19 15:24:58", "date_publish": "2015-02-03 16:55:57", "description": "Fifty years ago, an announcement was made that would transform Northampton and see millions of pounds poured into it.", "filename": "news_uk-england-northamptonshire-31110173_1747668298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80755000/jpg/_80755565_photo20.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-northamptonshire-31110173_1747668298.html", "title": "Fifty years since a plan that transformed Northampton", "title_page": "Fifty years since a plan that transformed Northampton - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On February 3 1965, Minister for Housing Richard Crossman announced that Northampton was to be one of a number of new towns offering housing to people living in poor conditions in London. Fifty years on, the BBC looks back at how the announcement changed the town.\n\"I just can't wait to be in Northampton!\"\nSo sang Linda Jardim in \"60 miles by road or rail,\" the promotional track that helped attract thousands of people to make their new home in \"Middle England\".\nThe song, originally part of an advert that blasted its way out of car stereos across London, proved so popular that Northampton Development Corporation (NDC) released it as a single.\nThis successful marketing ploy was all part of NDC's plans to persuade people to move from overcrowded areas in London and Birmingham to the open spaces of Northampton.\nEstablished in 1968, NDC spent £205m building vast new housing estates. Lumbertubs was started in 1970, with Moulton Park and Round Spinney following in the east of the town.\nBriar Hill, Camp Hill and East and West Hunsbury were built in the south.\nIn all, 15,655 new homes were built between 1970 and 1985. The impact on the town's population was considerable.\nIn 1971, Northampton was home to 130,000 people. By 1984 the population had mushroomed to 163,000.\nAmong those encouraged to come to the new town were former servicemen and Mr Lang had been a Navy man.\nHe said: \"Within four hours of coming to Northampton we had a house and a job.\"\nThe couple's three bedroom house cost £5,500 and although they only stayed there six years, they remain in Northampton.\n\"It has completely changed,\" said Mr Lang. \"We used to look out from London Road at green fields, now you have to go three or four miles to get to them.\"", "url": "https://www.bbc.com/news/uk-england-northamptonshire-31110173"}