{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:08:10", "date_modify": "2025-04-26 08:08:10", "date_publish": "2025-02-26 13:52:19", "description": "Pupils from Bready Jubilee Primary School have left their messages for the future in a time capsule.", "filename": "news_articles_c0l1znxr4j9o_1745654890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fdb8/live/b6e12800-f468-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0l1znxr4j9o_1745654890.html", "title": "Londonderry: Children bury time capsule at site of urban farm", "title_page": "Londonderry: Children bury time capsule at site of urban farm - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of schoolchildren have buried a time capsule under part of a new urban farm in Londonderry, which aims to help tackle climate change and create a discussion around food in the future.\nPupils from Bready Jubilee Primary School placed the object in the foundations of the Acorn Farm Project's 20m-high dome at St Columb's Park in the city's Waterside on Wednesday.\nIt contains vegetable seeds, coins and work by the children which documents the food they eat and what they think people will eat in the future.\nThe £6.2m farm project will see a working urban farm, community education facility and sustainable food venue developed at the Derry site.\n\"Food in the future may be 3D-printed food and I think it will be meat made in a lab,\" he said.\n\"I hope there will still be burgers, but I think we all be eating bugs in the future.\"\nScarlett, 10, said it was great to help the environment and think more about growing local food.\n\"In 200 years' time, I think people will be eating bugs for protein and 3D-printed food, which I think is amazing,\" she said.\n\"They will be eating seaweed as well and lab-grown meat.\n\"I've never had seaweed myself, but I wouldn't mind trying it.\"\nSchoolfriend Rachel agrees with Scarlett and thinks seaweed is definitely on the menu of the future, but she thinks it would make a great addition to pizza menus.\n\"My favourite food is chicken nuggets, but I don't think we will have that in the future,\" she said.\n\"I think seaweed pizza will be tasty.\"", "url": "https://www.bbc.co.uk/news/articles/c0l1znxr4j9o"}