{"authors": ["Asha Patel", "www.facebook.com"], "date_download": "2025-04-26 06:34:52", "date_modify": "2025-04-26 06:34:52", "date_publish": "2025-02-27 06:20:06", "description": "The government has released £25m for hospices but one boss says it will not help with its biggest cost.", "filename": "news_articles_c4gp7x0ygjjo_1745649292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7c28/live/25ec20b0-f469-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gp7x0ygjjo_1745649292.html", "title": "Nottinghamshire Hospice boss says funding will not help staff costs", "title_page": "Nottinghamshire Hospice boss says funding will not help staff costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As end-of-life care services across the country receive a share of £25m in government funding, one hospice boss says it will not help with what they need it for most.\nThe Department of Health and Social Care (DHSC) released the first tranche of a £100m capital fund for hospices on Wednesday - which can be used on things such as building, maintenance and IT.\nBut Rachel Hucknall, chief executive of Nottinghamshire Hospice - where jobs have been cut as a result of staffing costs - said while she was grateful for any contribution to the charity, the cash boost did not assist with 86% of its spending.\nA spokesperson for the DHSC said: \"The funding will reduce immediate pressures on hospices which will allow them to focus wider resources on providing the best care to patients.\"\nWhile the charity had tried to protect key services, Ms Hucknall said there was \"unease\" in patients reaching the last years of their lives.\n\"There is some nervousness, I think, amongst people who do have a terminal illness about what end-of-life services are going to look like when their time comes,\" she said.\nIn January, patients told the BBC about the \"invaluable\" service the hospice provided and said they were devastated by the proposed cuts.\nHospices across the country began receiving a share of the fund on Wednesday, after the £100m boost was announced last year.\nThe remaining £75m is set to follow from April, in what the DHSC called the \"biggest investment into hospices in a generation\".\nBut what they \"really need\", according to Ms Hucknall, is money to spend on salaries.\nShe said: \"I always think it's a strange society that we're in because, if maternity care was funded by cake sales and skydives, there would be uproar, but for some reason end-of-life care funding seems to rely heavily on charitable donations.\n\"Obviously we're grateful for any contribution to hospice care but the fact is this is for capital only, so we can only spend it on things like beds and cars and IT.\"\nShe added: \"If I had a magic wand, I would want the money that the government have given us to be able to be used on salaries and not just on capital expenditure - because 86% of our costs is on our staff.\"\nBeing charities meant hospices had the \"freedom to be responsive to people's needs\", Ms Hucknall said, but cost pressures were becoming \"too much to bear\".\nLike most charities, hospices rely heavily on the goodwill of its communities.\nBut Ms Hucknall said that too, was becoming more difficult due to the impact of the cost of living.\nShe said increases in National Insurance and the National Living Wage left the hospice with a £200,000 \"added cost pressure\".\nAn expected deficit of £800,000 for the 2025-26 financial year had dropped to £500,000 since the job cuts, Ms Hucknall added.", "url": "https://www.bbc.co.uk/news/articles/c4gp7x0ygjjo"}