{"authors": ["Chris Dearden", "www.facebook.com"], "date_download": "2025-04-26 06:24:42", "date_modify": "2025-04-26 06:24:42", "date_publish": "2025-02-28 22:45:53", "description": "Social media apps such as Instagram have been blamed for attracting more people to the mountains.", "filename": "news_articles_cj4nn4lyy5lo_1745648682.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/97cd/live/e1f06b00-f5da-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj4nn4lyy5lo_1745648682.html", "title": "Mountain rescue: Volunteers dealing with 'unprecedented' demand", "title_page": "Mountain rescue: Volunteers dealing with 'unprecedented' demand - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Volunteer mountain rescue crews in north Wales are being stretched to breaking point by increased callouts, police say.\nMountain rescue crews said this year had already seen \"unprecedented demand\", and two deaths in just 10 days.\nFriends of 28-year-old Maria Eftimova, who died last weekend, have thanked the mountain rescue crews who tried to save her.\nOfficers say social media apps - such as TikTok and Instagram - were responsible for greater numbers of people walking in the mountains and on the coast.\nUniversity student Ms Eftimova, originally from Bulgaria, was an experienced walker who was well equipped, and walking with a group.\nShe fell around 65ft (19.8m) while ascending the north ridge of Tryfan on 22 February.\nHer best friend Megan Griffiths said: \"Maria was a one-of-a-kind person who lived life to the fullest - not only adventurous and free-spirited, but also incredibly kind, intelligent, and selfless.\n\"We are so thankful to Maria's friends, crew, and the Ogwen Valley Mountain Rescue team for their efforts to save her.\"\nIt was just one of several emergency calls made from the mountains and coast of north Wales over the past fortnight.\nNorth Wales Police said the number of calls made to mountain rescue in the past two weekends had been \"almost unprecedented\", and the popularity of the area on TikTok and Instagram was partly to blame.\nChief Superintendent Owain Llewellyn said: \"What we're seeing is a dramatic increase in pictures and videos of the area appearing on social media, often posted by influencers.\n\"Some of the footage they're sharing is absolutely stunning. It really highlights what Eryri has got to offer, but unfortunately some of that footage is taken on a good day when it hasn't rained.\n\"Then we see visitors coming here, and on the day they arrive, the weather conditions aren't quite as nice when they get out the car - and they don't always understand that conditions up in the mountains can be even worse.\"", "url": "https://www.bbc.co.uk/news/articles/cj4nn4lyy5lo"}