{"authors": ["Rob Trigg", "www.facebook.com"], "date_download": "2025-04-26 04:19:21", "date_modify": "2025-04-26 04:19:21", "date_publish": "2025-03-04 06:18:05", "description": "Hundreds of homes, an education hub and hotel are being built as part of the Telford development.", "filename": "news_articles_c4gp3yev9pvo_1745641161.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2cbc/live/96edaa30-f843-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gp3yev9pvo_1745641161.html", "title": "'Huge interest' in Telford town centre eco-homes, council boss says", "title_page": "'Huge interest' in Telford town centre eco-homes, council boss says - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work to build almost 200 new eco-homes in Telford, as part of a wider regeneration of the area, has attracted \"huge interest from local people\", a council leader has said.\nA six storey apartment block and 103 new town houses and maisonettes are being built between Telford's train station and the town centre.\nTelford and Wrekin Council leader Lee Carter said the the first phase of the Station Quarter development was on track to be completed by summer 2026.\nMore than half of the homes will be owned by the council's lettings company, Nuplace.\nPlans for Station Quarter were approved in 2023 and construction on the digital learning centre The Quad began later in the year.\nThe five-storey building was completed in September and will welcome students from Harper Adams University and Telford College this autumn.\nThe council has invested £66.5m in to the Station Quarter project, while a further £36.6m of funding has come from central government.\n\"We'll generate income from some of the business units here,\" said Carter.\n\"Aside from that, we'll be giving people educational opportunities, which will give them better skills and access to good jobs.\n\"It means those young people can learn in Telford, get a job in Telford and live in Telford and contribute to the economy, which will benefit us all,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c4gp3yev9pvo"}