{"authors": ["Miriam Barker", "www.facebook.com"], "date_download": "2025-04-26 06:48:27", "date_modify": "2025-04-26 06:48:27", "date_publish": "2025-03-01 11:20:18", "description": "The Prince of Wales delivers his first full message in Welsh to mark St David's Day.", "filename": "news_articles_ckg8r147xk0o_1745650107.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d25b/live/7ff69e40-f69a-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg8r147xk0o_1745650107.html", "title": "St David's Day: Prince William speaks Welsh praising Wales", "title_page": "St David's Day: Prince William speaks Welsh praising Wales - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Prince of Wales has used his first message delivered in Welsh to wish Wales a \"Happy St David's Day\".\nPrince William pre-recorded a social media video to mark 1 March, the day Wales's patron saint is honoured and to \"celebrate Wales – its history, culture and incredible people\".\nHis words in Welsh follow a trip to Wales with his wife, Catherine, Princess of Wales, on Wednesday, when the couple visited Pontypridd.\nElsewhere, First Minister Eluned Morgan led celebrations in Wales at the annual Dragon Parade in St David's, Pembrokeshire.\nWhile he is not having formal lessons, it is understood the prince has been learning some conversational Welsh, though is it unclear who is teaching him the language, or if he is attending classes.\nIn his message, he said: \"Hello. Today, on St David's Day, we come together to celebrate Wales – its history, its culture, and its incredible people.\n\"From its breathtaking landscapes to its language, Wales continues to inspire.\n\"Today, we will celebrate everything that is magical about Wales.\n\"To the people of Wales and everybody around the world, Happy St David's Day.\"\nWilliam has been known to greet people with a few words of Welsh when in the country, but has not spoken fully in public before.\nKing Charles had formal lessons in the Welsh language, studying from April to June 1969 at Aberystwyth University, ahead of his investiture as the Prince of Wales in July that year at Caernarfon Castle.\nThe King's tutor was Welsh nationalist Tedi Millward, but despite their apparent differences the two men became firm friends.\nWilliam has not had an investiture since his father announced he had created his eldest son and heir as Prince of Wales during his first televised address as monarch, the day after the death of Queen Elizabeth II in 2022.", "url": "https://www.bbc.co.uk/news/articles/ckg8r147xk0o"}