{"authors": ["Michelle Finney", "Oliver Slow", "www.facebook.com"], "date_download": "2025-04-26 04:26:50", "date_modify": "2025-04-26 04:26:50", "date_publish": "2025-03-03 11:24:34", "description": "Poppy Williams, 27, had a stoma put in after emergency surgery in December 2021.", "filename": "news_articles_cwygwkezgzko_1745641610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/123d/live/915ca550-f81e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwkezgzko_1745641610.html", "title": "Shopping for a wedding dress with a stoma bag", "title_page": "Shopping for a wedding dress with a stoma bag - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman is documenting her experiencing living with a stoma bag – including shopping for a wedding dress – because she wants to \"normalise it and break the stigma\".\nPoppy Williams, 27, from Cardiff, was left with a stoma after emergency surgery in December 2021 and initially thought her \"life was over\".\n\"But then I thought, my stoma isn't going away. So I can either live with this, in secret, or I can project it to the world and see how it goes,\" she said.\nMs Williams said the reaction has been \"amazing\" and she wants to help other people going through similar experiences.\nStomas are an opening in a person's abdomen with a pouch placed over it to collect faeces or urine in a stoma bag.\nMs Williams, a supply teacher, said after being diagnosed with ulcerative colitis, external she was \"terrified\" about the potential of having a stoma bag.\nBut it is now part of her life, and she has been considering what type of wedding dress will look best with it, as she looks forward to the big day in summer 2026.\nLooking back on her journey, she described being rushed to hospital for emergency surgery more than three years ago.\nIt was there she was told that without one being fitted, \"it's unlikely you will leave the hospital alive\".\nShe told BBC Radio Wales Breakfast that she initially struggled with it.\n\"I was lying in hospital after my stoma bag [operation], thinking that my life was over and that I couldn't possibly live a normal life with a stoma bag,\" she said.\nBut she said her mindset then changed, and she wanted to help others who had experienced the same \"horrible, lonely feeling\" she had after the operation.\nShe said she put out a post on her Instagram page about her experience, which got an \"amazing\" response.\n\"And I thought, that's what I needed when I was lying in that hospital bed, so how can I help other people on their path?\" she said.\nShe now has thousands of followers on her page, which offers advice and education about what it is like to live with a stoma.\nA recent post shared advice about what it is like to shop for a wedding dress when you have a stoma.\nMs Williams said she needed to consider how the outline of a stoma bag would look in a wedding dress, and how tight the dress would be against the bag.\nShe admitted she \"had a good cry and felt very emotional\" before shopping for her dress.\n\"I thought if I didn't have my stoma bag, what sort of wedding dress would I pick? And growing up, you always have that vision of you in a white dress,\" she said.\nBut she described it as a positive experience.\nShe said she accidentally wore a black stoma bag on the day of her fitting, instead of a nude one.\n\"But actually it was helpful because I could see it through the dresses. I could see where it was fitting, when it would fill up, things like that,\" she said.\nShe hopes talking about her experiences will help other people who might be having similar experiences to her.\n\"There are so many people that don't know what a stoma is so I just want to open up the pathway for people who are having surgery today to make it easier for them,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cwygwkezgzko"}