{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:51:45", "date_modify": "2025-04-26 03:51:45", "date_publish": "2025-03-05 11:32:30", "description": "But 40 Days For Life have pledged not to break the country's new laws around buffer zones in the run up to Easter.", "filename": "news_articles_c20drjg3ly0o_1745639505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0d55/live/b265cce0-f9a9-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20drjg3ly0o_1745639505.html", "title": "Anti-abortion group start Lent protests near Glasgow hospital", "title_page": "Anti-abortion group start Lent protests near Glasgow hospital - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A US anti-abortion group has started a series of Lent protests outside a Glasgow hospital but says it will not break Scotland's new buffer zone law.\nCampaigners from 40 Days For Life have pledged to stay outside the 200m (656ft) safe access zone around clinics.\nLast month a 74-year-old woman became the first person in Scotland to be arrested for protesting near the Queen Elizabeth University Hospital.\nThe Abortion Services (Safe Access Zones) Act, external came into force last year and prohibits anti-abortion activists from protesting near 30 clinics offering abortion services in Scotland.\nThe group is planning to hold \"vigils\" on Hardgate Road, across from the hospital until 13 April, the Sunday before Easter.\nThe area has been a frequent target for anti-abortion activists.\nSix people, including a woman with a baby, gathered from around 08:00 and began quietly praying.\nSome held signs that said \"Choose life\" and \"Help is out there\".\nAn area of Hardgate Road, opposite the entrance to the hospital's maternity unit, has previously been a focal point for protests.\nBut the 40 Days For Life group gathered further away from the building on Shieldhall Road.\nMeanwhile, Mackay said she would work with Police Scotland and health providers to ensure the new laws are followed.\nThe MSP added no-one should be subjected to \"intimidation and harassment\".\nMackay said: \"For far too long women have had to endure totally unacceptable abuse and obstruction outside hospitals.\n\"It should never have happened, and my Act to stop it received the overwhelming support of our parliament.\n\"I urge anyone else who is planning to protest to look at the testimonies from people who have had to endure gauntlets of graphic banners and ask themselves if they really want to be responsible for causing even more pain and upset.\"", "url": "https://www.bbc.co.uk/news/articles/c20drjg3ly0o"}