{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:21:07", "date_modify": "2025-05-19 15:21:07", "date_publish": "2017-07-04 00:00:00", "description": "Plenary begins with Questions to the First Minister, and ends with a debate considering the case for new taxes in Wales.", "filename": "news_live_uk-politics-parliaments-40443639_1747668067.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-politics-parliaments-40443639_1747668067.html", "title": "AMs consider the case for new taxes in Wales", "title_page": "AMs consider the case for new taxes in Wales - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'No change for change's sake'\nConservative AM Nick Ramsay reminds the Cabinet Secretary for Finance and Local Government of the words in his written statement issued on 5 July 2016, that \"there should be no change for change's sake\".\nHe calls on the Welsh Government to make arrangements for an independent review of any new taxes to be completed within 6 years of their introduction.\nHe says it is important that the public were involved in the process but they should also \"have a sense of ownership\" of new taxation.\nHe added: \"Any new tax must have the potential to improve the lives of people in Wales\".\n'Have your say'\nThe public is being asked for ideas on what potential new taxes should be introduced in Wales.\nFinance Secretary Mark Drakeford said he wanted \"a national debate\" on new taxation and was keen to hear from the public and businesses.\nA shortlist of ideas for new Welsh taxes will be considered in the autumn.\nMr Drakeford told AMs the procedure for creating a new tax was \"certainly not straightforward\", and required approval from both the House of Commons and the House of Lords.\n\"Sometimes you have to begin with the machinery you have, and pretty soon some of its deficiencies may become apparent, and a less cumbersome set of mechanisms may emerge,\" he said.\nSeveral members of the public had already e-mailed him with ideas, he said.\nHe added that he was particularly interested in a levy on vacant land, due to come into force in the Republic of Ireland in 2019.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nWales Act 2014 allows for the creation of new Welsh taxes\nThe final item today is a government-led debate on taxation.\nThe Welsh Government already has powers over stamp duty and landfill tax from 2018, and income tax from 2019.\nPowers over stamp duty - to be replaced by a Land Transaction Tax - and the tax on landfill sites will take effect in April 2018.\nIncome tax rates in Wales could be varied from April 2019 as part of a deal with the UK Treasury with Welsh ministers able to cut or raise rates by 10p within each tax band.\n'Robust plan' by autumn for taking the service forward\nThe service, which differs from other UK models by having a greater proportion of clinical staff within it, was launched as a pilot in Abertawe Bro Morgannwg University Health Board (ABM), in October 2016, and extended to Carmarthenshire in May 2017.\nBetween 4 October 2016 and 30 April 2017 the service in ABM has dealt with in excess of 73,000 calls\nVaughan Gething says he is “very pleased with the progress that has been made to date\".\nHe tells AMs he has commissioned an evaluation of the pilot so far and has also asked the 111 Programme Board to provide him with a \"robust plan\" by autumn 2017 for taking the service forward.\n111 service available 24 hours a day, seven days a week\nThe members are now listening to a statement by the Cabinet Secretary for Health, Well-being and Sport, Vaughan Gething: Update on the Pathfinder 111 NHS Service in Wales.\nPlans to bring in a new NHS helpline for urgent but non-emergency care in Wales were first announced in 2013, despite problems with the service in England.\nThe 111 service is available 24 hours a day, seven days a week, and you can use it both for health information and advice and to access urgent care.\n'Health board compliance showed some variation'\nVaughan Gething acknowledges that \"in the first two months of the fund, health board compliance showed some variation in the availability of recommended medicines on health board formularies\".\nHe adds \"this needs to be consistent across Wales with every health board achieving full compliance with the two-month timescale for every medicine.\n\"I expect full compliance to be sustained over the five-year period of the fund and to make a real difference for patients\".\n350,000 entries of historic place names\nPlaid Cymru's Dai Lloyd refers to the Welsh Government decision earlier this year not to support his effort to protect historic place names.\nHe wanted to introduce a bill to the assembly to protect the names of houses and farms, fields, natural features and landscapes.\nKen Skates says that \"Wales now boasts the only statutory list, external of historic place names in the UK, and perhaps the world. The list included nearly 350,000 entries at its launch in early May.\"\nHe adds that work to bring the statutory register of historic parks and gardens into effect is well underway.\n'All private sector residential high rise blocks'\nCarl Sargent, Cabinet Secretary for Communities and Children, says \"our primary focus has been and remains for the time being on high rise tower blocks within the social housing sector.\n\"We are, though, now engaged with local authorities and the WLGA to identify all private sector residential high rise blocks.\n\"We are working to ensure we can identify freeholders and managing agents of these blocks and provide them with appropriate advice and guidance - in line with that which we have provided to the social housing sector.\n\"My expectation is that where an owner identifies that a residential high rise building has, or is suspected of having, ACM cladding they will send samples for testing and take the same additional precautionary measures as social housing landlords have taken\".\nHe reiterates he is waiting on UK Government advice on whether failed cladding should be removed or a \"full system\" test done first.", "url": "https://www.bbc.com/news/live/uk-politics-parliaments-40443639"}