{"authors": ["Richard Stead", "www.facebook.com"], "date_download": "2025-04-26 04:31:53", "date_modify": "2025-04-26 04:31:53", "date_publish": "2025-03-03 06:07:21", "description": "A Greater Manchester Police call handler heard over the phone an intruder break into a woman's house.", "filename": "news_articles_cx2p2dk3nrwo_1745641913.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/eff6/live/9146f530-f412-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2p2dk3nrwo_1745641913.html", "title": "'I heard glass shatter and a scream' - 999 operator", "title_page": "Manchester: 'I heard glass shatter and a scream' - 999 operator - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 999 call handler has described how she heard the sound of glass shattering and a victim scream down the phone when a burglar broke into a house.\nElla, who has responded to emergencies at Greater Manchester Police (GMP) for four years, took the call shortly after she started working for the force.\nShe said both she and the woman on the phone were \"terrified\", and that she told her to barricade herself in a bedroom.\nElla told BBC Radio Manchester: \"The one thing you always listen for is the sound of sirens in the background because that's when you know your job is done.\"\nGMP launched Operation Castle in July 2021, in a bid to cut the number of domestic burglaries.\nAt the time, GMP was in special measures after failing to record 80,000 crimes.\nDet Supt Alicia Smith, the force lead for burglary at Greater Manchester Police, admitted it was a \"very poor quality of service\" at the time.\n\"Burglary is now a force priority for us and we will attend every incident to seek every opportunity to catch the suspects,\" she said.\nGMP said as a result of its new approach it recorded 11,246 burglaries last year, 33% fewer than three years ago.\nAnd it arrested 2,305 people on suspicion of of the offence in 2024 - a 25% increase compared with 2021.", "url": "https://www.bbc.co.uk/news/articles/cx2p2dk3nrwo"}