{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 03:48:07", "date_modify": "2025-04-26 03:48:07", "date_publish": "2025-03-05 15:15:32", "description": "The broadband firm defended its response to Storm Éowyn but conceded communication could have been better.", "filename": "news_articles_c778vpk8ee1o_1745639287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2d70/live/3aa42280-f9ca-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c778vpk8ee1o_1745639287.html", "title": "Fibrus to pay compensation for Storm Éowyn broadband disruption", "title_page": "Fibrus to pay compensation for Storm Éowyn broadband disruption - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Broadband firm Fibrus will pay customers compensation for disruption caused by Storm Éowyn.\nDomestic customers will receive £5 a day for service interruptions that lasted more than 48 hours, while business customers will receive £10 a day.\nStorm Éowyn brought winds of more than 90mph to Northern Ireland on 24 January, damaging electricity and telecoms infrastructure.\nFibrus senior managers have been facing questions from a Stormont committee.\nThe company has said that 40,000 of their customers were without service at the peak of the storm.\nJust over 60 customers are still experiencing storm-related service problems.\nShane Haslem, chief operating officer at Fibrus, said the company could have triggered a \"force majeure\" clause meaning they would not have had to pay compensation but it chose not to.\nForce majeure is a legal term that refers to an extraordinary event that makes it impossible for a party to fulfill their contractual obligations.\nFibrus managers defended the firm's response to Storm Éowyn.\nDominic Kearns, the chief executive, told the committee that because a large part of its network was focused on hard-to-reach rural areas , its infrastructure was predominately overhead cables.\nHe said if the network was fully underground it would have been 10 times more expensive to build.", "url": "https://www.bbc.co.uk/news/articles/c778vpk8ee1o"}