{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:01:08", "date_modify": "2025-04-26 08:01:08", "date_publish": "2025-02-25 10:41:00", "description": "Albert Blackmore, 29, was detained by police after they forced entry to a property in Huntly.", "filename": "news_articles_cz9gdpyy22do_1745654468.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/65e4/live/14033a20-cc3a-11ef-b19f-35bc04f01269.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz9gdpyy22do_1745654468.html", "title": "Man caught with stun gun in Huntly jailed for five years", "title_page": "Man caught with stun gun in Huntly jailed for five years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who left London for Aberdeenshire to get away from criminality has been jailed for five years for possession of a stun gun.\nAlbert Blackmore, 29, was detained by police after they forced entry to a property in Huntly last year.\nA judge rejected a plea that Blackmore might avoid the five-year minimum prison term for such firearms offences.\nLord Young told him at the High Court in Edinburgh: \"Parliament has set out exceptional circumstances are required. They are rarely found in cases like this.\"\nBlackmore previously admitted being in possession without lawful authority of a firearm disguised as another object, namely a taser disguised as a USB device, in April last year.\nHe also admitted possessing the taser without holding a firearms certificate.\nDefence counsel Bill Adam said that, before moving to Aberdeenshire, Blackmore led \"a rather unsettled life\" in London and mixed with people involved in criminality.\nHe added: \"He moved to Aberdeenshire to withdraw from that lifestyle.\"\nHe said that Blackmore's actions in taking possession of the weapon were \"impulsive\" and told the court: \"He did not buy it for the purpose of using it offensively.\"\nMr Adam said: \"He had an extremely challenging childhood. It had a profound effect on him and still does.\"\nThe defence counsel said Blackmore's history of offending was a product of his lifestyle, which he now wanted to move away from, and on his release he planned to return to London to his family.\nThe judge said Blackmore was aware that the weapon in his possession was capable of inflicting harm.", "url": "https://www.bbc.co.uk/news/articles/cz9gdpyy22do"}