{"authors": ["Emily Dalton", "www.facebook.com"], "date_download": "2025-04-26 07:07:00", "date_modify": "2025-04-26 07:07:00", "date_publish": "2025-02-28 06:08:19", "description": "Fairmont Windsor Park has agreed to demolish 10 other buildings to make up for the treehouses.", "filename": "news_articles_cly669e53vno_1745651220.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5dc4/live/484f3d90-f531-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly669e53vno_1745651220.html", "title": "Surrey hotel allowed to keep illegally built treehouses", "title_page": "Surrey hotel allowed to keep illegally built treehouses - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Surrey hotel has been told, after a two-and-a-half year battle, it can keep four treehouses which were built illegally.\nThe accommodation was built next to the Fairmont Windsor Park near Englefield Green, on green belt land near Windsor Great Park, without planning permission.\nCouncillors voted in favour of the application at a Runnymede Borough Council planning meeting on Wednesday after the hotel agreed to demolish 10 other buildings to make up for the added treehouses.\nOfficers believed the benefits outweighed the harm to the green belt and recommended the scheme for approval.\nArora Group director Surinder Arora apologised for the \"mistake\" and told the council: \"You will never see this from Arora ever again.\"\nThe 10 buildings that were agreed to be demolished included stable blocks, log cabins, horse shelters and part of a barn.\nA biodiversity net gain on the site of 20% was also agreed as part of the application, the Local Democracy Reporting Service said.\nSpeaking against the plans, Amanda Willis told the committee the buildings proposed to be demolished were \"typical\" of a green belt setting but the lodges were \"entirely out of place\".", "url": "https://www.bbc.co.uk/news/articles/cly669e53vno"}