{"authors": ["Deborah Price", "www.facebook.com"], "date_download": "2025-04-26 07:52:53", "date_modify": "2025-04-26 07:52:53", "date_publish": "2025-02-25 14:30:43", "description": "Plans to build an energy-from-waste plant were rejected by the government in 2014.", "filename": "news_articles_c1enzz933q7o_1745653973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b27e/live/a8a79ef0-f377-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1enzz933q7o_1745653973.html", "title": "Site of rejected £1bn waste incinerator near Hatfield to be sold", "title_page": "Site of rejected £1bn waste incinerator near Hatfield to be sold - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The site where a £1bn waste incinerator was proposed to be built before the plans were halted by the government is to be sold.\nHertfordshire County Council said it no longer had \"purpose\" for the New Barnfield Centre site near Hatfield, where Hatfield School was based until 1990.\nThe authority had spent nearly £6m supporting the energy-from-waste project before it was turned down by the secretary of state in 2014.\nConservative councillor Bob Deering, executive member for resources and performance at the council, said money from the sale would be \"welcome in terms of our overall budget situation\".\nGovernment planning inspectors turned down the processing plant on green belt land, calling it an \"inappropriate\" development.\nFor more than a decade the council retained the site as a possible location for a secondary school.\nHowever, at a cabinet meeting Mr Deering said there was no longer a \"Hertfordshire County Council purpose for it\".\nA council report said if it was marketed with planning permission for industrial use, it could be \"very attractive in the marketplace\".\nIt did not state its value, the Local Democracy Reporting Service said.\nStephen Boulton, Conservative executive member for sustainable economic growth, said the empty school site had been a cost to the council for some time, with the buildings described as being in \"poor condition\".", "url": "https://www.bbc.co.uk/news/articles/c1enzz933q7o"}