{"authors": ["Julian O'Neill", "www.facebook.com"], "date_download": "2025-04-26 06:32:22", "date_modify": "2025-04-26 06:32:22", "date_publish": "2025-02-27 08:04:24", "description": "Sean O'Reilly's solicitor claims his client was denied travel to Scotland for treatment under anti-terrorism legislation.", "filename": "news_articles_c5yxxx8z258o_1745649142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5082/live/d877d0f0-f4df-11ef-ae0a-4bca4f518eb0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yxxx8z258o_1745649142.html", "title": "Shooting victim 'prevented from travelling for treatment'", "title_page": "Shooting victim 'prevented from travelling for treatment' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The victim of a suspected republican feud shooting in Northern Ireland has been prevented from travelling to Scotland for surgery, his solicitor has claimed.\nSean O'Reilly, 49, was shot twice in an attack in the Bell Steel Manor area of Dunmurry on Sunday.\nMr O'Reilly's solicitor alleged he was denied travel under anti-terrorism legislation.\nThe Police Service of Northern Ireland (PSNI) has said it was not its decision.\nMr O'Reilly's solicitor said that they will be taking legal action \"to establish who is responsible for the decision\".\nMr O'Reilly is currently believed to be under armed guard at the Royal Victoria Hospital in Belfast for his own safety.\nHe has undergone surgery to remove a bullet from his collarbone.\nA scan showed he had also suffered a severed nerve in his left bicep and arrangements were made for specialist surgery in Glasgow.\nThe PSNI contacted Police Scotland so it could arrange to manage the risk to him while in Glasgow.\nHowever, it is believed the hospital was then unwilling to admit him.\nMr O'Reilly's solicitor Peter Corrigan said a surgeon said he requires treatment before Saturday \"or the nerves will die\".", "url": "https://www.bbc.co.uk/news/articles/c5yxxx8z258o"}