{"authors": ["Brendon Williams", "www.facebook.com"], "date_download": "2025-04-26 03:38:35", "date_modify": "2025-04-26 03:38:35", "date_publish": "2025-03-04 22:52:00", "description": "A son who looks after his father 24-hours a day urges more mental health support for unpaid carers.", "filename": "news_articles_c15qn2kv3qno_1745638715.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/76fd/live/60ce84b0-f8de-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c15qn2kv3qno_1745638715.html", "title": "Unpaid carers: 'I love my dad to bits", "title_page": "Unpaid carers: 'I love my dad to bits - but I reached breaking point' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A son who looks after his father for 24-hours a day says he has reached \"breaking point\" and is calling for more mental health support for those who care for their loved ones.\nBernard Mendoza, 82, developed dementia, external three years ago and has been cared for by his son Danny at home ever since.\nDanny Mendoza, 54, from Gresford, Wrexham, said he loved his father \"to bits\" but had been \"living like a hermit\" and the isolation had left him feeling suicidal.\nThe Welsh government said unpaid carers played a vital role and that it was committed to ensuring support was available.\nDanny has had depression for 20 years but his condition worsened after he became his father's sole carer.\n\"It's had a huge impact on my mental health,\" he said.\n\"I've never been so depressed in my life. It got to the point where I was considering suicide as a way out.\n\"It's at that point I knew I wasn't well.\"\nAfter speaking to his doctor, Danny was put in touch with social services the next day who arranged for his father to spend six weeks in a care home for a period of respite.\nHe said agreeing to place his father in temporary care left him \"ridden with guilt\", but \"there's only so much you can do before you end up broken, and that's no use to me or my dad\".\nHe said more support should have been made available before he reached \"breaking point\".\n\"I should have reached out earlier, but nevertheless I still feel that there should be something there in place to ensure that family carers don't reach a position where they're at burnout or in a very dark place like myself,\" he said.\nFor the past few years, Danny has been taking one break a week for four hours while his father visits a day centre.\nHe said the loneliness of being a sole carer made him feel he had \"lost contact with the real world\".\nDanny, who was forced to leave his job three years ago, said the system for unpaid carers was \"totally broken\" and criticised the £328-per-month Carer's Allowance he said he received.\n\"I'm sorry, but that is an insult. I'm a 24/7 carer. Yes, he's my dad and I love him to bits, but I'm his carer and the money should at least reflect minimum wage. You've still got to live. It's not right.\"\nGill Stafford, 76, has been the sole carer for her son Gareth since her husband died 10 years ago.\nGareth, 38, has cerebral palsy and cannot walk or talk, but plays boccia – a form of bowls – for Wales.\nGill, from Abergele, Conwy, said carers \"feel like we're invisible sometimes\".\n\"I see people going past, through Gareth's window, and quite a few of them wave to him, which is rather nice,\" she said.\n\"You just feel like going out and saying 'can you come in?'\"\nGill said Gareth received some social care which allowed her to get out once a week for six hours.\nShe said a carer also took Gareth to Boccia for half a day a week, but she often goes with them so that \"I'm chatting to someone\".\nWhen carers are on holiday, or not available, she said: \"You can go weeks without seeing someone, especially over Christmas.\"\nNew figures from the charity Carers Wales, based on a survey of 1,217 current or former carers, suggested 38% of unpaid carers in Wales struggled mentally while 60% felt overwhelmed.\nOf those that sought support from social care services, 57% said services were not available when they needed them.\nCarers Wales said Census data suggested there were 310,000 unpaid carers in Wales, with the work they do estimated to be worth £10bn if they were paid.\nRob Simkins, the charity's head of policy, said the findings \"should be ringing alarm bells across Wales,\" and warned parts of the NHS would \"simply not work\" without unpaid carers.\nHe said they were responsible for keeping large numbers of people out of hospital, and without them, \"everything we've worked for to try and get people out of hospitals into homes, completely falls apart\".\nHe added: \"This report is the latest in a long line of reports exposing the issues facing unpaid carers in Wales and the failures that have led to this point,\" he added.\n\"We now need to see urgent action and leadership from the Welsh government to address these issues as a top priority. Anything less is simply not acceptable.\"\nThe Welsh government said it was committed to \"ensuring support continues to be available\".\nIt said it had allocated £42million to support unpaid carers since 2022, adding: \"We continue to work closely with health boards and local authorities to drive improvements in services for carers, including access to carers needs assessments.\"\nThe UK government said it was increasing the Carer's Allowance earnings threshold and making extra money available for local authorities.", "url": "https://www.bbc.co.uk/news/articles/c15qn2kv3qno"}