{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:29", "date_modify": "2025-05-19 15:29:29", "date_publish": "2015-02-10 12:07:48", "description": "A £30m contract to design a 19 mile (30km) stretch of dual carriageway between Inverness and Nairn is earmarked for Jacobs UK Ltd.", "filename": "news_uk-scotland-highlands-islands-31360743_1747668569.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80905000/jpg/_80905907_rivernairncrossing.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-31360743_1747668569.html", "title": "A96 Inverness-Nairn contract to be awarded", "title_page": "A96 Inverness-Nairn contract to be awarded - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A £30m contract to design a 19 mile (30km) stretch of dual carriageway between Inverness and Nairn has been earmarked for Jacobs UK Ltd.\nThe contract has to go through a process before Transport Scotland formally awards it.\nThe work involves designing a bypass for Nairn.\nThe work to upgrade the section of A96 forms part of a wider project to build 88 miles (141km) of dual carriageway between Inverness and Aberdeen, external.\nImproving the A96 from Inverness and Nairn - which also involves a new crossing over the River Nairn and two new railway crossings - could cost between £375m to £475m.\nCabinet Secretary for Infrastructure, Investment and Cities, Keith Brown, said the Scottish government was committed to improving the route.\nHe said: \"Dualling the A96 requires careful, in-depth planning and design so that we deliver the right scheme and help tackle congestion, make journey times more reliable and, crucially, improve road safety.\n\"This £30m design contract for the 19-mile section between Inverness and Nairn which includes a bypass at Nairn, reinforces our determination to invest in this road and all of our city-to-city roads, to bring them up to full dual carriageway standard.\"", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-31360743"}