{"authors": ["Gavin Kermack", "Tom Edwards", "www.facebook.com"], "date_download": "2025-04-26 06:27:50", "date_modify": "2025-04-26 06:27:50", "date_publish": "2025-02-28 18:28:56", "description": "The skills minister, Jacqui Smith, speaks with visually impaired students on a visit to Worcester.", "filename": "news_articles_cvge8dl1jgpo_1745648870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c57/live/cd431750-f5fa-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvge8dl1jgpo_1745648870.html", "title": "Worcester students challenge minister over disability funding", "title_page": "Worcester students challenge minister over disability funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pupils at a school for blind and visually-impaired children have challenged the government over its funding for specialist education.\nJacqui Smith, the skills minister and government spokesperson for equalities, spoke to pupils during a visit to New College Worcester (NCW) on Friday.\nStudents spoke highly of the difference attending a specialist school had made to their lives.\nBut they also said more funding and support from government was needed to help students with special educational needs and disabilities (SEND) reach their potential.\nMolly, 15, has been at the college since September.\n\"It has been such an amazing experience for me, from being in mainstream my entire life, to come to a specialist school,\" she said.\n\"It just feels absolutely amazing to have all that support that I have needed since I have lost my vision.\"\nZander, 15, said institutions like NCW gave young people the confidence to aspire to succeed.\n\"Places like this are critical,\" he said. \"In mainstream, I was isolated from a lot of subjects. Here, I've managed to heal myself from all of that, all of those problems.\"\nSmith, the former MP for Redditch, said she recognised that SEND provision was often lacking.\n\"One of the big challenges for us as a government is in the whole area of special educational needs and disabilities,\" she said.\n\"Essentially what we've inherited is a system where people feel a lot of money is being spent, but parents and children feel a lack of confidence in what they're able to access in mainstream schools.\n\"The government has already done more to put additional funding into local authorities for their special educational needs provision.\"\nShe added: \"There will always be a role for specialist schools.\"", "url": "https://www.bbc.co.uk/news/articles/cvge8dl1jgpo"}