{"authors": ["Jonny Manning", "www.facebook.com"], "date_download": "2025-04-26 06:55:09", "date_modify": "2025-04-26 06:55:09", "date_publish": "2025-02-28 15:42:36", "description": "Caitlin Hutchinson, from Sunderland, is now on the sex offenders register for abusing a teenager.", "filename": "news_articles_ckg88g1qdkwo_1745650509.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f53/live/093c8140-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg88g1qdkwo_1745650509.html", "title": "Sunderland woman groomed young boy over several months", "title_page": "Sunderland woman groomed young boy over several months - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who groomed and sexually assaulted a young boy over several months has been jailed for four years.\nCaitlin Hutchinson, 21, of Roker Avenue in Sunderland, sent the victim sexually explicit text messages and made him carry out sex acts on her.\nDurham Police said Hutchinson initially denied the offences and told officers the boy had forced himself on her.\nThe boy, who is in his early teens, said the last 18 months had been hell and he could not forgive Hutchinson for \"ruining his childhood\".\n\"I've changed so much because of what I've been through,\" he said.\n\"I don't want to be around women alone because I don't feel safe, even around women I know because I don't want to be targeted and manipulated again.\"\nThe boy, who is not being named for legal reasons, said he now struggled to sleep because his thoughts turned to memories of the abuse and he suffered from anxiety and depression.\n\"I feel like I will never get over what she has done to me, that I am damaged, and that I will never be fully happy.\n\"I just want a normal life and I don't feel that my life will ever be normal again.\"\nHutchinson was arrested when the boy told his parents about the abuse.", "url": "https://www.bbc.co.uk/news/articles/ckg88g1qdkwo"}