{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:30", "date_modify": "2025-05-19 14:45:30", "date_publish": "2015-03-04 01:25:35", "description": "Islamist militants have seized two oil fields in central Libya, officials say, as rival factions reportedly carry out air strikes.", "filename": "news_world-africa-31719043_1747665930.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81383000/jpg/_81383294_026145609-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31719043_1747665930.html", "title": "Libya oil fields of Bahi and Mabruk 'seized by militants'", "title_page": "Libya oil fields of Bahi and Mabruk 'seized by militants' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Islamist militants are reported to have seized two oil fields in central Libya, as rival groups fight for control of the country.\nForces guarding the Bahi and Mabruk sites retreated after running out of ammunition.\nIt is not clear which group seized the oil fields.\nLibya's internationally recognised government in Tobruk and its rivals Libya Dawn also conducted air strikes on each other's positions.\nLibya has been without an effective government since Muammar Gaddafi was ousted in 2011.\nMabruk, about 310 miles (500km) east of Tripoli, is one of Libya's biggest oil fields.\nIt had been closed for some weeks because of violence and a slow-down of exports.\n\"Extremists took control of the Bahi and Mabruk fields and are now heading to seize the Dahra field following the retreat of the forces guarding these sites,\" said Colonel Ali al-Hassi, a spokesman for the oil industry security service.\nA gun attack on Mabruk in February left 11 people dead.\nAt the time witnesses said the attackers had claimed to be from a militia which has joined Islamic State.\nThe Islamic State militia, which controls the town of Derna, has not commented.\nThe BBC's Rana Jawad in Tripoli says the seizure of these fields will put more pressure on Libya's oil-reliant economy, already barely functioning because of the battles between rival forces driven by political differences and local grievances.\nTheir capture by Islamist militants with no known allegiances to the other power blocs adds a new and more complicated dimension to Libya's growing state of chaos, our correspondent adds.\nMr Hassi also said militia warplanes had made an unsuccessful attempt to attack an export terminal at Sidra oil port.\nIn response, the head of the internationally recognised government's air force said it had struck Tripoli's Maitiga airport, without causing any casualties.\nOil fields and airports are prime targets in the conflict, which has pitted Prime Minister Abdullah al-Thinni's parliament in Tobruk against Libya Dawn, an alliance of militias that includes various Islamist groups.\nIt took control of Tripoli last year and formed its own administration.\nThe United Nations is trying to restart negotiations to end the fighting that has engulfed Libya since the fall of Gaddafi.", "url": "https://www.bbc.com/news/world-africa-31719043"}