{"authors": ["Ewan Gawne", "www.facebook.com"], "date_download": "2025-04-26 03:45:34", "date_modify": "2025-04-26 03:45:34", "date_publish": "2025-03-05 06:17:33", "description": "The immersive exhibition is announced as part of the 25th anniversary of the Lowry venue in Salford.", "filename": "news_articles_cedlg27e1gxo_1745639134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c2b5/live/76d10120-f90b-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cedlg27e1gxo_1745639134.html", "title": "L. S. Lowry: Chance to walk inside celebrated 'Going to the Match' work", "title_page": "L. S. Lowry: Chance to walk inside celebrated 'Going to the Match' work - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People will have the chance to step inside L. S. Lowry's iconic Going to the Match painting as part of a new immersive exhibition.\nA 360-degree display of the celebrated 1953 artwork, which depicts fans arriving at a football ground, has been commissioned as part of the 25th anniversary of Salford arts venue the Lowry.\nThe £106m waterfront theatre and gallery first opened in 2000 and has become one of the most visited attractions in Manchester, said Lowry chief executive Julia Fawcett.\nIt was also the \"cultural heart of one of Europe's most successful regeneration projects\", she said.\nPart of the venue has been transformed by creative studio Layers of Reality to surround gallery goers with \"the sights and sounds of Going to the Match\", a Lowry spokesperson said.\nThe oil canvas painting of spectators heading to watch Bolton Wanderers at the team's then-home ground Burnden Park was bought by the gallery for £7.8m in 2022.\nMs Fawcett said the purchase was aimed at keeping the work on public view and free to access.\n\"Now, through this immersive experience, we can share this remarkable and iconic painting with even more people,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cedlg27e1gxo"}