{"authors": ["Natalie Bell", "www.facebook.com"], "date_download": "2025-04-26 04:19:13", "date_modify": "2025-04-26 04:19:13", "date_publish": "2025-03-04 06:20:29", "description": "Women who fled abusive relationships say they did not feel secure in Hull charity’s housing.", "filename": "news_articles_cm2nkr8n1edo_1745641153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4481/live/6290bda0-f85b-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2nkr8n1edo_1745641153.html", "title": "Tenants of Hull charity Winner say ‘safe houses’ were not secure", "title_page": "Tenants of Hull charity Winner say ‘safe houses’ were not secure - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Women who fled domestic abuse say the \"safe houses\" they were placed in by a charity were in such poor condition, it caused them further distress.\nDozens of tenants of Winner, the Preston Road Women's Centre in Hull known locally as Purple House, said their properties had broken back doors, damp, mould and leaks.\nThe charity, which states it offers safe and supported accommodation to women and children experiencing violence and abuse, said it would \"continue to review our processes to identify any gaps in our services to those tenants\".\nHull City Council (HCC), which provides Winner with £107,000-a-year funding, said it had reported the charity to the government department for social housing.\nLaura, not her real name, said she turned to the charity for support following an abusive relationship but claimed her mental health worsened after years of problems with the house she was placed in with her children.\n\"My back door was smashed in by an ex-partner,\" she said. \"They did send someone round to fix it but they just put a cardboard box over it and left it like that for nine months.\n\"My handle used to fall off as well so if there was ever an emergency I couldn't get out of my back door. I had to force it with a knife to try and get out.\n\"It wasn't a safe house. I had to get out.\"\nJoanne, whose name has also been changed, added: \"My back door broke and when someone did eventually come out, they just took the locks off altogether and told me to just put plastic doorstops on and said it would be fine.\n\"When you're in a safe house you want it to feel secure and it certainly wasn't.\"\nLiv, also not her real name, spent four years in an abusive relationship but said she now felt trapped once more due to mould making living conditions miserable for her and her children.\n\"I just lay in bed and cry the majority of the time. I don't want to be here in this house, but I just have to put up and shut up, basically,\" she added.\n\"I'm stuck here. I can't afford private renting and the council isn't doing anything because I'm already housed, so I'm literally just stuck in this house.\"\nWinner said it has 178 houses in the city for women escaping abusive relationships. They are provided by Winner Trading Limited (WTL) - the charity's commercial arm.\nAccording to its accounts for the financial year ending 31 March 2024, WTL has managed a dispersed accommodation service since 2008 and charges rent.\nOn its website, the charity states rents are set at \"affordable levels which means that your Local Housing Allowance will cover at least most of the cost\".\nThe charity was founded 25 years ago by Lisa Hilder, who was awarded an MBE in 2024. It also provides training, nursery provision and volunteer programmes from its centre in east Hull and said it had helped \"tens of thousands of women\".\n\"We take the protection, safety and comfort of our tenants extremely seriously,\" a statement added.\n\"All our homes are fitted with a communications hub through which the tenants can report an issue 24 hours a day, seven days a week.\n\"We are working proactively to make sure repairs are dealt with in a timely manner and that properties are maintained appropriately.\"", "url": "https://www.bbc.co.uk/news/articles/cm2nkr8n1edo"}