{"authors": ["Becky Morton", "www.facebook.com"], "date_download": "2025-04-26 07:42:36", "date_modify": "2025-04-26 07:42:36", "date_publish": "2025-02-26 19:35:47", "description": "David Lammy says the UK \"a shared military and intelligence interest\" with the US in the territory.", "filename": "news_articles_c89y74pvp09o_1745653356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/992f/live/50d96470-f475-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89y74pvp09o_1745653356.html", "title": "David Lammy: Chagos deal will not go ahead if Donald Trump rejects it", "title_page": "David Lammy: Chagos deal will not go ahead if Donald Trump rejects it - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Chagos Islands deal will not go forward without the support of US President Donald Trump, the foreign secretary has said.\nDavid Lammy told ITV's Peston programme, the UK had \"a shared military and intelligence interest\" with the US \"and of course they've got to be happy with the deal or there is no deal\".\nThe UK is in talks with Mauritius about handing over the territory but continuing to lease one of the islands, Diego Garcia, which contains a UK-US military airbase.\nHowever, progress has been delayed to allow the new US administration to look at the details of the deal.\nIt comes as Prime Minister Sir Keir Starmer heads to Washington for talks with Trump, where the focus is expected to be on the Ukraine war.\nAsked if Trump had a veto on the Chagos deal, Lammy, who is also in the US for the visit, told ITV: \"If President Trump doesn't like the deal, the deal will not go forward and the reason for that is because we have a shared military and intelligence interest with the United States and of course they've got to be happy with the deal or there is no deal.\"\nThe foreign secretary added that he still believed \"it's the best deal\".\nEarlier this month Mauritian Prime Minister Navin Ramgoolam said US representatives would be present in negotiations over the islands.\nThe plan to cede sovereignty of the archipelago, known officially as the British Indian Ocean Territory, was announced last October after a deal was reached with former Mauritian leader Pravind Jugnauth.\nBut he was swept from power in a general election a month later, and Ramgoolam has criticised the deal negotiated by his predecessor.\nThe agreement has also been mired in uncertainty after Trump's re-election as US president, given several US Republicans have argued it could deliver a potential security boost to China.\nEarlier, Sir Keir faced questions over whether the money to pay Mauritius for leasing back the military base would come out of the increase in defence spending announced on Tuesday.\nPressed over the issue by Conservative leader Kemi Badenoch during Prime Minister's Questions, Sir Keir refused to say directly whether this would be the case.\nHe told the Commons the hike in defence spending was \"for our capability on defence and security in Europe\".\nThe PM added that the Chagos deal was \"extremely important for our security\" and the details and cost would be put before MPs when finalised.\nThe UK government has never confirmed the estimated cost of payments under the deal, but there have been reports of a figure ranging from £9bn to £18bn.\nSir Keir said \"the figures being bandied around are absolutely wide of the mark\".", "url": "https://www.bbc.co.uk/news/articles/c89y74pvp09o"}