{"authors": ["Laura Bicker", "www.facebook.com"], "date_download": "2025-04-26 03:58:57", "date_modify": "2025-04-26 03:58:57", "date_publish": "2025-03-04 12:50:12", "description": "Beijing's tit-for-tat measures are an opening swing, not a direct punch.", "filename": "news_articles_cx28g8z2w5po_1745639937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/27fa/live/d878eb60-f95e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28g8z2w5po_1745639937.html", "title": "Trump tariffs: China vows to fight US levies", "title_page": "Trump tariffs: China vows to fight US levies - but it also wants to talk - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"China will fight to the bitter end of any trade war,\" the foreign ministry spokesperson in Beijing declared, after China announced tit-for-tat tariffs on agricultural imports from the US.\nThis came within minutes of a new 10% US levy on Chinese imports that came into effect on Tuesday - which adds to existing tariffs both from Trump's first term and those announced last month.\nBut China's latest retaliatory measures are an opening swing, not a direct punch.\nIt shows some strength, and it has the potential to sting parts of the United States, but also leaves room to negotiate or escalate if necessary.\n\"We advise the US to put away its bullying face and return to the right track of dialogue and co-operation before it is too late,\" foreign ministry spokesperson Lin Jian added.\nThis is the second round of tariffs the two countries have imposed on each other since February. But this time China is hitting Donald Trump where it has the potential to hurt - by targeting farmers, who are some of his core supporters.\nAlmost 78% of farming-dependent counties in the US endorsed Mr Trump in 2024.\nChina is one of their biggest customers for produce such as chicken, beef, pork and soybeans and now all those products will face a 10-15% tax which will come into effect on 10 March.\nThe latest announcements raise the prospect of an all-out trade war between the world's top two economies and in various ministry statements, China is making two things very clear.\nFirstly, it is prepared to continue to fight.\n\"Pressure, coercion and threats are not the right way to deal with the Chinese side,\" said Mr Lin.\nBut secondly, it is also willing to talk.\nBeijing is not ramping up the rhetoric or the tariffs in the same way it did in 2018, during the last Trump administration. Back then it imposed a tariff of 25% on US soybeans.\n\"China's tariffs impact a limited number of US products, and remain below the 20% level. This is by design. China's government is signalling that they do not want to escalate, they want to de-escalate,\" according to Even Pay, an analyst with Trivium China.\nThe prospect of talks was raised last month. The White House said there would be a call between President Xi and Donald Trump. That never happened.\nSo will these talks take place and who will make the first move?\nChina is unlikely to want to go first. It will not want to be seen kowtowing to Washington.\nAnd in contrast to Canada and Mexico, Beijing has not announced new measures to target the flow of fentanyl. It simply repeated past statements that fentanyl is a \"US problem\" and that China has the strictest drug policies in the world.\nOn Tuesday, the State Council released a White Paper titled \"Controlling Fentanyl-related substances - China's contribution\".\nIt outlines the measures Beijing says it has already made to crack down on Fentanyl-related crimes and the precursor chemicals used to make the drug. It adds that it is \"diligently fulfilling international drug control obligations\".\nSo, while China hasn't picked up the phone to Washington, this document forms part of the country's message which appears to be saying - we are already doing what we can on fentanyl.\nIt can partly place the blame for any further economic woes at Washington's door and state that it's the fault of the US for starting a trade war.\nThe state media outlet Xinhua has in recent days released a series of parodies poking fun at a United States that is prepared to tax its allies and neighbours. The skits portray Washington as a bully echoing the words coming from the leaders of Canada and Mexico.\nAt the same time, China's Commerce Ministry has reiterated that it is prepared to work with other countries around the world to combat Mr Trump's tariffs.\nBeijing appears to be looking for potential allies in this trade war while also trying to cast Washington as a troublemaker who is prepared to target friends and foes alike.\nAll at a time when Donald Trump's \"America First\" doctrine has many in Europe and the UK wondering if the US-led world order is already in doubt.", "url": "https://www.bbc.co.uk/news/articles/cx28g8z2w5po"}