{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:37", "date_modify": "2025-05-19 15:31:37", "date_publish": "2015-02-20 08:49:38", "description": "Plans to base search and rescue helicopters are Manston Airport are scrapped following the airport's closure.", "filename": "news_uk-england-kent-31542599_1747668697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79658000/jpg/_79658118_hi022155899.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-kent-31542599_1747668697.html", "title": "Manston loses search and rescue service", "title_page": "Manston loses search and rescue service - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plans to base search and rescue helicopters at Manston have been scrapped after the airport's closure.\nThe Kent airfield was announced in 2013 as one of 10 UK bases for the helicopters when private company Bristow takes over the service in July.\nBut a letter from transport minister John Hayes on Thursday confirmed Manston would no longer be used.\nLeader of Thanet District Council Iris Johnston said she was furious and \"pretty surprised\".\nManston closed in May and a majority stake of the site was sold to regeneration specialists for redevelopment several months later.\nHowever, the nature of the sale and the true ownership of the airport was called into question at a recent Commons Transport Select Committee, external.\nIn a letter to the airport's consultative committee, Mr Hayes said: \"It is disappointing that Manston Airport's closure has forced Bristow to consider alternative locations.\n\"The uncertain future of the airport has placed an intolerable risk on the company.\"\nMs Johnston said it was her understanding that search and rescue helicopters would now be based at Lydd airport on Romney Marsh when the service was handed to Bristow by the RAF and Royal Navy.\nShe said she felt she was kept in the dark and had still been hopeful the helicopters would go to Manston.\n\"You didn't need a fully operating airport to have the search and rescue. There you could have that service without having all the rest that goes with it,\" she said.", "url": "https://www.bbc.com/news/uk-england-kent-31542599"}