{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:24:25", "date_modify": "2025-04-26 06:24:25", "date_publish": "2025-02-28 23:56:12", "description": "One story dominates Saturday's papers: Volodymyr Zelensky's row with Donald Trump at the White House.", "filename": "news_articles_cx2r0nd93neo_1745648665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/49a7/live/46e7f240-f62a-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2r0nd93neo_1745648665.html", "title": "'The Fight House' and 'Meltdown in Oval Office'", "title_page": "Newspaper headlines: 'The Fight House' and 'Meltdown in Oval Office'  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The meeting between Donald Trump, JD Vance and President Zelensky at the White House on Friday is reported to have \"started out smoothly\".\nBut the Daily Telegraph reports \"the mood in the room soured\", external when Zelensky called for US security guarantees that went beyond what was in the draft minerals deal. The paper says Trump \"took umbrage at the live negotiating style\".\nThe Daily Express, external and the Daily Mirror, external say the row has left hopes of a Ukraine peace deal \"in tatters\". The Mirror accuses Trump of making \"petty points\" and launching into a \"childish rant\".\nThe Times reports that \"none of this had been expected\" after French President Emmanuel Macron and Sir Keir Starmer had gone to the White House \"as the groundwork was laid\" for a deal.\nThe Guardian notes that as Zelensky arrived at the White House, Trump sought to \"physically dominate\" him., external He told reporters that Zelensky was \"all dressed up\" in his black turtleneck.\nThe Daily Mail says he \"came under attack\", external for his attire - with one reporter calling his combat clothes \"disrespectful\" to the Oval Office. According to the Mail, a US official predicted there would be problems. \"I know that's his thing\" they're quoted as saying, \"but this moment is different\".\nFT Weekend describes the meeting as one that \"could not have gone worse\"., external The paper says you can \"picture Vladimir Putin watching in the Kremlin, rubbing his hands in glee\".\nThe Daily Mail's headline calls the row \"a spectacle to horrify the world\" - noting the global audience \"doubtless\" included President Putin.\nIn its editorial, the Times says Russia's leader \"must have thought all his Christmases had come at once\", external as he watched the relationship between the US and Ukraine \"implode on live television\".\nThe Daily Telegraph leads condemnation of Trump and Vance, external - describing the pair as \"indisputably in the wrong, factually geopolitically and morally\".\nThe Daily Mirror's editorial column says the Americans' attempts to \"bully\" President Zelensky, external \"shames America\". But the letter from the editor in the Weekend i suggests Ukraine's president showed \"too little diplomacy when it might have benefitted his people\". The article points out \"realpolitik will prevail\".\n\"What now?\" is the question posed by the Times. The paper says diplomats will be \"scrambling\" to save the deal for Ukraine's rare earth minerals.\nWriting in the Daily Mail, the historian David Bishop says the \"omens suggest disaster for Ukraine\" - adding that the potential loss of US military support would mean Kyiv could only \"stagger on for a few months\".\nThe Guardian uses its leader column to say that tomorrow's summit of European leaders in London is now \"more crucial than ever\", external saying any plan agreed \"will be critical to Ukraine's future and to the continents\".", "url": "https://www.bbc.co.uk/news/articles/cx2r0nd93neo"}