{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:31:19", "date_modify": "2025-04-26 06:31:19", "date_publish": "2025-02-27 09:38:13", "description": "A look at what stories are trending across the West of England on 27 February 2025", "filename": "news_articles_c5yrrgl6jplo_1745649079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a010/live/f37b0680-f4ec-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yrrgl6jplo_1745649079.html", "title": "Seized firearms and airport parking charges up again", "title_page": "Seized firearms and airport parking charges up again - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman in Bridgwater who moved home and left her cats behind has been banned from keeping animals for 10 years, external. The incident was reported a month ago to the RSPCA as flies were seen coming from the property, says Somerset Live.\nA big talking point on social media has been Bristol Airport increasing their car parking charges for 10-minute drop-offs, external, which will go up to £7. The short-stay car park will also go up from £6 to £7, up from £6.\nA former bodyguard for Michael Jackson has started an \"all inclusive\" dance school in Taunton, external.\nAnd the last pub in Nympsfield in Gloucestershire has been bought by the community, external before being turned into flats, reports Gloucestershire Live.\nA number of firearms - including a submachine gun and pistols - have been seized, external at Dover, according to BBC reporter Simon Jones on X. A man from Bristol has been charged with carrying them as well as Class A drugs. You can read more about the story here.\nThere is a post in the Swindon Notice Board group from someone working at Great Western Hospital asking for clothes donations, external, after a patient reportedly arrived from a nursing home with no clothes to change into. The Facebook post has seen hundreds of responses.\nAnd there is an appeal in this Weston-super-Mare group is asking for something to be done about Uphill Way, which \"becomes impossible\" to walk up when it rains heavily, external.", "url": "https://www.bbc.co.uk/news/articles/c5yrrgl6jplo"}