{"authors": ["Karen Dunn", "www.facebook.com"], "date_download": "2025-04-26 07:42:16", "date_modify": "2025-04-26 07:42:16", "date_publish": "2025-02-26 21:08:06", "description": "The council says the project will save it an estimated £117m in maintenance and energy costs.", "filename": "news_articles_c80y505nr80o_1745653336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9045/live/606ff310-f482-11ef-96b5-cb16e833b61d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c80y505nr80o_1745653336.html", "title": "Council to spend £24m on 64,000 LED street lamps", "title_page": "West Sussex Council to spend £24m on 64,000 LED street lamps - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "West Sussex County Council is to spend more than £24m converting 64,000 street lights to LED lanterns.\nThe change is expected to save the council more than £117million in maintenance and energy costs, and cut carbon emissions by 1,633 tonnes per year, by 2028/29.\nThe initial cost was expected to be about £20.9million but has increased since the plan was first tabled in 2019. An additional £3.28m for the project was approved on Wednesday.\nWork is expected to start in May, the Local Democracy Reporting Service reports.\nConverting the thousands of lights will reduce light pollution by directing it on to the road and pavement where it is needed, rather than upwards, the council said.\nAs well as being energy efficient, LEDs last much longer than regular street lights and are less likely to fail.\nThe project will include a central monitoring system which will allow the lighting to be operated remotely – dimming or brightening them as necessary.\nThe plan has been six years in the making, but was delayed due to Covid and complex negotiations regarding changes to the current Street Lighting Private Finance Initiative contract.", "url": "https://www.bbc.co.uk/news/articles/c80y505nr80o"}