{"authors": ["Evie Lake", "www.facebook.com"], "date_download": "2025-04-26 07:32:04", "date_modify": "2025-04-26 07:32:04", "date_publish": "2025-02-27 16:50:39", "description": "The suitcase, which was kept under a bed for decades, sells for 10 times its estimated price.", "filename": "news_articles_cy7xxn73n6no_1745652724.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/85c4/live/14780820-f50f-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy7xxn73n6no_1745652724.html", "title": "Tutankhamun explorer suitcase found in Bishop Auckland sells at auction", "title_page": "Tutankhamun explorer suitcase found in Bishop Auckland sells at auction - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A suitcase believed to have been owned by the explorer who discovered the tomb of Tutankhamun has sold for £12,000 at auction after being found under a bed.\nAntiques expert David Harper said the suitcase, bearing a unique design of Egyptologist Howard Carter's initials, was gifted to his colleague John Healey before he died.\nWhen Mr Healey died in the early 1970s, the suitcase was kept under his son's bed in Bishop Auckland, County Durham.\nMr Harper said it is a \"very special day\" after he previously estimated the suitcase would sell for between £1,000 to £1,500.\nCarter and his team are credited with discovering the treasures of King Tut's tomb during a 1922 dig inside the Valley of the Kings in Egypt.\nMr Harper, from Barnard Castle, said he was approached by the suitcase's owner - Mr Healey's son - because he wanted to sell it.\nCarter and Mr Healey were \"firm mates\" as they worked together in Egypt in the 1930s, Mr Harper said.\nDavid Elstob, of Elstob Auctioneers which led the bidding, said he was \"astonished\" to come across the suitcase.\n\"We sell lots and lots of unique objects, but this was a real once-in-a-lifetime opportunity,\" he said.\n\"I was just astonished really.\"\nMr Elstob added it was a difficult thing to value and believed anything under £5,000 would have been cheap.\nThe suitcase eventually sold for a hammer price of £12,000, not including a 30% buyer's premium.", "url": "https://www.bbc.co.uk/news/articles/cy7xxn73n6no"}