{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 11:47:15", "date_modify": "2025-05-20 11:47:15", "date_publish": "2023-08-07 00:00:00", "description": "The barge can house up to 500 people - critics call the plan inhumane, but the government says it's cheaper than using hotels.", "filename": "news_live_uk-66424920_1747741635.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/E675/production/_130679985_microsoftteams-image-4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_uk-66424920_1747741635.html", "title": "Bibby Stockholm: Fifteen asylum seekers board on first day using barge", "title_page": "Bibby Stockholm: Fifteen asylum seekers board on first day using barge - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks for joining us\nYou can read our story on what the Bibby Stockholm is like inside here, or you can catch up on the controversy surrounding the Bibby Stockholm here.\nOur main story on the barge, which will continue to be updated into the evening, can be found here.\nThis could turn into another messy legal back-and-forth for government\nIone Wells\nPolitical correspondent\nThe government say 15 people have boarded the barge.\nRemember, it was expected the first tranche of arrivals would be 50 men.\nSo this number is lower than thought - and lower than the government had hoped and briefed.\nA Home Office official said there had been “minor” challenges.\nWe know about 20 people represented by the refugee charity Care4Calais had their transfers to the barge cancelled.\nThe government is not happy about this, with a government source saying that they have “another day” to move or they will consider removing their accommodation support.\nThis could turn into another messy legal back-and-forth over another immigration plan.\nTwenty people refused to board barge - Home Office\nWe've just heard from the official in charge of migrant accommodation at the Home Office, who says 20 people have refused to get on board the Bibby Stockholm so far.\nCheryl Avery, director for asylum accommodation at the Home Office, also says 15 people have boarded the vessel today.\nAsked by reporters about the consequences for any asylum seekers who refuse, she does not answer directly but stresses the government offers accommodation to migrants on a \"no choice\" basis.\nIn response to a follow-up question about how long people are expected to be on the Bibby Stockholm, Avery says the Home Office expects they will be there for around three to nine months.\nHow many people are prosecuted over illegal working?\nThe government has announced a tripling of fines for firms employing illegal migrants or renting out property to them.\nThe government says its visits to companies, including those targeting illegal working, were “at their highest levels since 2019, up 50% on last year”, resulting in arrests of “more people in 2023 than during the whole of 2022”.\nBut Labour says the number of penalties issued to firms employing workers illegally has fallen by two-thirds since 2016, arrests have dropped, and illegal working visits are down by over 1,000 on 2019.\nWho is right?\nIf you compare the number of fines to earlier years, there has been , externala 70% drop in penalties issued to employers since 2016. In 2016, there were 3,089 fines recorded, and in 2022 there were just 911.\nThere has also been a drop in the number of illegal working visits by Immigration Enforcement - a Home Office body responsible for tracking immigration offenders. In 2022, there were 3,735 visits by officials, external, down from 5,937 in 2019.\nHowever, the number of arrests resulting from these visits has indeed been rising in 2023.\nUp to July this year, there have been 3,959 arrests - more than in the whole of 2022. But this is still significantly lower than the 6,723 arrests recorded in 2019.\n'A ridiculous place to put anybody in large numbers’\nA local campaigner against putting the Bibby Stockholm barge in Portland has described the island as a \"really ridiculous place to put anybody in large numbers\".\nSusan Phoenix, from the \"No to the Barge\" campaign says having up to 500 people on the Bibby Stockholm risks putting a strain on local services, given there is just one road to get on and off Portland.\nQuote Message\nIf we have one accident on our causeway then neither ambulances nor fire engines or medical services can get across.”\nBut Phoenix also tells Radio 5 Live that her group has chosen not to protest the arrival of the first asylum seekers earlier, as they did not want to \"annoy any vulnerable people\" that may be boarding the vessel.\nPractical solution or unsafe plan?\nThe use of the Bibby Stockholm to house asylum seekers is a policy which divides political opinion, both on a local level in Dorset and more broadly in the UK.\nFor supporters like former Tory immigration minister Robert Goodwill, housing asylum seekers on the barge is a \"very practical solution to a very real problem\".\nThe Scarborough and Whitby MP tells Radio 5 Live the government is spending £6m a day to keep peoples in hotels, which means it needs to assess \"what alternatives can be more cost effective”, including using former military bases.\nBut for the head of the local Labour-run Portland Council, housing people on the Bibby Stockholm is neither safe nor reasonable.\nChairman Jim Draper says \"people on the island are worried\" over the safety of those on board.\nHow many asylum applications does the UK get?\nAs we've just been reporting, the number of migrants in hotels has increased by 3,000 since March - so how many asylum applications does the UK get?\nIn 2022, more than 89,000 people requested asylum in the UK.\nThat’s the highest number of applications since 2002 when 103,000 people (including dependants) applied, as people fled conflicts in Afghanistan, Somalia and Iraq.\nApplications then fell sharply, dropping to a 20-year low in 2010, before climbing again as refugees fled Syria.\nSee how numbers have changed over the years here:\nMigrants in hotels up by 3,000 since March\nMark Easton\nHome editor\nThe government wants to use the Bibby Stockholm barge to help reduce the cost of asylum accommodation, especially hotels.\nNow we've just seen that the number of asylum seekers being housed in hotels has gone up by 3,000 since the end of March.\nInterim figures released by the Home Office show a record 50,546 asylum seekers were in so-called contingency accommodation at the end of June.\nThe daily cost of the hotel rooms is more than £6m, the government says.\nHow many asylum seekers are male?\nAs we've just recapped, those on the Bibby Stockholm will all be men between 18 and 65. So how many asylum seekers are male?\nThe latest Home Office data, external shows that of the 91,047 people who applied for asylum in the year ending March 2023, 62% were adult men aged under 50.\nMost of the people crossing the Channel in small boats are men. They made up 87% of small boat arrivals, external in the year ending March 2023. The majority of them claimed asylum.\nTwo of the new migrant accommodation sites announced by the government – in Lincolnshire and Essex – are for adult men only. The government has not said who will be accommodated at the other confirmed sites in North Yorkshire and Sussex.\nWho will live on the barge?\nThose on board will be single, adult male asylum seekers aged from 18 to 65.\nThe BBC understands they will be a long way into the asylum claim process.\nThose on the barge will have had physical and mental health assessments, and been subject to security checks such as identity checks against UK immigration and police databases.\nIn an open letter addressing the plans, 40 organisations and campaigners have argued “containing people who have been through traumatising experiences, especially on a floating vessel, is cruel and inhumane\".\n'Disastrous failure' to stop the boats - Labour\nLabour has long criticised the government's strategy on migrants, and on Monday it said the pledge to stop the boats had been a \"disastrous failure\" after Home Office figures released today showed the number of migrants staying in hotels had hit 50,000.\nShadow home secretary Yvette Cooper said the figure represented a 25% increase from 40,000 in December, when PM Rishi Sunak promised to end the placement of asylum seekers in hotels.\n\"Rishi Sunak is failing to fix the Tories' boats chaos and the Conservatives are just flailing around chasing headlines rather than getting a grip,\" she said, adding that taxpayers were having to pay \"billions more pounds\" as a result.\nCooper added the backlog of asylum decisions was still at a \"record high\".", "url": "https://www.bbc.com/news/live/uk-66424920"}