{"authors": ["John Wimperis", "www.facebook.com"], "date_download": "2025-04-26 06:37:58", "date_modify": "2025-04-26 06:37:58", "date_publish": "2025-02-26 06:25:18", "description": "The development will include low-carbon, gas-free homes.", "filename": "news_articles_cwye3lp9926o_1745649478.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c5d1/live/bbe0e8f0-f296-11ef-9051-1161dc1af45b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwye3lp9926o_1745649478.html", "title": "Scores of eco-homes approved despite flooding fears", "title_page": "Nailsea housing: Scores of eco-homes approved despite flooding fears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans for 150 homes on the outskirts of a growing town have been approved - despite fears that future residents could be cut off by flooding.\nNorth Somerset Council has granted permission for the new eco-friendly properties near Hanham Way, Nailsea, north Somerset.\nThe development will include low-carbon, gas-free homes, with two-thirds of the site allocated as green space for public use.\nHowever, concerns were raised over access to the site, which will rely on a single road running through a reworked junction with Watery Lane.\nPlanning consultant Jemma Shurrock, representing the developer Vestry, said the homes would be built in a \"sustainable location, adjacent to Nailsea's existing settlement boundary\".\nWhile part of the site is at risk from future sea level rise, Ms Shurrock stressed that all homes would be built outside of these areas.\nBut critics fear the new homes could become isolated in the event of flooding.\nAt the council's planning committee meeting on 19 February, councillor Oliver Ellis warned: \"It's called Watery Lane for a reason.\"\nMeanwhile, councillor Mike Bird said with climate change and increased rainfall, \"flooding at the proposed junction could become more frequent, completely cutting off residents\".\n\"The development needs a full-width second entrance,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cwye3lp9926o"}