{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:46:08", "date_modify": "2025-05-19 14:46:08", "date_publish": "2015-02-23 00:00:00", "description": "All the latest news, sport, weather and travel from across Scotland on Monday 23 February 2015.", "filename": "news_live_uk-scotland-31582776_1747665968.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-scotland-31582776_1747665968.html", "title": "Scotland Live: News, sport, weather and travel updates from across the country on Monday 23 February 2015", "title_page": "Scotland Live: News, sport, weather and travel updates from across the country on Monday 23 February 2015 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One to watch...\nIs a £67,000 salary enough for MPs? Should they be allowed to have a second job?\nWe'll look at this story tonight on @BBCScot2015, external at 22:30 on BBC2 Scotland.\nBid to improve rally icon museum\nScottish Borders Council has committed £515,000 towards an enlarged and improved museum to celebrate the life and achievements of two-time Formula One World Champion Jim Clark.\nThe project will see the council's existing Jim Clark Room in Newtown Street, Duns, expanded on the current site and enhanced to allow cars raced by Clark to be displayed, along with a wide range of trophies and other memorabilia.\nExternal funding is also being sought to complete the £1.2m project.\nMan badly injured in Edinburgh bar fight\nA man is being treated in hospital for a serious head injury following a fight outside an Edinburgh bar.\nThe incident happened outside the Ritz Bar and Grill, on Lochside Place, at 01:00 on Sunday as the bar was closing.\nThe 23-year-old man was seriously assaulted and taken to Edinburgh Royal Infirmary.\nPolice are appealing for anyone who was in the bar at the time to contact police. They are particularly keen to speak to three people involved.\nTonight's forecast...\nBBC Scotland Weather\nLatest\nA windy night of weather in store across the south west, west coast and Hebrides. Winds here gusting from 50mph to 60mph and occasionally 70mph in exposed locations from the west or north west. Further frequent squally showers too, these of rain, hail and sleet to low levels, with snow on ground above around 300m.\nFurther east, across the central lowlands and southern uplands, expect a few showers although not as frequent.\nFor most of the mainland, there is also the risk of icy stretches as the temperature dips and the ground is wet. The driest spots will be across Grampian. Lows tonight around 1C to 3C for most.\nTomorrow remains windy with gales at first around western coasts from the north west. Further frequent showers will arrive across Highland and Grampian, with central, east and south east Scotland faring best, with drier and brighter spells of weather. Highs tomorrow around 5C to 7C.\nDundee move for Falkirk striker Loy\nBBC Sport\nScotland\nDundee have signed Falkirk striker Rory Loy on a pre-contract as manager Paul Hartley continues his squad rebuilding for next season.\nLoy, who has scored 11 times this season, will join the club in summer after agreeing a deal until 2018.\nThe 26-year-old signed from Carlisle in 2013 after previous spells at Rangers, Dunfermline and St Mirren.\nHe was nominated for the PFA Championship Player of the Year award last season after netting 21 times.\nTravel delays and road closures...\nBBC Scotland Travel\nLatest\nIn Glasgow, an accident is blocking one lane westbound at J16 Craighall and traffic is very slow on the approach and adding to the usual peak-time congestion. Traffic there is very slow from J13 Provan right through to J22 Plantation.\nIn West Lothian, traffic is slow due to roadworks on the M8 between J3a Bathgate and J4 Whitburn.\nA number of roads are closed elsewhere after heavy snow.\nIn Aberdeenshire, the A93 Glenshee to Braemar Road is closed, as is the A889 at Dalwhinnie and the B974 Banchory to Fettercairn Road.\nIn Aberfoyle, the A821 Duke's Pass is also closed.\nPolice say extra care is needed on the A9 at Dalwhinnie and on the A82 at Glencoe.\nStrong winds are affecting the Kessock, Tay, Erskine, Dornoch and Forth Road Bridges. The wins are also affecting ferries.\nAndy Coulson to face perjury trial\nThe former editor of the News of the World, Andy Coulson, is due to stand trial in Scotland on 21 of April on a charge of perjury.\nThe charge relates to the trial of the socialist politician Tommy Sheridan and his wife Gail at the High Court in Glasgow in December 2010.\nThe trial date was announced following a hearing at the High Court in Edinburgh today, which Mr Coulson attended.\nThe 47-year-old was director of communications at Number 10 Downing Street from 2010 to 2011.\nBrown leads case for Kirkcaldy Tesco\nFormer prime minister Gordon Brown has said that he and Fife Council leaders have put \"a strong case\" to Tesco for keeping its Kirkcaldy store open.\nTesco announced last month that the store, which employs 189 people, would be one of four closures in Scotland.\nMr Brown, who is the local MP, and Fife Council officials met Tesco chief executive Dave Lewis in London earlier.\nHe said they had shown Tesco that Kirkcaldy was not a declining market and would continue to grow.\nWar medals stolen in house raid\nPolice are attempting to trace thieves who stole five World War Two medals from a house in Edinburgh while the elderly homeowner was asleep.\nThe house, in the Grange area, was targeted on Sunday morning.\nThe owner woke to discover that medals were missing, along with a large quantity of cash, two gold wedding bands and three antique watches.\nPolice said the medals were of \"great sentimental value\" to the homeowner and have appealed for witnesses.\nMan fined for 'posting manure'\nA man who sprayed liquid manure through his former neighbour's letterbox following a row has been fined £700.\nStewart Reid, of Portknockie, admitted acting in a threatening or abusive manner during the incident in New Aberdour in September last year.\nThe 62-year-old first offender also admitted being in possession of a blade in a public place.\nAt Peterhead Sheriff Court, Reid was also ordered to pay the victim £200 for the resulting clean-up.\nFine and Dandie...\nCameron Buttle\nBBC Scotland\nMore than 50 Dandie Dinmont terriers and their owners have gathered near Selkirk in celebration of the breed.\nEvery single one of the world's population of Dandie Dinmonts can be traced back to a pair bred in the Borders.\nThe dogs - and their owners - travelled from all over the world to take part in events that also mark the 200th anniversary of the publication of Walter Scott's novel Guy Mannering, in which the author named the breed.\nLaptops stolen in computer shop raid\nA masked has stolen 10 laptop computers and a number of mobile phones after breaking in to a computer shop in Crieff.\nPolice said the shop, on the town's High Street, was targeted at 05:20 on Sunday morning.\nThe suspect was described as being about 5ft 10in (1.77m) tall. At the time of the robbery he was wearing a dark jacket and white trainers, with a full balaclava over his face.\nOfficers have appealed for information.\nTravel weather warning...\nWeather forecasters are warning of hazardous driving conditions on Monday and Tuesday as frequent sleet, snow and hail showers sweep across Scotland.\nThe Met Office has issued a yellow \"be aware\" warning for snow and ice across Scotland until Tuesday night.\nSnow showers caused disruption on some routes on Monday morning, including on parts of the A9, M80 and M74.\nUp to an inch (2.5cm) of snow is possible over low ground and 4in on ground above 200m, the Met Office said.\nDriver injured after car hits wall\nA driver has been injured after his car came off a road and struck a wall in Nairn.\nThe accident happened at about midday on Nairn's Inverness Road at its junction with the Newton Hotel.\nFirefighters freed the man from the wreckage and he was taken to hospital.\nThere was no information available on the condition of the man who was described by emergency services as \"elderly\".\nScotland 'will win soon'\nBBC Sport\nScotland\nVeteran winger Sean Lamont is adamant Scotland are close to clicking, and that a major result will soon follow.\nThe 34-year-old won his 92nd cap in the side's recent Six Nations defeat to Wales.\nIt was the second narrow loss in as many weeks as the Scots fell to France on the opening day.\nBut Glasgow Warriors' Lamont believes the margins between more Championship heartache and a precious win are growing ever slimmer.\n\"We've got to improve on making the right decisions at the right time,\" he said.\nDoctor caught with indecent images of children\nA 29-year-old hospital doctor has admitted downloading hundreds of indecent images of children.\nBrian Morris was caught with 481 images and 23 videos on his computer when police arrived at his rented flat in Glasgow's Princes Terrace.\nMorris, who is now a patient at Gartnavel Hospital, admitted downloading and possessing the material between November 2013 and March 2014.\nAt Glasgow Sheriff Court, sentence on the medic was deferred.", "url": "https://www.bbc.com/news/live/uk-scotland-31582776"}