{"authors": ["Aimee Dexter", "www.facebook.com"], "date_download": "2025-04-26 04:32:40", "date_modify": "2025-04-26 04:32:40", "date_publish": "2025-03-03 05:18:18", "description": "The first-ever UK pancake stacking championships take place in a town famous for its pancake race.", "filename": "news_articles_c2d4ez3x2wno_1745641960.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b204/live/f61a7640-f76d-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2d4ez3x2wno_1745641960.html", "title": "Olney pancake stacking contest debuts ahead of traditional race", "title_page": "Olney pancake stacking contest debuts ahead of traditional race - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sublime stackers and terrific tower-makers have been taking part in the UK's first-ever pancake stacking championships.\nThe competition was held on 1 March in Olney, Buckinghamshire - home to what is said to be the oldest annual pancake race in the world.\nThe new championships aim to \"widen the net and give everyone the opportunity to become a pancake champion\", organisers said, as only women are eligible to compete in the yearly Shrove Tuesday race.\nThe inaugural stacking competition was won by Lucas Willmore from Tring, Hertfordshire.\nThis year's Olney pancake race will take place on 4 March, with the new contest whetting fans' appetites and offering entrants the chance to show off their stacking skills.\nThe competition, which consisted of four initial rounds with stackers battling it out all the way to grand finale, was attended by people from across the UK who queued to get into the event.\nIn an interview with BBC Three Counties Radio, organiser Steven May said contestants received \"100 pancakes to the side\" and had to \"stack them up into the biggest tower you can make in 30 seconds\".\n\"The Guinness World Record for a pancake stack is more than 400, just to put it into perspective,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c2d4ez3x2wno"}