{"authors": ["Adrian Browne", "www.facebook.com"], "date_download": "2025-04-26 08:06:40", "date_modify": "2025-04-26 08:06:40", "date_publish": "2025-02-26 14:25:46", "description": "The party's Senedd leader says the money saved could be ploughed into struggling public services.", "filename": "news_articles_ckg8xq5n9dlo_1745654800.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/af8e/live/828aa910-f449-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg8xq5n9dlo_1745654800.html", "title": "Shut overseas offices to save cash, Tories tell first minister", "title_page": "Shut overseas offices to save cash, Tories tell first minister - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Welsh government's 20 offices abroad should be closed and the £4.7m saved spent on key public services, the Conservative Senedd leader has said.\nThe offices are in cities in North America, Europe, China, India, Japan, the Middle East and Africa. They include Beijing, New Delhi, Tokyo and New York.\nDarren Millar called Labour \"ridiculous\" for \"squandering millions of pounds\" on \"mini-embassies\" when UK ministers are in charge of international relations and Welsh public services are under strain.\nThe Welsh government said the offices \"link Wales with the world\", attract trade and investment and support Welsh businesses with export markets.\nOffices in India had also helped recruit doctors and nurses for the Welsh NHS, a spokesperson added.\nWriting to Labour First Minister Eluned Morgan, Millar said the UK government \"represents Wales, along with the rest of the United Kingdom, via a comprehensive network of embassies and consulates around the globe\".\n\"I am sure you will agree that with our NHS under severe pressure, local councils making cuts due to financial challenges, and families grappling with cost-of-living pressures, every pound of taxpayers' money must be spent where it is most needed,\" he wrote.\n\"I therefore urge you to immediately begin the process of closing these unnecessary overseas offices, while working with the UK government to ensure that Wales' interests are adequately promoted overseas, using UK embassies as necessary.\"\nIn 2017 the Federation of Small Businesses said exports were not boosted by the offices, while the Welsh government argued statistics may not present an accurate picture.\nLater that year plans for five new overseas offices were announced, to increase trade post-Brexit, taking the total to the current 20.", "url": "https://www.bbc.co.uk/news/articles/ckg8xq5n9dlo"}