{"authors": ["Jacob Panons", "www.facebook.com"], "date_download": "2025-04-26 07:31:29", "date_modify": "2025-04-26 07:31:29", "date_publish": "2025-02-27 17:12:15", "description": "Mike Sinden, 36, of Hove, denies sexual assault by penetration and the trial continues.", "filename": "news_articles_c3w11583qpno_1745652689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a75/live/e1ae53d0-f528-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w11583qpno_1745652689.html", "title": "Former Sussex Police inspector tells jury woman did not say 'no'", "title_page": "Former Sussex Police inspector tells jury woman did not say 'no' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former police inspector who is charged with sexual assault by penetration told a court the alleged victim did not say \"no\".\nMike Sinden, 36, of Hove, East Sussex, and the woman, who cannot be named for legal reasons, had been drinking heavily in Eastbourne as part of a group in March 2022 before the alleged incident, Hove Crown Court was told.\nThe father of two has denied pinning the woman against a wall in an alleyway and sexually assaulting her.\nThe woman said she told the inspector \"no\" as he sexually assaulted her.\nMr Sinden told the jury they had been flirting and kissing earlier in the evening after drinking shots and going to a cocktail bar.\nRachel Beckett, prosecuting, told him the kissing did not happen, but Mr Sinden insisted it did.\nIn regards to the claim Mr Sinden pinned the woman to a wall in an alley, Ms Beckett told him: \"She was moving away from you, turning her face, and she said 'no' to you.\"\nMr Sinden said it was one kiss and that she did not say \"no\".\nMs Beckett told the court: \"You held her against the wall and she tried to move your hand away and all this time she was saying 'no' to you.\"\nMr Sinden denied this and again said the woman did not say \"no\".\nHe also denied telling her: \"You're saying 'no' but I think you're actually saying 'yes'.\"\nThe woman tried to push his hand away as he moved it under her dress, Ms Beckett said.\nShe told the jury: \"She then managed to push him away and said 'I said no'.\"\nIn court, Mr Sinden also denied moving to take off his trousers after the woman pushed him away.\nThe court heard that the following day, the woman sent Mr Sinden a message saying: \"I don't feel great about any of it and I'm trying to forget but I definitely said no to you.\"\nMr Sinden deleted his replies as he did not want his partner to see them and did not want to be \"drawn into a conversation\", the jury heard.", "url": "https://www.bbc.co.uk/news/articles/c3w11583qpno"}