{"authors": ["Sarah Spina-Matthews", "www.facebook.com"], "date_download": "2025-04-26 07:50:30", "date_modify": "2025-04-26 07:50:30", "date_publish": "2025-02-25 15:55:18", "description": "Davey Smith, 18, \"could have caused himself serious harm\", according to North Yorkshire Police.", "filename": "news_articles_cz7veej58e8o_1745653830.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/03af/live/0db6b330-f382-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz7veej58e8o_1745653830.html", "title": "Scarborough man hid 'shivering' in lake after police pursuit", "title_page": "Scarborough man hid 'shivering' in lake after police pursuit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who was arrested after being fished out of a lake where he was hiding following a police pursuit has been given a suspended prison sentence.\nDavey Smith, 18, was seen driving \"suspiciously\" on the outskirts of Scarborough in the early hours of 6 November and sparked a pursuit when he failed to stop, according to North Yorkshire Police.\nSmith, of Prospect Crescent, Scarborough, then pulled over and fled from the car, with officers eventually arresting him after he was discovered \"almost fully submerged\" in Throxenby Mere, a spokesperson said.\nSgt Mark Patterson said: \"It certainly wasn't the cleverest place to hide on a cold November night and he could have caused himself serious harm.\"\nThe pursuit involving Smith and a passenger, who were travelling in a Ford Mondeo, had come to an end after a stinger device was used to deflate the car's tyres, the force spokesperson said.\nBoth Smith and his passenger, a 17-year-old boy, had then run from the vehicle towards Throxenby Mere, with the boy detained immediately, but \"no sign of Smith\".\nAfter about 45 minutes of searching by torchlight, Sgt Patterson noticed a figure in the water.\nSmith was subsequently pulled out of the lake before being given first aid and taken to hospital where he was charged, police said.\nHe later pleaded guilty to dangerous driving, failure to stop, failing to provide a specimen of blood for analysis and driving without insurance or an appropriate licence.\nAt Scarborough Magistrates' Court on Monday, Smith was sentenced to 36 weeks in prison, suspended for 18 months, as well as 200 hours of unpaid work.\nHe was also given a 28-month driving ban and ordered to pay more than £270 costs.\nThe passenger in the car was later released without charge, police said.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cz7veej58e8o"}