{"authors": ["Amy Holmes", "www.facebook.com"], "date_download": "2025-04-26 04:37:38", "date_modify": "2025-04-26 04:37:38", "date_publish": "2025-02-28 11:10:16", "description": "Some 36 councillors abstain as next year's budget is voted through in the early hours of the morning.", "filename": "news_articles_cvg114wydevo_1745642258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/858e/live/35a6dad0-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg114wydevo_1745642258.html", "title": "Central Bedfordshire Council to cut 100 jobs and raise tax", "title_page": "Central Bedfordshire Council to cut 100 jobs and raise tax - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has voted to cut up to 100 job posts in the hope of saving more than £35m in its annual budget.\nCentral Bedfordshire, which is run by the Independent Alliance group as a minority administration, also agreed to raise council tax by 4.99% for 2025-26, although the majority of councillors abstained from voting.\nPlans were rejected to close Dunstable Library on Sundays and Mondays and reduce opening hours at recycling centres.\nMore than half of the job cuts are expected to come by not filling vacant positions, but leader Adam Zerny said: \"Passing the budget is not a big cause for celebration as this has huge implications for jobs.\"\nThursday evening's meeting ran into the early hours of Friday, with 16 councillors voting to approve the £265m budget, 36 abstaining, and the rest of the authority's 63 members voting against.\nLeader of the Conservatives, Richard Wenham, said his party \"could not support this damaging budget\".\n\"Residents are faced with huge council tax rises and vicious cuts across the board,\" he said.\nHayley Whittaker, leader of the Central Bedfordshire Community Network group, said: \"It's going to take for the staff to be made redundant until we really start to feel the impact of those losses.\"\nA Liberal Democrat amendment was also passed to add £30,000 for flooding information and outreach, after Bedfordshire suffered significant floods in 2024.", "url": "https://www.bbc.co.uk/news/articles/cvg114wydevo"}