{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 04:41:35", "date_modify": "2025-04-26 04:41:35", "date_publish": "2025-03-02 07:06:59", "description": "Three-year-old Beau Kent was born with a rare condition meaning he stops breathing when he sleeps.", "filename": "news_articles_cy4vvjr107yo_1745642495.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/309c/live/868ea400-f5dc-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vvjr107yo_1745642495.html", "title": "Arundel family hopeful of treatment for son's rare condition", "title_page": "Arundel family hopeful of treatment for son's rare condition - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The father of a toddler with a rare breathing condition has said a breakthrough in treatment would be \"life changing\" for his son.\nThree-year-old Beau Kent, from Poling, near Arundel, was born with Congenital Central Hypoventilation Syndrome (CCHS), a condition in which a person loses control of their breathing when they fall asleep or lose consciousness.\nHis father, Ashley Kent, hailed him as a \"little fighter\" after spending the first nine months of his life in hospital.\nMr Kent, 44, was part of a relay run from Arundel in West Sussex to Hove in East Sussex to fundraise for Keep Me Breathing, a charity aiming to produce a \"breathing pacemaker\".\nBeau was born by emergency C-section after his mother, Eloise Kent, was rushed to hospital.\nAfter being immediately incubated, doctors noticed Beau did not respond to being taken off his support.\nHe was transferred to the Trevor Mann Baby Unit in Brighton and was eventually diagnosed with CCHS, and required a tracheostomy in 2021.\nHis condition means that he requires a mechanical ventilator every night, with a carer to watch over him overnight.\nIt also means that when he goes to school or nursery, he currently requires a nurse and a carer to accompany him every day.\nHis family said a so-called \"breathing pacemaker\" would control Beau's breathing, something Mr Kent said would be \"life changing\".\n\"He has no fear and is an incredible little boy. Beau is just Beau, and doesn't seem to care,\" he said.\nCCHS has reached its target of raising an initial £500,000 and will now look to apply for grants to continue funding the research.\nMr Kent was part of a team of runners who carried a lantern from Arundel town hall to Hove seafront on Wednesday in celebration of Rare Diseases Day, which was on Friday.\nHe added that the run, roughly a marathon distance, raised about £2,000 for the charity.", "url": "https://www.bbc.co.uk/news/articles/cy4vvjr107yo"}