{"authors": ["Zainab Ashraf", "www.facebook.com"], "date_download": "2025-04-26 07:37:24", "date_modify": "2025-04-26 07:37:24", "date_publish": "2025-02-27 14:22:28", "description": "It is the first time in five years that more businesses have been added to the ONS register than removed.", "filename": "news_articles_cewkkdn57yzo_1745653044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4537/live/23e25140-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cewkkdn57yzo_1745653044.html", "title": "More businesses opening than closing, stats show", "title_page": "More businesses opening than closing, stats show - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More businesses opened than closed in Scotland, an analysis of data from the Office of National Statistics (ONS) shows.\nIt is the first time in five years that more businesses were added to the ONS register than removed.\nThe UK government's official statistics body has data on more than 2.7 million businesses which pay VAT or PAYE, covering all but the smallest firms.\nAn analysis of the latest figures shows there were 18,025 business \"births\" and 17,655 business \"deaths\" in Scotland last year.\nHowever, separate ONS research found Scottish businesses were still worried about the impact of taxation, competition and falling demand for goods and services.\nKenny Richmond, head of insights and economics for Scottish Enterprise, told the BBC: \"It's a challenging global economic environment for businesses at the moment, but despite those challenges Scottish businesses are showing resilience and innovative spirit, with many actively looking to grow and scale.\"\nThe ONS data, external shows the same trend across the UK, however there had been a longer period of decline in Scotland.\nThe last time there were more businesses opening than closing in Scotland was 2019 as opposed to 2021 for the UK as a whole.\nLast year, across the UK a total of 306,995 new businesses opened and 297,760 closed.\nThe ONS data also breaks down the changes by industry across the UK.\nMost industries saw a decrease in business closures, with the biggest difference being 29.8% fewer transportation and storage firms closing.\nOnly three sectors had more closures than 2023.\nThey were the finance and insurance sector, which saw the biggest decline at 4.8%, agriculture, forestry and fishing, which was down 4.2%, and real estate, which saw a 3.2% decline.\nThe biggest increase in new businesses was the business administration and support services sector, which had a 43.8% rise compared with the year before.\nMeanwhile, the health and social care sector saw the biggest decrease in new businesses, down 11.8% in the same period.", "url": "https://www.bbc.co.uk/news/articles/cewkkdn57yzo"}