{"authors": ["Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 06:19:45", "date_modify": "2025-04-26 06:19:45", "date_publish": "2025-03-01 07:06:54", "description": "Harry Edmonds has set the record as the youngest competitor to complete the Global Race Series.", "filename": "news_articles_c3w115zvwv9o_1745648385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d211/live/600c9780-f5ad-11ef-a811-33641fc5bb1f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3w115zvwv9o_1745648385.html", "title": "Surrey: Man becomes youngest to complete the Global Race Series", "title_page": "Surrey: Man becomes youngest to complete the Global Race Series - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Surrey man who took part in extreme trail running races has set the record for becoming the youngest person to complete the series, as confirmed by the Global Race Series (GRS).\nGRS is organised by Beyond the Ultimate and \"tests the resilience and endurance of runners\" in remote areas such as the Amazon rainforest, the Namibian desert and the Tian Shan mountains in Kyrgyzstan.\nHarry Edmonds, from Guildford, has just returned from the final event, the Ice Ultra Challenge in Sweden, where racers trekked 230km (143 miles) in five days while battling temperatures as low as -40C.\nAlthough the 24-year-old did not win the \"brutal\" series, he said he gained \"invaluable experience and has become extra motivated\" for the next GRS.\n\"At first I was intimidated, being the youngest and having the least experience. But I am quite bold-headed and I charged into,\" he added.\n\"It was a very brutal competition, but the other competitors were so incredible. They helped me a lot and I grew so much over the last year.\"\nMr Edmonds said his father took up GRS 10 years ago and he decided to follow in his footsteps.\nWhen asked what motivated him to take up extreme sporting challenges, he said he \"just wanted to prove that I can do it\".\n\"I learnt something about myself from each competition I took part in,\" he added.\n\"If you commit yourself to something, even though it doesn't look possible to achieve, as long as you're dedicated nothing can stop you.\"", "url": "https://www.bbc.co.uk/news/articles/c3w115zvwv9o"}