{"authors": ["Hayley Clarke", "www.facebook.com"], "date_download": "2025-04-26 07:25:00", "date_modify": "2025-04-26 07:25:00", "date_publish": "2025-02-28 02:10:57", "description": "Education select committee calls for change \"without delay\", warning that pupils who should be fed free are missing out.", "filename": "news_articles_c2344p7nz05o_1745652300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee3c/live/a163ac70-f51f-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2344p7nz05o_1745652300.html", "title": "Auto-enrol eligible pupils for free school meals, say MPs", "title_page": "Auto-enrol eligible pupils for free school meals, say MPs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tens of thousands of children who are eligible for free school meals, but are not claiming them, should be automatically enrolled instead, MPs say.\nThe cross-party education committee says the government should change the current rules using a bill which is currently making its way through Parliament.\nThe education committee also accused the government of rushing the Children's Wellbeing and Schools Bill through the House of Commons \"at the expense of time for proper scrutiny\".\nA Department for Education (DfE) spokesperson said the government \"welcomed\" the engagement over the bill and said it would carefully consider the committee's recommendations.\nIn a new report, the education committee has told the government it should use the bill to remove the requirement to apply for free school meals for eligible children from low-income families.\nIn England, families are eligible to apply for free school meals, external if they are on universal credit and have a household income below £7,400 per year, after tax, alongside other benefits.\nThe total number of children registered for free school meals in England is about 2.1 million, or 24.6% of the total pupil population.\nHowever, an estimated one in 10 eligible children miss out on the meals, according to experts who gave evidence to MPs scrutinising the bill.\nKate Antsey, of the Child Poverty Action Group, told MPs, external that it was often because of language barriers or difficulty with the administrative process experienced by their parents.\nAnother estimate published, external in April 2024 by the think tank Policy in Practice put the number of children needlessly missing out on free school meals at 471,000.\nThe cross-party education committee said the government should change the current rules using the Children's Wellbeing and Schools Bill - which is currently making its way through Parliament - to remove the need for manual enrolment.\nFailing to address the issue would be a \"missed opportunity\" to feed hungry children at school, the report, external concluded.\nIt added that low uptake of free school meals contributes to hunger at school for children living with deprivation.\nThe MPs also accused the government of rushing the bill through the House of Commons \"at the expense of time for proper scrutiny\".\nEducation Secretary Bridget Phillipson has called it a \"landmark\" bill to \"seek to keep children safe\".\nIt includes plans for all children to have a unique identifier number, a bit like a National Insurance number, for safeguarding purposes.\nIt also includes other wide-ranging proposals, such as universal free breakfast clubs in all primary schools, and changes to academy schools' powers.\nSome of its proposals - particularly around academies - have been criticised, including by Conservative leader Kemi Badenoch, who called it educational \"vandalism\".\nPaul Whiteman, general secretary at school leaders' union NAHT, agreed with the committee's calls for auto-enrolment for free school meals, adding: \"Too often social stigma means parents do not register.\n\"Crucially, enrolment for free school meals also unlocks pupil premium money for pupils, so without registration they also miss out on this vital additional support.\"\nCampaigners say automatic enrolment would also bring in millions in extra funding for schools via pupil premium grants.\nThe government pays schools £1,455 per primary pupil on free school meals or £1,035 per secondary pupil, per year, for at least six years.\nOther recommendations in the report include ensuring that children with special educational needs and disabilities can access universal free breakfast clubs, strengthening the access of children in care to mental health support, and developing a national care offer.\nEducation committee chairwoman Helen Hayes said: \"The committee has made recommendations designed to strengthen support for the most vulnerable children in society, based on compelling evidence from experts and from young people who shared with us their deeply moving experiences of life in care.\"\nThe committee called on the government to develop a consistent national offer for care leavers across the country, to support vulnerable young people with things like transport costs and access to apprenticeships.\nThe DfE said the \"landmark\" schools bill would break the \"unfair link between background and opportunity\".\n\"Despite the challenging inherited fiscal context, we are introducing landmark measures to support family finances, including rolling out free breakfast clubs in every primary school and capping the number of branded uniform items parents have to pay for, as well as prioritising reform across children's social care.\"", "url": "https://www.bbc.co.uk/news/articles/c2344p7nz05o"}