{"authors": ["Julian O'Neill", "www.facebook.com"], "date_download": "2025-05-19 15:32:12", "date_modify": "2025-05-19 15:32:12", "date_publish": "2015-03-03 12:55:30", "description": "An economic report for the executive says there is not a strong enough case for abolishing a £13 tax on the majority of flights out of Northern Ireland.", "filename": "news_uk-northern-ireland-31705710_1747668732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/53457000/jpg/_53457709_010508642-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31705710_1747668732.html", "title": "Case not strong enough for abolishing £13 air passenger duty", "title_page": "Case not strong enough for abolishing £13 air passenger duty - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is not a strong enough case for abolishing a £13 tax on the majority of flights out of Northern Ireland, an economic report for Stormont has said.\nRemoving air passenger duty (APD) is seen by airports and airlines as key to attracting new routes and tourists.\nBut the report, prepared for the Northern Ireland Executive, considers the move too costly.\nIt said removing APD would mean a reduction of at least £55m in Northern Ireland's block grant from Westminster.\nThis would cover the loss to the Treasury of revenue it collects from APD on flights locally.\n\"A strong case for change has not been made,\" the report's authors state.\nNorthern Ireland has already scrapped APD on long-haul flights - a move which saved the New York service and has cost more than £2m so far.\nInstead of a go-it-alone move on APD, the executive is looking into financial help for airlines to operate new routes to the likes of Canada, Turkey and Germany.\nAid would cover 50% of landing charges.\n\"The Department of Enterprise may wish to consider a more direct targeted intervention,\" the report concludes.\nNorthern Ireland's three airports have explored accessing a £20m fund set up by the Chancellor George Osborne to help regional airports throughout the UK.\nShould applications be unsuccessful, the executive may look at its own version.\nIn 2007, a local £4m air route development fund helped to attract nine new routes, including New York.\nFrom this May, the chancellor has announced that APD will not apply to children under 12.\nBelfast International Airport Managing Director Graham Keddie said he was disappointed following the release of the report.\n\"We know there are airlines with available aircraft who will move swiftly to grow our network of direct air services, offering highly attractive fares to encourage international visitors to experience Northern Ireland,\" he said.\n\"However the continued application of APD is the most visible deterrent to securing their commitment and, while APD in Northern Ireland persists, they will choose more lucrative opportunities elsewhere.\"", "url": "https://www.bbc.com/news/uk-northern-ireland-31705710"}