{"authors": ["Katy Prickett", "www.facebook.com"], "date_download": "2025-04-26 03:59:55", "date_modify": "2025-04-26 03:59:55", "date_publish": "2025-03-04 05:34:44", "description": "A council says despite a road project being cancelled, it will not have to repay central government.", "filename": "news_articles_cvg17yk03geo_1745639995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8e93/live/b29356f0-f874-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg17yk03geo_1745639995.html", "title": "DfT 'will not ask' for £33m Norwich link road funds", "title_page": "DfT 'will not ask' for £33m Norwich link road funds - council - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The government \"will not ask\" for the return of £33m funding it granted towards a £274m road plan which has since dropped, according to a council.\nNorfolk County Council withdrew its planning application for the Norwich Western Link in January, because of concerns about its impact on rare bats.\nThe Conservative-run authority has spent £56m on the project near Norwich, which included the government funds. Opposition groups warned this could leave it with a large hole in its finances.\nGraham Plant, cabinet member for transport, said the council had now had \"really constructive\" discussions with the Department for Transport (DfT), which said it was \"committed to improving transport across Norwich\".\nThe DfT confirmed the council would not need to repay the £33m, but it expected to be provided with proposals for \"alternative solutions to the Norwich Western Link to relieve congestion on local roads\".\nThe 3.9-mile (6.2km) Norwich Western Link would connect the Northern Distributor Road to the A47 west of the city, and had been in the works for years.\n\"There is a mutual commitment to continue to work together to tackle the growing transport and traffic problems to the west of Norwich, which are projected to worsen with planned housing and employment growth in and around the city,\" said Plant.\n\"As a result of these discussions, DfT have confirmed that they will not ask for the £33m they have already committed to the project to be returned.\"\nThe council said the Western Link would have cut traffic congestion, reduce journey times and improve air quality in communities.\nBut new Natural England rules protecting rare barbastelle bats meant a licence was unlikely to be granted.\nMeanwhile, millions of pounds had already been spent on the project, including buying land, as well as staff and consultants' costs.\nPlant said discussions with the DfT continued and the council hoped \"to be able to provide a further update on the outcome of these discussions shortly, including regarding the future of the project and the next steps\".", "url": "https://www.bbc.co.uk/news/articles/cvg17yk03geo"}