{"authors": ["Chloe Parkman", "www.facebook.com"], "date_download": "2025-04-26 08:14:44", "date_modify": "2025-04-26 08:14:44", "date_publish": "2025-02-26 11:06:51", "description": "Ministers say efforts to tackle PFAS in the island's water will be guided by scientific evidence.", "filename": "news_articles_cj0q2z24mjno_1745655284.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/81f5/live/3e103b80-f410-11ef-a76f-edb5ccbf9ece.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj0q2z24mjno_1745655284.html", "title": "Jersey government 'committed' to safety of water supply", "title_page": "Jersey government 'committed' to safety of water supply - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ministers have promised to act on a petition which called for better healthcare for people who were exposed to a chemical used in firefighting foam at Jersey Airport.\nBoth the environment minister and health minister said all actions used to tackle PFAS in the island's water will be guided by scientific evidence.\nIn the early 1990s the foam was used on the airport fire training ground and leaked into the neighbouring area and private borehole water supplies.\nA spokesperson for Jersey Water said it was committed to playing a key role in implementing solutions to treat PFAS.\nMore than 1,200 people signed a petition, external to \"clean Jersey's water, build a treatment plant and improve PFAS-related healthcare\".\nThe petition said the island's water was \"contaminated with many types of PFAS and nitrates posing risks to health\" and called for a new treatment plant.\nEnvironment Minister Deputy Steve Luce said the government was \"committed to ensuring the safety and quality\" of the water supply and protecting public health.\n\"I am acutely aware of the challenges posed by PFAS contamination and the potential health risks it presents,\" he said.\nLuce said Jersey Water's 2024 report demonstrated 100% compliance with current UK and EU regulatory standards for PFAS.\n\"We are working towards introducing a specific regulatory requirement for Jersey to meet even stricter standards,\" he added.\n\"I recognise the need for advanced treatment solutions to address PFAS contamination.\"\nLuce said models similar to Australia's $30m treatment plant in Katherine were being considered as a solution.\nHe said Jersey Water had undertaken \"significant work\" to review options, adding it was \"committed\" to implementing treatment technology to reduce PFAS and nitrates in the island's water.\n\"I am confident that when I bring forward a Jersey regulatory standard for PFAS later this year, Jersey Water will be in an advanced position to implement treatment in their two water plants,\" he said.\nA spokesperson for Jersey Water said it was focused on the \"critical need\" to address the risks posed by PFAS pollution on the island and they were working closely with the government.\nThey added: \"Our focus is on investigating and selecting the right treatment solution for Jersey, based on the most up-to-date scientific evidence, global best practices, and compliance with the future regulatory limits the government sets for the island.\"", "url": "https://www.bbc.co.uk/news/articles/cj0q2z24mjno"}