{"authors": ["Julia Gregory", "www.facebook.com"], "date_download": "2025-04-26 03:49:45", "date_modify": "2025-04-26 03:49:45", "date_publish": "2025-03-05 13:22:39", "description": "The States of Guernsey asks residents not to feed the animal as it could delay efforts to catch it.", "filename": "news_articles_cm2jzqdg26vo_1745639385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dcb3/live/c6342a10-f9bc-11ef-bed1-9da6d7f95712.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzqdg26vo_1745639385.html", "title": "No new sightings in hunt for invasive squirrel", "title_page": "No new sightings in hunt for invasive squirrel in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The hunt is still on for an invasive stowaway grey squirrel that ended up in Guernsey, with no sightings for nearly a week, the island's government has said.\nThe States said \"efforts are ongoing to try and retrieve\" the squirrel alive in humane trap.\nIt was first spotted in February and is thought to have travelled to the island \"via a vehicle\".\nResidents were asked not to put out food for the non-native squirrel, named Elvis, as it would delay efforts to capture it and \"safely return it to a more familiar environment in the company of its own species\".\nGrey squirrels spread rapidly in the UK after they were introduced in the 19th Century, external, but Guernsey does not have an established population of the species.\nThe States confirmed it had been in touch with a squirrel sanctuary in the UK which is willing to give it a home and other animal rescue organisations have also offered support.\n\"It is looking hopeful that it might be able to be safely returned to a more suitable environment,\" the States said, confirming there had been no sightings since Friday.\nAnyone who spots the squirrel was asked not to approach it as this could scare Elvis away.\nThe States asked them to contact Guernsey Pest Management instead.", "url": "https://www.bbc.co.uk/news/articles/cm2jzqdg26vo"}