{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:38:41", "date_modify": "2025-04-26 03:38:41", "date_publish": "2025-03-04 22:44:58", "description": "The warning is contained in a report by public agency Highlands and Islands Enterprise.", "filename": "news_articles_c9vyrmv73r3o_1745638721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ce0a/live/35c7ea90-f8e8-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vyrmv73r3o_1745638721.html", "title": "HIE report shows business confidence in economy lowest since 2022", "title_page": "HIE report shows business confidence in economy lowest since 2022 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Confidence in the economy among some Scottish businesses is at its lowest level in two years, according to a Highlands and Islands Enterprise (HIE) report.\nThe Scottish government agency surveyed 1,013 firms in its area, which includes Highland, Moray, Argyll and Bute, Northern Isles and Western Isles.\nOver the past six months, most said they had performed well or had been fairly steady but more than a quarter reported that they had struggled.\nThe report, external suggested 55% were not confident in the economic outlook for Scotland, the lowest since a figure of 58% in a similar survey carried out over October and November 2022.\nHIE said the biggest challenges facing businesses were economic uncertainty, costs around doing business, legislation and regulation and access to skilled labour.\nJust under half of employers said they did not have enough people or skills, with temporary or seasonal roles more challenging to fill than permanent positions.\nOther findings from the survey included the fact that most businesses were investing in their workforce, including through offers of training, flexible working and making pay more competitive.", "url": "https://www.bbc.co.uk/news/articles/c9vyrmv73r3o"}