{"authors": ["Harriet Heywood", "Neve Gordon-Farleigh", "www.facebook.com"], "date_download": "2025-04-26 06:20:46", "date_modify": "2025-04-26 06:20:46", "date_publish": "2025-03-01 06:29:01", "description": "\"The agricultural industry needs the young people,\" says the 24-year-old shepherdess, Hannah Murrell.", "filename": "news_articles_c8711p998lvo_1745648446.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c20/live/8aaba530-f4fe-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8711p998lvo_1745648446.html", "title": "Norfolk shepherdess encouraging young people to join profession", "title_page": "Norfolk shepherdess encouraging young people to join profession - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hannah Murrell says many people are surprised to learn she looks after a flock of 400 sheep.\n\"You wouldn't expect little old me to do a job like this,\" says the 24-year-old, who comes from a farming family.\nShe recently took her first role as a shepardess at the Gawdy Hall Estate in Harleston, Norfolk.\nWorking seven days a week and almost 24 hours a day during lambing season, Hannah says working with livestock is \"not for everyone\" but is something she puts her \"heart and soul\" into.\nBefore joining Gawdy Hall in October, Hannah worked with her family's cattle at Pulham Herefords in South Norfolk.\nHer grandad was a pig farmer, her parents have nine hand-reared cows and her sister, Lizzie, is a pig farmer.\n\"You don't meet many shepherdesses in Norfolk because it's not really sheep country,\" Hannah said.\n\"There are more of us in the north of England but it's still very much a male-dominated profession.\"\nWith family and friends working in agriculture, she \"couldn't imagine doing anything else,\" and despite the hours \"didn't miss out out on much\" in terms of a social life.\n\"We [Hannah and her partner] do live a normal life... apart from lambing time\".", "url": "https://www.bbc.co.uk/news/articles/c8711p998lvo"}