{"authors": ["Katy Scott", "www.facebook.com"], "date_download": "2025-04-26 07:49:09", "date_modify": "2025-04-26 07:49:09", "date_publish": "2025-02-26 22:45:17", "description": "The school allows pupils to take less subjects in exchange for sports coaching during school hours.", "filename": "news_articles_clyn924d9gro_1745653749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b82e/live/cd7a1150-f443-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyn924d9gro_1745653749.html", "title": "Pupils fear being 'abandoned' if Glasgow sport school closes", "title_page": "Pupils fear being 'abandoned' if Glasgow sport school closes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pupils at a closure threatened school dedicated to sporting excellence fear they may be \"abandoned\" if it fails to secure financial support.\nGlasgow School of Sport, based at Bellahouston Academy, allows pupils to take fewer subjects in exchange for sports coaching during school hours.\nA council report said that it could be replaced by a bursary scheme in June 2026, and pupils would shift to \"excellence programmes\" delivered by the governing bodies of each sport.\nThe school's future was to be decided at a meeting of the local authority's city administration committee, but it has been delayed in order to clarify the report.\nThe school opened in 1998 and the 65 pupils who attend it specialise in one of five sports - athletics, badminton, gymnastics, hockey and swimming - with dedicated coaching taking place alongside regular academic classes.\nMichelle Junnor, whose son Charlie specialises in badminton, said she found out about the decision online.\n\"It's horrendous because there's been no notice and we've not been consulted on this,\" she said.\n\"If this is something so significant that it will affect our children's education and their sporting career, they could have at least been open with us.\n\"They're making these kids feel like they don't matter.\"\nCharlie is in S3 and he has dropped two subjects in order to include badminton training as part of his timetable.\n\"He's in a position now where he contemplating having to leave school at the end of S4,\" said Ms Junnor. \"There's almost a bit of panic in it.\n\"That would be half of his training hours a week gone and we don't know how to fill that gap. He's already training at night and the weekend.\n\"And how will the school fill his day when he's dropped 10 hours off his timetable and he's not studied some of these subjects for over two years?\"\nCharlie said it would feel like the school was \"abandoning\" him if it closed.\n\"The school has produced quite good athletes and it's the only one in Scotland,\" he said.\n\"It would be quite stupid to close it down. I think it would affect good junior athletes in the country.\n\"It's in my head that I might not have this next year and it could affect me in my future.\"\nA freeze on new pupils was introduced in 2024, due to the city council and Glasgow Life seeking funding support for the school.\nCouncil papers, external state that although 62% of the school's pupils come from outside Glasgow, \"both the Scottish government and local authorities indicated they were not able to provide financial support\".\nAs a result, the report found \"this equates to Glasgow spending circa £380k on the education of non-Glasgow pupils each school session\".\nMs Junnor, who lives in Renfrewshire, fears a new bursary scheme will only apply to Glasgow-based pupils.\nShe added: \"It seems to be a postcode lottery which is a real shame because these kids don't play for their local council, they play for Scotland.\n\"It seems like if you're not from the Glasgow area, you can attend the school but you're on your own. There's no coaching, no physio, no anything.\"\nShe also said it was \"ignorant\" to suggest Badminton Scotland could take on the cost of funding a similar programme.\nClare Martin, whose son Alfie also plays badminton at the school, said parents were told that the school was examining the effectiveness of the school's structure last year.\n\"But they held all the information back about how serious it was,\" she said. \"And nobody ever mentioned that it would be getting closed.\"\nShe said such a move would be \"devastating\" for Alfie, who has been tipped as a future Commonwealth or Olympian athlete.\n\"Glasgow Council has decided to host the next Commonwealth Games and they're wanting to shut the School of Sport down in the same year,\" she added. \"It's not a good look.\"\nShe said parents had written to the school but so far they had heard nothing back.\n\"It would mean Alfie might need to move to a school in East Kilbride that he's never been to,\" she added. \"He's worried about his future.\n\"Everybody is very angry that we haven't been given the full information and we're unsure about what's going to happen next.\"\nFormer pupils at the school include swimmer Michael Jamieson, an Olympic and Commonwealth Games silver medallist, and badminton player Kirsty Gilmour.\nMs Gilmour said the school gave her \"the perfect balance of getting my education while really having that focus on sport\".\n\"Being able to do sport and school at the same time was so good,\" she said.\n\"And the fact it was free and just a normal public school was so valuable.\n\"It's really sad that kids aren't going to get that same opportunity. I hope there's something that can happen to boost them.\n\"It was absolutely crucial for me and I don't know if I would have stood in as good stead going into senior badminton without the School of Sport.\"\nA Glasgow Life spokesperson said: \"The current School of Sport model was introduced more than 25 years ago and was designed to meet the needs of pupils from across Scotland at the time.\n\"Since then, national funding for governing bodies of sport has improved the support they offer prospective athletes considerably, offering multiple pathways to elite sports competition.\n\"In considering whether Glasgow School of Sport offers the appropriate model in the wider national context, we have also proposed a new way to support young athletes from Glasgow to achieve their full potential.\"", "url": "https://www.bbc.co.uk/news/articles/clyn924d9gro"}