{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:33", "date_modify": "2025-05-19 15:31:33", "date_publish": "2015-02-20 14:01:14", "description": "Plans to radically restructure the county council and make cuts of £68m in Northamptonshire are condemned as a \"muddled vision\".", "filename": "news_uk-england-northamptonshire-31552423_1747668693.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/72938000/jpg/_72938363_52226895.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-northamptonshire-31552423_1747668693.html", "title": "Northamptonshire council outsourcing plan condemned as 'muddled vision'", "title_page": "Northamptonshire council outsourcing plan condemned as 'muddled vision' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plans to radically restructure the county council and make cuts of £68m in Northamptonshire have been condemned by the opposition as a \"muddled vision\".\nTory plans to set up four outside bodies to run services and cut 4,000 staff to 150 were approved on Thursday.\nLib Dem Chris Lofts dismissed the \"Next Generation Model\" as a \"muddled vision\" rushed through at the last minute.\nLabour spokesman Mick Scrimshaw said council services should be public and private provision was not always best.\nThe four new specialist social enterprises were to provide child protection, care of vulnerable adults, health and well-being services and economic development.\nMr Scrimshaw said the plan was driven by dogma as the ruling Conservative administration naturally believed small government and private enterprise were always best.\n\"But how can people hold these bodies to account - that's the issue,\" he said.\n\"And they have not yet explained how they plan to achieve all this.\"\nMr Lofts said he was also concerned because he believed it was not a plan but a \"muddled vision\" with no real detail of savings.\nThey were living on hopes and keeping their fingers crossed, he said.\nFellow Lib Dem Sally Beardsworth said the Conservatives were \"hell bent\" on pushing through ideas that were at best \"embryonic\" and the administration did not have a good record on innovation.\nPlans to transfer the housing stock to a tenants association had taken much longer than planned, she said.\n\"They are facing a steep hill and cannot afford mistakes because there's no money.\"\nCouncil leader Jim Harker said traditional methods \"not only no longer work financially, but also do not meet the needs of citizens\".\nHe said the changes would be the biggest seen by the council in its 125 year history.", "url": "https://www.bbc.com/news/uk-england-northamptonshire-31552423"}