{"authors": ["Nick Triggle and Hannah Karpel", "www.facebook.com"], "date_download": "2025-04-26 03:38:09", "date_modify": "2025-04-26 03:38:09", "date_publish": "2025-03-05 01:48:19", "description": "The Royal College of Psychiatrists worries children and young people will be put at risk, as demand rises.", "filename": "news_articles_c3rn998ydl2o_1745638689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4125/live/f2c89e20-f918-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rn998ydl2o_1745638689.html", "title": "Most areas in England to cut eating-disorder help for under-18s", "title_page": "Most areas in England to cut eating-disorder help for under-18s - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Most areas in England are planning cuts to specialist eating-disorder services for children and young people this year, an analysis shows.\nOf the nation's 42 NHS integrated care boards, 24 are due to reduce spending for under-18s in 2024-25, once inflation is taken into account.\nOverall spending is due to go up by 2.9%, with budgets rising in the other areas, but the Royal College of Psychiatrists (RCPsych), which carried out the analysis, said this was too little to cope with increased in demand.\nNHS England said improving care was \"vital\" and more action was being taken in the community to support young people before their condition became a crisis.\nVeronika, 20, has been struggling with an eating disorder for five years.\n\"Shrugged off\" by services in the past, she says cuts could be \"catastrophic\" for people like her.\n\"It will have a knock-on impact and people won't want to seek help even from their GP, even for physical-health monitoring,\" Veronika says.\n\"It will just spiral on and on.\n\"It is horrible living day in and day out with it.\n\"And if you are not seen quick enough, I know myself how quickly things can spiral in a matter of weeks or days.\n\"It is going to be tragic for some and just long and horrible for others\".\nEating-disorder services cover a range of different support, from therapy and counselling to crisis support and hospital treatment.\nBut they were already underfunded, the RCPsych said, and it had had to ration care to the under-18s most affected.\nLast year, referrals went up by 13%.\nBy the end of 2024, more than 6,000 under-18s were on waiting lists.\nAnd targets for routine and urgent waits are not currently being met.", "url": "https://www.bbc.co.uk/news/articles/c3rn998ydl2o"}