{"authors": ["Andrew Rogers and Tom Richardson", "www.facebook.com"], "date_download": "2025-04-26 04:38:02", "date_modify": "2025-04-26 04:38:02", "date_publish": "2025-02-28 10:45:48", "description": "The Monster Hunter series exploded in popularity globally after years of success in Japan. How did they do it?", "filename": "news_articles_cy877gydn48o_1745642282.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/78c7/live/d194a7b0-f5b9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy877gydn48o_1745642282.html", "title": "Monster Hunter Wilds: How the series conquered the world", "title_page": "Monster Hunter Wilds: How the series conquered the world - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The latest release in one of Japan's most popular video game series has had one of the most successful debuts of all time.\nMore than one million players have logged on to the PC version of Monster Hunter Wilds within hours of its launch, according to figures from online store Steam.\nThere have been complaints from the first wave of players on Steam about the game's performance on computers, but its critical response has been positive.\nBBC Newsbeat spoke to director Yuya Tokuda and producer Ryozo Tsujimoto prior to the release of Wilds about turning the game into a global hit.\nMonster Hunter first launched on the PlayStation 2 in 2004.\nAs the title suggests, players spend the game navigating an area known as The Forbidden Lands capturing and battling a cast of increasingly fearsome beasts.\nLong-time fans of the series are drawn in by its challenging, complex systems and option to play co-operatively, teaming up with friends to take down massive foes.\nBreakout 2018 hit Monster Hunter World has has sold 21.3 million copies, according to publisher Capcom, rising to 28.1 million when sales of an upgraded 2019 edition are included.\nProducer Mr Tsujimoto told BBC Newsbeat the game was a culmination of all the work and lessons learned from previous titles on the series.\n\"Anything that we hadn't been doing we really tried to do with Monster Hunter World to get everything ready so that the game was ready to break through,\" he said.\nGames industry layoffs and studio closures in the West and Europe have led to fears of \"brain drain\" - a loss of knowledge as people leave companies or even look for work in different fields.\nJapan, where employment protections for workers are much stronger, has not been as badly affected and developers often stay with the same company for a long time.\nMonster Hunter director Mr Tokuda says he's worked on the series for 20 years and it's fed into his work on Wilds.\n\"It's the groundwork that you create with your previous titles that you hope can inform the success of later ones,\" he says.\n\"We have the ability to take data from past titles like Monster Hunter World and analyse that data in order to understand what players were enjoying and what we could improve.\"\nOther Japanese studios are known for taking this iterative approach and building on what has come before.\nRyu Ga Gotoku Studio, the makers of the popular Yakuza series and its Like a Dragon spin-offs, have put out a new game more or less every year since 2020.\nThe company's boss Masayoshi Yokoyama has spoken openly about how the team is happy to revisit previous locations and reuse elements from earlier games rather doing a \"fresh reboot\" each time.\nThis can help to lower development costs and reduce the time it takes to make new titles.\nThe Japanese games industry was a dominant force from the 1980s until the early 2000s, but a power shift saw Western developers begin to lead the way.\nMore recently, the country has been behind some of the most critically acclaimed and commercially successful titles released.\nAt last year's Game Awards - described by some as the industry's answer to The Oscars - Japanese-made games occupied four of the six Game of the Year nominations.\nMr Tsujimoto says he can't pinpoint a specific reason for this, but says the Monster Hunter team has learned there are certain things needed to make a \"triple-A success in today's market\".\nThat includes translating games into various languages so they can be released simultaneously in different countries, and being mindful of growing your audience.\n\"We're always careful to design the experience so new players can get into the game,\" he adds.\nJapan does face some of the same challenges as other developers worldwide.\nPlayer habits are changing, with PC gaming increasing in popularity, and as technology becomes more advanced making games becomes more expensive.\nMr Tsujimoto says generational leaps \"push the industry forward\", bringing \"new opportunities and new complexities\".\n\"I don't think it's necessarily the most difficult it's ever been but there are always new challenges whenever technology leaps forward.\"\nThe games industry is also more competitive than ever - more video games are being released, and players are tending to stick with the same ones for longer periods.\nIt leaves publishers of new releases fighting over a much smaller share of players' free time and 2025 has already been packed with big new releases.\nMr Tsujimoto insists they haven't paid too much attention to that while working on Monster Hunter Wilds.\n\"It looks like a big year for everyone but we're really all just working in our own lanes,\" he says.\n\"We happened to have this launch window that's on the verge of some other big releases but we don't have access to that information before the general public.\"\nFor an established series that suddenly explodes in popularity, Mr Tokuda says a big challenge is pleasing old and new fans.\n\"You always have in your mind that there's people waiting for your next creation and they're the players you want to satisfy,\" he says.\n\"But you also have your own creative idea and want to follow that through.\"", "url": "https://www.bbc.co.uk/news/articles/cy877gydn48o"}