{"authors": ["Alex McIntyre", "Liz Copper", "www.facebook.com"], "date_download": "2025-04-26 08:09:24", "date_modify": "2025-04-26 08:09:24", "date_publish": "2025-02-26 13:17:08", "description": "Louis Watkiss died in September 2021 while at a tobogganing party with friends.", "filename": "news_articles_cvg1evlkr8jo_1745654964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/255a/live/f3eae7f0-f43f-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1evlkr8jo_1745654964.html", "title": "Tamworth SnowDome fined £100k over Louis Watkiss death", "title_page": "Tamworth SnowDome fined £100k over Louis Watkiss death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An indoor ski centre has been fined £100,000 following the death of a 12-year-old boy.\nLouis Watkiss, from Sutton Coldfield, died at the SnowDome in Tamworth, Staffordshire, on 24 September 2021 during a tobogganing party with friends, after he was injured in a collision with a member of staff.\nFollowing an investigation, the Health and Safety Executive (HSE) charged SnowDome Limited with breaching health and safety regulations.\nThe firm pleaded guilty and was sentenced at a hearing at Telford Magistrates' Court on Wednesday.\nIt was also ordered to pay a victim surcharge of £2,000 and costs of £14,534.20.\nSpeaking outside court, Louis' father Chris Watkiss described the fine as \"ridiculous\" and said it was not appropriate when relating to a child's death.\nHe said the justice system was \"flawed in so many ways and I think that's just been demonstrated today\".\nMother Natalie Watkiss said Louis left behind an eight-year-old sibling who \"cannot understand what on earth has happened to his brother\".\n\"However we will stand strong and ensure Louis' memory will not be forgotten,\" she said.\nThe HSE said Louis was descending the main ski slope on a toboggan when it slid into the back of a member of staff who was conducting a slope walk.\nThe staff member fell backwards onto Louis, who died at the scene from head injuries, the HSE said.\nA joint investigation with Staffordshire Police found SnowDome Limited had failed to ensure the safety of its customers tobogganing at the venue.\nIt also found there was not a sufficient risk assessment for tobogganing activities, and that the firm had not \"fully considered all persons likely to be on the slope during tobogganing\".\nNathan Cook, senior enforcement lawyer for HSE, said: \"Louis' death could have been prevented if the company had adequately assessed and controlled the risks associated with tobogganing activities.\"\nHe said the case should act as a reminder for venues to make sure suitable risk assessments are in place.", "url": "https://www.bbc.co.uk/news/articles/cvg1evlkr8jo"}