{"authors": ["Sam Francis", "www.facebook.com"], "date_download": "2025-04-26 06:51:38", "date_modify": "2025-04-26 06:51:38", "date_publish": "2025-02-28 17:46:36", "description": "Dominic Grieve is to lead a new working group, following a rise in incidents of anti-Muslim hatred.", "filename": "news_articles_cn9v1lzwqn7o_1745650298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b62a/live/a75c78f0-f5f6-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn9v1lzwqn7o_1745650298.html", "title": "Ex-Tory minister to lead review of Islamophobia definition", "title_page": "Ex-Tory minister to lead review of Islamophobia definition - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The government has appointed former Conservative Attorney General Dominic Grieve to lead a review into creating a new definition of Islamophobia.\nDeputy Prime Minister Angela Rayner launched a new working group tasked with understanding and defining hate crime targeted against Muslims.\nLabour had promised a new definition, after the last Tory government rejected a cross-party proposal in 2019.\nCritics warned the current definition is too broad and could curb free speech.\nGrieve, who served as Tory MP from 1997 to 2019, said he hoped the review would \"help support positive change in our country\".\nGrieve said: \"We know Islamophobia is as challenging to define as its existence is undoubted.\n\"We need to balance addressing the lived experience of those who are victims of it and the right of British Muslims to feel heard and protected as equal citizens of our country, with the unwavering requirement to maintain freedom of thought and expression under law for all.\n\"I am hopeful that this commission will come up with principles in defining Islamophobia which are compatible with those requirements and can thus help support positive change in our country.\"\nAny proposed definition will be non-statutory but will guide the government and others on discrimination against Muslims.\nThe All-Party Parliamentary Group on British Muslims proposed a new definition of Islamophobia in 2019.\nThe government, led by former Prime Minister Theresa May, said the suggested definition had \"not been broadly accepted\" and the matter needed \"further careful consideration\".\nThe issue has been picked up by the Labour government following a rise in reported incidents of anti-Muslim hate crime in England and Wales.\nAnti-Muslim hate in the UK surged to record levels last year, according to Tell Mama - which tracks Islamophobia.\nTell Mama confirmed almost 6,000 reports of anti-Muslim incidents - more than double the number two years ago.\nMen were targeted more than women for the first time since the body was founded in 2012.\nIn its report,, external the organisation said there had been a \"surge in rhetoric that falsely portrays Muslims as terrorists or terrorist sympathisers\" following the Israel-Gaza conflict and Southport murders.", "url": "https://www.bbc.co.uk/news/articles/cn9v1lzwqn7o"}