{"authors": ["Dominic Casciani", "www.facebook.com"], "date_download": "2025-04-26 06:24:26", "date_modify": "2025-04-26 06:24:26", "date_publish": "2025-03-01 00:08:46", "description": "Yvette Cooper visits the French coast to see how authorities are tackling people smuggling gangs.", "filename": "news_articles_c39vjnpxy1wo_1745648666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22bf/live/1f3f9d20-f61a-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vjnpxy1wo_1745648666.html", "title": "Can the tide turn on the English Channel migrant boat crossings?", "title_page": "Can the tide turn on the English Channel migrant boat crossings? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On France's northern coast, they call the people smuggling and dangerous dinghies phenomenon, La Crise Migratoire.\nBut do the UK and France now have a chance of consigning the small boats to history?\nSomewhat eclipsed by events this week in Washington, Yvette Cooper became the first British home secretary in five years to go to the French coast to see for herself how £540m of British taxpayers' money is being used to tackle people smuggling gangs.\nShe was the guest of her French counterpart, interior minister Bruno Retailleau.\nThe fact that he invited his British opposite number to the frontline of a deeply sensitive problem for both countries speaks volumes.\nRather than slinging English Channel mud at each other, this diplomatic rapprochement began with a warm embrace in the cold morning air of Le Touquet airport - and ended with both feeling they may be on the verge of breakthroughs.\nIn the first seven weeks of this year, successful crossings have been down by 41% on the same period of 2024. As the weather improves, both governments know that could be reversed.\nThe optimism comes not from the daily statistics, but what the French and British believe is an increasingly slick coastal operation that may be making it harder for people smugglers to offer crossings to migrants making their way to the coast.\nThe Conservatives maintain there is no real deterrent to come to the Channel - because the government cancelled the deeply controversial Rwanda plan. And everyone who works with refugees says that people in genuine need of protection will have to turn to smugglers until the UK comes up with safe routes for them.\nThe roots of the feeling that things could now change were planted in the 2018 Sandhurst Treaty, signed when the Conservative's Theresa May was prime minister.\nThe UK promised that year to fund coastal security operations against smugglers and this year Paris will receive around £172m. Tough negotiations are continuing over what happens from 2027.\nOn Thursday, Cooper saw what that cash is buying: boots on the ground and an awful lot of kit and technology.\nThe French have 1,200 security personnel deployable daily on coastal smuggler operations. Some 730 of them are paid for by the British.\nAt the local headquarters of the Gendarmerie Nationale, the military police teams now wear a Nato-like \"Mission Small Boat\" sleeve badge.\nThey put on a good show for their British visitors - and told some grim stories of shoreline violence and rescues - but the real action is beyond the parade ground.\nFrench pilots are now in the air most days, using thermal cameras to spot migrants in the dunes.\nDrones move rapidly over wild coastline, providing pictures back to small mobile units of officers in military-grade beach buggies.\nAll of this kit and other tools aim to stop three things from coming together: migrants, the flimsy dinghies and the low-powered engines to power a crossing.\nThe engines and low-grade vessels are brought at speed in vans from up to four hours away in Germany. The migrants meet the gear, assemble it and put to sea in minutes.\nThe French say their teams have become more adept at reaching dinghies and destroying them in the dunes, but the migrants try to repel the police with missiles until they've launched.\nThis places the French police in a bind: They are trying to save lives. They cannot shoot people just because they are desperate.\nSo this is a daily race. But here's why both sides think things may move their way.\nThe average number of migrants per boat is now often up to 100 people.\nThe cramming suggests the gangs are moving to fewer launches because that's easier to evade detection.\nLaunch locations began to include estuaries a staggering 60km away from the Dover Strait - so the police countered with barrages and dams - and now they're gathering intelligence from train stations about how the migrants are moving around the region.\nSo the gangs changed again and are now opting for \"taxi boats\".\nQuite simply, one or two migrants get the craft quietly into the water and then pick up others as they wait offshore in the surf.\nIt's pictures of these craft struggling to get out of the waves on the Pas de Calais' beautiful and wild beaches that have enraged the French as much as the British and led many to ask why the police don't just stop them.\nFrance's relatively new interior minister told me this week he now wants to change complex maritime rules to allow his land-based units to intercept these taxi-boats as they sit in shallow waters. This is what the British have asked the French to do for years.\nHe is also proposing a new offence of illegal residence - but beach push-backs could be the game changer: no boats means no business - and that means no profit.\nAll of that is a big if - but it is not the only tactic now potentially bearing down on the gangs.\nThe UK's National Crime Agency understands better than before how gangs bring the boats and engines from Germany to France.\nIf the intelligence on these vans can get to the French in time, the Gendarmes can intercept and destroy the cargo.\nGermany meanwhile has agreed to make it a crime to facilitate illegal immigration to the UK.\nThat is a really big deal because it would mean police could raid the warehouses storing the dinghies.\nBulgarian customs officials have shown that existing laws can be used to seize consignment of dinghies as they enter the EU from Turkey - and the icing on the cake for the British would be if China seized the cheap engines which have no place in the legitimate maritime market.\nThe two countries are talking, but there's nothing confirmed there yet.\nWhile those conversations continue, the UK's legal plans to criminalise actions that prepare the way for a crossing - such as funding, advertising and other logistical arrangements - will go through Parliament.\nAnother key feature in the package means jail for anyone endangers lives at sea by attacking the police units on the French beaches or obstructs a rescue.\nIf La Crise Migratoire is going to end, all of these individual initiatives, legal reforms and technological solutions need to work together.\nBut there is genuine optimism that this could be the year when things begin to change.", "url": "https://www.bbc.co.uk/news/articles/c39vjnpxy1wo"}