{"authors": ["Daisy Stephens", "www.facebook.com"], "date_download": "2025-04-26 04:24:53", "date_modify": "2025-04-26 04:24:53", "date_publish": "2025-03-03 12:27:13", "description": "Bob Worth died during a home game on Saturday.", "filename": "news_articles_ce3495z0n5yo_1745641493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f8c6/live/8fe1c0f0-f825-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce3495z0n5yo_1745641493.html", "title": "Didcot FC pays tribute to fan Bob Worth who died during match", "title_page": "Didcot FC pays tribute to fan Bob Worth who died during match - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A football club has paid tribute to a fan who died during a match.\nBob Worth died during a game between Didcot Town and Willand Rovers at Loop Meadow Stadium in Oxfordshire on Saturday.\nThe match was abandoned as a result.\nIn a statement, Didcot Town FC said Mr Worth was \"a true character\" and would be \"sadly missed by everyone who had the pleasure of knowing him\".\n\"Bob Worth was a huge character at the club,\" it said.\n\"We would like to send our deepest condolences to his family and friends from everyone at Didcot Town.\n\"We would like to thank everyone from the football family for their well wishes yesterday and today and those that have left flowers at the club.\n\"We would also like to thank Vicky, who is a parent from our youth system, who was there and on hand to help as well as the the physio staff from both Didcot Town and Willand Rovers Football Club for their quick response and doing everything they could for Bob.\"\nThe club also praised the \"quick response from the emergency services\", and added: \"Bob, you will be missed by everyone at the Loop Meadow Stadium.\"\nDidcot Town Women's game on Sunday began with a minute's silence in honour of Mr Worth.", "url": "https://www.bbc.co.uk/news/articles/ce3495z0n5yo"}