{"authors": ["Tom Richardson", "www.facebook.com"], "date_download": "2025-04-26 03:57:16", "date_modify": "2025-04-26 03:57:16", "date_publish": "2025-03-04 14:11:09", "description": "Astro Bot, Still Wakes the Deep and Thank Goodness You're Here! complete a varied field this year.", "filename": "news_articles_c201p1w53ypo_1745639836.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a3dc/live/7d440ac0-f8f2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c201p1w53ypo_1745639836.html", "title": "Bafta Game Awards 2025: Hellblade 2 gets most nominations", "title_page": "Bafta Game Awards 2025: Hellblade 2 gets most nominations  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Senua's Saga: Hellblade II has picked up the most nominations at this year's Bafta Games Awards.\nThe action-adventure game, developed by Cambridge-based studio Ninja Theory, is up for awards in 11 out of 14 categories at the annual ceremony.\nHowever, it's not in the running for best game, unlike 3D platformer Astro Bot - up for eight awards - which clinched top prize at the US-based Game Awards in December.\nThe Baftas, considered one of the most prestigious ceremonies in the games industry calendar, will be held in London on 8 April.\nThe other contenders in the best game category are:\nBalatro - a poker-inspired card game\nBlack Myth: Wukong - an action-adventure made in China and inspired by a popular myth\nHelldivers II - a multiplayer co-operative shooter\nThe Legend of Zelda: Echoes of Wisdom - the first game in Nintendo's popular series to star the princess it's named after\nThank Goodness You're Here! - a wacky cartoon adventure game developed by two friends from Barnsley\nBafta hands out prizes each year in a range of categories, including acting, music and game design.\nThree of the six most-nominated games this year were made in the UK.\nStill Wakes the Deep, a horror game from Brighton-based studio The Chinese Room set on a Scottish oil rig, is up for eight awards, while Thank Goodness You're Here! is up for seven.\nLego Horizon Adventures, based on the PlayStation series and largely developed by London-based Studio Gobo, is nominated in four categories.\nIndie hits Animal Well and Balatro, each have four nominations, as does Call of Duty: Black Ops 6.\nSenua's Saga: Hellblade II is a sequel to Senua's Sacrifice - which picked up five awards at 2018's gaming Baftas.\nIts 11 nominations might surprise some - the game was an impressive technical showcase but received positive if not outstanding reviews.\nHowever, like the first game, it was praised for its sensitive depiction of the main character's psychosis.\nBafta Games committee chair Tara Saunders tells BBC Newsbeat it represents \"a strong year for British-made games\".\nShe says the voting panel is made up of members across the world who take the awards \"very seriously\" and vote based on a range of features.\n\"It's all about excellence,\" she says.\n\"Excellence in the crafts and maybe some of those games have nailed all of those craft areas.\"\nBafta CEO Jane Millichip agrees, and wants to embrace the fact they have a British game category.\n\"Our members are international and they're the people who choose,\" she says.\nThe Bafta Games Awards are no stranger to the odd upset.\nIn 2023, Vampire Survivors - made by a tiny British studio - beat Sony's God of War: Ragnarök to the top prize.\nThis year's best game field has a similar mix of big-budget blockbusters and indie hits.\n\"I love that Bafta can surprise, I love that it's not a given and we can get to that night and we don't know what's going to come out on top,\" Tara says.\n\"It's putting a spotlight on some really tiny games that might have slipped by.\"\nMetaphor: Refantazio featured prominently in other awards lists but only picked up two nominations, with one for its narrative.\nAnd Final Fantasy VII: Rebirth was nominated in the narrative and music categories but ineligible for best game due to Bafta rules on remakes.\nTimes remain tough for people working in the games industry worldwide, with mass layoffs, studio closures and cancelled projects continuing to make headlines.\nTara says awards like the Baftas are \"a beacon of light in the dark times\".\n\"It's really important to pause and celebrate the teams and individuals that have crafted these standout games experiences,\" she says.\nAnd Jane, who also oversees Bafta's events across film, TV and other creative industries, says the gaming awards are a place for people to support each other.\n\"I've never seen a community cheer so much when they lose, it's a brilliant thing to behold,\" she says.\n\"It's so wonderful to see the whole games community being so supportive of each other and there to celebrate the sector, not themselves.\n\"It's kind of devoid of ego and that's great.\"\nYou can find a full list of Bafta Games Awards nominations for 2025 here, external.", "url": "https://www.bbc.co.uk/news/articles/c201p1w53ypo"}