{"authors": ["Hugh Pym", "www.facebook.com"], "date_download": "2025-04-26 07:25:36", "date_modify": "2025-04-26 07:25:36", "date_publish": "2025-02-28 00:00:29", "description": "Creon, a pancreatic enzyme replacement therapy, helps digestion but stocks are desperately low.", "filename": "news_articles_cjry84d5jq5o_1745652336.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b45e/live/816d9180-f513-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjry84d5jq5o_1745652336.html", "title": "Fears cancer patients 'may starve' without vital drug", "title_page": "Fears cancer patients 'may starve' without vital drug - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cancer patients and others with debilitating conditions have highlighted shortages of a vital drug they say have had a \"devastating\" impact on their lives.\nCreon, a pancreatic enzyme replacement therapy (Pert), helps digestion, but has been hard to obtain for the last year and shortages are predicted to last until 2026.\nIt is thought more than 61,000 patients in the UK need it, including those with pancreatic cancer, cystic fibrosis and chronic pancreatitis.\nSome patients said through Your Voice, Your BBC News that they have had to cover long distances to find a pharmacist with supplies.\nThe Department of Health and Social care says it is working closely with the NHS, manufacturers and others in the supply chain to try to resolve the issues.\nWithout the drug, patients lose weight and strength, which means their ability to cope with treatment such as chemotherapy is reduced.\nDiana Gibb, who is 74, and her husband Mick, 78, live in Tonbridge, Kent.\nMick had a major operation to treat pancreatic cancer in 2023. Diana wrote to BBC News explaining that it is impossible for Mick to digest food without creon. She says he was prescribed a high dose to enable him to regain weight after losing four stone in hospital, but it became increasingly difficult to get hold of the medicine.\n\"We started to have trouble getting them in the higher dosage, involving me traipsing round pharmacies to find one who could get them. Pharmacies cannot get hold of that dosage. He now has to take a lower dose doubling up on the number of tablets taken, one box now lasts less than a week.\n\"Pharmacies cannot get hold of lower dosage either and there is no alternative medication. I was worried that my husband would starve to death without them.\"\nDiana says for now they can get supplies of the drug but there is no guarantee week-to-week, and that is still a big worry.\nBryony Thomas, who is from Stroud in Gloucestershire, needs creon after being diagnosed with pancreatic cancer. Her cancer is now in remission, but she is still reliant on the drug for her digestive system to work correctly. She says there was no availability to get the medication within her county, and she had to get her mother-in-law to make a two-hour journey to a pharmacy in Crewe.\nAt one stage, she says she obtained the drug from another patient, who had a surplus, against regulations via Instagram. She describes her situation as \"constantly stressful\".\nLeading pancreatic clinicians and charities including Pancreatic Cancer UK have written to the prime minister saying the absence of Pert can have a \"devastating impact on people's lives\", with doctors and pharmacists \"inundated with requests for help from desparate patients\".\nThe letter says that without the drug, people experience \"horrendous bowel symptoms, poor diabetes control, malnutrition, and reduced absorption of other medications, all of which can have a massive impact on their health and quality of life\".\nThere are other forms of Pert, but the charities and medical experts say while other countries have many brands available, in the UK creon \"holds a very high market share\". They say that with creon running short, switching by patients has depleted stocks of the alternatives. They are calling for a national process for importing Pert.", "url": "https://www.bbc.co.uk/news/articles/cjry84d5jq5o"}