{"authors": ["Joe Skirkowski", "www.facebook.com"], "date_download": "2025-04-26 04:19:21", "date_modify": "2025-04-26 04:19:21", "date_publish": "2025-03-04 06:18:02", "description": "Chalk-loving blooms, bees, butterflies and birds will be attracted to the site, the charity says.", "filename": "news_articles_c3rnp3qw205o_1745641161.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/173f/live/5959f960-f822-11ef-8e9e-47bc43726032.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rnp3qw205o_1745641161.html", "title": "Ex-dairy farm in Wiltshire to be turned into RSPB nature reserve", "title_page": "Ex-dairy farm in Wiltshire to be turned into RSPB nature reserve - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A large ex-dairy farm is being turned into a chalk grassland nature reserve with the help of the Royal Society for the Protection of Birds, it has been announced.\nOver the next 10 years, Roundbarrow Farm near Firsdown in Wiltshire should attract \"chalk-loving blooms, bees, butterflies and birds\", said Patrick Cashman, RSPB site manager.\nIt is hoped the plans for the farm, owned by Wiltshire Council, will improve water quality in the River Test.\n\"This is an inspirational project Wiltshire Council have embarked upon with the RSPB,\" said Mr Cashman.\nCattle manure can enter local waterways in heavy rain, so its removal is expected to improve water quality in the River Test as well as in the Solent catchment downstream.\nChalk grasslands are able to support a wide range of native wildlife and plants.\nAt RSPB Winterbourne Downs, just five miles from Roundbarrow Farm, the charity established a chalk grassland that has attracted stone curlews, lapwings and butterflies including the adonis blue, small blue and marsh fritillary.\nIt is hoped that these species will also find a home at RSPB Roundbarrow Nature Reserve, as the farm is to be known.", "url": "https://www.bbc.co.uk/news/articles/c3rnp3qw205o"}