{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:45:37", "date_modify": "2025-04-26 06:45:37", "date_publish": "2025-03-01 15:10:15", "description": "The cemetery in Bedford was a local community initiative supported by Bedford Borough Council.", "filename": "news_articles_c5y0rl6lln8o_1745649937.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9c23/live/b4335e00-f695-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y0rl6lln8o_1745649937.html", "title": "Community marks Bedford's first Muslim burial ground", "title_page": "Community marks Bedford's first Muslim burial ground - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An opening ceremony has been held at a town's first Muslim burial ground.\nThe local community initiative in Kempston, Bedfordshire was supported by Bedford Borough Council and is expected to be up and running by the summer.\nProject leader Parvez Akhtar said this cemetery on Green End Road was five years in the making and added: \"It is a testament to the community and our council that we can boast about this burial ground.\"\nThe event was attended by local community groups, mayor of Bedford Borough Council Tom Wootton, town councillors and Bedford MPs Mohammad Yasin and Richard Fuller.\nMr Akhter said: \"Many bigger councils up and down the country don't have such a facility, and it is a testament to the community and our council that we can boast about this burial ground.\n\"It was really pleasing to have cross-party support at full council for this project and I look forward to the official opening in the summer where we hope to invite everyone for a big celebration.\"\nMr Wotton said: \"This initiative goes far beyond land and planning approvals.\n\"It embodies our commitment to respect, inclusion and meeting the diverse needs of every community member.\n\"Just as our Christian community has traditionally enjoyed access to consecrated burial grounds, it is essential that our Muslim residents receive the same provision.\"\nPlans have also been submitted for Peterborough's first Muslim cemetery.\nThe Green Meadows Cemetery project will have about 8,500 burial spaces and include a community-use building in Sutton, just outside the city.", "url": "https://www.bbc.co.uk/news/articles/c5y0rl6lln8o"}