{"authors": ["Chris Lockyer", "www.facebook.com"], "date_download": "2025-04-26 06:34:22", "date_modify": "2025-04-26 06:34:22", "date_publish": "2025-02-27 06:29:36", "description": "Zoe Loudon-Godfrey collapsed and died suddenly while at her holiday home in Somerset last May.", "filename": "news_articles_cqlydx29pkdo_1745649262.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0bf5/live/2248a710-f45c-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqlydx29pkdo_1745649262.html", "title": "Family still waiting to know how Bristol woman, 50, died on holiday", "title_page": "Family still waiting to know how Bristol woman, 50, died on holiday - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a woman who died suddenly on holiday say they still have not been told her cause of death more than eight months on.\nZoe Loudon-Godfrey, 50, from Bristol, collapsed at her holiday home in Porlock in Exmoor, Somerset, in May and was flown to hospital in Taunton, where her life support was removed.\nIt took about four weeks, following her death, for the first post-mortem examination to be carried out, which was inconclusive, and the coroner later requested a brain exam.\nSomerset Coroner's Service saoid: \"We will seek to conclude matters as soon as we are able to.\"\nSusan Hodgetts, Ms Loudon-Godfrey's mum, who lives in Bournemouth, Dorset, said she was initially told a brain examination could take up to six months, but was now being told there was no new timeline.\nShe said the grief was with her \"all day, every day\", adding: \"Can we have some answers?\n\"You're imagining things all the time. Your mind's working overtime, and you don't need to be having these awful thoughts, trying to second guess what could have caused it.\"\nMs Hodgetts said she had not been told why there was a delay.\nShe added that two weeks before the incident, Ms Loudon-Godfrey had a clear medical exam by her employer.", "url": "https://www.bbc.co.uk/news/articles/cqlydx29pkdo"}