{"authors": ["John Campbell", "www.facebook.com"], "date_download": "2025-04-26 04:13:01", "date_modify": "2025-04-26 04:13:01", "date_publish": "2025-03-04 12:00:58", "description": "Six projects in health, education, justice and infrastructure will share the money.", "filename": "news_articles_cwygegyn3n8o_1745640781.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d0c9/live/46570e30-f8ee-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygegyn3n8o_1745640781.html", "title": "Public service reform: First part financial package to be released", "title_page": "Public service reform: First part financial package to be released - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Almost £130m is to be released for public service reform projects in Northern Ireland after the Stormont Executive reached agreement with the UK government.\nThe money is part of the financial package which accompanied the return of devolved government last year.\nIt included £235m ringfenced for projects which would increase the financial sustainability of public services or improve efficiency.\nThe Treasury has approved the first tranche of that money to be shared across six projects in health, education, justice and water infrastructure.\nFinance Minister John O'Dowd said while the money \"will in no way tackle the magnitude of issues at hand\" it would still be significant in helping to \"stimulate the wider transformation of public services\".\n\"Transformation will take time and this is a step on that journey,\" he added.\nThe largest allocation of £61m is for multidisciplinary teams (MDT) in primary health care.\nMDTs are partnership between GP practices and health trusts that involve specialists like physiotherapists and mental health practitioners working at GP clinics.\nThis means patients can see different specialists within the GP practice, reducing the need for referrals and appointments elsewhere.\nThe roll out of MDTs began with pilot projects in 2018.\nHealth Minister Mike Nesbitt called primary care MDTs \"the biggest success story of recent years in transforming our health service\".\n\"I believe that the MDT Programme, and the close collaboration between Trusts and GP Federations that underpins it, remains the key to stabilising vital Primary Care services in our communities, to ensure they can continue to provide high quality care to people, now and into the future.\"", "url": "https://www.bbc.co.uk/news/articles/cwygegyn3n8o"}