{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:34:43", "date_modify": "2025-04-26 04:34:43", "date_publish": "2025-02-28 12:54:01", "description": "Dorset politicians vow to fight on after Portland incinerator is granted an environmental permit.", "filename": "news_articles_cx2xx9r7gl7o_1745642083.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7e39/live/9abbbb70-f5cd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2xx9r7gl7o_1745642083.html", "title": "Portland incinerator fight continues after EA grants permit", "title_page": "Portland incinerator fight continues after EA grants permit - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dorset politicians have vowed to fight on after the Environment Agency (EA) issued a permit for a planned incinerator near the Jurassic Coast.\nPlanning permission for the energy recovery facility at Portland was granted by the government in September, despite initially being refused by Dorset Council.\nSouth Dorset MP Lloyd Hatton said he would continue to campaign until the incinerator plans were \"scrapped\".\nPowerfuel Portland, the company proposing the scheme, said it was pleased the EA had \"not identified any matters of concern\".\nCampaigners opposed to the energy plant have been granted a judicial review of the planning decision, which will be heard at the High Court on 12 March.\nMeanwhile, the EA announced on Thursday it had granted the necessary environmental permit for the incinerator to operate, saying Powerfuel Portland had met all of the necessary criteria.\nIt said the permit would not affect the legal challenge.\nFollowing the announcement, Mr Hatton said: \"This is not the end of the matter.\n\"The Environment Agency has made a decision to grant a permit, which I strongly, strongly disagree with, however, as it is an independent body, the government or ministers are not able to interfere with its decision-making processes.\n\"I will be continuing to work with local campaigners to fight for the right outcome, and continuing to press ministers to ensure the proposed incinerator on Portland is scrapped.\"", "url": "https://www.bbc.co.uk/news/articles/cx2xx9r7gl7o"}