{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:11:04", "date_modify": "2025-04-26 04:11:04", "date_publish": "2025-03-04 19:10:52", "description": "Other union members in the force's civilian workforce downed tools last month in a similar dispute.", "filename": "news_articles_ckg8lj9e4leo_1745640664.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1bd1/live/ffbb6880-f91b-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg8lj9e4leo_1745640664.html", "title": "Met Police: PCS union says more civilian staff to strike", "title_page": "Met Police: PCS union says more civilian staff to strike - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A trade union boss has said there is \"no reason\" for civilian employees with the Metropolitan Police to come into the office, with members set to take strike action in a dispute over flexible working.\nThe Public and Commercial Services union (PCS) said about 350 of its members who work as civilian staff at the Met would walk out from 17 to 28 March.\nOther union members in the force's civilian workforce took industrial action last month in a similar dispute.\nA Met spokesman said the \"vast majority of our hard-working staff\" were complying with a new hybrid working policy.\nPCS general secretary Fran Heathcote said: \"There is no reason why our highly skilled and hard-working members need to come into the office.\n\"They don't have public-facing jobs and have been working very efficiently from home.\n\"We call, once again, on managers to meet with us and resolve this dispute to the benefit of us, them and the wider London public.\"\nThe Met said it was \"currently working through the impact\" the strike might have, but services like call-handling and other front-line roles would be not be affected.\nThe spokesman said: \"We have been engaging with our staff and trade unions for over a year on this policy, which is in line with many other organisations. Ultimately, this is about our commitment to delivering a better service for Londoners.\"\nLast month more than 300 members of Met Police staff held a two-week strike in a dispute over hybrid working.\nWorkers in the referencing and vetting team had planned to continue working from home despite being expected in the office but were told they would still be docked pay if they did this.", "url": "https://www.bbc.co.uk/news/articles/ckg8lj9e4leo"}