{"authors": ["Ben Parker", "www.facebook.com"], "date_download": "2025-04-26 08:11:32", "date_modify": "2025-04-26 08:11:32", "date_publish": "2025-02-26 12:02:05", "description": "The county council wants all services in Suffolk to be provided by one unitary authority.", "filename": "news_articles_cvg147v7kw4o_1745655092.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9fb2/live/2392d830-f389-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg147v7kw4o_1745655092.html", "title": "Suffolk council calls for one sole authority in devolution deal", "title_page": "Suffolk council calls for one sole authority in devolution deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The county council has said it wants to see one authority in Suffolk as part of the current devolution process.\nPlans to draw up initial suggestions on how to reorganise local councils as part of devolution proposals are due before government at the end of March.\nThe Conservative-run Suffolk County Council argues a single body, rather than two unitary authorities for example, \"would make delivering public services simpler, cheaper and quicker\".\nThe opposition Green, Liberal Democrat and Independent Group said: \"We will fight for keeping the 'local' in local democracy every step of the way.\"\nSuffolk and Norfolk have been fast-tracked for devolution, external, which means the county would share a mayor with Norfolk, and existing councils would be scrapped and replaced with a number of unitary authorities - instead of the current two-tier system of county and district councils.\nSome political leaders have already voiced their opposition to one council for the whole of Suffolk.\nCaroline Topping, the Green leader of East Suffolk Council, said: \"We do not believe that a single, vast council covering the whole county would best serve those who matter most.\n\"There are far better options under consideration which would keep democracy local, including a two-unitary east and west model.\"\nLabour-run Ipswich Borough Council said it wanted to see a Greater Ipswich Unitary Council, external included in future plans.\nIf the county council gets its wish, all council services, such as waste collection and disposal, housing, social care, planning, highways maintenance, leisure, school placements and travel and street cleaning, would all be provided by one authority.\nRichard Rout, county council cabinet member for devolution and local government reform, said: \"The financial benefits of unitary local government are clear.\n\"By cutting unnecessary bureaucracy, the new council – whoever may serve on it – will have more money to invest in frontline public services, ensuring better value for taxpayers.\n\"If the government is serious about delivering savings, efficiencies, better outcomes for residents and financially sustainable local government, then there is only one answer - one council for Suffolk.\n\"Moreover, it is the only model that meets their criteria of serving over 500,000 people.\"\nAndrew Stringer, leader of the Green, Liberal Democrat and Independent Group at the county council, said: \"We are disappointed but not surprised that the county council administration are proposing a single unitary council for Suffolk before the business case has even been written.\n\"We are in favour of devolution as a principle that genuinely empowers and brings decision-making closer to local communities, but this is not what is being proposed.\"", "url": "https://www.bbc.co.uk/news/articles/cvg147v7kw4o"}