{"authors": ["James Waterhouse", "www.facebook.com"], "date_download": "2025-04-26 06:47:44", "date_modify": "2025-04-26 06:47:44", "date_publish": "2025-03-01 12:03:47", "description": "The more the country is attacked, the more unity there is, people in Kyiv tell the BBC.", "filename": "news_articles_cgr2g4n4wvdo_1745650064.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/01e5/live/7c960af0-f696-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgr2g4n4wvdo_1745650064.html", "title": "Ukrainians back Zelensky after disastrous Oval Office encounter", "title_page": "Ukrainians back Zelensky after disastrous Oval Office encounter - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Whether or not President Volodymyr Zelensky was ambushed or should have been more diplomatic in the Oval Office, it was a disastrous visit for Ukraine.\nFor those watching in Kyiv, the future of their country hung in the balance.\n\"It was an emotional conversation, but I understand our president,\" Yulia tells me next to Kyiv's golden-domed St Sofia's cathedral.\n\"Maybe it wasn't diplomatic, but it was sincere. It's about life, we want to live.\"\nYulia reflects a political pattern in Ukraine: the more the country is attacked, the more unity there is.\nBefore the full-scale invasion in 2022, President Zelensky's trust rating was 37%. Afterwards, it rocketed to 90%.\nBefore Donald Trump returned to office at the start of 2025, it was 52%. After he blamed Ukraine for starting the war, it hit 65%.\n\"They [Donald Trump and JD Vance] were so rude,\" says 30-year-old Andriy. \"They don't respect the people of Ukraine.\"\n\"It looks like Washington supports Russia!\" observes Dmytro, 26.\nYou wonder what the last 24 hours has done to President Zelensky's popularity.\n\"When the situation becomes worse, we have another rallying around the flag,\" explains Volodymyr Paniotto, director of the Kyiv International Institute of Sociology which conducted some of the polling.\nWorld leaders' popularity often wanes over time, and Mr Paniotto says President Zelensky has not been immune.\nHis ratings especially took a hit with Ukraine's failed counteroffensive of 2023, and his sacking a year later of the popular commander in chief of his armed forces, Valeriy Zaluzhnyi.\nBut Donald Trump's new, transactional, often-hostile approach to Ukraine has forced the country to unite and brace for further uncertainty.\nNot least with his warming to Russia.\nThe initial reaction was that of shock,\" says opposition MP Inna Sovsun.\n\"It was difficult to watch a president who's been a victim of Russian aggression being attacked by the leader of the free world,\" she adds. \"It's painful.\"\nUkrainian TV channels reported yesterday's scenes in a more measured way: that a minerals deal between Ukraine and the US was simply not signed.\nPerhaps, given it didn't include the American security guarantees that Kyiv and Europe desperately want, it wasn't as tantalising for Zelensky as had been suggested.\n\"We need to find stronger allies in Europe and Canada, Australia and Japan, who've all been supporting us,\" argues Sovsun.\nThere are clearly deep feelings of resentment between Washington and Kyiv. However, Sovsun doesn't think Ukraine should give up on negotiations, but should instead reframe the debate.\n\"It's important to find the right mediator,\" she says. \"Someone Trump can recognise, but someone we trust too. Someone like Georgia Meloni of Italy.\n\"Under no circumstances should we agree to calls for the president to resign, and I'm saying that as an opposition MP. That defies the very idea of democracy.\"\nAs sirens wail and missiles slam into cities, this is a war still raging, despite all of the talk of ending it.\nRussia is not backing down on its demands for Ukraine's political capitulation and the complete control of four regions.\n\"This war is not for some area, town or treeline in the east,\" says Taras Chmut, head of the Come Back Alive foundation.\nAfter Russia invaded Crimea in 2014, the organisation was set up to crowdsource military equipment for fighting Ukrainian troops.\n\"This is the war that will define the world order for future decades. Whether this world will still exist depends on how this war goes,\" he says.\nAs he ruthlessly pursues his \"America First\" policy, Trump wants Europe to provide security on a continent where he is less willing to do so. But Europe is divided on this, and where there is agreement it is that peace is not possible without the US as a safety net.\n\"Europe and the world once again want to close their eyes and believe in a miracle, but miracles do not happen,\" says Mr Chmut.\n\"Countries must accept the reality of the situation and do something about it. Otherwise, you will be the one to disappear next - after Ukraine.\"\nAdditional reporting by Hanna Chornous and Svitlana Libet.", "url": "https://www.bbc.co.uk/news/articles/cgr2g4n4wvdo"}