{"authors": ["Harriet Heywood", "www.facebook.com"], "date_download": "2025-04-26 03:46:45", "date_modify": "2025-04-26 03:46:45", "date_publish": "2025-03-05 05:30:52", "description": "Progress Mushonga is among seven patients whose life was saved during a busy week at Royal Papworth.", "filename": "news_articles_c0egpqp4zl4o_1745639205.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/787e/live/e5d05020-f902-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0egpqp4zl4o_1745639205.html", "title": "Royal Papworth records month's worth of operations in a week", "title_page": "Royal Papworth records month's worth of operations in a week - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A grandmother has thanked a family for her donor heart after she underwent life-saving surgery during one of a renowned hospital's busiest periods.\nProgress Mushonga, 49, from Southend-on-Sea in Essex, said she had a \"real sense of peace\" after her successful heart transplant at Royal Papworth Hospital in Cambridge.\nShe was one of seven people whose lives were saved during a period earlier this year in which a month's worth of transplant activity was carried out in seven days.\nMarius Berman, surgical lead for transplant at the trust, added the seven days would not have been possible \"without the gift of organ donation\".\nMs Mushonga received a heart transplant after a suitable donor heart became available in January.\nIn 2008, she had been diagnosed with cardiomyopathy, a condition that affects the heart's ability to pump blood.\nTreatment had controlled her symptoms until 2017, when she was also diagnosed with fluid retention.\nShe had a pacemaker fitted and was referred to specialists at Royal Papworth in September 2024, who advised her a heart transplant was her best option.\n\"It's been quite a journey for me but I now have a real sense of peace,\" said Ms Mushonga.\n\"I'm most looking forward to being back at home with my family.\n\"As a mother you always find yourself busy doing things, but I know I'll have to be cautious as I continue my recovery.\n\"I'd like to thank everyone at Royal Papworth Hospital and the wider NHS for their help and support in my care.\n\"I'd also like to thank the donor's family for making the decision to donate at a difficult time - I will be forever grateful.\"", "url": "https://www.bbc.co.uk/news/articles/c0egpqp4zl4o"}