{"authors": ["Sarah Spina-Matthews", "www.facebook.com"], "date_download": "2025-04-26 04:06:06", "date_modify": "2025-04-26 04:06:06", "date_publish": "2025-03-03 17:04:51", "description": "After a 25-year search, the half-siblings met for the first time thanks to a television programme.", "filename": "news_articles_c4g9205lj2yo_1745640366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ba2d/live/b4eaba70-f832-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g9205lj2yo_1745640366.html", "title": "North Yorkshire woman meets long-lost adopted half-brother", "title_page": "North Yorkshire woman meets long-lost adopted half-brother - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For her entire childhood, Jeanette Woodyatt had no idea she had a half-brother living just 40 miles away from her.\nBut after a 25-year search, she says getting to know her relative Graham Briggs - who grew up in Bolton and now lives in the US - has \"made her life complete\".\nJeanette, from Skipton, says her late father told her at the age of 18 that he had a son that he had given up for adoption, but asked her not to go looking for him until he decided to reach out.\n\"It felt odd, it felt like something was missing,\" she recalls.\n\"I had to fulfil my dad's wish that when he came looking, we welcomed him into the family,\" she says.\n\"I contacted [the phone company] and said 'please help, please pass me the phone number', but because of data protection they couldn't.\n\"Then I went through several adoption agencies - they tried for over 10 years to find him and hit a blank.\"\nJeanette decided to reach out to the ITV programme Long Lost Family, external and later discovered he was living in San Diego, California.\nThe pair met for the first time in 2023 at a pub in Keighley, where their father was from, with Jeanette describing it as the \"best experience\".\nShe says: \"It was so scary because I thought, is he going to look like my dad, is it going to upset me because he looks like my dad?\n\"Within seconds of seeing him, after the tears, it was like we'd always known each other.\"", "url": "https://www.bbc.co.uk/news/articles/c4g9205lj2yo"}