{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:54:23", "date_modify": "2025-04-26 03:54:23", "date_publish": "2025-03-04 17:34:27", "description": "Practices do not receive enough money to the cover costs of NHS procedures, a dentist group warns.", "filename": "news_articles_cvgwnp2jv20o_1745639663.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8c85/live/73248900-f90d-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwnp2jv20o_1745639663.html", "title": "Wirral dentists 'may have to stop NHS treatment'", "title_page": "Wirral dentists 'may have to stop NHS treatment' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dentists in Wirral have warned a funding crisis may force them to stop providing NHS treatment in the next year.\nThe Chair of the Wirral Local Dental Committee, which represents NHS dentists in the borough, said practices do not receive enough money from the government to cover the cost of carrying out procedures.\nStephen Wright said it was \"unsustainable\" and said the lack of funds could result in no NHS dental treatment being available.\nThe Department of Health and Social Care said the government is committed to rebuilding NHS dentistry.\nDentist practices are not owned or employed by the NHS. They are businesses which choose to enter into a contract with the NHS.\nMr Wright said: \"If you look at the British Dental Association figures to provide a set of dentures for a patient will on average lose a practice £40.\n\"That's just unsustainable. To keep our small businesses going we have to have income, and if the income from the National Health Service isn't sufficient we have to subsidise that by accepting private patients.\"\nJames Ashley, who runs a practice in Rock Ferry, said the profession also faced staffing problems .\n\"The main other struggle we have is the lack of dentists out there in the first place,\" he said.\n\"Young dentists we have recruited in recent years have gone abroad because the attraction of working abroad is much better for a lot of them than working in the NHS.\"\nA Department of Health and Social Care spokesman said it was \"reforming the dental contract to encourage more dentists to offer NHS services and tackle regional disparities\".\nThe spokesman said there was also a \"golden hello\" scheme to recruit dentists to areas in need.", "url": "https://www.bbc.co.uk/news/articles/cvgwnp2jv20o"}