{"authors": ["Ana Faguy & Max Matza", "www.facebook.com"], "date_download": "2025-04-26 04:03:51", "date_modify": "2025-04-26 04:03:51", "date_publish": "2025-03-03 19:38:35", "description": "American voters expressed frustration at one or both leaders for their roles in the dispute that shocked the world.", "filename": "news_articles_cvg17jmm5vxo_1745640231.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b437/live/e5d74780-f85e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg17jmm5vxo_1745640231.html", "title": "Americans voters frustrated by Zelensky-Trump Oval Office spat", "title_page": "Americans voters frustrated by Zelensky-Trump Oval Office spat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The shocking blow-up between US President Donald Trump and Ukrainian President Volodymyr Zelensky at the White House on Friday continues to ripple across the globe, including through American voters who expressed frustration at one or both leaders.\nThe extraordinary scene saw Vice-President JD Vance accuse the Ukrainian president of being \"disrespectful\" to the US, while Trump urged him to make a deal with Russia \"or we are out\".\nTrump also accused the Ukrainian president of \"gambling with World War Three\" as Zelensky pushed back at suggestions that he should work harder to agree a ceasefire with Vladimir Putin. Zelensky was eventually told to leave the White House early.\nWorld leaders and elected officials in the US have had much to say about the tense exchange, but so do American voters. We've asked five people what they think.\nThis South Carolina voter aligns himself with the Trump administration but he was frustrated by the Oval Office spat and wants the US to continue to back Ukraine.\nIt never should have happened. I blame both [Zelensky and Trump].\nZelensky did come across as arrogant, frankly. I get he was trying to make his point but he doesn't know how to deal with Trump. [UK Prime Minister Keir] Starmer knows how to deal with Trump, [French Prime Minister Emmanuel] Macron knows how to deal with Trump, [Russian President Vladimir] Putin definitely knows how to deal with Trump, but [Zelensky] doesn't know how to handle Trump.\nSome of what Trump says is true. When he said Ukraine doesn't have the cards, [Zelensky] doesn't have the cards.\nBut Zelensky does have the cards in so far as saying that we will feel it in America shortly after Europe feels it, if Putin is appeased, because [Putin will] just reconstitute his forces and invade somebody else.\nThis Florida Democrat has repeatedly voted against Trump and said she was ashamed to call herself an American in the wake of the meeting.\nI had to pause it a couple of times to give myself a few moments to cool off. I saw Trump and Vance steamrolling President Zelensky and refusing to let him get a word in edgewise.\nThey were selfish, rude, callous, and displayed a complete lack of basic human empathy.\nIt's hard to stay optimistic about the outcome of this war, and I knew something like this was likely to happen after Trump was re-elected.\nI've been dreading this possibility since election day; however, I didn't anticipate Trump being this horrible about it. I'm terrified for Zelensky and Ukraine.\nIf more people had seen the full interaction between Trump and Zelensky, then this Pennsylvania voter says they would understand Trump's frustrations.\nThe majority of the American public is getting a sliver of what happened, I'm glad that was public but I wish people would watch the whole thing because I think they'd have a very different point of view.\nThis war needs to end, but it's not going to end the way Zelensky wants it to end. It's a sad state of affairs.\nZelensky was expecting it to go a lot differently and I give Vance and Trump a lot of credit for handling it the way it did.\nPutin sitting there going, \"Damn, I better behave because Trump is holding no prisoners.\"\nThis New Jersey voter has backed both Republicans and Democrats in the past but was \"disgusted\" by how Trump and Vance handled themselves in the Oval Office.\nI was absolutely disgusted with it. Even if Zelensky and the Ukrainians were considered adversarial to us, you wouldn't talk to their head of state or head of government that way.\nI would go beyond sending more aid to Ukraine - I would go as far as saying we should send military assets: putting planes in the air or putting boots on the ground.\n[Putin] operates like a bully. The only way you're really going to get a bully to reconsider their actions is to stand up to them - you have to be willing to punch them in the mouth at some point in time.\nThis Indiana Trump voter wants to help Ukraine, but thinks there should be limit to US generosity to ensure Americans are taken care of too.\nI want to help them as much as we can but we can't keep giving, giving, giving.\nZelensky had good reason to want more, but I feel like he was in the wrong to ask for it in that manner. If he did it in private, it would have been the place for it.\nI didn't feel like Trump or Vance's reaction to it was wrong. It wasn't perfect, but I don't think it was a bad reaction per se. I hope there can be reconciliation after this, I want to help them end this war.\nBut if there isn't some middle ground they can find, I don't want to see the US to continue to spend and spend on a country that isn't ours when we have domestic problems.\nThis Indiana voter supports the president but described Trump and Vance's behaviour as the wrong move.\nIn all my years alive, I've never seen anything like that before. I understand behind closed doors things like this happen, but the Oval Office is not where you're displaying your dirty laundry.\nI'm not a big fan of Zelensky but I found what happened in the Oval Office the other day is embarrassing.\nIt's getting muddled up between the personalities on display there but the fact of the matter is Russia invaded Ukraine not once but twice.\nRussia is the aggressor.\nI understand the administration wants to show the world what we're dealing with, but we're supposed to be the leader of the world and good leaders don't lose their cool at this level.\nI don't want to appear that I'm hostile of Trump, but I just think this style of leadership is not productive.", "url": "https://www.bbc.co.uk/news/articles/cvg17jmm5vxo"}