{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:45", "date_modify": "2025-05-19 15:30:45", "date_publish": "2015-02-05 01:24:24", "description": "Chinese shares reversed gains to close lower after rallying on the central bank's unexpected move to cut a key lending rate on Wednesday.", "filename": "news_business-31142937_1747668645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80795000/jpg/_80795961_120541033-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31142937_1747668645.html", "title": "China stocks end lower after rate cut rally", "title_page": "China stocks end lower after rate cut rally - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chinese markets reversed gains to close lower, after rallying on the central bank's unexpected move to cut a key lending rate on Wednesday.\nThe People's Bank of China lowered the required reserve ratio (RRR) for banks by 50 basis points in an attempt to stimulate the slowing economy.\nThe Shanghai Composite ended down 1.2% at 3,136.53 after surging over 2% earlier in the day.\nHong Kong's Hang Seng index closed up 0.4% to 24,765.49 after jumping 1.5%.\nOther Asian markets also headed lower after the European Central Bank moved to tighten Greece's access to funding.\nJapan's Nikkei 225, external fell 1% to 17,504.62, while South Korea's benchmark Kospi ended down 0.5% to 1,952.84.\nAnalysts said the ECB was taking a hard-line stance and putting pressure on Greece to decide on a funding programme.\n\"Overall, we retain the view that an agreement between the Greek government and the EU remains possible, but the probability of a Greek exit is clearly now higher than at any time in 2012,\" Barclays Research wrote in a report.\n\"The rise of radical parties in Europe, such as Podemos in Spain, leaves not much room to EU policymakers to be lenient on Greece's requests.\"\nAustralian stocks, however, bucked the downtrend and closed up for the eleventh consecutive session.\nThe S&P/ASX 200 index was up 0.6% at 5,811.0 after hitting 5,819.1 - the highest since May 2008.\nThe benchmark index has risen 9.5% in 11 sessions - a feat that has not happened in over five years.", "url": "https://www.bbc.com/news/business-31142937"}