{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:58:17", "date_modify": "2025-05-19 14:58:17", "date_publish": "2015-03-07 01:51:25", "description": "Photos from a hairdressing salon in Lagos set up by a former Nigerian banker turned hairstylist.", "filename": "news_world-africa-31748259_1747666697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81429000/jpg/_81429841_12_phone.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31748259_1747666697.html", "title": "Nigeria in pictures: Hairdressing money spinner", "title_page": "Nigeria in pictures: Hairdressing money spinner - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bruno Oaikhinan decided to set up a hair salon in a Lagos mall after realising that no matter how the economy is faring, people are always prepared to spend money on their hair. Over the weekends it is packed with women, men and children being groomed.\n\"Whether they are poor or they are rich, whether there is crisis - people want to look good,\" Mr Oaikhinan told the BBC on a busy Sunday afternoon at the salon.\nHe says he was always interested in hair and during his 12 years in the financial industry took lessons and apprenticeships on the side to learn the trade. Then he spied an opening and began saving. \"I noticed there was no salon in a mall in this country and I wanted to be the first - though it was a big risk.\"\n\"Rents are very expensive and nobody thought that a salon would make enough money in the mall,\" he says. Eighteen months ago, Bruno's Place opened up in Ikeja Mall in Lagos - a middle-class area in Nigeria's commercial capital.\n\"This is the biggest mall in Lagos right now and we have a lot of activities going on right now - Nigerians, we like enjoyment. People can come to the mall to shop and while they are shopping they can keep their kids in the salon to do their hair,\" Mr Oaikhinan says.\n\"Or their husband can wait for them having a pedicure or a manicure or a haircut - there are so many other things going on here - and you have crowds,\" he says.\nHe believes the secret of his success is having a business model that suits all budgets. \"In Bruno's Place you can get your hair done for a minimum of 1,000 naira (about $5; £3).\" What can cost a lot are the hair extensions or weaves - especially those made from human hair that can cost up to 150,000 naira ($700).\n\"You have the most expensive ones, you have the cheap ones - it depends on the lifestyle you want to portray. It's the same things with cars, you can decide to drive a Range Rover, you can decide to drive a Toyota, you can decide to drive a Kia, it depends on the size of your pocket,\" he says.\nBut customers can buy a synthetic weave for about 1,700 naira \"which gives you the same feel, the difference is that the expensive one lasts longer\" and it costs about 3,500 naira to attach it, he says.\n\"It takes me at least one hour 30 minutes to do this,\" says Osa Jacobs, one of about 30 stylists at Bruno's Place, who is attaching a weave in a style called \"side parting\". \"I've already done five today - and can do up to eight [in a day]. I love doing it.\"\nBraiding costs a lot more as it takes more time - ranging between 4,000 and 8,000 naira. The braids come in three sizes. The bigger ones take one-and-a-half hours to plait but the small braids can take four or five hours.\nMany hairstyles are inspired by celebrity fashion. \"Victoria Beckham… Halle Berry… Rihanna... these stars are setting the trend,\" says Mr Oaikhinan. \"So if there is a particular hairstyle, we study it then we adapt it for our customers' faces.\"\nIt is Cecilia Ekong's first visit to Bruno's Place, which she heard about on the grapevine. The beauty consultant, who has her hair done every month, says she is very pleased with her style and she will come back as the mall is convenient.\n\"The mall is the best place to build a brand because what the big salons outside have spent years to do, I've done in barely 18 months,\" says Mr Oaikhinan. The rents in the mall may be expensive but he adds it is worth it as the unisex salon is assured of electricity, water and there are toilets for customers.\n\"When I was in banking, I knew how much I was earning, now as a hairstylist I earn more than that,\" Mr Oaikhinan says. But it is hard work - and the salon is often open until late at night. \"Officially we're supposed to close at 9 o'clock but we'll still stay until 10 or 11. We'll stay until the last customer leaves.\"", "url": "https://www.bbc.com/news/world-africa-31748259"}