{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:49", "date_modify": "2025-05-19 15:30:49", "date_publish": "2015-02-09 12:51:14", "description": "Greek bank shares have fallen sharply after the country's finance minister warned this weekend the euro would collapse if Greece leaves the eurozone.", "filename": "news_business-31300992_1747668649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80881000/jpg/_80881197_80881196.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31300992_1747668649.html", "title": "Greek bank shares fall sharply as fears over exit grow", "title_page": "Greek bank shares fall sharply as fears over exit grow - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Greek bank shares have fallen sharply after the country's finance minister warned this weekend the eurozone would collapse if Greece were to leave.\nMr Varoufakis told Italian broadcaster RAI such an exit would see the euro fall like a \"house of cards\".\nShares in Greece's four largest banks have fallen by between 8.5% and 16%.\nIt comes as the UK prime minister chaired a meeting of officials this morning to discuss the impact on the UK of a Greek exit from the eurozone.\nItaly's finance minister Pier Carlo Padoan tweeted that Mr Varoufakis's comments were misplaced and insisted Italy's debt was \"manageable\".\nBut ahead of a meeting of G20 finance ministers in Istanbul on Monday. Mr Padoan said he had \"had a chat\" with Mr Varoufakis and \"exchanged some messages\".\n\"There is no problem, and even less so on a personal level,\" Mr Padoan said.\n\"Italy's objective is to find a shared solution to Greece's situation, starting with the eurogroup meeting in Brussels on Wednesday,\" he was quoted as saying by the AGI news agency.\n\"The European institutions are very open to finding a solution in everybody's interest. For the moment there is no plan B. Before anything else we must see what plan A is.\"\nOn Sunday Mr Varoufakis said: \"Greece's exit from the euro is not something that is part of our plans, simply because we believe it is like building a house of cards. If you take out the Greek card, the others will collapse.\"\nHe added: \"Italian officials... have approached me to say they are supportive of us but that they cannot tell the truth both because Italy risks bankruptcy and they fear the consequences with Germany.\"\n\"A cloud of fear has hung over Europe in recent years. We have become worse than the former Soviet Union.\"\nItaly's debt amounts to just over 130% of GDP, compared to 175% for Greece.", "url": "https://www.bbc.com/news/business-31300992"}