{"authors": ["Federica Bedendo", "www.facebook.com"], "date_download": "2025-04-26 06:33:46", "date_modify": "2025-04-26 06:33:46", "date_publish": "2025-02-27 06:33:12", "description": "The rose bush and plaque remember Lucy Sands, who was just 16 when she was killed in Workington.", "filename": "news_articles_cpdexpqzz80o_1745649226.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ca0a/live/160d98f0-f422-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpdexpqzz80o_1745649226.html", "title": "Lucy Sands' murder: Workington memorial for Victorian teenager", "title_page": "Lucy Sands' murder: Workington memorial for Victorian teenager - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A memorial has been created to remember a teenage girl whose murder has remained unsolved for almost 150 years.\nLucy Sands was just 16 when she went to meet friends and disappeared in Workington, Cumbria, in December 1881. Her body was found under a pile of cobbles three months later.\nA plaque and a rose bush have been installed at the graveyard in the grounds of St John's Church, on the site where she had been buried.\nNeil Schofield, mayor of Workington Town Council, which is behind the memorial, said: \"It shows what a varied history we have and that you don't have to be rich and famous to go down in history - the working man and woman can too.\"\nLucy was born in Antrim, Northern Ireland, in 1865 and when her parents died, she and her brother James were sent to live with their grandmother on Christian Street in Workington.\nSigns of her existence had been present in the town but disappeared between the 1960s and 1970s.\nA gravestone was removed when the churchyard at St John's was cleared about 60 years ago and a memorial tree was removed some time later from the town's Northside area, marking the place where her body was discovered.", "url": "https://www.bbc.co.uk/news/articles/cpdexpqzz80o"}