{"authors": ["Frances Mao", "www.facebook.com"], "date_download": "2025-04-26 07:59:49", "date_modify": "2025-04-26 07:59:49", "date_publish": "2025-02-25 11:16:13", "description": "Ibrahima Diack and Magatte N'Diaye are given \"adopted sons of the city\" status in A Coruña.", "filename": "news_articles_cx29pnzy1l7o_1745654389.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/50b4/live/a62adcf0-f368-11ef-a30e-87a8a95b0cd7.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx29pnzy1l7o_1745654389.html", "title": "Spanish city honours migrants who intervened in homophobic attack", "title_page": "Spanish city honours migrants who intervened in homophobic attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Spanish city has honoured two Senegalese migrants for their heroism in trying to save a gay man beaten to death by a homophobic mob.\nIbrahima Diack and Magatte N'Diaye were given \"adopted sons of the city\" status in A Coruña on Monday in a formal ceremony recognising their actions.\nThe men were the only ones to intervene in July 2021, when Samuel Luiz was set upon by a group of men and kicked and punched outside a nightclub in the north-western city.\nThe 24-year-old later died of his injuries in hospital - an event which sparked national outrage and condemnation.\nOn Monday, at a formal ceremony in the city council's hall, Mayor Inés Rey described the migrants' actions as \"pure altruism\".\nFootage of that night showed other bystanders watching on, some filming on mobiles, and the two being the only ones who intervened.\n\"That two undocumented migrants were the only ones who physically risked themselves to help the victim of a pack thirsting for horror leaves much food for thought and a series of lessons,\" Mayor Rey said.\n\"Thank you for your example in risking everything despite having a lot to lose,\" said another councillor, Rosalía López, on Instagram in a post sharing videos of the ceremony.\nMr Diack and Mr N'Diaye had been living in the city without papers at the time and doing irregular work, putting them at risk of arrest and deportation if they came into contact with authorities.\nBut both men on Monday said they had just done what they thought was the right thing in trying to stop the violence. In front of friends, civic servants and other guests on Monday, they were handed plaques by the mayor bestowing them with the status of \"Adopted Sons of A Coruña\".\n\"We are not heroes, we did what we had to do,\" said Mr N'Diaye, according to an AFP report.\nMr Diack said: \"I was born in a family that doesn't have much... but they gave me many things more valuable than money. They gave me respect, education and above all, values.\"\nThe two were also crucial witnesses in the trial of Mr Luiz's killers last November, Spanish media reported.\nA jury found four men guilty of the murder, with the court ordering sentences between 10 and 24 years. The court found the main accused - given a 24-year sentence - had shouted homophobic insults during the attack.\nTens of thousands of migrants reach Spain illegally every year through boat crossings across the Atlantic - with the most common arrivals from Mali, Senegal and Morocco.", "url": "https://www.bbc.co.uk/news/articles/cx29pnzy1l7o"}