{"authors": ["Jennifer Meierhans & Dearbail Jordan", "www.facebook.com"], "date_download": "2025-04-26 04:16:18", "date_modify": "2025-04-26 04:16:18", "date_publish": "2025-03-04 09:30:28", "description": "Canada's Prime Minister Justin said Donald Trump's decision to impose import taxes was \"very dumb\".", "filename": "news_articles_ckg1jxdpq0qo_1745640978.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3669/live/7c375910-f91b-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg1jxdpq0qo_1745640978.html", "title": "US stock markets fall amid trade war fears", "title_page": "US stock markets fall amid trade war fears after Trump tariffs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US stock markets have tumbled over concerns that President Donald Trump's tariffs on Canada, Mexico and China will lead to a wider trade war and hurt the economy.\nThe S&P 500 index, which tracks 500 of the biggest companies in the US, fell for a second day, ending at its lowest level since November when Trump won the election.\nThe president has followed through on a threat to impose 25% tariffs on imports from Canada and Mexico, and a 20% levy on China.\nThe move drew swift retaliation, including from Canada, where Prime Minister Justin Trudeau warned Trump his decision to target the US neighbour and close trade partner was a \"very dumb thing to do\".\nTrump fired back, writing on social media: \"Please explain to Governor Trudeau, of Canada, that when he puts on a Retaliatory Tariff on the U.S., our Reciprocal Tariff will immediately increase by a like amount!\"\nUS Commerce Secretary Howard Lutnick suggested that Trump could be ready to do a deal with Canada and Mexico. \"I think he's going to work something out with them,\" he told Fox News.\nSaying it would not be a \"pause\", he added: \"I think he's going to figure out, 'You do more and I'll meet you in the middle some way', and we're going to probably be announcing that tomorrow.\"\nIt is not clear if Trump will announce a new deal but markets will be closely watching the president's address to Congress on Tuesday.\nGoods worth several billions of dollars cross the borders of the US, Canada and Mexico each day and their economies are deeply integrated.\nStock markets in the US and globally have fallen since Trump announced on Monday that the tariffs would go ahead.\nCanada and China have already announced retaliatory import taxes on US goods.\nMexico's President Claudia Sheinbaum said the country would announce a response on Sunday that would include \"tariff and non-tariff measures\".\nThe Dow Jones Industrial Average dropped 1.5%, while the Nasdaq, where many technology companies' shares are listed, fell 0.35%. The S&P 500 closed 1.2% lower.\nAmerican retailers and carmakers were among the hardest hit, with electronics chain Best Buy's share price closing more than 13% lower.\nThe company had warned earlier on Tuesday that the tariffs would lead to higher prices for its shoppers.\n\"The giant wildcard obviously is how the consumers are going to react to the price increases in light of a lot of price increases potentially throughout the year,\" said Best Buy's chief financial officer Matt Bilunas.\nTrump said he was imposing the tariffs on Canada, Mexico and China in response to what he said was the unacceptable flow of illegal drugs and illegal immigrants into the US.\nTrudeau called that justification \"completely bogus\" and warned that Canada's retaliatory measures would hurt.\nHe said Canada would first hit $30bn worth of products, and target the remaining $125bn over 21 days.\nAny fresh duties Canada imposes will be in place \"until the US trade action is withdrawn\", he said.\n\"Canadians are reasonable and we are polite, but we will not back down from a fight, not when our country and the wellbeing of every one in it is at stake,\" he said.\nAddressing Trump directly, he added: \"Donald, you're a very smart guy. But this is a very dumb thing to do.\"\nChina also swiftly announced its own counter-measures, which include 10-15% tariffs on some US agricultural goods including wheat, corn, beef and soybeans. China is the US's biggest buyer of these goods.\n\"If the United States... persists in waging a tariff war, a trade war, or any other kind of war, the Chinese side will fight them to the bitter end,\" foreign ministry spokesman Lin Jian said.\nTrump said he would respond to retaliation with a plan, due in April, for \"reciprocal\" tariffs.\nThese would be tailor-made to each country and take into account areas such as the trade balance with the US and other taxes, such as VAT.\nTrump has also threatened to impose 25% tariffs on the EU, recently claiming that the bloc had been \"formed to screw the United States\".\nEurope has pledged to hit back, but no tariffs have been implemented yet.\nTrump is hoping that imposing tariffs on the goods that the US buys will force foreign companies to invest in America, boost tax revenues and grow the economy.\nHe has argued the tariffs - which are a tax paid by the business importing the product - will boost US manufacturing and protect jobs as foreign companies switch to production in America.\nBut tariffs also tend to trigger retaliation from targeted countries, disadvantaging domestic businesses looking to export goods, meaning the measures can ultimately hold back trade.\nAnalysts have warned that tariffs could lead to economic recessions, push up prices for US households and could also have a knock-on effect on consumers across the world, including in the UK.\nChancellor Rachel Reeves said that regardless of whether the UK avoids tariffs, they will have a knock-on effect.\n\"I don't think it serves anyone well,\" she said. \"And it's absolutely the case that even if tariffs aren't applied to the UK, we will be affected by slowing global trade, by a slower [economic] growth and by higher inflation than otherwise would be the case.\"\nIf inflation rises, it could affect the pace at which interest rates are cut.\nCompanies could choose to absorb the cost of the extra tax. Chipotle said that the restaurant chain would take that route - for now.\n\"It is our intent today to hold pricing constant because we don't know if the tariffs are transitory, if they're going to be permanent, or how they will impact our business in the future,\" said Laurie Schalow, Chipotle's corporate affairs chief.\nBut, like Best Buy, other US retailers warned that prices would rise.\nTarget's boss Brian Cornell said shoppers were likely to see increases over the next couple of days for foods such as avocados, bananas and strawberries.\nMexican avocados make up nearly 90% of the US market each year.\nWalmart said it would try to keep prices \"as low as possible\".\n\"In the meantime, we encourage all parties to work towards finding common ground that will protect consumers from price hikes and continue to grow our economy,\" it said.\nCarmakers are also bracing for a hit.\nFord chief executive Jim Farley warned last month the business \"could handle two weeks of tariffs\".\nHe told Bloomberg:, external \"We could see billions of billions of dollars of pressure on the industry, lost jobs, lots of impacts to communities.\"", "url": "https://www.bbc.co.uk/news/articles/ckg1jxdpq0qo"}