{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:14:18", "date_modify": "2025-04-26 04:14:18", "date_publish": "2025-03-04 11:10:30", "description": "They hope to \"pass on support\" from Sheffield, which is twinned with two Ukrainian cities.", "filename": "news_articles_c9q403p3y45o_1745640858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f18a/live/5b065bb0-f8e4-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9q403p3y45o_1745640858.html", "title": "Sheffield councillors head to Ukraine to show solidarity", "title_page": "Sheffield councillors head to Ukraine to show solidarity - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sheffield councillors are to visit western Ukraine later this month in a show of solidarity with the war-torn country.\nLabour councillors Mark Rusling and Matt Dwyer will head to Lviv on 14-17 March, meeting local government officials, soldiers and a team working with the Association of Ukrainians in the UK.\nThe visit follows Friday's tense White House meeting between Ukrainian President Volodymyr Zelensky and US President Donald Trump and Vice President JD Vance.\nRusling said: \"Ukrainians are really, really worried that British people in general are losing interest in what's happening in Ukraine.\"\nZelensky has returned to Kyiv after three frantic days that saw him ordered to leave the White House after the Oval Office encounter.\nHe had a warmer welcome in London on Saturday, meeting Prime Minister Sir Keir Starmer and the King, before receiving a strong show of support from European leaders at a summit on Sunday.\nRusling said: \"Much of the world has looked on with horror as President Trump has called into question support from the US and Europe for Ukraine, alongside blaming Ukraine for being invaded by Russia.\n\"In Sheffield, this is particularly felt as we are twinned with two Ukrainian cities; Donetsk and Khmelnytskyi.\"\nRusling said the delegation would be \"passing on the support of the vast majority of people in Sheffield for the Ukrainian people\".\nAs an elected representative from Sheffield, Rusling said he would \"very much like to publicise the challenges faced by Ukrainians\" and that they would be \"raising awareness\" for the whole of Britain, but particularly Sheffield.\nThe trip is being organised by people now living in Britain who fled Kyiv at the start of the Ukrainian war.", "url": "https://www.bbc.co.uk/news/articles/c9q403p3y45o"}