{"authors": ["Chloe Harcombe", "www.facebook.com"], "date_download": "2025-04-26 04:28:15", "date_modify": "2025-04-26 04:28:15", "date_publish": "2025-03-02 10:01:46", "description": "The 21-year-old was last seen leaving the Black Horse Pub on Thursday night.", "filename": "news_articles_c1en6p5np06o_1745641695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8c5b/live/f8a3f530-f74a-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1en6p5np06o_1745641695.html", "title": "Sebastian Sailes: Large search in Chippenham for missing man", "title_page": "Sebastian Sailes: Large search in Chippenham for missing man - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A large search operation is under way to help find a man who has been missing for three days.\nSebastian Sailes, 21, was last seen leaving the Black Horse Pub in Chippenham, Wiltshire, at about 23:30 GMT on Thursday. He was captured on CCTV heading towards Lovers Walk.\nHe is described as white, about 5ft 10in tall, slim build, with blond/brown hair and a long fringe. He was wearing a grey jumper, blue jeans, a beige fur-lined jacket and white Adidas trainers with a velcro strap across the top.\nAnybody with information or dashcam footage has been urged to contact Wiltshire Police.\nCh Insp Ben Huggins said the force was conducting \"multiple lines of inquiry\".\n\"Sebastian's disappearance is out of character and we and his family are extremely concerned for his welfare.\n\"We are working with Wiltshire Search and Rescue and we currently have extensive specialist resources in place to find him, so we would ask the public not to speculate and to allow us to conduct our inquiries,\" he added.\nOfficers have also released CCTV images from the day that Mr Sailes went missing.\nHe is believed to have been headed south along Avon Valley Walk towards his home address in Notton.", "url": "https://www.bbc.co.uk/news/articles/c1en6p5np06o"}