{"authors": ["Shariqua Ahmed", "www.facebook.com"], "date_download": "2025-04-26 06:26:59", "date_modify": "2025-04-26 06:26:59", "date_publish": "2025-02-28 19:17:30", "description": "Fred Lamb, alongside his brothers, was banned from the centre after exploiting homeless people.", "filename": "news_articles_c9wppyqlg44o_1745648819.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/36ee/live/d435f4d0-f51c-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9wppyqlg44o_1745648819.html", "title": "Man, 42, jailed for breaching Peterborough city centre ban order", "title_page": "Man, 42, jailed for breaching Peterborough city centre ban order - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 42-year-old man who was banned from a city centre after being found guilty of exploiting homeless people has been jailed again for breaching the order.\nFred Lamb was made subject of an interim slavery and trafficking risk order (STRO) banning him from Peterborough city centre, alongside his two brothers, Lucas Lamb, 36, and Joseph Lamb, 35, in October last year.\nHe was arrested on Thursday morning in Bridge Street after being spotted on CCTV sitting in a doorway and jailed for four weeks at Cambridge Magistrates' Court on Friday.\nHe was sent to prison earlier this month for breaching the court orders four times between December and January.\nThe STRO applications were made to magistrates by the Peterborough City Centre Neighbourhood Policing Team (NPT) after police received information about the brothers subjecting homeless people to violence and exploitation over a prolonged period.\nThe interim orders ban Fred and Lucas, both of Trelowen Way, Hempsted, Peterborough, and Joseph, of North Road, Whittlesford, Cambridge, from Peterborough city centre apart from for pre-arranged medical appointments.\nThe ban is in place until a final hearing, which is due to be held at Peterborough Magistrates' Court on 4 March.\nSgt Steve Rose said: \"It is incredibly disappointing to see Fred have such blatant disregard for the law and the order imposed on him.\n\"In the space of three weeks he has been convicted of five offences and jailed twice. We will continue to do our job by enforcing the order and putting him back before the courts any time he is found to have breached it.\n\"The brothers' behaviour towards homeless people in Peterborough has been concerning, with reports of violence, demands for money and threats.\n\"They pose a very real and serious threat to the safety of vulnerable members of our society, which is why these orders have been applied for.\"", "url": "https://www.bbc.co.uk/news/articles/c9wppyqlg44o"}