{"authors": ["Kelly Ng & Juna Moon", "www.facebook.com"], "date_download": "2025-04-26 06:14:56", "date_modify": "2025-04-26 06:14:56", "date_publish": "2025-03-01 23:06:02", "description": "Families of those killed in the Jeju Air crash have been smeared as \"fake victims\" and \"scammers\".", "filename": "news_articles_cx28n141209o_1745648096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c19c/live/6b9ce340-ef2f-11ef-855c-1dd88cc7dccb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx28n141209o_1745648096.html", "title": "Jeju Air: Families attacked online after South Korea plane crash", "title_page": "Jeju Air: Families attacked online after South Korea plane crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A plane crash in South Korea last December left Park Geun-woo an orphan. The 22-year-old had barely found space to mourn his parents when he came across a torrent of online abuse, conspiracies and malicious jokes made about the victims.\nThe Jeju Air plane, which was returning from Bangkok, Thailand, crash-landed at Muan International Airport on 29 December and exploded after slamming into a concrete barrier at the end of the runway, killing 179 of the 181 people on board.\nPolice investigations have identified and apprehended eight people who have been accused of making derogatory and defamatory online posts. These included suggestions that families were \"thrilled\" to receive compensation from authorities, or that they were \"fake victims\" - to the extent that some felt compelled to prove they had lost their loved ones.\nAuthorities have taken down at least 427 such posts.\nBut this is not the first time that bereaved families in South Korea have found themselves the targets of online abuse. Speaking to the BBC, experts described a culture where economic struggles, financial envy and social issues such as toxic competitiveness are fuelling hate speech.\nFollowing Seoul's Halloween crowd crush in 2022, victims and bereaved families were similarly smeared. A man who lost his son in the incident had his photo doctored by hate groups - showing him laughing after receiving compensation.\nPeople whose loved ones died in the Sewol ferry sinking in 2014 - a maritime disaster that saw 304 people killed, mostly schoolchildren - have also for years been the targets of hate speech.\nThe tragedy saw the government pay out an average of 420 million won ($292,840; £231,686) per victim - triggering comments that claimed this figure was unreasonably high.\n\"People who are living day by day feel the compensation is overrated and say the bereaved are getting 'unfair treatment' and that they are making a big deal when everyone's life is hard,\" Koo Jeong-woo, a sociology professor at Sungkyunkwan University, told news site The Korea Herald.\nIn later comments to the BBC, Prof Koo suggested that economic stress and a competitive job market - particularly in the wake of Covid - has left many people feeling socially isolated, exacerbating the issue of hate speech.\nMany South Koreans, he says, now \"view others not as their peers, but as adversaries\", pointing to a widespread culture of comparison in South Korea.\n\"We tend to compare a lot... if you put someone else down, it's easier to feel superior yourself,\" Prof Lim Myung-ho of Dankook University told the BBC. \"That's why there's a bit of tendency in Korea to engage in hate speech or make derogatory remarks, aiming to diminish others to elevate oneself.\"\nMr Park says the families of the Jeju Air crash victims have been characterised as \"parasites squandering the nation's money\".\nBy way of example, he refers to a recent article about an emergency relief fund of three million won ($2,055; £1,632) that was raised for the bereaved through donations. That article was met with a flood of malicious comments, many referencing the erroneous suggestion that taxpayers' money was used for the fund.\n\"It seems like the families of the Muan Airport victims have hit the jackpot. They must be secretly delighted,\" said one such comment.\nMr Park says these comments were \"overwhelming\".\n\"Even if compensation for the accident comes in, how could we possibly feel like recklessly spending it when it is the price of our loved ones' lives?\" he says. \"Every single one of those comments cuts us deeply. We're not here to make money.\"\n\"Too many people, instead of being sensitive, build their entertainment on others' suffering,\" he adds. \"When something like this happens, they belittle it and spew hateful remarks.\"\nJoshua Uyheng, a psychology professor in the Philippines who studies online hate, says that hate is often \"directed towards [those] we believe are gaining some advantage at our expense\".\n\"We feel hatred when we [think we] are getting the short end of the stick.\"\nIn the case of the Jeju Air crash, political dynamics only made things worse.\nThe accident came amid a period of political turmoil in South Korea, with the country reeling from suspended President Yoon Suk Yeol's shock decision to enact martial law - an incident that politically divided the country.\nMany supporters of President Yoon's right-wing People Power Party have, without evidence, pinned blame for the crash on the main opposition Democratic Party (DP), pointing to the fact that Muan Airport was originally built as part of a political pledge by the DP.\n\"The Muan airport tragedy is a man-made disaster caused by the DP,\" read one comment on YouTube. Another described it as \"100% the fault\" of the party.\nPark Han-shin, whose brother died in the plane crash, says he has been accused of being a DP member and \"fake bereaved family member\". So extensive were these claims that his daughter took to social media to call them out.\n\"It pains me deeply to see my father, who lost his brother in such a tragedy, being labelled a 'scammer'. It also makes me worried that this misinformation might lead my father to make wrong choices out of despair,\" she wrote on Threads two days after the incident.\nPark Han-shin says he is stunned by how people seem to \"enjoy taking advantage of others' pain\".\n\"That's simply not something a human being should do,\" he told the BBC.\n\"I am just an ordinary citizen. I am not here to enter politics. I came to find out the truth about my younger brother's death.\"\nWhile there are no perfect solutions to hate, experts say social media companies should establish policies on what constitutes hate speech and moderate content posted on their platforms accordingly.\n\"Online users should be able to report malicious posts and comments smoothly, and platform companies must actively delete such content,\" Prof Koo says. Law enforcement agencies should also take perpetrators to task, he adds.\nReminding people of their shared identities may also help, says Prof Uyheng.\n\"The less people feel that they are on opposite ends of a zero-sum game, perhaps the more they can feel that tragedies like these are the shared concern of us all - and that victims deserve empathy and compassion, not vitriol and condemnation.\"", "url": "https://www.bbc.co.uk/news/articles/cx28n141209o"}