{"authors": ["Sarah Jane Griffiths", "www.facebook.com"], "date_download": "2025-05-19 15:22:56", "date_modify": "2025-05-19 15:22:56", "date_publish": "2015-03-03 17:40:27", "description": "The debate around the future of the NHS is the subject of the Royal Court's new play Who Cares, being staged in the run up to the general election.", "filename": "news_entertainment-arts-31710775_1747668176.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81374000/jpg/_81374868_dec14-017-aw1-clear.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_entertainment-arts-31710775_1747668176.html", "title": "Royal Court to stage NHS play ahead of election", "title_page": "Royal Court to stage NHS play ahead of election - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The debate around the future of the NHS has inspired a new play, Who Cares, being staged by the Royal Court in the run up to the general election.\nThe verbatim script is based on interviews writer Michael Wynne has carried out with nurses, doctors, managers, politicians and paramedics.\nWynne told the BBC he hoped it would \"make people think in a different way\".\nIt will take place all around the London theatre building, which will be transformed into a hospital setting.\nWynne spent 18 months interviewing NHS staff, private healthcare workers and policy makers, using sections of the interviews to form the \"immersive\" play.\n\"I got some real inside access, so some of the material and subjects are areas that people don't really know about, even though it feels like the NHS is talked about a lot,\" Wynne said.\n\"On the whole people really wanted to talk and had amazing stories and were really passionate.\n\"But,\" he admits, \"it is such an emotional subject, sometimes people were quite cagey.\n\"One of the people I interviewed, on the release form he just wrote at the bottom, 'don't stitch me up', you know. So it's been complicated at times.\n\"I'm still waiting to hear back from a couple of people, to see if they'll let us use all their material.\"\nThe Royal Court had originally hoped to stage the play in an old hospital, but after delays decided to go with its own theatre as a venue. Wynne said they wanted it to run before the election as it was sure to be such an \"important issue\".\n\"Partly that was just from all my interviews, and finding out what was going on financially and on the front line with staff,\" he said.\n\"I felt it might bubble to the surface more.\"\nThe Royal Court's artistic director Vicky Featherstone called it \"timely and thrilling\" to be putting on the \"moving and incisive play\" this season.\n\"The NHS has become one of the most criticised yet vital parts of our society and the debate around it will play an important part in the run up to the election,\" she said.\nWho Cares is billed as giving \"unheard perspectives on the past, present and possible future of our NHS\", and Wynne hopes it will make an impact.\n\"I think theatre is really good for debates. I studied politics which is why I really love that in theatre,\" he said.\nHe added the play would pose several questions about the NHS: \"Do we appreciate it and do we take it for granted? Do we not realise how lucky we are at times, especially when you look at other countries - not just in terms of having to pay but in terms of the treatment that you get?\n\"So I do want to throw it back to the audience and make them think... or emotionally connect in a different way.\"\nWynne also hopes the hospital setting will help stir emotions.\n\"That idea of an immersive production, that you feel like you're in a ward or a waiting room - because we've all had those experiences - hopefully it will make you feel more before the play's even started,\" he said.\n\"I've mainly focused on the professional side - I haven't really interviewed patients, so my idea was that the audience will be on the patient journey.\"\n\"It starts off in a waiting room - in a rehearsal room in a building next door - and goes through to the ward. There's a garden, then we're going to go up the back stairs and go through rehearsal rooms, dressing rooms and then up to the theatre upstairs where the climax will be.\"\nBecause of \"the scale and ambition\" of the project, it has three directors on board - Debbie Hannan, Lucy Morrison and Hamish Pirie.\nRehearsals start on Monday and the play will run from 10 April - 16 May, with around 50 people at each performance.\nIt is just one of the productions announced as part of the forthcoming season at the Royal Court, with Gary Owen's Violence and Son and Debbie Tucker Green's new play Hang also on the bill.\nHang is billed as a \"morally challenging and taut three-hander\", looking at the relationship between a victim and the perpetrator of a crime.\nIt stars Marianne Jean-Baptiste and Clare Rushbrook, previously seen together on screen as Brenda Blethyn's daughters in Mike Leigh's Secrets and Lies.", "url": "https://www.bbc.com/news/entertainment-arts-31710775"}