{"authors": ["Victoria Scheer", "www.facebook.com"], "date_download": "2025-04-26 04:16:32", "date_modify": "2025-04-26 04:16:32", "date_publish": "2025-03-04 08:55:30", "description": "A 17-year-old arrested on suspicion of burglary is bailed pending further inquiries, police say.", "filename": "news_articles_cdx2590y1rgo_1745640992.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5cae/live/63061770-f8d9-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdx2590y1rgo_1745640992.html", "title": "Man fatally electrocuted in alleged burglary in Drighlington", "title_page": "Man fatally electrocuted in alleged burglary in Drighlington - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man found dead at a derelict industrial site after police responded to reports of a burglary is believed to have been electrocuted.\nEmergency services were called to Moor Top in Drighlington, near Leeds, shortly after 06:00 GMT on Monday to reports of an ongoing burglary. Ambulance staff also attended after a call about a man being electrocuted.\nWest Yorkshire Police said a 29-year-old man was found dead within a building at the scene.\nA 17-year-old boy, who was arrested on suspicion of burglary, was released on bail pending further inquiries, the force said earlier.\nThe scene was made safe on Monday afternoon, it added.\nThe incident caused a brief power cut for more than a thousand nearby homes, Northern Powergrid said.\nA spokesperson for the firm said: \"Power to 1,504 customers was interrupted at 08:27 GMT, and our engineers were on site within 30 mins.\n\"All customers had their power restored by 09:41 GMT.\n\"We thank our customers for their patience whilst we worked as quickly and as safely as possible to restore their power.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/cdx2590y1rgo"}