{"authors": ["Angela Ferguson", "www.facebook.com"], "date_download": "2025-04-26 04:21:01", "date_modify": "2025-04-26 04:21:01", "date_publish": "2025-03-03 15:11:50", "description": "Organisers launch a marathon relay and one-mile run to enable even more people to take part.", "filename": "news_articles_cevx4kgxndjo_1745641261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22eb/live/1e5dc3e0-f823-11ef-a033-b58d3bfaf1a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevx4kgxndjo_1745641261.html", "title": "Rob Burrow Leeds Marathon to include two new races", "title_page": "Rob Burrow Leeds Marathon to include two new races - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Organisers of the Rob Burrow Leeds Marathon have announced that a new marathon relay and one-mile run will be taking place this year to make the event \"even more inclusive\".\nThe two new elements of the event, which is dedicated to the late former Leeds Rhinos rugby player, will take place in May.\nBurrow's widow, Lindsey, was among those at the launch at Headingley Stadium in Leeds earlier.\n\"We're incredibly proud,\" said Tristan Batley-Kyle from organisers, Jane Tomlinson's Run For All.\nHe said the extra events \"provide a fantastic opportunity for everyone to be part of this special event and we encourage as many as possible to come along and get involved\".\nIn 2023, Kevin Sinfield stopped short of the finish at the inaugural Rob Burrow Leeds Marathon to carry his friend over the line.\nLindsey Burrow, who also ran the marathon in 2023 and last year, has announced that she will be running the London Marathon in April as a tribute to her husband.\nMrs Burrow, who will be taking part alongside her brother Mark, said running the marathon was \"not just a physical challenge; it's a deeply personal journey of love, loss, and resilience\".\n\"Each mile I run is a testament to his enduring legacy,\" she added.\nShe will be raising money for the Leeds Hospitals Charity and Leeds Rhinos Foundation, the official charity of Burrow's former club.", "url": "https://www.bbc.co.uk/news/articles/cevx4kgxndjo"}