{"authors": ["Jasmine Ketibuah-Foley", "www.facebook.com"], "date_download": "2025-04-26 04:36:25", "date_modify": "2025-04-26 04:36:25", "date_publish": "2025-02-28 11:55:51", "description": "Seven-year-old Bodhi celebrates with players after completing two years of treatment for leukemia.", "filename": "news_articles_ce348g9kylzo_1745642185.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4153/live/b5c591f0-ef9e-11ef-a69b-217c96182c8e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce348g9kylzo_1745642185.html", "title": "Boy who inspired Somerset cricket team rings cancer bell", "title_page": "Boy who inspired Somerset cricket team rings cancer bell - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A seven-year-old boy who became a cricket team's \"lucky mascot\" has celebrated the end of his treatment for cancer.\nBodhi visited Somerset County Cricket Club to share the good news after he rang the bell following more than two years of treatment for T-cell acute lymphoblastic leukaemia.\nHe first met the players when they visited the children's ward at Bristol Children's Hospital and they have been friends ever since.\nBodhi's mother Alice said his friendship with his favourite team makes him feel \"really special\" and has \"instilled confidence in him\".\nThe players spotted Bodhi in the crowd when they collected their Vitality Blast T20 trophy in 2023 and rushed him out to join them on the podium.\n\"It was a very surreal experience and exciting for him at a time when things were not very exciting,\" Alice said.\n\"He was taking chemotherapy in the stands that day,\" she said.\nPlayers Ben Green and Tom Kohler-Cadmore in particular have formed a strong bond with him.\nTom was struck by Bodhi's positivity when he met him at the hospital.\n\"Even on his bad days, he keeps his spirits up,\" Tom said.\n\"He is an inspiration. Everyone at the club adores him, and whenever he's around, he brings smiles to everyone's faces.\"\nTom has invited Bodhi and his family to T20 games over the years, and was thrilled to celebrate the trophy win with him.\n\"When he was in the crowd, it was special to have him be part of our journey that year,\" Tom said.", "url": "https://www.bbc.co.uk/news/articles/ce348g9kylzo"}