{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 12:46:34", "date_modify": "2025-05-20 12:46:34", "date_publish": "2023-08-03 00:00:00", "description": "The chancellor says higher rate will be a worry for many, but the government is on track to meet inflation targets.", "filename": "news_live_business-66386519_1747745194.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/13FD1/production/_130637818_hunt-grab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_business-66386519_1747745194.html", "title": "Interest rates live: Chancellor Hunt says plan is working as Bank raises rate to 5.25%", "title_page": "Interest rates live: Chancellor Hunt says plan is working as Bank raises rate to 5.25% - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's it from the live team today\nEmma Owen\nLive reporter\nAs ever, there's plenty of detail and analysis on our website for you to read at your leisure:\nStart here: Read our news story covering today's rate rise.\nHow it affects you: Read our guide on what it means for your money.\nWhat does it all mean? Our economics editor Faisal Islam shares his thoughts here.\nNeed help? We have a guide to some practical things you can do if you're struggling.\nThanks for joining us, and have a good evening.\nHere's what you need to know from today\nAnd with that last post on Andrew Bailey, we're going to wrap up our coverage of today's interest rate rise.\nIf you'd like a quick catch up on today's events, here are the key things to know:\nThe Bank of England increased its base interest rate to 5.25% from 5%, meaning the cost of borrowing for mortgages, credit cards and other loans is at its highest level since 2008\nProjecting the short-term future of the economy, the UK's central bank said it expects inflation to fall below 5% in the autumn or winter\nIt signalled for the first time that it would keep interest rates higher and that they would remain higher until UK inflation is brought under control\nGovernor Andrew Bailey said the rate of annual price rises must be brought back to its 2% target, as \"inflation hits the least well-off hardest\"\nThe Bank also predicted the UK will not enter a recession - where the overall economy shrinks - but it expects growth to be limited and unemployment to rise\nChancellor Jeremy Hunt acknowledged the rise will be difficult for many people, but says the government plan for lowering inflation is working and it is sticking to it\nHis Labour party counterpart, Rachael Reeves, says the government is saddling people with higher mortgages, food bills and taxes\nWe need to see reduced inflation before rates fall, Bailey says\nAndrew Bailey has been giving another round of media interviews.\nAnd he's told our economics editor Faisal Islam that the Bank of England interest rate won't come down until there is more solid evidence that inflation is falling.\nThe Bank's governor emphasised there were multiple routes to get the UK's annual rate of price rises back to its target of 2%.\nAnd asked about the prospects for economic growth, Bailey said the Bank had forecast the UK would avoid a recession - where the overall size of the economy shrinks - because of falling energy prices.\nQuote Message\nThe economy is more resilient but growth is pretty sluggish. However we are bringing inflation down and that is going to be good for growth going forwards.\"\nAndrew Bailey, Governor, Bank of England\nWhat happens if I miss a mortgage payment?\nIf you miss two or more months' repayments you are officially in arrears\nYour lender must then treat you fairly by considering any requests about changing how you pay, such as lower repayments for a short time\nThey might also allow you to extend the term of the mortgage or let you pay just the interest for a certain period\nHowever, any arrangement will be reflected on your credit file, which could affect your ability to borrow money in the future\nRead more here.\nWhen will interest rates peak - and start falling?\nMichael Race\nBusiness reporter\nThe financial markets are now predicting rates will peak at about 5.7% in early 2024 - that's down slightly on the expected peak of 5.8% prior to today's decision.\nNow, although interest rates may peak at a lower level, the Bank has said they will stay at a higher level for longer - but they've not said how long.\nAccording to economists at Capital Economics, since the Bank became independent from government in 1997, the average gap between the last interest rate hike and first cut has been 10 months.\nPaul Dales, its chief UK economist, thinks it may be longer - about 12 months before rates start to come down.\nOur plan is working, says Hunt, and we're sticking to it\nWe've just heard from Chancellor Jeremy Hunt, who's acknowledged that a rise in interest rates will be \"a worry for families with mortgages and for businesses with loans\".\nBut speaking to broadcasters a little while ago, the chancellor points to the Bank of England’s forecast that this time next year inflation will be at 2.8% and a recession will have been avoided.\nHe added that the forecast is vindication of the government’s plan to cut inflation.\nHe said the government must stick to that plan and not \"veer around like a shopping trolley... so that families and businesses can start to feel the benefits of that plan working\".\nIs Sunak on track to meet his five pledges?\nBack in January, Prime Minister Rishi Sunak set out his five priorities for 2023.\n\"I fully expect you to hold my government and I to account on delivering those goals,\" he said at the time.\nThe top priority is to halve inflation, which needs to be 5.3% or lower in the last three months of 2023 if the PM is to succeed.\nSo there was some good news for him this morning, when the Bank of England predicted that inflation will be about 5% by the end of the year.\nHowever, there was a more mixed picture on another key goal - to \"grow the economy\".\nThe Bank says it only expects economic growth of 0.5% in 2023 and 2024. That’s partly because of the battle to bring down inflation.\nRead more on the five priorities here.\n‘If people spend less we can’t survive’\nPeter Ruddick\nBusiness reporter\nHigher interest rates are designed to curb spending and bring down inflation. But what if you run a business reliant on consumer spending?\nPeterborough hair salon owner Jo Bevilacqua told me she understands the economics but that it is a “hard pill to swallow”.\n“We are still in pandemic recovery mode. We don’t want people to be spending less. Our livelihoods are in their hands. If they are not spending money then we can’t keep our doors open, pay our staff or pay our suppliers”, she says.\nJo isn’t immune from the rates pain either. She moved onto an interest only mortgage when her business was struggling. “I need to be in a position where everything calms down to be able to re-mortgage. It comes to me as a three-pronged attack. My own mortgage payments are going up, but there are also my staff and customers.”\nWhen will interest rates fall?\nFaisal Islam\nEconomics editor\nDon't expect rates to fall any time soon, but they may not go up much more from here. That is what is indicated by the Bank of England's important new language today.\nThe words are as important as its deed - raising rates for a 14th consecutive time.\nThe Bank had picked up that some households and some in the financial markets were assuming that once inflation had tumbled to more normal levels, that interest rates too would fall.\nBy stating that it will \"ensure that Bank rate is sufficiently restrictive for sufficiently long\", the Bank's Monetary Policy Committee is clearly indicating that rates could plateau above 5% across next year into 2025.\nHowever, it is also implicitly acknowledging that, at 5.25%, rates are now close to their peak in this cycle of 14 rises.\nRead more of Faisal's analysis here.\n‘I’m going to have to take on a lodger’\nPeter Ruddick\nBusiness reporter\nEvery time interest rates go up so do Nicola Valentine’s stress levels.\nAfter years of renting, she secured a mortgage on her Cambridgeshire home in November 2021. That means she’s one of the 800,000 people with fixed deals coming to an end this year.\n“My mortgage is basically going to go up by £300 or £400 a month,” she told me. “I don’t have it. I feel a bit paralysed about what to do.”\nNicola says she thought her house sharing days were over but now it looks like she is going to have to take on a lodger.\n“It took me years to get on the property ladder. This wasn’t the dream; this wasn’t the plan. I feel frustrated that, as a young professional, I should be able to afford a place and then be able to live in it.”\nLabour and Tories both digging for answers, says think tank boss\nWhat part do politicians have to play in all this?\nIt's mainly the Bank of England's job to get inflation down, says Paul Johnson, director of the politically independent economics think tank Institute for Fiscal Studies.\nBut he says politicians can make it worse and they must think about how to boost the economy in the future.\nHe tells BBC Radio 4's World at One that neither Labour or the Tories have produced detailed plans about what they would do after the next election, but both will face spending restraints.\nBoth are struggling to lay out \"clearly and honestly\" how they will tackle big problems facing the country, he says, such as how to overhaul planning in order to boost house-building and develop green infrastructure.\n'I'm lucky if I have £100 to pay for food and fuel'\nDave from Chester-Le-Street in Durham is on a variable rate mortgage and says he's having to forgo essential maintenance work on his home \"as a result of paying so much money onto my mortgage\".\n\"I was coming away with a good £400/500 at the end of every month after all my bills were paid. Now, I’m lucky if I have about £100 left over to pay for things like food and fuel for the entire month,\" he tells Radio 5 Live.\nDave says he's taken on a second job to help cover the bills.\n“I’ve barely got any time for myself. It’s crazy at the minute,” he says.\nIf you've got a mortgage, we've answered some of your common questions here.\n'I've fixed my mortgage for 10 years'\nMeleisha in Chesterfield is another Radio 5 Live listener. She was on a variable rate mortgage, but moved to a fixed-term mortgage two months ago at 4.7%, as she believes “rates aren't going down anytime soon”.\n“What people are forgetting is the rates we’ve had for the past 15 years, they weren’t the normal rate… people got into a false sense of security about what they were taking on, and weren’t looking far enough ahead,” she added.\nMeleisha says food prices and children’s consumables are expensive and that’s \"because a lot of it isn’t manufactured in this country - it’s a big problem”.\n“If you look at America, they do have a lot of manufacturing going on there, we don't have an awful lot here to sustain ourselves as a country.”\n'I'm waiting to see if my landlord will increase the rent'\nRents are rising at the fastest rate in eight years, and renters are feeling the knock-on effects of higher mortgages too.\nRadio 5 Live has been hearing from listeners today, and Sophie in Ipswich says her rent is “just about affordable” but she relies on Universal Credit outside of what she earns to “survive each month”.\nShe says she knows nothing about her landlord, and today's rise in interest rates means “a very uncertain time” as she waits to learn if they will raise the rent.\n“The only other alternative I have would be saying to the landlord, ‘look, I can’t afford this’, and basically waiting for him to give a section 21 [eviction notice],\" she says.\nFind out more about your renting rights - including how often your rent can be put up - here.\nHouse prices aren't crashing, but rents are up 20% - estate agent\nEsyllt Carr\nBusiness reporter\nSteve Woodford, who runs Haslams Estate Agents in Reading, says he hasn't seen the shock to the housing market that some predicted from higher interest rates.\n“I think we’ve expected the last two rate rises to have an impact, and they haven’t yet,” he says. Remember, higher rates make mortgages more expensive, and therefore could make the housing market less competitive.\n“The prices might have dropped back by 5 to 10% but, put that in the context of what we’ve seen post Covid - a 25% increase - it’s not a crash,” he says.\nHowever, he says there’s been a much clearer spike in the cost of renting, with rents up around 20% in the last two years.\nHe puts that down to a shortage of rental properties – but says despite reports, he’s not seen a big surge in landlords selling up.\nWhat we've learned today (so far)\nWe're leaving that press conference now. Safe to say it's been a busy few hours, during which the Bank of England (BoE) has increased the UK's interest rate - or base rate - for a 14th consecutive time.\nThe UK's interest rate has risen by 0.25% - from 5% to 5.25% - the highest rate since April 2008\nThe BoE also released its quarterly Monetary Policy Report, which warned that food inflation remained \"extremely high\" but could fall to around 10% (from the current 17.3%) by the end of the year\nIt also predicted that inflation would drop below 5% by then - meaning Prime Minister Rishi Sunak would meet his much-publicised target of halving inflation by the end of the year\nIn a press conference, BoE governor Andrew bailey said the path of UK inflation will depend largely on the jobs market and on pay\nChancellor Jeremy Hunt says inflation is expected to be below 3% in a year's time - but acknowledges that families will struggle with issues such as higher mortgage bills in the meantime\nLabour and the Lib Dems say the interest rate rise will affect those on lower incomes - blaming the government for the \"crisis\"", "url": "https://www.bbc.com/news/live/business-66386519"}