{"authors": ["Jake Garner", "Lauren Monaghan", "www.facebook.com"], "date_download": "2025-04-26 06:38:01", "date_modify": "2025-04-26 06:38:01", "date_publish": "2025-02-26 06:24:36", "description": "Some say parking and traffic problems are still a \"nightmare\" despite increased enforcement.", "filename": "news_articles_c4g79q33vveo_1745649481.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41c7/live/c03abab0-efb8-11ef-8e5c-0d2ce78dcb00.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g79q33vveo_1745649481.html", "title": "Newark and Gedling residents say new traffic measures 'not helping'", "title_page": "Newark and Gedling residents say new traffic measures 'not helping' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some residents say parking and traffic problems on their doorsteps are still a \"nightmare\" despite increased enforcement changes.\nNottinghamshire County Council's leader Sam Smith said he wanted to \"bust the myth\" parking wardens were not enforcing changes, saying roads in the county had been checked more than 230 times in the past 12 months.\nBut residents in Newark and Gedling say drivers are still parking on double yellow lines and blocking driveways during school pick-up and drop-off times.\nThe county council said the interests of residents were \"at the heart of [its] parking enforcement\", adding \"most people respect the restrictions\".\nAccording to the authority, in the past year, Barnby Road in Newark was visited 51 times, Burton Road and Beaumaris Drive in Gedling were visited 65 times and Wingfield Avenue in Worksop was visited 104 times.\nKing Edwin Primary School in Edwinstowe also had 14 patrols with a camera car, it added.\nThe council said its warden visits across the county were part of its plans to ensure better road safety and less congestion for pedestrians and drivers, by assessing where traffic builds up.\nThis included identifying roads that could become blocked by parked cars and ensuring better road visibility around schools.\nMargaret Stocks, 61, who lives in Gedling, described the parking situation on her street as \"a nightmare\".\n\"There's been no traffic wardens down our road, cars are still double parked regularly and residents struggle to get out of the street,\" said Ms Stocks.\n\"Just the other day a police car struggled to get down the street which poses a safety issue.\n\"An ideal scenario would be to stop parents parking on the road completely.\"\nDavid Blackmore, 74, from Newark, said he wanted cameras to be installed where he lived because without wardens present, \"people just don't care\".\nHe added roads were \"abysmal\" during school pick-up and drop-off times.\n\"Traffic wardens have been around more frequently in the last six months, once in a blue moon prior to that,\" he said.\nKerry and Dan Welch, 51 and 55 respectively, believed parking in narrow roads, while legal, was putting them and children at risk.\nMr Welch said: \"There seems to be very little enforcement with the existing double yellow lines so I don't know if the new lines make a difference at all.\n\"It's made no difference at all, in fact some of the attitude and aggression from some of the parents is shocking.\"\nMrs Welch added: \"I understand that it's perfectly legal to park there but these roads are narrow and it is a danger and a risk to us and the kids.\"\nCouncillor Neil Clarke, cabinet member for environment and transport, previously told the Local Democracy Reporting Service (LDRS): \"I know it's easy for people to say they never see wardens or camera cars, but I can assure residents we have over 20 officers who carry out patrols.\n\"We keep a record of where they have been and we can identify when wardens have visited villages or towns and carried out their work.\"\nCouncil leader Smith added: \"We have 25 dedicated civil enforcement officers who work all hours, every day and in all weathers to deliver this service.\n\"The objective around our parking campaign is that officers are patrolling streets and roads to minimise congestion on residential streets and keep people safe.\n\"We also patrol with our camera enforcement cars around schools so that children can get to and leave schools safely.\n\"We have 29 miles of double and single yellow line parking restrictions across the county and more than 300 schools with restrictions – schools can request a priority visit from the Camera Enforcement Vehicle if parking is a an issue.\"", "url": "https://www.bbc.co.uk/news/articles/c4g79q33vveo"}