{"authors": ["Kaya Black", "www.facebook.com"], "date_download": "2025-04-26 03:45:40", "date_modify": "2025-04-26 03:45:40", "date_publish": "2025-03-05 06:16:15", "description": "The rise of so-called fast fashion is leading to more clothes being disposed of, a waste centre says.", "filename": "news_articles_c1jpgp6djrjo_1745639140.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/675b/live/0d4db5f0-f919-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1jpgp6djrjo_1745639140.html", "title": "Why are more clothes than ever being discarded?", "title_page": "Why are more clothes than ever being discarded? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The rise of second hand fashion app Vinted and people eager to find bargains has seen a rocketing rise in fashion sustainability - but one textile waste sorting centre said it has seen more garments than ever being discarded.\nSome 15,500 tonnes of clothing came through the doors at SWD Clothing site in Bolton, Greater Manchester, last year.\nThe estimated 60 million clothes come in from charity shops and local authority textile bins across the region, but there are fears a growing amount cannot be recycled.\nThe reason is thought to be the rise of so-called fast fashion, the mass production and sale of low quality and cheaply-made clothing closely following the latest trends.\nSWD Clothing said fast fashion is having a major impact on business because these garments are not designed to last as long as regular items and, by the same token, are not designed to be recycled.\nSo what happens to the clothes and what can we do to help promote better habits?\nMany people imagine most old clothes being recycled in the same way we recycle plastic but SWD said it is not that simple. Clothes listed as \"recycled polyester\" in the shops are most likely made up of recycled plastic bottles rather than old clothing.\nPeter Page, head of recycling and sustainability, said: \"It's very difficult because clothing is not designed to be recycled. It's designed to be bought, to be worn and then to be thrown away.\"\nHe explained that for textile recycling you mostly rely on single fibre materials but the use of synthetic materials in most fast fashion items makes that difficult.\nWorkers grade the clothing by quality, category and colour and the clothes need to be clean and dry to get reused or recycled.\nMr Page said that 75 per cent of the clothing that comes through the centre can be reused and is sold to wholesalers across the world.\nClothes that get sent for recycling are also used for carpet underlay, noise insulation or wiping cloths for the oil and gas industry, while new ideas are always being explored.\nThen, about three per cent of the clothes that are not fit for reuse or recycling are sent for incineration.\nSWD is getting busier every year, Mr Page said, but the quality of the clothes coming in makes it harder for them to reuse.\nQuite a lot. Among them, Valery Touchet started free classes to teach people how to sew and repurpose old clothes instead of throwing them out.\nMs Touchet said she had noticed the tradition of hand-me-down clothes she grew up with had changed to a culture of simply \"buying and throwing\".\n\"I just thought if I could educate people on how to reuse what they have already instead of buying new, that would help,\" she said.\nThe classes have brought together women from all different backgrounds, many who said they valued the \"sisterhood\" they had built as well as the new skills they have learned.\nMeanwhile, the Manchester Fashion Movement is helping to educate people about sustainable fashion by going into schools, hosting panel talks and organising pop-up exhibitions and fashion shows with an educational message.\nAlison Carlin said she wanted to \"champion local northern talent\" and send people away from her events \"with knowledge they can go on to discuss\".\nA project by MMU has been collecting surplus clothing from across Greater Manchester, looking at whether the textiles are reusable, reusable but low quality, or non-reusable.\nMore than half the textiles in the sample were categorised as high-quality reusable, a small proportion were low quality but reusable, and less than a third were non reusable.\nAs part of the project, textiles that come through the Bolton sorting centre are being scanned to find out the material composition.\nThe hope is that the results will work out how many of the garments could be recycled into new textiles or other uses - in order to ensure fewer clothes go to waste.", "url": "https://www.bbc.co.uk/news/articles/c1jpgp6djrjo"}