{"authors": ["Ellie Brown", "www.facebook.com"], "date_download": "2025-04-26 03:48:46", "date_modify": "2025-04-26 03:48:46", "date_publish": "2025-03-05 14:26:20", "description": "National Highways has submitted plans for a stretch of the A46 linking Coventry with the M6 and M69.", "filename": "news_articles_cdjyxv324n8o_1745639326.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c87c/live/67e78e00-fa54-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyxv324n8o_1745639326.html", "title": "Coventry A46 junction redesign may lead to 75 weeks of roadworks", "title_page": "Coventry A46 junction redesign may lead to 75 weeks of roadworks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Drivers in Coventry face almost a year and a half of roadworks, if plans to upgrade a major route are given the go-ahead.\nThe scheme could mean narrow lanes and a 40mph speed limit for 75 weeks at the A46 Walsgrave junction to allow improvement work.\nA stretch of the dual carriageway linking the city with M6 and M69 motorways would also be closed at times while work takes place.\nDetails have been sent to the government and, if approved, work would start in autumn 2026 at the earliest and finish in spring 2028.\nBosses are planning to remove the existing roundabout to allow the A46 to be realigned through that. Smaller roundabouts and link roads either side, along with a flyover above the A46, would allow access to the rest of the road network.\nIt would cut congestion and make journeys quicker and safer, planning documents said.\nThere would be three months at the start of the project where there would be no need for fixed traffic management, bosses said.\nAfter this, narrow lanes would be installed on the main A46 and B4082 link road and the speed limit will be reduced to 40mph, according to a traffic management proposal.\nNational Highways said full road closures of part of the A46 and B-road to Walsgrave would be needed at times while work takes place.\nIt would also shut for a stretch between the Binley roundabout and the M69/M6 junction.", "url": "https://www.bbc.co.uk/news/articles/cdjyxv324n8o"}