{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:58:19", "date_modify": "2025-04-26 07:58:19", "date_publish": "2025-02-25 11:44:46", "description": "Two possible cases squirrelpox have been reported in Bridge of Allan", "filename": "news_articles_c0kg5vxgl3yo_1745654299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/722f/live/f9f9f850-f365-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0kg5vxgl3yo_1745654299.html", "title": "Fears fatal red squirrel disease has moved north", "title_page": "Fears fatal red squirrel disease has moved north - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two possible cases of a virus deadly to red squirrels have been reported near Stirling - prompting fears the disease has spread northwards.\nResidents of Bridge of Allan have been asked to take in garden feeders for a month following a possible squirrelpox outbreak in the area.\nMembers of the public have reported two instances of sick and lethargic-looking red squirrels near Mine Wood.\nThe disease is carried by grey squirrels but is deadly only to reds.\nSaving Scotland's Red Squirrels (SSRS) said it was \"concerned\" at the news and has asked the public to submit photos of any sick or dead red squirrels they find.\nThe first known squirrelpox outbreak in Scotland occurred in 2007 near Lockerbie and since then the disease has arisen in various red squirrel populations across the south of the country.\nThe first death of a red squirrel north of Scotland's central belt was confirmed in Dunfermline last spring following a post-mortem examination.\nSymptoms include ulcers, scabs and weeping lesions on the face, paws and genitalia, all of which can prevent reds from eating, drinking or moving.\nIt is usually fatal within two weeks and an outbreak can cause a substantial reduction in local populations of reds.\nThe SSRS said the spread of squirrelpox poses a major threat to Scotland's more northerly red squirrels.\nGail Turney from SSRS said: \"We don't know for certain what these squirrels may be suffering from, as red squirrels can be affected by a number of illnesses especially during the winter.\n\"But as a precaution, we are now asking all those living in Bridge of Allan to take immediate action and protect the local red population by taking in all wildlife feeders for the next month to help prevent any possible spread of disease.\"\nAlthough squirrelpox is not considered harmful to humans, anyone who sees a sick red squirrel is advised not to approach it, but instead contact the SSRS for advice.\nPhotos of sick or dead red squirrels should be submitted to squirrels@scottishwildlifetrust.org.uk", "url": "https://www.bbc.co.uk/news/articles/c0kg5vxgl3yo"}