{"authors": ["Patrick Barlow", "www.facebook.com"], "date_download": "2025-04-26 03:46:18", "date_modify": "2025-04-26 03:46:18", "date_publish": "2025-03-05 06:05:27", "description": "The Medway Maritime Hospital is rated as \"requires improvement\" by the Care Quality Commission.", "filename": "news_articles_cp3yk1lv9qgo_1745639178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7b47/live/48b3b980-f907-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3yk1lv9qgo_1745639178.html", "title": "Kent: Patients face 'degrading' waits at Medway Maritime Hospital", "title_page": "Kent: Patients face 'degrading' waits at Medway Maritime Hospital - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Frail patients at an emergency department were \"told to soil themselves\" because there was no-one to take them to the toilet, staff have said.\nPatients at the Medway Maritime Hospital in Gillingham, Kent, faced waits of more than 50 hours with no access to washing facilities, with some left \"sitting in their own faeces\", the Care Quality Commission (CQC) was told.\nAn inspection by the CQC in February 2024 rated the emergency department as \"requires improvement\" and issued a warning notice for breaches of health and social care regulations.\nJayne Black, chief executive of the Medway NHS Foundation Trust which runs the hospital, apologised to patients and said improvements had since been made.\nA CQC report published on 5 March described patients who said they saw staff \"crying on the phone for help\", but \"no one seemed to turn up\".\nIn a visit on 21 February, 2024, inspectors said they found the emergency department \"was not suitable for the number of people\", with 14 patients in a resuscitation area designed for nine people and 15 people being treated in the corridor of the department.\nOne patient said they \"had been left sitting in their own faeces all day because there was no one available to help\".\nAnother patient told inspectors they had been sitting on a chair in the corridor for 55 hours.\nWhen they asked staff if they could shower, they were told they could only wash by splashing themselves with water from the toilet sink.\nInspectors also saw a patient \"passing urine into a bottle with no privacy curtains\".\nSome staff also described a \"poor culture\" and feared reprisals for raising concerns.\nFive staff told inspectors they had been threatened with disciplinary action or targeted for speaking up.\nPatients, relatives and staff contacted the CQC before the inspection to report how patients suffered \"degrading experiences\".\n\"Examples included frail patients who could not get up and take themselves to the toilet were left to soil themselves and left in soiled clothing and bedclothes for hours,\" said the CQC.\nStaff also reported that \"frail, bed-bound patients had been told to soil themselves because there were not enough staff to take them to the toilet\", it added.\nMs Black said: \"We are very sorry that despite the best efforts of our hard-working staff, at the time of the last February's inspection the inspection team found that our care fell below the standard that everyone should expect in their time of need.\n\"Over the last year we have made significant improvements so that patients attending our Emergency Department are treated sooner, are cared for in areas more suitable for their needs, and receive appropriate and compassionate care.\n\"We recognise there is much more for us to do, particularly to reduce delays for patients waiting to be admitted to a ward, so that every patient receives the high standard of care that we aspire to provide.\n\"Staff throughout the hospital continue to work tirelessly, together with our ambulance, community and social care partners, to reduce delays and improve care for all for patients attending our Emergency Department.\"\nImprovements highlighted by the trust included better waiting times and a new ward for patients with breathing and heart conditions, which opened in April 2024.", "url": "https://www.bbc.co.uk/news/articles/cp3yk1lv9qgo"}