{"authors": ["Maia Davies", "www.facebook.com"], "date_download": "2025-04-26 04:10:25", "date_modify": "2025-04-26 04:10:25", "date_publish": "2025-03-02 17:40:38", "description": "It marks the first time the US has had an official language since the country was founded.", "filename": "news_articles_c2kgq5pzpllo_1745640625.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2391/live/7c25fc70-f785-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kgq5pzpllo_1745640625.html", "title": "Trump makes English official language of US", "title_page": "Trump makes English official language of US - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "President Donald Trump has signed an executive order making English the official language of the United States.\nIt means government agencies and organisations that receive federal funding can choose whether they want to offer documents and services in languages other than English.\nIt rescinds a policy that required such bodies to provide language assistance to non-English speakers signed by former president Bill Clinton in 2000.\n\"Establishing English as the official language will not only streamline communication but also reinforce shared national values, and create a more cohesive and efficient society,\" the order says.\nThis marks the first time the US has designated an official language at the federal level since the country was founded almost 250 years ago.\nIt is noted in the order, external that agencies do not need to change, remove or stop offering any such assistance they already provide.\n\"In welcoming new Americans, a policy of encouraging the learning and adoption of our national language will make the United States a shared home and empower new citizens to achieve the American dream,\" the order reads.\n\"Speaking English not only opens doors economically, but it helps newcomers engage in their communities, participate in national traditions, and give back to our society.\"\nIt also says it celebrates the \"long tradition of multilingual American citizens who have learned English and passed it to their children for generations to come\".\nNearly 68 million of the country's 340 million residents speak a language other than English, according to the US Census Bureau.\nThis includes more than 160 Native American languages.\nSpanish, various Chinese languages and Arabic are among the languages spoken the most after English, according to the Census Bureau.\nRepublicans have previously tried to get English designated as the US's official language, with members of the House introducing legislation that failed in 2021.\nThose who opposed their efforts said an official language was not necessary given the high numbers of people who speak English without it being designated as such.\nThey also said establishing one could promote discrimination against non-English speakers.\nDuring his presidential campaign in 2024, Trump referenced non-English languages while calling for stricter immigration policies.\n\"It's the craziest thing - they have languages that nobody in this country has ever heard of. It's a very horrible thing,\" he told a crowd of supporters in February 2024.\nApproximately 180 countries around the world have official national languages, and most countries recognise multiple official languages.\nSeveral countries do not have an official language, including the United Kingdom.\nMore than 30 US states have designated English as the official language, while Alaska and Hawaii have also given official status to several native languages.", "url": "https://www.bbc.co.uk/news/articles/c2kgq5pzpllo"}