{"authors": ["Jacqueline Howard", "Emma Rossiter", "www.facebook.com"], "date_download": "2025-04-26 06:24:37", "date_modify": "2025-04-26 06:24:37", "date_publish": "2025-02-28 22:55:50", "description": "A statement from No 10 confirms he spoke with both and \"retains unwavering support for Ukraine\".", "filename": "news_articles_c3vw9p5lw5xo_1745648677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5db4/live/f0562fd0-f6ad-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vw9p5lw5xo_1745648677.html", "title": "Starmer speaks to Trump and Zelensky following White House row", "title_page": "Starmer speaks to Trump and Zelensky following White House row - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Prime Minister Sir Keir Starmer has spoken to US President Donald Trump and Ukrainian President Volodymyr Zelensky after a meeting between the two leaders in Washington descended into a row about US support for Ukraine.\nThe initially cordial White House talks ended in a furious row in front of the media, as Trump told his Ukrainian counterpart to be more thankful for US aid and accused him of \"gambling with World War Three\".\nNo 10 confirmed the prime minister had spoken with both presidents and that he retained \"unwavering support for Ukraine\".\nOn Sunday, Sir Keir will host a summit of European leaders to discuss an end to the war between Ukraine and Russia.\nZelensky arrived in the UK on Saturday ahead of the meeting, which will now be overshadowed by events in Washington.\nSpeaking on Friday, a No 10 spokesperson Sir Keir was \"doing all he can to find a path forward to a lasting peace based on sovereignty and security for Ukraine\".\nThe Oval Office spat also prompted words of support for Zelensky from key European allies, including French President Emmanuel Macron, German Chancellor Olaf Scholz and Polish Prime Minister Donald Tusk.\nFormer Foreign Secretary Jeremy Hunt told BBC Radio 4's Today programme that there remains a \"sliver of hope\" for a peace deal.\n\"Trump wants a sustainable peace in Ukraine because he sees this as a very big part in his legacy and he wants that to last for many years,\" Hunt said.\n\"He doesn't want to withdraw from Ukraine and abandon it to the Russians in the way that the United States abandoned Afghanistan to the Taliban - he knows that would be very bad for his reputation, for America's reputation - so in the end he needs a ceasefire that both Zelensky and Putin are part of.\"\nHunt stressed that what was needed for negotiations to restart was \"a little bit of time\" for \"tempers to cool down\".\nThe heated clash in the Oval Office of the White House - in which both Trump and Zelensky interrupted each other repeatedly - was supposed to be a prelude to the two leaders signing a deal that would pave the way towards US access to Ukrainian minerals.\nA news conference scheduled for later in the day was cancelled, and Zelensky was asked to leave the White House before the agreement could be signed.\nIn a later interview with Fox News, Zelensky said the public spat \"was not good\" - but the relationship between him and Trump could be salvaged.\nWriting on Telegram on Saturday, the Ukrainian leader said: \"It is very important for us that Ukraine is heard and that no one forgets about it, neither during the war nor after.\"\nSir Keir's own meeting with Trump on Thursday took on a much more cordial mood.\nThe pair agreed to begin work on a new US-UK trade deal, and Trump appeared to have softened his stance towards Zelensky.\nThere had been speculation that Sir Keir had also gone into the visit seeking a US security \"backstop\" in a European-led peace plan for ending the war in Ukraine. However, the US president stopped short of making such a commitment.\nTrump had previously criticised Sir Keir and France's Macron of having \"done nothing\" to seek an end to the war in Ukraine.\nReacting to Friday's far more acrimonious Oval Office meeting, Conservative leader Kemi Badenoch said that \"respectable diplomacy is essential for peace\", adding that a \"divided West only benefits Russia\".\nLiberal Democrat leader Sir Ed Davey suggested Trump and US Vice-President JD Vance were \"bullying the brave true patriot Zelensky into accepting a deal that effectively hands victory to Russia\".\nHe also said that he was \"proud that the UK has been Ukraine's staunchest ally from the start\" but that the PM should \"show British leadership on Ukraine by inviting President Zelensky to address Parliament on Monday\".\nThe leader of the SNP in Westminster, Stephen Flynn, said an offer of a second state visit - made during Starmer's White House visit, external - should be revoked.\nMeanwhile, Reform UK leader Nigel Farage said the spat was \"regrettable\" and would \"make Putin feel like the winner\".\nHe added that it was \"not the end of the story\" and that a peace deal \"with the right security guarantees\" for Ukraine was \"essential\".\nWhile reaction among US politicians appeared to largely fall along partisan lines, in Ukraine there was broad appreciation for Zelensky holding his ground over what many Ukrainians see as an existential war.\nRussia, meanwhile, said Trump and Vance had acted with restraint.", "url": "https://www.bbc.co.uk/news/articles/c3vw9p5lw5xo"}