{"authors": ["Samantha Noble", "www.facebook.com"], "date_download": "2025-04-26 03:44:39", "date_modify": "2025-04-26 03:44:39", "date_publish": "2025-03-05 07:01:16", "description": "Saffron Dixon, from Chesterfield, is raising funds to help prevent dogs being killed in the country.", "filename": "news_articles_c2kg111eve8o_1745639079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/89d1/live/e4812a20-f91e-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kg111eve8o_1745639079.html", "title": "Chesterfield woman's relief as Morocco street dogs scheme starts", "title_page": "Chesterfield woman's relief as Morocco street dogs scheme starts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman campaigning to save street dogs in part of Morocco says she is relieved after a programme to vaccinate and sterilise them began.\nSaffron Dixon, of Chesterfield, Derbyshire, decided she wanted to help after learning millions of dogs were to be killed in a clean-up of streets ahead of the Fifa World Cup in 2030, which Morocco will jointly host.\nThe Embassy of Morocco in London previously told the BBC that dogs that were neutered and vaccinated should be protected - while harmful practices for controlling stray animals were prohibited.\nMiss Dixon said the programme she was supporting started last week with the first six dogs treated.\nMiss Dixon's campaign began after she went to Taghazout in November 2023 and a pack of stray dogs would visit her hotel where she would feed them.\nShe returned the following year and met a woman who runs an organisation helping stray dogs called Al-Nour Animal Help.\nMiss Dixon is now supporting the group in a programme to vaccinate, sterilise, microchip and tag street dogs.\nThe 24-year-old has raised more than £6,000 towards the efforts.\nMiss Dixon said, after the programme began last week, she \"cried all day because I have worked so hard on it\".\n\"It has taken a lot to do it so I feel like quite relieved now... I'm just hoping that these ones [dogs] will be left alone,\" she added.\nShe is also planning to do a skydive in April for the campaign.", "url": "https://www.bbc.co.uk/news/articles/c2kg111eve8o"}