{"authors": ["Lorna Bailey", "Will Jefford", "www.facebook.com"], "date_download": "2025-04-26 04:34:44", "date_modify": "2025-04-26 04:34:44", "date_publish": "2025-02-28 12:52:30", "description": "Keaton Slater, 12, died after being hit by a car on his way home from school.", "filename": "news_articles_cx299839lg1o_1745642084.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d519/live/b73157a0-f5d8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx299839lg1o_1745642084.html", "title": "Keaton Slater's brother boxing to help deal with hit-and-run death", "title_page": "Keaton Slater's brother boxing to help deal with hit-and-run death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The brother of a 12-year-old boy who died in a hit-and-run crash in Coventry has said turning to boxing has helped him with his mental health.\nJosh Slater's brother, Keaton, died after being hit by a black BMW while on his way home from school on 14 June, 2024.\nThe 34-year-old said he had struggled following the death, before picking up boxing at the \"perfect time\".\nHe is now setting up a charity boxing event in April, which will help fund a family fun day for Coventry children on the anniversary of Keaton's death.\nSpeaking to BBC Radio CWR, Mr Slater said he had turned to alcohol and bad behaviour as he tried to deal with the death of his brother, who was struck while crossing Radford Road in Coventry.\nDolars Aleksanders, 21, who is wanted on suspicion of causing death by dangerous driving is believed to have travelled to Latvia following the crash.\nThe Keaton family are also behind a campaign calling for the man to be extradited back to the UK.\n\"I'm just glad to be doing something positive for my brother and putting on a fun day in his memory,\" Mr Slater said.\n\"I've always been into boxing and I was planning to try it last year, but it was very soon after the funeral so I didn't have the head space for it.\n\"I was generally not handling it well.\n\"It's good to have something to focus on and doing something that I really enjoy.\"\nHe added that the sport was a good way to get his \"anger out\" and a \"de-stresser\".\nThe family are hoping to use the money raised in the white-collar bout on 5 April to help fund a family fun day in Coventry on the one-year anniversary of Keaton's death.\n\"It's about all of us giving something back to Coventry because they've given us so much,\" Mr Slater said.\n\"Without everyone's support, I'm not sure how we would have got through it.\n\"It's amazing and it's put a bit of faith in humanity back in me.\"", "url": "https://www.bbc.co.uk/news/articles/cx299839lg1o"}