{"authors": ["Carolyn Atkinson and Ben Robinson", "www.facebook.com"], "date_download": "2025-04-26 03:59:51", "date_modify": "2025-04-26 03:59:51", "date_publish": "2025-03-04 06:00:06", "description": "“Kasibba”, who is non-verbal and had no family to speak for her, was one of hundreds wrongly detained.", "filename": "news_articles_cly43png991o_1745639991.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df8e/live/79a76760-f8c3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly43png991o_1745639991.html", "title": "Autistic woman wrongly locked up in mental health hospital for 45 years", "title_page": "Autistic woman wrongly locked up in mental health hospital for 45 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An autistic woman with a learning disability was wrongly locked up in a mental health hospital for 45 years, starting when she was just seven years old, the BBC has learned.\nThe woman, who is believed to be originally from Sierra Leone, and who was given the name Kasibba by the local authority to protect her identity, was also held on her own in long-term segregation for 25 years.\nKasibba is non-verbal and had no family to speak up for her. A clinical psychologist told File on 4 Investigates how she had begun a nine-year battle to release her.\nThe Department of Health and Social Care told the BBC it was unacceptable that so many disabled people were still being held in mental health hospitals and said it hoped reforms to the Mental Health Act would prevent inappropriate detention.\nMore than 2,000 autistic people and people with learning disabilities are still detained, external in mental health hospitals in England - including about 200 children. For years, the government has pledged to move many of them into community care, because they do not have any mental illness.\nThe government promised to take action after a BBC undercover investigation in 2011 exposed the criminal abuse of people with learning disabilities at Winterbourne View private hospital near Bristol.\nBut all key targets in England have been missed. In the past few weeks, in its plan for 2025-26, external, NHS England said it aimed to reduce the reliance on mental health inpatient care for people with a learning disability and autistic people, delivering a minimum 10% reduction.\nHowever, Dan Scorer, head of policy and public affairs at the charity Mencap, is not impressed. \"Hundreds of people are still languishing, detained, who should have been freed and should be supported in the community, because we haven't seen the progress that was promised,\" he told us.\nDr Patsie Staite learned of Kasibba's incarceration in 2013 when she was a rookie clinical psychologist carrying out a routine review of her care. But it would take nine years to free her.\n\"I hadn't ever seen anyone living in the situation that she was living in. And I think what was really shocking was it was all legitimised,\" Dr Staite told the BBC. She said the apparently legitimate hospital setting masked the reality that Kasibba \"was locked up for sometimes more than 23 hours a day\".\nReturning to the site of the hospital - which cannot be named to help protect Kasibba's identity - Dr Staite pointed out a hole in the fence. It had been cut out, she said, so Kasibba could watch people walking by from the outside space of the locked annex where she was held.\nIt is thought Kasibba, who is now in her 50s, was trafficked from Sierra Leone before the age of five. She lived in a children's home for a while, but that placement broke down and, by the age of seven, she was moved into the long-stay hospital.\nDr Staite said that staff had described Kasibba as \"dangerous\" and an \"eye-gouger\".\nShe discovered a single incident in the records which appeared to have led to these accusations of violence. Decades earlier, when Kasibba was 19 and before she was placed in long-term segregation, a fire alarm had gone off and the locked ward was being evacuated.\nKasibba was distressed and, in the confusion, she was approached by another patient. She scratched her, causing a cut to the other patient's eye.\n\"That was how the incident was talked about ever since, 'she's an eye gouger and she caused so much harm to this other person',\" said Dr Staite. But \"it just didn't ring true\", she said, that a middle-aged woman with a learning disability who had lived in the hospital for decades could be that dangerous.\nAfter months of work, Dr Staite submitted a 50-page report to Camden Council - the local authority in north London which had originally placed Kasibba in the hospital. Dr Staite said it had already been accepted that Kasibba did not have a mental illness and her report concluded she was not dangerous and was safe to live in the community.\nA team of health and social care professionals was then set up in 2016, calling themselves \"the escape committee\". Their mission was to free Kasibba.\nLucy Dunstan, from disability rights organisation Changing Our Lives, was appointed to be Kasibba's independent advocate and to build a compelling case for why it was safe for her to leave the hospital.\nBut Kasibba's release could only be signed off by the Court of Protection, which makes decisions for people who do not have the mental capacity to make their own.\nMs Dunstan said when she first met Kasibba, hospital staff simply introduced her as \"the eye-gouger\".\nShe said she recalls looking at Kasibba through a small window in the door that kept her locked in. \"She was just lying on the the settee. It was a very empty room. Her life was completely impoverished,\" she said.\nIt would be six years from first having met Kasibba before Ms Dunstan got a call to tell her that the Court of Protection had ruled she could leave hospital. \"I cried. Joy. Relief. Admiration for her. Pride,\" she said. \"It's not about me and what we did, but that she did it and she showed them.\"\nNow Kasibba lives in the community with the help of support workers, who engage with her and communicate with gentle touches, gestures and clear language. Her care manager said she loved fashion, was proud of her home and enjoyed social interaction.\n\"She has the most amazing sense of humour. She's a beautiful human being,\" the manager said. \"After about two weeks of working here she actually came up and gave me a hug. This is not an eye-gouger, you know.\"\nThe Mental Health Bill going through parliament will mean autistic people and those with learning disabilities in England and Wales, who do not have a mental health condition, will no longer be able to be detained for treatment.\nBut the government has said it will not bring in any changes until it is satisfied there is sufficient alternative support in the community. And it will still allow people to be detained in hospital legally for up to 28 days for assessment.\nJess McGregor, executive director of adults and health at Camden Council, said it was a \"tragedy\" that Kasibba had spent most of her life held in hospital. \"I'm personally sorry,\" she said. \"She shouldn't have experienced what she did.\"\nThe NHS mental health trust, which cannot be named to protect Kasibba's identity, said at no point had the care it delivered been brought into question and the service was rated as outstanding by the Care Quality Commission.\nThe trust told File on 4 Investigates that anyone assessed as needing long-term segregation had a self-contained property with their own bedroom, bathroom, living room and garden.\nThe trust said from 2010 it had been working with local authorities to put plans in place to support the discharge of all long-term residents to more appropriate care, where possible within the community, but said they were prevented from doing so by a legal case brought by the families of other patients.\nIt said its staff had then worked tirelessly for years supporting local authorities to put the necessary support in place in the community and they were able to successfully close the service in 2023.", "url": "https://www.bbc.co.uk/news/articles/cly43png991o"}