{"authors": ["Harriet Orrell", "www.facebook.com"], "date_download": "2025-04-26 03:46:29", "date_modify": "2025-04-26 03:46:29", "date_publish": "2025-03-05 05:51:08", "description": "Africa's Sahel region accounts for more than half of terror-related killings, a new reports says.", "filename": "news_articles_cp8vyl3j5kko_1745639189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/507d/live/ed4a5c50-f471-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8vyl3j5kko_1745639189.html", "title": "The region with more 'terror deaths' than rest of world combined", "title_page": "Africa's Sahel: The region with more 'terror deaths' than rest of world combined - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Sahel region of Africa is the \"epicentre of global terrorism\" and now, for the first time, accounts for \"over half of all terrorism-related deaths\", according to the Global Terrorism Index (GTI).\nIts new report says that in this semi-arid area to the south of the Sahara Desert 3,885 people out of a worldwide total of 7,555 died.\nThe GTI report adds that while the global figure has declined from a peak of 11,000 in 2015 the figure for the Sahel has increased nearly tenfold since 2019, as extremist and insurgent groups \"continue to shift their focus\" towards the region.\nThe index is published by the Institute for Economics and Peace, a think-tank dedicated to researching global peace and conflict.\nIt defines terrorism as the \"threatened or actual use of illegal force and violence by a non-state actor to attain a political, economic, religious, or social goal through fear, coercion, or intimidation\".\nThe Sahel stretches from the west coast of Africa eastwards across the continent. The GTI's definition of the region includes parts of 10 countries: Burkina Faso, Mali, Niger, Cameroon, Guinea, The Gambia, Senegal, Nigeria, Chad and Mauritania.\nThe Sahel has some of the world's highest birth rates, and almost two-thirds of the population is under 25.\nUnlike in the West where \"lone actor terrorism is on the rise\", the Sahel, has seen the rapid expansion of militant jihadist groups, according to the report.\nIt says most of the attacks there were carried out by two organisations: the Islamic State group affiliate in the Sahel and Jama'at Nusrat al-Islam wal Muslimeen (JNIM) - a branch of al-Qaeda.\n\"They're trying to introduce new legal orders,\" explains Niagalé Bagayoko, chair of the African Security Sector Network. \"They're trying to administer justice in particular based on Sharia.\"\nAnd in the process, she says they \"are competing with one another\" for land and influence.\nIS-Sahel has reportedly doubled the amount of territory it controls in Mali since the country's coups of 2020 and 2021 - largely in the east near its borders with Burkina Faso and Niger - while JNIM also continued to expand its reach, according to a UN panel of experts on Mali.\nThe GTI report notes that both groups have recruited more fighters, including child soldiers in the case of IS.\n\"In some instances, people tend to be in a point of choicelessness by the time they decide to join a militant group,\" says Beverly Ochieng, a senior analyst specialising in Francophone Africa at Control Risks, a geopolitical risk consultancy. \"These are communities that are very vulnerable.\"\nThe GTI report explains how political instability and weak governance are creating ideal conditions for insurgent groups to grow, pointing to conflict as \"the primary driver of terrorism\".\nThe Sahel is sometimes referred to as the \"coup belt\" of Africa.\nSince 2020 there have been six successful coups in the region as defined by the GTI report: two in Mali, two in Burkina Faso, one in Guinea and one in Niger. These countries are now all run by military juntas.\n\"The Sahel has experienced a breakdown in state society,\" says Dr Folahanmi Aina, an expert on the region at SOAS University in London.\n\"It's been informed by years of neglect from political leaders who haven't necessarily prioritised people-centred governance and local grievances have festered, resulting in terror groups trying to leverage these.\"\nThere was a perception that civilian governments were unable to combat security threats from insurgent groups, \"but despite these juntas taking over, they haven't necessarily improved optics on the ground and in fact insecurity has worsened,\" says Dr Aina. \"The juntas are professionally unprepared for the rigours of governance.\"\nIn fact in 2024, Burkina Faso \"remained the country most affected by terrorism for the second year in a row\" according to the GTI.\nIn the 14 years since the report began, it is the only country to top the list that is not Iraq or Afghanistan.\nJihadist groups sustain their operations in the Sahel with a range of illicit economic activities, including kidnap for ransom and cattle rustling, according to the GTI report.\nThe region has also become a key route for drug traffickers bringing cocaine from South America to Europe, and the report notes that \"drug trafficking represents one of the most financially lucrative illicit activities linked to terrorism in the Sahel\".\nIt points out that that some groups veer away from directly engaging in organised crime, however, preferring to \"make money by imposing taxes or providing security and protection in exchange for payment\".\nIt goes on to explain: \"This model not only generates revenue but also helps these groups integrate into local communities, strengthening their influence.\"\nInsurgent groups are also vying for control of the Sahel's rich natural resources. Niger is the world's seventh-largest producer of uranium, and unregulated artisanal gold mines found throughout the region are often taken advantage of by the likes of IS-Sahel and JNIM.", "url": "https://www.bbc.co.uk/news/articles/cp8vyl3j5kko"}