{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 06:19:39", "date_modify": "2025-04-26 06:19:39", "date_publish": "2025-03-01 07:08:47", "description": "A total of 7,800 Argyle supporters attending fifth round tie at the Etihad Stadium.", "filename": "news_articles_cqlyyezg5zvo_1745648379.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b802/live/52690060-f67e-11ef-b148-3189738b7be7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqlyyezg5zvo_1745648379.html", "title": "FA Cup: Plymouth Argyle fans flock to Manchester City clash", "title_page": "FA Cup: Plymouth Argyle fans flock to Manchester City clash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Thousands of Plymouth Argyle fans are in Manchester hoping to watch their team cause another FA Cup shock.\nThe Championship side are taking on Pep Guardiola's Manchester City at the Etihad Stadium in the fifth round.\nTickets for Argyle fans sold out, external with the club confirming 7,800 supporters made the 280-mile (450.6km) trip to the reigning Premier League champions.\nSome of the Green Army said they were optimistic another shock would follow their win over Premier League leaders Liverpool in the fourth round, but they would enjoy the day whatever happened.\n\"We're going to have a sea of green and white all the way across the stand,\" he said.\n\"I think it's going to put the atmosphere back into a big stadium.\"\nHarry Pearse was another fan who caught one of the coaches to the Etihad.\nHe predicted a 3-2 win for Argyle, but said the journey was more than just about the final score.\nMr Pearse said: \"Football's a results-based business, but there's always so much more than the match.\n\"It's about getting with a load of your mates and travelling up to the game together, soaking up the atmosphere before the match and enjoying the trip.\"\nTristan Bannister, a member of the North Devon Greens supporters group, said he and his wife Claire booked their train ticket and hotel before even getting their hands on a ticket.\nThe Westward Ho! couple managed to eventually bag a ticket in the away end, joined by several others from their supporter group.\nMr Bannister said the tie had been the main topic of conversation since the draw was made.\nHe said everyone who had travelled to Manchester would have a good time, even if the match ended in a defeat.\n\"Any Argyle away game is brilliant and a great atmosphere,\" he said.\n\"Come win, lose or draw, you have a great time.\"\nHe added the fans knew the side probably had bigger priorities to worry about as they battled to avoid being relegated from the Championship.\nMr Bannister said: \"In a game like this, we're not expected to win so Hull City on Tuesday is arguably the bigger game for us, that's the one we have to win.\"\nStand-up comedian and famous Argyle fan Josh Widdicombe echoed Mr Bannister's thoughts.\nWiddicombe joked City, who are fourth in the Premier League and 20 points behind leaders Liverpool, needed the cup run more than Argyle, especially after Real Madrid knocked them out of the Champions League.\n\"I think the problem with this game is - and I can't believe I'm saying this - Real Madrid haven't done us a favour,\" he said.\n\"We've actually got more to play for in the rest of our season than Man City.\n\"If a team was going to rest players, strangely it should be us because we should be more focused on the league, so there's actually more in this for Man City than us.\"\nThe Last Leg star added he would not be able to get to the stadium as he was performing in Chipping Norton, with the gig starting at at the same time the game finished.\nHowever, he said he would be watching the match before the gig and would not appear on stage until the final whistle.\nThe comedian said: \"The best thing for the show is that we lose because then I'll be able to go [on stage] on time.\"\nHe added: \"The result isn't a forgone conclusion and Plymouth have got every chance of winning.\n\"I want City to win, it doesn't matter who they're playing against.\n\"But it's nice to see them play against Plymouth because realistically, is it going to happen again in our life times? Quite possibly not.\"", "url": "https://www.bbc.co.uk/news/articles/cqlyyezg5zvo"}