{"authors": ["Ruth Bradley", "www.facebook.com"], "date_download": "2025-04-26 04:35:33", "date_modify": "2025-04-26 04:35:33", "date_publish": "2025-02-28 12:24:19", "description": "More than 1,600 people sign a petition against plans to scrap free car parks and bring in charges.", "filename": "news_articles_c86p335lzwyo_1745642133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c0d/live/5ada8e00-f384-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86p335lzwyo_1745642133.html", "title": "Hundreds against Somerset Council's plan to end free parking", "title_page": "Hundreds against Somerset Council's plan to end free parking - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than 1,600 people have signed a petition against Somerset Council's plans to scrap its remaining free car parks and bring in Sunday and overnight charges across all its parking sites.\nMembers of the council's scrutiny committee have also voted against the proposals, which are due to have a final decision next week.\nSomerset Council is proposing the changes, external because different rates currently apply across its car parks.\nIt said the aim of the proposal was to \"bring consistency\" to the county, and ensure the service remained \"completely self-funded\". If approved in principle by the authority's executive committee on Monday, the proposals will go out to a public consultation.\nThe petition, started by Taunton businesswoman Susie Thomas, external, said the proposals were being \"rushed through under cover of financial emergency and budget setting with inadequate debate and scrutiny\".\nMs Thomas said there had been no prior consultation with businesses and there was \"a very real risk of doing unwitting damage to Taunton's nightlife, including our cultural scene and town centre economy\".\nShe also said the charging proposals offered \"no specific improvements to parking facilities in exchange\" for the higher charges.\nMeanwhile, Conservative councillor Stephen Pugsley said the proposals were \"premature\" and needed \"more work doing\".\nHe said the scrutiny committee, when it met on Monday, felt there was not enough detail for its members to feel able to support the plans.\nThe scrutiny committee's feedback will be given to the council's executive committee when it meets to discuss the parking proposals on Monday.", "url": "https://www.bbc.co.uk/news/articles/c86p335lzwyo"}