{"authors": ["Ethan Gudge", "www.facebook.com"], "date_download": "2025-04-26 03:57:24", "date_modify": "2025-04-26 03:57:24", "date_publish": "2025-03-04 14:00:18", "description": "The collaboration will see students and staff gain access to funding and \"cutting-edge\" AI tools.", "filename": "news_articles_cx2eqk46dkeo_1745639844.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8a51/live/b9167910-f84e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eqk46dkeo_1745639844.html", "title": "Oxford university announces partnership with ChatGPT maker OpenAI", "title_page": "Oxford university announces partnership with ChatGPT maker OpenAI - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The University of Oxford has announced a new five-year partnership with OpenAI - the maker of the world's best-known artificial intelligence tool, ChatGPT.\nThe collaboration will see students and staff gain access to funding and \"cutting-edge\" artificial intelligence (AI) tools to \"enhance teaching, learning and research\", the university said.\nSome of the Bodleian Library's public collection will also be digitised as part of the new scheme.\nBrad Lightcap, OpenAI's chief operating officer, said \"continued collaboration\" with the academic community was \"essential to build AI that benefits everyone\".\nAs part of the scheme, Oxford researchers will receive access to OpenAI's latest models, including a version of ChatGPT designed specifically for educational institutions.\nResearch grant funding will also be available for projects that involve working with the firm, based in the Silicon Valley region of California in the US.\nThe university said the partnership would \"present opportunities to accelerate\" its research into areas such as health and climate change.\nProf Patrick Grant, pro vice-chancellor for research at Oxford, said: \"Artificial intelligence is accelerating the pace of scientific discovery and enabling researchers to work with increasingly complex data sets.\n\"The university aims to be at the forefront of AI research and the application of AI for all researchers, by producing ground-breaking studies to help both scholars and society not only adapt to these technologies, but also harness them wisely to their full potential,\" he added.", "url": "https://www.bbc.co.uk/news/articles/cx2eqk46dkeo"}