{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 04:43:21", "date_modify": "2025-05-21 04:43:21", "date_publish": "2025-02-01 00:00:00", "description": "Crowds gathered to welcome the freed Palestinian prisoners, as the Rafah crossing between Egypt and the Gaza Strip has reopened after eight months.", "filename": "news_live_cn4z119e5xxt_1747802601.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cn4z119e5xxt_1747802601.html", "title": "183 Palestinian prisoners freed from Israeli jail after Hamas releases three Israeli hostages", "title_page": "Israel Gaza ceasefire: 183 Palestinian prisoners freed from Israeli jail after Hamas releases three Israeli hostages - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three Israeli hostages released and 183 Palestinian prisoners freed\nLana Lam\nLive digital reporter\nThree Israeli hostages held by Hamas since 7 October 2023 were freed today in the fourth release of hostages since the start of the ceasefire deal on 19 January.\nIsrael later released 183 Palestinian prisoners that had been held in its jails, who were met by jubilant crowds in the occupied West Bank and Gaza Strip.\nHere's how the day unfolded:\nAt 08:30am local time (06:30 GMT), Hamas handed over Ofer Kalderon, 53 and Yarden Bibas, 34, to the Red Cross in Khan Younis. Two hours later, US-Israeli Keith Siegel, 65, was released in Gaza City\nBoth handovers were in \"stark contrast\" to the chaotic scenes on Thursday, BBC's Alice Cuddy writes, when seven hostages - two Israelis and five Thai nationals - were surrounded by large crowds in Khan Younis\nAfter the release of the three hostages, buses carrying Palestinian prisoners arrived from Ofer prison into Ramallah, in the occupied West Bank and Khan Younis to cheering crowds\nAs part of the ceasefire, the Rafah border crossing was re-opened after its closure last May, allowing wounded Palestinians to cross into Egypt for medical treatment and aid trucks to enter the territory\nWe're closing our live coverage now but you can keep up to date with the latest updates in our news story.\nSome in Israel fiercely oppose release of Palestinian prisoners\nJoe Inwood\nBBC News correspondent\nThis deal was never going to be without controversy or critics, especially on Israel’s far right. It sees hundreds of Palestinians freed in exchange for a far smaller number of Israelis.\nItamar Ben-Gvir resigned as National Security Minister over the deal, saying he was \"horrified\" that \"life-sentenced terrorists\" would be released.\nIt may be memories of the deal to exchange Israeli soldier Gilad Shalit for 1,027 Palestinian prisoners weighs heavy here. One of those released in the 2011 deal was Yahya Sinwar, who went on to mastermind the 7th October attacks.\nIndeed, some of those being released had been found guilty of serious crimes, although none were accused of involvement in October 7th. The Palestinian Prisoners’ Association say 18 were serving life, with another 54 having received long sentences.\nIt is worth pointing out, however, that the majority of those freed were held on what Israel calls “administrative detention”, but what their critics call imprisonment without charge.\nOf the 183 being released today, 25 of them are said to have gone to the occupied West Bank, seven will be deported to Egypt, with the rest being sent to Gaza.\nIt’s interesting to note, although maybe unsurprising, that on Israeli media the overwhelming focus of the coverage is the emotional scenes as the men reunite with their families, rather than the pictures of family reunions simultaneously taking place in the occupied West Bank.\nSiegel family 'can breathe again' as hostage returns to Israel\nThe family of Keith Siegel, the final hostage to be released today, says they are \"filled with indescribable excitement\" as he steps foot in Israel again and undergoes medical checks.\nIn a press release, they write that \"after 484 long, terrifying days and nights, full of immense worry for our father, we can breathe again\".\nThey thank the Israeli and American governments for helping make this deal possible.\n\"There are now 79 hostages who are also waiting to be reunited with their loved ones. Our hope rests with you,\" the statement adds.\nOfer Kalderon reunites with family as Netanyahu vows return of all hostages\nWe can now bring the latest images from Israel as freed hostage Ofer Kalderon has been reunited with his family.\nIn the emotional embrace, his children say to him \"that's it, it's over, Dad. Now you're with us.\"\nMeanwhile Israel's Prime Minister Benjamin Netanyahu has welcomed the release of Kalderon and the two other Israeli hostages - Yarden Bibas and Keith Siegel.\n\"Together with all the citizens of Israel and many around the world, my wife and I embrace you upon your return home,\" Netanyahu writes.\n\"Our thoughts are now with Shiri, Ariel, and Kfir Bibas, and all of our abductees. We will continue to work to bring them home. The people of Israel are alive.\nAs a reminder, Yarden's wife Shiri and their two young sons Ariel, five and Kfir, two, have not yet been released. Hamas says they were killed in an Israeli air strike but Israel says it can't verify this.\n'It's not if he will come back, it's when'\nAlice Cuddy\nReporting from Tel Aviv\nAmong those who have gathered in Hostage Square today is Doron Zexer, who hosted Israeli-American hostage Edan Alexander during his military service in Israel.\nHe says he was \"so excited\" to see the release of three more hostages today.\n\"This is my family. I don't know them but since 7 October they have become my family,\" he says.\nBut, he adds, \"we have to finish it\" and keep going \"until the last hostage comes back\".\nEdan was 19 when he was taken hostage on 7 October 2023. Following the release today of Keith Siegel, there are six Americans still held in Gaza. Edan is one of two thought to still be alive.\nWhile Edan remains in Gaza and will not be freed in the first phase of the ceasefire deal, Doron says he is confident he will return.\n\"It's not if he will come back, it's when. Edan will come back,\" he says.\nHow many Israeli hostages have been released so far?\nSince the ceasefire agreement came into effect on 19 January, a total of 18 Israeli hostages have been released.\nThat leaves 79 still unaccounted for, although only 44 are believed to be alive, according to Israel.\nDuring the first six-week phase of the deal, a total of 33 hostages should be released in exchange for Palestinian prisoners.\nIn addition, Hamas is still holding two men seized after crossing into Gaza from Israel before the war - Avera Mengistu, 27, an Ethiopian-Israeli dual national, and Hisham al-Sayed, 35, a Bedouin Arab, as well as the body of a soldier killed during a conflict in 2014.\nIn the second phase, the remaining living hostages are to be released, and in the final phase, the bodies of dead hostages are to be handed over.\nHamas hostages: Stories of the people taken from Israel\n'The situation is catastrophic' as Palestinians return to the north\nAlice Cuddy\nReporting from Tel Aviv\nHundreds of thousands of displaced Palestinians have been allowed to return to their communities in northern Gaza this week under the ceasefire deal between Israel and Hamas.\nWe've been speaking on the phone today with Ashraf al-Dous who has returned to his neighbourhood in Gaza City and says he was shocked by the scale of damage caused by Israeli bombing.\n\"It really a mess,\" he says. \"The situation is catastrophic.\"\nHe adds that most floors in his apartment building have been destroyed.\n\"I didn't expect the situation to be like this - it's too much,\" he says.\nHe adds that some people, including his father, have headed back to the south after seeing the scale of destruction.\nKey humanitarian corridor reopens\nAs we reported in our last post, the Rafah crossing has reopened today to people for the first time since May 2024.\nBuses carrying wounded and sick Palestinians have been forming queues at the border and are beginning to cross into Egypt. The EU's civilian border mission has been deployed to the border to support the transfers.\nThe Rafah crossing, which is on Gaza's southern border, has been a key humanitarian corridor throughout this war, where aid trucks are able to enter the country.\nThe crossing is also the only exit for people able to flee since the start of the war.\nHowever, humanitarian organisations have long criticised the closure of the crossing for reducing the amount of aid getting into the Gaza Strip.\nIsrael's president welcomes return of hostages\nWe can now bring you some reaction to the release of three Israeli hostages - Yarden Bibas, Ofer Kalderon and Keith Siegel - earlier today in Gaza.\nA statement by Israeli President Isaac Herzog reads \"each one deserves the time to rehabilitate and rebuild their lives\".\nIn a post on X, he says the country has \"worried and awaited their return\".\nHerzog adds he remains \"deeply concerned for the fate of our beloved Shiri, Ariel and Kfir Bibas\", the family of Yarden Bibas who were taken hostage but have not returned with him.\n\"As an entire nation we hold them in our hearts,\" Herzog says. \"We will not rest nor be silent until we return all our sisters and brothers\".\nHostage handover avoids chaotic scenes, but deep disquiet over Hamas' impression of authority\nJoe Inwood\nBBC News correspondent\nThe contrast with Thursday’s chaotic hostage handover could not be more stark. That saw surging crowds pressing in, with genuine concern for the safety of those being handed over.\nIt led to such anger in Israel that the subsequent release of Palestinian prisoners was delayed. Today's release of hostages was ordered and stage-managed, an attempt by Hamas to show that they are still the governing force in Gaza.\nThe banner on stage bore the images of their leaders killed in fighting, while lines of well-armed men kept all onlookers at bay. At least one of them can be seen carrying an Israeli rifle, presumably captured during the conflict.\nThe certificates of release held by Ofer Kalderon and Yarden Bibas as well as the sight of officials from the International Committee of the Red Cross signing paperwork, further added to the impression of authority Hamas clearly wanted to present.\nIsrael had told mediators it could not tolerate a repeat of the chaos of last Thursday. There was no repeat, but today’s highly stage-managed events, which saw two men who have spent more than a year in captivity made to wave to crowds, will undoubtedly cause deep disquiet here, but for very different reasons.", "url": "https://www.bbc.com/news/live/cn4z119e5xxt"}