{"authors": ["Shaimaa Khalil", "www.facebook.com"], "date_download": "2025-04-26 07:08:03", "date_modify": "2025-04-26 07:08:03", "date_publish": "2025-02-28 03:02:20", "description": "Shiori Ito became the face of Japan's MeToo movement after she accused a prominent journalist of rape.", "filename": "news_articles_cm2j1r1qn3zo_1745651283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0aa4/live/3be422f0-f4f0-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2j1r1qn3zo_1745651283.html", "title": "Oscar hopes for Japanese MeToo icon, but film not shown in Japan", "title_page": "Oscar hopes for Japanese MeToo icon, but film not shown in Japan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Japanese journalist Shiori Ito decided to speak up about her rape allegations, she knew she would do so in the face of a society that prefers silence.\n\"I'm scared…but all I want to do is to talk about the truth,\" she says, in the opening scene of her Oscar-nominated documentary Black Box Diaries.\nShiori became the face of Japan's MeToo movement after she accused a prominent journalist, Noriyuki Yamaguchi, of rape. He denies the charges.\nHer acclaimed directorial debut, based on her memoir of the same name, is a retelling of her quest for justice, after authorities found insufficient evidence to pursue criminal charges.\nBut there is one country where the documentary has still not been aired: Japan - where it has run into huge controversy.\nShiori's former lawyers have accused her of including audio and video footage that she did not have permission to use, which, they maintain, has violated trust and put her sources at risk.\nShe defends what she did as necessary for \"public good\".\nIt's a startling turn in a story that gripped Japan when it first broke. Then 28 years old, Shiori had chosen to ignore her family's request to remain silent about the alleged rape. And after her public accusation did not result in a criminal case, she filed a civil lawsuit against Mr Yamaguchi - and won $30,000 (£22,917) in damages.\nShiori told the BBC making the film involved \"re-living her trauma\".\n\"It took me four years [to make the film] because, emotionally, I was struggling.\"\nShe was an intern at Reuters news agency in 2015, when she claims Mr Yamaguchi invited her to discuss a job opportunity. At the time, he was the Washington bureau chief for a major Japanese media firm, Tokyo Broadcasting System.\nShiori claims she was raped following a dinner in Tokyo with Mr Yamaguchi, who has always denied the allegations.\nCCTV footage of an intoxicated Shiori being dragged from a taxi and into a hotel forms part of the more than 400 hours of footage which she has edited for the documentary.\nShiori, who directed and wrote Black Box Diaries, describes the editing process as \"really challenging\".\n\"It was like hardcore exposure therapy,\" she says.\nBut when the film was released, the CCTV footage included in the documentary became a source of friction between the director and the team of lawyers who had helped her win her civil case.\nThe lawyers stated her use of CCTV footage was unauthorised - and that Shiori had violated a pledge not to use it outside of court proceedings. .\nLast week, her former lawyers - led by Yoko Nishihiro - held a press conference, in which she said Shiori's use of the footage posed challenges for other sexual assault cases.\n\"If the fact that the evidence from the trial has been made public is known, we will be unable to obtain cooperation in future cases,\" Ms Nishihiro said.\nMs Nishihiro claimed Shiori also used unauthorised recordings in the film, which the lawyer only discovered following the screening of the film last July.\nThe documentary included audio of a police detective who eventually acted as a whistleblower in relation to the investigation process, as well as video of a taxi driver who had provided testimony about the night of the alleged rape.\nBoth the detective and the taxi driver, the lawyers have argued, were identifiable in the film - and neither had given their consent to be featured.\n\"I've been trying so hard to protect her for eight-and-half years, and I feel like I've been completely torn apart,\" Ms Nishihiro said.\n\"I want her to explain and be held accountable.\"\nShiori has previously acknowledged that she did not have the hotel's permission to use the CCTV footage, but has argued that it provided \"the only visual evidence\" of the night she claims she was sexually assaulted.\nShe said including audio of the police detective was necessary because of \"the cover-up of the investigation\", and has insisted she was releasing the video \"for the public good\".\n\"We are standing in different points of view,\" she said, referring to her fall-out with her former lawyers.\n\"For me, [it's for the] public good. For them, it's 'do not break any rules'.\"\nThere has been no official explanation as to why the film has not yet been distributed. According to Shiori, \"Japan is still not ready to talk about [it]\".\nHowever, it remains unclear how far the lack of distribution might also be due to legal hurdles.\nIn her most recent statement last week, Shiori apologised and said she would re-edit parts of the documentary to make sure individuals could not be identified. She said a redacted version would be screened at a later stage.\n\"There are moments I wish I didn't have to put in [the documentary]. There are moments I'm not proud of - but I wanted to put all of it, and to show we are also human,\" she told the BBC.\n\"No-one is perfect.\"", "url": "https://www.bbc.co.uk/news/articles/cm2j1r1qn3zo"}