{"authors": ["Kathryn Armstrong & Sarah Atiq", "www.facebook.com"], "date_download": "2025-04-26 06:51:35", "date_modify": "2025-04-26 06:51:35", "date_publish": "2025-02-28 17:50:06", "description": "No group has immediately claimed responsibility for the attack, which killed influential cleric Maulana Hamid ul-Haq.", "filename": "news_articles_cr522g2lmmpo_1745650295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5d47/live/947d9f20-f5d3-11ef-ab72-e7ad4ede4251.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr522g2lmmpo_1745650295.html", "title": "Pakistan: Six killed in blast at mosque dubbed 'University of Jihad'", "title_page": "Pakistan: Six killed in blast at mosque dubbed 'University of Jihad' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least six people have been killed in a suicide attack at an Islamic seminary in northern Pakistan that has been described as the \"University of Jihad\".\nThe blast happened at the mosque within the Darul Uloom Haqqania, in the Khyber Pakhtunkhwa province, about 55km (34 miles) from the northern city of Peshawar.\nMaulana Hamid ul-Haq, a prominent cleric and the influential head of the school, is among the dead. Police said more than 10 other people had been injured.\nThe seminary has long been associated with the Taliban since several of its members, including the group's founder Mullah Omar, trained there.\nNobody has claimed responsibility for the attack, which came ahead of the start of the holy month of Ramadan.\nThe explosion occurred after Friday prayers, according to local police.\nHaq's son, Khuzaima Sami, told the BBC that hundreds were present in the main hall at the time of the blast and that he feared there would be many casualties.\nAn investigation has been launched into the attack.\n\"Initial reports suggest the blast occurred after Friday prayers as people were gathering to greet Hamid ul-Haq,\" Abdul Rasheed, the district police chief, told the AFP news agency.\nThe seminary - where clerics are taught - also known as a madrassa, is considered one of the region's most renowned religious educational institutions and is an important academic centre of the Deoband school of thought.\nIt has been referred to as the \"University of Jihad\" due to its notable alumni, including Jalaluddin Haqqani, the founder of the militant Haqqani Network, and his son Sirajuddin Haqqani.\nBoth men played key roles in leading the Taliban's insurgency, first against Soviet forces and later against US and Nato forces, in Afghanistan.\nHaq, 57, was the son of the influential Pakistani cleric Maulana Sami ul-Haq, widely known as the \"Father of the Taliban\".\nHe became the seminary's vice-chancellor after his father's assassination in 2018, and the head of a faction of the religious Jamiat Ulema-e-Islam (JUI-S) political party.\nHe also served as a member of the National Assembly of Pakistan from 2002 to 2007.\nHaq's father had longstanding ties with the Afghan Taliban's leadership, including Mullah Omar.\nHe was considered an influential figure in facilitating negotiations between the Taliban and the Pakistani government.\nDespite their strong connections with the Afghan and Pakistani Taliban, neither Haq nor his father were directly involved in any anti-state movements.\nInstead, they were often seen as intermediaries between Pakistan and the Taliban.\nPakistan's President Asif Ali Zardari and Prime Minister Muhammad Shahbaz Sharif condemned the attack, as did the Pakistani Taliban.\nThe group described Haq as a \"preacher of truth, a compassionate teacher, and a fearless advocate for the stability of madrassas\".", "url": "https://www.bbc.co.uk/news/articles/cr522g2lmmpo"}