{"authors": ["Steven McIntosh", "www.facebook.com"], "date_download": "2025-04-26 04:34:04", "date_modify": "2025-04-26 04:34:04", "date_publish": "2025-03-03 00:57:42", "description": "The whirlwind drama wins five prizes, including best actress for 25-year-old newcomer Mikey Madison.", "filename": "news_articles_cly8v12p228o_1745642044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/35c4/live/4e7c6d80-f7ea-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly8v12p228o_1745642044.html", "title": "Anora sweeps the board as Mikey Madison wins best actress at Oscars 2025", "title_page": "Anora sweeps the board as Mikey Madison wins best actress at Oscars 2025 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Anora was the big winner at the Oscars, winning five awards including best actress for breakout star Mikey Madison, and a record-breaking four prizes for its director Sean Baker.\nThe whirlwind drama stars relative newcomer Madison as a New York stripper who falls in love with the son of a wealthy Russian.\nShe held off competition from Demi Moore, and described winning the best actress Oscar as a \"dream come true\".\nBaker became the first person to personally win four Academy Awards for a single film - for directing, editing, writing and producing Anora.\nIn her speech, 25-year-old Madison said: \"This is very surreal. I grew up in Los Angeles but Hollywood always felt so far away from me, so to be here standing in this room today is really incredible.\"\nShe added: \"I want to honour and recognise the sex worker community. I will continue to support and be an ally... the women I've had the privilege of meeting from that community has been one of the highlights of this entire incredible experience.\"\nThe best director trophy was presented by Quentin Tarantino, who previously cast Madison in a small role in his film Once Upon A Time In Hollywood.\nAccepting the trophy from Tarantino, Baker told him: \"If you didn't cast Mikey Madison... there'd be no Anora.\"\nBaker went on to thank the Academy voters for \"recognising a truly independent film\", and used his best director speech to champion cinemas.\n\"Where did we fall in love with movies? At the movie theatres,\" Baker said. \"Watching a film in a theatre with an audience is an experience.\n\"And at a time when the world can feel very divided, this is more important than ever, it's a communal experience you just don't get at home.\n\"Right now the theatre-going experience is under threat, independently owned theatres are struggling, and it's up to us to support them.\"\nHe concluded: \"This is my battle cry: Film-makers, keep making films for the big screen. I know I will. Distributors, please focus first and foremost on the theatrical releases of my films.\"\nBaker is the first person to win four Oscars for a single film. Walt Disney did win four prizes in a single night in 1953, but for four different films.\nThe Brutalist's Adrien Brody was named best actor for his performance as a Hungarian-Jewish architect who moves to the US after World War Two to build a new life.\nBrody had not been nominated at the Oscars since 2003, when he became the youngest ever winner of best actor for The Pianist.\n\"Acting is a very fragile profession,\" he said. \"It looks very glamorous, and in certain moments it is, but the one thing I've gained in having the privilege to come back here is to have some perspective.\n\"And no matter where you are in your career, no matter what you've accomplished, it can all go away. And what makes this night so special is the awareness of that, and the gratitude I have to still do the work that I love.\"\nBrody refused to be played off during his five-minute speech, continuing: \"I'm here once again to represent the lingering traumas and repercussions of war, and systematic oppression, and antisemitism and racism.\n\"And I pray for a healthier, happier and more inclusive world. And I believe if the past can teach us anything, it's a reminder to not let hate go unchecked.\"\nThe Brutalist also scored two British wins - best cinematography for Lol Crawley, who grew up in Wales, and best original score for composer Daniel Blumberg.\nZoe Saldaña was named best supporting actress for her performance in Spanish-language musical Emilia Pérez, about a drug lord who changes gender.\n\"I am floored by this honour,\" she said in an emotional acceptance speech. \"Thank you to the Academy for recognising the quiet heroism and the power in a woman like Rita,\" referring to her character.\n\"My grandmother came to this country in 1961,\" she added, \"I am a proud child of immigrant parents, and I am the first American of Dominican origin to accept an Academy Award, and I know I will not be the last.\"\nEmilia Pérez also won best original song for El Mal, a song performed by Saldaña in the film.\nSuccession star Kieran Culkin was named best supporting actor, a category he has dominated throughout awards season.\nThe actor won for his performance in A Real Pain, about two cousins who travel across Poland in remembrance of their grandmother.\nIn his acceptance speech, he said: \"I have no idea how I got here, I've just been acting my whole life, it's just been a part of what I do.\"\nHe thanked the film's writer and director Jesse Eisenberg, telling him: \"Thank you for this movie, you're a genius. I'd never say that to your face, I'll never say it again, so soak it up.\"\nCulkin also paid tribute to his Succession co-star Jeremy Strong, who was nominated in the same category.\nElsewhere at the ceremony, Morgan Freeman paid tribute to his \"dear friend\" Gene Hackman, whose death was announced last week.\n\"Like everyone who ever shared a scene with him, I learned he was a generous performer, and a man whose gifts elevated everyone's work,\" Freeman said.\nOther winners included The Substance, for best make-up and hairstyling, and Flow, which won best animated film.\nMeanwhile, In The Shadow of the Cypress was named best animated short.\nIts Iranian directors Shirin Sohani and Hossein Molayemi accepted the prize just three hours after their plane landed in Los Angeles, following difficulties obtaining a US visa.\nI'm Still Here, a film about the true story of a Brazilian woman who investigates the disappearance of her congressman husband, was named best international film.\nThe best documentary award went to No Other Land, a collaboration between Palestinian and Israeli film-makers about the ongoing conflict in the region.\n\"We made this film, Palestinians and Israelis, because together, our voices are stronger,\" said co-director Yuval Abraham.\nAlso during the ceremony, Cynthia Erivo and Ariana Grande sang a Wicked medley, while Raye, Liza from Blackpink, Doja Cat and Margaret Qualley all performed as part of a James Bond tribute.", "url": "https://www.bbc.co.uk/news/articles/cly8v12p228o"}