{"authors": ["Harry Harrison", "www.facebook.com"], "date_download": "2025-04-26 04:09:17", "date_modify": "2025-04-26 04:09:17", "date_publish": "2025-03-02 19:10:41", "description": "Six classrooms and a nursery would be built under plans to extend Hatchwell Wood Primary.", "filename": "news_articles_cd6524dwje5o_1745640557.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0082/live/d34aaea0-f786-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd6524dwje5o_1745640557.html", "title": "Doncaster school extension plans to create 210 new places", "title_page": "Doncaster school extension plans to create 210 new places - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than 200 new places would be created at a primary school in Doncaster if plans are approved.\nHatchwell Wood Primary has submitted proposals to build a single storey extension with six new classrooms and a nursery.\nAccording to the school, the extension would accommodate an extra 210 pupils.\nThe city council said its feasibility study showed \"an unmet demand for school places within the locality\" and the plans had been recommended for approval.\nA report, which is due to be presented at the authority's planning committee on Tuesday, said a \"new vehicular access/collection point\" off Plumpton Park Road would also be created under the plans.\nIt said the planning application had reported concerns about highway safety and noise, according to the Local Democracy Reporting Service.\nOne resident said: \"Plumpton Park Road is already very congested with vehicles parked on both sides of the road and on The Bramblings.\n\"Proposals will lead to increased congestion and demand for additional on street parking.\"\nAmong the responses, one also highlighted how a rise in pupil numbers would lead to an increase in noise for residents whose properties back onto the school playing field.\nIf given the go-ahead, work on the extension would be completed by December.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/cd6524dwje5o"}