{"authors": ["Oscar Edwards", "www.facebook.com"], "date_download": "2025-04-26 04:04:47", "date_modify": "2025-04-26 04:04:47", "date_publish": "2025-03-03 18:10:38", "description": "Jason Thomas, 40, punched his former colleague so hard he was knocked out.", "filename": "news_articles_crmjkr9rn4zo_1745640287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/94a2/live/8917db60-f857-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmjkr9rn4zo_1745640287.html", "title": "Llanelli: Builder jailed for killing friend in punching game", "title_page": "Llanelli: Builder jailed for killing friend in punching game - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A builder killed his former workmate in an alcohol-fuelled punching game over who could take the hardest blow, a court has heard.\nJason Thomas, 40, punched Liam Morgan-Whittle twice in the head which caused him to be knocked out and then collapse.\nThe 22-year-old sustained a bleed on his brain which led to his death in March 2023.\nMr Thomas, from Llanelli, admitted manslaughter and he has been jailed for two-and-a-half years.\nSwansea Crown Court heard the pair, who previously worked for the same construction firm, had been \"joking and laughing\" for the majority of the conversation.\nThey had been at a friend's house in Llanelli, Carmarthenshire drinking alcohol and taking cocaine.\nProsecutor William Hughes KC said: \"There came a point in the evening where they began a discussion which could be described as banter but became an increasingly aggressive argument as to who could take a punch better.\"\nMichael Davies told police he had tried to discourage the punching game which took place at his flat.\nHe said Thomas told the 22-year-old: \"I'll hit you first,\" and the victim replied: \"Go on then.\"\nMr Davies said neither of the punches was \"friendly\", and told Thomas: \"What have you done, there was no need for it.\"\nThomas allegedly replied: \"He asked for it, I told him not to mess.", "url": "https://www.bbc.co.uk/news/articles/crmjkr9rn4zo"}