{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:07", "date_modify": "2025-05-19 14:52:07", "date_publish": "2015-03-04 18:10:48", "description": "Spin is beating science in the debate over fracking in Scotland, the head of the Weir Group has claimed.", "filename": "news_uk-scotland-scotland-business-31733190_1747666327.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81405000/jpg/_81405076_keith.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-business-31733190_1747666327.html", "title": "Head of Weir Group claims fracking 'spin is beating science'", "title_page": "Head of Weir Group claims fracking 'spin is beating science' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spin is \"beating science\" in the debate over fracking in Scotland, the head of the Weir Group has claimed.\nKeith Cochrane, chief executive of the engineering firm, said that he feared Scotland would be left behind in the global market place.\nThe Weir Group is the world's leading supplier of pressure pumping equipment to the hydraulic fracturing industry.\nThe Scottish government has announced a moratorium on planned fracking operations amid envorinmental fears.\nMr Cochrane told business leaders at a dinner in Edinburgh that Scotland and the UK could benefit from technology that had helped \"transform\" America's energy industry.\n\"I accept the issue is controversial and of course Scotland and the rest of the UK are perfectly within their rights to say no,\" he said.\n\"All I ask is that they do so on the basis of fact and reason rather than propaganda and spin. I'm afraid as I look at the recent debate unfold in Scotland in particular, I think the spinners are beating the scientists and we should all regret that.\"\nHe added: \"If there's one thing you learn quickly at the helm of an international business, it is just how fiercely competitive the global market place is.\n\"I have a real fear Scotland, and to some extent the UK, risk becoming too insular, too self-obsessed. While we look in the mirror, other countries are racing ahead.\"", "url": "https://www.bbc.com/news/uk-scotland-scotland-business-31733190"}