{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 06:19:35", "date_modify": "2025-04-26 06:19:35", "date_publish": "2025-03-01 07:13:43", "description": "Organisers of the event say they are picking up on the work of their former finance officer.", "filename": "news_articles_cwyggv9r4qvo_1745648375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ed7d/live/927b1a60-f5bd-11ef-9aa5-8f9f2163b0a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyggv9r4qvo_1745648375.html", "title": "Guernsey Street Festival issues appeal for new sponsors", "title_page": "Guernsey Street Festival issues appeal for new sponsors - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Guernsey arts festival is trying to \"fill the shoes\" of one of its main organisers following his death as it searches for new sponsors.\nThe Guernsey Street Festival, which is on from 26 July to 9 August in St Peter Port, has issued an appeal for people and businesses to come forward to help pay the performers and keep the event running in future years.\nClaire Dawson, the festival's founder and chairperson, said organisers were picking up on the work of former finance officer Jack Honeybill who died last year.\nAnyone who is interested in becoming a sponsor for the festival has been asked to contact the organisers via email.\nMs Dawson said: \"Last year we lost our beloved finance officer Jack Honeybill, a man who did so much for the community whilst making sure we secured enough sponsorship to keep all our activities going.\n\"Our team is now doing all we can to fill his shoes and keep the funding coming in and we would love to hear from any organisation looking for ways to fulfil their corporate social responsibility and help keep our award-winning festivities alive.\"\nThe festival's organisers said any performers who want to feature at this year's event could still register for an audition by contacting them.", "url": "https://www.bbc.co.uk/news/articles/cwyggv9r4qvo"}