{"authors": ["Liam Barnes", "Becky Measures", "www.facebook.com"], "date_download": "2025-04-26 04:40:45", "date_modify": "2025-04-26 04:40:45", "date_publish": "2025-03-02 07:13:40", "description": "John Redhead spent 22 years in education before taking a bold step into a new career.", "filename": "news_articles_czdnl9yq0gzo_1745642445.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7a25/live/4ef05040-f5c1-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czdnl9yq0gzo_1745642445.html", "title": "'I left teaching to become an embalmer", "title_page": "'I left teaching to become an embalmer - and I love it' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former PE teacher has swapped the sports hall for the chapel of rest as he embarks on a new career as an embalmer.\nJohn Redhead, from Ripley in Derbyshire, is currently retraining with Nottingham-based A.W. Lymn to become a qualified embalmer, with his two-year external examinations set to start in June.\nThe 46-year-old said the caring skills he learned from 22 years in education transferred well to the funeral industry.\nWhile leaving teaching \"was one of the hardest decisions I've ever made\", he said he was enjoying his new lease of life.\n\"I'd always really enjoyed the pastoral element of my role as a teacher, but it was starting to feel like the job was all about achieving results, with every pupil's worth based on their academic achievements,\" he told BBC Radio Derby.\n\"I left teaching without having another job lined up, so I thought about what skills I have from teaching into a new one.\"\nMr Redhead said he used a skills matrix map, which uses a person's skills and proficiency levels from previous jobs and matches those skills with new careers.\nHe said the skills matrix gave him \"lots of ideas\" but social media posts about working in the funeral business kept appearing on his phone, which helped him choose his new career.\n\"After getting results from my skills matrix, I went to a jobs fayre and it went from there,\" he said.\nEmbalming is the process of preserving a body after death ahead of their funeral.\n\"Starting a second career can be scary, but ultimately when you break it down, both teaching and embalming are about care,\" he said. \"Whether you're caring for a child in a secondary school, an elderly person in a care home or the deceased and their family.\n\"If you've got the skills inside you and that empathy for people, it's not that much different at all.\n\"It's a hard job emotionally, but so is teaching. It can be quite challenging but I absolutely love my job and I'm learning again which is nice, I love learning new things.\"\nMr Redhead said he had never seen a dead body until the first day on his new job.\n\"It was really unusual,\" he said. \"When you think about death, you think about your family members but I don't know who these people were, what they sounded like or what they did for a job.\n\"I care about them but I don't know anything about them, which means I am able to separate myself from them whilst still caring for them and making sure I do my job properly.\"\nOnce his training is complete, Mr Redhead will become a member of the British Institute of Embalming.\nHe said he was confident the career change would not prove to be a dead end.\n\"No two days in the mortuary are the same and I feel so fortunate that now, I look forward to going to work at the start of the week,\" he said.\nMatthew Lymn Rose, managing director of the family-run funeral firm, said professional embalmers carried out \"vital\" work.\n\"We're thrilled that John has been able to make such a seamless transition into the profession,\" he said.", "url": "https://www.bbc.co.uk/news/articles/czdnl9yq0gzo"}