{"authors": ["Zac Sherratt", "www.facebook.com"], "date_download": "2025-04-26 03:54:46", "date_modify": "2025-04-26 03:54:46", "date_publish": "2025-03-04 17:03:16", "description": "Hundreds of people attend Canterbury Cathedral for a service of thanksgiving to Derek Underwood.", "filename": "news_articles_czjekkn2d8ro_1745639686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e57e/live/84b265b0-f918-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czjekkn2d8ro_1745639686.html", "title": "Cricket legend Derek Underwood celebrated at Canterbury Cathedral", "title_page": "Cricket legend Derek Underwood celebrated at Canterbury Cathedral - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hundreds of people have joined together at Canterbury Cathedral for a service of thanksgiving to Kent and England cricketing great Derek Underwood.\nUnderwood, who died last April at the age of 78, remains the most prolific spinner to play Test cricket for England, claiming 297 scalps in a remarkable career.\nAmong those to pay their respects on Tuesday was cricketer Zak Crawley and former England captain Chris Cowdrey, who gave the eulogy.\n\"It was playing with a legend. That word is over-used, but he really was a legend,\" said Cowdrey.\nHe added: \"He just had this incredible will to win, a determination, and he worked out a different way of bowling to anyone in the history of the game.\"\nCrawley said he learned a lot from Underwood and saw him as an inspiration.\n\"I've always enjoyed looking back on old games,\" he said.\n\"You learn from [old players], their attitude towards the game, and [Underwood] is certainly someone I can learn from.\"\nA staunch one-club man, Underwood represented Kent with pride on more than 900 occasions.\nJohn Shepherd, who played alongside Underwood at Kent, said: \"I spent all my youth playing with Derek at that great Kent team of the 70s and early 80s. I couldn't miss it for anything.\"\nClub president vice-admiral Tim Laurence and Underwood's daughter Heather gave readings, while former team-mate John Shepherd read a poem.\nSquad members Joe and Jaydn Denly, Tawanda Muyeye and Chris Benjamin, as well as chief executive Simon Storey and president elect Richard Ellison, were also among the congregation, as was England and Wales Cricket Board chief executive Richard Gould.", "url": "https://www.bbc.co.uk/news/articles/czjekkn2d8ro"}