{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:12:03", "date_modify": "2025-04-26 04:12:03", "date_publish": "2025-03-04 12:37:11", "description": "Katie Evans called herself the prisoner's 'queen' and moved money around for him, court hears.", "filename": "news_articles_cdxqlneeng7o_1745640723.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47f2/live/8f890270-f8fd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxqlneeng7o_1745640723.html", "title": "Doncaster prison officer jailed for relationship with inmate", "title_page": "Doncaster prison officer jailed for relationship with inmate - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A former prison officer who had an \"intimate\" relationship with an inmate has been jailed for 21 months.\nMother-of-one Katie Evans, 26, was \"corrupted\" by robber Daniel Brownley not long after starting work at HMP Doncaster, Sheffield Crown Court heard on Tuesday.\nEvans, of Hatfield in Doncaster, had more than 140 phone calls with Brownley, moved money around accounts for him and boasted of performing a sex act, the court heard.\nJudge Jeremy Richardson KC said there was \"no excuse\" for her offending despite her being \"manipulated by an experienced criminal\".\nEvans had admitted the \"intimate\" relationship but it was not clear whether she accepted it was a sexual one.\nProsecutor Matthew Burdon earlier told the court Evans had boasted to an ex-prison officer that she had performed a sex act on the inmate.\nThe judge heard the defendant referred to herself as \"your queen\" when talking to Brownley.\nJudge Richardson told Evans: \"It appears you indulged in some form of sexual activity in the prison.\n\"It is truly a terrible situation for a judge to be passing sentence on a former prison officer who has been branded a corrupt prison officer.\"\nHe added: \"I'm entirely satisfied you were manipulated by an experienced criminal to assist him.\n\"Your misconduct materially affected the good order and discipline of the prison.\"\nThe judge said Evans was \"young and immature\" at the time of the offending in 2020 and that she was \"regrettably susceptible to manipulation\".\n\"You were inexperienced and immature but that is, however, no excuse for what you did,\" he told her.\nHe said he accepted she was genuinely remorseful and posed no danger to the public in the future.\nJudge Richardson said Evans' sentence of 21 months should have been longer but, \"purely as an act of mercy\", he reduced it.\nHe cited the effect it would have on Evans' relationship with her young daughter and the difficulties she would experience in prison as a former officer.\nEvans admitted misconduct in a public office at a previous hearing.\nShe cried and waved at family members in the public gallery as she was led from the dock.\nThe court heard that Brownley had been jailed for five-and-a-half years in 2016 for attempted robbery, burglary and handling stolen goods.\nHe had been released but was back in prison in 2020 after he was recalled for breaching his licence conditions.", "url": "https://www.bbc.co.uk/news/articles/cdxqlneeng7o"}