{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:45:42", "date_modify": "2025-05-21 05:45:42", "date_publish": "2025-01-14 00:00:00", "description": "The chancellor says she won't be \"ducking\" the economic challenges facing the UK, after defending a recent trip to China.", "filename": "news_live_cgrn0l0kx99t_1747806342.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cgrn0l0kx99t_1747806342.html", "title": "Reeves says UK must go 'further and faster' in search of economic growth", "title_page": "Reeves says UK must go 'further and faster' in search of economic growth - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chancellor vows to go 'further' on growth amid rising debt costs and anger over China trip\nCachella Smith\nLive reporter\nRachel Reeves delivered a statement in the House of Commons this afternoon, defending a recent trip to China which had prompted criticism as it fell at a time of turbulence in the financial markets.\nThe trip, and the chancellor, have been defended by members of the Labour Party - while those in opposition parties accused Reeves of being \"missing in action\".\nReeves told MPs today that new agreements with China will benefit UK exporters and investors, but will also be key to sustaining a dialogue that enables the UK to raise sensitive issues.\nShadow chancellor Mel Stride suggested the deal was insubstantial compared with the rise in borrowing costs he attributed to Reeves's October Budget - and was joined in criticism by Lib Dem Daisy Cooper, who told Reeves her Budget \"has not worked\".\nThe chancellor defended her plans set out in October, and pledged to go \"further and faster\" to improve economic growth. She also promised to set out new economic policies after next week's meeting of the World Economic Forum in Davos, Switzerland.\nWe're ending our live coverage there, but you can continue reading more about today's developments in our news story.\nReeves' October Budget - at a glance\nWe heard a lot today from Rachel Reeves and cross-party MPs about her Budget - when the government announces its plans for how it will get and spend money.\nBack in October, Reeves announced tax rises worth £40bn to fund the NHS and other public services. And while borrowing costs have been rising for many countries around the world, some have argued that decisions made by Reeves appear to have made the UK more vulnerable.\nHere's a quick reminder of some of the things she announced:\nRates of income tax and National Insurance (NI) paid by employees, and of VAT, remained unchanged\nBasic rate capital gains tax on profits from selling shares to increase from 10% to 18%, with the higher rate rising from 20% to 24%\nCompanies to pay NI at 15% on salaries above £5,000 from April, up from 13.8% on salaries above £9,100, raising an additional £25bn a year\nExtra spending in England will lead to £3.4bn more for Scotland, £1.7bn more for Wales, and £1.5bn more for Northern Ireland in devolution payments\nIncreases in day-to-day spending on the NHS and education, as well as defence spending while Home Office budget to shrink (due to assumed savings from asylum system)\nWant to learn more on this? Read our story from the time, which looks at key takeaways from the Budget.\nChancellor to unveil new growth strategies\nFaisal Islam\nEconomics editor\nThe chancellor is likely to bring forward the detail of a range of new growth strategies in the next few weeks, BBC News understands, as she promises to move “faster and further” on the economy.\nShe will deliver a major speech on the overall growth strategy before the end of the month. It was planned last year as a moment for the chancellor as important for growth, as a Budget is for the public finances.\nMajor strategies on infrastructure, industry and trade could be fast-tracked as part of this announcement. The outline of the Industrial Strategy is now planned for the next fortnight. Further sectoral announcements along the lines of this weeks “AI Strategy” will be rolled out in the next few weeks.\nA Treasury source said its diagnosis was always that the UK’s sluggish growth performance needed “urgent action”, and that will be demonstrated in the coming weeks. The chancellor has within government been pushing departments to go “faster and further” on growth, but felt it was a helpful message for global markets to hear too.\nHer aides also said that it was clear they would not compromise on her self-imposed fiscal rules. The message is that if the OBR’s ongoing recalculation of the Budget maths points to a further squeeze on public spending, then the government can and will do so.\nHuman rights issues 'must be remembered in all engagements with China', Reeves told\nThe final question Rachel Reeves faces today comes from another DUP MP, Jim Shannon.\nHe says he welcomes the economic benefits of Reeves' visit to China, but raises the issue of human rights abuses against groups including the Uyghur Muslims in the country. He says this must be remembered in all engagements with China.\nReeves agrees with Shannon's sentiments, but says that the UK must engage with the world as it exists, not as we would like it to be.\nShe says that it is through such engagements the UK is able to raise \"even the most difficult of issues\".\nWith that, Reeves sits down and her economic grilling is over for the afternoon. We'll bring you a round-up of the key takeaways shortly, stick around for that.\nChancellor accused of 'turning her back' on energy sector\nTory MP Harriet Cross now turns the debate to energy security - Cross says the chancellor referred to safeguarding national security in her statement, adding this \"must include energy security\".\nCiting changes to the energy profits levy at a time when we are still reliant on oil and gas, Cross says this undermines the energy security and is \"dwarfing\" the £600m Reeves says she has brought back from China with the tax revenues that will be lost from the sector.\nWhy is the chancellor turning her back on the sector, Cross asks.\nReeves references OBR documents, saying that changes to the energy profits levy - raising the tax rate on it from 75% to 78%, the same rate as in Norway - raises money.\nReeves challenged on farmer inheritance tax row\nWe're now hearing from Democratic Unionist Party MP Carla Lockhart who challenges Rachel Reeves on one of the more controversial policies from the Labour government - changes to inheritance tax.\nLockhart says the government has made time to build economic relationships with countries around the world \"yet won't take time to speak with\" the various farmers' unions who have criticised the government's inheritance tax changes.\nLockhart says farms will be \"decimated\" by the government's decision.\nReeves responds and says she has met with the first minister and deputy first minister of Northern Ireland. The chancellor reiterates the claim the government inherited a \"22bn black hole\" in public finances which meant the government had to make \"difficult decisions on taxes\".\nFor context: The changes to inheritance tax in the last Labour Budget meant farms worth more than £1m would face an inheritance tax rate of 20%. Previously, all farmland was entirely exempt. BBC Verify's Ben Chu previously looked at the controversy surrounding the change.\nHow much is the UK-China agreement worth?\nBy Gerry Georgieva\nRachel Reeves has been defending her visit to China over the weekend.\nThe trip is said to have resulted in agreements worth £600m to the UK economy over the next five years and “up to” £1bn in the longer term, external.\nBoth are government estimates of how much benefit could come from removing certain barriers, external to trade between the two countries.\nThe Treasury told us that approximately £330m is expected to come from agreements on financial services and £270m from ones in agriculture.\nThe £1bn refers to improving arrangements across vaccine approvals, fertiliser, whisky labelling, legal services, cars and accountancy.\nAll of these were agreed as part of the 11th UK-China Economic and Financial Dialogue (EFD).\nThe 10th UK-China EFD in 2019 resulted in agreements with a projected worth of £1.6bn.\n'China's growing quickly and the UK can't miss out'\nReeves is now asked by the Lib Dems' Sarah Olney for an update on trade talks with the EU - citing that UK exports to China represent less than 10% of our total exports compared with 40% to the EU.\nOlney asks whether Reeves will now commit \"four times as much time\" to talks with European counterparts.\nReeves stresses it is \"not either or\" and that we \"can't write off one country\".\nThe chancellor says China is the UK's fourth biggest trading partner and the government can't miss out on opportunities with a country that is \"growing quickly\" with an \"expanding middle class\".\nBut, she adds, she was in Brussels in December and will \"leave no stone unturned\" to achieve her economic goals.\nGloomy mood within Labour as promised growth remains elusive\nIain Watson\nPolitical correspondent\nThe Treasury hopes that once President-elect Trump is inaugurated next week, and there is clarity - for better or worse - over tariffs and the linked effects on inflation, then turmoil on the international markets will replaced by relative calm - and borrowing costs eased.\nIf, however, those costs remain high, government sources are clear that spending will be squeezed rather than taxes raised.\nSubstantial cuts to the welfare budget will be just one screw that will tightened on public spending.\nThe wider question is whether Rachel Reeves’s party has the stomach for this.\nThere has been something of a frenzy in some sections of the press over whether Reeves can hold on to her job.\nThere is no sign of any organised move inside Labour’s parliamentary party to oust the chancellor.\nBut the mood remains gloomy – in part, because of poor polls ratings and in part because promised growth -the government’s \"number one priority\" - remains elusive.\nThe independent Office for Budget Responsibility is due to deliver a new economic forecast in March.\nAnd if downgrades growth prospects, the mood could darken further.\nChancellor tells Tory MP to 'get real' over bond yield rises\nFaisal Islam\nEconomics editor\nAnother telling exchange.\nThe chancellor shot back at a Conservative shadow minister Dr Luke Evans telling him to “get real” about the fact that the rise in bond yields was global volatility.\nShe said it was “not reasonable to suggest reason that bond yields in US Germany and France have risen is because of decisions made by this government”.\nWhile it is true that bond yields are up globally as jittery markets contemplate possible extra inflation and fewer rate cuts in the US under Trump’s policies, there has also been a clear focus on UK growth prospects.\nReeves pressed on spending cuts\nThe SNP's Stephen Flynn asks the next question, probing Reeves to - in his words - do what Prime Minister Keir Starmer has refused to and rule out future spending cuts.\nReeves says she \"won't write five years' worth of Budgets in the first six months of a Labour government\", but repeats that she is committed to meeting the fiscal rules set out in October.\n\"We know what happens when governments lose control of public finances, they crash the economy and end up on that side of the House,\" she says - looking over to her Conservative colleagues.\nDid Reeves raise the case of Jimmy Lai before China trip?\nA second question from Daisy Cooper focuses on Reeves' trip to Beijing - with the Lib Dem MP saying Reeves shouldn't have gone without assurances from China that Hong Kong businessman Jimmy Lai would be released.\nReeves responds by saying that she has already pledged to challenge China where necessary.\n\"Because I went to China I was able to raise issues around human rights, forced labour, Hong Kong and Jimmy Lai, and around the sanctioning of parliamentarians,\" she says.\nShe adds that the only way to challenge China is to be in the room, \"and I was in the room\".\nLib Dems say Budget has not worked\nLiberal Democrat deputy leader Daisy Cooper is next - she begins by saying \"the Budget has not worked\", criticising it for failing to raise funds for the NHS and piling pressure on small businesses.\nCooper says the funds raised by Reeves's trip to China would only fund \"five and a half hours of NHS spending a year\".\nReeves responds, saying the Lib Dems \"can't have it both ways\". If they want more spent on public services, she says, more money will need to be raised to fund this.\nShe goes on to joke that the Lib Dems have repeatedly opposed Labour's plans to raise money, but are now complaining that £600m isn't enough: \"I'd have thought the honourable lady would have welcomed this.\"\n'This government will bring down debt'\nWe'll now bring you questions from cross-party MPs and first up is Labour's Meg Hillier - she asks the chancellor whether she agrees that it's \"perfectly possible\" to manage pressures on the Budget through \"astute management\" of public spending.\nReferring to \"years of austerity\" from the Tories, Hillier adds we are a \"very, very long way\" from that approach.\nReeves refers back to her October Budget - saying the fiscal rules she set then established that day-to-day spending would be paid for through tax receipts and that the government would bring down debt as a share of the economy by the end of this Parliament.\nThe government remains \"committed\" to these fiscal rules, Reeves tells MPs.\nReeves pushes back - asking Conservatives what they would do\nReeves responds to Stride, saying that the Tories' strategy is simply to attack Labour, without offering any comment on what the party would do themselves.\n\"As far as I can tell, the Conservatives' economic strategy is that the UK should not engage with the second largest economy in the world,\" she says - adding that she spoke to a number of banks last week who told her the positive difference her agreement with China would make.\nReeves says this agreement with China forms part of a chance for the government to improve the lives of working people and that she will continue working hard to do that: \"That is the mandate this government had, has, and this is what we will deliver.\"", "url": "https://www.bbc.com/news/live/cgrn0l0kx99t"}