{"authors": ["Kevin Connolly", "www.facebook.com"], "date_download": "2025-05-19 14:47:20", "date_modify": "2025-05-19 14:47:20", "date_publish": "2015-02-26 15:08:56", "description": "Congress's invitation to Benjamin Netanyahu may rile the Obama administration but the two countries have fallen out before, the BBC's Kevin Connolly writes.", "filename": "news_world-europe-31639376_1747666040.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81260000/jpg/_81260488_81260486.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-31639376_1747666040.html", "title": "Israel US: Republican invite to Netanyahu riles Obama", "title_page": "Israel US: Republican invite to Netanyahu riles Obama - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In a world of shifting diplomatic sands, the relationship between the United States and Israel feels like a fixed point.\nThe two countries share military and political intelligence and Israeli politicians tend to portray their country as a kind of branch office of the Free World, operating the franchise in a particularly tough neighbourhood.\nAmerica provides money and weapons for the defence of the Jewish State and is bound to its main ally in the Middle East by countless links, both public and private.\nPro-Israeli lobbying organisations like the American Israel Public Affairs Committee (Aipac) are influential power-brokers in the election of many members of Congress and money flows into Israel from Jewish-American charities and wealthy individuals.\nSo when there is a blip in the relationship, it is news and there is certainly a blip now, if not something slightly more serious.\nIsraeli Prime Minister Benjamin Netanyahu has accepted an invitation to speak to Congress on 3 March - exactly two weeks before Israelis vote in a parliamentary election in which he is seeking a fourth term of office.\nThe invitation came not from the White House - which is furious at being blind-sided - but from the Speaker of the House, the Republican John Boehner.\nMr Netanyahu's rivals at home are also furious. They believe this is not about the fierce urgency of Iran's nuclear ambitions - which will be Mr Netanyahu's subject - but simply about Mr Netanyahu's conservative ideological soul mates on Capitol Hill giving him a leg-up before polling day on one of the world's most glamorous political stages.\nThat issue - Iran and the Bomb - is one of the defining themes of Mr Netanyahu's career and he is alarmed that the P5+1 powers (the five permanent members of the UN Security Council - the US, Russia, China, UK and France - plus Germany) negotiating with Tehran may be preparing to agree a deal towards the end of March which would be acceptable to the world powers but unacceptable to Israel.\nSo he will have plenty to talk about when he stands up in Congress.\nThe Obama administration does not much care for Mr Netanyahu at the best of times. It does not support his judgment on the Iran issue but there is something more too.\nIn siding with the Republicans and against the White House, in a speech to Congress, it may look as though he is intervening in US domestic politics.\nAnd by inviting him to speak as his election campaign in Israel reaches a climax, it looks as though House Republicans are intervening in Israel.\nLast year an unnamed US official was quoted as calling Mr Netanyahu \"a chickenshit\" - this time the administration has confined itself to calling his decision to speak in Congress \"destructive\".\nBut is this the worst relations between the two countries have ever been, as Senator John McCain has said? Probably not.\nThe US fell out with Israel spectacularly under Eisenhower (over Suez) and under Ford, Reagan and George HW Bush. Things got pretty bad in the 50s, the 70s and the 90s.\nThey recovered then and they will recover this time but it will be interesting to study the body language the next time Mr Obama and Mr Netanyahu meet. That will not be on this trip. Too close to Israel's elections, said the White House.\nThe bottom line is this: Mr Netanyahu's speech to Congress has caused quite a political flap even before he has got to his feet and cleared his throat.\nHe had better make sure he has something memorable to say.", "url": "https://www.bbc.com/news/world-europe-31639376"}