{"authors": ["Adam Laver", "www.facebook.com"], "date_download": "2025-04-26 06:35:04", "date_modify": "2025-04-26 06:35:04", "date_publish": "2025-02-27 06:15:56", "description": "Saad Qureshi says his Tower of Now marks the \"very unique identity\" that only exists in Bradford.", "filename": "news_articles_cd7edd0vy9jo_1745649304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9457/live/89d25c50-f376-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd7edd0vy9jo_1745649304.html", "title": "Bradford culture sculpture celebrates 'incredible city'", "title_page": "Bradford culture sculpture celebrates 'incredible city' - artist - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 50ft (15m) sculpture to be installed in Bradford as part of its City of Culture year was inspired by the area's multiculturalism, its creator has said.\nArtist Saad Qureshi, who moved with his family from Pakistan to Heaton at the age of eight, said he had designed the Tower of Now to celebrate the \"incredible\" city's diversity.\nOriginally intended to play soundscapes featuring voices in different languages, the tower has since been changed to a solely visual piece of art.\nMr Qureshi, 39, said the sculpture, on the site of the former Hall Ings car park, represented a \"culmination of these beautiful cultures and traditions that co-exist\" in Bradford.\nMr Qureshi, whose work has been exhibited in shows in London, New York and New Delhi, said his formative years in Bradford had always inspired his creativity.\nHowever, he said that when he had first told his family he wanted to be an artist, \"there was a lot of hesitation initially, from my parents particularly, about what this is going to lead to\".\nMr Qureshi said it was his art teacher at school, Mrs Robinson, who saw a talent that needed to be nurtured.\n\"She was the one that really inspired me and believed in me and convinced my parents that I should study art,\" he said.\nAfter spending his first eight years in Bewal, a small town in rural Pakistan, Mr Qureshi said that on arrival in Bradford he faced having to familiarise himself with a whole new culture and ways of expressing himself.\n\"I had to relearn how to communicate in a new language,\" he said.\n\"Art class was my safe space and I remember Mrs Robinson saying, 'if you can't say it, do it'.\n\"It was really wonderful for me to be able to develop this visual language.\"\nSpeaking about the inspiration for his Tower of Now sculpture, which is due to remain in its site in the centre of Bradford until March next year, Mr Qureshi said it was intended to highlight what was special about the city.\n\"I've taken small snippets and elements of sacred architecture from different traditions, cultures, religions, and I have woven them together so it sits in harmony in this one single column,\" he said.\n\"If you look at the sculpture, the narrowest part is down at the base of it, so it really talks about this perfect balance that multiculturalism requires.\n\"I genuinely feel Bradfordians have this very unique identity that only exists in Bradford, which is a culmination of these beautiful cultures and traditions that co-exist in the city.\"\nWith Bradford City of Culture 2025 now well under way, and months of special events still ahead, Mr Qureshi said it was \"high time Bradford got its due for being the incredible city it is\".\n\"I was only very happy and excited that we are finally celebrating what should have been celebrated all along,\" he added.\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cd7edd0vy9jo"}