{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:32", "date_modify": "2025-05-19 15:31:32", "date_publish": "2017-07-22 12:54:20", "description": "Researchers hope to create an online catalogue of cider and perry fruit using their DNA traits.", "filename": "news_uk-wales-39950413_1747668692.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/11E87/production/_97015337_apples.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-39950413_1747668692.html", "title": "Cider study finds unknown 'Wales-only' apples and pears", "title_page": "Cider study finds unknown 'Wales-only' apples and pears - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Researchers have uncovered 43 new varieties of apples and pears believed to be found only in Wales.\nA £500,000 joint project by the University of South Wales (USW) and the Welsh Perry & Cider Society is looking at the heritage of orchards and cider-making in Wales.\nIt hopes to create an online catalogue of cider and perry fruit in Wales using their DNA traits.\nThe Welsh Perry & Cider Society said the results were \"incredibly exciting\".\nThe two-year project, which features a number of studies and aims, has tested leaves at the society's museum orchard, outside Llanarth, near Abergavenny, as well as other sites across the country.\nSamples have been sent and compared to those recorded at the National Fruit Collection in Brogdale, Kent.\nDNA results confirmed 12 cider apples and nine perry pears within the museum orchard are Welsh, with a further 22 unique varieties identified from elsewhere in Wales not registered with Brogdale's database and which are believed to be found only in Wales.\n\"It's incredibly exciting for us,\" said Jayne Hunt, heritage project manager at the Welsh Perry & Cider Society, based in Crumlin, Caerphilly county.\n\"The project has unearthed far more unique varieties than we ever expected - fruit that is probably found only in Wales, and which has never been recorded.\n\"For cider lovers with a patriotic streak, it could be just what they're looking for.\"", "url": "https://www.bbc.com/news/uk-wales-39950413"}