{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:18:56", "date_modify": "2025-05-21 05:18:56", "date_publish": "2025-04-04 00:00:00", "description": "The constitutional court unanimously voted to uphold Yoon Suk Yeol's impeachment, paving the way for a snap election within 60 days.", "filename": "news_live_c5yrpvggyyet_1747804736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/78ce/live/d53ee860-10ff-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c5yrpvggyyet_1747804736.html", "title": "South Korea impeachment: Jubilation and despair as court upholds Yoon Suk Yeol's removal from office", "title_page": "South Korea impeachment: Jubilation and despair as court upholds Yoon Suk Yeol's removal from office - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thank you for staying with us\nWe're wrapping up our live page coverage for today. Thank you for staying with us as we covered a historic moment in South Korea's history.\nYou can read our news story here.\nThis page was edited by Tessa Wong, Yvette Tan and Joel Guinto in Singapore, with posts written by Fan Wang, Ewe Koh and Kelly Ng.\nJean Mackenzie, Shaimaa Khalil, Katy Watson and Simon Atkinson reported from Seoul, as did David Oh, Yuna Ku, Rachel Lee, Richard Kim and Hyojung Kim from BBC Korean.\nVerdict won't end political division Yoon unleashed in South Korea\nJean Mackenzie\nSeoul correspondent\nWhen Mr Yoon tried to orchestrate a military takeover, claiming the country had been infiltrated by North Korean spies, he stunned the world.\nFor the past month, eight judges at the constitutional court have been deliberating his fate. Today they unanimously ruled that he’d abused his power and should be immediately removed from office.\nThis is the result most people here had been hoping for – though not Mr Yoon’s loyal supporters, who’ve become more agitated and extreme as this case has dragged on, latching onto far-right conspiracy theories.\nThe authorities are urging them to accept this ruling and stay calm.\nMartial law only lasted six short hours, but it polarised the country. This verdict will bring some closure to South Korea. It can start to move forward – and elect a new leader.\nBut it won’t bring an end to the tension and division that Mr Yoon has unleashed here.\nThe scandalous history of South Korea's presidents\nYoon is the latest in a number of former South Korean leaders who have had their reputations marred or presidential terms interrupted by scandal. Here's the list:\nSouth Korea's first president Syngman Rhee fled the country for Hawaii in 1960 - where he died in 1965 - after his re-election led to violent protests.\nIn 1979, Park Chung-hee, who came to power after a coup and oversaw an authoritarian turn in the country, was assassinated by his own spy chief and lifelong friend.\nMilitary commander Chun Doo-hwan and his handpicked successor Roh Tae-woo were convicted in 1996 of corruption, as well as their roles in a coup and the Gwangju massacre.\nRoh Moo-hyun, who won the presidential race in 2002 and left office in 2007, took his own life as corruption investigators closed in over allegations he accepted $6m in bribes.\nLee Myung-bak, who won the 2007 election, was jailed for bribery five years after he left office.\nHis successor Park Geun-hye - the daughter of Park Chung-hee - was impeached in 2016 and jailed after a corruption scandal.\nRead the full breakdown of South Korea's scandal-hit former presidents.\nImpending presidential race 'basically neck and neck' - expert\nYoon's ruling People Power Party and the opposition Democratic Party will be \"basically neck and neck\" in the upcoming presidential race, Sung-Yoon Lee, Global Fellow at the Woodrow Wilson International Center for Scholars, told BBC Newsday earlier.\nAfter the court verdict today, which removes Yoon from office, a presidential election has to be held within the next 60 days.\nWhile Democratic Party leader Lee Jae-myung enjoys a \"comfortable lead\", Lee said, \"the swelling of support for Yoon's party\" in recent months cannot be discounted.\n\"One cannot rule out that the candidate from Yoon's party may prevail,\" Lee said. \"The drama goes on.\"\nThe 'traitor' at the heart of South Korea's impeachment drama\nHan Dong-hoon was driving home from dinner when he heard a breaking news update: President Yoon Suk-Yeol was preparing to deliver an emergency address.\nHours later, the president plunged the country into turmoil as he declared that he would be imposing martial law.\nThousands responded, with lawmakers rushing into the assembly building and clambering over fences and walls in a desperate attempt to block Yoon's order.\nHan - then the leader of Yoon's People Power Party (PPP) and widely seen as one of the president's closest allies - was among them.\nHis decision to impeach the very president he'd helped get elected was a surprising heel turn for someone formerly viewed as Yoon's right-hand man, with some branding him a \"traitor\".\n\"I find the current situation extremely painful and regretful,\" he said. \"Both the president and I worked in good faith for the betterment of our country – yet I must say that I deeply regret how things have turned out.\"\nRead more of Han's account here.\nYoon and his allies also face insurrection charges\nSeparate to the impeachment, Yoon has been on criminal trial over allegations that he led an insurrection with the botched martial law attempt. The charges handed to him on January made him the first sitting president in South Korean history to be charged with a crime.\nTravel bans also have been imposed on Yoon and several senior officials since December and some of the commanders and senior officials who dispatched troops under martial law were jailed.\nYoon was arrested in January - in a second attempt by authorities to take him into custody - and detained for over a month. He was released on 8 March after a court in Seoul overturned his arrest on technical grounds.\nKoreans eat green onion noodles in celebration of Yoon's impeachment\nHyojung Kim\nBBC Korean\nAfter Yoon was impeached, a new social media trend called the \"Impeachment Meal\" began. Hashtags like \"Dismissal Special\", \"Impeachment Special\", and \"Celebration Noodles\" have also become popular.\nMany are celebrating the impeachment by eating noodle dishes or other tasty meals and posting pictures online, external.\nThe dishes often include \"pa\" (green onions) and \"myeon\" (noodles), external - the word \"pamyeon\" sounds like impeachment or removal in Korean. Noodles are also traditionally eaten in Korea for celebrations.\nAs of this afternoon, more than 28,000 posts with the hashtag \"Dismissal Special\" have popped up on X.\nWho is Yoon Suk Yeol?\nBefore his martial law order, Yoon had already found himself in a political quagmire, plagued with personal scandals and mounting pressure from the opposition.\nA relative newcomer to politics when he won the presidency in 2022, Yoon had risen to national prominence for prosecuting the corruption case against former leader Park Geun-hye in 2016.\nAt a time when South Korea was grappling with widening divisions over gender issues, Yoon appealed to young male voters by running on an anti-feminism platform.\nHe also championed a hawkish stance on North Korea. In trying to impose martial law, he said it was to protect his countrymen against North Korean forces and “eliminate anti-state elements”, but it later became clear that the declaration had more to do with his domestic woes.\nMuch of the scandal surrounding Yoon's presidency centred around his wife Kim Keon Hee, who was accused of corruption and influence peddling, most notably allegedly accepting a Dior bag from a pastor.\nYoon was relegated to a lame duck president after the opposition Democratic Party won the parliamentary election by a landslide in April 2023. The result was widely seen as a vote of no confidence on his time in office.\nRead more about Yoon in our profile piece here.\nProtests turned bustling parts of Seoul into ghost towns, say struggling shop owners\nRachel Lee\nBBC Korean\nIn the lead-up to the verdict, thousands of protesters have staged rallies in central Seoul calling for either Yoon to go or to stay.\nChoi Seung-yeol, who runs a French fries shop near the Constitutional Court, says his sales have dropped by nearly half compared to a few months ago, before protests erupted in the area.\n\"This place used to be lively, with young couples on dates and foreign tourists dressed in hanbok [traditional Korean clothing] taking pictures. But now, with road restrictions in place, there aren’t many people hanging around here anymore.\"\nBaek Seung-hoon, who owns a restaurant in the area, faces the same struggle. His store used to be one of the most popular spots for lunch-goers in the area, but only few people were seen on the day our team visited ahead of the ruling.\n\"It’s even worse in the evenings,\" Baek says. \"More protesters arrive after 6 pm as workers get off from their jobs. This has been going on for almost two months now.\"\nBaek’s calendar is now filled with red marks - his way of tracking booking cancellations. Many customers have called to cancel, saying they’re too afraid to visit the area.\n\"This isn’t the first time,\" Baek sighs. \"I was here when former presidents were impeached. When Park Geun-hye was removed from office, I had no customers at all. I’m preparing for the worst again.\"\nWho might run in the snap presidential election?\nRichard Kim\nBBC Korean\nSouth Korea’s political landscape has shifted dramatically following the Constitutional Court’s decision to dismiss former President Yoon Suk-yeol from office, setting the stage for a snap presidential election.\nLee Jae-myung, the leader of the opposition Democratic Party, is currently the frontrunner among presidential hopefuls.\nWithin the ruling People Power Party (PPP), a fierce primary race is expected, featuring key figures such as Minister of Employment and Labor Kim Moon-soo, Seoul Mayor Oh Se-hoon, Daegu Mayor Hong Joon-pyo, and former PPP leader Han Dong-hoon.\nAmong them, Kim is currently enjoying relatively strong support. However, Lee Jae-myung’s approval rating is roughly three times higher.\nHan Dong-hoon, once a political ally of former President Yoon, has stated he is determined to stop what he describes as Lee’s “one-man dominance.”\nWhile it remains unclear who else from the PPP might enter the race, most analysts agree that with less than two months until the election, time is running out for any conservative candidate to overtake Lee Jae-myung in the polls.\nOutside of the PPP, Lee Jun-seok, a 40-year-old lawmaker from the Reform Party, has also attracted attention. In a December interview with BBC Korean, Lee announced his candidacy, pledging to bring about “a complete generational shift.”\nActing President Han: 'We'll do our best to manage the next election'\nActing President Han Duck-soo has just spoken to reporters in a news briefing.\n\"I solemnly acknowledge the grave and unfortunate situation in which a sitting head of state has been impeached for only the second time in our constitutional history,\" he said.\n“In support of the will of the sovereign people, we will do our best to manage the next presidential election so that the next government can be launched without disruption in accordance with the Constitution and laws.”\nHow the martial law crisis fuelled far-right extremism\nJean Mackenzie\nSeoul correspondent\nI was on the streets with hundreds of thousands of protesters as parliament voted to oust President Yoon four months ago. People erupted in joy. The country was mostly united in its rejection of their president.\nBut today, the picture is different. Although the majority of people were still hoping for this verdict, more than a third wanted Mr Yoon to return as president, and they are angry and disappointed.\nSo why the shift?\nWhen Yoon declared martial law, he played on people’s fears of North Korea. He claimed that the country and his political opposition had been infiltrated by North Korean and Chinese spies, and that these “anti-state forces” had rigged past elections.\nHe then continued to dangle these unsubstituted conspiracies, which have traditionally been pedalled by the far right.\nGradually, more and more people believed him. “Why would the president lie?” is a question his supporters now often ask me when I speak to them. They see him as a martyr; the victim of an establishment that has been overrun by “communists”.\nThousands protest every week in the centre of Seoul. They were on the streets today, and will be there again tomorrow, claiming the country’s politicians, judges and electoral commission are all corrupt.\nRead more here.\nPro-Yoon rally plans cancelled by despondent supporters\nYuna Ku and David Oh\nBBC Korean Service\nA rally that was planned by Yoon supporters at the presidential residence today has been cancelled.\nWe saw the mood at the pro-Yoon rally plummet after the verdict, with many supporters bursting into tears and anger.\nThe crowd began to disperse as many supporters packed up and left. But some have remained, like Won Bog-sil.\nThe 64-year-old says she came all the way from Jeju island to participate in the rally.\n“I came here with hope in my heart, believing we would win. I was sure we would win,\" she says.\n“What did President Yoon Suk Yeol do wrong?… President Yoon Suk Yeol loves and protects this country. The people know the Constitutional Court’s ruling today isn’t the truth.\n\"Mr President, please stay strong and protect Korea. It’s so unfair. So unfair.”\nAnother pro-Yoon demonstrator said he was angry about today's court ruling; however, he said he would respect the decision.\n\"Today, South Korea's liberal democracy has finally been sentenced to death,\" he said.\n\"I am very angry, but I must acknowledge this situation. I don't want any violence. It is so unfair that I can only accept this situation with tears, but I have no other choice.\"\n'It’s a relief Yoon's impeached' - opposition supporter\nKaty Watson and Simon Atkinson\nSeohyun Han, 62, from Seongnam city, is handing out free hot drinks in one of the tents at Ganghwamun, where anti-Yoon protesters have gathered to celebrate his removal from office.\nShe's decked out in merchandise of the man she wants to be president next: Lee Jae-Myung, the leader of the main opposition party, Democratic Party.\n“When a new president is elected, then there will be a new Korea,\" she says.\nBut despite her smiles today, she says she is still \"very anxious\" for the country's situation after months of political turmoil that has affected South Korea's economy.\n\"It’s a relief Yoon has been impeached but I’m still worried.\"", "url": "https://www.bbc.com/news/live/c5yrpvggyyet"}