{"authors": ["Robert Peston", "www.facebook.com"], "date_download": "2025-05-19 14:58:11", "date_modify": "2025-05-19 14:58:11", "date_publish": "2015-03-09 09:57:20", "description": "How ready is the Treasury for the next great crash and recession?", "filename": "news_business-31796541_1747666691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81492000/jpg/_81492255_ftse.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_business-31796541_1747666691.html", "title": "Is the Treasury prepared for the next crash?", "title_page": "Is the Treasury prepared for the next crash? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Treasury was grotesquely unprepared in the summer of 2007 for the closure of financial markets and the financial and economic crisis that followed.\nIt was intellectually and emotionally unready for the mayhem that was about to break out. And it was chronically short of officials with relevant expertise, especially in senior positions.\nIts big mistake was that of banks and regulators across the world - it had been lulled by the passage of so many years of prosperity into believing that financial stability was the natural and permanent condition, that a full-blown banking crisis was the most unlikely of risks facing the country and world.\nSo the worrying and damaging implication of today's report from the Commons Public Administration Committee is that the Treasury remains prone to risk myopia.\nIt is concerned that the government's National Risk Register, which is a snapshot of what are perceived to be important systemic dangers, does not include the risk of financial meltdown alongside anti-microbial resistance and pandemic flu.\nAnd it is critical that too few \"war games\" are being played by the Treasury, Bank of England and Financial Conduct Authority - or realistic simulations of how they would react in the far-from-impossible event that a vast bank, or insurer, money manager or hedge fund found itself unable to meet its obligations, and panic ensued.\nWhat is the Treasury's response? Well it accuses the MPs on the committee of \"taking no account of the relevant facts\". No obeisance to its employer then.\nThe Treasury points out that it has thoroughly overhauled both the structure of regulation, concentrating power on a massively enlarged Bank of England, and the structure of our big banks - by legislating to put a firewall between their retail and investment banking operations.\nIt also points out that financial and market risks are included in the National Security Risk Assessment (NSRA), which, it says is the more detailed register that builds on the National Risk Assessment.\nWhat is more, a global financial armageddon war game was played last spring by the chancellor and the governor of the Bank of England with their US counterparts and others.\nBut some will see the grumpy reaction to MPs of the Treasury as redolent of its famous self-confidence, bordering on dangerous arrogance.\nMore germanely, the radical reforms it pushed through after the 2007-8 debacle were - to state the obvious - designed to ward off the last crisis, but cannot be a prophylactic against all crises.", "url": "https://www.bbc.com/news/business-31796541"}