{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:31:00", "date_modify": "2025-05-19 15:31:00", "date_publish": "2015-02-18 22:49:29", "description": "An Australian former Guantanamo Bay detainee, David Hicks, successfully challenges his terrorism conviction in the US.", "filename": "news_world-australia-31528159_1747668660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81096000/jpg/_81096020_025069754-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-australia-31528159_1747668660.html", "title": "Australian David Hicks overturns US terrorism conviction", "title_page": "Australian David Hicks overturns US terrorism conviction - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "An Australian former Guantanamo Bay detainee has had his terrorism conviction overturned in the US.\nDavid Hicks, 39, pleaded guilty at the base in Cuba in 2007 to providing material support to terrorism.\nBut a US court has struck down the conviction, on the grounds the charge was not a war crime and so should not have been heard at a military court.\nMr Hicks was captured in Afghanistan in 2001, where he attended al-Qaeda training camps and met Osama Bin Laden.\nA Pentagon spokesman said the US would not appeal.\nThe unanimous ruling, by the US Court of Military Commission Review, reverses what had been one of the few successes in prosecuting Guantanamo detainees.\nIn January, a US military commission also overturned the conviction of a former Guantanamo inmate from Sudan, Noor Mohammed, who made a plea bargain under a similar charge to Mr Hicks.\nDavid Hicks told a news conference in Sydney that he \"had been waiting for this decision for years\". \"It's a relief because it's over,\" he said.\nHe said he would not seek an official apology but that he should be compensated for medical treatment needed to \"fix myself from torture\".\n\"It is being kept in metal rooms in freezing conditions for years, it is not being able to move or exercise,\" he said.\n\"The body deteriorates over five-and-a-half years, even without the added torture, such as stress positions, being beaten, etc.\"\nHis lawyer Stephen Kenny, meanwhile, said the decision confirmed that Mr Hicks' actions had not been illegal at the time.\n\"He wasn't doing anything that was a breach of Australian, international or US law.\"\nUS civilian courts have ruled that the charge of providing material support for terrorism cannot be considered a war crime in cases that were brought for actions before 2006, when new laws were adopted.", "url": "https://www.bbc.com/news/world-australia-31528159"}