{"authors": ["Olivia Copeland", "www.facebook.com"], "date_download": "2025-04-26 04:26:14", "date_modify": "2025-04-26 04:26:14", "date_publish": "2025-03-03 11:33:40", "description": "Calls come after complaint about the president of the States of Alderney.", "filename": "news_articles_cjryyexy394o_1745641574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/54b0/live/3c9a7460-f5d1-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjryyexy394o_1745641574.html", "title": "Calls for Alderney standards commissioner", "title_page": "Calls for Alderney standards commissioner after conduct complaint - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ex-politicians have called for an independent standards commissioner to rule over a code of conduct complaint against the president of the States of Alderney.\nIt comes after the vice president of the States, Steve Roberts, decided no further action would be taken over a complaint against President William Tate.\nBruce Woodhead submitted the complaint on 6 February after he resigned from the States of Alderney in December and said the way it had been dealt with was \"ridiculous\".\nThe president and vice president have both declined to comment.\nThe complaint centred around Woodhead's belief Tate had been \"totally biased\" against the States' former chief executive Theo Leijser during a December 2024 policy and finance committee meeting at which Leijser's employment status was discussed.\nWoodhead said Tate was \"incensed\" by a press release after Nigel Vooght had stepped down as chair of the committee.\nHe said Tate told the committee Mr Leijser \"should not have passed comment\" on Vooght's departure.\nIn response to the complaint, Roberts said the complaint \"has not been substantiated\" and \"determined that that no further action will be taken\".\nWoodhead said Roberts had a \"conflict of interest\" because he attended the meeting.\nVooght said responsibility for the code of conduct needs to be \"taken off-island\".\n\"It lacks independence, it lacks integrity and transparency.\"\nWoodhead said: \"The code of conduct has demonstrated the system doesn't work. It's null and void.\n\"It's ridiculous, because you put in a code of conduct complaint for good reason, and it's not even being looked at.\"\nHe called for an independent standards commissioner.", "url": "https://www.bbc.co.uk/news/articles/cjryyexy394o"}