{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:59:26", "date_modify": "2025-05-21 06:59:26", "date_publish": "2025-03-29 00:00:00", "description": "Skygazers across the UK – and in other parts of the world – are looking up to catch the astronomical spectacle.", "filename": "news_live_c1jp6yw366kt_1747810766.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1jp6yw366kt_1747810766.html", "title": "'Beautiful experience': Enthusiasts watch partial solar eclipse as Moon covers the Sun", "title_page": "'Beautiful experience': Enthusiasts watch partial solar eclipse as Moon covers the Sun - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Partial solar eclipse brings 'good vibes' and Pac-Man – and there's more coming next year\nLana Lam\nLive reporter\nSkywatchers across the UK and beyond were treated to a stunning sight today as a partial solar eclipse dazzled the skies for several hours.\nFrom the Royal Observatory in Greenwich to Warwickshire and all the way up to Manchester, people watched as the Moon moved in front of the Sun, stirring up a range of emotions.\nWe even got a great view from Nuuk, the capital of Greenland.\nWhile not a rare event, it was a special treat to see it from here in the UK. Some called it “humbling”, others “beautiful” – and one youngster said the sun looked like Pac-Man with a bite taken out of it.\nIf you missed it, you can scroll back through our live coverage. And don’t worry – there’s another one coming in August 2026.\nWe're closing our live coverage now. Thanks for joining us this nice morning.\nEclipse is 'bringing good vibes' and fond memories for viewers in Greenwich\nWe've been speaking to some of the viewers who made their way to the Royal Observatory in Greenwich to catch the partial solar eclipse.\nElizabeth Binney is visiting London from Thailand and headed to Greenwich this morning with a running group.\n\"It's such a buzz, I didn't think this was going to be part of my Saturday morning,\" she tells the BBC, adding \"it'll be one of my memories of my time in London\".\nPriyanka Prasher, originally from Birmingham and now living in London, says it's a lovely atmosphere.\n\"It's bringing good vibes... and it's a nice symbol of saying hello to spring,\" she says.\n\"My mum is visiting so I thought it would be a really nice experience to mark the occasion with the solar eclipse just before Mother's Day.\"\n'It's something everyone can see', say astronomers from the Royal Observatory\nRebecca Morelle\nScience editor, reporting from the Royal Observatory in Greenwich\nI've just been speaking to a couple of astronomers from the Royal Observatory.\n\"It's really exciting because it's something that everyone can see,\" says Bryony Lanigan, by using eclipse glasses or a pinhole projector.\n\"We always associate the moon with the night, the sun with the day but that's not really the way it works,\" she says.\n\"Our moon goes around us, we go around the sun - and at times, it all lines up so that one covers the other as it is right now.\"\nFellow astronomer Anna Gammon-Ross says partial eclipses aren't that rare and the UK is in a good position to see this one.\nA boy says the Sun looked a bit like Pac-Man\nRebecca Morelle\nScience editor, reporting from the Royal Observatory in Greenwich\nThe eclipse is past its peak now, and the shadow of the Moon is now moving to the top of the Sun.\nThe skies became a little hazy at the peak, but the view was still crystal clear through my safety glasses.\nThe crowd at the Royal Observatory Greenwich have loved it – describing it as magical and spectacular.\nOne boy called Jack said the Sun looked a bit like PacMan.\nA spectacular sight\nRebecca Morelle\nScience editor, reporting from the Royal Observatory in Greenwich\nIt's just a spectacular sight, seeing the sun appearing as a crescent and the moon taking a little nibble out of the side.\nWe've had really good weather here this morning. It's hazed over very slightly in the last few minutes but it's still a lovely view to see.\nThe views are differing across the UK - in the Outer Hebrides it's about 47% and in the southeast, it goes down to 28%.\n'This is just fun,' says professor watching the eclipse in Oxford\nWe've just heard from Chris Lintott, a professor of astrophysics at Oxford University, who's watching the partial eclipse in Oxford using special glasses. (Remember, it’s not safe to look at the eclipse with the naked eye.)\n\"We can see probably about 25 to 30% of the sun's disc is now covered by the moon, which is making a slow and stately progress across the face,\" he says.\n\"This is just fun... I think there's something nice about seeing the machinery of the solar system unfold.\n\"About 40 per cent of the sun will be covered in about 15 minutes or so.\" Lintott says partial solar eclipses happen a \"few times a year\", so they're not rare – and there's a good one next August for most of Europe.", "url": "https://www.bbc.com/news/live/c1jp6yw366kt"}