{"authors": ["Federica Bedendo", "www.facebook.com"], "date_download": "2025-04-26 07:06:37", "date_modify": "2025-04-26 07:06:37", "date_publish": "2025-02-28 06:15:27", "description": "A couple say they found out from social media their evening do would move from Dalston Hall's marquee.", "filename": "news_articles_c4g77rk25dro_1745651197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8922/live/87e081d0-f4ff-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g77rk25dro_1745651197.html", "title": "Dalston Hall noise complaints lead to wedding woes for couples", "title_page": "Dalston Hall noise complaints lead to wedding woes for couples - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Noise complaints about a wedding venue's marquee have caused last-minute stress for couples who will see their evening dos moved indoors.\nDalston Hall near Carlisle, Cumbria, received an abatement notice from Cumberland Council due to noise complaints, meaning they had to limit the use of their marquee.\nJade Keiling and Nathaniel Lee, who are due to get married there in two weeks, only found out about the change of plans from a post on social media.\nDalston Hall said it had applied to the council more than a year ago to address noise complaints. The council said a decision had been deferred in light of new documents from the venue and for councillors to visit the site.\nMiss Keiling, 30, and Mr Lee, 29, booked their wedding at Dalston Hall shortly after getting engaged in July 2023.\nTheir wedding celebrations were due to be held in the marquee, but when another bride-to-be posted on social media this week about restrictions to the use of the marquee, she found out her evening party would have to be moved indoors.\n\"I have been a bit stressed - I wasn't too happy,\" said Miss Keiling.\n\"It obviously can't be helped, it was just kind of a shock how I found out - my DJ tagged me on a post on Facebook, that's not the way to find out.\"\nMiss Keiling and Mr Lee, who live in Carlisle, have since been able to speak to the venue and said staff reassured them another space would be made available and the event would run smoothly.\n\"If I had known months ago, I would have gone somewhere else, but there's nothing we can do now, at least it's not been cancelled,\" Miss Keiling said.\nA spokeswoman for Gilchrist Collection, which owns Dalston Hall, said the venue had been frustrated with the lack of progress made with the council in addressing noise concerns from the marquee.\nThe group recently purchased the property and had plans to build a new marquee.\nIn the meantime, it requested to extend permission from the council to continue using the existing marquee, but the council is yet to make a decision a year on.\n\"We wanted a two-year extension so we could facilitate the bookings that we had, then we would have a closure period to build our new structure and everyone would be happy,\" said the spokeswoman.\nShe added the venue had appealed the council's abatement notice, which was triggered by neighbours' complaints.", "url": "https://www.bbc.co.uk/news/articles/c4g77rk25dro"}