{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 06:37:55", "date_modify": "2025-04-26 06:37:55", "date_publish": "2025-02-26 06:25:45", "description": "Wednesday evening's planned outage will allow for \"key pipework\" to be replaced, Manx Care says.", "filename": "news_articles_cjw2dng2w45o_1745649475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c4f0/live/c50917f0-f2b3-11ef-9220-d3ef6018353e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjw2dng2w45o_1745649475.html", "title": "Water outage at Noble's Hospital planned for maintenance works", "title_page": "Water outage at Noble's Hospital planned for maintenance works - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The waiting area for the emergency department at the Isle of Man's main hospital will be relocated for six hours on Wednesday during a planned water outage.\nManx Care said those waiting would be accommodated in the radiology waiting space at Noble's Hospital from 20:00 GMT on Wednesday.\nThe outage is required as part of ongoing work to upgrade the hospital's infrastructure, which will see water switched off on the West Wing from 21:00.\nThe healthcare provider said preparations had taken place to ensure minimal disruption and the team \"did not anticipate any significant impact on patient care\".\nThe temporary move will see hand wash basins put in place to ensure infection prevention and control, with alternative water and toilet access points identified for staff and hospital visitors across other affected wards.\nManx Care said dedicated teams would be on site to co-ordinate the outage and resolve any issues, and signage would be in place to direct people to the right waiting area until the water was switched back on, which is expected to be at 03:00 on Thursday.\nMaintaining the \"resilience of our critical infrastructure\" was a priority and the team had taken steps to ensure \"disruption is minimised for our frontline staff and patients\", the health care provider added.", "url": "https://www.bbc.co.uk/news/articles/cjw2dng2w45o"}