{"authors": ["Katy Prickett", "www.facebook.com"], "date_download": "2025-04-26 06:20:44", "date_modify": "2025-04-26 06:20:44", "date_publish": "2025-03-01 06:29:59", "description": "The loss might have been the equivalent of \"a few hundred quid\" to its owner, says a coin expert.", "filename": "news_articles_c20dzmnkd0yo_1745648444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1890/live/13ecbd90-f60b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20dzmnkd0yo_1745648444.html", "title": "Barton Bendish detectorist finds Roman silver coin hoard", "title_page": "Barton Bendish detectorist finds Roman silver coin hoard - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hoard of 16 silver Roman coins spanning two centuries has been discovered in a field by a detectorist.\nThe denarii date from the late Roman Republic to the reign of Marcus Aurelius and his wife Faustina, and were found at Barton Bendish, Norfolk.\nCoin specialist Adrian Marsden said the loss might have been the equivalent of \"a few hundred quid\" to its owner.\nThe hoard is the subject of a treasure inquest and King's Lynn Museum is hoping to acquire it.\n\"There's 200 years' worth of coins in the hoard, which is what you get with a stable currency,\" Dr Marsden, from the Norfolk Historic Environment Service, said.\n\"It's similar to the 1960s when you'd still get Victorian pennies in your change, although they were practically worn smooth.\"\nThe earliest coin in the hoard dates from 57BC and is also the most worn.\nIt was made in the Roman Republic which lasted from 509BC, when a monarch was replaced by elected magistrates, until 27BC, external, when the empire began.\nThe rest of the coins show six emperors and two of their wives, with the most recent denarii dating to AD175-6.\nDr Marsden said it was impossible to know if the coins were a purse loss or had been deliberately hidden \"which is simply what you do when you haven't got banks\".\n\"We do know that this part of Norfolk, the area on the fen edge around King's Lynn, was a very prosperous part of Britain - there was a line of villas here and you've got [the county's longest Roman road] the Peddars Way, external - because the soil is very fertile and it's prime agricultural land,\" he said.\n\"While it's always very difficult to tie in coins with prices today, because the structure of society was so very different, the loss was probably worth the equivalent of a few hundred quid to its owner.\"", "url": "https://www.bbc.co.uk/news/articles/c20dzmnkd0yo"}