{"authors": ["Robbie Macdonald", "www.facebook.com"], "date_download": "2025-04-26 04:19:12", "date_modify": "2025-04-26 04:19:12", "date_publish": "2025-03-04 06:21:17", "description": "West Lancashire Council warns other services may have to be cut as a way of balancing its budget.", "filename": "news_articles_c93ny4qv55lo_1745641152.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c32/live/01554370-f84d-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93ny4qv55lo_1745641152.html", "title": "Park and Nye Bevan swimming pools decision 'a victory for workers'", "title_page": "Park and Nye Bevan swimming pools decision 'a victory for workers' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A trade union which represents more than 70 workers at two council-owned swimming pools in West Lancashire has welcomed the decision to keep them open.\nThe GMB commented after councillors voted last week to save Park Pool in Ormskirk and Nye Bevan Pool in Skelmersdale.\nGMB regional organiser Tim Collins said: \"This is a huge victory for the workers and the community.\"\nMeanwhile, the council said it would have to hold a new budget meeting and consider cutting other services and raising charges because of the cost implications of saving the two pools.\nMr Collins said the union had \"fought tirelessly to protect these vital facilities and we're pleased to see that the voices of staff, service users, and residents have been heard\".\n\"Public services like swimming pools and ranger services are lifelines for our communities, providing jobs, health benefits and vital green spaces.\n\"Thanks to our members' determination and the support of key councillors, we've saved more than 70 jobs and secured the future of these services.\n\"We'll continue to work constructively with the council to ensure these facilities remain sustainable for years to come.\"\nWest Lancashire Council had been due to agree its budget for the coming year at a meeting on 26 February.\nA revised budget must now be agreed before the end of March.\nIn a statement following the decision to reverse its pool closures plan, the council said its budget gap had been forecast to increase from £2.11m to £3.39m in 2026-27, and then reach £4.11m the following year.\nIt said councillors now needed to \"look at all alternatives, which will include additional cuts to council services and raising charges\".", "url": "https://www.bbc.co.uk/news/articles/c93ny4qv55lo"}