{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:39:19", "date_modify": "2025-04-26 07:39:19", "date_publish": "2025-02-27 13:20:09", "description": "Paul Flowers betrayed his long-time friend so he could squander cash on holidays and drugs.", "filename": "news_articles_cy9ddxn727ro_1745653159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1b14/live/822dbbf0-f50d-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy9ddxn727ro_1745653159.html", "title": "Former Co-op Bank chairman jailed for £100k fraud", "title_page": "Paul Flowers: Former Co-op Bank chairman jailed for £100k fraud - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Co-operative Bank chairman Paul Flowers has been jailed for swindling an elderly and vulnerable friend out of £100,000.\nFlowers, 74, betrayed his friend, who had dementia, and spent her money on holidays and drugs, Manchester Crown Court heard.\nThe former Methodist minister, who was previously a Labour councillor in Rochdale and Bradford, was in charge of the Manchester-based bank between 2010 and 2013.\nHe pleaded guilty to 18 counts of fraud and was sentenced to three years.\nThe court heard his long-time friend Margaret Jarvis was a retired teacher who had no partner or children.\nHe had been made power of attorney and executor of Ms Jarvis's will as her dementia progressed and she could no longer look after her own money.\nFlowers began controlling her accounts and using her cash for his own selfish ends and continued to take her money after she had died, aged 82, in a care home, the court heard.\nFlowers, from Salford, had admitted fraud charges amounting to nearly £100,000 over a two-year period ending in 2017.\nThe defendant, who was dubbed the \"crystal methodist\" after a newspaper drugs sting, was brought into court using a walking stick.\nHe had handed himself in to police after a judge issued a warrant for his arrest when he failed to appear for his sentencing two weeks ago.\nSentencing Flowers, Recorder of Manchester Judge Nicholas Dean KC told him: \"This is a story of betrayal, no less than that.\n\"Betrayal by you of an old friend, someone who trusted you, who had every reason to believe she could trust you.\n\"In truth, you knew all along she could not, because of your own weaknesses and failings.\"", "url": "https://www.bbc.co.uk/news/articles/cy9ddxn727ro"}