{"authors": ["Alex Blake", "www.facebook.com"], "date_download": "2025-04-26 04:19:31", "date_modify": "2025-04-26 04:19:31", "date_publish": "2025-03-03 16:29:00", "description": "There are 15 candidates contesting four seat in the upper chamber of the Isle of Man's parliament.", "filename": "news_articles_cevxdjy7jkdo_1745641171.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8551/live/557ea1e0-f84c-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cevxdjy7jkdo_1745641171.html", "title": "Isle of Man Legislative Council: Who is standing for election?", "title_page": "Isle of Man Legislative Council: Who is standing for election? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There are 15 candidates vying for a seat on the Isle of Man's Legislative Council for the next five years.\nThe scrutiny body is the upper chamber of the Manx parliament, which makes up Tynwald alongside the House of Keys.\nFour spaces are available on the board of eight, to be selected in a ballot by MHKs on Tuesday morning.\nWhile 16 candidates were initially confirmed as successfully nominated to take part in the election, the withdrawal of Brian Holt has reduced the number to 15.\nIn order to stand in the election, those who applied needed to secure a proposer, seconder and at least two other supporters from the House of Keys.\nBut who are the candidates hoping to take a seat on the Council?\nPreviously professional in information technology (IT), Mr Mercer was first elected to the Legislative Council in 2020 and is seeking re-election after his current term of office came to an end on 28 February.\nWorking in IT for more than 30 years, he said sitting on the Council was \"one of the greatest honours\" of his life.\nAfter moving to the Isle of Man in 1980, Mr Perkins had a career in engineering and was an MHK for Garff from 2016 to 2021.\nHe was a political member for the departments of environment, food and agriculture, and enterprise, and said he misses the \"political arena\".\nAfter a career finance, Mr Reid is now the chairman of the Isle of Man Skills Board and sits on the board of the Isle of Man Financial Services Authority.\nHe said that gave him a \"strong track record of of success and experience\" to draw from.\nPreviously a television documentary director, Ms Sharpe was first elected to the Legislative Council in 2018 and is seeking re-election after her current term of office came to an end on 28 February.\nShe has been a political member for the departments of infrastructure and health and social care, and said she had \"scutinised 80 pieces of legislation\" during her time in office.", "url": "https://www.bbc.co.uk/news/articles/cevxdjy7jkdo"}