{"authors": ["Adam Hale", "www.facebook.com"], "date_download": "2025-04-26 03:51:01", "date_modify": "2025-04-26 03:51:01", "date_publish": "2025-03-05 12:13:52", "description": "The Russian warship had been escorting a cargo ship on its voyage from Syria through the English Channel and North Sea.", "filename": "news_articles_c5y2gepnjgdo_1745639461.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/539b/live/56a51170-f9b5-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5y2gepnjgdo_1745639461.html", "title": "Russian warship tracked near British waters", "title_page": "Russian warship tracked near British waters by Royal Navy - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Royal Navy has released images of a Russian warship which it tracked sailing near British waters.\nThe corvette Boikiy was part of a task group which was tracked by HMS Somerset for three days as it made its way through the English Channel and North Sea, escorting a merchant vessel on its return from Syria to Russia.\nPatrol aircraft and Nato forces also assisted with the monitoring operation, the navy said.\nBoikiy is one of several Russian vessels to have been tracked sailing near the British coast in recent months.\nThe Royal Navy said its operation began on Saturday as the Russian warship headed south through the North Sea and English Channel to meet the merchant vessel, known as Baltic Leader, to escort it back to Russia.\nSomerset, a British Type 23 frigate, used its radar system to report on the movements and a Merlin helicopter from its naval air squadron was also launched to gather information from the sky.\nThe Russian merchant ship was transporting military hardware from the Russian naval base in Tartus, Syria, with crew on the accompanying warship seen burning papers and manning the ship's machine guns, the Times, external reported.\nBBC Verify has analysed satellite imagery and found the Baltic Leader docked in Tartus on 1 February. At the time, its publicly-available tracker was turned off, according to ship tracking site MarineTraffic.\nIt is not possible to see what is on the ship, but imagery shows a number of containers and other items on the dock nearby.\nAccording to shipping database Equasis, the owner of the Baltic Leader is Russian shipping company MG-Flot LLC - which was sanctioned by the UK government after being accused of helping Russia to destabilise Ukraine.\nIn 2022, the vessel was also sanctioned by the US due to its links to Russian lender Promsvyazbank, one of the Russian entities targeted by the US and European countries in the aftermath of the full-scale invasion of Ukraine.\nThe ship's commanding officer, Cdr Joel Roberts, said: \"Somerset is well-versed in the escort of Russian ships, having conducted these operations on a number of occasions.\n\"Great professionalism has been shown by the ship's company to remain vigilant whilst operating in UK waters and integrating with our Nato allies to monitor Russian activity around Europe.\"", "url": "https://www.bbc.co.uk/news/articles/c5y2gepnjgdo"}