{"authors": ["Elliot Ball", "www.facebook.com"], "date_download": "2025-04-26 06:52:43", "date_modify": "2025-04-26 06:52:43", "date_publish": "2025-02-28 17:07:20", "description": "The two police officers involved are no longer serving officers following a gross misconduct panel.", "filename": "news_articles_cn04wllr15lo_1745650363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2b6d/live/fc9bee30-f5e8-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04wllr15lo_1745650363.html", "title": "Police could have prevented death, inquest hears", "title_page": "Police could have prevented death, inquest hears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A vulnerable man's death could have been avoided had police reacted appropriately, an inquest has ruled.\nLachlan Campbell, 51, from St Austell, was left lying outside St Erth railway station through the night in heavy rain by two police officers, the four-day hearing in Truro was told.\nThe Devon and Cornwall Police officers, PC David Bishop and PC Daniel Baber, sat in their car just a few feet from the stricken Mr Campbell on 1 November 2022.\nThe inquest ruled that Mr Campbell's death was \"drug related combined with neglect\". The police officers are no longer serving.\nThe two officers initially called for an ambulance to go to Mr Campbell at 01:42 GMT before leaving the scene to go to a high-risk domestic incident in Hayle.\nThey spent time looking for a known suspect on a night when there were only four PCs on duty in that part of West Cornwall, the inquest heard.\nMr Campbell was left on his own due to ambulance handover delays at the Royal Cornwall Hospital and other incidents which led to a four-and-a-half hour delay.\nWhen the officers returned to the scene at 05:00 GMT, the jury said the two officers should have taken Mr Campbell to hospital in their patrol car.\nThey also criticised the former officers for failing to provide Mr Campbell with \"appropriate shelter, warmth or medical attention\" and branded these \"serious failings\".\nHad action been taken in a timely manner, Mr Campbell's life could have been saved, the inquest heard.\nMr Campbell's mother told the inquest that her son \"should not have been left outside for so many hours\".\nShe accused the police of neglect and discriminating against her son because he was a drug user.\n\"He was not deemed important enough by the police to save his life,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cn04wllr15lo"}