{"authors": ["Katie Waple & Kirsten O'Brien", "www.facebook.com"], "date_download": "2025-04-26 04:40:24", "date_modify": "2025-04-26 04:40:24", "date_publish": "2025-03-02 07:27:54", "description": "Oaklands School in Hungerford are running rugby sessions for students to build new skills.", "filename": "news_articles_c14jn6nv4g4o_1745642424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/edbf/live/b23e2240-f467-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jn6nv4g4o_1745642424.html", "title": "Rugby helping SEND pupils in Berkshire learn life skills", "title_page": "Rugby helping SEND pupils in Berkshire learn life skills - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A school for children with special educational needs (SEND) is taking inspiration from the Six Nations by using rugby to help their students.\nOaklands School in Hungerford has started running rugby sessions with Hungerford RFC.\nThe sessions have been helping young people build new physical and soft skills, like communication and teamwork.\nDeputy Headteacher Ian Simmons said: \"What we are teaching them is life skills.\"\nMr Simmons explained that the sessions came about in 2023 to help build community links.\nHe said: \" We looked for someone to partner with and Hungerford RFC were committed to helping us.\n\"We were then given the opportunity to attend our first session which was a roaring success.\"\nOakland School pupil Isaiah said: \"First they were going to introduce us to some games using these rugby balls.\n\"It was kicking them seeing how far that went, throwing them to work on our aim and even teamwork, things like that, where we pass to each other.\"\nTeacher Chris Hoggarth said: \"Obviously we are a school so we have to do some academic lessons from time-to-time.\n\"We try to get outdoor quite a lot. For example we go to the library, we accidentally step into the coffee shops on the way - and that's all life skills for the pupils.\n\"Next week we are going swimming, we have horse riding and cycling on the list and we do outdoor maths lessons.\"\nHeadteacher Georgios Chatzakis added:\"We are incredibly proud of our pupils for stepping outside of their comfort zones and taking on this new challenge.\n\"Rugby is a fantastic way to build not only physical skills but also crucial life skills like teamwork, resilience, and communication.\n\"It was wonderful to see our pupils embracing the session with such enthusiasm.\"", "url": "https://www.bbc.co.uk/news/articles/c14jn6nv4g4o"}