{"authors": ["Lyndsey Telford", "www.facebook.com"], "date_download": "2025-04-26 03:58:38", "date_modify": "2025-04-26 03:58:38", "date_publish": "2025-03-04 13:03:25", "description": "The Department of Health repeats its apology to Muckamore patients and families at the hospital's inquiry.", "filename": "news_articles_cy5nwrpr6pzo_1745639918.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd8a/live/52334630-f8f6-11ef-ad98-31dd620eac72.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy5nwrpr6pzo_1745639918.html", "title": "Muckamore: Patients' families were 'undoubtedly failed'", "title_page": "Muckamore: Patients' families were 'undoubtedly failed' - Department of Health - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The health and social care system \"undoubtedly failed\" the families of Muckamore Abbey Hospital patients, the Department of Health (DoH) has said.\nIn a closing statement on behalf of the department at the public inquiry into abuse of patients at the Antrim-based facility, Andrew McGuinness KC repeated the DoH's apology to patients and families and recognised \"trust has been broken\".\nThe department has overall responsibility for Northern Ireland's health and social care system.\nEarlier on Tuesday, the Police Service of Northern Ireland (PSNI) backed calls from families for mandatory CCTV to be in place in settings where vulnerable people are cared for.\nSpeaking on behalf of the police, Mark Robinson KC said CCTV afforded \"protection\" to the most vulnerable.\nHe said had it not been for the discovery of footage at the hospital in 2017, the inquiry would not be happening.\n\"Without that CCTV, there would be no police investigation, no prosecutions, no public knowledge or awareness of issues uncovered in Muckamore Abbey Hospital,\" he said.\n\"And the conclusion of that would be that circumstances giving rise to the allegations of abuse may indeed be continuing to this very day.\"\nMr Robinson said the PSNI had been disappointed that there was no provision within a draft adult protection bill for the mandatory installation of CCTV in settings where care was delivered to those with severe learning disabilities or mental health needs.\nHe added that the PSNI \"trusts that the inquiry will consider this important issue when making their recommendations\".\nMuckamore is run by the Belfast Health Trust and provides facilities for adults with special needs.\nThe public inquiry is examining abuse at the hospital, which is based outside Antrim.\nA separate major police investigation began in 2017 after allegations of ill-treatment began to emerge.\nIn response to calls for the mandatory installation of CCTV in care settings by families, which were earlier supported by the PSNI, Mr McGuinness said the DoH had been advised that it would not be possible to legislate for mandatory CCTV in what is effectively someone's home.\nHowever, he said the department should be able to bring regulations governing the use of CCTV in social care settings.\nHe added that the department recognised the value of CCTV in identifying abuse at Muckamore and that the issue had been given \"significant consideration\" over the last number of years.\nThe Regulation and Quality Improvement Authority (RQIA), which gave evidence during the inquiry on its role in responding to abuse allegations at the hospital, said inspections had been carried out in accordance with the methodology in place at the time.\nThe comment was made in a closing statement on behalf of the health watchdog by barrister Michael Neeson.\nHowever, he added that inspections alone could not guarantee the prevention of abuse.\n\"Inspections are limited in what they can do; you're there for a period of time, you get a snapshot of a service during that time,\" he said.\n\"A system of inspection cannot guarantee the prevention of abuse, and the limitations inherent in inspection must be properly acknowledged.\"\nHe said the RQIA was a \"learning\" and \"reflective\" organisation, but that there were \"limitations\" on its ability to make full use of its role due to its current funding capacity.\n\"There is insufficient capacity or resources available to RQIA to fulfil the requirements of its regulatory role across the varied environments in which increasingly people are now being supported,\" Mr Neeson said.\nHe said the provision of services in community settings had evolved considerably over the years, and while the RQIA had a \"broad range of duties and powers\", there were \"regrettably limitations upon the body's ability to make full and effective use of its powers and duties given its current funded capacity\".", "url": "https://www.bbc.co.uk/news/articles/cy5nwrpr6pzo"}