{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 04:30:50", "date_modify": "2025-04-26 04:30:50", "date_publish": "2025-03-03 06:18:27", "description": "Dozens of people gathered to mark the landmark display being turned on again.", "filename": "news_articles_c981p3drdz4o_1745641850.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4fa1/live/59ea5e50-f779-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c981p3drdz4o_1745641850.html", "title": "City's 'Co-op cow' lit up for first time since 2001", "title_page": "Derby: City's 'Co-op cow' lit up for first time since 2001 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A historic landmark sign that once illuminated across a city has been relit again after it was turned off more than 20 years ago.\nThe \"Co-op cow\" in Derby city centre was turned back on for the first time since 2001 on Saturday with dozens in attendance to mark the occasion.\nFirst erected back in 1955, the metal structure occupied a prominent position on top of the Central Hall building until the turn of the century, when it was repaired and moved to the side of the building.\nElaine Dean, society president of Central Co-op, told the BBC: \"As a little girl, it was the Co-op cow. We had Co-op milk, and it was just part of Derby.\"\nThe sign has been relit using sustainable LED lighting, which the Co-op said was for \"future generations to enjoy\".\nThe original display was designed and built by the Derby Co-op Society as a \"beacon\" representing health and wellbeing, whilst advertising the Co-op dairy.\nIt also displayed the slogan \"the gateway to health\" above a large crimson-coloured cow sculpture, which was then aglow with red and green neon lights.\nThe cow soon became a symbol that provided a visual welcome home to Derby residents, many of whom remembered it as the official end to their adventures away from the city.\nDuring the redevelopment of Central Hall in 2001, the Co-op cow was removed for roofing repairs.", "url": "https://www.bbc.co.uk/news/articles/c981p3drdz4o"}