{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:30:38", "date_modify": "2025-05-19 15:30:38", "date_publish": "2015-01-30 03:38:10", "description": "The Met Office issues yellow \"be aware\" warnings for ice and snow across parts of Scotland on Friday and over the weekend.", "filename": "news_uk-scotland-31052196_1747668638.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80667000/jpg/_80667113_3eea4750-f71b-427c-aa76-c53ac655babc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-31052196_1747668638.html", "title": "More snow and ice forecast for Scotland", "title_page": "More snow and ice forecast for Scotland - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Met Office has issued, external yellow \"be aware\" warnings for snow and ice across Scotland over the next few days.\nA warning of icy driving conditions on Friday evening is followed by another of snow and sleet showers which comes into force on Saturday morning.\nOn Sunday and Monday, coastal areas in the east and west of Scotland and the north may experience more snow.\nAll of eastern Scotland could be in line for further wintry showers on Tuesday.\nThere has been further disruption for some school pupils in Dumfries and Galloway, with eight schools closed due to snow and ice.\nAll of those schools are expected to open on Monday.\nCh Supt Iain Murray, from Police Scotland, urged motorists to carefully plan their journeys and said localised conditions could make driving difficult.\n\"If you do decide to travel, ensure your vehicle is well prepared before setting off; make sure your windscreens are completely free of snow and ice, and your lights are working and clean,\" he said.\nSpeaking on BBC Radio Scotland, John Mitchell at the Met Office in Aberdeen, warned that some parts of the country should prepare for an icy blast over the weekend.\nHe said: \"As we go through Saturday and into Sunday we will see the proper arctic air coming down across Scotland and that's when we will see the showers really turning to snow.\n\"I think it will still be across the more northern half of the country. Southern parts, Edinburgh and Glasgow will miss most of the snow, seeing some further sunshine at times.\"\nWintry weather caused hazardous driving conditions across parts of Scotland on Thursday.\nHeavy snow affected routes across the country, including the main motorways, after the Met Office issued an amber \"be prepared\" warning for much of Scotland, Northern Ireland and northern England.\nThe conditions also led to more than 100 school closures.\nTulloch Bridge in Inverness-shire saw the deepest snow in Scotland with 23cm (9ins) while there was 9cm (3ins) in Aviemore.", "url": "https://www.bbc.com/news/uk-scotland-31052196"}