{"authors": ["Thomas Naadi", "Jake Lapham", "www.facebook.com"], "date_download": "2025-04-26 04:02:39", "date_modify": "2025-04-26 04:02:39", "date_publish": "2025-03-03 23:42:51", "description": "The bill prescribes a three-year jail term for people who identify as gay and five to 10 years for promoters and advocates.", "filename": "news_articles_cdjy91gr48lo_1745640159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0727/live/5af5df60-f880-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjy91gr48lo_1745640159.html", "title": "Ghanaian MPs reintroduce controversial anti-LGBT bill", "title_page": "Ghanaian MPs reintroduce controversial anti-LGBT bill - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A group of 10 MPs in Ghana have resubmitted a controversial bill that would impose some of the toughest restrictions on LGBT rights in Africa.\nThe bill prescribes a three-year jail term for people who identify as gay, and five to 10 years for promoters and advocates.\nThe legislation was passed by parliament last year, but the former President, Nana Akufo-Addo, declined to sign it into law before leaving office in January, citing legal challenges.\nIt has been widely condemned by both local and international human rights groups, with some describing it as draconian.\nAt the dissolution of the previous parliament ahead of last December's general election, all bills that had not completed the legislative process, including receiving the president's signature, were dropped.\nIt is unclear whether the speaker of the new parliament will admit the bill for consideration.\nGay sex is already punishable by up to three years in prison in the conservative West African country.\nPresident John Mahama has said he would prefer the bill to be state-sponsored, ensuring broader support and consultation.\n\"I do think that we should have a conversation on it again so that all of us, if we decide to move that bill forward, move it forward with a consensus,\" he said.\nSupporters claim the legislation would help preserve what they consider to be Ghanaian culture and family values.\nHowever rights groups have decried the legislation.\n\"The anti-LGBT rights bill is inconsistent with Ghana's long-standing tradition of peace, tolerance, and hospitality and flies in the face of the country's international human rights obligations,\" said Human Rights Watch researcher Larissa Kojoué last year.\n\"Such a law would not only further erode the rule of law in Ghana, but could also lead to further gratuitous violence against LGBT people and their allies.\"\nVa-Bene Elikem Fiatsi, a Ghanaian trans woman and LGBT activist, told the Reuters news agency the bill's reintroduction was \"disheartening and hard to process\" but insisted LGBT activism would continue.\nThe bill's potential impact on Ghana's economy is a significant concern.\nThe country's former finance minister warned that passing the bill could result in Ghana losing up to $3.8bn (£2.9bn) in development funding from the World Bank and affecting its $3bn (£2.3bn) IMF support programme.\nOpposition lawmaker John Ntim Fordjour told Reuters the country no longer needed to fear economic sanctions, citing the election of Donald Trump as US president.\n\"The global political climate is favourable for conservative values as demonstrated in the bold conservative pronouncements of President Donald Trump,\" he said.\nThe bill was first introduced to parliament in 2021 but has faced many delays.", "url": "https://www.bbc.co.uk/news/articles/cdjy91gr48lo"}