{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:17:10", "date_modify": "2025-05-19 15:17:10", "date_publish": "2017-08-16 00:00:00", "description": "All the latest headlines from across Berkshire, Oxfordshire, Dorset, Hampshire and the Isle of Wight.", "filename": "news_live_uk-england-hampshire-40592228_1747667830.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-hampshire-40592228_1747667830.html", "title": "South Live: Wednesday 16 August", "title_page": "South Live: Wednesday 16 August - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Good evening!\nThanks for joining us, that's all from BBC South Live for today.\nthe service will resume at 08:00 on Thursday when we will be bringing you the latest regional news, travel, sport and weather.\nYou can still get in touch by email, on our Hampshire, external, Dorset, external, Berkshire, external and Oxford, external Facebook pages or on Twitter @BBC_Hampshire, external, @BBCDorset, external, @BBCBerkshire, external and @BBCOxford, external.\nE-fits of Bevois Valley and Portsmood sex assaults suspect released\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nTwo women were approached separately by a man on a bike in the Bevois Valley and Portswood areas on Sunday between 23:30 BST and midnight.\nHe made sexually explicit comments to both women.\nHe also sexually assaulted one of the women her over the top of her clothes before exposing himself.\nBoth women said the man was wearing a sports top which had a \"South Africa\" logo on it.\nMarket trader fined for selling counterfeit goods\nA market trader who was caught with hundreds of counterfeit goods, including fake Rolex watches, has been ordered to pay fines and costs totalling more than £2,000.\nChristopher McDonald, 44, was found with 663 counterfeit products at Portland Market in August last year after Dorset County Council was tipped off by a member of the public.\nAmong his stock, officers found various branded sunglasses and clothing falsely marked as being Nike, Fred Perry, Swag, Gucci and Dolce and Gabbana.\nMcDonald, from Bournemouth, pleaded guilty to eight counts of of possessing counterfeit items for sale during a Weymouth Magistrates' Court hearing on Monday.\nHe was fined £500 and ordered to to pay £1,500 costs and a £60 victim surcharge.\nTrial for abuse accused football coach\nA date has been set for the trial of a former Southampton Football Club youth coach who faces child abuse charges.\nBob Higgins, 64, of Litchfield Road, Southampton, appeared at Winchester Crown Court earlier charged with 65 counts of indecent assault against 23 boys, all aged under 17.\nThe alleged offences took place between 1970 and 1996.\nMr Higgins, whose first name is Robert, did not enter a plea but a provisional trial date has been set for 9 April.\nPolice and fire service in new joint partnership\nA six-month pilot will see Hampshire's police and fire service team up to search for high-risk missing people.\nThe fire service said the scheme, which will cover police operations in Southampton, was a \"UK first\".\nIt said the project would involve officers being able to deploy firefighters to help find people who were at risk themselves or considered a risk to others.\nIf successful the idea could be rolled out to the rest the county, the fire service added.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nYeovil sign Bournemouth forward Green\nLeague Two club Yeovil Town have signed versatile forward Jordan Green on a free transfer from Bournemouth.\nThe 22-year-old has signed a one-year deal with the Huish Park outfit.\nHe made 10 league appearances during a loan spell at Newport County last season, but has not played in a senior match for the Premier League Cherries.\n\"Jordan has the potential to reach a very high standard,\" Yeovil boss Darren Way told the club website. \"He's quick, clever and difficult to mark.\"\nMan sent back to prison for breaching licence\nA man wanted by police for breaching the terms of his licence has been found in Bournemouth.\nAshley Hickson, 23, was released from prison on 10 July after serving part of an eight-month sentence for attempted burglary.\nHowever, he breached the terms of his licence and a recall notice was issued, Dorset Police said.\nHickson was located by officers in Boscombe yesterday has been sent back to prison.\nWoman punched in face while defending attacked boyfriend in Bournemouth\nA woman was punched in the face as she tried to defend her boyfriend during an unprovoked town centre attack.\nA black man, dressed in black, first hit the man, in his 20s, knocking him to the ground outside Debenhams in Bournemouth Square.\nAs the woman, also in her 20s, attempted to defend him she was punched in the face and knocked to the ground.\nPolice have released a CCTV image of a man they want to speak to about the attack in the early hours of Sunday.\nBoth victims needed hospital treatment for facial injuries.", "url": "https://www.bbc.com/news/live/uk-england-hampshire-40592228"}