{"authors": ["James Pearson", "www.facebook.com"], "date_download": "2025-04-26 06:37:54", "date_modify": "2025-04-26 06:37:54", "date_publish": "2025-02-26 06:26:45", "description": "Villagers near HMP Long Lartin regularly see criminal activity, and some fear reprisals.", "filename": "news_articles_cn9v3gr4xd0o_1745649474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f479/live/d552ddd0-f36c-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn9v3gr4xd0o_1745649474.html", "title": "Worcestershire villagers see increase in illegal drones at nearby prison", "title_page": "Worcestershire villagers see increase in illegal drones at nearby prison - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Drones dropping suspicious packages, fireworks used as distractions and arrests in the dead of night are some of the things villagers living next to a high security prison have witnessed.\nResidents in South Littleton, Worcestershire, said sightings of contraband deliveries to HMP Long Lartin had increased in recent years.\nLast month, the prisons watchdog warned that drones making drops at the Category A men's prison were a national security risk.\nOn Tuesday, the prison's governor, Babafemi Dada, told MPs the illegal use of drones was contributing to the prison's drug problem.\n\"It will be mobile phones, SIM cards, drugs, things like that\", said Spike Hughes, who lives a stone's throw from HMP Long Lartin's tall, grey perimeter wall.\nHe said attempts to deliver contraband over it – by unmanned drones or other means – had become a weekly occurrence, with people regularly trespassing on his property.\n\"Every Friday night there'll be somebody around. It's regular, you know, two or three times a week,\" he said.\nMr Hughes said he regularly liaised with local police and allowed them access to CCTV and ANPR cameras around his property.\n\"Being ex-military… I'm not quite as intimidated by them as some people would be,\" he said, \"and my dogs are well trained.\"\n\"But it has got to be a concern, isn't it? Because these people will stop at nothing.\n\"I have confronted two, but been warned against it.\"\nSince January 2024, no fly zones have been in place around all closed prisons, including Long Lartin.\nA new law made it an automatic offence simply to fly drones within 400m of a prison, with drone operators caught smuggling illicit items facing up to a decade behind bars.\nHowever, in January the chief inspector of prisons said urgent action was required at Long Lartin, with drops of contraband so regular that guns could be smuggled in.\nA damning report, external revealed serious concerns with safety and security, while in a survey of prisoners 50% of those who responded said it was easy to get drugs and alcohol.\nOn Tuesday Babafemi Dada, Long Lartin's governor, told Parliament's justice committee the use of drones was contributing to the prison's drug problem.\nHe described feeling a \"sense of helplessness\" when first arriving at the prison, and said efforts to clamp down on smuggling at the prison gate may have pushed criminals into using drones.\n\"It is difficult to manage,\" he said.\nFor most of the time, there are few signs the village of South Littleton is just a few hundred metres from a high security prison.\nBut several residents said sightings of illegal drone flights and their masked operators had become an increasing concern.\n“We’ve witnessed a lot of vehicles come on to the estate, riding around looking for somewhere quiet so they can park up and set the drones off to fly over the prison,” said Darren Lynes.\nAnother resident, who also wanted to remain anonymous, said they had reported a drone being launched from a car.\n\"They were found, probably with ANPR. The police let us know afterwards\"\nHowever, they said they had since had misgivings about contacting the police.\n\"We wanted to help because we don't want that activity round here,\" they said, \"but at the same time if we have to go to court, the criminals will know our names.\"\nThe Ministry of Justice said work was continuing to review site vulnerabilities at HMP Long Lartin to stop criminals smuggling in drugs and other illicit items.\nIt said the Prison and Probation Service was also investing in improvements to windows, installing specialised netting and grilles to stop drones.\n\"We have a wide range of security measures in place to seize more contraband and a specialist team to bear down on drugs and serious and organised crime,\" a spokesperson said.", "url": "https://www.bbc.co.uk/news/articles/cn9v3gr4xd0o"}