{"authors": ["Paul Adams", "www.facebook.com"], "date_download": "2025-04-26 03:59:44", "date_modify": "2025-04-26 03:59:44", "date_publish": "2025-03-04 06:07:13", "description": "Their fate is the discussion of Arab leaders in Egypt but what do Gazans want for their future?", "filename": "news_articles_cvg1vqy4py0o_1745639984.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d2f/live/98004850-f867-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1vqy4py0o_1745639984.html", "title": "Gazans face tough choices as their future is debated on global stage", "title_page": "Gazans face tough choices as their future is debated on global stage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The level of destruction in Jabalia when viewed from the air is truly astonishing.\nA Hiroshima-like wasteland stretches as far as the eye can see. The mangled carcasses of buildings dot the churned-up landscape, some leaning at crazy angles.\nGreat undulating waves of rubble make it all but impossible to make out the geography of this once bustling, tightly packed refugee camp.\nAnd yet, as a drone camera flies over the wreckage, it picks out splashes of blue and white where small tent camps have been set up in patches of open ground.\nAnd figures, clambering over broken buildings, moving along streets of dirt, where food markets are springing up under tin roofs and canvas awnings. Children using a collapsed roof as a slide.\nAfter more than six weeks of Gaza's fragile ceasefire, Jabalia is slowly coming back to life.\nIn the neighbourhood of al-Qasasib, Nabil has returned to a four-storey house that's somehow still standing, even if it lacks windows, doors and - in some places - walls.\nHe and his relatives have made crude balconies out of wooden pallets and strung-up tarpaulin to keep out the elements.\n\"Look at the destruction,\" he says as he surveys Jabalia's ocean of ruins from a gaping upper floor.\n\"They want us to leave without rebuilding it? How can we leave. The least we can do is rebuild it for our children.\"\nTo cook a meal, Nabil lights a fire on the bare staircase, stoking it carefully with pieces of torn-up cardboard.\nOn another floor, Laila Ahmed Okasha washes up in a sink where the tap ran dry months ago.\n\"There's no water, electricity or sewage,\" she says. \"If we need water, we have to go to a far place to fill up buckets.\"\nShe says she cried when she came back to the house and found it wrecked.\nShe blames Israel and Hamas for destroying the world she once knew.\n\"Both of them are responsible,\" she says. \"We had a decent, comfortable life.\"\nSoon after the war began in October 2023, Israel told Palestinians in the northern part of the Gaza Strip – including Jabalia – to move south for their own safety.\nHundreds of thousands of people heeded the warning, but many stayed, determined to ride out the war.\nLaila and her husband Marwan clung on until October last year, when the Israeli military reinvaded Jabalia, saying Hamas had reconstituted fighting units inside the camp's narrow streets.\nAfter two months of sheltering in nearby Shati camp, Leila and Marwan returned to find Jabalia almost unrecognisable.\n\"When we came back and saw how it was destroyed, I didn't want to stay here anymore,\" Marwan says.\n\"I had a wonderful life, but now it's a hell. If I have the chance to leave, I'll go. I won't stay one more minute.\"\nStay or go? The future of Gaza's civilian population is now the subject of international debate.\nIn February, Donald Trump suggested that the US should take over Gaza and that nearly two million Palestinian residents should leave, possibly for good.\nFaced with international outrage and fierce opposition from Arab leaders, Trump has subsequently appeared to back away from the plan, saying he recommended it but would not force it on anyone.\nIn the meantime, Egypt has led Arab efforts to come up with a viable alternative, to be presented at an emergency Arab summit in Cairo on Tuesday.\nIt's Sanaa Abu Ishbak's dress shop.\nThe 45-year-old seamstress, mother of 11, set up the business two years before the war but had to abandon it when she fled south in November 2023.\nShe came back as soon as the ceasefire was announced. With her husband and daughters, she's been busy clearing debris from the shop, arranging dresses on hangers and getting ready for business.\n\"I love Jabalia camp,\" she says, \"and I won't leave it till I die.\"\nSanaa and Laila seem equally determined to stay put if they can. But both women speak differently when they talk of the young.\n\"She doesn't even know how to write her own name,\" Laila says of her granddaughter.\n\"There's no education in Gaza.\"\nThe little girl's mother was killed during the war. Laila says she still talks to her at night.\n\"She was the soul of my soul and she left her daughter in my hands. If I have the chance to travel, I will do so for the sake of my granddaughter.\"", "url": "https://www.bbc.co.uk/news/articles/cvg1vqy4py0o"}