{"authors": ["Vanessa Pearce", "www.facebook.com"], "date_download": "2025-04-26 06:51:59", "date_modify": "2025-04-26 06:51:59", "date_publish": "2025-02-28 17:22:19", "description": "An inquest is being held into the death of Henok Zaid Gebrsslasie at a mental health facility.", "filename": "news_articles_c2kggk47l0go_1745650319.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16ad/live/231ebdf0-ed18-11ef-83b8-c34d7c00cdfa.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kggk47l0go_1745650319.html", "title": "Coventry health workers falsified checks of man found dead", "title_page": "Coventry health workers falsified checks of man found dead - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mental health facility staff who failed to check on a patient falsified paperwork to make it look as though observations had been carried out, an inquest has heard.\nHenok Zaid Gebrsslasie died while under the care of the Caludon Centre in Coventry on 12 August 2021.\nThe 23-year-old should have been checked every 15 minutes but was left unobserved for three hours, a court heard.\nOne healthcare worker said she had a \"habit\" of rewriting observation notes \"to get out of a situation\" with another telling the court he was directed to falsify notes by a more senior member of staff.\nJurors at the inquest heard the checks failed to be carried out between 14:00 and 17:00 on 12 August.\nMr Gebrsslasie died shortly after 14:00, the court heard.\nAsked why she had failed to conduct observation checks between 15:00 and 16:00, healthcare assistant Ana Adeyemo said she had been delayed in finishing her previous observation checks.\nShe described to the court how, when she was on her way to check her next duties, a patient had asked her to visit the laundry.\n\"When I came back to the office, towards the end of the hour and checked the board, I realised I was meant to do the Level 2 observations,\" she said.\nShe then described \"rewriting\" the paperwork to make it look as though the patients, including Mr Gebrsslasie, had been checked, but had \"mistakenly\" filled in the wrong retrospective entries as a worker had also neglected to make checks in the previous hour.\nThe next health worker due to make the observations on the psychiatric intensive care unit ward said he had become distracted by patients as he was the \"only member of staff on the floor\".\nHealthcare assistant Biju Abraham was due to carry out the checks between 16:00 and 17:00.\nAfter looking after a patient in seclusion until 16:00 he said \"persistent patients\" had asked him to take them on a cigarette break.\n\"I am the only one of the staff on the floor at the time, so I thought I must be on floating duties, so I took them out to the courtyard,\" Mr Abraham said.\nHe then went to the laundry and took patients on another cigarette break before checking the observation board in the staff room shortly before 17:00, and realising he should have been carrying out the 15 minute checks.", "url": "https://www.bbc.co.uk/news/articles/c2kggk47l0go"}