{"authors": ["Peter Hoskins", "www.facebook.com"], "date_download": "2025-04-26 03:46:49", "date_modify": "2025-04-26 03:46:49", "date_publish": "2025-03-05 04:29:20", "description": "US Commerce Secretary Howard Lutnick says Donald Trump is considering a deal that would offer exemptions from tariffs on Canada and Mexico.", "filename": "news_articles_c5yx02nnnyvo_1745639209.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/64d0/live/4014de50-f964-11ef-8f6f-e9041c1606f3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yx02nnnyvo_1745639209.html", "title": "Trump mulls exemptions for carmakers from Mexico and Canada tariffs", "title_page": "Trump mulls exemptions for carmakers from Mexico and Canada tariffs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US Commerce Secretary Howard Lutnick has said President Donald Trump is considering a deal that would offer exemptions from tariffs on Canada and Mexico, including potentially for carmakers.\nThe possibility of a rollback, which he said could be announced on Wednesday, came as many US businesses raised concerns about Trump's decision to hit US imports from its two closest trade partners with a 25% import tax.\nAfter two days of declines, the main US stock indexes were trading slightly higher early on Wednesday.\nCanada's Minister of Foreign Affairs Mélanie Joly told the BBC's Newsnight on Tuesday that her office had not been contacted about any plans around reducing tariffs.\nUS officials \"can say many things\" but \"the only one that really takes a decision is President Trump,\" Joly said.\nThe US president used a large part of his speech to Congress on Tuesday to outline his trade policies, but he did not say whether he planned to cut the tariffs that came into effect this week.\nCanada and Mexico announced retaliatory import levies on the US after Washington's 25% tariffs on its two neighbours came into effect on Tuesday.\nGoods worth billions cross the borders of the US, Canada and Mexico each day and their economies are deeply integrated.\nTrump says he wants to protect American industry and boost manufacturing, but many economists warn such tariffs could lead to prices rising for consumers in the US.\nOn Wednesday, Lutnick said tariffs would be in place, but suggested some goods could be \"left out\".\n\"There are going to be tariffs - let's be clear - but what he's thinking about is which sections of the market that maybe he'll consider giving them relief until we get to, of course, April 2,\" Lutnick told Bloomberg on Wednesday.\n\"It will be 25% but there will be some categories left out - it could well be autos. It could be others as well,\" he added.\nA day earlier on Fox News, Lutnick had raised the possibility of a compromise and reduction of tariffs for Mexico and Canada, saying Trump was weighing offers to meet his allies \"in the middle\".\nTrump has said he would move ahead on 2 April with plans for reciprocal tariffs on other countries around the world that he sees as treating the US unfairly.", "url": "https://www.bbc.co.uk/news/articles/c5yx02nnnyvo"}