{"authors": ["Erin Lister", "www.facebook.com"], "date_download": "2025-04-26 06:15:34", "date_modify": "2025-04-26 06:15:34", "date_publish": "2025-03-01 21:51:40", "description": "Amina Hassan has been inspiring others with videos of her solo stays in the Welsh countryside.", "filename": "news_articles_cvg1eqyjkjjo_1745648134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bda1/live/000cee50-f5c3-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1eqyjkjjo_1745648134.html", "title": "'The British countryside belongs to everyone'", "title_page": "Wales: 'The British countryside belongs to everyone' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Amina Hassan has spent the last few years carving out a space in the outdoors and sharing her journeys online, hoping to inspire others to follow in her footsteps.\nThe 27-year-old has dedicated much of the last 12 months to exploring Wales, and said it became her \"obsession\" after a chance trip to north Wales last year.\nHer videos have gained hundreds of views on Instagram and TikTok, and described the response from viewers as \"completely unexpected\".\nThe vlogger said she wanted her content to send the message that \"the outdoors belong to everyone\".\nAmina's love for solo travel and hiking began in Scotland back in 2020, but she did not begin creating travel content until 2022, originally intending the videos for friends and family.\n\"I wasn't expecting a response,\" Amina said. \"So, when I saw that so many people found inspiration in my adventures, I was like, I'm going to start sharing more.\"\nOne of her highlights, she said, was discovering the Welsh countryside after she helped her friend move there last year.\n\"I just immediately fell in love,\" she said.\n\"I started exploring the coastal areas of north Wales first, then ventured down to south Wales, Bannau Brycheiniog, and the Elan Valley. I knew instantly this was going to be my obsession for the year.\"\nPerhaps some of Amina's most popular videos involve her stays in bothies - basic shelters usually found in a remote location and left unlocked - available for anyone to use free of charge.\n\"I did my first ever solo bothy stay at Grwyne Fawr,\" she said.\n\"It had this gorgeous, enchanted feel to it, like something from an 1800s novel.\"\nThough initially apprehensive about the possibility of strangers arriving at night, she soon began to appreciate the experience.\n\"These places are difficult to get to, and I tend to go on these trips in the middle of the week. The chances that someone will happen upon that bothy are very low, and again, its winter.\n\"All of that creates the perfect recipe to enjoy bothies and be in a space where I can enjoy myself.\"\nAmina said the most beautiful part of her Welsh travels was the Llyn Peninsula, as she essentially \"stumbled\" upon it.\n\"I'm a sucker for coastal walks,\" she said.\n\"It was like walking through a dream. I wasn't expecting it to be that beautiful, and because it's so remote I often found myself completely alone, feeling like the landscape had been created just for me.\"\nBeyond the scenery, Amina was also captivated by Welsh culture and language and said she \"learned so much\" about place names and their meanings.\nAmina plans to travel west again in the future as she is keen to see more of south and mid Wales.", "url": "https://www.bbc.co.uk/news/articles/cvg1eqyjkjjo"}