{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:18:12", "date_modify": "2025-05-19 15:18:12", "date_publish": "2012-05-10 09:12:38", "description": "Profiles of Ukraine's political leaders", "filename": "news_world-europe-18006247_1747667892.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-18006247_1747667892.html", "title": "Ukraine profile - Leaders", "title_page": "Ukraine profile - Leaders - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Petro Poroshenko won the presidential election of May 2014 at a time of crisis which saw the ouster of his predecessor, the loss of the region of Crimea to Russia and a Russian-backed separatist rebellion in the east of the country.\nA billionaire businessman, Mr Poroshenko won an unprecedented first round victory in the elections which were held three months after pro-Russian President Viktor Yanukovych was chased from office by crowds following months of street protests.\nThe demonstrations were prompted by Mr Yanukovych's last-minute decision to reject a free trade deal with the EU - later signed by Mr Poroshenko - and seek a Russian bailout.\nOnly shortly before Mr Poroshenko was elected, Russia had responded to Mr Yanukovych's ouster by occupying the Crimea peninsula and running a referendum there in March 2014 in which an overwhelming majority voted to join Russia.\nSoon after, armed groups in eastern Ukraine claiming to act on behalf of local Russian speakers declared two separatist enclaves centred on the cities of Donetsk and Luhansk in the Donbass industrial area.\nMr Poroshenko launched an \"anti-terrorism operation\" against the pro-Moscow armed groups, but it was fought to a standstill with covert military support from Russia in often bloody clashes.\nA Russian-Ukrainian agreement to settle the conflict was mediated by France and Germany in February 2015, but this only succeeded in freezing the front line.\nBoth Moscow and Kiev accuse each other of blocking the agreement, which requires Ukraine to grant the separatist \"people's republics\" special constitutional status, while demanding that the republics reintegrate into Ukraine and allow free and fair elections.", "url": "https://www.bbc.com/news/world-europe-18006247"}