{"authors": ["Mark Smith", "www.facebook.com"], "date_download": "2025-04-26 07:37:34", "date_modify": "2025-04-26 07:37:34", "date_publish": "2025-02-27 14:07:51", "description": "Mark Cunningham runs Sherborne Cinema as a \"labour of love\", as film screenings mark its birthday.", "filename": "news_articles_c17qe2v7jn8o_1745653054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2619/live/4af60100-f428-11ef-9822-d3d66c578726.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c17qe2v7jn8o_1745653054.html", "title": "Gloucester mayor's medal marks independent cinema's 10th birthday", "title_page": "Gloucester mayor's medal marks independent cinema's 10th birthday - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An independent cinema has celebrated its 10th anniversary with a special weekend of film screenings.\nThe Sherborne Cinema in Gloucester is known for its art-deco interior, and for a single member of staff selling the tickets, drinks and snacks as well as starting the film.\nOwner Mark Cunningham marked the occasion by showing his favourite movie, Cinema Paradiso, a foreign language film about how a man fulfils his dream by opening a cinema, along with other classics including Lady in a Van and Casablanca.\nHe was presented with a Mayor's Medal and certificate for his \"outstanding service to the city\".\nMr Cunningham bought the building, which dates back to 1880, in Kingsholm after noticing it being advertised by an estate agent.\n\"I looked at it and thought it was a lovely building,\" he said.\n\"I liked its arched windows. I thought 'I'm having that' and so when the deal for the Christadelphian church to buy it fell through I became the owner of a semi-derelict building.\"\nMr Cunningham previously worked at the Palace Theatre cinema in Cinderford, and the Guildhall in Gloucester.\n\"There was an itch to have a go and it was an opportunity that was too good to miss,\" he explained.\nBetween 2012 and 2014 he installed the art-deco interior, for which the Sherborne Cinema is well known.\n\"When I started it was just a cream box. I knew I wanted to get some colour into it,\" he said.\n\"There are classic cinema colours, purples, browns, deep reds.\"", "url": "https://www.bbc.co.uk/news/articles/c17qe2v7jn8o"}