{"authors": ["Andrew Turner", "www.facebook.com"], "date_download": "2025-04-26 06:26:55", "date_modify": "2025-04-26 06:26:55", "date_publish": "2025-02-28 19:28:34", "description": "A family's claim that a boat deck was too small and lacked handrails is rejected by coroner.", "filename": "news_articles_ce988lvejp4o_1745648815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c7dd/live/2ed56e70-f5e5-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce988lvejp4o_1745648815.html", "title": "Coroner rejects safety claim after man died in The Broads", "title_page": "Coroner rejects safety claim after man died in The Broads - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man died after falling from a boat on The Broads, an inquest heard.\nCallum Bell, 58, of Algitha Road, Skegness, Lincolnshire, had fallen on the stern deck of the cruiser, moored at Great Yarmouth Yacht Station, Norfolk on 20 July last year.\nA toxicology report showed he was 2.5 times over the legal drink-drive limit but his family claimed the deck was too small for Mr Bell to get up without falling overboard.\nThe coroner accepted evidence from Barnes Brinkcraft, the company that owns the boat, that the boat met safety requirements.\nIn June Mr Bell, a painter and decorator, had suffered a stroke and had undergone surgery.\nHe was also taking anti-depression medication, which the coroner said was at a heightened level and could have led to an increased risk of sedation.\nThe holiday had been booked to celebrate the 60th birthday of Mr Bell's partner, Diane Simmonds, and that he had been looking forward to relaxing on the trip.\nBut all of the group were concerned about boat's narrow stern deck and lack of hand rails, stating that other family members including children and an elderly woman did not stay on the boat because of their perceived risks.\nBarnes Brinkcraft said it had signed records and digital evidence confirming safety videos had been watched.\nOn arriving at Great Yarmouth, they went into town to go shopping, and drank in four pubs.\nThe women returned to the boat while the men went to get takeaway food.\nMark Bell entered the boat and Diane Simmonds became concerned her partner had not boarded.\nShe said: \"I walked to the back of the boat and saw Callum laying on the back ledge and he asked me to help him as he had slipped and could not get up.\"\nMr Bell then came to help.\n\"Callum reached out to Mark's hand and I saw the difficulty of him having to turn to try to get up but there were no barriers or anything to grab and with a completely open back on the boat he had nowhere to go but to topple into the water,\" she said.\n\"We both tried to grab him again, but again, with nowhere else to hold on to to stabilise ourselves it was impossible.\"\nMr Bell added: \"On grabbing my hand he rolled into the water. We attempted to grab him but again, because of the openness of the boat, it was impossible.\"", "url": "https://www.bbc.co.uk/news/articles/ce988lvejp4o"}