{"authors": ["Daniel Holland", "www.facebook.com"], "date_download": "2025-04-26 06:48:34", "date_modify": "2025-04-26 06:48:34", "date_publish": "2025-03-01 11:11:30", "description": "What happened to the deal for a charity to run Newcastle's green spaces and what happens next?", "filename": "news_articles_c3e4v74z8zqo_1745650114.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/18c6/live/82471560-f683-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e4v74z8zqo_1745650114.html", "title": "Newcastle Council takes back control of parks", "title_page": "Newcastle Council takes back control of parks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A major shake-up of how city's parks are run has now come into effect.\nNewcastle City Council has retaken control of dozens of parks and allotments which it had previously put in the hands of charity Urban Green Newcastle (UGN).\nThe U-turn follows major concerns about the finances of the charity that emerged over the past year.\nBut there remain big questions about the future of the city's green spaces.\nUGN was given control of 33 parks and more than 60 allotments by Newcastle City Council in 2019.\nNewcastle was the first major metropolitan area in the UK to hand over the management of its parks in this way.\nThe idea was that, after years of austerity-driven budget cuts, a charity would be better placed to protect the green spaces.\nIt was hoped UGN would save the city more than £110m over a 125-year lease.\nThe council agreed to provide subsidies worth £7.7m to help see the trust through its first 10 years of operation before it became self-sustaining.\nThe Local Democracy Reporting Service revealed in March 2024 that the charity had already burned through all the council subsidy it had been given and predicted a £6.7m shortfall up to 2029.\nBosses admitted the trust would ultimately be unable to survive unless the city council was willing to keep supporting it financially.\nWhile the council agreed to award a further £1m to keep UGN going for the last 12 months, it also commissioned a review by Forvis Mazars.\nThat analysis concluded there was \"no evidence to suggest that UGN will be able to operate without ongoing and substantial financial support from the council for the foreseeable future\".\nThe council was given final approval that it would be retaking control over the parks in January.\nIn its most recent set of accounts, which detailed a £700,000 loss in 2023/24, UGN's board of trustees said the original business plan behind its creation was \"fatally flawed\".\nOne key factor was a dispute with the city council itself over the right to stage big music festivals in Exhibition Park, which had been seen as a key revenue stream.\nThat row in 2022, which followed complaints about noise from the This Is Tomorrow concerts, led to the council imposing strict limits on future events.\nVandalism and meeting health and safety regulations have also been cited as issues, along with a £900,000 drop in grants and donations last year.\nBut the main factor that has been blamed is the Covid-19 pandemic, which trustees said increased costs and \"shifted focus\" from finding new sources of income.\nUGN chief executive Carol Pyrah praised the charity for upgrading tennis courts and improving football pitches at Walker Park and Paddy Freeman's Park, as well as its work on walking and cycling route.\nIt was lauded for launching events like the Northern Lights trail and for planting more than 12,000 trees.\nHowever, it has also come in for plenty of criticism.\nHaving once aimed to secure Green Flag Awards for all 33 of Newcastle's parks by 2026, only Exhibition Park and Jesmond Dene currently hold that accolade.\nUGN has also been accused of treating the 150-year-old Leazes Park as a \"cash cow\".\nAfter a festival there last spring, damage caused included the knocking over of stone pillars at the Victorian park's entrance, which remain unfixed today.\nAt the time of the original handover to Urban Green, the council had slashed its annual parks budget from £2.58m in 2010/11 to less than £1m.\nNow it has said a minimum of £1.5m would be needed each year just to keep the parks at their current state.\nThere have been questions about how the council, which is poised to sign off on £21m spending cuts next week, will be able to find that money, particularly as it will not be able to access some grant funding in the same way a charity can.\nLast month, Labour was accused of making a \"rushed\" decision and there were warnings against taking the \"nuclear approach\" of scrapping UGN entirely.\nBut the council leadership has insisted there is no better option and argued that, given it would still need to keep funnelling cash to Urban Green even if it was allowed to continue, it would be exposed to financial risks either way.", "url": "https://www.bbc.co.uk/news/articles/c3e4v74z8zqo"}