{"authors": ["Gavin McEwan", "www.facebook.com"], "date_download": "2025-04-26 06:42:31", "date_modify": "2025-04-26 06:42:31", "date_publish": "2025-03-02 11:33:58", "description": "There are plans to recreate a station on the Hereford-Abergavenny line.", "filename": "news_articles_cwygwexlqxzo_1745649751.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/089e/live/6704b1e0-f750-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwygwexlqxzo_1745649751.html", "title": "Further delay to new Pontrilas railway station plan", "title_page": "Further delay to new Pontrilas railway station plan - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to recreate a passenger railway station for south-west Herefordshire have hit a further setback.\nA \"Golden Valley Parkway task force\" was set up late last year to co-ordinate progress on the proposal between councils and rail operators for Pontrilas on the Hereford-Abergavenny line.\nNow, a monitoring report on progress towards 179 council \"milestones\" has flagged as \"red\" its goal of completing a strategic outline business case for the plans.\n\"Delays in engagement with Network Rail has meant that the brief for procuring a professional services provider to undertake business case has not yet been agreed by the task force,\" the report said.\nThe plan is supported by Conservative MP for Hereford and South Herefordshire and former transport minister Jesse Norman.\nIn June, Herefordshire Council said it planned to spend £50,000 developing a business case in partnership with rail industry figures, but cautioned at the time it was \"not possible to commit to a timescale for station opening\".\nThe incoming Labour government then cancelled the Restoring Your Railways fund, which had been seen as the most promising source of funding to get the scheme off the ground.\nThe council's monitoring report said it had delivered, or was likely to deliver, 140 out of the 179 milestones by the start of April.", "url": "https://www.bbc.co.uk/news/articles/cwygwexlqxzo"}