{"authors": ["Shariqua Ahmed", "Joanna Taylor", "www.facebook.com"], "date_download": "2025-04-26 06:20:10", "date_modify": "2025-04-26 06:20:10", "date_publish": "2025-03-01 06:35:02", "description": "Prince Andrew visits the city, Peterborough United book another Wembley trip, and more stories you might have missed.", "filename": "news_articles_cm2nn2jrm8go_1745648410.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a929/live/a4012580-f5e1-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2nn2jrm8go_1745648410.html", "title": "Peterborough stories you may have missed this week", "title_page": "Peterborough stories you may have missed this week - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some last minute heroics saw Peterborough United book a second consecutive visit to Wembley in the EFL Trophy.\nCambridgeshire Police laid out when you should, and when you should not, call 999 after a resident phoned the emergency number about a cat.\nFrustrations grew over a sinkhole near the Town Bridge that has closed a footpath for five years.\nPrince Edward also met young people in the city who were trying to improve their communities.\nIn 2020, Susan Broccoli first noticed a sinkhole in Peterborough, but for five years it was unclear who was responsible for the repair.\nMrs Broccoli feared the situation on Henry Penn Wall reflected badly on the city centre and the size of the hole would only increase.\nPlans were under way to resolve the issue, but how did it get to this point and what is actually being done?\nBeing being bitten by a cat does not warrant an emergency call, police have reminded people.\nCambridgeshire Police said a man dialled 999 at the weekend to report two cats had been fighting and one had bitten him.\nWriting on Facebook, the force said the \"bizarre call\" was one of more than 1,000 taken by call handlers that weekend.\nA city school has welcomed the government's free breakfast club scheme.\nThe government has announced the first 750 schools where pupils will be offered a free daily breakfast, benefiting up to 180,000 pupils.\nTwo Peterborough schools - Northborough Primary School and St John Henry Newman Catholic Primary School - will be among the first to take part in the scheme from April.\nPrince Edward, the Duke of Edinburgh, met young people in Peterborough who had made a difference to their communities by taking part in the Duke of Edinburgh (DofE) Awards.\nThe duke also visited Peterborough United's stadium and ended his day at the Railworld Wildlife Haven, where he met students from local schools, completing their volunteering section at the centre.\nPeterborough City Council asked the public to put forward views about using Automatic Number Plate Recognition (ANPR) cameras to clamp down on dangerous driving.\nA consultation has been launched regarding nine new locations where drivers could be fined.\nMeanwhile, it was announced Peterborough Museum will remain open five days a week, despite suggestions it could have it hours cut to save cash.\nCouncil leader Dennis Jones said the authority was still \"exploring options\" for the future, but added it did not plan to make immediate changes.\nPeterborough's MP, Andrew Pakes, said 14,000 new NHS dentist appointments would be made available across Cambridgeshire and Peterborough in the next year. The region's integrated care board will be tasked with providing the urgent care appointments, funded by underspends in the dental budget.\nThe city council marked the third anniversary since Russia's full-scale invasion of Ukraine through a flag-raising ceremony. A spokesperson said their \"thoughts remain with those Ukrainian members of our community and all those affected by the conflict\".", "url": "https://www.bbc.co.uk/news/articles/cm2nn2jrm8go"}