{"authors": ["Dorcas Wangira", "www.facebook.com"], "date_download": "2025-04-26 06:26:38", "date_modify": "2025-04-26 06:26:38", "date_publish": "2025-02-28 21:07:07", "description": "Officials say they are concerned that they will spread the contagious disease to the wider community.", "filename": "news_articles_ckgne2v4p12o_1745648798.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/891a/live/eacbd360-f614-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgne2v4p12o_1745648798.html", "title": "DR Congo conflict: 500 mpox patients flee clinics after rebel looting", "title_page": "DR Congo conflict: 500 mpox patients flee clinics after rebel looting - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "More than 500 mpox patients have fled clinics in eastern Democratic Republic of Congo over the last month amid the current conflict.\nOfficials at Africa Centres for Disease Control and Prevention (Africa CDC), a leading health agency on the continent, have said they are worried as the missing patients risk spreading the highly contagious disease that is suspected to have killed at least 900 people in DR Congo last year.\nThe patients fled from facilities in Goma and Bukavu - two cities that descended into chaos as they were seized by the Rwanda-backed M23 rebels over the past weeks.\n\"We were looted. We lost equipment. It was a disaster,\" Dr Samuel Muhindo, in charge of a clinic in Goma, told the BBC.\nMpox - formerly known as monkeypox - can cause symptoms such as lesions, headaches and fever.\nAccording to Africa CDC, since the start of this year almost 2,890 mpox cases and 180 deaths have been reported in the country, which has been at the epicentre of several recent outbreaks.\nDr Muhindo described how 128 patients had fled Goma's Mugunga health centre in the wake of the fighting at the end of January.\nHis health workers had not been able to trace them as paperwork at the clinic was destroyed, he said.\nAt Bisengimana, a hospital in Goma that also treats mpox, looters took medicines and personal protective equipment.\nFires were lit outside the centre and when the perpetrators departed, patients' medical records were left strewn on the floor.\nThe situation has been further complicated by the M23's decision to close a network of camps in Goma where tens of thousands of people who had sought refuge from fighting in recent years.\nThey were given 72 hours to leave last week, although the M23 later said it was encouraging \"voluntary returns\".\n\"Now we are afraid of an outbreak of the epidemic in the areas where the displaced people returned to,\" Dr Muhindo said.\nHis fears have been echoed by the Africa CDC.\n\"Once again, we are calling really for the ceasefire and also the agency to establish a humanitarian corridor to facilitate the continuation of mpox interventions,\" Dr Ngashi Ngongo, Africa CDC's mpox incident manager, said on Thursday.\nOver the last week, the Africa CDC says the number of missing mpox patients has risen by 100 as fighting escalates and the rebels take more territory.\nDr Ngongo added that a new variant of mpox with \"high potential for higher transmissibility\" had also been detected in DR Congo.\nThe country's ability to respond to the disease has been hampered by the conflict, between the M23 and DR Congo's army, as well as a lack of funding.\nThe mpox facility at Mugunga, funded by the UN children's agency (Unicef) and BrItish government aid, managed to reopen last week.\nBut it is already so overstretched that there are times when four or five patients have to share one bed.", "url": "https://www.bbc.co.uk/news/articles/ckgne2v4p12o"}