{"authors": ["Asha Patel", "Emma Snow", "www.facebook.com"], "date_download": "2025-04-26 04:31:22", "date_modify": "2025-04-26 04:31:22", "date_publish": "2025-03-03 06:11:08", "description": "Fire crews in Nottinghamshire want us to be more aware of the risks around the popular kitchen gadget.", "filename": "news_articles_cx2eerg9567o_1745641882.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c8d/live/02fd12f0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2eerg9567o_1745641882.html", "title": "How do you operate an air fryer safely?", "title_page": "How do you operate an air fryer safely? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The air fryer has become a popular kitchen appliance in recent years - with many opting to use them over ovens for their ease, speedy dinners and cost to run.\nBut firefighters in Nottinghamshire say it is \"crucial\" users are aware of the risks that might come with them.\nNottinghamshire Fire and Rescue Service said crews had attended nine fires involving air fryers in the past 10 months.\nAnd when a student accommodation kitchen almost went up in flames earlier this month after an air fryer set alight, crews warned it was becoming a familiar scene. So how do we operate them safely?\nAccording to the fire service, the recent uptick in fires involving air fryers, while linked to their increase in use, has largely been down to \"user error\".\n\"Four of those incidents that we've attended - the air fryer has actually been sat on a hob in the kitchen and that hob has either been turned on deliberately, by someone not knowing that's not what they're meant to do, or accidentally,\" said station manager Richard Booth.\nHe added the other fires had been within the air fryers themselves, including one in which baking paper was used in the appliance, and another when excess packaging remained in the drawer of a new air fryer.\nThe recent incident at student accommodation, in Lenton, Nottingham, on 11 February, was contained thanks to a sprinkler system, external.\nFirefighters were called to the student accommodation building shortly before 22:00 GMT.\nThe students inside had already been evacuated and one person was treated at the scene for smoke inhalation, but the fire service said it \"could have been a much worse situation\".\nThe fire service said no single air fryer brand in particular had been involved in the fires.\n\"It doesn't matter which brand it is,\" Mr Booth said. \"Just as long as you check that it's in good working order, making sure that you keep on top of maintenance.\n\"And if you find that your air fryer is damaged in any way or it's not operating correctly, then stop using it and make sure you replace it.\"\nThe short answer is, no.\nStation manager Richard Booth says air fryers are \"very safe\" to use, thanks to their temperature control and timers.\nHe added: \"Most food that can be cooked in an air fryer has hot instructions for it.\"\nWhile there is generally nothing to worry about, there are things people do that can increase the risk of fire.\nMr Booth says if a fire does start in your air fryer, switch it off - only if it is safe to do so.\nYou should leave the property and contact the fire service.\nNever attempt to fight the fire yourself, Mr Booth said. And do not apply water to any air fryer fires.\nHe added: \"There's nothing to be worried about using an air fryer. Just follow those safety tips, make sure it's clean, try to stay in the room when you're using it, just in case something does happen.\n\"But they are very safe and they're much cheaper to use than your oven.\"", "url": "https://www.bbc.co.uk/news/articles/cx2eerg9567o"}