{"authors": ["Julia Gregory", "www.facebook.com"], "date_download": "2025-04-26 08:13:27", "date_modify": "2025-04-26 08:13:27", "date_publish": "2025-02-26 11:22:36", "description": "Whales are being spotted because \"if the food is here, they will come\", voyage bosses say.", "filename": "news_articles_cp3ywye5694o_1745655207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/502c/live/40120af0-f38c-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3ywye5694o_1745655207.html", "title": "Five-hour trips launched to spot and survey whales", "title_page": "Five-hour trips launched to spot and survey whales off Cornwall - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Organisers of whale-watching sea trips in Cornwall want to use new five-hour sailings to extend the reporting of sightings and further work to protect the sea creatures.\nA K Wildlife Cruises is planning trips to sail between 20 and 35 miles (30 and 55km) offshore to look for whales and other wildlife.\nIt comes after hundreds of people flocked to Newquay after a humpback whale was spotted there.\nManager Cameron Molland said: \"All of what we do is driven by the welfare of the animals and we always report all of our sightings. We work with a lot of groups to implement tighter protection of these animals.\"\nMr Molland, who described it as \"pretty surreal that you can see these gentle giants in Cornwall\", said people had chances to spot minke whales, which can be seen in the UK all year, as well as fin whales, the second largest whale; and humpback whales.\nWhales were being spotted off the Cornish coast because \"if the food is here, they will come\", he explained.\nHe said Cornwall had \"just been gripped by this incredible whale euphoria\" since \"epic\" sightings in Watergate Bay in Newquay.\n\"Simply put, whales are really cool,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cp3ywye5694o"}