{"authors": ["Julia Bryson & Grace Wood", "www.facebook.com"], "date_download": "2025-04-26 04:18:10", "date_modify": "2025-04-26 04:18:10", "date_publish": "2025-03-04 06:40:24", "description": "Giggle Fibre says running \"full fibre\" broadband cables underground in Garforth is not possible.", "filename": "news_articles_clyjgp38n9xo_1745641090.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2009/live/06f794f0-f847-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clyjgp38n9xo_1745641090.html", "title": "Garforth residents' anger over broadband poles installation", "title_page": "Garforth residents' anger over broadband poles installation - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents in part of Leeds have spoken of their anger at what they have described as \"unsightly\" poles being installed on their streets by a broadband provider.\nPeople living in the affected areas of Garforth - where there were previously no poles - have set up a petition against the work, and that has so far gained over 430 signatures.\nLocal resident Grace Feeney, 36, said: \"We're going to boycott the service. No-one wants it. We have people ready to park cars to stop the poles going up\".\nThe company behind the poles, Giggle Fibre, has been approached for comment, but previously said running its cables underground was not possible and using telegraph poles had a lesser environmental impact.\nMs Feeney explained: \"In some parts of the country, telegraph wires are not uncommon.\n\"But Garforth was built as an open estate, and the idea was that everything would be underground, so it tended not to have overhead cables.\n\"People have seen some very heavy cables go up already - and one telegraph pole with 20 wires coming out.\"\nMs Feeney said a petition she had set up where she lived on Acaster Drive had so far been signed by people from 50 out of the 96 households on the road.\nShe said: \"It's a nice street that backs on to the greenbelt. They're hideous wires.\n\"If we manage to avoid it on our street we'll be happy, but we want to help other people avoid it.\"\nWhile Giggle Fibre has yet to give a comment to the BBC, the firm has previously responded to concerns in a letter to people living in the area following a meeting with Labour MP for Leeds East Richard Burgon.\nIn the letter, the company said it had \"considered all available options to minimise disruption while ensuring reliable and future-proof connectivity\".\nIt added that in some places it had managed to share infrastructure with telecom company Openreach, but much of the underground networks were outdated and unable to be shared.\n\"Much of the existing underground network in East Garforth, which was installed in the 1970s, consists of direct buried cables without suitable ducting,\" it said.\nBurgon said: \"Ever since the estate was first built there, there have never been telegraph poles in that area.\n\"People enjoy that element of it and being able to see the full sky, and they should be allowed to continue to do so.\"", "url": "https://www.bbc.co.uk/news/articles/clyjgp38n9xo"}