{"authors": ["Vicky Wong", "www.facebook.com"], "date_download": "2025-04-26 04:08:55", "date_modify": "2025-04-26 04:08:55", "date_publish": "2025-03-02 20:08:35", "description": "The UK prime minister says Europe would take the lead but would need US backing for a peace plan.", "filename": "news_articles_c9vygkzkkrvo_1745640535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c795/live/14a83980-f778-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9vygkzkkrvo_1745640535.html", "title": "Starmer: Coalition of willing to guarantee Ukraine peace", "title_page": "Starmer: Coalition of willing to guarantee Ukraine peace - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "UK Prime Minister Keir Starmer has announced a four-point plan to work with Ukraine to end the war and defend the country from Russia.\nThe UK, France and other countries will step up their efforts in a \"coalition of the willing\" and seek to involve the US in their support for Ukraine, he said on Sunday - after calling a summit of 18 leaders, mostly from Europe and including Volodymyr Zelensky - three days earlier.\n\"We are at a crossroads in history today,\" Starmer said after the summit while Zelensky said Kyiv felt \"strong support\" and the gathering showed \"European unity at an extremely high level not seen for a long time\".\nIt comes two days after a fiery exchange between the Ukrainian leader and US President Donald Trump in the White House.\n\"We are all working together in Europe in order to find a basis for cooperation with America for a true peace and guaranteed security,\" Zelensky said after the summit.\nMeanwhile, French President Emmanuel Macron told Le Figaro newspaper that Paris and London wanted to propose a one-month truce between Russia and Ukraine \"in the air, at sea and on energy infrastructure\".\nSpeaking at a news conference shortly after the meeting of leaders, Starmer said four points had been agreed:\nto keep military aid flowing into Ukraine, and to keep increasing the economic pressure on Russia\nthat any lasting peace must ensure Ukraine's sovereignty and security and Ukraine must be present at any peace talks\nin the event of a peace deal, to boost Ukraine's defensive capabilities to deter any future invasion\nto develop a \"coalition of the willing\" to defend a deal in Ukraine and to guarantee peace afterwards\nStarmer also announced an additional £1.6bn ($2bn) of UK export finance to buy more than 5,000 air defence missiles. This comes on top of a £2.2bn loan to provide more military aid to Ukraine backed by profits from frozen Russian assets.\n\"We have to learn from the mistakes of the past, we cannot accept a weak deal which Russia can breach with ease, instead any deal must be backed by strength,\" he said.\nThe prime minister did not state which countries had agreed to join this coalition of the willing, but said that those who had committed would intensify planning with real urgency.\nThe UK, he said, would back its commitment with \"boots on the ground, and planes in the air\".\n\"Europe must do the heavy lifting,\" he said, before adding that the agreement would need US backing and had to include Russia, but that Moscow could not be allowed to dictate terms.\n\"Let me be clear, we agree with Trump on the urgent need for a durable peace. Now we need to deliver together,\" Starmer said.\nWhen asked if the US under Trump was an unreliable ally, he said: \"Nobody wanted to see what happened last Friday, but I do not accept that the US is an unreliable ally.\"", "url": "https://www.bbc.co.uk/news/articles/c9vygkzkkrvo"}