{"authors": ["Jake Wallace", "www.facebook.com"], "date_download": "2025-04-26 04:41:26", "date_modify": "2025-04-26 04:41:26", "date_publish": "2025-03-02 07:08:45", "description": "The shortlisted buildings include a family home, a museum and a office space.", "filename": "news_articles_cz7vv99d14vo_1745642486.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7e73/live/1eb18610-f4ea-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz7vv99d14vo_1745642486.html", "title": "Devon and Cornwall buildings on architecture awards shortlist", "title_page": "Devon and Cornwall buildings on architecture awards shortlist - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Building projects in Devon and Cornwall have been included on a shortlist for an architecture award.\nA museum and a house in Cornwall and an office in Devon join 11 other buildings shortlisted for the Royal Institute Of British Architects (RIBA) South West and Wessex Awards 2025.\nAll of the shortlisted projects will be visited by a regional jury and the winning buildings announced in spring.\nRegional jury chairman Rob Gregory said: \"This year's shortlist showcases a wide range of projects, from standalone new builds, to holistic transformations of existing properties, and discrete extensions.\"\nThe two Cornish building projects are a new-build family home overlooking Mawgan Porth bay in Newquay and the Story of Emily Museum in Saint Ive.\nThe latter celebrates the life of humanitarian Emily Hobhouse, who campaigned against the UK's use of concentration camps in the Boer War.\nIt encompasses the rectory where she grew up in addition to a collection of new build and rebuilt elements.\nThe Devon building on the shortlist is the Block office redevelopment in Royal William Yard.\nThe modern office is hidden behind the exterior of the Grade I listed Melville Building, which was a former naval warehouse.\n\"With nine homes in contention this year, domestic architecture in the south-west region remains as strong as ever,\" said Mr Gregory.\n\"Alongside these, the jury is looking forward to visiting new workplaces, cultural venues and community housing, on a carefully choreographed journey that extends over 135 miles (about 220km) - from the suburbs of Bath to the far reaches of West Cornwall.\"\nThe regional winning buildings will be considered for further RIBA awards including the UK's best new building.", "url": "https://www.bbc.co.uk/news/articles/cz7vv99d14vo"}