{"authors": ["Christine Sexton", "Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 07:35:46", "date_modify": "2025-04-26 07:35:46", "date_publish": "2025-02-27 15:05:03", "description": "A student complained about how teachers were locked out of school buildings, councillors are told.", "filename": "news_articles_cy833nkj452o_1745652946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1644/live/399aa720-f4fb-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy833nkj452o_1745652946.html", "title": "Mossbourne Federation schools in Essex subject to five complaints", "title_page": "Mossbourne Federation schools in Essex subject to five complaints - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Several formal complaints have been sent to a council concerning an academy trust that has taken over three schools in Essex.\nThe Mossbourne Federation started running two secondaries and a primary school in Thurrock this year.\nThurrock Council has outlined five complaints, which include concerns about an accident which happened during a class and the way teachers were locked out of one of the schools during industrial action.\nThe trust has so far declined to comment.\nIn December, the trust was accused of presiding over a \"toxic culture\" towards its pupils in Hackney, east London.\nCouncillors are due to discuss the complaints - detailed in published documents, external - at a meeting on Tuesday.\n\"Concerns around the Mossbourne Trust continue,\" said independent councillor Neil Speight, who chairs the local authority's pupil overview and scrutiny committee.\n\"I am watching closely events that are taking place in Hackney, where I understand matters in Thurrock are now being discussed as part of a probe into the effectiveness of the Mossbourne mantra.\"\nWhen Mossbourne Federation formally took over the running of the schools on 31 December, it changed their names.\nOrtu Gable Hall School in Corringham became Mossbourne Fobbing Academy; Ortu Hassenbrook Academy became Mossbourne Port Side Academy; and Corringham Primary School became Mossbourne Herd Lane Academy.\nThe council said it was first told, on 23 December, of two complaints made by parents about safeguarding within the trust.\nOn 7 January, it said it was forwarded two more complaints made to Ofsted about Mossbourne Fobbing Academy.\nA student complained about how teachers were locked out of buildings during industrial action and an anonymous member of staff complained how a particular teacher managed a serious accident during a class.\nOn 4 February, the council said it received another complaint via Ofsted, this time about safeguarding at Mossbourne Port Side.", "url": "https://www.bbc.co.uk/news/articles/cy833nkj452o"}