{"authors": ["Nick Thorpe", "www.facebook.com"], "date_download": "2025-05-19 14:23:19", "date_modify": "2025-05-19 14:23:19", "date_publish": "2015-04-10 23:30:51", "description": "Hungary's nationalist Jobbik party is trying to woo voters in the centre ground and improve its image, Nick Thorpe reports.", "filename": "news_world-europe-32248965_1747664599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/82234000/jpg/_82234984_jobbikrallyepa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-32248965_1747664599.html", "title": "Hungary's nationalist Jobbik party woos centrist voters", "title_page": "Hungary's nationalist Jobbik party woos centrist voters - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The nationalist Jobbik party aims to capture the centre ground in Hungarian politics and has narrowly won a key by-election.\nThe party is trying to position itself as the main challenger to Prime Minister Viktor Orban's ruling Fidesz.\nJobbik describes itself as \"a principled, conservative and radically patriotic Christian party\" on its website.\n\"Its fundamental purpose is protecting Hungarian values and interests,\" the message in English says.\nCritics see it as a far-right, even neo-Nazi movement. It got 20% of the vote in last year's parliamentary election, making it the most successful nationalist party in Europe in recent years. It is now running at 28% in opinion polls.\nThe by-election in Tapolca in western Hungary on 11 April confirms how wounded conservative Fidesz is now. Jobbik's triumph - winning its first ever individual constituency seat in parliament - could influence hundreds of thousands of previously undecided voters, ahead of national elections in 2018.\nJobbik's candidate Lajos Rig, a hospital worker and trade union leader, beat rivals from Fidesz and the opposition Socialists.\nGabor Vona, Jobbik's 37-year-old leader, wears what appears to be the new Jobbik uniform - blue jeans, black suit jacket, shirt and tie.\nIn late 2013, Mr Vona declared a new direction for his party - towards the political centre, and away from the extreme right which won it its ugly reputation.\n\"We are a people's party now,\" Mr Vona told me. \"Naturally we have kept our basic values, but now we are trying to represent the whole of society, with all the different views which people hold.\n\"So in the present political situation, Jobbik doesn't approach people with ideology, but on the basis of a programme of action.\"\nIsn't he worried that such a stance could lose him the support of the right wing, the roots of his party?\n\"If someone disagrees with the people's party direction I stand for, they will lose their place in Jobbik, sooner or later,\" he replied. \"I will not accept any crude or extreme views in the future. I want this to be party which everyone can calmly and honourably vote for.\"\nBut the list of those in Jobbik's past who might fall foul of such principles is a long one.\nOne Jobbik deputy spat on a monument on the Danube shore built to commemorate Jews murdered there in 1944 by Hungarian Nazis. Mr Vona ordered him to lay a flower there as an apology.\nAnother suggested, during a debate on the Middle East, the drawing up of a list of \"people of Jewish ancestry… especially in the Hungarian parliament and Hungarian government, who do indeed pose a national security risk\".\nMost seriously, by repeatedly insisting on a category it calls \"Gypsy crime\", Jobbik has contributed to a serious worsening of relations with the Hungarian Roma minority.\nOne of the results of that was a series of random murders of Roma in 2008-2009. One of the four men convicted of the murders suggested in court that the uniformed but unarmed \"Hungarian Guard\", which Mr Vona set up to patrol Roma neighbourhoods, was too mild for his taste.", "url": "https://www.bbc.com/news/world-europe-32248965"}