{"authors": ["Charlie Buckland", "www.facebook.com"], "date_download": "2025-04-26 04:28:51", "date_modify": "2025-04-26 04:28:51", "date_publish": "2025-03-02 09:03:26", "description": "Community members have made stickers and posters in protest against a security gate blocking Cwmparc forest.", "filename": "news_articles_cvg1e4v88x8o_1745641731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9d0c/live/ea888e00-f391-11ef-b176-3b0103bf5e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1e4v88x8o_1745641731.html", "title": "Cwmparc: Neighbours protest to remove house gate blocking forest", "title_page": "Cwmparc: Neighbours protest to remove house gate blocking forest - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents have taken to protest after a new homeowner put up gates blocking the entrance to a forestry.\nA petition calling for public access of Cwmparc Forest in Treorchy, Rhondda Cynon Taf has reached over 3,000 signatures within a week, with many community members voicing their concerns during a \"peaceful\" protest on Sunday.\nBut the homeowner of the property said the family were left with \"no choice\" after experiencing \"dangerous driving, dog fouling, people urinating, aggression, theft, drugs and air rifles\".\nRhondda Cynon Taf (RCT) council said it was reviewing all evidence, as while the land is privately owned, this \"does not prelude the existence of highway rights\".\nAbout 70 people gathered outside the home amid an amber rain warning on 23 February, holding a banner reading: \"No to the gate. Our mountains are there for all to enjoy.\"\nCampaigners entered Cwmparc forest using an alternative route accessible from Tylacoch near Treorchy Comprehensive school, but said it was a one to two mile detour of \"rough terrain\".\nPetition founder Richard Clarke, 57, from Treorchy, asked the property's interactive doorbell to open the gates, so they did not have to go back across the mountain.\n\"Conditions have deteriorated somewhat since we set off. We are in an almost emergency situation here... We would appreciate any cooperation you would kindly give us by opening your gates.\"\nIn response, the homeowner told them it was a private property and asked them to \"please leave\" to which they did, according to Mr Clarke.\nThe forest is managed by Natural Resources Wales (NRW), which confirmed it owned a private right of way over the land - but said it does not extend to public access.\nThe gate, which was put up last week, sparked campaigners to make \"no to the gate\" stickers and posters, which many small businesses have placed in shop windows to show their solidarity.\nHowever the family of the gated property, who moved to Cwmparc about a year ago, said their private entrance had been abused in a way which they felt they had to consult with authorities and advisors over what could be done.\nThe homeowners said their main concern was keeping their family safe, in what they described as a very difficult situation.\nIn a statement, they said: \"We are currently working hard to find an alternative solution. There is an existing path to one side of our property which would provide an alternative route.\n\"Work on clearing the path has already started but we ask for the community's patience and understanding as the progress is weather dependant.\"\nMr Clarke said he does not wish the family ill, but does not agree that people were now blocked from visiting the mountain.\nAs part of a local walkers group, he said the path had been used for decades for cyclists, dog walkers and nature lovers.\nHe said blocking the park was a threat to the community's mental health, as getting outdoors in the peace and quiet does wonders for people's wellbeing.\n\"This phenomena threatens to cage our cherished countryside and the happiness we found in it,\" said Mr Clarke.\nWhile the road is not a right of way for the public, Mr Clarke said residents were hoping to be granted prescriptive right of way.\nHe remains determined for the gate's removal, with more walks planned in the near future.\n\"Let our future generations continue to enjoy the beauty and freedom to roam our remarkable Welsh countryside, just as we have,\" he said.\nThe homeowners thanked those who had \"shown kindness and understanding\", adding that it had motivated them to \"keep faith\" in the community and \"help find an alternative solution which meets the needs of everyone concerned\".", "url": "https://www.bbc.co.uk/news/articles/cvg1e4v88x8o"}