{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:48:39", "date_modify": "2025-04-26 06:48:39", "date_publish": "2025-03-01 11:04:44", "description": "Much of Britain's seagrass beds have been lost but the project aims to plant 14 hectares over three years.", "filename": "news_articles_cd65j7jd3z5o_1745650119.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a98d/live/c0be2780-f687-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65j7jd3z5o_1745650119.html", "title": "Seagrass: £2.4m project launched to restore 'wonder plant' to Scotland's coasts", "title_page": "Seagrass: £2.4m project launched to restore 'wonder plant' to Scotland's coasts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A £2.4m seagrass planting programme has been launched to help restore the plant in seas around the north of Scotland.\nThe project aims to plant 14 hectares (34.6 acres) of seagrass, often described as a \"wonder plant\" by conservationists, over the next three years.\nSeagrasses are often likened to rainforests because they provide food and shelter for thousands of species, but they have been declining globally since the 1930s.\nIn the last century 92% of the plants have been lost from Britain's coasts and areas once covered by seagrass are now \"lifeless seabeds\", according to research by University College London., external\nThe new initiative is a partnership between the Scottish Marine Environmental Enhancement Fund (SMEEF) and Scottish and Southern Electricity Networks (SSEN).\nGrants have been awarded to four organisations that cover areas from Shetland to the Kintyre peninsula.\nThese are Mossy Earth's Wilder Firths project (based around the Black Isle), Kintyre Coastal Network's East Kintyre Biosphere, Wester Ross Fisheries Trust's seagrass planting project and Restoring Shetland's Marlie Meadows - a project by the University of the Highlands and Islands.\nSeagrass is home to a vast number of species, and is a food source for many others.\nIt can purify water and slow down waves, protecting coastal areas from flooding as a result.\nThe plant also takes in CO2, making it useful in tackling climate change.\nThe partnership said Scottish seas are a special place for marine habitats like seagrass, with the country's coasts stretching 18,000km (11,185 miles) and containing 8,000 species or more.", "url": "https://www.bbc.co.uk/news/articles/cd65j7jd3z5o"}