{"authors": ["Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 07:42:14", "date_modify": "2025-04-26 07:42:14", "date_publish": "2025-02-26 21:09:06", "description": "The hospice welcomes the government funding, but warned of a “funding gap” due to rising costs.", "filename": "news_articles_c3d853lk3j0o_1745653334.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/95c8/live/96938920-f45a-11ef-8420-bd21274f258f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3d853lk3j0o_1745653334.html", "title": "Bosham hospice to receive £141k government funding boost", "title_page": "Bosham hospice to receive £141k government funding boost - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hospice in West Sussex is to receive a funding boost from the government, but has warned of a \"funding gap\" due to rising costs in delivering specialist services.\nSt Wilfrid's Hospice in Bosham is to receive £141,670, which will be used to pay for capital costs such as infrastructure, it said.\nLois Howell, chief executive of the hospice, welcomed the funding, but said its running costs were more than £26,000 per day.\nMinister for Care, Stephen Kinnock, said it was the \"largest investment in a generation\".\nThe funding is part of a scheme which will see hospices across England receive the first £25m of a one-off £100m government grant.\nMs Howell said: \"We are extremely grateful to receive our share of this grant, but we are still left with a funding gap due to the ever-increasing costs of running our specialist services.\n\"One cause of those rising costs is the recent increase in Employer National Insurance contributions, which means that the hospice will have to find an extra £240,000 a year, on top of the £9m we need to run our services.\"\nShe added that demand for palliative and end-of-life care was increasing due the ageing and growing population.\nOf the £26,000 per day running costs, 16% comes from government funding, Ms Howell added.\nMr Kinnock said the funding boost would ensure hospices were able to deliver care in better, modernised facilities.\n\"From upgrading patient rooms to improving gardens and outdoor spaces, this funding will make a real difference to people at the end of their lives,\" he said.\nAn additional £75m will be available from April as part of the scheme, a Department of Health and Social Care spokesperson added.", "url": "https://www.bbc.co.uk/news/articles/c3d853lk3j0o"}