{"authors": ["Samantha Noble", "Becky Measures", "www.facebook.com"], "date_download": "2025-04-26 06:18:48", "date_modify": "2025-04-26 06:18:48", "date_publish": "2025-03-01 07:18:43", "description": "The Co-op cow - a locally-loved landmark - will be re-lit for the first time in more than 20 years.", "filename": "news_articles_c4gdde705yxo_1745648328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7662/live/2bc63f30-f5d0-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4gdde705yxo_1745648328.html", "title": "'The Derby Co-op cow sign is how we knew we were home'", "title_page": "'The Derby Co-op cow sign is how we knew we were home' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "After it first lit up the skyline in 1955 with its red and green neon lights, the \"Co-op cow\" sign soon became well-loved - and a signal to the people of Derby that they were home.\nMore than 20 years ago, the landmark on top of Derby's Central Hall was re-positioned on the side of the building, but some time after the lights went off and never came on again, leaving locals udderly upset.\nOn Saturday, it will finally moo-ve out of the darkness, with its switch-on due to take place at about 19:00 GMT.\nThe Co-op cow may be unfamiliar to younger generations, but for many older residents of the city, they say it is part of their childhood.\nThe Central Co-op said the cow was being re-lit as part of the celebration of the United Nations' International Year of Cooperatives 2025.\nElaine Dean, society president of Central Co-op, told the BBC: \"After over 20 years of darkness, we will have light and people will see the cow again.\"\nShe said she remembered it being put up, and going to see it.\n\"It was always there - as everyone says, it is the sign that you are coming home to Derby when you see it in the distance,\" she said.\n\"As a little girl, it was the Co-op cow. We had Co-op milk, and it was just part of Derby.\"\nMrs Dean said she remembered when the cow was re-lit in its new position, in 2002.\nShe said: \"It was lit up by Ted Pickard, the electrician, and I was up there on the roof at the time. We had a crowd of people up there to celebrate.\n\"Then it went off, and it was off for ages, and the Co-op vacated the Central Hall premises as retail departments and nobody bothered about it.\n\"I asked several times if it could be lit up again.\"\nMr Twigge, who has asked about the cow being re-lit on his show, said growing up, he would go into Derby on the number seven bus from Heanor.\nHe said: \"You knew you were in Derby because you could see the Co-op cow, and when you went in at night time, it was all lit up. It's iconic.\n\"For people that can remember it originally, it's huge. For me, the Co-op cow is Derby.\n\"Like Rolls-Royce, the railways and the Royal Crown Derby, so is the Co-op cow.\"", "url": "https://www.bbc.co.uk/news/articles/c4gdde705yxo"}