{"authors": ["Jacqueline Howard", "Laura Gozzi", "www.facebook.com"], "date_download": "2025-04-26 04:24:33", "date_modify": "2025-04-26 04:24:33", "date_publish": "2025-03-03 12:38:55", "description": "Several more people have been injured, police say, and one suspect, a German man, has been arrested.", "filename": "news_articles_cvge70y4q91o_1745641473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5151/live/75c5cb60-f84a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvge70y4q91o_1745641473.html", "title": "Two people dead after car drives into crowd in Mannheim, Germany", "title_page": "Two people dead after car drives into crowd in Mannheim, Germany - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two people - an 83-year-old woman and a 54-year-old man - have been killed after a vehicle drove into a pedestrian area in the city of Mannheim, western Germany.\nFive people were seriously injured and another five suffered minor injuries in the incident, investigators said.\nAuthorities arrested a lone suspect, a 40-year-old German man, who is not believed to be linked to extremism but shows \"concrete indications of mental illness\".\nThe suspect, who prosecutors said was a landscape gardener, remains in hospital in a stable condition after shooting himself with a gun loaded with blanks.\nThe incident occurred at around 12:15 local time (11:15 GMT), Mannheim police said.\nCCTV footage showed a black hatchback car speeding along Planken shopping street in Mannheim, heading west.\nImages from the scene showed police inspecting the car, a small black Ford, which had sustained heavy damage to its front.\nThe images show the car missing a hub cap on its front left wheel. In the CCTV footage, the front left hub cap also appears to be missing.\nThomas Strobl, interior minister of Baden-Württemberg, said the man used the vehicle \"as a weapon\".\n\"This act is one of several crimes in the recent past in which a car was misused as a weapon,\" Mr Strobl said, but added that there is no evidence to suggest the incident is connected to the Easter carnival taking place in the city.\nPolice are investigating two counts of murder and several of attempted murder, Mannheim chief public prosecutor Romeo Schluessler told reporters.\nMannheim's mayor described the incident as \"abhorrent and \"inhumane\".\n\"Our thoughts are with the dead and injured, their families and friends,\" Mayor Christian Specht said.\nOlaf Scholz, Germany's outgoing chancellor, thanked the emergency services and wished \"strength\" for eyewitnesses in Mannheim to \"process what they have experienced\".\n\"We mourn with the relatives of the victims of a senseless act of violence and fear for those injured,\" he said in a social media post.\nThe incident comes at a time of heightened security as outdoor carnivals linked to Easter celebrations are held across Germany.\nThere was a parade through the Mannheim city centre on Sunday, with major events scheduled for Tuesday.\nA market has now been closed and a street carnival in the city centre will not take place. Carnival events in the nearby suburbs of Feudenheim, Neckarau and Sandhofen have also been cancelled.", "url": "https://www.bbc.co.uk/news/articles/cvge70y4q91o"}