{"authors": ["Georgia Stone", "www.facebook.com"], "date_download": "2025-04-26 06:34:27", "date_modify": "2025-04-26 06:34:27", "date_publish": "2025-02-27 06:27:59", "description": "Law student Aishah Ahmed gives away 250 free curries a week to the community in Weston-super-Mare.", "filename": "news_articles_c0k5xgjndp5o_1745649267.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d5f5/live/ad332c00-ea2b-11ef-b97b-25d61d7f2164.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0k5xgjndp5o_1745649267.html", "title": "Student's charity helping tackle Weston-super-Mare food poverty", "title_page": "Student's charity helping tackle Weston-super-Mare food poverty - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 21-year-old university student's meal charity is helping to tackle food poverty in her town.\nAishah Ahmed set-up Aishah's Food Charity in 2023 after seeing people struggling with the cost of living in Weston-super-Mare, Somerset.\nHer dad, Syad Ahmed, cooks more than 250 free meals at his restaurant Pappadoms Takeaway every week, which are given away to homeless charities and handed out to people in need by the family.\n\"I said to my father, we need to do something to help people because in Weston they're really struggling,\" Ms Ahmed said.\nShe added: \"Anyone can come in, I won't judge, if you need it you need it - you don't need to explain anything to me.\n\"You don't know what someone is going through, so I don't judge a face being like 'you don't need food' - I let anyone come in.\"\nMs Ahmed, a law student at Bath Spa University, said it was during the coronavirus pandemic that she first noticed food poverty in Weston-super-Mare.\n\"It's more than a free meal for many,\" she said.\n\"I have helped people by giving them food but now when they come they don't just see me, they see new friends that they have through me making the charity.\"\nThe charity hands out 100 to 125 meals to people every Wednesday evening and a similar amount throughout the week to homeless shelters.\nVolunteers also deliver meals to homes if someone is unable to pick one up in person and the charity also works with local schools.\nHer father, Mr Ahmed, said: \"The children always helped me out with charity work from a young age.\n\"But when Aishah said she wanted to do her own charity, I said I would help her to cook and supply the food.\"\nA team of volunteers also helps, including Kacper Smeja, who said the charity had inspired him.\n\"I never really had a lot of money myself but you don't need money to help others.\n\"This has helped me learn you can help others no matter your situation,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c0k5xgjndp5o"}