{"authors": ["Ewan Gawne", "www.facebook.com"], "date_download": "2025-04-26 06:33:42", "date_modify": "2025-04-26 06:33:42", "date_publish": "2025-02-27 06:36:51", "description": "Lauren Patel says she thought she \"dreamt it\" when her agent said she had been invited to Hollywood.", "filename": "news_articles_c62k6qxwz1ko_1745649222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3787/live/548c6e40-f45d-11ef-ac82-1dbe36371215.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62k6qxwz1ko_1745649222.html", "title": "Wallace and Gromit: PC Mukherjee's ready for 'insane' Oscars trip", "title_page": "Wallace and Gromit: PC Mukherjee's ready for 'insane' Oscars trip - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The actor who voiced the plucky PC Mukherjee in the latest hit Wallace and Gromit film has said she is pinching herself ahead of a \"quite insane\" trip to the Oscars.\nLauren Patel starred in the BAFTA-winning Vengeance Most Fowl and will travel with cast and creators to the ceremony in Hollywood after the film was nominated for an Academy Award.\nThe long-awaited return of the animated stop-motion franchise from Aardman Animation was watched by 20 million people when the film aired on BBC One on Christmas Day.\nThe 23-year-old, whose character was a firm favourite with fans of the film, said the audience response had been \"so above and beyond what I thought it was going to be\".\nShe told BBC Radio Manchester being involved in the film was an \"incredible experience\", but added that the Oscars call came as a surprise.\n\"I woke up, I had like that horrible flu that had been going around and I just had a text from my agent saying, 'oh, you're going to the Oscars in like two weeks',\" she said.\n\"And I thought I dreamt it in my weird, ill state.\n\"I don't even really know how it works.\n\"And at this point I'm not questioning it. I'm just hoping they'll let me in when I show up.\"\nThe Bolton actor's turn as PC Mukherjee was a high point in the hilarious outing, as the intrepid new PC was central to the plot, helping the iconic title characters track down their penguin nemesis, the master of disguise Feathers McGraw.\nThe film also featured the vocal talents of Patel's fellow Boltonian, comedian Peter Kay, who voiced PC Mukherjee's superior, Ch Insp Mackintosh.\nCreator and Preston-born Nick Park and his Bristol-based Aardman Animations team have already won four Oscars, so Patel said hopes were high that they would add to that achievement.\n\"The team are so insanely talented and their minds are brilliant and the script is so witty and so fun,\" she said.\n\"It made it such an enjoyable job to work on [and they are] also just all lovely people.\n\"They've got Oscars and they're very successful, they're very well known.\n\"But they're all just really lovely, down to earth people who just want to make the film as good as it can be.\"\nThe trip to the Oscars comes three years after Patel landed her first role in coming-of-age musical drama Everybody's Talking About Jamie.\nThat success came just days after she was rejected by a number of drama schools and she said she got the part in an open online audition.\nSince then, she said she \"fell head first\" into the industry, which was \"kind of mental\", and she recently joined the cast of BBC drama Waterloo Road for the latest series.\nShe said becoming a professional actor was a dream come true.\n\"I never thought that I would be able to do it professionally in this capacity,\" she said.\n\"I was like, 'oh, maybe I'll go to drama school and then in like 10 years, I'll get a little bit on the telly and, and that'll be great'.\n\"And I'll maybe do some community theatre because that's really fun.\n\"But yeah, it's mad. I can't believe it.\n\"Everyone who has ever met me as a child would know that I loved singing and dancing and attention.\"\nShe said she was excited about every aspect of her trip and had chosen her all-important red carpet outfit.\n\"I wanted to find something that I felt really good in, that I felt represented who I was and I think I found that,\" she said.\nHowever, she added that she would keep the exact details of the outfit \"under wraps\".\nAbove everything else though, she said there was one thing she was really looking forward to.\n\"I'm really excited to see Raye perform,\" she said.\n\"I love her so much and I've never seen her live and the first time I'm going to see her is at the Oscars, which is mental.\"\nThe 97th Academy Awards will be held in Hollywood, Los Angeles, on Sunday. Coverage will be on the BBC News website.\nYou can watch Wallace & Gromit: Vengeance Most Fowl on BBC iPlayer.", "url": "https://www.bbc.co.uk/news/articles/c62k6qxwz1ko"}