{"authors": ["Jonathan Head, Lulu Luo and Thanyarat Doksone", "www.facebook.com"], "date_download": "2025-04-26 07:49:28", "date_modify": "2025-04-26 07:49:28", "date_publish": "2025-02-26 22:34:29", "description": "The camps are unsanitary, food barely sufficient, and many of those being held are in poor health.", "filename": "news_articles_c5yr7j18edjo_1745653768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cac7/live/60c82030-f4b9-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yr7j18edjo_1745653768.html", "title": "Myanmar scam centres: Thousands who have been freed are now stuck in camps", "title_page": "Myanmar scam centres: Thousands who have been freed are now stuck in camps - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I swear to God I need help,\" said the man quietly on the other end of the line.\nThe Ethiopian, who calls himself Mike, said he is being held with 450 others in a building inside Myanmar, along the country's border with Thailand.\nThey are among the thousands of people who have been freed from the notorious scam compounds that have thrived on the border for years, in what appears to be the toughest action so far against the industry along the Thai-Myanmar border.\nBut many of them are now stranded in Myanmar in makeshift camps because the process of assessing them and arranging flights back to their own countries is so slow.\nThe armed militia groups who are holding them have a very limited capacity to support so many people – more than 7,000. One of them has said they have stopped freeing people from the compounds because they are not being moved to Thailand fast enough.\nThe BBC understands that conditions in the camps are unsanitary, food barely sufficient, and many of the freed workers, like Mike, are in poor health. He is suffering from panic attacks, after working for a year in a scam centre where he was routinely beaten.\nHe told us they got two very basic meals a day, there were only two toilets for 450 people, who he said were now relieving themselves wherever they could.\nMike is one of an estimated 100,000 people who are believed to have been lured to work in the scam operations along the Thai-Myanmar border, most of them run by Chinese fraud and gambling operatives who have taken advantage of the lawlessness in this part of Myanmar.\nDespite horrifying accounts of abuse from those who escaped in the past, thousands still come from parts of the world where good jobs are scarce, enticed by promises of good money.\nChina, where many of the scam victims come from, has acted to shut down scam operations along its own border with Myanmar, but until this year neither China nor Thailand had done much about the Thai-Myanmar border.\nAriyan, a young man from Bangladesh, has come back to Thailand to try to help 17 friends who are still there. He said he made a promise to himself to do this after his own gruelling escape from one of the most notorious scam centres last October.\nHe showed us a brief, shaky video of the compound, still under construction in a remote, forested valley, where he was held, and remembers the terrible treatment he and his friends suffered at the hands of their Chinese boss.\n\"They gave us a target every week, $5,000. If not, they gave us two electric shocks. Or they put us in a dark room, with no windows. But if we earned a lot of money, they were very happy with us.\"\nAriyan had to approach men in the Middle East and lure them into transferring funds to fictitious investments. Using AI, the scammers made him appear on the screen to be an attractive young woman, altering his voice as well.\nHe says he hated doing it. He remembers one man who was willing to sell his wife's jewellery to fund the fraudulent investment, and wishing he could warn him. But he said the bosses monitored all their calls.\nThe release of the scam workers started more than two weeks ago after Thailand, under pressure from China and some of its own politicians, cut power and telecommunications links to the compounds on the border.\nIt limited banking access to the scam bosses and issued arrest warrants for some of the militia leaders who had been protecting the business.\nThat hit the business, but it also hit the ordinary Karen people who live nearby even harder, putting pressure on the militia commanders to show willingness in ending the abuses in the scam centres. They began helping those trying to escape, and completely evacuating some compounds.\nThe camp Mike is housed in is now being guarded by the Democratic Karen Benevolent Army, DKBA, a breakaway insurgent faction of the ethnic Karen community.\nUntil recently, it was protecting the many scam compounds which have sprung up in its territory. You can see them easily as you drive along the Moei River which divides the two countries - unlikely expanses of new buildings over in war-torn Karen State contrasting with the rural landscape on the Thai side of the border.\nThailand insists it is moving as fast as it can to process the former scam workers and get them home.\nA group of 260 freed workers were brought over the Moei River on a raft earlier this month. And around 621 Chinese nationals were flown straight back to China with a police escort on chartered planes. Otherwise, the movement of freed workers to Thailand seems to have stalled.\nThe problem is that they are from many different countries, some of which are doing little to help get their people home. Around 130 of the first 260 who came over are from Ethiopia, which does not have an embassy in Bangkok.\nThe BBC has been told that some other African countries will only fly their people home if someone else pays. Most of the freed workers have nothing; even their passports were withheld by the compound bosses.\nThailand fears bringing over thousands of people it will then have to look after indefinitely. It also wants to screen them to find out which are genuine victims of human trafficking and which may have committed criminal acts, but does not have the capacity to do this with such a large group of people.\nDifferent ministries and agencies, including the army, are involved in managing this problem, and have to agree who does what. It does not help that several senior police and immigration officers have been transferred over their alleged involvement in the scam business.\n\"If this issue is not resolved, then we will not stop working on it – we must work seriously,\" said Thai Prime Minister Paetongtarn Shinawatra on Tuesday in Bangkok. But she was referring to the wider problem of the scam business, not the growing humanitarian crisis among the freed workers.\n\"Unfortunately, it seems we're in a bit of a standstill,\" says Judah Tana, an Australian who runs an NGO which has for years been helping the victims of trafficking in the scam centres.\n\"We are hearing distressing information about the lack of sanitation and toilets. Many of the 260 who already came were screened for TB and tested positive. We are hearing from those who are still inside that people are coughing up blood. They are very happy that they have been liberated from the scam compounds, but our worry is that we're not engaging fast enough.\"\nThailand now seems ready to bring over one group of 94 Indonesians, as their embassy has been pushing for their release for several days and has booked flights to Indonesia for them.\nBut that still leaves more than 7,000 still inside Myanmar, unsure what will now happen to them.\nMike told me he and many others with him feared that if they are not allowed to cross into Thailand soon, the DKBA may hand them back to the scam bosses, where they could face punishment for trying to leave.\nOn Wednesday night his panic attacks and breathing were so bad, he said, they took him to hospital.\n\"I just want to go home,\" he said over the phone. \"I just want to go back to my country. That is all I am asking.\"", "url": "https://www.bbc.co.uk/news/articles/c5yr7j18edjo"}