{"authors": ["Stuart Harratt", "www.facebook.com"], "date_download": "2025-04-26 07:29:59", "date_modify": "2025-04-26 07:29:59", "date_publish": "2025-02-27 18:07:01", "description": "Karl Abbott, 37, posed as a teenage boy in an attempt to get the child to send him sexual images.", "filename": "news_articles_cjevvdy7n5go_1745652599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dfd8/live/d92c97d0-f528-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjevvdy7n5go_1745652599.html", "title": "Lincolnshire man jailed for sending explicit pictures to child", "title_page": "Lincolnshire man jailed for sending explicit pictures to child - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who posed as a teenage boy to send explicit pictures to a 13-year-old has been jailed.\nKarl Abbott, 37, requested sexual images in return from the victim, Lincolnshire Police said.\nAfter he was arrested in October 2022, forensic officers took 12 months to break into his digital devices after Abbott refused access to them.\nA stash of illegal images were found, the force said.\nAbbott, of Blades Drive in Saxilby, pleaded guilty to five charges including the possession of indecent images of categories A, B and C, sexual communication with a child and inciting a child into pornography.\nHe was jailed for two years and eight months at Lincoln Crown Court on Thursday.\nPolice said that Abbott, who worked as a photographer, changed his name during the investigation to James Smith.\nDet Con Warwick Taylor said he hoped the prison sentence \"goes some way to bringing the case to a close in the mind of the victim\".\n\"Children are often the most vulnerable people in our society and Abbott chose to abuse the trust placed in him by a young child,\" he said.\n\"His actions have no place in our county or our society at large and we hope this sends a strong warning to any would-be offenders – this behaviour will not be tolerated.\"\nListen to highlights from Lincolnshire on BBC Sounds, watch the latest episode of Look North or tell us about a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cjevvdy7n5go"}