{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:39", "date_modify": "2025-05-19 14:45:39", "date_publish": "2015-02-10 18:37:59", "description": "The Scottish government is sending in a support team to help cut A&E waiting times at the Royal Alexandra hospital in Paisley.", "filename": "news_uk-scotland-glasgow-west-31383227_1747665939.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80919000/jpg/_80919599_80917975.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-glasgow-west-31383227_1747665939.html", "title": "Support team to tackle A&E wait times at Royal Alexandra Hospital", "title_page": "Support team to tackle A&E wait times at Royal Alexandra Hospital - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Scottish government is sending in a support team to help cut accident and emergency waiting times at the Royal Alexandra Hospital in Paisley.\nUnscheduled care managers will work with hospital staff to identify ways to speed up treatment.\nIn January, it emerged one patient had waited 20 hours for a bed.\nThe head of NHS Scotland apologised to patients and said it had been a \"challenging winter\" for A&E departments across Scotland.\nChief executive Paul Gray said: \"I recognise that all staff have been working extremely hard in our NHS to ensure patients get the best possible care.\n\"However, I'm concerned that performance is not recovering as quickly as it should at the Royal Alexandra Hospital and it is clear to me, through our performance monitoring and management, that the board needs support to help them ensure patients are seen and treated in A&E within the appropriate timescale.\"\n\"Having discussed this with the board chief executive in line with our normal escalation procedures, I have today provided specialised support to work with NHS Greater Glasgow and Clyde to deal with the current level of demand, and an extended support team will be in place at the beginning of next week.\n\"This action will help identify issues where they exist and prioritise actions that can be taken to improve A&E performance.\"", "url": "https://www.bbc.com/news/uk-scotland-glasgow-west-31383227"}