{"authors": ["Karl Mercer", "www.facebook.com"], "date_download": "2025-04-26 07:07:50", "date_modify": "2025-04-26 07:07:50", "date_publish": "2025-02-28 05:58:51", "description": "After pregnancy caused Rebecca Willmont to lose her hearing, she can now hear her two-year-old thanks to London surgeons.", "filename": "news_articles_ckgnnzjljnro_1745651270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9915/live/fcf9a1d0-f528-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgnnzjljnro_1745651270.html", "title": "'Hearing loss surgery opened up the world again'", "title_page": "Otosclerosis: 'Hearing loss surgery opened up the world again' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"It's just opened up the world again... you don't realise half the things you're missing out on until you can hear again,\" says Rebecca Willmont, from west London.\nThe 31-year-old is two weeks on from surgery that allowed her to properly hear her two-year-old son Harry for the first time.\n\"He's very loud,\" she laughed, as her toddler son belted out the theme tune to Fireman Sam in their South Ruislip home.\n\"Before the operation, the thing I really wanted was to properly hear him laugh and play.\"\nWhile pregnant, Ms Willmont developed a condition called otosclerosis which is when one of the bones in the ear hardens and fuses together, causing hearing to deteriorate.\nIt is thought to affect about three in 1,000 people, but it is not yet understood why the condition can be triggered in pregnancy.\nWhen Harry was born, it meant Ms Willmont could not hear him properly, was unable to hear the baby monitor and was worried that his development would be affected by her condition.\nBut a team at Northwick Park Hospital in north-west London fixed that with an operation called a stapedotomy. It carries out about 50 of the operations each year.\nDuring the procedure, Ms Willmont's fused bones were separated using a laser and the body's smallest bone, the stapes, was removed.\nIn its place, surgeon Bhavesh Patel inserted a small prosthesis which meant the small bones in the ear could vibrate again and transmit sound to the inner ear.\nMs Willmont was only under a local anaesthetic, so was awake throughout which meant Dr Patel could talk her through what he was doing and check that the operation had worked.", "url": "https://www.bbc.co.uk/news/articles/ckgnnzjljnro"}