{"authors": ["George Thorpe", "www.facebook.com"], "date_download": "2025-04-26 04:30:51", "date_modify": "2025-04-26 04:30:51", "date_publish": "2025-03-03 06:18:17", "description": "A deputy says the government is not being clear enough about what money is being spent on the lido.", "filename": "news_articles_c98493np6q8o_1745641851.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9683/live/6b7da950-f770-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c98493np6q8o_1745641851.html", "title": "Transparency calls over Jersey lido costs", "title_page": "Transparency calls over Jersey lido costs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Demands have been made for Jersey ministers to be more open about how money has been spent on a lido.\nDeputy David Warr said he felt the island's government needed to be more transparent about how much repairing and maintaining the Havre des Pas in St Helier is costing.\nHe said it was becoming very hard to trace how the maintenance budget for the lido - which looks set to go over the £500,000 mark - was being spent.\nInfrastructure Minister Andy Jehan said the government was being transparent and work was ongoing while the search for someone to take over running the lido continued.\nAt a recent States of Jersey sitting, Mr Warr asked about the costs for the lido.\nIt was revealed £495,102 of capital expenditure had been committed so far to the site and a further £76,534 was still to be spent.\nMr Warr said he felt it was beholden on him to quiz ministers on the budget.\nHe said: \"In the private sector, you would have a fixed contract and fixed price, so why are the States and Jersey Property Holdings, external any different to anybody else out there?\n\"I think they should be held accountable and much more transparent.\n\"If they were more transparent, I wouldn't have to be asking the questions that I'm asking.\"", "url": "https://www.bbc.co.uk/news/articles/c98493np6q8o"}