{"authors": ["Khanyisile Ngcobo & Mayeni Jones", "www.facebook.com"], "date_download": "2025-04-26 03:50:08", "date_modify": "2025-04-26 03:50:08", "date_publish": "2025-03-05 13:03:49", "description": "Lesotho says it is surprised by Trump's comments given its \"warm and cordial\" relations with the US.", "filename": "news_articles_c0q18x0192yo_1745639408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/df50/live/73822100-f9cb-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q18x0192yo_1745639408.html", "title": "Lesotho shocked by Donald Trump's remarks that 'nobody has heard of the country'", "title_page": "Lesotho shocked by Donald Trump's remarks that 'nobody has heard of the country' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lesotho's government says it is shocked by US President Donald Trump saying that \"nobody has ever heard of\" the southern African nation.\nTrump, addressing the US Congress in his first speech since his return to the Oval Office, made the reference as he listed cuts made to what he said was wasteful expenditure.\n\"Eight million dollars to promote LGBTQI+ in the African nation of Lesotho, which nobody has ever heard of,\" Trump said, eliciting laughter from some US lawmakers.\nA spokesperson for Lesotho's foreign affairs department told the BBC that Lesotho enjoyed \"warm and cordial\" relations with the US.\nLesotho is one of the biggest beneficiaries of the US's African Growth and Opportunity Act (Agoa), which gives favourable trade access to some countries to promote their economic growth.\nAccording to the US government, the two countries traded goods worth $240m (£187m) in 2024, mostly exports from Lesotho to the US, in particular textiles and clothing.\nLesotho's Foreign Affairs Minister Lejone Mpotjoane said it was \"shocking\" to hear a head of state \"refer to another sovereign state in that manner\".\n\"To my surprise, 'the country that nobody has heard of' is the country where the US has a permanent mission,\" Mpotjoane told the BBC.\n\"Lesotho is a member of the UN and of a number of other international bodies. And the US has an embassy here and [there are] a number of US organisations we've accommodated here in Maseru.\"\nHe later told the AFP news agency: \"We are not taking this matter lightly,\" adding that they would send an official protest letter to Washington.\nOfficials dismissed Trump's remarks as \"off the cuff\" and a \"political statement\", adding that they were \"uncalled-for\" given the good relations between the two nations.\n\"We maintain very warm and cordial relations with the US. They've got a mission in Maseru and we also have [one] in Washington,\" foreign affairs spokesperson Kutloano Pheko told the BBC.\nMr Pheko was unable to confirm Trump's comments on the funding that went to LGBTQ organisations, saying that as the money went directly to them, they would be best placed to comment.\nMpotjoane, on his part, confirmed that the country had been affected by Trump's sudden decision to pause aid funding to countries around the world.\nMany organisations, mostly non-governmental, were thrown into chaos after the Trump administration announced a permanent end to the US President's Emergency Plan for Aids Relief (Pepfar) funding as part of a wider cost-cutting drive to reduce US government spending.\nPepfar was launched in 2003 by then US President George W Bush and its finances are distributed via the US government's main overseas aid agency USAID, whose funding has also been cut.\nLesotho is among those countries that benefited from Pepfar, its health ministry told South African publication GroundUp in February, with TB and HIV programmes among those receiving the critical funds.\nBut Mpotjoane declined to criticise this decision, saying it was the US's \"prerogative to cut aid if they want to\".", "url": "https://www.bbc.co.uk/news/articles/c0q18x0192yo"}