{"authors": ["Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 04:20:57", "date_modify": "2025-04-26 04:20:57", "date_publish": "2025-03-03 15:22:13", "description": "One phlebotomist says it is \"getting harder and harder to pay the bills\".", "filename": "news_articles_cz613egnpneo_1745641257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3e81/live/38a7f9f0-f841-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz613egnpneo_1745641257.html", "title": "NHS staff to strike over pay and grading", "title_page": "Gloucestershire NHS staff to strike over pay and grading - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Some NHS workers are set to strike at two hospitals over a \"pay and grading\" dispute.\nUnison confirmed that 37 phlebotomists, who take patients' blood samples, at Cheltenham General Hospital and Gloucestershire Royal Hospital voted for three days of strike action, which will begin on 17 March.\nChris Roche, the union's regional organiser, said: \"The NHS Trust has had over 12 months to resolve this issue but has repeatedly missed deadlines.\"\nA Gloucestershire hospital trust spokesperson advised patients to access hospital services in \"the usual way unless they hear from us directly\".\nUnion organisers said the \"complex nature\" of the phlebotomists' work should put them on Band 3 pay.\nHowever, phlebotomists are currently paid £12.08 per hour \"despite their expertise and vital role in patient treatment, with some having worked in the NHS for more than two decades\", the union added.\nMr Roche said: \"Phlebotomists deserve to be paid fairly for the skilled work they do.\n\"NHS staff want to be at work giving patient care. The trust can still do the right thing to prevent the disruption this strike will cause.\"\nCaroline Hayhurst, a phlebotomist at Cheltenham General Hospital, said it was time \"our pay and grading reflected the responsibilities of the role\".\n\"I do this job because I love it, but it's getting harder and harder to pay the bills,\" Ms Hayhurst said.\n\"Few people realise the skills and experience it takes to be a phlebotomist until they need one.\"", "url": "https://www.bbc.co.uk/news/articles/cz613egnpneo"}