{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 07:11:50", "date_modify": "2025-05-21 07:11:50", "date_publish": "2025-03-30 00:00:00", "description": "Former archbishop of Canterbury Justin Welby and Tory MP Alex Burghart are also on today's show.", "filename": "news_live_cdrxr3en54dt_1747811510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/56e9/live/aef2b340-0d3e-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cdrxr3en54dt_1747811510.html", "title": "Home Secretary Yvette Cooper, Justin Welby, Alex Burghart quizzed", "title_page": "Home Secretary Yvette Cooper, Justin Welby, Alex Burghart quizzed - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Home Secretary Yvette Cooper faces questions from Kuenssberg\nMatt Spivey\nLive editor\nGood morning and welcome to our coverage of this week's installment of Sunday with Laura Kuenssberg.\nThe home secretary, Yvette Cooper, is set to be quizzed just days after Chancellor Rachel Reeves gave her Spring Statement. If you need a recap of what the chancellor announced, our political correspondent Henry Zeffman has a handy video of everything you need to know in less than a minute.\nAlso on Laura's show this week is the former archbishop of Canterbury Justin Welby.\nTory MP Alex Burghart is also joining Laura on the show, he made headlines after his last appearance on the show earlier this year when he said Reform \"wants to destroy\" his party.\nThis morning, we will be running a stream-only page, which means we will not be providing regular text updates.\nAlthough you will still be able to follow along with the show right here, just click Watch live at the top of this page from 09:00 BST.\nBefore the show gets under way, there's just enough time to put the kettle on, get comfy and catch up on what has been a busy week in UK politics:\nSpring Statement 2025: Key points at a glance\nConservatives blame lower GDP forecast on Chancellor's decisions\nUK would not hesitate to retaliate against US tariffs - No 10 sources\nReform UK launches 'most ambitious' local election campaign", "url": "https://www.bbc.com/news/live/cdrxr3en54dt"}