{"authors": ["Katty Kay", "www.facebook.com"], "date_download": "2025-05-19 14:57:06", "date_modify": "2025-05-19 14:57:06", "date_publish": "2015-03-03 00:39:53", "description": "The BBC's Katty Kay spends a few days back in London and realises just how much the British misunderstand America", "filename": "news_world-us-canada-31703520_1747666626.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81355000/jpg/_81355672_469877037.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31703520_1747666626.html", "title": "How the British misunderstanding of America is growing", "title_page": "How the British misunderstanding of America is growing - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I've just come back from a few days in London where I had the chance to grill a few Americans - officials and non officials - on what they find tricky about explaining their country to my country.\nIt's something that perpetually intrigues because the longer I live in America, the more different I think our two nations are and the more I feel Brits misunderstand the US, and vice versa.\nInterestingly, the hardest things to reconcile seem to be America's role in the world, what it should and should not be, and America's relationship with guns.\nOne American businessman suggested he felt he was repeatedly tripped up by the continuing resentment of the invasion of Iraq which still sours British perceptions of America.\nHistorians will look back and suggest Europe's post-Cold War love affair with the US was short and clearly ended with shock and awe over Baghdad.\nWhat's less clear to Brits is what they want from America today.\nOffer them the alternative scenarios of US intervention in places like Syria and and Ukraine and no US intervention and they are divided on which they prefer (obviously the more pertinent choice is between smart and not-smart intervention).\nOn that ever thorny issue of guns, as we see yet another headline shooting, I have all but given up trying to explain America's gun culture to Brits. So it was intriguing to hear how one US official is wrestling with it too.\nHe posed an interesting question, which I couldn't really answer, so I'd love your thoughts.\nIs there something Brits feel emotionally protective of, in the same way that Americans feel about the right to bear arms, whose application is not always socially beneficial in practice?\nIt's a good question and would help me translate something so many Europeans just find incomprehensible.\nIt is always good to go back to London - and to see America again from the outside - even if it did rain a lot.", "url": "https://www.bbc.com/news/world-us-canada-31703520"}