{"authors": ["Marc Waddington", "www.facebook.com"], "date_download": "2025-04-26 04:41:27", "date_modify": "2025-04-26 04:41:27", "date_publish": "2025-03-02 07:08:40", "description": "Famously written off in the 1980s, the Merseyside seaside town is now described as being \"on the up\".", "filename": "news_articles_cd65jyl506vo_1745642487.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d309/live/9aad9880-f6bb-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65jyl506vo_1745642487.html", "title": "New Brighton: A seaside town seen through a different lens", "title_page": "New Brighton: A seaside town seen through a different lens - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I grew up round here thinking I could not wait to get out,\" says 51-year-old Dan Davies.\n\"And then I used to come back up from London on a weekly basis and would see half the place boarded up and going downhill fast.\"\nNew Brighton, on the northern tip of the Wirral peninsula in Merseyside, was once a booming holiday destination boasting the longest promenade in the country, a pier and a tower bigger than Blackpool's.\nBut in the mid-1980s, after cheap package deals to Spain had become the first choice for many holidaymakers, New Brighton found itself struggling to keep up, and photographer Martin Parr's famous 1986 collection The Last Resort depicted it as a scruffy, litter-strewn town whose glory days were behind it.\nFran Barrett, 35, returned to New Brighton after going away to London to study and work as a journalist.\n\"When you're a kid you never want to live where you're growing up,\" she said.\n\"But I realised as I got older why it was such a great place to live.\"\nWhile many of Fran's friends who stayed in London were still trying to get on the property ladder, she and her husband and toddler son were able to move up a rung in 2021 because of the £30,000 they made in profit on their terraced home.\n\"It just has a real community feel to it,\" said Fran.\n\"There are so many new businesses springing up, and if you've got kids there are so many great little parks.\n\"A lot of my friends from other parts of the Wirral are moving here, too.\"\nAnd they all need places to eat, drink and shop.\nFran's sister Lou runs the café bar and gift shop SUP, just one of many independent businesses that have sprung up in the town in recent years.\nA few hundred yards away from SUP is the James Atherton pub, which takes its name from the resort's founder who, in the 1830s, set about creating a northern version of Sussex seaside town Brighton.\nThe pub made national headlines in 2020 when it was renamed in a disparaging tribute to Boris Johnson, Matt Hancock and Dominic Cummings and their three-tier coronavirus lockdown restrictions.\nIt is one of a number of buildings in Victoria Road that Dan's company Rockpoint Leisure revived.\nTo \"keep out the big boys\", as he puts it, the company bought up parcels of land and buildings and made sure independent shops, cafes and art spaces were able to move in.\nThe walls of many of them are now festooned with large murals by artists both local and global.\n\"We wanted to demonstrate that you don't need big outside consultants to come in and tell you what you need, you need a sustainable plan that can protect a place like New Brighton.\n\"We did that, and we have become the number one model for seaside town regeneration,\" he says.\nJust up the road is Tallulah's Emporium, which owner Wayne Saunders describes as a \"listening space\" after the model of the Japanese kissa bars that specialise in playing jazz records.\nWayne, 51, left New Brighton in 1989, at a time when \"numerous friends from primary school had ended up dead or in prison\".\nHe moved to London, where he opened the Comedy Café in Shoreditch, before returning to New Brighton to open up Tallulah's in 2022.\nHe agrees with Dan's assessment that New Brighton is, with its thriving independent scene, \"Wirral's Brooklyn to Liverpool's Manhattan\".\nThere are not many remnants of New Brighton's past as a Victorian and Edwardian seaside town still visible today.\nThe tower was pulled down and sold for scrap in the 1920s, while the ballroom was gutted by fire in 1969 and then demolished.\nBut the town has always remained a seaside resort.\nIn 2011, the Marine Point development opened at an estimated cost of about £65m, bringing a cinema, hotel, bars and restaurants to the seafront.\nIt stands a short distance from the Fort Perch Rock coastal defence battery – now a museum – which was built in the 1820s to protect Liverpool from foreign naval attack, and the Adventureland amusement complex which was built about 100 years later and which has been mooted for redevelopment as apartments in recent years.\nJayne Casey, a former member of punk band Big In Japan, now runs a small deli and arts bar District House just around the corner in Victoria Road.\nNow 68, she remembers the New Brighton of the 1980s that was encapsulated in Parr's Last Resort collection, and believes that, generally, the photos captured the area quite well.\n\"It was where people from Liverpool and the Wirral came for a cheap day out,\" she says.\n\"It had a beautiful 1930s outdoor swimming pool, and had that classic seaside town look to it.\n\"It was a place that working-class people came en-masse in the time when the factories closed down for a week and everyone had a week at the seaside.\"\nToday the resort is still popular with day trippers and families.\nAnd according to one person who was involved in its regeneration over the last decade, attempts to broaden what the town had to offer were not always met with open arms.\n\"There was a feeling from some that New Brighton is just about grandparents bringing their grandkids for day out,\" they said.\n\"But there were those who felt it was about more than just Fort Perch Rock and the promenade.\"\nJane, who helped transform a wilderness of empty warehouses near the Liverpool waterfront into the arts and tech enclave now known as the Baltic Triangle, says that while art and culture are playing a big part in New Brighton's renaissance and transformation, the town is not being \"gentrified\".\nGentrification is the process through which working-class urban populations find themselves displaced and priced out of their own communities.\n\"Yes, house prices have gone up and new people have come in but I don't think any kind of mass gentrification has happened,\" she says.\n\"But,\" she warns, \"there are some big sites that could come up and then could become apartment blocks and flats.\"\nNew Brighton's promenade – the longest in Britain – will be most familiar to those outside the north-west of England as the location of a Channel 4 ident that includes the TV network's logo running to keep pace with a group of wheelchair racers.\nNext month, the documentary I Am Martin Parr will be screened at The Light cinema, part of the Marine Point complex which looms over the promenade where that clip was filmed and where one of Parr's most infamous shots was taken.\nJose Wilmin, who has been coming to New Brighton for more than 60 years from her home in Ellesmere Port, has witnessed the resort going through its ups and downs in that time.\n\"It used to be a proper holiday place, there was a massive outdoor pool, a big funfair and the main street was just packed with bucket-and-spade shops,\" the 68-year-old says.\nWhile she says it is great to see New Brighton \"on the up again\", she has been a regular through good times and bad.\n\"I've always come here, to have fish and chips and watch the world go by.\n\"It's where I used to come with my mum. It's where all my memories were made.\"", "url": "https://www.bbc.co.uk/news/articles/cd65jyl506vo"}