{"authors": ["Joe Willis", "www.facebook.com"], "date_download": "2025-04-26 03:59:33", "date_modify": "2025-04-26 03:59:33", "date_publish": "2025-03-04 06:10:47", "description": "North Yorkshire Council is consulting on plans to boost the number of wheelchair-accessible taxis.", "filename": "news_articles_c86p1n9dq0lo_1745639973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6f6b/live/3a6a9b10-f84d-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86p1n9dq0lo_1745639973.html", "title": "North Yorkshire taxi drivers urge more research on accessible taxi rules", "title_page": "North Yorkshire taxi drivers urge more research on accessible taxi rules - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has been urged to carry out further research before introducing rules to increase the number of wheelchair-accessible taxis.\nNorth Yorkshire Council is proposing to only allow new taxi registrations for wheelchair-accessible vehicles (WAV), electric or potentially hybrid vehicles.\nRichard Fieldman, of the North Yorkshire Taxi Drivers group, warned the change could lead to a shortage of taxis, suggesting the council had done \"no research at all other than look at what other councils have done\".\nGreg White, the council's executive member for licensing, said \"we know that we can do better\" in improving WAV provision in rural areas.\nThe council launched a consultation on its proposals, which runs until 30 April.\nIt licenses about 70 WAV taxis, representing about one for every 9,000 residents.\nBut it said other rural authorities have one WAV for every 2,000 to 3,000 people.\nTo reach a similar ratio, the council would need to license an extra 200 WAVs, according to the Local Democracy Reporting Service.\nRipon-based Mr Fieldman, who represented about 100 group members, warned the policy change could damage the trade.\n\"The policy isn't going to create more wheelchair vehicles, all it's going to do is put a lot of people out of the trade,\" he said.\n\"A lot of drivers like me who are in their 60s won't make that kind of investment needed to buy a WAV.\n\"They'll just retire early or go find another job.\"\nThe taxi driver is calling for further research to find out the true demand for taxis across North Yorkshire.\nMr Fieldman said taxi drivers would like to be allowed to use Euro 6 petrol and diesel cars, which meet strict EU emissions standards.\nThe Disability Action Yorkshire urged the public to contribute to the consultation.\nJackie Snape, the charity's chief executive, said: \"For disabled people, the provision of wheelchair-accessible licensed taxis across the district is low, and the alternatives are expensive specialist private hire vehicles which are beyond the means of most.\"\nWhite said the authority recognised the difficulties that passengers who need accessible vehicles faced.\n\"It can affect their mental health and leave them isolated, so we need to ensure the trade serves everybody, regardless of age, disability, gender, race, religion or sex,\" he said.\n\"We recognise that taxis should be accessible to all and we need to strike a balance that supports users and is feasible for the trade to adopt.\"", "url": "https://www.bbc.co.uk/news/articles/c86p1n9dq0lo"}