{"authors": ["Catherine Nicoll", "www.facebook.com"], "date_download": "2025-04-26 03:45:57", "date_modify": "2025-04-26 03:45:57", "date_publish": "2025-03-05 06:08:25", "description": "Tynwald members are asked to support additional funding to cover Manx Care's spending for 2024-25.", "filename": "news_articles_cd65ggqg03jo_1745639157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e518/live/12e10590-f90e-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd65ggqg03jo_1745639157.html", "title": "Tynwald approval sought for additional £20m healthcare overspend", "title_page": "Tynwald approval sought for additional £20m healthcare overspend - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tynwald will be asked to approve £20m in additional funds to cover and overspend on health services over the past year.\nManx Care had previously confirmed it was facing a budget deficit of about £15m for the 2024-25 financial year.\nAt the March siting of the parliament, the Treasury Minister will ask politicians to support the extra spending by the Department of Health and Social Care.\nThe healthcare provider rolled back on a series of planned cuts to procedures after receiving £800,000 for the Treasury.\nThat allowed for the reinstatement of some on-island election surgery however it said a \"pause\" on non-urgent off-island appointments would still go ahead.\nThe health department said the additional funding would be allocated to Manc Care to cover it mandated services and add to its operating budget of £347m in 2024-25.\nThe department said despite a £44m increase in the allocated budget from the previous year, Manx Care continued to \"experience significant financial pressures\".\nRises in costs included additional staff pay awards and recruitment into key vacancies, the introduction of new services, and a 4% rise in the drugs bill, which included \"significant\" cost increase for cancer, rheumatology, renal, gastroenterology, and cystic fibrosis treatments.\nThe department said an 8% rise in tariffs imposed by UK NHS providers for off-island care, and a 4% inflationary increase on contracts due for renewal also placed a burden on Manx Care finances.\nAs well as the reported overspend so far, the £20m figure included £5.35m to mitigate for the risk of increases in costs and spending during the remainder of the financial year.\nThe row about overspending by Manx Care and the cuts required to balance the budget for the year saw former minister Lawrie Hooper, who argued the arm's length healthcare provider was \"underfunded\", resign his post in October.", "url": "https://www.bbc.co.uk/news/articles/cd65ggqg03jo"}