{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:36:20", "date_modify": "2025-05-19 15:36:20", "date_publish": "2015-02-13 17:08:34", "description": "A selection of photographs from around the African continent this week.", "filename": "news_world-africa-31440440_1747668980.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80962000/jpg/_80962863_sapeurkinshasa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31440440_1747668980.html", "title": "Africa in pictures: 6-12 February 2015", "title_page": "Africa in pictures: 6-12 February 2015 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A \"sapeur\" poses on Tuesday in the Democratic Republic of Congo's capital, Kinshasa, as he marks the 20th anniversary of the death of their movement's founder Stervos Niarcos Ngashie...\nLa Sape - a cult of appearance - is known for its flamboyant style of dressing. It was meant to defy then-Zaire's ruler Mobutu Sese Seko who ordered people to wear traditional African clothes.\nTwo days earlier in northern Nigeria's main city, Kano, traditional regalia was on display for the public coronation of Mohammad Sanusi II as emir of Kano, the second-highest Islamic authority in Africa's most populous state.\nThe emir is dressed for the occasion by men known as \"the kingmakers\". His mouth is usually covered to signal that he speaks through his aides. Mr Sanusi, a former central bank chief and an Islamic scholar, rose to the throne last year following the death of his predecessor, Al Haji Ado Bayero...\nHorse-riders entertained the thousands of people who attended the ceremony, despite fears that militant Islamist group Boko Haram could launch an attack. The emir is a fierce critic of the group and his predecessor survived an attempted assassination blamed on the militants.\nMeanwhile, Moroccan and Egyptian singers perform on Friday at a music festival in the Indian city of Kolkata. It was billed as a peace festival - showing the role music and dance can play in bringing together people of diverse backgrounds...\nIn South Africa, a Hindu devotee gets pierced with lime and flowers during a festival on Saturday at a temple in Mount Edgecombe, north of Durban. The annual festival is a purification ritual offering prayers, penance, observing a month-long vegetarian diet and celebrating the Hindu god Muruga's birth...\nOn Tuesday, ballet dancers perform at a theatre in the main city, Johannesburg. The South African Ballet Theatre company is trying to raise awareness about the dance form by encouraging users of social media to upload their best pirouette videos.\nIn Ivory Coast's main city Abidjan, police estimated that about one million people lined the streets and packed the Felix Houphouet-Boigny stadium on Monday to celebrate the national football team's return from Equatorial Guinea, where they won the Africa Cup of Nations in dramatic fashion...", "url": "https://www.bbc.com/news/world-africa-31440440"}