{"authors": ["Paul Adams", "www.facebook.com"], "date_download": "2025-04-26 07:43:44", "date_modify": "2025-04-26 07:43:44", "date_publish": "2025-02-26 18:25:12", "description": "Aid agencies say it is the largest forced displacement of Palestinians in the West Bank in decades.", "filename": "news_articles_c4g039ergplo_1745653424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/39c2/live/4afafa80-f45e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g039ergplo_1745653424.html", "title": "Thousands of exiled West Bank residents face uncertain months ahead", "title_page": "Thousands of exiled West Bank residents face uncertain months ahead - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"The army forced us out. Me, my wife and family. We took nothing with us.\"\nAlaa Ofi is trying to figure out how to manage his drastically changed circumstances.\n\"We left behind our documents, clothes and everything we had at home.\"\nIt's been a month since the Israeli army raided the Tulkarm refugee camp, causing thousands of residents to flee.\nAt the local Palestinian governor's office we found displaced camp residents looking for assistance.\nSome were struggling to find affordable places to rent. Others, like Mr Ofi, needed to retrieve important belongings but had been prevented from returning to their homes by the Israeli army.\n\"My wife is expecting a baby next week,\" Mr Ofi said. \"I can't take her to hospital because I need insurance papers and my ID, but they were left behind at home.\"\nWhat Israel is calling \"Operation Iron Wall\" against Palestinian armed groups has triggered an exodus of around 40,000 people from four camps in the north of the occupied West Bank: Tulkarm, Nur Shams, Jenin and Far'a.\nAid agencies are calling it the largest forced displacement of Palestinians in the West Bank since it was captured by Israeli forces during the 1967 Six Day War.\nIt's also the first time any of the camps, which were established in the early 1950s for Palestinians who fled or were driven from their homes during Israel's War of Independence, have been almost completely evacuated.\nAt least 51 Palestinians, including seven children, have been killed by Israeli forces in the northern West Bank since the beginning of the operation, according to the UN.\nThree soldiers have also been killed by Palestinian gunmen, one of them during an exchange of fire in Jenin and two others in an attack on a checkpoint in Tubas, it says.\nThe Israeli army says it's tackling Palestinian militant groups, based inside the camps - groups it blames for a string of roadside bomb attacks on Israeli soldiers and civilians.\nOn Sunday, Israel's Defence Minister, Israel Katz, said the army was \"at war with Islamic terrorism in Judea and Samaria\" - the term Israel uses to describe the West Bank.\nHe said he had instructed the Israel Defense Forces (IDF) \"to prepare for a prolonged stay in the camps that have been cleared for the coming year\".\nAt the same time, Katz ordered tanks to take up positions in Jenin camp and the surrounding city, for the first time in more than 20 years.\nBeyond underlining the government's tough message, it's not clear what role the four tanks will perform.\n\"The IDF is operating within very complex urban environments,\" a military official said, on condition of anonymity.\n\"We've done that in Gaza, we've done that in the villages of southern Lebanon,\" the official said, referring to Israel's wars with Hamas and Hezbollah.\n\"We're doing that in those neighbourhoods in Judea and Samaria because of the threat that we're facing.\"\nIn the meantime, Palestinians find themselves struggling with a host of new difficulties, large and small.\nIn the village of Qabatiya, just south of Jenin, we found a driver frantically trying to reverse out of a muddy pothole left by Israeli bulldozers that had dug up the street.\nHis car was stuck in the middle of the road, holding up traffic in both directions.\nIn the centre of a nearby roundabout, a miniature replica of Jerusalem's iconic Dome of the Rock had been smashed to pieces.\nDespite Israel Katz's warning, no-one knows how long the operation, and the restrictions on civilians, will last.\n\"If we can't go back to our house for a year, it's going to be a disaster,\" says Alaa Ofi.\n\"We'll be left stranded in the streets with the kids.\"", "url": "https://www.bbc.co.uk/news/articles/c4g039ergplo"}