{"authors": ["Jasmine DuFraisse", "Jonny Humphries", "www.facebook.com"], "date_download": "2025-04-26 06:25:47", "date_modify": "2025-04-26 06:25:47", "date_publish": "2025-02-28 21:41:46", "description": "Aaron Hunt is used to entertaining thousands by playing as Daisy Hill FC on the Football Manager game.", "filename": "news_articles_cly8wn2kn0zo_1745648747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/24a4/live/82ab3430-f61c-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly8wn2kn0zo_1745648747.html", "title": "Aaron Hunt: Twitch star's football club takeover brings big crowd", "title_page": "Aaron Hunt: Twitch star's football club takeover brings big crowd - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An amateur football club taken over by a Twitch streamer, who brought virtual glory on the Football Manager videogame, saw a big jump in attendance for his first real-life match.\nAaron Hunt gained thousands of followers streaming his success with his local club Daisy Hill FC, based in Westhoughton, Bolton, on the management simulation game online.\nHis popularity led to him being invited to step in and become chairman of the North West Counties Football Counties side, which needed financial support.\nDaisy Hill usually attracts modest numbers of supporters - about 50 - but their clash with Atherton Laburnum Rovers FC saw well-known YouTuber Angry Ginge and TikTok star Steve Bracknall among a crowd of several hundred.\nMr Hunt was headhunted by manager Lee Hill, in the hope he could replicate his virtual success on the pitch.\nSpeaking before kick-off, Mr Hunt described the differences between running a virtual club on his computer to the real thing.\n\"I could do it in my boxers at home, I can't do that here,\" he said.\n\"I've got right stuck in though. I have drawn all the lines on the pitches today and that, I want to be proper hands on with it and just help a lot of people in the community as well.\n\"Everyone's come together as well, you've seen how many people are here.\"\nMr Hunt said one of the biggest advantages to his appointment was the chance to bring attention and \"new eyes\" on the club, potentially attracting new sponsorship.", "url": "https://www.bbc.co.uk/news/articles/cly8wn2kn0zo"}