{"authors": ["Anthony Zurcher", "www.facebook.com"], "date_download": "2025-04-26 04:01:56", "date_modify": "2025-04-26 04:01:56", "date_publish": "2025-03-04 02:56:52", "description": "Trump is making a high-stakes bet that could either reap major political dividends, or seriously undercut his second term.", "filename": "news_articles_crrd7gpvw5po_1745640116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1e8a/live/42b37b40-f8e6-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crrd7gpvw5po_1745640116.html", "title": "Trump's tariffs risk economic turmoil", "title_page": "Trump's tariffs risk economic turmoil - and voter backlash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Donald Trump has been threatening major tariffs on America's two largest trading partners, Canada and Mexico, for more than a month. It now appears that the day of reckoning is at hand.\nThe risk for the president is that his sweeping tariffs, which also target China, may drive up prices for businesses and consumers in the months ahead, damaging the health of the US economy - the issue that Americans say they care about most.\nThe economy and inflation was at the top of voter concerns last November – concerns Trump promised to address as he stormed back to the White House, partly on the back of lingering discontent about soaring prices early in the Biden presidency.\nTrump can comfortably boast that he has delivered many of his most striking campaign promises – including slashing federal jobs, stepping up immigration enforcement and recognising two sexes only.\nBut on inflation, the new Trump administration has made little tangible progress. Sky-high egg prices have been a daily reminder. And while the mass culling of chickens in response to bird flu has played a major role, the cost of the daily staple for many Americans has kept inflation front and centre in voters' minds.\nAs Trump confirmed on Monday that 25% tariffs on Canadian and Mexican-made goods would indeed be coming into effect, US stock markets took their biggest hit of the year, providing an early indication of the economic turbulence his policies could create. And Trump's tariffs on Mexican food imports, in particular, could hit Americans where they feel it the most – in higher prices at the grocery store.\nAccording to a CBS survey conducted last week, 82% of Americans say they think the economy should be a \"high\" priority for the president. Only 30% said that about tariffs.\nOnly 36% of respondents think Trump is prioritising the economy \"a lot\" – compared to 68% for tariffs. Just 29% believe Trump is prioritising inflation. Views on the state of the economy remain generally dour, as 60% said it is \"bad\", compared to 58% who had the same view last year.\nPublic opinion of Trump's handling of the economy as a whole is within the margin of error on the survey, with 51% approving. That exactly matches his overall job rating, suggesting that the fate of this president, like those of his predecessors, will hinge on the strength of the economy.\nAccording to Clifford Young, president of public affairs at polling company Ipsos, Trump is still in the honeymoon period of his presidency, when Americans will give him room to manoeuvre.\nTypically, he said, this benefit of the doubt for a new president lasts about six months – but that can be cut short if the economy suffers some kind of dramatic shift. Trump argues that his tariffs will boost US manufacturing, raise tax revenue and spur investment – but most economists say that prices for Americans are likely to rise, potentially in a similar timeframe.\nOn Tuesday night, in a primetime speech to a joint session of Congress, Trump will have a chance to make the case that the short-term pain of his tariff plan will lead to long-term benefits. It's his chance to convince the American public to keep his honeymoon going.\n\"I'd be interested to see how he links government efficiency to the economy, global tariffs to the economy, even immigration to the economy,\" said Young. \"Ideally, he would make an argument that all these different things he's doing are ultimately done with the view of improving the economy.\"\nThe challenge for the president is there are some indications that doubts about the economy are growing, along with warning signs of other challenges to come.\nA survey of public and private businesses released last week by the Conference Board, a non-partisan economic research group, found a precipitous drop in consumer confidence – the largest decline since August 2021. The souring mood among US consumers was largely attributed to concerns over inflation and economic disruptions caused by rising tariffs.\nInflation, as measured by the Consumer Price Index, rose 3% in January, marking a six-month high. The public appears to agree, as the CBS poll found 62% of Americans reporting that prices have been \"going up\" in the past few weeks.\nWhite House officials privately insist that administration efforts to cut government costs, reduce regulation and boost energy production will ultimately lead to lower prices even in the face of higher tariffs – but that such efforts take time to produce results.\nIn a television interview on Sunday, Treasury Secretary Scott Bessent said Trump plans to appoint an \"affordability tsar\" to address the concerns of \"working-class Americans\".\n\"President Trump said that he'll own the economy in six or 12 months,\" Bessent said, suggesting that former President Joe Biden was to blame for the current conditions.\n\"But I can tell you that we are working to get these prices down every day.\"\nWhile Tuesday's speech is not a formal State of the Union address, Trump can talk about what he is doing – and will do – to address these voter concerns.\nAny missteps could give Democrats, who have been struggling to find an effective line of attack against the new president, an opening. Their choice of rebuttal speaker, newly elected Senator Elissa Slotkin from the trade-dependent industrial Midwestern state of Michigan, suggest they are keen to focus on economic issues.\nAt the moment, Trump is at the height of his political power. Now, he appears willing to use that power to change the way the US conducts trade policy – an issue that has animated him for more than four decades.\nBut American history books are lined with the names of presidents felled by souring public perceptions of the economy.\nSome financial disruptions are entirely out of a White House's control. With his tariff decision, however, Trump is making a high-stakes bet that the American public will ultimately approve of his decisions.\nIf he's right, the payoff could be a generational political realignment on this issue.\nIf he's wrong, it could undercut the second term of his presidency before it even gets fully underway.", "url": "https://www.bbc.co.uk/news/articles/crrd7gpvw5po"}