{"authors": ["Malia Carty", "www.facebook.com"], "date_download": "2025-04-26 06:35:40", "date_modify": "2025-04-26 06:35:40", "date_publish": "2025-02-27 06:12:22", "description": "Samantha Day says she seriously struggled to find a rental property that allowed pets.", "filename": "news_articles_cx2g5vyzrxwo_1745649340.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f549/live/d75cbcb0-f41e-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2g5vyzrxwo_1745649340.html", "title": "'No-pets rental rule almost saw me lose my cats'", "title_page": "'No-pets rental rule almost saw me lose my cats' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Samantha Day received a section 21 eviction order from her landlord, she had two months to find a new home for herself and her two cats, Cali and Ellie.\nHowever, as she began browsing the listings, she was horrified to find nearly all of them stated no pets were allowed - and said landlords she spoke to became cautious when she mentioned her cats.\nMs Day, from Derbyshire, was considering temporarily housing her furry friends with family members before receiving help from a pet-friendly organisation.\nShe is now calling on landlords to be more open-minded about tenants with animals.\nMs Day said she had found the lack of rental options for herself and her felines \"scary and frightening\".\n\"It got to the point where I was asking family members if they could take them in temporarily in case I got kicked out,\" she told the BBC.\n\"It's sad knowing that there was a possibility that I might have had to give them up.\"\nLuckily a breakthrough came with the help of AdvoCatsEastMids, a non-profit voluntary organisation that helps tenants with pets find homes.\nJennifer Berieza, the group's founder, helped Ms Day create a pet CV - designed to set out their breed, medical history and best qualities with the aim of demonstrating the owner's responsible approach - and a new home was found.\nMs Berieza says she started the organisation because she saw a \"real need\" in the market - property website Zoopla estimates that only about 7% to 9% of rental properties are pet-friendly.\n\"I think that landlords should consider that while it's their property, it's also a tenant's home,\" she said.\n\"It's important for people to feel safe, secure and happy in their homes and for a lot of people that means having a pet.\"\nMs Day said she understood the concern a landlord might feel but felt it was unfair to lump together responsible renters with \"bad tenants\".\n\"A lot of people do look after their rented homes well, even with pets,\" she said.\nChange could be round the corner with the proposal of the Renters Rights bill, which seeks to give tenants the right the request a pet and states the request cannot be unreasonably refused by landlords.\nThe government has yet to publish a guideline of what a reasonable refusal would be.\nIt would also allow damage to rented properties to be covered by pet insurance.\nMs Berieza called the planned legislation \"a very good step\", but said there was still more that could be done.\n\"I think it will help tenants but they have to know that they still need to request permission and they can't just automatically think 'I have a right to a pet' and go and get one,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cx2g5vyzrxwo"}