{"authors": ["Robby West", "www.facebook.com"], "date_download": "2025-04-26 06:46:23", "date_modify": "2025-04-26 06:46:23", "date_publish": "2025-03-01 13:59:40", "description": "Artists forced to leave a building express concern about the impact on Norwich's art scene.", "filename": "news_articles_cx2x8my8xxdo_1745649983.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b3bf/live/6fcdfa50-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2x8my8xxdo_1745649983.html", "title": "Anglia Square art studios loss 'devastating' for Norwich", "title_page": "Anglia Square art studios loss 'devastating' for Norwich - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An artist who was evicted from his studio said the loss of affordable work space was \"devastating\" for the local art community.\nHenry Jackson Newcomb is one of 90 people being forced to leave Gildengate House in Anglia Square, Norwich, after it was bought by Norwich City Council, which plans to build 1,100 new homes there.\nMr Jackson Newcomb said there was no other affordable art space nearby.\nThe council said the redevelopment would benefit local residents.\nArtists began moving into the Gildengate House, known as Outpost, in 2010, with some 90 people based there, prior to eviction at the end of February.\nMr Jackson Newcomb said losing the space was a \"devastating loss for the community.\"\nStudios in the building had cost up to £110 per month to rent, and he said there was no comparable studio space available nearby.\n\"People are moving to Great Yarmouth,\" he said, adding the seaside town had more affordable workshops.\nSculptor, Anna Brass, who was based at the building, said the \"supportive\" community working there was now \"dissolving\".\nShe added the people who worked from Outspace \"underpin so many things that are going on, arts-wise, in the city\".\n\"The art scene in Norwich is really strong,\" she said, \"but it's an ecology, and we are a vital part of that.\"\nNorwich City Council said the site would deliver 1,100 new homes, jobs, as well as new retail and leisure facilities \"for the benefit of the people of Norwich\".\n\"It is crucial that we continue to move at pace and redevelop Anglia Square,\" the authority said.\nThree months notice given to the building's occupants in December was brought forward to 28 February after the council found \"significant compliance risks affecting the safety and wellbeing of both the occupiers and visitors, to Gildengate House\".", "url": "https://www.bbc.co.uk/news/articles/cx2x8my8xxdo"}