{"authors": ["Natalie Sherman, Laura Bicker & Tom Geoghegan", "www.facebook.com"], "date_download": "2025-04-26 04:23:42", "date_modify": "2025-04-26 04:23:42", "date_publish": "2025-03-03 13:07:35", "description": "The US president has repeatedly threatened to tax imports from two of the country's closest neighbours.", "filename": "news_articles_cn48q3150dxo_1745641422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2b1a/live/c8e12320-f873-11ef-a9fe-3f8068a4d2a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn48q3150dxo_1745641422.html", "title": "Stock markets sink as Trump confirms tariffs on Canada, Mexico and China", "title_page": "Stock markets sink as Trump confirms tariffs on Canada, Mexico and China - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "President Donald Trump has said he is moving forward with 25% tariffs on goods imported from Canada and Mexico into the US, adding that time had run out to reach a deal.\nUS stock markets sank in response to the measures, which he has threatened since earlier this year and said would now go into effect on Tuesday.\nAn additional 10% tariff on Chinese imports is also expected to come into force, leaving all of America's top three trade partners facing significantly higher barriers than just a few weeks ago.\n\"No room left for Mexico or for Canada,\" Trump said at the White House on Monday. \"The tariffs, you know, they're all set. They go into effect tomorrow.\"\nThe three major indices in the US sank after Trump's comments. The Dow Jones Industrial Average ended the day down 1.4%, the S&P 500 sank 1.75% and the Nasdaq fell 2.6%.\nPrime Minister Justin Trudeau responded: \"Canada will not let this unjustified decision go unanswered.\"\nCanadian Foreign Minister Melanie Joly told reporters that Ottawa planned to impose retaliatory tariffs against US imports of C$155bn ($107bn; £ 84bn), with the first tranche of $30bn ready immediately to be levied on everyday goods like pasta, clothing and perfume.\nThe foreign minister added that the tariffs were \"an existential threat to us\", with \"thousands of jobs in Canada at stake\".\nChina's commerce ministry on Tuesday also vowed to retaliate against the fresh US tariffs, accusing the Trump administration of trying to \"shift the blame\" and \"bully\" Beijing over fentanyl flows.\nIn a statement, the ministry urged the US to \"immediately withdraw\" its tariffs that it described as \"unreasonable and groundless, harmful to others\".\nState media outlet The Global Times reported on Monday that China may target US agricultural and food products with both tariff and non-tariff measures.\nMexico also said it will retaliate against the US tariffs, raising the prospect of a widening trade war.\nTrump threatened to impose the tariffs, which are a tax added to a product when it enters a country - on Canada, Mexico and China in response to what he said was the unacceptable flow of illegal drugs and illegal immigrants into the US.\nAll the tariffs were supposed to take effect last month, until the US agreed to a one-month delay for Canada and Mexico, pulling its North American neighbours back from the brink of a potentially damaging trade war.\nBut Trump went ahead with imposing a 10% tariff on Chinese exports to the US in February, meaning goods from the country now face a levy of at least 20%.\nTrump has long maintained that tariffs are a useful tool to correct trade imbalances and protect US manufacturing.\nHe has largely dismissed concerns that the measures risk economic damage in the US, despite the close ties, especially in North America, where businesses have enjoyed decades of free trade.\n\"What they'll have to do is build their car plants, frankly, and other things, in the United States, in which case they have no tariffs,\" he added.\nThe Canada Border Services Agency (CBSA) says it has been \"surging\" its efforts to tackle fentanyl crossing into the US.\nPresident Trump has also announced a 25% charge on all steel and aluminium imports, which is meant to come into effect on 12 March.\nIn addition, he has threatened to impose custom \"reciprocal\" tariffs on individual countries, as well as 25% tariffs on the European Union.", "url": "https://www.bbc.co.uk/news/articles/cn48q3150dxo"}