{"authors": ["Tanya Gupta", "www.facebook.com"], "date_download": "2025-04-26 06:18:44", "date_modify": "2025-04-26 06:18:44", "date_publish": "2025-03-01 07:19:54", "description": "The achievements of women of the past, present and future inspire events across the region.", "filename": "news_articles_c0q1wk0x1zwo_1745648324.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2616/live/97c1c880-f521-11ef-9339-81d4ea72d09f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1wk0x1zwo_1745648324.html", "title": "West Midlands celebrates Women's History Month", "title_page": "West Midlands celebrates Women's History Month with calendar of events - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Achievements of women past and present are being celebrated, from scientists and writers to today's business leaders and sports pioneers.\nMuseum curators have used Women's History Month to focus on untold stories, while chambers of commerce are holding talks to learn from success.\nInternational Women's Day is on 8 March, but talks, walks and exhibitions are planned all month across the West Midlands region.\nJenny Wilkes, chair of Wolves Women, will be speaking about roadblocks women face, role models to inspire them, and self-belief, as the football team celebrates its 50th anniversary.\nMs Wilkes, who has been chair since 1999, said women still faced roadblocks and unconscious bias was \"one of the big things\", together with imposter syndrome.\nIn football, people still think women cannot play, and cannot be pundits or be on the TV, she said.\nBut she said role models were important and \"if you can see it, you can be it\".\nNow, when the women play, it is not just girls who turn up wanting autographs, but boys too, she said.\nShe said confidence mattered, adding: \"Women don't think they can do it - but it's about self-belief.\"\nMs Wilkes will give a talk for the Black Country Chamber of Commerce at Molineux, as an exhibition on Wolves Women is launched at the Wolves museum at the stadium.\nAmong the other organisations staging events is Shropshire Chamber of Commerce, which said its event sold out last year.\nIt said it had planned \"another memorable gathering, external\" with guests including fire service chiefs, a voice coach and an HR expert on military careers.\nMeanwhile, Staffordshire Chamber of Commerce will hear from three trailblazers, external who have spearheaded initiatives in gut health, pet safety and online fitness.\nThe month-long focus on women's history includes several talks at museums in the region.\nThe Brampton Museum in Newcastle-under-Lyme will look at women passed over as \"just wives, external\", when in fact they \"made their mark on their times\".\nSelly Manor Museum in Birmingham is holding a sold-out symposium, external looking at the life of Dame Elizabeth Cadbury and the role and expectations of women in late Victorian society.\nStaffordshire History Centre will look at the work of 19th Century astronomer Mary Blagg, who lived in Cheadle, but whose \"studies took her to the stars as she mapped the moon, external and revolutionised our modern understanding\".", "url": "https://www.bbc.co.uk/news/articles/c0q1wk0x1zwo"}