{"authors": ["Max Matza", "www.facebook.com"], "date_download": "2025-04-26 06:16:46", "date_modify": "2025-04-26 06:16:46", "date_publish": "2025-03-01 19:21:33", "description": "The majority of Republicans say Zelensky was at fault for the spat, but one accused the president of \"embracing Putin\".", "filename": "news_articles_cnvz566n523o_1745648206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9af5/live/3ec84a00-f707-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cnvz566n523o_1745648206.html", "title": "Most Republicans laud Trump after Zelensky showdown, but some express dismay", "title_page": "Most Republicans laud Trump after Zelensky showdown, but some express dismay - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Most Republicans have backed US President Donald Trump and Vice-President JD Vance following their public row in the Oval Office with Ukrainian President Volodymyr Zelensky.\nSenator Lindsey Graham suggested Zelensky should resign, adding that Friday's altercation had imperilled future US military support for Kyiv, but another Republican senator accused Trump of \"embracing Putin\".\nZelensky was asked to leave the White House without signing a deal with the US that would have jointly developed Ukraine's valuable minerals.\nOn Saturday, Zelensky enjoyed a much warmer reception from UK Prime Minister Keir Starmer in Downing Street, a day ahead of a meeting with King Charles.\nThe Ukrainian leader also made a plea on Saturday to the US to \"stand more firmly\" with Kyiv, adding that he was ready to sign the minerals deal with Trump, but wished for defined security guarantees.\nTrump has suggested that Ukraine should concede territory to Russia to end its invasion and has opened peace talks between Washington and Moscow.\nThe American president has also warned Russia that he will impose high tariffs and further sanctions if President Vladimir Putin fails to end the \"ridiculous\" war.\nBefore leaving for Florida after the Oval Office clash with Zelensky, Trump told reporters that the Ukrainian leader had \"overplayed his hand\".\n\"Either we're going to end it or let him fight it out, and if he fights it out, it's not going to be pretty,\" Trump said. \"Because without us, he doesn't win.\"\nNational Security Adviser Mike Waltz, who was in the Oval Office during the meeting, told Breitbart News on Saturday that Zelensky was too focused on fact checking and compared the Ukrainian leader to an \"ex-girlfriend\".\n\"It's like an ex-girlfriend that wants to argue everything that you said nine years ago, rather than moving the relationship forward,\" Waltz said.\nWhile Democrats said they were horrified by the showdown with a US ally, the majority of Republicans in Washington backed Trump.\n\"What I saw in the Oval Office was disrespectful, and I don't know if we can ever do business with Zelensky again,\" said Senator Graham, a longtime advocate for Ukraine aid and a foreign policy hawk, as he left the White House on Friday.\n\"The question for me is, 'is he redeemable in the eyes of Americans?' Most Americans witnessing what they saw today would not want Zelensky to be their business partner, including me, and I've been to Ukraine nine times since the war started.\"", "url": "https://www.bbc.co.uk/news/articles/cnvz566n523o"}