{"authors": ["David Dixon", "www.facebook.com"], "date_download": "2025-04-26 07:05:27", "date_modify": "2025-04-26 07:05:27", "date_publish": "2025-02-28 06:29:38", "description": "The much-loved ferry is due to be retired after nearly 50 years of service to the Isles of Scilly.", "filename": "news_articles_cq5zdg0q8x4o_1745651127.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d531/live/3c5d6e80-f428-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq5zdg0q8x4o_1745651127.html", "title": "Scillonian III ferry set for final season to the Isles of Scilly", "title_page": "Scillonian III ferry set for final season to the Isles of Scilly - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Final preparations are under way for the Scillonian III ferry to start sailing to the Isles of Scilly next month on what could be her last season.\nThe vessel came into service in 1977 and has made more than 10,000 trips to the islands.\nSenior managers at the Isles of Scilly Steamship Group (ISSG) have said the ferry was now 48 years old and it was now time to look forward.\nHer replacement, the Scillonian IV, and a new cargo vessel were both under construction in Vietnam and were scheduled to enter service in the spring of 2026.\nThe Scillonian III has made the 36 mile (58km) journey from Penzance harbour to St Mary's harbour on the Isles of Scilly more than 10,000 times.\nThe ferry has travelled over 388,500 nautical miles and carried over five million passengers since entering service in 1977.\nHowever, the 223ft (68m) ship, which sails between March and November, has experienced some mechanical issues.\nAn engine problem meant she had to operate on half power for a few days in September 2024 and journey times were increased from two hours 45 mins to four hours.\nThe crane that lifts cargo into the hold also broke last year and mobile cranes were brought in to the quays in Penzance and St Mary's.\nThe Isles of Scilly Steamship Group CEO Stuart Reid said he hoped their problems were behind them.\n\"The crane has been completely overhauled and the engine has been tested and everything is looking good for the first sailing,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cq5zdg0q8x4o"}