{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:20:58", "date_modify": "2025-04-26 04:20:58", "date_publish": "2025-03-03 15:22:09", "description": "Cpl Shaun Roberts died in hospital weeks after being punched outside a Blyth nightclub, a court hears.", "filename": "news_articles_c0q1g2n4j5yo_1745641258.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8fbe/live/7e240560-f840-11ef-9967-9d96c0c1bbff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1g2n4j5yo_1745641258.html", "title": "Blyth teenager who celebrated fatal soldier punch detained", "title_page": "Blyth teenager who celebrated fatal soldier punch detained - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager who celebrated after fatally injuring a \"super soldier\" with a punch outside a nightclub has been detained for six years.\nShaun Roberts, a 35-year-old corporal in the British Army, died in hospital almost a month after being attacked in Blyth, Northumberland, Newcastle Crown Court heard.\nThe father-of-four had served in Afghanistan and been mentioned in dispatches for risking his own life to save fellow soldiers under heavy fire, the court heard.\nMason Ibbotson, 18 and from Blyth, admitted manslaughter.\nCpl Roberts, who was known as Robbo, had been on a night out in Blyth with three colleagues after attending a course in the town on 5 October, Newcastle Crown Court heard.\nShortly after 03:00 GMT on 6 October, the group had left the Dejavu club and were going to get a taxi back to barracks at Otterburn when they were confronted by Ibbotson and his gang, prosecutor Jessica Slaughter said.\nThe gang targeted the soldiers because they were \"not from the area\", Ms Slaughter said, with the two groups gesturing at each other before Ibbotson repeatedly punched one of Cpl Roberts' friends.\nCpl Roberts had his arms by his side when Ibbotson, a trained boxer with a history of assaulting emergency workers, suddenly punched him in the face, causing him to collapse unconscious to the ground.\nAs Cpl Roberts' colleagues tried to give aid, Ibbotson jumped around with his arms in the air celebrating the punch, Ms Slaughter said.\nHe then tried to attack other members of the army group before running away, the court heard, later telling someone he had \"blood on his hands\" and had killed someone.\nCpl Roberts, a sniper in the Royal Anglian Regiment based in Oakham, Rutland, died in hospital on 1 November having never regained consciousness, the court heard.\nIn a statement read to the court, Cpl Roberts' wife said the family had been devastated by his death.\nShe said he was beloved by his friends, family and colleagues, and was the \"most selfless\" person she ever knew.\nMrs Roberts said the weeks she spent by his bedside were \"mental torture\" and they knew even if he did survive, his brain injury would have been life-changing.\n\"We had to watch as his body slowly shut down and the strong man we know was still trying to fight to be with us,\" she said.\nThe court heard glowing references of Cpl Roberts from his supervising officers.\nBrig Guy Foden said he was a \"super soldier\" and in a \"remarkable company stood out at the top\", adding he was a \"master of his profession\" and an \"exemplar of the Royal Anglian\".\nThe court heard Cpl Roberts had extensive frontline experience having served in places such as the Helmand province.\nHe had been mentioned in dispatches for his \"gallantry\" for rescuing a wounded comrade under heavy fire, something he did on \"more than one occasion\", his officer said.\nThe court heard Cpl Roberts had run through gunfire to lift with \"superhuman\" strength an injured colleague who he then carried to safety.\nCpl Roberts served his country and \"much was asked of him\" but he \"never failed to deliver excellence\", Brig Foden said, adding: \"He was brave, determined and kind.\"\nAnother senior officer said Cpl Roberts was the \"epitome of loyalty\" and \"always fun to be around\".", "url": "https://www.bbc.co.uk/news/articles/c0q1g2n4j5yo"}