{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:18:58", "date_modify": "2025-05-21 06:18:58", "date_publish": "2025-01-04 00:00:00", "description": "Several fights were delayed with one cancelled following \"challenging\" weather conditions.", "filename": "news_live_c2kxwkdj331t_1747808338.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c2kxwkdj331t_1747808338.html", "title": "Bristol Airport reopens and bus services cancelled as weather warnings remain", "title_page": "Bristol Airport reopens and bus services cancelled as weather warnings remain - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from us\nSarah Turnnidge\nBBC News, West of England\nWith the majority of the snow cleared and the temperature rising this afternoon across our region, we are bringing our coverage of the weather overnight and this morning to a close.\nPlease be aware that while the coldest weather may now have passed we have seen warnings from a number of officials urging people to take care while driving, due to a large amount of standing water still present on the roads.\nStay safe everyone!\nThe pictures keep coming...\nWe love seeing pictures of your pets enjoying the snow and this one is no exception.\nThank you to our Weather Watcher Craig Rich for sending this one in from Winterslow, in Wiltshire.\n'Grind to a halt'\nThe work of volunteer 4x4 responders like Mr Greenhalgh may be little known, but the service they provide in tricky conditions like those we saw last night can make a huge difference to people working on the front lines of healthcare.\n\"If we can't get staff to work for their shift, then the people who are already there can't get home.\n\"The whole thing would grind to a halt and you'd end up with people double-shifting in the hospital which is not the ideal situation for patient care,\" he said.\nClick here to read more.\n4x4 responders on call overnight\nLaura Jones\nReporter, BBC Points West\nIn response to last night's conditions, 4x4 responders were on call in Gloucestershire helping key workers get to and from their shifts.\nYesterday we spoke to Jerry Greenhalgh, 75, who has volunteered with the Gloucestershire and Worcestershire 4x4 Response team for 16 years.\n\"We will be expecting calls from our service users - primarily NHS trusts, local care homes, a few doctors surgeries, where we would transport staff from their home to their place of work, and similarly from their place of work back home when there's a shift changeover,\" he said.\nHaving spent a long career as an engineer for an electricity company, heading out on call is now second nature to Mr Greenhalgh.\n\"Going out in all weathers, at all times of the day and night, is something that I was doing for 40 years,\" he said.\nYellow weather warning comes into force\nSarah Turnnidge\nBBC News, West of England\nA new weather warning - this time for rain - has been introduced this morning, covering a large part of southern England including the West.\nThe Met Office has issued a yellow weather alert, warning: \"Further heavy rainfall may lead to some transport disruption in places.\"\nThe agency says bus and train journeys are likely to be affected, with spray and flooding on roads also potentially extending journey times.\nThe warning covers from shortly before 09:00 GMT today to 09:00 on Monday, during which a further 15-20mm of rain could fall quite widely. The Met Office says up to 30mm could fall in a few locations - most likely in the South West.\nSpike in temperature across West Country\nAlex Osborne\nBBC Weather\nSpeaking to BBC Radio Bristol this morning BBC Weather's Alex Osborne said milder air had pushed in overnight, with a temporary spike in temperatures expected across our region.\n\"At the moment in Bristol temperatures are hovering just above freezing, whereas a little bit further south in Somerset, in Yeovil, it's 13 degrees out there at the moment,\" she said.\n\"The forecast essentially is that milder air is going to continue to spread northwards to all parts, so by this afternoon Bristol also will be up into double figures - but that is for one day only.\"\nLast night's snow has now turned to rain in many places, with a few flood alerts and flood warnings issued.\n\"If you are driving or travelling this morning, do take a little bit of extra care for some spray and surface water,\" Alex said.\nWhile we are all likely to see temperatures rise significantly this afternoon, it isn't to last. Overnight temperatures will return to low single figures, with cooler air dominating throughout the week ahead. Some wintry showers may be on the cards, but not the snowfall we saw last night.\nShare your pictures with us\nWe would love to see more of your snow pics from Saturday night.\nThere are a few ways you can get in touch.\nWhatsApp: Message us on 0800 313 4630\nEmail: Send a message to pointswest@bbc.co.uk\nPlease remember to include your name and where you took the photo.\nPower restored in Worle\nSarah Turnnidge\nBBC News, West of England\nWe reported earlier this morning 130 homes in Worle, North Somerset, were without power after a fault in the low-voltage network.\nPower was gradually restored to affected home and this incident has now been removed from the National Grid's map of live incidents altogether.\nThe only other reported outage within our region is in the Southmead area of Bristol, where 28 homes spent the night without power. The supply, National Grid say, is expected to be restored by 11:00 GMT this morning.", "url": "https://www.bbc.com/news/live/c2kxwkdj331t"}