{"authors": ["Aisha Iqbal", "Chris Young", "www.facebook.com"], "date_download": "2025-04-26 04:14:19", "date_modify": "2025-04-26 04:14:19", "date_publish": "2025-03-04 11:13:47", "description": "Opposition politicians say selling the £35m One City Park would make a dent in the savings needed.", "filename": "news_articles_c3vw54wddzeo_1745640859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4521/live/aa15a610-f8d6-11ef-8a06-7ba4024a445c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3vw54wddzeo_1745640859.html", "title": "One City Park: Tories call for Bradford building sell-off to balance budget", "title_page": "One City Park: Tories call for Bradford building sell-off to balance budget - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council bosses in Bradford have been urged to sell off a flagship regeneration project to help balance the books.\nOpposition Conservatives argue that offloading the £35m One City Park office development - even at a loss - could save at least £250,000 in annual financing costs for 50 years.\nThe Labour-run council's executive is finalising details of a proposed 9.99% council tax hike, plus more than £42m of cuts, in an effort to balance the books and avoid effective bankruptcy.\nMike Pollard, Tory finance spokesman, said \"sacrificing\" big projects was among the \"tough decisions\" needed, but the council's Labour leader said the suggestion did \"not make any sense\" and was opposition\"posturing\".\nThe authority was last year granted \"exceptional financial support\" – meaning the government has given the council permission to borrow money to fund essential services.\nThis coming financial year it will borrow around £127m.\nMeanwhile planned cuts already include scrapping projects like the refurbishment of Bradford City Hall and a solar farm at Odsal.\nPollard argued that a different approach could have cut borrowing by £8-10m. He said his party would still propose a council tax rise, but at the usual maximum rate of 4.99%.\nThe Tory proposals won't face a vote at Thursday's budget meeting - as Pollard said the council's current financial situation and the \"fixed\" nature of its emergency support agreement with ministers meant the party \"cannot present an alternative budget\", something opposition parties normally do.\nBut he said selling the One City Park development along with scrapping plans for a new swimming pool and leisure centre at Squire Lane were \"tough decisions\" the council should consider.\n\"I concede that its realistic value on the open market would be, rather disappointingly, around £18-20m. Nonetheless, that particular lamb would still be worth sacrificing,\" he said.\nThe Conservatives claim their plan would have balanced a £12.5m Council Tax reduction with £20m in savings and receipts.\nThe Labour leader of the council, Susan Hinchcliffe said: \"Some of what they are saying doesn't make any sense.\n\"They're suggesting giving £20m back to government for another capital project, and selling that for another £20m.\"\nHinchcliffe added: \"We have to make decisions because we need to keep this place ready for investment, ready for jobs and making sure we have a financially sustainable future for the council - and that is what we are doing.\n\"We are making the right decisions, but it is hard and it is tough.\"\nIf the tax rise is approved, the council says it will set up a £1.2m hardship fund \"to ease the impact of the rise for those of working age on low incomes\".\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North.", "url": "https://www.bbc.co.uk/news/articles/c3vw54wddzeo"}