{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:22:27", "date_modify": "2025-05-19 15:22:27", "date_publish": "2015-02-27 11:56:26", "description": "Plans for a controversial £9m council office building in Harrogate are recommended for approval.", "filename": "news_uk-england-york-north-yorkshire-31659145_1747668147.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81285000/jpg/_81285372_harrogateofficeproposal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-york-north-yorkshire-31659145_1747668147.html", "title": "New £9m Harrogate Council office set to get green light", "title_page": "New £9m Harrogate Council office set to get green light - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plans for a controversial £9m council office building in Harrogate have been recommended for approval.\nThe proposed four storey development at Knapping Mount, off West Grove Road, has a circular design and would include car parking with 230 spaces.\nThe proposal would involve knocking down the existing office buildings on site, plus two houses and four garages.\nHarrogate Borough Council is expected to approve the plans on Tuesday.\nA Change.org petition, external was started in protest at the new building when the plans were announced. It currently has 409 signatures.\nHelen Flynn, who started the petition, said the new office would be a \"waste of local taxpayers' money\". She has argued the council should focus on refurbishing its current offices at Crescent Gardens instead.\nCurrently council staff are split between five sites including Knapping Mount, Crescent Gardens, Scottsdale House, Victoria Park House and Springfield Gardens. The new building would allow all 500 staff to work from a single office.\nHarrogate Borough Council said it would comment on the proposals after the planning committee meeting.", "url": "https://www.bbc.com/news/uk-england-york-north-yorkshire-31659145"}