{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:04:38", "date_modify": "2025-05-21 05:04:38", "date_publish": "2025-01-23 00:00:00", "description": "Social Care Minister Maree Todd outlines the government's change in plans for a national serviced.", "filename": "news_live_crke2x7kdx5t_1747803878.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_crke2x7kdx5t_1747803878.html", "title": "Social Care Minister Maree Todd outlines the government's change in plans for a national serviced.", "title_page": "Social Care Minister Maree Todd outlines the government's change in plans for a national serviced. - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scrapping of the National Care Service: The headlines\nNow if you're just joining us, here's a reminder of the key lines that emerged in the statement from the Social Care Minister on the future of the National Care Service:\nMaree Todd told the chamber the first part of the National Care Service Bill would be dropped and revised proposals put in parts two and three of the legislation\nThe first part of the bill would have transferred responsibility for social care away from councils to a new national body - this will now be scrapped\nHowever, the bill will enshrine Anne's Law which allows people in care homes to receive visits from a named loved one even in restricted measures\nThe minister said the right to breaks for unpaid carers would be introduced\nA National Care Service advisory board will be introduced urgently with a wide remit\nThe advisory board will start meeting in March\nThere will be an overhaul of eligibility criteria in social care\nTory MSP Sandesh Gulhane called on Maree Todd and Health Secretary Neil Gray to resign\nLabour's Jackie Baillie highlighted nearly £30m of taxpayers' money has already been \"wasted\" on the bill and she too called on Neil Gray to resign\nThat's it as far as our live coverage of an extremely hectic day at the Scottish Parliament is concerned.\nThe editor today was Paul McLaren and the writers were Craig Hutchison and Ashleigh-Keenan Bryce.\nCritical importance of having the right care in place\nLisa Summers\nBBC Scotland health correspondent\nAshleigh Milroy gets support from Thistle Foundation.\nHaving good social care has allowed her to live independently, complete a degree in psychology and volunteer for many organisations.\n\"The difference is everything. I'm having a great experience now which means I can do all the things a person with additional support needs would do - like live independently, like attend my church and see friends - but all these things wouldn't be possible if I didn't have the right support.\n\"When you don't know what's happening and you don't know where people are coming from it's really quite scary and it puts you in a very vulnerable position.\"\nAshleigh says there needs to be a significant investment in social care\n\"It's a really big responsibility as they allow someone to live an independent life, and for wider society it needs to be prioritised as a really good job to get the right workers.\n\"Because if you are not working with the right people, it can really affect people's mental health and their whole life.\"\n'We desperately need reform '\nLisa Summers\nBBC Scotland health correspondent\nThe government has been announcing the scrapping of much of its controversial National Care Service.\nBut what do people at the sharp end think of the current system?\nMark Hoolahan, the chief executive of the Thistle Foundation in Edinburgh's Craigmillar, says: \"We desperately need reform, so to be four years beyond the review into social care is deeply disappointing.\n\"The Scottish government could be investing more in the social care workforce. We are still in a position where social care workers are paid 15% less than people who work in equivalent roles in the NHS and that's outrageous really.\"\nI hope this pause allows time for discussion, says Todd\nBefore the session winds up, Scottish Lib Dem leader Alex Cole-Hamilton criticises the amount of money \"wasted\" on the government's controversial plans.\nHe says every year spent building the National Care Service is time the minister could have spent improving the care system.\nCole-Hamilton asks whether the minister will apologise to people stuck in hospital waiting for a care package, to community carers unable to offer support due to a lack of time and the families who do not have the wrap-around care they need.\nThe minister says thousands of people who use the care service in Scotland have said things need to change, while pressing for the Scottish government to continue with the creation of the National Care Service.\nTodd adds: \"I hope that this pause and this further clarity on what it is we're trying to achieve with primary legislation will enable those parties who have been opposed to change from the very conception will come round the table and contribute to shaping the change we need to see in Scotland.\"\nWhy is social care so critical?\nLisa Summers\nBBC Scotland health correspondent\nAsk any A&E doctor what would make the biggest difference to the pressures they face in overcrowded emergency departments, and they will tell you - sort out social care.\nAround 2,000 beds each day in Scotland are taken up by patients who no longer need to be in hospital. To put that in perspective, the biggest hospital in the country, the Queen Elizabeth University Hospital has 1677 beds.\nThese are all people who are well enough to go home but who are stuck in hospital because of a lack of appropriate social care.\nIt leads to patients spending hours in A&E because there is no space on wards, or waiting in the back of an ambulance that cannot get back out on the road.\nExperts say investing in more resources for social care not only frees up space in hospital, but it is vital to the individuals who receive it.\nIt allows them to live fuller and more independent lives. It helps them stay well and ultimately reduces hospital admissions.\nGreen MSP welcomes 'small but positive' changes to social care\nGillian Mackay says she hopes this announcement will allow small but positive changes to social care.\nThe Green MSP asks how the work of the lived experienced groups will be retained and how it will contribute to ongoing reform of social care.\nShe asks whether the right to information and advocacy originally in part one of the bill will now be put into the bill elsewhere.\nThe minister replies she recognises the voices of the lived experienced is vitally important.\nTodd adds she will be happy to engage with the MSP on advocacy as the bill progresses.\nTodd defends spending on National Care Service\nJackie Baillie says three years on and with £30m of taxpayers' money have been spent on this bill, the National Care Service is no more.\nShe says the money could have funded care packages, which could have funded an extra one million hours of care.\nBaillie recalls Humza Yousaf's statement that the creation of the National Care Service would be the most significant public sector reform since the creation of the NHS and be operational within the five-year lifetime of the parliament.\nShe asks the minister whether it's time for Health Secretary Neil Gray to follow Yousaf and resign.\nMaree Todd says the government has delivered on a 25% funding increase for social care in this parliament two years early.\nShe says, for context, the £30m spent on the National Care Service was spent in a system where £5bn is spent annually.\nTodd adds: \"I don't think it's unreasonable to spend 0.2% of a budget to achieve change in a system that all of us agree is not currently working.\"\nTory MSP says plan has been 'fatally flawed' from the start\nIt is now the turn of Brian Whittle to challenge Maree Todd on the whole concept of a National Care Service.\nThe Tory MSP argues the government ignored the social care sector and their plan was \"fatally flawed\".\n\"How can the sector trust that this Scottish government will ever listen to their expert opinions again?\" he says.\nThe minister hits back, arguing she works very closely with the sector and everyone agrees change is needed.\nWhat part of the National Care Service has the government scrapped?\nAs we have been reporting, the largest and most controversial part of the National Care Service has been ditched.\nThe flagship scheme would have transferred responsibility for social care away from councils to a new national body.\nThe legislation aimed to centralise adult social care and social work - delivered by local authorities - into a single body ultimately accountable to ministers.\nBut the government could not get the support of the unions or the industry and it has now been scrapped.\nCare workers will have parity with NHS workers, says Todd\nBack in the Holyrood chamber, Todd says it is \"essential\" to continue support for the workforce and the government is committed to fund the real living wage for adult in social care workers.\nShe says there will be a sense of professionalism built into the sector, improving parity with the NHS workforce.\nAt local level, integration joint boards will continue to plan and oversee community health with consideration to ensure the voice of lived experience is heard to increase accountability and transparency.\nThe minister says she will also work with Highland partners who have ended their model of integration to align with the rest of Scotland's integration joint board model.\nThe route to a National Care Service\nAndrew Kerr\nBBC Scotland political correspondent\nThe Covid pandemic was perhaps the most critical issue which helped spur on the creation of a National Care Service.\nThe care sector was frequently in the national spotlight in those times – almost five years ago now.\nThe focus was on care homes at the time - but most social care is given in homes and local communities.\nThe then-First Minister Nicola Sturgeon commissioned a review of adult social care by a former senior civil servant, Derek Feeley, in September 2020\nA National Care Service was proposed which would basically help national and local services work better together, lift care standards across the country to an appropriate level and ensure staff were properly rewarded.\nLaudable aims no doubt – but, in short, the plans that were put together lost the support of unions and councils while a number of heath boards voiced concerns.\nThe Scottish government now proposes more piecemeal changes to achieve improvements instead of a grand re-design.\n'The SNP government could not run a bath'\nSandesh Gulhane tells the chamber almost £30m has been wasted which could have paid for the salaries of 1,200 social care workers.\n\"This bill was fatally flawed,\" continues the Tory MSP and he accuses the minister of being \"hapless and tone deaf\" in her statement.\nHe also accuses the government of \"arrogance, failure and sheer waste\" and adds \"the SNP government could not run a bath\".\nHe calls on Maree Todd and Health Secretary Neil Gray to \"do the right thing and resign\".\nThe minister insists she has listened very carefully and everyone is agreed change is needed in social care.\nTodd argues the Tories have not come forward with a single alternative idea and she insists she has removed the most contentious parts of the bill.\nHow the unions and councils lost faith in the care service plan\nThe government's plans for a National Care Service were dealt a significant blow in October last year when Scotland's largest trade union body withdrew its support.\nThe Scottish Trades Union Congress (STUC) wrote to Health Secretary Neil Gray to raise concerns at the lack of funding for social care workers.\nIt said plans for a National Care Service had lost support from stakeholders across Scotland and urged the government to focus its attention on addressing the \"immediate issues\" in social care.\nCouncil body Cosla had withdrawn its support for the proposals the previous month month.\nIt said council leaders had concerns about the proposed legislation and that several organisations - including those in the care sector - had expressed doubt over the government's approach.\nMinister explains roles of advisory board\nMaree Todd says the advisory board will have a wide remit, providing advice on national programmes intended to support improvement, implementing a person-led approach and working to reduce the number of people in delayed discharge and the drugs mission.\nShe says she will also work with people with high levels of need across current organisational and geographical boundaries and empowering people to understand their rights by publishing the charter of rights.\nThe minister says work will also take place to overhaul eligibility criteria in social care.\nCare service advisory board to start meeting in March\nThe justice secretary says she will move quickly to introduce a National Care Service advisory board.\nTodd says it is her intention the board will consist of unpaid carers, those who work in the care sector, care providers, trade unions and local government.\nShe says she expects the board to meet for the first time in March 2025 with the chairperson to be someone independent, ideally with lived experience of accessing or providing care themselves to hold the Scottish government and other partners to account.\nMinister commits to enshrining Anne's Law in the bill\nThe minister turns to the proposed Anne's Law, which would allow people in care homes to receive visits from a named love one even in restricted measures.\nIt is named after Anne Duke, who died aged 63 in November 2021 after being cut off from her family while battling early-onset dementia during the Covid pandemic.\nHer family has campaigned for a change in the law, which was put into national standards in March 2022.\nA proposal for a national social work agency to provide a national standard for that area of care is expected to pass too.\nThe minister says she is commited to enshrining Anne's Law in the bill.", "url": "https://www.bbc.com/news/live/crke2x7kdx5t"}