{"authors": ["Esme Kenney", "www.facebook.com"], "date_download": "2025-04-26 06:47:24", "date_modify": "2025-04-26 06:47:24", "date_publish": "2025-03-01 12:14:20", "description": "Cowley locals say they have had \"hostile\" interactions with drivers cutting through Marsh Park.", "filename": "news_articles_c93k404pxnqo_1745650044.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/241f/live/05969ff0-f687-11ef-93d4-53054053c79d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93k404pxnqo_1745650044.html", "title": "Oxford residents fear safety as motor vehicles use park shortcut", "title_page": "Oxford residents fear safety as motor vehicles use park shortcut - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents have raised fears that mopeds and motorbikes cutting through an Oxfordshire park are a threat to safety.\nLocals say the vehicles, many of which are used for deliveries, routinely go through Marsh Park in Cowley, Oxford, as a shortcut.\nThe park is used by walkers, cyclists and young children walking to Oxford Spires Academy and Tyndale Community School.\nOn Thursday, Oxfordshire County Council approved the addition of a number plate recognition camera to Barracks Lane near the park to enforce existing restrictions.\nOne local resident said he had seen a lot of mopeds and motorbikes cutting through the footpath past the garages between Barracks Lane and Leafield Road.\nHe said: \"I have nearly been knocked over by a delivery motorcycle cutting through illegally and I am concerned it is only a matter of time before someone is injured, especially as this is a popular cut through for children to get to the local schools.\"\nAnother resident said there had been \"hostile interactions\" with moped drivers.\n\"We regularly have to pull the children aside, as moped riders scream through the gap between homes, bollards and driveways,\" he said.\n\"Those delivery drivers are working hard, providing a service to the people of Oxford, but the shortcuts are too tempting.\n\"It unsafe for them, and unsafe for us.\"", "url": "https://www.bbc.co.uk/news/articles/c93k404pxnqo"}