{"authors": ["Chrissie Reidy", "Hsin-Yi Lo", "www.facebook.com"], "date_download": "2025-04-26 07:40:20", "date_modify": "2025-04-26 07:40:20", "date_publish": "2025-02-27 12:24:21", "description": "A sexual abuse survivor says charities are at risk from increased National Insurance contributions.", "filename": "news_articles_cy4l8ej590lo_1745653220.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8b74/live/a1d18fa0-f502-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4l8ej590lo_1745653220.html", "title": "Sussex charities 'at risk' from National Insurance hike", "title_page": "Sussex charities 'at risk' from National Insurance hike - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A sexual abuse survivor says vital charities are at risk from the government's plans to increase employers' National Insurance (NI) contributions.\nLaure was six-years-old when she was sexually abused. As a result she left France and arrived at Survivors' Network in Brighton.\n\"Just knowing they believed me and just being in a room with other people who understood what I went through made a huge difference,\" she said.\nLaure says she is concerned the increase in NI will impact victim support charities' ability to deliver vital services.\nShe said: \"These services are limited. I feel really sad because these charities are truly saving lives.\"\nEmployers have been paying NI of 13.8% of annual salaries of £9,100 or more, but from April that will increase to 15% on annual salaries above £5,000.\nKatie Kempen, chief executive of Victims Support which has offices across the South East, says \"years of stagnant funding\" has severely impacted its ability to deliver vital services.\n\"There's simply no fat left to trim, so sadly we have no other option than to cut really vital support services that help victims of crime cope, recover and move forward after trauma,\" she said.\nMs Kempen is calling for the government to fund the increases in NI charges.\nKaty Bourne, police and crime commissioner for Sussex, is giving charities she supports an extra £100,000.\nShe said: \"I don't think the government put any thought into this. The charity sector is very reliant on grants so having to pay more for the staff they employ will affect their services.\n\"In Sussex we have an amazing patchwork of different charities. Fundamentally this is not a political issue for me, this is about what is right for our voluntary sector.\"\nMs Kempen says she is \"grateful\" for Ms Bourne's funding boost.\n\"This helps compensate for those additional costs, and it means the victim services in Sussex can continue to thrive.\"", "url": "https://www.bbc.co.uk/news/articles/cy4l8ej590lo"}