{"authors": ["Galya Dimitrova", "www.facebook.com"], "date_download": "2025-04-26 06:36:33", "date_modify": "2025-04-26 06:36:33", "date_publish": "2025-02-27 06:02:24", "description": "Councillors say they would like to see government plans to end badger culling brought forward.", "filename": "news_articles_c62z7de223eo_1745649393.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2cd2/live/84afca70-f432-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62z7de223eo_1745649393.html", "title": "Council reaffirms opposition to badger culling", "title_page": "Oxfordshire County Council reaffirms opposition to badger culling - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has reaffirmed its opposition to badger culling as a means of eradicating bovine tuberculosis (TB).\nOxfordshire County Council last year voted to end badger culling on council-owned land.\nLib Dem and Green councillors had branded the practice as \"inhumane\" while opposition councillors said it could be effective in tackling bovine TB.\nThe government said it was working on a TB eradication package which included establishing a new field force to \"increase badger vaccination at pace\".\nThe government announced last year that badger culling would end in England within five years, with the aim of eradicating bovine TB by 2038.\nAs part of a new strategy, badgers will be vaccinated instead of killed and work to develop a separate vaccine for livestock will also be stepped up.\nSpeaking at a cabinet meeting to review the council's decision in December to ban culling on its land, Greens group leader Ian Middleton said that \"hundreds of thousands of badgers, including over 8,000 in Oxfordshire, have been needlessly killed and injured using public funds\" since 2018.\nHe insisted the policy was \"not about disadvantaging farmers\" but said culling \"has been shown not to be an effective measure in controlling bovine TB\".\n\"The focus should instead be on better herd-based measures and accurate forms of testing which can control the disease more humanely and far more effectively,\" he said.\n\"We simply can't go on destroying our wildlife forever.\"\nA council report, external stated that the among the agricultural land the council owns or leases, there were three tenants who keep beef cattle and no land was used for dairy farming.\nCouncil leader Liz Leffman said she had written to the Department for Environment, Food and Rural Affairs (Defra) expressing the council's continued opposition to the cull.", "url": "https://www.bbc.co.uk/news/articles/c62z7de223eo"}