{"authors": ["Matthew Barlow", "www.facebook.com"], "date_download": "2025-04-26 07:04:36", "date_modify": "2025-04-26 07:04:36", "date_publish": "2025-02-28 06:46:44", "description": "A community group wants to create a museum in the building where John Flamsteed lived.", "filename": "news_articles_cm2jjvdjv2vo_1745651076.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a344/live/e179ddb0-f525-11ef-ba6e-5dc164a31f2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jjvdjv2vo_1745651076.html", "title": "Museum could honour famed city astronomer", "title_page": "Museum could honour famed city astronomer - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A community group in Derby has unveiled a vision to create a museum at a historic building where the celebrated astronomer John Flamsteed once lived.\nThe Friends of 27 Queen Street want to turn the city centre property into a museum with community astronomical activities in its gardens.\nHowever the owners of the building, which was made Grade II listed last year, are planning to convert it into accommodation.\nOther significant historic figures who have lived at 27 Queen Street, which is currently unoccupied, include the artist Joseph Wright and the clockmaker John Smith.\nJuliet Hemingray, artistic director of The Friends of 27 Queen Street, said it was important Flamsteed's life was marked as he was the creator of Greenwich Mean Time.\n\"Every clock in the world is against the Greenwich Meridian, which had its early stages in that back garden when Flamsteed made his calculations,\" said Ms Hemingray.\n\"When we get up in the morning and we look what time it is, it is all based around Greenwich Mean Time.\"\nShe said she wanted the house to be a \"creative hub\" that would celebrate astronomy and offer telescopes for people to use.\n\"I can just imagine events in the garden like small concerts based on the music of the 17th Century with 17th Century food,\" she added.\nMs Hemingray said her group would be exploring grants and public donations to pay for the building but this was still at an early stage.\nThe property is owned by the Dewinter family who are working with an unnamed developer on a plan to build accommodation in the garden.\nRussell Rigby, managing director from Rigby & Co, who is acting agent for the family, said plans for the building had not yet been submitted but were at an advanced stage.\nHe said he had not heard anything from the community group about its idea but added: \"If they reach out, we are happy to talk.\"\nThe group is also planning another celebration of Flamsteed, with a walk from the house to the mosaic outside Derby Cathedral marking his life in honour of the 350th anniversary of him being made Astronomer Royal.", "url": "https://www.bbc.co.uk/news/articles/cm2jjvdjv2vo"}