{"authors": ["Archie Farmer", "www.facebook.com"], "date_download": "2025-04-26 07:39:03", "date_modify": "2025-04-26 07:39:03", "date_publish": "2025-02-27 13:28:38", "description": "The AAIB finds there was \"miscommunication\" as the Jump Air flight approached Guernsey in thick fog.", "filename": "news_articles_c9844j17ldyo_1745653143.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a476/live/334f5550-f50a-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9844j17ldyo_1745653143.html", "title": "Jump Air pilot confusion caused Guernsey Airport incident", "title_page": "Jump Air pilot confusion caused Guernsey Airport incident - AAIB - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An investigation into a serious incident involving a plane attempting to land in fog found \"confusion and miscommunication\" between the crew.\nA Jump Air flight from Southampton was on the approach to Guernsey Airport in August when it descended below the minimum height allowed during poor visibility.\nThe report by the Air Accidents Investigation Branch (AAIB), external found there was confusion between the pilot and co-pilot which resulted in delays to the plane making a climb.\nIt then diverted and landed safely back at Southampton Airport.\nThe AAIB said the operator had taken a number of safety actions since the incident.\nGuernsey airline Aurigny said the flight was being operated by Jump Air - an aircraft, crew, maintenance and insurance (ACMI) or \"wet lease\" provider.\nA spokesman said this was commonplace and typically used by airlines to increase capacity during peak periods or when its fleet capacity is impacted.\nIt added: \"We are encouraged by the report findings that Jump Air has implemented a number of changes since the incident.\n\"We are very glad all those involved are safe and the safety and welfare of our customers and crew is always our priority. We will work closely with regulatory bodies and ACMI operators accordingly.\"", "url": "https://www.bbc.co.uk/news/articles/c9844j17ldyo"}