{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 06:14:42", "date_modify": "2025-04-26 06:14:42", "date_publish": "2025-03-02 00:04:06", "description": "Those who knew him discuss his brilliance, as well as his disdain for the trappings of Hollywood.", "filename": "news_articles_cvgwwyrnpzdo_1745648082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d5ac/live/091466f0-f685-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgwwyrnpzdo_1745648082.html", "title": "Gene Hackman 'loved acting and hated everything that went with it'", "title_page": "Gene Hackman 'loved acting and hated everything that went with it' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"He loved being an actor, and hated all the stuff that surrounds being an actor.\"\nThat, for film director Barry Sonnenfeld, is how he'll remember Gene Hackman, who has died at the age of 95.\nThe endless hours in hair and makeup, repeated takes, and studio notes all frustrated Hackman, Sonnenfeld told BBC News.\nSo too did actors who showed up not knowing their lines - notably John Travolta, who Hackman clashed with on the set of 1995 film Get Shorty, which Sonnenfeld directed.\nIn the days since the news of Hackman's death, I've been speaking to people here in Los Angeles and beyond, who, like Sonnenfeld, knew and worked with him.\nWhat's immediately clear is how seriously Hackman took acting, and how meticulously he dealt with scripts.\nBut what's also clear is that he was wary of the trappings of Hollywood.\nHackman, a two-time Oscar winner, died alongside his wife Betsy Arakawa, 65, and their dog at his home in New Mexico. No cause of death was given, but police said the situation was \"suspicious enough\" to merit investigation.\nOfficials said on Friday that evidence points to Hackman having been dead since 17 February, 10 days before the couples' bodies were found.\nIn LA, Hackman's face is everywhere on television bulletins and on newspapers.\nHis death was all anyone was talking about as stars gathered for pre-Oscars parties.\nI was at one of those events on Thursday night, where the American actor John C Reilly told me that he expected the Academy to commemorate Hackman on Sunday. \"I don't see how you could have the Oscars without mentioning a great like him who's passed.\"\nFor Sonnenfeld and for the Irish director John Moore – who directed Hackman in 2001's Behind Enemy Lines – it was Hackman's way of dealing with scripts that demonstrated his brilliance. He would remove all of the scriptwriter's notes about how his character should deliver his lines.\n\"Because he didn't want any screenwriter to tell him how he was supposed to feel at that moment,\" Sonnenfeld said.\n\"So he had unique cut and pasted scripts that had no information from the writer about anything, because he wanted to make those choices, not the writer.\"\nMoore recalls a similar incident from the very first time he filmed with Hackman.\n\"He was just quietly sitting there, taking script pages out, cutting them up, removing extraneous stuff like scene descriptions, and then sticking them back onto blank pages,\" he said.\nHe said Hackman told him: \"Acting is my job, you do the rest.\"\n\"It put the fear of God into me,\" Moore said, laughing.\n\"It was essentially him saying: 'I don't need anything, as I'm that good. You better bring your A-game, as I'm bringing mine.'\"\nIt wasn't just superfluous studio notes that bothered Hackman.\n\"He had this conflict in that he was this brilliant actor but he hated the tropes of what it took to act in movies,\" said Sonnenfeld.\n\"[He] hated putting on makeup. The putting on of wardrobe. The wardrobe person after takes, taking their lip brush and rubbing down their wardrobe. The makeup person recombing his hair while he's talking to me,\" he said.\n\"All that sort of fussy hair and makeup and all that stuff, I think that drove him crazy.\"\nNor did he often want to socialise after filming, said Moore.\n\"I'd try and have a drink with him after we'd shoot, and go up to the minibar,\" he said.\n\"He'd have one, that was it. [Betsy] would give him that look, and off it would be to bed. And he was in great shape in the morning as a result.\"\n\"For Gene, it was all about the acting,\" added Sonnenfeld. \"End of story. Get me out of here as fast as possible.\"\nHackman could be \"a hard actor\" to work with, said Sonnenfeld. \"He suffered no fools.\"\nIn Get Shorty, Hackman starred alongside Travolta, who plays a Miami mobster sent to collect a debt.\n\"Gene was a consummate actor, both technically and artistically. So he came to set every day knowing his lines,\" Sonnenfeld said.\n\"John came to set not knowing his lines, probably not having read the script the night before.\"\nThat resulted in a showdown on the first day of filming.\nSonnenfeld recalls Travolta – who he describes as \"charming but not self aware\" – asking Hackman what he had done on the weekend.\nHackman responded: \"Nothing except learn the lines,\" to which Travolta replied, \"Well that's a waste of a weekend,\" according to Sonnenfeld.\nAs filming went on, Hackman grew \"angrier and angrier\" at his co-star not knowing his lines.\nSonnenfeld said he let Hackman take out his rage on him.\n\"For the next 12 weeks, he would yell at me whenever John didn't know his lines,\" he said.\n\"But he's great in a movie. And I knew he was never really mad at me.\"\nHackman retired from acting in 2004 and from then on lived a quiet life in New Mexico with his wife.\n\"I suspect that one of the reasons he moved to Santa Fe, again, great outdoors and as far away from Hollywood as you can get,\" said Sonnenfeld.\nIn 2008, Hackman gave a rare interview with Reuters, in which he was asked if he missed acting, external.\nHe responded by saying the business was, for him, \"very stressful\".\n\"The compromises that you have to make in films are just part of the beast, and it had gotten to a point where I just didn't feel like I wanted to do it anymore.\"\nBut, he added: \"I miss the actual acting part of it, as it's what I did for almost 60 years.\n\"And I really loved that.\"", "url": "https://www.bbc.co.uk/news/articles/cvgwwyrnpzdo"}