{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:25:32", "date_modify": "2025-04-26 07:25:32", "date_publish": "2025-02-28 00:21:04", "description": "The Scots pop icon will be joined by Nina Nesbitt and Eddi Reader at this summer's HebCelt.", "filename": "news_articles_c86ppj62ve2o_1745652332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f679/live/4c336950-f4f4-11ef-ab77-6b27a1316238.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86ppj62ve2o_1745652332.html", "title": "Lulu headlining HebCelt festival where 70% of acts will be female", "title_page": "Lulu headlining HebCelt festival where 70% of acts will be female - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scots pop icon Lulu is to headline a music festival where 70% of the acts will be female-led or have female members.\nOrganisers of HebCelt said they had ensured at least a 50:50 gender balance every year since 2014.\nSinger-songwriter Nina Nesbitt, who has been supporting Snow Patrol on tour, and Brit Award-winning musician Eddi Reader are among the other female acts due to perform in Stornoway, Lewis, in July.\nThere has been criticism in recent years of male domination of the music industry and some festival line-ups.\nMore than 30 performances have been confirmed for the main line-up, but the overall number of acts is expected to rise to more than 40 once fringe events have been confirmed.\nLulu, who has had top 10 singles since the 1960s, is known for her debut hit Shout and in the 1990s performed the song Relight My Fire with boy band Take That.\nShe was a headliner at last year's Glastonbury festival.\nLulu said she was looking forward to visiting the Western Isles this summer.\nJosie Duncan, who will be playing with her band at HebCelt, told BBC Naidheachdan: \"I can hardly believe that Lulu is going to be in Stornoway.\n\"Maybe we will see her in the pub.\n\"But it is just mad to think that a local like myself gets the chance to be on stage alongside these incredible acts, such as Eddi Reader.\"\nDuncan said she hoped other festivals would follow HeCelt's example of greater representation of female talent.\n\"I think it has become so normal to see line-ups that are all-male that we don't even notice it,\" she said.\n\"This is something different.\n\"I personally think it should be just as normal.\"", "url": "https://www.bbc.co.uk/news/articles/c86ppj62ve2o"}