{"authors": ["Danny Fullbrook", "www.facebook.com"], "date_download": "2025-04-26 06:59:09", "date_modify": "2025-04-26 06:59:09", "date_publish": "2025-02-27 05:45:25", "description": "Chloe Webb now runs a specialist store - and travels the world buying and selling Pokémon cards.", "filename": "news_articles_crmj2grl04vo_1745650749.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9bb6/live/c3c69470-f435-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crmj2grl04vo_1745650749.html", "title": "The YouTubers who brought Pokémon to Chorleywood", "title_page": "The YouTubers who brought Pokémon to Chorleywood - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Chloe Webb was explaining how she recently sold a Pokémon card in her shop for £40,000 when a young boy and his dad politely interrupted to ask for her autograph.\nEver since the 31-year-old quit her office job and opened Collector's Cardhouse in the picturesque Hertfordshire village of Chorleywood in April, it has become a destination for fans around the world.\n\"Every week we have an international visitor - Japan, America, United Arab Emirates - I've made so many friends all over the world, which is crazy to me because I never used to leave my little bubble when I had a normal job,\" she says.\n\"I live, breathe, and eat Pokémon.\"\nThe Japanese franchise started life in 1996 on the Nintendo Game Boy, with players having to catch, train and battle virtual monsters called Pokémon.\nWhen it arrived on UK shores in 1999, it had evolved.\nThere was an animated series and packets of trading cards were available at most newsagents across the country. That's when Mrs Webb, from Watford, became a fan.\nShe began a business with her husband, Harry, selling the cards online just before the pandemic. During lockdown, it \"really blew up\".\nIn recent years, Pokémon cards have become valuable collectors' items and many shop visitors hope they too could be sitting on a gold mine.\nLast year, a Nottinghamshire man made £55,000 when he sold a collection of cards from the 1990s and 2000s.\nBut a collector from Suffolk failed to sell his fourth print Charizard card when it did not reach its reserve of £8,000.\nMrs Webb explained: \"It could be anything that makes a card collectable.\n\"It could be that they're rare... It could be that it's a really popular Pokémon.\n\"Sometimes overnight prices change on cards and I can't tell you why that card is now valuable.\"\nSometimes cards worth up to £100,000 have been brought into the shop, although PokiChloe admits the big sums no longer surprise her.\n\"It's going to sound really awful: I'm very used to it now,\" she says.\n\"It is very surreal to think that this little bit of cardboard is worth that sort of money because to some people that's a deposit for a house - that could buy them two or three cars.\n\"But with what we do now we're exposed to it. Often it's just another day and another Pokémon card.\"\nMany of the visitors who arrive at Collector's Cardhouse come with large binders tucked under their arms filled with cards they stashed away in their childhood.\nMany of these collections are, unfortunately, not worth anything.\nIf, however, PokiChloe does deem a card valuable, it then has to be \"graded\".\nThe process involves sending the card to a grading company who analyse it for signs of wear and then award it a graded score, usually out of 10, which denotes its quality and potential value.\nPokiChloe compared those cards that get a 10 to \"gold dust\".\n\"It has to be completely clean,\" she says.\n\"There can't be scratches on the holographic part, there can't be any whitening or damage on the back, it can't be creased. It has to be perfect like it's never been touched before.\n\"We had a Charizard that was graded a 10. It was a special card that was given out to employees at Creatures, who own Pokémon. I think there's only 300 of them and we had a 10 and we sold it for just under £40,000.\"\nMrs Webb said a common misunderstanding is that a card has to be old to be valuable.\n\"There are packs that you could open today from the shop that cost you about £30,\" she says.\n\"If you got the best card in the set and it was graded a 10, you'd be looking at a couple of thousand.\n\"And they're cards that only came out a few years ago. So they're not even what we would call vintage. They're modern cards.\"\nA graded card, regardless of how damaged it is, is sealed in plastic to preserve its condition.\nMrs Webb said: \"We get people that send off cards that aren't in good condition. They just want to encapsulate it and keep it as a memory. So that's quite nice to see.\n\"I know the money is a big part of it and obviously people are blown away by the prices, but for some people it's about the memories, the nostalgia and just having some memories from when they were kids.\"\nNext year Pokémon is celebrating its 30th anniversary. PokiChloe has ambitious plans for the future of Collector's Cardhouse.\n\"I want to keep this growing,\" she says.\n\"If you'd asked me about this five years ago I wouldn't have believed it. I used to work in an office, I had a very normal job before this, and now this is my life... So, as long as people enjoy it, I'm going to keep doing it.\"", "url": "https://www.bbc.co.uk/news/articles/crmj2grl04vo"}