{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:54:36", "date_modify": "2025-04-26 03:54:36", "date_publish": "2025-03-04 17:15:30", "description": "A 15-year-old boy denies the attempted murder of a 13-year-old girl on a camping trip last year.", "filename": "news_articles_cy05wwvkxv5o_1745639676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8f6b/live/898634e0-f918-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05wwvkxv5o_1745639676.html", "title": "Boy offered £20 to stab girl, Hull Crown Court court told", "title_page": "Boy offered £20 to stab girl, Hull Crown Court court told  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A jury was told a boy accused of attempting to kill a 13-year-old girl claimed he was offered £20 by a friend to attack her with a samurai-style sword.\nThe 15-year-old allegedly stabbed the victim 10 times while on a camping trip by the A63 in East Yorkshire in November last year.\nHull Crown Court heard she was found covered in blood by passing drivers after staggering on to the road.\nThe defendant, who cannot be named due to his age, denies attempted murder but has pleaded guilty to wounding with intent and possessing a bladed weapon.\nOpening the Crown's case, David Lamb KC told the jury: \"The prosecution say he is guilty of attempted murder because the attack was unlawful and the defendant's behaviour before, during and after the attack showed he meant to kill.\"\nMr Lamb said the victim and the defendant were on a Halloween camping trip by the Humber Bridge with friends, with one of the group taking along the sword.\nThe jury was told a row broke out between the victim and another girl, leading to the victim wanting to leave.\nAnother boy was showing her the way home through the wood when the defendant ran after them and told the other boy to go, the prosecution said.\nMr Lamb claimed this was part of a plan to isolate the victim away from the others.\nHe told the jury that the defendant pretended to go the toilet before he produced the sword from his waistband and began the attack saying: \"I'm sorry I have to do this.\"\nThe girl managed to escape and made her way to the road and the defendant returned to the camping group.\nThe girl suffered wounds to her back, neck, arms and chest causing damage to her lungs. There was also an abdominal wound that penetrated her liver, the court heard.\nA forensic pathologist's report said the victim \"was extremely fortunate not to have lost her life as a result of the assault,\" Mr Lamb said.", "url": "https://www.bbc.co.uk/news/articles/cy05wwvkxv5o"}