{"authors": ["Daisy Stephens", "www.facebook.com"], "date_download": "2025-04-26 06:52:56", "date_modify": "2025-04-26 06:52:56", "date_publish": "2025-02-28 16:53:00", "description": "Residents meet weekly to read short works of literature aloud and then discuss them.", "filename": "news_articles_cwydd99w8q5o_1745650376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f8a8/live/7bdff2b0-f5d8-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwydd99w8q5o_1745650376.html", "title": "Wokingham shared reading aloud book group 'offers escapism'", "title_page": "Wokingham shared reading aloud book group 'offers escapism' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shared Reading is a different kind of book club.\nInstead of reading works of literature separately and then coming together to discuss it, a poem, short story or novel extract is read aloud - and then discussed.\nFiona Dignan, who leads a regular session in Wokingham, Berkshire, said the sessions aimed to make good literature \"available to everybody\".\nFran Whiteman, who has been attending the sessions regularly for over a year, said she got \"joy\" from the meetings, adding the conversation starts at the literature but then often \"explodes\".\n\"It can become a very serious discussion on one aspect of the story or it can be purely anecdotal,\" she said.\n\"It can be a form of increasing your knowledge, sharing your ideas, but it can also be a form of escapism and reminding yourself of things that you think 'oh, I'd forgotten about that' or 'oh, I didn't know I really thought that'.\"\nShe added: \"We read something that was about space and I think we sat for an hour talking about the galaxies and then what lies beyond, do we believe in the world beyond, and at the end I come out feeling really invigorated.\"\nMs Dignan, who runs the group in conjunction with charity The Reader, said it was \"a very different experience to a book club\".\n\"With a book club you've pre-read it all, you've read it in your own head, and you come and say your piece,\" she said.\n\"[But] we're not critiquing this literature, we're saying: as human beings reading this, how are we feeling about this? What is it evoking?\"", "url": "https://www.bbc.co.uk/news/articles/cwydd99w8q5o"}