{"authors": ["Olivia Fraser", "www.facebook.com"], "date_download": "2025-04-26 03:45:41", "date_modify": "2025-04-26 03:45:41", "date_publish": "2025-03-05 06:15:43", "description": "Campaigners welcome proposals to introduce better legal protections for sexual assault victims.", "filename": "news_articles_cpv4jk892xno_1745639141.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d575/live/da7a0d00-f926-11ef-9cc1-0f3c4de978dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4jk892xno_1745639141.html", "title": "Stalking and spiking could become specific offences in Guernsey", "title_page": "Stalking and spiking could become specific offences in Guernsey - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Victims could soon have better legal protection in Guernsey under a proposal to introduce new specific sexual offences, campaigners have said.\nThe Committee for Home Affairs said the new specific offences included spiking, stalking, suffocation or strangulation, female genital mutilation and sexual harassment in a public place.\nPresident Deputy Rob Prow said the measures were \"much-needed in the 21st Century\".\nPoppy Murray, a campaigner and chairwoman of charity SafetyNet, said it was \"reassuring to see these serious issues being given attention\".\nAt the moment, there is no specific offence of stalking in the bailiwick, and it can be charged as harassment.\nMs Murray said: \"These are real concerns in our community, and I believe that the proposed changes will help deter offenders while encouraging victims to come forward and report incidents.\"\nA new offence could see a prison sentence of up to 10 years for more serious stalking involving fear of violence or serious alarm or distress, said the committee.\nThere are also plans to give police and court greater protection to victims and witnesses of these offences.\nThis includes Stalking Protection Orders, which allow the police to address stalking concerns before they escalate, and introducing a register of serial domestic abuse and stalking offenders.", "url": "https://www.bbc.co.uk/news/articles/cpv4jk892xno"}