{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:39:24", "date_modify": "2025-05-19 15:39:24", "date_publish": "2015-02-09 14:49:03", "description": "New double yellow lines painted around a cycle parking space and across a patch of road too narrow for a car to get down are described as \"bonkers\" by traders.", "filename": "news_uk-england-bristol-31291404_1747669164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80882000/jpg/_80882396_img_3473.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-bristol-31291404_1747669164.html", "title": "Clifton new double yellow lines 'bonkers', say traders", "title_page": "Clifton new double yellow lines 'bonkers', say traders - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New double yellow lines painted around a bicycle parking space and across a road too narrow for a car to get down have been branded \"bonkers\" by traders.\nThe lines in Clifton, Bristol, have been painted along with new parking bays ahead of the introduction of a residents parking zone (RPZ).\nBusinesses have staged protests over the scheme with one hiring a tank and driving it through the streets.\nThe markings are \"complete nonsense\", said florist Kika Hedgecock.\n\"Who could or would park there?\" she added.\nNew parking bays have been painted along streets like The Mall, which previously only allowed parking on one side with loading only on the other side.\n\"No-one knows if you can park in them or not - it's chaos,\" said Mrs Hedgecock.\n\"We didn't want this scheme but they're forcing it on us anyway, so why not put the meters in first, then put signs up, then paint the lines in last - that would make sense.\"\nA Bristol City Council spokesperson said: \"The machines will be in place by the time the scheme is officially launched on 16 March.\n\"In the meantime, motorists can park in the bays free of charge.\"", "url": "https://www.bbc.com/news/uk-england-bristol-31291404"}