{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:37:53", "date_modify": "2025-05-19 15:37:53", "date_publish": "2015-02-22 02:45:55", "description": "Scotland's First Minister Nicola Sturgeon calls for the SNP to be included in pre-election talks with the civil service in Whitehall.", "filename": "news_uk-scotland-31565481_1747669073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81148000/jpg/_81148511_sturgeonheywoodcompo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-31565481_1747669073.html", "title": "SNP calls for pre-election civil service contact", "title_page": "SNP calls for pre-election civil service contact - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland's First Minister Nicola Sturgeon has called for her party to be included in pre-election talks with the civil service in Whitehall.\nThe SNP leader has written to top civil servant, Sir Jeremy Heywood, saying all parties who have MPs elected could be involved in the next UK government.\nMs Sturgeon said policy briefing contact should go beyond the main opposition party.\nThe Cabinet Office said it would respond \"in due course\".\nMs Sturgeon said polling evidence indicated a hung parliament would be the outcome of May's general election.\nShe said that could mean political parties with a presence in the House of Commons may be in a position of power and influence.\nBy convention, opposition parties are entitled to enter into confidential discussions with senior civil servants in the run-up to a general election.\nSuch discussions must be sanctioned by the prime minister of the day and are usually limited to the parties that could form a government at Westminster.\nThe talks are intended primarily to allow potential ministers to familiarise themselves with aspects of departmental organisation.\nAnd they allow opposition MPs to inform civil servants of likely changes to the machinery of government if they are elected.\nMs Sturgeon said she understood that Prime Minister David Cameron had written to Labour's Ed Miliband last year offering such pre-election contact.", "url": "https://www.bbc.com/news/uk-scotland-31565481"}