{"authors": ["Sammy Darko", "www.facebook.com"], "date_download": "2025-05-19 15:02:27", "date_modify": "2025-05-19 15:02:27", "date_publish": "2015-02-27 02:47:06", "description": "Ghana has scrapped a controversial ban on newly qualified nurses travelling abroad to find more lucrative employment as it says it has stemmed the brain drain, writes the BBC's Sammy Darko.", "filename": "news_world-africa-31637774_1747666947.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81273000/jpg/_81273230_ghananurses-2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31637774_1747666947.html", "title": "How Ghana has reversed exodus of nurses", "title_page": "How Ghana has reversed exodus of nurses - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ghana's government has scrapped a controversial ban on newly qualified nurses travelling to find more lucrative employment abroad.\nThey introduced it 10 years ago when the West African country was suffering from a shortfall of nurses as many headed off for better opportunities in the West.\nIt began a scheme funding the education of nurses who then had to agree to work for the next five years in Ghana.\nBut now the government says it has enough nurses and it is no longer useful to keep them under bond.\n\"There are now more private schools churning out nurses and some of them can't even find jobs,\" Dr Kwesi Abir, the health ministry's deputy director of human resources, told the BBC.\n\"There is no point to continue to pay the tuition of nurses and also give allowances when hundreds are paying their own fees in private schools,\" he said.\nThe policy reversal is unlikely to lead to an immediate exodus of nurses because although the bond scheme stopped taking new entrants last year, it takes four years to qualify as a nurse and those already in the scheme will have to finish their five-year service.\nIf a nurse wants to jump the bond there is penalty of $650 (£422) to pay for each uncompleted year, something very few can afford to do.\nAnd the authorities will not issue certificates that will enable them to work abroad unless the fine is paid.\nStudent nurse Collins Aboagye says he is in that position - even though he would love to work in the UK after qualifying, he will not be able to.\n\"I think the five years is too much… I wish to work outside because outside, there are certain things their way of delivering care is a bit different from ours here.\"\nThis is a sentiment - a desire for job satisfaction - that is echoed at the country's premiere hospital, the Korle Bu Teaching Hospital in the capital, Accra.\nNurses can be seen under pressure as they attend to patients in the maternity ward - a large hall with about 100 benches filled with women awaiting for antenatal services.\nSome of them are impatient, demanding to be seen more quickly.\nOne of the major difficulties in providing good healthcare is not just the number of healthcare professionals but the fact that hospitals are ill equipped, nurses told the BBC.\nThey say there are insufficient protective plastic gloves, not enough hospital beds for patients, a lack of water and chemicals, frequent power outages - their list is endless.\nHowever, salaries are likely to still be a driving factor for nurses to go abroad given Ghana's rising cost of living.\nAccording to the UK's National Health Service, a newly qualified nurse starts on a salary of more than £21,000 a year, external - with opportunities to earn overtime - that is, at least $2,695 a month.\nA professional nurse in Ghana earns about $400 a month after tax - and nurses often face the frustration of delays in the payment of their salaries.\nThis would stop nurses being tempted to seek employment elsewhere, she said.\nGhana currently has a little more than 20,000 professional nurses.\nEach year about 400 enter the job market but in 2004 almost twice that number - 700 nurses - left to work in the UK.\nGhana's health ministry says these numbers have dramatically declined with only about 300 nurses leaving in the last two years.\nBehind the numbers, there are grave concerns about the quality of healthcare delivery.\nAnd there is a down side for students from poorer backgrounds who will no longer be able to benefit from the government-funded scheme.\nBut with the brain drain stemmed, health officials are optimistic that the funds used in nurse training can now be used to address long waiting hours and improve hospitals.", "url": "https://www.bbc.com/news/world-africa-31637774"}