{"authors": ["Vikki Irwin", "Sarah Lilley", "www.facebook.com"], "date_download": "2025-04-26 06:26:51", "date_modify": "2025-04-26 06:26:51", "date_publish": "2025-02-28 19:50:07", "description": "Adrian Ramsay gives his views on solar farms, pylons, traffic and devolution.", "filename": "news_articles_c4g00nnre23o_1745648811.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/545e/live/029e0cc0-f600-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g00nnre23o_1745648811.html", "title": "Five takeaways from Waveney Valley MP's hotseat", "title_page": "Five takeaways from Waveney Valley MP's hotseat - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "MP and Green Party co-leader Adrian Ramsay has been in the hotseat on BBC Radio Suffolk.\nHe was elected in July 2024 to the new constituency of Waveney Valley, which spans both Suffolk and Norfolk.\nRamsay took questions from listeners and presenter Sarah Lilley.\nRead the five takeaways from the show below or listen to the full interview here.\nAs a party co-leader and MP, Ramsay said he was \"busy\" but he was \"first and foremost\" there to represent the people of Waveney Valley.\nHe told BBC Radio Suffolk that constituents said they wanted an active MP who was visible across the area.\n\"I am certainly doing my best every week to speak up for local concerns in Westminster,\" he said, before adding he felt \"much more at home when he was back in Suffolk and Norfolk\".\nKelly Ling, from Eye, asked how safe battery substations were, after EcoPower Suffolk released plans to build one.\nIt wants to create a new energy farm and battery storage facility on 1,500 acres (607 hectares) of land near Eye and at an existing substation north of Yaxley.\nRamsay said there needed to be \"solar on land\" if clean energy was going to be delivered and bills reduced.\nHe said he preferred to see solar put on brownfield, car parks and buildings in the first instance.\nPressed on how safe the battery storage facilities were, he said: \"I don't have any strong evidence to suggest we should be worried about the safety.\n\"But I would expect to see testing and also certification of how the installations are done.\"\nRamsay spoke about National Grid's proposals for pylons between Norwich and Tilbury.\nThe utility company had previously considered laying cables underground through Waveney Valley, however, it now said it preferred them to be installed on land.\nRamsay said: \"We do need to improve the capacity of the grid and we will all benefit from that - it's just how best to do that.\n\"I want to see a proper consideration of all the options, including the potential to underground on some, or all of the route.\n\"That is something I have pressed the government both publicly and privately to do.\"\nBut he said he was not convinced the government was \"listening\".\nA limit on heavy goods vehicles (HGVs) was in place for 12 months in Eye.\nJon Betts, director at the Bank Arts Centre, wanted to know if it could be reintroduced.\nHe said lorries were \"getting stuck, buildings were being clipped and pavements mounted\".\nRamsay said he was \"heavily involved\" in this issue and aware of the safety concerns.\nHe said he had a meeting with Suffolk County Council and it was \"clear\" the scheme \"would not be reintroduced\".\nThe authority had previously said the trial was not made permanent, as it moved traffic to surrounding villages like Debenham, Hoxne and Stradbroke.\nRamsay said the council did pledge to have a meeting with Eye Town Council about the issue to \"offer up other solutions\".\nThe MP added: \"[It] remains to be seen if those solutions will fully address the issues.\"\nThe BBC has contacted Suffolk County Council for further comment.\nPresenter Sarah Lilley asked Ramsay how he wanted to see Suffolk \"carved up\" under the devolution deal and council reorganisation.\nRamsay said he agreed with devolving power from government to local communities and strongly supported the principle of giving local communities more power and more funding.\nBut he was not so supportive of the government's planned reorganisation of local councils.\nIn Suffolk and Norfolk, the shake up would mean the scrapping of all councils and replacing them with unitary authorities.\nConservative-led Suffolk county Council has said it would be backing a single unitary authority for the county.\nRamsay said: \"Without a change in the way funding for local government is done I am deeply concerned about the proposals and I am against having a Suffolk-wide unitary authority.\"", "url": "https://www.bbc.co.uk/news/articles/c4g00nnre23o"}