{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:02", "date_modify": "2025-05-19 14:52:02", "date_publish": "2015-02-02 12:55:09", "description": "New Saudi Arabian pan-Arab news channel Alarab stops scheduled broadcasting less than 24 hours after going on air from studios in Bahrain.", "filename": "news_world-middle-east-31090848_1747666322.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80721000/jpg/_80721837_hi025699437.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-middle-east-31090848_1747666322.html", "title": "Saudi Alarab TV channel halts hours after launch", "title_page": "Saudi Alarab TV channel halts hours after launch - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new Saudi Arabian pan-Arab news channel has stopped scheduled broadcasting less than 24 hours after going on air from studios in Bahrain.\nAlarab TV, owned by billionaire Saudi businessman Prince Alwaleed bin Talal, launched with the promise of politically independent news coverage.\nOne of its first guests was a prominent Bahraini opposition figure, drawing criticism from pro-government media.\nAlarab said it had stopped for \"technical and administrative reasons\".\nThe channel reverted to showing promotional video and said it would be \"back soon\".\nBahrain's information ministry said: \"Progamming at Al-Arab satellite channel has been temporarily suspended for administrative and technical purposes.\n\"The Information Affairs Authority continues to work alongside Al-Arab's management team in order to swiftly resolve the matter, which is expected to see broadcasting resume shortly.\"\nBahrain daily, Akhbar al-Khaleej, claimed the suspension was due to the channel \"not adhering to the norms prevalent in Gulf countries\".\nKhalil Marzook, a prominent critic of Bahrain's ruling Sunni royal family, appeared in an initial sequence on the channel.\nDuring the interview, Mr Marzook discussed the Bahraini government's decision on Saturday to strip 72 people of their citizenship.\nLast year Mr Marzook, assistant secretary general of Bahrain's main opposition group, Wefaq, was cleared of charges including \"inciting terrorism\".\nBahrain has been wracked by unrest since a Shia-led uprising in 2011 pushing for greater rights from the Sunni-led government.\nAlarab is the latest pan-Arab TV channel to enter the market, following the likes of Qatar's Al-Jazeera and Saudi Dubai-based Al-Arabiya.\nJamal Kashoggi, Alarab's general manager, told AFP the channel had chosen to transmit from Bahrain because Saudi Arabia did not allow \"independent\" channels.", "url": "https://www.bbc.com/news/world-middle-east-31090848"}