{"authors": ["Riyah Collins", "www.facebook.com"], "date_download": "2025-04-26 03:38:10", "date_modify": "2025-04-26 03:38:10", "date_publish": "2025-03-05 01:14:48", "description": "The Go singer says she's entering a \"new era\" where she's comfortable sharing her love for women.", "filename": "news_articles_cdxerx9rkpzo_1745638690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/173b/live/169793e0-f81c-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdxerx9rkpzo_1745638690.html", "title": "Cat Burns: 'I never had music for queer girls'", "title_page": "Cat Burns: 'I never had music for queer girls' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"I just wanna talk about girls.\"\nCat Burns couldn't be clearer about what's on her mind in her new track.\nCalled - you guessed it - Girls! she says it marks a shift from her more \"serious\" records and is her shot at writing music she didn't have access to growing up.\n\"I feel like I never had a song like that for me,\" she says. \"Especially for all the queer girls.\"\nShe says she's leaning into a new era where she feels increasingly confident celebrating her sexuality.\nThe singer, 24, has enjoyed in meteoric rise in the past few years.\nHer single Go, first released in 2020, became a viral hit on TikTok in 2023 - rising to number 2 in the charts, propelling Cat on to a Brits Critics' Choice award nomination later that year.\nShe tells BBC Newsbeat having songs like that is \"super important\", especially growing up and figuring out who you are.\n\"It's nice to know that people like you exist and exist freely,\" she says.\n\"And I think the 'fun-ness' of the song can show people who aren't lesbian or queer or bi or whatever that we are just normal human beings who like just so happen to like the same sex.\"\nIn the past year, the charts have been dominated more than once by queer women writing openly about gay relationships.\nChappell Roan's Good Luck, Babe! tells the story of being in love with a woman struggling to come to terms with their sexuality and spent 16 weeks in the UK top 10.\nAnd after Billie Eilish claimed she was \"outed\" by Variety magazine in 2023, she followed up with her album Hit Me Hard and Soft, including the single Lunch which explored her desire for women.\nBillboard described the track, which peaked at number two in the UK chart, as \"a glorious queer awakening\". , external\nBefore that though, there's been slim pickings for mainstream pop songs that celebrate authentic lesbian relationships.\nTake, for example, Katy Perry's 2008 debut I Kissed A Girl.\nIt's \"a brilliant pop song\", Cat says, but doesn't go any deeper than the first stage of exploring sexuality.\n\"I think it's always good when we make room and allow space for lesbian and queer artists to speak about it whilst we're further into our journey,\" she says.\n\"Where it's less curiosity and trying... and it's more like: 'No, I'm into it now and really delving to my experience as a queer woman'.\"\nAnd the more voices that add to that, the better, Cat says.\n\"The more representation and more space for different types of queer artist, it can just help paint a more vivid picture of what the community's actually like and who exists within that community.\n\"Having people like Reneé Rapp and Chappell Roan and, hopefully, someone like myself, we're starting to show people that we're not a monolith and we vary across the spectrum.\"\nCat, who's previously spoken about her ADHD and autism spectrum disorder (ASD) diagnoses, says she \"falls into so many different groups\" and wants to celebrate differences.\n\"I just want to continue to show people that we're just not all one way,\" she says.\n\"What you know of something might not always be true.\"", "url": "https://www.bbc.co.uk/news/articles/cdxerx9rkpzo"}