{"authors": ["Ali Abbas Ahmadi", "www.facebook.com"], "date_download": "2025-04-26 07:28:03", "date_modify": "2025-04-26 07:28:03", "date_publish": "2025-02-27 19:36:34", "description": "The American singer will be joined by Lauren Sanchez, whose fiancee Jeff Bezos owns Blue Origin.", "filename": "news_articles_cx2gg4x4w14o_1745652483.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ced6/live/2cc7d0f0-f531-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx2gg4x4w14o_1745652483.html", "title": "Katy Perry will head to space on Blue Origin all-women flight", "title_page": "Katy Perry will head to space on Blue Origin all-women flight - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Pop star Katy Perry will blast off into space as part of an upcoming all-women flight on Blue Origin's New Shepard rocket.\nThe Firework singer will be joined by Blue Origin owner Jeff Bezos's fiancee Lauren Sanchez, CBS presenter Gayle King, former Nasa rocket scientist Aisha Bowe, civil rights activist Amanda Nguyen, and film producer Kerianne Flynn.\nBlue Origin said this is the first all-women space flight to take place since the Soviet Union's Valentina Tereshkova's solo mission in 1963.\nThere is no specific date for the launch, but Blue Origin said it would take place this spring.\nKaty Perry is scheduled to be on her Lifetimes Tour from 23 April until 11 November, so this trip is expected to take place before that.\n\"If you had told me I'd be part of the first all-female crew in space, I would have believed you. Nothing was beyond my imagination as a child,\" Perry said in a statement cited by Newsweek.\nThe NS-31 mission will be the 11th human spaceflight for the New Shepard rocket and the 31st in its history. So far, the programme has launched 52 people into space.\nA trip on the New Shepard typically lasts about 11 minutes, according to Blue Origin. It is fully autonomous - which means there are no pilots - and takes the passengers past the Karman line, internationally recognised as the edge of space.\nBlue Origin credited Lauren Sanchez for bringing the mission together, saying in its press release that she is \"honored to lead a team of explorers on a mission that will challenge their perspectives of Earth, empower them to share their own stories, and create lasting impact that will inspire generations to come\".\nSanchez first announced her plan to fly with an all-women crew on a Blue Origin rocket in 2023 in an interview with Vogue, saying they were \"paving the way for women\".\nThis is the latest group of celebrities to embark on a flight to space.\nBezos himself flew on the company's first manned mission in 2021. Good Morning America's co-host Michael Strahan and Star Trek actor William Shatner have also been blasted into space on one of Bezos's rockets.\nRichard Branson, the founder of Virgin Galactic, made a trip aboard his company's VSS Unity spacecraft in July 2021. SpaceX founder Elon Musk, however, is yet to make a trip.", "url": "https://www.bbc.co.uk/news/articles/cx2gg4x4w14o"}