{"authors": ["Mark Simpson", "www.facebook.com"], "date_download": "2025-04-26 04:41:59", "date_modify": "2025-04-26 04:41:59", "date_publish": "2025-03-02 06:31:16", "description": "The three-acre site near the City Hospital contains more than 10,000 bodies dating back to the Irish famine.", "filename": "news_articles_clynnyz01zjo_1745642519.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2225/live/4a159c10-f5e9-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynnyz01zjo_1745642519.html", "title": "Calls for council to mark 'forgotten' burial ground", "title_page": "Calls for council to mark 'forgotten' burial ground - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Belfast City Council has been urged to formally mark a hidden burial ground containing more than 10,000 bodies dating back to the Irish famine.\nThe three-acre site is now part of a housing development close to the City Hospital on Belfast's Donegall Road.\nThere is no plaque or sign to acknowledge that it was previously a burial site, which has been dubbed Belfast's \"forgotten cemetery\".\nIn the late 1840s, the ground in south Belfast was used to bury poor people from a nearby workhouse.\nHistorian Dr Robyn Atcheson has called on the council to take action.\n\"I would love to see something to commemorate, to memorialise that so many people are buried there,\" she told BBC News NI.\n\"I would love that part of Belfast's history to be better known.\n\"So many people lived in awful conditions. They were born in Belfast, lived in Belfast, died in Belfast and there's nothing to remember them by.\"\nA former lord mayor of the city, Tom Hartley, and current councillor, Tracy Kelly, also believe something should be done to remember the dead.\nThe Donegall Road is one of the busiest routes in and out of the city centre.\nThe burial ground is on the opposite side of the road to the City Hospital, in an area now covered by a number of streets including Prince Andrew Park.\nThe only clue to the past is a small part of the wall from the original entrance to the graveyard.\nDr Atcheson, who is based at nearby Queen's University, has been researching the burial ground.\nIt dates back to 1848, when Belfast was still a town rather than a city.\nShe said that the high mortality rate during the famine years resulted in \"all of the cemeteries in the town being full\".\n\"They had run out of space, especially for the poor,\" she added.\nOutbreaks of cholera and typhus added to the mortality rate and the decision was taken to use the three-acre site near the Union Workhouse for burials.\nIt remained open until the early 1900s.\nEstimates vary as to the number of people buried at the site.\nDocumentation from 1901 shows there were at least 10,000 people.\nDr Atcheson said there is no definitive figure but it could be as much as 60,000 people over a 70 year period.\nAt Belfast City Hall, there is a stained-glass window to remember those who died in the famine in the 1840s and an accompanying plaque refers to a graveyard at Donegall Road.\nHowever, on the road itself, there is nothing to commemorate the dead.\nDr Atcheson said it is part of Belfast's history that \"nobody really wanted to remember\".\n\"They would just rather forget that there was so much poverty and so many people dying and being buried in a nameless grave.\"\nThe former mayor, Tom Hartley, also believes there should be a mark of respect for those who died.\n\"We need to find a form of remembrance. It might be a stone, it might be a marker on the Donegall Road,\" he said.\nHe also said local primary schools could become involved in a history project about the site.\nCouncillor Tracy Kelly, from the Democratic Unionist Party (DUP), has lived in the area all of her life.\nShe said she had heard \"rumours\" over the years about a burial ground but, until now, was not sure if they were true.\nShe said: \"I think any burial ground should be recognised.\n\"It's the respectful thing to do, if this is people's last resting place, then something should be there to mark that.\"\nShe said historians would be best placed to take the lead in any initiative but she would support council involvement.\nBBC News NI has asked Belfast City Council if it has any plans to mark the site.\nAn Ordnance Survey map from the 19th Century shows the exact location of the burial ground. It was a short walk from the Belfast Union Workhouse.\nThe workhouse closed in 1948 and has since been demolished.\nThe City Hospital is now on the site.", "url": "https://www.bbc.co.uk/news/articles/clynnyz01zjo"}