{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:54:26", "date_modify": "2025-05-19 14:54:26", "date_publish": "2017-07-05 00:00:00", "description": "Bringing you the latest news, sport, travel and weather from across Cumbria on Wednesday 5 July 2017.", "filename": "news_live_uk-england-cumbria-40462799_1747666466.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_uk-england-cumbria-40462799_1747666466.html", "title": "BBC Local Live: Cumbria", "title_page": "BBC Local Live: Cumbria for Wednesday 5 July 2017 - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Our live coverage across the day\nOur updates have now ended for the day. Thank you for joining us.\nWe'll be back tomorrow from 08:00 with the news, sport, weather and travel for Cumbria.\nIf you've got any stories or photos to share in the meantime, let us know by sending us an email or getting in touch via Facebook , externalor Twitter, external.\nWeather: Mostly dry for the rest of the day\nIt will turn largely dry for the rest of the day for most parts of the county, barring the odd light shower.\nIt'll be cloud overnight, but it will stay dry to begin with. Outbreaks of rain will move across parts of Cumbria in the early hours.\nThere's a yellow warning of rain for tomorrow with isolated thunderstorms possible across parts of England and Wales from early morning.\nThese storms may miss many places but, where they do develop, intense downpours are likely.\nThere could be flash flooding, lightning and hail.\nBarrow start at Dagenham in National League\nBarrow AFC will go to Dagenham and Redbridge to start their National League campaign on Saturday 5 August.\nThe Bluebirds' first home fixture will be the following Tuesday against FC Halifax Town.\nFor the full fixture list click here., external\nDriving tests: more than two thirds in South Cumbria pass first time\nPeople who take their driving test in Kendal or Barrow are among the most likely in the country to pass at their first attempt.\nThe driving test centres in South Cumbria are among the top three in England when it comes to their first-time pass rate.\nThis copy of the 1980s Highway code is pictured beside Kendal's former test centre on Shap Road, before a recent move across town.\nFigures from the Driver and Vehicle Standards Agency, external show the national average first-time pass rate is 47.5%, but in Kendal it is almost 68% and, in Barrow, 67%.\nCheaper rail fares now available on day of departure\nMillions of rail passengers can now buy cheaper \"advance\" tickets on the day of departure, the Rail Delivery Group (RDG) has announced.\nUntil now, advance fares have generally only been available up until midnight on the day before.\nEight train operators are offering the service, claiming that the cheaper tickets can be bought as little as 10 minutes before the train leaves.\nBut advance fares are for a limited number of seats and often sell out.\nAdvance tickets can potentially be bought on the day with CrossCounty, Grand Central, Greater Anglia, Northern, Transpennine Express, Virgin Trains East Coast, Virgin West Coast and Caledonian Sleeper.\nTalks under way to merge hospital and community services in south Cumbria\nHealth officials say major changes to services in south Cumbria should provide more \"consistent care\" for patients.\nTalks are under way to merge hospital and community services. At the moment they're provided by two different trusts with separate managers and finances.\nThe Morecambe Bay and Cumbria Partnership Trusts say that makes things more complicated. They're looking at integrating services by the end of the financial year.\nCopeland residents told: your water's safe, but come and find out more\nPeople in West Cumbria who have noticed changes to their water supply are being invited to drop-in sessions by the supply company United Utilities, external.\nSome people say they have developed skin rashes, mouth ulcers and upset stomachs after drinking tap water which makes a \"popping\" noise when boiled.\nUnited Utilities says the water in Copeland is safe to drink and meets the water quality regulations. It says any changes are simply the result of blending hard and soft water from early June, after it switched on new boreholes at Egremont to replace some of the supply that used to come from Ennerdale Water.\nThe sessions will run from 13:00-20:00 starting at the Methodist Church in Egremont next Wednesday, and at the Beacon in Whitehaven the following day.\n'Despicably cruel' deer poachers' increasing use of killer dogs\nNeil Smith\nSouth Cumbria journalist, BBC Cumbria\nA rise in deer poaching in Cumbria is being put down to what some are calling a blood-sport, involving the \"inhumane\" use of dogs to kill the deer.\nDeer poaching used to involve lamps and powerful rifles, but now dogs are set off across fields to bring the animals down.\nWithin a three-mile mile radius of Rusland in South Cumbria, 17 deer were killed by dogs in just six months last year.\nThe South Lakes Deer Management Group says this is \"despicably cruel\". There are also further concerns that carcasses are entering the human food chain via the black market without being checked for disease or contamination, even though the venison contains dog bite-marks.\nA continuing Cumbria Police Operation Samurai against poachers has seen officers patrolling the Haverthwaite area, and police appealing for information to catch the poachers involved.\nCumbrian fells: mainly dry, with bright or sunny spells developing\nHere's today's Met Office forecast for mountains in the Lake District, external\nWeather: Patchy light will die out through the morning. The cloud will tend to lift and break through the afternoon with some good spells of strong sunshine developing, leading to a risk of sunburn. Then a fine and dry evening.\nVisibility: Persistent and extensive cloud cover from below 300m will make navigation difficult through the first half of the morning. Visibility remains poor in cloud but improves to good or very good as the cloud lifts and breaks, with very little poor visibility expected by evening.\nCloud free hill top: Little chance through the first half of the morning. However conditions improve with about 70% chance of cloud free tops by mid-afternoon as cloud lifts and breaks and perhaps 90% by evening.\nScrap the cap?\nCumbrian MPs are calling for the 1% cap on pay rises for public sector workers to be scrapped.\nTrudy Harrison, the Conservative MP for Copeland, external, told Sky News yesterday that she wanted the cap to be lifted, but it would have enormous consequences so needed to be done properly.\nSome ministers have said they would like to see the cap relaxed, but the chancellor Philip Hammond said this week that policy had not changed, and the government should \"hold its nerve\".\nWelcome to today's BBC Cumbria Live\nJohn Bowness\nBBC Radio Cumbria reporter\nGood morning, we'll be bringing you live updates on the county's news, sport, weather and travel throughout the day.\nIf you've got a story or a photo you'd like us to see, let us know by sending us an email or getting in touch via Facebook, external or Twitter, external.", "url": "https://www.bbc.com/news/live/uk-england-cumbria-40462799"}