{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 07:07:57", "date_modify": "2025-04-26 07:07:57", "date_publish": "2025-02-28 05:14:14", "description": "Éanna Hardwicke is \"not a fan of rehashing things\", but sees why some want to revisit the characters.", "filename": "news_articles_cly2279qg70o_1745651277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b235/live/2f415470-f589-11ef-b426-ed3a8bcd00a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly2279qg70o_1745651277.html", "title": "Eanna Hardwick says no need for a Normal People sequel", "title_page": "Eanna Hardwick says no need for a Normal People sequel - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Normal People actor Éanna Hardwicke has said he doesn't want a sequel to the hit TV series, as he's \"not a fan of rehashing things\".\n\"It's nicer to leave it in people's imagination, and leave it as it was,\" the 28-year-old told BBC News at a pre-Oscars party in Los Angeles on Thursday night.\nBased on Sally Rooney's novel, the BBC Three drama charted the on-off relationship of teenagers Marianne and Connell.\nIt starred Daisy Edgar Jones and Paul Mescal, while Hardwicke played Rob, Connell's friend from high school.\nIn the series, Hardwicke's character Rob suffers from depression and takes his own life, causing Connell's mental health to suffer.\nBut Hardwicke said that it's not the fact he wouldn't be in any sequel, that makes him not want one.\n\"I'd be very happy to watch it as a punter, because then I could enjoy it,\" he said, speaking at the annual Oscar Wilde event to celebrate Irish talent.\nHe also admitted that he can see why some people want to revisit the series.\n\"Of course, part of me is curious, I'd love to see those characters in 15 years,\" he said.\n\"I just adore Sally [Rooney]'s writing so much, I'm excited every time she releases a new book, so I'm just looking forward to reading what she does next.\"\nHardwicke said he still speaks to his Normal People co-stars.\n\"We all stay in touch, which is nice. It was a really special thing for all of us,\" he said.\n\"I think that will never change. It will always be a really foundational job for all of us, so we do stay in touch.\n\"Every now and then we meet for a pint and go, 'God, wasn't that mad'.\"\nMore recently, Hardwicke starred as murderer Benjamin Field in BBC One true crime drama The Sixth Commandment.\nThe series follows the death of Peter Farquhar in Maids Moreton, Buckinghamshire in 2015, and Field's later seduction of Farquhar's elderly neighbour, Ann Moore-Martin, who died in 2017.\nHardwicke said he didn't have an answer for why people are so fascinated by true crime, but said as an actor, \"you just want to work on stuff that has that depth\".\n\"There's a responsibility to telling true stories, to know why you're doing it, why you're telling the story, what's the point,\" he said.\n\"It was approaching true stories in a different way. I felt, when I read that script, it was doing it with scrutiny and care and it didn't feel at all manipulative.\"", "url": "https://www.bbc.co.uk/news/articles/cly2279qg70o"}