{"authors": ["Rebecca Brahde", "www.facebook.com"], "date_download": "2025-04-26 06:18:35", "date_modify": "2025-04-26 06:18:35", "date_publish": "2025-03-01 07:25:40", "description": "The 10 stamp collection features some of the renowned Manx born artist and designer's works.", "filename": "news_articles_c0rz8k91q8jo_1745648315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9afe/live/17446530-f2b7-11ef-8db0-bbc7a4fcf665.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rz8k91q8jo_1745648315.html", "title": "Legacy of Archibald Knox celebrated on Isle of Man stamp set", "title_page": "Legacy of Archibald Knox celebrated on Isle of Man stamp set - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The legacy of renowned artist and designer Archibald Knox has been celebrated on a new set of stamps.\nThe 10-piece collection has been created in conjunction with a major exhibition of the Manx born with artist at the Manx Museum from 5 April.\nThe set features examples of Knox's metalwork, jewellery, paintings, household accessories and other designs.\nGeneral manager of Isle of Man Stamps and Coins Maxine Cannon said the collection served as a \"tribute to his remarkable talent\".\nThe set features imagery from the Manx National Heritage Collection, the Peartree Collection, as well as private collections.\nSome of those items will feature in the exhibition Knox: Order & Beauty, which is the set to be the largest ever display of his works.\nThe display explores Knox's artistic journey, his connection to the Isle of Man, and his pioneering role in modern design, and will showcase more than 200 pieces from collections across the British Isles.\nCurator Katie King said the stamp collection \"brings together some of Knox's most iconic works and reminds us of the enduring beauty and relevance of his designs\".\nManaging Director of the Archibald Knox Forum Chris Hobdell, which is putting the exhibition together in conjunction with Manx National Heritage, said the set of stamps offered a \"glimpse into the depth and diversity of his work\".\nHe said the collection would allow people to \"learn more about this remarkable designer\" ahead of April's opening of the year-long display.", "url": "https://www.bbc.co.uk/news/articles/c0rz8k91q8jo"}