{"authors": ["David Deans", "www.facebook.com"], "date_download": "2025-04-26 04:02:44", "date_modify": "2025-04-26 04:02:44", "date_publish": "2025-03-03 22:50:51", "description": "Welsh government plans for an extra £600m in NHS spending passes with Lib Dem help.", "filename": "news_articles_c2d458162xro_1745640164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bd5d/live/25bec790-f929-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2d458162xro_1745640164.html", "title": "Welsh government budget passes with Lib Dem help", "title_page": "Welsh government budget passes with Lib Dem help - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Welsh government's spending plans for the next year have been given the go-ahead in the Senedd on Tuesday evening.\nIts £26bn budget for the NHS, education and other public services passed a crucial vote after Labour ministers won the support of Liberal Democrat Jane Dodds last month.\nGovernment politicians needed the help of one opposition MS - Dodds was won over after ministers promised a ban on greyhound racing and £1 bus fares for under-21s.\nThe Welsh Conservatives and Plaid Cymru opposed the package, which cover the next financial year.\nLabour MSs banged Senedd tables as the result of the vote came in with 29 Senedd members in support and 28 against, with one abstention from Dodds.\nIn a debate, Wales' Finance Secretary Mark Drakeford took aim at the two opposition parties, warning they risked losing extra funding for the NHS and childcare.\nThe Tories said the budget would not \"fix Wales\", while Plaid accused Labour of failing to meet the challenges Wales faces.\nWelsh Labour had been searching for a deal after the Plaid Cymru co-operation pact came to an end last summer.\nIf the budget had not been not agreed the Welsh government's funds - which mostly come from the Treasury - would be automatically cut, with potentially £4.15bn over the course of a financial year at stake.\nUnder the previous Labour first minister Vaughan Gething it had been unclear how a deal could be achieved with all other parties ruling out working with him.\nDecisions taken by UK Labour Chancellor Rachel Reeves means there is £1.5bn more in the Welsh budget for 2024-25, according to the Welsh government.\nPlans include £600m more for the Welsh NHS, which ministers hope will tackle high waiting times.\nBut there are concerns public bodies will have to use the extra cash to fund a rise in the National Insurance paid by employers.\nWhile there are promises of extra support for the public sector from the Treasury, it is not clear to what organisations it will extend to, or how much will be provided.\nOpening the debate on his budget, Drakeford said: \"Today with this budget, we turned the corner, moving beyond austerity to investment and to growth.\n\"While we cannot undo all the damage inflicted on Wales during the austerity years we can begin to rebuild our services and create an economy which truly offers prosperity for all.\"\nAttacking the Tories and Plaid Cymru, Drakeford told the Senedd: \"There is no other budget that can be endorsed here this afternoon.\"\nHe said voting against it was a \"vote against\" extra treatments in the NHS, the employment of teachers, extra child care places and other policies.\nPlaid Cymru leader Rhun ap Iorwerth intervened and accused Drakeford of a \"spurious argument\".\n\"Whilst we can agree with elements of the budget, of course we can – this is a flawed Labour budget.\"\nDrakeford responded: \"If you were to succeed everything I have outlined this afternoon would be lost.\"\nThe two later clashed on how much they had tried to negotiate. Drakeford said Plaid had not been \"prepared\" to so, claiming to have met a party spokesperson three times. He said the party did not \"return to discuss what you would have wanted in order to be able to have allowed this budget to go through\".\nAp Iorwerth said he had been in a meeting with Drakeford \"who didn't mention how we could work together on their budget\".\nLater, Darren Millar, Welsh Conservative Senedd leader, said voting down the budget would be a \"good thing\".\n\"Let's be clear about this - if the Welsh government lost this vote today, it would effectively bring to an end twenty six years of a failing tired, clapped out Labour government that is devoid of the right ideas to fix the problems and the challenges that Wales faces.\"\nHis finance spokesman Sam Rowlands said the budget was \"merely a sticking plaster over the problems that far too many people face in Wales\".\n\"It won't lead to greater prosperity for our people. It won't put more money in people's pockets and it won't give us the public services that the people of Wales are crying out for.\"\nPlaid Cymru's Heledd Fychan said the budget \"falls short of adequately addressing challenges we face as a nation\".\nIf the budget passed, she said, \"services that people depend on will continue to be cut, some will disappear entirely. Council tax will rise significantly\".\n\"Far too many people will still be unable to afford food, unable to afford to heat their homes and will be living in poverty.\"\nShe reiterated Plaid demands for finance reform and extra funding from the Labour UK government.\nShe said the budget lacked a \"single penny\" of consequential funding from High Speed Rail 2. \"Where is the fair funding formula,\" she asked.\nBy Gareth Lewis, BBC Wales political editor\nLabour is asking voters to stick with it – in Wales and in Westminster – and to allow time for public services to improve.\nThat could be a challenge, with forecasts suggesting tighter public spending in future years, low economic growth in the UK and global economic and political uncertainty – all of which could mean less money coming from Westminster for Welsh ministers to spend.\nAnd what if voters simply want change after what will be 27 years of Labour in power come the 2026 Senedd election?\nThe other parties sense that change in the air and will spend the next year arguing that two Labour governments working together are not doing enough for Wales and that the Welsh government's spending priorities are wrong.\nLabour for its part tried to put Plaid on the defensive during the budget debate, accusing it of jeopardising billions of pounds of funding by not backing the spending plans.", "url": "https://www.bbc.co.uk/news/articles/c2d458162xro"}