{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 03:57:18", "date_modify": "2025-04-26 03:57:18", "date_publish": "2025-03-04 14:05:45", "description": "Sally Taylor has presented the South of England regional news programme for almost four decades.", "filename": "news_articles_cdrx3g4zrdjo_1745639838.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/84e9/live/578db840-f8fb-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrx3g4zrdjo_1745639838.html", "title": "BBC South Today's Sally Taylor to retire after 38 years", "title_page": "BBC South Today's Sally Taylor to retire after 38 years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC news presenter and journalist Sally Taylor has announced she will leave the regional news programme she has hosted for almost four decades.\nTaylor joined South Today in 1987 having previously worked at Spotlight, the regional news programme for the south west of England.\nIt is believed she is the longest-serving female presenter of a flagship regional television news programme.\nShe will present her last programme on 20 March.\nDuring her career, she has covered 10 general elections, reported from Bosnia at the end of the war with military medics, and broadcast live from Antarctica after travelling there on HMS Endurance.\nShe also presented BBC Radio Solent's daily, mid-morning show and a Saturday morning show for the station.\nIn 2005, Taylor was made an MBE in the Queen's Birthday Honours List for her services to regional broadcasting.\nTen years later she was awarded an honorary doctorate by the University of Winchester in recognition of her work in broadcasting and with local charities.\nJason Horton, director of production for BBC Local, said: \"Her class in the studio or on location, her sheer hard work in preparing for the programme, and her eye for the stories that really connect with the South Today audience, is unrivalled.\n\"Sally has always wanted more for the viewer and encouraged us all on that mission, whether we were reporters or producers, editors or senior leaders.\n\"She has also mentored countless colleagues, supporting the next generation of journalists and broadcasters.\"", "url": "https://www.bbc.co.uk/news/articles/cdrx3g4zrdjo"}