{"authors": ["Kate Moser Andon", "www.facebook.com"], "date_download": "2025-04-26 03:46:47", "date_modify": "2025-04-26 03:46:47", "date_publish": "2025-03-05 05:30:13", "description": "A council will spend £150,000 on a report into flooding at Little Paxton, Earith and Whittlesey.", "filename": "news_articles_cq8yzykxe80o_1745639207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/803f/live/e7ffb640-f8e1-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq8yzykxe80o_1745639207.html", "title": "Flood-prone roads in Cambridgeshire to be focus of new study", "title_page": "Flood-prone roads in Cambridgeshire to be focus of new study - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three flood-prone roads have been granted £150,000 for an assessment to be carried out into the causes and solutions.\nCambridgeshire county councillors voted in favour of the study into three roads - Mill Lane in Little Paxton, the A1123 at Earith and the B1040 at Whittlesey.\nAt a meeting on Tuesday, they dismissed an alternative option to spend £250,000 on a study for Mill Lane in Little Paxton only, which was closed four times last year due to flooding.\nInstead, councillors agreed to allocate £100,000 for short-term flood measures at Mill Lane, with the rest spent on the study.\nThe council recommended the second option because it said it would get better value for money.\nMill Lane is an important link between St Neots, Little Paxton and the A1, but has been closed for 23 days last year due to rainfall and repair works.\nDuring the closure, residents needed to take a 7.2-mile (11.6km) diversion via the A1.\nIn October, work to repair 200 sqm of damaged road, which had washed away, cost the council £15,000.\nRichard Tomlinson, vice chair of Little Paxton Parish Council, said Mill Lane was \"vital\" to the community, adding: \"When it floods, residents, businesses and emergency services suffer.\"\nStephen Ferguson, an independent county councillor in St Neots, said: \"We're talking about a major road crossing in the middle of the biggest town in the county.\"\nThe A1123 at Earith and B1040 at Whittlesey are also known to flood.", "url": "https://www.bbc.co.uk/news/articles/cq8yzykxe80o"}