{"authors": ["Christal Hayes", "www.facebook.com"], "date_download": "2025-04-26 04:32:42", "date_modify": "2025-04-26 04:32:42", "date_publish": "2025-03-03 05:14:39", "description": "The acceptance speech at the Academy Awards was one of the most overtly political moments of the night.", "filename": "news_articles_cvg1vdr4dzko_1745641962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3e7f/live/fd1ca270-f802-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvg1vdr4dzko_1745641962.html", "title": "Oscars 2025: No Other Land wins best documentary as filmmaker criticises US", "title_page": "Oscars 2025: No Other Land wins best documentary as filmmaker criticises US - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Israeli journalist has said US foreign policy \"is helping to block\" a path towards a political solution in the Middle East as he picked up a best documentary Oscar for No Other Land, a feature set in the occupied West Bank.\nThe acceptance speech at the 97th Academy Awards was one of the most overtly political moments of the night.\nYuval Abraham said his life was very different to that of his colleague, Palestinian journalist Basel Adra. \"When I look at Basel, I see my brother, but we are unequal,\" Abraham told the audience.\nTheir win comes amid a fragile ceasefire between Hamas and Israel, pausing fighting for an exchange of Israeli hostages and Palestinian prisoners.\nAs they won their Oscar on Sunday night, Abraham and Adra took to the stage with colleagues Rachel Szor and Hamdan Ballal to pick up the award.\nAbraham said: \"There is a different path, a political solution, without ethnic supremacy, with national rights for both of our people.\n\"And I have to say, as I am here, the foreign policy in this country is helping to block this path.\" The audience cheered.\nAdra thanked the Academy and said he became a father two months ago.\n\"I hope to my daughter that she will not have to live the same life I am living now, always fearing settlers' violence, home demolitions and forceful displacements.\"\nHe said the film, which is broadcast in the UK on Channel 4 this week, reflected \"the harsh reality we have been enduring for decades\".", "url": "https://www.bbc.co.uk/news/articles/cvg1vdr4dzko"}