{"authors": ["Carwyn Jones", "www.facebook.com"], "date_download": "2025-04-26 04:29:57", "date_modify": "2025-04-26 04:29:57", "date_publish": "2025-03-03 06:31:24", "description": "Gerald Corrigan, 74, was shot while fixing his satellite dish outside his Anglesey home in 2019.", "filename": "news_articles_cpdez8jl4xvo_1745641797.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d80a/live/76815ab0-f6bf-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpdez8jl4xvo_1745641797.html", "title": "Anglesey crossbow murder: Questions raised over evidence", "title_page": "Anglesey crossbow murder: Questions raised over evidence - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Questions have been raised as to why evidence in a crossbow murder trial was withheld from jurors.\nGerald Corrigan, 74, was shot while fixing his satellite dish outside his Anglesey home in 2019 and the motive is still not known.\nJournalist Siôn Tecwyn has said evidence not being shown to jurors in the criminal trial \"raises more questions\" in a case already shrouded in mystery.\nThe Crown Prosecution Service (CPS) said it \"complied with its disclosure obligations\" and North Wales Police has declined to comment.\nMr Corrigan died three weeks after being shot with a crossbow outside his remote home near Holyhead in the early hours of 19 April 2019.\nTerence Whall was later found guilty of his murder and jailed for 31 years.\nMr Tecwyn, a former BBC journalist who covered the case at the time, said it was now known that evidence was not presented during the trial.\nThe claims are included in his new book, which was jointly written with Meic Parry, producer of the Crossbow Killer podcast, which examines the unanswered questions following the case.\nMr Tecwyn said documents show defence teams and jurors were not allowed to see some material in the trial of Whall, and in a subsequent fraud trial.\nThe nature of the material that was allegedly kept secret in the murder trial remains a mystery.\nMr Tecwyn said the prosecution obtained a Public Interest Immunity Order to prevent some evidence being made available to Whall's defence team.\nThe CPS's own guidelines on such orders say they should be \"rare\", only applied for \"in exceptional circumstances\", and only when it was \"in the public interest\", Mr Tecwyn said.\n\"What that evidence was we do not know.\"\n\"It's very unusual,\" he said, adding that \"there is no suggestion that it means there's been some kind of miscarriage of justice\".\nMr Tecwyn said it was one of the strangest cases he had covered in his career, and that he believed that Whall was \"hired\" to kill Mr Corrigan by someone else.\n\"Everything points to Terence Whall being the killer, but in such a case where there are so many unanswered questions, this, again, raises more unanswered questions,\" he said.\n\"Why was Gerald Corrigan murdered in such a brutal manner, who was behind it?\n\"We can say almost certainly that it wasn't Whall acting by himself, by all accounts he didn't even know Gerald Corrigan.\"\nMr Tecwyn said evidence was withheld in a subsequent fraud trial.\nRichard Wyn Lewis pleaded guilty to defrauding Mr Corrigan and his partner out of more than £200,000 over a two-year period before the shooting.\nLewis was given a six-year jail sentence for the fraud. There is no evidence of any connection between the fraud and the murder.\nMr Tecwyn said the legal documents obtained in their research showed the prosecution and the Court of Appeal blocked efforts by Lewis' defence team to see material which they claimed showed Lewis had been a police informant who had provided intelligence about major criminals involved in drug distribution in Wales and Ireland.\nThe BBC asked Richard Wyn Lewis to comment on the claims, however he declined.\nThe CPS said it had \"complied with our disclosure obligations at every stage of the case\", and was unable to provide any further comment.\nNorth Wales Police said it would not comment on the claims made in the book.\nSpeaking to the BBC, Mr Tecwyn said some people were still frightened to talk on the island after the murder.\nHe said a friend of Mr Corrigan, from Anglesey, left the UK shortly after the murder because he feared for his safety.\n\"He still feels very scared for his safety and he doesn't want to talk about what happened,\" he said.\n\"This was bizarre and brutal, Gerald Corrigan suffered horrific injuries... and we still don't know why he was killed, that is the big mystery, we hope the book will help, and somebody somewhere will come forward with some answers,\" he said.\nHe added: \"There is of course one man who knows the truth, and that's Terry Whall. In a matter of minutes, he could lessen some of the agony for Gerald Corrigan's family and friends by explaining why he committed such a brutal murder.\n\"But so far he has refused to do so.\"", "url": "https://www.bbc.co.uk/news/articles/cpdez8jl4xvo"}