{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:46", "date_modify": "2025-05-19 14:47:46", "date_publish": "2015-02-09 04:35:02", "description": "The Nigerian interior minister says he is confident the fight against Boko Haram will be successful enough to allow postponed elections to go ahead.", "filename": "news_world-africa-31269243_1747666066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80874000/jpg/_80874127_80873871.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-africa-31269243_1747666066.html", "title": "Nigeria election: Minister 'confident' poll will happen", "title_page": "Nigeria election: Minister 'confident' poll will happen - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nigeria's interior minister believes the fight against Boko Haram will be successful enough for the postponed elections to go ahead, he told the BBC.\nAbbo Moro said he had been advised by the military that enough troops would be available in six weeks' time to secure the presidential ballot.\nOfficials say they delayed the vote to 28 March because troops needed for security are fighting the militants.\nOpposition candidate Muhammadu Buhari has made a plea for calm.\nBut he said the independence of Nigeria's electoral commission had been \"gravely compromised\" by the decision to postpone the elections.\nMeanwhile Boko Haram on Monday launched a third attack in four days on neighbouring Niger, targeting a prison in the border region of Diffa.\nThe militant group, which killed at least one person in a similar attack on Sunday, were reportedly pushed back after clashing with Nigerian forces.\nSaturday's decision to postpone the presidential poll was welcomed by the ruling party of incumbent President Goodluck Jonathan though the US said it was \"disappointed\".\nParliamentary elections due to take place on 14 February have also been postponed to 28 March, and elections for state governors and assemblies slated for 28 February have been moved to 11 April.", "url": "https://www.bbc.com/news/world-africa-31269243"}