{"authors": ["Matthew Critchell", "www.facebook.com"], "date_download": "2025-04-26 03:40:31", "date_modify": "2025-04-26 03:40:31", "date_publish": "2025-03-05 10:01:24", "description": "Arriva South says there are too few passengers to support the route between Braintree and Stansted.", "filename": "news_articles_cg7054g7k4zo_1745638831.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fbac/live/86288650-f999-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cg7054g7k4zo_1745638831.html", "title": "Essex villages' bus link with Stansted Airport to be scrapped", "title_page": "Essex villages' bus link with Stansted Airport to be scrapped - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A bus service that links people in villages to Stansted Airport is being scrapped because of low passenger numbers.\nArriva South said there were too few customers to support its 133 service, which travels from Braintree, Essex, through villages including Rayne, Felsted and Takeley.\nThe bus provider warned the daily service, which costs £3 for a single fare, would end on 1 June.\nDistrict councillor Lynn Jefferis said she hoped the decision would be reviewed before people were \"inconvenienced\".\nJefferis, the leader of Braintree's Labour group, said many who worked at the airport would be affected by the move.\n\"I think it's disappointing,\" she told the Local Democracy Reporting Service. \"I am surprised about this and that there is not enough custom for it.\n\"It's a lot cheaper than getting a taxi and I am sure this will cause inconvenience for some people.\"\nThe councillor added: \"It might be something they can review in the future and hopefully they decide this is not a good idea.\"\nArriva South said it needed to make changes to its routes to balance costs.\nA spokesman added: \"Unfortunately, there was no alternative.\"", "url": "https://www.bbc.co.uk/news/articles/cg7054g7k4zo"}