{"authors": ["Olivia Demetriades", "Anna O'Neill", "www.facebook.com"], "date_download": "2025-04-26 06:52:58", "date_modify": "2025-04-26 06:52:58", "date_publish": "2025-02-28 16:52:58", "description": "A Northern City line train crashed after failing to stop at the station, killing 43 people.", "filename": "news_articles_c3rn8dw470yo_1745650378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3178/live/5b5cd0a0-f5e5-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3rn8dw470yo_1745650378.html", "title": "Remembrance service marks 50 years since Moorgate Tube crash", "title_page": "Remembrance service marks 50 years since Moorgate Tube crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Commemorations have taken place to mark 50 years since the Moorgate Tube crash which killed 43 people and left 74 injured.\nThe London Fire Brigade (LFB) joined Transport for London (TfL), emergency service partners and families of survivors at the Moor Place memorial for a service of remembrance.\nThe disaster is considered to be the worst peacetime loss of life on the London Underground when a Northern City line train failed to stop at Moorgate Tube station and crashed into a dead end.\nFor six days, London Fire Brigade led over 1,300 firefighters, 240 police officers, 80 ambulance workers, 16 doctors and volunteers in the rescue and recovery operation.\nThe crash site was located over 20m (65ft) below ground, meaning all equipment had to be carried down to the platforms via the station stairs, according to the LFB.\nRescue crews were forced to work without their protective clothing at times to avoid heat exhaustion, the brigade added.\nA makeshift operating theatre was also established on the platform by medics from The London Hospital, providing immediate emergency care, as paramedics worked to triage those rescued from the wreckage.\nLaurence Marks was a 25-year-old journalist when he was asked to cover the biggest catastrophe in the City of London since the Blitz.\nWhen assigned to the story, he did not know his father had been killed instantly in the crash.\nMr Marks told BBC London: \"It wasn't until later this afternoon, 50 years ago, that my stepmother phoned me and said, 'I think your dad may have been on that train'.\n\"It wasn't really until nine o'clock the next morning, when I was in my council flat in Finsbury Park, when there was a knock on the door and a policeman was standing there and said, 'We're very sorry to tell you your father was removed from the second carriage this morning, and would you come down and identify his body?'\"\nHe has since written many stories about the crash.\nJavier González, 71, also attended the service on Friday.\nHe recounted his memories to BBC London: \"I remember pretty much everything.\n\"I was sitting down next to the double doors, the train moved a lot brisker than usual and I saw the lady sitting opposite me and the moment I saw her eyes, the lights went out and the glass smashed and the metal started crumbling.\n\"Everything happened so quickly, there was no time for anybody to react, to scream, to press any alarm.\n\"I don't think the lady opposite me survived sadly.\"\nAfter being found face down in the carriage, he was carried to safety by someone called David, who he would like to track down and thank.\n\"I am unbelievably lucky to have been through that and survived,\" he added.", "url": "https://www.bbc.co.uk/news/articles/c3rn8dw470yo"}