{"authors": ["Jack Silver", "www.facebook.com"], "date_download": "2025-04-26 07:43:54", "date_modify": "2025-04-26 07:43:54", "date_publish": "2025-02-26 18:14:48", "description": "David Alpert says he spent two months diving off the Devon coast to capture the winning image.", "filename": "news_articles_c0rzqed9z42o_1745653434.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c79d/live/f93547e0-f459-11ef-9d52-1b1b29dc5f7f.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0rzqed9z42o_1745653434.html", "title": "Mischievous seal in award-winning photo 'had put seaweed on head'", "title_page": "Mischievous seal in award-winning photo 'had put seaweed on head' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A \"mischievous\" seal pictured in an award-winning wildlife photograph had earlier put a strand of seaweed over its head in an attempt to play, a London-based photographer has revealed.\nDavid Alpert, whose portrait The Curious Seal won two awards at the Underwater Photographer of the Year Awards, external, captured the image off Lundy Island in Devon in summer 2024.\nMr Alpert, who is originally from Cape Town in South Africa, said he had dived with seals around the world but the Lundy Island grey seals were \"much more interactive\" than seals elsewhere.\nHe said some of the seals liked \"coming up behind you and mischievously nibbling on your fins\".\nHe added that the seal in his photo had earlier \"put a piece of seaweed on its head, like it had been briefed on how to look cute in a photograph\".\nMr Alpert took the photo during a two-month spell exploring different locations off the north Devon coast.\nHe said the visibility was \"absolutely crystal clear\" on the day he took the winning photo, making the image \"a little bit different\".\nIt picked up the prize for British Underwater Photographer of the Year at the awards, as well as winning the British Waters Wide Angle category.", "url": "https://www.bbc.co.uk/news/articles/c0rzqed9z42o"}