{"authors": ["Isaac Ashe", "www.facebook.com"], "date_download": "2025-04-26 03:48:50", "date_modify": "2025-04-26 03:48:50", "date_publish": "2025-03-05 14:20:22", "description": "Two teenagers deny killing 80-year-old Bhim Kohli in a Leicestershire park in September.", "filename": "news_articles_c93k9z1l6n5o_1745639330.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/667d/live/0f524500-f9c8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93k9z1l6n5o_1745639330.html", "title": "Boy 'planned to flee city' after fatal park attack", "title_page": "Bhim Kohli: Boy 'planned to flee city' after fatal park attack - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A boy charged with the murder of an 80-year-old man who died after being attacked in a park told friends he needed to flee \"to a different city\", a court has heard.\nBhim Kohli died the day after being assaulted while walking his dog Rocky in Franklin Park, yards from his home in Braunstone Town, Leicestershire, on 1 September last year.\nA 15-year-old boy and a 13-year-old girl, who cannot be named because of their ages, are on trial at Leicester Crown Court accused of killing him.\nOn Wednesday, the court head evidence from a teenage friend of the male defendant, who said he and a friend met him the day after the attack in a churchyard, where the defendant appeared \"overwhelmed\".\n\"He was kind of shaking,\" the witness said in his police interview, which was played to the jury.\n\"He told me about it. He said that he was walking with his mates and he saw that man trying to do something to a young girl.\n\"When he saw that, he said he got really angry and started battering him.\"\nThe defendant, then aged 14, told the pair he needed to \"leave the area\".\nThe witness said: \"I think he was planning to go somewhere far, like a different city.\"\nAnother teenage boy, who cannot be named, told the court he had been with the defendant and other friends earlier that day.\nHe said after hearing there were \"10 police cars\" outside his home, the defendant had said he \"put an 80-year-old in intensive care\" and \"basically killed him\".\nThe witness said he told the defendant: \"You're crazy bro.\"\nHe replied: \"I know but it is what it is.\"", "url": "https://www.bbc.co.uk/news/articles/c93k9z1l6n5o"}