{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:47:15", "date_modify": "2025-05-19 14:47:15", "date_publish": "2015-02-26 02:15:38", "description": "A North Korean shipping company has renamed and reflagged its vessels in an attempt to get around sanctions, a UN report says.", "filename": "news_world-asia-31635564_1747666035.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/69531000/jpg/_69531949_a7bad521-37ac-4e74-848b-ac406f6375d3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31635564_1747666035.html", "title": "North Korea reflagging ships to evade sanctions - UN", "title_page": "North Korea reflagging ships to evade sanctions - UN - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A North Korea shipping company has been renaming and reflagging its vessels so it can evade an arms embargo, a UN report has said.\nNorth Korea is subject to strict sanctions because of its nuclear weapons programme.\nThe sanctions were extended to Ocean Maritime Management (OMM) last year after one of its ships was found to be importing weapons from Cuba.\nThe UN Security Council is to discuss the report on Thursday.\nThe report, from a panel of experts monitoring the sanctions, said OMM had renamed 13 of its 14 ships, and transferred their ownership to shell companies, which meant they were effectively erased from the blacklist database.\n\"These changes are likely a strategy to evade assets freezes by member states,\" said the report, quoted by AFP news agency. The company has operations in at least 10 countries.\nThe report also said that despite the sanctions, North Korea was continuing to \"attempt to procure or transfer items relating to its nuclear and missile programmes\".\nUnder United Nations sanctions, North Korea is banned from weapons exports and the import of all but small arms.\nBut in July 2013, the North Korea vessel Chong Chon Gang was stopped in Panama on suspicion of carrying drugs.\nPolice found undeclared Cuban military cargo hidden on board, hidden under bags of sugar in its hold.\nThe authorities in Havana admitted being behind the stash, saying they were Soviet-era arms from Cuba headed for repair in North Korea.\nThe UN's North Korea sanctions committee said at the time that OMM had \"played a key role in arranging the shipment of the concealed cargo of arms\".", "url": "https://www.bbc.com/news/world-asia-31635564"}