{"authors": ["Brian Farmer", "Lewis Adams", "www.facebook.com"], "date_download": "2025-04-26 03:50:18", "date_modify": "2025-04-26 03:50:18", "date_publish": "2025-03-05 12:54:36", "description": "Kyle Clifford, who admitted the killings, is on trial for the rape of his ex-partner, Louise Hunt.", "filename": "news_articles_c4g7dvdpl3yo_1745639418.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6bf1/live/6b32ac80-f9b3-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g7dvdpl3yo_1745639418.html", "title": "Jury shown security footage of moments before Bushey murders", "title_page": "Jury shown security footage of moments before Bushey murders - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jurors have been given a glimpse into the final hours of a 25-year-old woman murdered by an ex-partner on the same day as her sister and mother.\nA home security system captured dog groomer Louise Hunt working in the garden of the house she shared with her father, BBC racing commentator John Hunt, mother, Carol Hunt, and sister Hannah Hunt, in Bushey, Hertfordshire.\nKyle Clifford, 26, of Enfield, north London, has admitted stabbing Carol, 61, to death and shooting Louise and Hannah, 28, with a crossbow at their home on 9 July 2024.\nBut he denies raping Louise before killing her.\nJurors have been told Clifford killed Carol first, then Louise, followed by Hannah.\nThey were played clips of footage captured by the Hunts' home system.\nOne clip showed Clifford walk up to the front door and chat to Carol, before being let in.\nA prosecution barrister said a scream could be heard seconds after the door closed.\nFootage showed Louise walking in and out of a \"pod\" she used as a work base in the garden – unaware that Clifford was in the house.\nShe is shown carrying one dog and walking another before making her way into the house through a patio door.\nAlison Morgan KC, who is leading the prosecution team, said evidence showed that Clifford had used Louise's phone to message Mr Hunt – about an hour before he murdered her.\nMiss Morgan said Clifford had asked Mr Hunt if he would be late home from work.\nThinking it was from his daughter, Mr Hunt, who sat in the public gallery of the court with relatives, replied: \"Late, I'm afraid. Everything OK sweetness?\"", "url": "https://www.bbc.co.uk/news/articles/c4g7dvdpl3yo"}