{"authors": ["Robbie Meredith", "www.facebook.com"], "date_download": "2025-04-26 06:33:32", "date_modify": "2025-04-26 06:33:32", "date_publish": "2025-02-27 06:42:35", "description": "Richard Pengelly faced questions from the education committee about a decision to replace the pitch.", "filename": "news_articles_ckgdykn0zrgo_1745649212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8fb0/live/04a82700-f473-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgdykn0zrgo_1745649212.html", "title": "Lisneal College: 'Mistake made' over school football pitch use", "title_page": "Lisneal College:  'Mistake made' over school football pitch use - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Education Authority (EA) made a mistake by claiming that a Londonderry school football pitch had not been used since 2019, according to the EA's chief executive Richard Pengelly.\nMr Pengelly faced questions from MLAs on Stormont's education committee about a decision to replace the pitch at Lisneal College.\n\"There's been a lot of commentary on this by a lot of people, I think most people along the way have got something wrong about this,\" he said.\n\"Uniquely we have held our hand up and said we got something wrong. Don't let that undermine everything else we're saying.\"\nThe Belfast Telegraph, external reported the funding for the pitch along with details of a meeting the school held with Education Minister Paul Givan and colleagues of his from the Democratic Unionist Party (DUP).\nIt also reported that the school had not made an application for the money.\nGivan later denied having \"any influence\" on the decision to award £710,000 for the pitch upgrade.\nMr Pengelly told MLAs on Wednesday that as controlled schools, like Lisneal, were actually owned and managed by the EA there was \"no need for an application\" for the work.\n\"It wasn't anything that was missing or erroneous about the process, the lack of an application form,\" he said.\n\"An application would therefore have been us applying to ourselves.\"\nHe also gave other details about the process to replace the pitch.\nMr Pengelly said that the Lisneal pitch had been assessed as a \"major health and safety risk\" in 2019.\nHe admitted, though, that the EA had made a mistake by originally claiming that the pitch \"hadn't been in use\" since then.\nMr Pengelly said that EA statement had been wrong and released without all \"checks\" taking place.\nQuestioning Mr Pengelly, the Sinn Féin vice-chair of the committee, Pat Sheehan, said that replacing the pitch was not an \"inescapable health and safety pressure.\"\n\"To me inescapable means there was no alternative but in this case there were a number of alternatives,\" he said.\n\"Whatever about health and safety, it wasn't an inescapable pressure.\"\nRichard Pengelly responded that the school relied on the pitch as its main play and recreation space for pupils.\n\"The point is if it was being used, it wasn't an inescapable health and safety pressure, do you not accept that?\" Sheehan responded.\nMr Pengelly replied, \"I don't.\"\nHe said that if a school needed a replacement roof, for instance, the EA did not close the school but it was still an \"inescapable pressure.\"\n\"I don't accept that point,\" Sheehan replied.\n\"There was educational funding used to bring the pitch to a standard that wasn't required,\" he said.\n\"So that money could have been used elsewhere for some more pressing or urgent need.\"\n\"But it wasn't, it was decided that it would go in to bring this pitch up to a certain standard.\"\n\"The pitch is required by the school, the pitch is part of the school estate,\" Mr Pengelly replied.\nLisneal's principal Michael Allen recently decided to take up a new position with the Department of Education (DE).\nHe accepted the post of education adviser for the Strule Shared Education Campus in Omagh.\nMr Allen previously told BBC NI's The Nolan Show he had considered quitting after it emerged the school was allocated funding to upgrade its football pitch.\nMr Pengelly was seconded to his post as interim chief executive of the EA for up to three years on 15 April 2024.", "url": "https://www.bbc.co.uk/news/articles/ckgdykn0zrgo"}