{"authors": ["Marcus White", "www.facebook.com"], "date_download": "2025-04-26 06:43:30", "date_modify": "2025-04-26 06:43:30", "date_publish": "2025-03-01 17:57:12", "description": "Parents tell of their frustration over the care of a teenager with borderline personality disorder.", "filename": "news_articles_c0mw9plwmmjo_1745649810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d51d/live/ac1a71c0-f69c-11ef-a895-fbbe0f4341f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0mw9plwmmjo_1745649810.html", "title": "Teen died after healthcare 'catastrophes', says family", "title_page": "Bournemouth: Teen died after healthcare 'catastrophes', says family - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager took his own life after a \"catalogue of catastrophes\" in his mental healthcare, his family has said.\nAlec Channing, 18, also known as \"Kieran\", was found dead in his room at Arts University Bournemouth (AUB) on 27 January 2022.\nA coroner previously said there were \"missed opportunities\" by NHS trusts to intervene.\nThe teenager's parents, from Devon, said he was \"left to his own devices\" despite concerns for his safety.\nIn a statement, the parents, who asked not to be named, expressed frustration over his mental health treatment from the age of 15.\nThey said: \"We were never advised how, as parents, we could help or manage his condition.\"\nIn September 2021, he began his university course, shortly after making four attempts on his life and being diagnosed with emotionally unstable personality disorder (EUPD), they told the BBC.\n\"His care worker was supposed to have referred him to the Bournemouth mental health team but soon after went on long-term sick leave and never came back,\" they added.\nIn January 2022, the student was detained in hospital in Devon again under the Mental Health Act.\nTwo weeks later, he returned to Bournemouth where fellow students reported concerns about him to AUB, his parents said.\nHowever, an NHS appointment days before his death was cancelled when he caught Covid, leaving him feeling let down, they added.\nThey said: \"Although we had suspicions throughout his journey that the healthcare professionals could have done more, we were always trusting and hoping they were doing their best.\n\"It was only after the seven-day inquest that the coroner confirmed our doubts that... they could have done better.\"\nIn a Prevention of Future Deaths Report, external, coroner Richard Middleton said the cancelled Bournemouth appointment was a \"missed opportunity\".\nHe said the teenager's care after hospital in January 2022 was not properly planned and university welfare staff had no training in EUPD, otherwise known as Borderline Personality Disorder.\nNeither the university, Dorset Healthcare NHS Foundation Trust or Devon Partnership NHS Trust offered any comments when approached by the BBC.\nSpecially-built benches in the teenager's memory, paid for by well-wishers, have been placed at a school in Ottery St Mary and in Exminster where he grew up.\nIf you are affected by any of the issues raised in this story, support and advice is available via the BBC Action Line.", "url": "https://www.bbc.co.uk/news/articles/c0mw9plwmmjo"}