{"authors": ["Mark Easton", "Ben Wright", "www.facebook.com"], "date_download": "2025-04-26 06:36:07", "date_modify": "2025-04-26 06:36:07", "date_publish": "2025-02-27 06:03:43", "description": "A government-commissioned review will call for content showing women being choked during sex to be illegal.", "filename": "news_articles_c0q1wx3nzy9o_1745649367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/121e/live/f1fd2c00-f4df-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0q1wx3nzy9o_1745649367.html", "title": "Ban degrading and violent online pornography, review proposes", "title_page": "Ban degrading and violent online pornography, review proposes - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The review proposes that porn videos considered too harmful for any certificate in the offline world should be banned online.\nBaroness Bertin argues that online pornography contributes to some of the \"gravest issues in our society, from domestic violence to toxic masculinity to the mental health crisis among young people\".\nShe told the BBC: \"I'm not saying that people shouldn't watch porn. I'm not saying porn shouldn't exist. I'm not a prude.\"\nHowever, her 32 recommendations on what government should do about the \"high-harm sector\" of legal online pornography are likely to initiate a debate about how far the state should police people's sex lives.\nBaroness Bertin said online porn was not \"properly scrutinised and regulated\" in the same way as offline content.\n\"It strikes me as incredible that to buy a DVD, which sounds so sort of retro, the BBFC [British Board of Film Classification] has to put a stamp on it, has to check that certain standards have been met. That there's no sense you are encouraging child sexual abuse. No harmful, degrading, humiliating practices which is not through consensual roleplay,\" she told the BBC.\n\"You just have to go on the homepages of some of these mainstream sites and you will see of all that degrading content – particularly violent towards women – and it's all there for everyone to see.\"\nHer report suggests pornography websites depicting the non-fatal choking of women during sex has normalised such behaviour in the real world, with violent and degrading material rife on mainstream platforms amid a \"total absence of government scrutiny\".\nThe review cites research suggesting that over a quarter of the nation regularly accesses online porn with a third of all men watching material at least once a week. It concludes that increasingly disturbing content is \"rewiring\" the way young people think about gender, sex and their role in society.\nThe Department for Science Innovation and Technology said it would look at the links the review highlighted.\n\"We have already announced we will ban the creation of intimate deepfakes without consent and from next month under the Online Safety Act platforms will have to proactively tackle illegal content including extreme pornography and sexual abuse material,\" the spokesperson said.\n\"But further action is needed to address the review's shocking finding that graphic strangulation is increasingly appearing in pornography, despite being illegal, and is becoming normalised in real life.\n\"We will urgently ensure that platforms, law enforcement and prosecutors take all necessary steps to tackle this disturbing harm.\"\nDowning Street also described the findings of a report into the porn industry as \"shocking\", and suggested it would \"act swiftly\" to address gaps in the law - but stopped short of saying it would be banned.\nThe review's recommendations were welcomed by the End Violence Against Women Coalition, which called for action from the government to address the harms arising from the current state of the porn industry.\n\"We know these companies are profiting enormously from sexual violence, and until they are forced to clean up their act, they won't,\" the group's director Andrea Simon said.\nMadelaine Thomas, an adult content creator, also welcomed the review but added: \"If we look to police people's sexual interests that's problematic.\n\"I don't think prohibition has ever eliminated demand in any way but I do think there are ways that we can work together to come up with frameworks that prioritise both consent and compassion and allow people to create and view what they would like to view on the internet,\" she told BBC Two's Politics Live.", "url": "https://www.bbc.co.uk/news/articles/c0q1wx3nzy9o"}