{"authors": ["Madeline Halpert", "www.facebook.com"], "date_download": "2025-04-26 07:25:03", "date_modify": "2025-04-26 07:25:03", "date_publish": "2025-02-28 02:02:45", "description": "The attorney general is accusing federal agents in New York of withholding documents related to sex offender Jeffrey Epstein.", "filename": "news_articles_cyvee9rpdq6o_1745652303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/290a/live/878302a0-f57a-11ef-a73e-7d6ca483ec0b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cyvee9rpdq6o_1745652303.html", "title": "Attorney General Pam Bondi alleges FBI agents withheld Epstein documents", "title_page": "Attorney General Pam Bondi alleges FBI agents withheld Epstein documents - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US Attorney General has accused federal investigators of withholding thousands of documents related to sex offender Jeffrey Epstein, and asked the FBI to release all the information by Friday morning without any omissions.\nIn a public letter, Attorney General Pam Bondi asked FBI director Kash Patel to also investigate why thousands of documents related to Epstein probe were withheld by the agency.\nBondi released the \"first phase\" of newly declassified files on Thursday, but it contained no major new allegations about Epstein nor revelations about his associates.\nEpstein was arrested in July 2019 on charges of sex trafficking and died by suicide while awaiting trial.\nThe attorney general demanded all information related to the disgraced financier be turned over by 08:00 EST (13:00 GMT) on Friday \"regardless of how it was obtained\".\n\"Late yesterday, l learned from a source that the FBI Field Office in New York was in possession of thousands of pages of documents related to the investigation and indictment of Epstein,\" she wrote in the letter. , external \"Despite my repeated requests, the FBI never disclosed the existence of the files.\"\nAdditionally, Bondi directed FBI director Patel to conduct an immediate investigation into why her order to the FBI was not followed.\n\"You will deliver to me a comprehensive report of your findings and proposed personnel action within 14 days,\" she said.\nIn a post on X, Patel said the agency was \"entering a new era—one that will be defined by integrity, accountability, and the unwavering pursuit of justice\".\n\"There will be no cover-ups, no missing documents, and no stone left unturned,\" he wrote.\nThe declassified files largely contain documents that have been previously leaked but never released in a formal capacity by the US government, according to a statement, external released by the justice department.\nThe 10 files include a series of flight logs from Epstein's private jet, plus a partly-redacted \"contacts list\".\nWhile running for the White House, President Donald Trump had promised to release the \"Epstein list\", a rumoured document that some believe may link high-profile individuals to sex crimes.\nBondi was also urged by Republican lawmakers to disclose all information about the disgraced financier.\nOn Thursday afternoon, the White House first handed over the initial batch of 200 files - in binders that read \"The Epstein Files: Phase I\" - to conservative influencers.\nThe influencers included political commentator Rogan O'Handley, known as DC Draino, as well as Libs of TikTok creator Chaya Raichik, US media reported.\nBut the limited information in the latest batch of files disappointed some Republicans, including Representative Anna Paulina Luna, who leads a House Republican task force on government transparency.\n\"I nor the task force were given or reviewed the Epstein documents being released today,\" Luna posted on X. \"This is not what we or the American people asked for and a complete disappointment.\"\nConservative commentator Glenn Beck wrote: \"The Epstein files are a total joke. Who is subverting POTUS?\"\nMost of the \"Epstein docs\" over the past several years have come out of civil litigation between one of Epstein's accusers, Virginia Giuffre, and his former girlfriend Ghislaine Maxwell.\nThe 66-year-old had pleaded guilty to soliciting prostitution from a minor in 2008.\nGhislaine Maxwell lost her appeal last year against her own sex trafficking conviction for helping Epstein sexually abuse young girls.", "url": "https://www.bbc.co.uk/news/articles/cyvee9rpdq6o"}