{"authors": ["Bob Dale", "www.facebook.com"], "date_download": "2025-04-26 06:49:29", "date_modify": "2025-04-26 06:49:29", "date_publish": "2025-03-01 09:56:16", "description": "The city council said the event will go ahead as planned, despite work on the Royal Albion hotel.", "filename": "news_articles_cwyn6e77r12o_1745650169.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/93fc/live/f27c68d0-f679-11ef-b3b4-819a5c0aa1c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyn6e77r12o_1745650169.html", "title": "Brighton half-marathon route unaffected by hotel demolition", "title_page": "Brighton half-marathon route unaffected by hotel demolition - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Brighton half-marathon will follow its usual route, despite demolition work that is being carried out on a hotel near the seafront, the city council has said.\nA section of the A259 seafront road has been closed for a week after warnings that the Royal Albion Hotel was at risk of \"catastrophic collapse\".\nBrighton & Hove City Council has now said it is \"confident\" Sunday's main event can take place on its original planned route, as organisers prepare for youth races on Hove Prom later.\nHowever, diversions will remain in place for eastbound traffic on Monday.\nThe council said the position of a pedestrian island outside the hotel meant there was not enough space for a contraflow to be installed which would have allowed traffic in both directions.\nInstead, the two lanes on the south side of the road will be reopened for cars travelling west, with eastbound traffic diverted.\nCouncillor Trevor Muten, cabinet member for transport, parking and public realm, said: \"I'm pleased work has progressed enough so we can safety open the road to be used for the Brighton Half Marathon.\n\"It's a brilliant event for the city and I want to thank the organisers for their cooperation and understanding over the last week.\n\"I know this ongoing inconvenience is frustrating for residents and businesses, but until the urgent demolition work has been carried out to make the structure safe we can't open more of the road.\"\nThe youth races, a mile-long race for children aged seven to 17, began at 13:00 GMT on Saturday, while the main event starts at 09:30 on Sunday.", "url": "https://www.bbc.co.uk/news/articles/cwyn6e77r12o"}