{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:26:56", "date_modify": "2025-05-19 15:26:56", "date_publish": "2017-07-04 00:00:00", "description": "The US could lift a ban on laptops and other large electronics devices on inbound flights.", "filename": "news_live_business-40455613_1747668416.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/news/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_live_business-40455613_1747668416.html", "title": "Business Live: Laptop ban binned?", "title_page": "Business Live: Laptop ban binned? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Good evening\nThat's it for Business Live as the US stock markets are closed for Independence Day.\nPlease join us again at 6.00am on Wednesday morning for all the breaking business and economics news.\nUntil then, have a great evening.\nFTSE indexes finish lower\nThe FTSE 100 has closed down 6.41 points at 7,370.68.\nShares in Worldpay finished 28.1% higher at 409.60p following takeover approaches for the payment processing company.\nThe FTSE 250 ended slow down 18.96 points at 19,301.47.\nThe pound is down 0.17% against the dollar at $1.2918.\nSterling is up 0.02% against the euro at 1.13860 euro.\nCurrys PC World makes safety push\nCurrys PC World announced this week it's emailing millions of customers urging them to register their electrical products.\nJason Roberts, from Dixons Carphone, the parent company of Currys PC World, said:\n\"For us it's about ensuring that manufacturers, if needed, have got your latest information... so that if they do at any point - and it's very rare, I should stress, that it's ever needed - if they do need to get in touch regarding a safety related issue, they've got your details.\"\nHe says that \"in the vast majority of cases\" your information will not be used for marketing purposes.\nEC raids Irish motor insurance companies\nThe European Commission has just announced that its officials \"carried out unannounced inspections at the premises of companies active in motor insurance in the Republic of Ireland\" on 4 July.\nIt said: \"The commission has concerns that the companies involved may have engaged in anti-competitive practices in breach of EU antitrust rules that prohibit cartels and restrictive business practices and/or abuse of a dominant market position.\"\nFTSE 100 reverses fall\nJust a gentle reminder that the US stock markets are closed today for the 4 July national holiday.\nIn London, the FTSE 100 has reversed earlier declines and is now trading up 4.54 points at 7,381.63.\nNo prizes for guessing who the biggest riser is on Tuesday. It is still the payment processing group Worldpay whose shares are up 29.2% at 412.80p following takeover approaches by Vantiv and JPMorgan.\nOn the list of the biggest fallers, subprime lender Provident Financial and aerospace giant BAE Systems are vying for first place. Provident Financial is down 1.39% at £23.35 and BAE is 1.4 lower at 622.50p.\nThe FTSE 250 is down 14.90 points at 19,305.53.\nThe pound is off 0.14% against the dollar at $1.2923.\nBut sterling is up 0.06% against the euro at 1.1391 euros.\nKremlin confirms Putin to meet Trump\nUS President Donald Trump will meeting with his Russian counterpart Vladimir Putin on Friday at the G20 summit in Hamburg according to a spokesman for the Kremlin.\nThe Russian representative said it will be a \"fully-fledged\" meeting, rather than an informal chat on the sidelines.\nIt is not yet clear what the two will discuss.\nAshley banker accused of 'making up evidence'\nAn investment banker who is suing Sport Direct founder Mike Ashley has been accused of \"making up evidence\".\nThe fight relates to a claim by Jeffrey Blue that billionaire Mr Ashley, who also owns Newcastle United Football Club, promised to pay him £15m if the banker could increase Sports Direct's share price from £4 to £8m.\nMr Blue says that Mr Ashley paid only £1m.\nOn Monday, the High Court heard how Mr Ashley drank 12 pints with vodka chasers during a business meeting in a pub where he vomited in a fireplace.\nTanzania lawmakers back controversial mining laws\nSammy Awami\nBBC Africa, Dar es Salaam\nTanzania's parliament has passed two controversial laws to bring about far-reaching reforms in the mining sector.\nOne law explicitly states that the Tanzanian people will have permanent sovereignty over all natural wealth and resources, and ownership and control will be exercised by the government on behalf of the people.\nThis means private companies would mine on behalf of the nation - whereas before the law stated that once firms signed a contract with the government, they owned the minerals.\nAnother law empowers parliament to review all agreements made by the government regarding natural resources.\nThe two pieces of legislation follow months of dispute between President John Magufuli's government and UK-listed mining firm Acacia over revenue sharing.\nAcacia is accused of under-reporting the gold and copper levels in its concentrate exports by more than 10 times and of underpaying the government tens of billions of dollars over the two decades it has been operating in the East African country.\nThe company strongly denies any wrongdoing.\nMining companies and lobby groups had urged the government to delay passing the two laws to allow for more consultation.\nThe government, however, pushed ahead with gaining parliamentary approval for the legislation.", "url": "https://www.bbc.com/news/live/business-40455613"}