{"authors": ["Bea Swallow", "www.facebook.com"], "date_download": "2025-04-26 06:43:43", "date_modify": "2025-04-26 06:43:43", "date_publish": "2025-03-01 17:41:30", "description": "Charities warn they may have to cut back on services unless they receive sustainable funding.", "filename": "news_articles_cn04w935zlzo_1745649823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/35c8/live/967dd8e0-f6b8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn04w935zlzo_1745649823.html", "title": "Somerset hospice warns 'rising costs mean difficult decisions'", "title_page": " Somerset hospice warns 'rising costs mean difficult decisions'  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hospice charities have warned \"difficult decisions\" could be on the horizon unless changes are made to \"restrictive\" government funding.\nOn Wednesday, the government announced the release of £25 million for hospices across England, but this is reserved for facility upgrades and refurbishments only.\nDorothy House Hospice Care, covering Bath and North East Somerset, is set to receive £298,000 of this funding and must spend it by the end of March.\nFacing a \"significant rise\" in demand and costs, hospices across the country have been rallying for a more sustainable, long-term funding solution for the sector.\nStephen Kinnock, the minister for care, said the money would help \"transform hospice facilities\" across England.\n\"Hospices provide invaluable care and support when people need it most and this funding boost will ensure they are able to continue delivering exceptional care in better, modernised facilities,\" he said.\nHowever, the cash is reserved for purchasing new medical equipment, improving gardens, refurbishing buildings, upgrading technology and modernising facilities.\nPenny Agent, chief operating officer for Dorothy House, said unless it received support with staffing costs, it would have no choice but to cut back on services.\n\"We are really appreciative of this recent funding, however it is ringfenced, and we can only really use it on estate or capital use,\" Ms Agent said.\n\"It's all well and good having a very pretty estate, but if you can't actually pay the staff who provide the care to our patients, it all crumbles.\"\nIt currently costs Dorothy House £19 million per year to provide its services. Just 20% of this funding comes from government, with donations providing the rest.\n\"The funding we receive has not kept pace with the increase in costs,\" Ms Agent explained.\n\"Unless we get additional and appropriate funding, we're going to have to make some really difficult decisions around how we deliver our services.\"", "url": "https://www.bbc.co.uk/news/articles/cn04w935zlzo"}