{"authors": ["Galya Dimitrova", "www.facebook.com"], "date_download": "2025-04-26 06:51:55", "date_modify": "2025-04-26 06:51:55", "date_publish": "2025-02-28 17:26:55", "description": "Concerns about a progress report have been raised during Oxfordshire County Council's scrutiny committee.", "filename": "news_articles_cy4vv3grpxjo_1745650315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bcf8/live/4e0e1450-f5c6-11ef-97ab-abb74cabf06c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy4vv3grpxjo_1745650315.html", "title": "Oxfordshire parents wait for 'tangible' outcomes on SEND provision", "title_page": "Oxfordshire parents wait for 'tangible' outcomes on SEND provision - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Parents say they are still waiting for special educational needs and disabilities (SEND) action plans to \"translate into outcomes that are tangible\".\nOxfordshire County Council's scrutiny committee reviewed a report on progress made across the Local Area Partnership after issues were raised by the 2023 inspection.\nMelody Drinkwater from Oxfordshire SEND Parent Action said that contained \"little or no\" information about its impact.\nThe council said overall progress was being made, although \"not fast enough\" and \"not in all areas\".\nKaty Bentley, who has a deaf daughter, said she attended committee meeting in response to claims that \"only a small number of parents [are] not feeling the change on the ground\".\n\"I'm curious to know how officers conclude it's a small number - and I'm here to tell you it's not,\" she said.\n\"And there are many more stories but we are almost universally exhausted and in my case, frustrated.\"\nMrs Bentley said it had been years waiting to see the priority action plan \"translate into outcomes that are tangible and we are still waiting\".\nShe said her daughter had to be moved from a \"mainstream school with excellent SEND support\" to a specialist school.\nThe school applied for education, health and care plans (EHCP) and a deaf base offered her a place starting next term.\n\"I asked if the local authority would issue the EHCP naming the base from the term that the space was available,\" Mrs Bentley said.\n\"However, the final EHCP was issued naming the current school and I was told that naming the specialist space from the next term was incompatible with the education of others.\"\nMrs Bentley lodged an appeal and \"spent countless hours\" with the school working out how to implement any EHCP in the mainstream school setting.\n\"On the last week of term, 15 minutes before mediation started, I got a phone call with the 'good news' that a panel had decided to change the EHCP, naming the deaf base from the start of the next term.\"\nShe said the decision had \"apparently been made two weeks prior\" and she had not known the panel had been happening.\n\"In a SEND system that is at breaking point, I cannot understand how that is considered workable for anybody else apart from the council,\" she added.\nMs Drinkwater said that while \"progress seems to be made\", the report was \"overly positive\".\n\"[It] is focused almost entirely on what the council's doing with little or no information about the impact,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cy4vv3grpxjo"}