{"authors": ["Nic Rigby", "Andrew Sinclair", "www.facebook.com"], "date_download": "2025-04-26 06:13:23", "date_modify": "2025-04-26 06:13:23", "date_publish": "2025-03-02 06:06:29", "description": "Labour MP Jack Abbott says immigration is being cut and a care industry pay review will take place.", "filename": "news_articles_c62xjd5p6dxo_1745648003.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/25c5/live/6db3dbd0-f613-11ef-b87e-ada6db845779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c62xjd5p6dxo_1745648003.html", "title": "Migrant permits should be time-specific", "title_page": "Migrant permits should be time-specific - Nigel Farage - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Migrant workers needed in the UK should only be employed on a \"time-specific work permit\", Nigel Farage said.\nThe leader of Reform UK and Clacton MP claimed care home workers were \"necessary\" rather than skilled and should not stay in the UK indefinitely.\nBut his view was attacked by Liberal Democrat MP Charlotte Cane, who said it was \"absolutely a skilled task\" and they should be paid properly and welcomed to the UK.\nLabour MP for Ipswich, Jack Abbott, said the government was reducing immigration and would set up a pay review for people working in the care industry.\nIn an interview with BBC Politics East, Farage said: \"If we really can't recruit people in Britain to work in care - and I believe we could with some tweaks to the tax system - recruit them on a time-specific contract with no entitlement to health care or social benefits.\n\"We give people who come in indefinite leave to remain and once they have got that they can then bring in their mum, their dad, their aunty, their uncle, theirs. That's what's gone wrong. We have been way too lax on this.\"\nHe said he recognised skilled workers, such as builders, were sometimes needed from abroad and saw care home workers as \"necessary\" workers rather than skilled.\nCane, the Ely and East Cambridgeshire MP, also appeared on the programme as part of a panel including Abbott and Tom Pursglove, the former Tory MP for Corby and ex-immigration minister.\nResponding to Farage, Cane said: \"We need to respect the value these people [migrants] are bringing to our country.\n\"I really do object to the suggestion that care workers aren't skilled. If you've ever watched a care worker work, they are hugely skilled and hugely important.\n\"We struggle to get enough care givers, who struggle to provide the care people need in their homes.\n\"We should be really grateful that these people are willing to come to our country to help us care for people in need and it is absolutely a skilled task. We also need to pay these people properly.\"\nAbbott said: \"One of the biggest reasons we have a social care problem in this country is because of retention and recruitment because we don't pay them properly.\n\"We are going to set up a pay review body to make sure we are paying people for the jobs they do.\n\"It's an important role but physically demanding too. We should be paying people properly.\"\nBBC Politics East will be broadcast on Sunday, 2 March at 10:00 GMT on BBC One in the East of England, and will be available after broadcast on BBC iPlayer.\nFollow Essex news on BBC Sounds, Facebook, external, Instagram, external and X, external.", "url": "https://www.bbc.co.uk/news/articles/c62xjd5p6dxo"}