{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:31:28", "date_modify": "2025-04-26 06:31:28", "date_publish": "2025-02-27 08:48:47", "description": "Libraries at risk of closure in Perth & Kinross and Moray have been saved following council budget meetings.", "filename": "news_articles_c20dgy1epl6o_1745649088.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8823/live/a182d270-f449-11ef-837a-fdc1fd381948.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20dgy1epl6o_1745649088.html", "title": "Councils halt plans to close libraries", "title_page": "Councils halt plans to close libraries - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Councils in Moray and Perth & Kinross have halted plans to close several libraries following their budget meetings.\nPerth & Kinross Council announced a 9.5% council tax increase and said the rise made it possible to assign an additional £1m of funding to save five library facilities for the next two years.\nIn Moray, a number of alternative provisions will be considered after the council halted the plans to shut seven out of its 11 libraries.\nCommunities across Scotland have protested against the \"never seen before\" cuts to library services proposed by some local authorities, who argued that fewer people were using them and the ways to access books have changed.\nThe new Perth & Kinross Council budget includes the funds needed to maintain current premises and opening hours of five at-risk libraries - Alyth, Auchterarder, Birnam, Cormie and Scone.\nCulture Perth and Kinross (CPK), which runs libraries on behalf of the council, will receive two payments of £500,000 over the next two years to retain these branches and help safeguard other council services.\nIn addition to the 9.5% council tax increase, the council also approved provisional increases of 9.5% for 2026/27 and 6% for 2027/28.\nSave Our Rural Libraries, a group opposing the closure plans in Perth & Kinross, has organised numerous protests, set up petitions totaling 5,600 signatures, met First Minister John Swinney and turned the debate national by bringing it to Holyrood.\nSpeaking on behalf of the group, Hannah Wickes said they were heartened that councillors had recognised the value rural libraries bring to communities.\nShe said: \"We want our kids, young people, new parents, and older folk to have the chance to socialise, digitally upskill and feel a sense of community and opportunity through these libraries - and thanks to the budget decision today that's become a possibility again.\"\nShe added that their work doesn't end here.\n\"We need a commitment that our local council will continue to fund our rural libraries, and integrate them with other local services well beyond these current two years,\" she said.\nThe group also calls for more transparency on how funds are spent by CPK, as well as a shift in the way the organisation engage with communities on behalf of the council.\n\"As a next step we would love to see a national review announced that will help define what an 'adequate library provision' is, particularly for those in rural areas across Scotland,\" Ms Wickes said.\nElsewhere in Moray, seven out of 11 facilities were earmarked for closure in a bid to save £275,000 last year - Burghead, Cullen, Dufftown, Keith, Lossiemouth, Fochabers and Tomintoul.\nMoray Council, which has agreed a 10% council tax rise next year, said it was retaining all 11 branches and stopping the proposed closures at a meeting last week.\nThe council's leader, Kathleen Robertson, said: \"We've always said public input on consultations is vital and we've shown with this decision that we do listen and take the views of residents on board.\n\"However, the fact of the matter is we still need to transform our library services as part of our vision for the future and to make sure it's a sustainable offering for the council,\" she said.\nInstead of permanently closing the branches, the council will review their opening hours and consider a new option to co-locate some libraries within schools.", "url": "https://www.bbc.co.uk/news/articles/c20dgy1epl6o"}