{"authors": ["Lynette Horsburgh & Rachael Lazaro", "www.facebook.com"], "date_download": "2025-04-26 08:01:47", "date_modify": "2025-04-26 08:01:47", "date_publish": "2025-02-26 17:17:45", "description": "Police \"strongly believe\" they have found the body of Rania Alayed from Manchester buried by a road.", "filename": "news_articles_c0l1zd75ke3o_1745654507.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/abb8/live/b4b3c0b0-f468-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0l1zd75ke3o_1745654507.html", "title": "Remains found in search for woman murdered in 2013", "title_page": "Rania Alayed: Remains found in search for woman murdered in 2013 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Police searching for the body of Rania Alayed, who was murdered by her abusive husband 12 years ago, have found human remains.\nAhmed Al-Khatib is serving a life sentence for killing the mother-of-three in a planned \"honour killing\" in Salford, but her body was never found.\nNew information led officers to return to search for the 25-year-old near the A19 in Thirsk, North Yorkshire, on Monday, Greater Manchester Police (GMP) said.\nRemains have been discovered buried there, which police \"strongly suspect\" is Ms Alayed, the force added.\nHer son Yazan said the discovery had \"come as a surreal surprise to me and my family\".\n\"Being able to provide a final resting place is all we have wanted,\" he said.\n\"To have the ability to lay down a few flowers for my mother is more than I can ask for from this world.\"\nMs Alayed, formerly of Norton on Teesside before moving to Greater Manchester, had suffered years of abuse at the hands of Al-Khatib, his trial heard.\nJurors were told that he murdered his wife in a \"pre-planned honour killing\" because he believed she had become too westernised and was \"establishing an independent life\".\nThe trial heard Al-Khatib then began an elaborate deception, with CCTV showing him wearing a headscarf in an attempt to pass himself off as Ms Alayed.\nHe messaged and texted her friends and family trying to convince them she was still alive.\nSentencing judge, Mr Justice Leggatt, told him: \"The contempt you showed for Rania in death matched the contempt of how you treated her in life.\"\nDet Ch Insp Neil Higginson said the murder was \"utterly horrific\" and not knowing where her body was had \"inflicted further pain to all those who knew her\".\nHe said: \"More than a decade after her murder, we now strongly believe we have located Rania's body and are finally able to provide closure to her family, who we know have endured so much pain and grief over the years.\"", "url": "https://www.bbc.co.uk/news/articles/c0l1zd75ke3o"}