{"authors": ["Martin Eastaugh", "www.facebook.com"], "date_download": "2025-04-26 07:43:00", "date_modify": "2025-04-26 07:43:00", "date_publish": "2025-02-26 18:43:54", "description": "Three men are standing trial over the theft of a gold toilet which had been part of an exhibition.", "filename": "news_articles_ce8my7ydg04o_1745653380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e698/live/3294f740-f29f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ce8my7ydg04o_1745653380.html", "title": "Gold toilet theft trial: Staff thought raid was boiler explosion", "title_page": "Gold toilet theft trial: Staff thought raid was boiler explosion - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A gang that broke into Blenheim Palace to steal a solid gold toilet worth £4.8m made so much noise that staff thought a boiler had exploded, a court heard.\nThe artwork, called America, was taken from the Oxfordshire stately home in the early hours of 14 September 2019, two days after it went on display.\nMichael Jones, 39, from Oxford, denies one count of burglary. Fred Doe, 36, from Windsor, and 41-year-old Bora Guccuk, from west London, both deny conspiring to transfer criminal property.\nThe toilet was most likely broken up and has never been recovered, Oxford Crown Court was told.\nPalace night duty manager Abel Clarke said his room was above the golden toilet exhibition and that he was awoken by a fire alarm.\n\"I heard two loud bangs coming from below my room,\" he said in a statement read to jurors.\n\"My first thought was that the boiler had exploded.\"\nHe went to see colleague Reza Haghighi, who was monitoring CCTV, who told him there were vehicles outside and people were breaking in.\nMr Clarke said he saw headlights facing in his direction but only got a glimpse of what was happening.\nHe looked into the courtyard and saw two vehicles, including a truck, were pulling away \"at speed\".\n\"At one point I was running alongside the pick-up for a few seconds but could not see the person inside,\" Mr Clarke added.\nMr Haghighi was working overnight monitoring 48 CCTV cameras stationed around the Unesco World Heritage Site until 06:00 GMT on 14 September.\nHe said at 04:50 he saw vehicles enter the palace's quadrangle and zoomed in to see the gang approach.\nMr Hagigi said he pressed a panic button and then the fire alarm, which turned on lights around the site.\nFootage previously played to the jury showed two vehicles driving across the Great Courtyard, before hooded individuals armed with sledgehammers and a large crowbar broke into the palace.\nThe 18-carat gold toilet was part of an exhibition by Italian conceptual artist Maurizio Cattelan.\nIt weighed 98kg (216lb) and was insured for $6m (£4.8m). Gold prices at the time would have seen the metal alone worth £2.8m, the court was told.\nThe palace is the birthplace of Sir Winston Churchill.\nA fourth man, James Sheen, a 40-year-old from Wellingborough in Northamptonshire, has previously pleaded guilty to burglary, the court heard earlier in the trial.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/ce8my7ydg04o"}