{"authors": ["Gemma Dillon", "Jessica Bayley", "www.facebook.com"], "date_download": "2025-04-26 03:40:30", "date_modify": "2025-04-26 03:40:30", "date_publish": "2025-03-05 10:02:07", "description": "Students in Bradford say the consequences of knife crime are not getting through to their peers.", "filename": "news_articles_cd0nvlp2n2ko_1745638830.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ca2/live/232aed60-f915-11ef-b698-2d7c94e2f7af.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0nvlp2n2ko_1745638830.html", "title": "Carrying knives in Bradford 'commonplace' among teens", "title_page": "Carrying knives in Bradford 'commonplace' among teens  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Teenagers in Bradford have said they fear the consequences of knife crime are not getting through to their peers.\nStudents at New College Bradford said carrying blades had become \"commonplace\" among young people in the city.\nThe BBC spoke to students in the city after West Yorkshire mayor Tracy Brabin published her crime plan for the region.\nResponding to the students views, Alison Lowe, deputy mayor for policing, said a key part of delivering the plan was to listen to young people's concerns.\nAreebah, 17, said knives were now \"commonplace\" and described hearing people talk about them as \"something that shouldn't be concerning\".\nShe said on one occasion she had seen had been walking to meet a group of friends when she had seen a group of boys with a blade.\n\"One of them pulled out a knife to show it to his friends whilst I was walking past,\" she said.\n\"Then I noticed they turned around and followed me. I was really afraid in that situation something might go wrong.\"\nShe said more needed to be done to remove the \"sense of glorification\" around knives.\nVictor, also 17, said he had not been directly impacted by knife crime, but he had a friend who had been unable to take his GCSEs after he had been stabbed.\nHe said he did not believe the way those in authority were dealing with knives was \"effective\" and said he would like to see more done to highlight the \"repercussions and consequences of what could happen\".\nHe questioned whether the Deputy Mayor knew how they were going to stop knife crime, saying: \"Just saying we are going to stop knife crime isn't enough, we need an actual strategy put in place for it to happen.\"\nFellow student Amy, 17, said she worried that efforts to tackle knife crime were falling on deaf ears, saying she did not believe those involved \"would hear about what the Mayor's saying or what the Mayor is trying to do\".\nShe said: \"They'll just think about gangs, they're not thinking about the wider societal impact. They're more thinking about their own safety and protection.\"\nHer friend, 17-year-old Khushi said she while there was information available \"it's only there if you openly choose to read about it\".\nShe said more bag checks could help cut the number of people carrying blades.\n\"If there were implications where people felt they couldn't bring a knife into somewhere it would prevent people from being able to do it so easily,\" she said.\nAmy said she supported actor Idris Elba's suggestion that the points could be removed from some kitchen knives, which she said would mean \"the danger of them being used in the streets is much less\".", "url": "https://www.bbc.co.uk/news/articles/cd0nvlp2n2ko"}