{"authors": ["Julie McCullough", "www.facebook.com"], "date_download": "2025-04-26 06:34:40", "date_modify": "2025-04-26 06:34:40", "date_publish": "2025-02-27 06:22:02", "description": "Jeni Larmour died after taking Ketamine hours after arriving at Newcastle University in October 2020.", "filename": "news_articles_cgm1yrm83mjo_1745649280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee90/live/9bf88180-f46a-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgm1yrm83mjo_1745649280.html", "title": "Play tackles true story of drug deaths in schools across NI", "title_page": "Play tackles true story of drug deaths in schools across NI - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The mother of a County Armagh teenager, who died after taking drugs given to her on her first night at university, is hoping a play touring schools will make other young people think about what they would do in a similar situation.\nSandra Larmour's 18-year-old daughter Jeni died after taking Ketamine hours after arriving at Newcastle University in October 2020.\nThe play - I Love You Mum - I Promise I Won't Die - is based on the true story of 16-year-old London boy Daniel Spargo-Mabbs who died after taking ecstasy on a night out 11 years ago.\nSandra, who has been campaigning for more drugs education in schools, worked hard to bring the production to Northern Ireland.\nMartina McAfee, one of the actors in the production, says the fact that it is a \"verbatim play\" meant it was \"not an easy performance to do\".\nA verbatim play is based on the actual words of real people.\nMartina believes that because the script is based on \"true words\" from 16-year-old Daniel Spargo-Mabbs' family and friends means it \"sticks in the students' heads\" after they leave the school.\nThe title of the play are the final words he spoke to his mum on the night he died.\nHannah Reilly, another actor, says there are \"so many different characters to identify with\" and that is what makes it so emotional.\n\"There've been a lot of tears and sniffles throughout the performances.\"\nThe play is being performed in 26 schools across Northern Ireland.\nPupils, from four different schools, who saw the play at The Royal School Armagh spoke to BBC News NI about how the play had affected them after they saw it.\nFrancesca, 18, who is in upper sixth at the school said it was \"weird\" to have things that would be considered \"touchy subjects\" being talked about so openly and found it informative.", "url": "https://www.bbc.co.uk/news/articles/cgm1yrm83mjo"}