{"authors": ["Esme Kenney", "www.facebook.com"], "date_download": "2025-04-26 03:45:38", "date_modify": "2025-04-26 03:45:38", "date_publish": "2025-03-05 06:16:49", "description": "The section of Queen Street in Oxford currently has uneven paving and Tarmac.", "filename": "news_articles_c5yrlr48p45o_1745639138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a255/live/674b0790-f8ee-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c5yrlr48p45o_1745639138.html", "title": "Calls to resurface Oxford centre street in 'appalling state'", "title_page": "Calls to resurface Oxford centre street in 'appalling state' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A busy city centre road is in an \"appalling state\" and needs to be resurfaced without delay, a local councillor has said.\nThe section of Queen Street between the Westgate Centre and Bonn Square in Oxford currently has uneven paving and Tarmac.\nWhile Oxfordshire County Council is responsible for highways maintenance, the Westgate Centre is responsible for the stretch of road.\nThe Westgate said it had been working with the council to \"agree a suitable replacement surface\" for the path.\nCouncillor Susanna Pressel, who represents Jericho & Osney, said \"like many other people\" she was \"really fed up with the appalling state\" of the road surface.\n\"It's truly dreadful, and it's in the heart of the city, so thousands of people have to pass over it every day - we should be ashamed.\"\nShe told the Local Democracy Reporting Service that the pathway was \"actually quite unsafe\", particularly for cyclists.\nOxford cycling group Cyclox said they were \"hugely supportive\" of the attempts to improve the road surface.\n\"Potholes and other surfacing failures can be extremely dangerous for people cycling, not just uncomfortable,\" the group added.\nA spokesperson from the Westgate Centre said the road was \"originally planned as a pedestrianised walkway\" with the surface fit for this purpose, however the \"current vehicular usage\" had led to deterioration of the surface.\nA number of buses pass through the stretch of road.\nThe Westgate added that it was working with relevant parties to \"enhance the overall experience for both our guests and the wider community\".\nThe council said it had passed Ms Pressel's enquiry on to officers, and confirmed it had been in contact with the Westgate's developer about resolving the ongoing issue with the road surface.", "url": "https://www.bbc.co.uk/news/articles/c5yrlr48p45o"}