{"authors": ["Anselm Gibbs", "www.facebook.com"], "date_download": "2025-04-26 04:02:01", "date_modify": "2025-04-26 04:02:01", "date_publish": "2025-03-04 02:28:22", "description": "There are efforts under way to recycle and reuse more at what has been dubbed \"the greatest show on Earth\".", "filename": "news_articles_ckgy421gmy2o_1745640121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/33ba/live/f11373f0-f82f-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgy421gmy2o_1745640121.html", "title": "The revellers making Trinidad's carnival more sustainable", "title_page": "The revellers making Trinidad's carnival more sustainable - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "From dazzling costumes to exuberant parties, Trinidad's carnival is often dubbed \"the greatest show on Earth\".\nBut some of its elements are not exactly eco-friendly and the festivities are estimated to produce 3.4 tonnes of waste every year according to Carnicycle, a local initiative aiming to make festivities more sustainable.\nDanii McLetchie, who co-founded Carnicycle in 2018, says that while carnival \"is a big part of our culture\" it also has a very negative environmental impact \"from the events, to the textiles, to costumes\" used by the masqueraders, spectators and vendors taking part in the annual parade on the two days preceding Ash Wednesday.\nProducing and transporting just a single carnival costume bra can generate approximately 37.68kg (83lb) of CO2 emissions, Carnicycle estimates based on calculations made using an online tool provided by Swedish tech company Doconomy.\nDanii and her team are working to have that estimate verified by a third party, but with tens of thousands of masqueraders parading every year, she says the amount of emissions is cause for concern.\nTo reduce those emissions, Carnicycle has started a recycling programme, collecting unused costumes that would have been dumped or burned by masquerade bands, which use new costume designs every year.\nCarnicycle also puts up collection bins at hotels and other venues so discarded costumes can be reused.\n\"Up until last year we collected around 10,000 pieces of costume materials,\" Danii told the BBC, describing the arduous task of completely stripping down truckloads of costumes to preserve feathers, beads and other materials for future use.\nThe salvaged materials are sold to costume designers, ravers, and people in the burlesque industry, who save by buying second hand.\nCarnicycle also rents out the large backpack pieces which are a popular part of the costumes worn at Trinidad's carnival. Their price can run up to $700 (£550), depending on size.\nDanii explains that they came up with the idea after hearing revellers complain not just about the expense but also about the weight of the backpack pieces. \"'I'm paying this much money but then it's heavy and by the time it's lunch I just want to throw it away',\" Danni recalls people saying.\nCarnicycle rents the backpacks to masqueraders long enough so that they can pose for photos, but are freed from carrying their load during the parade.\nDanii and Carnicycle's co-founder Luke Harris – who both hold down full-time jobs in addition to their environmental initiative - are not the only ones dedicating their spare time to making Trinidad's carnival both fun and eco-friendly\nLawyer Aliyah Clarke and fashion designer Kaleen Sanois started a side business called 2nd Closet - a pop-up thrift shop where people can buy and sell pre-owned clothing.\nThe two have also been making video tutorials with tips on how to transform costumes into beachwear and outfits for other occasions.\nAliya told the BBC it was something she first did for herself: \"After I was finished with my costume I would rip it apart, literally down to the wire, and figure out how to make this into something else to wear outside of carnival.\"\nNow she is sharing her ideas in a video segment the two millennials have dubbed \"Tipsy Tuesday\".\nThey also offer a closet-sorting service, which involves coming to a person's home and sorting through unwanted clothing, to rescue items fit for sale at their pop-up thrift shop.\n\"Over the past three years we've actually prevented over one million single-use plastics from entering the landfill, I think maybe over five tonnes of glass,\" says Vandana Mangroo, co-founder of Close the Loop Caribbean, a company which started working with the organisers of Fete with the Saints in 2023 to make the event more sustainable.\nJoseph Hadad, co-chairman of the party's organising committee, says that those behind the event knew that their efforts to make it greener would \"add some layer of costs and more labour\". But he is adamant \"it worked\" and insists that the party spirit has not been dampened.\nThese green efforts are being welcomed by patrons such as Roland Riley, who hailed it as \"a good initiative by Fete with the Saints to go that route\".", "url": "https://www.bbc.co.uk/news/articles/ckgy421gmy2o"}