{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:38:02", "date_modify": "2025-05-19 15:38:02", "date_publish": "2015-02-06 17:35:57", "description": "More details emerge about planned changes to Northern Ireland's welfare and benefits system.", "filename": "news_uk-northern-ireland-31171934_1747669082.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/79912000/jpg/_79912732_9rovroa3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-northern-ireland-31171934_1747669082.html", "title": "Details emerge of planned Northern Ireland welfare changes", "title_page": "Details emerge of planned Northern Ireland welfare changes - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "More details have emerged about planned changes to Northern Ireland's welfare and benefits system.\nThe moves are all part of a welfare reform deal reached between the DUP and Sinn Féin before Christmas.\nUnder plans contained in the Stormont House Agreement there would be a fund to top up benefits of people losing out under reforms agreed at Westminster.\nThere are also plans to establish a local commissioner who would oversee the additional payments.\nNext week welfare reform - the issue that nearly brought the institutions down - will top the agenda in Northern Ireland.\nThe crisis was averted when Sinn Féin and the DUP agreed a welfare deal.\nSeventy-eight amendments have been tabled to the Welfare Reform Bill and they include the establishment of a discretionary support scheme that would help those who would lose benefits under Westminster welfare reforms.\nThe amendment states this is \"not to be regarded as a social security benefit \"\nThis would be overseen by a discretionary support commissioner and a series of inspectors.\nThere are concerns that even with these new measures in place those on benefit will still be disadvantaged.\nKevin Higgins, of Advice NI, said: \"We still have concerns around impact on people, people with disabilities whose benefits may be changed as a result of reassessment and time-limiting and also the introduction of the size criteria.\"\nIn the budget agreed by Sinn Féin and the DUP, £70m was put aside to off-set the impact of welfare reform.\nSome insist that Sinn Féin 's original opposition to the reforms was based on rhetoric.\n\"Why could this not have been sorted out two years ago?\" Ulster Unionist MLA Roy Beggs asked.\n\"Why did they have to block everything. It's interesting that they have not placed any amendments themselves other than have been agreed by the executive parties in discussions that occurred.\n\"It's surprising that they appeared to roll over at the last moment.\"", "url": "https://www.bbc.com/news/uk-northern-ireland-31171934"}