{"authors": ["Christal Hayes", "www.facebook.com"], "date_download": "2025-04-26 06:16:04", "date_modify": "2025-04-26 06:16:04", "date_publish": "2025-03-01 20:24:41", "description": "The Wish I Didn't Miss You singer was involved in a collision in Alabama following a performance.", "filename": "news_articles_c1d4r2nk4yyo_1745648164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9d6a/live/979b53d0-f6d9-11ef-ba69-c78ed0ab1046.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4r2nk4yyo_1745648164.html", "title": "Angie Stone, veteran R&B singer-songwriter, dead in car crash", "title_page": "Angie Stone, veteran R&B singer-songwriter, dead in car crash - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Grammy-nominated R&B artist Angie Stone has died after a car crash, aged 63, her daughter says.\n\"My mommy is gone,\" her daughter, Diamond Stone, wrote in a Facebook post.\nStone was fatally injured when a van she was travelling in overturned in Alabama early on Saturday following a performance, according to media reports.\nThe artist, who was behind songs like No More Rain (In This Cloud) and Wish I Didn't Miss You, was nominated for three Grammys over her career. She started out in the 1970s as a member of the female hip-hop trio The Sequence.\nThe group's most popular song, Funk You Up, peaked at 15 on Billboard's Hot Soul Singles.\nHer daughter, who is also a musician and goes by the nickname Ladi Diamond, said on Facebook that she was \"numb\". Hours earlier, she had asked for prayers for her family and said she was on the road.\nA spokesperson for the artist told the BBC that her family had travelled to Montgomery, Alabama, and planned to release more information soon.\nGuy Todd Williams, known as Rahiem in the hip-hop group Grandmaster Flash and the Furious Five, said about nine other passengers were in a van with Stone at the time of the crash.\n\"She left her indelible mark on the music industry initially as a member of the legendary rap group Sequence,\" Williams said.\nHe said she was the sole fatality in the crash.\nThe BBC has contacted police in Montgomery for details.\nAlong with her music career, Stone also had some success in film.\nShe made her movie debut with a role in The Hot Chick, a 2002 hit starring Rob Schneider, Rachel McAdams and Anna Faris.\nShe also starred in The Fighting Temptations in 2003 with Cuba Gooding Jr and Beyonce.", "url": "https://www.bbc.co.uk/news/articles/c1d4r2nk4yyo"}