{"authors": ["Neve Gordon-Farleigh", "www.facebook.com"], "date_download": "2025-04-26 07:07:32", "date_modify": "2025-04-26 07:07:32", "date_publish": "2025-02-28 06:05:52", "description": "Three schemes are under way to improve safety and ease congestion in Norfolk.", "filename": "news_articles_c04zze47qv7o_1745651252.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8a62/live/8c5c89e0-f548-11ef-a9c6-c7f9594861df.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c04zze47qv7o_1745651252.html", "title": "A47 upgrades: Why are they happening and where?", "title_page": "Norfolk A47 upgrades: Why are they happening and where? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three schemes are under way to improve safety and ease congestion throughout the county.\nRecently, work on the A47-A11 to overhaul the Thickthorn junction was given the go ahead by the government.\nLilian Greenwood, Future of Roads Minister, visited the A47 on Thursday and said the £200m scheme would \"make this road safer\".\n\"There's no future hold-ups, work is under way already,\" she said. \"We anticipate the road will be improved and open for traffic in Spring 2027.\"\nThree thousand residential dwellings, external and commercial business units could be built near the junction, with National Highways anticipating it could increase congestion.\nElsewhere along the A47, work began in October between North Tuddenham and Easton to improve the road, that is currently unable to cope with the high volume of traffic.\nPlans include, external the road to be dualled, with two new junctions and the removal of the Easton roundabout.\nAt Blofield, the road which is currently a single carriageway, external will also be dualled and will be located about 70m south of the existing road.\nA bridge will also be added over the carriageway to connect Blofield and North Burlingham, taking traffic towards Great Yarmouth.\nAll of the schemes aim to improve the safety of the road, including easing congestion.\nBlofield, where a new bridge is due to be built, hopes to improve amenities for cyclists and pedestrians.\nIn Thickthorn, near where 30,000 homes are planned to be built, the work aims to support regional housing and economic growth in the city.\nThe Department for Transport says once the work is completed, drivers are predicted to save up to four minutes on their journeys at peak times on the eastbound A11 to A47, and up to three minutes along the A11.\nNumerous improvements and construction work has been delayed due to legal challenges by environmental campaigners.\nAround the road between North Tuddenham and Easton, National Highways has felled 2,500 trees to create two additional lanes.\nDavid Hook, of the Campaign to Protect Rural England group, said: \"If you are completely altering a landscape, there is no way that can be described as sensitive.\n\"We need infrastructure of the right type in the right places, and that does not necessarily include dualling a short stretch of road between Easton and the current dual carriageway.\"\nWhile construction work for this part of road began in October, it was delayed by 20 months by legal challenges from environmental campaigners.", "url": "https://www.bbc.co.uk/news/articles/c04zze47qv7o"}