{"authors": ["Mairead Smyth", "www.facebook.com"], "date_download": "2025-04-26 04:31:07", "date_modify": "2025-04-26 04:31:07", "date_publish": "2025-03-03 06:13:57", "description": "Terminal cancer patient Mo Jackson is devastated about the Marie Curie hospice's temporary closure.", "filename": "news_articles_c8e76lx6k94o_1745641867.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/016b/live/9c039ea0-f797-11ef-bf79-99cefaeadcd6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8e76lx6k94o_1745641867.html", "title": "Terminal cancer patient 'scared' of dying at home", "title_page": "Terminal cancer patient 'scared' of dying at home - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman with terminal lung cancer has said she feels \"scared\" of dying at home rather than in the care of a specialist hospice.\nMo Jackson, who wants to spend her final days at Marie Curie hospice in Liverpool, said it \"shook me to my core\" when she discovered the centre had been forced to temporarily close for outpatients.\nThe 57-year-old, who said cancer had spread to her stomach and brain, went on to say that she had received \"lots\" of chemotherapy and immunotherapy.\nMarie Curie said the decision to close the 26-bed inpatient unit in Woolton in July was due to shortages in specialised nursing staff.\nMs Jackson, from Liverpool, told BBC North West Tonight that she had been \"strangely looking forward\" to going to the Marie Curie hospice since she knew it also provided \"brilliant\" aftercare for patients' families.\nShe added: \"I feel scared for my family - I will not have a happy death if I die in here.\n\"My house is for living in and not dying in.\n\"I envisaged being in Marie Curie, in a bed, with all my family around me.\"\nMs Jackson said she wanted \"the staff to look after me when needed, and my children around not as my carers, but as my children\".\nThe 57-year-old said she was determined that her family would \"make good memories, even though I am dying.\"\nMs Jackson's husband Barrie died at the Marie Curie hospice 18 months ago, as did her sister Anne six years ago.", "url": "https://www.bbc.co.uk/news/articles/c8e76lx6k94o"}