{"authors": ["Alexander Brock", "Charlotte Benton", "www.facebook.com"], "date_download": "2025-04-26 03:39:35", "date_modify": "2025-04-26 03:39:35", "date_publish": "2025-03-04 20:15:53", "description": "Council tax will rise by 7.5% amid £148m in spending cuts, as the leader apologises to the city.", "filename": "news_articles_c80yppyr43zo_1745638775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/06b3/live/9c48d380-f990-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c80yppyr43zo_1745638775.html", "title": "Birmingham City Council confirms 7.5% tax hike and spending cuts", "title_page": "Birmingham City Council confirms 7.5% tax hike and spending cuts - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Birmingham residents are set to pay more council tax from April, despite cuts to adult social care, library closures, and reductions in bin collections.\nThe cuts, which also include a reduction of about £148m in spending, were announced during the authority's annual budget meeting.\nCouncil leader John Cotton apologised for the agreed 7.5% tax rise, but said the authority was now \"moving in the right direction\".\nProtesters, including striking refuse workers and residents, had gathered outside the council's headquarters as the meeting took place, to express their anger over the authority's decisions.\nThe Labour-run council effectively declared itself bankrupt in September 2023 and was forced to find savings of at least £300m, in addition to selling assets worth £750m, by April 2026.\nThe council tax rise follows last year's increase of just below 10%.\nRobert Alden, Conservative opposition leader, said it had been a \"hugely disappointing day\".\nHe criticised the \"double whammy on Brummies\" as they are being hit by tax rises and reduced services.\nThe Labour administration had \"directed savings to the back office\" rather than \"protecting frontline services\", Alden said.\nCotton has promised council tax would not rise again next year and insisted the authority continued \"to be on the side of the people of Birmingham\".\nThere was \"still much to do\" in terms of the authority's recovery, he said, but he remained optimistic.\n\"\"I am determined to put things right,\" he said.", "url": "https://www.bbc.co.uk/news/articles/c80yppyr43zo"}