{"authors": ["Brendan Hughes", "www.facebook.com"], "date_download": "2025-04-26 04:20:56", "date_modify": "2025-04-26 04:20:56", "date_publish": "2025-03-03 15:23:56", "description": "Thales missile factory in east Belfast is set to supply 5,000 air defence missiles to Ukraine.", "filename": "news_articles_c2er3ynvmlmo_1745641256.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/741a/live/ea5aa000-f84e-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2er3ynvmlmo_1745641256.html", "title": "Thales: Michelle O'Neill 'incredulous' over Ukraine missile deal", "title_page": "Thales: Michelle O'Neill 'incredulous' over Ukraine missile deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "First Minister Michelle O'Neill has said she is \"incredulous\" at a UK government deal for a Belfast factory to supply air defence missiles to Ukraine.\nThe Sinn Féin vice-president said that \"rather than buying weapons of war, I would rather see the money invested in public services\".\nThe Thales missile factory is to supply 5,000 air defence missiles to Ukraine in a deal worth up to £1.6bn, the UK government announced on Sunday.\nIt will involve recruiting 200 additional staff.\nIn the Northern Ireland Assembly on Monday, O'Neill was asked by independent assembly member (MLA) Claire Sugden whether she supported the deal.\nThe first minister said she found it \"incredulous\" at a time when \"public services are being cut left, right and centre\".\nShe added: \"At a time when we've endured 14 years of austerity, at a time whenever winter fuel payments are being cut from older people, at a time when lots of small local businesses are going to go to the wall because they can't afford the national insurance hikes.\n\"At a time whenever our farmers are worried because of the inheritance tax, I think at a time like that, rather than buying weapons of war, I would rather see the money invested in public services.\"\nO'Neill said she believed \"the focus of the international community should always be to work towards negotiation and peace settlements\".\n\"That's my approach to these things,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c2er3ynvmlmo"}