{"authors": ["Paul Pigott", "www.facebook.com"], "date_download": "2025-04-26 07:57:51", "date_modify": "2025-04-26 07:57:51", "date_publish": "2025-02-25 12:04:24", "description": "Yuki is \"lucky to be alive\" says her owner, who wants dog-on-dog attacks to be criminalised.", "filename": "news_articles_c0jgn891exxo_1745654271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22fe/live/2b1906e0-f36d-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c0jgn891exxo_1745654271.html", "title": "Dog attacks: Laws must change says the owner of mauled small dog", "title_page": "Dog attacks: Laws must change says the owner of mauled small dog - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The owner of a dog who was \"lucky to be alive\" after being mauled in an attack said people have to change their attitude about keeping pets on leads.\nGiles Lewis said Yuki, a Pomeranian-Japanese Spitz cross, was shaken \"from side to side like a little toy\" by a loose lurcher-type dog.\n\"I had her in my arms, she was still screaming, there was blood everywhere, and I had to flee because the dog was completely out of control,\" said the 43-year-old from Newport, adding the cost in veterinary bills to save Yuki was about £20,000.\nGwent Police said officers were trying to identify the owner of the lurcher, who was also walking a boxer-type dog on the night of the attack.\nMr Lewis told BBC Radio Wales Breakfast he had to wrestle six-year-old Yuki out of the attacking dog's jaws, when the attack took place at about 19:10 GMT on 6 February on Risca Road.\n\"The owner was nowhere nearby and taking no responsibility,\" he said.\n\"It was a horrific situation.\"\nYuki was rushed to a veterinary hospital with large wounds on her side and belly.\nShe was not expected to survive, but after two weeks in intensive care and surgery on Monday, Mr Lewis said he and his partner's \"baby\" was expected to make it.\n\"She's a brave little girl, she's pulled through,\" he said.\n\"She has a long road in front of her in terms of recovery.\n\"She'll always have a huge scar and she may not get her beautiful fur back, which is sad, but at least she will live.\"", "url": "https://www.bbc.co.uk/news/articles/c0jgn891exxo"}