{"authors": ["Ruth Bradley", "www.facebook.com"], "date_download": "2025-04-26 08:10:32", "date_modify": "2025-04-26 08:10:32", "date_publish": "2025-02-26 12:30:27", "description": "Somerset Council is handing over services and assets to town and parish councils to save money.", "filename": "news_articles_cx29p1j771xo_1745655032.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/20b2/live/8f7969b0-f429-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cx29p1j771xo_1745655032.html", "title": "Minehead Town Council to take over parks and play areas in £123k deal", "title_page": "Minehead Town Council to take over parks and play areas in £123k deal - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A town's parks and open spaces, including two cafes and two car parks, are to be taken over by the local town council.\nIt is part of Somerset Council's plans to hand over services and assets to town and parish councils, to save the larger authority money.\nMinehead town councillors agreed the deal, which includes Blenheim Gardens, at a meeting on Tuesday night., external\nIt will cost the town council £123,000 a year in staffing and further costs but it expects to make money from the cafes and car parks.\nThe cafes are leased out to operators and the town council will receive the rental income.\nSomerset Council has generally avoided handing over car parks, as they bring income, but the town council argued the North Road car park is important for Blenheim Gardens.\nAlexandra Road car park has also been made an exception, as it had previously been identified as the possible site of a new swimming pool.\nThe town council said the new arrangements should \"streamline service delivery, enhance maintenance standards, improve response times, and simplify open space management for the wider community\".\nIt said there had been some confusion in recent months when the town council took responsibility for Blenheim Gardens planting and locking the gates as night, while Somerset Council remained the overall owner.\nSomerset Council's report on the deal, external stated it would save £121,800 a year by handing over the services and assets, after allowing for loss of car parks income (£50,000) and income from the cafes and kiosk leases (£32,500).\nParts of the Esplanade will transfer to the town council under a long lease, but Somerset Council will remain responsible for clearing sand from the area.\nWellington, Wells, Bridgwater and Yeovil are among the other towns to have already agreed similar deals with Somerset Council.", "url": "https://www.bbc.co.uk/news/articles/cx29p1j771xo"}