{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:20:01", "date_modify": "2025-05-19 15:20:01", "date_publish": "2015-02-10 14:27:52", "description": "An Ofsted report says pupils at a Derby residential deaf school were \"at risk of sexual exploitation\".", "filename": "news_uk-england-derbyshire-31372557_1747668001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80910000/jpg/_80910786_80910779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-england-derbyshire-31372557_1747668001.html", "title": "Royal School for the Deaf Derby: Pupils 'at risk of grooming'", "title_page": "Royal School for the Deaf Derby: Pupils 'at risk of grooming' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pupils at a residential school for the deaf were put at risk of child sexual exploitation and grooming, according to inspectors.\nThe principal at the Royal School for the Deaf Derby has been suspended for \"failing to promote the safeguarding needs of the pupils\", Ofsted said.\nIt was rated \"inadequate\" in all categories following a two-day inspection in December.\nGovernors at the 131-pupil school said they were working to resolve issues.\nThe report, external rated the school inadequate in five key areas - overall effectiveness, outcomes for residential pupils, quality of residential provision and care, residential pupil safety and leadership.\nIt highlighted the principal's failure to share child protection concerns, which it said \"directly impacted upon pupils as they were placed at risk of potential grooming and child sexual exploitation\".\nThe problems at the school, which has children with \"complex special needs\", resulted in \"social workers and independent reviewing officers attempting to make crucial decisions about the welfare of children looked after without full information before them\".\nOfsted said it has made the Department for Education aware of the issues at the school, where alternative safeguarding arrangements have since been put in place.", "url": "https://www.bbc.com/news/uk-england-derbyshire-31372557"}