{"authors": ["Isaac Ashe", "www.facebook.com"], "date_download": "2025-04-26 04:31:00", "date_modify": "2025-04-26 04:31:00", "date_publish": "2025-03-03 06:15:57", "description": "The grants had stopped in 2024 leaving farmers and hedgelayers unable to fund schemes.", "filename": "news_articles_cdjyyxm8j0wo_1745641860.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/870f/live/36a13f70-f50a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyyxm8j0wo_1745641860.html", "title": "Welcome return for 'limbo' DEFRA hedgelaying funding", "title_page": "Welcome return for 'limbo' DEFRA hedgelaying funding - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A hedgelayer has welcomed the return of government grants to maintain hedges.\nThe Department for Environment, Food and Rural Affairs (DEFRA) said in September it had suspended funding for farmers to maintain hedgerows as a result of \"unprecedented demand\", but then closed the scheme in November for the grant process to be \"simplified and rationalised\".\nThe stop in funding left many farmers and hedgelayers \"in limbo\", said Steve Budding, incoming chair of the 700-member National Hedgelaying Society.\nOn Wednesday the return of the grant scheme was announced by the government department.\nThe grant scheme's return means farmers can once again apply for up to £25,000 for water quality, air quality and natural flood management projects and up to £35,000 for boundaries, trees and orchards.\nLeicestershire hedgelayer Mr Budding, 70, said 90% of hedgelaying work is paid for by the grants and most schemes need to be carried out during the winter.\nHe added: \"A lot of people would have been left fighting over work but farmers will now have up to £35,000 to spend.\n\"Most of the work is taken a year in advance and we wouldn't have known where our next job was coming from, but thankfully now the pressure's off.\"\nDEFRA said funding had been secured to process the 4,040 outstanding applications ahead of accepting fresh bids for funding from farmers for 2025/26.\nA spokesperson said: \"Following the temporary closure of the capital grants scheme in November 2024, we're pleased to share that we've secured sufficient funding for 2025/26.\n\"This means we can now process the 4,040 completed applications that were on hold.\n\"Once the scheme reopens guidance will be published on gov.uk.\"\nNational Farmers' Union deputy president David Exwood said the closure of the scheme was \"very frustrating\" and he was \"pleased\" DEFRA had reopened the \"vital\" grants.\nHe added: \"This is a positive outcome that wasn't expected.\n\"Going forward, DEFRA must learn a stop-go approach will not achieve the outcomes farmers or the environment requires.\"", "url": "https://www.bbc.co.uk/news/articles/cdjyyxm8j0wo"}