{"authors": ["Gillian Marles", "www.facebook.com"], "date_download": "2025-05-19 15:36:15", "date_modify": "2025-05-19 15:36:15", "date_publish": "2015-02-21 01:29:16", "description": "The fashion world seems to be warming to wool - and that spells good news for Scotland's textile industry.", "filename": "news_uk-scotland-scotland-business-31547588_1747668975.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81128000/jpg/_81128518_spools_row.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-scotland-business-31547588_1747668975.html", "title": "Chanel firm Barrie Knitwear cashes in on cashmere", "title_page": "Chanel firm Barrie Knitwear cashes in on cashmere - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With London fashion week in full swing, Scotland is expected to feature prominently on the catwalks - not just in the design effort.\nIt seems the fashion world is warming to wool and that's good news for Scotland's textile industry.\nOne of the world's best known fashion labels, Chanel, chose Scotland to manufacture much of its knitwear more than 30 years ago.\nThat business relationship was cemented two years ago when the company acquired the Barrie knitwear factory in Hawick.\nThe mill has been weaving and stitching for more than 100 years. Today about 100 women sit at linking machines in one hall of the factory.\nEven with modern processes, and a £1m-plus investment by Chanel in new machinery over the past year, much of the work is done by hand.\nAnd it is highly skilled work.\nIn order to safeguard these skills, Chanel bought the factory when it came up for sale. As well as Chanel, the mill supplies other top design houses and its own new Barrie brand.\nBarrie Knitwear sales director Clive Brown says: \"The product is becoming more complex, the days of us making v-neck and crew necks are almost gone.\"\n\"Some people would say it's almost like dressmaking in cashmere now. It's all fully-fashioned, sometimes we have four panels in sweaters, sometimes we can have nine.\"\nBarrie employs 220 people and makes about 90,000 sweaters a year - 96% of which are cashmere.\nBut the company is finding it difficult to get the skilled staff.\n\"Since Chanel took over, we've hired another 60 people and I expect we'll need another 60 over the next couple of years,\" says Mr Brown.\n\"But at the moment if we could get another 20 or 25 people with the right skills, I'd take them on tomorrow.\"\nThe profile of the industry has certainly been lifted by the big labels, according to the Campaign for Wool. It was formed to promote wool and encourage trade.\nChief operating officer Peter Ackroyd says: \"I think the Chanel acquisition of Barrie in Hawick was a perfectly-timed statement that the luxury industry is seeking to be sure of the provenance of its expensive products. You can't charge premium prices for goods of dubious provenance.\"\nAnd after years of being out in the cold as a functional rather than fashionable fibre, Mr Ackroyd believes things are really starting to change.\n\"We are at the cusp at the moment where I see things coming back, and I see it particularly coming back in Scotland because the current looks in fashion are very much Scottish.\"\nYou can hear more about the business of wool on BBC Radio Scotland's Business Scotland programme shortly after 06:00 on Saturday and 10:00 on Sunday, and later on the BBC iPlayer or by free download.", "url": "https://www.bbc.com/news/uk-scotland-scotland-business-31547588"}