{"authors": ["Danielle Andrews", "www.facebook.com"], "date_download": "2025-04-26 07:06:35", "date_modify": "2025-04-26 07:06:35", "date_publish": "2025-02-28 06:15:31", "description": "Barnsley Council leader Sir Steve Houghton praises the budget as \"the best in 15 years\".", "filename": "news_articles_cm2yyllxj91o_1745651195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8607/live/162b5640-f537-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2yyllxj91o_1745651195.html", "title": "Council approves almost 5% tax increase", "title_page": "Barnsley Council approves almost 5% tax increase - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council tax in Barnsley will rise by 4.99%, the maximum increase allowed without a referendum, as councillors approved the borough's budget.\nThe increase is set to help address a £15.1m funding gap and ensure that essential services can continue amid rising costs and growing demand.\nMeanwhile, £34.1m has been allocated for social care, including £8.7m to cover pay and inflation, £4.8m for children's social care and £10.2m for adult social care.\nCouncil leader Sir Steve Houghton said the budget was \"the best in 15 years, maybe even longer\".\nThe council tax rise comprises a 2% increase to support adult social care and 2.9% to maintain other vital services.\nBudget documents described the rise as difficult but necessary to prevent cuts to services that residents rely on, according to the Local Democracy Reporting Service.\nHoughton said: \"No one wants to see council tax go up, least of all me.\n\"But the reality is, to keep the council financially sound we have to make sure that revenue base continues, whatever we spend it on.\"\nCouncillor Roy Bowser, who seconded the proposals, paid tribute to the \"resilience of Barnsley people in a deeply embedded cost of living crisis\".\nResidents in Band D properties will pay an extra £87 per year, with their council tax bill going from £1,790.68 to £1,878.42.\nCouncillor Hannah Kitching said the increase would be a \"hard sell' for residents who have not had their recycling bins collected so far this year.\nA total of £3.7m has been allocated to waste and fleet services, £900,000 to home-to-school transport and £600,000 to homelessness services and temporary accommodation.\nThe Great Childhood Ambition and Community Enhancement initiatives will also each receive £1.5m for pilot projects.\nCouncillor Chris Wray criticised plans to save £350,000 a year by dimming streetlights across the borough.\n\"There are streets already where people feel unsafe. Sadly, this is across the country but it is something that we don't want to be making worse,\" he said.\n\"I firmly believe that no changes should ever come that either potentially or will risk or compromise anybody's safety.\"\nCouncillor James Higginbottom, cabinet member for environment and highways, said that community safety was at the \"forefront\" of the authority's plans.\nHe said: \"Professional highway engineers are continuing to explore options around how we can continue to achieve those savings, both financially and in terms of our energy consumption.\n\"It is not the intentions of the highways service to go out tomorrow and switch all the streetlights off in Barnsley, I can give you that guarantee.\"\nThe budget was passed following a vote, with 41 for and 13 against.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cm2yyllxj91o"}