{"authors": ["Henry Godfrey-Evans", "www.facebook.com"], "date_download": "2025-04-26 06:20:48", "date_modify": "2025-04-26 06:20:48", "date_publish": "2025-03-01 06:27:39", "description": "A musician who did about 20 gigs with Charli XCX before she was famous says he knew she was special.", "filename": "news_articles_cedlld7799eo_1745648448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/666f/live/cce6b690-f5e6-11ef-86a6-15c2bb2c0119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cedlld7799eo_1745648448.html", "title": "Charli XCX co-performer 'found the next Madonna'", "title_page": "Charli XCX co-performer 'found the next Madonna' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A musician who invited a young Charli XCX to perform with his band after watching her Myspace videos said he knew he had \"discovered the next Madonna\".\nThe five-time Brit 2025 nominee from Start Hill, near Stansted Airport in Essex, performed with Charlie \"Chaz\" John Ross's band The Coolness in 2008, when she was aged just 15.\nThis week she has already been announced as winner of Songwriter of the Year and is up for Artist of the Year and four other awards at Saturday's ceremony.\nRemembering hearing the pop star sing for the first time, Mr John Ross said: \"My jaw was on the floor, I was gobsmacked.\"\n\"Her dad phoned me up days later and that's what got the ball rolling, really.\n\"She started supporting my band, to the point where we were even her back-up band.\"\nHe said Charli - whose real name is Charlotte Emma Aitchison and was born in Cambridge - was 15 when she did her first public gig at the White Hart in Whitechapel, London, in 2008, supporting his band.\n\"She played her, maybe, first dozen or 20 shows supporting my band,\" he said.\nCharli was soon signed by Warner Brothers after a gig in a hair salon.\nFast forward to present day, Charli is the most nominated artist at this year's Brits.\nThe now 32-year-old is up for Artist of the Year, Album of the Year, Song of the Year, Dance Act and Pop Act.\nShe brought out her album, Brat, in June, which went on to reach the UK number one slot and made waves across the Atlantic.\nThe album's success led to \"brat summer\" becoming a cultural phenomenon and Collins Dictionary's Word of the Year for 2024.", "url": "https://www.bbc.co.uk/news/articles/cedlld7799eo"}