{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:49:38", "date_modify": "2025-04-26 06:49:38", "date_publish": "2025-03-01 09:19:48", "description": "Kane Clears, 30, of Water Lane, Bourne, was estimated to be double the drink drive limit.", "filename": "news_articles_c89ygw9e5qgo_1745650178.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e3be/live/534d1d10-f5f5-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c89ygw9e5qgo_1745650178.html", "title": "Bourne drink driver jailed for killing man in 90mph crash", "title_page": "Bourne drink driver jailed for killing man in 90mph crash  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A drink driver, who was speeding at about 90mph (145km/h) in a 40mph zone when he killed a father-of-two, has been jailed for seven years and eight months.\nKane Clears, 30, of Water Lane, Bourne, was estimated to be double the alcohol limit for driving when he killed aircraft engineer Ian Gooden, 59, during a three-car collision on the main Stamford to Bourne road on Friday 21 July 2023.\nLincoln Crown Court heard police found two cans of Stella Artois lager in the footwell of Clears' car and one of the cans had already been opened.\nWhile sentencing on Friday, Judge James House KC told Clears his drinking made the collision inevitable and was responsible for the speed he was driving at.\nHe said: \"I am sure drinking impaired his judgement and his ability to drive.\n\"Mr Gooden had no warning, he could do nothing about it.\"\nClears was also banned from driving for 10 years and one month and must take an extended retest.\nDavid Eager, prosecuting, said CCTV footage from shortly before the collision at 19:00 GMT estimated Clears was travelling between 89mph and 91mph on the A6121 near Toft.\nThe court was told Clears did not slow down at all as his car entered a temporary 40mph limit for roadworks and lost control on a bend.\nHis car criss-crossed the central reservation before hitting Mr Gooden's Ford Focus head-on.\nThe force of the impact caused the engine of Clears' car to detach from his vehicle before his car flew into the air and collided with a third vehicle containing a woman and her daughter who were coming home from a hospital appointment.\nThey both suffered minor injuries.\nMr Gooden, a keen cyclist and engineer from Cambridgeshire, was pronounced dead at the scene.\nA blood test taken several hours after the collision put Clears within the drink-drive limit but a back calculation estimated he was about twice the legal limit at the time of the crash.\nVictim impact statements were read out in court by a number of Mr Gooden's family and his widow, Gyonyul.\nMrs Gooden described how their two young sons would now have to grow up without their father due to the irresponsible actions of a drink driver.", "url": "https://www.bbc.co.uk/news/articles/c89ygw9e5qgo"}