{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 05:27:49", "date_modify": "2025-05-21 05:27:49", "date_publish": "2025-04-03 00:00:00", "description": "First Minister John Swinney takes questions from opposition leaders at Holyrood.", "filename": "news_live_cn7xm8n18kkt_1747805269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6905/live/72017ec0-1064-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_cn7xm8n18kkt_1747805269.html", "title": "Swinney questioned on Trump's tariffs at FMQs", "title_page": "Swinney questioned on Trump's tariffs at FMQs - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The headlines\nHere are all the highlights from this afternoon’s session at Holyrood:\nRussell Findlay challenged the Scottish government on support for businesses after US President Donald Trump’s announcement on new tariffs.\nThe Conservative leader called for John Swinney to back his calls for the UK government to lower tax on whisky and produce a new USA export plan.\nSwinney said he would “leave no stone unturned” in taking forward the whisky industry’s concerns.\nJackie Baillie accused the SNP of “breaking Scotland’s NHS” and putting GP practice “at crisis point”.\nThe first minister said he recognised challenges in the NHS, but did not accept the health service had been broken under 18 years of SNP government.\nOutgoing Greens co-leader Patrick Harvie called for protection for renters following the removal of a cap on increases.\nSwinney wished Harvie well after announcing his departure as co-leader and said government is “on renters side”.\nSwinney and Conservative Douglas Lumsden clashed over future plans for the North Sea, with the first minister accused the Tories of “cuddling up to Reform”.\nThe first minister said he would abide by “the rule of law” over potential legal action surrounding the future if the Jackdaw and Rosebank oil fields.\nLiam Kerr accused the Scottish government of “lacking a strategy” for dealing with overcrowding in prisons.\nThat's all from the team covering FMQs. Your writers today were Katy Scott and James Delaney, while Mary McCool was editor. Thanks for following.\nGovernment lacks strategy to tackle prison overcrowding - Tories\nScottish Conservative MSP Liam Kerr is up next with a question on overcrowding in prisons, saying the Scottish government lacks a \"holistic strategy\".\nHe asks if the first minister will \"put the public first\" and rule out the release of long-term prisoners after charities warned of potential dangers.\nThe first minister begins by saying the question \"sums up the problem\" but he is interrupted by MSPs speaking.\n\"Apparently the Conservatives believe in free speech unless it's me that's speaking,\" Swinney jokes.\nHe says the Scottish government does have a holistic strategy and the Conservatives should \"engage constructively\" in discussions on how to address \"real challenges\" the government is facing.\nEarly release of prisoners begins in Scotland\nBackground: Call to end Crown immunity after prison suicides\nThe Scottish government had been broadly supportive of ending Crown immunity for the prison service prior to Wednesday’s meeting between the Scottish Prison Service (SPS) and the parents of two young people who took their own lives in Polmont Young Offender's Institution.\nBut the SPS’ chief executive giving her backing to the plans could see that pursued sooner rather than later.\nTeresa Medhurst made the comment during a meeting with the families of Katie Allan and William Brown, also known as William Lindsay, who both died by suicide at Polmont in 2018.\nUnder the Crown immunity doctrine, the Crown, which includes the SPS, cannot be held criminally responsible for deaths in custody.\nCampaigners have long challenged the law, arguing that the public and private sectors do not operate on a level playing field.\nThe families met the Scottish government's justice secretary, Angela Constance, at Holyrood ahead of a statement to parliament last week.\nA government spokesperson told BBC Scotland News it would \"continue to pursue the lifting of the SPS corporate Crown immunity\".\nClark calls for resource shift towards community justice\nLabour MSP Katy Clark asks the first minister whether the reported increased annual cost of Scotland's prisons to over £77,000 per prisoner represents good value for public money.\nSwinney says the reported figure is “wrong,” and says the average cost of a prisoner annually is closer to £48,000.\nClark says Scotland has the highest number of prisoners in Western Europe. She says some prisoners have to be kept in custody, but asks if Swinney will accept that resources should be shifted to alternatives to custody, which are more effective to rehabilitating prisoners.\nSwinney says there has been a £25m increase in funding for community justice over the past two years, and the government will look at expanding the community justice capacity.\nWill the first minister back Rosebank and Jackdaw?\nIn a similar vein, the SNP's Fergus Ewing is up next with a question on the Rosebank and Jackdaw oil and gas fields.\nHe says developers had gained the necessary licences, complied with government regulations and made huge investments.\nHe warns that if they are declined final permission \"because the rules have changed\", the UK government could be sued billions to recover costs.\nA reminder - Ewing recently announced he would not run for the SNP at the next election and has been at odds with the SNP over what he believes is a lack of support for the oil and gas industry.\nEwing asks if the first minister will confirm that the Rosebank and Jackdaw fields \"must go ahead\".\nSwinney says he is a \"strong believer in the rule of law\" and the Scottish and UK government will have to consider the implications of recent court decisions.\nClashes over climate and North Sea transition\nSNP MSP Kevin Stewart asks about comments from the chair of the North Sea Transition Task Force that its future should be a national mission.\nSwinney points out his “frustration” with successive UK governments on the failure to explore the Acorn Carbon Capture project.\nConservative Douglas Lumsden asks whether the SNP will “ditch its hostility” towards the oil and gas sector.\nSwinney denies he is hostile towards oil and gas and says he is committed to a “rational transition” to net zero, including relying on oil and gas for a period of time.\nHe accuses the Tories of “cuddling up to Nigel Farage” over abandoning climate change targets and references Jamie Greene’s comments about the party being in “a dance” with the Reform leader.\nGovernment is 'complacent' about rent rises - Harvie\nSwinney says there are opportunities for tenants to seek a review of a rent review which they believe is \"unacceptable.\"\nHe says the Scottish government is bringing forward a housing bill and introducing the \"concept of rent controls\".\nHarvie say he is grateful for the kind, personal remarks from the first minister.\nBut he fears the first minister is being \"complacent\" about the housing issue and there is nothing holding back a \"tide of unaffordable rent rises\".\nSwinney says people can be assured the government is on their side and there are strict legal processes to ensure landlords follow rules about rent rises and ending tenancies.\nSwinney wishes Harvie well as he steps down\nPatrick Harvie, co-leader of the Scottish Greens, is up next with a question on rent rises.\nHe says the Scottish government withdrew \"critical protection\" against rent rises on Monday and landlords can now set rents to \"uncontrolled, free market levels\" which tenants cannot prevent.\nHarvie asks if the first minister understands why tenants across Scotland are \"fearful\" about what he has done.\nBefore he answers the question, Swinney expresses his \"good wishes\" on Harvie's decision to step down as co-leader of the Scottish Greens.\n\"I have always enjoyed our encounters,\" he adds. \"We will have many more of them before the summer and I wish him well for the future.\"\nNo shortage of politics - for both Baillie and Swinney\nPhilip Sim\nBBC Scotland political correspondent\nWe look set to go into next year’s Holyrood election with John Swinney and Jackie Baillie as the only two remaining MSPs defending the same seat they won in 1999.\nThese are two adversaries who know each other very well – and two who frequently savour a big clash in the Holyrood chamber.\nMs Baillie was singing from a familiar songbook, repeating Anas Sarwar’s frequent attack about the SNP’s management of the NHS.\nMr Swinney meanwhile attacked Ms Baillie’s use of figures – as he does most weeks, regardless of whether she is asking a question or not – and accused her of only being interested in “politics, politics, politics”.\nHe would have to concede that after 26 years of these exchanges, there has been no shortage of politics.\nBaillie creating 'alarm' with questioning, says Swinney\nBack to the chamber, and Jackie Baillie accuses the SNP “spin machine” of “pretending everything is fine”.\nShe asks: “Isn’t it the case, that after 18 years in charge, if the SNP had a plan to fix the NHS, they would have done it by now?”\nSwinney says he hears the same thing from Baillie every single week and says it is “not good enough” for her to “create the alarm” with her questioning.\nHe says Scotland is treating more cancer patients on time within the 31 and 62-day standards than the same quarter five years ago.\nHe says record funding was put in to the health service by the Scottish government and accuses Baillie of “not being interested\" in properly funding the NHS.\nSwinney and Findlay similar on whisky, but not on Starmer\nPhilip Sim\nBBC Scotland political correspondent\nThere isn’t really a big policy difference between Russell Findlay and John Swinney when it comes to US tariffs.\nThey are both worried about high tax rates on exports; they would both like to see a better deal for whisky.\nBut the interesting difference is that the Tories are only too happy to fire in about the UK government’s approach.\nJohn Swinney loves nothing more than giving the Labour administration a kicking on their domestic policies, like welfare cuts.\nBut he has always been clear that he is behind Sir Keir Starmer’s approach on the world stage.\nIt does reflect the fact that Scottish ministers don’t have much of a role in international trade negotiations, but also the fact that the FM and PM are similar characters – both hoping for cool heads and pragmatic solutions to win out.\nWill the government promote Scotland abroad?\nThe Scottish Tory leader said the Scottish Whisky Association was \"worried\" about the Scottish government and whether it would help them.\nFindlay said the Scottish government announced a USA export plan to identify the best opportunities for Scottish businesses in America last year, but it was cancelled within months.\nHe asks if this was a mistake and if Swinney will reverse the decision and produce a new USA export plan.\nThe first minister says the line of questioning was \"bizarre\" because the Conservatives \"demand that the government close our international offices\" which are \"critical\" for Scotland's success abroad.\nHe said the Scottish government would look at opportunities to promote Scottish products overseas and stand \"shoulder-to-shoulder\" with the industry.\nCalls for UK government to lower whisky tax\nFindlay refers to the Scottish Chambers of Commerce which warned that many firms will now struggle to survive, specifically whisky businesses.\nHe said this follows an increase in whisky duty \"imposed\" by the UK government six months ago.\nHe asks if the Scottish government will back his call for the UK government to lower its \"record high tax on whisky\".\nSwinney says the UK government will make its financial decisions and the Scottish Tory leader was able to make his representations to them.\nHe said the government had had extensive dialogue with the Scottish Whisky Association and would \"leave no stone unturned\" in taking forward the industry's concerns.\nFindlay challenges first minister to support business\nScottish Conservative leader Russell Findlay goes straight into Donald Trump’s new tariffs, saying they will cause “significant harm to many of our industries”.\nHe says that Scotland exports about £4bn worth of goods to the US each year adding: “It’s our largest export destination.\"\nHe asks if the first minister will instruct the government and its business agencies to do whatever they can to support business and protect Scottish jobs.\nSwinney says that is “absolutely” what the Scottish government and says the tariffs are “not good news” across the world, with negative implications for the US as well.\nHe says the Scottish government will engage with the UK government who are responsible for international trade.\nGreene sees red over Tories 'Reform-lite' direction\nAngus Cochrane\nBBC Scotland News\nThe talk of parliament this morning, other than the US president’s plans to reorder global trade, is the news that Jamie Greene hasquit the Scottish Conservative group.\nGreene accused the party of becoming \"Trump-esque in both style and substance\" and adopting “Reform-lite” policies.\nThe West Scotland MSP has often cut an isolated figure on the Tory backbenches since being removed as the party’s justice spokesperson in 2023 – a sacking he claims was linked his support for the government’s controversial gender recognition reforms.\nThe announcement is therefore not a tremendous shock, but it is a blow for leader Russell Findlay.\nGreene will now sit as an independent, leaving the Conservatives with 30 MSPs in the chamber, and facing a battle to hold onto that large a cohort at next year’s Holyrood election.\nOne party chief who will not be leading his party into that election is Patrick Harvie, who announced on Wednesday he is stepping down as Scottish Green co-leader.\nAfter almost 17 years in the role, he says it’s time “for a new face to join the leadership team”.\nTariffs dominate - but Greene resignation likely to come up\nPhilip Sim\nBBC Scotland political correspondent\nThere are plenty of big stories around in politics ahead of FMQs – but opposition leaders might be as nervous about them as John Swinney.\nThe threat of US tariffs on goods from the UK is the sort of thing a business-friendly Tory leader might ask about.\nBut Russell Findlay will know that he’s likely to hear a thing or two about the fact one of his quit the Conservatives this morning.\nJamie Greene’s resignation letter was a brutal one, slamming Mr Findlay’s “Reform-lite agenda that appeals to the worst of our society”. Mr Swinney will look for any opportunity to read from it.\nMeanwhile Jackie Baillie is leading for Scottish Labour, with Anas Sarwar away in the States.\nMr Swinney is heading to New York himself for Tartan Week, but not until after the big Holyrood set piece of the week.\nSome in the SNP have already raised an eyebrow at the fact Mr Sarwar will be absent – although his deputy is more than capable of leaning into a scrap with the first minister on her own account.\nUltimately – at least as it stands – there isn’t a huge amount of difference between the parties on how they’d like to approach the issue of American tariffs.\nThe SNP seem quite happy to follow the calm, measured negotiating strategy of Sir Keir Starmer.\nBut the big news of the day is still likely to provide a flashpoint between them this afternoon.", "url": "https://www.bbc.com/news/live/cn7xm8n18kkt"}