{"authors": ["Nick Jackson", "www.facebook.com"], "date_download": "2025-04-26 03:58:51", "date_modify": "2025-04-26 03:58:51", "date_publish": "2025-03-04 12:53:39", "description": "Trafford councillors argue over financial management as the hike is approved to plug a budget deficit.", "filename": "news_articles_cly42486w9lo_1745639931.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3a76/live/75907960-f8e0-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cly42486w9lo_1745639931.html", "title": "Trafford Council has 'no option' but to pass 7.5% council tax hike", "title_page": "Trafford Council has 'no option' but to pass 7.5% council tax hike - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The leader of a council where taxes have risen by 7.49% - the highest of any authority in Greater Manchester - has said the hike was unavoidable.\nIt was backed by Labour-led Trafford Council at a budget-setting meeting on Monday to help plug a £12.8m financial deficit.\nConservative opposition leader Nathan Evans said Labour had driven the authority \"to the brink of bankruptcy\" since taking control in 2018.\nBut council leader Tom Ross said the shortfall was largely down a Conservative government council tax freeze between 2011 and 2015, which \"cost us £14m in today's money\".\nHe told BBC Radio Manchester the council was in a \"very difficult\" position, so the hike was required to put Trafford on a \"sustainable financial footing\".\nThe area had low levels of funding compared to other councils and an ageing population meant \"the financial envelope with which we operate in is getting more and more restricted\", Ross added.\nHe said: \"We need to have a fundamental review of the way that government is funding local government that has to reflect the demographics of the area.\"\nTrafford is one of four struggling council's in the north-west of England where the government relaxed budgeting rules to help them tackle a £12.8m deficit.\nA £9.6m loan will be handed to the council by the Ministry of Housing, Communities and Local Government to help plug the gap.\nEvans said the Labour group, in control since 2018, have had seven years \"to get it right\" but had left Trafford \"in crisis\".\nHe said the National Insurance hike during the Labour government's autumn budget had \"put a further strain on already stretched finances\".\n\"We are left with the fourth highest council tax hike in England, borrowing to pay debt interest and no end in sight,\" he said.", "url": "https://www.bbc.co.uk/news/articles/cly42486w9lo"}