{"authors": ["Nomsa Maseko", "www.facebook.com"], "date_download": "2025-04-26 03:38:17", "date_modify": "2025-04-26 03:38:17", "date_publish": "2025-03-05 00:12:25", "description": "Thousands of Congolese are opting make a dangerous river crossing to get to safety in Burundi.", "filename": "news_articles_c93k9476694o_1745638697.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8d94/live/429f7b40-f92c-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93k9476694o_1745638697.html", "title": "DR Congo conflict: Men risk drowning to flee conscription by rebels", "title_page": "DR Congo conflict: Men risk drowning to flee conscription by rebels  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jordan Bita preferred to risk his life swimming across a roaring river than stay at home and be conscripted by rebels in eastern Democratic Republic of Congo.\nThe 25-year-old clung on to a black bin bag with some possessions as he used the strong currents to navigate his way across the Rusizi river, which forms the border between DR Congo and Burundi.\nThis was the last stage in a desperate journey to escape to safety in Burundi as the conflict in eastern DR Congo escalates, with M23 rebels capturing the cities of Goma and Bukavu in the last five weeks.\n\"I managed to flee safely… because I was crossing through the forest and moving along the bushes instead of the main road,\" he told the BBC after climbing up the bank on the Burundian side and wiping the water from his face.\n\"This is because M23 fighters are everywhere and they are forcing us to join them to fight against the government,\" he said.\nBurundian troops are monitoring the riverbank in Cibitoke province in the north-west where Congolese families are crossing.\nThey are among nearly 70,000 people who have sought refuge here over the last month as the M23 rebels - backed by Rwanda, Burundi's neighbours to the north - continue to advance south in DR Congo.\nAt the end of January they took the major hub of Goma in DR Congo's North Kivu province and in mid-February Bukavu, the capital of South Kivu, fell.\nMr Bita's luggage was thoroughly checked on the orders of Burundian troops - no weapons are allowed in.\nAfterwards, he picked up his bag and carried it on his head, making his way up a steep hill to the nearest refugee camp about 12km (seven miles) away in the town of Rugombo.\nHe is bringing with him desperately needed food - maize meal, peanuts and beans - for his family who are already at a makeshift camp set up in the town's football stadium.\nAnother man, Amani Sebakungu, looked exhausted and was trying to catch his breath as he emerged from the Rusizi: \"In the river you just have to take heart and say if I die or survive so be it. God willed I crossed safely.\"\nAs the BBC team was interviewing Mr Sebakungu, the Burundian military ordered us all to vacate the area as M23 rebels had been spotted marching towards the river on the other side.\nLater, looking over from a nearby hill, we could see the rebels in military fatigues walking in single file and stopping the people on the Congolese side from making the crossing.\nThe dangers those fleeing face are real.\nOver the last two weeks, at least 20 people have been swept away as they attempted to swim the 300m (984ft) across the river, which at certain points is 10m deep. It is thought many other drownings have gone unreported.\nClarice Kacindi lost her three-year-old child while crossing the Rusizi 10 days ago.\n\"One of my children was lying on the raft in front of me while I held three others beside me. We had many other people in the raft and when we reached the middle of the river the raft broke into two and my child was swept away,\" she told the BBC at Rugombo's football stadium.\n\"M23 are making our lives very difficult. They must stop this war. Even if I wanted to go back home, I'll be forced to start from scratch. They've stolen everything we left behind,\" she said.\nHundreds of white tents have been put up for shelter in the stadium as the paperwork of those seeking asylum is processed.\nAs many as 25 people share a tent, with many others sleeping under the stars. Food is rationed to only one meal a day.\nFurther south, the main border post between DR Congo and Burundi at Gatumba is also busy.\nIt is usually an hour's drive between the nearby Congolese city of Uvira and Burundi's main city of Bujumbura with the road humming with traders and vehicles.\nNow it is only one-way traffic with refugees flowing into Burundi - mainly women and children.\nBurundian security officials, who spoke on condition of anonymity, told the BBC that men were not being allowed over the border and were being told to remain in Uvira to defend the city from the M23.\nBurundi has more than 10,000 troops deployed in DR Congo helping the military there fight the M23.\nMany of their soldiers are now based in Uvira, which has a population of more than 300,000.\nIt is located on the northern tip of Lake Tanganyika and is now on high alert as M23 rebels are marching south from Bukavu and are reportedly 70km away.\nBurundi has been a natural ally of DR Congo over years because of its enmity with Rwanda.\nRelations between Rwanda and Burundi have long been hostile, with both accusing each other of trying to overthrow their respective governments.\nThe countries share a similar language and ethnic make-up - with Tutsi and Hutu communities often vying for power - and both have suffered terrible ethnic-based massacres.\nBut unlike Rwanda, which is headed by a Tutsi president, the majority Hutus are in power in Burundi.\nBurundi's government fears that if the M23 cements its presence in South Kivu by taking Uvira it will strengthen a Burundian rebel group called Red Tabara.\nBased in South Kivu, it is mainly made up of Tutsis - and has attacked Burundi in the past.\n\"It is terrible for Burundi. This is the first time in more than 20 years for the country to receive this large number of refugees,\" Brigitte Mukanga-Eno, an official from the UN refugee agency, told the BBC.\n\"We need to support this country in receiving the refugees to improve the conditions of those that are still making their way to Burundi so that there are no clashes between the refugees and host communities.\"\nEighty-seven-year-old Magega Mwarui can attest to the years of unrest in the region, often triggered by ethnic rivalries.\n\"I have fled to Burundi so many times. We cross this river carrying the little belongings we have left,\" the Congolese woman, who has lost her sight, told BBC in Rugombo.\n\"Since I was young, before I turned blind… There've been times where I almost drowned while fleeing conflict,\" she said.\nCharlotte Odile, who is now living at a camp just outside Rugombo set up for those who have been officially registered as refugees, told us she came to Burundi with her four children after her husband was shot dead by M23 rebels in South-Kivu.\n\"I'm hoping to find a home for my children and peace,\" she said.\nAdditional reporting by the BBC's Robert Kiptoo.", "url": "https://www.bbc.co.uk/news/articles/c93k9476694o"}