{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-20 13:57:53", "date_modify": "2025-05-20 13:57:53", "date_publish": "2023-07-31 00:00:00", "description": "The PM says more oil and gas licences will be approved, despite warnings from campaigners.", "filename": "news_live_uk-politics-66357043_1747749473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/41A9/production/_130590861_oil-gettyimages-1299175775.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/news_live_uk-politics-66357043_1747749473.html", "title": "Sunak insists new oil and gas 'entirely consistent' with net zero", "title_page": "Sunak insists new oil and gas 'entirely consistent' with net zero - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What happened today?\nWe're wrapping up our live coverage, so let's recap the day.\nSpeaking from Aberdeenshire, Prime Minister Rishi Sunak announced that the government would grant 100 new North Sea oil and gas licences.\nSunak defended the new licences, saying they were \"entirely consistent\" with government climate commitments.\nBut critics say today's plans show the government is not serious about tackling climate change. Shadow climate change secretary Ed Miliband said Sunak's \"weak and confused policy... will do nothing for our energy security, and drive a coach and horses through our climate commitments\".\nSunak also announced support for a carbon capture project, which will trap planet-warming CO2 emissions and bury them under the sea in north east Scotland.\nWe're ending our live coverage but you can:\nGet a summary of they key points in our main story here\nUnderstand what carbon capture is and how it can help fight climate change here\nFind out more about the oil and gas licenceshere\nToday's live page was written by Andre Rhoden-Paul, Anna Boyd, Emily McGarvey, Gem O'Reilly, Charlene Anne Rodrigues, Jacqueline Howard, Sean Seddon and Malu Cursino. It was edited by James Harness, Victoria Lindrea, Jamie Whitehead and Dulcie Lee.\nIs it true that the UK decarbonised faster than any other G7 country?\nIn this morning's BBC Scotland interview, Rishi Sunak claimed the UK has “decarbonised faster than any other G7 country.”\nThe G7 (Group of Seven) is an organisation of the world's seven largest so-called \"advanced\" economies, which includes the UK.\nIt is true the UK has decarbonised faster when comparing cuts to greenhouse gas emissions since 1990.\nUK emissions have fallen by 48.7% up to the end of 2022, external, according to government data.\nThis figure refers to greenhouse gas emissions within the UK, in line with international standards. It doesn’t account for the UK’s total carbon footprint, which includes emissions related to the manufacture of products that the UK imports from abroad, for example.\nGermany is in second place among the G7, having cut its emissions by 40.4% since 1990, external.\nHowever, since a key international climate agreement, called the Paris Agreement, was signed at the end of 2015, Germany has reduced its emissions at a faster rate compared with the UK.\nUnder the Paris Agreement nearly 200 countries agreed to try to limit average global temperature rises to 1.5C, which would stave off some of the worst effects of climate change.\nSunak will go on holiday by plane, says No 10 after flight criticism\nThe PM's jet usage was under spotlight again today, as he flew to Aberdeenshire, in Scotland, to announce the government's 100 new oil and gas licences, alongside carbon capture plans.\nTaking a flight made sense, he said, “because it’s an efficient use of time for the person running the country”.\nCritics accused him of hypocrisy after his flight today, given his pledges to curb carbon emissions.\nAccording to Downing Street, Prime Minister Rishi Sunak will be going on an overseas holiday with his family this Thursday. It'll be the first family holiday in four years, his spokesperson told reporters.\nNo 10 confirmed Sunak and his family will be flying rather than getting a train.\nWhat impact can carbon capture have?\nDouglas Fraser\nScotland business & economy editor\nOf all the ways of reducing carbon emissions, the cheapest way is simple: don't burn oil and gas.\nSo lower the thermostat and improve insulation. Carbon capture and storage has been at the other end of the spectrum (if you need a recap of what it is, check our previous post).\nAlthough the industry hopes to bring down the cost of capture from £80 to £100 per tonne, it aims to reduce that to below £40. But in doing so, it's a highly industrial answer to the challenge.\nThe opposition to it is not the concept, but mistrust of industry motives - it provides a means for the oil and gas industry to keep drilling.\nBut it's not just the industry with that need. If it works at scale, it can allow generators to continue making electricity from gas, oil and even coal.\nIt allows petro-chemicals and refining to continue, while mitigating emissions.\nWhile the technology is proven, it is only at a small scale. Only around 40m tonnes of carbon are sequestered each year. The aim is to get to 8bn tonnes by 2050.\nWhat is carbon capture and storage?\nYou'll have heard this phrase a lot today, as Rishi Sunak announced more funding for carbon capture projects. So let's have a quick rundown of what it is.\nFirstly, burning fossil fuels like oil, gas and coal to generate electricity emits CO2, which is the main driver of climate change.\nThe carbon capture process stops most of the CO2 produced from being released, and either re-uses it or stores it underground.\nThe government says the North Sea is an ideal place to store CO2 - it has plenty of old empty oil and gas reservoirs, and also permeable rocks known as saline aquifers.\nTake a look at how the process works below:\nIs the UK meeting its climate targets?\nSpeaking to BBC Scotland this morning, Rishi Sunak said “we [the UK] have met every single carbon budget target we’ve set ourselves”.\nThe “carbon budget” refers to the cap on the amount of greenhouse gases emitted in the UK. It is set by the government’s independent climate advisers, the Climate Change Committee, over five-year periods.\nThe current budget is the fourth and it runs between 2023 and 2027.\nThe PM is correct that the UK met all three previous carbon budgets, using provisional data for the third carbon budget, external. The Climate Change Committee said in June that it was more confident than a year ago that the UK would meet its fourth budget.\nHowever, they also warned that it was now “markedly less confident” than a year ago that the government would meet its fifth and sixth budgets – highlighting a lack of urgency to deliver on its ambitious commitments in the medium-term.\nEach carbon budget is considered an important stepping stone to the government’s 2050 goal to stop adding to the total amount of greenhouse gases into the atmosphere, known as net zero.\nThe Climate Change Committee also said the expansion of fossil fuel production would not be “in line with net zero”.\nDespite this, the government says it is still committed to the targets.\nYou can read more about the government’s net zero target here.\nFour in ten support ban on new North Sea developments - poll\nHow do people feel about new oil and gas developments in the North Sea?\nWe can get a clue from a YouGov poll, external from May, which found that 40% of respondents would support a ban on new North Sea developments.\nOn the other hand, 32% of people opposed a ban.\nAnd, perhaps showing how complex this issue is, a whopping 29% of people didn't know how they felt.\nSunak hopes to draw clear line on green issues\nJames Cook\nScotland editor\nThe prime minister hopes to drive a green wedge between his party on the one hand and Labour, the SNP, the Liberal Democrats and the Greens on the other.\nBut his approach comes with big risks. Environmental campaigners argue that Sunak is making a huge mistake — morally, practically and electorally.\nAlex Armitage, a Scottish Green Party councillor in Shetland says oil and gas is a \"sunset industry\" and the controversial oil field Rosebank will not improve the UK’s energy security or bring down bills.\nThis month’s wildfires in Greece show that continuing to extract oil from the North Sea and North Atlantic would be madness, he adds.\nClimate change and its impact looks certain to become a central issue when the UK goes to the polls sometime in the next 18 months.\nCarbon capture projects won't make up for oil and gas licences\nJustin Rowlatt\nClimate editor\nWill the carbon capture and storage projects announced today help deal with the emissions from the hundreds of new licences for oil and gas the government plans to issue?\nThe simple answer is no.\nCarbon capture and storage is an emerging industry. There are only about 40 commercial operations globally, according to the International Energy Agency.\nThe investment the government has announced today - and for two other projects in England earlier this year - is designed to kickstart the industry in the UK.\nIt will be many years before it is capable of trapping planet-warming carbon dioxide on a large scale.\nAnd there are questions about how it will be funded in the future.\nCapturing and storing CO2 represents a significant additional cost. Why would businesses incur it unless the government obliges them to?\nOil and gas production in the North Sea is falling - why?\nMark Poynting\nClimate and environment researcher\nThe amount of UK oil and gas extracted from the North Sea has been steadily falling in recent years.\nIn 2000, North Sea oil and gas production was nearly 250 million tonnes of oil equivalent (Mtoe), according to the North Sea Transition Authority - the UK oil and gas body.\nTen years later this had almost halved to nearly 125 Mtoe. In 2022, oil and gas production was less than 80 Mtoe and is forecast to continue to decline in the coming years.\nSo what’s behind the fall?\nIt’s largely because oil and gas supplies in the North Sea are dwindling, making it harder and more costly to extract new oil and gas.\nAt the same time, demand for oil and gas is expected to fall sharply – for example as heating and transport become electric.\nIf the UK meets its net-zero targets - which would mean the UK would not be adding to the total amount of greenhouse gases in the atmosphere - then demand will be around a quarter of its current level by 2050.\nThat’s according to the government’s independent advisers, the Climate Change Committee.\nIn fact, even without any new oil and gas projects, the UK would have to import half as much oil and gas in 2050 compared with today if it reaches net zero.\nFor these reasons, the best way to lower bills for customers and boost energy security would be to cut fossil fuel use and invest in renewables, according to the CCC and the environmental think tanks Green Alliance, external and the Energy and Climate Intelligence Unit, external.\nSunak wary of rapid transition to renewables\nJames Cook\nScotland editor\nThe prime minister knows he is facing an uphill battle to retain power at the next general election.\nBut the result of this month’s Uxbridge by-election in London has given him some hope.\nThe Conservatives’ narrow victory there was attributed to anger about Labour’s plans to tax polluting vehicles under a scheme called Ulez.\nThe lesson Rishi Sunak appears to have drawn is that a rapid and disruptive transition from oil and gas to renewable energy could be a vote loser.\nSome 600 miles from Uxbridge, that stance resonates with Arlene Robertson, one of many Shetland islanders to benefit from the 1970s oil boom.\nThe UK, she argues, is nowhere near ready to stop producing hydrocarbons.\n“Shutting down oil and trying to import it from places like Russia doesn't make much sense to me,\" she says.\nRobertson thinks the controversial Rosebank oil field off the coast of Shetland, one of the largest untapped reserves in UK waters, should be drilled.\nIt is currently awaiting regulatory approval but Sunak’s intervention is a strong signal that he expects it to go ahead.\nThe race for North Sea carbon storage\nSean Seddon\nJournalist\nIt isn't just the UK looking at North Sea carbon storage to meet emission targets.\nProf Stuart Haszeldine, from the University of Edinburgh, told the BBC earlier how Equinor, a Norwegian company, has been implementing carbon capture since 1996.\nNorway has dubbed its wider carbon capture strategy Longship, external and wants to turn the importing of liquified CO2 from around Europe into a fully-fledged industry.\nFunding has been approved for a venture, external which will see carbon trapped at industrial sites on the mainland transported by ship and stored 2,600m (8530ft) below the sea.\nDenmark issued its first carbon capture licences earlier this year, Reuters reported, external. Three companies - including British firm Ineos - are aiming to store eight million tonnes per year by 2030.\nThe Netherlands has plans, external to ship industrial carbon from Rotterdam to offshore sites, while an agreement, external is in place between firms in Germany and Belgium to create a pipe network for liquified CO2 bound for the North Sea.\nA threat to UK's position as global climate leader?\nJustin Rowlatt\nBBC Climate editor\nPrime Minister Rishi Sunak's announcement on North Sea oil and gas licences threatens the government’s ability to lead on climate internationally, say some senior Tories.\nSunak urged world leaders to act quickly on climate when he spoke at the UN Climate Conference in Sharm El-Sheikh in Egypt last year.\n\"Putin's abhorrent war in Ukraine, and rising energy prices across the world are not a reason to go slow on climate change. They are a reason to act faster,\" he said.\nBut the hundreds of new oil and gas licences he said his government plans to issue are likely to make influencing other nations on the climate agenda harder.\nThe government’s climate watchdog, the Climate Change Committee, last month warned the government is losing its leadership role on climate.\nThat fear has been echoed by environmentally minded Conservatives including Zac Goldsmith and Alok Sharma.\nThe question is why other countries would listen when the UK urges them to scale back oil and gas production if it plans to chase down its last reserves of oil and gas?\nWhere does the UK get its energy from?\nIn 2022, the UK imported about 37% of its energy, external.\nThat represents a drop from nearly 50% in the early 2010s - but the figure is still higher than in the late 1990s, when the UK was a net exporter - meaning it sent more energy abroad than it imported.\nThe UK imports proportionally less of its electricity - typically about 5%. In 2022 it was a net electricity exporter for the first time in 44 years, but this was largely because of French nuclear plant maintenance.\nRead more here.\nScotland missed out on previous funding round\nKevin Keane\nBBC Scotland environment correspondent\nThe Acorn project in St Fergus missed out - quite controversially - on track one of funding for this back in 2021.\nInstead it went to two projects in the north of England.\nThat was controversial because there had been heavy hints placed that the Scottish project would form part of that. It was one of the most advanced projects in the UK, if not the most advanced, and then suddenly it was dropped.\nThe accusation was that the government was favouring red wall constituencies following its success at the last general election.\nBut it was always the case that this would be a sequencing of events.\nBetween the projects announced in 2021 and today, 10 mega tonnes of carbon dioxide will be captured and stored by 2030, the UK government says.\nThat includes emissions from Mossmorran, from Grangemouth, from a new power station to be built at Peterhead and, potentially, from direct air capture.\nIt effectively sucks carbon dioxide out of the atmosphere and also stores it.\n'How do we replace oil?' 5 Live listeners react to licence announcement\nMore now from some 5 Live listeners, who have been speaking with presenter Nicky Campbell, following the government's announcement of at least 100 production licences for the North Sea.\nGill in Launceston, Cornwall says there is no replacement for a lot of things that run on oil.\n“What do we do to replace these items, these companies, these things that are so necessary?” she asks.\nGill says she understands and supports the message to “clean the Earth up,\" but she doesn’t agree with activists who \"attack the little man in the street and not the people who run these companies\".\n“We, as a country, are the dot in the ocean - when you've got China digging more coal mines and Germany building more furnaces,” she believes.\n'Gas risks tens of billions of pounds of debt for UK' - climate campaigner\nWe tuned into Nicky Campbell 's Radio 5 Live program and heard from Tessa Khan, who is the director of climate campaign group Uplift.\nKhan says gas reliance puts the UK in debt, whereas MP Craig Mackinlay claims we cannot solely rely on renewable resources.\n\"Our ongoing dependence on gas risks adding tens of billions of pounds of debt to the UK government's budget sheet\" says Tessa, explaining that this is due to the \"volatility of gas\".\nCraig comes back to say there's no direct answer for affordable energy resources because the UK needs \"a storage\", he adds \"what happens when the wind and sun doesn't show\" for renewable resources.", "url": "https://www.bbc.com/news/live/uk-politics-66357043"}