{"authors": ["George Torr", "www.facebook.com"], "date_download": "2025-04-26 04:09:13", "date_modify": "2025-04-26 04:09:13", "date_publish": "2025-03-02 19:35:11", "description": "Derbyshire Police say fraudsters have been using a number of names to pose as officers.", "filename": "news_articles_cy05jyreq58o_1745640553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/295a/live/55f7b6a0-f795-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cy05jyreq58o_1745640553.html", "title": "Fake PC scam warning issued by police", "title_page": "Derbyshire: Fake PC scam warning issued by police - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scam calls from people pretending to be police officers have been reported across the county, Derbyshire Police has said.\nThe force said fraudsters had been calling people using names such as DC John Marston, DC James Madison, DC Mark Reilly or DC Martin Johnston in order to access cash.\nThe scammers claimed they were investigating an \"unauthorised use of the person's bank card\" and advise victims to keep the call secret.\nPolice have urged anyone who receives a call like this to contact officers immediately.\nPolice said no force in the country would contact someone asking for banking information or to withdraw money to aid an investigation.\nA spokesperson said: \"Criminals will often target areas where they know elderly or vulnerable people live, so please share this message with your friends, family and anyone who may benefit from this advice.\n\"If you or someone you know receives a call of this nature, please report it to us as soon as possible so we can identify the areas being targeted to alert local banks and communities.\n\"If you're using the same phone you received the scam call on, please wait five minutes to hear a dial tone before calling us or your bank via the number on the back of your card.\"", "url": "https://www.bbc.co.uk/news/articles/cy05jyreq58o"}