{"authors": ["Ashlea Tracey", "www.facebook.com"], "date_download": "2025-04-26 06:33:26", "date_modify": "2025-04-26 06:33:26", "date_publish": "2025-02-27 06:51:26", "description": "The annual event held in Ramsey during the TT fortnight is called off by organisers due to costs.", "filename": "news_articles_ckg8nw4045yo_1745649206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3419/live/90b71900-f459-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckg8nw4045yo_1745649206.html", "title": "Ramsey drag race event axed due to financial pressures", "title_page": "Ramsey drag race event axed due to financial pressures - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An annual drag race held during the Isle of Man's TT festival has been cancelled for 2025 due to financial pressures, organisers have confirmed.\nThe Ramsey Sprint, which is open to anyone with a motorbike, sees participants from all over the world compete over a 1 mile (1.6km) strip of promenade.\nUK-based motorsport events organiser Straightliners said TT race schedule changes had also made it \"almost impossible\" to secure traders and catering units for the event.\nBut Ramsey Town Commissioners confirmed the four-day music festival Sprintfest, usually held to coincide with the event, would still be going ahead from late May.\nHead of Straightliners Trevor Duckworth said he was \"absolutely gutted\" the event, which was first run in its current form in 1978, would not be going ahead this year but he was confident it would make a return for 2026.\nIn a statement the organisation said it had \"invested heavily\" in redeveloping a race track near York, and currently did not have \"enough capital\" for insurance, permits and travel to the island for this year's event.\nIt also said available catering units, which had reduced in number since the pandemic, were preferring to set up at the Grandstand \"with racing most days\" under the events new format.\nThe schedule for the motorcycle festival was revised for 2023, and now sees racing in two-day blocks over six days rather than four seen previously.", "url": "https://www.bbc.co.uk/news/articles/ckg8nw4045yo"}