{"authors": ["Simon Finlay", "www.facebook.com"], "date_download": "2025-04-26 04:41:39", "date_modify": "2025-04-26 04:41:39", "date_publish": "2025-03-02 07:06:48", "description": "The council's Kent Travel Saver scheme is increasing by between 5.5 and 12.5% from April.", "filename": "news_articles_cp8yve3r5yzo_1745642499.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/13f2/live/10d7ecf0-f68e-11ef-9dad-2d98b18c0719.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8yve3r5yzo_1745642499.html", "title": "Kent County Council: School bus pass costs go up by up to 12.5%", "title_page": "Kent County Council: School bus pass costs go up by up to 12.5% - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The cost of school bus passes is to rise in Kent with low income families hit by a hike of more than 12%.\nA subsidised ticket will go from £120 to £135 (up 12.5%) in 2025-26, while the full rate jumps by 5.5% from £550 to £580, according to the Local Democracy Reporting Service.\nThe Kent Travel Saver (KTS), which is run by Kent County Council (KCC), has seen the full price rise from £450 to £580 in three years.\nThe new prices have been criticised by parents and opposition councillors, but the ruling Conservatives said the increases have been kept lower by funding from the government's Bus Service Improvement Plan (BSIP).\nEnvironment and transport cabinet committee member, councillor Harry Rayner told a meeting on 25 February he estimated the full cost of a KTS pass on some routes could range from £1,200 to £1,600 without the council's subsidy.\nHe said: \"For some students not using a KTS, a return would cost £6 per day, compared to £3.05 if a KTS is used.\"\nBut Green Party committee colleague Mark Hood said: \"What worries me is that when (BSIP) doesn't happen… the cost is going to be astronomical.\"", "url": "https://www.bbc.co.uk/news/articles/cp8yve3r5yzo"}