{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:35:58", "date_modify": "2025-04-26 06:35:58", "date_publish": "2025-02-27 06:05:51", "description": "Forster's activism is to be commemorated with a special plaque with rainbow stripes round it.", "filename": "news_articles_c983zzlw75ro_1745649358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f1bc/live/783eb370-f390-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c983zzlw75ro_1745649358.html", "title": "Rainbow plaque to be unveiled at former home of Jackie Forster", "title_page": "Rainbow plaque to be unveiled at former home of Jackie Forster - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "London's latest \"rainbow plaque\" has been unveiled at the former home of actor, broadcaster and lesbian rights activist Jackie Forster.\nUnder the scheme, blue plaques bordered with rainbow stripes have been installed in several locations in the capital, to commemorate significant people, places or events in LGBTQIA+ history.\nForster publicly came out as a lesbian in 1969 and joined the Campaign for Homosexual Equality. She later co-founded the long-running lesbian social network and publication Sappho.\nArts organisation Studio Voltaire, which runs the plaque scheme, described Forster as a \"true trailblazer who paved the way for LGBTQIA+ people through her pioneering work\".\n\"Jackie spent the last half of her life working increasingly for LGBTQIA+ rights and visibility,\" said Anne Lacey, Forster's partner.\n\"From the day she 'came out' at Speakers' Corner in 1969, she fought for the celebration of the word 'lesbian.'\"\nThe plaque was unveiled in front of her family, friends and fellow activists on Wednesday, at Forster's former home in Warwick Avenue, where she lived for 21 years until her death.\nSue Sanders, Founder of LGBT+ History Month said Forster was a \"whirlwind and a massive champion for lesbian visibility\".\n\"Importantly, Jackie ensured there was a weekly safe space at Sappho's Notting Hill meetings.\n\"Her kindness was legendary,\" she added.", "url": "https://www.bbc.co.uk/news/articles/c983zzlw75ro"}