{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:23:30", "date_modify": "2025-05-19 14:23:30", "date_publish": "2015-03-30 14:55:02", "description": "Incumbent Uzbek President Islam Karimov is re-elected as expected by a landslide in a vote criticised by international watchdogs.", "filename": "news_world-asia-32117463_1747664610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81993000/jpg/_81993465_024245890-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-32117463_1747664610.html", "title": "Uzbekistan vote: Huge win for President Islam Karimov", "title_page": "Uzbekistan vote: Huge win for President Islam Karimov - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uzbekistan's Islam Karimov has been re-elected president by a landslide, according to preliminary results of Sunday's election.\nThe widely-predicted outcome saw Mr Karimov, who has led the country for more than 25 years, secure 90% of the vote.\nBut international observers have criticised the poll, saying that it fell short of international standards.\nUzbek officials said that there was a 91% turnout for the vote.\nMr Karimov, 77, has led Uzbekistan since 1989 when the country was still part of the Soviet Union, making him the only leader in the country's history.\nThe Organization for Security and Cooperation in Europe issued a statement on Monday criticising the election for a \"lack of genuine political alternatives\" to the incumbent and \"persistent legal and organisational shortcomings\".\nThe OSCE also criticised Mr Karimov for disregarding the two-term limit placed on the presidency by the Uzbek constitution.\nBBC Central Asia correspondent Abdujalil Abdurasulov says that elections in authoritarian Uzbekistan are often used to boost the incumbent's legitimacy, with high turnout helping to reinforce the image of public support for the president.", "url": "https://www.bbc.com/news/world-asia-32117463"}