{"authors": ["Elizabeth Baines", "www.facebook.com"], "date_download": "2025-04-26 06:38:17", "date_modify": "2025-04-26 06:38:17", "date_publish": "2025-02-26 06:19:20", "description": "Road closures are due to railway bridge being replaced as part of route upgrade.", "filename": "news_articles_cn89gqld687o_1745649497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9b0f/live/e3109620-f36b-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn89gqld687o_1745649497.html", "title": "Cross Gates: Businesses in Leeds suburb fear impact of roadworks", "title_page": "Cross Gates: Businesses in Leeds suburb fear impact of roadworks - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Along Station Road in Cross Gates, a cluster of businesses line the busy artery through the east Leeds suburb.\nSome have been stationed opposite the railway for the past three decades, but their owners say work to upgrade the line is threatening their trade.\nFrom late March, a bridge over the tracks will be demolished and rebuilt so the line between Leeds, Selby and York can be electrified.\nBut with early preparation work already reducing passing footfall, business owners have told the BBC they are \"terrified\" for their futures when full road closures come into effect.\nKatie Ramsden established her coffee shop just over a year ago after her son, Tobias, was stillborn.\n\"You get more appreciation for life when something like that happens,\" she told the BBC, her café bustling with commuters hoping to catch the next train into Leeds.\nHIT Coffee, which is named using a combination of her children's initials, gave Mrs Ramsden the opportunity to set her own hours, allowing her to spend more time with her family.\nShe is worried the works, which are part of the Transpennine Route Upgrade, will stop people coming in.\n\"We bring our kids for breakfast before they go to school; our home and business life is now going to have to change drastically.\n\"We will be extremely restricted, we will not have footfall, we will not have drive-in traffic; it is petrifying.\n\"Without help, we will not be able to survive this, we do not have anything else; this is who we are.\"\nThe Station Road bridge, which crosses over the line next to Cross Gates Station, is currently too low to accommodate overhead wires.\nThe bridge, which was originally built in 1830 and widened twice in the decades after, will be removed and rebuilt at a higher level.\nBetween the 31 March and 25 November, the section of the southbound carriageway of Station Road across the railway bridge will be closed to enable construction work to take place.\nOne lane of the northbound carriageway will also be closed as will a nearby footpath.\nDiversions will be in place during the closures. , external\nEarly preparation work began last week, with Northern Powergrid diverting services beneath the central reservation of the bridge.\nThe work is taking place directly outside florist Monroes.\nMaria Brown has run the business for 35 years and says she received \"no notification\" the works were going to take place.\n\"The first time I knew, was seeing a sign at the top of the road telling me there were major works.\n\"We accept the work has to be done but the issue is we have not been told.\n\"When you ask a question like, 'how am I going to get access? How can my delivery people come on a morning?' You do not get a response.\n\"There will be days we cannot trade.\"\nLucy Grogan from the Transpennine Route Upgrade project said representatives had met with \"several of the local businesses around Cross Gates\" to \"discuss their concerns\".\nShe said they would \"continue to engage\" to ensure everybody was informed about the upcoming work.\n\"We have planned our construction carefully to enable one lane to remain open to help maintain access and minimise disruption, however there are eight days when the road will need to be closed for safety.\n\"Access to all businesses will be maintained throughout the works.\n\"The reconstruction of Station Road bridge to create room for electrical overhead lines to be installed is a key step in enabling faster, greener and more frequent electric trains to run between York, Leeds, Huddersfield and Manchester.\"\nListen to highlights from West Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cn89gqld687o"}