{"authors": ["Asha Patel", "Jake Garner", "www.facebook.com"], "date_download": "2025-04-26 07:06:52", "date_modify": "2025-04-26 07:06:52", "date_publish": "2025-02-28 06:12:31", "description": "One councillor says increasing reports of dog fouling are just the \"tip of the iceberg\".", "filename": "news_articles_cdellzgkwx7o_1745651212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4404/live/721bddd0-f537-11ef-a372-9f83dba237c1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdellzgkwx7o_1745651212.html", "title": "Rushcliffe's doubling dog poo problem is 'not nice for anyone'", "title_page": "Rushcliffe's doubling dog poo problem is 'not nice for anyone' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Would you rather pay a £100 fine or pick up your dog's poo with your bare hands?\nIn a corner of Nottinghamshire where dog fouling seems to be a growing problem, one ill-prepared man chose the latter, said councillor Rob Inglis.\nRushcliffe Borough Council said it had received nearly 40 reports of dog fouling across the borough since 1 January - more than doubling its previous monthly average of 10.\nInglis, who deals with environment and safety, said the reports to the council were just \"the tip of the iceberg\".\nThe council wants to renew its Public Spaces Protection Order (PSPO), external, which excludes Tollerton, that was introduced three years ago to address dog control in the borough.\nIt gives the authority power to issue on-the-spot fines of £100, or people can face a prosecution fine of up to £1,000.\nThe village of Keyworth has been identified as a particular hotspot in recent months.\nJackie and Paul Benson, both in their 70s, regularly walk through the village and said they had noticed an increase in dog poo on their route.\n\"We've seen some people pick up, but, you know - some of the excrement that's come out of a dog has been the size of a human being's - so I understand the upset [when people don't],\" Mrs Benson said.\nMr Benson added: \"Picking up what [your dog] does is part and parcel of it, and that's what you have to accept when you take on a dog in the first place.\n\"I think that the problem with a lot of people is they see it as too much trouble.\"\nSusan Cannell, a villager of 15 years, said she watched one walker leave their dog's mess in her garden.\n\"It was bad a few years back, but then we got it all sorted, but it's started coming back again, and down the street where I live, there's quite a bit.\n\"It's not nice for anyone,\" she said.\nShe added most people followed the rules but thought catching the culprits was difficult.\nThe council is currently holding a public consultation on a proposal to renew its PSPO in July.\nBut 93-year-old resident David Potter was not convinced powers to issue a financial penalty helped.\n\"I don't think the fine will do any good because - how are they going to catch them?\" he said.\nHe thought, however, more warning signs around the village could work as a deterrent \"for a while\".\nMr Potter added while he had not seen a \"noticeable increase\" in dog mess on the streets, he had noticed bags were being \"thrown into people's gardens\".\nJoanne Baker, 58, believed dog fouling in the countryside was worse but felt the penalty should remain in place in Rushcliffe.\n\"We've all had occasions where you run out of a bag. I've even knocked on a neighbour's door and said 'can I have a carrier bag?' Or you'd flag down another dog owner - that happens occasionally - but generally you should be responsible,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cdellzgkwx7o"}