{"authors": ["Luke Deal", "Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 04:23:22", "date_modify": "2025-04-26 04:23:22", "date_publish": "2025-03-03 13:24:49", "description": "Kat and Fi Parsons challenge themselves to hire and all female construction team for their home renovation.", "filename": "news_articles_cr42z5wyzpdo_1745641402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/180b/live/def4c4c0-f82b-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cr42z5wyzpdo_1745641402.html", "title": "'We hired only women to renovate our Suffolk home'", "title_page": "'We hired only women to renovate our Suffolk home' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A couple renovating their home are making use of an all-female team to promote gender equality in the construction industry.\nKat and Fi Parsons are in the process of renovating their home in Gosbeck near Needham Market, Suffolk.\nBoth have backgrounds within construction and wanted to challenge a \"male-dominated environment\" and set themselves the task of hiring only women for the project.\nThey hoped to inspire other women into the industry during this week's Women in Construction Week.\n\"When it came to starting to renovate the house we thought why not try with an all-female team, given only 14% of the workforce are female and 1% are on tools,\" Kat explained.\n\"We like a challenge so we decided to give it a go.\n\"The construction side of things, to actually get women on site to build this, has been the challenge.\"\nThe couple almost gave up a year ago when they couldn't complete the team, but through connections and social media they found their main builder.\nAbout 340,000 women are employed within the UK construction industry according to Simian, external, one of the country's leading construction and scaffolding specialists.\nHowever, just 7% of executive roles are held by women.\nFi said it had been \"frustrating\" trying to find other females for their project, but she was pleased they had.\n\"I'm glad we persevered and I wouldn't really do it any other way... we want to shine a spotlight on women in construction and we want to showcase that right across the board,\" she added.\n\"From designing it to actually building it and showing what opportunities there are for girls and women in the construction industry.\"\nKat said women in the industry faced various challenges including issues around confidence.\n\"A lot of people who have worked on the project said that they felt really underestimated when you turn up on site and you get that sort of eyeroll of, 'Oh no, they've sent a woman, you're going to cause issues', that sort of thing,\" she continued.\n\"You have to be quite thick skinned for that and you absolutely shouldn't have to.\"\nShe added women in construction can struggle to attain personal protective equipment (PPE).\nHer team however, were fully kitted out with PPE that was designed for women.\nYas Poole is one of the builders working on the project.\n\"It's quite exciting because it's very rare that you get to work with that many females on site,\" she said.\n\"So having an all-female team, it's just fantastic.\"\nMarta Holton, one of the architects on the team, said even within her field she felt women were still underrepresented.\n\"You almost have to prove yourself in every meeting that you know what you're talking about and it really shouldn't be like this,\" she explained.\n\"You've gone through all of the education... you turn up to a meeting and you shouldn't have to again prove yourself and often it's still the case.\"", "url": "https://www.bbc.co.uk/news/articles/cr42z5wyzpdo"}