{"authors": ["David Loyn", "www.facebook.com"], "date_download": "2025-05-19 14:43:44", "date_modify": "2025-05-19 14:43:44", "date_publish": "2015-01-29 02:25:43", "description": "Four months after the inauguration of a new president, Afghanistan is still without a government and could face zero growth in 2015.", "filename": "news_world-asia-31024856_1747665824.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80582000/jpg/_80582525_afgh1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-31024856_1747665824.html", "title": "Afghan economy stagnates amid political deadlock", "title_page": "Afghan economy stagnates amid political deadlock - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exactly four months after the inauguration of Afghanistan's new president Ashraf Ghani, there is still no government in place in Afghanistan, and the long delay is threatening the economic recovery of one of the frailest economies in the world.\nInstead, deputy ministers from the former administration are caretaking government departments, and the new president has fired many officials across the country without appointing replacements.\nOnly eight ministers have been confirmed by parliament, less than a third of the total, after long wrangling.\nThe highest-profile casualty was General Sher Mohammed Karimi, nominated as defence minister.\nAfter long arguments in parliament it is now clear that no more ministers will be in place before members of parliament go for a winter break until the end of March.\n\"The business community needs a strong government, legislation, the power of the rule of law,\" said Aarakhsh Hafizi, head of the international relations committee of the Afghan Chamber of Commerce. \"Without that, the market economy will not work.\"\nWhen President Ghani met Mr Hafizi with other business leaders soon after he took power in September, he said he would meet them monthly because of the importance of the private sector.\nBut he has not held any meetings since, and he recently went to neighbouring Turkmenistan without any Afghan business people, although his office had asked Mr Hafizi to name a delegation.\nThe impact of the economic slowdown can be seen everywhere.\nUnused trucks are parked on open ground next to the road near Kabul. One driver, Zar Gulab, said he had never known a time like it.\nThe economy has been hit by a perfect storm of events - with political change coming as international troops left.\nThe artificial economy of the wartime years was ended - with the loss of the jobs of tens of thousands of people - just as President Ghani tried to form his new government.\nAnd even before the arguments in parliament, forming the government took time because of an uneasy coalition between President Ghani and his chief executive, Abdullah Abdullah. In the truck park, a driver who gave his name as Wajid said simply, \"For one truck you can't have two drivers.\"\nAfghanistan simply cannot afford the posturing and continual delays.\nIn Kabul's central money market, a raucous gathering of money-lenders close to the river, manager Mohammed Khan Baz said the outlook was bleak.\n\"Even though a lot of projects are half-completed - not only office blocks, but hospitals, clinics, schools and roads all over the country - the money has simply run out and everything has closed down,\" he said.", "url": "https://www.bbc.com/news/world-asia-31024856"}