{"authors": ["Katharine Da Costa", "www.facebook.com"], "date_download": "2025-04-26 06:39:15", "date_modify": "2025-04-26 06:39:15", "date_publish": "2025-03-02 16:22:05", "description": "Katharine House Hospice, in Adderbury, welcomes the government's £100m investment in the sector.", "filename": "news_articles_cn48qy54d11o_1745649555.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/39e0/live/df37b8e0-f775-11ef-841c-1f98008bd439.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn48qy54d11o_1745649555.html", "title": "Hospice joins calls for long-term financial help", "title_page": "Katharine House Hospice joins calls for long-term financial help - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An Oxfordshire hospice has joined calls for more long-term financial help to pay staff salaries, despite a government pledge of £100m for the sector.\nKatharine House Hospice, in Adderbury, welcomed the capital grant for buildings and equipment but said wages and bills were \"increasingly hard to cover\".\nFrom April, hospices will face additional National Insurance contributions as well as national minimum wage rises.\nHospice CEO Emma Radley said she was \"delighted\" that the government was \"recognising that hospices are underfunded\".\nLouise Ludlow, who has late stage ovarian cancer, said she had \"a very good experience\" at Katharine House, adding: \"The staff have all been wonderful and responsive to my symptom management.\n\"This time, they're helping me through this really difficult transition from being really well to dying and I feel comfortable and at peace.\"\nThe hospice said it needs to raise £3.5m a year to fund 10 inpatient beds and a community team but it has been in deficit for the last couple of years and has recently let go five members of staff.\nMs Radley told the BBC: \"I think all hospices would say what we need is better funding for hospices every day.\n\"The revenue funding for nurses' salaries, doctors' salaries, gas, electric - all of those costs are going up and that is increasingly hard to cover.\"", "url": "https://www.bbc.co.uk/news/articles/cn48qy54d11o"}