{"authors": ["Sarah Spina-Matthews", "www.facebook.com"], "date_download": "2025-04-26 04:10:49", "date_modify": "2025-04-26 04:10:49", "date_publish": "2025-03-04 19:38:14", "description": "Children in Scarborough continue the town's 122-year-old Shrove Tuesday tradition.", "filename": "news_articles_c1mnzgdmzmvo_1745640649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d931/live/6ba0ee00-f90b-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mnzgdmzmvo_1745640649.html", "title": "Hundreds celebrate Scarborough's annual Skipping Day", "title_page": "Hundreds celebrate Scarborough's annual Skipping Day - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hundreds of people have descended on a seaside town to take part in its annual Skipping Day, which has been held every year since early last century.\nThe event, in Scarborough, was first officially recorded in 1903, and is held on Shrove Tuesday following the day's other traditional activity of pancake racing.\nMany school pupils get half a day away from classes to take part, with the town's Foreshore Road being closed to cars for the celebrations.\nLes Shannon, from the Scarborough Maritime Heritage Centre, said local residents had fiercely defended the unique tradition over the years, saying \"we need to preserve it\".\nMr Shannon told BBC Radio York: \"Every time we get a new headmaster, the first thing they want to do is stop the [half day of school], but locally we push very much to keep that tradition.\"\nHe said in its early days, most of the town had an \"unofficial bank holiday\" as servants and labourers were given a half day off for Lent.\nCelebrations would begin after the town's \"pancake bell\" was rung at midday, which originally signalled the beginning of Lent and then, in the 1800s, became the cue to start cooking pancakes, Mr Shannon explained.", "url": "https://www.bbc.co.uk/news/articles/c1mnzgdmzmvo"}