{"authors": ["Zoe Kleinman", "www.facebook.com"], "date_download": "2025-04-26 07:42:51", "date_modify": "2025-04-26 07:42:51", "date_publish": "2025-02-26 19:00:44", "description": "Tulsi Gabbard said she was seeking further information from the FBI and other US agencies.", "filename": "news_articles_c1kjmddx2nzo_1745653371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/544e/live/daee2460-f46c-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1kjmddx2nzo_1745653371.html", "title": "US intelligence head 'not told' about UK secret Apple data demand", "title_page": "US intelligence head 'not told' about UK secret Apple data demand - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tulsi Gabbard, the director of US National Intelligence, says she was not informed in advance about the UK government's demand to be able to access Apple customers' encrypted data from anywhere in the world.\nEarlier this year, the UK government asked for the right to see the data, which currently not even Apple can access.\nThe tech giant last week took the unprecedented step of removing its highest level data security tool from customers in the UK.\nIn a letter, Ms Gabbard said she was seeking further information from the FBI and other US agencies and said, if the reports were true, the UK government's actions amounted to an \"egregious violation\" of US citizens' privacy.\nThe Home Office notice, which cannot legally be made public, was issued to Apple under the UK's Investigatory Powers Act in January.\nMs Gabbard added that she was also seeking legal advice over whether the UK had breached an agreement between it and the US not to demand data belonging to each other's citizens.\nIn response to the Home Office notice, last week Apple pulled its top level privacy tool, Advanced Data Protection, from the UK market.\nAdvanced Data Protection (ADP) means only account holders can view items such as photos or documents they have stored online through a process known as end-to-end encryption.\nApple would have to break its encryption systems in order to comply with the UK government demand, as currently it cannot see data protected in this way so would be unable to share it with law enforcement. This is something it says it will never do.\nApple's UK users' data remains encrypted in the UK but at a level which means it can be accessed by the tech giant if served with a warrant.\nIn the letter to Senator Ron Wyden and Representative Andy Biggs which has now been published online, Tulsi Gabbard said she first read about the notice in the media and had not been informed beforehand by either the UK or by Apple.\nApple did not comment. The Home Office referred the BBC to comments made earlier this week by security minister Dan Jarvis.\nThe Minister of State for Security said: \"I cannot comment on operational matters, and it would not be appropriate for me either to confirm or to deny the existence of any notices under the Investigatory Powers Act 2016.\"\nHe added: \"What I can say is that the suggestion that privacy and security are at odds is not correct; we can and must have both.\"\nMeanwhile, two US lawmakers have also requested the US Department of Justice (DOJ) review the UK government's notice to Apple and its implications.\nUS Senator Alex Padilla and Representative Zoe Lofgren, two Democrats who both represent California, asked the DOJ to investigate whether the UK might have breached the terms of the US-UK Agreement on Access to Electronic Data for the Purpose of Countering Serious Crime.\n\"It is difficult to see the UK's notice to Apple, if the reports are accurate, as anything less than an action that undermines US law, public policy, and information security by requiring US companies to take such reckless action as undermining encryption for all users globally,\" the lawmakers said in a statement, external.\nAdditional reporting by Graham Fraser", "url": "https://www.bbc.co.uk/news/articles/c1kjmddx2nzo"}