{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:30:01", "date_modify": "2025-04-26 06:30:01", "date_publish": "2025-02-27 10:52:44", "description": "Cleaning staff at civil service sites are facing reduced hours or redundancies under proposals, a trade union has warned.", "filename": "news_articles_cedll20j6pwo_1745649001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb33/live/8bf2d190-f506-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cedll20j6pwo_1745649001.html", "title": "NI civil service cleaning staff face cuts, union warns", "title_page": "NI civil service cleaning staff face cuts, union warns - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Cleaning staff at civil service sites are facing reduced hours or redundancies under cost-saving proposals, a trade union has warned.\nContractor Aramark has proposed cutting 1535 cleaning hours per week across 162 sites, according to Nipsa official Ryan Wilson.\nThe firm said it is \"committed to providing our clients with the best possible solutions for their business needs\".\nThe Department of Finance (DoF), which oversees outsourced services, said decisions in relation to the workforce \"are taken by the contractor\".\nThe plans could see \"fewer staff being asked to do more work while robots and automation are brought in to replace them\", Mr Wilson told BBC's Nolan Show.\nAt one site, the Department of Health's Castle Buildings headquarters, there is a proposal to reduce cleaning hours by up to 60%, as first reported by the Newsletter., external\n\"They currently have 300 hours cleaning per week, the proposal on the table is to slash that by 175 hours…to replace some of that work, they're proposing two robot cleaners to be introduced,\" Mr Wilson said.\n\"How can anybody expect the same level of cleanliness, the same hygiene standards, when over half the hours are gone and the work is supplemented by machines instead of human workers? That's just one example.\n\"If this was [about] efficiency we would be talking about improving standards, not about slashing over 1500 cleaning hours a week.\"\nAramark has entered into consultation with Nipsa and GMB trade unions and has shared documentation on their proposal to cut hours across the 162 sites.\nMr Wilson said \"it has been made clear\" that Aramark want to make \"changes\" before the contract is due to start on 1 April.", "url": "https://www.bbc.co.uk/news/articles/cedll20j6pwo"}