{"authors": ["Erin Black", "Chris Craddock", "www.facebook.com"], "date_download": "2025-04-26 03:44:22", "date_modify": "2025-04-26 03:44:22", "date_publish": "2025-03-05 07:26:06", "description": "About 300 people were evacuated for several hours after the incident at Jersey Airport.", "filename": "news_articles_c9deg32y07eo_1745639062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f86/live/25063110-f999-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deg32y07eo_1745639062.html", "title": "Jersey Airport reopens after 'significant' security incident", "title_page": "Jersey Airport reopens after 'significant' security incident - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "About 300 passengers and staff were evacuated from Jersey Airport due to a \"security incident\", police have said.\nStates of Jersey Police said those affected were \"safely evacuated\" to a nearby health club after the incident at about 06:30 GMT.\nIn a post on social media, the force warned of disruption to all flights \"until further notice\".\nJersey Airport said its top priority was \"the safety and security of everyone at the airport\" and it reopened to passengers at about 11:15.\nDisruption to flights is still expected and Jersey Airport said passengers should contact their airlines for information.\nAirport operations director Ashley Maggs said the evacuation happened because of a \"significant security incident\" and they were taking it \"very seriously\".\nAt 09:30 he said they had \"received information\" and \"had to investigate its credibility\".\n\"At the moment it's deemed as doubtable non-credible but obviously we have to take every precaution,\" he added.\nHe said security teams were in the building and had been \"going through protocols to make sure everything is safe\".\nPorts of Jersey worked with police to manage the incident.\nIt said: \"We apologise for the inconvenience this may cause and appreciate the cooperation and understanding of passengers during this time.\n\"Our top priority is ensuring the safety and security of everyone at the airport.\n\"We are advising passengers to contact their airlines for updates.\"\nPassenger Rena Dunphy was evacuated after check-in and said the airport was \"covered with police at the minute\".\nSpeaking to BBC Radio Jersey she said: \"I got through security and at about 06:30 GMT the alarm started going off.\n\"They just got everyone out to assembly points, kept us there for roughly half an hour and then they got everyone out of the assembly points and into the car parks.\"\nMs Dunphy said people were then told to leave the car parks and to \"go to Strive or basically go home and keep an eye on the airport website until further notice\".\nShe said more than 100 people, including airport staff, had chosen to wait at nearby Strive Health Club.\n\"Police were just saying it was a security issue,\" she added.\n\"I don't think the staff even know because they were evacuated as well, they're not even letting the cars or buses or anything in.\"\nGeorge Bridger, who was part of a stag do on the way to Dublin, said the situation was \"a bit of a surprise\".\n\"So we'd all gone through security and got a drink and sat down, and some alarms went off basically advising us all to evacuate the airport as soon as possible,\" he said.\n\"We were waiting outside and police arrived and we were all escorted to the car park area and then told to leave the grounds altogether.\n\"It was a bit of a surprise I think a lot of people were confused if it was just a training exercise but it soon became apparent it was serious.\n\"Armed police arrived, fire trucks and lots of police vehicles turned up at the airport, I think we all realised it was a serious matter.\"", "url": "https://www.bbc.co.uk/news/articles/c9deg32y07eo"}