{"authors": ["Lewis Adams", "Holly Nichols", "www.facebook.com"], "date_download": "2025-04-26 06:35:42", "date_modify": "2025-04-26 06:35:42", "date_publish": "2025-02-27 06:12:01", "description": "Ron and Nancy Ashpool say they feel \"so lucky\" to be celebrating their platinum wedding anniversary.", "filename": "news_articles_c9813x5yxr0o_1745649342.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/dd61/live/0cc140b0-f474-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9813x5yxr0o_1745649342.html", "title": "Luton couple celebrate 70th wedding anniversary", "title_page": "Luton couple celebrate 70th wedding anniversary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A couple who wed 70 years ago said patience, exercise and \"a couple of glasses of wine\" were key to a happy marriage.\nRon Ashpool, 93, and 91-year-old Nancy got engaged on the back seat of a bus after a day trip to London in 1954.\nMr Ashpool admitted his plan was to propose a week later on Christmas Day, but \"like a fool\" he let Mrs Ashpool try her engagement ring on - and she refused to take it off.\nThe parents of three said they felt \"so lucky\" as they threw a platinum wedding party at their sheltered accommodation in Luton on Wednesday.\nThe couple dated for two years before getting engaged, enjoying frequent visits to either the pub or a dance.\nBut their wedding day was nearly ruined when 1ft (0.3m) of snow fell the night before, blocking the roads into Harpenden.\nMr Ashpool, who worked a shift at his parents' pub in Luton on the morning of the big day, was almost stranded as a result.\nMick Ashpool, 61, the couple's youngest son, said: \"Luckily, when my dad finished his shift an hour before his own wedding, they cleared the roads enough for him to get through to Harpenden and get there on time – just.\"", "url": "https://www.bbc.co.uk/news/articles/c9813x5yxr0o"}