{"authors": ["Will Jefford", "www.facebook.com"], "date_download": "2025-04-26 06:39:13", "date_modify": "2025-04-26 06:39:13", "date_publish": "2025-03-02 16:25:44", "description": "The club, in Wombourne, closed after the pandemic, compounded by years of financial pressure, plans say.", "filename": "news_articles_c70wnqklepqo_1745649553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c748/live/a1e2bac0-f780-11ef-b744-2fe4be9f666c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c70wnqklepqo_1745649553.html", "title": "Plans to demolish Staffordshire Golf Club for homes submitted", "title_page": "Plans to demolish Staffordshire Golf Club for homes submitted - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to demolish a former golf club to make way for three homes have been submitted.\nThe properties are set for the former Staffordshire Golf Club in Wombourne, which closed in 2022 after the pandemic compounded years of financial pressures.\nPlans show developers Prime Oak are aiming to demolish the former clubhouse and driving range to make way for two four-bed and one five-bed homes.\nIt is also proposed that two areas of grassland on the former 18-hole course would be converted into woodland.\nBuilt on land formerly owned by the Earl of Dudley, the course was opened in 1974.\nPapers submitted to South Staffordshire Council on behalf of the developers said the club had \"struggled\" throughout its life span due to a lack of financial investment.\n\"What could have been a high-quality successful enterprise and recreational facility, only supported mostly minimum wage jobs and suffered from underfunding, that ultimately proved to be unsustainable,\" the documents said.\nIt was during the pandemic that the club finally closed its doors, before it was sold off to the current developers.\nThe application said the new homes would be made from \"seasoned oak, air-dried over several years, ensuring the highest-level quality control, for structures that last a lifetime\".\nPlanning officials from the council will review the designs before deciding if they should be approved.\nA consultation is running until 24 March.", "url": "https://www.bbc.co.uk/news/articles/c70wnqklepqo"}