{"authors": ["Danielle Andrews", "Lucy Ashton", "www.facebook.com"], "date_download": "2025-04-26 03:49:05", "date_modify": "2025-04-26 03:49:05", "date_publish": "2025-03-05 13:56:57", "description": "Cold homes, overcrowding and poor maintenance put the health of tenants at risk, the council says.", "filename": "news_articles_cp8v6epv8mjo_1745639345.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3417/live/6b85b2b0-f9ac-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8v6epv8mjo_1745639345.html", "title": "Plans to tackle low quality private rentals", "title_page": "Plans to tackle low quality private rentals in Barnsley - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A council has set out plans to improve standards in the private rental sector to ensure the health and safety of tenants.\nBarnsley Council said cold homes, overcrowding and poor maintenance were all factors putting renters at risk.\nA council survey, external in 2020 had found an estimated 19% of private rented housing in the town were not up to standard.\nThe council said measures being taken to improve standards included prioritising enforcement action against landlords who fail to maintain properties or break the law through overcrowding or improper evictions.\nAccording to the Local Democracy Reporting Service, the council's focus will be on regulating landlords and houses in multiple occupation (HMOs).\nThere is an estimated 1,527 HMOs in Barnsley, and the council plans to ensure these properties comply with health and safety regulations.\nLarge HMOs with five or more tenants are required to be licensed, and the council said it would investigate unlicensed properties to ensure they meet the necessary standards.\nThe council is also introducing a mediation service to resolve disputes early and a support service to help tenants maintain stable housing, it will also work with landlords to improve energy efficiency.\nEmpty council properties will be brought back into use and there will be a review of areas where housing conditions are poor or landlords fail to meet legal requirements.", "url": "https://www.bbc.co.uk/news/articles/cp8v6epv8mjo"}