{"authors": ["Kate Whannel", "www.facebook.com"], "date_download": "2025-04-26 07:26:54", "date_modify": "2025-04-26 07:26:54", "date_publish": "2025-02-27 21:57:35", "description": "The US president says a trade deal could happen very quickly and avoid taxes on UK imports.", "filename": "news_articles_c7988r3q1p2o_1745652414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7be4/live/600be2f0-f5a7-11ef-bcea-7b70a14a5556.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c7988r3q1p2o_1745652414.html", "title": "Donald Trump: UK-US trade deal could mean tariffs 'not necessary'", "title_page": "Donald Trump: UK-US trade deal could mean tariffs 'not necessary' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A trade deal between the US and UK could happen \"very quickly\", President Donald Trump said at a joint press conference with Sir Keir Starmer.\nSpeaking during the prime minister's visit to the White House, Trump envisaged \"a real trade deal\" which could see the UK avoid the kind of tariffs the president has been threatening on some of the US's other trading partners.\nThe trip had been seen as a key moment in Sir Keir's premiership as he sought to influence Trump's decisions on topics including Ukraine, as well as trade.\nSir Keir kicked off his White House visit by presenting Trump with a letter from King Charles inviting him to an \"unprecedented\" second state visit to the UK.\nThe US president did most of the talking, setting out his stance on many subjects including the possibility of a Ukraine deal and the UK's potential agreement with Mauritius over the Chagos Islands.\nOn the plane to the US, Sir Keir reiterated his willingness to send British troops to Ukraine as part of a peace deal.\nHowever, he argued that, without US security guarantees, Russian President Vladimir Putin could re-invade Ukraine.\nAsked if he would provide such assurances, Trump said a minerals agreement he plans to sign with Ukraine on Friday could provide a \"backstop\".\nHe said \"nobody will play around\" if US workers were in the country, as part of the deal on minerals.\nThe US president was pressed on whether he stood by his accusation that Ukrainian President Volodymyr Zelensky was a \"dictator\".\n\"Did I say that? I can't believe I said that,\" he said.\nHe later added he had \"a lot of respect\" for Zelensky, who he will host in Washington DC on Friday.\nThe UK's planned agreement with Mauritius over the Chagos Islands was one potential source of tension between the UK and US leaders.\nHowever, Trump appeared to back the UK's approach saying he was \"inclined to go along with it\".\nThe deal would see the UK cede sovereignty of the Indian Ocean archipelago, but maintain control over the island of Diego Garcia, which includes a US-UK military airbase, by leasing it back.\nAfter taking questions in the Oval Office, the two leaders took part in talks and then held a formal press conference, during which Trump repeatedly spoke about a possible US-UK trade deal which could be agreed \"very quickly\".\nReferring to an economic, rather than a trade deal, Sir Keir said the UK and US would begin work on an agreement centred on the potential of artificial intelligence.\n\"Instead of over-regulating these new technologies, we're seizing the opportunities they offer,\" he said.\nHe said the UK and US had shaped the \"great technological innovations of the last century\" and now had the chance to do the same in the 21st Century.\n\"Artificial intelligence could cure cancer. That could be a moon shot for our age, and that's how we'll keep delivering for our people,\" he said.\nTrump has repeatedly threatened to impose tariffs - import taxes - on many of its allies, including 25% on goods made in the European Union.\nHe also ordered a 25% import tax on all steel and aluminium entering the US - which could hit the UK.\nAsked if Sir Keir had tried to dissuade the president from ordering tariffs against the UK, Trump said: \"He tried.\"\n\"He was working hard I tell you that. He earned whatever the hell they pay him over there,\" he said.\n\"I think there's a very good chance that in the case of these two great, friendly countries, I think we could very well end up with a real trade deal where the tariffs wouldn't be necessary. We'll see.\"\nIn a bid to convince the president against UK tariffs, Sir Keir said the US-UK trade relationship was \"fair, balanced and reciprocal\".\nSince leaving the European Union, successive British leaders have hoped to get a general free trade deal with the US.\nIn his first term as president, Trump said talks about a \"very substantial\" trade deal with the UK were under way.\nHowever, negotiations stalled with disagreements over US agricultural exports and UK taxes on tech companies causing problems.\nThe head of trade policy at the British Chambers of Commerce - a former Labour MP and minister - told BBC Radio 4's Today programme on Friday that businesses will be encouraged by what he called an \"important first step\".\n\"In trade negotiations, relationships matter,\" says William Bain, adding that seeing the two leaders find common ground on their respective economies and trade is \"helpful\".\nHe added that a deal to keep tariffs low would most benefit automotive and pharmaceutical industries in the UK.", "url": "https://www.bbc.co.uk/news/articles/c7988r3q1p2o"}