{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:29:31", "date_modify": "2025-05-19 15:29:31", "date_publish": "2015-02-05 03:19:32", "description": "Will a series of events to encourage people to register to vote help boost turnout at the general election?", "filename": "news_uk-politics-31095661_1747668571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80737000/jpg/_80737116_80737115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-politics-31095661_1747668571.html", "title": "Election 2015: Can registration drive help turnout?", "title_page": "Election 2015: Can registration drive help turnout? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Campaigners are putting on a series of events encouraging people to register to vote ahead of May's general election.\nAmid concerns about the number of people, particularly aged between 18 and 24, who are not currently on the electoral register, campaigners want to \"make a noise\" about the value of the vote and how to sign up as part of Voter Registration Day.\nWhat is voter registration day?\nCampaign group Bite the Ballot came up with the idea last year to combat what it said was a lack of awareness and education about voter registration.\nIt wants to get 250,000 people onto the electoral register on a single day by hosting a series of events to celebrate the importance of registering to vote.\nLast year, 50,000 people signed up on a single day. Those who sign up this time around will be entered into a ballot for tickets to a gig at the Camden Roundhouse in March.\nWhat is happening on Thursday?\nUniversities, schools, youth clubs and other organisations are being encouraged to host registration rallies to try and make the process as hassle-free and engaging as possible.\nBite The Ballot has released a video, which has been broadcast by the BBC and other broadcasters, showing one young man's story of registering. It is aimed at personalising the experience and conveying the power of having the vote.\nIt is also promoting a series of games designed to trigger discussions about voting and explain the basics of signing up. The digital version is narrated by a series of celebrities, including musicians Tinie Tempah and Eliza Doolittle.\nElsewhere, unions are organising registration activities in workplaces across the UK, such as the National Theatre and Royal Opera House, while an image of a ballot box will be beamed on to the House of Commons' Elizabeth Tower.\nWhy all the fuss?\nThe general election is only three months away and anyone who wants to have their say will not be able to do so unless they are registered by the 20 April deadline.\nWho can register to vote?\nYou can register once you are 16 although you will only be able to vote on 7 May if you are 18 or over on the day. If you are a citizen of another EU member state or Commonwealth country living in the UK, and unsure whether you are entitled to vote in the general election or local elections, consult the Electoral Commission website, external.\nYou can register to vote online through the government's gov.uk portal, external. The process takes five minutes and you will need your national insurance number. If you are unsure whether you are already registered or want to update your details, contact your local electoral registration officer, external to find out. You can also register to vote by post, external.\nCan't I ask my husband, wife, son or flatmate to register me?\nNot any more.\nUntil recently, one member of a household could sign up everyone else living there. But this was scrapped last summer as part of a drive to individual electoral registration (IER).\nThe move was designed to reduce the risk of electoral fraud but critics have warned that it hasn't been adequately publicised and, as a result, up to a million people have fallen off the register.\nThere is particular concern that students (who can no longer be signed up en masse in their halls of residence,) those living in private rented properties, and recently arrived migrants are among those being disenfranchised.\nWhat happens if I don't register?\nPut simply, you won't be able to vote on 7 May.\nAnd although it is not compulsory to vote in the UK, those eligible voters who don't register when requested could potentially be fined £80.\nSuch penalties won't apply to anyone who has a valid reason for not doing so, for instance anyone who has been hospitalised for a prolonged period or who has severe learning difficulties.\nTurnout at the last general election in 2010 rose to 65% but 16 million eligible voters did not take part. Politicians have warned that radical action is required if participation is to rise above 70% - last seen in 1992.", "url": "https://www.bbc.com/news/uk-politics-31095661"}