{"authors": ["Laura Jones", "Maisie Lillywhite", "www.facebook.com"], "date_download": "2025-04-26 03:55:55", "date_modify": "2025-04-26 03:55:55", "date_publish": "2025-03-04 15:34:35", "description": "Melissa Wilband and Jack Wheeler deny two charges relating to four-month-old Lexi's death in 2020.", "filename": "news_articles_c4ged793l05o_1745639755.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b3f5/live/9ccf18c0-f907-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ged793l05o_1745639755.html", "title": "Baby died after being shaken at home, court told", "title_page": "Lexi Wilband: Baby died after being shaken at home, court told - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A four-month-old girl suffered fatal brain injuries when she was shaken at her home, a jury has been told.\nMelissa Wilband, 28, and her former partner Jack Wheeler, 31, deny two charges relating to the death of her daughter Lexi Wilband in April 2020.\nThey are accused of manslaughter and causing or allowing her death in Newent, Gloucestershire.\nThe trial of Ms Wilband, from Newent, and Mr Wheeler, from Ledbury, Herefordshire, began on Tuesday at Bristol Crown Court and is expected to last for five weeks.\nA post-mortem examination gave Lexi's cause of death as bleeding to the brain, caused by a non-accidental traumatic event such as someone \"shaking her violently\", said Jane Osborne KC, representing the prosecution.\nShe added Lexi was \"shaken in a way that was rough, unnecessary, violent and caused her brain to start bleeding\".\n\"The prosecution don't suggest that either Melissa Wilband or Jack Wheeler intended to kill Lexi or wanted to cause her serious harm,\" she told the court.\nMs Osborne said it would have been clear to the person inflicting the injuries to Lexi that \"some harm would be caused by their actions\", and there was evidence that the incident \"was not the first time Lexi had been shaken\".\nMs Wilband and Mr Wheeler had been in a relationship for about three years but separated for several months when she became pregnant with another man in early 2019.\nIn court on Tuesday, they were described as \"regular cocaine users\" and that Ms Wilband told Mr Wheeler throughout the pregnancy that he was the biological father, despite knowing this not to be the case, Ms Osborne said.\n\"This was a deliberate ploy to deceive Jack Wheeler into thinking he was the father of Lexi,\" she told the jury.\nMs Osborne said that Ms Wilband presented Mr Wheeler with a document, which purported to be a paternity test, declaring that he was the father but it was \"obviously not a genuine document\".\n\"The most obvious fact was the fact that the word 'father' was spelt 'farther' which would have been obvious to anybody who knew how to spell it properly,\" Ms Osborne said.\n\"Very soon after Lexi was born, Jack Wheeler ensured that Melissa Wilband submitted samples for a proper test.\n\"The genuine test showed that he was not the father of Lexi. After the results of this, Mr Wheeler and Ms Wilband nearly split up but Ms Wilband persuaded Mr Wheeler that he should stay with her.\"\nDuring a police interview after Lexi's death, Ms Wilband admitted she had faked the paternity certificate, Ms Osborne added.\nThey restarted their relationship that spring and Mr Wheeler helped raise Lexi following her birth in November 2019.\nMs Wilband moved into a council house in Newent in February 2020, with Wheeler moving into the property during the Covid-19 lockdown.\nNeighbours heard a woman crying inside the house and a man talking at about 23:30 BST on April 12.\nA woman was heard saying words to the effect of \"what are we going to do now\", Ms Osborne said.\nMs Wilband called NHS 111 at 23:24 BST, with paramedics finding Lexi on the floor.\nThey were allegedly told by Ms Wilband that Lexi had been in her bouncer chair when she cried, went floppy and unresponsive and stopped breathing.\nShe was taken by ambulance to Gloucestershire Royal Hospital, and paramedics noted that Ms Wilband was rolling a cigarette and using her mobile phone when answering questions.\nShe was asked whether she would like to hold her baby before she was intubated, but she declined to do so, the jury was told.\nLexi was transferred to Bristol Children's Hospital and a CT scan indicated she had suffered trauma, with old and new blood seen in her brain.\nMs Wilband went to sleep in another part of the hospital after being with her baby between 20:00 and 23:00.\n\"Ms Wilband knew that Lexi might die during the night but she didn't stay by her bedside,\" Ms Osborne told the court.\nA nurse held Lexi's hand through the night and Ms Wilband was told to attend the ward on the morning of 18 April as Lexi appeared to have longer pauses in her breathing.\n\"She arrived just after Lexi had ceased to show any signs of life and had stopped breathing,\" Ms Osborne said.\nThe trial continues.", "url": "https://www.bbc.co.uk/news/articles/c4ged793l05o"}