{"authors": ["Jason Arunn Murugesu", "www.facebook.com"], "date_download": "2025-04-26 03:59:47", "date_modify": "2025-04-26 03:59:47", "date_publish": "2025-03-04 06:02:05", "description": "The case centres around the use of carbon-capture technology to reduce greenhouse gas emissions.", "filename": "news_articles_c9deq8enxljo_1745639987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8978/live/a524c8f0-7b56-11ef-9f51-2df4bcb50c71.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9deq8enxljo_1745639987.html", "title": "'Tension' in Teesside power plant's approval, court hears", "title_page": "'Tension' in Teesside power plant's approval, court hears - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Court of Appeal has heard there is a \"tension\" in the government's decision to approve a new \"net zero\" gas power station.\nEnvironmental consultant Andrew Boswell lost a High Court case in August after arguing against the green credentials of Net Zero Teesside, which is planning to use carbon-capture technology.\nHe was given permission to take the case to the Court of Appeal where it was heard earlier.\nLegal representatives for the Department for Energy Security and Net Zero (DESNZ) said \"no legal error\" had been made.\nThe plant, which is planned for the Teesworks site, near Redcar, is being developed by a firm called Net Zero Teesside Power – owned by BP and Equinor.\nThe company has previously stated the project could generate up to 860 megawatts of low-carbon electricity.\nIt has claimed that at least 90% of the gas power station's emissions would be captured and funnelled beneath the North Sea\nIn February 2024, the government granted the project a development order (DCO) which is required for nationally significant infrastructure projects.\nBarrister Catherine Dobson, representing Dr Boswell, had previously told the High Court the environmental consultant had exposed \"a large double-counting error\" regarding how the power station's greenhouse gas emissions would be calculated.\nShe said the final assessment - that it may contribute more than 20 million tonnes of \"carbon dioxide equivalent\" into the atmosphere over its lifetime - was \"significantly greater\" than previously estimated.\nMs Dobson told the Court of Appeal that the government had accepted Dr Boswell's calculations and had acknowledged the project's lifetime emissions could cause \"significant adverse\" effects.\nNevertheless, the government had granted permission for the scheme, insisting it would help the UK reach its goal of hitting net zero by 2050.\nShe said there was an \"inconsistency\" in this argument and the government had not given a \"coherent explanation\".\nShe said the government had an \"obligation\" to reach a \"reasoned conclusion\" on the project's environmental impact and had so far failed to do so.", "url": "https://www.bbc.co.uk/news/articles/c9deq8enxljo"}