{"authors": ["Arwyn Jones", "www.facebook.com"], "date_download": "2025-05-19 15:22:18", "date_modify": "2025-05-19 15:22:18", "date_publish": "2015-02-25 06:48:07", "description": "A look at the changes might we see to the national curriculum, which has been part and parcel of how pupils in Wales have been taught since the late 1980s.", "filename": "news_uk-wales-31534284_1747668138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81218000/jpg/_81218209_digital.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-wales-31534284_1747668138.html", "title": "Analysis: What is proposed in Wales' curriculum change?", "title_page": "Analysis: What is proposed in Wales' curriculum change? - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "So what changes might we see to the national curriculum, which has been part and parcel of how pupils in Wales have been taught since the late 1980?\nThe national curriculum was given the go-ahead in 1988 under education reforms by the then education secretary Kenneth Baker and started to be taught in schools in September 1989.\nMr Baker had said that \"we can no longer leave individual teachers, schools or local authorities to devise the curriculum that children should follow\".\nThe world was a bit different 26 years ago - the mobile phone was in its infancy; the internet had not been invented.\nThere have been attempts at tweaks since but this has led to an over-complicated and incoherent system.\nProf Graham Donaldson of Glasgow University - a former teacher and chief inspector of schools - was asked to lead a wide-ranging review by the Welsh government nearly a year ago.\nProf Donaldson wants to do away with the idea of having four key stages in schools.\nHe says the \"transitions\" between them leads to too much of a disconnect for pupils; that teachers and schools do not see the education system as one long process, but rather a series of blocks.\nThey all have different characteristics which are \"unhelpful\" for pupils whereas they should feel their time in school is one \"journey\". It is all too complicated at the moment, it is seen as \"stop-start\".\nSo he wants to see five \"progression steps\" at three-year intervals.\nThe idea is that, instead of going from stage to stage, a pupil's time in school will be one long process.\nIt would mean, for example, that primary and secondary schools would have to work together much better, rather than being seen as a \"new beginning\".\nTesting in schools should continue but be very different to what we have now.\nAt the moment, pupils are tested every year in Wales from the age of seven. The results are used to track and monitor the progress of pupils and also to judge the relative success of schools.\nThis needs to change. Without saying so explicitly, Prof Donaldson suggests very heavily that there is too much testing and that it is not being used correctly.\nHe thinks pupils should be tested less often, and that it should be \"part of learning\".\nAt the moment he thinks there is too much emphasis on testing for accountability rather than for learning.\nHe said: \"Testing can be an important learning tool. And if I'd have to choose between accountability and learning, I'd go with learning every time.\"\nIn his report there will be more details about what tests should look like in future, although he thinks there needs to be a conversation within the profession about how they should be used in future.\nBut he added: \"There needs to be a radically different way of working in future.\"\nAt the moment, subjects are taught within a \"core\" and \"non-core\" framework. It basically ranks subjects in order of importance: English, Welsh, science and maths are the core subjects.\nThe non-core subjects are: art and design, design and technology, geography, history, information and communication technology, modern foreign language, music, physical education and Welsh as a second language.\nThis needs to go, Prof Donaldson says and instead there should be six areas of learning.\nProf Donaldson will not be drawn on a precise timescale but is keen that while we do not rush it we do not lose momentum either.\nEducation Minister Huw Lewis has said it could take a decade or more of \"heavy lifting and hard work\" from teachers before the new curriculum is in place.\nWednesday's announcement will not be the end. To paraphrase Churchill, it will not even be the \"beginning of the end\". It will, however, \"be the end of the beginning\".", "url": "https://www.bbc.com/news/uk-wales-31534284"}