{"authors": ["Daniel Logan", "www.facebook.com"], "date_download": "2025-04-26 06:14:46", "date_modify": "2025-04-26 06:14:46", "date_publish": "2025-03-02 00:00:09", "description": "Local bird experts are calling for the consolidation and promotion of the swift population in Northern Ireland.", "filename": "news_articles_c86ppgvg776o_1745648086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2827/live/7b797670-f5dd-11ef-a452-97c9e2e951dd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c86ppgvg776o_1745648086.html", "title": "Ballyclare: Bird experts in Northern Ireland try to save a species", "title_page": "Ballyclare: Bird experts in Northern Ireland try to save a species - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Local bird experts are calling for the preservation of the swift population in Northern Ireland.\nBird groups have recorded a 66% reduction in breeding swifts across the UK in the last 30 years.\nHowever Ballyclare is one location which is stepping up to help preserve the \"Bird of the Borough,\" with a call for people in the area to get involved by hosting nesting boxes., external\nOne local expert has said \"it will take time, but work is well underway\".\nSwifts are warm weather birds, arriving from late April, before making the 3,400 mile trip back to Africa from early August.\nRarely touching the ground, they spend the majority of their lives airborne, reaching speeds of 69 mph.\nThey eat, bathe, mate and sleep, whilst in the air.\nWhen mating has concluded these brown sooty birds will finally touch down to begin the process of constructing a nest.\nWith a pinpoint sense of direction, the bird is site-faithful, locating the exact same nesting spot, year-on-year.\nA lack of nesting sites is seen by many as key factor in the population decline.\nAs a founding member of the Northern Ireland Swift Group, Mark Smyth campaigns for the conservation of swifts. He even hosts one of County Antrim's largest swift colonies on the side of his house.\nHaving spent more than three decades fascinated by swifts, Mark believes the decline has been inevitable.\n\"About 1990 is when many enthusiasts noticed a small downturn in the number of swifts. Before that, when I was in primary school, the skies would've black with them.\n\"In the early days of social media we would see online European forums, noting the decline in the bird.\"\nMark said efforts in parts of the rest of Europe were \"miles ahead of the UK in conservation\".\nThe swift was given \"Bird of the Borough\" status by Antrim and Newtownabbey Borough Council in May 2015, following a request to council from the Antrim RSPB Local Group.\nMany residents and businesses are now being asked to carry out swift conservation projects by incorporating nesting bricks or erecting nesting boxes on their homes or linking with their businesses.\nA meeting of the local RSPB group, in Ballyclare, on Wednesday aims to provide additional nest sites for the bird.\nSwifts are classified in the UK as Red, under the Birds of Conservation Concern 5: the Red List for Birds, external (2021).\nHowever, this is not an irreversible problem.\nSteps have been taken already in the UK and Republic of Ireland to promote swift populations.\nIn County Mayo, the swift population has increased by 23% after a requirement to include swift bricks in all new buildings , externalwas introduced.\nIn 2019 Choice Housing built a new complex of flats in Ballyclare, at the request of the RSPB Antrim Local Group, they included six swift bricks attached to the new-builds.\nThe housing was built on the site of Woodsides, in the town, which would have seen vast colonies of swifts until its demolition in 2013.\nMichael Ingleston, from Antrim RSPB, said he believes the issues with Lough Neagh are a factor in the decline.\n\"The numbers of Lough Neagh Fly have dropped significantly, due to the presence of Algae along the shores.\n\"These fascinating flyers nested in Belfast and would fly to the lough to get these flies as a significant food source.\"\nHowever, he added, work is very much under way in saving the swifts, although it may take time.\n\"Phase one of this campaign began in the village of Parkgate last year. We managed to obtain DIY swift boxes by applying for funding via the Save Our Wild Isles fund, external.\"\nThe fund involves a collaboration with the WWF, the RSPB and Aviva to make it less challenging for communities across the UK to take action for nature in their local area.\nThe project has now moved on to Ballyclare which \"already has a steady population of swifts during summertime\", said Michael.\nPart of this new project is to install nest boxes on the town hall in Ballyclare Square.", "url": "https://www.bbc.co.uk/news/articles/c86ppgvg776o"}