{"authors": ["Ruth Lucas", "www.facebook.com"], "date_download": "2025-04-26 06:45:24", "date_modify": "2025-04-26 06:45:24", "date_publish": "2025-03-01 15:34:05", "description": "The petition calls for safety improvements at a junction following a £5.5m makeover last year.", "filename": "news_articles_c1d4rkrg5qno_1745649924.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a8ae/live/a89d8cc0-f6ac-11ef-acd4-091c140b24c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4rkrg5qno_1745649924.html", "title": "Wokingham council to discuss petition against colourful crossing", "title_page": "Wokingham council to discuss petition against colourful crossing - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A petition calling for safety improvements at a road junction that underwent a £5.5m makeover last year will be debated by a council's scrutiny committee next week.\nMany residents have complained about the new colourful leaf design of California Crossroads in Finchampstead, Berkshire, calling it an \"accident waiting to happen\".\nThe intersection between Finchampstead Road and Nine Mile Ride was closed between February and September 2024, with the aim of making it more pedestrian-friendly.\nThe petition calls for the junction's zebra crossing and roundabout to be repainted.\nThe makeover project resulted in two roundabouts, each with three exits and, instead of zebra crossings, there are white painted leaves showing where pedestrians should cross.\nThe petition, which has been signed by 1,619 to date, was presented to Wokingham Borough Council in January.\nConservative councillor Peter Harper, who made the submission, said: \"Standard road markings for a roundabout have not been applied, meaning motorists are unsure how to negotiate the junction… they do not consistently give pedestrians priority to cross the road.\"\nA safety audit revealed the authority rejected a number of recommendations to make the junction clearer, including adding central islands to the mini roundabouts.\nWokingham Borough Council commissioned an audit into the junction, which was completed in September.\nIt made a number of recommendations, including adding \"look both ways\" markings to the crossing points, central islands and arrow markings to the roundabouts.\nIt also suggested adding hatching on the approach to existing islands to reduce the risk of collisions.\nLiberal Democrat council leaders have consistently defended the scheme and say they are \"proud\" of its uniqueness.\nA report published ahead of next week's meeting clarifies rules have been followed from the Department for Transport.\nAccording to the rules, informal crossings can be identified using a pattern \"as long as this is not mistaken for a formal crossing, such as a Zebra\", the report reads.\nIt adds that by following the government's Manual for Streets, where \"imaginative and context-specific design\" can achieve \"high levels of safety\".\nHighways and transport officers will answer councillors' questions during the debate on 4 March.", "url": "https://www.bbc.co.uk/news/articles/c1d4rkrg5qno"}