{"authors": ["Claire Hamilton", "www.facebook.com"], "date_download": "2025-04-26 06:54:24", "date_modify": "2025-04-26 06:54:24", "date_publish": "2025-02-28 16:01:03", "description": "Locals were not consulted and the impact was not considered, a group of Liverpool councillors say.", "filename": "news_articles_cgkmmkz6pj3o_1745650464.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/71a9/live/e45f8350-f5e7-11ef-9e7b-21c750c82d19.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgkmmkz6pj3o_1745650464.html", "title": "Liverpool: Caribbean centre site school plan faces more scrutiny after protests", "title_page": "Liverpool: Caribbean centre site school plan faces more scrutiny after protests - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plans to build a new girls school on an African Caribbean community centre site will face further scrutiny by councillors after objections.\nThe proposal for the all-girls Muslim faith school to be built on the site of the African Caribbean Centre in Liverpool off Upper Parliament Street was agreed earlier this week but led to protests.\nA group of local councillors from Toxteth and the surrounding area have \"called in\" the proposals, meaning they will be looked at again by a different council committee.\nLiverpool City Council said it was facing a \"critical\" situation in 2026 over school places, but campaigners said they were \"not happy\" and local people had not been consulted.\nAbout 100 people gathered at Liverpool Town Hall earlier this week to protest at the authority's plan to use a plot of land it owns off Upper Parliament Street to provide a new secondary school.\nThe council said the site had been identified as it met the urgent need for secondary school places in a poorly-served part of Liverpool.\nUnder the plan, the first intake would see more than 120 pupils given places at Eden Girls' Leadership Academy operated by Star Academies, with the school eventually catering for 600 students.\nThe Department for Education would provide funding for its construction, with the council obliged to find a suitable site.\nThe school would be the first Muslim faith-designated school in Liverpool's history and 50% of places would be reserved for Muslim girls.", "url": "https://www.bbc.co.uk/news/articles/cgkmmkz6pj3o"}