{"authors": ["Angela Ferguson", "www.facebook.com"], "date_download": "2025-04-26 03:45:05", "date_modify": "2025-04-26 03:45:05", "date_publish": "2025-03-05 06:24:09", "description": "Alex Overton says his Bradford hospital work inspired him to make a potentially lifesaving donation.", "filename": "news_articles_c4ge8ekg6dko_1745639105.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/995f/live/1d9019f0-f8ef-11ef-aa9e-0529c5c73157.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4ge8ekg6dko_1745639105.html", "title": "Stem cell donation 'least I can do'", "title_page": "Stem cell donation 'least I can do' - Bradford NHS worker - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who donated his stem cells in a bid to save the life of a critically ill patient has said his work at an NHS hospital inspired him to help out.\nAlex Overton, 28, who works at Bradford Royal Infirmary, signed up as a stem cell donor three years ago and was later found to be \"a perfect match\" with a blood cancer patient.\nMr Overton said his stem cells were given to the patient days after he donated them at a hospital in Sheffield, and he still knows nothing about the recipient, other than the fact \"a transplant was their best chance of survival and potentially cure\".\nMr Overton, from Brighouse, said he wanted to encourage others to follow in his footsteps by signing up as a donor.\nMr Overton, a general manager for corporate operations at Bradford Royal Infirmary, said he was inspired to sign up to the NHS Stem Cell Donor Registry after working for the health service and being a blood donor for \"many years\".\nHe explained he had to provide 12 blood samples which were then sent off for testing in the UK and USA, before he underwent further medical screening in December.\n\"I then heard I was the perfect patient match,\" said Mr Overton, who went on to make the donation at the Royal Hallamshire Hospital in Sheffield.\nThe donation process was \"pain-free – like giving a blood donation, but for a little longer\", he said.\nMr Overton said: \"For patients who are critically unwell with blood cancers, without treatment they are less likely to survive.\n\"So, working in the NHS, I want to do all I can to help people.\n\"I think the most precious thing you can do is to give people more time with the family, kids and friends.\n\"If I can do it for one patient then I feel like I am making a difference to their lives.\"\nMr Overton described himself as \"a fit and healthy 28-year-old, so it's the least I can do - and I'd like to think someone would do it for me if I needed it\".\nHe added: \"I'd encourage others to donate. It's rare to be found as a match, but if you are, the only sacrifice you need to give is your time.\"", "url": "https://www.bbc.co.uk/news/articles/c4ge8ekg6dko"}