{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:26:30", "date_modify": "2025-05-19 14:26:30", "date_publish": "2015-03-13 05:22:12", "description": "PM Narendra Modi says India and Sri Lanka must act like good neighbours, during the first official visit to Colombo by an Indian leader for 28 years.", "filename": "news_world-asia-india-31865470_1747664790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/81619000/jpg/_81619954_81619953.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-asia-india-31865470_1747664790.html", "title": "Narendra Modi: India and Sri Lanka must be good neighbours", "title_page": "Narendra Modi: India and Sri Lanka must be good neighbours - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Narendra Modi has urged Sri Lanka and India to act like good neighbours, during the first official visit to Colombo by an Indian PM for 28 years.\nHe promised that his neighbours would benefit from India's status as \"the new frontier of economic opportunity\".\nAnalysts say Mr Modi is attempting to counter the increasing influence of China on its island neighbour.\nIndia's failed effort to broker a peace deal in Sri Lanka's civil war in the 1980s helped to sour relations.\nIn recent years, China has offered cheap loans and helped Sri Lanka with major infrastructure projects.\nFormer President Mahinda Rajapaksa, who was voted out of office in January, openly hailed his close relationship with Beijing.\nHowever, the new government of Maithripala Sirisena has announced a review of all major deals with China amid claims of corruption.\nMr Sirisena made his first overseas trip as president to India last month, apparently indicating a willingness to revive the relationship.\nMr Modi, in a speech to Sri Lanka's parliament, said the future of any country was influenced by the state of its neighbours.\n\"The future I dream for India is also a future that I want for our neighbours,\" he said.\n\"The world sees India as the new frontier of economic opportunity, but our neighbours should have the first claim on India.\"", "url": "https://www.bbc.com/news/world-asia-india-31865470"}