{"authors": ["Sarah Turnnidge", "www.facebook.com"], "date_download": "2025-04-26 06:19:50", "date_modify": "2025-04-26 06:19:50", "date_publish": "2025-03-01 07:03:34", "description": "Producers say they want stories \"only someone from Bridgwater would know\" to help make a new film.", "filename": "news_articles_cj9210emxd2o_1745648390.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/78bb/live/72bdde70-f51c-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cj9210emxd2o_1745648390.html", "title": "Calls for Bridgwater residents to help create new film about town", "title_page": "Calls for Bridgwater residents to help create new film about town - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Residents have been urged to share their unique stories about a Somerset town for a new film.\nThe creators behind the project have asked for contributions \"only someone from Bridgwater would know\".\nPeople living in the area are invited to share their favourite things about the town at drop-in sessions on Saturday or Wednesday.\nDeb Richardson, creative director at Somerset Film, said the team was \"delighted to have been given the opportunity to create a short film that tells the story of contemporary life in Bridgwater in a really interesting way\".\nThe production company is looking for inspiration taken directly from people living and working in Bridgwater to capture the spirit of the town for the film.\nLocals have been asked to share their top three \"best things about Bridgwater\", whether that is a place, person, event or activity.\n\"We're also asking people to share their stories of how they arrived in Bridgwater - either how they came to live here or perhaps an eventful journey that brought them safely back home,\" Ms Richardson added.\nThe shape of the film, she said, would be built around these contributions from the people who know the town best.\n\"It's not like we've already got the script - we're very much looking for inspiration from the town,\" she said.\n\"We're really interested in those things that perhaps only someone from Bridgwater would know - maybe there's a park bench where the sun hits it at a particular time of day, for example.\"\nA drop-in event for those with stories is being held later at Seed Creative Pop-up in Angel Place between 13:00 and 16:00 GMT, with another at The Engine Room on Wednesday 5 March between 18:00 and 20:00.\nPeople can also email in their ideas.", "url": "https://www.bbc.co.uk/news/articles/cj9210emxd2o"}