{"authors": ["Alice Cunningham", "www.facebook.com"], "date_download": "2025-04-26 03:52:05", "date_modify": "2025-04-26 03:52:05", "date_publish": "2025-03-05 11:16:45", "description": "The reopening of Elmswell Services follows a dispute between the operator and the local authority.", "filename": "news_articles_cz61g4n2d76o_1745639525.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a0cb/live/23deadc0-f9a9-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cz61g4n2d76o_1745639525.html", "title": "Elmswell Services on the A14 open again after safety repairs", "title_page": "Elmswell Services on the A14 open again after safety repairs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A service station on the A14 in Suffolk has reopened after a safety planning dispute.\nElmswell Services, between Bury St Edmunds and Stowmarket, was served with a breach of condition notice in January by Mid Suffolk District Council.\nInitially it remained open but it closed in February after the operator agreed to carry out the safety work.\nThe council and the service station operator both confirmed the work had been carried and the site was back open.\nThe council had initially refused planning permission for the site before it was granted on appeal.\nHowever, it said essential road safety measures were not implemented on the site's access points before it opened in December, leading to the first breach of condition notice.\nIn February, the site was issued with a \"stop notice\" after the council said it failed to comply with the first notice.\nAt the time, a spokesperson for site operator EG On The Move said it was \"committed to addressing the matters promptly and responsibly\", and closed the site on 14 February.\nHowever, it said it was \"disappointing considering all legal paperwork and agreements\" had been in place to carry out the work from 28 February to 3 March.\nThe services reopened at 05:00 GMT on Tuesday.\nOn Wednesday, EG On The Move said the work had improved safety, made the site more accessible and easier to navigate, and was \"fully compliant with the planning permission requirements\".\nIt said entry points had been resurfaced and signs had been updated.\n\"We are excited to welcome our customers back after the completion of the safety works,\" a spokesperson added.", "url": "https://www.bbc.co.uk/news/articles/cz61g4n2d76o"}