{"authors": ["Laura Bicker and Kathryn Armstrong", "www.facebook.com"], "date_download": "2025-04-26 06:30:22", "date_modify": "2025-04-26 06:30:22", "date_publish": "2025-02-27 10:31:42", "description": "The move comes after rights groups warned the Uyghurs face torture and possibly death back in China.", "filename": "news_articles_c14jjxz8re6o_1745649022.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c974/live/685a0380-f4f1-11ef-ae0a-4bca4f518eb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c14jjxz8re6o_1745649022.html", "title": "Thailand deports dozens of Uyghurs to China", "title_page": "Thailand deports dozens of Uyghurs to China - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least 40 Uyghurs have been deported to China,Thai authorities have confirmed, despite warnings from rights groups they could face possible torture and even death.\nThe group is thought to have been flown back to China's Xinjiang region on Thursday, after being held for 10 years in a Bangkok detention centre.\nChina has been accused of committing crimes against humanity and possibly genocide against the Uyghur population and other mostly Muslim ethnic groups in the north-western region of Xinjiang. Beijing denies all of the allegations.\nIt is the first time Thailand has deported Uyghurs since 2015.\nThe deportation has been shrouded in secrecy after serious concerns were raised by the United States and United Nations.\nThai media reported that several trucks, some with windows blocked with sheets of black plastic, left Bangkok's main immigration detention centre in the early hours of Thursday morning.\nHours later, tracker Flightrader24 showed an unscheduled China Southern Airlines flight leaving Bangkok, eventually arriving in Xinjiang. It was not immediately clear how many people had been deported.\nThe Thai government later said it had decided to send the 40 Uyghurs back to China because it was not right that they had been held for more than a decade, but that no other third country had stepped forward offering to take them. That includes Turkey, which has given Uyghurs asylum in the past.\nEight Uyghurs remain in Thailand, including five who are serving jail terms for crimes they committed while in detention.\nThe government also said that Prime Minister Paetongtarn Shinawatra was given assurances that the Uyghurs would be looked after if returned to China during her recent visit to the country.\nShe did not initially confirm any deportations had taken place when asked by reporters on Thursday.\n\"In any country in the world actions must adhere to the principles of law, international processes, and human rights,\" Shinawatra said.\nBeijing said that 40 Chinese illegal immigrants were repatriated from Thailand, but refused to confirm that the group were Uyghurs.\n\"The repatriation was carried out in accordance with the laws of China and Thailand, international law and international practice,\" the foreign ministry said.\nChinese state media said the group had been \"bewitched\" by criminal organisations and were stranded in Thailand after illegally leaving the country.\nThe returned group is made up of more than 300 Uyghurs who were detained at the Thai border in 2014 after fleeing repression in Xinjiang.\nMany were sent to Turkey, while others were deported back to China in 2015 - prompting a storm of protest from governments and human rights groups.\n\"What is the Thai government doing?\" asked opposition lawmaker Kannavee Suebsang on social media on Thursday.\n\"There must not be Uyghur deportation to face persecution. They were jailed for 11 years. We violated their human rights for too long.\"\nThe detention centre where the Uyghurs - who had been charged with no crime, apart from entering Thailand without a visa - were kept was known to be unsanitary and overcrowded. Five Uyghurs died in custody.\nIn a statement on Thursday, Human Rights Watch said the group now face a high risk of torture, enforced disappearance and long-term imprisonment.\n\"Thailand's transfer of Uyghur detainees to China constitutes a blatant violation of Thailand's obligations under domestic and international laws,\" said the organisation's Asia director, Elaine Pearson.\n\"Until yesterday [Wednesday], senior Thai officials had made multiple public assurances that these men would not be transferred, including to allies and UN officials.\"\nPhil Robertson, director of the Asia Human Rights and Labour Advocates (AHRLA) group, said that the deportations \"totally destroyed\" the \"charade\" that the current Thai government was different to the previous one \"when it comes to transnational repression and cooperating with authoritarian neighbours\".\nAmnesty International described the deportations as \"unimaginably cruel\".\nOn Thursday, US Secretary of State Marco Rubio condemned Thailand for the deportation and urged \"all governments in countries where Uyghurs seek protection not to forcibly return ethnic Uyghurs to China.\"\nHe accused China of having \"committed genocide and crimes against humanity targeting predominantly Muslim Uyghurs and other members of ethnic and religious minority groups in Xinjiang\" in a statement published online.\nThe UN said it \"deeply regrets\" the deportations, a phrase echoed by the EU.\nMeanwhile, UK Foreign Secretary David Lammy said the UK disagrees \"in the strongest terms\" with Thailand's decision.\nThere are about 12 million Uyghurs, mostly Muslim, living in Xinjiang, which is officially known as the Xinjiang Uyghur Autonomous Region (XUAR).\nThe Uyghurs speak their own language, which is similar to Turkish, and see themselves as culturally and ethnically close to Central Asian nations. They make up less than half of the Xinjiang population.\nRecent decades have seen a mass migration of Han Chinese (China's ethnic majority) into Xinjiang, allegedly orchestrated by the state to dilute the minority population there.\nChina has also been accused of targeting Muslim religious figures and banning religious practices in the region, as well as destroying mosques and tombs.\nWith additional reporting by Thanyarat Doksone in Bangkok", "url": "https://www.bbc.co.uk/news/articles/c14jjxz8re6o"}