{"authors": ["Jessica Lane", "www.facebook.com"], "date_download": "2025-04-26 03:45:23", "date_modify": "2025-04-26 03:45:23", "date_publish": "2025-03-05 06:20:15", "description": "A hospital has apologised after Rosalind Armiger's care 'fell below expected standards'.", "filename": "news_articles_cwynrnn1gpdo_1745639123.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bb5d/live/31e74da0-f8eb-11ef-8db4-815a70ccdd1d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwynrnn1gpdo_1745639123.html", "title": "Grandmother 'dumped' at wrong address after Boston hospital error", "title_page": "Grandmother 'dumped' at wrong address after Boston hospital error - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The family of a woman who has mild dementia say she was \"dumped like a parcel\" at the door of the wrong address after being discharged from hospital.\nRosalind Armiger, 72, had been sent to Pilgrim Hospital Boston for a scan on a head injury and should have been returned to Johnson Community Hospital in Spalding, where she had been receiving care following a previous fall.\nHowever, she said despite telling the driver she no longer lived at the address, she claimed she was left without shoes or a coat in the lobby of flats she had moved out of weeks earlier.\nLincolnshire Community and Hospitals (LCH) NHS Group said it was investigating what happened and apologised for the error.\nMrs Armiger said: \"I was left alone. They just left me to sort myself out.\n\"It was scary. I couldn't make it to the toilet and I couldn't go to the door.\"\nShe had originally spent four weeks in Pilgrim Hospital with fractured bones in her back and pelvis after a fall in her kitchen on 23 December 2024.\nShe had been undergoing rehabilitation at Johnson Community Hospital and was due to move into a care home but on the day of the move suffered another fall and was taken back to Pilgrim Hospital for a scan, when the mistake happened.\nMrs Armiger then said she spent two hours in the lobby of her former address before managing to contact her sons Marcus, 53, and Paul, 51, who came to her aid.\n\"I saw him (Marcus) coming in and I felt relieved because then I knew everything would be all right,\" she said. \"He said to me 'hold on to me mum and I'll take you out'.''\nAcorn Taxis, which picked up Mrs Armiger, said they had policies in place to deal with incidents like this and that they reported it to the transport unit at the hospital the following morning after the family contacted them.\nMrs Armiger, a former cookery teacher, moved to Sutterton, between Boston and Spalding, 10 years ago to live nearer her sons and their children after her husband, John, died.\nHer son, Marcus Armiger, said the family felt let down by the hospital.\n\"I'm angry and upset,\" he said. \"I don't want this to happen to anybody else. You can't treat people like this.\"\nPaul Armiger added: \"We're horrified by what happened. I understand people are busy, but they have a duty of care and they didn't follow that.\n\"She was dumped like a parcel at the door. It shouldn't happen.\n\"When you have a loved one go into hospital, you entrust them (hospital) with your care.\n\"I don't think it's much to ask that they show you that care. They might not be able to fix you, but they should show you that care.\"", "url": "https://www.bbc.co.uk/news/articles/cwynrnn1gpdo"}