{"authors": ["Shannen Headley", "www.facebook.com"], "date_download": "2025-04-26 04:21:03", "date_modify": "2025-04-26 04:21:03", "date_publish": "2025-03-03 15:10:46", "description": "The community multi-faith event is being hosted by the Midlands Art Centre for the second year.", "filename": "news_articles_c07z1ygk7jgo_1745641263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bb47/live/abf23c40-f83c-11ef-9241-f1bc6b2390b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07z1ygk7jgo_1745641263.html", "title": "Midlands Arts Centre marks Ramadan with community Iftar", "title_page": "Midlands Arts Centre marks Ramadan with community Iftar - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "People from across Birmingham have gathered together to celebrate the breaking of the fast during the month of Ramadan at a community Iftar.\nThe multi-faith event was held at the Midlands Art Centre (MAC) on Monday.\nFollowing the meal, there was an evening of shares prayers, free to invited guests and their families.\nThe MAC has also commissioned local artist and printmaker Haseebah Ali to create a mural inside the building for visitors to enjoy throughout the month.\nRamadan is the most important time in the Islamic calendar, when Muslims fast and refrain from eating or drinking between dawn and sunset.\nMuslims also believe it is a time for self-reflection and renewing their faith in Allah, with donations to charity, also known as zakat and reciting special evening prayers known as Taraweeh, being important aspects of the month.\nIt was the second year the MAC has hosted the iftar, and the event was broadcast live on BBC Midlands Today.\nHaseebah Ali, whose art is featured at the centre, said it was important her work reflected elements of her faith.\n\"It is important because when you look around the community it is so broad and vast, so we should really implement the people that come to the MAC,\" she told the programme.\n\"They deserve to see artwork that they can relate to and feel warmth when they look at it.\"", "url": "https://www.bbc.co.uk/news/articles/c07z1ygk7jgo"}