{"authors": ["Jeremy Britton", "www.facebook.com"], "date_download": "2025-04-26 04:05:09", "date_modify": "2025-04-26 04:05:09", "date_publish": "2025-03-03 17:55:03", "description": "Shaquille Graham was shot by a man who laid in wait for him outside a club in south-east London.", "filename": "news_articles_cjev7jl2vnxo_1745640309.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/69ad/live/b40c7eb0-f84e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjev7jl2vnxo_1745640309.html", "title": "Tyler Roberts-Emmanuel convicted of murder of Shaquille Graham", "title_page": "Tyler Roberts-Emmanuel convicted of murder of Shaquille Graham  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 19-year-old has been found guilty of murdering a man he shot at point-blank range outside a south London nightclub.\nTyler Roberts-Emmanuel shot Shaquille Graham, 30, in Catford on 10 March 2024, after lying in wait for him for 20 minutes outside the venue. \"Mr Graham never stood a chance,\" said prosecutor Joel Smith KC. \"He collapsed and died immediately.\"\nThe Old Bailey heard how Mr Graham's murder was planned, with the defendant making a \"dummy run\" on a scooter in the hours before the shooting. However, the motive for the attack remains a mystery, the court was told.\nRoberts-Emmanuel will be sentenced on 4 April.\nJurors heard how the gunman, dressed in dark clothing and a mask or balaclava, left his grandmother's house in Linden Grove, Peckham, in the early hours of 10 March and drove to Silks nightclub in Catford.\nAfter circling the area, Roberts-Emmanuel lay in wait opposite the club until Mr Graham left.\n\"He got off the scooter, walked to Mr Graham, and without pause shot him through the throat,\" said Mr Smith.\n\"The bullet travelled up through the neck, into Mr Graham's skull where it lodged itself.\"\nThe gunman then returned to his grandmother's house, the court heard.\n\"Whilst it is obvious that the killing of Mr Graham was planned, the background remains obscure,\" said Mr Smith.", "url": "https://www.bbc.co.uk/news/articles/cjev7jl2vnxo"}