{"authors": ["Steven Brocklehurst", "www.facebook.com"], "date_download": "2025-04-26 06:24:36", "date_modify": "2025-04-26 06:24:36", "date_publish": "2025-02-28 23:00:02", "description": "President Eisenhower enjoyed an informal stay with the Queen during which she cooked drop scones.", "filename": "news_articles_ckgnnlw2r0mo_1745648676.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4b85/live/33fad250-f5e0-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_ckgnnlw2r0mo_1745648676.html", "title": "When the Queen served drop scones for a US president at Balmoral", "title_page": "When the Queen served drop scones for a US president at Balmoral - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US president Donald Trump has been invited to meet King Charles in Scotland to discuss an unprecedented second state visit to the UK.\nAn official letter from the monarch, delivered by Prime Minister Sir Keir Starmer on Thursday, offered a meeting at either Dumfries House in Ayrshire or Balmoral Castle, a favourite retreat of the Royal Family since the days of Queen Victoria.\nKing Charles's mother, the late Queen Elizabeth, met 13 US presidents during her 70 years on the throne but only one ever stayed with her at Balmoral.\nDwight D Eisenhower, who was often affectionately known by the nickname Ike, was a five-star general who had worked closely with Princess Elizabeth's father - King George VI - during World War 2 and became a friend of the family.\nAfter the war, in1946, the general had visited Balmoral and when he became president the young Queen made her first state visit to the US, staying with Eisenhower in private quarters at the White House in 1957.\nShe enjoyed it so much she invited the president to stay with her at her favourite Scottish sanctuary.\nReports from the time describe an informal and friendly meeting during which the Queen served drop scones at a lakeside picnic.\nShe even sent the president the recipe because he had liked them so much.\nKing Charles, who was 10 years old when his mother hosted Eisenhower in 1959, has now extended a rare invitation to the current US president to meet him in Scotland.\nLike his mother, the King is seeking to play a major role in facilitating the US and UK's \"special\" diplomatic relationship.\nIn his letter to President Trump, the King suggested meeting at either Dumfries House, which he has owned since 2007, or Balmoral, which is only about 58 miles (93km) from the Trump International golf resort at Menie in Aberdeenshire.\nThe president is due to open a new course named after his mother - who was born and brought up on the Isle of Lewis - this summer.\nPresident Trump said it would be an \"honour\" to return to the UK, which he called a \"fantastic\" country.\nThe only US president the late queen did not meet during her reign was Lyndon Johnson.\nHowever, despite her regular visits from the US head of state, she sought to keep Balmoral as place where the affairs of state did not usually intrude.\nA New York Times front page article covering President Eisenhower's visit in 1959 remarked on the \"informality\" that governed his overnight stay.\nIt says that he was the first American head of state to be honoured at the castle, which had been bought by Queen Victoria more than a century before.\nAccording to its report, Queen Elizabeth was seen \"pacing casually\" with her sister Princess Margaret on the road by the gatehouse to the castle when the president drove up with Prince Philip just before noon.\nThe Queen's husband had greeted the US president at Dyce Airport in Aberdeen and the American flag was flown from the Queen's car as it drove the 55-mile route to the castle.\nAccording to the newspaper, school children were lining the route and workmen \"lifted their caps and touched their forelocks in salute\" as the president drove by.\nA BBC report from the time said people along the route were waving flags and banners proclaiming \"We like Ike!\".\nWhen the president arrived at Balmoral, the Queen shook his hand and a lone bagpiper sounded the \"Royal Salute\".\nEisenhower, who was 68 at the time, was said to have \"fallen easily into an unhurried pace\" as the 33-year-old Queen led him towards the castle.\nThe rest of his visit was away from public view but newspaper reports from the time said he had a tour of the estate and picnic lunch on the shore of Loch Muick.\nThey later exchanged gifts and paid a visit to the Queen Mother's home at nearby Birkhall, which is now a favourite place for King Charles to stay.\nMonths after the visit, in January 1960, a letter for President Eisenhower arrived at the White House in Washington.\nWritten on official Buckingham Palace letterhead and signed \"Elizabeth R\", the handwritten note contained a recipe for drop scones (scotch pancakes).\nIt read: \"Dear Mr President, seeing a picture of you in today's newspaper standing in front of a barbecue grilling quail reminded me that I had never sent you the recipe for the drop scones, which I provided you at Balmoral.\n\"Now, I hasten to do so, and I hope you will find them successful.\"\nThe Queen continued: \"\"Though the quantities are for 16 people, when there are fewer I generally put in less flour and milk, but use the other ingredients as stated.\n\"I've also tried using golden syrup or treacle instead of only sugar, and I think that can be very good too.\n\"I think the mixture needs a great deal of beating while making and shouldn't stand about too long before cooking.\"\nIt remains to be seen what recipes King Charles might share with President Trump when they meet.\nIngredients (for 16 people)\n4 teacups flour*\n4 tablespoons caster sugar\n2 teacups milk\n2 whole eggs\n2 teaspoons bicarbonate soda\n3 teaspoons cream of tartar\n2 tablespoons melted butter\nBeat eggs, sugar, and about half the milk together.\nAdd flour and mix well together, adding remainder of milk as required – also bicarbonate and cream of tartar.\nFold in the melted butter.\nAlthough the queen does not provide the instruction, the pancakes are then cooked on a hot griddle.\n*1 teacup = 3/4 cup or 150g", "url": "https://www.bbc.co.uk/news/articles/ckgnnlw2r0mo"}