{"authors": ["Kevin Sharkey", "www.facebook.com"], "date_download": "2025-04-26 06:52:05", "date_modify": "2025-04-26 06:52:05", "date_publish": "2025-02-28 17:19:56", "description": "Almost 2,000 motorists caught speeding on an uncertified camera have had fines overturned.", "filename": "news_articles_c8j0e7ye4m4o_1745650325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e525/live/1568cdb0-f5f4-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8j0e7ye4m4o_1745650325.html", "title": "Mayo speeding fines quashed over camera error on N17", "title_page": "Mayo speeding fines quashed over camera error on N17 - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Almost 2,000 motorists in the Republic of Ireland are to have speeding fines and penalty points quashed.\nThe decision has been taken because the speeding was detected by an uncertified speed camera.\nSome 1,871 drivers were caught speeding on the N17 in County Mayo on the west coast of Ireland between 20 December 2024 and 12 February 2025.\nThey were all issued with fixed charge notices.\nThe speeding was detected by a static speed safety camera system, and it is standard procedure for all cameras used for speeding detection to have valid calibration certificates issued by the GoSafe camera provider.\nGardaí (Irish police) have explained that in conjunction with GoSafe they discovered that the camera, located near the town of Claremorris, was fully functional and accurately identifying offences, but it was not certified.\nThis discovery was made on 12 February and the decision to quash fines and points was announced on Friday.\nSome of the motorists who were caught speeding on the busy road have already paid fines and they will now be refunded.\nA full breakdown of the figures shows that 800 notices were paid and penalty points applied while a further 123 fines were paid but the error was identified before these drivers were given penalty points.\nGarda Ch Supt Jane Humphries said \"this error is very much regretted\".\nHowever, she added: \"The level of speeding breaches issued since the camera went operational on December 20, 2024 demonstrates the continued need for all motorists using this road to slow down.\"\nA spokesperson for the camera provider said: \"At GoSafe, we are committed to maintaining the highest standards of quality and safety. During a routine quality assurance check, we identified that the calibration certificate for radar components in a static speed camera on the N17 in Mayo had expired.\"\n\"To prevent a recurrence, we have implemented enhanced safeguards within our quality assurance process,\" the spokesperson added.\nMotorists impacted by error are now being notified by gardaí.\nThe speed safety camera system went live on 20 December 2024.\nIt was not operational between 1 January 2025 and 17 January 2025 as it had been vandalised.\nThis means that all the 1,871 speeding notices were issued over a period of 39 operational days.", "url": "https://www.bbc.co.uk/news/articles/c8j0e7ye4m4o"}