{"authors": ["Nadia Lincoln", "Andrea Pluck", "www.facebook.com"], "date_download": "2025-04-26 03:46:32", "date_modify": "2025-04-26 03:46:32", "date_publish": "2025-03-05 05:41:13", "description": "Brackley Town Council will hold the meeting to discuss cemetery regulations with residents.", "filename": "news_articles_clynxz4rzdwo_1745639192.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/16ca/live/b47226a0-f904-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_clynxz4rzdwo_1745639192.html", "title": "Public meeting in Brackley after family told to clear grave", "title_page": "Public meeting in Brackley after family told to clear grave - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A town council which ordered a grieving family to remove decorations from their daughter's grave is to hold a public meeting to review its procedures.\nBrackley Town Council last month gave the Sadler family a month's notice to remove all ornaments on their seven-year-old daughter Lottie's grave at the cemetery in Halse Road.\nThe family started a petition, which has attracted more than 4,000 signatures, calling for the Northamptonshire council to reverse its decision and apologise for its conduct.\nThe council has since announced that it will hold the meeting to discuss cemetery regulations with residents.\nIn its original letter to the family, the authority said it had received complaints about the decorations from visitors, who felt that it was \"disturbing the peace of the cemetery\".\nThe grave was decorated with flowers, cuddly toys, lights and trinkets in memory of Lottie, reports the Local Democracy Reporting Service.\nThe council said that, as Lottie's grave was in the adult section of the cemetery, the family should have known they would not be allowed to decorate the plot.\nAn online petition, which stated that the grave decorations were an expression of the family's \"love and grief\", was started on 11 February.\nIt reads: \"Brackley Council has threatened to shatter this sanctuary. We find this directive deeply inhumane and insensitive, punishing a grieving family who are merely trying to cope with their loss.\"\nThe council later issued a statement saying that it \"understands the sensitive nature of cemetery regulations and the emotional attachment individuals feel towards memorialising their loved ones\".\nIt added that its regulations could sometimes be \"difficult\" and that it would review the case and its overall policy to ensure it strikes the right balance between \"respecting individual memorials and maintaining a dignified space for all\".\nThe council said no policy decisions would be made at the meeting but the feedback would be included in a review of the regulations.\nThe meeting will be held in Egerton Hall on 13 March at 18:30 GMT.", "url": "https://www.bbc.co.uk/news/articles/clynxz4rzdwo"}