{"authors": ["Martin Heath", "www.facebook.com"], "date_download": "2025-04-26 03:50:37", "date_modify": "2025-04-26 03:50:37", "date_publish": "2025-03-05 12:36:05", "description": "The council says the state-of-the-art facility will help provide \"vital support for grieving families\".", "filename": "news_articles_c9wp10ezd1zo_1745639437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bfd3/live/05b80860-f9ad-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c9wp10ezd1zo_1745639437.html", "title": "Work starts in Northampton on new £9.5m mortuary", "title_page": "Work starts in Northampton on new £9.5m mortuary - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Building work has started on a new £9.5m public mortuary.\nThe facility, at Booth Meadow in Northampton, is expected to open in the autumn.\nWest Northamptonshire Council said it was needed because the existing provision was \"fragile and increasingly expensive\".\nIt added that the new mortuary would have \"modern, dignified spaces for families, including private viewing and identification areas\".\nWest Northamptonshire Council has a duty to provide mortuary facilities for the coroner, and also for emergencies.\nAccording to a council report, external, it fulfils those responsibilities at the moment by using mortuaries at local hospitals.\nIt also has a \"temporary body storage facility\" in old school pre-fab buildings at The Leys, near Wollaston.\nThe report described those arrangements as \"fragile, vulnerable and expensive\".\nConstruction work has now started on a new purpose-built mortuary, designed for both traditional post-mortems and those involving scanners, which reduce the impact on the bodies.\nThere will also be family viewing and identification facilities.\nThe site will have the facility to create additional temporary body storage if there is an incident involving mass fatalities.", "url": "https://www.bbc.co.uk/news/articles/c9wp10ezd1zo"}