{"authors": ["David Tooley", "www.facebook.com"], "date_download": "2025-04-26 07:58:10", "date_modify": "2025-04-26 07:58:10", "date_publish": "2025-02-25 11:57:35", "description": "A PC admits carrying out searches concerning his ex-brother-in-law, but says he had permission.", "filename": "news_articles_cn8rxglzyezo_1745654290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cb81/live/1a03eb60-f35c-11ef-9040-bf215a6f65f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8rxglzyezo_1745654290.html", "title": "West Mercia PC at misconduct hearing over brother-in-law searches", "title_page": "West Mercia PC at misconduct hearing over brother-in-law searches - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A police constable has admitted carrying out searches on the West Mercia force's systems concerning his ex-brother-in-law who had a conviction, but said he did so with permission and for legitimate policing reasons.\nThe unnamed officer is accused of nine counts of using systems improperly between 2007 and 2018 at a misconduct hearing.\nHe divorced the mother of his two children in 2004, before joining the force, and in 2010 his ex-brother-in-law was jailed for raping children, the hearing was told.\nA panel heard he had not known what the conviction was for, but accessed information in 2018.\nColin Banham, representing the officer, who cannot be named under a reporting restriction, said the officer \"did not know his ex-brother-in-law\" and \"had not seen him for a number of years\".\nTerence Rigby, for West Mercia Police, said: \"He accessed information contrary to force policy, regulations and data regulations.\n\"Officers are entitled to use police equipment for policing reasons, not out of curiosity or intention to provide the information to anyone else.\"\nThe Worcester panel heard the officer met his ex-brother-in-law by chance when the officer responded to an alleged incident in Malvern in March 2018.\nThe officer said his ex-brother-in-law, who he hadn't seen since 2002, opened the door, adding: \"I was as surprised to see him as he was to see me.\"\nHe said he informed his sergeant, adding: \"I knew that he had gone to prison but I did not know what for. I accessed the information under the direction of the sergeant.\"\nA retired sergeant told the hearing he could not remember details of conversations between 2007 and 2018.\nThe officer produced a signed notebook with details of his last search in March 2018. The panel heard the constabulary could not find other notebooks.", "url": "https://www.bbc.co.uk/news/articles/cn8rxglzyezo"}