{"authors": ["Martin Eastaugh", "www.facebook.com"], "date_download": "2025-04-26 07:34:37", "date_modify": "2025-04-26 07:34:37", "date_publish": "2025-02-27 15:38:22", "description": "Three men are standing trial over the theft of the gold toilet which had been part of an exhibition.", "filename": "news_articles_c2ljjkzdl20o_1745652877.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e698/live/3294f740-f29f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2ljjkzdl20o_1745652877.html", "title": "Gold toilet Blenheim Palace theft accused 'searched for news'", "title_page": "Gold toilet Blenheim Palace theft accused 'searched for news' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man accused of the theft of a £4.8m golden toilet searched for online news articles related to the crime in the days following the heist, a court has heard.\nThe artwork, called America, was taken from from Blenheim Palace in Oxfordshire in the early hours of 14 September 2019, two days after it went on display.\nMichael Jones, 39, from Oxford, denies one count of burglary. Fred Doe, 36, from Windsor and 41-year-old Bora Guccuk, from west London, both deny conspiring to transfer criminal property.\nThe trial at Oxford Crown Court heard police found searches in the internet history of the mobile phone of Mr Jones after he was arrested.\nHeadlines that read \"Maurizio Cattelan speaks out after Blenheim's £4.8m gold toilet stolen\" and \"Blenheim Palace reopens after gold toilet stolen in burglary\" were also among the stories that were searched on his phone on 16 September.\nA fourth man, James Sheen, 40, from Wellingborough in Northamptonshire, has previously pleaded guilty to burglary.\nThe court heard that hundreds of fragments of gold were found in and on his clothing at Sheen's home in Oxford, days after the robbery.\nJurors were told that some of the fragments, when analysed, were found to be \"indistinguishable from the gold from which the America golden toilet had been made\".\nThe court also heard that DNA, \"likely to have been left by Mr Sheen\" was found on a sledge hammer left in the toilet cubicle at the stately home.", "url": "https://www.bbc.co.uk/news/articles/c2ljjkzdl20o"}