{"authors": ["Jon Ironmonger", "www.facebook.com"], "date_download": "2025-04-26 06:37:06", "date_modify": "2025-04-26 06:37:06", "date_publish": "2025-02-26 06:37:23", "description": "GP firm says it is \"committed to delivering the highest standards of care\" in wake of criticism.", "filename": "news_articles_cpql042wgv4o_1745649426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fd0d/live/8ee617b0-eeb5-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpql042wgv4o_1745649426.html", "title": "Fears voiced over Northamptonshire eHarley Street GP surgeries", "title_page": "Fears voiced over Northamptonshire eHarley Street GP surgeries  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For months, staff at Brook Medical Centre have been forced to perform intimate examinations in the freezing cold without heating or hot water.\nHealth workers say it is just one example of how unpaid bills and staff shortages have impacted patients at three GP practices in Northamptonshire, and accuse the partner-owners of putting people in danger.\nGP services run by Dr Jalil Ahmed and Dr Jonathan Allinson have drawn criticism in south Wales recently, and the pair are set to resign from five surgeries there, claiming the contracts are unviable.\nA spokesperson for eHarley Street, which provides remote management support to the partners, said they were \"committed to delivering the highest standards of care\" and described the allegations as \"hearsay, fuelled by disgruntled ex-employees\".\nDr Ahmed and Dr Allinson, both eHarley Street senior executives, hold NHS contracts for 24 GP practices in England and Wales.\nThey include Brook Medical Centre (Brook), Rushden Medical Centre (Rushden) and County Surgery (County) in Northamptonshire, which together have more than 20,000 patients and receive about £3.5m in funding from the Integrated Care Board (ICB).\nThe BBC has spoken to eight existing or former health workers at the three surgeries, all of whom asked not to be identified.\nMany said there had been shortages of medical equipment such as speculums, emergency adrenaline, ECG patches, forceps and gloves due to \"constantly unpaid invoices\", which they claimed had resulted in some appointments being cancelled.\nThe BBC has seen internal emails that support most of the allegations.\nIt's understood a medical supplies company twice put a \"stop\" on the GP partners' accounts because of overdue invoices amounting to more than £50,000.\nA former employee at Rushden said that for several months last summer no butterfly kits were available to perform injections on children or people with fragile veins \"so patients were being bruised with larger needles\".\nStaff members at Brook said the boiler was broken for more than a year leaving them with no heating or hot water.\n\"Everyone was in scarves and gloves, and we were struggling to weigh babies or do smear tests in the severe cold,\" one former worker said, \"if we used fan heaters the electrics would trip during consultations.\"\n\"We had to clean up with sanitiser, and I couldn't open dressing packs because my hands were so numb,\" another said.\nThe boiler was replaced last month.\nThe BBC has seen various overdue invoices addressed to County since September, including a letter from HMRC requesting urgent payment of £4,500, a letter from a debt collection agency and a civil claim for £460 from a fire safety company.\nFormer staff claimed County had been a profitable surgery prior to being taken over in 2020.\nOne of those who spoke to the BBC said: \"It doesn't make sense that doctors weren't being replaced and nurses' hours were cut afterwards – we became reliant on locums, and some weren't coming back because they were owed money.\"\nSince coming under new management, the number of permanent GPs at the Northamptonshire practices has reduced from seven to one.\n\"I dread to think what might happen,\" one employee said. \"People are being put in danger and people will die this winter if things don't change.\"\nIn a 28-page statement to the BBC on behalf the GP partners, eHarley Street's business operations manager Sam Clare said patient safety was their \"top priority\".\nHe said the amount owing to a medical supplies company across all practices was \"a working debt\" and \"within normal parameters\".\nResponding to allegations about each practice he said:", "url": "https://www.bbc.co.uk/news/articles/cpql042wgv4o"}