{"authors": ["David Cowan", "www.facebook.com"], "date_download": "2025-04-26 04:02:45", "date_modify": "2025-04-26 04:02:45", "date_publish": "2025-03-03 22:48:56", "description": "A BBC documentary, The Hunt for Peter Tobin, explains how the murder of a Polish student led to the killer of two other teenagers.", "filename": "news_articles_c4g0ej1ljwpo_1745640165.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ca8/live/efdfc3c0-f8d0-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c4g0ej1ljwpo_1745640165.html", "title": "How families were devastated by the cruelty of serial killer Peter Tobin", "title_page": "How families were devastated by the cruelty of serial killer Peter Tobin - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On the day police found a second body behind a house once occupied by a murderer, the father of a missing teenager raised his hand, crossed his fingers and said he hoped it was his daughter.\nDinah McNicol was 18 when she vanished in 1991, after hitchhiking home to Essex from a dance music festival in Hampshire.\nHer father had spoken to countless reporters since then and it just so happened that I was interviewing him when 16 years of tortuous uncertainty were coming to an end.\nIan McNicol had been left in such a dark place that he wanted his daughter to be the person in a shallow grave, because it would mean the family would finally know where she was, get her back, and lay her to rest.\nHis words laid bare the terrible cruelty of serial killers and they've haunted me ever since.\nA new BBC documentary, The Hunt for Peter Tobin, explains how the murder of a young Polish student finally solved the mystery of what had happened to Dinah and a second teenager, 15-year-old Vicky Hamilton, who had gone missing in central Scotland six months earlier in February 1991.\nTobin was a registered sex offender on the run from the authorities when he killed Angelika Kluk and concealed her body beneath the floor of a Glasgow church in September 2006.\nHe was 60 at the time. The crime was so horrific, detectives were convinced he must have killed before.\nStrathclyde Police launched Operation Anagram, a nationwide scoping exercise which tried to establish whether Tobin could be linked to unsolved cases around the UK.\nWithin months, officers realised he was living in Bathgate when Vicky Hamilton went missing in the West Lothian town.\nDespite a huge inquiry and appeals by her distraught family, 15 years had passed with no trace of Vicky ever being found.\nThe link with Tobin changed everything.\nForensic scientists re-examined evidence from the time of her disappearance and found DNA from Tobin's son on Vicky's purse, which had been left near Edinburgh bus station.\nIn June 2007, Lothian and Borders Police searched Tobin's former home in Bathgate. In the attic, they discovered a knife which bore traces of Vicky's DNA.\nOperation Anagram went on to connect Tobin to Dinah, who'd gone missing at the other end of the country in August 1991.\nHer cash card had been used in towns across the south-east of England, from Hove to Margate and Ramsgate in Kent.\nThe money draining from Dinah's account was compensation she received after her mother Judy died in a road accident when she was six.\nThe police found evidence linking Tobin to the card and established he was living in Margate when Dinah failed to come home.\nOne of Tobin's neighbours recalled \"Scottish Pete\" digging a deep hole in his back garden around that time.\nEssex Police thought they were going to get answers for Ian McNicol and his family when they went to Tobin's old house at 50 Irvine Drive in November 2007 - but instead of Dinah, they found Vicky.\nHaving covered the search in Bathgate, I travelled south to Margate with a sense of disbelief which was shared by the Scottish officers investigating Tobin's past.\nEveryone in Scotland knew the face of the smiling schoolgirl with the bobbed dark hair.\nThe discovery of her remains so far from home was horrifying and baffling. How had she ended up there?\nThe answer was that Tobin had killed Vicky in Bathgate, dismembered her body, and taken her remains with him when he moved to a new house 470 miles away in the south of England.\nIn the days that followed, as the police continued their search for Dinah at Irvine Drive, I interviewed her dad at his home in Tillingham, a small Essex village built round a Norman church.\nIan was an instantly likeable man in his late 60s; a retired musician originally from Glasgow who'd named his daughter after a jazz standard.\nOver the years, Dinah's disappearance had taken its toll on his health. We sat down and started filming.\n\"When I lost my wife, we knew she was dead because we had to bury her,\" he said.\n\"We went through the normal process of grief.\n\"When a member of your family goes missing, it's 20 times worse than death because you do not know a thing and all sorts of things go through your imagination.\"\nHe was taking some solace from the fact that another family in exactly the same situation had been helped, even though his daughter had not been found.\nIan turned to the camera to address Vicky's family and said: \"If you're watching, from me and my family, good luck to you. We wish you all the best.\"\nThe doorbell rang. Another reporter told us the police had just announced the discovery of a second body.\nIan agreed to continue the interview, raised his right hand with his fingers crossed and said: \"If they've said that, please be Dinah, and get us out of this misery.\n\"I would bury her next to her mother. So please, let it be Dinah.\"\nLater, after the police confirmed the remains were those of his daughter, Ian said he could die in peace. He passed away in 2014.\nThe detectives investigating Tobin's past were certain he had other victims. They did all they could to find answers for other families, to no avail.\nTobin took his secrets to the grave and was serving three life sentences when he died in 2022.\nNo-one came forward to claim his body. His ashes were disposed of at sea.\nWhen I was interviewed for the BBC documentary, the producer asked what I had thought when I heard the news.\nI told him I had been pleased and hoped his death hadn't been pleasant. Should I have been that honest? Did it cross a line? I don't know.\nWhat I do know is that I'll never forget Ian McNicol or what he said to me 17 years ago: \"Please be Dinah.\"", "url": "https://www.bbc.co.uk/news/articles/c4g0ej1ljwpo"}