{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-21 06:16:47", "date_modify": "2025-05-21 06:16:47", "date_publish": "2025-04-02 00:00:00", "description": "Wall Street suffers its worst day since 2020 but the White House tells investors to \"trust in President Trump\".", "filename": "news_live_c1dr7vy39eet_1747808207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/026e/live/52df9560-10a8-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/news_live_c1dr7vy39eet_1747808207.html", "title": "Major US stocks see biggest losses since 2020 after Trump's tariffs announcement", "title_page": "Major US stocks see biggest losses since 2020 after Trump's tariffs announcement - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trump touts stock market 'boom' while global markets tumble\nJacqueline Howard\nLive reporter\nAs investors watched the US stock market take its biggest one-day dive since the pandemic in 2020, the message from the White House to Wall Street was: \"Trust in President Trump\".\nTrump himself said markets would \"boom\" under his new tariff scheme as the Dow Jones, Nasdaq and S&P plunged over the course of the day.\nTwenty-four hours after Trump imposed minimum 10% import tariffs worldwide starting on 5 April, the US's key trading partners are mapping out their response.\nCanadian Prime Minister Mark Carney retaliated with 25% levies on all vehicles imported across the border, lamenting that the close relationship with the US is \"now over\". In contrast, Mexican President Claudia Sheinbaum said her country would not retaliate in kind.\nMeanwhile, the UK has drawn up a 400-page sample list of US goods that could face future tariffs in retaliation to Trump's tariffs, and though EU leaders are yet to present the bloc's official response, many have slammed the tariffs as \"brutal\".\nEyes will be on the Asian markets in the coming hours as eastern trading floors reopen after initial losses immediately following Trump's announcement.\nWe are now ending our live coverage for the night, but will be back with you come morning. In the meantime, there is plenty about the impact of Trump's tariffs on offer across BBC News:\nWhy Trump's tariffs aren't really reciprocal\nUS tariffs on China, EU and more, at a glance\nSee all the Trump tariffs by country\niPhones, pensions and Brexit: Your questions about tariffs answered\nCanadians continue to boycott US products\nRobin Levinson-King\nReporting from Toronto\nAt a grocery store in Toronto, shopper Benedykta Mazur has become a bit of a sleuth.\nSince Donald Trump launched a trade war with Canada, she has been trying to buy Canadian as much as possible. Some products, like fresh blueberries in April, are impossible.\nBut while she’s willing to pick up something grown in Mexico or Chile, she draws a hard line at anything grown or manufactured in the US.\n“It's a no, an absolute no,” she tells me, after Trump announced his latest round of tariffs on the rest of the world.\n“This is something that is not going to be just kind of wishy washy,” she says.\nMazur says while Canadians have a reputation for being “really nice”, it is time to turn people’s charms elsewhere, and build partnerships with countries that “share commonalities in regards to how you treat another person, because countries are made of people”.\nOlive oil producer says US importer discouraged by tariffs\nGiulia Tommasi\nReporting from Rome\nRocco Mangiaracina is an agricultural entrepreneur. His small family business based in Campobello di Mazara, Sicily, produces around 20,000 bottles of olive oil a year.\nThis is the first year they've started exporting to the US.\n“Only a week ago, we sent our first 900 bottles to the American market,\" he says, adding that he planned to send more bottles but was advised to wait and see how the situation develops.\n“Our concern isn’t so much for us, since we’re not the ones bearing the extra costs, but for the importer - who was planning to place another order soon, increase volumes, or expand the product range.\n\"Now the importer is discouraged by the prospect of having to pay significantly more and, as a result, being forced to raise the final price for consumers.\n\"This feels like a regression - putting up barriers whose usefulness I struggle to see.\"\nCan Trump's tariffs spark a manufacturing boom in India?\nSoutik Biswas\nIndia correspondent\nTrump’s tariffs have rattled global trade, but disruption often creates opportunity. What does this mean for India, the world’s fifth largest and increasingly protectionist economy?\nStarting 9 April, Indian goods will face tariffs of up to 27%. Before this, US tariffs averaged just 3.3% - far lower than India’s 17%, per the White House.\nYet, with the US imposing even steeper tariffs on China (54%), Vietnam (46%), Thailand (36%), and Bangladesh (37%), India has a chance to gain ground in textiles, electronics, and machinery, says Delhi-based think tank GTRI.\nHigher tariffs on Chinese and Bangladeshi exports could help Indian manufacturers expand in the US, while a shift in semiconductor supply chains from Taiwan (32% tariffs) could also benefit India - if it builds the right infrastructure.\nBut can India truly seize the moment, or are these tariffs just a Trump bargaining chip?\nTrump says vehicle firms have begun moving production to US\nBernd Debusmann Jr\nTravelling with the president\nOn his flight from Washington DC to Miami this afternoon, President Trump surprised reporters in the back of the plane by stopping by for an extended question-and-answer session.\nOver the course of 20 minutes, Trump answered a wide range of questions, about everything from TikTok and Elon Musk's future to the Chagos Islands and New York's mayoral race.\nThe bulk of the questions, however, were on tariffs.\nIn response to a BBC question on his message to American workers and businesses that may ultimately feel the impact of retaliatory tariffs, Trump said: \"I think it's going to all work out.\"\n\"Remember, there are no tariffs if you build your plant, or make your product in the US,\" he said. \"There's going to be a transition period, because they're going to be building instead of paying tariffs to some other place.\"\n\"All you have to do is build or make your product in the United States, and a lot of people are doing that,\" he added.\nAccording to Trump, he spoke to two of the five major automobile manufacturers.\n\"They've already started moving their parts-making out of Mexico, out of Canada, and into the United States,\" he said.\nWhat role does the World Trade Organization have in all this?\nJonathan Josephs\nBBC business reporter\nAs we've reported, the World Trade Organization (WTO) has sharply reduced its forecasts for global trade because of President Trump's global tariffs. Malcom asks about the role of the WTO in the imposition of tariffs.\nWhen it comes to the rules of global trade, including tariffs, the WTO is supposed to decide and enforce them.\nUnder President Trump, there has been mixed messaging from the United States because it remains somewhat but not fully engaged.\nThe American complaint, from both Republicans and Democrats, has been that the WTO system doesn’t treat America fairly - by which they mean China gets preferential treatment on global trade.\nThe US also thinks WTO ruling have overstepped their remit to its detriment.\nOne example would be the steel and aluminium tariffs imposed by President Trump in his first term.\nThe WTO said they were against the rules but President Joe Biden's administration ignored that, arguing as Trump had, they were allowed under national security provisions.\nThat argument has also been used this time so a similar response can be expected.\nIn recent weeks, the Trump administration has withheld about $25m of funding from the WTO meaning it faces restrictions on what it can do there.\nHowever, hope of engagement comes in President Trump's nomination of a new ambassador to the Geneva based institution - Joseph Barloon’s appointment is pending Congressional approval.\n'It's absolutely terrifying,' say Ford workers in Canada\nAli Abbas Ahmadi\nReporting from Windsor, Ontario\nKathryn and Christina both work at the Ford plant in Windsor, Ontario, in Canada.\nThey tell me that they \"absolutely\" fear that their plant will shut down, just as the Stellantis one has temporarily.\n\"It's absolutely terrifying,\" says Christina, who marks her 25th year working at Ford today.\nShe has four children, one of whom is in university, and two who are younger. \"I would like them to have a good life too,\" she says, tears welling in her eyes.\nKathryn, whose family has been with Ford for five generations, says she fears her sons will lose their jobs at the plant.\nShe is nearing retirement age, she says, and worries that her pension will also be affected.\n\"If anything drastic were to happen, 40% of our pension is gone.\"\nScale of tariffs appear to have caught investors off-guard\nVishala Sri-Pathma\nBusiness reporter\nAs we've just reported, US stocks plunged today, with the S&P 500 suffering its biggest decline since March 2020.\nInvestors are concerned that the tariffs unveiled on Wednesday raise the risk of a global trade war which may tip the US economy into a recession. The scale of the tariffs were not anticipated so appear to have caught investors off-guard.\nShares of multinational companies tumbled. Nike and Apple dropped 13% and 10%, respectively. Tech shares dropped, with chip-makers Nvidia off 7% and Elon Musk’s Tesla down 5%.\nWhen asked about the market reaction to the tariffs, President Trump said: “The markets are going to boom. The stock is going to boom. The country is going to boom. And the rest of the world wants to see is there any way they can make a deal.\"\nWatch: Trump likens tariffs plan to medical 'operation'\nA short while ago, we heard from President Donald Trump before boarding Air Force One in Maryland.\nOne reporter asked him how the tariffs were going, to which Trump said he thinks \"it's going very well. It was an operation like when a patient gets operated on, and it's a big thing\".\n\"We have six or seven trillion dollars coming into our country,\" the US president says, \"the markets are going to boom, the stock is going to boom, the country is going to boom\".\n\"And the rest of the world wants to see is there any way they can make a deal,\" he adds. \"They've taken advantage of us for many, many years.\"\nAs a reminder, here is a list of the countries with the highest tariffs announced yesterday.\nStellantis plant shutdown is 'scary, very scary'\nAli Abbas Ahmadi\nReporting from Windsor, Ontario\nJournalists are crowding the local auto workers' local union after news broke of the temporary shutdown of the Stellantis plant - Windsor's largest employer.\nDerek Gungle, speaking softly to protect his voice after all the interviews he's given, tells me that he works to assemble cars at the Stellantis plant.\nHe says the shutdown announcement was “kind of expected” after Trump announced the tariffs, but \"scary, very scary\".\nIf the worst happens and the shutdown becomes permanent, or he is laid off, Gungle says he has “no idea” what he will do.\nGungle says Windsor is heavily reliant on cross-border trade and any threat to that that will have devastating effects.\nHe is the second person to mention Flint, Michigan, when speaking about this crisis. Clearly, the fear of deindustrialisation is at the forefront of peoples’ minds.\nWatching that happen just across the border was “weird, very weird,” he says. “I’m hoping it doesn’t have to come to that.”\nWorld Trade Organization predicts drastic reduction in global trade\nJonathan Josephs\nBBC business reporter\nThe World Trade Organization (WTO) has sharply reduced its forecasts for global trade because of President Trump's global tariffs.\nInstead of predicting a 3% growth in volume, it now expects a 1% contraction.\nThe drastic scale of this reduction underlines that these US tariffs pose the biggest challenge to the global trading system since the WTO began drawing up and enforcing the rules 30 years ago.\nThe director general, Ngozi Okonjo-Iweala, says the tariffs \"will have substantial implications for global trade and economic growth prospects\".\nShe adds that she is deeply concerned about escalation and retaliatory measures - which have already started - making things even worse. Some of Trump's tariffs are already being challenged at the WTO.\nBut the Geneva-based body risks being sidelined if it can't find a way to help its members, including the US, to settle their differences.\nWon't tariffs hurt the US more than other countries?\nJonathan Josephs\nBBC business reporter\nAs part of Your Voice, Your BBC News, our correspondents and experts have been answering your questions on US tariffs.\nHere's one from Justine Armstrong, who asks whether the new import taxes will affect people in the US \"more acutely\" than those in other nations.\nThe most immediate impact will be felt by people in America in the form of higher prices.\nIn the first instance, the tariffs are paid at the more than 300 border crossings, ports and airports where companies bring goods in from abroad.\nThose extra costs will squeeze profits along the supply chain and invariably - at least partly - will end up being paid for by American consumers.\nIn other parts of the world, a slowdown in demand from American consumers could lead to fewer jobs if companies currently supplying America can’t find somewhere else to sell their stuff.\nA major catalyst for American companies getting their goods from Asia was China opening up to foreign companies in the late 1970s and offering cheaper options.\nThat meant a dramatic decline in US manufacturing and one of President Trump’s big hopes is that he can reverse that movement.\nHowever, not everything can be made in the US, and even if it can it will take time and significant financial commitment from the companies involved.\nHow well those goods can then compete on price remains to be seen.\nHow did the US work out the tariff numbers?\nIf you scan across Donald Trump’s tariff chart, you'll see that the value in the first column equals roughly half of the number in the second column for most countries. There's a reason for that.\nThe two columns represent:\nTariffs that countries supposedly charge the US\nTariffs the US will impose on other countries\nInitially, it was assumed that the figures were based on existing tariffs plus other trade barriers (like regulations and licensing rules) which make trade harder.\nBut, the White House has now published its official methodology, and it turns out there is a simple equation behind it\nThe calculations are based on a country’s goods trade deficit with the US. In other words, how much more the US imports than it exports. This number is then divided by the total value of imports from that country.\nLet's use China as an example: The US buys more goods from China than it sells to them - there is a goods deficit of $295bn and the total amount of goods it buys from China is $440bn.\nThen, we find the percentage difference between those two numbers, which = 67% - that's the number which appears in the first column of Trump’s chart.\nAnd to work out column two - the tariff the US wishes to impose - you simply divide that number by two.\nSo in China’s case, the result is 34, and there you have the tariff.\nHow were Donald Trump's tariffs calculated?", "url": "https://www.bbc.com/news/live/c1dr7vy39eet"}