{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:20:06", "date_modify": "2025-05-19 15:20:06", "date_publish": "2015-02-02 00:44:00", "description": "Islanders are being asked to work longer and save more for retirement under proposed reforms to personal tax, pensions and benefits.", "filename": "news_world-europe-guernsey-31056400_1747668006.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80686000/jpg/_80686158_179023721.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-europe-guernsey-31056400_1747668006.html", "title": "Guernsey pension age 'could rise to 70'", "title_page": "Guernsey pension age 'could rise to 70' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n2 February 2015\n70\nPension age by 2025\n41,460 Working age from 62,732 population\n52 Number of dependents per 100 people\n17.8% Islanders aged over 65\nTHINKSTOCK\nIslanders are being asked to work longer and save more for retirement under proposed reforms to Guernsey's personal tax, pensions and benefits.\nAnyone currently aged 36 or under will not receive a States pension until they are 70 years old under the Treasury and Resources and Social Security plans, external.\nHealth benefit, discounted prescription charges and free TV licences are among the benefits that could be cut.\nThe plan suggests this could be offset by increases in personal tax allowance.\nThe review was launched because of the island's ageing population - an estimate from 2012 suggested the number of over-65s would double in 20 years.\nIts aim was to suggest changes to the tax and benefits system to \"ensure that public services can continue to be delivered economically and sustainably in the long term\".\nThe report asks the States \"to acknowledge that the present model of provision of long-term residential and nursing care for older people is financially unsustainable\".\nHeadline proposals\nPension age raised from 65 to 70 years, by two months a year from 2020 until 2049 - currently it is due to rise to 67\nIncrease personal tax allowance to a maximum of £17,500 (at 2015 prices) by 2025\nReview the introduction of a consumption tax - like VAT or GST\nHealth Benefit grant, external - up to £12 paid towards medical appointments - to be phased out by 2025\nTo increase prescription charges, external, which are currently £3.40 to £4.40 per item, in 2016\nLimit increases to domestic property tax to 7.5% per annum in real terms between 2016 and 2025\nFamily Allowance, external, currently £15.90 per child per week, to be phased out by 2025\nEnd free prescription charges for those over the age of 64 by 2020 and introduce a £1 per item charge in 2016\nPhase out free TV licences, external for those aged over 74 and those over the age of 64 claiming Supplementary Benefit by 2020\nMortgage Interest Relief to be phased out by 2025\nCreate a pension scheme, in addition to the old age pension, by 2020\nThe 100-page report suggests Guernsey's tax base should be brought \"more into line with... other advanced economies\".\nIt said this should be done by 2025 through direct personal taxes and Social Security contributions being \"reduced significantly from its current level of 74% of total government income\".\nThe report suggests the tax base should be \"diversified, so that a greater proportion of taxation revenues is derived from other forms of taxation\".\nIt also recommends total government income - from general revenue, social security contributions and fees and charges - should not exceed 28% of Gross Domestic Product, which was £2,186m in 2013.\nConsumption tax review guidelines\nRate at which a VAT or GST should be levied, but no higher than 5%\nOne-off and annual costs to the States of introducing and administering any such tax\nOne-off and annual costs to island businesses with proposals for measures to mitigate such costs\nViability of sharing resources for the administration of any such tax with the States of Jersey\nMeasures required to off-set the introduction of any such tax with a reduction in direct taxation through increased personal tax allowances\nChanges needed to pensions and benefits system to mitigate the impact on groups of people that may be disadvantaged by its introduction\nIf approved the report would be due to return to the States of Deliberation no later than June 2017.\nRelated internet links\nTax, Pensions and Benefits Review\nStates of Guernsey: Taxation\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/news/world-europe-guernsey-31056400"}