{"authors": ["Finn Purdy and Jessica Lawrence", "www.facebook.com"], "date_download": "2025-04-26 03:55:36", "date_modify": "2025-04-26 03:55:36", "date_publish": "2025-03-04 15:52:32", "description": "The Irish Cabinet has approved draft legislation to change the rules that govern how its military can be used abroad.", "filename": "news_articles_cwyge72pv55o_1745639736.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9dc4/live/e36e9390-f91c-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyge72pv55o_1745639736.html", "title": "Ireland moves to change rules on deploying military", "title_page": "Defence Forces: Ireland moves to change rules on deploying military - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ireland is in a \"serious period of reform\" when it comes to defence and security, the tánaiste (Irish deputy prime minister) has said.\nEarlier on Tuesday, the Irish Cabinet approved draft legislation to change the rules that govern how its military can be used abroad.\nThe reforms include changes to what it known as 'the triple lock', requiring the approval of the United Nations (UN), government and Dáil (lower house of Irish parliament) for certain troop deployments.\nUnder existing rules, 12 members of the Irish Defence Forces can be sent on an overseas mission without triggering the lock.\nThe proposed change would mean removing the need for UN approval and raising to 50 the number of troops that can be deployed without sign off from the Dáil.\nSpeaking to Irish broadcaster RTÉ's Six One news programme, Simon Harris said the removal of the triple lock system is about \"sovereignty\".\n\"We have a very proud track record in the country of peacekeeping,\" he added.\n\"But the idea that any permanent member of the security council can have a veto, including Vladimir Putin, on where our defence forces go is not democratic.\"\nThe foreign affairs minister said it was \"important\" for decisions on peacekeeping to be taken in Ireland.\nAsked if the removal of the triple lock threatened Ireland's policy of military neutrality, Harris said that was something \"extraordinarily important\" to the Irish people.\n\"We do also need to spend more on defence because actually when you are militarily neutral, you still have an obligation to your own people, to your own country, you still have an obligation to protect your own seas and your own skies,\" he said.\n\"We are in an era now of significant investment in defence... but all of that very much aligned with military neutrality.\"\nEarlier, Taoiseach (prime minister) Micheál Martin said that Russia and China should not have a veto on where Irish troops are sent.\n\"This is about exercising our own sovereignty,\" he added.\nSinn Féin have described the move as an \"abandonment\" of Ireland's policy of neutrality.\nSinn Féin TD (MP) Pearse Doherty said \"the Irish people are against it\", and called for a referendum on the issue.\nThe move comes as the European Commission President Ursula von der Leyen announced plans to give member states more fiscal space for defence investments, as well as €150 billion (£124bn) in loans for those investments.\nEarlier on Tuesday, the US announced it would pause military aid to Ukraine.\n\"We are in an era of rearmament, and Europe is massively ready to boost its defence spending, both to respond to the short-term urgency to act and to support Ukraine, but also to address the long-term need to take on more responsibility for our own European security,\" von der Leyen said.\nEarlier, Brig Gen Rossa Mulcahy was appointed as the next Chief of Staff of the Irish Defence Forces.\nAnnouncing the appointment, the Defence Forces said that Brig Gen Mulcahy has more than 35 years of experience across a variety of roles, both at home and overseas.\nHe has served in deployments to Lebanon, Syria and Afghanistan with the United Nations and NATO.\nSince 2021, he has held the role of assistant chief of staff and he is due to take up the new appointment on 1 June.\nIrish broadcaster RTÉ reported that Brig Gen Mulcahy will be appointed for a minimum of two years, during which time major changes to the Defence Forces's command structures are set to be introduced.\nThis includes a new position of chief of defence, which Brig Gen Mulcahy will be eligible to apply for.\nUnder new plans, the chief of defence will have military control with clearer statutory roles and responsibilities, and more clarity in the defined roles of the Department of Defence and Defence Forces.", "url": "https://www.bbc.co.uk/news/articles/cwyge72pv55o"}