{"authors": ["Sean Dilley, Molly Stazicker, Esme Stallard & Mitchell Labiak", "www.facebook.com"], "date_download": "2025-04-26 07:46:55", "date_modify": "2025-04-26 07:46:55", "date_publish": "2025-02-27 00:00:15", "description": "Transport Secretary Heidi Alexander says she is \"minded to approve\" the expansion, which faces opposition.", "filename": "news_articles_cqjdz9q170yo_1745653615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a953/live/2d80feb0-f4f8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqjdz9q170yo_1745653615.html", "title": "Gatwick Airport: Second runway backed by government", "title_page": "Gatwick Airport: Second runway backed by government - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A second runway at Gatwick Airport has been backed by government, providing measures to reduce noise are put in place.\nTransport Secretary Heidi Alexander said she was \"minded to approve\" the expansion. Some MPs, local authorities and residents are strongly opposed.\nThe airport wants to move its northern runway, which is currently only used for taxiing or as a back up, and make it operational by the end of the decade.\nThe transport secretary's support does not guarantee the expansion will go ahead as it would still need planning permission.\nIf permission is granted, work would start almost immediately, the BBC understands. The £2.2bn expansion will be funded through private investment.\n\"I am issuing a minded to approve decision that provides some additional time to seek views from all parties on the provisions, prior to a final decision,\" Alexander said in a written ministerial statement on Tuesday.\nGatwick has until 24 April to respond to demands for it to include measures, such as noise mitigation and having a proportion of passengers travelling to the airport via public transport, in its overall plans before a final decision will be made in October.\nStewart Wingate, Gatwick Airport chief executive, said following the latest announcement that the government has \"outlined a clear pathway to full approval later in the year\" and that the airport would \"engage fully\" in the process.\nThe Transport Secretary's support for expansion comes as the government is looking at ways to boost economic growth in a bid to boost living standards, with Chancellor Rachel Reeves backing a third runway at Heathrow last month.\nGatwick, in West Sussex, is Europe's busiest single runway airport, with more than 40 million passengers using it last year.\nOn Tuesday, Alexander told industry leaders aviation was good for economic growth and said she was \"not some sort of flight-shaming eco warrior\".\nThe growth arguments for expanding Heathrow and Gatwick, the UK's two largest airports, differ with the former catering for more freight traffic relating to international goods trade.\nAn extra runway at Gatwick would see capacity increased for holidaymakers and business travellers, particularly for short-haul destinations, as opposed to Heathrow's longer-haul flights.\nGatwick managers have said that with 55 take-offs and landings in a busy hour, the airport is \"full\".\nBeing able to use both runways could increase the number of departures by 50,000 a year by the end of the 2030s, the airport argued.\nIt said some 30,000 of those flights are planned to depart from the north runway which will only be used for departures and not landings.\nBut there is strong opposition to any expansion, particularly from climate campaigners.\nGreenpeace UK policy director Douglas Parr said the extension would not drive economic growth. \"The only thing it's set to boost is air pollution, noise, and climate emissions,\" he added.\nAlex Chapman, senior economist at left-of-centre think tank New Economics Foundation, also argued the move would not create new jobs, but would just shift them from other parts of the country.\n\"People are already perfectly able to catch cheap flights on holiday or travel for business,\" he added.\nUnion Unite general secretary Sharon Graham backed Gatwick having a second runway, but warned it would need \"to come with guarantees of well paid, unionised jobs and proper facilities for workers\".", "url": "https://www.bbc.co.uk/news/articles/cqjdz9q170yo"}