{"authors": ["Max Matza", "www.facebook.com"], "date_download": "2025-04-26 04:07:38", "date_modify": "2025-04-26 04:07:38", "date_publish": "2025-03-02 22:29:46", "description": "Trump named five cryptocurrencies he wanted in a potential national reserve so the US could become \"the Crypto Capital of the World\".", "filename": "news_articles_cn0jgggd7r4o_1745640458.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/47a6/live/d4531390-f7aa-11ef-a6f7-85a91847ab50.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn0jgggd7r4o_1745640458.html", "title": "Crypto prices rally after Trump backs 'crypto reserve'", "title_page": "Crypto prices rally after Trump backs 'crypto reserve' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump has revealed the names of five cryptocurrencies that he says he'd like to be included in a new strategic reserve to make the US \"the Crypto Capital of the World\".\nThe market prices of the five coins he named - Bitcoin, Ethereum, XRP, Solana and Cardano - all swiftly jumped after the announcement.\nDuring Trump's presidential campaign, he aggressively courted the crypto community. The previous US president, Joe Biden, had overseen a crackdown on crypto due to concerns about fraud and money laundering.\nIt is unclear how the new stockpile will work. More information is expected on Friday, when Trump plans to host the first Crypto Summit at the White House.\nIn a social media post on Sunday, Trump said he had signed an order which \"directed the Presidential Working Group to move forward on a Crypto Strategic Reserve that includes XRP, SOL, and ADA\".\nAbout an hour later he added in another post: \"And, obviously, BTC and ETH, as other valuable Cryptocurrencies, will be at the heart of the Reserve.\"\nThe first three coins he named jumped by up to 62% on Sunday.\nBitcoin and Ethereum also jumped by more than 10% each.\nThe posts marked a new upward turn for crypto prices, which had dropped sharply since spiking after his election.\nShortly after taking office in January, Trump signed an executive to create a presidential working group tasked with proposing new crypto laws and regulations.\nThe order called on the group to \"evaluate the potential creation and maintenance of a national digital asset stockpile\" that could use \"cryptocurrencies lawfully seized by the Federal Government through its law enforcement efforts\".\nIt is unclear whether creating a new national strategic stockpile would require an act of Congress.\nTrump had previously been a crypto critic, telling Fox News in 2021 that Bitcoin is a \"scam\".\nBut in recent weeks, both he and his wife Melania Trump have launched their own cryptocurrencies, leading to accusations that they are trying to profit from his White House policies.", "url": "https://www.bbc.co.uk/news/articles/cn0jgggd7r4o"}