{"authors": ["Chloe Aslett", "www.facebook.com"], "date_download": "2025-04-26 07:42:56", "date_modify": "2025-04-26 07:42:56", "date_publish": "2025-02-26 18:52:57", "description": "The Court of Appeal rules Scarborough man Macauley Nesfield's original sentence was unduly lenient.", "filename": "news_articles_cn0j1le28r5o_1745653376.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/3884/live/e24f7670-b2e8-11ef-a6fb-d9b09689a88d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn0j1le28r5o_1745653376.html", "title": "Jail sentence extended for Scarborough abuser who punched woman", "title_page": "Jail sentence extended for Scarborough abuser who punched woman - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A violent man who left a woman and her baby covered in blood after punching her has had his prison term extended after it was ruled his original sentence was unduly lenient.\nMacauley Barry Robert Nesfield, 28, of Eastfield, Scarborough, was jailed in December for two years and three months for controlling coercive behaviour, assault occasioning actual bodily harm and unlawful wounding.\nBut at the Court of Appeal on Wednesday, his sentence was increased to three years after an appeal by North Yorkshire Police's witness care unit.\nNesfield subjected the woman to years of fear and violence between 2021 and 2024 by manipulating situations to control her and physically abusing her, the force said.\nThe case was referred to the Court of Appeal by the Solicitor General after she considered the sentence to be unduly lenient.\nDet Con Kelly Sharp, from North Yorkshire Police, said she was pleased the court agreed with this, following the ruling.\n\"Domestic abuse and violence against women and girls is a serious threat to our society,\" she said.\n\"Today's outcome sends a clear message we will do everything in our power to ensure offenders are taken off the streets for as long as possible.\"\nAt the initial sentencing hearing at York Crown Court in December, Nesfield was also served a five-year restraining order.\nNorth Yorkshire Police confirmed that a number of other offences, including six counts of assault, one of intentional strangulation, and one of criminal damage, were allowed to remain on file.\nListen to highlights from North Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/cn0j1le28r5o"}