{"authors": ["Anisa Kadri", "Zac Sherratt", "www.facebook.com"], "date_download": "2025-04-26 07:27:56", "date_modify": "2025-04-26 07:27:56", "date_publish": "2025-02-27 19:47:08", "description": "Claire Knights's killer Harrison Lawrence Van-Pooss was a \"vast and powerful man\", a court hears.", "filename": "news_articles_cdrxx62edjzo_1745652476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/439a/live/57df6160-f52f-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdrxx62edjzo_1745652476.html", "title": "Dog walker faced knife terror before being killed", "title_page": "Dog walker faced knife terror before being killed - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man used a knife to \"terrify and control\" a dog walker near a Kent beach before killing her, a court has heard.\nClaire Knights, 54, from Upstreet near Canterbury, was found dead between St Nicholas-At-Wade and Minnis Bay in August 2023 after being sexually assaulted.\nHarrison Lawrence Van-Pooss, 21, admitted murdering her at Canterbury Crown Court in December.\nAt the first day of sentencing on Thursday, the prosecution told the same court Van-Pooss had wanted to target a lone female when he attacked Ms Knights and forced her away from a path.\nProsecuting barrister Alison Morgan KC said Van-Pooss was a \"vast and powerful man\" who beat Ms Knights, leaving her with multiple fractures.\nThe court heard there had been no injuries inflicted that could have been caused by the knife.\nIt also heard how Ms Knights' son had found his mother's body \"face down in the dyke\".\nThere were areas of bruising to her neck and thighs, which the prosecution said meant Ms Knights had been sexually assaulted while still alive.\nAt an inquest in September, a coroner said Ms Knights was believed to have died from a blunt force injury and drowning, and that the death had been \"violent or unnatural\".\nThe precise sequence of events leading up to Ms Knights' death was known only to her killer, the prosecution said.\nHowever, Ms Morgan said Van-Pooss told experts he had \"no recollection of parts of the day\".\n\"He has himself said he was under the influence of alcohol at the time of these events,\" she said.", "url": "https://www.bbc.co.uk/news/articles/cdrxx62edjzo"}