{"authors": ["Noor Nanji", "www.facebook.com"], "date_download": "2025-04-26 06:14:40", "date_modify": "2025-04-26 06:14:40", "date_publish": "2025-03-02 00:22:48", "description": "Who will win, what can we expect and what has caused the most controversy this awards season?", "filename": "news_articles_c93kq2kldrqo_1745648080.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ee5a/live/c1f4d430-f602-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c93kq2kldrqo_1745648080.html", "title": "How to watch Academy Awards and who is nominated", "title_page": "How to watch Academy Awards and who is nominated - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Stars, film fans and fashionistas rejoice as the biggest night in the showbiz calendar is here at last - the 97th Oscars.\nSpanish-language musical Emilia Pérez leads the way with 13 nominations, but recently saw its awards chances damaged after offensive historic tweets from its star resurfaced.\nWicked, The Brutalist, Conclave and Anora are also among the top contenders, with the race for best picture too close to call.\nUS comedian Conan O'Brien is presenting the awards from Los Angeles, with the show starting at 16:00 (PT), 19:00 (ET) and midnight (GMT).\nEmilia Pérez, about a Mexican drug lord who changes gender, has 13 nominations in total – including best picture, best actress (Karla Sofía Gascón) and best supporting actress (Zoe Saldaña).\nIt is the most-nominated non-English language film of all time. It's actually a French production, largely set in Mexico, with Spanish as the main language spoken.\nKarla Sofía Gascón's nomination made her the first trans person to be nominated in an acting category (although Elliot Page was nominated for Juno in 2008, before the actor transitioned).\nHowever, the film – which had already caused controversy in Mexico – has been beset by controversy following a social media row involving Gascón.\nEmilia Pérez remains strong in a couple of categories, but it's unlikely to sweep the board in the way Oppenheimer – which also had 13 nominations – did last year.\nChasing down Emilia Pérez with 10 nods is three-and-a-half epic The Brutalist, starring Adrien Brody.\nWicked also has 10 nominations, including for British actress Cynthia Erivo and her co-star Ariana Grande, while Demi Moore has the first Oscar nomination of her career for her role in The Substance.\nMeanwhile, pope selection drama Conclave has eight nominations, including best actor for its British star Ralph Fiennes.\nAll the films above are up for the coveted best picture prize, and are joined by Anora, about a New York stripper who falls for the son of a wealthy Russian.\nThe film, which has six nominations, leapt ahead in the race after a string of precursor wins at the Critics Choice Awards as well as two major guild ceremonies - the Directors Guild of America and Producers Guild of America Awards.\nBut there remains no consensus on what will ultimately win the top prize – with the other contenders for best picture including A Complete Unknown, Dune: Part Two, I'm Still Here and Nickel Boys.\nThis has been an unpredictable awards season, and there could still be plenty of surprises in store.\nIn the best actress category, Moore, 62, is nominated for playing a fading star who swaps her body for a younger and more beautiful version of herself in The Substance.\nBut it's a tight race.\nThere were gasps backstage at the Baftas (where I was) when Anora star Mikey Madison scooped up the best actress prize.\nIt was a big blow to the assumed Oscar momentum for Moore, and an incredible moment for Madison, who was relatively unknown before her role in Anora.\nThis is exactly the type of rags-to-riches story that awards ceremonies love – and the film itself celebrates.\nBest actor may also be up in the air. Adrien Brody is the frontrunner, with his nod for The Brutalist – but Timothée Chalamet is his toughest competition, thanks to his acclaimed portrayal of Bob Dylan in A Complete Unknown.\nLast week, Chalamet's surprise SAG win shook up the race, after his somewhat eccentric awards campaign.\nIf he won, not only would Chalamet halt Brody's winning streak, he would also take Brody's record as the youngest-ever winner of best actor.\nIn the best supporting actor category, Kieran Culkin is the frontrunner for A Real Pain, while Zoe Saldaña is almost certain to win best supporting actress for Emilia Pérez, having taken the trophy at a string of precursor events including the Baftas, SAG Awards and Golden Globes.\nIt's worth noting it's been a decade since the hashtag #OscarsSoWhite started trending, due to the lack of diversity at the 2015 Academy Awards.\nThis year, there are people of colour in both the best actress and best actor categories.\nIn fact, Sing Sing's Colman Domingo is nominated for best leading actor for the second year in a row.\nElsewhere, however, progress remains slow.\nCoralie Fargeat is the only woman to be nominated for best director, for The Substance, out of a field of five.\n\"Has there been progress, yes. Has there been enough? Absolutely not,\" April Reign, LA-based founder of the #OscarsSoWhite movement, told me.\n\"It was never just about the Oscars not being black enough. It was also about gender, age, class, sexuality and geography too.\"\n\"If we're still able to count them on one hand, then we're not there yet.\"\nMost of the nominees will be gracing the red carpet – I'm already betting we'll see more tears and hand holding from Cynthia Erivo and Ariana Grande.\nThere had been a big question mark over whether Karla Sofía Gascón will show up after the row over her past tweets.\nHowever, it's been confirmed she will attend the Oscars ceremony itself – although it remains to be seen if she will walk the red carpet and sit with her co-stars.\nPresenters include Halle Berry, Whoopi Goldberg, Robert Downey Jr, Cillian Murphy, Da'Vine Joy Randolph and Emma Stone.\nThis year's Oscars race has played out against the grim backdrop of devastating wildfires in Los Angeles.\nThe nominations themselves were postponed twice due to the fires.\nThere's no doubt it's going to be hard for the awards to strike the right tone when so many people are suffering. It doesn't sit well with celebrities flaunting their wealth on the red carpet.\nCancelling the whole event, however, was \"never on the table,\" according to Lynette Howell Taylor, an LA-based British film producer and member of the Academy's board of governors, who lost her own house in the fires.\nShe told me there would \"definitely be recognition of what the city has gone through\" during the ceremony, with clear signposting of support mechanisms and ways to donate.\n\"But ultimately the show will be about the celebration of the movies of the year, like it is every year,\" she said.\nThe 2025 Oscars will air live on Sunday 2 March from the Dolby Theatre in Hollywood, where the ceremony has been held since 2002.\nThe show can be watched in the US on ABC and can be streamed on Hulu. It is also being broadcast around the world in more than 200 territories.\nUK viewers can watch on ITV and ITVX from 22:30 GMT.\nCynthia Erivo is the first black British woman to receive two Oscar nominations for acting, after also being nominated for Harriet in 2020.\nIf she wins best actress this time, for playing Elphaba in Wicked, she'll become an EGOT - having completed the set of Emmy, Grammy, Oscar and Tony awards.\nRalph Fiennes is flying the flag in the best actor category with his first nomination for 28 years. He's recognised for playing a cardinal who oversees the selection of a new Pope in Conclave.\nElsewhere, Felicity Jones is nominated for best supporting actress for The Brutalist - a decade after her first Oscar nomination - while Sir Elton John is in the best original song race.\nThe country will also be rooting for two more screen legends - Wallace and Gromit (and their makers Aardman Animations), who are hoping for their fourth Oscar. They are shortlisted for best animated feature for their latest outing, Vengeance Most Fowl.", "url": "https://www.bbc.co.uk/news/articles/c93kq2kldrqo"}