{"authors": ["Mike McBride", "www.facebook.com"], "date_download": "2025-04-26 03:51:22", "date_modify": "2025-04-26 03:51:22", "date_publish": "2025-03-05 11:58:06", "description": "A Derry councillor says criteria within the fund makes it more difficult for council-owned grounds.", "filename": "news_articles_cvgp8v21j97o_1745639482.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f73/live/263f42f0-f9bd-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cvgp8v21j97o_1745639482.html", "title": "Derry and Strabane council seek Football Fund deadline extension", "title_page": "Derry and Strabane council seek Football Fund deadline extension  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derry City and Strabane District Council have written to Communities Minister Gordon Lyons seeking an extension to the Northern Ireland Football Fund deadline.\nThe council owns the Ryan McBride Brandywell Stadium, which is the home ground of League of Ireland side Derry City FC.\nSinn Féin councillor Christopher Jackson has expressed concerns over what he believes is \"unequal treatment\" within the criteria of the funding application, which he said negatively impacts council-owned grounds.\nIn order to be granted a share of the £36.2m funding, clubs must demonstrate that they will contribute at least 5% of the total project costs, but for council-owned grounds, this rises to 40%.\nThe Northern Ireland Football Fund dates back to 2011, when it was called the Sub-Regional Stadia Programme.\nThe aim of the fund is to improve sporting facilities for players and fans. The fund is open to 41 clubs in total in the men's and women's game.\nThey are all members of the Northern Ireland Football League (NIFL) or League of Ireland who play their home matches at a venue located in Northern Ireland.\nThe clubs can apply for one of three categories of grants:\nProjects with a total cost of up to £1.5m\nUp to £6m\nMore than £6m\nThe council has now written to Minister Gordon Lyons asking that the deadline for applications for funding be extended beyond March 14.\nSpeaking to BBC News NI, councillor Jackson said the council has been left in \"a completely unrealistic position\", which could negatively impact the completion of stadium projects, like the Mark Farren Stand in the Lone Moor Road ground.\nWork on a new stand at the Brandywell, which is named after former player Mark Farren, began in 2018 as part of a £7m redevelopment.\nHowever, the second phase of that project has still not been built despite planning permission already being granted.\nCouncillor Jackson said asking council to come up with that substantial sum of money within a matter of weeks, in order to meet the 40% criteria, may not be achievable, due to budget limitations.\n\"The business case for Stage Two of the Mark Farren Stand, for example, has been in place for a very long time and we have been working under the premise of that 5% figure, but when we heard it was 40% for council-owned grounds - that was a real shock,\" he said.\n\"This council, like many other councils, is working within a very limited budget and that budget that was already set when we struck the district rate earlier this year, so we have now been left really on the back foot with this.\"", "url": "https://www.bbc.co.uk/news/articles/cvgp8v21j97o"}