{"authors": ["Carmelo Garcia", "www.facebook.com"], "date_download": "2025-04-26 03:51:02", "date_modify": "2025-04-26 03:51:02", "date_publish": "2025-03-05 12:11:09", "description": "Two ccouncils jointly own Gloucestershire Airport and it was put up for sale in October last year.", "filename": "news_articles_cdjyxdv48wko_1745639462.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/27ac/live/5894ffc0-f9a3-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cdjyxdv48wko_1745639462.html", "title": "Airport's £25m sale to wipe debt to two councils", "title_page": "Gloucestershire Airport's £25m sale to wipe debt to two councils - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Part of the income from the sale of a £25m airport will be used to pay off any outstanding debts to two councils from a recent refurbishment of the site.\nGloucester City and Cheltenham Borough councils jointly own Gloucestershire Airport and it was put up for sale in October last year.\nIn 2021, the two councils borrowed £7.5m to revamp the 350-acre (142-hectare) site, which included closing one of three runways to make way for a new business park.\nGloucester City Council leader Jeremy Hilton confirmed the decision at its budget meeting last week.\nThe airport generated about £3.5m in operational income last year, the Local Democracy Reporting Service said, adding two business parks there made more than £1.2m per year.\nHilton said remaining income from the sale would be shared equally between the two councils once the debts had been wiped.\nHe added the deadline for first-stage bids for the property and business closed on 27 January.\n\"One of the conditions is that we expect the applicants to put in a proper business plan and investment plan in order to deliver further success for the airport,\" Hilton said.\n\"Any capital we see is shared fifty-fifty between Gloucester City Council and Cheltenham Borough Council.\n\"And any debts that the airport owes will be the first to be paid off and there's a loan for the runway.\"\nThe airport is mainly used for private and commercial flights, training and clubs - and brings in more than £50m each year to the local economy.", "url": "https://www.bbc.co.uk/news/articles/cdjyxdv48wko"}