{"authors": ["Julia Breens", "www.facebook.com"], "date_download": "2025-04-26 04:28:22", "date_modify": "2025-04-26 04:28:22", "date_publish": "2025-03-02 09:35:09", "description": "Councillors have voted to approve the development which received nine objections.", "filename": "news_articles_cd920dwnwqdo_1745641702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/303d/live/578c7950-f746-11ef-9f40-e95ad80c0062.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd920dwnwqdo_1745641702.html", "title": "New 135-home housing estate approved in Market Bosworth", "title_page": "New 135-home housing estate approved in Market Bosworth - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A 135-home estate has been given the go ahead for a Leicestershire town.\nThe homes will be built on land off Station Road in Market Bosworth after Hinckley and Bosworth Borough Council's planning committee approved the application.\nAccording to the plans, the estate will include 13 one-bed homes, 45 two-beds, 52 three-beds and 25 four-bedroom properties.\nDespite nine objections to the scheme, councillors voted to approve it, with one parish councillor praising it as a \"quality development\".\nThe scheme by housebuilder Miller Homes also includes 1.3 acres of employment land which will be built on fields opposite the former Kyngs Golf and Country Club.\nA 50-room hotel is also set to be built on the land after Statue Homes received planning permission last year, the Local Democracy Reporting Service (LDRS) said.\nThe LDRS said two houses would be demolished to provide an access from Station Road and some existing commercial buildings would also be bulldozed to make way for the development.\nMarket Bosworth parish councillor John Wasteney supported the plans.\nHe said Market Bosworth needed a development \"in keeping with the rural settlement\".\n\"This quality development before you has met all of those criteria that were in the plan,\" he added.\nBorough councillor Brian Sutton said he thought it was a good development but added the town was \"desperate for a larger doctors' surgery\".\nSection 106 financial contributions have yet to be agreed with the developer but a report presented to councillors said £104,000 would be sought towards Market Bosworth or Newbold Verdon surgeries, the LDRS said.", "url": "https://www.bbc.co.uk/news/articles/cd920dwnwqdo"}