{"authors": ["Ben Mellor", "www.facebook.com"], "date_download": "2025-04-26 07:05:46", "date_modify": "2025-04-26 07:05:46", "date_publish": "2025-02-28 06:22:59", "description": "Gary Siddons, who uses a wheelchair, wanted to start an inclusive group after taking up the sport.", "filename": "news_articles_c3e41z7q0dwo_1745651146.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0d18/live/7dead5e0-f3bf-11ef-9843-25877e801f1e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c3e41z7q0dwo_1745651146.html", "title": "'Darts star Luke Littler inspired me to play", "title_page": "'Darts star Luke Littler inspired me to play - now I run a club' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Watching Luke Littler, his incredible feats over the last 12 months at his age, it really captures the imagination,\" says Gary Siddons.\nIt was Littler's rise to fame after reaching the 2024 World Darts Championship at the age of 16 that inspired the 53-year-old from Loughborough, in Leicestershire, to take up the sport himself.\nMr Siddons, who has been paralysed from the waist down since birth due to spina bifida and uses a wheelchair, started playing in December and then came up with the idea of running an inclusive darts club.\nHis inspiration, Littler, went on to become the youngest ever world championship winner in January, aged 17.\n\"I knew there would be other people who had been inspired who wouldn't necessarily want to go to a pub, or couldn't [play] at home, so it was about setting up a social place where they could,\" he explained.\n\"I just found him quite inspiring with his age, his attitude and his calmness doing what he was doing,\" Mr Siddons said.\n\"I've always been in and around sport, I was perhaps looking for something new, so I thought this is something I could get into.\"\nWith the help of friends and volunteers, Mr Siddons turned his idea of creating an inclusive club into a reality in under eight weeks and the first Darts for All event took place at John Storer House, in Ward's End, on Tuesday.\nAbout 50 people attended and played using donated darts and flexiboards - the height of which can be adjusted to suit the player.\n\"It's a pinnacle really,\" says Danny Higgins, who was born with half of his spine missing and uses a wheelchair.\nThe 30-year-old, from Leicester, added: \"It feels 100 times better to be able to pull that board down and get my own darts, it's a nice feeling and something I've always wanted to achieve.\"\nMr Siddons said the sessions were \"not just about darts\", and added \"it's about getting people out of home and out in the community\".", "url": "https://www.bbc.co.uk/news/articles/c3e41z7q0dwo"}