{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 06:34:57", "date_modify": "2025-04-26 06:34:57", "date_publish": "2025-02-27 06:17:36", "description": "Lorna Hayes began training her Crufts winning dog Nora when her arthritis left her in a wheelchair.", "filename": "news_articles_c20lpdpze6eo_1745649297.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1fa6/live/904efa70-f42f-11ef-90ba-27e0e506a6c8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c20lpdpze6eo_1745649297.html", "title": "Crufts dog Nora 'made me smile when I didn't have anything else'", "title_page": "Crufts dog Nora 'made me smile when I didn't have anything else' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman who had to use a wheelchair after being diagnosed with arthritis has described how training her Crufts-winning dog made her smile when she \"didn't have anything else to smile for\".\nLorna Hayes from East Budleigh, Devon, was in chronic pain after developing arthritis in 2019, but said training her Border Collie Nora gave her a reason to get up in the morning and \"fight through the pain\".\nThe pair began a dog dancing class which developed into a routine that eventually took them to Crufts, where they won the heelwork to music freestyle final in 2024.\nMs Hayes described Nora as her \"little star\" and said the dog \"saved her life\" at a time when she was close to giving up.\nLISTEN: Lorna Hayes speaks to BBC Radio Devon's John Acres\n\"She made me smile when I didn't have anything else to smile for,\" said Ms Hayes.\n\"Not being able to walk very well and having a collie, they're really active, they need to use their brains so we would sit on the couch with some treats and teach her some tricks.\n\"When you can't put a sock on and you're crying, your dog coming up soon and doing a fun trick, there is nothing better in the day in all honesty\"\nMs Hayes had never owned or trained a dog before Nora and said winning at Crufts was down to her being \"a very clever little dog\".\n\"I was definitely crying in both the finals,\" she said.\n\"The tears definitely come from basically being able to show the world how amazing I know she is.\"\nNora and Ms Hayes have been training since September to defend their title when Crufts returns next month. , external\n\"It's a completely new routine as you're not allowed to do the same routine you did in previous years,\" said Ms Hayes.\n\"Obviously the aim is to win, we would love to win and defend the title, but the fact we are on that green carpet of Crufts again, if we go out and just have fun that's the main aim for us.\"", "url": "https://www.bbc.co.uk/news/articles/c20lpdpze6eo"}