{"authors": ["Charlie Buckland", "www.facebook.com"], "date_download": "2025-04-26 08:12:44", "date_modify": "2025-04-26 08:12:44", "date_publish": "2025-02-26 11:49:06", "description": "The women fell while on Glyder Fach and Tryfan, say Ogwen Valley Mountain Rescue Team.", "filename": "news_articles_c07zk2ez47jo_1745655164.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5820/live/93c4c470-f428-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c07zk2ez47jo_1745655164.html", "title": "Two women die in separate mountain accidents", "title_page": "Eryri National Park: Two women die in separate mountain accidents - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Two women have died in separate accidents in Eryri National Park in the past 10 days.\nMaria Eftimova, 28, a University of Salford student from Bulgaria, fell about 65ft (20m) while ascending Tryfan mountain on February 22.\nA walker also slipped on a patch of grass and fell approximately 32ft (10m) on 16 February while hiking Glyder Fach, Ogwen Valley Mountain Rescue Organisation said.\nThe rescue team said: \"The thoughts of all involved are with the casualties' families and friends, thank you to all the members of the public who tried to help.\"\nOn 16 February a couple were descending the main face of Glyder Fach when the woman slipped on a patch of grass and fell.\nHer partner also fell while trying to reach her and suffered head and wrist injuries but managed to call for help and began CPR, a rescue spokesperson said.\nIn a statement, they added an air ambulance was unable to access the couple so they were reached by rescue teams on foot, but the woman did not survive.\nThe second woman, Maria Eftimova, was part of a group and fell around 65ft into steep terrain while ascending the north-ridge of Tryfan mountain on 22 February, which stands at at 917m (3,010ft).\nPassersby with climbing equipment abseiled down to make Ms Eftimova safe, while a nearby team member started CPR, according to the rescue team.\nMs Eftimova died from her injuries and she was brought down to the mountain rescue base.\nMegan Griffiths, Ms Eftimova's best friend said she was so thankful to Maria's friends, crew, and the Ogwen Valley Mountain Rescue team for their efforts to save her.\nShe added: \"Maria was a one of a kind person who lived life to the fullest - not only adventurous and free-spirited but also incredibly kind, intelligent, and selfless.\n\"Her tragic loss will be felt by so many, and we are absolutely devastated to lose such a precious friend.\"\nAnother friend, Victoria Critchley said: \"Maria was an ambitious, bright and cherished, whose vibrant personality, energy and aura touched and uplifted all around her.\n\"She had a passion for engineering, having studied civil engineering at the University of Salford and a love for extreme sports.\n\"Her biggest passion being snowboarding, which she was super excited for and looking forward to doing again on her upcoming trip to Austria.\n\"She had an insatiable thirst for life and exploring our world's beauty.\n\"Tragically, she was taken from her family far far far too soon.\n\"Words cannot express the devastation her family and our community are experiencing.\"\nMs Critchley said adding to their immense grief, the family, who reside in Bulgaria, faced a significant financial burden to repatriate Maria to \"give her the dignified farewell with her loved ones that she deserves\".\nTryfan is often described as a peak that marks the line between hiking and mountaineering and is difficult to navigate in a traditional manner, especially in poor weather.\nWith no marked footpaths to the summit, it requires using hands and scrambling skills to reach the top.\nIt was used as a training ground to test oxygen equipment and safety techniques before the first ever successful climb of Everest in 1953.\nChris Lloyd, chairman of Ogwen Valley Mountain Rescue Organisation, has encouraged people to \"check the weather forecast and make sure you are suitable equipped\" before venturing on the mountains.\nSpeaking to BBC Radio Wales Breakfast, Mr Lloyd said: \"The amount of times we are called because people have been caught out by darkness because they didn't bring a torch with them even though it's a really simple thing.\"\nHe said there is still snow on the top of the mountains at 3,000ft and described the rocks during the day as \"greasy\" due to damp in the air.", "url": "https://www.bbc.co.uk/news/articles/c07zk2ez47jo"}