{"authors": ["Sarah Rainsford", "www.facebook.com"], "date_download": "2025-04-26 06:41:51", "date_modify": "2025-04-26 06:41:51", "date_publish": "2025-03-02 12:12:56", "description": "Pope Francis is unable to deliver his traditional Angelus prayer in person, with the Vatican publishing a text.", "filename": "news_articles_c2kgqdkx9jxo_1745649711.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c577/live/83b4bf00-f75b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c2kgqdkx9jxo_1745649711.html", "title": "Pope absent from St Peter's Square for third week", "title_page": "Pope absent from St Peter's Square for third week running - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "For the third week in a row, Pope Francis has been unable to deliver his traditional Angelus prayer in person, with the Vatican publishing his written comments instead.\nVatican officials said the text, sent from his hospital room in Rome, had been written \"in the past few days\". In it, the Pope thanked people for their prayers and thanked his medical team for their care.\n\"I feel in my heart the 'blessing' that is hidden within frailty, because it is precisely in these moments that we learn even more to trust in the Lord,\" he wrote.\n\"At the same time, I thank God for giving me the opportunity to share in body and spirit the condition of so many sick and suffering people.\"\nThe Pope usually makes his address from a window of the official Vatican appartments, drawing a crowd below on St Peter's Square.\nMany Catholics come specially for the chance to see him but this is now the longest Pope Francis has been out of the public eye since he was elected.\nEach evening on the square, a group of cardinals lead people in prayers for his health.\nIn his latest written address, the Pope told Catholics that he felt their \"affection and closeness\" and felt \"carried and supported by all God's people\".\nThe Vatican said he remained stable on Sunday, although doctors still describe his overall condition - with pneumonia - as \"complex\" and the risk of another infection is high. After 16 days in hospital, they are still giving no prognosis.\nThe medical team has not spoken directly to journalists for over a week, and all updates are coming via Vatican officials.\nOn Sunday, they said the Pope no longer required \"non-invasive mechanical ventilation, only high-flow oxygen therapy\".\nHe does not have a fever and was able to participate in mass in a chapel on the 10th floor of Rome's Gemelli hospital where he is being treated.\nThe Pope also received two visitors - Vatican Secretary of State Cardinal Parolin and his deputy Monsignor Pena Parra. They are the first to be mentioned by the Vatican in almost a week.\nThere are no details about the length of time the men spent with him or what was discussed.\nThe latest details do suggest that the Pope has rallied somewhat since Friday, when he suffered a second breathing \"crisis\" which doctors had worried might have a lasting impact. It was the second time the word \"crisis\" had been used since he was admitted to hospital on 14 February.\nBy Sunday, though, Vatican sources were more reassuring.\n\"The Pope woke, had breakfast with coffee, continued his therapy and read the newspapers as he usually does,\" they told journalists.\nIn his Sunday Angelus, the Pope prayed for peace, including in \"tormented Ukraine, Palestine, Israel\", adding: \"From here, war appears even more absurd.\"\nAlways outspoken against war, some of the Pope's previous comments on Ukraine have nevertheless created controversy.\nHe suggested that Russia's full-scale invasion was \"somehow provoked\" and on one occasion agreed that Kyiv should show \"the courage of the white flag\" and negotiate for peace.", "url": "https://www.bbc.co.uk/news/articles/c2kgqdkx9jxo"}