{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 07:06:47", "date_modify": "2025-04-26 07:06:47", "date_publish": "2025-02-28 06:12:31", "description": "Part of the Gloucestershire Cycle Spine, the work in Gloucester City Centre will start in March.", "filename": "news_articles_c798d4j1r07o_1745651207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/95c3/live/156dbc30-f432-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c798d4j1r07o_1745651207.html", "title": "Work to Gloucester City Centre phase of £48m cycle route to begin", "title_page": "Work to Gloucester City Centre phase of £48m cycle route to begin - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work on the next phase of a new £48m cycling and walking route is set to begin in March.\nPart of the 26-mile (42km) Gloucestershire Cycle Spine, the work in Gloucester City Centre will start on 10 March and is expected to be finished by late autumn.\nThe cycle spine will connect Bishops Cleeve in the north to Stroud in the south, also linking Gloucester and Cheltenham.\nCouncillor David Gray, cabinet member for environment, economy and planning, said the city centre section of the route was \"an essential part\" of the scheme and would \"significantly improve walking and cycling options for people\".\nHe also said it would \"help to reduce carbon emissions and encourage active travel\".\nThe work, carried out by contractors Montel Civil Engineering Ltd, will include cycle routes on Northgate and Southgate Street - from Parliament Street to the Tall Ship pub.\nIt will also include building the Llanthony access road between Sudmeadow Road and Hemmingsdale Road in the city, which will begin later in the spring and will complete the Gloucester South West Bypass project.\nAnyone who has an interest in the project, or any questions, is being encouraged to attend a \"meet the contractor\" event at St John's Lane Northgate Methodist Church on Wednesday.", "url": "https://www.bbc.co.uk/news/articles/c798d4j1r07o"}