{"authors": ["Tiffanie Turnbull", "www.facebook.com"], "date_download": "2025-04-26 03:38:15", "date_modify": "2025-04-26 03:38:15", "date_publish": "2025-03-05 00:27:03", "description": "Australian police have been investigating the video, which circulated widely online and caused public outcry.", "filename": "news_articles_cpv4jd7nje3o_1745638695.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0f9d/live/286fc4b0-f953-11ef-b1ae-4bdcb430a526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpv4jd7nje3o_1745638695.html", "title": "Second nurse charged over video threatening Israeli patients", "title_page": "Second nurse charged over video threatening Israeli patients - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A second Sydney nurse who allegedly appeared in a video that made threats towards Israeli patients has been charged by police.\nAhmad Rashad Nadir, 27, and Sarah Abu Lebdeh, 26, were both suspended from their duties at Bankstown Hospital in February after the video was released online. It was filmed on an anonymous online platform which pairs people randomly for a chat.\nAuthorities say there is \"no evidence\" the pair actually harmed patients.\nMr Nadir was charged on Wednesday with using a carriage service to threaten, menace or harass, and with possessing a prohibited drug.\nCarriage services refer to modern communication systems such as phones and the internet.\nMs Lebdeh was charged last week with three offences: threatening violence to a group, using a carriage service to threaten to kill, and using a carriage service to harass or cause offence.\nNeither person has entered a plea to the charges, but Mr Nadir apologised last month through his lawyer.\nIn the footage, which appeared to have been filmed inside a hospital and was published by an Israeli content creator, Ms Abu Lebdeh and Mr Nadir allegedly bragged about refusing to treat Israeli patients, killing them, and said they would go to hell.\nThe video spread widely online and caused public outcry, with Prime Minister Anthony Albanese describing it as \"disgusting\" and \"vile\".\nEarlier this month Australia passed tougher laws against hate crimes following a wave of unrelated antisemitic attacks.\nIn recent months, there have been a series of arson and graffiti incidents involving homes, cars, and synagogues in Jewish communities across Australia.\nThere have also been rising incidents of islamophobia. A Western Australian teenager was charged on Wednesday after allegedly threatening to launch a Christchurch massacre-inspired attack on a Sydney mosque.", "url": "https://www.bbc.co.uk/news/articles/cpv4jd7nje3o"}