{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:22:55", "date_modify": "2025-04-26 04:22:55", "date_publish": "2025-03-03 13:26:04", "description": "An increase in shoplifting and drug trafficking contributes to a rise in crime across Oxfordshire.", "filename": "news_articles_cge1g04g941o_1745641375.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/119f/live/508074e0-f82c-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cge1g04g941o_1745641375.html", "title": "Oxfordshire crime grew by 1.5% in last year, police stats show", "title_page": "Oxfordshire crime grew by 1.5% in last year, police stats show - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "An increase in shoplifting and drug trafficking contributed to a rise in crime across Oxfordshire over the past year.\nCrime in the county rose by 1.5% between April 2024 and January 2025 compared to the previous year, according to figures released by Thames Valley Police (TVP).\nThe steepest rise was in the robbery of business properties, which jumped by 200% compared with the previous year.\nThames Valley Police and Crime Commissioner (PCC) Matthew Barber said the \"general crime trend\" in Oxfordshire was \"downwards\".\n\"Some types of crime have gone up, as reporting has also increased, which I have encouraged and that resulted in more criminals being brought to justice,\" he said.\nHe said TVP had \"invested heavily\" in tackling shoplifting and robberies of business premises, and \"as a consequence there is confidence that these crimes should be reported and dealt with and that the policies we put in place have been effective\".\n\"There is more work to do, and that's why I have been encouraging people to report crime and anti-social behaviour in their communities, so action can be taken,\" the PCC added.\nThe statistics show the number of drug trafficking offenses across the county doubled over the period.\nShoplifting also rose by a third.\nTVP launched a new Retail Crime Strategy, developed jointly with retailers and businesses, aimed at tackling the offenses in January last year.\nAs part of the strategy, the force launched a free app called Disc, which allows retailers to report and access information about crimes such as shoplifting and anti-social behaviour.\nMr Barber said the strategy had contributed to a the number of charges for shoplifting offences doubling in the Thames Valley.\nAlthough the force statistics show a general increase in the number of crimes reported, some offences decreased.\nOne of the biggest falls was in vehicle thefts, with a 20% drop compared to the previous year.", "url": "https://www.bbc.co.uk/news/articles/cge1g04g941o"}