{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:52:12", "date_modify": "2025-05-19 14:52:12", "date_publish": "2015-02-01 07:35:21", "description": "A British woman, sentenced to death for drug smuggling in Bali, has written to the UK government asking for legal help or funding for an appeal.", "filename": "news_uk-31080056_1747666332.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/65428000/jpg/_65428488_l3qrjgzt.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31080056_1747666332.html", "title": "Lindsay Sandiford: 'Time on death row is running out'", "title_page": "Lindsay Sandiford: 'Time on death row is running out' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A British woman, sentenced to death for drug smuggling in Bali, has written to the UK government asking for legal help or funding for an appeal.\nLindsay Sandiford, 57, from Cheltenham, says time is running out and she could be executed within a few weeks.\nThe Foreign Office said it stood \"ready to provide support at this difficult time, if requested\".\nSandiford was found with cocaine worth an estimated £1.6m when she arrived in Bali from Thailand in May 2012.\nSandiford, who faces death by firing squad, claims she was forced to transport the drugs to protect her children, whose safety was at stake.\nIn a letter passed to the BBC, Sandiford appealed to UK Foreign Secretary Philip Hammond, who is due to visit Indonesia this month.\nShe said she currently had no legal representation and could not afford to pay for a lawyer, which meant she had been denied the opportunity to fully challenge her death penalty and the right to file for clemency.\nShe also said she had received little or no help from the Foreign Office since her arrest.\nSandiford said there was a risk the Indonesian authorities might interpret this as a lack of commitment by the government to her case.\nThe Foreign Office said it had consistently provided and offered consular support to Sandiford, which she currently declined to accept.\n\"We are closely following Lindsay Sandiford's case in Indonesia. We stand ready to provide support at this difficult time, if it is requested,\" said a spokesman in the British embassy in the Indonesian capital Jakarta.\n\"The UK strongly opposes the death penalty in all circumstances without exception. We have made representations about the death penalty to the Indonesian government, and we will continue to do so.\"\nLast year, Sandiford challenged the UK's government's policy not to fund Britons facing capital charges abroad.\nAlthough the UK's top court dismissed the appeal, the judges called on the government to look at her case \"urgently\".\nThe Supreme Court's written ruling said \"the local courts seem to have ignored the substantial mitigating factors in her case\".\nThe judges cited age, mental problems, lack of previous criminal record and co-operation with police.\nThey said there was a \"remarkable disparity of her sentence with those members of the syndicate whom she helped to bring to justice\".\nThe BBC's Karishma Vaswani said Indonesia had some of the toughest drug laws in the world, and last month it executed six people - including five foreigners - on drug related offences.\nIndonesian President Joko Widodo had recently declared he would reject all clemency appeals from drug convicts, she added.", "url": "https://www.bbc.com/news/uk-31080056"}