{"authors": ["Mick Lunney", "www.facebook.com"], "date_download": "2025-04-26 06:42:34", "date_modify": "2025-04-26 06:42:34", "date_publish": "2025-03-02 11:26:51", "description": "Up to £400m of investment could come to Doncaster due to the area's regeneration, the council says.", "filename": "news_articles_c8x44grvn4go_1745649754.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8be0/live/eacc2cc0-f4fc-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8x44grvn4go_1745649754.html", "title": "Doncaster waterfront clean-up work gets under way", "title_page": "Doncaster waterfront clean-up work gets under way - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Work has begun to transform an area of Doncaster city centre into an open space ready to be used for future development.\nThe clean-up work for the Doncaster Waterfront project is being carried out on a 22 acre (89,000 sq m) brownfield site off Chappell Drive, which, among other uses, was once a gas works and a cattle farm.\nIt was hoped that up to £400m of investment could eventually come to Doncaster through the redevelopment of the waterfront, the council said.\nRos Jones, Mayor of Doncaster, said it was \"an incredibly important strategic site to the city\".\nDoncaster Council has previously said the aim of the watefront regeneration was to create high quality open spaces, including a marina and a public square, to provide new leisure, retail, civic and other uses.\nThe area already includes Doncaster College Hub and university centre.\nDoncaster has received £18.6m of Levelling Up money from central government for a range of work in the city, including the waterfront project.\nJones said the area, one of the biggest brownfield sites in an urban centre in the north of England, had much potential.\n\"With 22 acres of land and easy access to the city centre, Doncaster markets, rail network and establishments such as the colleges and the civic and cultural quarter, it is an incredibly important strategic site to the city\", she said.\nDue to the work, drivers have been advised that part of the Chappell Drive East car park had been closed.\nHowever, the council said that 350 spaces were still available there, along with the Chappell Drive West and Church Way car parks.\nListen to highlights from South Yorkshire on BBC Sounds, catch up with the latest episode of Look North or tell us a story you think we should be covering here, external.", "url": "https://www.bbc.co.uk/news/articles/c8x44grvn4go"}