{"authors": ["Khanyisile Ngcobo", "www.facebook.com"], "date_download": "2025-04-26 07:50:42", "date_modify": "2025-04-26 07:50:42", "date_publish": "2025-02-25 15:36:22", "description": "Donald Trump has been raising the alarm over the number of white farmers killed in the country.", "filename": "news_articles_cwyj1198wy3o_1745653842.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/33f5/live/7f37eac0-f37c-11ef-958e-8b9bf28c4572.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cwyj1198wy3o_1745653842.html", "title": "White genocide in South Africa: Court rules claims 'not real'", "title_page": "White genocide in South Africa: Court rules claims 'not real' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Trump has referred to the \"large-scale killing of farmers\" in South Africa, while Musk has condemned what he said were \"racist ownership laws\" and previously condemned the \"genocide of white people\".\nDespite vowing to crack down on immigration, Trump has said that white South African farmers would be allowed to settle in the US as refugees because of the persecution he said they faced.\nMusk was born and grew up in South Africa before moving to the US.\nThe court action was brought by Mr Gray's four siblings, who are also trustees and beneficiaries of the family trust.\nIn it, they claimed that their brother had become \"obsessed with the idea of an impending genocide of white people in South Africa\" in the last 10 years of his life.\nHe died in March 2022.\nMr Gray, who was paralysed following an accident aged 26 while doing military service, had also become paranoid, believing the supposed \"genocide\" would occur soon.\n\"That idea was further fuelled by his already present racism and the online content that he was exposed to,\" Judge Rosheni Allie summarised in a 15 February ruling that has just come to light.\nMr Gray first met members of the Boerelegioen in 2020 and allegedly gave them about $326,000 (£258,000) in gold coins to help fund their cause and gain membership of the racist group.\nThe Boerelegioen describes itself as a \"civil defence movement that enables citizens to resist the promised slaughter of whites in RSA [Republic of South Africa] as well as the theft of their property\".\nMr Gray subsequently made the organisation a beneficiary to his estate, specifying that a portion of the money go towards the various training programmes the group ran.\nBut because there were three entities all bearing the Boerelegioen name, the court found that Mr Gray's bequest made was \"vague concerning which entity was the intended beneficiary\" of his will.\n\"The only expression of the [Mr Gray's] intention that is evident is the intention for the funds to be used for 'training' as well as [his] own assertions that he wanted the funds used to benefit an organisation which he deemed to be one which will exterminate every black person in South Africa and will be used to defend or ward off a white genocide, which is clearly imagined and not real,\" Judge Allie said.\nOn the public policy issue, Mr Gray's siblings contended that Boerelegioen wanted to use the funds to \"further... its messages of racial hatred and separation\".\nBoerelegioen says it simply provides security and training services to communities and does not exclude anyone on the basis of race, gender or religion.\nJudge Allie ruled in favour of the siblings and ordered Boerelegioen to pay the costs in the court case.\nEarlier this month, Trump signed an executive order freezing financial aid to the country over a new law allowing for land seizures by the South African government under certain circumstances.\nThe status of white South African farmers has long been a rallying cry on the right and far-right of American politics.\nBut despite numerous claims in the past of the systematic targeting of the country's white Afrikaner minority group, local crime statistics figures paint a different picture.\nSouth Africa does not release crime figures based on race but the latest figures revealed that 6,953 people were murdered in the country between October and December 2024.\nOf these, 12 were killed in farm attacks. Of the 12, one was a farmer, while five were farm dwellers and four were employees, who are likely to have been black.\nIn contrast, 961 women were murdered alongside 273 children.", "url": "https://www.bbc.co.uk/news/articles/cwyj1198wy3o"}