{"authors": ["Yasmin Rufo", "www.facebook.com"], "date_download": "2025-04-26 04:26:06", "date_modify": "2025-04-26 04:26:06", "date_publish": "2025-03-03 11:39:59", "description": "The TV presenter left the show in 2021 over his controversial comments about the Duchess of Sussex.", "filename": "news_articles_c1d4e9rd5ywo_1745641566.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f15/live/35b2bf80-f825-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1d4e9rd5ywo_1745641566.html", "title": "Piers Morgan returns to Good Morning Britain after almost four years", "title_page": "Piers Morgan returns to Good Morning Britain after almost four years - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Piers Morgan has returned to Good Morning Britain almost four years after he left ITV over controversial comments about the Duchess of Sussex.\nThe 59-year-old re-joined his former co-presenter Susanna Reid and Ed Balls on the show to discuss his recent conversation with US President Donald Trump.\nThe TV presenter walked off the morning programme on 8 March 2021 after he said he did not believe claims made by Meghan Markle during her and Prince Harry's interview with Oprah Winfrey.\nOn Monday morning, Morgan started his interview saying: \"Hang on, are we just going to ignore the fact I haven't been here for 1,453 days?\"\nHe then tried to give Reid a hug, which she rejected, saying: \"No, I don't want a hug.\"\nFormer MP Balls offered to hug Morgan, saying: \"We don't mind hugging.\"\nMorgan also remarked to Reid that she had \"moved on so fast\" to a new co-presenter, to which she replied: \"I've got a couple of new husbands now.\"\nBalls assured Morgan that she did not hug him either, to which Reid responded: \"No, I don't do hugs, as you know.\"\nLaunching into the interview, Morgan said he had a phone call with Mr Trump on Friday ahead of the US president's clash with Ukrainian president Volodymyr Zelensky on Friday.\nHe said Mr Trump had been in an \"upbeat mood\" on the call where they had discussed numerous topics including Ukraine.\n\"I've had screaming matches with him, literally, and then an hour later, we're laughing and joking, doing a fun interview.\n\"So I always think with him, focus on what he does, not what he says, or the general drama and chaos.\n\"And secondly, understand that this is almost uniquely in modern times, a Republican president in America who wants peace, not war.\"", "url": "https://www.bbc.co.uk/news/articles/c1d4e9rd5ywo"}