{"authors": ["Becky Morton", "www.facebook.com"], "date_download": "2025-04-26 03:58:14", "date_modify": "2025-04-26 03:58:14", "date_publish": "2025-03-04 13:16:23", "description": "The US vice-president faces criticism after saying troops from \"some random country\" will not deter Russia.", "filename": "news_articles_czx7w7q7qzro_1745639894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1bd9/live/ba2e4110-f953-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czx7w7q7qzro_1745639894.html", "title": "Anger over JD Vance 'random country' peacekeeping remark", "title_page": "Anger over JD Vance 'random country' peacekeeping remark - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The US vice-president has sparked a row with his comments about a potential peacekeeping force in Ukraine.\nUK opposition politicians accused JD Vance of disrespecting British forces after he said a US stake in Ukraine's economy was a \"better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years\".\nThe UK and France have said they would be willing to put troops on the ground in Ukraine as part of a peace deal.\nVance has since insisted he did not \"even mention the UK or France\", adding that both had \"fought bravely alongside the US over the last 20 years, and beyond\".\nHowever, he did not specify which country or countries he was referring to.\nIn a post on social media, Vance added: \"But let's be direct: there are many countries who are volunteering (privately or publicly) support who have neither the battlefield experience nor the military equipment to do anything meaningful.\"\nSo far only the UK and France have publicly committed troops towards policing any potential peace deal in Ukraine, although Prime Minister Sir Keir Starmer has previously said a \"number of countries\" have agreed to.\nVance's comments came as the US paused military aid to Ukraine, following an explosive spat between President Donald Trump and Volodymyr Zelensky in the Oval Office last week.\nZelensky left the White House before a proposed deal on sharing Ukrainian minerals with American companies could be signed.\nSpeaking about the proposal, Vance told Fox News: \"The very best security guarantee is to give Americans economic upside in the future of Ukraine.\n\"That is a way better security guarantee than 20,000 troops from some random country that hasn't fought a war in 30 or 40 years.\"\nSir Keir has said US security guarantees - such as air cover - will be needed to deter Vladimir Putin from invading Ukraine again, if there is a deal to end the war.\nHowever, Trump has so far refused to pledge this, instead arguing that US workers in Ukraine as part of a minerals deal could provide such assurances.\nSpeaking in the French Parliament, France's Armed Forces Minister Sébastien Lecornu welcomed that Vance had \"corrected his remarks\".\nHe paid tribute to the memory of French soldiers who had died in recent decades, earning applause from French MPs by saying they \"deserved the respect of our allies\".\nEarlier, Vance's original comments had drawn criticism from UK opposition politicians.\nConservative shadow defence secretary James Cartlidge pointed out both the UK and France deployed forces alongside the US in Afghanistan, adding: \"It's deeply disrespectful to ignore such service and sacrifice.\"\nAsked about Vance's comments later, Conservative leader Kemi Badenoch said the vice-president did not call Britain a \"random country\".\n\"A lot of people are getting carried away. They're saying loads of things and getting quite animated. Let's keep cool heads,\" she said.\nReform UK leader Nigel Farage said Vance was \"wrong, wrong, wrong\", adding that the UK \"stood by America\" for 20 years in Afghanistan.\nLiberal Democrat defence spokesperson Helen Maguire, a former captain in the Royal Military Police who served in Iraq, urged the UK's ambassador to the US, Peter Mandelson, to call on Vance to apologise for the comments.\n\"JD Vance is erasing from history the hundreds of British troops who gave their lives in Iraq and Afghanistan,\" she said.\nShe later told the BBC Vance's comments \"were clearly referring to the UK and France\", adding that they were \"deeply disrespectful\".", "url": "https://www.bbc.co.uk/news/articles/czx7w7q7qzro"}