{"authors": ["Kelly Withers", "www.facebook.com"], "date_download": "2025-04-26 04:13:58", "date_modify": "2025-04-26 04:13:58", "date_publish": "2025-03-04 11:34:45", "description": "ReMind UK is looking for people over the age of 50 to take part in trials for new treatments.", "filename": "news_articles_c1mnz518d92o_1745640838.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2dc6/live/311406d0-f8e5-11ef-9628-add78e51db09.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c1mnz518d92o_1745640838.html", "title": "Bath charity ReMind UK needs volunteers for dementia research", "title_page": "Bath charity ReMind UK needs volunteers for dementia research - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A charity which carries out research into new treatments for dementia says it needs more volunteers to support its work.\nBath-based ReMind UK is currently running eight clinical trials, with another five starting this year, and four academic studies.\n\"We've had two drugs come through in the last 18 months that slow the progression of early stages of Alzheimer's, one of the most common forms of dementia,\" said CEO Melissa Hillier.\nThe charity is looking for people over the age of 50, with or without dementia, to become research volunteers.\nNHS figures show more than 944,000 people in the UK, external have dementia.\nIt is estimated that by 2030 that number will be more than one million.\nMs Hillier explained: \"Lots of trials have to be quite specific, so it's quite targeted to different age groups. The more people we have on our register the more we can get through into the trials.\"\nThe ReMind UK trials are looking into the links between dementia and protein build-up in the brain.\n\"A lot of scientists think the build-up stops the signalling working properly, so it's looking at mechanisms to stop the proteins from spreading, developing and clumping together,\" Ms Hillier added.\nOne of the current volunteers, Brian Dyson, said he urged anyone \"who has a little bit of spare time\" to get involved.\nHe added: \"It's such a devastating disease, so if longer term we can do something to help prevent it it's got to be worthwhile.\"", "url": "https://www.bbc.co.uk/news/articles/c1mnz518d92o"}