{"authors": ["Jack Burgess", "www.facebook.com"], "date_download": "2025-04-26 04:36:50", "date_modify": "2025-04-26 04:36:50", "date_publish": "2025-02-28 11:35:17", "description": "At least 25 people were detained during a worldwide operation, Europol says.", "filename": "news_articles_czxnnzz558eo_1745642210.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e35d/live/c03d11b0-f5b8-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_czxnnzz558eo_1745642210.html", "title": "AI-generated child abuse global hit leads to dozens of arrests", "title_page": "AI-generated child abuse global hit leads to dozens of arrests - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "At least 25 arrests have been made during a worldwide operation against child abuse images generated by artificial intelligence (AI), the European Union's law enforcement organisation Europol has said.\nThe suspects were part of a criminal group whose members engaged in distributing fully AI-generated images of minors, according to the agency.\nThe operation is one of the first involving such child sexual abuse material (CSAM), Europol said. The lack of national legislation against these crimes made it \"exceptionally challenging for investigators\", it added.\nArrests were made simultaneously on Wednesday 26 February during Operation Cumberland, led by Danish law enforcement, a statement said.\nAuthorities from at least 18 other countries have been involved and the operation is still continuing, with more arrests expected in the next few weeks, Europol said.\nIn addition to the arrests, so far 272 suspects have been identified, 33 house searches have been conducted and 173 electronic devices have been seized, according to the agency.\nIt also said the main suspect was a Danish national who was arrested in November 2024.\nThe statement said he \"ran an online platform where he distributed the AI-generated material he produced\".\nAfter making a \"symbolic online payment\", users from around the world were able to get a password that allowed them to \"access the platform and watch children being abused\".\nThe agency said online child sexual exploitation was one of the top priorities for the European Union's law enforcement organisations, which were dealing with \"an ever-growing volume of illegal content\".\nEuropol added that even in cases when the content was fully artificial and there was no real victim depicted, such as with Operation Cumberland, \"AI-generated CSAM still contributes to the objectification and sexualisation of children\".\nEuropol's executive director Catherine De Bolle said: \"These artificially generated images are so easily created that they can be produced by individuals with criminal intent, even without substantial technical knowledge.\"\nShe warned law enforcement would need to develop \"new investigative methods and tools\" to address the emerging challenges.\nThe Internet Watch Foundation (IWF) warns that more sexual abuse AI images of children are being produced and becoming more prevalent on the open web.\nIn research last year the charity found that over a one-month period, 3,512 AI child sexual abuse and exploitation images were discovered on one dark website. Compared with a month in the previous year, the number of the most severe category images (Category A) had risen by 10%.\nExperts say AI child sexual abuse material can often look incredibly realistic, making it difficult to tell the real from the fake.", "url": "https://www.bbc.co.uk/news/articles/czxnnzz558eo"}