{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:05:37", "date_modify": "2025-04-26 04:05:37", "date_publish": "2025-03-03 17:11:54", "description": "The priest, who died in 2021, was said to have abused the man while he was a primary school pupil and a teenager.", "filename": "news_articles_cm2y30ggjjro_1745640337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d95e/live/d96ba4f0-f84f-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2y30ggjjro_1745640337.html", "title": "Diocese of Galloway ordered to pay man £473,000 over priest abuse", "title_page": "Diocese of Galloway ordered to pay man £473,000 over priest abuse - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Roman Catholic diocese has been ordered to pay a man more than £470,000 after he suffered \"horrific\" sexual abuse at the hands of a priest almost 50 years ago.\nThe man, who has not been identified, was targeted by the priest when he was five years old while at school in Irvine in Ayrshire and again while he was a boarding school pupil in the Highlands aged 14 to 16.\nThe Court of Session said the Diocese of Galloway was \"vicariously liable\" for the abuse, which has left the man unable to work since 2012.\nIt ordered the diocese to pay a total of £473,250 for the impact it has had on his life.\nThe priest, who has not been identified, died in 2021 and had been convicted of sexual abuse.\nLawyers for the man, also unidentified for legal reasons, raised an action against the church after the man was diagnosed with complex post traumatic stress disorder (CPTSD) stemming from his experiences in childhood.\nIn a written judgement, Lord Clark said the abuse had a \"profound effect\" on his life.\nThe diocese was the subject of the action because the priest was within its area at the time of the offending.\nThe diocese covers Dumfries and Galloway, East and South Ayrshire, and parts of North Ayrshire.\nThe man was first targeted by the priest aged five or six while a pupil at St Mark's Primary in Irvine.\nThe same priest targeted the boy again in the late 1970s whilst he was a boarding school student at Fort Augustus Abbey Secondary School in the Highlands.\nThe man had several jobs throughout his life, but felt unable to continue in employment from 2012 onwards.\nHe developed CPTSD, originally diagnosed as severe PSTD, at around that time.\nArchbishop William Nolan, who was once Bishop of Galloway but is now Archbishop of Glasgow, gave evidence to proceedings.\nThe court heard how he wrote a letter to the man shortly after the conviction of the priest - Lord Clark wrote about how this letter sought to \"assist the pursuer\".\nIn his evidence, the archbishop referred to the now revamped safeguarding guidelines adopted by the Catholic Church.\nThe diocese had argued the causes of the man's psychiatric injuries were attributable to other \"adverse\" life events.\nBut Lord Clark wrote that his experiences while a primary school pupil were \"serious and damaging\".\nIn his judgement, he said: \"This is a complex case in which there was serious and damaging sexual abuse of the pursuer when he was very young at primary school.\n\"He then suffered further abuse at secondary school, with sexual elements, and of a physical and emotional nature.\n\"That later abuse lasted longer than the first and may well, based on the medical literature, have had a profound effect on his life.\"\nHe added: \"But the devastating nature of the horrific sexual abuse at St Mark's when he was a young child was the more prominent cause.\"\nLord Clark originally awarded the man a total of £627,000 for the abuse carried out on him while he was a pupil at St Mark's.\nHowever, Lord Clark wrote that the man had already received £50,000 compensation for the abuse he had suffered from another church organisation and a representative of a person who had abused him whilst he was at Fort Augustus Abbey.\nLord Clark wrote that the man had also received £153,749.67 in respect of the abuse perpetrated at St Mark's.\nLord Clark said that £78,749.67 of came from the priest's estate which was paid in February 2024 and interim payments of £75,000 which had already been paid by the diocese.\nHe concluded these payments meant that the final sum which was due to be handed over was £473,250.\nLord Clark wrote: \"The impact on the pursuer and the harm from which he continues to suffer cannot adequately be addressed merely by an award of damages but it is hoped that, this matter now having been dealt with, the pursuer can move on with his life.\"", "url": "https://www.bbc.co.uk/news/articles/cm2y30ggjjro"}