{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 15:01:58", "date_modify": "2025-05-19 15:01:58", "date_publish": "2015-02-02 12:53:37", "description": "A man convicted of raping two women in Inverness is given a life sentence and will be made the subject of a lifelong restriction order.", "filename": "news_uk-scotland-highlands-islands-31090053_1747666918.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/68959000/jpg/_68959457_edincourt464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-scotland-highlands-islands-31090053_1747666918.html", "title": "Inverness rapist Andrew Peters given life sentence", "title_page": "Inverness rapist Andrew Peters given life sentence - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A man convicted of raping two women in Inverness has been given a life sentence.\nAndrew Peters, 34, was found guilty by a jury in 2013 of attacking the women who were 48 and 27.\nDuring the trial, the 48-year-old woman told how she smeared her blood behind a bed head in an effort to leave evidence of the rape.\nPeters was told he must serve at least seven and a half years before being eligible to apply for parole.\nHe will be held at the high security State Hospital at Carstairs because of a mental disorder.\nIf his condition improves he can be transferred to a mainstream prison.\nPeters, who appeared at the High Court in Edinburgh for sentencing, will be made the subject of an Order for Lifelong Restriction (OLR).\nUnder an OLR a prisoner will only be released by the parole authorities when it is considered that holding him in custody is no longer necessary for the protection of the public.\nIf freed he is kept under supervision.\nJudge Lord Uist ordered that Peters must serve seven and a half years in prison before he becomes eligible to apply for parole, but warned him that he must not assume he will automatically be released.\nPeters was found guilty in July 2013 of raping the women on March 9 in 2011 and November 4 in 2012, leaving the latter victim seriously injured.\nLord Uist said Peters' 48-year-old victim had suffered \"severe injury, permanent disfigurement and permanent impairment\".", "url": "https://www.bbc.com/news/uk-scotland-highlands-islands-31090053"}