{"authors": ["Amy Cole", "Shehnaz Khan", "www.facebook.com"], "date_download": "2025-04-26 04:30:11", "date_modify": "2025-04-26 04:30:11", "date_publish": "2025-03-03 06:24:40", "description": "The civil rights activist visited the town just days before his assassination in 1965.", "filename": "news_articles_cq8yy312xkxo_1745641811.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22cf/live/c8273e60-f6c5-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cq8yy312xkxo_1745641811.html", "title": "The day Malcolm X came to Smethwick", "title_page": "The day Malcolm X came to Smethwick 60 years ago - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Malcolm X came to Smethwick 60 years ago, it was to witness at first hand the racial discrimination being endured by Black and Asian communities.\nFor many local residents, what was happening in the area amounted to an apartheid, with ethnic minorities prohibited from renting and buying houses in certain areas or getting jobs.\nThe civil rights activist visited Marshall Street on 12 February 1965, just days before his assassination, after he was invited by Avtar Singh Jouhl from the Indian Workers' Association (IWA).\nOn the day of his visit, Malcolm X was taken to the local Blue Gates pub - and he didn't get served.\nSohan Singh, who has lived on Marshall Street for 33 years, remembered how people were kept in separate areas of the pub.\n\"You can go there, but they said not in smoke room, only the bar,\" he said.\n\"There were two sort of glasses, one is straight, one is with a handle. They give the glass, [the] handle one to the Indians, a straight one for the Europeans.\"\nMalcolm X had visited the small industrial town in the Black Country at a time when it was considered to be a hotbed of racial tension, with some residents lobbying the council to buy up empty houses and make them available to white families only.\nThe area had experienced a high proportion of immigration from Commonwealth communities after World War Two, with Peter Griffiths elected as Smethwick's Conservative MP in 1964, amid a racist campaign.\nAnti-racism campaigner Mr Jouhl had invited Malcolm X to witness the racial discrimination, while the BBC brought him to Marshall Street, where he was interviewed by reporter Julian Pettifer.\nThe interview remains one of the last recorded before the assassination.\nMr Jouhl's son said his father, who died in 2022, was determined that his guest should see how bad things were in the town.\n\"Malcolm when he came here expressed that things are worse here than they are in Harlem and he also sort of said let's not wait for them to erect the gas ovens as they did with the Jews in Germany,\" said Jagwant Johal.\n\"So that was the seriousness of if you don't actually oppose these things, that things can get out of hand.\"\nDuring the visit, Malcolm X walked side-by-side with members of the IWA down Marshall Street.\nMr Johal told the BBC his father had achieved what he wanted to do.\n\"He definitely hit the mark, because the purpose was to bring Malcolm here to shine a light on what was going on in Smethwick,\" Mr Johal said.\n\"Even now, 60 years later, people are still asking the same questions and also looking at what was Malcolm's legacy lessons that could be applied to what's going on today.\"\nIn 1964, Malcolm X, who had taken on the name when he joined the Nation of Islam group, was one of the most famous and most polarising figures in the US.\nLike Martin Luther King, he was a powerful orator, but unlike his contemporary he did not advocate only peaceful means to achieve his aims.\nFilm-maker Stephen Page, from Darlaston, has spent decades exploring his legacy and in 2005, created a film called Malcolm X: A Day In Smethwick as part of a community project.\nA blue plaque was erected on the side of a house in Marshall Street in 2012 to mark Malcom X's visit.\nYouth worker Miffy Ball, who lives in Walsall, agreed that racism remained a problem today.\n\"We're so much more of a multicultural country, that it's not just one specific group it's affecting, it's affecting everybody on a daily scale, but I think it's sad as a country that we're still fighting it,\" she said.\nMr Johal said it was important to build relationships, but there would not be a change in the long-term, unless \"structural racism\" was dismantled.\n\"Over time you get to know your neighbour and through your neighbour you get to know your neighbour's neighbour,\" he said.\n\"Things are sort of changing - it's only because we are continuing to campaign and raise the issues that still exist to be changed.\"", "url": "https://www.bbc.co.uk/news/articles/cq8yy312xkxo"}