{"authors": ["Liam Barnes", "www.facebook.com"], "date_download": "2025-04-26 03:54:15", "date_modify": "2025-04-26 03:54:15", "date_publish": "2025-03-04 17:48:53", "description": "Rhianan Rudd took her own life five months after terrorism charges against her were dropped.", "filename": "news_articles_cm2jzjqr133o_1745639655.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1805/live/89947370-f91d-11ef-becb-07cbf84d799c.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cm2jzjqr133o_1745639655.html", "title": "Rhianan Rudd: Girl, 16, 'thriving' in children's home before death", "title_page": "Rhianan Rudd: Girl, 16, 'thriving' in children's home before death - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A teenager who took her own life in a children's home was \"thriving\" in the weeks before her death, an inquest has heard.\nRhianan Rudd was 16 when she died at a home in Nottinghamshire on 19 May 2022, months after terrorism charges were dropped when it emerged she had been exploited by far-right extremists in the US.\nAn inquest at Chesterfield Coroner's Court heard she was \"deeply scared\" about further action being taken against her, but had been making \"positive\" developments since her arrest.\nSocial workers from Derbyshire County Council said they did not believe she was at risk of self-harm or suicide at the time of her death.\nRhianan was living in Bolsover when she was arrested by Derbyshire Police on 22 October 2020, later becoming the youngest girl in the UK to be charged with terrorism offences, which were later dropped in December 2021.\nThe inquest was previously told she was groomed by an American far-right extremist, who had sent her \"racially-motivated links\" to read.\nIn April 2021 she had been taken into Bluebell House Residential Home after a series of incidents at her home, including several instances of self-harm and running away.\nTom Carty, the Derbyshire County Council social worker responsible for her between November 2020 and March 2022, had said in a statement he \"had a sense of hopelessness and sadness\" about early home visits, but said his relationship with Rhianan was soon \"going from strength to strength\".\nHe said the situation with Rhianan improved once she had moved into the children's home.\n\"The visits to Bluebell House were much more positive and more future-focused,\" he said.\n\"It's just my hypothesis, but maybe she felt freer or more able to speak outside of home.\"\nPaige McMahon was the county council's social worker responsible for Rhianan after she was arrested in October 2020.\nShe moved departments the following month, handing the case over to Mr Carty, before she returned to take over from him in March 2022.\nMs McMahon said she was amazed by the \"dramatic change\" in Rhianan in the time since she had last seen her, and said she was \"really thriving\" at the home.\n\"I'd describe her as almost a completely different young person,\" she said.\n\"When I came back in March 2022, we all considered Rhianan's mental health to be quite stable.\"", "url": "https://www.bbc.co.uk/news/articles/cm2jzjqr133o"}