{"authors": ["Alison Holt", "www.facebook.com"], "date_download": "2025-05-19 15:36:19", "date_modify": "2025-05-19 15:36:19", "date_publish": "2015-02-09 22:41:05", "description": "A former Home Office researcher says a bullying culture at Rotherham Council led to her warnings of child sexual exploitation being suppressed years before action was finally taken.", "filename": "news_uk-31327781_1747668979.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80893000/jpg/_80893464_rotherham.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_uk-31327781_1747668979.html", "title": "Rotherham abuse: Researcher's warning 'ignored in 2002'", "title_page": "Rotherham abuse: Researcher's warning 'ignored in 2002' - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A former Home Office researcher says a bullying culture at Rotherham Council led to her warnings of child sexual exploitation being suppressed in 2002, years before action was finally taken.\nA report, external this month by government official Louise Casey concluded the council was not \"fit for purpose\".\nThe way many in the authority denied a 2014 finding, external children were exploited between 1997 and 2013 was criticised.\nThe council says it is investigating researcher Adele Gladman's claims.\nAt the time of the claims, Ms Gladman was undertaking research for a Home Office pilot. But she found her findings about the scale of sexual exploitation in Rotherham were also met with denial.\nPreviously, she has only spoken anonymously.\n\"What I didn't realise was just how many whistle-blowers there had been over the years and how many opportunities to change poor practice,\" she said.\n\"That has cost young people their health, their happiness and in some cases their lives. That is unforgiveable.\"\nMs Gladman was based at Rotherham Council when she carried out the work for the Home Office.\nShe describes being subjected to bullying and intimidation after her research found a small number of men, mainly of Pakistani heritage, were sexually exploiting a significant number of young people.\nShe says the council sent her on race awareness training and effectively suppressed her report.\n\"I had every aspect of my professionalism questioned,\" she said.\n\"I had every aspect of my work questioned. I had data removed over a weekend so that I couldn't substantiate my findings. Fortunately I had made copies.\"\nShe says the bullying she faced went beyond the local authority and remembers a police officer approaching her outside her office.", "url": "https://www.bbc.com/news/uk-31327781"}