{"authors": ["Jim Scott", "www.facebook.com"], "date_download": "2025-04-26 06:57:38", "date_modify": "2025-04-26 06:57:38", "date_publish": "2025-02-28 14:00:10", "description": "Construction work begins on the new factory on Wearside.", "filename": "news_articles_cn8rrmdn52no_1745650658.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ae60/live/4fccbca0-f5b8-11ef-8c2a-43d22b661d81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn8rrmdn52no_1745650658.html", "title": "Sunderland tyres into jet fuel factory to create 100 jobs", "title_page": "Sunderland tyres into jet fuel factory to create 100 jobs - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A new factory turning old tyres into jet fuel will create more than 100 jobs, its owners have said.\nThe £100m facility in Sunderland would produce sustainable aviation fuel (SAF) for the International Airlines Group (IAG) which owns British Airways.\nWastefront, which will operate the plant in the city's port, said about 10 million tyres would be processed each year.\nConstruction work has now begun with the company planning to open the first phase of the site by the end of 2026 and be fully operational a year later.\nNorwegian-firm Wastefront said it would also be the UK's first \"fully circular tyre-to-fuel plant\" as it is able to refine used tyres into oil, and then SAF, on Wearside.\nIAG announced its investment in the facility in January, with ground-breaking construction work beginning on Friday.\n\"The Sunderland facility is just the beginning, we aim to expand rapidly to meet the growing demand for sustainable fuels,\" Vianney Valès, chief executive of Wastefront, said.\nHe said the new site would create more than 100 jobs and would not just \"prevent millions of tyres from being discarded in landfill\" butalso provide a \"scalable, cost-effective pathway for SAF production\".\nMichael Mordey, leader of Sunderland City Council, said the beginning of construction work marked the start of the port's \"growing deserved reputation\".\nHe said: \"We're proud that this has captured the attention of Wastefront.\"", "url": "https://www.bbc.co.uk/news/articles/cn8rrmdn52no"}