{"authors": ["Tom Edwards", "www.facebook.com"], "date_download": "2025-04-26 03:44:38", "date_modify": "2025-04-26 03:44:38", "date_publish": "2025-03-05 07:03:52", "description": "Emma Watkins' sister and family are living in a hotel after the blaze last month.", "filename": "news_articles_cpq2n7ej23vo_1745639078.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bf3f/live/6c0716c0-f8f3-11ef-beb0-b7d9efbf9716.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cpq2n7ej23vo_1745639078.html", "title": "Plea to help Bromsgrove family forced out of home by fire", "title_page": "Plea to help Bromsgrove family forced out of home by fire - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A woman is appealing for people to help her sister whose home was devastated by a fire that she and others fled \"with just the clothes on their backs\".\nTwo semi-detached properties on King Edward Road in Bromsgrove went up in flames last month.\nEmma Watkins said her sister's family were now living in a hotel, having lost swathes of personal possessions, adding it could be more than a year before they were able to return home.\n\"It's been devastating for them - they've even lost their wedding album,\" she said. \"There's so many things they can't replace.\"\nReliving her sister's panicked call, Ms Watkins said: \"She was screaming down the phone, saying 'my house is on fire'.\n\"Of course your heart stops and you don't know what to do.\"\nShe described seeing the plumes of smoke from her own window.\n\"The scene inside the house just breaks your heart,\" she added of the aftermath.\n\"They walked outside with just the clothes on their backs.\"\nHereford and Worcester Fire and Rescue Service has said the fire is believed to have started accidentally.\nMs Watkins' nephew, Kyle Southerton, 27, was in the house with his parents and brother when the fire broke out.\nHe said they were making breakfast when they were alerted by a neighbour.\n\"We get a knock on the door from someone who used to babysit me and my brother, saying 'I don't know whether you know this, but your house is on fire, you've got to get out'.\"\nHe said: \"My family are distraught - you never think it's going to be your family, and when it is, you don't know what to think, how to react.\"", "url": "https://www.bbc.co.uk/news/articles/cpq2n7ej23vo"}