{"authors": ["Georgia Roberts", "www.facebook.com"], "date_download": "2025-04-26 06:33:40", "date_modify": "2025-04-26 06:33:40", "date_publish": "2025-02-27 06:37:09", "description": "Labour's plans to increase council tax by 4.99% were blocked by opposition councillors.", "filename": "news_articles_cp8lk65rn57o_1745649220.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ea85/live/c100ed80-f471-11ef-aeb3-bb556fdec0fe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp8lk65rn57o_1745649220.html", "title": "Maximum council tax hike rejected by Derby councillors", "title_page": "Maximum council tax hike rejected by Derby councillors  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Derby City Council leaders were forced to abandon plans to raise council tax by the maximum amount permitted after the plans were blocked by opposition councillors at a meeting.\nThe Labour-led minority council had proposed a council tax rise of 4.99% as part of its budget plans for the upcoming year, which also include £10m worth of cuts to services.\nHowever, the Conservatives and Reform labelled the rise \"crippling\", and grouped together with Liberal Democrat and Independent councillors to force a lesser rise of 3.99% instead.\nThey also imposed an additional £1m for spending on parks, a move Labour criticised as \"preposterous\".\nThe council is facing emerging pressures on its finances amounting to almost £40m in the next year.\nSpeaking at the end of the roughly five-and-a-half-hour meeting on Wednesday night, much of which was spent in deadlock over the plans, the Labour leader of the council Nadine Peatfield called the changes \"irresponsible\" and said it would lead to further service cuts in next year's budget.\nThe estimated cost of the reduced council tax will mean the authority will have over £2m less to spend in the immediate term.\nThe reduction amounts to an annual reduction of about £1.3m going forward on current plans, which will be funded by less money than planned being invested into depleted reserves.\nNadine Peatfield said a maximum hike of 4.99% would have marked \"an era of recovery\" in the finances whilst also protecting the most vulnerable.\nThe Labour leadership lost a council vote on their original budget plans by one vote, at 23 votes for and 24 against.\nThe Conservatives eventually forced the changes to the budget with the new tax increase and parks investment, which was voted through on 25 to 23 votes.\nLabour claims that the government had given the authority an extra almost £23m to spend across the council proved a major sticking point of the meeting, with opposition councillors accusing the party of \"misleading\" the public with claims it represented new money.\nNadine Peatfield told the meeting: \"You were presented tonight with a responsible budget that set us back on a responsible financial footing, that's gone.\"\nShe later told the BBC after the meeting she was \"upset\" and \"so angry\".\n\"This neglect to protect our reserves... without that resilience - we creep closer and closer to the danger zone,\" she said.\n\"A reduction in council tax also means... our priorities are reduced in terms of improvements to services.\"\nPeatfield said that although she recognised the public would be pleased not to see a maximum tax hike, the consequences are that the council \"can't deliver the things that [the public] want us to deliver\".", "url": "https://www.bbc.co.uk/news/articles/cp8lk65rn57o"}