{"authors": ["Caroline Gall", "www.facebook.com"], "date_download": "2025-04-26 03:45:18", "date_modify": "2025-04-26 03:45:18", "date_publish": "2025-03-05 06:21:32", "description": "In the past year 8.3 million journeys were made, a 53.7% increase over 2023.", "filename": "news_articles_cn52kklpp0wo_1745639118.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/82c5/live/977c2950-f919-11ef-becb-07cbf84d799c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cn52kklpp0wo_1745639118.html", "title": "West Midlands Metro tram journeys surpass pre-Covid levels", "title_page": "West Midlands Metro tram journeys surpass pre-Covid levels - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Passenger numbers on the West Midlands Metro have surpassed pre-Covid levels.\nUp to 8.3 million journeys were made over the past year, a 53.7% increase over 2023, and passing the eight million recorded in 2019, according to Department for Transport (DfT) data.\nThe increase follows significant investment in the network, including three new stops being added in Birmingham in 2022 and connecting with the railway and bus stations in Wolverhampton, Transport for West Midlands (TfWM) said.\nThe first phase of the extension between Wednesbury and Dudley is due to open later this year.\nConstruction work on the next phase to Merry Hill is also under way.\nThere will also be a new link to Digbeth in Birmingham, with all extensions being paid for by the City Region Sustainable Transport Settlement (CRSTS), funding awarded by the DfT.\nIn April last year a report stated that expanding the tram network carried an \"enormous cost\" that may prove difficult to meet.\nHowever, in November's Budget, Chancellor Rachel Reeves said the government would provide funding for the link from Wednesbury to Brierley Hill, a plan that had been beset with rising costs.\nServices were also suspended for several months in November 2021 after cracks were found in the bodywork of trams.", "url": "https://www.bbc.co.uk/news/articles/cn52kklpp0wo"}