{"authors": ["Emily Bell", "www.facebook.com"], "date_download": "2025-04-26 04:19:15", "date_modify": "2025-04-26 04:19:15", "date_publish": "2025-03-04 06:19:53", "description": "La Passerelle students in Year 10 and Year 11 have received international attention for their film.", "filename": "news_articles_cp3j0dyj3nxo_1745641155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/91b4/live/1b5feac0-ea0d-11ef-bd1a-09d219561c0c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cp3j0dyj3nxo_1745641155.html", "title": "Jersey students' film shown at international film festivals", "title_page": "Jersey students' film shown at international film festivals - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A short film created by Jersey students will be screened at international film festivals in Louisiana in the US, Galway in Ireland and the Italian island of Sardinia this year.\nIt was written by La Passerelle Year 10 and Year 11 students Cameron Crocker, 14, and Megan McKenna, 15, with local student Melissa Dean starring in the main role.\nThe piece, titled Lé Viage in Jèrriais, or The Journey in English, has already won an award for best original score at the Californian Best Shorts Competition and received an honourable mention at the UK Film Awards in November 2024.\nLé Viage is waiting for confirmation of selection for at least nine more international film festivals.\nThe film is about a young girl's connection with her horse which helps her to get through bullying and isolation at school.\nMegan described the film's success as \"shocking\".\nCameron said: \"It's kind of breathtaking to think that our work has gone so far.\"\nBoth said they were inspired by \"personal experiences\" in education and Megan's love for horse riding, which she began aged 13.\n\"We wanted this film to go far and wide to help people who were in similar positions to [us],\" Cameron added.", "url": "https://www.bbc.co.uk/news/articles/cp3j0dyj3nxo"}