{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-05-19 14:45:52", "date_modify": "2025-05-19 14:45:52", "date_publish": "2015-02-06 05:24:54", "description": "Harvard University introduces a total ban on relationships between professors and students in bid to stop sexual harassment.", "filename": "news_world-us-canada-31159406_1747665952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/mcs/media/images/80822000/jpg/_80822428_harvard.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/news_world-us-canada-31159406_1747665952.html", "title": "Harvard University bans relationships between students and professors", "title_page": "Harvard University bans relationships between students and professors - BBC News", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harvard University has introduced a total ban on relationships between professors and students.\nStaff said they introduced the ban after considering how \"power dynamics can contribute to sexual harassment\".\nHarvard's previous ban on staff-students affairs only applied if couples were in the same class.\nA committee which drafted the guidelines concluded the university needed to strengthen its language on \"relationships of unequal status\".\nHarvard University is not the only higher education college in the US to introduce such a ban.\nIts rival Yale did so in 2010, as did the University of Connecticut in 2013.\nBased in Cambridge near Boston, Harvard has about 2,400 faculty members and about 6,700 undergraduate students\nLast May the institution appeared on a US government list of 55 institutions which had allegedly mishandled harassment complaints.\nIn an email, Alison Johnson, a history professor who led the committee which helped revise the guidelines, told the Associated Press news agency: \"We wanted to emphasize that the central characteristic of any relationship between a professor and an undergraduate in the College should be pedagogical.\"", "url": "https://www.bbc.com/news/world-us-canada-31159406"}