{"authors": ["Craig Williams", "www.facebook.com"], "date_download": "2025-04-26 08:13:39", "date_modify": "2025-04-26 08:13:39", "date_publish": "2025-02-26 11:20:57", "description": "The first minister says it is time to \"draw a line in the sand\" against \"a politics of fear\".", "filename": "news_articles_cd0njprdengo_1745655219.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8c3d/live/4c4ba320-f46e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd0njprdengo_1745655219.html", "title": "Swinney calls for unity to combat far right 'threat' in politics", "title_page": "Swinney calls for unity to combat far right 'threat' in politics - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The first minister has called for politicians to unite against the far right in Scotland.\nIn a press conference at his official residence Bute House, John Swinney said it was time to \"draw a line in the sand\" against \"a politics of fear\".\nHe said he understood the huge amount of anger and frustration felt by the public but accused Nigel Farage and his Reform party of being apologists for the Russians.\nSwinney has called a summit of political leaders and civic leaders including trade unions, churches and charities, for the end of April.\nHe praised MSPs for working together to pass the Scottish government's budget and said it could be a model for collaboration and partnership between parties.\n\"I want us to work together to agree a common approach to asserting the values of our country, to bringing people together and creating a cohesive society where everyone feels at home,\" he said.\n\"Our politics - our parliament - have demonstrated that they work.\n\"Storm clouds are gathering. We can all see them. The threat from the far right is real, but that leaves me all the more convinced that working together is not only the right choice but the only choice,\" he added.\nHis comments came in the wake of the Scottish Conservative group leader on Glasgow City Council defecting to Reform UK.\nThomas Kerr, who represents the Shettleston ward, was first elected as a 20-year-old in 2017 and became Tory group leader in 2019.\nRecent polling has also seen suggestions of a rise in support for the party in Scotland, after it won 7% of the vote in last year's Westminster election.\nThe first minister added: \"It is time to come together to draw a line in the sand. To set out who we are and what we believe in, because a politics of fear is a politics of despair.\n\"It is a politics that will divide us and destroy so much that we hold dear.\n\"I want us to be ready for whatever this age of uncertainty throws at us, for us to be united in the face of the undoubted challenges that lie ahead.\n\"It was a mobilisation of mainstream Scotland that delivered our Parliament a quarter of a century ago.\n\"I have no doubt it is only by mobilising mainstream Scotland that we can protect those things we care most about, those things that are most important to us today.\"\nSwinney also criticised Farage personally, saying: \"There is a very alive and active threat to our security from the aggression of Russia and I think Farage is an accomplice to the Russian agenda and an apologist for the Russian agenda.\n\"Farage has been for years leading the argument which has been hostile to migration and I think that is based on a fundamentally racist view of the world - I reject that.\"\nA Reform Scotland spokesman accused Swinney of \"once again trying to deflect from the SNP's awful record in government\".\nHe added: \"Scottish people are turning to Reform because we represent real change from the status quo in Holyrood that has failed Scotland for far too long.\n\"Wanting sensible, controlled immigration isn't racist, it's common sense. John Swinney's inflammatory comments should be seen for what they are - nonsense.\n\"When it comes to Ukraine, we have been clear. We want Ukraine's long-term security guaranteed in any deal and that Putin is a despicable aggressor.\"\nNigel Farage has previously said the west \"provoked\" the war in Ukraine but denies ever supporting or praising Vladimir Putin.\nReform's former leader in Wales appeared in court on Monday accused of accepting bribes to make statements in the European Parliament that would benefit Russia.\nFarage has also repeatedly denied being a racist throughout his time as leader of both UKIP and Reform.\nHe told a BBC audience last year that he had done more to drive out the far right than any living person in British politics.\nA Scottish Conservative spokesperson said: \"The SNP have sown division in Scotland for decades so it's galling to hear John Swinney preach about unity.\n\"Scottish people are disillusioned with the state of politics because the SNP have obsessed over fringe issues like gender reform, instead of focusing on what really matters, such as creating jobs, improving schools, reducing hospital waiting times and providing good value for taxpayers.\n\"We'll see what is proposed, but we won't take part in yet another SNP talking shop that achieves nothing.\"\nSTUC general secretary Roz Foyer welcomed Swinney's announcement, describing it as \"commendable\".\n\"The threat of the far right is a real and present danger both in our politics and our communities,\" she said.\n\"For generations, trade unions have fought against fascism, racism and discrimination both in and outwith the workplace. We will continue that fight.\n\"We need policies from governments to tackle the economic injustice in our communities, which is a breeding ground for the growth of far right wing ideas.\"\nShe added: \"We must bring people with us and show them the politics of fearmongering, demonising and scapegoating is not the way. We cannot belittle. We have united before to defeat fascism. We will do it again.\"\nOne of the greatest powers of government is not legal or financial, it is the power to convene - to bring people together in a shared effort to tackle a problem.\nIt happened big time in the Covid emergency, although ironically that was about building consensus on the need to keep people apart.\nIt has happened in recent months at Holyrood, giving the government sufficient support to pass the Scottish budget, which was voted through comfortably on Tuesday.\nNow, the first minister is suggesting that the same collaborative approach could be used to counter political forces that mainstream parties and civic organisations reject.\nDomestically, this is an effort to resist the politics of Nigel Farage and his anti-immigration Reform UK party, which polls suggest is on course to win seats at the 2026 Holyrood election.\nThat development would probably squeeze support for the Conservatives and Labour much more than the SNP, so it will be hard for John Swinney's opponents to reject his call for a cross-party summit.\nBut they may also spot a potential trap, worrying that the more they work with the Swinney government and accept his leadership on this the harder it might become to distinguish themselves as alternatives to the SNP in the election campaign to come.", "url": "https://www.bbc.co.uk/news/articles/cd0njprdengo"}