{"authors": ["James Ingham", "www.facebook.com"], "date_download": "2025-04-26 06:57:27", "date_modify": "2025-04-26 06:57:27", "date_publish": "2025-02-28 14:21:05", "description": "A psychotic guest who killed a Travelodge worker was mishandled by authorities, her parents say.", "filename": "news_articles_cd92q2jpnd7o_1745650647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7530/live/f5707260-f382-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cd92q2jpnd7o_1745650647.html", "title": "Travelodge death: Marta Elena Vento's parents angry at 'mistakes'", "title_page": "Travelodge death: Marta Elena Vento's parents angry at 'mistakes' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The mother of a hotel receptionist killed by a guest with a history of violence said her daughter's death had left her feeling like she was \"dying while still alive\".\nMarta Elena Vento's death at a Travelodge hotel in Bournemouth in December 2020 was caused by failures by prison health workers and police, a coroner concluded.\nAt their home in Valencia, Spain, the 27-year-old's parents said \"mistakes\" were made by police, prison and health workers who dealt with killer Stephen Cole.\nCole, who had been actively psychotic when he killed Ms Elena Vento, was given an indefinite hospital order in 2021 after he pleaded guilty to manslaughter by reason of diminished responsibility.\nConcluding the inquest, Dorset Senior Coroner Rachael Griffin said Cole, who had recently been released from prison for sex offences, was not under proper supervision despite attacks on prison workers and inmates.\nIn a narrative conclusion, she said: \"[He was] unmedicated because of a failure to sufficiently plan and ensure continuity of mental healthcare... and because he was not adequately managed as a sex offender in line with national guidance upon his release from prison.\"\nMs Elena Vento's parents, Roser Vento Sancho and Luis Elena Blas, invited the BBC into their home to talk about the failings they felt had led to their daughter's death.\nThey showed me a very personal space - her bedroom.\nThe room is exactly as it was when she left home on her final adventure - a cork board displays photos with friends, ticket stubs and a map of Europe, marked with the cities she had travelled to.\nMs Vento Sancho makes sure there are always fresh flowers on her desk.\n\"I can't let go of this,\" she said.\nLater, we drove to a beach which the family had visited many times. They scattered Marta's ashes in the Mediterranean close to here.\nBlowing kisses at the waves, she told me: \"Marta is the sea now.\"\nThe couple followed the inquest into their daughter's death in Bournemouth remotely, hearing four weeks of evidence from authorities who dealt with Cole in the preceding months.\nMrs Vento Sancho, said: \"[Cole] is the one who committed the crime, but the blame lies with the whole chain of people, from the prison, who should never have let him out, to the last person who saw him.\n\"When you hear people talk... and you know they could have done better... then that breaks you down.\n\"It has been devastating, like dying while still alive.\n\"A part of my life has never been the same again. And it never will be.\"\nHer father likened Cole to a gun triggered by \"incompetence, negligence and failure of duty\".\nHe said: \"The mistakes are obvious... Stephen Cole is like the gun, but a gun doesn't fire on its own. It needs intervention.\n\"And that intervention was... a failure of duty by all those who should have done their job before.\"\nThe 32-year-old killer, originally from Reading, had a diagnosis of psychosis and a history of violence, the inquest heard.\nHowever, he was unmedicated and unsupervised when he launched a 42-minute assault on Ms Elena Vento in the early hours of 9 December.\nAmong those Mr Elena Blas blames is Dorset Police - Cole had been arrested for allegedly attacking guests and workers at another Bournemouth hotel five days before the Travelodge attack.\n\"You just pulled someone out of a fight, someone staying in a shelter only for problematic men, and you leave him on the street,\" he said.\n\"That's like dropping a bomb and not warning anyone.\"\nHe also criticised prison authorities, which released Cole from HMP Winchester with a four-week supply of antipsychotic medication on 27 October 2020.\nHe added that a GP should have renewed the prescription at Cole's request on 8 December - the day before the attack.\nCoroner Ms Griffin said prison health services contractor Practice Plus Group (PPG) failed to discharge Cole to a GP or refer him to a community mental health team.\nShe also said Dorset Police did not gather sufficient information about him in order to manage the offender effectively.\nHowever, she said the GP acted in line with local guidance in not prescribing antipsychotic medication and it was unclear what effect the drug would have had in a short time.\nIn her final words, the coroner spoke to Ms Elena Vento's parents in Spanish.\nThe family's translator told the court Ms Griffin said: \"No-one in this room can imagine what you have suffered in almost four-and-a-half years since that terrible day.\n\"I regret from the depth of my heart for your loss.\"\nMs Griffin said she would be sending a Prevention of Future Deaths Report to the NHS, police and prison authorities.\nDuring the hearing, PPG expressed \"deep regret\" that it did not alert Cole's GP about his release.\nDorset Police said it \"recognised\" the coroner's findings and had changed its offender management practices.\nIn a statement read on their behalf outside the hearing, Ms Elena Vento's parents said: \"Our daughter paid with her life for lapses in the English prison and policing systems.\"\nTheir solicitor Benjamin Burrows said: \"Marta's case has laid bare systemic failures.\n\"Clear action needs to be taken. Marta's family will be watching to see that this time something is done to stop such tragedies happening again in the future.\"", "url": "https://www.bbc.co.uk/news/articles/cd92q2jpnd7o"}