{"authors": ["Nick Clark", "www.facebook.com"], "date_download": "2025-04-26 06:50:36", "date_modify": "2025-04-26 06:50:36", "date_publish": "2025-03-01 07:42:55", "description": "Tan Dhesi heads the group calling for it, alongside former prime minister Baroness Theresa May.", "filename": "news_articles_c39vvre0pv7o_1745650236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8305/live/531cdd00-f53f-11ef-938c-4727a1e64ce2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c39vvre0pv7o_1745650236.html", "title": "Berkshire MPs and May call for new Heathrow rail link from Slough", "title_page": "Berkshire MPs and May call for new Heathrow rail link from Slough - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Four Berkshire MPs have called on the government to support a new rail link to Heathrow Airport.\nThe proposed line would involve building a tunnel east of Langley station in Slough linking the Great Western mainline and the airport.\nThe call - backed by 18 MPs and Baroness Theresa May of Maidenhead - comes after the government said last month it would support a third runway at Heathrow.\nA Department for Transport (DfT) spokesperson said though there is no live planning application for Heathrow's expansion and \"any plans will need to take rail access into account\".\nCurrently, people travelling by rail to the airport from the west must take the train through Reading and Slough into London Paddington, then change to go back out towards the airport, according to the Local Democracy Reporting Service.\nThe letter said the proposed link would eliminate the need for this, reducing those passengers' journey times by an average of 30 minutes.\nThe letter was written on behalf of the all party parliamentary group on the western rail link to Heathrow, which is headed by Slough MP Tan Dhesi and Baroness May.\nOther Berkshire MPs to sign the letter were Wokingham's Clive Jones, Woodley and Earley's Yuan Yang and Windsor's Jack Rankin.\n\"We are clear that transport is an essential part of our mission to rebuild Britain, and we are committed to delivering infrastructure that drives growth and opportunity,\" the DfT spokesperson added.\n\"There is currently no live planning application for an expanded Heathrow, but we are clear that any plans will need to take rail access into account, in addition to meeting strict climate and air quality targets.\"", "url": "https://www.bbc.co.uk/news/articles/c39vvre0pv7o"}