{"authors": ["Miya Chahal", "www.facebook.com"], "date_download": "2025-04-26 04:31:40", "date_modify": "2025-04-26 04:31:40", "date_publish": "2025-03-03 06:09:59", "description": "An encampment used by rough sleepers has appeared opposite a school and library.", "filename": "news_articles_cjd3emx2jrpo_1745641900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/474a/live/73d5c810-f461-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cjd3emx2jrpo_1745641900.html", "title": "Parents concerned over 'homeless camp' near school", "title_page": "Beeston: Parents concerned over 'homeless camp' near school - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Parents of children at a primary school in Nottinghamshire say they are concerned about pupil safety after an \"encampment\" used by rough sleepers appeared just steps away from their school.\nThe arrangement of tents, shopping trolleys, sheets and cuddly toys sits opposite Round Hill Primary School's infant entrance and Beeston Library.\nBroxtowe Borough Council said the encampment had been causing concern in the community but it was unable to remove it as the land was owned by Nottinghamshire County Council.\nThe county council said it would monitor the situation and take action to provide an \"appropriate solution\".\nNottinghamshire-based homelessness charity Framework said two rough sleepers were initially at the site but its teams had been \"unable\" to engage with them.\n\"Anyone who has been driven to sleep rough is clearly in need of help, however these particular individuals would evidently prefer to be left alone,\" the charity added.\nThe site has been active for about six months.\nParents told the BBC they had found needles, blood-stained tissues and faeces in the area, although it has not been confirmed if this is linked to the encampment.\nJessica Baker's six-year old son attends the school and the pair walk past the dwelling every day.\nShe said: \"I understand that people live like this and have nowhere else to go. We are sympathetic. But outside a school is not the right place.\n\"There's cuddly toys in there, what if our children runs up to them and put themselves in danger?\"\nAll of the children who use the entrance are aged four to seven.\nAnother parent, Helen Wilson, said she worried about the impact on the community.\n\"It started as one tent, then two, and the camp started growing more and more. It is attracting littering in the area,\" she said.\n\"This is a difficult situation and nobody wants to deal with it, but we have to put our children's safety first.\"", "url": "https://www.bbc.co.uk/news/articles/cjd3emx2jrpo"}