{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 04:31:47", "date_modify": "2025-04-26 04:31:47", "date_publish": "2025-03-03 06:08:27", "description": "The National Trust site in Cheshire was badly flooded when a river breached its banks in January.", "filename": "news_articles_crewwg2l3xeo_1745641907.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6765/live/c967cbd0-f811-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_crewwg2l3xeo_1745641907.html", "title": "Quarry Bank restoration after floods 'could cost £100,000'", "title_page": "Quarry Bank restoration after floods 'could cost £100,000' - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "It could cost \"in excess of £100,000\" to restore a National Trust estate after it was badly damaged by heavy rain and flooding in January, the charity has said.\nQuarry Bank in Cheshire was severely affected when the River Bollin broke its banks and caused \"extensive erosion and a major landslide in the gardens\", a representative said.\nThey said it was \"too early\" to be certain of the full cost of restoration, but it was expected to run into six figures as it needed to cover \"clear-up, monitoring, prevention works and any redevelopment\".\nThe country park, which includes a mill from the late 18th Century, draws about 250,000 visitors every year and has annual running costs of at least £2.2m.\nEstate general manager Roz Stone told BBC North West Tonight that \"the level of rainfall and the speed at which it came\" caused significant damage\" to the estate, which lies in a valley in Styal, near Manchester Airport.\nShe said surface water from nearby roads and fields had flowed down a steep incline in the garden and caused a landslide which blocked paths.\nShe said the site had \"definitely seen an increasing number of flood and bad weather events [and] a high number of storm closures this winter.\n\"We haven't had a landslide on the site previously so this has been a more significant event, but we are noticing that [poor weather] is becoming more and more the norm and a real challenge,\" she added.", "url": "https://www.bbc.co.uk/news/articles/crewwg2l3xeo"}