{"authors": ["BBC News", "www.facebook.com"], "date_download": "2025-04-26 08:03:05", "date_modify": "2025-04-26 08:03:05", "date_publish": "2025-02-26 16:33:07", "description": "Kim Forth deluged the woman with texts and claimed he would torture her and \"stamp\" on her children.", "filename": "news_articles_cgr2nv59ll0o_1745654585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9018/live/0a385ca0-f458-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cgr2nv59ll0o_1745654585.html", "title": "Sunderland man jailed for bombarding partner with threats", "title_page": "Sunderland man jailed for bombarding partner with threats - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A man who bombarded his ex-partner with threats, including claims he would torture her and \"stamp\" on her children, has been jailed.\nKim Forth, 39, deluged the woman with violent and aggressive text messages and voice notes before turning up at her house, Newcastle Crown Court heard.\nHe was arrested after climbing on to her shed roof to try and access a window he had previously broken, the court heard.\nForth, from Sunderland, was jailed for one year and four months after admitting sending threatening communications, threatening criminal damage and harassment.\nForth and the woman began a relationship in March 2023 which was \"initially good\" but then \"deteriorated\", prosecutor Graham O'Sullivan said.\nShe said Forth, a roofer from Moorsley Road in High Moorsley, was \"emotionally abusive and threatening\" and appeared to be \"excessively jealous\", the court heard.\nAfter an argument on 26 January, he spent that evening sending her vile messages and voice notes, Mr O'Sullivan said.\nAmong the threats were claims he would torture the woman, put her in a coma, smash her windows and, if her children tried to intervene, \"stamp all over\" them, the court heard.\nShe called police who attended her home, with officers able to monitor his movements through the couple's phone location services, the court was told.\n\"Alarmingly, they could see he was getting closer and closer to her home,\" Mr O'Sullivan said.\nWhen he arrived, he climbed on to a shed with the apparent aim of getting to a bedroom window he had previously broken, the court heard.\nPolice talked him down and arrested him, but as he was led away he was heard to say the woman would \"get a good hiding\" when he was released, Mr O'Sullivan said.\nIn a statement read to the court, the woman said Forth had made her feel scared and mentally unwell, adding she feared what he might do and just wanted to be her \"old self\".\nIn mitigation, Sophie Allinson-Howells said the episode was out of character.\nA restraining order banning Forth from contacting the woman for five years was also made.", "url": "https://www.bbc.co.uk/news/articles/cgr2nv59ll0o"}