{"authors": ["Anna Whittaker", "www.facebook.com"], "date_download": "2025-04-26 07:31:58", "date_modify": "2025-04-26 07:31:58", "date_publish": "2025-02-27 16:50:53", "description": "Councils across the Black Country have laid out their financial plans this week.", "filename": "news_articles_c8718w7815xo_1745652718.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2740/live/f40cd4b0-f2c7-11ef-8f01-fb4843bea627.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_c8718w7815xo_1745652718.html", "title": "How much council tax will I pay in the Black Country?", "title_page": "How much council tax will I pay in the Black Country? - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Council tax charges are set to rise across the Black Country in April.\nDudley, Wolverhampton, Walsall and Sandwell councils laid out their plans in budget meetings this week.\nAll four councils agreed to increase council tax by the maximum 4.99% and approved millions of pounds of spending and cuts, with leaders citing significant financial challenges.\nLabour has promised £2bn of funding for English councils in the year from April 2025, an extra £700m on top of the £1.3bn announced in October's Budget.\nConservative-run Dudley Council approved £42m of savings as part of its five-year strategy.\nThe increase means an average band D house will pay £1.94 extra per week.\nThe council will close one of its three dementia hubs, the Crystal Gateway, to save £500,000 per year.\nGreen waste fees will also increase from £36 to £52.\nHowever, the Sycamore Adventure Centre in Upper Gornal was saved from the cuts after being under threat.\n\"It has been a tough time for all councils in the UK, we are all overspending on adult social care and children's social care,\" Conservative leader Patrick Harley said.\n\"We have put together a package of measures which will see us through to 2030.\"\nThe Labour-run council has outlined £40.7m of savings over a three-year period.\nThe council tax rise means a band D household will pay £1.92 extra per week.\nCouncillors approved the closure of shop mobility and a significant reduction in its community events programme.\nThe council will also remove security staff from Wolverhampton and Bilston markets to save £91,000.\nLeader Stephen Simkins said the authority would crack down on fly tipping and spend an extra £500,000 to help fix potholes and maintain highways.\nLabour-run Sandwell Council outlined savings of £19m to balance the 2025/26 budget.\nResidents will pay an extra £2 per week in council tax in a band D home.\nThe council will look to close the Harry Mitchell Leisure Centre, transfer Hadley Stadium to a third party and develop a new operating model for Tipton Sports Academy.\nIt will also increase charges for meals on wheels, burials and cremation, introduce higher green waste subscription fees and switch to alternate weekly collections of general waste and recycling.\nSpeaking on BBC Radio WM this month, leader Kerrie Carmichael said: \"I understand that council tax is a bugbear for most people but we do a lot with it in Sandwell.\n\"We've protected our library services, they are really important to us.\"", "url": "https://www.bbc.co.uk/news/articles/c8718w7815xo"}