{"authors": ["Bernd Debusmann Jr", "www.facebook.com"], "date_download": "2025-04-26 03:39:33", "date_modify": "2025-04-26 03:39:33", "date_publish": "2025-03-04 20:18:46", "description": "The move comes less than a year after massive Gaza war protests swept across US college campuses.", "filename": "news_articles_cqly0zrnnv3o_1745638773.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/99e1/live/cb29e950-f931-11ef-b5f1-abd941d42398.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/news_articles_cqly0zrnnv3o_1745638773.html", "title": "Trump threatens to jail or deport students for 'illegal protests'", "title_page": "Trump threatens to jail or deport students for 'illegal protests'  - BBC News", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "US President Donald Trump said he would cut funding for universities that allow what he called \"illegal\" protests and prosecute and deport foreign students who participate.\nOn his Truth Social social media platform, Trump said that \"all federal funding will STOP\" for schools that permit students to protest illegally.\nTrump's announcement comes less than a year after massive student protests against Israel's war in Gaza swept across US college campuses, including Columbia University in New York and the University of California, Los Angeles (UCLA).\nAmerican students will be expelled, Trump said.\nTrump did not specify what would constitute an \"illegal\" protest. Broadly speaking, the right to protest is protected by the First Amendment of the US Constitution.\nThe Foundation for Individual Rights and Expression, also known as Fire, swiftly condemned Trump's announcement.\n\"Colleges can and should respond to unlawful conduct, but the president does not have unilateral authority to revoke federal funds, even for colleges that allow 'illegal' protests,\" the statement said.\nThe group added that the move will \"cast an impermissible chill on student protests about the Israeli-Palestinian conflict\".\nIn a separate announcement, the US Department of Education, General Services Administration and the Department of Health and Human Services said they would conduct a \"comprehensive review\" of Columbia's federal contracts amid an ongoing investigation into compliance with Title VI, a federal law that bans discrimination based on ethnicity or ancestry.\nIn a statement, the education department said that it is considering stop work orders for $51.4m (£40.19m) in contracts with the New York City-based university, and will review more than $5bn in grant commitments to the school.\n\"Americans have watched in horror for more than a year now, as Jewish students have been assaulted and harassed on elite university campuses - repeatedly overrun by antisemitic students and agitators,\" Trump's new Secretary of Education, Linda McMahon, said in a statement.\nMcMahon added that \"unlawful encampments and demonstrations have completely paralysed day-to-day campus operations, depriving Jewish students of learning opportunities to which they are entitled\".\nIn January, Trump signed an executive order that called for the removal of foreign students who participated in protests.\nThe order also directed government departments to make recommendations that could allow educational institutions to \"monitor for and report activities by alien students and staff\" and, if warranted, remove them.\nA White House fact sheet on the order specified that it seeks to \"protect law and order, quell pro-Hamas vandalism and intimidation, and investigate and punish anti-Jewish racism in leftist, anti-American colleges and universities\".\nIn April 2024, student protests against the war in Gaza drew national attention after students at Columbia were arrested at a student encampment set up on campus.\nThousands of arrests were ultimately made at dozens of universities across the country.\nAt Columbia, the university authorised New York Police Department officers to swarm the campus, a controversial decision that led to the arrests of about 100 students who were occupying a university building.\nFour months after protests rocked the campus, Columbia president Minouche Shafik resigned.\nEarlier this week, a federal task force announced it would visit 10 prominent US universities that have been the scene of anti-semitic incidents.", "url": "https://www.bbc.co.uk/news/articles/cqly0zrnnv3o"}