{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-04-26 08:04:13", "date_modify": "2025-04-26 08:04:13", "date_publish": "2025-02-26 15:56:44", "description": "World Boxing is granted provisional recognition as the sport's international federation by the International Olympic Committee (IOC).", "filename": "sport_olympics_articles_c9vym9l7w0ro_1745654653.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ae11/live/28d1e0b0-f457-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_olympics_articles_c9vym9l7w0ro_1745654653.html", "title": "World Boxing: International Olympic Committee grants provisional recognition as international federation", "title_page": "World Boxing: International Olympic Committee grants provisional recognition as international federation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World Boxing has been granted provisional recognition as the sport's international governing federation by the International Olympic Committee.\nBoxing is not currently part of the programme for Los Angeles 2028 and the creation of a new global body was the biggest hurdle to the sport's inclusion in the next Games.\nThe IOC has run boxing at the past two Olympics after the International Boxing Association (IBA) was suspended as the sport's world governing body in 2019 over governance, finance, refereeing and ethical issues.\nThe Russian-led IBA was then stripped of its status in June 2023 over a failure to implement reforms.\nWorld Boxing was formed in April 2023 and now has 78 members across five continents, including Great Britain.\nThe IOC said: \"The [IOC] assessment concluded that World Boxing has continued to make progress regarding the identified areas of consideration.\"\nThe IOC added World Boxing has met several key criteria to merit provisional recognition, including gaining sufficient members across five continents.\nIt has also applied the sports integrity process during Paris 2024, providing independent oversight and good governance structures, as well as assurances on revenues and signing up to the World Anti-Doping Code.\nBoris van der Vorst, president of World Boxing, said: \"Keeping its place at the Olympic Games is absolutely critical to the future of our sport at every level, from the grassroots to the highest echelons of professional boxing, and this decision by the IOC takes us one step closer to our objective of seeing boxing restored to the Olympic programme.\n\"[It] is an important milestone, however, everyone connected with World Boxing understands that being part of the Olympic movement is a privilege and a responsibility and not a right.\n\"There is still a lot of work to do, and everyone is as committed as ever to continuing to work together and doing everything within our power to deliver a better future for our sport and ensuring that boxing remains at heart of the Olympic movement.\"\nApart from removing its status, the IOC was also at loggerheads with the IBA during Paris 2024 over the participation of two boxers, Algeria's Imane Khelif and Taiwan's Lin Yu-ting.\nThe IBA banned the fighters midway through the 2023 World Championships saying they had failed gender eligibility tests, but the IOC allowed them to compete and both won gold medals in their weight classes.", "url": "https://www.bbc.co.uk/sport/olympics/articles/c9vym9l7w0ro"}