{"authors": ["Joe Bradshaw", "www.facebook.com"], "date_download": "2025-05-21 04:57:20", "date_modify": "2025-05-21 04:57:20", "date_publish": "2025-04-04 13:28:22", "description": "Mohamed Salah: Should we be worried about his Liverpool form?", "filename": "sport_football_articles_cly141vxzdlo_1747803440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b4a/live/88cbbb20-1159-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly141vxzdlo_1747803440.html", "title": "Mohamed Salah: Should we be worried about his Liverpool form?", "title_page": "Mohamed Salah: Should we be worried about his Liverpool form? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "One goal in six games. Zero assists in his past four. This is an unusually quiet time for Mohamed Salah.\nThat it has coincided with Liverpool fluffing their lines in two competitions - against Paris St-Germain and Newcastle - is unfortunate timing.\nIt is unlikely to matter in the Premier League. Liverpool's advantage is such over Arsenal that they could still limp over the line without needing their talismanic forward.\nBut the drop-off in Salah's form is still noteworthy. So what has happened?\nIt is hard to know where to start the comparison. After all, before this hiccup, Salah had eight goals in eight games from the end of January - hardly suggestive that a drop was incoming.\nAnd yet some of that was over-performing. Against Ipswich, Everton, Aston Villa and Manchester City, Salah's expected goals figures were all below 0.5 and yet he found the back of the net in each game.\nIndeed, looking across his underlying numbers from the start of 2025, he has not been as good as he was in the autumn.\nWhile that eight-game streak ensured his goals average has remained stable, he is down across other metrics.\nThat expected goals metric has dropped from 0.75 to 0.6 - still only behind the figures of Erling Haaland and Alexander Isak, but down on his own ridiculous standards.\nHis dribbles success rate has also dropped, from 45% to 37% since the turn of the year.\nAgainst Paris St-Germain in the first leg, he was totally anonymous - in the pocket of Nuno Mendes and having his fewest touches of the season.\nWhile far better in the second leg, he replicated that Paris display against Newcastle in the Carabao Cup final - failing to show up on Liverpool's biggest stage of the season.\nIt is a trend of 2025 so far that Salah is taking fewer shots - from 3.75 to three. However, with that, his shot conversion rate has improved. So he is more lethal but getting fewer opportunities, which just testifies to how exceptional a finisher he is.\nWhy has this happened?\nFirst of all, everyone is entitled to a dip - and Salah's performances for most of 2024-25 have been so other-worldly that it was always unlikely to sustain all season.\nOn top of that, he has played a lot of minutes. Only four other outfield players have managed more in the Premier League this season. In fact, his total of 2,662 puts him 10th in Europe for outfield minutes played.\nThrow in another 800 minutes in Europe, more than 300 in the Carabao Cup and five games for Egypt this season and he has had very little downtime.\nNot only that, but for the past month, devout Muslim Salah has also been observing Ramadan and fasting from sunrise to sunset. It is hardly surprising that an elite athlete may not be at their peak during this time.\nLiverpool have dipped slightly too. While the points per game tally has not dropped massively since 1 January (2.47 to 2.38), their metrics dovetail consistently with Salah. In other words, when Salah is clicking, so are Liverpool.\nYet even this must be put in context.\nIf this was a bygone season where Liverpool were fighting to keep pace with Manchester City at the top of the Premier League and in the latter stages of the Champions League, Salah's form might be more concerning.\nInstead, with only the league to worry about now - and no more midweek matches on the schedule - Salah will get unexpected levels of rest between games.\nAnd given the title could be wrapped up before May anyway, he is likely to enjoy a procession to the end of the season.", "url": "https://www.bbc.com/sport/football/articles/cly141vxzdlo"}