{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:00:01", "date_modify": "2025-05-21 05:00:01", "date_publish": "2025-04-04 11:30:11", "description": "Newcastle news: Harvey Barnes 'desperate to showcase what he can do' - Howe", "filename": "sport_football_articles_c0elwqzzy5po_1747803601.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/38f9/live/d0ad8550-113f-11f0-abd9-6517a0c37791.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0elwqzzy5po_1747803601.html", "title": "Barnes 'desperate to showcase what he can do' - Howe", "title_page": "Newcastle news: Harvey Barnes 'desperate to showcase what he can do' - Howe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle midfielder Harvey Barnes needs to make it \"impossible\" for boss Eddie Howe to take him out of the team.\nThe 27-year-old has made 31 appearances for the Magpies this season, but has started fewer than half of those.\nAnthony Gordon's impressive form on the left wing has meant Barnes has had to wait for his opportunity to make an impact from the start.\nBut with Gordon struggling with injury, the former Leicester player has been deputising in his place on the left and provided two assists in his past two Premier League games.\n\"Harvey has been chomping at the bit to play. He's been desperate to showcase what he can do,\" Howe said.\n\"He brings unique things to the team. He's definitely a goal threat. I think he had seven shots against Brentford off both sides of the pitch. I trust him a lot. I think he's got a lot of great attributes that we want in the team.\n\"I've been really happy with how he's come into the team and built relationships with the likes of Joelinton and Tino Livramento. They've been a consistent threat down that left-hand side so I'm delighted with that side of the pitch.\"\nWith crucial games coming up as Newcastle try to secure Champions League football, the question now is whether Barnes can keep his place in the starting XI when Gordon returns.\n\"That's the message to any player when you get your opportunity,\" Howe added.\n\"You've got to try to grab it and make it impossible for me to take you out. That's the challenge for Harvey.\"", "url": "https://www.bbc.com/sport/football/articles/c0elwqzzy5po"}