{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:52", "date_modify": "2025-04-26 04:27:52", "date_publish": "2025-03-03 10:41:55", "description": "A section of AC Milan fans stage a protest towards the ownership of the club before Sunday's 2-1 Serie A defeat to Lazio.", "filename": "sport_football_articles_cn7vz1lkn0ko_1745641672.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5701/live/2f4bddf0-f809-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn7vz1lkn0ko_1745641672.html", "title": "AC Milan 1-2 Lazio: Milan fans stage protest during match", "title_page": "AC Milan 1-2 Lazio: Milan fans stage protest during match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "AC Milan manager Sergio Conceicao says his players are \"feeling the tension\" after a section of fans protested during Sunday's 2-1 Serie A home defeat by Lazio.\nThe Curva Sud stand was empty for the first 15 minutes of the game and, when the fans did arrive, they called the players \"shameful\" and demanded American owners RedBird sell the club.\nIt was the Rossoneri's third straight league defeat dropping them to ninth in the table, 17 points behind leaders and city rivals Inter Milan.\nThey were also knocked out of the Champions League play-offs by Feyenoord last month.\n\"We discussed the atmosphere and this is the first time I've experienced this in my career. Mistakes weigh heavier under such conditions,\" Conceicao told DAZN.\n\"I was a player, I know when it's like that, your boots feel like they're burning. When a dribble or a pass doesn't work or you're behind, it burns even more.\"\nMattia Zaccagni put Lazio ahead in the first half but Samuel Chukwueze's scored a later equaliser for the hosts after a Strahinja Pavlovic red card.\nHowever, former Chelsea forward Pedro netted the winner for the visitors from the penalty spot in the eighth minute of stoppage time.\n\"It is not an easy moment,\" added Conceicao. \"The players feel the tension around the club.\n\"The only way forward is to work hard, take pride in our colours and strive to change the situation.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn7vz1lkn0ko"}