{"authors": ["Matt Warwick", "www.facebook.com"], "date_download": "2025-04-26 07:03:48", "date_modify": "2025-04-26 07:03:48", "date_publish": "2025-02-28 07:48:33", "description": "Tom Pidcock says he is refreshed following his departure from Ineos Grenadiers - but he has a lot to prove in 2025.", "filename": "sport_cycling_articles_c4gpp2xl9w7o_1745651028.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4dcc/live/ba10b470-f515-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cycling_articles_c4gpp2xl9w7o_1745651028.html", "title": "Tom Pidcock: Can cyclist win big and why did it not work out at Ineos Grenadiers?", "title_page": "Tom Pidcock: Can cyclist win big and why did it not work out at Ineos Grenadiers? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tom Pidcock said goodbye to Ineos Grenadiers at a training camp in December in Denia, Spain, \"on good terms\" following a career-defining three years which ended with the 25-year-old being \"no longer compatible\" with one of cycling's biggest and most successful teams.\nA couple of months later he looked a man unleashed as he blasted away from his pursuers on the second stage of his debut race for his new second-tier Q36.5 team, winning comfortably between steep sandstone rocks during the Alula Tour - a race where he would go on to win the overall green jersey.\nThe only thing missing was any of his true rivals for the big race wins this year. It made Pidcock look imperious in Saudi Arabia, but it's how he will look in Belgium and France as the season progresses that will define his year - and possibly the double Olympic mountain bike champion's road-race career.\nVery little information about how the relationship with one of Ineos' biggest talents broke down has made it outside the team bus. Which leaves many looking for clues within what both team and athlete say - even while they are trying not to say much.\n\"I think it's as simple as the word 'compatibility',\" said Ineos CEO John Allert during a pre-season press call. \"There's no guarantees in life... I think Tom and the team probably realised we'd come to a point of recognising that.\n\"I think the whole Tom topic might be one for a book in 10 years' time.\"\nIt's as telling, especially in Allert's last line, as it is diplomatic.\nThere's little doubt there was a fallout: they dropped him from competing in the final big race of last season - the Il Lombardia 'monument' classic across Italy's wealthy northern region. A one-day event Pidcock was perfect for.\nPidcock himself gave his own clues to BBC Sport during his second training camp before the new season. \"I feel fresher, more energised. I feel like it's my own journey, taking control and being in charge of my own destiny. It's a really nice feeling as well.\"\nThe past few seasons had seen Ineos shift from a winning machine to a more relaxed and autonomous environment, which would seemingly suit a young, nonchalant, multi-discipline athlete such as Pidcock.\nThey were happy to see him throw himself into a lake off a speedboat on Instagram, or fly at breakneck speed down the dirt tracks of the Alps for Olympic glory on a different kind of bike.\nBut road cycling is changing and Ineos are making a transition into a modern 'super-team'. This includes last year's introduction of performance director Scott Drawer and a search for more sponsors on top of the already substantial backing of Ineos owner Sir Jim Ratcliffe, which requires a refocus on what was their original objective as Team Sky: to win the Tour de France, again and again.\nPidcock himself remains confident he is capable of winning a three-week race - he has won one of the hardest stages of the hardest race of them all, of course, descending his way to folklore at 100km/h before climbing Alpe d'Huez to victory during the 2022 Tour de France.\nPidcock, however, won't be there in 2025 as cycling's biggest race would have been unlikely to accept Q36.5 this year - given their current lower UCI ProTeams status, they will rely on wildcard invites to this year's biggest World Tour races.\n\"I'm happy, I've got a year out from it... a break. When I come back it'll be [with] a refreshed energy,\" he said.\nQ36.5 will make it to at least one three-week Grand Tour this year and it allows Pidcock to focus on the one-day races, where he has excelled in recent seasons.\nHis next objective must be to win one of the five 'monument' one-day races. \"Italian races, Ardennes [classics]... all these races I want to perform in, and now be a bit more focused on them.\"\nIt's a focus which begins this weekend with the spring classics 'opening weekend', the Omloop Nieuwsblad race in Belgium.\nTeam boss Doug Ryder, a fellow South African, led that team. And while anyone would expect an employer to be excited about their new charge, Ryder's view of Pidcock is effusive.\n\"[Pidcock's] attention to detail is next-level,\" he says. \"He focuses on every millimetre. We did a nice team-building event, and it was Tom's idea, and then he wouldn't let the team pay - just those personal things are just really, really cool.\"\nQuite the team player for a man considered by some to be the opposite at Ineos. And it's likely the biggest clue of all when it comes to Pidcock's Ineos era...\n\"Within our team, he doesn't have to fight for leadership,\" concludes Ryder. \"He will be our out-and-out leader when we go to those races.\n\"He wants to be a world champion. And he wants to ride for general classification in a Grand Tour, and show that he's one of those riders that can stand tall on the podium in the highest endurance events in our sport.\"", "url": "https://www.bbc.co.uk/sport/cycling/articles/c4gpp2xl9w7o"}