{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 05:17:25", "date_modify": "2025-05-21 05:17:25", "date_publish": "2025-04-03 16:32:03", "description": "Two St Johnstone games with big implications for Celtic", "filename": "sport_articles_c0l0pd1e2epo_1747804645.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96ff/live/0ad4dab0-10a7-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0l0pd1e2epo_1747804645.html", "title": "Two St Johnstone games with big implications for Celtic", "title_page": "Two St Johnstone games with big implications for Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Games against St Johnstone don't normally feature too prominently on the radar of most Celtic fans. That's all about to change this month.\nThe two upcoming clashes with Simo Valakari's side will set the tone for the climax to the Parkhead side's season.\nThe first is this weekend at McDiarmid Park, Celtic's last away league fixture before the Premiership split. Top travelling to rock bottom, having not dropped a single point in Perth in the best part of a decade.\nBrendan Rodgers' side scored six without reply the last time they were. The aggregate score so far this season is 10-0 in Celtic's favour. You get the drift. It's the away assignment the champions would have hand-picked at this 'business end' of the season.\nWere they to extend their winning streak on Saints' patch from 15 in a row to 16, Celtic would be a maximum of two wins away from the title, with another struggling side, Kilmarnock, coming to Parkhead on the final day before the league divide.\nKillie haven't won since mid-February. They haven't won at Celtic Park since 2012. As title run-ins go, the script is looking pretty good for Celtic as they look to get the job done as early as possible.\nPlan A is to be just one win away from retaining the title by the time they renew acquaintances with St Johnstone at the national stadium on 20 April with a place in the Scottish Cup final up for grabs.\nThe speed and skill of Daizen Maeda, Jota and Nicolas Kuhn on the open expanse of Hampden Park will take a lot of subduing. Despite two derby defeats to Rangers this year, Celtic's march towards another treble shows little sign of slowing.\nSt Johnstone are fighting to avoid relegation and will give everything they have in both matches, with their best chance of success against Celtic clearly coming on their own pitch.\nIt would be an almighty upset, however, were Celtic not to prevail in both encounters. Which would leave Brendan Rodgers contemplating the final flourish to the season he's been planning for.", "url": "https://www.bbc.com/sport/articles/c0l0pd1e2epo"}