{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:21:27", "date_modify": "2025-05-20 14:21:27", "date_publish": "2023-07-29 08:31:30", "description": "Ahead of Sunday's All-Ireland Football final, BBC Sport looks at how Kerry captain David Clifford became the GAA's biggest headline attraction.", "filename": "sport_gaelic-games_66316478_1747750887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77DD/production/_130558603_clifford-index.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gaelic-games_66316478_1747750887.html", "title": "David Clifford: How Kerry's 'ultimate winner' became the GAA's biggest superstar", "title_page": "David Clifford: How Kerry's 'ultimate winner' became the GAA's biggest superstar - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four All-Ireland titles (one as captain), eight Munster crowns, three All-Stars, a footballer of the year award and a man-of-the-match performance in an All-Ireland final.\nAs one of the greatest defenders to ever play the game, there isn't much Kerry legend Seamus Moynihan hasn't seen or done in Gaelic football.\nHe achieved greatness alongside some of the finest talents to ever pull on the famous green and gold jersey, but even he was taken aback the first time he laid eyes on a young David Clifford.\n\"He had a beautiful left leg. You could see he had something. He's an exceptional talent,\" Moynihan said on The GAA Social podcast.\nMoynihan has done a bit of coaching since retiring from Kingdom duty in 2006. He coached an East Kerry minor team that featured Clifford before taking over as manager of Fossa, Clifford's club, in late 2017.\nBy then, Clifford was already being touted as the next big thing, his reputation enhanced enormously by a frankly ridiculous 4-4 tally in the 2017 All-Ireland Minor final as Kerry ran riot over Derry.\nEven before his senior debut for the Kingdom, he was generating more headlines than most and being heralded as the next Maurice Fitzgerald or Colm Cooper. The hype was immense.\nAt Fossa, Moynihan was struck by both Clifford's maturity and scoring prowess.\n\"When I coached Fossa he was still only a young lad, maybe 18 or 19. As an 18 and 19-year-old he was playing well beyond his years,\" he said.\n\"He was taking serious hits, he was doing stuff that he shouldn't have been doing and he was getting crazy scores.\n\"You can say it was against a lower level or junior level but you could still just see this guy was different class.\"\nClifford's journey since those formative years under Moynihan's watchful eye has been nothing short of sensational.\nStill only 24, he is already indisputably one of the greatest players of all time, while some even regard him as the greatest. Securing a second Celtic Cross medal with victory over Dublin on Sunday would only strengthen their argument.\nA languid, at-times-unmarkable attacking genius, Clifford has already tucked away an All-Ireland title, four All-Stars, a footballer of the year award, five Munster championships and three National League successes.\nHe is a genuine superstar, a man for whom being mobbed by selfie-hunting youngsters after matches has become commonplace.\nOf course, his brilliance has not been confined to the senior inter-county arena. He's won a host of underage titles, while earlier this year, he tucked away an All-Ireland Junior Club medal with Fossa.\nHe occupies a special place in the hearts of Kerry fans and now stands on the cusp of captaining the Kingdom to a second successive Sam Maguire, a feat the county has not achieved since 2007.\n\"He's a guy who keeps himself to himself but he's an ultimate winner, he sets out every day to be a winner and goes out to win,\" added Moynihan.\n\"The way he's playing at the minute, he's just on fire.\n\"He's immensely strong, pulls himself through games - the only way you can beat David Clifford is to deprive him of the ball because once he has that ball he's basically unstoppable.\n\"He's up with the best of them and he's only 24.\"\nHowever, to paint Clifford's journey with Kerry as pain-free would be to distort the truth. There have been disappointments and agonising defeats.\nOne of Clifford's most excruciating experiences with Kerry came in 2019. Having bowed out of the Super 8s the previous year, Kerry rebounded to reach their first All-Ireland final since 2015.\nStanding between them and the promised land was Dublin. But not just any Dublin team, one looking to rewrite the history books with an unprecedented fifth All-Ireland title in a row.\nClifford was upstaged twice: first by Jack McCaffrey in the drawn game and then by Ciaran Kilkenny in the replay as Dublin completed their 'Drive for Five'.\nMuch has changed in the four years since. The pandemic upended the sport, both management teams have changed while key Dublin figures such as McCaffrey, Paul Mannion and Stephen Cluxton stepped away from the inter-county grind, only to return this year.\nMost importantly, Kerry got their hands back on Sam, and while Galway star Shane Walsh eclipsed Clifford's 0-8 tally in last year's final, it was Clifford who was named man of the match and gathered all the subsequent plaudits to secure his place in the sport's pantheon of greats.\nThis year, Clifford and his brother Paudie - another key Kerry attacker - endured personal tragedy when their mother, Ellen, passed away just before the Munster final in May.\nWith the brothers having been praised for honouring her memory by starring in the victory over Clare, beating Dublin on Sunday would cap an emotional year for Clifford.\n\"They probably weren't as good against Monaghan but still did enough to get to the final.\n\"I think this is going to be a really, really brilliant game. You have a team definitely wanting to win one more for all those boys and you have a Kerry team with one of the best players we have ever seen in our lifetimes.\n\"Kerry have a younger average age, 26, compared to Dublin's 30 - that would have to be a help but it's going to be a phenomenal game. Both teams will die in their boots for this one.\n\"If Kerry win it you'd like to think they'll be there or thereabouts for the next few years and if Dublin win it they're going to copper-fasten their legacy, finishing on a high by going up the steps at Croke Park to lift the Sam Maguire in an All-Ireland final.\n\"This Kerry team last year played an outstanding brand of football, this year you look at a few games and you would have to say they haven't played with the same hunger or intensity.\n\"At times some of the players were playing well below their level, but to be fair to them they have turned it since the Louth match - there has been a massive turnaround in terms of work-rate and hunger, that appetite.\n\"It's certainly back to the levels they were last year.\"", "url": "https://www.bbc.com/sport/gaelic-games/66316478"}