{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:57", "date_modify": "2025-05-21 06:15:57", "date_publish": "2025-01-08 10:49:44", "description": "Somerset all-rounder Archie Vaughan, son of former England captain Michael, will captain England U19s on their tour of South Africa later this month.", "filename": "sport_cricket_articles_cx2w2nz74z0o_1747808157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/93a4/live/2c31fd30-cdab-11ef-aa44-e1a2ca968acf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx2w2nz74z0o_1747808157.html", "title": "Archie Vaughan to captain England Under-19s on tour of South Africa", "title_page": "Archie Vaughan to captain England Under-19s on tour of South Africa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Somerset all-rounder Archie Vaughan, son of former England captain Michael, will lead England Under-19s during their tour of South Africa which begins later this month.\nEngland's Young Lions play three youth one-day internationals and two youth Tests against South Africa Under-19s, starting on 17 January.\n\"I found out that I was going to be captain during the training camp before Christmas and it was a very special moment,\" said Vaughan, 19, who signed his first professional contract at Somerset last May.\n\"To get the opportunity to represent England at this level is really special in itself, but to lead the team out is something else.\"\nVaughan played four first-class and seven 50-over matches for Somerset last season, having made his debut for the county in July.\nHe averaged 33.71 with the bat in the County Championship but also caught the eye with his off-spin, taking 15 wickets including two five-wicket hauls.\nHis father was one of England's most successful Test captains, winning 26 of his 51 Tests in charge and leading his side to victory in the iconic 2005 Ashes series against Australia.\n\"If someone had told me 12 months ago that I would have forced my way into the Somerset first team and be captaining the Under-19s, I wouldn't have believed them,\" Vaughan said.\n\"It's happened quickly but I'm going to keep my feet on the ground and work harder and harder.\"\nVaughan made his Somerset debut in the same week 16-year-old Rocky Flintoff, the son of former England all-rounder Andrew, made his first appearance for Lancashire.\nFlintoff was also part of the training group in South Africa before Christmas but has since been promoted to England Lions squad for their tour of Australia this month, where he will be coached by his father.\nThat tour begins on 14 January.\nEngland U19s squad for tour of South Africa: Archie Vaughan (Somerset - captain), Farhan Ahmed (Nottinghamshire), Tazeem Ali (Warwickshire), Ben Dawkins (Kent), Kesh Fonseka (Lancashire - Test squad only), Alex French (Surrey), Alex Green (Leicestershire), Jack Home (Worcestershire), James Isbell (Middlesex), Eddie Jack (Hampshire), Ben Mayes (Hampshire), James Minto (Durham), Harry Moore (Derbyshire), Joe Moores (Lancashire - ODIs only), Thomas Rew (Somerset), Aaryan Sawant (Middlesex), Naavya Sharma (Middlesex), Alexander Wade (Yorkshire)", "url": "https://www.bbc.com/sport/cricket/articles/cx2w2nz74z0o"}