{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:25:45", "date_modify": "2025-05-20 12:25:45", "date_publish": "2023-08-04 11:56:08", "description": "Crusaders manager Stephen Baxter says the referee showed \"poor judgement\" in dismissing Paul Heatley late in the defeat by Rosenborg.", "filename": "sport_football_66404530_1747743945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14748/production/_130648738_sb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66404530_1747743945.html", "title": "Europa Conference League: Stephen Baxter criticises referee after Crusaders defeat", "title_page": "Europa Conference League: Stephen Baxter criticises referee after Crusaders defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crusaders boss Stephen Baxter says the referee showed \"poor judgement\" in dismissing Paul Heatley late in the defeat by Rosenborg in Norway.\nHeatley was shown a second yellow for kicking the ball away as the Crues lost the Europa Conference League qualifier 3-2 to go out 5-4 on aggregate.\n\"The manner of the defeat is so disappointing - to get Paul sent off for nothing at all,\" said Baxter.\n\"I can't tell you how proud I am of this team over the two games.\"\nCrusaders took Rosenborg, who have reached the Champions League group stages in the past, to extra-time and Heatley was sent off for two yellow cards by referee Adam Farkas before Leo Cornic netted the winner.\n\"It's poor, poor judgement by the referee to not have a chat with him and say 'don't do it again' or whatever the case may be,\" Baxter told Crusaders FC social media.\n\"You need some common sense to be applied given we were in the lion's den with a 15,000 crowd coming at us.\n\"To hold a team of this magnitude to extra-time and be a hair's breadth of penalty kicks is just phenomenal and to say it's our best performance in Europe is absolutely true.\"\nLarne faced an uphill task after losing 3-0 to FC Ballkani in Kosovo in the first leg of their second-round qualifier and a 4-1 defeat at Solitude left it 7-1 on aggregate.\n\"It's been a tough two legs - they are a top side but I think there were a lot of positives in our game in what we did and how we did it,\" said Inver boss Tiernan Lynch.\n\"There were periods of the match where we carried out our gameplan well but other parts where we need to do better. We were hugely frustrated by the goals we did concede but it is what it is.\n\"That's the level for us, that's where we want to be, these are the games we want to be involved in and we want to learn from them. We want to be able to progress from them at some stage.\"", "url": "https://www.bbc.com/sport/football/66404530"}