{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:00", "date_modify": "2025-05-21 07:46:00", "date_publish": "2025-01-30 21:34:32", "description": "Luton Town sign Exeter City forward Millenic Alli in a deal BBC Radio Devon understands to be worth £1.5m.", "filename": "sport_football_articles_cvgem2z13deo_1747813560.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7369/live/b22f65b0-def1-11ef-979f-05eee0cfa3a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgem2z13deo_1747813560.html", "title": "Millenic Alli: Luton Town sign Exeter City striker", "title_page": "Millenic Alli: Luton Town sign Exeter City striker - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town have signed Exeter City forward Millenic Alli in a deal BBC Radio Devon understands to be worth £1.5m.\nThe 24-year-old moved to the Grecians from non-league FC Halifax Town a year ago and scored 16 goals in 43 appearances.\nHe is Exeter's top scorer this season with 12 goals in all competitions.\nHe moves to a Luton Town side who have scored the third-fewest goals in the Championship and are second-from-bottom of the table, a season after being relegated from the Premier League.\n\"Milli is a player who we have come up against a few times and he's always impressed with his pace, power and individual dribbling ability to get his team up the pitch,\" Luton boss Matt Bloomfield told the club website.\n\"If you look at the goals he has scored – even Tuesday evening, two headers, one at the back post – he's a brave boy, and with his non-league background, he has a real hunger to prove himself at the levels above.\n\"Physically, he's got the capabilities to step up and with some work on the training ground with us, and that desire and pace at the top of the pitch, we believe that he can be a good asset for us both now and developing further into the future.\"\nThe deal represents another impressive piece of business for Exeter City.\nThe Grecians have prided themselves on nurturing players through their academy as well as bringing in players and selling them on for large fees.\nThe club has received fees and sell-ons in excess of £1m for players such as Sam Nombe, Jay Stansfield, Ethan Ampadu and Joel Randell in recent years.\n\"Part of the club's vision is to develop players from both inside and outside the Academy,\" Exeter City chief executive Joe Gorman told the club website.\n\"Thanks to Gary (Caldwell, manager) and the football staff, we are increasingly recognised as a club which develops and transitions players to higher levels, something which is again evidenced by this sale.\n\"This significant sum will be reinvested back into the club, to help fund first-team improvements, academy growth and overall club development.\n\"Selling players at the right time is a vital part of the club's strategic long-term vision.\"\nMeanwhile, on-loan midfielder Tom Krauss has left Luton early for personal reasons and returned to parent club Mainz.\nThe German made 23 appearances for the Hatters, scoring twice.", "url": "https://www.bbc.com/sport/football/articles/cvgem2z13deo"}