{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:41:04", "date_modify": "2025-04-26 03:41:04", "date_publish": "2025-03-05 09:08:42", "description": "The Football Association says Millwall keeper Liam Roberts' three-match ban for a challenge on Crystal Palace striker Jean-Philippe Mateta is \"clearly insufficient\".", "filename": "sport_football_articles_cz03920e4ydo_1745638864.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c418/live/ded03230-f99e-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz03920e4ydo_1745638864.html", "title": "Liam Roberts: FA wants Millwall goalkeeper's ban to be extended", "title_page": "Liam Roberts: FA wants Millwall goalkeeper's ban to be extended - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Football Association wants the three-match ban given to Millwall goalkeeper Liam Roberts for a dangerous challenge on Crystal Palace striker Jean-Philippe Mateta to be extended.\nRoberts was sent off in the eighth minute of Millwall's FA Cup fifth-round defeat at Selhurst Park on Saturday for a high challenge which left Mateta needing 25 stitches around his left ear.\nThe FA said the standard three-game ban for serious foul play is \"clearly insufficient\" and has submitted a claim to a regulatory commission to increase it.\nBBC Sport has been told that Millwall will contest the claim. They have until Tuesday to respond to the FA.\nThe club said in a statement that they will \"continue to support\" Roberts after the \"horrendous online abuse\" he has received.\nIf the FA's claim is successful, the commission will determine a new punishment. If the claim is dismissed, the three-game ban will remain in place.\nIn 2023 Fulham striker Aleksander Mitrovic had a three-game ban increased to eight following an FA claim, after he pushed referee Chris Kavanagh during an FA Cup defeat by Manchester United.\nIn 2013 an FA appeal to extend Chelsea forward Hazard's three-match ban was dismissed. He was sent off for kicking a 17-year-old ball boy during a League Cup defeat by Swansea.\nOn Saturday Palace chairman Steve Parish described Roberts' challenge as \"the most reckless I've ever seen\" and that he \"endangered a fellow professional and maybe his life\".\nOn Monday Millwall said reporting of the incident \"contributed to an unwarranted character assassination\" of Roberts.\nMillwall said he contacted Mateta after the match \"with an apology which was accepted immediately\".\nRoberts served the first game of his ban as Millwall lost 2-0 to Bristol City in the Championship on Tuesday.\nMillwall supporters showed their support by holding a minute's applause after eight minutes and singing \"there's only one Liam Roberts\". There were also some boos.\nMichael Oliver, who refereed the game, will not be involved in a Premier League match this weekend.\nHe sent Roberts off after intervention from the video assistant referee (VAR).", "url": "https://www.bbc.co.uk/sport/football/articles/cz03920e4ydo"}