{"authors": ["Francis Keogh", "Sonia Oxley", "www.facebook.com"], "date_download": "2025-05-21 07:26:48", "date_modify": "2025-05-21 07:26:48", "date_publish": "2025-01-04 06:28:39", "description": "Luke Littler has become darts' youngest world champion. BBC Sport looks at the qualities that have taken him to the top.", "filename": "sport_darts_articles_cn087q8y542o_1747812408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e5e/live/1b9783b0-c9db-11ef-b056-6f0ecb5a0ddb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cn087q8y542o_1747812408.html", "title": "Luke Littler: the mind and the making of darts' youngest world champion", "title_page": "Luke Littler: the mind and the making of darts' youngest world champion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Darts is a sport where you just cannot afford nerves to get to you - a tremble is often the end of a treble.\nWhat sets Littler apart from his rivals is the fact he has been able to master essential calmness at such a young age - and amid an explosion of interest in the sport and him as a direct result of his arrival on the big stage a year ago.\n\"It's like water off a duck's back really, the way he just sort of takes it all in his stride,\" sports psychologist and former women's world number one darts player Dr Linda Duffy told BBC Sport.\n\"It's almost like he's not really 100% sure of what's going on around him. He's in that sort of bubble where he's just thinking about what he needs to do, which is fantastic.\n\"He's certainly very cool, calm and collected under pressure.\n\"What a lot of people who don't play darts don't understand is how difficult it is to play. You've got all this adrenaline, all the emotions whirling round inside you and you have to stay as steady as a rock to throw that dart properly at the target.\"\nLittler admitted he had felt nervous after going 2-0 up in Friday's final but told himself to \"just relax\".\nThe only time he has really let any pent-up emotions spill over in the past year was after his opening win over Ryan Meikle last month, when he became tearful during his post-match interview and sought out hugs from his parents.\nIt was, perhaps, one of the few times he has looked more like his age.\nHis lifestyle away from the oche, though, is much more in line with plenty of teenagers - video games, football, fast food - and it is this that could also be playing a part in his mental strength, according to Duffy.\n\"This all helps him when it comes to having to cope with pressure because he knows how to relax and get some downtime in,\" she said.\nLittler's mental approach is founded on a \"very deep and absolute trust\" in his ability, according to sports psychologist Martin Perry.\n\"What he's doing all the time, he's trying to fine-tune the feeling to get into the quality of focus and concentration where it feels like everything's happening automatically,\" he said. \"You're playing unconscious darts and you're scoring big and making checkouts.\n\"Luke's calmness is really invaluable in allowing him to stay in a bubble of high-focus concentration, which means he can repeat high-scoring sequences regularly.\"\nIt is Littler's scoring power when under pressure which has stood out in this tournament.\nIf trebles are for show and doubles for dough, he has both bases covered.\nEven that rare bout of nerves in the 3-1 win over Meikle culminated in him creating more history.\nThe teenager was in tears through a mixture of relief and satisfaction after hitting a record 140.91 set average – taking 32 darts to complete the set, when the minimum possible is 27.\nHis pace of play and shot selection, sometimes taking an alternative route to the norm, has even caught out seasoned darts 'spotters' on TV coverage as they alert directors to the next camera angle.\nHe hit four nine-darters last year, including in the Premier League final – one of 10 titles in his debut professional season – and revels in taking out the highest possible checkout of 170, a crowd-pleasing treble 20, treble 20 and bullseye known as 'The Big Fish'.\nLittler is lethal on double 10, which also acts as a back-up shot if he misses double tops, while others might prefer double eight or 16 on the opposite side of the board.\nDespite his quick thinking, he has admitted to being \"terrible\" at maths at school.\n\"It's just the longer you practise, the quicker you get to know checkouts, scoring and finishing up and laying up your shots and you know what to go for. So the more you play, the more you get used to it,\" he said.\nThere has been plenty of play, having started throwing magnetic darts aged just 18 months and moving to a proper board by the age of five.\nLittler's journey at last year's PDC World Championship captured the public's imagination, with the final becoming the most-watched sports event outside football in Sky Sports' 34-history.\nA media whirlwind ensued, endorsements soon followed and youngsters began picking up arrows at a rapid rate.\nHe firmly took the limelight from those at the top of the sport, with world number one Luke Humphries joking people kept realising they were talking to the 'wrong Luke' when speaking to him.\nLittler earned more than £1m in prize money last year in a trophy-laden season but appears to have remained grounded - even if his eyes widened considerably while he took in the announcement of the £500,000 prize he banked on Friday.\n\"It sounds a bit cliche but the family will never forget where they've come from. He's earned a lot of money really fast but has his feet firmly on the floor,\" said Garry Plummer, the boss of sponsors Target Darts, who first signed a deal with Littler's family when he was aged 12.\n\"There are two Luke Littlers. He's quiet and he's humble, and then he gets on that stage and he wants to entertain. He's like a seasoned pro.\"", "url": "https://www.bbc.com/sport/darts/articles/cn087q8y542o"}