{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:05:51", "date_modify": "2025-05-19 15:05:51", "date_publish": "2015-02-16 23:52:40", "description": "Man Utd boss Louis van Gaal hails his side's \"unbelievable spirit\" as they come from behind to beat Preston in the FA Cup.", "filename": "sport_football_31498082_1747667151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81050000/jpg/_81050419_louisvangaal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31498082_1747667151.html", "title": "Man Utd: Louis van Gaal hails 'unbelievable' spirit in FA Cup win", "title_page": "Man Utd: Louis van Gaal hails 'unbelievable' spirit in FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Louis van Gaal praised his side's \"unbelievable team spirit\" as they came from behind to beat Preston in the FA Cup fifth round.\nScott Laird gave the League One side the lead but goals from Ander Herrera and Marouane Fellaini, and a Wayne Rooney penalty secured victory.\nUnited will host Arsenal in the quarter-finals and Van Gaal said: \"I was reasonably satisfied.\n\"But we showed an unbelievable team spirit after the Preston goal.\"\nUnited failed to register a single shot on target in the first half but improved when the ineffective Radamel Falcao was replaced by Ashley Young after Preston had taken the lead.\nFellaini was then pushed into attack and, after Herrera's shot snuck in, the Belgium international poked in United's second to give them a lead they never relinquished.\n\"We changed the shape and that was the solution,\" added Van Gaal.\n\"We can always overcome the pressure with Fellaini and he scores goals also.\n\"I played him for the first time in the position he wants but I have not always got a position for him and that's my problem.\"", "url": "https://www.bbc.com/sport/football/31498082"}