{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:59:24", "date_modify": "2025-05-20 12:59:24", "date_publish": "2023-07-26 00:00:00", "description": "Reaction as Spain beat Zambia to reach last 16 of the 2023 Women's World Cup.", "filename": "sport_live_football_65565257_1747745964.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/057A/production/_130520410_gettyimages-1571527610.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65565257_1747745964.html", "title": "Fifa Women's World Cup LIVE: Watch Spain vs Zambia score, commentary & updates from Group C game", "title_page": "Fifa Women's World Cup LIVE: Watch Spain vs Zambia score, commentary & updates from Group C game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nThat's the end of this live text, thanks for joining us today.\nWe'll be back in an hour and 15 minutes (in a different live page) for the Republic of Ireland's date with destiny against Canada.\nBye for now.\n'This is a different Spain to the Euros'\nFT: Spain 5-0 Zambia\nAnita Asante\nFormer England defender on BBC Two\nThe Japan game will be an exciting test. What we need to remember is players like Hermoso weren't available in the Euros. Now they have them back.\nPost\nFT: Spain 5-0 Zambia\nKatie Smith\nBBC reporter at Eden Park\nA couple of the Zambia players sink to the grass.\nThey really gave that everything but their World Cup exit is confirmed and the wait for a first goal goes on too.\nPost\nSpain 5-0 Zambia\nSpain play Japan on Monday in the final group game. They just need a draw to finish top. If the Japanese win, they have top spot.\nThey will play the top two teams from Group A (in the opposite order) - so Switzerland, New Zealand, the Philippines or Norway.\n'VAR has been used well'\nSpain 5-0 Zambia\nKaren Bardsley\nFormer England and Manchester City goalkeeper on BBC Two\nSo far, every time VAR has been involved, they have been correct.\nIt seems like we are heading in the right direction.", "url": "https://www.bbc.com/sport/live/football/65565257"}