{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-20 12:58:29", "date_modify": "2025-05-20 12:58:29", "date_publish": "2023-08-02 17:01:13", "description": "Lauren James has become an overnight sensation but dad Nigel tells BBC Sport he is not surprised at her success for England at the Women's World Cup.", "filename": "sport_football_66385871_1747745909.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/844F/production/_130617833_gettyimages-1587327763.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66385871_1747745909.html", "title": "Lauren James: Dad Nigel 'not surprised' as the England forward stars in Australia", "title_page": "Lauren James: Dad Nigel 'not surprised' as the England forward stars in Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I pinch myself every day. Most parents would only dream to have one England international, never mind two.\"\nThe lashing rain just outside Marlow in Buckinghamshire is powerless to dampen Nigel James' beaming sense of pride at the recent events in the Adelaide heat.\nDaughter Lauren James, younger sister of 23-year-old Chelsea and England men's star Reece, is leading the Lionesses' charge at the Women's World Cup in Australia.\nThe 21-year-old produced the standout performance of the tournament as she scored twice and assisted three goals in England's crushing 6-1 win over China on Monday.\nBut dad Nigel, who is the first father since records began to have children play for both the men's and women's England teams, says he is \"not surprised at all\" by his daughter's success.\n\"Everyone who has seen Lauren play from six or seven-years-old knows how good she is,\" James told BBC Sport.\n\"It's brilliant, it's quality but that's Lauren. She has trained all her life, she's dedicated and she's been obsessed with being a footballer. It's all she has ever wanted to do.\n\"She always wanted to compete against boys and has trained against top academy players who are playing in the Premier League today.\"\nWhen she was a child, Lauren played alongside brother Reece and the likes of Chelsea and England men's midfielder Conor Gallagher in a team James Sr coached.\nJames manages his own coaching business and aims to help young people achieve their ambitions.\nSpeaking to the BBC in 2021, he said the siblings played football every day growing up.\n\"If they weren't playing with friends after school, they were playing with each other. There are not many families that had the contact time they had; they had a field and all the equipment they needed. They had poles, goals, and football after football because I was a coach.\n\"There where times I coached them, but if I didn't, things were set up so that they went out and repeated what we'd done in a session, working on things.\"\nLauren was training with Arsenal women as a 13-year-old, before joining a newly formed Manchester United side in the Women's Championship. She moved to Chelsea in 2021 and made her England debut in 2022.\n\"I had to do some work at Lauren's place,\" he said. \"Her mum is out there and I've been the removal man. Driving around in the van and carrying the washing machine around. I'm not there in Australia so I'm here and I feel like I'm doing something for my children.\n\"I've just been watching at home in my own peace with friends and family. When she scored we just looked at each other, and then at the screen, and then gave each other a cuddle.\n\"You just think, 'Wow'.\n\"I've seen her do things like that before. She has an unbelievable technique that she has worked on for many years, but when you see it at the World Cup, it's amazing.\n\"I'm very proud to say we are the first family to produce two kids - one male and one female - playing for England [since records began].\"\nFollowing the game James shared a few quiet words of encouragement with his daughter on the phone.\n\"I spoke to her after the game and told her how proud I was,\" he added. \"I told her how she had made the whole family and the country proud. To keep going, keep believing, get her rest and go again.\n\"She just said, 'Thanks dad'.\"\nHaving overseen Lauren's development from a young age, Nigel, whose non-league career was cruelly cut short by injury before he turned to coaching, says something would have been \"really wrong\" if his daughter did not hit the heights.\n\"There was a time where people were focused on fitness and her work off the ball but sometimes you have to focus more on what they can do and not what they can't do,\" said James.\n\"Me and her brothers had to keep drumming into her how fantastic she is. She manipulates the ball and it's easy and there is no pressure.\n\"We don't see too many Diego Maradonas or Ronaldinhos anymore, so to be on the female side, when you see a player like that, you have to think to yourself 'wow'.\"\nJames's three goals make her the joint-second top scorer in the World Cup, one behind Japan's Hinata Miyazawa.\nAsked if she could become a future Ballon d'Or Feminin winner, James said: \"She can take it as far as she wants. If she remains fit and keeps developing, why not?\"\nEngland's last-16 tie with Nigeria will be broadcast live on BBC One on Monday, 7 August at 08:30 BST.", "url": "https://www.bbc.com/sport/football/66385871"}