{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:14", "date_modify": "2025-05-21 05:51:14", "date_publish": "2025-04-02 09:45:34", "description": "Liverpool vs Everton: 'Definitely a sense of owing Everton one'", "filename": "sport_football_articles_c74n8dzjkzqo_1747806674.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aa7/live/d07808b0-0f16-11f0-acc1-239a761fa7cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c74n8dzjkzqo_1747806674.html", "title": "'Definitely a sense of owing Everton one'", "title_page": "Liverpool vs Everton: 'Definitely a sense of owing Everton one' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Athletic's Liverpool reporter James Pearce believes the memories of the final Merseyside derby at Goodison Park will be \"looming large\" when the Reds host Everton on Wednesday.\nThere were four red cards handed out after full-time of the 2-2 draw, including for Arne Slot and his assistant Sipke Hulshoff.\nSince then, Liverpool have extended their lead at the top of the Premier League but been knocked out of the Champions League last 16 by Paris St-Germain and beaten in the Carabao Cup final by Newcastle\n\"There was definitely a burning sense of injustice in terms of some of the decisions that went against Liverpool,\" Pearce said. \"We saw those emotions bubble over.\n\"There's definitely that sense of Liverpool owing Everton one.\n\"The biggest thing for Liverpool going into this derby is they have to learn lessons from that Newcastle game. If you're Everton, you would look at what Newcastle did and the blueprint is there.\n\"They broke the game up, there wasn't much fluency and they were physical and combative. They outmuscled and outfought Liverpool and caused them a lot of problems from set-pieces.\n\"Liverpool can't let it become the game Everton want it to be in the same way they allowed Newcastle to dictate things at Wembley.\n\"I think there will be an element of those memories from Goodison looming large when Liverpool take to the pitch on Wednesday night.\"", "url": "https://www.bbc.com/sport/football/articles/c74n8dzjkzqo"}