{"authors": ["Katie Gornall", "www.facebook.com"], "date_download": "2025-04-26 07:07:39", "date_modify": "2025-04-26 07:07:39", "date_publish": "2025-02-28 06:02:06", "description": "A fan who was convicted of shouting a homophobic slur at a football ground tells BBC Sport why he wants to make amends.", "filename": "sport_football_articles_c1kjjw3rdd8o_1745651259.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afd7/live/973ce870-f51e-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1kjjw3rdd8o_1745651259.html", "title": "Football fan banned for shouting homophobic slur 'willing to make amends'", "title_page": "Football fan banned for shouting homophobic slur 'willing to make amends'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Steve was leaving the football ground when he shouted back at some away fans. Moments later he was in handcuffs and under arrest.\nHe had shouted a homophobic slur, committing a hate crime that led to him being charged with a Section 5 Public Order offence. The case ended up in court, where he pleaded guilty, and he was banned from attending football matches in the UK for three years.\nNow Steve - not his real name as he fears for the impact on his professional and personal life - is trying to make amends after coming through a fan education programme run by anti-discrimination charity Kick It Out.\nHere he shares his story with BBC Sport.\nA lifelong football fan, Steve had just watched his side play Chelsea and was leaving the stadium.\n\"I heard Chelsea fans shouting and I shouted back, 'Oi, you Chelsea rent boys', gave them a few gestures and thought nothing of it. I thought I was just having a bit of back and forth with the away fans,\" he said.\nWhat followed is all a bit of a blur.\n\"I walked away and then all of a sudden I was surrounded by six security guards. And then from that point, a police officer arrested me and put the cuffs on.\"\nSince January 2022, the Crown Prosecution Service has defined the \"Chelsea rent boy\" chant - aimed at the west London club's players and supporters - as a homophobic slur and says that anyone singing it is committing a hate crime and could face prosecution.\n\"I'm in my 20s and I didn't really understand that [term],\" Steve said. \"I knew there was stuff around it, but I didn't really perceive why it was homophobic.\"\nSteve was eventually referred to Kick It Out, which runs a fan education programme where offenders learn about the different types of discrimination and the impact their actions can have on victims.\n\"I accept that [what I did] was awful, and now it's about repaying that, turning that into something positive. I've had a look at myself... I'm willing to make amends,\" he said.\n\"People are going to make mistakes, but you're judged on how you then move forward.\"\nHe said the session had changed him \"massively\".\n\"It's made me aware of how there's a fine line between what's considered banter and just abuse.\"\nThe Kick It Out course is run by Alan Bush, the charity's fan education and engagement manager, who has delivered more than 400 sessions in the past five years. In that time, 40 fans were referred to him by either police or clubs for using the Chelsea slur.\n\"We can't ban our way out of discrimination and we can't just ban football fans from football. All we do is we push it back into society,\" Bush said.\n\"Football has a responsibility to educate its fans... then fans say to other fans 'you can't say that, mate, you'll end up in court' or 'you can't say that because that's wrong'. There's a chance they report, there's a chance that they challenge. And I just think that has to be a far better than just banning people.\"\nHe added that \"the vast majority have not understood the gravity of how offensive that [chant] can be, how that can cause harassment, alarm and distress to an individual\".\nTo illustrate his point, Bush tells the offenders the story of Lee Johnson, a passionate Tottenham fan who was forced out of football for nearly a decade after hearing the Chelsea chant inside White Hart Lane as a teenager.\n\"It completely shook me to my core,\" Johnson - who is now co-chair of the Proud Lilywhites, the LGBTQ+ supporters' association of Tottenham Hotspur - told BBC Sport.\n\"It felt like all of the lights had gone out and I was just isolated by myself. It just took me straight back to when I was younger at school. 'Rent boy' was one of the things I used to get [called].\"\nJohnson had often been a target for abuse in his home town. Football used to be an escape, somewhere he could \"get lost in the magic of the game\" but hearing homophobic chanting made him question everything.\n\"I was thinking 'Am I safe here?' If people around me knew that I was gay, would they be attacking me or be verbally abusive? Would they stop singing it about Chelsea and would they start singing it about me?\" he said.\n\"People were using a term that has caused a lot of harm to me over the years. It's very traumatic. I think it was still the first half and I just said to my friend, 'I can't be here'. It was a fight or flight response. I left and I didn't come back for nearly 10 years.\"\nSince 2023, the Football Association has also been able to charge clubs if their fans sing the chant.\nSeven charges have been brought against six clubs for homophobic chanting, according to English football's governing body. The clubs, which include Wolves, Leeds and Luton have been fined a total of £415,000.\nTwo charges raised against Tottenham Hotspur following their Premier League match with Manchester United on 29 September 2024 are yet to be decided.\nThe updated FA guidance, combined with the change in law, appears to be having the desired effect.\nFigures from Kick it Out show reports of mass homophobic chanting are falling, with 17 reported incidents last season, down from 43 in the 2021-22 season.\nSteve knows he has been part of the problem.\nHe has never considered himself homophobic but since he got arrested he has been through a spectrum of emotions.\n\"Fear. Annoyance. Despair. Guilt. But then came acceptance,\" he said.\n\"My journey has sort of been about personal growth. Now I want to make a difference going forward. I want to make football a better place.\"\nHe wants to make sure other do not repeat his mistakes, adding: \"Treat everybody with respect or you'll end up like me with a ban and a criminal record.\n\"Some people who are gay have walked away from football altogether and don't feel it's safe. So, if I can just stop one person from doing that. I'll be happy. Just think before you speak.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1kjjw3rdd8o"}