{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:33", "date_modify": "2025-05-21 05:31:33", "date_publish": "2025-04-02 20:10:47", "description": "Former Arda Kardzhali player Petko Ganchev attends their match against Cherno More as a special guest - two weeks after the club mistakenly announced his death.", "filename": "sport_football_articles_cp34nlpz7elo_1747805493.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f67f/live/7adb2bf0-0ffa-11f0-940a-2d1024e25c21.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp34nlpz7elo_1747805493.html", "title": "Petko Ganchev: Ex-player is match guest of club that wrongly announces his death", "title_page": "Petko Ganchev: Ex-player is match guest of club that wrongly announces his death - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bulgarian side Arda Kardzhali welcomed club great Petko Ganchev as a special guest to their match against Cherno More on Wednesday - two weeks after holding a minute's silence for him.\nArda mourned Ganchev before their match with Levski Sofia last month, wrongly believing he had died, with both teams lining up on the centre circle and bowing their heads.\nHowever, before that game had ended, Arda posted on social media to say they had received \"incorrect information about his death\" and that the 78-year-old was very much alive.\nGanchev was described as a \"legend\" and received a jersey with his name on it before Arda's match against Cherno More, which they won 4-0.\n\"Before the match Petko Ganchev saw the sport director Ivaylo Petkov, who gave him a jubilee jersey. He watched the match in the company of other Arda veterans,\" the club said.\n\"Once again we apologise to Petko Ganchev.\"\nGanchev said he had to reassure friends and family he was still alive because he was driving home when Arda mistakenly made their announcement of his death.\n\"When I heard the terrible news, I poured myself a small brandy,\" he told Bulgarian outlet Blitz.\n\"Being buried alive is quite stressful, really.\"", "url": "https://www.bbc.com/sport/football/articles/cp34nlpz7elo"}