{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:56:18", "date_modify": "2025-05-21 04:56:18", "date_publish": "2025-01-14 23:56:00", "description": "Nottingham Forest 1-1 Liverpool: 'We must not get a habit of not getting what we deserved' - Slot reacts to draw", "filename": "sport_football_articles_c8edkell0zko_1747803378.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3390/live/fb052c00-d2d2-11ef-86e4-31e50b6c5341.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8edkell0zko_1747803378.html", "title": "'We must not get a habit of not getting what we deserved'", "title_page": "Nottingham Forest 1-1 Liverpool: 'We must not get a habit of not getting what we deserved' - Slot reacts to draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool manager Arne Slot, speaking to BBC Sport: \"I am a little bit disappointed, although when you're 1-0 down against Nottingham Forest it is maybe a lot to ask for a win because they've hardly given away any chances in the recent games that they have played.\n\"That is why I couldn't ask for more from our players. They created so many chances in the second half but to not score from all of those chances was a little disappointing of course.\"\nOn Matz Sels: \"He was also like this at Anfield, but also all season. It isn't just their goalkeeper, but the way they defended and because of that maybe they deserved to not concede a second or third goal because they threw themselves for every ball and cross. They fight with everything they've got and the fans were really loud and helped them a lot.\n\"Still, we managed to create more than a few chances to score and that is what pleased me most and maybe, not for the first time this season, we didn't get what we deserved.\"\nOn what changed in the second half: \"We were a bit more patient in the second half. Maybe the intensity was a little bit higher but maybe the other team is a little bit more tired too.\"\nOn the Jota and Tsimikas substitutions: \"I just wanted to bring more attacking threat to the team and the fact we scored immediately was just a bonus.\"\nOn the result as a whole: \"We should be disappointed, although they are having a great season. We want to win every game and they probably want to win every game as well. With how the game went I think we can be disappointed.\n\"They are a counter-attacking team and I think we only conceded one counter-attack and for us to come from behind shows the character and quality the team has. We must not get a habit of not getting what we deserved because it happened at Tottenham and it happened today and the analysts might not agree but based on expected goals we deserved more than 2-2 draw against Manchester United too.\"", "url": "https://www.bbc.com/sport/football/articles/c8edkell0zko"}