{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:12:22", "date_modify": "2025-05-19 15:12:22", "date_publish": "2017-07-04 00:00:00", "description": "Rangers suffer arguably their worst ever defeat in European football as Progres Niederkorn knock them out of the Europa League.", "filename": "sport_live_football_40497360_1747667542.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_football_40497360_1747667542.html", "title": "How Rangers crashed out of Europe in Luxembourg", "title_page": "How Rangers crashed out of Europe in Luxembourg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pressure will pile on Caixinha and players\nFT Progres Niederkorn 2-0 Rangers (agg 2-1)\nManager Pedro Caixinha and his players will be enveloped in a whirlwind of criticism in the coming weeks. What a testing time they face. Somehow they will have to regroup and prepare for the domestic campaign. The result will also pile pressure on the Rangers board - have they appointed the right man in Caixinha? Is their signing policy the correct one? Where does this leave their rebuilding job? So many questions to be answered. We'll call it a night and keep our fingers crossed that Tommy Wright can lead his St Johnstone team to victory in Vilnius on Thursday. Thanks for your company. I'm too stunned to type.\nHorrific night for Rangers\nFT Progres Niederkorn 2-0 Rangers (agg 2-1)\nYou could make a list of things to try to put this into perspective: Rangers are out of Europe before Wimbledon has really got going, in the first full week of the school holidays, before some of their new signings have even arrived at the club. Progres weren't even playing at their home ground - the match had been moved to the national stadium. This was the Luxembourg minnows' first European win in 14 matches.\nHammer blow for Rangers and Scottish football\nFT Progres Niederkorn 2-0 Rangers (agg 2-1)\nThis result will be spoken about for many years, though whether it is mostly by Rangers fans or their Scottish rivals is debatable. In any case, it's a hammer blow for Rangers as they try to catch Celtic domestically and establish themselves in Europe once more. But it's also a stinker for Scottish football, with the coefficient withering across the seasons. St Johnstone are behind in their Europa League first leg against Trakai, Aberdeen join in at the next stage and Celtic have qualifiers to negotiate in the Champions League. Will any Scottish team reach the group stage of either of European football's club competitions?\n'A shameful performance'\nFT Progres Niederkorn 2-0 Rangers (agg 2-1)\nChick Young\nBBC Scotland\n\"That was a shameful performance by Rangers. Not one player that they have signed answered the call tonight. Some of them performed like amateur players. You have to applaud Progres Niederkorn. They had a belief at half time.\"\nLast-chance saloon\nProgres Niederkorn 2-0 Rangers (agg 2-1)\nRangers have hit the bar twice in the second half. They need to go closer than that in the next 60 seconds or they are out of Europe at the first hurdle.\nTime running out\nProgres Niederkorn 2-0 Rangers (agg 2-1)\nRangers need a touch of genius or a major stroke of fortune if they are to avoid a cripplingly embarrassing defeat in Luxembourg. They are throwing everything at it but Progres are defending for their lives.\n66.6% of Progres goals...\nProgres Niederkorn 2-0 Rangers (agg 2-1)\nHere's one way to look at what an upset this could be: tonight Progres have scored two-thirds of all the goals they have ever scored in European competition. This is their seventh European campaign since their debut in 1977-78.\nCLOSE!\nProgres Niederkorn 1-0 Rangers (agg 1-1)\nNiko Kranjcar wins a free-kick for Rangers on the edge of the D and takes on the set-piece. However, his dipping effort is just not dippy enough and it skims the roof of the net. Rangers are potentially one error away from being knocked out by the Luxembourg minnows.", "url": "https://www.bbc.com/sport/live/football/40497360"}