{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 13:39:25", "date_modify": "2025-05-20 13:39:25", "date_publish": "2023-07-25 11:06:02", "description": "Canada fight back from a goal down to beat the Republic of Ireland 2-1 and knock the debutants out of the Women's World Cup in Perth.", "filename": "sport_football_66290708_1747748365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1862/production/_130524260_gettyimages-1571934950.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290708_1747748365.html", "title": "Women's World Cup: Canada end Republic's hopes of progression", "title_page": "Women's World Cup: Canada end Republic's hopes of progression - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Canada fought back from a goal down to beat the Republic of Ireland 2-1 and knock the debutantes out of the Women's World Cup.\nIrish captain Katie McCabe scored the Republic's first World Cup goal when her superb corner flew into the net after just four minutes.\nThe Irish had chances to add a second against the Olympic champions, but they were undone in first-half injury time as Julia Grosso's cross took a touch off defender Megan Connolly and nestled in the bottom corner in torrential conditions.\nAdriana Leon poked Canada into the lead eight minutes into the second half and, although they pressed forward, the Republic could not find the goal they needed to keep their hopes of progressing alive.\nThe Republic will be playing for pride against Nigeria, who face co-hosts Australia on Thursday, in their final match in Group B.\nAfter days of sunshine, Perth was hit by torrential rain in the lead up to the match and, knowing they needed to avoid defeat to remain in contention at their first World Cup, it was the Republic who made a stunning start.\nKyra Carusa, who was causing havoc against the Canadian defenders, forced a double save by Kailen Sheridan after being played in by midfielder Quinn.\nHowever, there was lift off in Perth from the resulting corner when captain McCabe, who came close to scoring direct from a corner in their opener with Australia, sent a delightful, curling ball over the head of Sheridan and into the net.\nIt sparked wild celebrations among the Irish support, who dominated the Rectangular Stadium, which was a sea of colour and noise.\nSheridan was forced into action again as she shovelled Sinead Farrelly's effort wide, but Canada should have been level, only for stretching defender Vanessa Gilles to somehow poke. over from five yards from a corner.\nNew Chelsea recruit Ashley Lawrence lobbed over as the rain returned, but Carusa was causing all sorts of problems at the other end and she battled her way into the area and forced a solid save from Sheridan from a tight angle.\nFarrelly saw a shot blocked from another McCabe corner, but there was a sucker punch right at the end of the half when Connolly got the slightest of touches on Grosso's low delivery and Courtney Brosnan was left helpless as the ball found the bottom corner.\nDespite their first-half domination, the Republic were lucky to go in level at the break as Gilles headed narrowly wide form another corner.", "url": "https://www.bbc.com/sport/football/66290708"}