{"authors": ["Steve Sutcliffe", "www.facebook.com"], "date_download": "2025-05-21 05:19:30", "date_modify": "2025-05-21 05:19:30", "date_publish": "2025-04-03 21:26:40", "description": "World champion Kyren Wilson requires medical attention in his 10-5 defeat to Ding Junhui in the quarter-finals of the Tour Championship in Manchester.", "filename": "sport_snooker_articles_c4g4zgn5dy6o_1747804770.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ffa/live/34cd4d70-10cf-11f0-9388-abc6cefd9011.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_c4g4zgn5dy6o_1747804770.html", "title": "Wilson has medical attention in Tour Championship loss to Ding", "title_page": "Wilson has medical attention in Tour Championship loss to Ding - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Kyren Wilson needed medical attention for a nosebleed during his 10-5 defeat to Ding Junhui in the quarter-finals of the Tour Championship.\nTrailing 5-1, Wilson was forced to leave the auditorium in Manchester and play was suspended for almost 30 minutes.\nWhen he eventually returned to the table, the Englishman joked: \"I thought there was a red over the pocket,\" before missing a long pot and watching Ding clear up with a break of 80.\n\"It was a nightmare. I think it was just exhaustion,\" Wilson later said on ITV 4.\n\"I went deep in the Players Championship and then had three back-to-back exhibitions after that.\n\"In hindsight it is probably a good thing. It'll give me two weeks to knuckle down and get a bit of rest and get ready for the World Championships.\"\nWilson's Crucible campaign will begin on 19 April, the opening Saturday of the 17-day tournament.\nChina's Ding compiled six half-centuries and a century to dominate, at one stage reeling off eight consecutive frames before sealing victory to set up a semi-final meeting with Mark Selby on Saturday (13:00 BST).\nHaving led 7-1 overnight against Neil Robertson, four-time world champion Selby made light work of completing a resounding 10-1 win over the Australian.\nThe Leicester man took all three frames on Thursday and ended the match with breaks of 124 and 123.\nMeanwhile, the resurgent form of Scotland's John Higgins continued as he triumphed 10-3 against China's Xiao Guodong.\nThe 49-year-old, who won his first ranking title for four years in March at the World Open, will take on Barry Hawkins in the last four on Friday (13:00 BST).\n\"It has given me a bit more belief in my game,\" said Higgins of his recent title. \"The big players are winning multiple events during the year. That's what I am striving to do.\n\"I still want to compete with all the best players in the world. If I ever lose that, I have got no chance.\"", "url": "https://www.bbc.com/sport/snooker/articles/c4g4zgn5dy6o"}