{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:00", "date_modify": "2025-05-21 03:48:00", "date_publish": "2025-02-01 17:36:20", "description": "Brighton's Fabian Hurzeler defends his disciplinary record after picking up his fifth card of the season on Saturday - but no manager has received more than six cards in a single campaign.", "filename": "sport_football_articles_cq8k40g9yw8o_1747799280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c775/live/96acbfd0-e0b9-11ef-a56b-833ca503b60b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq8k40g9yw8o_1747799280.html", "title": "Brighton boss Fabian Hurzeler defends disciplinary record: 'Emotions are part of it'", "title_page": "Brighton boss Fabian Hurzeler defends disciplinary record: 'Emotions are part of it'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton boss Fabian Hurzeler could be forgiven for letting his frustrations boil over while watching his side fall to a 7-0 defeat - their heaviest since August 1958 - at Nottingham Forest on Saturday.\nUnfortunately for the 31-year-old German, his second-half yellow card following a clash of heads between Forest's Nikola Milenkovic and Brighton's Danny Welbeck wasn't the first time he has landed himself in hot water with match officials.\nHis remonstrations with the fourth official earned him his fourth yellow card of the season and fifth card overall - more than any other manager in the top flight.\nNo boss has received more than six cards in a season since they were introduced for managers in English football at the start of 2018-19. With 14 league games of the current campaign still to play, Hurzeler will have to try harder to keep his emotions in check if he wants to avoid another unwanted record.\n\"Being emotional is part of it,\" Hurzeler, sent off during Brighton's 2-2 draw with Forest at Amex Stadium earlier this term, told BBC Match of the Day. \"I know the statistic, but in the end, emotions are part of the game.\"\nHurzeler was frustrated at referee Simon Hooper's decision not to penalise Milenkovic after the defender made contact with the back of Danny Welbeck's head inside the penalty area 10 minutes into the second half.\nThe German felt Tariq Lamptey's foul on Morgan Gibbs-White moments later – which led to Forest's fifth goal – was not enough for a penalty, while he was also adamant the home side's sixth should have been chalked off for handball against Ibrahim Sangare.\n\"When we look a the decisions today, they were really poor,\" Hurzeler continued, before adding in a separate interview with TNT Sports: \"I have to deal with it, deal with the pressure and the disappointment.\n\"I will try and be a role model in the case of finding the right solutions. That is my job now.\"\nOnly two other managers have received five cards in a single Premier League season since the rule was introduced. Roberto de Zerbi – Hurzeler's predecessor at Amex Stadium – was shown six cards in 2022-23 before receiving another five the following campaign.\nArsenal boss Mikel Arteta was also shown five cards during the 2023-24 season.\n\"It's not an easy day, as you can imagine, but it is also part of the business,\" said Hurzeler said. \"We have to find solutions and that is my responsibility.\n\"It is about taking responsibility - and that is what I will do.\"", "url": "https://www.bbc.com/sport/football/articles/cq8k40g9yw8o"}