{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:48", "date_modify": "2025-05-21 05:27:48", "date_publish": "2025-04-03 10:47:14", "description": "Brighton 0-3 Aston Villa: Fan views", "filename": "sport_football_articles_ckgn420nvelo_1747805268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgn420nvelo_1747805268.html", "title": "Brighton 0-3 Aston Villa: Fan views", "title_page": "Brighton 0-3 Aston Villa: Fan views  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Brighton's Premier League match against Aston Villa. Here are some of your comments:\nBrighton fans\nJon: Another game in which Brighton are outperformed by a physically stronger and well organised team. Just as they did with Everton and Nottingham Forest, Brighton seemed lightweight compared with Villa.\nFran: Very lacklustre from the Seagulls with too many passes going astray, poor decision-making around the Villa goal and a defence that seemed very unsure. Also, I am not sure why we play the ball into the corner and give defenders time to get across in numbers and block everything. We need to be more aggressive and direct and somebody needs to take responsibility and have a shot at goal instead of passing it! Never normally leave a game early but I did with this. Nothing to get excited about.\nRob: Scoreline really did not reflect the game. The disallowed goal, which was a marginal decision, changed the game. Looking forward to next season when something is done about the ridiculous time-wasting, which is spoiling the game for spectators.\nVilla fans\nJames: Not our best performance but it just shows the mentality of the team now, winning when not completely firing. Also being able to bring those sort of players off the bench to change and influence games is amazing.\nDavid: Brighton were very good but our quality showed in the end. Two assists for Morgan Rogers and great to see Donyell Malen score and get some love from the fans. Every game between now and the end of the season is a cup final for us to make the top five. It's lucky Emery is a bit of cup specialist!", "url": "https://www.bbc.com/sport/football/articles/ckgn420nvelo"}