{"authors": ["Tom Rostance", "www.facebook.com"], "date_download": "2025-05-21 07:24:15", "date_modify": "2025-05-21 07:24:15", "date_publish": "2025-05-19 21:18:28", "description": "Manchester City midfielder Jack Grealish may have to leave the club this summer with \"the writing on the wall\" for him, says their former goalkeeper Shay Given.", "filename": "sport_football_articles_cr7z8k393p8o_1747812255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d26f/live/f245d5e0-34ea-11f0-8cf4-152b688ba022.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr7z8k393p8o_1747812255.html", "title": "Jack Grealish: 'Writing on the wall' for Manchester City midfielder says Shay Given", "title_page": "Jack Grealish: 'Writing on the wall' for Manchester City midfielder says Shay Given - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City midfielder Jack Grealish may have to leave this summer with \"the writing on the wall\" for him, says their former goalkeeper Shay Given.\nGrealish, 29, was a British record signing when he joined Pep Guardiola's side from Aston Villa for £100m in 2021.\nThe England international has won three Premier League titles, the Champions League and FA Cup with City but has fallen down the pecking order this season.\nGrealish has only started 16 times this season in all competitions, and has been on the pitch for 1,520 minutes - fewer than half the amount he played in the 2022-23 season when City won the Champions League.\nHe was an unused substitute as Crystal Palace won the FA Cup final last weekend, while he also did not get on the pitch when City were beaten at Wembley by rivals Manchester United in 2024.\nGrealish's future at Etihad Stadium is unclear heading into the summer, with a growing sense that he would benefit from a move before next season.\nThere is likely to be interest from clubs across Europe in a player who may be attracted by the idea of a fresh start at a top club who could provide him with regular football.\nIt remains to be seen whether his reported £300,000-per-week wages will prove prohibitive towards any potential move away.\n\"I have a soft spot for Jack Grealish and the way he is being treated is not on,\" former City keeper Given, who played alongside Grealish at Villa, told BBC Radio 5 Live's Monday Night Club.\n\"He's not helped himself at times but he is a generational talent that you want to build your team around.\n\"That's back-to-back FA Cup finals where you need a goal and you don't use him. At the weekend City brought on Claudio Echeverri who made his debut instead.\n\"Jack is an international, a multiple winner, it was criminal he didn't get on the pitch. The writing is on the wall. I don't know why Pep even brought him to London. He may as well have stayed at home.\n\"When he plays, he's a mannequin on the wing and just told to keep the shape. Kevin de Bruyne is leaving in the summer and Jack Grealish is the perfect replacement to play in the middle but after what has happened, he maybe won't play for the club again.\n\"For his career, he has to see what is out there. He is an amazing talent with plenty of years left in him.\"\nDefeat in the FA Cup final means that City will finish without a major trophy for the first time since Guardiola's first season in charge in 2016-17.\nThey go into their final two Premier League games in sixth place and could miss out on the Champions League next season.\nGuardiola says discussions will take place between outgoing director of football Txiki Begiristain, his successor Hugo Viana and the player's representatives.\n\"We didn't talk - I didn't talk with him,\" Guardiola said. \"People don't believe me, but these things belong to the agents and the club and Txiki, and in this case Hugo as well. Both will decide.\n\"What is going to happen will happen, but he has to come back to start to play minutes again.\n\"It's not only Jack. There is not one player in my locker room, and I think all the locker rooms around the world, that is happy when they do not play.\n\"When the team is winning and winning, they have to figure out how everything happens - but they are not happy.\n\"They are here to play and, when they don't play, they are not satisfied. That is the normal position in all the clubs.\"", "url": "https://www.bbc.com/sport/football/articles/cr7z8k393p8o"}