{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:09", "date_modify": "2025-05-20 11:41:09", "date_publish": "2023-08-07 00:00:00", "description": "Watch coverage from fifth day of the 2023 Cycling World Championships in Glasgow.", "filename": "sport_live_cycling_65738764_1747741269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15FB6/production/_130683009_neilfachieandmatthewrotherham.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cycling_65738764_1747741269.html", "title": "2023 Cycling World Championships: GB's Jack Carlin, Sophie Capewell & Neil Fachie in action", "title_page": "2023 Cycling World Championships: GB's Jack Carlin, Sophie Capewell & Neil Fachie in action - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'It is special to be in front of a home crowd'\nNeil Fachie spoke to BBC Sport after winning his 18th rainbow jersey: “First two world titles as a dad, and it does make it extra special.\n“It is special to be in front of a home crowd and the atmosphere is unreal here.\n“When you are up racing side by side and you are going for gold you here that crowd roar, and it is so buzzing.”\nAustralia crash out in final race of evening\nOw. That looks painful...Australia's Beau Wooton and Byron Davis hit the track in their bronze medal deciding race against France in the men's B sprint.\nThat had echoes of Charlie Tanfield's crash the other day.\nThe Australians are in no shape to race again so France will take third spot.\nWooton was apparently moving but leaves the track on a stretcher as a precautionary measure.\n'We are in a really nice position'\nNeah Evans and Elinor Barker speaking to BBC Sport.\nNE: \"I remember thinking I have one sprint to go . Elinor is off the front and I have to come in and do two laps and we've won and then the gun went and it was like oh no, I don't know if I have nine laps left in me. We got to the front and went hard and it worked.\"\nEB: \"My little boy is here. He is probably asleep but it is the first time he has been in the same building when I have won a bike race. We had to be first at worst. We just had to be up there. We are in a really nice position. Before Tokyo it was kind of a mess. It was impossible to put a marker down, we were trying to race through Covid.\n\"We were doing some race here and there with a small number of teams and we didn't get to race the Australians, the Americans, the Canadians and it all felt really hard to predict. Now we can take this confidence and hopefully put it into something good next year.\"", "url": "https://www.bbc.com/sport/live/cycling/65738764"}