{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:59:55", "date_modify": "2025-04-26 06:59:55", "date_publish": "2025-03-02 00:00:00", "description": "Everton produce a clinical performance to beat Aston Villa 2-0 and condemn their hosts to a fourth successive league defeat.", "filename": "sport_football_live_c798d7v3ql8t_1745650795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0075/live/fbb93cf0-f775-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c798d7v3ql8t_1745650795.html", "title": "Aston Villa v Everton", "title_page": "Aston Villa v Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Everton produced a clinical performance in front of goal to beat Aston Villa 2-0 and condemn their hosts to a fourth successive league defeat.\nEverton were outplayed for much of the first 45 minutes at Villa Park, with Aston Villa dominating possession and both Rachel Daly and Jill Baijings testing goalkeeper Courtney Brosnan.\nHowever, Everton capitalised on their only opportunity of the half to steal a 1-0 lead in the 16th minute when Villa failed to clear a corner which was swung in to the near post. Maren Mjelde volleyed home after reacting fastest to the bouncing ball.\nVilla suffered a blow early in the second half when goalkeeper Sabrina D'Angelo was forced off with a facial injury.\nHer replacement Katelin Talbert endured a nightmare start on her WSL debut, spilling the ball into the path of Honoka Hayashi who smashed home from close range to double Everton's lead and register her fourth goal of the season.\nThe result ends a run of seven away league matches without a win for Everton and sees Brian Sorensen's side climb up to eighth, 10 points clear of bottom-placed Crystal Palace.\nAston Villa, however, remain perilously poised above the relegation zone, just four points above Palace, and are still searching for a first league win under Natalia Arroyo, who replaced Robert de Pauw in late January.\nThere was a time when goals were hard to come by for Everton.\nIn their first 10 league matches of the 2024-25 WSL season, Sorensen's side found the back of the net just six times and went goalless on five occasions.\nSince returning to action in the new year, however, they have eight goals, scored by five different players, in five matches, with West Ham the only side to prevent them from scoring.\nA key factor in their turnaround in front of goal is January signing Kelly Gago, who headed into this game with three goals in her first four WSL matches, but while she was kept quite at Villa Park, Everton remained ruthless in attack.\nThey were dominated by Villa for much of the match, particularly during the first half when the hosts had 63.9% possession and outshot their visitors six to two (four to one on target).\nHowever, unlike Villa, who created multiple chances through Daly, Baijings and Jordan Nobbs, Everton converted their two clear-cut chances in front of goal.\nFrustratingly for Villa boss Arroyo, it's not a new problem for her side, who had 70% possession and 12 shots (but only three on target) during their 3-0 defeat by Leicester City on 16 February.\nThey've also been over-reliant on Daly, who has scored five of their 15 league goals. Second-highest scorer Adriana Leon (three) moved to San Diego Wave earlier this week.\nWith a crucial match against relegation favourites Crystal Palace up next (16 March), Aston Villa need to solve their problems in front of goal quickly.", "url": "https://www.bbc.co.uk/sport/football/live/c798d7v3ql8t"}