{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:06:40", "date_modify": "2025-05-21 07:06:40", "date_publish": "2025-03-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Watford v Plymouth Argyle in the Championship", "filename": "sport_football_live_crewywyv5z3t_1747811200.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crewywyv5z3t_1747811200.html", "title": "Watford v Plymouth Argyle: Championship stats & head-to-head", "title_page": "Watford v Plymouth Argyle: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford missed the chance to move closer to the Championship play-off places as they failed to capitalise on total second-half domination in a scoreless draw against bottom-of-the-table Plymouth Argyle at Vicarage Road.\nThe Hornets, who remain four points adrift of the top six before the other play-off contenders are in action at 15:00 GMT, managed just one off-target attempt in a miserable first-half display.\nOnly a fabulous save by keeper Egil Selvik from Ryan Hardie prevented the visitors from taking the lead, but Watford were infinitely better on the resumption, playing with greater urgency and finally turning possession into chances.\nVakoun Bayo wasted a couple of glorious opportunities, the excellent Rocco Vata hit the bar with a deflected strike and substitute Kwadwo Baah also went close on a couple of occasions.\nArgyle, who remain five points adrift of safety and could be as many as eight points behind after the afternoon matches, could have snatched victory in the closing minutes, but Muhamed Tijani shot wide.\nWatford, who have just one victory in their past five league games, will have been left wondering how they were not already assured of a vital three points by then.\nTheir second-half performance was full of urgency and drive, in stark contrast to a first period littered with poor decision making and almost no threat in the final third.\nThe home supporters had to wait until first-half injury time for an attempt on goal, a long-distance strike from Vata that drifted harmlessly wide, which prompted ironic chants of \"we've had a shot\".\nMoments later that was followed by boos at the sound of the half-time whistle.\nBut Watford's vast improvement in the second period overcame Plymouth's ploy of sitting deep, surrendering possession, packing the midfield and breaking with pace.\nThe home side's front-foot approach ensured the Pilgrims' front trio of Hardie, Mustapha Bundu and Michael Obafemi were kept quiet - and they also created plenty of chances.\nWatford's best opportunity came after a lovely move on the left saw Francisco Sierralta head back a deep cross, but Bayo made a total hash of his first-time finish and moments later Vata was found by Moussa Sissoko but took a heavy touch and his subsequent strike was blocked.\nThe Hornets ended the match with 16 attempts on goal but only one on target. Bayo shot into the side netting from a tight angle, Vata hit the bar from 18 yards via a deflection, and another deflected strike almost brought a stoppage-time winner from Edo Kayembe.\nWatford boss Tom Cleverley told BBC Three Counties Radio:\n\"We wasted 45 minutes against a team that we're good enough to beat. That's the main regret.\n\"We didn't play with enough tempo, enough desperation to score, enough penetration and there were too many unforced errors.\n\"There has to be a determination to break down that back line and I didn't see that. It's not just going to happen, you have to make it happen.\n\"The second half was how we should play. It was a more entertaining style, more direct, no mistakes. It's a bit of a head scratch how the ball's not found its way into the net, but that's the way it's been going for us.\n\"I've a lot of admiration for our second-half performance, how the players reacted to a bit of a rocket at half-time.\"\nPlymouth boss Miron Muslic told BBC Radio Devon:\n\"We were almost perfect in the first half in not allowing Watford a shot on target. The lads were brilliant.\n\"And they are a very good team with a fantastic home record so it's not easy to keep them out. It's a point and we take it - they are a good team.\n\"The next step is to reward ourselves with goals. We created so many good things due to good structure.\n\"We had a lot of opportunities but we needed to be a bit calmer and show more efficiency. We need to be more clinical with the positions we created.\n\"If we had given Watford the same chances that we had, I think they would have taken them.\"", "url": "https://www.bbc.com/sport/football/live/crewywyv5z3t"}