{"authors": ["Andy Burke", "www.facebook.com"], "date_download": "2025-05-21 04:26:54", "date_modify": "2025-05-21 04:26:54", "date_publish": "2025-04-05 21:08:14", "description": "Glasgow Warriors run in six tries to sweep past Leicester Tigers and set up a Champions Cup quarter-final against Leinster next Friday.", "filename": "sport_rugby-union_articles_c98gyegjr7qo_1747801614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afd3/live/e2bc9f40-1263-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c98gyegjr7qo_1747801614.html", "title": "Champions Cup: Glasgow beat Leicester to reach quarter-finals", "title_page": "Champions Cup: Glasgow beat Leicester to reach quarter-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasgow Warriors ran in six tries to sweep past Leicester Tigers and set up an Investec Champions Cup quarter-final against Leinster next Friday.\nOlly Cracknell crossed to give Tigers an early lead, but Glasgow hit back with tries from Henco Venter and Sione Vailanu to lead by 12 at the break.\nVailanu scored his second early in the second half before a quickfire double from Adam Hastings and George Horne put the hosts out of sight.\nSolomone Kata and Hanro Liebenberg provided fleeting moments of respite with tries for the visitors, but Venter rounded off the scoring as Glasgow powered into the last eight.\nTigers struck the first blow almost immediately. An initial push from a line-out maul was repelled by the home defence, but when the ball was recycled, Cracknell was able to burrow under the bodies to score.\nGlasgow responded well, banging at the Leicester door, only to be denied by some ferocious defence. When Warriors did find a way through, it was in slightly fortuitous circumstances.\nThere seemed to be a mix-up in the line-out call when Johnny Matthews throw sailed right over the top, but Adam Hastings was on to it and slipped a pass for Venter to crash over.\nThe home side were on top and from a dominant scrum on the Leicester put-in, Vailanu was able to peel off the base and blast over.\nWith a strong wind at their backs, Glasgow continued to dominate territory and possession and looked to add to their advantage, but Leicester stood firm in the face of all that pressure. On the occasions they were opened up, their scramble defence was superb.\nHastings knocked over a penalty to send Glasgow in 17-5 up at the break.\nTurning around to play into the breeze in the second period, the concern for the home side was whether a 12-point cushion was enough, but they added to it in the opening moments of the half, Vailanu going over from close range for his second of the evening.\nThe breeze was proving no problem at all for the hosts as they moved through the gears, and Hastings finished off a sweeping move for a try number four.\nIt was five almost immediately as Warriors sprung again straight from the restart, Kyle Rowe breaking free and finding Horne running a trademark support line to go in under the sticks.\nThis was turning into a bit if a doing, though Kata stemmed the tide somewhat by ghosting through to score Leicester's second try of the evening.\nThey should have scored again when Freddie Steward broke through and fed Dan Kelly, but with the line at his mercy, the centre inexplicably fumbled forward and the chance was lost.\nTigers third try did come eventually from Liebenberg, but by then the mountain to climb was too high for the visitors.\nVenter powered over for his second try of the evening to round off a dominant Warriors performance.\nNext up for the URC champions is one of European rugby's toughest tests, a last-eight showdown in Dublin with a Leinster side fresh from a 10-try demolition of Harlequins.\nGlasgow Warriors head coach Franco Smith told BBC Scotland: \"The boys stuck to the script and played some really good rugby.\n\"We left some points out there, so there's a lot to improve on but we're excited about the opportunity next week.\n\"Leinster have huge depth and they are probably the most talked about team in world rugby at the moment. It will be the toughest task we've had in a very long time.\n\"We must go there with a mindset that you can achieve on the day, so looking forward to a big challenge but they are definitely the favourites.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c98gyegjr7qo"}