{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:13:34", "date_modify": "2025-04-26 06:13:34", "date_publish": "2025-03-05 00:00:00", "description": "Liverpool complete one of the biggest smash and grabs in Champions League history to come away from their last-16 first leg against Paris St-Germain with a win.", "filename": "sport_football_live_ce8mgmpzv81t_1745648014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f02f/live/a99af750-fa14-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_ce8mgmpzv81t_1745648014.html", "title": "1 Liverpool: Harvey Elliott scores winner in smash and grab", "title_page": "PSG 0-1 Liverpool: Harvey Elliott scores winner in  smash and grab - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool completed one of the biggest smash and grabs in Champions League history to come away from their last-16 first leg against Paris St-Germain with a win.\nPSG completely dominated the game, with 27 shots, and Liverpool goalkeeper Alisson had to make nine saves.\nBut the hosts could not find an opener - and the Reds scored with their second shot of the night in the 87th minute.\nHarvey Elliott netted with his first touch, after replacing Mohamed Salah, when he was picked out by Darwin Nunez.\nLuis Enrique's side were shell shocked - and how they failed to score will go down as a mystery. Well, an Alisson-shaped mystery.\nPSG forwards Ousmane Dembele and Khvicha Kvaratskhelia in particular were unplayable at times.\nKvaratskhelia had a fine goal in the first half rightly disallowed by the video assistant referee (VAR) for offside.\nThe VAR again sided with Liverpool, more controversially, when Ibrahima Konate avoided a red card despite shoving Bradley Barcola over just outside the box.\nLiverpool will host the second leg next Tuesday.\nSince their big-money Qatari takeover in 2011, PSG have flattered to deceive in the Champions League.\nJust as it looks as if they are getting things together, it all goes wrong.\nThis one felt like it was going to be different.\nThe runaway Ligue 1 leaders had won their past 10 games and were unbeaten in 22 matches.\nPrevious collapses had come from trying to fit star names and big egos into a team - including all of Kylian Mbappe, Neymar and Lionel Messi.\nBut this was a different PSG, more of a team with fewer true household names.\nDembele had scored 20 goals in his previous 14 matches. Some of his dribbles had the Reds defenders on toast, especially in the first half. Kvaratskhelia, a January signing from Napoli, was sublime when running with the ball too.\nThe hosts felt as if they were winning everything on Wednesday, quicker to every ball, and ending up with 70% possession.\nLuis Enrique's team will point to the red card Parisian Konate could have been shown in the first half too.\nBut they were ultimately made to pay for not taking their chances - and now face a huge uphill task at Anfield in six days' time.", "url": "https://www.bbc.co.uk/sport/football/live/ce8mgmpzv81t"}