{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:52:15", "date_modify": "2025-04-26 03:52:15", "date_publish": "2025-03-03 10:30:33", "description": "Hibernian: 'On cloud nine, we're a team again' - Your Edinburgh derby views", "filename": "sport_articles_cevyz4v0nx0o_1745639535.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edbc/live/a6f51a90-f775-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cevyz4v0nx0o_1745639535.html", "title": "'On cloud nine, we're a team again' - Your Edinburgh derby views", "title_page": "Hibernian: 'On cloud nine, we're a team again' - Your Edinburgh derby views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Hibs' 2-1 Edinburgh Derby win against Hearts.\nHere's what some of you said:\nGordon: Most pleased for Sir David Gray, a true club legend who has taken his leadership skills from the pitch to managing the squad. Simply phenomenal Hibs! While I'm worth, my room on this earth, I will be with you.\nBert: In November I was very critical of the club coach and players. The way that they have responded is heroic, with everyone giving full effort and commitment. Been a Hibee since 1947 and watched the Famous 5 until moving to NZ. Always a Hibs fan.\nNeil: Great to see Jack Iredale rewarded for the amount of graft and commitment he puts in, he's been great for us. Totally deserving of the win once we settled into the game and nice not to be the subject of any VAR controversy.\nJohn: Absolutely amazing when compared with the early season form. It's now really exciting football played by a team who all work for each other. Gray and his backroom staff deserve all their success, as do the board for standing by them in the dark ages earlier in the season.\nAidan: It's stunning. Let's make this tremendous run of form count for something at the end of the season. Dare to dream, fellow Hibees!\nDaryl: We're definitely in a place now where we could compete and beat anyone, but we're still in a place where anyone can beat us, don't get carried away, don't count your chickens until they hatch.\nJohn: A few nervy moments in the first half but we totally dominated the second 45 and were worthy winners. tis team has a far superior attitude under Gray than of the previous managers of the past few years. Every player gets a pass mark.\nDarren: On cloud nine! What a fantastic run we're on. First half to forget but then we bossed them second half and fully deserved the three points with quite a wonderful strike. Proud to be a Hibee.\nGordon: We are a team again. Gray and his team have worked hard to make this happen, and the goals were superb.\nChris: Great result, but the best bit is that we have completely kicked the habit of letting games go in the last 15 minutes. Gray has to take all the credit, there are still a number of players in the squad that were bad recruits but he is getting the best out of a strong starting XI and has made a few inconsistent performers much better.", "url": "https://www.bbc.co.uk/sport/articles/cevyz4v0nx0o"}