{"authors": ["Saveena Johal", "www.facebook.com"], "date_download": "2025-04-26 07:33:41", "date_modify": "2025-04-26 07:33:41", "date_publish": "2025-02-27 15:57:40", "description": "Nottingham Forest: Opinion - 'Great shame' if no European football", "filename": "sport_football_articles_c0q11ggn09lo_1745652821.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2992/live/78122530-b62e-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0q11ggn09lo_1745652821.html", "title": "Opinion - 'Great shame' if no European football - BBC Sport", "title_page": "Nottingham Forest: Opinion - 'Great shame' if no European football - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC Sport asked Forest fan Saveena Johal a few questions about successes, hopes and fears...\nWhat would be success from here?\nThere is a sense that something good can happen, thanks to an almost surreal season so far.\nGiven our current position, our campaign can and should be topped off with a Champions League place. Having finished previous seasons just above the relegation zone, we seem to have comfortably embedded ourselves in the Premier League now and, hopefully, thereafter.\nEvery club strives to earn a spot in the Champions League, not least progress in it, and for us this feels like a success within reach. Since the formation of the Premier League, every team that has stood at third place at this point in the season has finished within the top five. So it's definitely something we should be looking ahead to.\nCan you explain your one hope and one fear for the rest of the season?\nI'm hopeful that we will qualify for Champions League football. With just 11 league fixtures remaining, and many of the tough ones well dealt with, our chances of securing European football are high.\nWith the hopeful addition of a fifth place spot for an English team, this could also work in our favour should we need it. The idea of reviving the glory days is exciting.\nThe only fear would be Forest not qualifying for European football in any capacity. This would clearly be a great shame, given how well the season is progressing, but equally it feels like a fortunate predicament to find ourselves in. Our chances of European football at the forefront, as opposed to a relegation battle.\nWhile fans of other clubs seem confident we'll prosper, perhaps it's the typical mentality of a Forest fan to not be overly optimistic as the occasional dread sets in. Points-wise, it's still tight at the top so these next few weeks will be telling.\nHowever, a decent run in and the fight we've shown in the last couple of games will hopefully be enough to squash any doubts.", "url": "https://www.bbc.co.uk/sport/football/articles/c0q11ggn09lo"}