{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:42", "date_modify": "2025-05-20 14:07:42", "date_publish": "2023-07-31 00:00:00", "description": "Relive the action as co-hosts Australia thumping Canada to reach the last 16 of the Women's World Cup.", "filename": "sport_live_football_66183277_1747750062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/157F1/production/_130594088_australia3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183277_1747750062.html", "title": "Canada vs Australia: Watch Fifa 2023 Women's World Cup LIVE, plus score, commentary & updates from Group B games", "title_page": "Canada vs Australia: Watch Fifa 2023 Women's World Cup LIVE, plus score, commentary & updates from Group B games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us tomorrow!\nThat's all from us today. Be sure to join us at 07:30 BST tomorrow morning as we race towards the business end of the Women's World Cup.\nIn Group E defending champions USA face Portugal while the Netherlands play Vietnam (both at 08:00 BST).\nAnd at 12:00 BST the Lionesses conclude their group stage and will advance as Group D winners if they avoid defeat to China.\nAt the same time Haiti will hope for their first win at a World Cup when they play Denmark.\nWe can't wait!\n'Nigeria have beaten the odds'\nFT: Republic of Ireland 0-0 Nigeria\nFara Williams\nFormer England midfielder on BBC Two\nNigeria weren't a nation that people were talking about getting out of this group.\nIf they are the team that England will have to face [in the next round], they are going to be a difficult opponent.\n'Everyone is proud of that'\nFT: Republic of Ireland 0-0 Nigeria\nRepublic of Ireland goalkeeper Courtney Brosnan to RTE Sport: \"Unbelievable. I said before we were disappointed not to make it out of the group. We deserved something from the tournament.\n\"Vera and Katie said we're proud to be here for our country. We grew and held our own against three top teams. Everyone is proud of that.\"\nOn her amazing save: \"It was an unbelievable cross into the box, a teasing one. I thought I could come for it but dropped back. I knew I had to make a special save. I threw my body at it, I wanted us to get something from the game.\n\"We have the best fans in the world. The support here and at home has been unbelievable. We're so proud to put on the shirt and represent our country.\"\n'These players go out as world stars'\nFT: Republic of Ireland 0-0 Nigeria\nRepublic of Ireland boss Vera Pauw to RTE Sport: \"Fantastic feeling. They are the 11-time African champions and we had the better play. They always looked dangerous but we were in control. We created chances.\n\"We need to get there [to the opposition goal] to score. We’ve done that so much better. When you see what Nigeria did against Australia, not one time they could do that to us. The game plan worked again. I’m so proud.\n\"I think we can be really proud. We played three top 10 nations, I think Nigeria are a top-10 nation [despite their 40th-placed ranking], we have played equal games against them.\n\"Those players came into this tournament as very good players, they go out as world stars. It will change their lives. They will get other contracts and more opportunities.\"\n'Home crowd was their 12th player'\nFT: Canada 0-4 Australia\nRachel Brown-Finnis\nEx-England goalkeeper on BBC Two\nFrom the opening few seconds it was clear what Australia wanted to do, how they were going to set up and how they would combat the threats of Canada.\nWith setting out their stall early on, it got the home crowd on their feet.\nHaving a home crowd behind you, you feel like everyone in the stadium is there shouting and willing you on.\nIt really is that cliche of the 12th player.\n'Australia showed up when they had to'\nFT: Canada 0-4 Australia\nFara Williams\nFormer England midfielder on BBC Two\nAustralia needed to show up, and they did exactly that.\nThey hadn't yet shown up in the tournament, and left it to the final game under immense pressure.\nSam Kerr could have been used if needed, but she wasn't, and she will be grateful for that because she has an extra few days for her recovery. Hopefully we see some of her in the round of 16.\nTactically, Australia were miles better than Canada today.", "url": "https://www.bbc.com/sport/live/football/66183277"}