{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:46:15", "date_modify": "2025-05-20 13:46:15", "date_publish": "2023-08-01 00:00:00", "description": "Listen to live commentary & follow text updates as China face England & Haiti take on Denmark in Group D of the 2023 Women's World Cup.", "filename": "sport_live_football_65468316_1747748775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/163B4/production/_130606019_whatsubject.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_65468316_1747748775.html", "title": "Fifa Women’s World Cup 2023: China vs England & Haiti vs Denmark score, commentary & updates from Group D game", "title_page": "Fifa Women’s World Cup 2023: China vs England & Haiti vs Denmark score, commentary & updates from Group D game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nFT: China 1-6 England\nThat's all for this live page and what a day it has been for England as the Lionesses equalled their record win at a Women's World Cup with an outstanding display to beat China 6-1 and march on into the last 16.\nNext up for England, Nigeria on Monday, with that one starting at 08:00 BST.\nThanks for joining us and for your comments.\nUntil next time, bye for now.\nJames gets your vote as Player of the Match\nFT: China 1-6 England\nChelsea forward Lauren James was your Player of the Match as England cruised into the last 16 of the Women's World Cup with a thumping 6-1 win over China.\nJames was BBC Sport readers' top choice for the second game on the bounce with a rating of 8.57.\nThe 21-year-old scored twice, had another strike ruled out and provided three assists to set up a round of 16 tie with Nigeria on BBC One on Monday.\nGoalscorers Alessia Russo and Lauren Hemp were also highly rated, finishing on 7.76 and 7.72 respectively.\nClick here to see how all the players rated.\nStunning James goals power England into last 16 - read the report\nFT: China 1-6 England\nEmma Sanders\nBBC Sport at Hindmarsh Stadium\nLauren James produced a sensational individual performance as England entertained to sweep aside China and book their place in the last 16 of the Women's World Cup as group winners.\nIt was a display worthy of their status as European champions and James once again lit the stage alight in Adelaide with two sensational goals and three assists.\nThe 13,497 in attendance were treated to a masterclass from Chelsea's James, who announced her arrival at the World Cup with the match-winner against Denmark on Friday.\nShe helped England get off to the perfect start when she teed up Alessia Russo for the opener, and later slipped the ball through to Lauren Hemp to coolly place it into the bottom corner.\nIt was largely one-way traffic as England dominated and overwhelmed, James striking it first time into the corner from the edge of the box to make it 3-0 before another stunning finish was ruled out by video assistant referee (VAR) for offside in the build-up.\nChina knew they were heading out of the tournament unless they responded, so they came out with more aggression in the second half, unnerving England slightly when Shuang Wang scored from the penalty spot after VAR picked up a handball by defender Lucy Bronze.\nBut James was not done yet - she volleyed Jess Carter's deep cross past helpless goalkeeper Yu Zhu for England's fourth before substitute Chloe Kelly and striker Rachel Daly joined the party.\nEngland, who had quietly gone about their business in the group stages, will have raised eyebrows with this performance before their last-16 match against Nigeria on Monday, which will be shown live on BBC One at 08:30 BST.\nHarder helps Danes beat Haiti to book last-16 spot - read the report\nHaiti 0-2 Denmark\nDenmark booked their place in the World Cup last 16 with a 2-0 win over Haiti to finish second in Group D behind England.\nHaiti were undone by a penalty for a third game in a row, with Pernille Harder scoring from the spot after Dayana Pierre-Louis' handball.\nSanne Troelsgaard sealed the Danes' progression to the knockout stages with a second goal deep into injury time. Denmark face Group B winners and co-hosts Australia in Sydney on Monday.\nIt will be Denmark's first World Cup knockout match in 28 years, since they lost to Norway in the quarter-finals of the 1995 tournament.\nRanked 13th in the world, the Danes were guaranteed of a place in the round of 16 with a win and a better outcome than China's result against England in the other match in the group.\nHaiti, meanwhile, needed a victory and the Lionesses to beat China if they were to have any chance of reaching the last 16.\nJames 'did special things'\nFT: China 1-6 England\nEngland\nEngland manager Sarina Wiegman to ITV1: \"I said before the game we had to do things a little different than we did before. We did really well it shows how adaptive we are on the pitch.\n\"Today it went really well. We want to use the qualities we have now and today it worked really well.\"\nOn Lauren James' performance: \"She feels good, you can tell. She did special things today. Unfortunately that one goal was cancelled. She flows over the pitch.\n\"We expected China to press high because they had to win to go through. But they just stayed in shape. They didn't expect us to play this way and they didn't find a solution.\n\"It also helps when Lucy Bronze and Rachel Daly can press up in and out of possession. They worked well today.\"\nJames a 'generational talent'\nFT: China 1-6 England\nEniola Aluko\nFormer England forward on ITV1\nI'm running out of superlatives, descriptions to describe what is a generational talent [in] Lauren James.\nThree goals and three assists already in this World Cup and she is just 21 years of age.\nHer [second] finish is absolutely ridiculous. The way she controls the pace of the ball. Do not underestimate how difficult that is. She controls it like a pass, first touch, she knows exactly what she's doing.\nHer weaker foot as well. She's already scored one with her right.\nAbsolutely unbelievable. Amazing.\n'Confidence is flowing in the team'\nFT: China 1-6 England\nEngland\nEngland forward Chloe Kelly speaking to BBC Radio 5 Live: \"Unbelievable from the girls, each and every one of us really put in a shift tonight and scoring goals for fun.\nOn not starting: \"I think everyone wants to start a game as a footballer. Getting on the pitch tonight was great and getting on the scoresheet was even better.\n\"For the whole team's confidence, scoring goals is brilliant. Once one goes into the net, they all start flowing so I think it's brilliant to get that goal scoring up and the confidence is flowing in the team.\"\nOn Lauren James: \"She's special, a very special player for us and women's football in general. She's a special talent and the future is bright.\"\nOn the change in formation: \"I think it just shows the depth in our squad. We've always spoken about the 23 players within the group and the staff as well and it was brilliant tonight that we got that result and scoring so many goals is amazing. To be on the pitch with such a great group.\"\nOn facing Nigeria: \"We're looking forward to it. A different test again and in world football playing against different opposition is amazing so we're all looking forward to it.\"\n'Who better to get on the ball in an England shirt than Lauren James?'\nFT: China 1-6 England\nEngland\nEngland midfielder Katie Zelem speaking to BBC Radio 5 Live:\n\"You could see by the smiles on our faces how we felt. It looked like a lot of things had come together that we had been working on on the training pitch came off.\nOn when she found out that she was playing: \"We announce the line-ups the night before so I was very excited, my first start for England in any game.\n\"China were really organised, there wasn't too much space for me and Georgia [Stanway] in the first half but it allowed players like LJ [Lauren James] to get on the ball and who better to get on the ball in an England shirt than Lauren James?\n\"I've know LJ for a long time, played with her at Manchester United so I've known the talent she had so there is no surprise she is playing this well at the tournament and hopefully it will continue.\"\nOn facing Nigeria next: \"A really tough team. Every team that gets into the knockout stages deserves to be there so we know it will be a difficult test and we're ready for it.\"\n'What dreams are made of'\nFT: China 1-6 England\nEngland\nLauren James speaking to ITV: \"It's what dreams are made of. Happy for the team; everyone is buzzing. We are looking forward to the next round\n\"I felt free. Whether I'm on the wing or in the middle, I'm happy to be playing and contributing to goals.\"\nOn her goals: \"Like last game, I just thought 'hit it and see what happens'. It was frustrating [to have a goal disallowed] but those things happen. I'm just looking forward to the next one. Each game, I'm looking to get better and there are many more years of improvement. I just have to stay focused.\"\nOn facing Nigeria: \"It'll be very tough. Teams are catching up with each other. It'll be a difficult game.\"", "url": "https://www.bbc.com/sport/live/football/65468316"}