{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:57:57", "date_modify": "2025-04-26 06:57:57", "date_publish": "2025-02-28 13:44:29", "description": "Jos Buttler says it is \"the right decision\" for him and the team as he resigns as white-ball captain following England's Champions Trophy exit.", "filename": "sport_cricket_articles_cg4kk4xypwvo_1745650677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b933/live/4e9de350-f5e9-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cg4kk4xypwvo_1745650677.html", "title": "Jos Buttler resigns as England white-ball captain", "title_page": "Jos Buttler resigns as England white-ball captain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jos Buttler has resigned as England's white-ball captain following his side's Champions Trophy exit.\nThe 34-year-old will lead England for the final time in their last group match in the tournament against South Africa on Saturday.\nDefeat by Afghanistan on Wednesday knocked England out of the Champions Trophy - their third disappointing white-ball event in a row under Buttler following their disappointing defences of the 50-over World Cup in 2023 and the T20 version last year.\n\"It's the right decision for me and it's the right decision for the team,\" said Buttler at an unplanned media conference in Lahore.\n\"I've just reached the end of the road.\"\nHe added that he felt England had gone out of the Champions Trophy \"with a bit of a hangover from the tournaments before\".\nButtler, one of England's 2019 World Cup winners, was appointed captain in 2022 after the international retirement of Eoin Morgan.\nHe won the T20 World Cup that autumn in Australia but England have endured a significant downturn in form since the start of the 2023 World Cup in India.\nThey won only three of their nine matches there and have lost 12 of their 16 ODIs since then, including a current losing run that stands at six matches.\nThey reached the semi-finals of the T20 World Cup last year but were well beaten by India and limped through the earlier rounds.\n\"My over-riding emotions are sadness and disappointment, but I'm sure in time that will pass and I'll get back to really enjoying my cricket,\" Buttler said.\n\"Also, I'll be able to reflect on what an immense honour it is to captain your country and all the special things that come with it.\"\nThe Champions Trophy has been England's first tournament since Brendon McCullum combined the white-ball job with his role as Test coach.\nThe New Zealander, who backed Buttler to remain as captain when being appointed, said he thought his skipper was considering quitting in the immediate aftermath of the Afghanistan defeat and Buttler confirmed his decision at the team hotel on Thursday.\n\"He sent me a message saying he needed a chat, and I knew then that things were coming to an end,\" McCullum told BBC Test Match Special.\n\"When he told me he wanted to step down, I was initially thinking, 'Don't worry about it, we'll carry on' but no, he's made the right decision.\"\nButtler's recent record has been poor but he has also had to deal with his best players often being absent from squads as Ben Stokes' Test team was prioritised.\n\"He has worn the captaincy quite heavily because he cares so much about playing for the shirt, the guys in the dressing room and all the supporters of the team,\" added McCullum.\nMcCullum said he will begin discussions with managing director of men's cricket Rob Key over a successor in the coming weeks.\nBatter Harry Brook, all-rounder Liam Livingstone and opener Phil Salt have all captained the white-ball team in the past six months.\nBrook, who was made Buttler's vice-captain in January and led in five ODIs against Australia last year, appears the favourite.\n\"This news is still pretty fresh,\" said McCullum.\n\"We have got time after this tournament as we go into the English summer so we can work out who the right person is.\"\nButtler has captained England in 44 ODIs overall, with a record of 18 wins, 25 defeats and one no result.\nHe holds a better record as captain in T20s, with 26 wins, 22 defeats and three no results in his 51 matches in charge.", "url": "https://www.bbc.co.uk/sport/cricket/articles/cg4kk4xypwvo"}