{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:43:09", "date_modify": "2025-05-21 06:43:09", "date_publish": "2025-03-28 23:03:29", "description": "Cliftonville striker Joe Gormley says that his side are determined to retain the Irish Cup to honour their late teammate Michael Newberry.", "filename": "sport_articles_czrnrkv7k23o_1747809789.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0b7/live/88280f70-0c27-11f0-ab7e-e1214861eeb0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czrnrkv7k23o_1747809789.html", "title": "Irish Cup: Reds want to win Irish Cup again for Newberry", "title_page": "Irish Cup: Reds want to win Irish Cup again for Newberry - Gormley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cliftonville striker Joe Gormley said that his side are determined to retain the Irish Cup to honour their late teammate Michael Newberry.\nGormley scored the opening goal in the 3-0 semi-final win against Ards as the Reds booked their place in a second successive final.\nMembers of Newberry's family were in the crowd for the last-four tie, and Gormley hopes they can celebrate with the team again if they win the final on Saturday, 3 May.\n\"We would love Michael to be here and be part of the team while playing but we will always remember him and hopefully come the final we can bring home the cup for him,\" Gormley told BBC Sport NI.\nThe striker showed composure to fire the Reds ahead against their Championship opposition and was relieved to play his part in helping Cliftonville reach another final\n\"I was just on my toes, and I was glad it found the back of the net because we were a bit edgy, we were snapping at everything,\" he explained.\n\"It's amazing to be in another final, at Cliftonville you want to play in the big occasions, the League Cup final was incredible as was last year's Irish Cup final so we're hoping to get our hands on it for a second year in a row now.\"\nThe 35-year-old assisted substitute Ryan Corrigan for the third goal, unselfishly squaring the ball to the youngster after a mistake from Ards goalkeeper Alex Moore.\n\"In the League Cup final, he passed to me, so I owed him one!\" Gormley joked.\nHe was in a better position, and it was to make it 3-0 so I was happy enough.\"\nThe forward said he has no preference for who the Reds face in the decider with Bangor taking on Dungannon Swifts in the other semi-final on Saturday.\n\"No matter who it is it will be a tough game, I will be clued in tomorrow night watching. Dungannon are a great side, they beat us at home recently and we played Bangor earlier in the season who are another great side.\"", "url": "https://www.bbc.com/sport/articles/czrnrkv7k23o"}