{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:26:55", "date_modify": "2025-04-26 04:26:55", "date_publish": "2025-03-03 11:18:19", "description": "Scotland draft Matt Currie, Nathan McBeth and Ben Muncaster into their squad for this weekend's Six Nations game against Wales.", "filename": "sport_rugby-union_articles_c3w1d3ey21qo_1745641615.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9ba4/live/a5f9fb00-f820-11ef-be1d-e7df6cf5ab80.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c3w1d3ey21qo_1745641615.html", "title": "Six Nations 2025: Scotland squad update", "title_page": "Six Nations 2025: Scotland squad update - Currie, McBeth & Muncaster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Scotland call up trio as Crosbie and Mann drop out\nPublished\n3 March 2025\nGuinness men's Six Nations: Scotland v Wales\nVenue: British Gas Murrayfield Date: Saturday, 8 March Kick-off: 16:45 GMT\nCoverage: Watch on BBC One, listen on Radio 5 Live, BBC Radio Scotland & BBC Sounds; text commentary and highlights on BBC Sport website and app.\nMatt Currie, Nathan McBeth and Ben Muncaster have been called into the Scotland squad for this weekend's Six Nations game against Wales but back rows Luke Crosbie and Jack Mann have been ruled out by injury.\nCentre Currie is recalled after scoring a hat-trick for Edinburgh against Munster on Friday as he returned from the concussion sustained against Zebre.\nMuncaster, who has one cap, also started in Edinburgh's memorable win in Cork and provides cover following the injuries to Crosbie and Mann.\nGlasgow prop McBeth, who scored a try at the end of their tight defeat against Ospreys, has also joined the squad.\nCrosbie was replaced early on in Edinburgh's game on Friday night and has returned to his club for further assessment.\nMann picked up a head injury in Warriors' game on Friday and is undergoing World Rugby's concussion protocols.\nScrum-half Ali Price and winger Ross McCann have also returned to Edinburgh.\nScotland lost against Ireland and England following their opening-weekend victory against Italy while Wales sit bottom of the Six Nations table after three defeats.\nScotland squad to face Wales\nForwards: Ewan Ashman, Jamie Bhatti, Gregor Brown, Dave Cherry, Rory Darge, Jack Dempsey, Matt Fagerson, Zander Fagerson, Euan Ferrie, Grant Gilchrist, Jonny Gray, Patrick Harrison, Cameron Henderson, Will Hurd, Ewan Johnson, Nathan McBeth, Ben Muncaster, D'Arcy Rae, Jamie Ritchie, Pierre Schoeman, Sam Skinner, Rory Sutherland, Marshall Sykes.\nBacks: Fergus Burke, Matt Currie, Jamie Dobie, Darcy Graham, George Horne, Rory Hutchinson, Huw Jones, Tom Jordan, Blair Kinghorn, Stafford McDowall, Cameron Redpath, Arron Reed, Finn Russell, Kyle Rowe, Ollie Smith, Duhan van der Merwe, Ben White.\nRelated topics", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c3w1d3ey21qo"}