{"authors": ["Kris Holland", "www.facebook.com"], "date_download": "2025-05-19 14:42:36", "date_modify": "2025-05-19 14:42:36", "date_publish": "2017-07-12 11:20:24", "description": "In the wake of the dispute over Jeff Horn's win over Manny Pacquiao, BBC Sport looks at whether boxing could introduce technology to help judges.", "filename": "sport_boxing_39489636_1747665756.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48DA/production/_96905681_cornerapp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_39489636_1747665756.html", "title": "Could Manny Pacquiao v Jeff Horn row have been avoided with technology?", "title_page": "Could Manny Pacquiao v Jeff Horn row have been avoided with technology? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With the controversy around the result of the Manny Pacquiao and Jeff Horn WBO world welterweight title fight, the accuracy of scoring in boxing is again under scrutiny.\nEight-time world champion Pacquiao called his defeat an \"unfair decision\", while the WBO were persuaded to review the Brisbane bout - before ruling the result was correct.\nNow it is understood major players within the sport are keen on exploring whether technology could be more widely used to remove some of boxing's subjectivity.\nBut how might that work?\nAt the Rio Olympics - in which amateurs competed - the same system was adopted, with five officials judging each bout and a computer randomly selecting three whose scores were counted.\nAll that is judged with the naked eye, which can lead to controversy. In Brazil in 2016, for example, Irish bantamweight Michael Conlan and Kazakhstan's Vassiliy Levit lost bouts in which they both appeared to win comfortably.\nOffering to remove those debates is British company Corner, which is using accelerometer technology (the stuff your smartphone uses to detect movement) to track the different motions of a boxer's hands and measure the number and type of punches they throw.\nPacked into a chip not much bigger than a 50 pence coin, the wireless hardware is concealed within the fighter's hand wraps, with one for each glove.\n\"I know a lot of people who can't get into boxing,\" Corner's CEO and co-founder Charles Burr tells BBC Sport.\n\"They can't understand the subjectivity of the scoring. They can't get into the match, or get excited, because they don't know who is winning.\n\"If we had stats scoring in real-time at the end of each round, so people could really see what is going on, that would aid the judging for the fighters and for the fans.\n\"This would be a system with no bias. Not even a subconscious bias. I think that is very comforting for a boxer.\"\nUS based company Hykso have designed a similar product for training purposes, but it is currently limited to gyms and clubs.\nCorner has recently been tested and used by the Italian and French national boxing teams during a World Series Boxing (WSB) event, which is endorsed by the International Boxing Association (AIBA).\nBurr argues that sports fans now expect stats and technology to support what they watch on screen.\nRobert Smith, the general secretary of the British Boxing Board of Control, is open-minded about the idea.\n\"A similar technology was tested five or six years ago and didn't work,\" he said. \"But if this has moved things on then we would look into it if there was a clear proposal.\"\nIn its current form, the Corner system is not necessarily a ready-made solution because it cannot identify on what part of the body the shots land - a key element of the scoring criteria used by judges.\n\"I think it is possible for us to get to a point where we could distinguish if a blow strikes the head or the body - the data from the sensors looks so much different,\" said Burr.\n\"Even if we couldn't, you would still have an indication to the accuracy, power and the number of punches, plus who has landed more. It would reduce 90% of the subjectivity of the punch stats.\n\"I think it is the right time for this sort of solution to come in.\"\nManny Pacquiao v Timothy Bradley (MGM Grand Garden Arena, Las Vegas, 9 June 2012)\nFive years ago Pacquiao was at the height of his powers and seemed to have done enough to retain his WBO welterweight title, with Timothy Bradley struggling with an injured foot by the fifth round.\nBefore the judges had been able to give their scores, Bradley reportedly told his promoter: \"I tried hard but I couldn't beat the guy.\"\nCompuBox - a system that provides real-time statistics for broadcasters - indicated Pacquiao had landed more punches in 10 of the 12 rounds - 253 to Bradley's 159.\nBut despite that, Pacquiao was beaten for the first time in seven years after two judges scored the bout 115-113 in the undefeated American's favour.\nThe Filipino won by unanimous decision in the 2014 and 2016 rematches.", "url": "https://www.bbc.com/sport/boxing/39489636"}