{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:01:30", "date_modify": "2025-05-20 15:01:30", "date_publish": "2023-07-27 11:37:24", "description": "Former Wales wing Mark Jones joins Ospreys as a first-team coach and will focus on defence.", "filename": "sport_rugby-union_66109311_1747753290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17370/production/_130188059_cdf_080623_walesu20training66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66109311_1747753290.html", "title": "Mark Jones: Ospreys name former Wales wing as new defence coach", "title_page": "Mark Jones: Ospreys name former Wales wing as new defence coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mark Jones has joined Ospreys as a first-team coach, focusing on defence.\nDarren Edwards had filled the Ospreys defence role since January 2022 but is no longer part of the set-up.\nFormer Wales wing Jones, 43, takes up the role after leading Wales Under-20s to sixth place at the Junior World Championships in South Africa.\n\"I can't wait to get started. There's a talented group... with some incredible young prospects that I've already had the pleasure of working with,\" he said.\n\"I'm truly excited for the opportunity to help drive the defensive strategies of the Ospreys and I'm looking forward to contributing wherever I can towards the team being the best team it can be.\"\nJones began his coaching career in Llanelli and took charge of RGC as well as a spell with English club Rotherham Titans.\nIn 2013, he assisted Rob Howley during Wales' Grand Slam-winning campaign and was part of Robin McBryde's staff on tour in Japan that same year.\nAfter working with Namibia at the 2019 Rugby World Cup, Jones joined the coaching set-up at Super Rugby side Crusaders in New Zealand from 2020 to 2021.\nHe then returned to work as defence coach at Worcester Warriors prior to the club being put into administration and suspended from the English Premiership.\nJones was on a short-term contract with the Welsh Rugby Union (WRU) for the Junior World Championships in South Africa after taking over from Byron Hayward.\nNew WRU executive director of rugby Nigel Walker says Jones impressed with the Wales youngsters and he would be having a conversation with Jones about his future during the tournament.", "url": "https://www.bbc.com/sport/rugby-union/66109311"}