{"authors": ["Chris Osborne", "www.facebook.com"], "date_download": "2025-05-19 14:41:42", "date_modify": "2025-05-19 14:41:42", "date_publish": "2017-07-23 11:51:24", "description": "Sammi Kinghorn wins gold on the final day of the World Para-athletics Championships as Britain finishes with 39 medals, their best tally for 19 years", "filename": "sport_disability-sport_40697902_1747665702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/71A6/production/_97049092_hi040748392.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_disability-sport_40697902_1747665702.html", "title": "World Para-athletics Championships: Britain's Sammi Kinghorn wins gold", "title_page": "World Para-athletics Championships: Britain's Sammi Kinghorn wins gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sammi Kinghorn won gold on the final day of the World Para-athletics Championships as Britain finished with their best medals tally for 19 years.\nT53 wheelchair racer Kinghorn completed a golden double with victory in the 100m, having already won the 200m.\nThere was also a trio of British silver medals for Polly Maton in the T47 long jump, Jordan Howe in the T35 100m and Mickey Bushell in the T53 100m.\nGB have collected 39 medals, eight more than they did in Doha in 2015.\nThe tally, which includes 18 golds, is GB's best since the Birmingham championships in 1998, where they collected 68 but at a time when there were many more events.\nThis is the sixth World Championships since the number of events was reduced, with Britain's next-best medal haul the 38 they took in Christchurch in 2011.\nThey finished third in the medal table, one place higher than two years ago, mainly because Russia, who came second in 2015, are currently banned.\nThere will be one more World Championships in 2019 before attention turns to the Tokyo Paralympics in 2020, where the aim will be to improve on the 33 medals collected in athletics at Rio.\nBritain's 11-time Paralympic champion and BBC Radio 5 live summariser Baroness Grey-Thompson said: \"Britain have done fantastically well. I don't think there's been too many surprises from the British team in terms of where medals have come from.\n\"It's all about the Tokyo 2020 cycle and this is a stepping stone to the next Paralympics.\"\nGB head coach Paula Dunne said: \"A year after the Paralympic Games we are in a strong position.\n\"This is a very highly motivated group of people, we are all working together and they know what they need to do to achieve their goals in Tokyo and what they need to work on.\"\nKinghorn, who is paralysed from the waist down after an accident at her home in 2010, has announced herself in London as the top T53 sprinter in the world and clinched 100m gold in a time of 16.65 seconds, ahead of Australia's Angela Ballard.\nShe returned to the track in the evening session for the 800m final and came fifth, but leaves with two golds and a bronze from the 400m after missing out on medals completely at Rio 2016.\n\"I genuinely felt my life would be spent in bed. And now I'm a double world champion. I asked myself why not me? And this week it was me,\" she told BBC Radio 5 live.\n\"I need to learn to believe in myself. I'm as good as these girls. I need to know I'm good enough for this.\"\nWhile Kinghorn's gold had been expected, Britain's trio of silver medals was far from guaranteed and came courtesy of exceptional performances.\nMaton, 17, a single-arm amputee, had finished fifth in the 100m and, by her own admission, had struggled with the long jump this season because of a persistent calf injury.\nBut she climbed from fourth to second with her final effort, landing a lifetime best of 5.23m.\nGold medal winner Taleah Williams had foregone her last two jumps to head over to the other side of the stadium and compete in the T47 400m, in which she came fifth.\n\"It's absolutely amazing,\" Maton said. \"It was about pulling myself together for the long jump. I've had a rubbish season with it, especially with my calf and I wasn't expecting this.\"\nBushell, 27, has pedigree in the T53 100m, having won gold in this stadium at the 2012 Paralympics, but went on to come sixth in Rio.\nHe only qualified third fastest from his heat, but converted that into a third world silver medal, finishing behind Canada's Brent Lakatos, who won a fourth gold in London.\nWelshman Howe had shown medal-winning form in the 100m this season, but with just a European Championship appearance to his name, he had never performed on the global stage.\nThe 21-year-old, who has cerebral palsy, excelled in front of the London crowd and clocked a personal best of 12.52 seconds.\n\"It was my time to shine and I did,\" he said. \"I was calm, I wasn't nervous. I want to progress now.\"\nElsewhere for GB, Steve Morris came fifth in the T20 5,000m.", "url": "https://www.bbc.com/sport/disability-sport/40697902"}