{"authors": ["Kate Holloway", "Adam Oxley", "www.facebook.com"], "date_download": "2025-05-21 05:25:11", "date_modify": "2025-05-21 05:25:11", "date_publish": "2025-04-03 13:57:31", "description": "Sheffield Wednesday boss Danny Rohl says he \"trusts\" that the club will resolve their unpaid wage problem as quickly as possible as the Owls prepare to host Hull on Saturday.", "filename": "sport_football_articles_c4g32ywe6q3o_1747805111.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/40fb/live/cbd80ab0-108a-11f0-92f2-9df11cadb01a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g32ywe6q3o_1747805111.html", "title": "Sheffield Wednesday: Danny Rohl 'trusts' club will solve wage issue", "title_page": "Sheffield Wednesday: Danny Rohl 'trusts' club will solve wage issue - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sheffield Wednesday boss Danny Rohl says he \"trusts\" the club to resolve their unpaid wage problem as quickly as possible.\nPlayers' wages have not yet been paid for the month of March due to cashflow issues experienced by owner Dejphon Chansiri.\nSpeaking ahead of Saturday's Championship game against Hull City (15:00 BST), Rohl has not confirmed if he has also been affected.\n\"It doesn't matter if I'm paid or not paid, I think it's a poor situation but what's important is that we solve this problem and then we can carry on,\" Rohl told BBC Radio Sheffield.\n\"It's a little bit of waiting while they solve this problem, I cannot influence this.\n\"I trust the club. I trust they will try to solve this. I hopefully can bring my players and focus for Saturday.\"\nRohl is \"hopeful\" the situation will find a resolution soon but admits he does not know the timeframe.\n\"It could be today, it could be tomorrow, it could be next week,\" he added.\n\"Of course, it's not perfect, but this case we can just influence what we can influence and this is on the pitch a good performance.\"\nThe latest controversy has added to a growing list of concerns from Wednesday fans over Chansiri's ownership of the club, with rumoured protests expected to take place outside of Hillsborough on Saturday.\nHowever, with the German unable to influence the financial struggles of the club, his priority is to keep \"positivity energy\" circulating within the dressing room.\nThe Owls have just seven games remaining; five points shy of a play-off place and also in search of their first home win in six league games (D3 L3).\n\"We must make this topic not big in our rooms because everybody knows this topic, and we think about this, but I try to focus on the next three points,\" Rohl said.\n\"It's around three months ago that we had our last home win and it would fantastic to give our massive fans these three points on Saturday and for us as well, to have a good home game.\n\"With a good performance on the pitch, we sometimes bring the emotions down. What's important is that we go forward and make this step.\"\nIn more positive news for the Owls, right-back Yan Valery and midfielder Stuart Armstrong are both expected to return on the weekend after missing the last five games with injury.\n\"They are both back but what it means for the starting XI, this is then a final decision,\" Rohl said.\n\"But if nothing happens today or tomorrow then both will be part of the squad.\"\nGiven the distractions off the pitch, it's likely all Wednesday players have found it difficult to remain unaffected while training - though Rohl does not want to use the issues surrounding the club as a crutch for a potential loss.\n\"I know for some players it's more, and for some players, it's maybe less, but for me, we should not be looking excuses before the game,\" he said.\n\"Hopefully I can bring the players on the right emotional level for Saturday. I know we have the quality to take the next win but it's about finding the emotional level.\"", "url": "https://www.bbc.com/sport/football/articles/c4g32ywe6q3o"}