{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:48:59", "date_modify": "2025-05-21 06:48:59", "date_publish": "2025-01-04 10:41:11", "description": "'Celtic eye loan deal for Arsenal's Kieran Tierney amid summer talks' - gossip", "filename": "sport_articles_cqjzkxydv5no_1747810139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f140/live/3931c220-ca88-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cqjzkxydv5no_1747810139.html", "title": "'Celtic eye loan deal for Arsenal's Kieran Tierney amid summer talks'", "title_page": "'Celtic eye loan deal for Arsenal's Kieran Tierney amid summer talks' - gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic are expected to contact Arsenal to begin negotiations about taking out-of-favour Scotland defender Kieran Tierney on loan until the end of the season, with talks having already begun between Celtic and the 27-year-old's agent about a permanent return when his contract with the Premier League club ends this summer. (Sky Sports), external\nCeltic are hoping to announce the sensational return of Kieran Tierney from Arsenal on a pre-contract agreement over the next week. (Scottish Sun), external\nCeltic winger Luis Palma is top of Genoa's January wish list, but they face competition for the out-of-favour 24-year-old Honduras from, among others, Greek club Olympiakos. (Genova Today), external\nCeltic have rejected an offer from Internacional to sign Argentine left-back Alexandro Bernabei, with the Brazilian club's bid being below the £3.75m the Scottish champions paid for him in 2022. (The Celtic Way), external\nLeft-back Alexandro Bernabei, centre-half Maik Nawrocki and winger Luis Palma are all likely to leave Celtic this month. (Football Insider), external\nOut of favour winger Jota has once again been sidelined by Stade Rennes boss Jorge Sampaoli amid rumours over a return to Celtic. (Daily Record), external\nJohnny Kenny, the second top scorer in this season's Europa Conference League, has returned to Celtic after his loan to Shamrock Rovers, but while the striker wants to challenge for a first-team place with his parent club, the Irish outfit are keen to bring him back to continue their European campaign. (Scottish Sun), external", "url": "https://www.bbc.com/sport/articles/cqjzkxydv5no"}