{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:58:22", "date_modify": "2025-05-20 11:58:22", "date_publish": "2023-08-06 08:00:19", "description": "Celtic defender set for La Liga switch as champions show interest in Manchester City fringe player...", "filename": "sport_football_66419258_1747742302.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7784/production/_130669503_-3b351d71-5d4e-4fbe-ae2e-a06d944ca5d2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66419258_1747742302.html", "title": "Scottish gossip: Celtic, Hearts, Dundee, Starfelt, Turnbull, Vata, McTominay", "title_page": "Scottish gossip: Celtic, Hearts, Dundee, Starfelt, Turnbull, Vata, McTominay - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Spanish side Celta Vigo are closing in on Celtic defender Carl Starfelt with a permanent transfer being agreed this weekend. (Fabrizio Romano), external\nJoining Vigo, coached by Rafa Benitez, would allow Carl Starfelt to be nearer partner Jacynta Galabadaarachchi, who left Celtic Women for Lisbon club Sporting. (Sunday Mail), external\nCeltic are in the queue for Manchester City midfielder Tommy Doyle, while Wolves are keen on a loan move for the 21-year-old. (Scottish Sun), external\nBrendan Rodgers has flung open the door for David Turnbull to sign a new Celtic deal following his impressive performance against Ross County. (The Herald On Sunday), external\nDavid Turnbull wants a new Celtic contract but Brendan Rodgers lays down challenge before making an offer. (Sunday Mail), external\nTorino are interested in a move for Celtic teenager Rocco Vata, according to Italian outlet Tuttomercato. (Scottish Sun), external\nBasel are \"toying\" with the idea of a move for former player Albian Ajeti but his Celtic wages could prove a stumbling block. (Blick via Sunday Mail, external)\nDundee manager Tony Docherty has confirmed interest in taking Everton midfielder Tyler Onyango on loan after St Johnstone decided against a move for the 20-year-old. (Sunday Mail), external\nRangers midfielder Alex Lowry turned down other clubs in England and Scotland to join Hearts on loan, says Tynecastle head coach Frankie McAvoy. (Edinburgh Evening News), external", "url": "https://www.bbc.com/sport/football/66419258"}