{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:22:54", "date_modify": "2025-05-20 14:22:54", "date_publish": "2023-07-29 07:56:46", "description": "Inaugural Ballon d'Or winner Ada Hegerberg will miss Norway's pivotal group game against the Philippines in the Women's World Cup because of injury.", "filename": "sport_football_66347689_1747750974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13C7A/production/_130581018_gettyimages-1553252834.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347689_1747750974.html", "title": "Ada Hegerberg: Norway striker injured for final group game", "title_page": "Ada Hegerberg: Norway striker injured for final group game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Inaugural Ballon d'Or winner Ada Hegerberg will miss Norway's pivotal Women's World Cup group game against the Philippines because of injury.\nNorway sit bottom of Group A with one group game remaining having suffered a shock defeat to co-hosts New Zealand before drawing with Switzerland.\nHegerberg, 28, withdrew from Norway's last match following the warm-up after feeling \"discomfort\", external in her groin.\nThe Lyon striker could return if they progress to the knockout stages.\n\"We knew it could be a possibility,\" said manager Hege Riise. \"The medical staff have worked to see if this was possible. It turned out today that it was not.\n\"The rest of us have prepared as best we can for what we have to do and the group has handled it very well.\n\"We are continuing the rehabilitation with a view to getting Ada ready to play for the next match, if we continue in the tournament.\"\nTo qualify for the last 16 Norway must beat the Philippines and hope either Switzerland or New Zealand win, and they manage a three-goal swing over the Swiss.\n\"There was too little time to make it to the match against the Philippines,\" added Hegerberg. \"I have faith in the team and will continue to work to be ready for a possible round of 16 game.\"", "url": "https://www.bbc.com/sport/football/66347689"}