{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:35:35", "date_modify": "2025-05-21 07:35:35", "date_publish": "2025-03-26 06:45:23", "description": "Ireland prop Niamh O'Dowd says the side will need to improve their execution against Italy in round two of the Women's Six Nations on Sunday.", "filename": "sport_articles_c743k4w3n3jo_1747812935.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e88/live/4282da60-08b5-11f0-8723-3171587fdebe.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c743k4w3n3jo_1747812935.html", "title": "Ireland to 'throw punches' in Italy - O'Dowd", "title_page": "Women's Six Nations: Ireland to 'throw punches' in Italy - O'Dowd  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland prop Niamh O'Dowd said they will need to improve their execution against Italy in round two of the Women's Six Nations on Sunday (15:00 BST).\nScott Bemand's side were beaten 27-15 by France in their opening fixture last weekend.\nAlthough they were just 17-15 behind going into the final 10 minutes, their efforts against a side they have not beaten since 2017 were undermined by 31 handling errors.\n\"It'll be the same for us focusing on ourselves, we're going to try and throw punches,\" said O'Dowd of the approach for the trip to Parma.\n\"We have our set-piece, we know our lineout works, we know our scrum can function. [It will be] more of the same and then just maybe just tidy up on the execution.\"\nOne area where Ireland have showed real improvement of late is their set-piece.\nAll three of their scores last weekend came off the lineout and they were successful with 18 of their 19 throws out of touch.\nO'Dowd credits the work of forwards coach Alex Codling who joined Scott Bemand's ticket last year.\n\"We spend a lot of time, especially on the lineout, with Codders [Codling],\" said the loose-head.\n\"He's been great. His level of detail, we've never experienced that level of detail. He also puts a lot of trust in us to get to that level.\n\"He backs us all the way. We've just put a lot of work into it every week and getting it all right.\"", "url": "https://www.bbc.com/sport/articles/c743k4w3n3jo"}