{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:14:02", "date_modify": "2025-05-21 07:14:02", "date_publish": "2025-03-29 07:38:49", "description": "Thiago Motta lasted just nine months at Juventus before the Italian giants sacked him last week, so what went wrong?", "filename": "sport_football_articles_c79898xn1xro_1747811642.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b729/live/625f1430-0bc0-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c79898xn1xro_1747811642.html", "title": "Thiago Motta: What went wrong at Juventus for ex-Bologna boss?", "title_page": "Thiago Motta: What went wrong at Juventus for ex-Bologna boss? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thiago Motta lasted just nine months at Juventus before the Italian giants sacked him last week and swiftly appointed Igor Tudor.\nMotta's departure came after heavy back-to-back defeats in Serie A - losing 4-0 at home to Atalanta before being beaten 3-0 at Fiorentina.\nThat appeared to be the final straw, with Motta having also overseen Juventus' exit from the Champions League and the Coppa Italia, which they won last season.\n\"It was inevitable,\" journalist Julien Laurens said on BBC Radio 5 Live's Euro Leagues podcast.\n\"You can't lose 4-0 and 3-0 in back-to-back games, on the back of being knocked out in the Champions League.\"\nBut will his departure solve Juventus' issues? And is former Croatia defender Tudor the right man to turn things around?\nMotta, 42, a former midfielder with Barcelona, Inter Milan and Paris St-Germain, was appointed last year after a hugely impressive spell at Bologna.\nHis progressive style of football transformed the club from one battling against relegation to one that finished fifth in Serie A last season to secure a place in the Champions League.\nHowever, the style of football with which he so impressed at Bologna was rarely on show with Juventus.\n\"I felt for him, because I am a big fan and I love what he did at Bologna,\" Laurens added.\n\"This doesn't mean he is not a good coach and that later on in his career he is not going to achieve great things, but maybe this was a little bit too early and certainly it just never started.\"\nQuestion marks could also be raised over Juventus' dealings in the transfer market during Motta's time at the club.\nWeeks after arriving at Juventus, he oversaw the £42.35m signing of midfielder Douglas Luiz from Aston Villa.\nSuch a significant outlay suggested he would be a key player for what Motta wanted to do, but Luiz started only three of the 17 league games in which he was included in the matchday squad.\nStriker Moise Kean was allowed to leave to join Fiorentina in a deal worth a reported £10m., external He is currently the second-highest scorer in Serie A with 15 goals.\nMotta's focus was to make Juventus defensively solid and he achieved that as they did not concede a goal in their first six games.\nBut that appeared to limit them as an attacking force and while they did not lose much, they also drew far too many games. From 1 September they went 19 league games unbeaten, but 13 of those ended in draws.\nItalian journalist Mina Rzouki said: \"We can't blame Thiago Motta for some of the choices of which players were brought in, but it was almost like he continued to double down on his tactics, regardless of the fact it seemed like he lost the dressing room when it came to absorbing those instructions of how he wants to play.\n\"He refused to be pragmatic in any way shape or form and I think when you have the second youngest team, that were now losing confidence, and yet you still double down on your philosophy.\n\"I think he made some huge mistakes, despite the fact he had a brilliant time at Bologna.\"\nNot all of the blame for Juventus' problems this season can be placed at the feet of Motta, with issues off the pitch as well as on it.\n\"Juventus is a mess on every level,\" Rzouki added.\n\"They don't have a sponsor, that goes to show you everything you need to know. Jeep ran out, the long-term sponsor they had, and they couldn't find another one.\n\"So this is a management that's not doing well from every level up above.\"\nAccording to reports,, external Juventus' sporting director Cristiano Giuntoli is under pressure for perceived mistakes made with player and manager recruitment.\nLaurens said: \"Motta struggled to get his project going, it's not just on him, obviously the players and Giuntoli the sporting director are partly to blame too.\n\"But as a manager you pay the price and I think it was inevitable they were going to sack him.\"\nGiven how the Motta appointment worked out, the pressure is on Giuntoli to ensure Tudor is the right man to turn the club's fortunes around.\nThe former midfielder, who played for Juventus between 1998 and 2007, is currently only on a contract until the end of the season, but that will reportedly be automatically renewed, external if he secures Champions League qualification.\nHe has been seen as something of a fixer - a coach able to come in during a season and oversee swift improvements.\nThe 46-year-old has a reputation for being a fixer, coming into clubs during the season and turning things around, something he did successfully in previous roles at Udinese, Hellas Verona and Lazio.\nHis most recent role was a three-month spell at Lazio at the end of last season.\n\"Am I someone who resolves problems? I consider myself a coach,\" Tudor said.\n\"I started coaching young and I've been doing it for 10-15 years, I have gone around a lot, I can also be a bit particular because I make choices with my heart. I live in the present.\n\"I want to be here for 10 years, but I will do my work in the same way. We can't control what happens in the future.\"", "url": "https://www.bbc.com/sport/football/articles/c79898xn1xro"}