{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:28", "date_modify": "2025-04-26 08:04:28", "date_publish": "2025-02-26 15:47:17", "description": "England forward Sarah Beckett extends her contract with Premiership Women's Rugby title-holders Gloucester-Hartpury.", "filename": "sport_rugby-union_articles_cz7vez1ypdeo_1745654668.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c6b5/live/0d8c7b90-f456-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cz7vez1ypdeo_1745654668.html", "title": "Sarah Beckett: England forward extends Gloucester-Hartpury contract", "title_page": "Sarah Beckett: England forward extends Gloucester-Hartpury contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England forward Sarah Beckett has extended her contract with Premiership Women's Rugby title-holders Gloucester-Hartpury.\nThe 26-year-old has 35 international caps and has won multiple Six Nations championships with the Red Roses.\nBeckett, who can play in the second and back row, joined the Circus from Harlequins in 2022 and has been part of the squad that has won the past two league titles.\nShe has played in every match for this season's table-toppers since returning from injury in round eight.\n\"It was a really easy decision for me to make, I loved being a part of this team and I'm excited to see what we can achieve in the future,\" she told the club's website., external\n\"It's such a good environment to be a part of and the future looks bright for the club. We're on the verge of doing something really special this season and I'm really happy to play a part in it.\"\nGloucester-Hartpury host Bristol Bears in the PWR semi-final on Sunday in a repeat of last season's final.\nThe club has not disclosed the length of Beckett's new deal.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cz7vez1ypdeo"}