{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:46", "date_modify": "2025-05-21 04:05:46", "date_publish": "2025-01-23 21:01:07", "description": "BBC Sport football expert Chris Sutton takes on Back in Action star Jamie Demetriou with his predictions for this weekend's Premier League fixtures.", "filename": "sport_football_articles_cdd9ezprgd4o_1747800346.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/85a9/live/b1607890-d780-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdd9ezprgd4o_1747800346.html", "title": "Premier League predictions: Chris Sutton v Back in Action star Jamie Demetriou", "title_page": "Premier League predictions: Chris Sutton v Back in Action star Jamie Demetriou - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City's Champions League hopes are in the balance but can they sustain their improved form in the Premier League against tougher opposition?\nThe defending champions have gone five games unbeaten in the league, winning three of them, but after facing Chelsea on Saturday they play Arsenal, Newcastle and Liverpool in successive weeks.\n\"We are about to really find out where City are at,\" said BBC Sport football expert Chris Sutton.\n\"They have had some kinder fixtures recently, but this run of games will define their season. If they make it into the Champions League play-offs, they will face even more games in February, which will make this spell even harder.\"\nSutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 23, he takes on Bafta-winning actor and comedian Jamie Demetriou, who stars opposite Cameron Diaz and Jamie Foxx in new comedy Back in Action.\nBack in Action is out on Netflix now. It features Diaz and Foxx as two secret agents who are forced out of retirement on a new mission, where they encounter Demetriou's character, Nigel, a wannabe agent himself.\nDo you agree with their scores? You can make your own below.\nThe most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.\nDemetriou, 37, grew up in north London but admits he only fell in love with Tottenham fairly recently.\n\"I didn't grow up in a particularly fertile football word,\" he explained to BBC Sport.\n\"My dad wasn't really into it - he was a kind of fair weather Panathinaikos fan, which didn't really give me much to grab on to.\n\"We never had the channels that showed it live, there was never anyone to take me to games and I was also rubbish at playing football.\n\"I kind of always had a secret love for it and would kind of tuck myself away during international tournaments and get really het up about it, but there was no anger for football in my house from anyone.\n\"I think the closest I came to choosing a team when I was a kid was when I once expressed a kind of like for football in general.\n\"For Christmas my dad bought me a pair of Arsenal shorts but they were three sizes too small for me. They were usually hidden under my baggy t-shirt so it looked like I wasn't wearing anything on my bottom half.\n\"At that age, it was like anything to do with football had some associated trauma.\"\nIt ended up being Demetriou's comedy writing that led to him finding Spurs - but not as a source for jokes.\n\"As time passed I always kind of had a longing to find a team,\" he added.\n\"When you miss the boat as a kid it is quite hard to make a commitment to anyone, but then I got into my late 20s and started taking more of an interest.\n\"Basically, as a writer you find yourself finding it more and more difficult to watch telly - or I do anyway - because you find yourself comparing your work to other people's.\n\"So, instead, I thought 'what is something I can watch that I cannot do?' and it was football. I realised it was the best, most dramatic and engaging TV show there is, and the only one that will be around forever in my opinion.\n\"I completely fell in love with it and I got to make an informed decision as to who I wanted to support. I suppose a lot of people have the kind of privilege of inheriting a kind of family team but I had to come at it from a different angle.\n\"Spurs are my closest team to where I live and, from the start, I just really enjoyed following them.\n\"I immediately really got into it and I probably watched every Premier League game, not just Spurs, every week.\n\"Then I became a season ticket holder, and went completely mad for it. We were not even doing particularly well at the time. I just found what was going on compelling and I just felt drawn them.\n\"It was almost like those sticks people use to take them to water - divining rods. I don't know if something like that took me to White Hart Lane, I just found myself there.\"\nChris Sutton and Jamie Demetriou were speaking to BBC Sport's Chris Bevan.\nWhat a game this is, between two of the form teams in the Premier League.\nWe all know how good Nottingham Forest have been but I am fed up with writing off Bournemouth because I keep on getting them wrong.\nI didn't see their big win over Newcastle coming last week, but they were brilliant, and they thoroughly deserved it.\nThe bad news for Cherries fans, of course, is that as soon as I start backing them, you can guarantee that their results will tail off.\nI actually think this is more likely to be a draw, because Forest have an excellent away record - only Liverpool have picked up more points than them on the road this season.\nI am pretty sure that the BBC readers will be predictable and go for it to end 1-1, but like I say, I am backing Bournemouth now.\nSutton's prediction: 2-1\nJamie's prediction: Bournemouth are on form but Forest are on fire. 1-2\nIt is hard to judge David Moyes's Everton off the back of their 3-2 win over a Tottenham side who have been so leaky defensively.\nThis will be a much better indication of whether Toffees striker Dominic Calvert-Lewin is up and running after ending his long wait for a goal against Spurs.\nSimilarly, it's hard to read too much into Brighton's victory at Manchester United.\nTheir performance was impressive, especially how dominant they were, but then everyone is dominating against United at the moment - even Southampton managed it when they went to Old Trafford.\nEverton were also very good against Spurs but I think they will find things much harder here and Moyes has still got a bit of work to do to keep them up.\nScoring goals has been such a problem for them so getting three against Tottenham was massive - but I don't think they will get any this week.\nSutton's prediction: 2-0\nJamie's prediction: It would be comforting for me if I could write off our loss to Everton as Moyes bounce, so I'd like to see it continue, although it probably won't work to the same extent against Brighton. 2-2\nIpswich got absolutely smashed by Manchester City last time out and I have told my daughter's Ipswich-supporting teacher, Mr Fields, that if he is considering travelling up to Anfield for this game, then he really shouldn't bother.\nAnother of Sophia's teachers, Mr Worral, is upset that Mr Fields got a mention and he didn't - so I am putting that right here.\nMr Worral is actually a Liverpool fan, and he is going to have a much more enjoyable weekend.\nIt's a long way for Ipswich fans to travel to watch their team get spanked, then go all the way back to East Anglia.\nThis should be pretty routine for Liverpool and they will get a few goals, but because they are fighting on so many fronts I don't think they will absolutely wallop them.\nSutton's prediction: 3-0\nJamie's prediction: I really enjoy watching Ipswich and I want them to stay up - I feel like they are giving it a good go, and they play with such confidence. I have a feeling they will come back with some grit after what City did to them and while I don't necessarily think they will win or even score, this will be close. 1-0\nAll the talk before Newcastle played Bournemouth was whether Eddie Howe's side could push Liverpool in the title race, but that talk has stopped since they lost 4-1.\nThey are still right in the mix for a top-four finish, but it is important for them to quickly get back to winning ways - and this seems like a good game for them to do that.\nSouthampton have made a decent fist of it in their past two games, against Manchester United and Nottingham Forest, but they still ended up losing both of them.\nLet's face it, they are as good as down. Their situation is so bad that, when we spoke about the relegation battle on this week's Monday Night Club, we didn't even mention them - the assumption is that they are already gone.\nTheir main aim now is to avoid going down with the lowest points tally in Premier League history.\nThey have got 16 games left to pick up the six points that would see them beat Derby County's tally of 11 points from 2007-08.\nIt is a big incentive because Robbie Savage, who was Derby's captain that season, has had to live with that record for years.\nI'd really like him to keep hold of it, so let's all pray for Southampton to reach the 12-point mark. I don't see them picking anything up here though.\nSutton's prediction: 0-2\nJamie's prediction: Newcastle will have something to prove after the Bournemouth game and it seems like Southampton are committed to finishing bottom, and are doing a good job of it. 1-3\nI see Wolves manager Vitor Pereira dug out Matheus Cunha for his body language after Monday's defeat by Chelsea.\nI am not sure how smart a move that is, considering Cunha has scored almost a third of their 32 Premier League goals this season.\nMaybe it will work and inspire Cunha - but there is always the risk of losing a player when you criticise him like that.\nMind you, I am not sure about Arsenal boss Mikel Arteta's attempts to galvanise his players either.\nThe Gunners have been playing Brazilian Samba music during training sessions, external this week, to 'build energy' according to Arteta.\nHe has some wild ideas, including getting pickpockets to steal valuables from his players, external during a squad meal at the start of the season.\nI dread to think how it would have gone down if, say, Martin O'Neill had started playing any sort of music, Brazilian or otherwise, during training when I was with Celtic.\nI think the minute his back was turned, the players would have been making all sorts of gestures. We would have just found it funny - maybe it is a generational thing.\nAs for the pickpockets? If some of my old team-mates found someone trying to nick their wallets then they might have ended up having a scrap with them. Imagine if that one went wrong!?\nStill, maybe I am just being an old misery for mocking things like this. Arteta is thinking outside the box and trying something different - if he wins this game, like he did against Dinamo Zagreb on Wednesday, then I guess it has worked.\nArsenal slipped up badly against Aston Villa last weekend, letting them back in it from 2-0 up, but I don't see them having any problems here.\nSutton's prediction: 0-2\nJamie's prediction: Any other season I would be pushing for a Wolves win but with Spurs not far above them I am going to enjoy being a realist for a second. I'd love to be surprised but I just don't think Wolves can do it at the moment, even though Arsenal are not exactly in top form. 1-2\nWell, so much for City being 'back' after beating Leicester, West Ham and Ipswich recently. What happened against Paris St-Germain was more evidence that they are nowhere near their usual selves.\nThe number of signings they are making is maybe an admission from Pep Guardiola of how much needs to change.\nThe pressure is really on City in the Champions League now after Wednesday's defeat in Paris, but they have got some tough games coming up in the Premier League too, starting with this one.\nSaturday is not just a case of Cole Palmer returning to his former club as a potential match-winner, because Chelsea's manager Enzo Maresca is also back on familiar territory.\nThis is a huge game in the race for the top four and it feels like anything could happen.\nI definitely don't see City keeping Chelsea out, but my gut feeling is still that they will win this.\nSutton's prediction: 2-1\nJamie's prediction: I am expecting at least one mad result from these games, and I reckon this one will have a fair few goals. 4-2\nCrystal Palace are on a bit of a roll after three wins and two draws in their past five league games.\nForm-wise they are on a better run than Brentford, but I was impressed by Thomas Frank's side when I watched them against Liverpool last week - even though they lost.\nI am a big fan of Bees striker Bryan Mbeumo, who looked really dangerous in that game. I feel like they will score again here, but I don't think they will win this week either.\nPalace were unlucky to lose at Brentford on the opening weekend of the season after Eberechi Eze scored with a free-kick but it was ruled out because the referee had already blown his whistle.\nThis time, the Eagles are definitely getting something from the game, and this has got a draw written all over it.\nSutton's prediction: 1-1\nJamie's prediction: These two are kind of neck and neck in the table and Palace are in a particularly good place at the moment so it is tempting to go for a home win. Brentford never lie down, though, and you never know what Mbeumo and Yoane Wissa can pull out of the bag. 1-1\nTottenham have only picked up one point from their past six league games but that is still better than Leicester, who have now lost seven in a row.\nThings are becoming increasingly desperate at Spurs, too. Ange Postecoglou seems to be getting a lot of backing from above, but this is an enormous game for him.\nThey are missing Cristian Romero and Micky van de Ven at the back but there is still an argument that the players who have come in should be doing better than they are.\nThat's the way I feel anyway - I look at the Tottenham team and they should not be trailing by three goals, going on five or six, at half-time against Everton.\nI think you can lose certain games as an under-pressure manager, but not others. I was worried for Postecoglou when Spurs went three goals down because of the pressure that losing to another struggling team would put on him.\nThe same applies here. Lose this and he's in deep trouble.\nI love watching Ange's teams play, I have got a lot of time for him and he has been really unfortunate with a few things, but if Spurs are beaten at home by Leicester then things could get pretty ugly even if they are still in both domestic cups and the Europa League.\nI don't think that will happen though. These two sides drew 1-1 on the opening day but this time I am backing Spurs to win comfortably.\nSutton's prediction: 4-1\nJamie's prediction: Although the team is not in form, enough of our players are to get us a win here. It feels like a good opportunity for us to get back on track. 3-1\nJamie on why Postecoglou should stay: I am a Greek boy so having a Greek boy in charge is always appealing to me. I am not loving being 15th but personally I would rather be in hell than in limbo and the idea of Ange getting sacked mid-season when we are in the semi-finals of the Carabao Cup and still in a bunch of cups and having a caretaker manager feels more devastating than a poor position in the league.\nI would also much rather be watching the kind of football we have been playing than what was going on under Jose Mourinho and Antonio Conte. Doing badly and being bored is like an indescribable pain where at least there is some kind of dynamism to this.\nThe cold compress on my hot forehead is just looking at the amount of goals we have scored this season - it is insane when you compare it to where we are in the table.\nAston Villa are eighth in the Premier League and ninth in the Champions League, so their season is hardly a disaster - they just look a little bit flat at times.\nTheir striker situation is something that Villa boss Unai Emery has got to sort out because he put Jhon Duran on to play with Ollie Watkins in the second half against Monaco, and they are not playing well together\nI don't know if that is an ego thing, where both strikers want to be the main man, but they both need to have a think about what benefits the team.\nAs a former striker myself, I know how other strikers want to be fed, and how to have an understanding to create situations, but that does not seem to be happening - Watkins and Duran are not connecting or clicking, which is a worry.\nFor a partnership to work, you have got to understand your role in the team and how sometimes one of you has got to sacrifice yourself.\nBelieve it or not, I was pretty good at realising that, where I was in the pecking order, and how to adapt my game. There are people out there who would say I was unselfish and a team player, and I wouldn't argue with that.\nI know there is a different view because I listen to my old strike-partner Alan Shearer speaking to Erling Haaland about how you have to be single-minded in front of goal.\nYou do, you have to be selfish when it comes to taking chances. But football is a team game and sometimes you have to be prepared to adapt and roll your sleeves up - Shearer always did it - and try to play roles that you don't necessarily want to play, for the good of the team.\nWhen Aston Villa's squad is stretched and a little bit fatigued, Watkins and Duran should be capable enough, and have enough understanding of how to feed each other, because strikers know how to do it.\nNot doing it is a bit of a blot on the copybooks of both players. They are both very talented players, but they need to work this out for the good of the team. Maybe Emery needs to whack some Brazilian music on in training to sort them out?\nSeriously, though, this is a crucial time in Villa's season and I think they will get past West Ham.\nGraham Potter's side were jammy when they beat Fulham last week, but I don't see them being lucky enough to beat Villa.\nSutton's prediction: 2-1\nJamie's prediction: Villa obviously have the potential to do damage but I just feel like Potter has got something to prove in his first month. 1-2\nI was totally gutless last week, going for Manchester United to draw with Brighton.\nI put it down to the stick I get on social media whenever I predict United will lose getting to me and clouding my judgement, and it is not going to happen again.\nMy gut was telling me Brighton are a better team than United but I didn't listen. I have the same feeling about Fulham and I am not going to ignore it.\nManchester United boss Ruben Amorim has backtracked a bit after calling his team \"maybe the worst\" United side ever when they lost to Brighton, claiming he was speaking more about himself.\nI don't think that was a smart move, no matter what he meant by it. I like Amorim but being overly emotional is not going to help his cause.\nIn terms of this game, let's get it right - Fulham are bright going forward, they are going to be bolder than United will be, and they will take the game to them.\nThat scenario has suited United in the past, but the outcome of this game really depends on whether they turn up, and at the moment that feels like the toss of a coin.\nSutton's prediction: 2-1\nJamie's prediction: There is a certain kinship between Spurs and United fans at the moment, because we are both in such terrible form. Fulham have been amazing to watch and I don't think that United have kind of concocted the cure for what is going on with them, so a Fulham win feels fairly inevitable. 2-1", "url": "https://www.bbc.com/sport/football/articles/cdd9ezprgd4o"}