{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:15:32", "date_modify": "2025-05-19 15:15:32", "date_publish": "2015-02-19 00:00:39", "description": "Terry wants new deal, Man Utd target Kyle Walker, Inter eye Yaya Toure and Warburton could manage England, plus more.", "filename": "sport_31527708_1747667732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80715000/jpg/_80715661_gossip_promo_464_main.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_31527708_1747667732.html", "title": "Gossip column: Terry, Toure, Pogba, Gignac, Chadli", "title_page": "Gossip column: Terry, Toure, Pogba, Gignac, Chadli - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea captain John Terry, 34, is willing to accept a one-year contract at Stamford Bridge but negotiations have not yet started. (Daily Star), external\nJuventus midfielder Andrea Pirlo, 35, has told team-mate Paul Pogba, 21, to resist the lure of a Premier League return and stick with the Italian side. (Sun - subscription required), external\nInter Milan hope to lure Ivory Coast midfielder Yaya Toure, 31, away from Manchester City but the proposed move hinges on the Italian side qualifying for next season's Champions League. (Tutto Mercato - in Italian), external\nSchalke defender Benedikt Howedes, 26, who is a target for both Manchester United and Arsenal, has said his \"goal\" is to play in England. (Daily Mirror), external\nManchester United are also interested in signing Tottenham defender Kyle Walker, 24, in the summer with the England international expected to cost at least £20m. (Daily Mail), external\nLiverpool striker Rickie Lambert, 33, has revealed he agreed terms over a two-and-a-half-year deal to move to Aston Villa but needed more time to make his decision. (Sun - subscription required), external\nManchester United and Arsenal target Aymeric Laporte, 22, has played down the chances of him leaving Athletic Bilbao this summer. (Talksport), external\nMarseille have lined up Fernando Llorente, 29, to replace striker Andre-Pierre Gignac, 29, who is wanted by both Liverpool and Manchester United. (Daily Express), external\nWest Ham's new signing, Brazilian forward Nene, 33, could be at the centre of a power struggle between manager Sam Allardyce and co-owner David Sullivan who was keen to push through the free transfer. (Daily Mirror), external\nTottenham midfielder Nacer Chadli, 25, has revealed how there is now no escape from Mauricio Pochettino's punishing fitness regime - thanks to a GPS tracker. (Daily Express), external\nManager Brendan Rodgers says the Europa League has not yet seen the best of his resurgent Liverpool side who hope to show what they are made of against Besiktas at Anfield on Thursday. (Liverpool Echo), external\nManchester City full-back Micah Richards, 26, on loan at Fiorentina, returns to England in the Europa League against Tottenham on Thursday but says his time with the Sky Blues is over. (Daily Telegraph), external\nEverton manager Roberto Martinez will speak with former Tottenham and QPR boss Harry Redknapp about playing on Young Boys' artificial pitch ahead of their Europa League tie - Spurs played on the surface five years ago. (Daily Express, external)\nMelbourne City and former Chelsea star Damien Duff's career could be over at the age of 35 after damaging his calf and ankle. (Guardian) , external\nGus Poyet is not in immediate danger of losing his job as manager of Premier League strugglers Sunderland. (Daily Telegraph), external\nMeanwhile, Black Cats chief executive Margaret Byrne has denied claims by the club's former director of football Roberto De Fanti that he had to implement huge cost-cutting measures, saying: \"His only remit was to improve the team.\" (Guardian), external\nFormer Manchester United midfielder Anderson lasted just 36 minutes of a cup tie at high altitude for his new Brazilian club Internacional before requesting an oxygen mask. (Daily Mail), external\nVenezuelan side Zamora were quite literally \"bowled over\" with their latest goal celebration. Arles Eduardo Flores fired home from 35-yards in the Copa Libertadores match with Uruguayan side Wanderers before celebrating in style.(Metro), external\nFormer Manchester United manager Sir Alex Ferguson has been reunited with Roy Keane for the first time since his former captain said he would \"never forgive\" his old boss in his autobiography. The pair sat three rows apart on a flight back from Paris on Wednesday. (Sun - subscription required), external\nEx-England midfielder David Bentley, 30, scored three points on his Gaelic football debut after switching codes for an Irish documentary. (Daily Mail), external", "url": "https://www.bbc.com/sport/31527708"}