{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:20:19", "date_modify": "2025-05-19 15:20:19", "date_publish": "2017-07-03 23:01:10", "description": "More than a third of Premier League football fans say they regularly watch matches live online via unofficial streams, according to a BBC survey.", "filename": "sport_football_40483486_1747668019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11D7F/production/_96778037_hazard_clichy.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40483486_1747668019.html", "title": "Premier League: Third of fans say they watch illegal streams of matches - survey", "title_page": "Premier League: Third of fans say they watch illegal streams of matches - survey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "More than a third of Premier League football fans say they regularly watch matches live online via unofficial streams, according to a BBC survey.\nThe poll suggests younger adults are most likely to say they stream matches via unauthorised providers.\nNearly a quarter of all fans surveyed regularly watch matches online via special technology, such as Kodi boxes.\nSky and BT Sport hold the live rights for Premier League football, and unofficial streams are illegal.\nThe Premier League says the law is catching up with pirates and that it will continue to protect its copyright.\nIn April, a ruling by the European Court of Justice, external put pirated streams on the same legal footing as copyright-infringing downloads, making it illegal to watch them.\nKieron Sharp, director general of the Federation against Copyright Theft (Fact), said: \"People need to be aware that this is no longer a grey area, in fact it is very black and white.\n\"If you are accessing content for free such as sport, TV and films for which you'd normally need a subscription, or go to the cinema, or buy a DVD, this is illegal.\n\"As the old saying goes, if it looks too good to be true, then it probably is.\"\nThe Premier League is seeking to protect the value of its TV deal, after Sky and BT Sport paid a record £5.136bn for rights to show live matches for three seasons.\nLast season saw the biggest drop in live Premier League TV viewing figures for seven years, hitting both Sky and BT. Sky saw a 14% drop, while viewing of BT channels dropped by 2%.\nThis may have been caused in part by the relegation of well-supported teams such as Newcastle and Aston Villa, while Sky said it was also encouraged by the use of alternative legal platforms such as Sky Go and Now TV.\nEarlier this year the Premier League announced what it described as its biggest ever anti-piracy crackdown, focusing on those who provide the streams and supply equipment.\nIn March, a High Court judge granted an order for the UK's four biggest internet service providers to block access to online servers, making it harder for pirates to switch streams when they are shut down.\nA Premier League spokesman said: \"Fans should know that these pre-loaded boxes enable pirate broadcasts of Premier League football, and other popular content, and are illegal. People who supply them have been jailed or ordered to pay significant financial penalties.\n\"We are increasingly seeing prominent apps and add-ons being closed down as the law catches up with them, leading to consumers being out of pocket.\n\"The Premier League will continue to protect its copyright, and the legitimate investment made by its broadcasting partners. Their contribution allows our clubs to develop and acquire players, invest in facilities and support the wider football pyramid and communities - all things that fans enjoy and society benefits from.\"\nKodi is free software, built by volunteers, that is designed to bring videos, music, games and photographs together in one easy-to-use application.\nThe developers behind Kodi say their software does not contain any content of its own and is designed to play legally owned media or content \"freely available\" on the internet.\nHowever, the software can be modified with third-party add-ons that provide access to pirated copies of films and TV series, or provide free access to subscription television channels.\nIn March, a man from Hartlepool was given a suspended prison sentence and ordered to pay £250,000 for selling Kodi boxes to pubs and clubs.\nFor the BBC 5 live survey, ComRes interviewed 1,000 adults who report being regular viewers of Premier League football, online between 7 and 15 March.", "url": "https://www.bbc.com/sport/football/40483486"}