{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:13:57", "date_modify": "2025-05-20 14:13:57", "date_publish": "2023-07-29 23:05:31", "description": "Brentford boss Thomas Frank says it is an \"open secret\" the club are willing to sell Spain goalkeeper David Raya.", "filename": "sport_football_66351862_1747750437.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E57C/production/_130584785_gettyimages-1565580460.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66351862_1747750437.html", "title": "David Raya: Thomas Frank says it is an 'open secret' that Brentford are willing to sell Spanish keeper", "title_page": "David Raya: Thomas Frank says it is an 'open secret' that Brentford are willing to sell Spanish keeper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford boss Thomas Frank says it is an \"open secret\" the club are willing to sell Spain goalkeeper David Raya.\nRaya, 27, who kept 11 clean sheets last season as the Bees finished ninth in the Premier League, has been strongly linked, external with a move to Bayern Munich as competition for Manuel Neuer.\n\"I think it's natural that he would like to leave if it's a good opportunity for him,\" said Frank.\n\"We all think it's a good idea at the right price.\"\nRaya is currently with the Brentford squad as part of their pre-season tour of the United States.\nHe came on at half-time in the Premier League Summer Series match against Fulham last Sunday, while £11m summer signing Mark Flekken has started both games in the USA so far.\nFrank said he was undecided as to whether Raya would be in the squad for Sunday's game against Aston Villa.\n\"He's training hard and is good professional,\" said the Dane, adding that Raya's potential departure probably means \"focusing on the other keepers we have, I think that [is] completely natural\".", "url": "https://www.bbc.com/sport/football/66351862"}