{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:50:49", "date_modify": "2025-04-26 03:50:49", "date_publish": "2025-03-05 12:23:57", "description": "PSV 1-7 Arsenal reaction: Chris Sutton on Ethan Nwaneri and Myles Lewis-Skelly", "filename": "sport_football_articles_c4g0kyepl8xo_1745639449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed2a/live/14c05930-f998-11ef-ae5c-2f8723cb2041.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g0kyepl8xo_1745639449.html", "title": "PSV 1-7 Arsenal reaction: Chris Sutton on Ethan Nwaneri and Myles Lewis-Skelly", "title_page": "PSV 1-7 Arsenal reaction: Chris Sutton on Ethan Nwaneri and Myles Lewis-Skelly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC Sport expert Chris Sutton cannot believe how well 17-year-old winger Ethan Nwaneri has adapted since breaking into the Arsenal first team.\nThe youngster scored in the Gunners' 7-1 win at PSV Eindhoven on Tuesday.\n\"You think with young players at times they will come into the team and hit the ground running and then they'll take a dip but he looks an absolutely phenomenal player,\" said Sutton on BBC Radio 5 Live's Football Daily podcast.\n\"He can drive the inside and can give that little step and go the outside.\"\nAt 17 years and 348 days old, Nwaneri is the third youngest player to score in the Champions League knockout stages and his goal was assisted by fellow teenager Myles Lewis-Skelly.\nFormer Tottenham winger Andros Townsend offered his take on why the duo are so dangerous for Mikel Arteta's side.\n\"When you are that age, you don't really feel pressure,\" he said. \"You have confidence and you don't think about how it is a Champions League away fixture in the knockouts.\n\"You are just in the moment, and you could see with those guys, they were just in the moment and enjoying being on that stage.\n\"It is amazing to see those guys perform so well.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g0kyepl8xo"}