{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:30:08", "date_modify": "2025-05-21 06:30:08", "date_publish": "2025-01-04 14:45:37", "description": "Jersey Bulls extend their unbeaten run in the league to 22 games as they beat Epsom and Ewell 5-1 in Combined Counties Premier South.", "filename": "sport_football_articles_cwy4zpdjn5go_1747809008.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/523e/live/38593da0-caa2-11ef-a078-37769e6d4b12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy4zpdjn5go_1747809008.html", "title": "Jersey Bulls beat Epsom and Ewell 5-1 to keep unbeaten league record", "title_page": "Jersey Bulls beat Epsom and Ewell 5-1 to keep unbeaten league record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey Bulls extended their unbeaten run in the league to 22 games as they beat Epsom and Ewell 5-1 in Combined Counties Premier South.\nThe Bulls impressed in the early part of the game and took the lead when Toby Ritzema headed in a Rai Dos Santos corner after 23 minutes.\nDos Santos doubled the lead 16 minutes later when he headed in a free-kick.\nThe visitors replied through Niall Stillwell's 63rd-minute goal despite Bulls protests that goalkeeper Euan van der Vliet was fouled, but Ritzema blasted in a third for the islanders four minutes later to restore their two-goal cushion.\nBulls scored two goals in a three-minute spell to end any lingering doubts - first Karl Hinds converted a Jonny le Quesne ball into the box before Dos Santos calmly slotted home his second.\nIt saw the islanders score five or more goals for the sixth time this season - they have yet to lose a league game under manager Elliott Powell as they remain third in the division.\nBulls have two games in hand on second-placed Redhill and have played four fewer than leaders AFC Whyteleafe, who travel to Jersey in two weeks.\n\"It was pretty well-deserved,\" Powell told BBC radio jersey\n\"I thought first half in particular we really got on the front foot, we had a bit of a change in shape today and the lads responded to it really well.\n\"Every credit to the lads, they've shown a good degree of tactical flexibility and understanding to implement that game plan and it's paid off today with three points.\"", "url": "https://www.bbc.com/sport/football/articles/cwy4zpdjn5go"}