{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:03:42", "date_modify": "2025-05-21 06:03:42", "date_publish": "2025-04-01 15:50:50", "description": "Rangers players 'invariably let you down' as 'they're not strong enough' to win trophies", "filename": "sport_articles_cn91dqevjljo_1747807422.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3461/live/826c03b0-0f07-11f0-8db0-89a142ea748b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn91dqevjljo_1747807422.html", "title": "Rangers players 'invariably let you down' as 'they're not strong enough' to win trophies", "title_page": "Rangers players 'invariably let you down' as 'they're not strong enough' to win trophies - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"The minute you start to think that they've turned a corner and they've cracked it, they'll invariably let you down.\"\nIs this a spot-on assessment of Rangers this season, despite a revival of sorts under Barry Ferguson?\nThe dramatic 4-3 weekend win over Dundee was a microcosm of the Ibrox side's season so far, showing their ability to score goals and look threatening in attack while highlighting their glaring defensive frailties.\n\"I think Barry Ferguson touched on it after the game, he mentioned bad habits coming back and I agree with him,\" Sunday Mail chief football writer Scott McDermott told the Scottish Football Podcast.\n\"He's not daft, he knows he's delighted with some of the results, but he knows the performances still aren't there.\"\nDespite rallying from 3-1 down at Dens Park, many still aren't convinced by the mental fortitude of this Rangers side and whether they are able to find consistency.\nMcDermott added: \"These players, they've been so up and down the last four or five years, the minute you start to think they've turned a corner and they've cracked it, they'll invariably let you down because I don't think mentally they're strong enough to go and win trophies and titles, I think that's been proved.\n\"So it's all a bit wild at the moment for Rangers. It's a bit of a rollercoaster ride with Barry Ferguson.\n\"Obviously, they've got the European tie coming up, but don't think for a minute that everything's turned round and everything in the garden is rosy.\"", "url": "https://www.bbc.com/sport/articles/cn91dqevjljo"}