{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:06:22", "date_modify": "2025-05-19 15:06:22", "date_publish": "2015-03-04 14:19:32", "description": "Stevenage's squad is suffering at the hands of physical opponents, according to manager Graham Westley.", "filename": "sport_football_31732558_1747667182.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81395000/jpg/_81395736_westley_getty_2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31732558_1747667182.html", "title": "Graham Westley: Stevenage players getting a 'kicking'", "title_page": "Graham Westley: Stevenage players getting a 'kicking' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stevenage's squad is suffering at the hands of physical opponents, according to manager Graham Westley.\nBoro are currently unbeaten in five matches, but have had a number of players sidelined for the past month.\n\"Opposition managers make a thing about us being big, strong and physical,\" Westley told BBC Three Counties Radio.\n\"And then they get away with blue murder kicking seven bells out of our players. But we don't moan about it, it's not an issue to us.\"\nStevenage beat Plymouth on Tuesday with a late Bruno Andrade goal, but Westley said Roarie Deacon, Chris Whelpdale, Charlie Lee, Dean Wells and Bira Dembele were all in the treatment room after the game.\nAdam Marriott, Calvin Zola, Darius Charles and Jerome Okimo are already sidelined.\n\"You either laugh about it or pull your hair out. It's bizarre,\" said Westley, whose side are a point below the play-off places, despite their injury problems.\n\"I see the knocks that come our way and it's laughable that not much happens when it's our players on the receiving end.\n\"We're enjoying our football. I think that's 28 points in 16 games - when you consider how small we are and the problems we've had it's a really good return\n\"But we've got an opportunity to kick on now.\"\nWestley added that he would look at extending the loans of Andrade, from QPR, and Danny Johnson, from Cardiff, after both deals expired last night.", "url": "https://www.bbc.com/sport/football/31732558"}