{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:15", "date_modify": "2025-05-21 03:48:15", "date_publish": "2025-04-07 12:25:41", "description": "Man Utd news: Fans raise concerns about 'disgusting' reallocation plans", "filename": "sport_football_articles_crldkl6pg07o_1747799295.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c77e/live/238cc570-138d-11f0-b751-af2aaed03a76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crldkl6pg07o_1747799295.html", "title": "Man Utd news: Fans raise concerns about 'disgusting' reallocation plans", "title_page": "Man Utd news: Fans raise concerns about 'disgusting' reallocation plans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United supporters have been voicing their grievances after staging a sit-in protest against the Glazer Family, the increase in ticket prices and the announcement that 500 supporters behind the dugouts will be reallocated.\nBBC Radio 5 Live's 606: Football Phone In spoke to some of the Manchester United fans, who said the club were showing \"no regard for their long-term supporters\" in their reallocation plans.\nRob said: \"We got a generic email that said on one line at the bottom: 'You will be moved'. They couldn't care less about the supporters. They are killing the club.\n\"They said it is to improve the 'matchday experience' for supporters, which is nonsense. They aren't going to improve my experience because they are going to try to move me up into the gods.\n\"A lot of people sat around me are saying they are done. I'm one of those people. I won't be sitting anywhere else, I have made that decision. I'll go and support my local team, like Macclesfield or Altrincham.\"\nColin added: \"My brother sits in there. He has been a season ticket holder for 40 years, he is 74 years old and had a stroke a couple of years ago. I've just had to leave him there in tears, which is really sad, as it is the one thing that gets him out of the house now.\n\"His season ticket is also going up £60 and he has been hassled three times about whether he is going to renew or not. They haven't even told him where he will be sitting yet, but they want to know if he is going to renew?\n\"We tried to chat to some of the directors but we were given short shrift from some of the sporting directors who were leaving the box. It is disgusting.\"\nFinally, Steve said: \"When I phoned the club to say that we should have been contacted about where we're going to be reallocated, they couldn't even confirm if the three of us in our family were going to be able to sit together.\n\"I sent an email to their generic address and, unsurprisingly, I've had no response. Unfortunately, this is all a sad indictment of how classless Manchester United has become over the past 12 months.\"\nWhen United announced the price changes, chief executive Omar Berrada said the club \"worked hard to come up with a pricing package that is fair and reasonable\" and stated that the new changes were being made \"to offset continued rises in operating costs\".\nCo-owner Sir Jim Ratcliffe has also said that recent cost-cutting measures have been \"necessary to put Manchester United back on to a stable footing\".", "url": "https://www.bbc.com/sport/football/articles/crldkl6pg07o"}