{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:37:13", "date_modify": "2025-05-20 13:37:13", "date_publish": "2023-08-01 16:04:05", "description": "Stevenage are fined £7,500 after a teenage fan ran on to the pitch and \"attempted to assault\" a Bradford player.", "filename": "sport_football_66374540_1747748233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12AC/production/_130608740_shutterstock_editorial_14027370a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66374540_1747748233.html", "title": "Stevenage fined after fan, 14, 'attempted to assault' Bradford player on pitch", "title_page": "Stevenage fined after fan, 14, 'attempted to assault' Bradford player on pitch - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stevenage have been fined £7,500 after a 14-year-old fan ran on to the pitch and \"attempted to assault\" a Bradford player during their game in February.\nAn 86th-minute goal by Jamie Walker secured a 3-2 win for the visitors and ended a 12-match unbeaten run for Boro.\nStevenage admitted failing to ensure fans did not \"encroach on to the pitch or commit any form of pitch incursion\".\nAn independent panel also ordered the club to draw up an action plan to reduce the risk of future incidents.\nThe report said, external the teenager ran towards the centre circle and past the referee \"unopposed\" and \"attempted to assault\" Bradford's Andy Cook in the 87th minute of the game, but a Stevenage player stepped between them.\nIt was concluded by the commission there was no \"proper risk assessment\" or \"action plan\" to deal with a pitch invasion, which led to the lack of reaction from security and safety staff.\nThe supporter was eventually ejected from the ground and has been banned from Lamex Stadium for three years.\nA Bradford fan ran on to the pitch in the first half of the match.\nSince the incident, Stevenage have installed a dedicated 'pitch invasion team' for home games.", "url": "https://www.bbc.com/sport/football/66374540"}