{"authors": ["Geoff Doyle", "www.facebook.com"], "date_download": "2025-05-21 05:51:58", "date_modify": "2025-05-21 05:51:58", "date_publish": "2025-04-02 09:20:26", "description": "BBC Three Counties sports editor Geoff Doyle cites young defender Christ Makosso as one of the reasons for Luton Town's resurgence.", "filename": "sport_football_articles_cvg7wl0e8dxo_1747806718.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/edae/live/7e6e9e70-0fa3-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg7wl0e8dxo_1747806718.html", "title": "Luton Town expert view: Christ Makosso among reasons for resurgence", "title_page": "Luton Town expert view: Christ Makosso among reasons for resurgence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This weekend's match between Luton and Leeds is set to be a humdinger of an occasion.\nIt's second from bottom versus second from top. Contrasting positions and contrasting form of an unusual kind.\nThe Hatters' win at Hull and Leeds' late heartbreak at home to Swansea has added to the mouth-watering encounter.\nLuton have gained confidence from three wins in five, while Leeds are having a wobble at precisely the wrong time with just one win in five.\nNerves are going to be heightened - which team handles the pressure best is likely to be the victor.\nThe Hatters appear to have their mojo back. It's taken Matt Bloomfield longer than he would've liked but it seems the team have turned a corner and their belief, which was rock bottom three months ago, has been restored and that fighting spirit and togetherness is back.\nIt's not down to just one player. Bloomfield has organised the team into a structure and shape which is much tighter, conceding fewer goals as a result.\nBut one player deserves special praise. Young defender Christ Makosso made his full debut a month ago with the team in desperate trouble. Since then, Luton's points per game percentage rate has risen from 27% to 67%. The Hatters have kept three clean sheets in five.", "url": "https://www.bbc.com/sport/football/articles/cvg7wl0e8dxo"}