{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:32", "date_modify": "2025-05-20 14:14:32", "date_publish": "2023-07-29 18:49:47", "description": "Sheffield Wednesday 1-2 Luton Town: Tom Lockyer plays 90 minutes in friendly win", "filename": "sport_articles_cndk9krdkjpo_1747750472.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77c8/live/7a6b48a0-2e40-11ee-aaee-09040f2e711a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cndk9krdkjpo_1747750472.html", "title": "Sheffield Wednesday 1-2 Luton Town: Tom Lockyer plays 90 minutes in friendly win", "title_page": "Sheffield Wednesday 1-2 Luton Town: Tom Lockyer plays 90 minutes in friendly win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town defender Tom Lockyer hopes he can now \"push forward\" after playing his first 90 minutes since collapsing in the play-off final in Saturday's 2-1 friendly win at Sheffield Wenesday.\nPelly Ruddock Mpanzu and Carlton Morris got the goals for Rob Edwards' side at Hillsborough, as they fought back from being 1-0 down.\nLockyer said his pre-season has been \"tough\" but was pleased to be able to last the full match.\nHe told Luton's official website: \"The main thing is to be as fit as possible going into that first game [against Brighton on 12 August].\n\"We don't want to look too far ahead. You can get carried away with the season that's coming up, but we have to focus on getting our principles right on the pitch, doing everything we can in training for that first game.\n\"You want to win these pre-season friendlies, but I think there's deeper meanings for us at the minute - shape, how we want to play, how we want to move the ball, getting to know new players who have come in and them getting used to our style of play.\n\"You've got to see pre-season for what it is, but I'm delighted to get 90 minutes under my belt.\n\"It's been a different pre-season but hopefully now, with 90 in the tank, I can push forward.\"", "url": "https://www.bbc.com/sport/articles/cndk9krdkjpo"}