{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:59:06", "date_modify": "2025-05-20 13:59:06", "date_publish": "2023-07-31 09:12:50", "description": "Exeter City manager Gary Caldwell hails the return of midfielder Kyle Taylor after 16 months out with a serious knee injury.", "filename": "sport_football_66358650_1747749546.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D0AB/production/_130591435_kyletaylorreturnstoactionrex2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66358650_1747749546.html", "title": "Kyle Taylor: Exeter City midfielder returns to action after 16 months out with knee injury", "title_page": "Kyle Taylor: Exeter City midfielder returns to action after 16 months out with knee injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter City manager Gary Caldwell has hailed the return of midfielder Kyle Taylor after 16 months out injured.\nHe suffered what then-Exeter boss Matt Taylor described as \"the worst injury a footballer can get\" when he ruptured knee ligaments and damaged his bone and cartilage at Oldham in March 2022.\nHe returned in Exeter's 2-1 pre-season loss to Coventry City on Saturday.\n\"It's amazing. He's somebody that went through a really difficult time with his injury,\" Caldwell told BBC Devon.\n\"He's worked extremely hard to get in the position he's in, he had another setback in pre-season with an innocuous ankle injury, so to get him minutes was special.\n\"Every time I see him he shows the quality that he has and he's somebody that could be a really big player for us this season.\"\nThe 24-year-old former Bournemouth player will feel like a new signing for Caldwell, who has never been able to call upon him since taking over from Matt Taylor last October.\nIt comes as the City boss aims to bolster his squad ahead of the opening game of the season at Wycombe Wanderers on Saturday, having already brought in eight players either on permanent deals or on loan.\n\"I'm hopeful of maybe one or two early to middle of the week,\" Caldwell said.\n\"But I've said all along that we'll keep working right throughout until the end of the window to bring the best players that we can to add to the group and create competition among the players that we've already got.\"\nOn the possibility of anyone leaving the club before the end of the summer transfer window Caldwell said: \"We will lose someone if they want to leave and they don't want to be part of what we're doing.\n\"But we're in no position to need to sell anyone, we feel like we've got a good group here and the important thing to that is to add to that and add competition.\"", "url": "https://www.bbc.com/sport/football/66358650"}