{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:24:15", "date_modify": "2025-05-21 04:24:15", "date_publish": "2025-01-23 16:02:19", "description": "Zoe Aldcroft says England must embrace the darkness of defeat by the Black Ferns to clinch a home World Cup final victory in 2025.", "filename": "sport_rugby-union_articles_cx2p4gw84wko_1747801455.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3a1/live/db9b8f80-d99e-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cx2p4gw84wko_1747801455.html", "title": "Rugby World Cup 2025: Zoe Aldcroft & England quest for redemption", "title_page": "Rugby World Cup 2025: Zoe Aldcroft & England quest for redemption - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zoe Aldcroft remembers warming up at Eden Park.\nIn the stands were more than 40,000 New Zealand fans, at the other end of the pitch were the five-time world champion Black Ferns, but in Aldcroft's mind there was not a shred of doubt.\n\"I didn't think there was a chance we were going to lose,\" she tells Rugby Union Weekly as she looks back on the Rugby World Cup final of November 2022.\n\"I felt super confident. I had been super nervous before the semi, but going into the final all my nerves disappeared.\"\nIt was a justified confidence. The Red Roses had won their previous 30 Tests, beating New Zealand by record margins en route. They were, by any measure, the best team in the world. But, critically, they weren't the best team on that Auckland evening.\nOn 19 minutes, England wing Lydia Thompson was sent off. On 29 minutes, Aldcroft was forced off with concussion. With the clock in the red, England had a line-out on the Kiwi line and a chance to grab a decisive score. But the ball spilled forward and England fell the wrong side of a 34-31 scoreline.\n\"It was just heartbreaking for everyone involved,\" Aldcroft says. \"We hadn't written that story, it just wasn't how it was supposed to end, it was super, super difficult.\"\nAldcroft, 28, returned home to England and, for the first time since she started playing alongside her brother at Scarborough Rugby Club as an eight-year-old, didn't like rugby.\n\"Personally I felt really embarrassed about it, because there had been so much talk about how good we were, how we had won all these matches in a row, and we couldn't win the ultimate game,\" she says.\n\"I didn't want to see anyone for two weeks and I was really dreading getting back into rugby. I remember the day I had to go back into training at Gloucester-Hartpury and thinking, 'I don't want to do this'.\"\nBut she did. Her club team-mates picked her up. Together they lifted the Premiership Women's Rugby (PWR) trophy at the end of that season. In June, they defended their title.\nAnd, at the start of this month, Aldcroft was named the captain who will lead the Red Roses in their search for redemption, as the Rugby World Cup begins in England in August.\nAldcroft believes England will only emerge triumphant in the final - to be played at Twickenham's Allianz Stadium on 27 September - if they embrace the polar opposite of the emotions they felt on the other side of the world three years earlier.\n\"We need the reflections from that final so that if the adversity does come again [we can deal with it]. We have no idea what will be thrown at us on that day - how can we best manage it and put us in a place where we are unstoppable?\" she says.\nIt would complete an arc that encompasses all that Aldcroft loves about the game.\n\"I love going to those dark places, especially with my team-mates,\" she says.\n\"I just love the feeling of doing everything you can and putting your body on the line and the fact that everyone has done that for each other. That really drives me as a person.\"\nIt is the impulse that England hope will drive them to the very summit of the world game this year.", "url": "https://www.bbc.com/sport/rugby-union/articles/cx2p4gw84wko"}