{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:45:42", "date_modify": "2025-05-21 03:45:42", "date_publish": "2025-04-06 14:56:28", "description": "Aberdeen fan views: 'Solid display that should provide much-needed confidence'", "filename": "sport_articles_ckg10m43833o_1747799142.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df77/live/da775d50-12e2-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg10m43833o_1747799142.html", "title": "'Solid display that should provide much-needed confidence'", "title_page": "Aberdeen fan views: 'Solid display that should provide much-needed confidence' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Aberdeen's 1-0 win against Ross County.\nHere's what some of you said:\nChris: The game overall was robust and scrappy because of the County set-up to give them the best chance of disrupting our play. Great goal from Shayden Morris for sure and Graeme Shinnie moving to left back with finally a stable midfield paying dividends. Pape Gueye has lost his mojo and is inconsistent at best. Kevin Nisbet is playing well like the player he is, but the table is tight and we need to keep winning to make it to Europe.\nAlan: Good three points but not a good performance, too many long balls, should be playing through our good players Leighton Clarkson and Ante Palaversa. Dante Polvara needs to play, the improvement in Morris is a bonus as he is now adding the final ball to his undoubted pace, if only Pape could do the same. The fight for third places continues.\nJohn: Mats Knoester has been the main reason behind the team's upturn in results in recent weeks. Brings a calmness and organisation to our defence which gives the likes of Clarkson and Palaversa a platform to perform in midfield. Shinnie at left-back has been an added bonus!\nAndrew: Disappointing performance after last week, and we had enough chances in the first half to have County dead and buried by half time, but nevertheless a good three points.\nFred: A good match but feel we should have scored more, however Morris was excellent, his speed is such an asset to the team. Great to see us keeping a clean sheet but our forwards need to perform better.", "url": "https://www.bbc.com/sport/articles/ckg10m43833o"}