{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:40", "date_modify": "2025-05-21 07:28:40", "date_publish": "2024-12-23 17:35:17", "description": "Lincoln City centre-back Lewis Montsma signs a new contract to keep him at the club until 2027 after recovering from a serious knee injury.", "filename": "sport_football_articles_c4g24gdz47xo_1747812520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e05/live/b0930980-c152-11ef-b6e4-c5ae54f969ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g24gdz47xo_1747812520.html", "title": "Lewis Montsma: Lincoln City defender agrees new deal until 2027", "title_page": "Lewis Montsma: Lincoln City defender agrees new deal until 2027 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lincoln City centre-back Lewis Montsma has signed a new contract to keep him at the club until the summer of 2027.\nThe Dutchman has made 13 appearances this season after recovering from a second ACL knee injury.\nMontsma has played 96 games in total since making his Imps debut in 2020 and has scored 11 goals.\n\"It has been a long road but the club have shown a lot of trust in me and, with some real hard work, it has worked out,\" he said.\n\"Easing me back into it with one game a week was right for me and I feel I am getting back to my best. I feel fitter and better after every game, and just want to keep this run going.\"\nLincoln are sixth in League One ahead of the festive and New Year programme and are away to Shrewsbury Town on Boxing Day.\nDirector of football Jez George said the new deal was testament to Montsma's \"incredible hard work, resilience, determination and character\".\nHe added: \"We will still need to control Lewis's minutes this season. It is testament to the culture of our club that we refuse to put Lewis's career at risk for a single result despite the recent unavailability of other centre-backs.\"", "url": "https://www.bbc.com/sport/football/articles/c4g24gdz47xo"}