{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-04-26 03:55:25", "date_modify": "2025-04-26 03:55:25", "date_publish": "2025-03-04 16:09:45", "description": "Romanov v Bednar - lights out", "filename": "sport_articles_cqjdq7kpnzvo_1745639725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/672f/live/fceb84d0-f909-11ef-bc87-ad84b3fde561.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cqjdq7kpnzvo_1745639725.html", "title": "Romanov v Bednar - lights out", "title_page": "Romanov v Bednar - lights out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the most enduring images of Vladimir Romanov's time at Hearts is a grainy video, captured on a pre-smartphone mobile by one of the squad on a pre-season tour of Austria in 2007.\nAfter the previous season petered out into a damp squib, Romanov still fancied himself as a motivational coach and he was there on the tour of Austria, determined to rouse the players for upcoming challenges.\n\"Vlad was chatting away to us about the season ahead, and just sort of like some sort of inspirational speech,\" Michael Stewart tells Romanov: Czar of Hearts.\n\"And he was talking about how growing up, he was small, he was a boxer, he was a fighter. You could tell folks were switching off.\"\nBut one person who wasn't switching off was Roman Bednar.\n\"At that point, I was young and cheeky all the time, and I said, 'You must be joking, you did boxing?'\" the former Czech forward recalls.\nWith Stewart adding that this certainly got the attention of the squad: \"And you could just see Vlad was sort of like taking it in as if, 'Did he just say that?' Aye, he did!\"\nVlad didn't take kindly to the comments. Later, as the rest of the squad looked on, he ambushed Bednar in a car park with the appropriate equipment in hand.\n\"He holds up this set of boxing gloves, and he's like, 'Yeah, me and you, right, put them on, we're going to have this boxing fight,'\" recalls Stewart who had a front-row seat to it all.\n\"Vlad's going, no, no, no, let's box.\"\nFor the rest of the team looking on, this would be a popcorn moment to remember.\nSaulius Mikoliunas recalls Vlad going for a knockout blow: \"Then Mr Romanov, he went for attack and he made some movements and he punched into the face with was some big sound.\"\nBednar, Vlad's sparring partner, assures listeners: \"He didn't hurt me at all but yeah, he hit me well.\"\nMaybe there are other examples of a 5ft 7in club chairman landing a punch on a 6ft 4in striker, but we haven't been able to find any.", "url": "https://www.bbc.co.uk/sport/articles/cqjdq7kpnzvo"}