{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:10:41", "date_modify": "2025-04-26 04:10:41", "date_publish": "2025-03-02 17:29:54", "description": "Monaghan sit top of Division Two thanks to a 1-27 to 1-21 victory over Louth in Drogheda on Sunday.", "filename": "sport_articles_c70wnqv0gl7o_1745640641.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3c90/live/e94c5e00-f782-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c70wnqv0gl7o_1745640641.html", "title": "Monaghan withstand Louth fightback to clinch victory", "title_page": "Football League: Monaghan withstand Louth fightback to clinch victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Monaghan sit top of Division Two thanks to a 1-27 to 1-21 victory over Louth in Drogheda on Sunday.\nThe Ulster side were firmly on course for the win with Conor McCarthy netting as they led by 17 points just before the break.\nHowever, Louth fought back and Sam Mulroy slotted home a penalty to help his side move within three points.\nMonaghan responded with late points as the visitors came away with a six-point success.\nMonaghan surged into a 10-point advantage after just 12 minutes with Andrew Woods and Stephen O'Hanlon each firing over four apiece in a one-sided first half.\nMcCarthy shot low into the net to increase the lead and at half-time Monaghan boasted a 1-19 to 0-07 lead.\nIt was all change on the restart as Louth launched a comeback which saw them threaten an unlikely victory.\nLouth went on a run of 1-9 without reply with Mulroy accounting for 1-7 of the total.\nNow just three points ahead with two minutes left and Monaghan were in danger of letting slip a huge lead but they rallied to see out the remaining time to secure another two league points.\nRoscommon and Meath are also on eight points but Monaghan lead the way on scoring difference.", "url": "https://www.bbc.co.uk/sport/articles/c70wnqv0gl7o"}