{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:38:11", "date_modify": "2025-05-21 03:38:11", "date_publish": "2025-02-06 07:28:01", "description": "Michael van Gerwen criticises world champion Luke Littler for his poor time keeping after the 18-year-old arrived 45 minutes late for a media day in Belfast.", "filename": "sport_darts_articles_c07k07pvnx1o_1747798691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fc26/live/3279e1a0-e45b-11ef-b1c1-db98e78afd8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_c07k07pvnx1o_1747798691.html", "title": "Luke Littler: 'He's not a baby any more'", "title_page": "Luke Littler: 'He's not a baby any more' - Michael van Gerwen on world champion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael van Gerwen has criticised world champion Luke Littler for his poor timekeeping after the 18-year-old arrived 45 minutes late for a media day in Belfast.\nLittler, who became the youngest world champion when he defeated the Dutchman last month, is one of eight players competing in the Premier League which starts in Northern Ireland on Thursday.\nThe teenager from Warrington said he had overslept after taking a morning nap, which did not impress his colleagues.\n\"They need to stop treating him like a baby. He's not a baby any more, he's 18 years old now,\" Van Gerwen said.\n\"It happens. He has to learn. You have to learn the hard way. It's a professional sport so you have to be responsible for your actions. Simple as that.\n\"If he turns up late for an interview, I don't mind. But seven other people are waiting for him. That's not very nice, is it?\"\nThe comments were laughed off by Littler, who is looking forward to renewing his rivalry with the three-time world champion Van Gerwen.\n\"He's going to be up for it, he's going to be hungry but I'm up for it as the reigning champion. Whoever wins, it will be big for us,\" Littler said.\n\"This is the biggest tournament I am going to defend all year around until the Worlds. I might feel nervous when it does come to the task, but there is always nerves, but I'm hoping to make a fast start like I did in the final.\n\"The first win last year came here in Belfast, so I have got good memories here and I want to kick on.\"\nAfter their meeting in the World Championship final, the pair met again in the quarter-finals of the Dutch Masters two weeks ago with Littler again coming out on top.\nThey are set to renew their rivalry again at the oche in Belfast on Thursday as they will face each other in their opening quarter-final of this season's Premier League.\nYou can follow live text commentary on the BBC Sport website from 19:00 GMT on Thursday", "url": "https://www.bbc.com/sport/darts/articles/c07k07pvnx1o"}