{"authors": ["David Mohan", "www.facebook.com"], "date_download": "2025-05-21 04:01:56", "date_modify": "2025-05-21 04:01:56", "date_publish": "2025-02-09 15:41:49", "description": "Antrim's away woes continue as they are resoundingly beaten 2-26 to 0-17 by Offaly in the Allianz Hurling League Division 1B game at Tullamore.", "filename": "sport_articles_ckgx4vdj8w8o_1747800116.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/92fc/live/92027580-e6f7-11ef-a39a-7b0f4e03d69d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgx4vdj8w8o_1747800116.html", "title": "Offaly 2-25 Antrim 0-17: Faithful hammer Saffrons in Hurling League Division 1B", "title_page": "Offaly 2-25 Antrim 0-17: Faithful hammer Saffrons in Hurling League Division 1B - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Antrim's away woes continued at O'Connor Park in Tullamore as they were resoundingly beaten 2-26 to 0-17 by an impressive Offaly in the Allianz Hurling League Division 1B contest.\nA scoring burst leading into the break gave the hosts daylight, and they kicked on in the second period as Antrim never seriously threatened a comeback.\nBut for some smart saves by Ryan Elliott, the scoreboard could have looked a lot worse for the Saffrons\nBrian Duignan led the way for the Faithful with a dozen points, while Dan Ravenhill and Killian Sampson rattled the net in each half.\nIt was an even opening, but Offaly sounded a couple of early warnings, with keeper Elliott forced into smart stops from Charlie Mitchell and Duignan.\nThe home side had the wind advantage and gradually began to assert themselves with Duignan, Sampson and Ravenhill carrying much of the threat.\nAntrim remained in touch with braces from James McNaughton and Seaan Elliott, leaving them just two adrift heading into the final five minutes of the opening period.\nHowever, the hosts hit 1-5 without reply in a storming finish to the opening period with the goal coming on 31 minutes as Ravenhill got onto a long delivery from Sampson and this time gave Elliott no chance to help his side into a 1-14 to 0-7 advantage.\nAntrim briefly threatened early in the second period but Paul Boyle was denied by Mark Troy at the expense of a 65 that was converted by McNaughton. However, it was a false dawn as Offaly just put their foot on the gas to leave the visitors in their wake.\nOisin Kelly ensured all six starting forwards were on the board as substitute Sam Bourke also got in on the act, while their second goal came with 10 to play as Sampson buried after wriggling out of a challenge.\nMcNaughton and Keelan Molloy added late points for Antrim but they were well beaten on the day as Offaly maintained their impressive form.\nDavy Fitzgerald now has the job of raising the morale of his players for the home contest with his previous side Waterford in two weeks.", "url": "https://www.bbc.com/sport/articles/ckgx4vdj8w8o"}