{"authors": ["Ben Ramsdale", "www.facebook.com"], "date_download": "2025-04-26 07:53:06", "date_modify": "2025-04-26 07:53:06", "date_publish": "2025-02-25 14:25:34", "description": "Nottingham Forest boss Nuno Espirito Santo has been speaking to the media before Wednesday's Premier League game against Arsenal (kick-off 19:30 GMT).", "filename": "sport_football_articles_c5y2622zpw0o_1745653986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y2622zpw0o_1745653986.html", "title": "Nuno Espirito Santo press conference: Forest vs Arsenal preview", "title_page": "Nuno Espirito Santo press conference: Forest vs Arsenal preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nuno confirmed that there are a few players carrying knocks that will need to be assessed before Wednesday evening's match but didn't disclose who.\nHe said three defeats in the last four Premier League games is simply \"the reality of the game\" and all part of the club's journey.\nOn the recent good form at home and whether they can take confidence from that going into the Arsenal game: \"I hope so. We hope that the City Ground helps us because we need all the help that we can get against such a tough opponent. We hope the City Ground can give us the energy and atmosphere.\"\nWhen asked about finishing above Arsenal, Nuno said that the team's ambition is to simply \"be better than in previous games.\"\nHe dismissed a question on whether Forest are in the title race, stating: \"We chase the next game, that is all that is on our minds. We want to chase everything that we want to achieve.\"\nFinally, on what he has learned about the side in adversity: \"We react better than before. We didn't react to a tough time at Bournemouth but we reacted well against Newcastle. We were able to revert the momentum of the game. That was positive but not enough.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c5y2622zpw0o"}