{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:14:45", "date_modify": "2025-05-20 14:14:45", "date_publish": "2023-07-30 00:00:00", "description": "England beat Scotland in their final Pool B match at the Netball World Cup in Cape Town - follow live text and radio commentary.", "filename": "sport_live_netball_65930744_1747750485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2A7E/production/_130587801_gettyimages-1563082754.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_netball_65930744_1747750485.html", "title": "Netball World Cup 2023 LIVE: England beat Scotland", "title_page": "Netball World Cup 2023 LIVE: England beat Scotland - score, commentary & updates in Pool B game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nWell, that's all from us today. England will be pleased to have got over the line but still have plenty to work on as the tournament starts to hot up.\nYou can keep up to date with all the latest netball news here and follow the latest score from that enticing match between Jamaica and South Africa here.\nWe'll be back on Monday for England's next task on this World Cup journey.\nSee you then!\nWhat's next for the home nations?\nNext up, England and Scotland progress to Pool F, where they will meet Australia, Fiji and either Tonga or Zimbabwe.\nScotland will take on Australia first thing on Monday morning while England will face them in their last Pool F match on Thursday.\nNext for England it's the winner of that match between Tonga and Zimbabwe, which is up next in Cape Town, South Africa.\nWales are in Pool G with New Zealand, Jamaica and South Africa.\n'Focus on what's next'\nFT: England 62-37 Scotland\nEngland wing attack and player of the match Chelsea Pitman speaking on Sky Sports:\n\"I've been working on trying to control the pace and be a solid team member. I can't do my job without the girls so getting the win and winning each quarter is a success for us.\n\"We've got a good connection in mid-court, myself with Jade [Clarke] especially playing at club level. We've been pretty seamless with the changes so we've got to keep doing that and focus on what's next.\n\"We've got to have a bit of confidence, keep inside our bubble, focus on what's next and take every game as it comes. We want to have a successful campaign but it's about breaking it down and being present and reflecting on what we've got now.\n\"Any support is amazing, we've been blessed about how many supporters have come over so we want to hear them loud and proud.\"\n'Taking positives'\nFT: England 62-37 Scotland\nScotland captain Claire Maxwell speaking on Sky Sports:\n\"We weren't focussing on the scoreboard today but we were about learning and what we can take into next games. We're pleased with what we did out there - at times they out-muscled us and a times we broke down their defence.\n\"We won some turnover which is pleasing against a top quality side. Other than that it's about taking positives into the next round.\"\n'We had to dig deep'\nFT: England 62-37 Scotland\nEngland defender and co-captain Layla Guscoth speaking on Sky Sports after the win:\n\"They've all been so different [matches], that's what's great about a World Cup but also hard, you face many different styles.\n\"We knew Scotland would be a hard contest and they were, we had to dig deep and pull out a performance.\n\"Every game we have managed to get all 12 players on court and seen so many different combinations of people playing in different positions and that can only hold is in good stead going into the next week when we face even more different styles and nations. We need that versatility to see us through to the end.\"\nOn injury to Imogen Allison: \"She seems to be doing fine, I think it was just a precautionary bringing her off. Two more games in the next two days and then more after that so we need everyone fit and well.\n\"Good that we managed to win all four quarters, they were four difficult quarters and we want to take that momentum of being able to weather the storm on court.\"\nPost\nFT: England 62-37 Scotland\nBoth teams get in a huddle and give each other three cheers - a netball tradition that some of you reading this may find slightly odd but there we go, it's part of the game.\nClaire Maxwell leads her Scotland team in the cheers first and wishes England all the best for the rest of the tournament, adding she hopes they can go all the way.\nWhat do we think? Can they?", "url": "https://www.bbc.com/sport/live/netball/65930744"}