{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:03", "date_modify": "2025-05-20 13:47:03", "date_publish": "2023-07-31 14:45:11", "description": "Kerry's All-Ireland final defeat by Dublin is proof that the Kingdom are \"over-reliant\" on David Clifford, says Philly McMahon.", "filename": "sport_gaelic-games_66359351_1747748823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7F56/production/_130589523_gettyimages-1565637147.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_gaelic-games_66359351_1747748823.html", "title": "David Clifford: Dublin defeat evidence of Kerry's over-reliance on captain, says Philly McMahon", "title_page": "David Clifford: Dublin defeat evidence of Kerry's over-reliance on captain, says Philly McMahon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kerry's All-Ireland final defeat by Dublin was further evidence that the Kingdom are \"over-reliant\" on David Clifford, says Philly McMahon.\nClifford, the 2022 footballer of the year, kicked three points but also four wides, including an injury-time miss that effectively sealed Kerry's fate.\nSpeaking on the The GAA Social Extra podcast, Dublin legend McMahon said his county's aggressive approach to marking Clifford prevented the Kerry talisman from getting the space he had enjoyed in the semi-final win over Derry.\n\"Everybody knows the player that he is, it's been preached so much,\" said McMahon, an eight-time All-Ireland winner with Dublin.\n\"I think the crucial thing for Clifford was that the narrative was everyone saying that Kerry are over-reliant and today showed that. It really did.\"\nMcMahon went on to say it looked like Clifford was \"daydreaming\" during the national anthem prior to throw-in, but felt the key factor to the Fossa club-man's disappointing afternoon was the aggression Dublin showed while marking him, led by Michael Fitzsimons.\n\"The second part that really caught my attention was how aggressive Dublin were in doubling up all the time,\" added McMahon, who was on co-commentary duty for the BBC at Croke Park on Sunday.\n\"When Chrissy McKaigue was on that left-hand side [for Derry in the semi-final], Kerry were playing down into the Hill and that favourite side Clifford gets the ball kicked into, there wasn't the pressure that the Dubs were putting him under today.\n\"That has a huge impact on him because all he really did in that first half was give a brilliant ball into [Paul] Geaney for the goal and kicked a score.\n\"You were thinking 'here we go' but he got on the ball, there were two or three players around him. He couldn't get any space. That was massive in the second half.\n\"I'm telling you at certain stages he would have been thinking 'I have to grab this game by the scruff of the neck here because if I don't, we're going to lose. I'm the person that's going to do this'.\n\"So he was taking shots in a different state of mind. It's nearly like not in flow, nearly in fear. 'I have to be the one to take Kerry over the line here'. The execution was an issue obviously in some of the shots but I would've seen pressure in those shots.\"\nWhen asked by Oisin McConville if McCarthy, Cluxton and Fitzsimons would be happy enough with nine, McMahon said: \"Right now the hurt will be with Kerry.\n\"Cluxton played most of the minutes in this championship, McCarthy is possibly tipped for player of the year, Fitzsimons keeps one of the best players in the country quiet, albeit with support but he was sticky tight.\n\"So why would you not go on to the following season and try to win a 10th?\n\"I want to take it back to one man. He probably wasn't 100% correct when he said it but Dave Hickey, the Dublin legend, stepped inside the changing room one day and said this group is good enough to win 10 All-Irelands.\n\"Now it may not be the same group but three of those lads could possibly win 10 All-Irelands and I have no doubt they will go for that next year.\"", "url": "https://www.bbc.com/sport/gaelic-games/66359351"}