{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:45:30", "date_modify": "2025-05-20 12:45:30", "date_publish": "2023-07-25 21:45:18", "description": "Fulham sign Mexico striker Raul Jimenez from fellow Premier League side Wolves for a fee of about £5m.", "filename": "sport_football_66308712_1747745130.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CCF7/production/_130517425_gettyimages-1474902545.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66308712_1747745130.html", "title": "Raul Jimenez: Fulham sign Wolves and Mexico striker for £5m", "title_page": "Raul Jimenez: Fulham sign Wolves and Mexico striker for £5m - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fulham have signed Mexico striker Raul Jimenez from fellow Premier League side Wolves for a fee of about £5m.\nThe 32-year-old has signed a two-year deal with Fulham, with the club having the option for a third year.\nJimenez scored 57 goals in 166 games during his five seasons at Molineux following a club record £30m move from Benfica.\nThe Cottagers moved for Jimenez with the future of their star striker Aleksandar Mitrovic in doubt.\nThe Serbia international is pushing for a move to Saudi Pro League side Al-Hilal after Fulham rejected a £25m bid.\nJimenez said: \"It's really important for me to arrive here. I will try to do my best for the team, one of the most iconic teams in the Premier League.\n\"I'm happy to be here and to play in this stadium, it's a really good stadium, I like it here. I'm going to give my best to keep scoring goals in the Premier League.\"\nThe Mexican never rediscovered his goalscoring touch after a nine-month spell out that resulted from a fractured skull suffered in a horrific clash with Arsenal defender David Luiz in 2020.\nBefore then, he had scored 34 goals in 86 Premier League games for Wolves, but after then only netted six in 49 games.\nHis only three goals last season were in the Carabao Cup.\nJimenez becomes Fulham's first summer signing after finishing 10th last season under Marco Silva.", "url": "https://www.bbc.com/sport/football/66308712"}