{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:27:24", "date_modify": "2025-05-21 04:27:24", "date_publish": "2025-01-23 15:45:46", "description": "Sale Sharks winger Arron Reed signs a new deal to remain with the Premiership club for a further three years.", "filename": "sport_rugby-union_articles_c5y6gdd2484o_1747801644.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79ca/live/cc64fa30-d99c-11ef-941c-57ca5bda0a5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5y6gdd2484o_1747801644.html", "title": "Arron Reed: Sale Sharks and Scotland winger signs three-year contract extension", "title_page": "Arron Reed: Sale Sharks and Scotland winger signs three-year contract extension - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sale Sharks winger Arron Reed has signed a new deal to remain with the Premiership club for a further three years.\nThe 25-year-old Scotland international came through the club's academy from the age of 15 and has made 120 appearances, scoring 36 tries.\nHaving initially been called up to Scotland's Six Nations squad in 2024 he eventually made his international debut against Canada last summer.\n\"I grew up in the North West and I watched Sale as a kid and every time I put on that shirt it means so much to me. It was an easy decision to stay,\" Reed said.\n\"Every day I go into training and I just love it. I'm playing and training with mates who I went to school with and it's really hard to describe just how good that is. I don't think many players have that opportunity.\"\nReed has made eight appearances for Sale this season and scored five tries for the club during that period.\nHe also recently received a call up to the Scotland squad for the upcoming Six Nations tournament.\n\"Success is never linear with any player and everyone has challenges and obstacles,\" director of rugby Alex Sanderson said.\n\"Reedy has had his fair share, but he is continually improving and learning his craft and he has so much potential that's still unrealised. Great things take time, and he is a really great thing.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c5y6gdd2484o"}