{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:10", "date_modify": "2025-05-21 05:33:10", "date_publish": "2025-04-02 16:45:41", "description": "Leeds United report a loss of £60.8m during the 2023-24 season, an increase from £33.7m lost the season before.", "filename": "sport_football_articles_cpdzvz2z1n2o_1747805590.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/40c1/live/39a97000-0fdd-11f0-8db5-3f4abea6b85e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpdzvz2z1n2o_1747805590.html", "title": "Leeds United: Financial report shows £60m loss for 2023-24 season", "title_page": "Leeds United: Financial report shows £60m loss for 2023-24 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United have reported a loss of £60.8m during the 2023-24 season.\nThe amount is an increase on 2022-23, when the Whites posted a loss of £33.7m as they were relegated from the Premier League.\nThe club's revenue has dipped 33% to £128m, with both broadcast and commercial appeal taking a hit after relegation to the Championship.\nDespite dropping down a tier, matchday income did increase from £29m to £30.5m, while wage spending dropped by 42%.\nFootball finance expert Kieran Maguire said that while the loss may seem worrying for a club receiving parachute payments, it was not entirely gloomy.\n\"Leeds made more money from ticket sales last season in the Championship than they did in the two previous seasons in the Premier League,\" Maguire told BBC Radio Leeds.\n\"It's partly a function of a few more matches but it also reflects that Leeds fans will turn out at Elland Road regardless of the opposition, regardless of the division.\n\"Also if you take a look at commercial income, it's by far the highest in the Championship and it's higher than perhaps two thirds of the clubs in the Premier League as well.\"\nMaguire expects that Leeds will make further reductions to their £84m wage bill next year and says that, despite debts accrued from buying players, fans should not be overly concerned.\n\"When Leeds United were recruiting players in the Premier League, it was very much done on credit. As a consequence, Leeds United owe over £140m to other clubs,\" he said.\n\"If Leeds get promoted, of course fans will be looking forward to it, but if you owe a lot of money on your credit card, that has to be paid down to a certain extent first before you can go on another spending spree.\n\"But it's not horrendous by Premier League standards. You've got clubs like Spurs and Chelsea who owe over £400m in transfer fees.\"\nHowever, Maguire does expect that Leeds will be within the boundaries of the Profitability and Sustainability Rules (PSR) and should not be in danger of a points deduction.\nIn part, this is due to a player sales increase after a £40m club record sale for Georginio Rutter to Brighton and a further £30m for Archie Gray's move to Tottenham Hotspur.\n\"Overall, the numbers look scary but I think there are more positives than negatives,\" Maguire added.\n\"If the club goes up, then they've got the riches of the Premier League. If the club doesn't go up, which nobody at Leeds United wants, then they have acclimatised to life in the Championship.\"", "url": "https://www.bbc.com/sport/football/articles/cpdzvz2z1n2o"}