{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:36", "date_modify": "2025-05-21 06:31:36", "date_publish": "2025-03-31 18:43:26", "description": "Gerwyn Price wins the ninth Players Championship of 2025 with an 8-4 victory over Ian White in the final, as Luke Littler goes out in the third round.", "filename": "sport_darts_articles_c8eplw0yxgdo_1747809096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c96d/live/1ebccaa0-0e5a-11f0-9fff-a7291b2e82a7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_c8eplw0yxgdo_1747809096.html", "title": "Players Championship 9: Gerwyn Price wins second title of 2025 against Ian White as Luke Littler suffers early exit", "title_page": "Players Championship 9: Gerwyn Price wins second title of 2025 against Ian White as Luke Littler suffers early exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gerwyn Price won the ninth Players Championship of 2025 with an 8-4 victory over Ian White in the final, as Luke Littler went out in the third round.\nPrice produced a superb 140 checkout in the fourth leg - the highest of the match - to take a 3-1 lead and kept his composure in the remainder of the contest at the Leicester Arena.\nWelshman Price averaged 94.67 to White's 96.99 and had fewer 180s - three to six - but his checkout success of 34.8% versus 28.6% proved crucial.\nIt was Price's second Players Championship tournament win of the season following last month's success in Wigan.\n\"I didn't feel too good at the beginning of today - was a little bit up and down in games - but that will give a me boost for the Premier League next week,\" Price told the PDC.\n\"I was a little bit inconsistent but I battled on. In the past I probably throw those games away. There were some ragged points but I'm glad to get a win.\"\nWhite, ranked 52nd in the PDC order of merit, had reached his first professional tour final in five years having knocked out world champion Littler in the last 32.\nThe 54-year-old, nicknamed 'Diamond', had given Littler a scare in the fourth round of the World Championships earlier this year.\nBefore that match White revealed he used to beat 18-year-old Littler's grandfather on the pub darts circuit in Runcorn in the 1990s.\nIn his second meeting with the Warrington teenager, White triumphed 6-5 after a thrilling deciding leg.\nLittler failed to land a 102 checkout to give White a chance and he nailed 46, finishing with double top, to progress at the expense of his fellow Englishman.\nWhite went on to score wins over Josh Rock and Cameron Menzies in the quarters and semis before he came unstuck against Price.\nGary Anderson, meanwhile, compiled a nine-dart finish in his first-round match against Krzysztof Ratajski, before he lost in the last 32.", "url": "https://www.bbc.com/sport/darts/articles/c8eplw0yxgdo"}