{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:49:39", "date_modify": "2025-05-20 11:49:39", "date_publish": "2023-08-07 09:23:51", "description": "Boss Luke Williams wants Notts County to move on from last term after a \"pathetic\" 5-1 loss at Sutton marks their EFL return.", "filename": "sport_football_66427809_1747741779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15033/production/_130676068_gettyimages-1564734489.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66427809_1747741779.html", "title": "Luke Williams: Notts County must not dwell on promotion after losing EFL return", "title_page": "Luke Williams: Notts County must not dwell on promotion after losing EFL return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Luke Williams says Notts County must move on from last season's achievements after a \"pathetic\" 5-1 thumping at Sutton United on their return to the English Football League.\nThe Magpies came up via the National League play-offs, having run champions Wrexham close the whole season.\nSaturday's game was their first in the EFL after four years away.\n\"It was an incredible journey to get here. But that journey has ended,\" Williams told BBC Radio Nottingham.\n\"We need to close the door on that.\"\nNotts were well beaten at Gander Green Lane, conceding inside the first three minutes and also having goalkeeper Aidan Stone sent off on a chastening afternoon.\n\"We were pathetic. I am genuinely delighted that it wasn't double figures,\" Williams said.\n\"We froze and played with zero conviction. We hesitated on everything. We were timid and weak so we got everything we deserved.\n\"I love this group of players; they are fantastic. They are allowed to have a really bad day but they now have to show it was a really bad day. They have to show it was not their level, it's the fact that they were overwhelmed.\"\nThe team were backed by 1,200 travelling Notts supporters, who despite the manner of the loss were praised by Williams for the atmosphere they created.\n\"If they played, we would have won,\" he added. \"Did you hear how they competed? I need to put them on the pitch.\n\"I owe them [the players] so much and I am so proud of them. But it's also my job to push them. Today they buckled and folded under the pressure and the fans didn't deserve to see that. I am sorry for them.\"", "url": "https://www.bbc.com/sport/football/66427809"}