{"authors": ["Alex Pewter", "www.facebook.com"], "date_download": "2025-04-26 07:55:59", "date_modify": "2025-04-26 07:55:59", "date_publish": "2025-02-25 12:25:21", "description": "Crystal Palace news: Opinion - What isn't clicking at Selhurst Park?", "filename": "sport_football_articles_c93n8714vgdo_1745654159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6b0/live/3752ed40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c93n8714vgdo_1745654159.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - What isn't clicking at Selhurst Park? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "There is an old cliche about 2-0 leads and the dangers of complacency that come with them. Clearly Oliver Glasner and his team are not aware of this.\nThe 2-0 victory on Saturday against Fulham was the fourth successive away win by that margin in the Premier League.\nThis team's efficiency when not playing at Selhurst Park has been stellar. Over the past eight away games, Palace topped the league in points gained - six wins, two draws, and zero defeats - while only conceding three times.\nGlasner's issue is that, despite the club-record-breaking nature of this away run, the home form - at least in terms of results - is not living up to that lofty standard. The past eight fixtures at home have yielded only one victory against the worst team in the division and six points in total.\nSo, what is not clicking for the team at Selhurst Park?\nIs it simply that the team is aptly suited to playing more of a counter-attacking style, where the opposition is more likely to play with a higher line? Or is this all a statistical anomaly that is likely to even out?\nFor fans of expected goals (xG) as a rough guide, the attacking numbers are reasonably even home or away over this eight-game sample.\nIn attack, Palace averaged 1.52 xG at home and 1.59 xG away per game. The team has been more wasteful at Selhurst, underperforming their xG total by 3.12, according to Opta.\nHowever, the difference defensively is stark from home to away. Thanks partly to Arsenal's 5-1 win in December, the team is -5.41 xG versus goals conceded.\nThey are vastly overperforming on the road, +6.37 against the chances conceded. The team has also been very good at preventing those chances from getting on target, and Dean Henderson has 'prevented' 2.86 goals for those that have.\nIt is a riddle for Glasner and co to solve, perhaps. Yet, it would seem that the bad luck at home should eventually swing around – something the larger section of the fanbase in attendance for those games will be desperate for.", "url": "https://www.bbc.co.uk/sport/football/articles/c93n8714vgdo"}