{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:22", "date_modify": "2025-05-21 04:09:22", "date_publish": "2024-12-29 00:00:00", "description": "Follow live text commentary, score updates and match stats from Blackburn Rovers v Hull City in the Championship", "filename": "sport_football_live_clyvzp849y5t_1747800562.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_clyvzp849y5t_1747800562.html", "title": "Blackburn Rovers v Hull City: Championship stats & head-to-head", "title_page": "Blackburn Rovers v Hull City: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ryan Longman scored his first Hull City goal for over two years to secure the Tigers' first away win in nine games with a 1-0 victory at Blackburn.\nThe winger went on as a substitute and hit Rovers with a sucker punch after the outstanding Alfie Jones had led a staunch defensive display in the second half at Ewood Park.\nLongman spent last season on loan at Millwall and has largely been on the fringes of the team after returning to east Yorkshire.\nHe calmly finished from Regan Slater's fine pass with 13 minutes of normal time remaining to inflict play-off hopefuls Rovers' second defeat in the last nine games.\nThe win takes Hull one point clear of the relegation zone in 21st, while Rovers stay fifth.\nHull had not won on their travels since their victory at QPR on 1 October, with new boss Ruben Selles seeing his side lose both away games since he took charge at the start of the month.\nSelles had watched from the stands three weeks ago as Rovers, pushing hard for a play-off place, had won at the MKM Stadium the day after his appointment - part of a dreadful run of 15 games that had yielded just one win until victory in Lancashire.\nThere were no early signs of an upset as Rovers pushed for the opening goal, but the ubiquitous Jones seemed to get in the way of everything the home side could conjure.\nHe blocked Makhtar Gueye's near-post back-flick early in the game and then cleared off the line as the lively Brighton loanee Amario Cozier-Duberry carved in from the right wing and shot past Hull goalkeeper Ivor Pandur.\nHull rarely threatened in the first half but Blackburn had their own keeper Aynsley Pears to thank for a goalless half-time scoreline as Slater picked up his loose pass and, after his first shot was blocked, saw the keeper stretch out a leg to block his follow-up attempt.\nRovers piled on the pressure after the break but found Jones - ably supported by defensive partner Sean McLoughlin, whose unfortunate own-goal settled the reverse fixture - unbeatable.\nSenegalese striker Gueye looked sure to score from Lewis Baker's header back across goal only for both centre-backs to hurl themselves at the ball to block.\nJones was there again to whip the ball of the foot of Todd Cantwell as it fell to the Rovers midfielder in the box, and Cantwell fired another chance wide before teeing up Owen Beck for another opportunity, which the Liverpool loanee lifted over the bar.\nOn a rare foray forward, Hull struck.\nSlater picked out Longman at the far post and, with Pears racing off his line to narrow the angle, he calmly tucked his shot past the keeper.\nThe goal sparked a late furry from the Tigers, with Longman scuffing a great chance to seal it and Gustavo Puerta striking a post but the last word fittingly went to Jones, producing another brilliant, and important, block to deny Andi Weimann an equaliser in added time.\nBlackburn head coach John Eustace told BBC Radio Lancashire:\n\"It's a really disappointing result. It was a difficult game and we created a couple of really good chances, but needed to be more clinical.\n\"It was never going to be pretty and then we needed to defend the box better in the second half. The lads kept going, and the attitude was good, so we move on to the next one.\n\"The effort the boys put in a few days ago [2-2 draw v Sunderland] was excellent, so it was a big ask, but it was the same for both teams.\n\"It's important we don't get too disappointed. The boys have been magnificent this year and we go into the new year in the top six, which is really exciting.\"\nHull City head coach Ruben Selles told BBC Radio Humberside:\n\"We had some good moments but the most important thing was that we were competitive and took our chances. In our box we protected with everything we have and in the other box scored with the situation we had.\n\"Everyone is fighting really hard to get results for the club. We have a good platform and hopefully it's the beginning of a good run away from home.\n\"Ryan [Longman] was very upset after the last game because he didn't have a very good game and wanted to make a point going on to the pitch.\n\"It was not only the goal, he was all over the place running, pressing, getting people one-on-one, commanding the team, running back - that's the kind of mentality we need.\"", "url": "https://www.bbc.com/sport/football/live/clyvzp849y5t"}