{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:39", "date_modify": "2025-05-20 12:04:39", "date_publish": "2023-08-05 11:56:29", "description": "Dillian Whyte returns \"an adverse finding\" from a doping test, causing his heavyweight rematch against Anthony Joshua to be cancelled.", "filename": "sport_boxing_66416584_1747742679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1666C/production/_130665719_gettyimages-1530813940.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66416584_1747742679.html", "title": "Dillian Whyte out of Anthony Joshua fight after adverse test", "title_page": "Dillian Whyte out of Anthony Joshua fight after adverse test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dillian Whyte has returned \"an adverse finding\" from a doping test, causing his heavyweight rematch against Anthony Joshua on 12 August to be cancelled.\nThe Voluntary Anti-Doping Association (Vada) informed promoters Matchroom and boxing authorities of the test result.\n\"In light of this news, the fight will be cancelled and a full investigation will be conducted,\" said a Matchroom statement.\nA \"devastated\" Whyte, 35, says he is \"completely innocent\".\nJoshua, 33, could still fight at London's O2 Arena if a new opponent can be found.\n\"I am shocked and devastated to learn of a report by Vada of adverse findings relating to me,\" Whyte wrote in a statement released on X, formerly known as Twitter.\n\"I only learned of it this morning and am still reacting to it.\n\"I have also just seen that the fight is being cancelled without having any chance to demonstrate my innocence before the decision was taken.\n\"I can confirm without a shadow of doubt that I have not taken the reported substance, in this camp or at any point in my life.\n\"I am completely innocent and ask to be given the time to go through the process of proving this without anybody jumping to conclusions or a trial by media.\"\nThe fight between Joshua and Whyte, a rematch of their 2015 bout, was announced a month ago.\nJoshua knocked out Whyte in the seventh round of their heated British title fight eight years ago, which also took place at the O2, as he avenged a loss to his rival on the amateur circuit.\nWhyte, who lost his only world title challenge to Tyson Fury in 2022, beat Joshua by decision as an amateur in 2009 to start what became a bitter rivalry.\nOlympic gold medallist Joshua went on to become a two-time world champion.\nJoshua gained revenge when the pair met again as professionals in December 2015, being rocked in the second round but recovering to force a stoppage in the seventh.\nWhyte had a doping violation charge dropped in 2019 after UK Anti-Doping said the levels of a banned steroid were \"very low\" and he was not at fault.\nHe served a two-year suspension from 2012 to 2014 for taking an illegal supplement.\nA tribunal accepted Whyte's claim he did not knowingly take methylhexaneamine (MHA) but said he did not do enough to check the supplement's ingredients.", "url": "https://www.bbc.com/sport/boxing/66416584"}