{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-04-26 08:01:17", "date_modify": "2025-04-26 08:01:17", "date_publish": "2025-02-26 17:43:13", "description": "McLaren's Lando Norris tops the time sheets from Mercedes' George Russell on day one of pre-season testing in Bahrain.", "filename": "sport_formula1_articles_c9wp5zg7dw5o_1745654477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c75f/live/022905f0-f462-11ef-bc71-6ff62e3f49fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_c9wp5zg7dw5o_1745654477.html", "title": "F1 2025 pre-season testing: Lando Norris quickest for McLaren on day one", "title_page": "F1 2025 pre-season testing: Lando Norris quickest for McLaren on day one - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "McLaren's Lando Norris topped the fastest lap times from Mercedes' George Russell on the first day of Formula 1 pre-season testing.\nNorris was 0.157 seconds quicker than Russell at Bahrain's Sakhir circuit, with Red Bull's Max Verstappen third and Ferrari's Charles Leclerc fourth.\nThe six fastest drivers set their best times in the session that ran from the afternoon into the evening.\nLeclerc's new team-mate Lewis Hamilton ran in the morning session and ended the day 13th fastest.\nHeadline lap times in pre-season testing are notoriously unreliable indicators of actual competitiveness, as there are so many factors affecting performance that teams do not reveal, such as fuel loads and engine power modes.\nThe session was held in unusually cool conditions in the Gulf state, with air temperatures about 15C.\nRussell said he was encouraged by the performance of the Mercedes, after three seasons when the team knew from testing that they were facing a tough time in the months ahead.\nRussell said: \"The car is performing well. We've got to be careful because in Bahrain it's usually 20C hotter.\n\"This is the best it has ever felt around Bahrain but I'm sure it's the same for all testees.\n\"I am enjoying it. I had confidence, the long-run pace looked all right.\n\"We are not going to get carried away with ourselves, but so far so good. We've had some tests here where it did not go well, but so far it is silky smooth.\"\nNorris' team-mate Oscar Piastri, who drove in the morning session and was 16th on the time sheets, said: \"The car is feeling pretty good, just trying to get [it] into a bit of a better window.\n\"I think we're in OK shape. A few teams looking pretty good early on. [It's] early doors but we're pretty happy.\n\"We're doing a good job of focusing on ourselves and getting some good information. It's already looking very close so I think we're in for a very exciting year in F1.\"\nLast year, McLaren won the constructors' championship for the first time since 1998, while Norris finished second to Verstappen in the drivers' title chase.\nNorris and McLaren have set themselves the target of starting the season in competitive shape and mounting a season-long title challenge, after Verstappen's early dominance saw him establish an insurmountable lead in 2024.\nHamilton and Verstappen did not speak to the media on Wednesday.\nVerstappen's new team-mate Liam Lawson was the only driver to fully lose control of his car - the New Zealander had a spin at Turn Two in the morning session.\nA power outage in the middle of the afternoon session led to an hour's delay, and the end of running was extended by an hour to compensate.", "url": "https://www.bbc.co.uk/sport/formula1/articles/c9wp5zg7dw5o"}