{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:07:21", "date_modify": "2025-05-20 14:07:21", "date_publish": "2023-07-30 15:25:01", "description": "A ball is yet to be kicked in the new Scottish Premiership season, but already there is a serious cloud of doubt forming above St Johnstone.", "filename": "sport_football_66353383_1747750041.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1440E/production/_130585928_-9ea858ce-91e5-4b19-b26c-398948f2bcfa.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66353383_1747750041.html", "title": "Can Steven MacLean's St Johnstone recover from humiliating Viaplay Cup exit?", "title_page": "Can Steven MacLean's St Johnstone recover from humiliating Viaplay Cup exit? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A ball is yet to be kicked in the new Scottish Premiership season, but already there is a serious cloud of doubt forming above one of the league's teams.\nSaturday's embarrassing 4-0 drubbing at home to third-tier Stirling Albion concluded an abject Viaplay Cup group campaign for St Johnstone, mounting pressure on rookie boss Steven MacLean.\nJust two months after signing a three-year deal as permanent manager, questions are being asked about the former Saints striker and his side who now face a seismic start to the season.\nCan MacLean turn it around? BBC Scotland has a look...\n\"Simply not good enough\" is how Andy Considine evaluated his side's start to the season after Saturday's humiliation.\nAfter picking up just three points from a group containing four lower-league clubs - Ayr United, Stirling Albion, Stenhousemuir and Alloa Athletic - nobody can disagree with the Saints defender.\nFewer than three years ago the Perth side lifted the League Cup. They followed that up with the Scottish Cup three months later to secure a historic double. A top-six place was also achieved in an unforgettable season.\nBut the following two campaigns have been ones that will be far easier to erase from memory. The club needed a relegation play-off win to secure their top-flight survival in 2021-22. With the side struggling again last season in another dogfight, Callum Davidson was sacked in April.\nIn came interim manager MacLean to arrest the decline. He got a response from the players as three wins and two draws from the final six games ensured a ninth-placed finish, which was enough to to hand a permanent three-year contract to the former Saints striker.\nBut, even without a league game played, the start of this season has given little encouragement to an increasingly concerned fanbase.\n\"It seems like a club in decline,\" former Motherwell and Partick Thistle centre-back Stephen Craigan said on BBC Sportsound.\n\"There will be so much doubt in MacLean's mind about what's going on and how he's approaching things. He's not getting a response from his players. They're clearly light in numbers and they're lacking quality and confidence.\n\"MacLean's a very inexperienced manager. Sometimes when you have that, you need that older figurehead around you. I imagine he'll want to speak to older people he's worked with in the game as a sounding board to get his points across.\n\"If he doesn't get off to a good start in the league campaign, a heavy defeat here or there, the St Johnstone board will have a big decision to make even this early in the season.\"\nArthur: The best thing we can do is get rid of MacLean. He is clueless, they should have sacked him at the same time as Davidson.\nMiguel: Abject performances and tactics. We all knew in May that we needed players, but obviously the management team didn't. Out-of-depth inexperienced manager, looks like it. Relegation looming, possibly. Chance of new players signing, who knows. It's an embarrassment. Hearts will be rubbing their hands, possibly looking to put nine past us.\nAlastair: I am sorry to say that Steve Brown's total lack of interest and Davidson's very poor management has set the club well and truly on the path back to where they were when Geoff Brown stepped in to save them.\nStuart: We wasted too much money in the last two seasons buying deadwood that now leaves us short. How many strikers did we buy that either never played or never scored? It is too early to panic, but the board need to back the manager completely or we are doomed to repeat the mistakes of the past.", "url": "https://www.bbc.com/sport/football/66353383"}