{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-05-21 06:28:13", "date_modify": "2025-05-21 06:28:13", "date_publish": "2025-01-22 18:24:15", "description": "Manager Philippe Clement will not \"park the bus\" at Old Trafford as he urges Rangers to \"write history\" with a first win against Manchester United.", "filename": "sport_football_articles_cpwx71vkyzvo_1747808893.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3ba7/live/3f1cb830-d8e2-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwx71vkyzvo_1747808893.html", "title": "Clement urges Rangers to 'write history' against Man United", "title_page": "Clement urges Rangers to 'write history' against Man United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Philippe Clement will not \"park the bus\" at Old Trafford as he urges Rangers to \"write history\" with a first win against Manchester United.\nBoth sides are well placed to progress in the Europa League, with the hosts on 12 points from six matches and Rangers one point behind in eighth place.\nThe teams met on Champions League duty in 2003 and 2010, with United winning three of those group games and the other ending 0-0 when Walter Smith's side frustrated Sir Alex Ferguson with a masterclass of defensive football.\nClement is not minded to deploy the same tactics against a side that has lost four of their past five home matches in the Premier League, where they occupy 13th place.\n\"I'm not somebody who believes in parking a bus in front of goal and hoping that nothing happens, hoping to come one time on the other side to score a goal,\" said Clement.\n\"So we'll play to our qualities. Of course, we also need to consider the qualities of Manchester United.\n\"It's a really, really big challenge. The spotlight is on the players and it's a massive opportunity.\n\"I know my team and my squad will embrace those moments. You dream of being in stadiums like this.\"", "url": "https://www.bbc.com/sport/football/articles/cpwx71vkyzvo"}