{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:21", "date_modify": "2025-05-21 07:09:21", "date_publish": "2025-03-30 12:07:02", "description": "'A familiar tale to anyone with even a passing interest in Dundee's season'", "filename": "sport_articles_c30q36mpv17o_1747811361.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2576/live/6a01c340-0d5f-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c30q36mpv17o_1747811361.html", "title": "'A familiar tale to anyone with even a passing interest in Dundee's season'", "title_page": "'A familiar tale to anyone with even a passing interest in Dundee's season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dundee fans, we asked for your views on the painful 4-3 defeat to Rangers at Dens Park. Here's a taste of what you had to say...\nEddie: Same old story. Dreadful defending again and the bottom line is our entire defence are simply not good enough. Our management team should have addressed this months ago, but did nothing. A play off spot is all we can now hope for.\nGary: I wish the manager would take some accountability for his lack of game management. At the end of the first half, and for most of the second, Rangers were on top but still Docherty did nothing from the bench. All the hard work of the first half hour faded.\nAndrew: A familiar tale to anyone with even a passing interest in Dundee's season. No matter the opposition, and no matter how favourable the situation in terms of the scoreline, we can always find a way to end the game with zero points.\nWhile we have demonstrated that we can put three goals past any team in the league, we have also provided ample evidence that on their day any team coming to Dens Park can score five if they're in the mood.\nStefan: So disappointing to see Dundee throwing much-needed points away again to the Old Firm at home. Tony Docherty needs to start coming up with some better defensive tactics and stop saying \"we need to learn from this\" etc. It's getting a bit late in the season for learning, Doc!\nRoss: Same old, same old since Docherty came in. Far too often over the last two seasons we have had a two-goal lead in a match, and ended up losing.\nIs it a psychological thing, is it naivety or is it poor tactics? Probably a bit of all three. I really fear for us this year. If we are in the same position - only four ahead of St Johnstone-at the split, we are down. At least the neutral certainly gets value for money when play.", "url": "https://www.bbc.com/sport/articles/c30q36mpv17o"}