{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-20 14:48:26", "date_modify": "2025-05-20 14:48:26", "date_publish": "2023-07-28 07:07:10", "description": "As Terence Crawford and Errol Spence Jr finally meet in the ring, here is the story of how the undisputed welterweight fight came together.", "filename": "sport_boxing_66333458_1747752506.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58ED/production/_130556722_gettyimages-1448262447.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66333458_1747752506.html", "title": "Terence Crawford v Errol Spence Jr: Las Vegas meeting for long-time rivals who seized control of fight talks", "title_page": "Terence Crawford v Errol Spence Jr: Las Vegas meeting for long-time rivals who seized control of fight talks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Terence Crawford is sitting relaxed in his hotel room at the MGM Grand Hotel in the heart of Las Vegas.\nIt might be the Tuesday before the biggest fight of his career against fellow welterweight champion Errol Spence Jr, but Crawford is calm.\nJazz tunes are playing in his hotel room, specially selected by him. His team say he may change to country music or reggae as the fight draws closer.\nWearing shorts and white shocks, his answers are considered, but brief. Usually a fighter during fight week is drained from all the promotion and dieting and can range from angsty to combative, depending on the personality.\nCrawford, 35, is no such thing. He doesn't want to be drawn into trash talking his opponent or giving too much away about his tactics.\nHe may give the impression he is at ease, but underneath the surface is a man brimming with ambition. He has 39 fights to his name and 39 wins.\nBeating Spence on Saturday night would be the biggest win of his career and could crown him as the pound-for-pound world's best fighter.\nCrawford likes 33-year-old Spence, but his steely resolve is clear. So often his brilliant spitefulness shines in the ring, but every now and then it also creeps out of him outside it. It came out in the news conference when he clashed with one of Spence's team members who wouldn't stop heckling him.\nAnd it comes out when he speaks about beating Spence.\n\"There is mutual respect. I don't hate the kid. I don't have any bad things to say about him, but I'm going to kick his ass,\" he says.\nGrowing up in Omaha, Nebraska, Crawford always wanted to be a boxer.\n\"My dream was always to be a world champion and I secured that in 2014 when I fought Ricky Burns,\" he says.\n\"Growing up in Omaha was just like any other neighbourhood that's in the ghetto.\n\"It was fun, getting in trouble. You got fights. You find friends that you know and you all go on little journeys and be kids.\n\"Growing in Nebraska was great for me because it taught me a lot, showed me a lot and developed the man you see today.\"\nOne such moment of trouble occurred 15 years ago when Crawford was shot in the face following a game of dice with friends just weeks after his fourth pro fight. He drove himself to the hospital. He recovered, welcoming his first child a few months later.\n\"Family orientated\" is how he describes himself, and it was his family and his close relationship with God that proved his turning point, not fighting.\nBut fighting appears to be what he does best. He has won 17 consecutive world title fights across three weight divisions.\nHis weight cutting experts describe him as the \"gold standard\" for their athletes. No one is more vigilant or dedicated than Crawford.\nBeating Spence would make him just the second fighter after Claressa Shields to win undisputed titles in two weight classes.\nFor the last five years, Crawford has rarely done an interview that hasn't featured at least one question about Spence.\nCrawford first noticed Spence fighting in the amateurs, when he was representing the United States at the Olympics.\n\"Real recognises real, you see the talent when you see it,\" Crawford says.\nTheir rivalry has been drawn out, played out entirely outside the ring rather than in it. Not long ago, Crawford says he had given up on it happening.\nBut just a few months ago, after years of failed talks, Crawford and Spence decided to hash out terms between themselves.\n\"Simple as a phone call and as talking things through,\" Crawford says.\nCrawford's decision to leave promotional outfit Top Rank last year, a move he says had nothing to do with wanting to fight Spence, still appears pivotal to the fight happening.\nIn a sport full of endless intermediaries, Spence says he and Crawford took control.\n\"There was a lot of stuff [coming] from different people,\" Spence adds.\n\"We're putting our lives on the line. This event is because of me and him and not anybody else.\n\"We decided to talk to each other on the phone to reach a mutual agreement then have our people get involved. Basically ironed it out and that's what we did.\"\nAll the headline issues were discussed - money being the most pertinent. A middle ground was reached and Spence returned to his team with the terms. One such agreement was a coin toss would decide who walked second, a honour usually reserved for the defending champion.\nA few weeks later, the fighters themselves announced the bout on their social media before any official press release.\nFast forward to fight week and tensions have finally begun to rise. Crawford has cast himself as the elder, while Spence bristles when his rival refers to him as \"kid\".\nNeither fighter is numb to the impact this fight could have. Every fight fan remembers Floyd Mayweather versus Manny Pacquiao or Evander Holyfield versus Mike Tyson. People still talk about Marvin Hagler versus Thomas Hearns and Muhammad Ali versus Joe Frazier.\n\"It definitely can leave a legacy,\" Spence says of his fight with Crawford.\n\"The magnitude of it, this is what boxers live for. These types of fights.\n\"Of course, you've got boxers that crumble - these big fights and the bright lights - but this is what I live for.\"", "url": "https://www.bbc.com/sport/boxing/66333458"}