{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:21:55", "date_modify": "2025-05-20 13:21:55", "date_publish": "2023-07-25 09:41:44", "description": "'I always had a vision of returning' Shinnie", "filename": "sport_articles_cd1eydvlzklo_1747747315.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3796/live/6e808f60-2acf-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cd1eydvlzklo_1747747315.html", "title": "'I always had a vision of returning' Shinnie", "title_page": "'I always had a vision of returning' Shinnie  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's like he's never been gone, Dons, eh?\nGraeme Shinnie can't hide away his joy at being back at Aberdeen on a permanent basis as he looks ahead to an \"exciting\" season back in the north east.\nFor all the success the 31-year-old was a part of during his four years previously, he had unfinished business on the European stage. With at least Conference League football secured until Christmas, the captain is \"massively\" looking forward to what the continent has to offer.\n\"The last time I was here it was always a big ambition of ours to get through to the group stages,\" he told Sky Sports, external. \"It was very tough back then, playing so many ties to actually get in, so to have guaranteed Conference League group stage football is exciting.\n“It’s an exciting challenge for the club and it’ll be a different test for the squad but it’s one we’re looking forward to.”\nShinnie, who spent the second-half of last season on loan at Pittodrie said that short spell was the perfect taster to ignite his desire to return and he was \"desperate\" to do so.\n\"It was really tough when I moved away, I was very settled and very happy at the club that I love,\" the former Scotland international added.\n\"I always had a vision about coming back, I just didn't really know when it would be and maybe I didn't see it happening quite as quickly as it has, but it was a place I missed very much.\"", "url": "https://www.bbc.com/sport/articles/cd1eydvlzklo"}