{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:20:53", "date_modify": "2025-05-19 15:20:53", "date_publish": "2017-07-04 09:16:52", "description": "Birmingham City's failure to sign John Terry could work in the club's favour, says manager Harry Redknapp.", "filename": "sport_football_40492496_1747668053.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17551/production/_96796559_redknapp.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40492496_1747668053.html", "title": "Harry Redknapp: Birmingham boss wants 'strong all-round team' after missing John Terry signing", "title_page": "Harry Redknapp: Birmingham boss wants 'strong all-round team' after missing John Terry signing - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Birmingham City's failure to sign John Terry could work in the club's favour, says manager Harry Redknapp.\nThe defender, 36, turned down Blues to join local rivals Aston Villa, but Redknapp plans to use the savings on making several additions to his squad.\nLazio's Ravel Morrison, who is training with the club,, external could be among them.\n\"I'm hoping the players I'm going to bring in, with the budget I had for John, will make us a stronger all-round team,\" he told BBC WM.\nFormer Blues loanee Morrison, 24, has not figured in the Serie A side since April 2016 and played under Redknapp at QPR.\nRedknapp said he was looking to make \"five or six\" more signings, after drafting in goalkeeper David Stockdale from Brighton and centre-back Marc Roberts from Barnsley, in a bid to turn Birmingham into promotion contenders after they narrowly avoided relegation last season.\nHowever, the 70-year-old insisted the club would spend within their means in the transfer market.\n\"We're not going to be splashing out £15m on players,\" he said.\n\"We took the Championship goalkeeper of the year on a free transfer, so that's a good start, and then we took Marc Roberts, who I think is an outstanding young centre-half with a big future.\n\"So that's two parts of the jigsaw, and there's another five or six to fill still. When we get them in, I'll be happy with that team.\"", "url": "https://www.bbc.com/sport/football/40492496"}