{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:21:17", "date_modify": "2025-05-21 04:21:17", "date_publish": "2025-02-09 12:26:56", "description": "Great Britain, driven by Dylan Fletcher, win the latest leg of the SailGP season in Sydney, Australia, to extend their lead in the overall standings.", "filename": "sport_sailing_articles_cvgpmyp6q05o_1747801277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbac/live/289f9cb0-e6db-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_sailing_articles_cvgpmyp6q05o_1747801277.html", "title": "SailGP: Great Britain extend overall lead with win in Australia", "title_page": "SailGP: Great Britain extend overall lead with win in Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain's SailGP team extended their lead in the overall standings with a thrilling first win of the season in Australia.\nDriver Dylan Fletcher led the British team to podium finishes in the opening two events, finishing second in November's season-opener in Dubai and third last time out in Auckland, New Zealand in the 14-regatta event.\nGB claimed four top-three finishes in the seven qualifying races to reach the final in Sydney Harbour, alongside hosts Australia and Canada, led by former British driver Giles Scott.\nAnd they found the better breeze in the closing stages to overhaul Canada and win by six seconds, while Tom Slingsby's Australian team had to settle for third after being penalised for encroachment at the start.\n\"We need to keep working hard and delivering, but this is a great result for the team and I'm really proud of how everyone performed,\" said Fletcher, 36, who won gold in the men's 49er class at the Tokyo Olympics.\nBen Ainslie, CEO of the British team, added: \"It's only Dylan's third event with the team and he's done brilliantly. He's world-class and that's why we wanted to get him in this game.\"\nIt was a first victory for the British team since June - when they won in Canada in the 2024 campaign with Scott as driver - and moved them to 27 points overall, three clear of second-placed Australia and seven ahead of reigning champions Spain in third.\nRacing now moves to the United States for back-to-back legs in Los Angeles (15-16 March) and San Francisco (22-23 March).", "url": "https://www.bbc.com/sport/sailing/articles/cvgpmyp6q05o"}