{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:45:04", "date_modify": "2025-05-21 07:45:04", "date_publish": "2024-12-23 11:18:01", "description": "Connacht will play at Mayo GAA's McHale Park for the first time in the professional era when they take on derby rivals Munster in March.", "filename": "sport_articles_cx2ndm70y8mo_1747813504.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ade8/live/4d3424d0-c11d-11ef-b76e-9de78285d5f5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx2ndm70y8mo_1747813504.html", "title": "United Rugby Championship: Connacht-Munster game to be played at home of Mayo GAA", "title_page": "United Rugby Championship: Connacht-Munster game to be played at home of Mayo GAA - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Connacht will play at Mayo GAA's McHale Park for the first time in the professional era when they take on derby rivals Munster in March.\nThe historic occasion in Castlebar will see the teams compete in an interprovincial United Rugby Championship encounter on Saturday, 29 March.\n\"All the players were absolutely delighted when told the news - the opportunity to play in front of a massive home crowd, in the heart of the province, is something to really look forward to,\" said Connacht club captain Cian Prendergast.\n\"Our supporters are amongst the best there are, and we know the passion that the people of Mayo, and Connacht more widely, show every time they support their teams, whatever the code or colour of the jersey.\"\nConnacht head coach Pete Wilkins is also looking forward to seeing his team play at McHale Park.\n\"We're all incredibly excited by today's news - we are proud to represent the whole province of Connacht, and we look forward to sharing this great occasion with our existing supporters and getting out to meet many more new supporters from all across the province.\"", "url": "https://www.bbc.com/sport/articles/cx2ndm70y8mo"}