{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 05:45:31", "date_modify": "2025-05-21 05:45:31", "date_publish": "2025-04-02 13:53:04", "description": "La Liga says Barcelona do not have the financial capacity to register Dani Olmo and Pau Victor.", "filename": "sport_football_articles_ce8gdyzyljlo_1747806331.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/110a/live/848a17c0-0fc2-11f0-9f8d-f125b11f3e53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8gdyzyljlo_1747806331.html", "title": "Barcelona lack financial capacity to register Dani Olmo and Pau Victor, says La Liga", "title_page": "Barcelona lack financial capacity to register Dani Olmo and Pau Victor, says La Liga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona do not have the financial capacity to register forwards Dani Olmo and Pau Victor, La Liga has said.\nThe Catalans were granted temporary licenses by La Liga to register Olmo and Victor last summer.\nBut their registrations were then revoked in January by La Liga, who said Barcelona had failed to prove they were compliant with the league's financial rules by their deadline of 31 December.\nSpain's sports council (CSD) gave Barcelona permission to temporarily reinstate Olmo and Victor following an appeal, with a definitive ruling on the pair's registrations expected by 7 April.\nBarcelona - top of La Liga and in the Champions League quarter-finals - announced a deal on 3 January to sell VIP boxes at the club's Nou Camp stadium, which is being rebuilt, in order to raise 100m euros (£83m).\nBut La Liga says the deal was not recorded in the accounts submitted by Barcelona to the league last week for the 2024-25 season, and that the deal had been approved by a different, unnamed auditor.\n\"No amount from the [VIP box deal] is ultimately recorded in the profit and loss accounts, contrary to what had been certified by the club and the auditor at the time of said transaction,\" said La Liga in a statement.\nLa Liga said they were reporting the auditor to the Accounting and Auditing Institute.\n\"Barcelona did not have on December 31, 2024, or on January 3, 2025, nor has it had since that date, nor does it currently have, [the financial fair play capacity] for the registration of the players Dani Olmo and Pau Victor,\" La Liga said.\nIn response, Barcelona president Joan Laporta told reporters the league's letter was \"an attempt to damage the club's image and go against FC Barcelona's interests\".\nHe said the club's legal team would respond to the letter \"as forcefully as necessary\" and questioned the timing of it, with his side facing Atletico Madrid in the second leg of their Copa del Rey semi-final later on Wednesday (20:30 BST).\n\"Three months ago I said that Olmo and Pau Victor's registrations had been carried out correctly, following each and every one of the requirements demanded by the RFEF [Spanish Football Federation] and La Liga, and this is still the case.\"\nOlmo, 26, joined Barcelona from RB Leipzig in a £52m deal last summer.\nHe has made 28 appearances this season, including 13 since the CSD's ruling.\nVictor, 23, a product of Barcelona's academy, has played 22 times this season and five times since the ruling.", "url": "https://www.bbc.com/sport/football/articles/ce8gdyzyljlo"}