{"authors": ["www.facebook.com"], "date_download": "2025-05-21 04:03:45", "date_modify": "2025-05-21 04:03:45", "date_publish": "2025-01-09 00:00:00", "description": "Jude Bellingham's second-half strike helps Real Madrid beat Mallorca in Jeddah to set up a meeting with Barcelona in Sunday's Spanish Super Cup final.", "filename": "sport_football_live_c5y7n7llk5gt_1747800225.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y7n7llk5gt_1747800225.html", "title": "Real Madrid 3-0 Mallorca: Jude Bellingham scores to help Real reach Super Cup final", "title_page": "Real Madrid 3-0 Mallorca: Jude Bellingham scores to help Real reach Super Cup final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jude Bellingham's second-half strike helped Real Madrid beat Mallorca in Jeddah to set up a meeting with Barcelona in Sunday's Spanish Super Cup final.\nThe England midfielder broke the deadlock in the 63rd minute of the semi-final by poking home after Rodrygo's header hit the post and Kylian Mbappe's follow-up was saved.\nLast year's winners added further goals in stoppage time when Martin Valjent turned Brahim Diaz's through ball into his own net and Rodrygo swept in Lucas Vazquez's shot from close range.\nBellingham's goal was his seventh for Real in his past nine games and his ninth of the season.\nSunday's Clasico, a repeat of last year's final which Real won 4-1, kicks off at 19:00 GMT.\nBarcelona, who were 4-0 winners when the sides met in La Liga in October, earned their place in the final by beating Athletic Club 2-0 on Wednesday.\nDani Olmo missed that match amid Barcelona's troubles with registering the winger, but he could feature in the final after provisional permission was given by the Spanish national sports council.\nBarcelona have won the Super Cup a record 14 times, with Real just one title behind them.", "url": "https://www.bbc.com/sport/football/live/c5y7n7llk5gt"}