{"authors": ["Sophie Hurcom at Kingsholm", "www.facebook.com"], "date_download": "2025-05-21 06:52:25", "date_modify": "2025-05-21 06:52:25", "date_publish": "2025-03-29 19:23:29", "description": "Gloucester score nine tries in a show-stopping display as they beat Bristol 53-28 to move back up to third in the Premiership table.", "filename": "sport_rugby-union_articles_czjex9g30xlo_1747810345.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d50/live/2a97e7c0-0cce-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_czjex9g30xlo_1747810345.html", "title": "Premiership: Gloucester 53-28 Bristol: Cherry and Whites score nine tries", "title_page": "Premiership: Gloucester 53-28 Bristol: Cherry and Whites score nine tries  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gloucester scored nine tries in a show-stopping display as they beat neighbours Bristol 53-28 to move back up to third in the Premiership table.\nChristian Wade and Seb Atkinson both scored hat-tricks for the Cherry and Whites as they completed a double over the Bears for the first time since the 2016-17 campaign.\nThe first half alone saw nine tries scored and 55 points shared, as Gloucester raced to an unopposed try-scoring bonus point in 17 minutes.\nThe home side scored another three unanswered tries after the break before James Williams managed a fourth for Bristol to ensure they left the sold-out Kingsholm with at least a point of their own.\nIf high-scoring entertainment is what the Premiership wants this season, fans were treated to another rip-roaring spectacle as Gloucester produced one of their most blistering displays in attack to delight the home crowd.\nThe debate about whether that quest to glitter in attack is coming at a detriment to defence will continue but the hosts were eye-catching almost every time they ran with the ball.\nA week ago at Ashton Gate, Bristol achieved the second-fastest bonus-point score in Premiership history in just 16 minutes when they beat Exeter, and Gloucester seemingly started their own stopwatch and almost bettered it, with four rapid opening tries of their own helped by some poor Bears defending and errors.\nA Bristol penalty deep in Gloucester's 22 immediately gave the hosts an opening, and Carreras chipped the ball through to a racing Wade to dab down in the corner on three minutes.\nFour minutes later they had a second as Harry Bryne's ball went loose and Santiago Carreras pounced, scooping it up before cleverly sending a one-handed pass around the back to feed Josh Hathaway.\nChris Harris added their third, as another Bristol penalty gifted Gloucester a kick to touch for a line-out. Charlie Atkinson broke easily through a tackle and with Harris inside he scored next to the posts.\nNothing was going Bristol's way as Byrne's kick to restart into the swirling wind went straight out and from a Cherry and Whites scrum on halfway, the ball was passed out wide to Hathaway who raced downfield.\nHis long ball back inside was expertly picked out of the air one-handed by a jumping Tomos Williams, whose no-look pass then found Seb Atkinson to run under the posts for the crucial fourth score to make it 24-0.\nBristol director of rugby Pat Lam said during the week that he thought the match-up between two of the most potent sides in the league could be \"one of the best\" and at times both defences could barely keep up.\nBristol got themselves on the board as Benhard Janse Van Rensburg bouldered through and Harry Randall picked the ball quickly, to find Fitz Harding to dive under the posts.\nRich Lane then came within a whisker of the line before Williams scored Bristol's second to close the gap to 24-14.\nYet Gloucester were soon back at the other end as Hathaway darted between two tacklers and found Seb Atkinson in space to slide over.\nThe tries continued to trade back and forth as Max Lahiff powered over for Bristol's third from close range.\nBut Gloucester were not done and with the clock in red on 42 minutes they created space for Wade to dive over for a sixth in the corner.\nGloucester's intensity did not relent as the second half began and Wales scrum-half Williams caught Bristol's line unawares, throwing a long ball from a penalty to Seb Atkinson who bundled over for his hat-trick.\nWade then chased his own kick past two Bristol players to tap down his own third try, and Barton then got in on the act after coming on as a replacement with Gloucester's ninth.\nThe win was out of Bristol's reach but they scored a crucial fourth to ensure they took something from the trip up the M5 through Williams, who muscled over under a tackle.\nGloucester director of rugby George Skivington told BBC Sport:\n\"I do think we were brilliant in defence, I know we conceded four tries but our defence was brilliant. Set-piece was very clinical.\n\"Attack-wise, we've scored a lot of tries this year but there has been times we've scored four and then the game has sort of gone along, we've not deliberately been conservative but I think scoring those three tries straight after the break was as good as we have been.\n\"I think Lightsy [James Lightfoot-Brown, attack coach] is really paying off there and the boys are really enjoying it. It is hard work, Lightsy's very on his detail - it's not lucky. It's just rewards to James and to all the boys.\"\nBristol director of rugby Pat Lam told BBC Sport:\n\"Well done to Gloucester, they were superb tonight, definitely their night and great to see so many young Gloucester kids and supporters enjoyed the game.\n\"I think we worked our way back 29-21 just before half-time and then we conceded again.\n\"At half-time we talked about how we have got to start fast and we turned the ball over from the kick-off and got a chance to get into it, and if we scored there we're back in the game but we turned the ball over and Gloucester scored.\n\"Not a great night defensively but we'll take the one point, the season ebbs and flows. The journey towards the end of May, June is not always easy one but you learn along the way. Our main thing is we got one point out, we'll dust ourselves off, we've got five more [games] to get into those play-offs.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/czjex9g30xlo"}