{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-04-26 04:38:27", "date_modify": "2025-04-26 04:38:27", "date_publish": "2025-02-28 10:31:26", "description": "World record signing Naomi Girma is expected to be included in Chelsea's squad for the first time for Sunday's Women's Super League match against Brighton.", "filename": "sport_football_articles_c3e44lj5899o_1745642307.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c230/live/c606cf10-f5b7-11ef-accd-233028a2e09e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c3e44lj5899o_1745642307.html", "title": "Chelsea Women: World record signing Naomi Girma 'should' be in squad against Brighton", "title_page": "Chelsea Women: World record signing Naomi Girma 'should' be in squad against Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World record signing Naomi Girma is expected to be included in Chelsea's squad for the first time for the Women's Super League match against Brighton on Sunday.\nThe USA defender joined for £900,000 from San Diego Wave in January but has yet to make her debut as she recovers from a calf injury.\nThe 24-year-old was ruled out of the United States' matches for this month's SheBelieves Cup but has got back to fitness with her new club during the recent international break.\nChelsea manager Sonia Bompastor told a news conference on Friday that Girma \"should\" be in the squad.\nMeanwhile, Australia striker Sam Kerr is \"in a good place\" and \"progressing really well\", according to Bompastor, but is not yet ready to return from her anterior cruciate ligament injury.\n\"She is returning back to her level but it's always difficult to put a timeframe on her return, but I'm actually really happy with what I saw the last two weeks,\" the manager added.\nKerr, who has not played since the end of 2023, was earlier this month found not guilty of causing racially aggravated harassment.\nChelsea are currently seven points clear at the top of the WSL, while they also have a League Cup final and Champions League quarter-final to come in March.", "url": "https://www.bbc.co.uk/sport/football/articles/c3e44lj5899o"}