{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:34:19", "date_modify": "2025-05-21 04:34:19", "date_publish": "2025-04-05 00:00:00", "description": "Follow live text and listen to BBC local radio commentaries from day two of the 2025 County Championship campaign.", "filename": "sport_cricket_live_cr529608990t_1747802059.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/07e6/live/971c8570-1239-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cr529608990t_1747802059.html", "title": "County Championship: Day Two as it happened as Banton sets record for Somerset", "title_page": "County Championship: Day Two as it happened as Banton sets record for Somerset - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Good evening\n#bbccricket\nThe runs have flowed and records have tumbled on another incident-packed day of county cricket.\nA run-laden day capped by Tom Banton's incredible unbeaten 344.\nCenturions Matt Critchley, Michael Pepper, John Simpson and Wayne Madsen can also take a bow. Who'd be a bowler?\nWe'll be back in the morning with more of the same. Thanks for your company today.\n'Dudgeon looks an inspired signing'\nClose: Northants 107-7 v Kent (Target 260)\nAndrew Radd\nBBC Radio Northampton\nSouth African seamer Keith Dudgeon looks an inspired signing for Kent after his burst of three wickets in nine balls left the visitors on the brink of victory at Wantage Road.\nBrought back into the attack late in the evening session by Daniel Bell-Drummond, Dudgeon removed Saif Zaib, Rob Keogh and Lewis McManus - all with the aid of catches at second slip by Jack Leaning.\nGeorge Bartlett's unbeaten 54 kept Northamptonshire afloat, but at the end of another blink-and-you-miss-it day's play which saw 20 wickets fall, Kent will fancy their chances of wrapping up the win before the Sunday lunch is served.\n'Durham had a decent little final session'\nClose: Notts 197-5 v Durham 378\nDave Bracegirdle\nBBC Radio Nottingham commentator\nMatthew Montgomery is 19 not out at stumps and Farhan Ahmed is four not out.\nDurham had a decent little final session with a couple of wickets for Paul Coughlin.\nThey were big wickets as well, Joe Clarke and Freddie McCann. And then Ben Raine with the second new ball getting rid of Jack Haynes.\nHopefully we'll begin day three a little less frenetically than we did this morning and things run a little smoother.\nClose of play at Lord's\nLancs 353-9 v Middx 260\nLancashire had an immediate return on their overseas player expenditure at HQ with Marcus Harris reaching an unbeaten 134 at stumps on day two as the Red Rose put Middlesex on the back foot.\nOpener Keaton Jennings got the visitors off to a decent start with a half century and Tom Aspinwall, for the hosts, with 4-32, was another who could be pleased with his day's work.\nYet if Lancashire go on to hammer home their their advantage – they lead by 93 with a wicket remaining – it will be largely down to the Australian who anchored their reply and saw them over the line for a third batting point.\n'The draw looks the most likely result'\nClose: Warks 223-3 v Sussex 528\nAdrian Harms\nBBC Sussex\nIt's been a really good day's cricket.\nJohn Simpson takes the plaudits with that wonderful innings of 181 and then coming out and keeping wicket.\nWarwickshire were off like a rocket, both Alex Davies and Ron Yates batted really well. I think Davies will be annoyed with the way that he got out straight after tea, he looked in complete control.\nBut Sussex having leaked runs, I thought then bowled really nicely. Jack Carson in particular caused one or two problems.\nI think at the end of day two you have to say the draw looks the most likely result but Sussex with those three wickets in the session has just made it interesting, certainly for tomorrow as well.\nClose of play\nNorthants 107-7 v Kent (Target 260)\nAn awful way to end the day as Justin Broad shoulders arms with two balls of the day remaining and is pinned in front by Nathan Gilchrist.\nHe goes for one and the hosts lose a seventh wicket of the evening session.\nGeorge Bartlett remains as the sole resistance, unbeaten on 54.\nKent will return in the morning needing just three wickets for an emphatic win.\nClose of play at Trent Bridge\nNotts 197-5 v Durham 378\nBen Raine in to bowl the final over of the day and Matt Montgomery cuts the first ball down to third man boundary for four to move to 19.\nThe Notts batter then plays out the rest of the over without alarm and that's stumps.\nHard to say exactly who's on top here.\nBoth Ben Slater (92) and Freddie McCann (72) threatened centuries only to gift their wickets as Durham battled away to keep the hosts innings in check.\nNotts will resume in the morning still 81 runs in arrears with five wickets in hand. Even stevens.\nClose of play at Utilita Bowl\nYorkshire 189-6 & 121 (lead by 61 runs) v Hants 249\nA pretty dismal day for Yorkshire to file along with a solidly dismal day yesterday. Aside from Adam Lyth remaining unbeaten at the crease at tonight's close and a 61 run lead postives were hard to find.\nSuch small pluses have been eclipsed by a dominant Hampshire display which leaves the hosts on pole with two days to go and eyeing an opening victory of the season.\nSo much to ponder for new Yorkshire skipper Jonny Bairstow, who at least got his season up and running after a stuttering start, reaching a half century and sharing a 105-run partnership with Lyth.\nOf significant concern for him will be a first day collapse with the bat and the fact that after getting Hampshire six wickets down for 176 in their reply, they were unable to cut through the tail who weighed in with valuable first innings runs.\nWith Bairstow's side staring at a 128-run first innings deficit, it was Brad Wheal who did the damage with the ball for Hampshire, taking four of the top seven batters and finishing with 4-41.\nHe will return tomorrow refreshed and with a nightwatchman occupying the crease in Ben Cliff, Hampshire will be hopeful of wrapping up a win on day three.\nPost\nNotts 293-5 v Durham 378\nMatthew Montgomery takes a single and leaves Farhan Ahmed with two balls to survive from Matthew Potts' final over of the day.\nShort leg is brought in and it's an aggressive field as Alex Lees moves to leg slip\nBut Ahmed gets a little bit of bat and deflects it past Lees to the boundary.\nThe final ball holds its line and goes right through the defences, but fortunately it misses both bat and stumps.\nOne to go.\nWICKET\nHaynes lbw b Raine 30 (Notts 288-5 v Durham 378)\nA bizarre dismissal on an odd day at Trent Bridge as Durham continue to chip away.\nJack Haynes ducks down expecting a short ball from Ben Raine and appears to lose sight of the ball.\nIt doesn't get up as expected and strikes Haynes on the thigh of his back leg as he's caught almost side on.\nFarhan Ahmed is sent out as nighthawk in chief with two overs remaining.\nClose of play at Edgbaston\nWarks 223-3 v Sussex 528\nJohn Simpson led from the front for Sussex with an unbeaten 181 and the late wicket of Sam Hain has given them a sniff at Edgbaston.\nRob Yates and Alex Davies raced to an opening century partnership with Yates going on to complete his 11th first-class hundred as Warwickshire raced away at the start of their innings.\nThere was a bit of spin for Jack Carson who nipped out Hamza Shaikh with a beauty and Jayden Seales late strike probably just gives Sussex the edge and Warwickshire will need to mind their work when we return tomorrow morning.", "url": "https://www.bbc.com/sport/cricket/live/cr529608990t"}