{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:34:41", "date_modify": "2025-05-21 05:34:41", "date_publish": "2025-01-23 00:00:00", "description": "Follow live text and radio commentary featuring Aryna Sabalenka and Iga Swiatek from the Australian Open semi-finals in Melbourne.", "filename": "sport_tennis_live_cvgny8p6v7pt_1747805681.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_live_cvgny8p6v7pt_1747805681.html", "title": "Australian Open 2025 LIVE: Iga Swiatek vs Madison Keys", "title_page": "Australian Open 2025 LIVE: Iga Swiatek vs Madison Keys - live text and radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nThat's all from the three us today, but we'll be back very early tomorrow morning for the men's semi-finals.\nAndy Murray-coached Novak Djokovic takes on Alexander Zverev before Jannik Sinner faces Ben Shelton.\nDon't forget you can keep up to date with all things Australian Open on our dedicated page. Enjoy!\nKeys-Sabalenka head-to-head record\nAryna Sabalenka is aiming to emulate Martina Hingis' three straight titles between 1997-99.\nEarlier today she cruised into the final with a 6-4 6-2 win over close friend Paula Badosa.\nSabalenka and Keys have met each other five times on tour, with Sabalenka winning on four occasions.\nThat one Keys win was on grass in Berlin in 2021. Sabalenka won their last meeting on the hard courts of Beijing in October.\n'I'm really excited for the challenge' - Keys\nMore from Madison Keys: \"I think at the end we were both battling some nerves and really just pushing each other and it came who can get this final point and who can kind of just be a little bit better than the other one, and I'm happy it was me.\"\nOn the final against Aryna Sabalenka: \"There will definitely be some big hitting and definitely not a lot of long points but she's obviously going for her third Australia Open and I'm excited to get to play her.\n\"I'm really excited for the challenge and I don't know, Saturday is very far ahead in my brain right now.\"\nOn what her plan is: \"I'm probably going to go and hug my team and then I will have a bunch of obligations that I will run around and do but I think I'm just going to try and enjoy this a little bit and then get ready for Saturday.\"\n'I feel I blacked out at one point' - Keys\nMadison Keys on booking her spot in the final said during her on-court interview: \"I’m still trying to catch up to everything that is happening, I’m in the finals. That match was such high level and she [Iga Swiatek] played so well and I just felt like I was fighting to stay in it.\n\"I then ran with the second [set] and the third was just a battle and to be able to be standing here and be in the finals is absolutely amazing and I’m so excited that I get to be here on Saturday.”\nOn the fight and determination throughout the match: \"I feel like even though I lost the first set I was playing some better tennis at the end of it and that I had a little bit of momentum going into the second set. To be able to run with that second set and really just be able to settle was really nice.\n\"In the third set it was so up and down and there were so many big points and break point chances that neither one of us got. I feel I blacked out at one point and I was just there running around so just to be able to stay in it and stay fighting, and then a ten-point tie-breaker for an extra dramatic finish.\"", "url": "https://www.bbc.com/sport/tennis/live/cvgny8p6v7pt"}