{"authors": ["Justin Goulding", "www.facebook.com"], "date_download": "2025-05-19 14:46:30", "date_modify": "2025-05-19 14:46:30", "date_publish": "2015-02-24 11:32:21", "description": "Chris Gayle hits the first double century in World Cup history as West Indies beat Zimbabwe by 73 runs in Canberra.", "filename": "sport_cricket_31600976_1747665990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81203000/jpg/_81203899_chris_gayle_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_31600976_1747665990.html", "title": "Cricket World Cup 2015: Chris Gayle 215 sets up West Indies win", "title_page": "Cricket World Cup 2015: Chris Gayle 215 sets up West Indies win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Gayle hit the first double century in World Cup history as West Indies beat Zimbabwe by 73 runs under the Duckworth-Lewis method.\nThe left-hander smashed 215 off 147 balls, including 16 sixes and 10 fours, in West Indies' 372-2 in Canberra.\nHe added an ODI record 372 for the second wicket with Marlon Samuels, who made a relatively sedate 133 not out.\nChasing a rain-revised target of 363 off 48 overs, Zimbabwe mustered 289 as Gayle took two wickets and a catch.\nHaving lost their opening game to Ireland, West Indies' win took them level on points with India at the top of Pool B, going into their meeting with South Africa on Friday.\nAlthough Zimbabwe's bowlers suffered heavily at the hands of Gayle, their batsmen deserve credit for a respectable run chase that featured Sean Williams's 76 and 52 for Craig Ervine.\nJerome Taylor claimed 3-38 and West Indies captain Jason Holder 3-48, but their figures were footnotes in a game that will be remembered for Gayle's savage hitting.\nFortunate to survive an lbw review off his first delivery after opening partner Dwayne Smith fell to the second ball of the innings, Gayle batted with uncharacteristic patience in bringing up a 105-ball century.\nHowever, his next hundred spanned only 33 deliveries - and his fourth fifty a mere 12 - as he and Samuels flayed 152 off the final 10 overs.\n\"It was a fantastic day from a personal point of view,\" said Gayle.\n\"When I got past 100, I knew I wanted it to be a double hundred, so I'm glad I got the chance to deliver it.\"\nSamuels's occasionally scratchy century went almost unnoticed as Gayle repeatedly cleared the boundary, swinging disdainfully over mid-wicket and driving powerfully straight.\nHe eventually fell off the last ball of the innings, having equalled the record of 16 sixes in an ODI innings shared by Rohit Sharma and AB de Villiers.\n\"Chris is an outstanding player,\" said West Indies captain Jason Holder. \"It's great to have him back in form and hopefully he can carry it through the tournament.\"\nDespite losing Regis Chakabva and Hamilton Masakadza inside the first five overs of their reply, Zimbabwe scored at almost seven runs an over.\nThe resourceful Williams was the chief architect of a chase that unravelled only after he top-edged a pull off Holder.\nPart-time off-spinner Gayle bowled Ervine round his legs six overs later to reduce Zimbabwe to 226-6 and remove any doubt over the outcome of the contest.\nHe finished with 2-35 and capped a remarkable day with an exaggerated dive and roll after catching Elton Chigumbura at extra cover off Taylor.\nZimbabwe skipper Chigumbura said: \"There is a lot of work to be done. We were unlucky with the Gayle lbw but he played a massive innings today and it made a big difference.\"\nListen to highlights from Test Match Special's and 5 live Sport's 2015 Cricket World Cup coverage", "url": "https://www.bbc.com/sport/cricket/31600976"}