{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:20:08", "date_modify": "2025-05-21 04:20:08", "date_publish": "2025-04-05 15:16:04", "description": "New Zealand seamer Matt Henry's return to Somerset is indefinitely delayed as he recovers from a shoulder injury.", "filename": "sport_cricket_articles_crldkrxngjlo_1747801208.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23a9/live/755294e0-122d-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_crldkrxngjlo_1747801208.html", "title": "Matt Henry: Injured New Zealand seamer's return to Somerset delayed", "title_page": "Matt Henry: Injured New Zealand seamer's return to Somerset delayed - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Zealand seamer Matt Henry's return to Somerset has been indefinitely delayed as he recovers from injury.\nThe 33-year-old had been due to join the county on 7 April and be available to play for 11 weeks, but the club say he is undergoing a \"phased rehabilitation programme\" with the New Zealand medical team.\nHenry suffered a shoulder injury during the Champions Trophy semi-final win against South Africa last month and has also been managing an ongoing knee issue, external that ruled him out of the one-day international series against Pakistan\n\"Obviously, this is frustrating news for Matt as well as our Somerset members and supporters who we know were looking forward to seeing Matt in the club colours again in April,\" said , externalAndy Hurry, Somerset director of cricket.\n\"Matt's health, fitness and wellbeing are everyone's priority, and we will continue to connect and collaborate with all parties over the next few weeks.\n\"We are all working towards seeing Matt at the Cooper Associates County Ground in 2025, and as soon as we have any further updates we will let our members and supporters know.\"", "url": "https://www.bbc.com/sport/cricket/articles/crldkrxngjlo"}