{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 13:29:28", "date_modify": "2025-05-20 13:29:28", "date_publish": "2023-08-02 05:31:16", "description": "Fernando Alonso tells BBC Sport's Andrew Benson about being on 'the dark side', feeling misunderstood and being competitive.", "filename": "sport_formula1_66350215_1747747768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/85BE/production/_130583243_gettyimages-1576001768.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66350215_1747747768.html", "title": "Fernando Alonso: Aston Martin driver on 'the dark side', Max Verstappen and Alpine", "title_page": "Fernando Alonso: Aston Martin driver on 'the dark side', Max Verstappen and Alpine - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fernando Alonso is discussing perception and reality, the difference he sees between his wider public image and his assessment of himself.\n\"This,\" he says of Formula 1, \"is a great show - inside, and off track as well. And you need to play a character, you know? Whatever is assigned to you.\n\"You need to sell the story, you need to tell which ones are the good ones and the bad ones. In every race, in every discussion, in every polemic, there is always a good power and a bad power, good guys and bad guys.\n\"And people in general, media or whatever, they put me always on the bad side. Like if I was doing something wrong or whatever.\"\nAlonso's observation has been prompted by discussion of a remark he made in the most recent series of Netflix's Drive To Survive - a show widely regarded as central to the transformation in Formula 1's popularity over the past few years.\nA two-time world champion and one of the sport's most celebrated and fascinating figures, Alonso says in an episode that, on F1's character board, he is \"on the dark side\".\nAs he talks to me in his Aston Martin team's headquarters at the Belgian Grand Prix, he's explaining what he meant, and how he feels about the way he is seen.\n\"I feel OK,\" he says. \"I feel good. I don't mind.\n\"The most important part is people still want you and are still interested in how many years you have on your contract because they may get interest in having you driving in the future.\n\"Whatever is happening on the outside is just part of this circus.\"\nAlonso's comments to Netflix made an impression because they tap into a theme he has occasionally revisited in the past couple of years - that, as an outsider in a fundamentally British environment, he is treated differently. But also because they are true - he is often painted as the bad guy.\n\"It has been always like this,\" he says. \"I am maybe Spanish and Latin. I didn't have much support, or we don't have that media train that can take everything out. We are just a small country from the south of Europe and we just take everything that is not right and we are OK.\"\nBut perhaps, really, he does mind, or at least did, once. Perhaps he doesn't think it's OK. Perhaps he has just learned to live with it.\nUndoubtedly, he has been involved in some controversies over the years.\nMost infamously, there was the 2007 Hungarian Grand Prix,, external when he was penalised for blocking McLaren team-mate Lewis Hamilton in the pit lane, then fell out with his team bosses after asking them to favour him.\nThere have been others, too. Such as when he allowed his frustrations with the performance and reliability of McLaren's Honda engine to boil over at the Japanese Grand Prix in 2015 and shouted \"GP2 engine\" over the radio. Not the best idea at the home race of a company from a country where honour and face are part of the culture.\nBut there are two sides to every story. Alonso's actions in Hungary came in response to Hamilton pulling a fast one on the Spaniard.\nAnd the GP2 engine remark was towards the end of a season in which Honda's fallibilities had made the company close to a laughing stock in F1. He had made plenty of positive comments before his patience finally snapped in the heightened adrenaline of a race situation.\nAlonso might reasonably point out that other drivers make critical comments about rivals, do questionable things, and sound off on the radio, and are not tarred with the same brush.\nAnd he could be forgiven for not quite being able to compute, given all this, why his return to the front with Aston Martin this year has been met with such transparent acclaim.\nDoes he feel misunderstood?\n\"The things that have been talked about and have been published on some episodes, for sure could lead to some misunderstandings,\" he says. \"Like, as you said, 2007, the Hungary thing. No-one heard my version, or the truth, or the facts.\"\nAnd what is that?\n\"I said that I never hold anyone,\" he says, referring to preventing Hamilton doing a final qualifying lap. \"They just gave me old tyres when it was qualifying.\n\"So there is the radio transcript, the decision from the stewards, where it is written that they put me a penalty on an article that didn't exist. They just put the penalty but clarified it was not for any article. And things like that.\n\"And it was my team putting a protest against myself, which is the first time in the history of the sport. So when you put all these kinds of things and you don't see the facts, obviously it is difficult to clarify some misunderstandings.\"\nThis is the first time I can remember Alonso publicly discussing the controversy of Hungary 2007. There is a lot to unpick in what he said, but it is clear that further questions on the topic will not be welcomed.\nAlonso's version of events is not, let's say, the accepted one.\nDid McLaren fit used tyres to his car? It can't be ruled out, but it doesn't look like it from TV pictures from the time, and he went out and set pole afterwards.\nWas there a radio transcript? Somewhere, probably, but McLaren people's memories of the incident are only of the countdown to when he should have left, then the team urging him to go, and radio silence from the car.\nDid McLaren protest against him? Not officially, but various senior team members certainly complained to the FIA about his actions. Alonso was penalised - over a matter in which many thought the stewards should not have got involved - and Hamilton's actions which provoked him were never punished.\nFive years ago, when Alonso was about to step away from F1 for the first time, I tried to establish the true story of key episodes in his career for a series of articles, and spoke to many of those involved.\nOne thing became all too apparent. Establishing a definitive truth was impossible - everyone's memory varied. So, for now, perhaps the way to think about what Alonso says is it is his truth.\nAnd that's as good a way as any of understanding Alonso. He lives by his truth - with passion and without compromise. And he often can't resist the temptation to put it across. Just as importantly, he has a rare talent for expressing his opinion in a powerful and vivid manner in just a few words.\nThe modern world lives on headlines and Alonso's words and actions provide them - quite often intentionally; sometimes not. And because he is such a high-profile name, they resonate.\n\"When you are 20 years in a competitive level in any sport,\" he says, \"I think you will get some of these episodes.\n\"If we go to tennis, or football, or whatever, with all the respect for any other players in football, maybe the right midfielder of one small team gets some episodes and no-one knows anything about them. If Ronaldo or Messi or some other big players sometimes get a yellow or red card or [say something in] whatever interview, there is a big story behind.\n\"So I think I found myself sometimes in those situations.\"\nGiven the controversies that have peppered his career, it has been interesting to see Alonso's return to the front with Aston Martin this season met with almost universal delight.\nFrom the very first race in Bahrain, the joy that one of the greatest drivers in history was finally back in a car that could allow him to run close to the front, after 10 years in the competitive wilderness, was palpable - both inside the F1 paddock and outside.\nHis on-track achievements in 2023 - six podiums in the first eight races; a win that got away in Monaco - have delighted audiences across the globe. And he has become a social media sensation off track - whether it has been making knowing references to wild rumours of a romance with Taylor Swift, or being caught on camera sniffing flowers in the TV 'pen' in Miami.\n\"It has been a great welcome from everyone that I go back to a more competitive position,\" Alonso says. \"Also for Aston Martin - everyone is happy for a new team to join the fight. We see in the grandstands a lot of green colour.\n\"The old fans who still remember some of the good days, it is good to prove to them that I can still be quick, and enjoy my driving. And for the new fans who maybe never saw me on the podium, it is good to have this possibility again.\"\nAlonso has dominated his team-mate Lance Stroll. But the dynamic between the two is like none at any other team in the pit lane.\nAston Martin is owned by Lance's father - Canadian billionaire Lawrence Stroll. The team effectively exists for Lance. For someone with such competitive intensity as Alonso, this might have been expected to lead to problems. Instead, Alonso, as Verstappen has described it, has been \"like a life coach\" to his team-mate.\nOn two occasions Alonso has found himself behind Stroll in races - in Spain and Austria - he has gone on the radio to say he won't try to pass. He even offered live set-up advice over the radio mid-race in Azerbaijan.\n\"I know what my role is,\" Alonso says. \"Try to help the team to grow in all these areas, try to help Lance as well in anything that I can bring to the team. Because I will race for a few more years but I don't know how many - not so long. And he will race for many more years, and he has to lead the team into the future. So I am happy to help.\n\"I don't think there is much more mystery on this. We have a good relationship now. We are not fighting for the championship. If we were fighting for the championship, maybe there would be less communication or a little bit more tension, between the team or drivers, but right now we have very clear goals and we work together in that direction.\"\nAlonso would not be at Aston Martin, however, had the management at Alpine not mishandled the driver market last season.\nHe had every intention of staying at the French team, but their prevarication over contract negotiations - offering only a one-year deal with options rather than the two years he wanted - and various ill-advised comments from chief executive officer Laurent Rossi in the media made him question their commitment.\nSo when Aston Martin contacted him following Sebastian Vettel's decision to retire, Alonso jumped at the chance to join a team whose potential he believed was clear.\nMany questioned the move at the time, but it was an inspired choice - even if some of the difference in performance between the teams this year is down to Aston Martin gaining Alonso and Alpine losing him.\nRossi was replaced a couple of weeks ago. This interview took place before the news team principal Otmar Szafnauer had also been removed, but Alonso made his feelings about Rossi and Szafnauer clear.\n\"I don't think I felt disrespected,\" he says. \"But it is true it took longer than I thought when we started conversations - I think it was in Australia back in [April] 2022 - about renewing the contract.\n\"It was just on a very slow pace, and it was not from my side. I was just ready and happy. The 2022 car was a fast car so I was also happy with the performance and the possibilities into the future.\n\"So that slow pace of conversations and eventually not even putting on paper what we were writing and all these comments about the age and whatever, which they are still doing.\n\"It is the way they do things. Or the way Otmar does things. Because after this year, he should be quiet. He should not talk at all. After the results of Aston Martin and the results he's achieving, he's still talking and still proud of the decision, which is incredible, amazing.\"\nDoes he think Alpine underestimated what he brought to the team?\n\"100%,\" Alonso replies. \"And still do.\"\nHe adds: \"When you are doing the best you can every weekend, when I did so many things for Renault as well, you take a little bit personal when someone is doubting your performance or your age or these kinds of things.\n\"And you just want to prove even extra hard that you are in the best moment of your career. The results, they speak for themselves, and that's the best way.\"\nAlonso admits the performance of Aston Martin this season was \"a little bit unexpected,\" but he says to be back fighting at the front has been an \"incredible feeling, something I was hoping for for many years\".\nThe team's performance tailed off in the past four races before the summer break, but there is optimism the foundations have been set for a bright future. Which raises the question of whether, even at the age of 42, Alonso is thinking about wanting to stay on beyond the end of his contract in 2024.\n\"Not thinking too much into the future, thinking on these years only,\" he says. \"The target is to keep growing as a team. We are finding some obstacles right now.\n\"We are dealing with some extra performance from our opponents, our lack of performance in certain circuits and these kinds of things. Which I find very interesting and very useful for us as a team to grow up.\n\"We will always find difficulties and some obstacles in the way. And it's up to us now how to deal with those and overcome them. The team is really clever in some of the approaches it is taking now, and even if we are struggling a little bit in this middle part of the year, it will make us stronger in the future. So I am quite optimistic.\"\nAnd of his own performances so far this year?\n\"I am happy but still obviously room to improve,\" he says. \"Only the first six months with the team and still there is more to come.\"", "url": "https://www.bbc.com/sport/formula1/66350215"}