{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-04-26 06:32:25", "date_modify": "2025-04-26 06:32:25", "date_publish": "2025-02-27 07:56:09", "description": "Tom Rowland was a powerhouse England under-18 prop. Eight years later and four stone lighter, he is about to become part of the first sub-85kg New Zealand team.", "filename": "sport_rugby-union_articles_cdrxy3j65ggo_1745649145.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ce9/live/1874eee0-f3c8-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cdrxy3j65ggo_1745649145.html", "title": "Tom Rowland: Former England under-18 prop on weight-restricted rugby", "title_page": "Tom Rowland: Former England under-18 prop on weight-restricted rugby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tom Rowland remembers rooming with Joe Heyes.\nLeicester prop Heyes is now part of England's Six Nations squad, coming off the bench in each of their three games so far.\nBack then though, in Cape Town, in 2017, both Heyes and Rowland were England Under-18s.\nBoth were props. Both were highly rated. Both would start against South Africa Schools the next day.\nBut, in other ways they were different.\n\"Joe was the size he is now, he was just an absolute beast,\" remembers Rowland.\n\"He was something like 130kg (20st 7lb) aged 16.\n\"Someone like him was made to play in the front row.\"\nRowland wasn't though.\nTwo years earlier, he had been a blind-side flanker or number eight, carrying hard for Bristol's academy team.\nHowever, his coach, seeing the trend for more mobile props, suggested he swap the back row for the front row.\n\"I was only 90kg (14st 2lb) at the time,\" Rowland says.\n\"I enjoyed my gym work, but I never dreamed of being fast-tracked into being a prop.\"\nThe change of position demanded a change in physique.\nRowland was given two aims - to load up the weights bar and his plate.\nSix meals a day, five weights sessions a week.\nEnergy in, power out and, hopefully, bulk up.\n\"I found it pretty tough,\" says Rowland. \"It was a conscious effort making sure I got the food in.\n\"My strength and conditioning coach would always be on to me. You'd have to weigh in in the mornings, you would step on the scales and find you had lost a kilo because you haven't had enough dinner the night before.\n\"I always like to eat relatively 'clean', but it got to a point where they said 'you just need the calories, we don't mind if you are smashing a load of dessert'.\n\"It was always a bit of a battle for me.\"\nIt was a battle he won. In the short term at least.\nA couple of years after changing position, he had put on three stone and the England Under-18 loose-head prop shirt.\nRowland played five games, lining up alongside Marcus Smith, Tom Willis, Cadan Murley and Ted Hill, all of whom, like Heyes, are playing for England in this year's Six Nations.\nRowland is still playing, just at a lower level, in a different country and, intriguingly, at a lighter weight.\nThis April, he will be part of the first-ever 'Small Blacks' team – a New Zealand representative side with a catch., external\nAll its members play weight-restricted rugby, in which no player, whether front row or fly-half, weighs more than 85kg (13st 5lbs).\nIn New Zealand, the concept has taken root.\nIn 2024, 45 teams entered the national under-85kg Cup, with the final taking place at Sky Stadium in Wellington as a curtain-raiser to an All Blacks win over Australia.\nThe players are smaller and more uniform in stature, but the action is fast and hard.\n\"If no-one had a number on their back, you would struggle to know who is playing which position,\" says Rowland.\n\"I wouldn't say it's like sevens, the games can still be quite physical and forward dominated, but everything's done at just a much greater pace.\n\"Everybody is pretty fit so the collisions in the 70th minute are just as hard as those in the opening five minutes of a game. There's no real drop off.\n\"The skill level from one to 15 is great. Even as a prop, you are expected to have as good a catch and pass as anyone in the backline.\n\"The only thing where there's probably a big step down is the set-piece, especially the line-outs. You have a lot of guys who aren't used to jumping in a line-out.\n\"But in a way less focus around the set-piece makes it a bit more exciting, it speeds everything up.\"\nRowland is certainly quicker than he was. Back in his England age-grade days, he weighed in about 17st 5lb.\nNow 26, he plays four stone lighter, the weight he was as a 14-year-old.\n\"I can still enjoy the scrummaging side but I am also now fit enough and at a good weight to be mobile and contribute around the pitch.\n\"I get to carry lots, make tackles and I actually play 80 minutes in most games. I really enjoy not having to get dragged off at around 50 or 60 minutes because I can't breathe any more.\"\nRowland's initial weight loss came during the Covid lockdown. Unable to dislodge the likes of Yann Thomas and Jake Woolmore in the first team, he had been released by Bristol.\nWithout access to weights, but with a desire to keep fit, he started running every day.\nWhen restrictions eased and he met up with friends again, Rowland's body shape had changed so dramatically, they thought he was ill.\nRowland felt the opposite.\n\"The weight just flew off me and I felt so much better,\" he says. \"I had more energy - I did have to sell my whole wardrobe though and buy new clothes!\"\nIn 2021, he moved to a new country as well, taking advantage of the New Zealand passport he has through his mother.\nIn a different hemisphere, things turned upside-down.\nWhere once he was piling on pounds any which way he could, now he has to be mindful of passing a weigh-in a couple of hours before matches.\nSome players will, like boxers, shed weight in saunas the night before, tip the scales and then wolf down carbohydrate-heavy food in the dressing room.\nCramps can creep up on those who misjudge their pre-match routine.\nWhen the New Zealand under-85kg team play their first match, it won't be an issue though. At least not for Rowland and his Small Blacks team-mates.\nTheir two matches against the full Sri Lanka national team (ranked 40th in the world) in Kandy and Colombo are being played at a catchweight.\nA cap of 105kg (16st 7lb) has been applied to ensure there isn't a dangerous discrepancy between the hosts and tourists.\n\"It will be interesting to see if we'll be able to kind of hold our own, obviously being a bit lighter than that,\" says Rowland.\nWeight-restricted rugby's potential for growth may be mostly at the grassroots level, retaining players who feel that, while rugby is a game for all sizes, they would prefer a format with more evenly matched physiques.\n\"There would be definitely a pocket of players who would really kind of enjoy this grade of rugby. I think it's only going to be good for the game, and keep people playing,\" says Rowland.\n\"I think it's an idea that would go pretty well in Europe as well.\"\nIf it does, there are long-term hopes of staging a weight-restricted World Cup.\nRowland, who watched former team-mate Smith in action at Eden Park against the All Blacks in July, could, in theory, have a black-and-white decision to make; whether to turn out for England or New Zealand.\n\"Tough, tough question,\" he smiles.\nProbably still not as tough as that sixth meal of the day though.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cdrxy3j65ggo"}