{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:10:16", "date_modify": "2025-05-19 15:10:16", "date_publish": "2015-02-20 13:16:21", "description": "Darren Bent's penalty gives Derby a thrilling win over 10-man Sheffield Wednesday and sends them top of the Championship.", "filename": "sport_football_31467127_1747667416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81156000/jpg/_81156833_darren_bent2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31467127_1747667416.html", "title": "Derby County 3-2 Sheffield Wednesday", "title_page": "Derby County 3-2 Sheffield Wednesday - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Darren Bent's penalty gave Derby a thrilling win over Sheffield Wednesday and sent them top of the Championship.\nLewis McGugan put the Owls into the lead with a superb curling free-kick, before Jake Buxton glanced home the equaliser from George Thorne's corner.\nWill Keane pounced on slack Derby play to fire home for 2-1, but Buxton nodded home another leveller from a corner.\nBent converted a spot-kick after Owls goalkeeper Keiren Westwood was sent off for hauling down Tom Ince in the area.\nDerby were hoping to capitalise on morning leaders Middlesbrough's 1-0 defeat by Leeds earlier in the day and named midfielder Thorne in the starting line-up for the first time this season.\nThorne - a summer signing from West Bromwich Albion - had been kept on the sidelines by a pre-season cruciate ligament injury.\nBut his side fell behind after Will Hughes gave away a soft free-kick on the edge of his own area and McGugan's effort looped over the wall, leaving goalkeeper Lee Grant rooted to his spot.\nInce then missed a glorious chance to level, but the on-loan winger could only hit the post with the goal at his mercy, before later seeing a free-kick brilliantly tipped over by Westwood.\nMcGugan's goal failed to give Wednesday a foothold in the game, and a minute after the break Steve McClaren's side were level when defender Buxton rose to turn in.\nSoon after, Derby gave the ball away cheaply and forward Keane, who is on loan from Manchester United, took full advantage to beat Grant at the near post.\nStuart Gray's side had Derby in trouble, and Kieran Lee sliced an effort from Jacques Maghoma's cross when well placed in the area.\nWednesday looked vulnerable at corners and Derby made in 2-2 when Craig Bryson's ball in was headed in by Buxton for his third goal of the season.\nInce then curled an effort just wide, before he won the penalty from which Derby moved two points clear at the top of the table after Brentford beat Bournemouth 3-1.\nDerby head coach Steve McClaren:\n\"We've had spells of six or seven clean sheets but in the last four we've conceded nine goals.\n\"We can't continue with that and I thought today we are going through a spell where we make a mistake or give a free-kick away and it's a goal.\n\"But we have to eradicate mistakes otherwise conceding nine goals in the next four games will get us nowhere.\n\"We said to the players at half-time that this could be a very big three points if we comeback and I think in the end we wore Wednesday down with constant pressure and the tempo of our football.\"\nSheffield Wednesday manager Stuart Gray:\n\"We have been doing very well in our own box so to concede three goals from set plays was very disappointing. And then for Westwood to get sent off, I think that was a bit harsh.\n\"Derby are a good side and I think they will get promoted. Because they put you under so much pressure, we have got lads making decisions with tired minds.\n\"But to get ourselves 2-1 up gave us something to build on.\"", "url": "https://www.bbc.com/sport/football/31467127"}