{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:41:57", "date_modify": "2025-05-21 03:41:57", "date_publish": "2025-04-06 18:22:03", "description": "Warwickshire and Sussex appear destined to start their County Championship Division One season with a draw after three sun and run-soaked days.", "filename": "sport_cricket_articles_cz79erjpyq2o_1747798917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6307/live/6a068f10-130e-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cz79erjpyq2o_1747798917.html", "title": "County Championship: Warwickshire and Sussex seem destined for draw", "title_page": "County Championship: Warwickshire and Sussex seem destined for draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire and Sussex appear destined to start their County Championship Division One season with a draw after three sun-soaked and run-heavy days at Edgbaston.\nSussex closed the third day on 126-3 in their second innings, 200 ahead overall, having taken a first-innings lead of 74.\nIt is a solid advantage that can be built on. However, taking 10 wickets quickly on the final day would require very something special from the bowlers on a pitch offering some turn but still batter-friendly.\nThe match was pretty much consigned to a draw on the third afternoon when Warwickshire, replying to 528, reached 379 to avoid the follow-on.\nThey went on to total 454 thanks to Rob Yates (115), Ed Barnard (82), Alex Davies (66) and Dan Mousley (63). Jack Carson took 4-92 for Sussex, a highly commendable effort in the excellent batting conditions.\nSussex have a significant lead but, in such conditions, a last-day declaration would have to be very carefully judged as a run-chase would heavily favour the batting side.\nAfter Warwickshire resumed on the third morning on 223-3, Sussex struck early.\nOllie Robinson needs to fire early this season to advance his case for an England recall and he has started strongly in this match with several hostile spells in conditions favouring the bat.\nHe removed the well-set Yates with the 21st ball of the day, a perfectly-pitched leg-cutter which was edged behind.\nRobinson then unfurled another fine ball which Mousley, still to score, edged to slip, but Tom Alsop grassed the catch. Less impressive was his next wicket-taking ball - a full toss which Ethan Bamber belted straight to mid-wicket.\nAt 252-5, still 127 short of the follow-on, Warwickshire needed steadying and Mousley and Barnard provided the necessary stability with a stand of 124 in 32 overs.\nMousley exploited his early reprieve to bat attractively but departed furious at himself for missing a sweep at Carson and falling lbw. Barnard struck seven fours and two sixes in an increasingly fluent innings before he fell lbw to a fine ball from Danny Lamb.\nKai Smith's punchy 27 ended when he lifted Carson to long-on and Michael Booth fell in similar fashion after Tazeem Ali edged Lamb to second slip.\nSussex were left with a session to bat and they spent it enhancing their lead in less than scintillating fashion for the loss of three wickets to the spinners. Yates added two wickets to his earlier century as he had Daniel Hughes (33) caught at slip and Tom Haines (34) lbw, half-forward.\nTom Clark offered no shot to a sharply turning ball from Tazeem Ali and was adjudged lbw. The degree of turn in that last dismissal offers some hope of purposeful cricket on Monday, but it will take some monumentally good or careless cricket for this match to yield a winner and a loser.", "url": "https://www.bbc.com/sport/cricket/articles/cz79erjpyq2o"}