{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-21 05:57:52", "date_modify": "2025-05-21 05:57:52", "date_publish": "2025-01-04 18:28:03", "description": "Bournemouth 1-0 Everton: Dyche's forwards going backwards", "filename": "sport_football_articles_cgrwvrk0pxjo_1747807072.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9172/live/dcf0e720-cac8-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgrwvrk0pxjo_1747807072.html", "title": "Bournemouth 1-0 Everton: Dyche's forwards going backwards", "title_page": "Bournemouth 1-0 Everton: Dyche's forwards going backwards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was a pointed comment from Sean Dyche as he mulled over Everton's lack of goalscoring threat in the wake of their defeat against Bournemouth at the Vitality Stadium.\n\"You look at goalscoring records before I was here,\" Dyche said. \"It's been an ongoing challenge.\"\nHard to argue with that assessment, but have Everton's forwards gone backwards?\nDominic Calvert-Lewin has two goals in 17 appearances. Beto has managed one in 12. Iliman Ndiaye and Dwight McNeil are joint top scorers with three apiece.\nThe Toffees have failed to score in a league-high 11 different Premier League matches this season.\nShocking numbers, if the truth be told. Dyche must be culpable to some degree.\nHow the Everton boss would dearly love the club's new owners to dig deep into their pockets and sign a striker before the transfer window closes.\nIf they do not the Blues are going to find it an almighty slog from now until the end of the season, attempting to eke out results.\nA backs-to-the-wall style, based on defensive organisation, can only take you so far.\nIt's certainly going to struggle to enthuse an Everton fanbase seemingly growing weary of the manager's style.", "url": "https://www.bbc.com/sport/football/articles/cgrwvrk0pxjo"}