{"authors": ["Tom Brown", "www.facebook.com"], "date_download": "2025-04-26 03:39:59", "date_modify": "2025-04-26 03:39:59", "date_publish": "2025-03-05 10:41:44", "description": "Lauren Price has achieved everything she has set her eyes on in sport - but is Natasha Jonas her toughest challenge yet?", "filename": "sport_boxing_articles_ce8yzl308yzo_1745638799.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b8a9/live/42eeeba0-f9ac-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_ce8yzl308yzo_1745638799.html", "title": "Natasha Jonas v Lauren Price: Wales' Lauren Price targets statement win", "title_page": "Natasha Jonas v Lauren Price: Wales' Lauren Price targets statement win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Lauren Price aims for something, she usually gets it.\nBecome a kickboxing world champion? Check.\nPlay football for Wales? Check.\nGo to the Olympics? Check. And she even won a gold medal.\nTurn pro and become world champion? Check.\nBecome unified world champion, fight in stadiums and become the best female boxer on the planet? Pending.\nBut you wouldn't put it past her.\nFriday night marks a major milestone in her latest quest.\nA fight against a two-weight world champion and an icon of women's boxing - Natasha Jonas.\nWin and she is dreaming of selling out stadiums back in Wales.\nLose and it would be the first setback of a near-perfect pro career to date.\nEight fights, eight wins, no rounds lost.\nBut the 30-year-old from Ystrad Mynach knows full well that Jonas is by far her biggest test yet.\n\"It's a little bit more pressure,\" she told BBC Sport Wales, \"but I've always got pressure on me. I think it's more of an exciting pressure.\n\"It's Wales v England; it's British rivalry. You've got two of not just the best in Britain but the best in the world going at it, belts on the line. It's exciting.\n\"As a boxer, that's the fight you get up for - the early mornings, the dieting, that's what excites you and keeps you going.\n\"I'm just looking forward to putting on a show and I think you'll see another level of my game come out.\"\nIn the build-up to Friday's all-female card at the Royal Albert Hall, Price says she has left no stone unturned.\nTraining under Rob McCracken at the home of GB Boxing in Sheffield, she's been sparring three times a week - sometimes up to three ten-minute rounds.\nHer physical prowess has never been in question, whatever the sport. Just ask her former Wales international football team-mates and coaches.\nBut Price is showing an increasing belief in her boxing ability and feels she has all the attributes needed to beat someone at the level of Natasha Jonas.\n\"I believe I'm technically very good - my skill, my speed,\" she continued.\n\"When you put my work ethic in as well, with my fitness and everything else, then it's going to be hard to be beaten.\n\"I think I've got a great ring IQ, I can read a fight. I'm Olympic champion. I became world champion within seven fights. So that's where the belief comes from.\n\"She's a very good fighter. She's got a great jab, good backhand, good lead hook. But I just think I'm better.\"\nWhilst Price has always had self-confidence, showing it so overtly in interviews is something of a new look.\nThis humble girl from the valleys would much rather do her talking with her gloves.\nBut in her relatively short time as a professional, she has learnt it has to come with the territory.\nLast year, despite winning her world titles in dominant style in Cardiff in May, was a frustrating one overall as she fought just once more - a routine win over Bexcy Mateus in December to set up this showdown with Jonas.\nShe had to be patient, but she finally got the fight she has always wanted.\nAnd her ambitions do not end here.\n\"[A win] opens up different opportunities and bigger fights,\" she said. \"Unification opportunities, maybe fighting in Saudi. A legacy not just from Wales but from Britain and the world.\n\"In my ninth [pro] fight, beating a name like Jonas and becoming unified world champion is massive - not just for Wales but for British boxing as well. I can follow in the footsteps of Claressa Shields and Katie Taylor. That's the legacy I want to create.\n\"I want to come back to Wales and I want to be boxing in stadiums.\"\nPrice calls herself 'The Lucky One' but nothing's ever come easy for her.\nRaised by her grandparents Derek and Linda from when she was three days old, she was always encouraged to reach for the stars, but if she fell short she would still land on the moon.\nThe latest hurdle, in Natasha Jonas, is arguably her biggest yet - and Price knows it.\nBut she always knows she has yet to fall short.", "url": "https://www.bbc.co.uk/sport/boxing/articles/ce8yzl308yzo"}