{"authors": ["Liam McLeod", "www.facebook.com"], "date_download": "2025-05-21 05:36:43", "date_modify": "2025-05-21 05:36:43", "date_publish": "2024-12-24 19:47:10", "description": "Liam McLeod: 'Aberdeen's excellent work in danger of unravelling'", "filename": "sport_articles_c75wv5n6zwqo_1747805803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc75/live/b325e960-c152-11ef-a2ca-e99d0c9a24e3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c75wv5n6zwqo_1747805803.html", "title": "'Aberdeen's excellent work in danger of unravelling'", "title_page": "Liam McLeod: 'Aberdeen's excellent work in danger of unravelling'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All Aberdeen's excellent work in the first quarter of the season is in danger of unravelling.\nHaving looked like a stick-on for third place – and perhaps even higher – until mid-November, the team's form has fallen off a cliff with only three points collected from the last 18 available.\nThey are joint bottom of the form table over the last six games with only goal difference in that time keeping Ross County below them. During this run, Celtic and Rangers have picked up 13 points more than the Dons, St Mirren nine more and Hibernian seven more.\nAnd the fixtures ahead are fraught with danger as Aberdeen prepare to visit Kilmarnock on Boxing Day and Dundee United on Sunday before a trip to Motherwell after County first foot them at the start of January. These are crucial times in Jimmy Thelin's first season at Pittodrie.\nThe goals shipped during Saturday's home defeat to Hibernian all came via awful mistakes and it has been a theme during this period. Errors that were going unpunished during the breathtaking opening to the campaign are being capitalised on now and a lot of it can be traced back to the League Cup semi-final humbling by Celtic at the start of last month.\nThe three goals Aberdeen conceded in that 11-minute spell at the end of the first half at Hampden were all avoidable. As were the two at St Mirren. As was Rocky Bushiri's late equaliser for Hibs at Easter Road. Nicky Devlin's own goal equaliser for Hearts at Tynecastle, Reo Hatate's winner for Celtic, Makenzie Kirk's opener for St Johnstone at Pittodrie. All were cheap concessions and the centre of the defence in particular appears to need major surgery.\nElie Youan's quickfire leveller for Hibs at the weekend set the tone for what followed. After what had been a promising start by the home side, Slobodan Rubezic's woeful attempt at a clearance for that one summed up the Dons' form which has also seen them record just one clean sheet in their last 13 Premiership fixtures with 11 conceded in this sequence of six.\nAberdeen are still well placed to have a successful campaign, and injuries haven't helped them, but there clearly needs to be much more work done in the winter transfer window than any Dons fan would have envisaged when they left Pittodrie after the stirring victory over Rangers at the end of October if they are to avoid wasting their spectacular start.", "url": "https://www.bbc.com/sport/articles/c75wv5n6zwqo"}