{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:49:35", "date_modify": "2025-04-26 06:49:35", "date_publish": "2025-03-01 09:38:56", "description": "Australia and South Africa will travel to Dubai before the Champions Trophy semi-finals, despite not knowing if they will play there or in Pakistan.", "filename": "sport_cricket_articles_c4ge929dengo_1745650175.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d685/live/51506470-f67e-11ef-8cef-79e00b1a31a3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c4ge929dengo_1745650175.html", "title": "Champions Trophy 2025: Australia and South Africa will travel to Dubai ahead of potential semi-final", "title_page": "Champions Trophy 2025: Australia and South Africa will travel to Dubai ahead of potential semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Australia and South Africa will travel to Dubai before the Champions Trophy semi-finals, despite not knowing if they will play there or in Pakistan.\nDubai will host the first semi-final on Tuesday with the second match played in Lahore, Pakistan, a day later.\nIndia, who are guaranteed to progress from Group A, are playing all of their matches in Dubai after opting not to travel to Pakistan.\nGroup B concludes with South Africa's match against England on Saturday but neither the Proteas or Australia will know the venue for their semi-final until after the conclusion of India's match against New Zealand on Sunday.\nWere they to wait until Monday and only travel when the fixtures were confirmed, that would rule out the possibility of training in Dubai – where India will have played all three group matches.\nIt raises the prospect of Australia taking the three-hour flight from Lahore to Dubai on Saturday, only to have to fly back on Monday if they do not meet India.\nSimilarly, South Africa will fly to Dubai in the early hours of Sunday and could return to Pakistan 24 hours later if they do not have to face India.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c4ge929dengo"}