{"authors": ["Andrew Petrie", "www.facebook.com"], "date_download": "2025-05-21 05:38:12", "date_modify": "2025-05-21 05:38:12", "date_publish": "2025-01-31 16:21:10", "description": "Elie Youan 'still a Hibs player' for now - David Gray", "filename": "sport_articles_cwy7wgyppd4o_1747805892.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79c1/live/a1411f50-dfe1-11ef-9e55-bfd035967447.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwy7wgyppd4o_1747805892.html", "title": "Youan 'still a Hibs player' for now", "title_page": "Elie Youan 'still a Hibs player' for now - David Gray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Elie Youan is \"still a Hibs player\" for now, says manager David Gray, as speculation swirls around the French attacker.\nReports, external claim Blackburn Rovers have had a bid rejected for the 25-year-old and are weighing up whether to increase their offer before Monday's (23:00 GMT) transfer deadline.\nFrench forward Youan, who joined Hibs in summer 2022, was subject of an offer from a Ligue 1 club last May.\n\"Elie is someone that, every window, attracts attention and speculation purely because of his attributes, his qualities,\" Gray said.\n\"There is a lot of speculation around Elie, but at this moment in time he's still a Hibs player and until that changes, there's no real news on it.\n\"He's injured at the moment, he needs to keep working hard to get himself back on the training pitch as quick as he can.\n\"If he's still here [after the deadline], then brilliant. But at this point, if he's not and something comes up that we think is right for everybody involved, then we'll have to be ready to react in whatever way we think makes the club better.\"\nJanuary has been a quiet transfer window for Hibs so far, with only Gambia midfielder Alasana Manneh arriving.\nThere have also only been two departures so far - midfielders Nohan Kenneh (on loan) and Jake Doyle-Hayes - despite the large squad size.\n\"Naturally, the closer you get towards deadline, there's a lot of things that start to happen,\" Gray added. \"The domino effect of people moving on at different levels and how that filters through. As I've always said, we need to be ready.\n\"If something comes up that we think can make us better, we'll definitely look to try and do that. But at the same time, if anything comes towards us, we've got quite a bloated squad as well.\n\"We need to be ready to react to that. The work's been going on for a number of weeks to make sure that we certainly finish the window in a stronger position than we started it.\"\nManneh, 26, arrived from Odense in Denmark having previously spent three years in Barcelona's academy.\n\"He's not available this weekend,\" Gray said. \"We're still waiting on the admin side to get visas and international clearance and things, which we're hoping to try and get through today.\n\"Regardless if that does come through later today, he won't be available for the weekend but he'll join us early next week, worst case scenario, which is brilliant.\"", "url": "https://www.bbc.com/sport/articles/cwy7wgyppd4o"}