{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:39:09", "date_modify": "2025-05-19 15:39:09", "date_publish": "2017-07-27 06:42:58", "description": "He says he prizes \"equilibrium\" above all and shuns the spotlight - his manager says he loves \"stripping off and oiling up\". BBC Sport assesses the rise of Adam Peaty, swimming's grounded showman.", "filename": "sport_swimming_40735191_1747669149.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11EDF/production/_97093437_peaty1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_swimming_40735191_1747669149.html", "title": "Adam Peaty: What next for world champion, record-breaker, patriot and poster boy?", "title_page": "Adam Peaty: What next for world champion, record-breaker, patriot and poster boy? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the time-honoured phrase, Britain's Adam Peaty said he had experienced a \"rollercoaster of emotions\" in winning two world titles and breaking his own world record - twice - at the World Aquatic Championships in Hungary.\nBut currently it's difficult to see what the downs are.\nThe 22-year-old Olympic champion has retained both his 50m and 100m breaststroke titles in Budapest.\nHe also broke his own 50m world record twice on Tuesday, once in the heats and again in the semi-final.\nHe did miss out on a medal in the 4x100m mixed medley relay final, but can still add to his tally in Sunday's 4x100m men's medley relay.\nThe two medals already secured in Budapest mean Peaty, who won gold in the 100m breaststroke in Rio, now has five world golds in his career, more than any other Briton.\n\"He is the poster boy for swimming across the world, not just in Britain,\" said double Olympic champion Rebecca Adlington after Wednesday's final.\nPeaty now holds the Olympic, world, European and Commonwealth 100m breaststroke titles and the world record time; he also holds the world and European 50m breaststroke titles, and world record time - the 50m breaststroke is not an Olympic event.\nHis global domination began at the 2014 Commonwealth Games in Glasgow and within three years he has won 16 major titles.\nHe said: \"My main aim when I won Commonwealths, even though I was a young, skinny kid, was to try to take on the world - 'Can I win all the grand slams in two years?'\n\"I didn't even think about world records. I just wanted those four titles within two years. Now I've done that.\n\"I've had an extra year now, got 16 international gold medals with all the world records.\"\nBBC Sport's Olympic sports reporter Nick Hope in Budapest\nAdam Peaty is undeniably Britain's most dominant male swimmer of the post-war era.\nDuncan Goodhew (1980) and Adrian Moorhouse (1988) may each have won Olympic gold medals, but Peaty also has a silver to his name from the 4x100m medley relay in Rio - and no-one from Great Britain comes close to his five world titles.\nEven on the women's side, double Olympic champion Rebecca Adlington claimed just one world title during her impressive career.\nInternationally Peaty has a long way to go before matching the likes of American Michael Phelps' record tally of 26 world titles, although he is halfway to joining legends Grant Hackett and Ryan Lochte on four straight world golds in the same event.\nAustralia's Hackett won 1500m freestyle at four World Championships between 1998 and 2005, while American Lochte was unbeaten in the 200m individual medley between 2009 and 2015.\nThe City of Derby and Loughborough swimmer was once so afraid of water his mum Caroline struggled to give him a bath.\n\"He didn't like the water when he was younger,\" said grandmother Mavis Williams. \"He used to scream every time he got in the bath. And when his mum used to take him to the pool he used to scream there.\n\"Then one day Caroline's friend took him and it paid off. And he's been swimming ever since.\"\nHe has been coached by three-time Olympian Melanie Marshall since he was 14.\nHis breakthrough came in 2013 when he won 50m breaststroke silver and 100m breaststroke bronze at the ASA National Youth Championships in Sheffield before ducking under a minute in the 100m breaststroke for the first time to win gold.\nA first senior championship appearance followed at the European Short Course Championships in Denmark that year and then came his first major medal at the Commonwealth Games.\nPeaty's goal is to become the first swimmer to go under 57 seconds over 100m and he is getting closer, setting the world record of 57.13 at the Rio Olympics last year.\nHe clocked 57.47 in the final in Budapest on Monday and described himself as \"over the moon\" with the second fastest time in history.\n\"It gives me confidence that I can one day go 56. That dream now is burning more alive than ever.\"\n\"It is so doable,\" said former world champion Karen Pickering.\n\"You have seen how far he is able to knock the time down on the 50m breaststroke. He quite often goes out in a similar time in the 100m so he will be able to get to halfway dead on 26 seconds. That would man he would only need to come back in 30 seconds.\n\"I love the fact he is looking ahead, looking forward to these targets - he is not worried about who is behind him.\"\nBBC Sport's Olympic sports reporter Nick Hope\nWith the tattoos, photo-shoots, expensive watches and talk of his love for fast cars, Peaty could be in danger of appearing arrogant, but he is actually a very grounded man who happens to be going through a golden period of his career of the sort sprinter Usain Bolt enjoyed in 2008-2009.\nLike Bolt, Peaty has 'showman' like moments; like Bolt, he is able to talk freely about his targets because he is so at ease with himself and his abilities.\nBut his family and his coach made sure the young Adam Peaty remained humble and thankful for the sacrifices that others had made to help him.\nSo in the same breath as discussing 'Project 56' - his plan to become the first swimmer to go under 57 seconds over 100m - he is emphasising how it's important for him to go back and visit local schools in his community to inspire future swimmers.\nAs to 'Project 56', few people - including the man himself - actually thought it would come this year. It will come before Toyko 2020, of that I'm sure - but whether Peaty can ever lower his 50m time again is a big question.\nHe was genuinely stunned about swimming 25.95 in the semi-finals and looking at the race it is difficult to see where improvements can actually be made. As it is a non-Olympic event future challenges may come over 200m should he decide to tackle that distance in the near future.\nIt's strongly believed he could 'test out' the event at next year's Commonwealth Games and while that would improve his medal chances at Tokyo 2020 - it could be to the detriment of his out-and-out speed. It will be fascinating to see how he and coach Mel Marshall plan to combine all of the challenges over the coming years.", "url": "https://www.bbc.com/sport/swimming/40735191"}