{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:24:14", "date_modify": "2025-05-21 05:24:14", "date_publish": "2025-04-03 14:44:09", "description": "Bristol City midfielder Mark Sykes says the team want to have something to play for as they continue their chase for a play-off place.", "filename": "sport_football_articles_crldn6rz4x4o_1747805054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/09c6/live/4bda7700-1097-11f0-b6ff-f7b4e8c1b1b9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crldn6rz4x4o_1747805054.html", "title": "Mark Sykes: Bristol City midfielder says team want something to play for", "title_page": "Mark Sykes: Bristol City midfielder says team want something to play for - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol City midfielder Mark Sykes insists the Robins are desperate to have something to play for at the end of the season as they continue their chase for a play-off place.\nThe eighth-placed Robins are level on points with West Bromwich Albion in sixth and two points behind Coventry in fifth, despite last weekend's loss at Burnley.\nThey take on Watford on Saturday - a club one place and four points below them - in their first of seven games remaining.\n\"We've given ourselves a right chance of being up there in the mix with seven to go, of course we're allowed to be excited,\" Sykes told BBC Radio Bristol.\n\"That's what we play football for to be in amongst it. We don't want to, come the end of the season or with a few games left, not be playing for anything, so we've got to put things right this weekend and I think we're in a good position to do so.\"\nSykes, whose contract with the club was extended through to the end of 2026 in February, joined Bristol City in 2022.\n\"There's been a few mid-table finishes since I've signed, this year's a bit different but that's a good thing,\" Sykes said.\n\"We want to be up there - the tough games are coming, but we've got to beat the teams around us definitely and see where we end up.\"", "url": "https://www.bbc.com/sport/football/articles/crldn6rz4x4o"}