{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:20", "date_modify": "2025-05-21 07:27:20", "date_publish": "2025-03-28 13:45:38", "description": "Leeds United striker Joel Piroe says the team is less reliant on individuals this season as they push for promotion to the Premier League.", "filename": "sport_football_articles_cly4yw3l727o_1747812440.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a4f/live/7527efa0-0bd0-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly4yw3l727o_1747812440.html", "title": "Joel Piroe: 'Dangerous' Leeds United more of a team this season", "title_page": "Joel Piroe: 'Dangerous' Leeds United more of a team this season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leeds United striker Joel Piroe has said he believes the team is less reliant on individuals this season.\nThe Whites, who host Piroe's former club Swansea on Saturday (15:00 GMT), are top of the Championship with eight games to go.\nThe Dutchman, the division's second-top scorer behind Norwich's Borja Sainz with 15, was part of the Leeds side that finished third last season before losing to Southampton in the play-off final.\nKey forwards Crysencio Summerville and Georginio Rutter, and teenage midfielder Archie Gray, were sold to West Ham, Brighton and Tottenham respectively in the summer.\n\"I think last season we were a bit more dependent on the form on the day of the players, and I think this year we feel more like a team out there,\" he told BBC Radio Leeds.\n\"Everyone is dangerous and we have better playing patterns if I'm honest.\n\"I enjoyed last season as well but I think this season we are even more dangerous.\"\nPiroe said he turned down the opportunity play for Suriname in the international break because he wants to put all his energy into winning promotion to the Premier League.\nThe 25-year-old is eligible to play for the South American country through his father, who was born there.\n\"At the minute I am completely focused on Leeds and I just want to reach the Premier League with them,\" he said.\n\"Afterwards I will think about an international career because at the minute with this many games you just feel like you need the moments to rest as well.\"\nHe added: \"It won't be easy for us and we know that. I think it's good to have your head straight on one goal.\n\"We all know the position we are in and that we have a tough schedule, but everyone is looking forward to it and wants to avoid the play-offs.\"\nHe said this year's Leeds squad is driven by last season's near miss as they aim to win promotion at the second attempt.\nDaniel Farke's side are level on points with second-placed Sheffield United, and two ahead of third-placed Burnley.\n\"We have known defeat and you just want to come back and show you can do it,\" said Piroe.\n\"Everything that happened last season was more than enough motivation.\"", "url": "https://www.bbc.com/sport/football/articles/cly4yw3l727o"}