{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:11", "date_modify": "2025-05-21 07:48:11", "date_publish": "2025-05-18 18:24:25", "description": "Durham make their highest first-class score of 664 to set up a victory chance against Nottinghamshire in the County Championship.", "filename": "sport_cricket_articles_ckgq81nxe2no_1747813691.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a514/live/2664cf20-340f-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckgq81nxe2no_1747813691.html", "title": "Durham post record 664 against Notts", "title_page": "County Championship: Durham post record 664 against Notts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Centuries from Emilio Gay, Ollie Robinson and Graham Clark put Durham in a strong position on a record-breaking day in their County Championship match with Nottinghamshire.\nGay and Robinson dominated the morning session as they pushed Durham beyond Nottinghamshire's total, with Gay notching up a second consecutive home century.\nRobinson was then joined by Clark in the afternoon and the pair took the game to the Nottinghamshire bowling attack, with Clark picking up a second consecutive century and Robinson looked back to his best as he got his first hundred of the season.\nThe hosts kept on going into the evening and broke the county's record for the highest first-class total, but there was a bright spot for Nottinghamshire as Liam Patterson-White picked up his fifth first-class five-wicket haul and they eventually bowled Durham out for 664.\nNottinghamshire reached close on 67-1, 190 runs behind the hosts.\nClark has been a consistent performer for Durham this season, impressing with the bat on several occasions already. On the other hand, Gay and Robinson both had tricky starts, but their class showed to give their side a chance of a vital win on day four.\nMeanwhile, Nottinghamshire will be thinking about what could have been as Joe Clarke dropped both Gay and Robinson in the slip cordon in the early stages of their knocks.\nResuming on 320-4, Gay and Robinson were the unbeaten pair in place and they were looking to get Durham into a lead as soon as possible. Robinson picked up where he left off as he played a lovely punch for four early on, but he was dropped by Clarke on 35 as the Durham man edged a Mohammad Abbas delivery but the slip fielder dropped one for the second time in the innings.\nGay played a beautiful shot through midwicket for four, while Robinson reached his half-century from 75 balls.\nGay brought up his second century of the season in style as he cut a Rob Lord delivery to the boundary, while Robinson smashed a Patterson-White delivery down the ground for six.\nGay's excellent innings came to an end as Patterson-White bowled him for 104 while attempting a reverse sweep, but that brought the in-form Clark to the crease and he smashed Lyndon James for two boundaries in an over to take his side into the lead. Clark passed fifty in quick time, with it coming from 56 deliveries, and another milestone came soon after as Robinson got his century from 141 balls with a lovely boundary through third.\nRobinson then made the most of a short ball from Patterson-White as he heaved one over the leg-side boundary for six, but the Durham keeper's fabulous innings came to an end at 141 when a leading edge from a James delivery was caught by Freddie McCann at backward point.\nWickets came like buses for the visitors as England's Brydon Carse was bowled by the resilient Patterson-White without troubling the scorers.\nClark was agonisingly left on 99 not out at tea, but he reached his second century of the season in the first over after tea and he took his side over the 600 mark. The runs continued to flow for Clark and George Drissell, but Clark handed Patterson-White a fourth wicket of the day as he chopped on for 121.\nBut they kept on going, with Ben Raine getting the single that gave Durham their record first-class total, but he became Patterson-White's fifth victim when he departed for 10. Drissell smashed one down the ground for six as the lead stretched past 250, but the Durham innings came to an end when Codi Yusuf was run out, with the lead at 257.\nFirst innings double centurion Haseeb Hameed picked up an early boundary as the league leaders kicked off their second innings, while Ben Slater got off the mark with a nice shot through the covers.\nJust before close, Carse got the vital wicket of Hameed for 13 with a beauty which dismantled the Nottinghamshire captain's off stump, but Slater, who has looked in good touch, and nightwatcher Rob Lord saw Nottinghamshire to close without further loss.", "url": "https://www.bbc.com/sport/cricket/articles/ckgq81nxe2no"}