{"authors": ["Tyrese King", "www.facebook.com"], "date_download": "2025-04-26 06:53:08", "date_modify": "2025-04-26 06:53:08", "date_publish": "2025-02-28 16:45:28", "description": "Eight-time Men's Ballon d'Or winner Lionel Messi says he \"didn't enjoy\" playing for French club Paris St-Germain during his two-year spell and was \"unhappy.\"", "filename": "sport_football_articles_c9dej12zezno_1745650388.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5c38/live/16192430-f5ef-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9dej12zezno_1745650388.html", "title": "Lionel Messi: Argentine icon 'didn't enjoy' time at PSG", "title_page": "Lionel Messi: Argentine icon 'didn't enjoy' time at PSG - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Lionel Messi says he \"didn't enjoy\" playing for Paris St-Germain during his two-year spell at the club.\nThe 37-year-old joined the French side in 2021 after 21 years at Barcelona.\nMessi scored 32 goals and provided 35 assists in 76 appearances before leaving two years ago for Inter Miami, co-owned by David Beckham, in Major League Soccer.\nIn an interview with Apple Music's Zane Lowe, the eight-time Ballon d'Or winner said: \"Coming to play for Inter Miami was an opportunity and the way things developed during my last years in Paris, although it was a decision that I had to make on the go, because I had to leave from Barcelona, I went through two years which I didn't enjoy.\n\"I wasn't happy on a daily basis, with the training, the matches. I had a hard time adapting to all that. I felt called to come to Inter [Miami] because it's a club that's growing, very new, with few years as a club.\"\nPSG chairman Nasser Al-Khelaifi criticised Messi, external for lacking \"respect\" for the French club when he left them.\nAt the time, the Argentine said his relationship with PSG fans \"fractured\" after a \"significant\" number of supporters started to treat him differently.\nSince joining Inter Miami, Messi has wanted to help both the club and MLS continue to \"grow\", contributing 36 goals and 20 assists in 42 appearances.\nHe is also looking forward to Miami hosting the 2025 Fifa Club World Cup, which will feature PSG as well as Premier League sides Manchester City and Chelsea.\n\"I think this is very important for the club, especially, to participate for the first time in a World Cup that will take place in the country and for the MLS to have two teams is a wonderful thing,\" added Messi.\n\"Everything that's happening creates an opportunity for the MLS to keep growing in football, as a league. And for other players to have the opportunity to come and keep growing.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c9dej12zezno"}