{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:34:50", "date_modify": "2025-05-20 14:34:50", "date_publish": "2023-07-25 13:13:33", "description": "Para sprinter Kevin Santos says smashing the British 100m record made up for the 'disappointment' of his recent World bronze medal.", "filename": "sport_disability-sport_66303834_1747751690.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12B88/production/_130408667_gettyimages-1247573165.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66303834_1747751690.html", "title": "Kevin Santos: Para sprinter says new GB record makes up for World bronze 'disappointment'", "title_page": "Kevin Santos: Para sprinter says new GB record makes up for World bronze 'disappointment' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Para sprinter Kevin Santos says smashing the British 100m record helped erase the 'disappointment' of his recent World bronze medal run.\nThe 21-year-old from Norfolk clocked 10.78 seconds during the Diamond League meeting at London Stadium.\nIt also knocked 0.05 seconds off his previous personal best set in May.\n\"I just wanted to go out there and perform a better race, especially in front of a big crowd,\" Santos told BBC Radio Norfolk.\nA 50,000 sell-out watched Sunday's event and he believes such experiences will only stand him in good stead, having switched back to the track from competing in jiu-jitsu events.\n\"It's good to be in front of these crowds and get used to big stadiums, and going out there to perform.\n\"It was a little bit overwhelming at first and you don't want to have a bad performance out there. I just focused on my own race and executing the race I wanted to put out there,\" he said.\n\"When I competed in my first Diamond League in 2021 in Gateshead, it was the biggest competition I had done and being on that start line, I wasn't used to that feeling and couldn't control the nerves. I remember being on the start line shaking so much.\"\nHis record run came just days after he finished third behind two Brazilians in the T47 100m final at the World Para Athletics Championships in Paris.\nIt was a tremendous effort after problems with a quad strain and a stomach bug during the build-up.\nSantos said: \"I'm proud of what I achieved. I knew coming in there that I had a medal potential.\"\nBut he added: \"I made a good start and got to about 30m left and I saw the person on my left start to catch up on me. This is where racing experience comes into play at these high levels.\n\"I lost a bit of my composure and I kind of gave up. I said to myself in the last 20m 'I'm not going to medal here' and I threw my form out of the window.\n\"Probably the worst thing you could do in a final is throw your form out of the window and just try to survive. But I'll learn from that for next time.\"", "url": "https://www.bbc.com/sport/disability-sport/66303834"}