{"authors": ["Gareth Griffiths", "www.facebook.com"], "date_download": "2025-05-20 12:21:17", "date_modify": "2025-05-20 12:21:17", "date_publish": "2023-08-04 06:06:03", "description": "It is World Cup audition time for Wales' hopefuls against England, especially the five potential new caps in Cardiff on Saturday.", "filename": "sport_rugby-union_66385702_1747743677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/163E/production/_130649650_bbc-sport-index-imagery-4-split-images-gradient-7b1b413a-8796-44d9-bb4f-5849de939b65.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66385702_1747743677.html", "title": "Wales v England: New caps have chance to impress for World Cup", "title_page": "Wales v England: New caps have chance to impress for World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is World Cup audition time for five Wales' hopefuls against England as they aim to prove to head coach Warren Gatland they should be in France next month.\nCardiff props Corey Domachowski and Keiron Assiratti plus Gloucester centre Max Llewellyn are set to make their debuts from the start on Saturday.\nThere could also be two more new Wales caps off the bench in Taine Plumtree and ex-England prop Henry Thomas, while fly-half Sam Costelow will make his first international start.\nGatland's current squad of 48 and will be reduced to 33 when he names his World Cup party in late August.\nAfter the weekend's game, Wales return to Twickenham on 12 August before completing their preparations against world champions South Africa seven days later.\nWales open their pool campaign against Fiji in Bordeaux on 10 September before further group games against Portugal, Australia and Georgia.\nThe new players will have an early chance to impress and book their journey to France.\nDomachowski and Assiratti have come through the ranks together, both playing for the Rhondda Schools Under-16s team that won the Dewar Shield in 2012 at the Principality Stadium.\nThe Cardiff duo will win their first caps at the same ground against England after impressing for Cardiff in the second half of the season.\nDomachowski, who signed a new contract this week, has a fascinating background having learned his Polish great-grandfather had survived the horrors of Auschwitz during World War Two.\nStefan Domachowski escaped from the concentration camp and eventually moved to Wales, settling in Pencoed and working as a miner.\nBack to the present day and with fellow Cardiff loose-head Rhys Carre having been released from the squad and British and Irish Lions Wyn Jones not included, Domachowski has a chance to book his World Cup place as he battles with Nicky Smith, Kemsley Mathias and Gareth Thomas for the three loose-head spots.\nAssiratti is reaping the rewards for a breakthrough season where he started the campaign playing for the Cardiff RFC semi-professional side and finished being first choice tight-head.\n\"Those two were impressive for their club at the end of the season,\" said Gatland.\n\"They had big games for Cardiff against Sale and in Judgement Day against Ospreys.\n\"They know each other pretty well and have got a solid hooker in Ryan Elias between the two young boys.\"\nGatland says it was important to play some new caps at home as he decided to name the team a day early.\n\"The new caps playing at home and making that experience a bit easier was a part of the selection,\" said Gatland.\n\"They've got a lot of family and friends coming. Corey Domachowski has got a bus of 40 I think. That's pretty exciting.\n\"That's why I named the team early, so they could get all the congratulations and texts. Their phones got pretty hot. They're excited about that. It's a great opportunity.\n\"There's some great competition in the squad. There'll be some tough calls. When we do get the chance to name the 33, they'll have this chance to put down a marker.\"\nLlewellyn, the son of former Wales lock Gareth, will partner George North in a huge midfield, with North 6ft 4in and more than 17 stone, while Llewellyn stands 6ft 5in and tips the scales at 16-and-a-half stone.\nHe impressed for Cardiff this season but will join Gloucester for the 2023-24 campaign and is battling for a midfield spot against Nick Tompkins, Mason Grady, Joe Roberts and Johnny Williams.\n\"There's some competition there in midfield,\" said Gatland.\n\"We're looking at the make-up of the squad and it's probably going to be a 19-14 forwards and backs split so you probably need someone in midfield who can cover the back three.\n\"Max has impressed in training with the lines he's running. I've been pleased with how he's started to step up and how vocal he's been.\n\"That's one of the big focus areas for this squad, how important your voice is, particularly under fatigue. I've seen a huge improvement in him and he's built confidence.\n\"It's not just the physical side. He's also a good passer of the ball and can hopefully put us outside in space.\"\nScarlets fly-half Sam Costelow will make his first start for Wales having made two replacement appearances in November 2022.\nHe partners Scarlets scrum-half Gareth Davies as he is given the first chance to shine, with Dan Biggar on the bench and Gareth Anscombe not included.\n\"He gets the ball through his hands really well and we've been impressed with his ability to the line when he becomes a running threat,\" said Gatland.\n\"He's brave and doesn't take a backwards step defensively. He's spoken well when he presents to the group and shown some leadership skills.\n\"He's doing a lot of work with (Wales skills coach) Neil Jenkins. When I saw him, I thought kicking was the weakest part of his game. He's working hard on that. Still not perfect but there's been a huge improvement\n\"We're excited about him. We've put him with Gareth (scrum-half Davies) so there's familiarity, hopefully that makes it easier for him.\"", "url": "https://www.bbc.com/sport/rugby-union/66385702"}