{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:14:19", "date_modify": "2025-05-21 07:14:19", "date_publish": "2025-01-22 11:46:44", "description": "Four-time World Rally Championship runner-up Elfyn Evans believes another change to the points system in 2025 brings back \"the value of a win\".", "filename": "sport_motorsport_articles_cjexvn3lpxyo_1747811659.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0ad5/live/832166b0-d8b1-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_motorsport_articles_cjexvn3lpxyo_1747811659.html", "title": "World Rally Championship: Elfyn Evans welcomes 2025 points revamp", "title_page": "World Rally Championship: Elfyn Evans welcomes 2025 points revamp - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Four-time World Rally Championship (WRC) runner-up Elfyn Evans believes another change to the points system in 2025 brings back \"the value of a win\".\nHaving given more weighting to Sunday performances in 2024, the changed rules increase the likelihood of the overall winner of a rally gaining the most points.\nThe new campaign begins in Monte Carlo from 23-26 January, also without the hybrid engines run for the last three years, though the Welshman says they \"didn't make a huge difference\" to drivers.\nEvans, second in four of the last five years, will also be rejoined full-time in the Toyota Gazoo Racing team by 2022 and 2023 champion Kalle Rovanpera, who sat out most of 2024.\nThe 36-year-old Welshman dismisses suggestions he felt under greater pressure to deliver last year.\n\"It didn't change a lot for me in the end, my goals still remain the same,\" said Evans, who finished second to Hyundai's Thierry Neuville in 2024.\n\"The team will be strong this year. We've got a selection of five very good drivers within the team, but naturally my personal goals don't really change whatever Kal is doing.\"\nFinland's Rovanperra, 24, started only seven of last year's 13 rallies, winning four of them. He finished seventh overall.\nEvans only victory came at the final round in Japan, but he took five second spots, a third and two fourth places.\nHowever, under the 2024 points system - which awarded 18 points for the leader at the end of Saturday's stage and a further 12 for Sunday running - the Welshman led the points-haul at three rallies.\nEvans collected more than the winners at Rally Sweden and Rally of Central Europe. Yet he only banked the same points as Toyota team-mate Sebastien Ogier despite winning November's final event in Japan.\nIn 2025 Saturday points are gone, replaced by 25 points down to 1 for the overall classification at the rally finish.\nSunday points have shrunk from 7-1 for the top seven, down to 5-1 for the leading five performers. The final power-stage bonuses remain, so the maximum possible haul rises to 35.\n\"It's definitely brought back the value of a win, which I think was really important, because I think that was lost last year,\" said Evans.\n\"However, it still leaves quite a big opportunity to score on Sunday with 10 points available and it still rewards someone who, in a way, has a bad weekend.\n\"I think the system is an improvement over what we had last year, just maybe a little bit too much emphasis still on Sunday, but that's how it is and it's the same for everyone.\"\nNeuville's title was the 36-year-old Belgian's first after 15 years of trying, denying Evans, who started the season as a leading favourite.\nThe Welsh driver admits 2024 was a disappointment.\n\"Yeah, of course, the goal is always to win,\" said Evans. \"Naturally, when that doesn't happen, it's frustrating.\n\"But in fairness we didn't have the best season. Last year there was a patch mid-season where it really cost us in terms of the championship race. So even to finish second by the end of the year was looking like a bit of a long shot.\n\"So yeah, naturally not happy to come second, but still we managed to finish the year in strong form so that's quite important.\"\nEvans is hoping to pick-up where he left off in Nagoya to launch the new season with his first ever victory at Rallye Monte-Carlo.\n\"I think Monte Carlo is one of, if not the most famous event on the WRC calendar and naturally everybody wants their name on the trophy,\" he said.\n\"We've come quite close a few times here, so naturally the target will be to win.\n\"But we also know how much of a challenge and how many things have to go right to be successful here in Monte.\"\nMonte Carlo is the first round of an expanded 14-event calendar.\nRally Islas Canarias in April has been added to the schedule along with August's Rally de Paraguay and Rally Saudi Arabia, which will be the concluding event in November.", "url": "https://www.bbc.com/sport/motorsport/articles/cjexvn3lpxyo"}