{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-19 14:42:46", "date_modify": "2025-05-19 14:42:46", "date_publish": "2017-08-07 17:50:37", "description": "Who's had most red cards? Worst season for managerial changes? First all-foreign starting XI? It's the story of the Premier League in numbers.", "filename": "sport_football_40704646_1747665766.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A9CE/production/_97207434_pic1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40704646_1747665766.html", "title": "Premier League is 25 years old: Facts and figures behind the first quarter-century", "title_page": "Premier League is 25 years old: Facts and figures behind the first quarter-century - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thirteen players from outside the UK and Ireland, a crowd of 20,699 at Chelsea, defeats for Manchester United and Arsenal, wins for Coventry City and Sheffield United.\nThe Premier League landscape looks very different to the one on the opening weekend a quarter of a century ago, which also featured Oldham Athletic and Wimbledon.\nAfter 9,746 games and 25,769 goals involving 47 teams across 25 memorable years, BBC Sport crunches the numbers and brings you the story of England's top-flight in facts and figures.\nThe Premier League battlefield is littered with managerial casualties yet it was all so very different back in 1992.\nThere was one sacking during the inaugural season - Chelsea's Ian Porterfield losing his job 29 games into the 42-game campaign on 15 February 1993.\nIt didn't take long for that figure to rise sharply.\nBetween August 1994 and August 1995 there were 15 managerial changes alone - including eight sackings.\nWhy the rapid increase?\nAfter three 42-game campaigns featuring 22 clubs, England's top flight, already awash with television money, was about to be slimmed down to a 38-game format with 20 teams.\nFor the only time in Premier League history, four teams - instead of three - were facing relegation in 1994-95.\nCasualties of the reshaping included John Deehan, who resigned at struggling Norwich with five matches left, while Alan Smith departed soon after Crystal Palace's relegation was confirmed. Leicester City and Ipswich Town also lost their Premier League status.\nOver the years, the more lucrative the Premier League has become the more knee-jerk reactions have been in boardrooms. The league is a minefield for managers - and not only those at clubs trying to avoid the drop.\nRoberto Mancini was sacked as Manchester City manager in May 2013 - a year to the day after winning the Premier League, while Claudio Ranieri was made redundant nine months after steering Leicester City to the 2015-16 title.\nChelsea were even less patient in December 2015 when they sacked Jose Mourinho seven months after winning the league.\nBy the end of 2016-17, the average number of managerial changes each season stood at 8.84.\nThat figure looks likely to rise further. In only two of the past 10 seasons has the number of changes failed to hit double digits.\nA total of 221 different managers have taken charge of at least one Premier League game, 154 permanent and 67 caretakers.\nOf the 242 players that started 11 matches on the opening weekend of the 1992-92 season, 13 were not British or Irish.\nThe number of overseas players who started 10 games on the last day of the 2016-17 season was 112 out of 220.\nOver 25 years, a total of 3,835 players have played at least one Premier League game while 113 different nations - including the Seychelles, Pakistan and Guinea-Bissau - have been represented.\nAt the beginning there was a strong Scandinavian influence. Eight players from Norway, including Liverpool full-back Stig Inge Bjornebye, external and Blackburn defender Henning Berg, featured in the inaugural season. There were a further four from Denmark and three from Sweden.\nIn December 1995, the Bosman ruling was introduced, allowing players to leave as soon as their contracts expired.\nBy the end of 1997-98, there were significant increases in the number of players (compared with 1995-96) from countries including France (3 to 17) and Italy (1-14).\nMeanwhile, Gianluca Vialli's Chelsea made history against Southampton on 26 December 1999 by fielding the first non-British starting XI, external - Ed de Goey (Netherlands), Dan Petrescu (Romania), Emerson Thome (Brazil), Frank Leboeuf (France), Celestine Babayaro (Nigeria), Albert Ferrer (Spain), Didier Deschamps (France), Gus Poyet (Uruguay), Roberto di Matteo (Italy), Gabriele Ambrosetti (Italy), Tore Andre Flo (Norway).\nFrench players have consistently dominated the season-by-season overseas players' table - peaking at 44 in 2003-04 - but there are examples of significant shifts in trends.\nThe first Spaniard in the Premier League? Midfielder Nayim, who had already been at Tottenham four years, scored three times in 18 appearances in 1992-93. Twenty years later the number of Spanish players had swollen to 28 - an increase of more than 50% from 2006-07 - after the country's success at the 2010 World Cup and Euro 2012.\nThere was another signalling of a change in transfer trends when Oscar moved directly to England from Brazil in July 2012, joining Chelsea.\nBrazilian talent had been limited on the Premier League stage - most players opting for Spain or Italy where it is seen as less physically demanding, fixture calendars are less congested and the climate better. There were exceptions, Juninho went straight from Sao Paulo to Middlesbrough, external in 1995.\nLast season Philippe Coutinho became the highest-scoring Brazilian in the Premier League after making his way to Liverpool in January 2013, one of 14 players from the South American nation to play in England's top-flight in 2016-17.\nRemember those crunching tackles by Vinnie Jones? The red mist descending on Lee Cattermole? What about Roy Keane,, external the former Manchester United captain, who spared no prisoners?\nYou might not be surprised to hear that former Everton striker Duncan Ferguson, external is joint-top of the Premier League's individual red card list with eight dismissals in 269 appearances - one every 33.62 games.\nThree-time Premier League winner Patrick Vieira was also sent off eight times in 307 appearances for Arsenal and Manchester City, while Richard Dunne, who made 431 appearances for Everton, Manchester City, Aston Villa and Queens Park Rangers, received the same number of early baths.\nIn total, there have been 1,477 red cards in 25 years. That's an average of 59.08 each season, with the number peaking at 72 in 1998-99, 2002-03 and 2005-06 - 44 more than the 28 dished out in 1993-94.\nOnly three teams have managed 100 or more goals in a single season - Chelsea (103 in 2009-10), Manchester City (102 in 2013-14) and Liverpool (101 in 2013-14).\nAt the other end of the pitch, Swindon Town, in their only Premier League season in 1993-94, are the only side in 25 years to concede 100 goals.\nSeven players have scored 30 or more in a single season - Andy Cole (34 in 1993-94), Alan Shearer (34 & 31 in 1994-95, 1995-96), Kevin Phillips (30 in 1999-00), Thierry Henry (30 in 2003-04), Cristiano Ronaldo (31 in 2007-08), Robin van Persie (30 in 2011-12) and Luis Suarez (31 in 2013-14).\nShearer tops the all-time list with 260 goals for Blackburn and Newcastle, with Wayne Rooney second on 198 for Everton and Manchester United.\nGetting a ticket for a Premier League match these days can be a frustrating and futile task. Not so 25 years ago.\nA crowd of 12,681 turned up at Coventry's old Highfield Road on 15 August 1992 to watch the Sky Blues beat Middlesbrough 2-1, while Arsenal and Chelsea both failed to attract 25,000 to their home games on the opening weekend.\nMeanwhile, only 3,039 turned up to see Tony Cottee, external score twice for Everton in a 3-1 win against Wimbledon at Selhurst Park on 26 January 1993 - the lowest attendance in Premier League history.\nFewer than 10 million turned out to watch 462 games in 1992-93, while Chelsea's average was fewer than 19,000.\nIn 2016-17, 13.6 million turned up to 380 matches, with a quarter of clubs attracting 50,000-plus average crowds - Manchester United (75,290), Arsenal (59,957), West Ham (56,972), Manchester City (54,019) and Liverpool (53,016).\nIn the last 25 years, several clubs, including Manchester United, Chelsea and Liverpool, have extended their grounds, while others have moved to new homes like Arsenal,, externalManchester City, external and Southampton.\nIf you add up the attendance from each of the 9,746 games, the figure comes to more than 313 million. The population of the United States in 2010 was 308 million.", "url": "https://www.bbc.com/sport/football/40704646"}