{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 07:48:25", "date_modify": "2025-05-21 07:48:25", "date_publish": "2025-03-28 07:14:07", "description": "The NFL free agency window has been packed with big-name moves and teams rebuilding. Ben Collins picks out some of the most significant deals.", "filename": "sport_american-football_articles_c7vzg4mgp8eo_1747813705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8d85/live/f66cc220-0a8b-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c7vzg4mgp8eo_1747813705.html", "title": "NFL free agency: Aaron Rodgers, Cooper Kupp, Davante Adams", "title_page": "NFL free agency: Aaron Rodgers, Cooper Kupp, Davante Adams - the biggest deals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Free agency is always a busy period in the NFL - and this year two Super Bowl-winning quarterbacks came on the market.\nAaron Rodgers and Russell Wilson were both available, sparking weeks of speculation over where the two veterans would go next.\nWilson's former team Seattle made the most big moves as they aim to usher in a new era.\nElsewhere, a handful of teams have focused on rebuilding their offensive lines in readiness for the 2025 season, while stars such as Ja'Marr Chase and Myles Garrett are staying put after securing lucrative extensions.\nBBC Sport runs through some of the biggest deals from the free agency window.\nThe Seattle Seahawks had a positive first year under head coach Mike Macdonald - and British defensive coordinator Aden Durde - as they narrowly missed out on the play-offs.\nNow the Seahawks' front office has made some bold moves in a bid to truly move on from Pete Carroll's 14-year tenure and make this Macdonald's team.\nDK Metcalf requested a trade and Seattle sent the 27-year-old to the Pittsburgh Steelers on a deal worth $150m (£116.5m) - making him the NFL's fourth highest-paid wide receiver.\nDays later quarterback Geno Smith, 34, was traded to the Las Vegas Raiders and the Seahawks replaced him with Sam Darnold, 27, on a three-year, $100.5m (£78m) deal.\nDarnold has just enjoyed the best season of his career with the Minnesota Vikings and will link up with 31-year-old receiver Cooper Kupp, who was released by the Los Angeles Rams three years after being the Super Bowl MVP.\nDarnold was handed the starting role at Minnesota after last year's first-round draft pick JJ McCarthy got injured in pre-season.\nDarnold adjusted admirably to revive his career, but his position was always in doubt with McCarthy returning to full fitness.\nThe Vikings let Darnold go and with McCarthy being on a rookie contract, they have spent big on bolstering their offensive line.\nThe New England Patriots and Chicago Bears have done the same as they too have second-year quarterbacks in need of greater protection - Drake Maye and Caleb Williams, respectively.\nWiliams, for example, was the number one pick in last year's draft but was sacked 68 times in his rookie season - 16 more than any other quarterback.\nThe Tennessee Titans have the first pick in this year's draft and have also made big moves to reinforce their offensive line, suggesting they will take a quarterback next month - with Cam Ward the clear favourite.\nWith the San Francisco 49ers preparing to offer quarterback Brock Purdy a long-term contract, they have let a lot of talent go to free up salary cap space.\nVersatile receiver Deebo Samuel is among those to leave, being traded to the Washington Commanders, so - after losing in two of the past six Super Bowls - the 49ers' championship window could now have closed.\nThe New York Jets were billed as potential Super Bowl contenders last season having rebuilt their roster around Aaron Rodgers, the NFL's four-time Most Valuable Player, but the gamble did not pay off.\nThe Jets have replaced the 41-year-old with former Chicago and Pittsburgh quarterback Justin Fields and released receiver Davante Adams, who was snapped up by the Rams to replace Kupp.\nRussell Wilson has left Pittsburgh to join the New York Giants, while a decision is still due from Rodgers, who has spoken to the Giants, Steelers and Vikings.\nThe Indianapolis Colts have given Daniel Jones a chance to compete with Anthony Richardson for the starting role.\nIn other big-name moves, New England signed receiver Stefon Diggs, Buffalo picked up ex-Chargers pass rusher Joey Bosa and the Baltimore Ravens have given Lamar Jackson another weapon by signing receiver DeAndre Hopkins.", "url": "https://www.bbc.com/sport/american-football/articles/c7vzg4mgp8eo"}