{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:26", "date_modify": "2025-05-21 06:31:26", "date_publish": "2025-03-31 19:28:49", "description": "Manchester City striker Erling Haaland is out for up to seven weeks with an ankle injury suffered in Sunday's FA Cup quarter-final win at Bournemouth, says manager Pep Guardiola.", "filename": "sport_football_articles_c0m901gngw4o_1747809086.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf6a/live/49233d10-0e64-11f0-9848-d7576b56a0e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0m901gngw4o_1747809086.html", "title": "Erling Haaland: Manchester City striker out for up to seven weeks with ankle injury", "title_page": "Erling Haaland: Manchester City striker out for up to seven weeks with ankle injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City striker Erling Haaland will be out for up to seven weeks with the ankle injury he suffered in Sunday's FA Cup quarter-final win at Bournemouth, says manager Pep Guardiola.\nThe Norwegian was substituted in the 61st minute after scoring the equaliser as City went on to beat the Cherries 2-1 and reach the semi-finals.\nA video was posted on social media showing the 24-year-old leaving the Vitality Stadium on crutches and with his left ankle in a protective boot.\n\"They told me the doctors say between five to seven weeks,\" said Guardiola. \"So hopefully the end of the season and by the Club World Cup he will be ready.\n\"Sometimes there are years when these kinds of things happen. It happened all season.\"\nCity said on Monday that Haaland would see a specialist about the injury and anticipate he \"will be fit to play a further part in the remainder of this season including this summer's Fifa Club World Cup\".\nHaaland missed a penalty and two big chances on Sunday, but he turned in Nico O'Reilly's cross to level the game before Omar Marmoush scored the winner.\nThe FA Cup is City's only remaining chance of silverware this season following a difficult Premier League campaign and early exits from the Champions League and Carabao Cup.\nManager Guardiola has had to deal with injuries to key players throughout the campaign. His side are fifth in the Premier League, one point behind Chelsea in the race for a Champions League spot.", "url": "https://www.bbc.com/sport/football/articles/c0m901gngw4o"}