{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:37", "date_modify": "2025-05-21 06:17:37", "date_publish": "2025-01-04 18:56:29", "description": "Southampton 0-5 Brentford: What Thomas Frank said", "filename": "sport_football_articles_c89xjj0qvz2o_1747808257.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c3c4/live/4097b040-cabc-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89xjj0qvz2o_1747808257.html", "title": "Southampton 0-5 Brentford: What Thomas Frank said", "title_page": "Southampton 0-5 Brentford: What Thomas Frank said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brentford manager Thomas Frank has been speaking to BBC Match of the Day following the win at St Mary's: \"That was very, very close to perfection. We gave nothing away throughout the 90 minutes, defended extremely well and then we created chance after chance after chance. It could have easily been more than five goals.\n\"I am extremely proud of this performance in many ways because Southampton are struggling a little bit.\n\"We haven't won away on the road, but the performance we put out there is fantastic and I think it speaks about the culture we have got in the changing room and among the players. The commitment, the focus, the attitude - wow.\"\nOn how his side creates chances: \"We are always happy when the offensive players score goals because those are the ones who need to be reliable, and then other players need to chip in occasionally. But basically we played with five very offensive players.\n\"Keane Lewis-Potter, Kevin Schade and Yoane Wissa scored, Bryan Mbeumo scored two. Mikkel Damsgaard created a lot of chances and opportunities, at least one assist today.\n\"We are very dangerous and we had a very good day.\"\nOn Mbeumo and Wissa's chemistry: \"Some players can click on the pitch, but they have a very good relationship on and off the pitch. You can see that in a lot of the goals.\n\"Our group of players really like each other, work hard for each other and they care about each other - I think that's extremely important.\"", "url": "https://www.bbc.com/sport/football/articles/c89xjj0qvz2o"}