{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:20", "date_modify": "2025-05-21 05:50:20", "date_publish": "2025-04-02 10:21:53", "description": "Leicester finances news: Foxes post pre-tax loss of £19.4m", "filename": "sport_football_articles_c20z7n75n0no_1747806620.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65b2/live/de1759c0-0fa8-11f0-ba4a-e504e2ac19f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20z7n75n0no_1747806620.html", "title": "Leicester finances news: Foxes post pre-tax loss of £19.4m", "title_page": "Leicester finances news: Foxes post pre-tax loss of £19.4m - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester have announced the club accounts for the period ending June 2024, posting a pre-tax loss of £19.4m.\nThe loss is down compared to the £89.5m to June 2023, reflecting the Foxes' relegation to the Championship.\nThe Premier League confirmed in January no clubs were in breach of PSR rules.\nTurnover fell from £177.3m to £105.3m while in the second tier, but gate receipts remained at £18.4m and other commercial revenues increased by £0.3m to £9.8m.\nChief executive Susan Whelan said: \"Operating outside of the Premier League during the 2023-24 season required some obvious adjustments compared with previous years. However, we achieved success on the pitch and attained promotion and the Championship title at the end of the season.\n\"We still have work to do to return to the consistent heights of the past 15 years and the ability to successfully adapt to different challenges is a strength we will rely on as we build for future seasons.\"\nAnalysing the figures, BBC Radio Leicester's Owynn Palmer-Atkin said: \"It is important to note that combining the losses published by clubs over the past three years does not amount to the losses PSR will look at.\n\"Clubs have the opportunity to have add-backs to the figures, such as investment in the academy, club infrastructure and the women's team, which don't count towards the PSR calculations.\n\"However, this set of accounts is a positive addition to the PSR calculations for Leicester City with a huge decrease in losses from the previous accounts and those add-backs still to come in.\"", "url": "https://www.bbc.com/sport/football/articles/c20z7n75n0no"}