{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:51", "date_modify": "2025-04-26 06:47:51", "date_publish": "2025-03-01 11:57:43", "description": "Aston Villa news: Fan views on FA Cup win over Cardiff City", "filename": "sport_football_articles_cvgeq7zenqro_1745650071.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgeq7zenqro_1745650071.html", "title": "Aston Villa news: Fan views on FA Cup win over Cardiff City", "title_page": "Aston Villa news: Fan views on FA Cup win over Cardiff City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Aston Villa's performance against Cardiff City, as Unai Emery's side sealed their spot in the FA Cup quarter-finals.\nHere are some of your comments:\nRob: A solid and professional performance. There were some hints of fantastic play - Asensio's ball control is just sublime - but, while a strong team was played, we were clearly keeping some energy back for the Brugge game. Cardiff's Ethan Horvath had a fantastic night in goal and deservedly won man of the match. Overall I'm pleased with the result and where we are in the season, especially when I think where Villa were before Emery came in. Every season is a building block - and there will be peaks and troughs.\nNick: A solid performance. I'm glad we went strong, as this competition at least provides the opportunity to go to Wembley. It would be good to give it a real go this season because many of the big clubs are out.\nRichard: Glad to get the win and not concede, but we were often too slow in possession when attacking. Asensio and Rashford seem to be a good partnership. It's also great that all of the new signings have slotted seamlessly into Emery's style of play. Hopefully the players aren't too tired for Tuesday's game.\nLee: We did the job eventually. Rashford just needs a goal now, it will do his confidence the world of good. You can't fault his assists though, spot on.\nPrit: I'm really happy with the win and it is great to see the Rashford-Asensio axis getting stronger each match. I thought Cardiff's goalkeeper had a great game and I couldn't believe he has only just got into the team. I'm still concerned about our defence. We need Torres and Mings back but, above all, we need a fit Kamara anchoring.", "url": "https://www.bbc.co.uk/sport/football/articles/cvgeq7zenqro"}