{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 03:52:46", "date_modify": "2025-05-21 03:52:46", "date_publish": "2025-04-07 09:50:35", "description": "Luke Humphries says he will keep quiet in future after receiving a backlash on social media after admitting to finding the darts schedule overwhelming.", "filename": "sport_darts_articles_cdxnq67wl34o_1747799566.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/be93/live/f46738c0-138c-11f0-b751-af2aaed03a76.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_cdxnq67wl34o_1747799566.html", "title": "Luke Humphries on social media backlash: 'It will be the last time I confess my real feelings'", "title_page": "Luke Humphries on social media backlash: 'It will be the last time I confess my real feelings'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Luke Humphries says he will keep quiet in the future after facing backlash regarding his comments about struggling with the current darts schedule.\nAfter a 6-1 win over Dirk van Duijvenbode in the second round of the International Darts Open on Saturday, an emotional Humphries told Sky Sports that playing felt like a \"chore\" and he needed a break for his mental wellbeing.\nThe 2024 world champion also said that he felt \"emotionless\" as a result of playing too much.\nOn Sunday, Humphries then said he had been misunderstood after he received some criticism on social media, mostly regarding how much he is paid.\n\"Considering the comments and people not understanding what I meant, it will be the last time I ever confess my real feelings to the public,\" Humphries responded on X.\n\"Everything I say or ever do just never seems to be good enough for anybody.\n\"As long as no one complains when we all give the same answers in interviews like robots and not our true feelings, then everyone I guess will be happy, or usually will still find a way to moan at us.\"\nHumphries, who lost to eventual champion Stephen Bunting in the semi-finals, is also currently competing in the Premier League, where he is second in the table behind world champion Luke Littler.\nAfter winning last year's World Championship, Humphries reflected on his rise to the top of the sport having had mental health challenges and suffered from anxiety at times in his career. He has admitted that after one anxiety attack on stage in 2018 he contemplated quitting the sport.\nThe 30-year-old's defence of the world championship ended at the last 16 stage this year, losing to former champion Peter Wright.", "url": "https://www.bbc.com/sport/darts/articles/cdxnq67wl34o"}