{"authors": ["Alex Pewter", "www.facebook.com"], "date_download": "2025-05-21 07:46:17", "date_modify": "2025-05-21 07:46:17", "date_publish": "2025-05-20 11:39:21", "description": "Crystal Palace news: Fan view on Europa and future after FA Cup win", "filename": "sport_football_articles_czx047v21dqo_1747813577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e6b0/live/3752ed40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czx047v21dqo_1747813577.html", "title": "Crystal Palace news: Fan view on Europa and future after FA Cup win", "title_page": "Crystal Palace news: Fan view on Europa and future after FA Cup win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "So, what's next? We've collectively taken a breath, and it is uncharted territory for Crystal Palace, headed into a season of European football for the first time.\nWinning the FA Cup has sent the club down one of two wildly divergent paths – one where the hope of retaining players may have dramatically increased, who would almost certainly have been leaving without the carrot of the Europa League.\nTopping the list of question marks on the pitch is captain Marc Guehi, with a year to run on his contract, and several would-be suitors. Despite playing for a mid-table team, Guehi already has England recognition, but the sense is that he is waiting for the right move, and Palace will be seeking a record fee for him to leave this summer, if the past two windows have taught us anything.\nThe stock price of Eberechi Eze is also at an all-time high. He has delivered on a grand stage and is entering his prime years. Again, Palace's valuation and his suspected release clause are at the high-water mark for players in his position. He turns 27 in June, with two years left on his deal.\nOff the pitch, Oliver Glasner is the mastermind of the season. The club will seek to extend his contract beyond the following season. His system and its implementation have been a revelation for the club. We have a clear picture of what an 'Oliver Glasner' player looks like, and Palace will be recruiting on that basis.\nRecruitment is therefore the key phase, and despite the emotional comedown from the weekend, Palace will need to be at work immediately. The team is set to play at least 49 matches next season, one more than this, even with two late cup runs. The squad will need greater depth than ever before, but hopefully, while retaining the key figures from Saturday.", "url": "https://www.bbc.com/sport/football/articles/czx047v21dqo"}