{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:08:46", "date_modify": "2025-05-20 12:08:46", "date_publish": "2023-08-05 10:21:36", "description": "Cornwall vice-captain Jake Lloyd signs a new two-year contract with the League One club.", "filename": "sport_rugby-league_66407034_1747742926.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77E6/production/_130649603_jakelloydcreditcornwallsportsmedia.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66407034_1747742926.html", "title": "Jake Lloyd: Cornwall forward signs new two-year contract", "title_page": "Jake Lloyd: Cornwall forward signs new two-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n5 August 2023\nCornwall vice-captain Jake Lloyd has signed a new two-year contract.\nThe 25-year-old hooker has been an ever-present for the League One club this season and has been with the side since their formation in 2022.\n\"It was an easy decision for me to sign a new contract,\" Lloyd, who played for both Lancashire and Great Britain at amateur level, told the club website.\n\"This season we have made some real progress and this club is something that I very much want to be a part of.\n\"When there was the option to sign for another two years, that really was a no-brainer. I love the club and I love playing for Cornwall so I'm made up to be part of it for the next couple of years.\"\nCornwall head coach Mike Abbott added: \"His stats speak for themselves and I think there was one game when he made nearly 50 tackles without any misses.\n\"That kind of work-rate and commitment to the team is inspiring and infectious for others.\n\"Having him here for another two years shows that this club is laying down some really firm foundations and looking very much to the future.\"\nRelated topics\nAround the BBC\nThe Super League Show\nRelated internet links\nCornwall RLFC\nThe Super League Show Facebook\nSuper League\nRugby Football League\nThe BBC is not responsible for the content of external sites.", "url": "https://www.bbc.com/sport/rugby-league/66407034"}