{"authors": ["Sean Kearns", "John Bennett", "www.facebook.com"], "date_download": "2025-04-26 07:55:51", "date_modify": "2025-04-26 07:55:51", "date_publish": "2025-02-25 12:30:02", "description": "Jamie Carragher has been accused of disrespecting the Africa Cup of Nations following his \"clumsy\" views on the tournament.", "filename": "sport_football_articles_c1lpv46pm3vo_1745654151.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dd00/live/5bb78f70-f3a3-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1lpv46pm3vo_1745654151.html", "title": "Jamie Carragher & Afcon 'disrespect' row explained", "title_page": "Jamie Carragher & Afcon 'disrespect' row explained - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Who would have thought a discussion on the brilliance of Mohamed Salah would spark a heated social-media row about the merits of the Africa Cup of Nations?\nWell that's what happened when Sky Sports pundit Jamie Carragher suggested Afcon was not considered a \"major tournament\".\nSo what did Carragher say? Who else has spoken out? And is Afcon disrespected by a European-centric view of world football?\nBBC Sport attempts to break down and explain the issues.\nSpeaking after Liverpool's 2-0 Premier League win at Manchester City on Sunday, pundits in the Sky Sports studio were discussing Salah's performance and whether this season could be one of the \"greatest\" individual campaigns.\nBBC Sport explored that discussion on Monday.\nThe debate then turned to whether Salah could be in line to win the Ballon d'Or - a prestigious annual award for the best player in the world.\nThe Ballon d'Or is voted for by 100 journalists from around the world, and was won last year by Manchester City midfielder Rodri.\nFormer Liverpool defender Carragher suggested Salah would have to win the Champions League in order to win the Ballon d'Or because Afcon is not recognised by voters as a \"major tournament\".\nHe added: \"I think the problem is the fact he's with Egypt, and he's probably not playing in the major tournament as such, or maybe got a great chance of winning, I think it's either the Champions League or the major tournament. Normally, the player who excels in that.\"\nCarragher's repeated use of the term \"major tournament\" irked fellow pundits Micah Richards and Daniel Sturridge.\nRichards stressed Afcon was a \"major tournament\", saying: \"A lot of people are at home saying 'They aren't taking it seriously.' Afcon is a big tournament.\"\nFormer Liverpool striker Sturridge said: \"It's a fact. If you win the Euros or Copa America it's deemed to be big - so the Afcon is at the same level.\"\nCarragher responded: \"Egypt are not going to win the World Cup are they?\" And when Richards tried to explain, he cut him off and said \"Oh God.\"\nClips of the exchange were shared widely across social media.\nOn Monday, Carragher attempted to clarify his comments on X, saying Salah was \"at a disadvantage playing for Egypt in terms of him winning the Ballon d'Or\".\n\"If Salah had an average season at LFC but won the Afcon & was MVP [Most Valuable Player] I don't think he would win the Ballon d'Or. Because I don't think Afcon carries the weight of other tournaments.\n\"But if Mbappe had an average season at Real Madrid but won the World Cup/Euros, he would still have a great opportunity.\"\nTo get an idea of the value of Afcon, all you have to do is listen to some of the continent's greatest ever players. Legends such as Samuel Eto'o, Yaya Toure and Didier Drogba - or the big stars still in action, like Mohamed Salah, Sadio Mane and Riyad Mahrez.\nThey have trophy cabinets full of medals and titles from European club football, but Afcon means everything to them.\nComparisons will always be made to the quality of the Euros and the Copa America, but - just like those tournaments - it's incredibly difficult to win the trophy for even the biggest names and biggest countries.\nI've lost count of the number of times the tournament favourites have crumbled under the pressure, or in tough conditions against so-called smaller football nations.\nDrogba never won it despite playing in a golden generation of Ivory Coast talent. Salah is yet to lift the trophy, and I can still picture how devastated he was after losing the finals in 2017 and 2021.\nThe organisers also argue the interest in the tournament around the world is increasing all the time. And having been in Ivory Coast at the last edition, I feel that too.\nIt was one of the most exciting I've experienced with the dramatic storyline of the hosts sacking their manager in the group stage before making a remarkable comeback and winning the final. On the ground it certainly felt that it was bigger than ever before with more worldwide interest than ever before.\nYes, there have been many issues in the past that have damaged the reputation of the tournament. For example late changes to the location, such as when Egypt hosted in 2019 instead of Cameroon, who weren't ready. Or changes to the timing, for example with the next edition which was due to take place in June and July but will now start just before Christmas.\nThen there are difficulties with infrastructure, security or organisation. But similar issues have also impacted the Euros and the Copa America in recent years.\nI've always found complaints about the tournament taking place in the middle of the European season overblown. Yes it's frustrating for the clubs but why should African football be dictated to by the European game? Weather conditions also make hosting it in June and July impossible in certain areas of the continent.\nThe tournament may not get the respect it deserves in some parts of the world but after covering six Afcons I get the impression that's changing and that the next edition in Morocco, where football is booming right now, will be bigger than ever and may just have an impact on the Ballon d'Or voting.", "url": "https://www.bbc.co.uk/sport/football/articles/c1lpv46pm3vo"}