{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:38:08", "date_modify": "2025-05-20 12:38:08", "date_publish": "2023-08-04 00:00:00", "description": "Follow text and radio commentary as Southern Brave host Welsh Fire in the 2023 Women's Hundred.", "filename": "sport_live_cricket_66306512_1747744688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3A2F/production/_130659841_4e81e91edc9d43501521632d79684411d35eab2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306512_1747744688.html", "title": "The Hundred 2023 LIVE: Southern Brave vs Welsh Fire in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Southern Brave vs Welsh Fire in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us for the men's match...\nThat was an absolute thriller! Will the Southern Brave vs Welsh Fire men's match be as exciting? Let's hope so.\nOur live-text commentary of that game will get underway shortly on the BBC Sport website at 18:15.\nYou can join that here...\nIn the meantime you watch a selection of clips of the the key moments from this game in The Hundred below.\nSee you on the other side.\n'That was an epic...'\nWelsh Fire captain Tammy Beaumont, talking to Sky Sports: \"What a game of cricket that was. The crowd were treated to an epic. With Danni Wyatt and Smriti Mandhana you never know if you've got enough runs. The bowlers stuck at it hard. I'm ecstatic.\n\"We've spoke at length in team meetings that the top two or three can be extremely explosive, but if you get through them it can be easier. I'm really happy for the girls.\n\"Only in the last three balls was I confident. Freya Kemp is an extremely talented player. Hayley Matthews has done it for West Indies for a very long time. After her third set she said 'don't bowl me again', but I said 'Hayls, you're going to have to' and she said 'no worries, boss'.\n\"For me to go with Alex Griffiths for the penultimate set showed how confident I was in her. She bowled beautifully. It shows the passion and the Welsh dragon inside her.\"\n'Pretty special to get over the line'\nMatch Hero Hayley Matthews talking to Sky Sports: \"It was great. It was a pretty good wicket and we wanted to get a big score on the board, we knew they'd come hard so we're glad to get over the line.\n\"It's huge for the team. We've spoke about not getting over the line in previous years so it's pretty special to do it today when it was close and cap it off.\n\"We were really excited to get out there. We knew they'd be a tough team to play but we just wanted to play positive cricket and we did that today.\n\"I wasn't sure how many they needed off the final set. I just knew what I wanted to bowl and wanted to nail it. I'm glad I got it done.\"", "url": "https://www.bbc.com/sport/live/cricket/66306512"}