{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:28:27", "date_modify": "2025-05-21 07:28:27", "date_publish": "2025-01-14 00:00:00", "description": "Watch the third round draw of the Rugby League Challenge Cup.", "filename": "sport_rugby-league_live_cx2vz91xnvzt_1747812507.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_live_cx2vz91xnvzt_1747812507.html", "title": "Rugby League Challenge Cup LIVE: Third Round Draw", "title_page": "Rugby League Challenge Cup LIVE: Third Round Draw - watch stream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How will it work?\nBBC Sport\nThe road to Wembley continues as the draws for the men's and women's Challenge Cup draws taking place live on the BBC Sport website.\nFollowing a change to the format, the men's third-round draw will see the 12 Betfred Super League clubs enter at an earlier stage to previous years, with a seeded draw taking place to guarantee each side will be drawn away to one of the 20 second-round winners.\nAfter the postponement of 14 out of the 17 first-round ties scheduled for the past weekend, the draw will now feature 31 community sides as well as 23 teams from the Championship and League One. The draw will start with the one ball being drawn to face each one the 12 Super League clubs, before the final eight balls will complete the 16 ties for round three, due to be played between 7-9 February.\nThe women's competition begins with a group phase, which will see eight Super League sides and four teams from the Championship drawn into four seeded groups of three, giving opportunity for two teams to qualify for the quarter-finals. The draw will be seeded with one of last season’s top four teams – Leeds Rhinos, Wigan Warriors, York Valkyrie and holders St Helens – in each group, alongside two teams chosen from the remaining eight.\nBoth competitions will culminate at Wembley on the 7th June with men's and women's finals taking place on the same day.", "url": "https://www.bbc.com/sport/rugby-league/live/cx2vz91xnvzt"}