{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:41:04", "date_modify": "2025-05-21 06:41:04", "date_publish": "2025-01-17 00:00:00", "description": "Live video and text coverage of Dungannon Swifts versus Glenavon at Stangmore Park in the Irish Premiership", "filename": "sport_football_live_cd64q99g108t_1747809664.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cd64q99g108t_1747809664.html", "title": "Malone double as Glenavon beat Swifts at Stangmore", "title_page": "Irish Premiership: Malone double as Glenavon beat Swifts at Stangmore - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chances were few and far between in the opening 25 minutes with Peter Campbell's delivery easily gathered by Declan Dunne and Matthew Snoddy unable to keep his strike from range on target for Paddy McLaughlin's side.\nDungannon's best chance early on came when Leo Alves fired a loose ball towards goal, but Mark Byrne was able to thwart the chance at the near post.\nGlenavon opened the scoring just before the half hour after Chris Atherton's corner was recycled back to the 16-year-old with his second delivery nodded towards goal by Snoddy, forcing Dunne to make a good save to tip the danger away.\nSnoddy was able to get to the rebound, but once again his shot was deflected. However, Davy McDaid was able to nod home from close range for his third goal in three games.\nMcDaid was then denied a second goal by the inside of the left-hand post after he had been played through on goal by Len O'Sullivan and tried his luck from a tight angle. Campbell latched onto the rebound but couldn't get a shot away.\nThe striker was involved in Glenavon's second goal though as his pass, which deflected off the torso of Gael Bigirimana, was met by a superb first-time finish from Malone, which flew into the top corner.\nIt was the perfect start to the second half for the Tyrone club as they were awarded a penalty just 60 seconds after the restart when McGovern fell under the challenge of Barney McKeown, with McGovern stepping up and making no mistake with the resulting spot-kick.\nBoth sides then had good chances with Malone and Adam Glenny both firing narrowly wide.\nThe equaliser came in the 65th minute with substitute Mitchell heading a well-timed cross from Scott past Glenavon stopper Byrne.\nThe tempo of the game then dropped but the goals weren't with Malone netting his second of the evening and putting Glenavon ahead once again after Malone finished after the ball was played back to him by substitute Paul McGovern.\nDungannon pushed for another goal until the final whistle with Tomas Galvin being denied by a superb diving save by Byrne before Rhys Marshall cleared Andrew Mitchell's shot to safety.", "url": "https://www.bbc.com/sport/football/live/cd64q99g108t"}