{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:17:49", "date_modify": "2025-05-20 13:17:49", "date_publish": "2023-08-02 11:53:11", "description": "Prop Thomas Mikaele rejoins Warrington Wolves from Gold Coast Titans on a deal until the end of the season,", "filename": "sport_rugby-league_66383656_1747747069.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11E87/production/_130615337__am10215.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66383656_1747747069.html", "title": "Thomas Mikaele: Gold Coast Titans prop re-joins Warrington Wolves until end of season", "title_page": "Thomas Mikaele: Gold Coast Titans prop re-joins Warrington Wolves until end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Prop Thomas Mikaele has rejoined Warrington Wolves from Gold Coast Titans on a deal until the end of the season, four months after returning to Australia on compassionate grounds.\nThe 25-year-old scored three tries in seven games earlier this season to help the Wire go top of the Super League.\nHe returned to the National Rugby League in April with the Titans, but made just one senior appearance.\n\"It's been a weird year for me so far,\" Mikaele said., external\n\"There's been some changes and obviously things haven't gone the way they were planned for me since returning to the NRL.\n\"But I've been given the opportunity to come back and be a part of something special that we had going on earlier in the year at Warrington.\n\"I'm happy my family is sorted back home and I'm excited to get back to the UK to reconnect with the lads and play in front of the Wire crowd again which I've missed.\"\nFormer Wests Tigers front-rower Mikaele played 66 NRL games in addition to 11 in reserve grade before a mid-season move to Warrington in 2022 - ending last term with one try in 11 Wolves matches.\nHe spent much of his time back in Australia this season playing for the Titans' feeder club Burleigh Bears in the Queensland Cup, making eight appearances, and despite landing back in England on Wednesday is being considered for Friday's game with Catalans.\n\"Every minor detail has been covered to ensure he's as fresh as possible to give him the best chance of playing this Friday,\" interim head coach Gary Chambers said. \"We'll assess on Thursday if he's ready to go.\n\"He's a handful for any defence. He's a threat with the ball in hand and in defence as well. He was playing consistently well at the start of the year and hopefully he can find that form again for us over the next few months.\"", "url": "https://www.bbc.com/sport/rugby-league/66383656"}