{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-21 04:35:03", "date_modify": "2025-05-21 04:35:03", "date_publish": "2025-04-04 18:04:46", "description": "Ian Holland leads the way for Leicestershire’s bowlers as they dismiss Glamorgan for 229 to take the upper hand in Cardiff.", "filename": "sport_cricket_articles_c0jgjg95ev5o_1747802103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1acc/live/0f65e460-117f-11f0-bef7-27730fea7c1a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0jgjg95ev5o_1747802103.html", "title": "Holland puts Leics on top in Cardiff", "title_page": "County Championship: Holland puts Leics on top in Cardiff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ian Holland led the way for Leicestershire's bowlers as they dismissed Glamorgan for 229 to take the upper hand in Cardiff.\nThe Australian-bred American international claimed important top-order wickets in his 3-40.\nChris Cooke, last out for 55, led some late resistance.\nHolland fell for seven in the Leicestershire reply but Sol Budinger (36*) led the Foxes to 65-1 in reply..\nOn a grey and damp morning Leicestershire had no hesitation in bowling first against a Glamorgan side including short-term signings Shoaib Bashir, the England spinner on loan from Somerset, and Asitha Fernando, the first Sri Lankan to play for Glamorgan.\nHolland's first ball got rid of Zain Ul Hassan, edging to slip, but Eddie Byrom got the scoreboard moving with his first 36 runs coming in boundaries.\nThe Foxes' five-man seam attack gained consistent movement and Tom Scriven trapped Sam Northeast lbw for 17, before Ben Green found the edge of Byrom's bat for 41.\nAs the sun came though and the cool sounds of a nearby jazz performance drifted into the ground, Kiran Carlson (25) and Colin Ingram (32) started the afternoon brightly.\nBut Holland rattled Carlson's stumps and pinned Ingram lbw in the space of four overs, with Scriven quickly dispatching Ben Kellaway to put the bowlers firmly in control as they continued to find some movement off a green-tinged pitch.\nMike was next to step up for the visitors with a couple of wickets as the run-rate dropped.\nCooke had a painstaking start but battled through to add 53 in a ninth-wicket stand with Bashir (20) to earn some token respectability.\nWith Leicestershire opener Rishi Patel sidelined by a thumb injury suffered early on in the field, Holland stepped up to open alongside Sol Budinger but was caught at slip off Timm van der Gugten for seven.\nBudinger survived a slip chance on 18 off van der Gugten and profited in a partnership with Ben Mike, surprisingly promoted to number three, as Fernando's bustling early overs for Glamorgan proved fruitless.", "url": "https://www.bbc.com/sport/cricket/articles/c0jgjg95ev5o"}