{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-21 04:02:43", "date_modify": "2025-05-21 04:02:43", "date_publish": "2025-01-23 22:50:43", "description": "Rangers fought hard against adversity and showed character against Manchester United to give themselves something to build on, says Tom English.", "filename": "sport_football_articles_cvgmnx1j0d4o_1747800163.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5adf/live/c327b7c0-d9db-11ef-bc6d-11d87693addc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgmnx1j0d4o_1747800163.html", "title": "Man Utd 2-1 Rangers: 'Hurt and hope for Clement as side fight adversity'", "title_page": "Man Utd 2-1 Rangers: 'Hurt and hope for Clement as side fight adversity' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The intros had been written, the praise laid on thick, with a trowel. Rangers had come back from the dead.\nThey had survived injuries, they had brought on two teenagers, they had gifted a goal to Manchester United and yet there they were, fighting, believing, scoring.\nCyriel Dessers is made of Teflon. He has to be.\nThe amount of flak the big man has been pelted with in his seasons with Rangers, the insults, the fact that he himself felt he had been written of by his own fans before he'd unpacked his boxes in his new home.\nBut it was Dessers who levelled it at Old Trafford minutes from the end.\nA ball over the top. A first touch on his right foot to kill it. A turn. A second touch with his left foot buried in the back of the United net. Harry Maguire mortified. The home support enraged. Rangers in raptures.\nA point in the circumstances would have felt like a win, but there was neither a point nor a win.\nInstead, there was a moment of hesitation from Rangers at the back. There was Bruno Fernandes rescuing his team. And there was pain on the face of every Rangers player.\nSo close to a fine result, but so far.\nConsolation, at least, came with confirmation from Uefa that the Ibrox side have done enough to be guaranteed place in the knock-out round before their final group game with Union Saint-Gilloise of Belgium next Thursday.\nThis had been an uphill struggle for Rangers, but one they committed to with a purpose that was unmistakeable, even as United threatened to overrun them.\nAs the Rangers players left the pitch at the end of a goalless opening half that contained a whole lot of encouragement, Philippe Clement walked to his hobbling centre-back, Leon Balogun, to get a prognosis. It wasn't good.\nBalogun never reappeared and now Rangers, pretty comfortable to that point, faced a challenge of an altogether different order.\nJames Tavernier moved from right-back to right centre-back. Ridvan Yilmaz, operating on the left of midfield, was moved to right-back. Clement shuffled and possibly prayed.\nThe teenage Bailey Rice appeared, 18 years young. Ten minutes versus Nice; 28 versus Fraserburgh; 12 versus Motherwell; and one against St Mirren has been the sum total of Rice's first-team involvement.\nNow it was the Europa League with Christian Eriksen and Fernandes as direct opponents. Baptisms of fire don't come much hotter.\nWhat Rice could have done with was more time to settle in and get himself to the pitch of the game at 0-0.\nWhat he, and his admirable team-mates, needed like a hole in the head was for Jack Butland to punch Eriksen's corner into his own net early in the new half.\nHad it been a moment of class that undid them, it might not have hurt so much. A Fernandes rocket, some trickery from Amad Diallo, a moment of class from Alejandro Garnacho. But instead it was a gift.\nOld Trafford had been fairly hushed up until then. Rangers' concentration levels were high, their intensity much like it was when going toe-to-toe with Tottenham.\nUnited had chances - a goal strangely ruled out for a foul that few people saw - but so had Rangers.\nNico Raskin, Yilmaz and Hamza Igamane reminded their hosts that, though they may have had the majority of possession, there was a still-beating heart down the other end. They would find out later how strongly it was beating.\nHalf-time came and Clement would have been a happy man.\nWith its paeans to the immortal Denis Law and the banners hailing the genius of their other great Scot Sir Alex Ferguson, Old Trafford looked the part.\nBut it didn't sound like it. It didn't have any aura, any noise from the home fans, any intimidation factor.\n\"Glory and honour\", \"One Love Stretford End\", \"Manchester Is My Heaven.\" The worthy motifs decorated the stands but there wasn't glory or honour or love.\nNot until Butland banged one into his own net.\nSuddenly, the volume was turned up. Suddenly, United looked convincing in their build-up play, albeit wasteful when the moments came.\nThere were several good ones, but no second goal, not until the dying seconds.\nButland saved, his defenders blocked and Rangers ensured that their night didn't descend into something unpleasant.\nFindlay Curtis came on, another 18-year-old in the fray. A debut against Fraserburgh on Sunday and a Europa League debut on Thursday. Rice and Curtis must have felt like kids at Christmas.\nSo much has been said about the Old Firm's inability to break through their young players, but Clement has some decent ripostes to that criticism now. Rice and Curtis were there because of injuries to others, but they were there.\nThis is a young group of players that Clement has and he is desperately trying to buy time to mould them into a gnarled unit. Patience, of course, is as rare as the dodo bird on the Govan Road.\nIn a heart-stopping moment late on, Rice played a gorgeous pass into Dessers, who was on-on-one with Altay Bayindir in the United goal.\nHe lifted it over him and saw it come off a post. He was probably offside but that didn't lessen the ire of the home fans. They reacted with a fury that split the ears.\nWe couldn't have known that Dessers would go again and this time he would put it away in the manner of the greatest Rangers strikers. Seventeen for the season. More than 20 last season.\nThat's decent shooting for the dud you hear some Rangers fans talking about.\nFernandes had the final say and there will be Rangers angst because of it. For all the class of the finish, the goal was avoidable.\nThat will hurt, but there will be hope, too, for Clement. His players fought hard against adversity. He saw character out there. No points, but something to keep building on.", "url": "https://www.bbc.com/sport/football/articles/cvgmnx1j0d4o"}