{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 04:25:02", "date_modify": "2025-04-26 04:25:02", "date_publish": "2025-03-03 12:22:23", "description": "Their performances and certain advantages mean India are favourites for the Champions Trophy, but they can be beaten.", "filename": "sport_cricket_articles_c0rz14exrggo_1745641502.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2330/live/0d68edb0-f82a-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c0rz14exrggo_1745641502.html", "title": "Champions Trophy 2025: India favourites but can be beaten by Australia", "title_page": "Champions Trophy 2025: India favourites but can be beaten by Australia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Three games, three comprehensive wins.\nIndia have reinforced the view they are the world's best white-ball side at the Champions Trophy over the past 11 days, not that it should be a surprise.\nIn the aftermath of their victory over New Zealand on Sunday, Black Caps bowler Matt Henry was asked by a journalist whether their opponents should admit India were \"smart\" in selecting five spinners for this tournament.\nHenry did well to hide any bemusement. No other team has had the chance.\nThat India, after their decision not to travel to Pakistan in this tournament, are playing all of their matches in Dubai is a significant advantage.\nThey have the best spinners and, without having to change hotel bed or pick up their passports, are able to utilise them where slow bowling averages best, concedes the fewest runs and takes wickets more often compared to any of this tournament's three other venues.\nWhile the other three semi-finalists have had to balance a squad for the pace of Lahore or the skiddy bounce of Karachi, India have not.\nRohit Sharma's side fielded three spinners in the first two games and, when the pitches tired further, added a fourth to face New Zealand - architect turned mystery spinner Varun Chakravarthy coming in to take 5-42.\nThis should not take away from the skill of India's quartet.\nChakravarthy, Ravindra Jadeja, Axar Patel and Kuldeep Yadav are each world-class in their own right and even their fifth spin option, off-spinner Washington Sundar who is yet to play in the tournament, would stroll into England's struggling XI.\nIndia may well be too good for Australia – world champions but without their three best quicks – on any surface but Tuesday's semi-final will be on India's strip of dry turf.\n\"Whoever beats India wins, simple,\" former England captain Michael Vaughan said.\n\"I think it's only the Aussies who could get them but I very much doubt it on the Dubai pitch.\"\nYet Australia have an edge in the sides' recent meetings. A win in an epic Test series this winter, the World Test Championship final in 2023 and, most significantly, the 50-over World Cup final later that year – the most recent meeting in this format.\nConfidence will be taken from that day when they chased for victory, playing on India's tendency to not stretch themselves in the biggest games when batting first.\nRohit Sharma has spent the past two and a half years trying to beat that issue out of his side. It also resurfaced in last year's T20 World Cup final, although they went on to win.\n\"Australia will back themselves to chase anything but if they bat first it could all end up in a heap,\" former England spinner Alex Hartley said.\n\"They might panic against the spinners and be bowled out really cheaply but if they are chasing they've got the mindset to dig in.\"\nWith the pitches set to turn again, India's XI is unlikely to be changed.\nAustralia have lost opener Matt Short to injury and have responded by calling up 21-year-old Cooper Connolly, who has played only three ODIs.\nThey could promote Josh Inglis to open and bring in seamer Aaron Hardie, or play attacking opener Jake Fraser-McGurk. Connolly at least gives captain Steve Smith another option with his left-arm spin.\nSmith will be heavily reliant on his leg-spinner Adam Zampa, who has dismissed Rohit four times in ODIs, Virat Kohli five and both Hardik Pandya and KL Rahul on four occasions.\nIndia's spin strength also means their death bowling is yet to be tested in this tournament, where they are without the great Jasprit Bumrah because of injury.\nIn Bumrah's absence, the role will fall to Mohammed Shami and Hardik, if Australia can be the first team to take them deep.\nShami has gone at 8.12 runs per over in the final 10 overs of ODIs since the start of 2022, putting him among the more expensive finishing bowlers in the world, while Hardik is one of 11 bowlers to concede more than 10.9 runs per over at the death in recent Indian Premier Leagues.\nAustralia will train at the Dubai International Stadium – the location of their 2021 World Cup win – on Monday night, ensuring their decision to depart Pakistan on Saturday despite not knowing if they would play there was not wasted.\nSouth Africa, who flew in on Sunday in a similar scenario, were not so fortunate and returned to Pakistan on the three-hour flight on Monday morning, less than 24 hours after arriving.\nThe second semi-final will be a repeat of a match won by New Zealand, also at Gaddafi Stadium just 21 days ago.\nOn that occasion, Mitchell Santner's side chased 305 with eight balls to spare but South Africa's weakened line-up, due to the conclusion of the SA20, has been reinforced since.\nNew Zealand were too tentative early in their chase against India on Sunday and will hope to earn a second shot at beating Rohit's side, should the favourites progress.\nThe Proteas' fearsome middle order of Aiden Markram, Heinrich Klaasen – regarded as the best attacker of spin in the world - and David Miller, who has the highest average against slow bowling of any batter in top-tier ODIs since the start of 2022, would not be so conservative.\nPerhaps it is Temba Bavuma's side who are best set up to defy the odds.\nIndia are not unbeatable but defeating them will take something special.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c0rz14exrggo"}