{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:01:17", "date_modify": "2025-05-20 14:01:17", "date_publish": "2023-07-30 13:13:32", "description": "Australia aim to avoid an early exit like fellow co-hosts New Zealand, Japan and Spain look to win Group C, and Republic of Ireland play their final 2023 Women's World Cup match.", "filename": "sport_football_66353826_1747749677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60C0/production/_130586742_gettyimages-1579469345.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66353826_1747749677.html", "title": "Women's World Cup: Canada v Australia, Republic of Ireland v Nigeria, Japan v Spain, Costa Rica v Zambia", "title_page": "Women's World Cup: Canada v Australia, Republic of Ireland v Nigeria, Japan v Spain, Costa Rica v Zambia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia will seek to avoid joining New Zealand in a piece of unwanted history as Groups B and C reach a climax at the Women's World Cup.\nIn each of the previous eight tournaments, the hosts have reached the knockout stages.\nThis is the first Women's World Cup with co-hosts and, after New Zealand went out on Sunday, Australia - who have a fitness doubt over star striker Sam Kerr - will follow them if they lose to Olympic champions Canada.\nSurprise package Nigeria will seal a place in the last 16 with victory against the Republic of Ireland, who have already been knocked out.\nGroup C sees Japan and Spain battle for top spot, while Costa Rica and Zambia play out a dead rubber.\nThe Group C winners will take on Norway, who beat the Philippines 6-0 on Sunday to finish second, while the runners-up will face Group A winners Switzerland.\nSpain boss Jorge Vilda said he did not care who his side met in the last 16 and added: \"Be clear that Spain will always go out to win.\n\"We have not wasted a second thinking about which opponent we could play.\n\"This match will help us grow as a team, but it is not a decisive match. We are waiting for it to arrive - and we are prepared to face it.\"\nCosta Rica take on Zambia with both looking for their first victory at a Women's World Cup.\nCosta Rica have drawn two and lost three of their five matches over two tournaments, with two losses in 2023, while debutants Zambia are yet to score a goal after successive 5-0 defeats.\nEx-England goalkeeper Rachel Brown-Finnis' prediction for Japan v Spain: \"This World Cup feels wide open from what we've seen so far and I would include both of these teams in my list of five or six serious contenders who have either been really impressive or look like they have another couple of gears to find.\n\"With their progress already assured, they are both trying to top Group C, but I don't think either will fear whoever they end up facing out of Group A. I could see Japan or Spain going on to win the tournament, they have been that good.\n\"It's hard to pick a winner here, but I am going to go with Spain to take it, just about, 1-2.\"\nKey stat: Spain have won both of their games at the 2023 Women's World Cup, having won just one of their first seven matches before the tournament (drew two, lost four).\nBrown-Finnis' prediction for Costa Rica v Zambia: \"These teams are both already out and are yet to score a goal or put a point on the board.\n\"So, I can see them wanting to go out and show what they can do. There is not much point in them being cagey now, 2-2.\"\nKey stat: Zambia have become only the fourth side to concede 10 or more goals in their opening two Women's World Cup matches, and the third to concede five or more in both games after Mexico (1999) and Ecuador (2015).\nCanada v Australia is shaping up to be a big one, with either the Olympic champions or the hosts set to go out - although they could both still go through.\nIf Australia exit, that would be both the hosts out, with New Zealand left disappointed on Sunday.\nNigeria and Canada both go into their final games only needing a point to go through, and Australia chasing the win. A draw would be enough for the Matildas if the Republic of Ireland, who are already eliminated, beat Nigeria by two goals.\nThe Irish have just pride to play for - and a first Women's World Cup win - after losing both matches narrowly so far in battling performances against higher-ranked sides.\n\"We want to still make the history of getting points, really mixing up this group for us. We're still fully concentrated on that,\" said defender Louise Quinn.\nNigeria boss Randy Waldrum says his team have been \"underestimated and underappreciated\" after drawing with Canada and beating hosts Australia.\n\"Hopefully we've proved to the world right now that we belong in a higher place [than 40th in the Fifa rankings],\" said the American.\nThere is a bit of uncertainty for Ireland going into the game, with manager Vera Pauw - whose contract ends after the tournament - saying she and her players deserve clarity over her future.\nAustralia forward Kerr's fitness will go \"down to the wire\" according to boss Tony Gustavsson, after she missed both opening games with a calf injury.\n\"There is a lot on the table to discuss and we probably won't know how we are going to use that until we are coming into the stadium tomorrow,\" said Gustavsson.\nKerr, though, has said she is \"definitely going to be available\".\nCanada's English boss Bev Priestman says her team have not even spoken about the Chelsea forward's fitness.\n\"We spoke about what it's going to take to beat Australia because Australia aren't just Sam Kerr,\" she added.\nOne star who should be fit is Canada forward Christine Sinclair, who is bidding to score in a record sixth Women's World Cup.\nBrown-Finnis' prediction for Canada v Australia: \"Australia will be devastated that they come into their final group game needing to beat Canada, when they were expected by many to be safely into the last 16 by now.\n\"Canada have not looked at their sharpest so far, but they are still very experienced in situations like this and the Matildas will need everything to come together if they are going to beat them.\n\"I don't think it will be straightforward at all for the co-hosts, but I am going to go with my heart and say they will make it - the tournament really needs them to get through too. 1-2.\"\nKey stat: Caitlin Foord and Emily van Egmond - who combined for Australia's opening goal against Nigeria last time out - have each made 14 appearances at the Women's World Cup, just one short of Lisa de Vanna's national record.\nBrown-Finnis' prediction for Republic of Ireland v Nigeria: \"The Republic of Ireland are out, but they have competed so well, exactly the way I was hoping they would.\n\"Nigeria, meanwhile, have surpassed all expectations - including my own - but fully deserve to be top of Group B. From what we've seen so far, no-one will want to play them in the last 16.\n\"A draw would be enough to send Nigeria through no matter what happens elsewhere, and the Republic would be happy with that outcome too, because it would give them their first World Cup point. 0-0.\"\nKey stat: Six of the Republic of Ireland's seven shots on target in the Women's World Cup have been made either in the first 10 minutes (four) or from the 90th minute (two).", "url": "https://www.bbc.com/sport/football/66353826"}