{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:57:04", "date_modify": "2025-05-21 07:57:04", "date_publish": "2025-03-27 19:43:16", "description": "Swansea City: Harry Darling in battle to be fit for Leeds United trip", "filename": "sport_football_articles_crewg4w0yzno_1747814224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96d2/live/556d88f0-0b26-11f0-b1de-e342f84c59e9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crewg4w0yzno_1747814224.html", "title": "Swansea City: Harry Darling in battle to be fit for Leeds United trip", "title_page": "Swansea City: Harry Darling in battle to be fit for Leeds United trip  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan says Swansea City must wait and see whether Harry Darling will be fit for Saturday's trip to Leeds United.\nCentre-back Darling has been out since picking up a hip injury during Swansea's win over Middlesbrough on 8 March.\nWith Darling in the side, Swansea kept clean sheets in their first three games under caretaker boss Sheehan.\nWithout him, they suffered successive defeats against Watford and Burnley prior to the international break.\nBut Sheehan says there are no guarantees that Darling will be feature against the leaders at Elland Road.\n\"Nothing is 100%,\" Sheehan said.\n\"Harry is back on the grass, so we'll have a look at him closer to the game.\"\nSwansea will be boosted by the return of Hannes Delcroix at Leeds after the defender was forced to sit out the 2-0 defeat to Burnley because he is on loan from the Clarets.\nSheehan, meanwhile, says Swansea are assessing a \"few bumps and bruises\" after eight players who have been away on international duty returned to their Fairwood training base on Thursday.\n\"Today is the first day we've had the group together, after coming back from South Korea, Australia, Chile, Slovenia and North Macedonia,\" he said.\n\"We have had to train with a small group, but we have now got most of the group available.\"", "url": "https://www.bbc.com/sport/football/articles/crewg4w0yzno"}