{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:25", "date_modify": "2025-05-21 05:29:25", "date_publish": "2025-01-14 14:56:27", "description": "Tottenham news: Ange Postecoglou on the north London derby", "filename": "sport_football_articles_c3rwx2lx7ndo_1747805365.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1741/live/a35b4c40-d279-11ef-9377-192b32874917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c3rwx2lx7ndo_1747805365.html", "title": "Tottenham news: Ange Postecoglou on the north London derby", "title_page": "Tottenham news: Ange Postecoglou on the north London derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham boss Ange Postecoglou says there \"is no better place to start\" winning games and picking up their form than at Emirates Stadium against Arsenal.\nSpurs will make the short trip to their neighbours on Wednesday, who are facing a similar blip in form and battle with injuries.\nSince drawing his first north London derby in September 2023, Postecoglou has lost twice at home to their fiercest rivals.\n\"I felt it was intense from the moment I arrived, but at the same time I've never tried to be disingenuous about this stuff and say 'this means the world to me' when I've literally just arrived,\" he said.\n\"But you get the context of the game and what it means to the club and supporters and what it means for our season. From that perspective, right from the first time we played them, I was well aware.\n\"It's like being up in Glasgow, you're well aware of what it means and the ramifications of both the positive and negative.\n\"This year is as big as they ever come, especially for us and our season. We have to start winning games in the league and no better place to start.\n\"Big game for the club, big game for our season, big game for our supporters... so I'm looking forward to it.\"", "url": "https://www.bbc.com/sport/football/articles/c3rwx2lx7ndo"}