{"authors": ["Andy Campbell", "www.facebook.com"], "date_download": "2025-05-21 07:42:04", "date_modify": "2025-05-21 07:42:04", "date_publish": "2025-03-28 10:56:35", "description": "The Scottish Premiership returns after a two-week hiatus, here are some names and games to look out for.", "filename": "sport_football_articles_czjer7mey44o_1747813324.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/784a/live/a203b480-0a3d-11f0-88b7-5556e7b55c5e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czjer7mey44o_1747813324.html", "title": "Scottish Premiership: Hearts' tall order, Hibs' Boyle & Kilmarnock's McInnes in focus", "title_page": "Scottish Premiership: Hearts' tall order, Hibs' Boyle & Kilmarnock's McInnes in focus - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Scottish Premiership returns after a two-week hiatus to accommodate international fixtures.\nThe table was left with still many issues to be resolved with nine points separating Hibernian in third and Ross County in ninth.\nAnd it is in that middle section of the division where most of the intrigue lies, with three rounds of games to play before the split.\nCeltic remain comfortably on course for a fourth successive top-flight title, despite their home loss to Rangers last time out.\nBrendan Rodgers' side hold a 13-point lead at the top of the division and will be champions if they win their next four matches.\nHearts, on the other hand, have work to do to secure a top-six place and challenge for Europe.\nWinning at Celtic Park is a tall order. Hearts have lost 25 of their past 27 visits in all competitions.\nBut, under Steven Naismith, Hearts did enjoy a 2-0 away win over the champions last season and Rangers have shown Rodgers' men can be beaten in their own backyard.\nShould Neil Critchley's team come away empty handed, it could have big ramifications. Hearts are sixth, a point above Motherwell, four points in front of St Mirren and Ross County and two points below Dundee United.\nFresh from helping Australia defeat Indonesia and China, Hibernian forward Martin Boyle can extend his recent resurgence at home to St Johnstone.\nBut it's not just Hibs' push for finishing third that is likely to be on Boyle's mind since the 31-year-old will soon enter the final two months of his contract.\nThe club has an option to extend his stay for another year, although Boyle has said conversations are unlikely until this term is complete.\nHe has three goals in his past five appearances for club and country. He's on to 14 for the season at Hibs, exceeding last term's haul of 11.\nHe scored the clincher in September's 2-0 win over Saints and a goal on Saturday would mean he equals his highest tally at Hibs in season 2020-21.\nWith eight games to play, Boyle will surely fancy his chances of making the current campaign his most prolific.", "url": "https://www.bbc.com/sport/football/articles/czjer7mey44o"}