{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:58:13", "date_modify": "2025-05-20 14:58:13", "date_publish": "2023-07-27 06:07:20", "description": "Simon Adingra's double sees Brighton beat Brentford 2-0 in Atlanta for their first win of the Premier League Summer Series pre-season tournament.", "filename": "sport_football_66322198_1747753093.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1574/production/_130529450_gettyimages-1572889160.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66322198_1747753093.html", "title": "Brentford 0-2 Brighton: Simon Adingra's double gives Seagulls comfortable win", "title_page": "Brentford 0-2 Brighton: Simon Adingra's double gives Seagulls comfortable win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Adingra's double saw Brighton beat Brentford 2-0 in Atlanta for their first win of the Premier League Summer Series pre-season tournament.\nIvory Coast winger Adingra, who spent last season on loan at Belgian side Union SG, struck in the 19th minute.\nHe then doubled their advantage from close range in the 58th minute.\nBrighton midfielder Moises Caicedo played the last 25 minutes - his first appearance of pre-season amid long-standing interest from Chelsea.\nThe match started in frantic fashion, with both sides nearly gifting the opposition chances when trying to play out from defence.\nBrighton took the lead when Adingra, 21, ran on to an excellent long pass from goalkeeper Jason Steele before curling past stranded Bees stopper Mark Flekken and clipping in off the inside of the post.\nBrentford pushed for an equaliser, with winger Keane Lewis-Potter seeing his shot cleared off the line by centre-back Adam Webster and striker Bryan Mbeumo flashing a shot just wide of Steele's goal.\nAdingra punished those missed chances when he curled his second past Flekken from the corner of the six-yard box after a pass from Steven Alzate.\nBrentford pushed for a way back into the match but the Seagulls ultimately won comfortably.", "url": "https://www.bbc.com/sport/football/66322198"}