{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:21", "date_modify": "2025-05-21 04:31:21", "date_publish": "2025-01-18 00:00:00", "description": "Two goals from Jean-Philippe Mateta give Crystal Palace victory over West Ham in the Premier League.", "filename": "sport_football_live_c4g9zempde4t_1747801881.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c4g9zempde4t_1747801881.html", "title": "West Ham 0-2 Crystal Palace: Jean-Philippe Mateta's double seals win", "title_page": "West Ham 0-2 Crystal Palace: Jean-Philippe Mateta's double seals win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two goals from Jean-Philippe Mateta gave Crystal Palace an away victory over West Ham in the Premier League.\nMateta latched on to a sublime through ball from Eberechi Eze before slotting low and hard past Hammers goalkeeper Lukasz Fabianski into the bottom corner.\nWith two minutes remaining, Mateta played a pass into the path of Eddie Nketiah, who was wiped out by the West Ham keeper.\nMateta's resulting spot-kick squirmed under Fabianski, as Palace sealed the win.\nGraham Potter's home side had been reduced to 10 men in the 80th minute when Konstantinos Mavropanos was shown a second yellow card after he grappled with Mateta and then launched a high boot into his face.\nThe result means Palace move up to 12th in the table, while West Ham are a point behind them in 14th place.\nThere was concern for Crystal Palace at the start of the season when they were winless in the Premier League until the last week of October, but those fears have been banished.\nGlasner's side are on a five-game unbeaten league run and looked in control once they took the lead at West Ham.\nMateta has scored eight league goals this season and 32 in total since he joined Palace, and continues to prove his worth for the South London club.\nEze has provided assists for eight of those 32 goals, with no Crystal Palace player having assisted a team-mate more often in Premier League history.\nThe pair's link-up has proved beneficial in recent games, and Palace's newest signing should add even more attacking threat.\nRomain Esse, a 19-year-old attacking midfielder, joined from Millwall earlier on Saturday and will be available for selection from next weekend's match against Brentford.\nHe has registered five goals and an assist for Millwall this season.\nPalace have now gone seven consecutive away games without losing for the first time in their top-flight history (won four, drawn three).\nMore impressively, they've also kept clean sheets in each of the last three, equalling their longest run without conceding away from home in the league.\nAfter some early season struggles, Palace look to have found their feet under Glasner.", "url": "https://www.bbc.com/sport/football/live/c4g9zempde4t"}