{"authors": ["Nick McPheat", "www.facebook.com"], "date_download": "2025-05-21 05:24:06", "date_modify": "2025-05-21 05:24:06", "date_publish": "2025-04-03 15:00:21", "description": "Michael Wimmer: Motherwell boss on contracts, Armstrong, Halliday & embracing pressure", "filename": "sport_articles_cedy9788lqdo_1747805046.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3f9b/live/0e037140-109a-11f0-acff-955625354c84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cedy9788lqdo_1747805046.html", "title": "Michael Wimmer: Motherwell boss on contracts, Armstrong, Halliday & embracing pressure", "title_page": "Michael Wimmer: Motherwell boss on contracts, Armstrong, Halliday & embracing pressure - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wimmer insists his team will be \"ready and prepared\" for the test at Rugby Park after a deep analysis session with his players on their poor 4-1 defeat at Aberdeen.\nThe Well boss is open to the possibility of extending Luke Armstrong's stay, saying the on-loan Carlisle striker is a \"very important player\" who works hard in and out of possession.\nOn Tom Sparrow, who signed a new two-year deal this week, Wimmer says: \"Tom has big potential, we can develop him. He's perfect for the playing style.\"\nThe former Austria Vienna boss says he has never managed a first-team game on an artificial surface, but will stand for no excuses about the Rugby Park pitch on Saturday.\nTo achieve a top-six finish, Wimmer says his team \"have to go all in\" and they should \"enjoy\" the pressure.\nOn a potential high turnover of players this summer, Wimmer says \"the picture's become clearer from each player\" and the club is \"now working to extend\" contracts.\nAmong those yet to sign a new deal is midfielder Andy Halliday. Wimmer would not be drawn on specific contract negotiations but says the 32-year-old is an influential player who is \"very, very important\" for him.", "url": "https://www.bbc.com/sport/articles/cedy9788lqdo"}