{"authors": ["Tino", "www.facebook.com"], "date_download": "2025-04-26 04:12:01", "date_modify": "2025-04-26 04:12:01", "date_publish": "2025-03-04 12:38:52", "description": "Celtic fan voice: 'Yang quietly penning a redemption story'", "filename": "sport_articles_cz7vl909jq2o_1745640721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/564d/live/8b0e29b0-f8f2-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cz7vl909jq2o_1745640721.html", "title": "Celtic fan voice: 'Yang quietly penning a redemption story'", "title_page": "Celtic fan voice: 'Yang quietly penning a redemption story' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "As if Daizen Maeda's mesmeric form wasn't enough for Celtic fans, Yang Hyun-jun has now decided he wants to join the party.\nAnd he's more than welcome!\nThe South Korean winger has had an indifferent time in Glasgow following his arrival in July 2023 from Gangwon FC in his homeland, but if recent evidence is anything to go by that's about to be flipped on its head.\nHis match-winning performance in Paisley on Saturday was the latest episode in the 22-year old's redemption story at Celtic, but in truth he's been quietly penning those chapters since the turn of the year.\nFive goals and five assists in just 558 minutes played in 2025 tell us that on current form he's now providing a goal contribution every 55 minutes.\nPretty incredible for a player many fans had consigned to the ever-growing pile of ineffective signings from THAT failed transfer window of summer 2023.\nBut while it looks like there's no future in Glasgow for the likes of Gustaf Lagerbielke, Maik Nawrocki and fellow countryman Kwon Hyeok-kyu, Yang – who joined as the K League's young player of the year - seems determined to prove the club were right to offer him a five-year deal in the first place.\nFor a then 21-year-old to make the 9,000km move from South Korea to Scotland can't have been easy but now he seems far more at ease in his adopted homeland.\nThe key for the youngster is to maintain the consistency he has found recently, but there's no doubt he has the backing of the manager, and that in turn should give him the confidence to do so.\nBrendan Rodgers deserves a great deal of credit for sticking by a player who has looked shorn of belief in large spells this season. The manager persevered and is now seeing the benefits.\nThe majority of the credit must go to the player himself. He has never shied away from the challenges of breaking into a side with talents such as Nicolas Kuhn, James Forrest, Maeda and now Jota occupying the wide areas.\nCrucially he also has the backing of his team-mates and that could be seen clearly in how they celebrated with him on Saturday night.\nSpeaking after Yang's 26-minute man-of-the-match display against St Mirren, Arne Engels said: \"It was just unbelievable. I'm really happy for him. Yang is always training at 100%. A really amazing performance from him.\"\nThe key, however, at Celtic isn't what you did in the last game, it's what you'll do in the next one, and that now means Sunday's Scottish Cup quarter-final with Hibs.\nIf Yang can add to those 10 goal contributions this weekend, and follow it up against Rangers the following week, we may well be looking at the latest rising star in this increasingly exciting team that Rodgers is building.", "url": "https://www.bbc.co.uk/sport/articles/cz7vl909jq2o"}