{"authors": ["Matthew Raisbeck", "www.facebook.com"], "date_download": "2025-05-21 05:19:35", "date_modify": "2025-05-21 05:19:35", "date_publish": "2025-01-14 18:06:03", "description": "Newcastle news: Opinion - Isak, Guimaraes and Gordon will not need to be sold", "filename": "sport_football_articles_cx24nr01r1no_1747804775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d08/live/c3f9bfc0-5f03-11ef-8c32-f3c2bc7494c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx24nr01r1no_1747804775.html", "title": "Opinion - Isak, Guimaraes and Gordon will not need to be sold - BBC Sport", "title_page": "Newcastle news: Opinion - Isak, Guimaraes and Gordon will not need to be sold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Magpies were under PSR pressure last summer when, in a frantic, late attempt to avoid sanctions, they reluctantly sold young academy graduate players Elliot Anderson and Yankuba Minteh for more than £60m combined.\nCEO Darren Eales later said: \"We do not want to be leaving ourselves in that situation again in such tight circumstances.\"\nWhile two significant sales gave them a little more headroom, PSR continues to restrict their ability to spend big - and it now seems likely they will go through a third transfer window without making a major signing.\nBut, most importantly for Eddie Howe and the Newcastle fans, they do not have to sell star names like Alexander Isak, Bruno Guimaraes and Anthony Gordon to balance the books.\nHowe said on Tuesday: \"I think the club were educated last year. For us what happened last year was very difficult. It had a knock-on effect on what happened in the summer; PSR continues to affect our decision-making, whether that is a contract renewal - or whatever the situation regarding our squad - we have to think long and hard about making a decision.\"\nListen to full commentary on every Newcastle United game, and have your say on the Magpies on Total Sport North East every weeknight from 18:00, on BBC Radio Newcastle.\nAnd subscribe to the Total Sport Newcastle United Podcast on BBC Sounds", "url": "https://www.bbc.com/sport/football/articles/cx24nr01r1no"}