{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:19", "date_modify": "2025-05-21 06:01:19", "date_publish": "2025-01-08 00:00:00", "description": "Lucas Bergvall scores later winner as Tottenham beat Liverpool 1-0 in Carabao Cup semi-final first leg.", "filename": "sport_football_live_cd608x6l01dt_1747807279.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cd608x6l01dt_1747807279.html", "title": "Tottenham 1-0 Liverpool: Lucas Bergvall scores late winner as Spurs beat Liverpool in Carabao Cup semi-final first leg", "title_page": "Tottenham 1-0 Liverpool: Lucas Bergvall scores late winner as Spurs beat Liverpool in Carabao Cup semi-final first leg - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nFT: Tottenham 1-0 Liverpool\nThat's the semi-final first legs of the Carabao Cup done.\nNewcastle beat Arsenal 2-0 yesterday with the second leg at St James' Park on 5 February, and now Tottenham have a 1-0 lead to take to Liverpool for their second leg at Anfield a day later.\nYou don't have long to wait for more cup action though, as the FA Cup third round will be played from Thursday to Monday.\nHope you can join us tomorrow for the start of it. Thanks as always for your company and comments. Goodnight.\nSpurs beat Liverpool in semi-final first leg - read the report\nFT: Tottenham 1-0 Liverpool\nPhil McNulty\nBBC Sport chief football writer at Tottenham Hotspur Stadium\nTottenham edged out Liverpool in a controversial finale to their Carabao Cup semi-final first leg.\nLucas Bergvall gave Spurs a narrow advantage to take to Anfield - but Liverpool were left raging that the 18-year-old was on the pitch to make the decisive contribution four minutes from time.\nBergvall was on a yellow card when he caught Liverpool defender Kostas Tsimikas late in an incident not seen by referee Stuart Attwell.\nTsimikas was still off the pitch when Bergvall scored moments later, prompting a furious reaction from head coach Arne Slot, who was cautioned.\nSpurs deserved the win after Pedro Porro missed a great chance and Dominic Solanke saw a goal ruled out for offside, but the manner of their win will leave a bitter taste for Liverpool, who suffered only their second defeat under Slot.\nAnd the victory for Postecoglou's side, who were already without 10 players through injury and illness, came after they lost Rodrigo Bentancur amid worrying scenes early on. He went down in the penalty area and was taken off on a stretcher wearing a neck brace after 10 minutes of treatment.\nIt was later confirmed he was conscious, talking and would undergo further checks in hospital.\n'A loss is not what we deserved'\nFT: Tottenham 1-0 Liverpool\nLiverpool\nLiverpool boss Arne Slot, speaking to Sky Sports: \"It didn't feel to me we were ever going to lose here.\"\nOn the referee's performance and whether Lucas Bergvall should have had a second yellow card: \"The decision he made had a lot of impact on the result tonight. There's not a lot I can say from that.\n\"The fourth official told me why he thought it wasn't a second yellow and he heard that probably from the referee. What we can say about it is that he said he didn't stop the counter attack, every manager would say they prefer the second yellow than a counter attack that goes on.\n\"It is what it is, we hate to lose but the positive is that it is better to lose when there is a second leg.\"\nMore on the game: \"It was a game where both teams wanted to press the other high, both wanted to bring the ball out from the back. I liked this performance from us a bit more than the one on Sunday but it is a completely different game.\n\"I do agree that we played one of the best, probably the best games, two weeks ago against Tottenham.\n\"This performance today was definitely good enough to get a result. To go away with a loss is definitely not what we deserved.\"\n'I'm a big dreamer...I have never dreamt this one'\nFT: Tottenham 1-0 Liverpool\nTottenham Hotspur\nTottenham goalkeeper Antonin Kinsky speaking to Sky Sports: \"I would say I'm a big dreamer, I always make my own visions of the future. Probably this dream I have never dreamt this one yeah, amazing.\n\"I'm really happy for the whole club. I came three days ago, everything worked so good, all the people are kind. I'm so happy for them and the whole team but this is just the first leg.\"\nOn who he was celebrating with at the end: \"It was my sister because yesterday I got to know there is a possibility of me being in goal today so I called them immediately, my sister came, her boyfriend, my parents, I was so happy to have them here on such a special night.\n\"That was him [his dad, a former goalkeeper, shown in the stands] I hope he’s proud. The whole family, my grandfather was also a goalkeeper, he was watching as well. I hope they are all happy.\"\n'I have seen so much growth'\nFT: Tottenham 1-0 Liverpool\nTottenham Hotspur\nMore Tottenham manager Ange Postecoglou, speaking to Sky Sports: \"We are having to deal with adversity all the time. We started really well and then lost a key player. This lot are nothing if not resiliant and they keep going and they did today.\n\"It is incredible when you think we had a couple of 18-year-olds out there. I have just seen so much growth. I have no doubt we will get through this period and get players back, what I've found in the meantime is we have some real players to help us to be the team we want to be.\"\nOn goalkeeper Antonin Kinsky making his debut: \"That is a big occasion for a young man. He handled himself outstandingly.\"\nOn Dominic Solanke: \"I don't know where he gets the energy from. He keeps soldiering on. An unbelievable finish, I thought we deserved it on the night. We deserved the victory and really pleased the players get rewards.\"\nOn VAR announcement: \"If people think that announcement added anything to the game tonight then I am sorry. It used to be you put your flag up and the game goes on, but anyway.\"\nOn the tie: \"It is only half-time and going to Liverpool is not easy but just that feeling of having a victory against a really strong opponent I want the players to feel good about it.\"\nOn saying before about always winning a trophy in his second season: \"People can keep mocking me about it but we will see.\"\n'We take it on the chin'\nFT: Tottenham 1-0 Liverpool\nLiverpool\nMore from Liverpool captain Virgil van Dijk speaking to Sky Sports: \"We played against an intense team with good attacking players, they can make it difficult, keep running.\n\"We created good moments, good opportunities at times, not really clear-cut chances in my opinion but still enough that we could have scored, unfortunately but we didn’t.\n\"It’s half-time now and I’m looking forward to the game back at Anfield.\"\nOn whether they were a level or two below their best: \"At times I think we could have done better, that’s part of football as well. We try to play our best game, every one of us and at times we played through them nicely and created some one v ones and some dangerous moments. They were able to defend it better than they did when we played here a couple of weeks ago.\n\"We move on, we take it on the chin, it's half-time, we have another 90 plus minutes to go and I’m really looking forward to them.\"\nVan Dijk unhappy at referee's 'mistake'\nFT: Tottenham 1-0 Liverpool\nLiverpool\nLiverpool captain Virgil van Dijk speaking to Sky Sports about what he said to the officials at the end of the game: \"I think it was quite obvious it was going to be a second yellow [for Lucas Bergvall]. I think it was pretty clear. It was a coincidence and a minute later he scores the winner.\n\"It is what it is. He [the referee] made a mistake in my opinion and I told him that. He thinks he didn’t but it was quite obvious I think and everyone on the sidelines knew it was supposed to be a yellow.\n\"There's a linesman there, a fourth official there, there's VAR, a referee and he doesn't get a second yellow. I’m not saying this is the reason why we lost tonight but it was a big moment in the game.\"", "url": "https://www.bbc.com/sport/football/live/cd608x6l01dt"}