{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:42:00", "date_modify": "2025-05-20 13:42:00", "date_publish": "2023-08-01 13:59:44", "description": "What can be expected of the 'box office yo-yo' club this season?", "filename": "sport_articles_cp4n0d8417vo_1747748520.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb0c/live/b64da190-3072-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cp4n0d8417vo_1747748520.html", "title": "What can be expected of the 'box office yo-yo' club this season?", "title_page": "What can be expected of the 'box office yo-yo' club this season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Daniel Smith, Up Wi' The Bonnets podcast, external\nWelcome to the Dundee weekly fan column. If there is one thing I can promise you all, is that we will always have something to write about as we all know, Dundee FC are box office, albeit maybe not for all the right reasons much of the time...\nWe enter this new Premiership season full of optimism. A new manager, new signings and a new hope that we can finally make a go at cementing ourselves as a mainstay in the top-flight.\nWe’ve got the label as a yo-yo club and it’s about time this club tried to banish this to unwanted comparison.\nOf course, our other label as being trophy virgins lays intact for the foreseeable after our run of the mill exit in the League Cup by just one goal on Sunday. Regardless, it’s not stopped me looking at the season ahead through my dark blue tinted glasses.\nWe’ve made some good signings this summer. Scott Tiffoney, Joe Shaughnessy, Jon McCracken and Owen Beck are the pick of the nine signings we have made so far. Fling in the twa Mexicans that have signed on and we could very well be looking at a title winning squad being assembled. Either that, or a comfortable bottom six finish.\nIt will be a season of fine margins really.\nRegardless, we will have plenty to talk about this season so bear with me, this will get funnier, especially when I’m trying to cover the pain of seeing all my hopes being dashed in true Dundee fashion...\nPredicted finish: A reasonable 8th\nStandout player will be: Lyall Cameron. This boy is a player.", "url": "https://www.bbc.com/sport/articles/cp4n0d8417vo"}