{"authors": ["Jack Skelton", "www.facebook.com"], "date_download": "2025-05-21 07:44:09", "date_modify": "2025-05-21 07:44:09", "date_publish": "2024-12-23 19:25:07", "description": "England Test captain Ben Stokes requires surgery on a torn left hamstring and is ruled out of all cricket for at least three months.", "filename": "sport_cricket_articles_cy095ngzn2lo_1747813449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/333c/live/35ad87b0-c164-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cy095ngzn2lo_1747813449.html", "title": "Ben Stokes: England Test captain out for at least three months with torn left hamstring", "title_page": "Ben Stokes: England Test captain out for at least three months with torn left hamstring - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England Test captain Ben Stokes requires surgery on a torn left hamstring and has been ruled out of all cricket for at least three months.\nStokes, 33, suffered the injury while bowling on day three of the third Test against New Zealand earlier this month.\nIt is the second time Stokes has torn his left hamstring this year, having sustained the same injury while playing in The Hundred in August.\nEngland said Durham all-rounder Stokes will have surgery in January.\n\"Something else to overcome - go on then,\" Stokes posted on X., external\n\"I've got so much more left in this tank and so much more blood sweat and tears to go through for my team and this shirt.\n\"There's a reason I have a phoenix permanently inked on my body.\"\nStokes was not included in England's squads for the white-ball tour of India and the Champions Trophy in January and February because of the injury.\nHe had been set to play for MI Cape Town in the SA20, South Africa's franchise T20 league, in January but will now miss the tournament.\nEngland's next Test is not until they face Zimbabwe at Trent Bridge in May.\nStokes will be aiming to be fit again for the first round of the County Championship, with Durham facing Nottinghamshire at Trent Bridge on 4 April, though that will depend on his recovery from surgery.", "url": "https://www.bbc.com/sport/cricket/articles/cy095ngzn2lo"}