{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:28", "date_modify": "2025-05-21 05:59:28", "date_publish": "2025-04-05 00:00:00", "description": "Aston Villa survive a stirring Nottingham Forest comeback to boost their bid for a Champions League place with victory at Villa Park.", "filename": "sport_football_live_cdrgj57mdpzt_1747807168.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1054/live/3838a950-124b-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cdrgj57mdpzt_1747807168.html", "title": "Aston Villa 2-1 Nott'm Forest: Hosts survive fightback to boost European hopes", "title_page": "Aston Villa 2-1 Nott'm Forest: Hosts survive fightback to boost European hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aston Villa survived a stirring Nottingham Forest comeback to boost their Champions League hopes.\nVilla looked in total control against Forest, lying third in the Premier League, when quick-fire goals from Morgan Rogers and Donyell Malen gave them a 2-0 lead after only 15 minutes.\nRogers ran clear to score with a composed finish before Malen timed his arrival in the six-yard area perfectly to turn in Ian Maatsen's inviting cross two minutes later.\nForest - with their own Champions League qualification ambitions - cleared their heads after a dreadful start to play their way into the game and both Anthony Elanga and Callum Hudson-Odoi were only inches away before the break.\nThis season's Premier League surprise package continued their improvement after the interval, getting their reward when substitute Jota Silva scored on the turn after 57 minutes.\nForest came close again as efforts from Elliot Anderson and Neco Williams were just wide, while Rogers almost put Villa out of sight after a superb solo run forced a fine save from keeper Matz Sels.\nThere was drama right to the end, as Forest's Murillo crashed a long-range effort against the crossbar, then Sels denied substitute Marcus Rashford when he was clean through.\nVilla's win moved them to within one point of Chelsea in fourth place, while Forest remain in third despite this setback.\nAston Villa's dream start was transformed into an almighty second-half struggle, but they stood firm to secure another vital victory.\nUnai Emery's side started with a pace and fierce intensity that Forest were unable to cope with. The goals from Rogers and Malen were no more than they deserved.\nRogers was at the heart of Villa's best work, while Youri Tielemans orchestrated affairs from midfield.\nIt was a different story in the second half after Silva scored, as Villa Park's mood changed from one of elation to nerves.\nVilla held on, though, despite several scares and might have even added further goals of their own through Rogers and, in the closing seconds, Marcus Rashford.\nIt capped the perfect week for Villa after setting up an FA Cup semi-final with Crystal Palace at Wembley by winning at Preston North End, before claiming six points from tough-looking assignments at Brighton and here against in-form Forest.\nAnd it is the ideal preparation for their Champions League quarter-final first leg away to Paris St-Germain on Wednesday.\nNottingham Forest will have left Villa Park bitterly disappointed on two counts - cursing a slow start that had them two goals down early on, and feeling they might have claimed a point when they finally got going.\nForest were uncharacteristically off the pace early on, allowing Villa to stamp their authority on the game, dominance confirmed by the goals from Rogers and Malen.\nWhen Forest finally clicked into gear, they showed all the qualities that have made them such a force this season - putting Villa Park in the grip of anxiety for most of the second half.\nAnd for a side whose trademark during an outstanding season has been hitting teams on the break, they showed they can be brave when backed into a corner and have to force the pace.\nSadly for Forest and manager Nuno Espirito Santo, they left themselves too much to do, although they were right in the hunt for a point until the final whistle, which they almost snatched in the most spectacular fashion when defender Murillo unleashed that 30-yard piledriver that struck the bar with Villa keeper Emiliano Martinez comprehensively beaten.", "url": "https://www.bbc.com/sport/football/live/cdrgj57mdpzt"}