{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:49:13", "date_modify": "2025-05-20 14:49:13", "date_publish": "2023-07-28 00:00:00", "description": "All the latest transfer news as Riyad Mahrez signs for Saudi side Al-Ahli and Brighton reject Chelsea bid for Moises Caicedo.", "filename": "sport_live_football_66334504_1747752553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5F9B/production/_130557442_mahrezsplit.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66334504_1747752553.html", "title": "Transfer news latest: Riyad Mahrez, Moises Caicedo & Harry Kane", "title_page": "Transfer news latest: Riyad Mahrez, Moises Caicedo & Harry Kane - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks for joining us\nThat's all from us today football, but you can stay up to date on all the latest football news on the BBC Sport index.\nIt's been a mixed day for England's Lionesses. Sarina Wiegman's side are on the brink of reaching the knockout stages of the Women's World Cup after Lauren James' sublime strike sealed a 1-0 win against Denmark. Read the full match report here.\nHowever, they suffered a blow with a suspected knee injury to Kiera Walsh.\nElsewhere in Group D, China earned their first victory of the tournament with a 1-0 win over Haiti, despite playing most of the game with only 10 players. Check out the full report here.\nIn transfer news, Al-Ahli have confirmed the signing of Algeria winger Riyad Mahrez from Manchester City in a deal worth £30m.\nAnd ahead of the new season, the English Football League have announced plans that will make added time more accurate. You can read more about that here, external.\nChelsea target Southampton's Lavia after Caicedo rejection\nToday's Gossip column\nChelsea\nChelsea feature heavily in today's Gossip column.\nThe Athletic, external are reporting that Southampton's 19-year-old Belgium midfielder Romeo Lavia may be the Blues' next target, after an £80m bid for Brighton and Ecuador midfielder Moises Caicedo was rejected.\nArgentina forward Paulo Dybala, 29, who is a potential target for Mauricio Pochettino, looks set to sign a new contract with current club Roma, according to Italian outlet Tuttomercatoweb., external\nWhile Ajax's Ghana midfielder Mohammed Kudus, 22, has expressed a strong preference for joining Arsenal at Chelsea's expense, according to Football Transfers., external\nChelsea also have had a bid for 20-year-old Montpellier striker Elye Wahi rejected. The Standard , externalreports that the bid was worth up to £24m.\nAnd finally, Fabrizio Romano, external reports that Chelsea's England winger Callum Hudson-Odoi, 22, has been the subject of a £4m bid from Fulham.\nKeep up to date on all the latest Chelsea news and transfers by following their club page here.\nBayern in talks with Brentford over Raya move\nToday's Gossip column\nIt was reported in today's Gossip column, via a story in The Times, external, that Bayern Munich are interested in Brentford's Spain goalkeeper David Raya, 27.\nSky Sports, external are now reporting that Bayern have opened talks with Brentford but their \"expectations have not yet been reached\".\nRaya has one year remaining on the four-year contract he signed at Brentford in October 2020, while Bayern Munich are looking for a replacement for Yann Sommer, who is in talks with Inter Milan over a move to the San Siro, according to Sky Sports.\nMan Utd fans would take relegation over Glazer ownership\nSimon Stone\nBBC Sport in San Diego\nThe 1958 Group of Manchester United fans created a bit of a stir earlier this week when, speaking to the BBC's 'How To Buy A Football Club' podcast, they claimed they would prefer United to go down if it meant the Glazers left the club.\nThey ran a poll in the wake of the podcast's release and from 12,000 respondents, 72% said they would go down for a season.\nObviously there is no for us to verify that and clearly Manchester United have a lot more than 12,000 fans but it does underline the strength of feeling despite the club spending over £100m on Mason Mount and Andre Onana this summer.\nPinsoglio's shootout saves help Juve beat Milan\nJuventus 2-2 AC Milan (Juventus win 4-3 on penalties)\nAs the Women's World Cup nears the final round of group matches, pre-season for Europe's top men's teams continues.\nIn the United States, Juventus beat AC Milan 4-3 on penalties after their friendly ended in a 2-2 draw on Thursday.\nThe two Serie A giants produced an interesting hour at the Dignity Health Sports Park, the home of Major League Soccer's Los Angeles Galaxy, before mass substitutions from both teams saw the game fizzle out.\nMilan twice took the lead, only to be pegged back. German defender Malick Thiaw headed them in front on 23 minutes before Juve's Danilo equalised 10 minutes later following a scramble in front of goal.\nOlivier Giroud restored the Rossoneri's lead six minutes before the break through a well-taken volley on the turn, but then deflected a Daniele Rugani flick past his own keeper to put Juventus back on level terms.\nJuve's back-up keeper Carlo Pinsoglio then saved three spot-kicks in the shootout to ensure a win for Massimiliano Allegri's team.\nMilan take on Barcelona in Las Vegas on Tuesday, while Juve finish the Soccer Champions Tour against Real Madrid in Orlando on Wednesday.\nChina beat Haiti despite first-half red card\nChina 1-0 Haiti\nChina earned their first victory at the 2023 Women's World Cup by beating Haiti in Group D, despite playing for more than an hour with only 10 players.\nThe win for China means England, who beat Denmark 1-0 earlier on Friday, have not qualified for the last 16 yet.\nMidfielder Zhang Rui was sent off after 29 minutes for a dangerous knee-high challenge on Haiti's Sherly Jeudy.\nBut Wang Shuang scored the only goal, converting a 74th-minute penalty after Ruthny Mathurin fouled Zhang Linyan.\nEngland would have advanced to the knockout stages with a match to spare if China had drawn or lost to a Haiti side ranked 53rd in the world.\nThe last matches in the group take place on Tuesday, with leaders England, on six points, playing against China, while Denmark face Haiti at the same time.\nRead the full match report here.\nDier 'upset' he did not do more for Dele\nEric Dier is upset he \"didn't do more\" to help former Tottenham team-mate Dele Alli.\nDele, who is now at Everton, recently said he was \"molested\" aged six, started smoking aged seven and was dealing drugs at eight years old.\nHe also revealed he spent six weeks in rehab because of a sleeping pill addiction and mental health issues.\n\"Obviously, it was difficult to watch,\" Spurs defender Dier told various newspapers, external about Dele's interview.\n\"Lots of stuff, not everything, but quite a lot of it I knew already. I was with him just a week before, he was at my wedding.\n\"I don't know what to say about it. I don't want to say anything that I haven't said to him. I wouldn't do that. For me it was, as I said, it was difficult to watch, upsetting.\n\"I think my overwhelming feeling, which I said to him as well, is probably I'm upset that I didn't do more.\"\nRead the full story here.\nWrexham regularly flew to non-league matches\nWrexham's Premier League ambitions have seen them rubbing shoulders with some of the world's biggest clubs on a pre-season tour of the United States, taking on Chelsea and Manchester United in front of packed stadiums in Florida and San Diego.\nFlying to North America for high profile fixtures would appear to make commercial sense for the newly promoted Welsh side riding the wave of interest generated by their high-profile owners Ryan Reynolds and Rob McElhenney.\nBut as Wrexham returned to the football league after a 15-year absence last season, BBC Sport research showed they also took eight domestic return flights to non-league rivals including Eastleigh, Gateshead and Barnet.\nFourteen of those 16 journeys departed from and returned to Manchester Airport. The shortest flight was just 29 minutes and the average flight time was 43.5 minutes.\nMany Premier League clubs choose to fly to domestic games to aid with player recovery around a crowded fixture schedule, but the environmental damage caused by short-haul flights means they have become increasingly controversial in sport in recent years.\nThe BBC found no evidence of any other clubs flying in the National League last season.\nClick here for the more on this story.\nget involved\nGet Involved - should stoppage time be more accurate?\n#bbcfootball, WhatsApp on 03301231826 or text 81111 (UK only, standard message rates apply)\nFor the rest of the afternoon, we would like to hear your views on the English Football League's plan to introduce a more \"accurate\" way to calculate added-on time.\nRemember, a similar move was introduced by Fifa at the 2022 World Cup in Qatar, which led to much longer periods of stoppage time.\nWhat do you think? Click thumbs up if you think the move is needed, thumbs down if you are happy with the current system.\nPlease get in touch with your views on Twitter, text or WhatsApp using the contact details above.\nEFL games set to last longer under new time rules\nThe English Football League is to introduce a more \"accurate\" way to calculate added-on time during matches this season.\nMatch officials are being told to add the exact time taken for certain events - like goals and substitutions - rather than the previous \"nominal\" amount.\nA multi-ball system will also be used to help keep stoppages to a minimum when the ball goes out of play.\nThe EFL's plans also include changes over how injured players are treated.\nFootball's law makers - the International Football Association Board (Ifab) - announced its wish to \"create fairer conditions for both teams in terms of the amount of time available in a match\" at the start of the year and those guidelines form the basis for the EFL's initiative.\nRead more on this story here.\nRonaldo showed the way for Man Utd's Dalot\nSimon Stone\nBBC Sport in San Diego\nManchester United full-back Diogo Dalot says he is indebted to fellow countryman Cristiano Ronaldo for teaching him the importance of discipline.\nRonaldo’s time at Old Trafford ended in controversy last December, when he had his contract cancelled in the wake of his hugely controversial interview with Piers Morgan, when he said he had ‘no respect’ for United manager Erik ten Hag.\nEvidently, for Ronaldo’s team-mates, the relationship is significantly different.\nAnd Dalot, who in May signed a five-year contract extension with United, said Ronaldo was a positive influence.\n“He helped me a lot outside the pitch,” he said. “The discipline he has – and had through all his career – brought me a lot.\n“I will keep some things to myself but the general thing is his discipline. You can be consistent, but consistent in a bad way. He was disciplined and consistent in a good way.\n“It was a joy for me to play with him and to be his team-mate.”", "url": "https://www.bbc.com/sport/live/football/66334504"}