{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:49", "date_modify": "2025-05-21 07:31:49", "date_publish": "2024-12-23 17:14:56", "description": "Dundee boss Docherty hoping to get 'ahead of the game' with Monterrey partnership", "filename": "sport_articles_cwy8w94130jo_1747812709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a214/live/18844c90-c151-11ef-9c2a-c910c1a61425.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwy8w94130jo_1747812709.html", "title": "Docherty hoping to get 'ahead of the game' with Monterrey partnership", "title_page": "Dundee boss Docherty hoping to get 'ahead of the game' with Monterrey partnership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tony Docherty hopes Dundee's partnership with Mexican club Monterrey will help his side be \"ahead of the game\" following the arrival of 19-year-old Cesar Garza on loan.\nThe defensive midfielder has arrived in Dundee ahead of a January loan move and comes with first-team experience with the five-times CONCACAF Champions League winners.\n\"He's a good character,\" Docherty said.\n\"Obviously our experience with Antonio Portales and the amount that we've watched him, we're confident we're bringing in a really good player and again, it will increase competition for places.\n\"Antonio was a young player at Monterrey himself, so he knows. He's been here, he's settled in.\n\"He's come in and he's met the rest of the boys and he'll train with us over the next couple of days, but really excited to get him in the building.\n\"The thing I really need to commend the club on, particularly [owners] John Nelms and Tim Keyes, we're always thinking outside the box. Where can we look at another market?\n\"We've established a partnership with a fantastic club in Monterrey.\n\"The by-product of that is that we'll get good players in, they'll get good experience coming and playing in Scotland and it's just another way you're trying to be a wee bit ahead of the game.\"", "url": "https://www.bbc.com/sport/articles/cwy8w94130jo"}