{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:44:35", "date_modify": "2025-05-21 07:44:35", "date_publish": "2025-05-20 12:22:18", "description": "Former Liverpool and Spain keeper Pepe Reina will retire from playing at the end of this season after more than 1,000 professional matches.", "filename": "sport_football_articles_cx2xx49gge5o_1747813475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f81b/live/d978e200-3571-11f0-a288-d583f745f4b6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2xx49gge5o_1747813475.html", "title": "Pepe Reina: Former Spain and Liverpool keeper to retire aged 42", "title_page": "Pepe Reina: Former Spain and Liverpool keeper to retire aged 42 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Spain and Liverpool keeper Pepe Reina will retire from playing at the end of this season.\nThe 42-year-old is currently at Italian club Como, who will play the final game of their campaign when they host Inter Milan in Serie A on Friday.\nReina, who came through the Barcelona academy, was part of the Spain squad which won the 2010 World Cup and the European Championship in 2008 and 2012.\nHe joined Liverpool from Villarreal in 2005 and won the FA Cup and League Cup with the Reds as he also claimed the Premier League Golden Glove award - given to the top-flight keeper with the most clean sheets - three seasons in a row from 2005-06.\nReina made 394 appearances for Liverpool before leaving in 2014 and going on to have spells at Bayern Munich, Napoli, AC Milan, Aston Villa, Lazio, Villarreal and Como.\nHe played the 1,000th competitive game of his career in 2023 when he turned out for Villarreal in 2023.\n\"A very beautiful career is coming to an end, a very full life,\" Reina told Movistar. \"I feel very fortunate for what I've experienced.\n\"I didn't expect it, but I think the time has come and I feel like bringing it to a close here.\"", "url": "https://www.bbc.com/sport/football/articles/cx2xx49gge5o"}