{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:32", "date_modify": "2025-05-21 06:07:32", "date_publish": "2025-01-04 22:36:59", "description": "Carrick Rangers manager Stephen Baxter says his side's 4-3 comeback win over Championship side Newry City was \"helter-skelter cup football at its best\".", "filename": "sport_articles_c9wlzk10yqqo_1747807652.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d183/live/7cb14330-cae8-11ef-8a5a-5de16dcbcfda.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9wlzk10yqqo_1747807652.html", "title": "Irish Cup: 'Helter-skelter cup football at its best'", "title_page": "Irish Cup: 'Helter-skelter cup football at its best' - Carrick boss Baxter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carrick Rangers manager Stephen Baxter says his side's 4-3 Irish Cup fifth-round win over Championship side Newry City at Taylors Avenue was \"helter-skelter cup football at its best\".\nThe Premiership team trailed 2-0 before the 20-minute mark courtesy of goals from Lorcan Forde and Ryan McNickle.\nIn the space of five manic minutes, the sides then traded four goals. Nedas Maciulaitis fired home his side's opener on 27 minutes before turning provider for Seanan Clucas to level the game two minutes later.\nWithin 60 seconds, Newry were back in front when debutant Jamie Doran bundled home Forde's cross, but their lead was short-lived, as Danny Gibson made it 3-3 at the other end.\nLuke McCullough scored the winning goal four minutes into the second half.\n\"Both teams went at it, both teams were here to try and play football, try to score goals,\" Baxter told BBC Sport NI after Saturday's game.\n\"We've had three 0-0 draws in our past three league games so I said to the team today, 'let's have a go at this', so we attacked the box.\n\"For me too many defensive errors though. The goals were soft, particularly the second and third goals for them, so that was disappointing from our point of view.\"\nThe former Crusaders boss praised the approach of his opponents.\n\"Newry put it up to us and fair play to them for doing that. They came to have a right good go and I like that. That's the way the game should be played.\n\"But we didn't panic in the game. We were 2-0 down and 3-2 down but we still won the game 4-3 and to be fair we missed four chances at the end of the game that on any given day we should really score.\"", "url": "https://www.bbc.com/sport/articles/c9wlzk10yqqo"}