{"authors": ["Ian Westbrook", "www.facebook.com"], "date_download": "2025-05-21 07:46:19", "date_modify": "2025-05-21 07:46:19", "date_publish": "2025-05-20 11:36:50", "description": "Brentford news: Opinion - Bees buzz into the final weeked with Europe still in sight", "filename": "sport_football_articles_cx2e7pj17kqo_1747813579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3eee/live/caf4a690-f0d7-11ee-b0e1-b9dd5ac46984.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2e7pj17kqo_1747813579.html", "title": "Opinion - Bees buzz into the final weeked with Europe still in sight - BBC Sport", "title_page": "Brentford news: Opinion - Bees buzz into the final weeked with Europe still in sight  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "What a disappointing weekend that was to be a Brentford fan.\nFirst of all, we had to not support the underdog in the FA Cup final, because of the way a Crystal Palace victory would affect our European chances, and then we lost at home to rivals Fulham.\nI should say that I am genuinely pleased for a couple of Palace friends that they won the cup - despite the impact for the Bees.\nDespite all that, Brentford go into the season's final weekend with our European qualification hopes still alive - just.\nTo make it, we need to finish eighth and then hope that Chelsea both win the Conference League and also finish outside the top five.\nWhether or not we do it, what an achievement it would be if we could finish in the top half of the Premier League for the second time in four seasons.\nIt has been another great campaign, filled with some cracking football, exciting matches and plenty of goals. For both Bryan Mbeumo and Yoane Wissa to score 19 is some feat.\nIt is also great to be going into Sunday's final match with something to play for.\nFinally, a quick word about Ben Mee, who will be leaving us in the summer.\nHe was superb in his first season with us in 2022-23 - when he only missed one Premier League game - helping us to finish ninth. He was also voted supporters' player of the year.\nBut he has been used sparingly in the past two years, so, as he is out of contract, he deserves to go somewhere where he will play regularly again - and I am sure he will have plenty of offers.", "url": "https://www.bbc.com/sport/football/articles/cx2e7pj17kqo"}