{"authors": ["Ellie Thomason", "www.facebook.com"], "date_download": "2025-05-21 06:55:05", "date_modify": "2025-05-21 06:55:05", "date_publish": "2025-01-31 09:34:10", "description": "Manchester United boss Marc Skinner said having the world's most expensive female player Naomi Girma is brilliant for the Women's Super League, but the spending \"skews the market\".", "filename": "sport_football_articles_crm7dd7wnzgo_1747810505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/946c/live/6f88e860-dfb6-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crm7dd7wnzgo_1747810505.html", "title": "Marc Skinner press conference: Tottenham v Man Utd preview", "title_page": "Marc Skinner press conference: Tottenham v Man Utd preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United boss Marc Skinner said having the world's most expensive female player Naomi Girma is brilliant for the Women's Super League, but the spending \"skews the market\".\n\"With my women's football hat on it is fantastic that we can get to this level of investment in the women's game,\" Skinner said.\n\"Chelsea are top of the league and clear and as Manchester United manager I want to be ultra competitive and try and push them as much as possible. I also understand I have been in it when there is no money in the game. I am happy the investment has come in.\n\"Does it widen the gap? It definitely skews the market. It's fantastic for the women's game, the growth and development in such a short period of time. But we may potentially see fallouts and how it affects everybody else.\n\"It has to make you try harder. That is the reality. On the pitch you have to find solutions, you have to adapt. I don't know if many players of that level have been signed in these types of window before. For us it is a challenge but all we can do and all we will ever do is just be us, focus on what we can control.\"", "url": "https://www.bbc.com/sport/football/articles/crm7dd7wnzgo"}