{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:59:43", "date_modify": "2025-05-21 05:59:43", "date_publish": "2025-01-04 18:23:56", "description": "Truro City manager John Askey praises his players as they score a stoppage time winner to beat Hornchurch 2-1 in National League South.", "filename": "sport_football_articles_cwydzjlpg77o_1747807183.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/733c/live/94db1370-cac8-11ef-bb47-87a9dea68aa1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwydzjlpg77o_1747807183.html", "title": "Truro City get late winner in dramatic 2-1 Hornchurch victory", "title_page": "Truro City get late winner in dramatic 2-1 Hornchurch victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Truro City manager John Askey has praised his players as they scored a stoppage time winner to beat Hornchurch 2-1 in National League South.\nIn a game played in freezing conditions Billy Palfrey gave City a 1-0 lead after 82 minutes as he curled in an effort after Dominic Johnson-Fisher's cross was not properly cleared.\nBut a defensive mix-up saw Darren McQueen equalise in the first minute of stoppage time, only for Andrew Neal to get Truro's winner two minutes later.\nThe substitute fired in from a tight angle after Connor Riley-Lowe's cross fell to the striker in the box as he scored for the second time in Truro's last four games.\nThe victory saw Truro move up to fourth place in National League South, leapfrogging Worthing, who beat league leaders Torquay United 5-1 in the FA Trophy.\nThe Tinners are just two points behind the Devon side having played a game more.\n\"I thought if anybody was going to win it was ourselves,\" Askey told BBC Radio Cornwall.\n\"We missed one or two chances, the conditions were atrocious, but I thought we played them better.\n\"It would have been really disappointing if we hadn't have won that game, especially being one up with a few minutes to go.\n\"But again the players never surprise us, they keep coming up with these late winners and full credit to them again, it was a tremendous effort.\"", "url": "https://www.bbc.com/sport/football/articles/cwydzjlpg77o"}