{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:53:20", "date_modify": "2025-05-20 11:53:20", "date_publish": "2023-08-05 20:30:13", "description": "Rangers' Michael Beale admits Saturday's opening-day loss to Kilmarnock has introduced \"a bit of realism\" for his rebuilt side.", "filename": "sport_football_66416047_1747742000.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7D9C/production/_130665123_goldson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66416047_1747742000.html", "title": "Kilmarnock 1-0 Rangers: Micheal Beale admits 'excitement is tempered' by opening defeat", "title_page": "Kilmarnock 1-0 Rangers: Micheal Beale admits 'excitement is tempered' by opening defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Beale admits Saturday's opening-day loss to Kilmarnock has \"tempered\" the excitement generated by his rebuilt Rangers side.\nBut he urged fans to \"not get carried away\" as \"there's 37 games to go\".\nRangers, with five summer signings starting, were beaten 1-0 by hosts who narrowly avoided relegation last term.\n\"It's bitterly disappointing for the players and staff but ultimately for the fans who have been excited in the summer,\" manager Beale said.\n\"So there's a bit of realism in the air with that result. It's a very poor opening day for us. We need to move forward very quickly.\"\nBrad Lyons' strike after 65 minutes was enough to deliver Rangers' first opening-day defeat in the top flight for 25 years.\nIt means Beale's side are immediately three points adrift of Celtic after the reigning champions subdued lively visitors Ross County 4-2 earlier in the day.\n\"Not the start we wanted at all,\" the manager said. \"We had good control of the game, we had the lion's share of possession. Kilmarnock defended extremely well throughout, getting lots of people in and around their box.\n\"We had a couple of minutes towards the end of the first half that should've resulted in a goal. We had 18 attempts at goal, but I can't remember the Kilmarnock goalkeeper being troubled enough.\n\"In a game like that when it's stuffy, when we're struggling to create clear-cut chances, you can't concede a goal like we did. It's a poor one.\"\nBeale did not want to use the number of players making their competitive debuts as an excuse.\n\"I don't want to go down that road, because it seems like a cop-out,\" he said. \"We've had five weeks together, they're quality players. We had enough players on the pitch today who know what this is about.\n\"We had enough of the game in terms of possession and set-plays - we had more than Kilmarnock. But we couldn't find the answer.\"\nRangers now must regroup ahead of their Champions League third qualifying round first leg at home to Servette.\n\"There's a lot of work to do moving forward, but we'll bounce back on Wednesday,\" Beale added.", "url": "https://www.bbc.com/sport/football/66416047"}