{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:15:36", "date_modify": "2025-05-20 13:15:36", "date_publish": "2023-07-25 12:02:32", "description": "Tottenham Hotspur: Postecoglou offers transfer update", "filename": "sport_articles_c8v07j2n3yvo_1747746936.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3cb5/live/b27304e0-2adf-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c8v07j2n3yvo_1747746936.html", "title": "Tottenham Hotspur: Postecoglou offers transfer update", "title_page": "Tottenham Hotspur: Postecoglou offers transfer update - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Despite there being \"no certainties\" on transfers for Tottenham, Ange Postecoglou says there is \"no frustration\".\nSpurs have played just one fixture of their pre-season schedule so far after the cancellation of their friendly against Leicester on Sunday, but as they prepare for the new season there are questions over the futures of some players.\nSpeaking at a news conference in Singapore, the head coach said: \"I wouldn't read too much about guys not being in the squad. Like I said we're trying to balance up where people are at.\n\"It's fair to say that there are a number of players with us, including Davinson [Sanchez], who are exploring options about their future. I'm waiting for any uncertainty before I deal with that at the moment.\n\"At the moment in terms of ins and outs, there are no certainties hitting my desk.\"\nDiscussing whether there was any frustration about the lack of new signings in central defence, the Australian emphasised the need for patience.\nHe added: \"It's just the football world, I've been in it a long time. I wish it could be like my wife with Amazon where we get deliveries everyday, but I can't put one in and get it the next day, unfortunately.\n\"It's just the way of the football world so [there's] no frustration, just keep working hard to try and get it done.\"", "url": "https://www.bbc.com/sport/articles/c8v07j2n3yvo"}