{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:03:40", "date_modify": "2025-04-26 07:03:40", "date_publish": "2025-02-28 08:01:38", "description": "Sunderland midfielder Luke O'Nien is set to make his 300th appearance for the club when they face Sheffield Wednesday on Friday night.", "filename": "sport_football_articles_c04zzer1dxpo_1745651020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/99e6/live/2914ebd0-f515-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c04zzer1dxpo_1745651020.html", "title": "Luke O'Nien: Sunderland midfielder set for 300th club appearance", "title_page": "Luke O'Nien: Sunderland midfielder set for 300th club appearance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Luke O'Nien will make his 300th appearance for Sunderland, if selected against Sheffield Wednesday on Friday night.\nThe midfielder joined the Black Cats from Wycombe in 2018 and was part of the side which won promotion to the Championship via the play-offs in 2022.\nO'Nien has only missed one league game so far this season with Sunderland in the thick of the promotion race.\n\"He came in as a central midfielder and he's played everywhere else and playing that number of games shows you're fit, reliable and he's never let anyone down,\" former Sunderland striker Martin Smith told BBC Radio Newcastle.\n\"It's no disrespect but he's got the most out of everything he's got - he looks into his game and every fine detail.\"\nThe 30-year-old has scored 23 goals during his time at the Stadium of Light and Smith believes he is a vital part of Regis Le Bris' side.\n\"Sometimes on the outside you don't see what an individual brings on a day-to-day basis and what a manager sees having someone in the team, maybe not in terms of performance all the time but what he brings to everyone else,\" Smith added.", "url": "https://www.bbc.co.uk/sport/football/articles/c04zzer1dxpo"}