{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 03:38:19", "date_modify": "2025-04-26 03:38:19", "date_publish": "2025-03-05 00:07:48", "description": "Eindhoven is packed with carnival-goers but on Tuesday it was Arsenal enjoying their own party, setting a Champions League record in the process.", "filename": "sport_football_articles_cjw2ny70qy6o_1745638699.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2170/live/6fc89c40-f99b-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjw2ny70qy6o_1745638699.html", "title": "PSV 1-7 Arsenal: Record-breaking Gunners enjoy carnival season in Eindhoven", "title_page": "PSV 1-7 Arsenal: Record-breaking Gunners enjoy carnival season in Eindhoven - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Eindhoven has been packed with carnival-goers in recent days but on Tuesday it was Arsenal enjoying their own party in the city, getting over their goalscoring crisis and setting a Champions League record in the process.\nMikel Arteta's side became the first team in Champions League history to score seven goals away from home in the knockout stages of the competition as they romped to a 7-1 win over PSV Eindhoven.\nIt was the most goals the Gunners have scored in a single game since beating Newcastle 7-3 in the Premier League 13 years ago.\nThe Arsenal manager said the win had given his players \"joy and confidence and belief\", but was not getting carried away when questions were put to him about the records that his team had broken.\n\"For sure, it's something that hasn't been done, so great to be part of that,\" Arteta said. \"But as a team we want to achieve many other things that are far more important than that.\n\"The happiest thing is we are in a very strong position to go to the next round, which is where we want to be.\n\"But there's still a job to do in London in a week's time.\"\nAfter failing to score in their past two games, a 0-0 draw at Nottingham Forest and 1-0 defeat by West Ham, Arteta may not have seen a victory like this coming.\n\"This will give them great confidence for the rest of the season. Right from the start Arsenal had control of the game,\" said Chris Sutton on BBC Radio 5 Live.\n\"Arsenal were ruthless with their finishing, some of the combination play in the final third was sensational.\n\"Martin Odegaard looked back to his best. To a man they were really strong and that centre-back pairing [Gabriel Magalhaes and William Saliba] is phenomenal.\n\"Arsenal will take some stopping in this competition.\"\nEngland and Arsenal midfielder Declan Rice was one of the players singled out for his performance during the game and said that the Gunners have got the reward for their hard work in recent weeks.\nRice, who had a goal ruled out for offside, said Arsenal were \"fluid\" and possessed the \"enthusiasm, drive and hunger\" that the knockout stages demand.\n\"But we've been playing like this all season,\" he added. \"We feel we've been playing well as a team. Sometimes we score five, sometimes two, sometimes we don't score but [on Tuesday] we did well. It all clicked.\"\nArsenal's lack of a recognised striker has been well documented, with Gabriel Jesus and Kai Havertz both injured. But six different players contributed to the rout on Tuesday - Odegaard scored twice, along with goals for Jurrien Timber, Mikel Merino, Ethan Nwaneri, Leandro Trossard and Riccardo Calafiori.\nThe emphatic win means that Arsenal can start planning for a trip to Madrid, as they are set to take on the winner of the tie between Real and Atletico, which finished 2-1 to Carlo Ancelotti's side. Next week's second leg takes place at Atletico.\nArsenal's excellent 17-year-old Nwaneri again showed why there is so much hype and excitement about his future in the game.\nThe academy graduate has been given the task of filling in for Bukayo Saka on the right hand side of Arsenal's attack while the England international is out injured. The teenager has repaid that faith in him with eight goals in 28 games in all competitions.\nThat goal return puts him alongside some of England's most iconic young players.\nMichael Owen and Wayne Rooney scored nine goals each in all competitions when they were aged 17 or younger and Nwaneri now has 16 days before his 18th birthday to try to match or beat that record.\n\"I don't think that he needs any pushing. You see every time what the intention is,\" Arteta said. \"If it comes, it comes and it's great.\n\"I'm really impressed with the way he behaved and the way he played. It's about consistency and now doing it again three days later in another big stadium.\"\nNwaneri also became the third youngest player to score a goal in a knockout stage match in the Champions League after Bojan in April 2008 (17 and 217 days) and Jude Bellingham in April 2021 (17 and 289 days).\n\"He's 17 years old and he's on the biggest stage,\" Rice said.\n\"We've taken [the youngsters] under our wing and they deserve to be playing. You should see them train they way they have no fear and want to perform.\n\"Even if Saka was here Ethan would be still getting minutes because he's that good and works so hard in training. We have so many top young players.\"\nNwaneri was joined in the starting XI by his team-mate from the academy Myles Lewis-Skelly and the 18-year-old also impressed despite being withdrawn in the first half to avoid him getting sent off.\nLewis-Skelly, who had been booked earlier, put in a late tackle on Richard Ledezma and although he was unpunished, Arteta substituted him moments later.\n\"They play like they have been here for many years,\" captain Odegaard said.\n\"So much quality and confidence, they're ready for it. I'm not worried about them, we enjoy having them in the team and they have a great attitude.\"\nOdegaard, who himself started playing senior football at 15 years old, believes that Lewis-Skelly can use his early withdrawal as a learning experience.\n\"He took that really well,\" he added. \"He knew it was a tricky position to be in. He was on a yellow and had a tough challenge too. He took it well and we're all there to support and I'm sure he will learn from that too.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cjw2ny70qy6o"}