{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:38:23", "date_modify": "2025-05-21 07:38:23", "date_publish": "2025-03-28 12:23:12", "description": "Benetton fly-half Tomas Albornoz kicks a 77th minute penalty to dent Cardiff's hopes of a United Rugby Championship play-off place.", "filename": "sport_rugby-union_articles_ckgzgzvj8vjo_1747813103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a38d/live/740fba70-0ce4-11f0-8c1b-b787b2d090cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_ckgzgzvj8vjo_1747813103.html", "title": "Benetton 20-19 Cardiff: Late Albornoz penalty seals URC win for Italian side", "title_page": "Benetton 20-19 Cardiff: Late Albornoz penalty seals URC win for Italian side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Benetton fly-half Tomas Albornoz kicked a 77th minute penalty to dent Cardiff's hopes of a United Rugby Championship (URC) play-off place.\nAlbornoz produced a 15-point performance as Benetton lifted themselves to seventh in the table and into the top eight play-off places.\nDespite tries from James Botham, Ellis Bevan and Evan Lloyd, Cardiff have slipped to ninth after only picking up a losing bonus-point in Treviso.\nMatt Sherratt's men fell on the wrong side of Scottish referee Hollie Davidson with three yellow cards shown to Ben Donnell, Rory Jennings and Cameron Winnett and 15 penalties conceded.\nWith four rounds of regular matches remaining, there is no Welsh side in the top half of the table but it remains tight in the battle to finish in the top eight.\nLock Teddy Williams captained Cardiff as one of six changes made by head coach Sherratt from the 20-17 victory against Lions, while Benetton were without Italy centre Tommaso Menoncello due to injury.\nBotham opened the scoring after early visitors' pressure before Albornoz responded with a penalty.\nCardiff centre Jennings was the architect of the second score with a fine break before his inside pass to the supporting Bevan.\nAlbornoz secured the hosts' opening try after Benetton pierced the Cardiff midfield.\nCardiff lock Donnell was shown a yellow card for head contact on Benetton full-back Rhyno Smith. While it looked inconclusive that Donnell had initiated head contact, he could have been sin-binned for interfering with a quick tap free-kick.\nFlanker Thomas was outstanding in defence as Cardiff initially held firm with 14 men.\nBut just after they were restored to a full complement, Cardiff soon lost another player when Jennings was sent to the sin-bin for bringing down a Benetton maul with a penalty try also awarded as the hosts led 17-14 at half-time.\nIt was an error-strewn second half played in wet conditions.\nBenetton number eight Toa Halafihi spurned a golden chance when he inexplicably spilled possession with the Cardiff line looming.\nCardiff were also struggling to contain Benetton wing Ignacio Mendy but the hosts failed to capitalise on their dominance.\nThe visitors demonstrated a clinical edge when hooker Lloyd forced his way over in a rare foray into the Benetton 22.\nCardiff fly-half Sheedy crucially missed the conversion with Albornoz slotting over the winning kick.\nCardiff could not gain that elusive final opportunity with full-back Winnett shown a late yellow card for a deliberate knock-on.\nCardiff head coach Matt Sherratt: \"The difference in the game was the penalty count.\n\"We have conceded 15 compared to Benetton's eight and we have had three yellow cards, so it is always then going to be an uphill task.\n\"We are never going to come away from home and get 50-50 decisions here and we certainly didn't.\n\"You had the TMO coming in for things and stopping the game for no reason, in my opinion.\n\"We still gave ourselves a chance to win but could not quite get over the line.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/ckgzgzvj8vjo"}