{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-20 14:20:18", "date_modify": "2025-05-20 14:20:18", "date_publish": "2023-07-30 05:29:43", "description": "Terence Crawford dismantles Errol Spence Jr to become the four-belt era's first undisputed welterweight champion in Las Vegas.", "filename": "sport_boxing_66352005_1747750818.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14B70/production/_130584848_gettyimages-1579854674.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66352005_1747750818.html", "title": "Terence Crawford beats Errol Spence Jr to win undisputed welterweight title", "title_page": "Terence Crawford beats Errol Spence Jr to win undisputed welterweight title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Terence Crawford dismantled Errol Spence Jr to become the four-belt era's first undisputed welterweight champion.\nThe WBO champion, 35, knocked Spence down three times before the referee ended the punishment in the ninth.\nThe win makes him the first man to win undisputed titles in two weight classes as he stripped his fellow American of his WBC, WBA (Super) and IBF titles.\n\"I'm an overachiever, nobody believed in me when I was coming up,\" Crawford said.\nSpence, 33, was undefeated in 28 fights heading into the Las Vegas showdown and it was his eighth world title bout in a row.\nBut Crawford, in his 18th consecutive championship bout, staked a firm claim to be the world's best boxer as he extended his win streak to 40 fights at T-Mobile Arena.\n\"It means everything because of who I took the belts from,\" he added.\n\"They talk bad about me and I kept praying to God I would get the opportunity to show the world how great I am.\n\"And tonight, I believe I showed how great I am.\"\nSpence has the option to activate an immediate rematch and Crawford said he was open to agreeing a second fight.\nSpence made his entrance first despite being the unified champion. Crawford won a coin toss at the news conference on Thursday, meaning he could decide who occupied the champion's spot.\nDressed in black and white with red trim, Spence walked second for the first time since stopping Kell Brook to win his first world title in 2017.\nThe ringwalks made it clear Crawford fans were outnumbering Spence and T-Mobile Arena raised the roof when American rap superstar Eminem emerged from the smoke alongside Crawford, dressed in black and with a fishnet over his shoulder.\nCrawford said a quick prayer before entering the ring and the stage was set for one of the most intriguing contests in boxing in the last 20 years.\nA tentative opening round saw neither man willing to engage. Spence dropped behind his jab in the second and found success, but it quickly emerged that Crawford was looking for huge counters.\nOne whipped centimetres past Spence's face, then Crawford found his mark moments later, dropping an advancing Spence with a counter one-two.\nSpence wobbled, but was back on his feet quickly and Crawford delivered a strong right on his opponent at the bell.\nThe speed and timing of Crawford sparked moments of panic from Spence, who tried to push ahead in the third and impose himself.\nBut Crawford was too quick for his rival, repeatedly tagging Spence with counters.\nHe was smacked with an uppercut in the fourth then ducked into several hooks from Crawford before eating a massive long left that sent blood flying from the Texan's nose.\nCrawford continued to pick Spence apart in the fifth, selecting his shots cleverly and punishing his opponent with combinations.\nSpence tried to fight fire with fire, but his timing was now completely skewed as Crawford began to push forward.\nAfter fighting so much of the bout brilliantly on the backfoot, Crawford was now pouring forward.\nSpence attempted to fend him off with his jab, but the Omaha native punched through his defences with his own, tagging him repeatedly with left hands and mixing in uppercuts at close range.\nAt the midway point Crawford could count himself at least five rounds ahead, including the 10-8 knockdown round.\nBut this dominance was not enough for the WBO champion. He let Spence come onto him early in the seventh before countering with a thunderous uppercut followed by a right hook that put his rival down for the second time.\nSpence was again quick off the canvas, but unsteady on his feet. Crawford sensed an end was close and stepped on the gas.\nSpence bounced off the ropes trying to avoid the onslaught, but flew straight into another right hook that sent him down again.\nThe bell rang to save Spence and a convincing argument could have been made to pull the battered champion out of the contest.\nNevertheless he emerged for the eighth hoping to land one punch that could turn the fight around - but Crawford's superiority was entrenched and he boxed beautifully off his jab, bamboozling Spence at will with his speed and movement.\nSpence's face was now battered, beginning to swell badly on the left side. His punches lacked power, while Crawford's jab snapped back the head of his opponent.\nThe ninth round saw the punishment finally end for Spence when Crawford invited him to fight fire with fire and the valiant champion did just that.\nBut while Crawford was calm, Spence was wild. Another right hook landed to stun Spence and as his opponent unleashed a flurry of punches, the referee stepped in to stop the contest.\nCrawford was elated in celebration, dancing with his family after checking on his fellow pound-for-pound great.\nCrawford said before the fight the winner could call himself the best fighter in the world in any weight division and few would surely find it difficult to disagree with 'Bud' after such a dominant performance.", "url": "https://www.bbc.com/sport/boxing/66352005"}