{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:31", "date_modify": "2025-05-21 07:09:31", "date_publish": "2025-03-30 11:42:45", "description": "'If a hoodoo existed against Killie, this was certainly the way to exercise it'", "filename": "sport_articles_cvg7epgxzdzo_1747811371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4969/live/53e1fe30-0d5b-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg7epgxzdzo_1747811371.html", "title": "'If a hoodoo existed against Killie, this was certainly the way to exercise it'", "title_page": "'If a hoodoo existed against Killie, this was certainly the way to exercise it' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Mirren fans, we asked for your views on the emphatic 5-1 victory over Kilmarnock. Here's a taste of what you had to say...\nColin: What a fantastic performance. We played with a great intensity and never gave Kilmarnock a minute on the ball. Some top drawer finishing too, even without our top scorer.\nDouglas: A five star performance. A result like this has been coming. Every player was excellent and confidence will be high for next week at Dundee.\nJohn: Played like a team. Absolutely solid from back to front. Everyone stuck to their job and there was no daft mistakes. A joy to watch. The top six is back on.\nDouglas M: If a hoodoo existed against Killie, this was certainly the way to exorcise it. Chased them down from the start and kept the pressure on, even into the wind in the second half. Caolan Boyd-Munce will get the credit for his two goals, but the entire midfield played a stormer. We never took the gas off throughout and thoroughly deserved a thumping win.\nJim: A great all round performance against Kilmarnock with a really good positive attitude. I was particularly impressed with the attacking display. The strikers worked well together and a very energetic midfield kept them going. Here's hoping for a continuation over the next two games.", "url": "https://www.bbc.com/sport/articles/cvg7epgxzdzo"}