{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-21 06:03:44", "date_modify": "2025-05-21 06:03:44", "date_publish": "2025-04-01 15:50:00", "description": "Warwickshire fast bowler Olly Hannon-Dalby says the Bears must spread the wickets around if they are to challenge in 2025.", "filename": "sport_cricket_articles_cx254x7ynvpo_1747807424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e703/live/7359e220-0f0c-11f0-8926-611e8cb1ab81.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cx254x7ynvpo_1747807424.html", "title": "Bears must spread wickets around - Hannon-Dalby", "title_page": "Warwickshire: Bears must spread wickets around - Hannon-Dalby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire fast bowler Olly Hannon-Dalby was part of the last Bears team to win the County Championship in 2021 - prior to Surrey's three years of dominance.\nHe took 24 wickets.\nIn the last three seasons, the 35-year-old ultra-consistent 6ft 8in Yorkshireman they call OHD has plundered more than double his 2021 tally.\nHe took 53 wickets in 2022, 54 in 2023 and 50 in 2024.\nBut the Bears have finished 8th, 4th and 7th in Division One.\nNo wonder then that OHD wants to see the wickets shared about more in 2025 if his county, now under new management, are to mount any sort of serious challenge to all-conquering Surrey.\n\"From a personal point of view, the last three seasons getting 50 wickets is fantastic,\" Hannon-Dalby told BBC Sport. \"Something I'm really proud of.\n\"But, when you look at the teams who do well and win County Championships, you probably need three or four bowlers who are all getting 40 wickets, rather than one who's getting 50.\n\"For the sake of the club's health, I would prefer it if, at the end of the season that three or four of us have taken 40 wickets each and we're up near the top end again.\"\nLast season's red-ball record - just one win in 16 matches - led to an end-of-season review that ultimately cost head coach Mark Robinson his job, being replaced from within by Ian Westwood.\n\"It's never nice seeing people leave,\" Hannon-Dalby added.\n\"Mark Robinson's a top human being. He's a great coach and a fantastic man to be around who really loves his cricket.\n\"But the decision was made to part company. And Ian Westwood's been at this club for more than 20 years. He knows the club inside out.\n\"He's a young, vibrant, excellent coach and there's no reason why he can't make a success of it and put his own stamp on proceedings.\"\nAside from the propect of having a fit Chris Rushworth for the entire season after losing him for almost all of 2024, the Bears have signed Middlesex paceman Ethan Bamber, a memorable matchwinner the last time he took to the Edgbaston stage.\nThey will also have the short-term service of Sri Lanka's Vishwa Fernando, followed by the return of Pakistan's Hasan Ali in late May.\n\"It's a bit of a fresh start,\" Hannon-Dalby said. \"We've made some good signings. On paper, it looks like we've got a strong healthy squad. It's exciting on all fronts.\"\nThe one other winter change at Edgbaston was OHD's election as the new chair of the Professional Cricketers Association - the 16th to be chosen since it formed in 1967.\n\"I'm 35 and I've been Warwickshire PCA rep for 10 years,\" he said. \"And I've always been a massive fan of the PCA in terms of what they do and how they help players.\n\"The opportunity arose to apply for it and I thought 'why not? It went through a voting process, I had to submit a manifesto - and the players from around the country voted me in, which is a huge honour.\"\nLike most native Yorkshiremen, the man from Halifax is a great talker on the game., external\n\"It's something to get my teeth stuck into,\" he said. \"I've only been in the job a month so I'm still trying to figure out exactly what I'm doing but I'm keen to help any man or woman around the country playing professional cricket.\n\"Cricket gets a bit of a battering at times when it shouldn't but we've got a brilliant, vibrant domestic game in this country which should be celebrated.\n\"Of course there are issues, but there's always been issues. The schedule has been an issue as long as the PCA has been in existence.\n\"All the money that's coming into the game from the Hundred sales all needs to be debated. But I just want to help protect the game, help it advance and look after it so it's still there to be enjoyed for many years to come.\"", "url": "https://www.bbc.com/sport/cricket/articles/cx254x7ynvpo"}