{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:50:07", "date_modify": "2025-05-21 07:50:07", "date_publish": "2025-03-28 00:00:00", "description": "All the reaction as Chelsea reach the semi-finals of the Women's Champions League, beating Women's Super League rivals Manchester City on aggregate.", "filename": "sport_football_live_c78e2ywx95qt_1747813807.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c486/live/45b10f70-0ba0-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c78e2ywx95qt_1747813807.html", "title": "'A true Chelsea performance' to reach semi-finals - Women's Champions League reaction", "title_page": "'A true Chelsea performance' to reach semi-finals - Women's Champions League reaction - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Time to switch!\nWe're closing this women's football news live now, but there's plenty more to come from us at BBC Sport Towers today.\nSwitch over to our men's football live now, where we will be building up to the weekend's FA Cup action, including press conferences for six of the quarter-finalists.\nWe will be livestreaming Manchester City manager Pep Guardiola speaking to the media, plus we will bring you a special FA Cup episode of the Football News Show.\nYou can find that live here - see you on the other side.\n'The Emirates was a game changer for them'\nFT: Arsenal 3-0 Real Madrid (agg 3-2)\nGilly Flaherty\nFormer England defender on the Football Daily podcast\nI just feel with Arsenal that the Emirates is a great strength for them. They play a lot better there. They have had difficult results there too, but when the crowd is there, they're on their side and the noise is behind them they have this belief that they can beat anybody. I had a belief that Arsenal could come back and beat Real Madrid, I felt like the first half was a bit flat but coming out in the second half knowing you had to go at them, and getting those goals in such quick succession gave them a belief that they were going to get back in the game. The Emirates was a game changer for them.\n'Injuries haven't been kind to Man City'\nFT: Chelsea 3-0 Man City (agg 3-2)\nGilly Flaherty\nFormer England defender on the Football Daily podcast\nUltimately they fell short when it came to the second leg but I think with Man City it's really hard. They have a really strong XI at the moment but when it comes to the later stages of the game they just don't have enough of a squad. I think Alex Greenwood and Lauren Hemp have been such big misses for them this year.Lauren Hemp can just create something out of nothing, Bunny Shaw is such a presence as well. Injuries haven't been kind to them.\n'You feel like you're in a washing machine'\nFT: Chelsea 3-0 Man City (agg 3-2)\nRachel Corsie\nScotland and Aston Villa captain on the Football Daily podcast\nChelsea were far better prepared and I suppose they have more expirence of handling games like these. It was a difficult position for City to come into, 2-0 is uncomfortable and then to concede within 20 minutes and then you know you're really under pressure and it's hard to switch momentum in that moment. Knowing what it's like against a Chelsea coming at you, over and over and over you feel like you're in a washing machine. It's not easy to calm down, it's not easy to have the ball at your feet and make a pass under pressure.\n'Bompastor has lifted Chelsea to a new level'\nFT: Chelsea 3-0 Man City (agg 3-2)\nGilly Flaherty\nFormer England defender on\nLosing Emma Hayes, no one knew what to expect from Chelsea and how they were going to react to losing such a big figure at the club. I think Sonia Bompastor coming in, the question was how is she going to adapt to the Women's Super League and how are the players going to react to her, and she's lifted Chelsea to a new level with ease.\n'They all knew what the game plan was'\nFT: Chelsea 3-0 Man City (agg 3-2)\nGilly Flaherty\nFormer England defender on the Football Daily podcast\nI think from minute one you could see they [Chelsea] were on the front foot. They were going in pairs, no one was pressing in isolation and they all knew what the game plan was. They really unsettled City by not allowing them to get into a rhythm and it could have been more. It could have been five or six but I think for them it was key that they went in at half time 3-0 up, getting that all important third goal.\nPost\nToday's BBC Football Daily podcast is dedicated to the remarkable comebacks we have seen from Arsenal and Chelsea over the last 48 hours.\nEleanor Oldroyd brought the reaction from Stamford Bridge alongside Gilly Flaherty, Rachel Corsie and Jonathan Pearce, and the panel discussed both Chelsea and Arsenal's chances of reaching the final, with European giants Barcelona and Lyon standing in their way.\nHere's what they had to say...\nEnglish comeback queens\nThose that were on the page yesterday may remember a particular statistic we posted with regard to Arsenal's comeback.\nAfter the Gunners' 3-0 victory over Real Madrid, they became the first English side to overturn a two-goal first leg deficit in a Women's Champions League knockout tie since 2010-11.\nWell, not to be outdone, it took just 24 hours for Chelsea to do it again!\nArsenal's 3-0 victory on Wednesday was also just the second time a club had overturned a two-goal first-leg deficit in the quarter-finals of the competition in history.\nUntil last night, when the Blues decided to become the third and pencil their name in the history books right next to the Gunners. Literally, right next to them. The ink wasn't even dry!\n'Chelsea were absolutely relentless'\nChelsea 3-0 Manchester City (Agg: 3-2)\nEllen White\nFormer Manchester City striker on BBC Radio 5 Live\nThey [Chelsea] were absolutely relentless. They had so much belief, energy and intensity and Man City just couldn’t live with them.\nObviously to score three goals in that first half just blew Man City away. An incredible performance by Chelsea.\nThis season they’ve lost one game which is just ridiculous. They’ve showed what winning means.\n'Quadruple mentality is back on'\nChelsea 3-0 Man City (agg 3-2)\nKaren Carney\nFormer Chelsea midfielder on TNT Sports\nFirst 45 minutes Chelsea absolutely blew Manchester City away and there was no response there. The quadruple mentality is back on. They are not stopping, they are a train and when they are on it you can’t stop them.\nThat team will be thinking 'we want that quadruple and we are not going to stop'.\nChelsea-Arsenal final would be 'mental'\nChelsea 3-0 Manchester City (Agg: 3-2)\nEllen White\nFormer Manchester City striker on BBC Radio 5 Live\nMan City only had four outfield players on the bench and obviously one goalkeeper.\nI do feel for City because they’ve got a really thin squad, lots of injuries. But now they have to focus to on getting a Champions League spot because they’re quite a few points behind now.\nOn the semi-finals: Can you imagine a Chelsea-Arsenal Champions League final? That would be absolutely mental.\nBarcelona and Lyon dominance\nBarcelona and Lyon have dominated in Europe in recent times - Arsenal and Chelsea could not have asked for tougher opponents in a bid to reach the final.\nBarcelona have reached the final five times out of the last six years, winning the title on three of those occasions.\nOn the two times they failed to get over the line - who did they lose to? Lyon, of course.\nThe French side have made the final 11 times in their history, winning an incredible eight titles. They most recently reached the final in 2024 where they fell to defeat by - yep - Barcelona.\nBoth sides made lightwork of their quarter-final opponents on their way to the semi-finals this year - Barcelona landing an incredible 10-2 aggregate victory over Wolfsburg while Lyon breezed past Bayern Munich 6-1 on aggregate.\n'Champions League is the one Chelsea want'\nFT: Chelsea 3-0 Man City (agg 3-2)\nEni Aluko\nFormer Chelsea forward on TNT Sports\nThe quadruple is important, but the Champions League is the one that has alluded them. Even if they don’t do the quadruple, if they win the Champions League, that will be the one for Millie and all the players that have tried to do it for years.\nTo win this tie and still be in it, up against Barcelona next who have got Chelsea's number, I think that is the one the players want. That is the one Bompastor wants and the owners have brought them in because she has done it. It will be interesting to see the mentality now to go and win that trophy that has always alluded them.\nHow many times have the semi-finalists won the Champions League?\nChelsea are the only team of the four not to have lifted the women's Champions League trophy.\nArsenal won one of the first editions of the competition back in 2007 but have failed to repeat the feat since.\nTheir opponents, Barcelona and Lyon respectively, however, have dominated in Europe with the French side being the most successful women's team in the competition.\nChampions League titles:\nLyon x8\nBarcelona x3\nArsenal x1\nChelsea x0 (beaten finalists in 2021)\nAll-English final on the cards?\nThere is an all-English Women's Champions League final on the cards, with Arsenal and Chelsea safely into the last four of the competition.\nThe semi-final line-up was confirmed on Thursday as Chelsea and Barcelona joined Arsenal and Lyon in the next round.\nArsenal will play eight-time winners Lyon, while Chelsea face holders Barcelona.\nSemi-final first legs will be played on 19 and 20 April, with the second legs taking place on 26 and 27 April.\nExact details will be confirmed by Uefa on Friday.", "url": "https://www.bbc.com/sport/football/live/c78e2ywx95qt"}