{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 11:41:03", "date_modify": "2025-05-20 11:41:03", "date_publish": "2023-08-06 17:38:35", "description": "England's wait for a first Netball World Cup title continues after Australia defeat the Roses to win the event for a 12th time.", "filename": "sport_netball_66423459_1747741263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1F65/production/_130673080_gettyimages-1581269141.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66423459_1747741263.html", "title": "Netball World Cup final 2023: England 45-61 Australia - Roses miss out on historic title", "title_page": "Netball World Cup final 2023: England 45-61 Australia - Roses miss out on historic title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's wait for a first Netball World Cup title continues after Australia defeated the Roses to win the event for a 12th time.\nThe Roses were gradually overwhelmed by a dominant Australia, who pulled away to win 61-45.\nEngland were appearing in their first World Cup final, following a group-stage win over Australia and a semi-final victory against New Zealand.\nHowever, they had to settle for leaving Cape Town with silver.\nA dejected England may have missed out on the trophy, but have equalled the nation's best result at the tournament - previously achieved in 1975 after a round-robin event.\nHowever, they will be left to rue some of the sloppy play that allowed the Diamonds to strengthen their grasp on the trophy, particularly in the final quarter.\n\"We are obviously gutted with a losing margin like that but such is the difference between seasoned finalists and a team in their first final,\" said England head coach Jess Thirlby.\n\"Today was always going to be a tough ask, you just can't throw ball like that against Australia in a final.\n\"If we do that, we need to find a way to win it back. Unfortunately both of those things eluded us for long periods during the match.\"\nEngland claimed a thrilling 56-55 win against the Diamonds earlier in the week but repeating that feat against the nation that has featured in every World Cup final was ultimately a step too far.\nSome of Australia's aura had been diminished after England claimed Commonwealth gold against them on the Gold Coast in 2018.\nBut the Diamonds took revenge to end England's Commonwealth challenge at the semi-final stage in Birmingham last year, with this final the latest twist in a growing rivalry that so often swings Australia's way.\n\"We are really grateful for that silver medal and over time I'm sure that it will sink in,\" said Thirlby.\n\"The disappointment [we feel] is a measure of the belief we had in ourselves.\"\nDespite Australia maintaining their status at the top of world netball, England's presence in the final and Jamaica's bronze-medal victory against New Zealand earlier on Sunday shows the strength of the chasing pack.\n\"We had the better of them the other day and they had the better of us today,\" said England shooter Eleanor Cardwell.\n\"There's so many positives. This is the first World Cup final for every name on the team sheet and a lot of those Diamonds players have a whole lot of experience.\n\"I am super proud of us making history. Last year at the Commonwealth Games we came fourth and were gutted. This year we've got a silver medal.\"\nSince winning Commonwealth gold five years ago England have beaten Australia just twice in 11 meetings, but will hope to use this final as a platform to push to greater heights.\nEngland mid-courter Imogen Allison, who has often produced the key moment for the Roses at this tournament, said she was \"super proud\" of the team.\n\"We have to take this and run with it. If this is the first time in a final, the next time we are getting the gold,\" she added.\nEngland took confidence from their victory over the Diamonds on Thursday but Australia were powered by anger from an uncharacteristic defeat.\nKeen to reassert themselves as the dominant force in world netball, Australia head coach Stacey Marinkovich used all her trump cards to keep England on the back foot throughout the final.\nThe tone was set when the Roses lost the ball on their first centre pass, but they battled to keep the scores level at 13-13 after the first quarter.\nThe Diamonds started to build their lead and England struggled to cope with a dynamic attack circle, which was boosted by the arrival of shooters Sophie Garbin and Kiera Austin.\nEngland coach Thirlby tried multiple combinations in defence in an attempt to prevent the goal tally from running away, but a four-goal lead quickly became six before the wheels came off in the final quarter.\nEven after half-time a comeback seemed unlikely as England seemed to lack the belief that had powered them through the tournament.\nAustralia capitalised on wayward passes and sloppy play in key areas as the Roses struggled to win the ball - something they have excelled at in previous matches.\nThe Australia players on the court and on the bench sensed victory was close even with several minutes remaining, as a Roses side who seemed overwhelmed by their first foray into a World Cup final looked increasingly out of sorts.\nQuestions will be asked over the choice and timing of Thirlby's substitutions but in the end England were over-awed by a side who are, quite simply, so used to winning the big finals.", "url": "https://www.bbc.com/sport/netball/66423459"}