{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-05-21 07:15:03", "date_modify": "2025-05-21 07:15:03", "date_publish": "2025-05-20 11:04:07", "description": "Man City news: Pat Nevin on Pep Guardiola and style of play", "filename": "sport_football_articles_c0eqqwyv89qo_1747811703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3b4/live/1954aee0-3563-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0eqqwyv89qo_1747811703.html", "title": "Man City news: Pat Nevin on Pep Guardiola and style of play", "title_page": "Man City news: Pat Nevin on Pep Guardiola and style of play - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A recent discussion asked 'Has Arsenal's season been a failure?' This was followed by a similar inquisition on Pep Guardiola's Manchester City. They have no trophies between them, which is astonishing. But disastrous failures, really?\nThere was a narrowly lost FA Cup final for City while Arsenal look set to come home second in the league on top of an impressive Champions League run. This included the hammering of Real Madrid, while playing the campaign without a recognised striker - and with their top scorer Kai Havertz unavailable for the business end of the season.\nI am sticking with disappointment rather than failure for both but maybe City have more to learn. Arsenal boss Mikel Arteta has changed his style and adapted by adding more physicality while City still seem to be playing very similar tactics to those they always have under Pep. Meanwhile the game is evolving.\nI thought the FA Cup final was the perfect example. City demand control of the game and with 79% of possession, they had it. The downside is that demand for control stops players taking chances in the final third. That final pass is almost always the riskiest but the risk-reward equation means it is worth it.\nCity have gone too far the other way. If the pass isn't 99% on, they turn back. Pep and City were trailblazers, but even if you have the best players and the most money, if you keep doing the same thing you become predictable.\nThe biggest change by others this season is from an obsession with control and order to a willingness to create chaos, using players who can deliver the unexpected.\nFor all the beauty of City at their best, I can't say I am disappointed by the change. Have a look at how PSG's style of play for a glimpse at the future.", "url": "https://www.bbc.com/sport/football/articles/c0eqqwyv89qo"}