{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:02:57", "date_modify": "2025-04-26 07:02:57", "date_publish": "2025-02-28 08:13:59", "description": "Aston Villa vs Cardiff predictions: Chris Sutton on FA Cup game", "filename": "sport_football_articles_c1mnnxy9vn0o_1745650977.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1mnnxy9vn0o_1745650977.html", "title": "Aston Villa vs Cardiff predictions: Chris Sutton on FA Cup game", "title_page": "Aston Villa vs Cardiff predictions: Chris Sutton on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The rest of the season is going to be a bit of a juggling act for Aston Villa.\nThey are still in the Champions League and also trying to finish high enough in the Premier League to qualify for it again next season.\nSo, it will be interesting to see if they target the FA Cup too. I'm sure Unai Emery would ideally like to keep his finger in every pie, but we've seen how that has stretched his squad already.\nStill, this is where you want to be as a Villa fan, with your team fighting on all fronts near the end of the season - and they will be favourites for this tie even if Emery rests players.\nLet's face it, Cardiff are pretty hopeless, especially on the road where they have only won one Championship game all season.\nCardiff have won away twice in the FA Cup, against Sheffield United and Stoke City, but it was basically the Blades reserves who they beat in round three.\nThey may rest players too - it depends whether they prioritise this tie or their relegation fight and Tuesday's league game at home to Burnley - but, even if they don't make changes, Villa will probably be too strong for them, especially at home.\nSutton's prediction: 3-1\nListen to live commentary on BBC Radio 5 Live.", "url": "https://www.bbc.co.uk/sport/football/articles/c1mnnxy9vn0o"}