{"authors": ["Holly Bacon", "www.facebook.com"], "date_download": "2025-05-21 06:01:01", "date_modify": "2025-05-21 06:01:01", "date_publish": "2024-12-24 14:12:18", "description": "Ruud van Nistelrooy press conference: Liverpool vs Leicester preview", "filename": "sport_football_articles_c4gp0erg0lro_1747807261.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1b8b/live/79404600-c1ed-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gp0erg0lro_1747807261.html", "title": "Ruud van Nistelrooy press conference: Liverpool vs Leicester preview", "title_page": "Ruud van Nistelrooy press conference: Liverpool vs Leicester preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On team news Van Nistelrooy said Jakub Stolarczyk is available and they are assessing Mads Hermansen \"every day\". He added: \"We will see when he is 100% fit to perform for the team. I'm confident it will be in the short term but I don't know when.\"\nJamie Vardy could miss the game with Van Nistelrooy stating: \"We have to address Jamie, he picked up some knocks, see if he is ready for Thursday. Hopefully we will be fine if not it will be a short term issue.\"\nOn goalkeeper Danny Ward, who was booed by Foxes' fans during their 3-0 defeat by Wolves: \"What happened during the game on a personal note and also for us as a team it was a tough one because you feel for a team-mate, a player that you work with. It's support for him, be there for him, stay together and make sure we perform in a way which gives the fans something to cheer for. That is our task.\"\nVan Nistelrooy said they need to \"stop the individual mistakes\" and believes confidence can help them do so: \"It's something which is confidence, trust and belief. With good focus and preparation, confidence will rise and mistakes will be less, that's what I believe in. Football is a game of mistakes but it's good to focus on reducing it.\"\nOn James Justin: \"He is a great professional with good qualities. He has played some excellent games. I'm not worried about him. We all go through different spells of form and when the crowd starts to react to you it's our job to deal with it and focus on your performances. I don't want to make it a big deal.\"\nHe said his view of the task at hand has not changed: \"No, not at all. If on a weekly basis you are going to evaluate into a drama or into a success, that is not the way you work as professionals. Of course it will be highlighted in the media and also fans will react like that, it's the world we live in, the immediate success everyone is chasing. We know we're in it for the long run and we know the end of the season is the finish line where we have to be in a position to stay in the league. That is the bigger picture for me.\"\nOn Liverpool: \"It's clear who is the dominant force in this game. When I see Liverpool play and how Arne [Slot] is managing it, I know how he wants his team to play. The streak is remarkable, the wins, the goals they scored, such few goals they concede.\"", "url": "https://www.bbc.com/sport/football/articles/c4gp0erg0lro"}