{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:40:14", "date_modify": "2025-04-26 03:40:14", "date_publish": "2025-03-05 10:20:46", "description": "Plymouth Argyle boss Miron Muslic criticises the mentality of his players after their 2-0 loss at relegation rivals Hull City.", "filename": "sport_football_articles_cx2glvn9jdzo_1745638814.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f442/live/13543650-f9a9-11ef-b257-2b725ccbdd87.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2glvn9jdzo_1745638814.html", "title": "Miron Muslic: Plymouth Argyle boss slams team's mentality after Hull City loss", "title_page": "Miron Muslic: Plymouth Argyle boss slams team's mentality after Hull City loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Plymouth Argyle boss Miron Muslic has criticised the mentality of his players after their 2-0 loss at relegation rivals Hull City.\nThe Pilgrims were poor for much of the match and did not register a shot on target.\nThey had gone into the game buoyed after a good showing in Saturday's 3-1 FA Cup defeat by 2024 Premier League champions Manchester City.\nBut the result at Hull, couple with others going against them, means Argyle are now six points from safety with 11 games to play.\n\"It's not about changing the players, it about changing the mentality,\" Muslic told BBC Radio Devon.\n\"The Championship is (about) fight, it's physical, it's duels, and I think we showed it in an excellent way over the last couple of weeks and we didn't show it tonight.\n\"If we don't show it, we don't have the quality to compete.\"\nThe loss followed a good recent run of results - they beat West Bromwich Albion 2-1 and then defeated runaway Premier League leaders Liverpool 1-0 in the fourth round of the FA Cup last month.\nThey backed that up with their biggest win of the season as they thrashed Millwall 5-1, while also earning draws with Luton Town and Cardiff City - their only league loss in that spell came at Blackburn Rovers on 15 February.\nIt meant the performance at Hull was even more of a surprise for Muslic, who has appeared to galvanise his side since taking over from Wayne Rooney in January.\n\"All the signs of the last couple of weeks were that we were heading in the right direction,\" he said.\n\"But we have to be humble all the time and realise what our situation is.\n\"I know we played a fantastic game a couple of days ago, but the reality of the Championship is fighting for every inch on the pitch and I think we missed this completely.\n\"We showed a lot of this character and effort for the last couple of weeks, that's why we've been able to collect points.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx2glvn9jdzo"}