{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:30:54", "date_modify": "2025-05-21 04:30:54", "date_publish": "2025-04-05 08:19:08", "description": "Monaghan's three-time All-Star and BBC pundit Conor McManus says Donegal should prove too strong for Derry in Sunday's Ulster SFC opener.", "filename": "sport_articles_c0457rvy3vno_1747801854.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe13/live/bca7bc40-115f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0457rvy3vno_1747801854.html", "title": "'Donegal should have too much for Derry'", "title_page": "Ulster SFC 2025: 'Donegal should have too much for Derry' - Conor McManus column - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Monaghan will face the winner of Sunday's preliminary tie between Donegal and Derry, and Donegal are looking strong.\nDerry have had a rough time lately. They haven't won a game in regulation since they beat Westmeath in the round-robin last year. It's a long time to go without winning a game of any description.\nLooking at it purely on the league table, you'd say they're in trouble heading to Ballybofey, but I don't think it's as bad as that.\nThey should have beaten Kerry bar two late goals and a catastrophe at the end, they drew with Galway who were arguably the in-form team at that point, and were five or six points up after 65 minutes of their defeat by Donegal.\nI don't think their situation is as bad as the league table would have you believe, but they are missing a lot of key players. Look at the defence, for example. Conor McCluskey is out, Gareth McKinless is out and Chrissy McKaigue is retired. That's three All-Star defenders out of the picture.\nThen there are the question marks over Brendan Rogers' fitness. I'd expect him to play on Sunday, but how fit is he? At the other end, they're heavily reliant on Shane McGuigan and if Donegal keep him quiet, it's hard to see where Derry's scores are coming from.\nYou put all that together and the fact they're away to Donegal, who were the form team in the early rounds of the league before putting the handbrake on, it's hard to see how Derry can lift it to a level where they can beat Donegal.", "url": "https://www.bbc.com/sport/articles/c0457rvy3vno"}