{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-04-26 04:09:55", "date_modify": "2025-04-26 04:09:55", "date_publish": "2025-03-02 18:54:36", "description": "Brighton striker Danny Welbeck's extra-time winner over Newcastle continues his fine late-career form in Sussex.", "filename": "sport_football_articles_cwygwg9qrn2o_1745640595.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56b7/live/a526eea0-f793-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwygwg9qrn2o_1745640595.html", "title": "Danny Welbeck: Brighton's FA Cup hero enjoying career renaissance", "title_page": "Danny Welbeck: Brighton's FA Cup hero enjoying career renaissance - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "\"Thanks to my mum and dad for giving me good genes,\" said Brighton's FA Cup hero.\nFive years after it looked as though Danny Welbeck's career was petering out, the 34-year-old sent Albion into the FA Cup quarter-finals.\nWhen Welbeck played 18 times and scored twice in Watford's Premier League relegation campaign in 2019-20, it didn't seem like there were great days ahead of him.\nThe former (more on this later) England frontman left the Hornets on a free transfer and joined Brighton after the transfer window had closed in October 2020.\nAn un-Brighton-like signing, a 29-year-old injury-prone forward - surely just a stop-gap?\nAnd yet, the two-time FA Cup winner with Arsenal has had a storming time in Sussex - capped off by his latest goal.\nIn extra time of their FA Cup fifth-round tie with Newcastle, he ran on to Solly March's pass before clipping a clever finish over Martin Dubravka from a tight angle to make it 2-1.\nThat is his eighth goal of the season - only behind two of his Manchester United seasons and one at Arsenal. He is four off his record of 12 at United in 2011–12.\n\"Danny was great to play alongside. If I'm being honest I would like to see him here at Manchester United,\" said former Red Devils and England team-mate Wayne Rooney on BBC One.\nWelbeck, a Mancunian born to parents from Ghana, came through the academy at Manchester United and scored 29 goals in 142 games for the club.\nLoan spells at Preston and Sunderland both ended early because of injury.\nAfter being at the club from the age of eight to 23, he went to Arsenal for £16m - with United signing Monaco forward Radamel Falcao on loan instead.\nInjuries would follow him to Arsenal, where he netted 32 goals in 126 games over five years.\nHe missed the 2015 FA Cup final, then eight months out in 2016 cost him a chance of going to Euro 2016 and his final game for the club came in November 2018, when he broke his ankle.\nThe following season he only played half of Watford's games as they went down.\nAnd then came his move to Brighton.\nWith former clubs United and Arsenal struggling for goalscoring frontmen, they might both wish they still had the services of Welbeck.\nAfter 26 goals in his first four seasons at Brighton, Welbeck has hit eight in 25 this season.\nAmong those eight have been some big ones.\nHe netted in a 2-1 win over Manchester United in August, scored two winners at St James' Park this season and also got winning goals over Tottenham and Bournemouth.\n\"It's great to get the winning goal,\" he said after the cup win at Newcastle, where he came on as an 80th-minute substitute.\n\"I am feeling very good, feeling fit and feeling strong. Thanks to my mum and dad for giving me good genes.\"\nHe added: \"When you're on the bench you have to analyse the game and see where you can make a difference and today that's what we did.\"\nIt might seem fanciful - but some are wondering if Welbeck's form could earn him an international recall.\nWelbeck scored 16 goals in 42 games for England, making his debut in 2011 against Ghana, the nation of his parents. He scored against Sweden at Euro 2012 and played at two World Cups.\nBut his last cap came in 2018 when still at Arsenal.\nNew England manager Thomas Tuchel will name his first squad soon with World Cup qualifiers against Albania and Latvia coming up.\nBrighton boss Fabian Hurzeler was asked by ITV about it after the game.\n\"You have a good coach, Thomas Tuchel, so he will make the decision,\" Tuchel's fellow German said.\n\"It might be possible but it is not my decision. The only thing I can say is I am happy to work with him, he is a great leader, great role model and a great player.\n\"In the end, the goal for sure gives us the win but in general he worked hard when he comes into the match.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cwygwg9qrn2o"}