{"authors": ["Adam Wild", "www.facebook.com"], "date_download": "2025-04-26 04:25:48", "date_modify": "2025-04-26 04:25:48", "date_publish": "2025-03-03 11:59:36", "description": "BBC Sport's Adam Wild reflects on whether rugby league's festival in Las Vegas has been a success.", "filename": "sport_rugby-league_articles_cvg17kypp1vo_1745641548.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d6fd/live/1d6e7a80-f826-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cvg17kypp1vo_1745641548.html", "title": "Rugby league: Have games in Las Vegas been a success?", "title_page": "Rugby league: Have games in Las Vegas been a success? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Las Vegas, a city built around extravagance and opulence, with the blinking bright lights of giant electric billboards, garish neon signs and enormous flashing video screens, feels about as far away from the traditional northern England rugby league heartlands as it's possible to get.\nUltimately though, that's entirely the point of the sport's Sin City adventure.\nTaking a game that has always struggled for attention in the crowded sporting marketplace to a city, and indeed a country, with no history or heritage in the game may, for many, seem an unusual and expensive gamble.\nStill, if you're going to take a chance there's perhaps no more fitting place on earth than Las Vegas to roll the dice.\nIt is, after all, a city well used to hosting major global sporting events like boxing, the Super Bowl and Formula One - and rugby league is now securely on that illustrious list.\nIf there were any questions about the ambition and commitment to this festival of rugby league, they were answered on Thursday evening in downtown Vegas.\nThe Australian National Rugby League (NRL), the driving force behind the project, turned the world-famous Freemont Street into a spectacular red carpet walkway filled with dancers, musicians, drummers and sporting celebrities to welcome the players from the eight teams involved.\nMore than 10,000 fans turned up to the event, creating a carnival atmosphere the like of which the sport has never seen before.\nMany watching on from the barriers were left open-mouthed at the scale of the welcome.\nAnd all that before a ball had even been kicked.\nSuper League may not have been here at all had it not been for the vision of Wigan Warriors chief executive Kris Radlinski.\nTwelve months ago, he reached out to the NRL to get his side involved, having watched last year's inaugural event that was limited to just Australian clubs.\n\"I never thought it'd be like this, it's bigger than I imagined,\" said Radlinski.\n\"But it's what we deserve. I want everyone at home to believe what's possible. We've been through so much as a sport, so much effort goes on behind the scenes and we're in Las Vegas - it's exciting. We should enjoy and embrace it.\"\n\"I think we've grasped the opportunity with both hands, I don't think we could have done any more.\n\"Hopefully people at home have seen this has been an unbelievable event and hopefully it will be even better next year.\n\"The number of ticket sales is better than last year so that tells you that we have collectively made an impact.\"\nBut where does the game go from here? A number of English clubs have already expressed an interest in playing in next year's event, which has now been confirmed as again featuring Super League sides.\nIt is fairly easy to see why. Future options include building the World Club Challenge into the programme and expanding the number of games.\nBut while this has all undoubtedly been an exciting new departure for the fans already engaged in the sport, what impact this will all have on rugby league's future as a truly global sport remains unclear.\nWhat is certain is that rugby league has entered a bold new era.", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cvg17kypp1vo"}