{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:04:20", "date_modify": "2025-05-21 04:04:20", "date_publish": "2025-02-01 14:43:03", "description": "SA20 results: Craig Overton stars as Sunrisers Eastern Cape beat Paarl Royals by 48 runs", "filename": "sport_cricket_articles_cp8k0ly13zro_1747800260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5cd/live/e6f86fe0-e0ad-11ef-a544-6d6714619779.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cp8k0ly13zro_1747800260.html", "title": "SA20 results: Craig Overton stars as Sunrisers Eastern Cape beat Paarl Royals by 48 runs", "title_page": "SA20 results: Craig Overton stars as Sunrisers Eastern Cape beat Paarl Royals by 48 runs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's Craig Overton took three wickets and held a stunning one-handed catch on the boundary as Sunrisers Eastern Cape beat Paarl Royals by 48 runs to confirm their place in the SA20 play-offs.\nThe Somerset all-rounder took three wickets for the Sunrisers in his first two overs after they had set Paarl, who had already progressed to the play-offs, a target of 149.\nHe then took a superb catch, leaping high to his right just inside the boundary rope to dismiss Bjorn Fortuin, who had lifted Aiden Markram high towards long-on.\nSunrisers posted 148-8 from their 20 overs, with Jordan Hermann top-scoring with 53, but a rapid 43 including three sixes from Tristan Stubbs helped stave off a potentially disappointing total.\nOverton's fiery opening burst helped reduce the Royals to 22-5, but only a partnership of 49 between Rubin Hermann and Andile Phehlukwayo threatened Eastern Cape's total.\nMarco Jansen took 3-22 as Paarl were dismissed for 100.\nThe result means that Paarl will finish second in the SA20 table behind MI Cape Town, who still have a game to play, while Sunrisers are in third place five points ahead of Joburg Super Kings, who also have one game remaining.", "url": "https://www.bbc.com/sport/cricket/articles/cp8k0ly13zro"}