{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:03:03", "date_modify": "2025-05-21 05:03:03", "date_publish": "2025-04-04 09:01:35", "description": "Newport County: Nelson Jardim demands more from long trip to Carlisle", "filename": "sport_football_articles_c05npmqgnr3o_1747803783.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c0d1/live/67979730-1127-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05npmqgnr3o_1747803783.html", "title": "Jardim demands more from long trip to Carlisle", "title_page": "Newport County: Nelson Jardim demands more from long trip to Carlisle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newport County will embark on their longest away trip of the season on Saturday - a gruelling 560-mile round trip to face League Two's bottom side Carlisle at Brunton Park.\nTravelling has been the Exiles' Achilles heel this season, with 13 losses and just three wins on the road, an area Nelson Jardim has been trying to remedy in recent weeks.\n\"We are traveling later now, we've looked at the way we rest, train, and eat,\" said County head coach Jardim.\n\"But it's always tough traveling that far. Regardless of that, we know we have to perform.\"\nA vocal contingent of more than 100 Newport supporters are expected to make the mammoth trip to north west England and Jardim is determined to give them something to cheer about.\n\"We need to make sure we put on a good performance because we are playing for the fans as well,\" he added.\nWith six games remaining, hosts Carlisle - managed by former Wales boss Mark Hughes - are nine points from safety and fighting tooth and nail for EFL survival.\nNewport are 17th having been denied an 11th home win of the season by a late Bromley equaliser on Tuesday.\nThey may have no relegation worries but Jardim insists victory on Saturday remains important as he looks to finish the season strongly and lay the foundations for future success at the club.\n\"I expect to see more from us, every game has been important,\" he said prior to the long trip to Carlisle.\n\"It's a huge game for us as well.\"", "url": "https://www.bbc.com/sport/football/articles/c05npmqgnr3o"}