{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:50:07", "date_modify": "2025-05-21 03:50:07", "date_publish": "2025-02-09 17:29:24", "description": "Spanish top seed Carlos Alcaraz beat Australian Alex de Minaur 6-4 3-6 6-2 in the Rotterdam Open final to claim his first indoor title.", "filename": "sport_tennis_articles_cvg4qgrv7eeo_1747799407.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1171/live/3d4cf3f0-e709-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cvg4qgrv7eeo_1747799407.html", "title": "Rotterdam Open: Carlos Alcaraz beats Alex de Minaur for first indoor title", "title_page": "Rotterdam Open: Carlos Alcaraz beats Alex de Minaur for first indoor title - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Carlos Alcaraz edged a tight final against Australia's Alex de Minaur to win the Rotterdam Open and claim the first indoor hardcourt title of his career.\nIt was a 17th ATP title for the 21-year-old Spanish top seed but his first since winning in Beijing in September.\nThe four-time Grand Slam winner had to fight hard for the victory after third seed De Minaur won the second set to take the match into a decider.\nBut a break of serve for Alcaraz in the sixth game of the final set proved decisive and he went on to win the next two games to seal a 6-4 3-6 6-2 victory.\nThe reigning French Open and Wimbledon champion, who also claimed the US Open in 2022, has won grand slam titles on all three outdoor surfaces.\nAlcaraz's latest success, in his first tournament back following defeat by Novak Djokovic in the Australian Open quarter-finals, added another string to his bow.\nHe thanked the Rotterdam crowd for a \"special week\" as he claimed the winner's prize in his first appearance at the event.\nFor De Minaur, however, it was a second successive defeat in the Rotterdam final, after finishing runner-up to world number one Jannik Sinner last year.\n\"It's been a lot of improvements in my game over the last couple of years and I am going to keep on pushing for more,\" said De Minaur, 25, who has won nine titles on the ATP tour.\n\"It's been two years now with this runners-up trophy, I'm hoping I will get my hands on the winner's one day.\"\nAt the Dallas Open in Texas, Denis Shapovalov beat second seed Casper Ruud 7-6 (7-5) 6-3 to secure the third, and biggest, ATP title of his career.\nCanadian Shapovalov, 25, also defeated top seed Taylor Fritz and third seed Tommy Paul on his way to the final.", "url": "https://www.bbc.com/sport/tennis/articles/cvg4qgrv7eeo"}