{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-19 15:15:48", "date_modify": "2025-05-19 15:15:48", "date_publish": "2017-07-04 12:18:00", "description": "Manchester United manager Jose Mourinho has been left unimpressed by the club's lack of summer transfer dealings.", "filename": "sport_football_40495870_1747667748.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6657/production/_96799162_gettyimages-688139420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40495870_1747667748.html", "title": "Manchester United: Jose Mourinho unhappy with lack of summer transfer business", "title_page": "Manchester United: Jose Mourinho unhappy with lack of summer transfer business - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United manager Jose Mourinho is unimpressed by the club's lack of summer transfer dealings.\nAfter United's Europa League final win against Ajax on 24 May, Mourinho said he had given executive vice-chairman Ed Woodward a list of transfer targets.\nSenior United figures spoke privately about signing three or four players.\nThere could be developments later this week, but so far the only new signing has been 22-year-old defender Victor Lindelof from Benfica for £31m.\nIt is understood Mourinho wants at least one forward to compensate for the loss of Zlatan Ibrahimovic, 35, because of injury, as well as a holding midfield player.\nEfforts to sign Atletico Madrid forward Antoine Griezmann, 26, for a fee that would have come close to the world record £89m United paid Juventus for midfielder Paul Pogba 12 months ago were compromised by Ibrahimovic's major knee injury, which will keep him out until the New Year.\nAtletico were also banned from buying players during the current transfer window and Griezmann signed a new contract, retaining a 100m euros release clause.\nAnother potential target, Everton striker Romelu Lukaku, 24, is thought to be more interested in joining Chelsea, so Real Madrid's Alvaro Morata, 24, has emerged as United's preferred striking option.\nHowever, efforts to do a deal with Real have, thus far, met with frustration.\nHis father and agent met with Real officials, external at the Bernabeu on Monday and although it is still anticipated a transfer will happen, United's departure for their five-match pre-season tour of the USA on Sunday has created an artificial deadline there is no certainty of meeting.\nTottenham's Eric Dier, 23, and Chelsea's Nemanja Matic, 28, have been spoken of by club officials as possible additions to fill the holding midfield role.\nHowever, any attempt to get Dier would involve protracted discussions with Tottenham, which United have never found easy.\nIt is understood Chelsea will not even entertain the prospect releasing Matic until they have completed the transfer of 22-year-old France midfielder Tiemoue Bakayoko from Monaco.\nUnited officials also spoke to Inter Milan about winger Ivan Perisic, 28, but that move is hampered by the Italian side's improved financial situation, meaning they have no urgent need to sell.\nThe situation is somewhat different to 12 months ago, when Ibrahimovic, centre-half Eric Bailly and midfielder Henrikh Mkhitaryan were all signed two weeks before United went on their pre-season tour of the Far East, with Pogba coming in later.\nMourinho is mindful his squad needed improving, as - despite winning the EFL Cup and Europa League last season - they finished sixth in the Premier League.\nTour matches against Manchester City, Real Madrid and Barcelona in particular will offer an indication about how much improvement is required.", "url": "https://www.bbc.com/sport/football/40495870"}