{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:47", "date_modify": "2025-05-21 07:51:47", "date_publish": "2025-02-11 00:00:00", "description": "Portsmouth secure a precious win in their bid for Championship survival as they beat Cardiff City to overtake their relegation rivals.", "filename": "sport_football_live_cp82pzzmnv1t_1747813907.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cp82pzzmnv1t_1747813907.html", "title": "Portsmouth beat Cardiff City 2-1 in battle for Championship survival", "title_page": "Portsmouth beat Cardiff City 2-1 in battle for Championship survival - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth secured a precious win in their bid for Championship survival as they beat Cardiff City to overtake their relegation rivals.\nPompey blew their flustered opponents away with two early goals, both set up by former Cardiff winger Josh Murphy as Colby Bishop prodded in with an instinctive finish before Conor Shaughnessy's header from a corner.\nThe visitors responded well to their woeful start as Callum O'Dowda's guided header before the break halved their deficit and prompted a period of pressure from the Bluebirds.\nBut Omer Riza's side were unable to build on that momentum as the hosts regained enough control in a scrappy second half to hold on for victory.\nPortsmouth leapfrog Cardiff as they move up to 18th in the table, now four points clear of the relegation zone, whereas the Bluebirds slip to 20th, with two points separating them and the bottom three.\nGiven how congested the bottom half of the table has been this season – even by the Championship's extreme standards – this felt like a game that could have a significant impact on the battle for survival.\nCardiff started the evening just one point and one place ahead of Portsmouth, who were themselves a mere two clear of the drop zone.\nDuring the opening stages, however, there was a startling gulf between the teams, with Pompey as impressive as their opponents were ragged.\nCardiff, who were crushed 7-0 by Leeds in their previous league outing, looked brittle defensively again and fell behind in the ninth minute as Cian Ashford gave the ball away to Murphy, who eased past Calum Chambers and set up Bishop to stab into the bottom far corner.\nMurphy was a menace against his former club, with a dangerous cross of his almost turned into his own net by Will Fish before Bluebirds goalkeeper Jak Alnwick did well to save the winger's curling 20-yard strike.\nFrom the resultant corner, Murphy's cross found Shaughnessy and the centre-back forced his header in despite a touch by Alnwick.\nCardiff were rattled and seemingly ripe for another thrashing but, five minutes after conceding the second goal, they had a route back into the contest as O'Dowda steered in a fine header from Andy Rinomhota's deep cross.\nThat changed the flow of the match as the visitors piled forward and created several chances before half-time, although the break seemed to help Portsmouth as they looked to protect their lead in a second half that lacked the quality and excitement of the first.\nWith chances scarce for both teams, Cardiff emptied their bench in the hope that one of their substitutes might be able to conjure an equaliser.\nBut their attacks lacked imagination and grew increasingly desperate and easy to defend, and it was actually their opponents who came closest to scoring late on as Bishop's shot was deflected on to the crossbar by Dimitrios Goutas.\nMore importantly for Portsmouth, they were resolute enough at the other end to earn what could be a crucial win, one that was celebrated loudly by the rowdy Fratton Park crowd.\nPortsmouth manager John Mousinho told BBC Radio Solent:\n\"My brain is a bit frazzled by some of the things we did but we've come away with three points, which is the most important thing.\n\"I thought we were the dominant side. We didn't allow Cardiff to have much possession, didn't allow them to have too many chances.\n\"My overall feeling is that I'm absolutely delighted we've taken the three points. There's some frustration in parts of the performance but the most important thing at any stage of the season is to pick up the points but particularly now.\"\nCardiff manager Omer Riza told BBC Radio Wales:\n\"I'm disappointed. We made it hard for ourselves. To go two down early on again is hard work. After 20 minutes, we were better and got the goal, created chances we maybe should have scored but in general we weren't good enough.\n\"We lacked execution, we lacked bravery. We were second to a lot of the stuff tonight. We have to move forwards but it wasn't good enough.\n\"They [Portsmouth] have been really strong at home and they're good at the things they did. It was like a rugby match at times and we didn't stand up to the challenge. A few players froze in the moment.\"", "url": "https://www.bbc.com/sport/football/live/cp82pzzmnv1t"}