{"authors": ["Ian Kennedy", "www.facebook.com"], "date_download": "2025-05-21 07:27:44", "date_modify": "2025-05-21 07:27:44", "date_publish": "2025-01-22 13:05:43", "description": "Everton news: Opinion - Who has been Toffees' most-underrated performer of the season?", "filename": "sport_football_articles_c8r5gz8lvrxo_1747812464.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b58/live/9796be80-6ea6-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8r5gz8lvrxo_1747812464.html", "title": "Opinion - Who has been Toffees' most-underrated performer of the season? - BBC Sport", "title_page": "Everton news: Opinion - Who has been Toffees' most-underrated performer of the season? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been a tough season so far for everyone at Everton, and the standout player for much of that time has been Jordan Pickford. Jarrad Branthwaite is also someone who generates headlines, but has had a season hampered by injury, much like Dwight McNeil.\nBut quietly going about his business recently has been Ashley Young, who, at the age of 39, has been among the club's more consistent performers of late, even while having to play at both right and left-back (and other positions too).\nIliman Ndiaye has also done well, which is not easy when the side have been struggling for wins, but he is someone who has that natural ability to go past players - and, as we saw against Tottenham, score goals too.\nDavid Moyes will be hoping for more of that in the second half of the campaign, and that Dominic Calvert-Lewin's goal will kick-start things for him.\nMoyes will obviously want more players to shine now as he tries to guide the team back up the table.\nThere is another tough game at Brighton coming up, but the win over Spurs could act as a springboard towards instilling more confidence and belief.\nListen to Total Sport Merseyside from 18:00 on weeknights and find details here of live Everton match commentaries on BBC Radio Merseyside", "url": "https://www.bbc.com/sport/football/articles/c8r5gz8lvrxo"}