{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:27:20", "date_modify": "2025-04-26 04:27:20", "date_publish": "2025-03-03 10:51:21", "description": "Paul Robinson tells the BBC's Football Daily podcast Aston Villa won't relish an FA Cup quarter-final trip to Preston North End.", "filename": "sport_football_articles_ckg8q1p2z1ko_1745641640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c964/live/a4703cd0-f817-11ef-8dde-aff9d405c81c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8q1p2z1ko_1745641640.html", "title": "Preston North End: Ex-England keeper Paul Robinson praises Aston Villa's FA Cup opponents", "title_page": "Preston North End: Ex-England keeper Paul Robinson praises Aston Villa's FA Cup opponents - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former England goalkeeper Paul Robinson says Aston Villa \"won't relish\" being drawn away to Preston North End in the FA Cup quarter-finals.\nThe Lilywhites reached the last eight for the first time since the year England won the World Cup, 1966, courtesy of a 3-0 derby win over Burnley at Deepdale on Saturday and they are the last EFL side left in the competition.\n\"It's the quarter-final of the FA Cup - Villa won't be relishing the challenge at Preston,\" Robinson told the BBC Football Daily: FA Cup Debrief podcast.\n\"No disrespect to Preston but everyone will have wanted them at home, nobody will have fancied going there.\n\"He's done well there, Paul Heckingbottom. What I've seen of Preston since he's gone in, he's recruited well, changed the style of football.\"\nRobinson ended his career with Burnley but encouraged the Clarets' rivals to seize their opportunity.\nHe added: \"They are a Preston side who are playing the best football I've seen them play in a number of years. I think they are in a really good place.\n\"I don't like the saying 'it's a free hit' but it absolutely is for Preston - go and enjoy it!\"", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8q1p2z1ko"}