{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:52", "date_modify": "2025-05-21 07:48:52", "date_publish": "2025-05-18 18:06:04", "description": "Haverfordwest book their place in the qualifying round of the Europa Conference League after beating Caernarfon in the Cymru Premier play-off final.", "filename": "sport_football_articles_c8e6pd6x17ro_1747813732.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b603/live/96143dd0-3412-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8e6pd6x17ro_1747813732.html", "title": "Cymru Premier play-off final: Haverfordwest 3-1 Caernarfon", "title_page": "Cymru Premier play-off final: Haverfordwest 3-1 Caernarfon - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Haverfordwest booked their place in the qualifying rounds of the Europa Conference League after beating Caernarfon 3-1 in the Cymru Premier play-off final.\nHaverfordwest took the lead after 17 minutes, Corey Shephard driving into the Caernarfon box before squaring to Ben Ahmun for a tap in.\nThe Bluebirds doubled their lead on 33 minutes, Owain Jones' deft flick putting Dan Hawkins through on goal, and the 24-year-old added an excellent left-footed finish.\nCaernarfon went close on the hour mark, but Adam Davies's thumping effort from close range came back off the right post.\nAnd the result was put beyond doubt with four minutes remaining, as Gregory Walters put through Ahmun to score his second of the match.\nThere was still time for Caernarfon to give their fans something to cheer, as Louis Lloyd took advantage of an error from Haverfordwest goalkeeper Zac Jones to finish from an acute angle.\nHaverfordwest return to European competition for the first time since 2023, when they claimed a thrilling Europa Conference League victory over North Macedonian side Shkendija before losing out to B36 Torshavn.\nIt was not to be for Caernarfon, who qualified last season after beating Penybont in the final.", "url": "https://www.bbc.com/sport/football/articles/c8e6pd6x17ro"}