{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:16:43", "date_modify": "2025-04-26 08:16:43", "date_publish": "2025-02-26 10:31:43", "description": "Man City news: De Bruyne's future is his decision and not Guardiola's", "filename": "sport_football_articles_clyrk0885mzo_1745655403.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0285/live/a681b170-f416-11ef-b21d-b7e43192c885.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clyrk0885mzo_1745655403.html", "title": "De Bruyne's future is his decision and not Guardiola's", "title_page": "Man City news: De Bruyne's future is his decision and not Guardiola's - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City boss Pep Guardiola says Kevin de Bruyne's future at the club must be his own decision and not his.\nDe Bruyne is in his 10th season for City after joining for £55m in 2015, but is out of contract in the summer.\nThe 33-year-old has established himself as one of the greatest midfielders in Premier League history, winning six titles, five League Cups, two FA Cups, two Community Shields and the Champions League.\nWhile his role in the Treble-winning side of 2023 was huge, this season he has struggled to make an impact in what has been an injury-disrupted campaign.\nWhen Pep Guarduiola was asked if his relationship will be key to any decision on De Bruyne's future, Guardiola said: \"Nothing is going to change about that. Of course, we know each other quite well and we are quite honest with that.\n\"In that situation, he has to decide, that is the most important thing. He's completely honest with himself, to decide what he feels and what he can do in the next period of his life.\n\"He is 34 in the summer and he has to decide - like what happened with David Silva, for example.\"\nDe Bruyne has previously been linked with moves away to Major League Soccer in the United States or Saudi Pro League, but he could also remain at Manchester City in a reduced role.", "url": "https://www.bbc.co.uk/sport/football/articles/clyrk0885mzo"}