{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:55:05", "date_modify": "2025-05-20 12:55:05", "date_publish": "2023-07-26 06:43:55", "description": "Nottingham Forest: Chris Bart-Williams remembered by Craig Armstrong", "filename": "sport_articles_c4n4wx55dleo_1747745705.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4749/live/97fc9d60-2b7f-11ee-940d-63d72d220dda.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4n4wx55dleo_1747745705.html", "title": "Nottingham Forest: Chris Bart-Williams remembered by Craig Armstrong", "title_page": "Nottingham Forest: Chris Bart-Williams remembered by Craig Armstrong - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Nottingham Forest defender Craig Armstrong has been reminiscing on the time he spent with Chris Bart-Williams during their time playing together at the club in the late 1990s.\nSpeaking to BBC Radio Nottingham, Armstrong reflected on the passing of his former team-mate - describing him as the \"life and soul\" of the dressing room.\n\"He socialised a lot with the lads,\" he added.\n\"We were a really tight-knit group. I just remember going on nights out and he'd always carry the kitty, he'd always be ordering the drinks. He made sure we were all as a group and, when we needed to go out, him and Kevin Campbell were the ones at the forefront organising things.\n\"When I'm looking at how players control the football, how they cushion it and have that soft feel on the ball, how they can manipulate the ball - Chris was like that on both feet. Little balls round corners, outside of his left foot, outside of his right - his range of passing was outstanding.\n\"For someone who didn't fasten up his boots - how his boots never came off his feet I don't know. He had wide feet, never fastened up his boots, always wore rubber studs.\n\"Not just ability, he was so confident as a person. He'd come into a dressing room and call everyone 'kid'. It epitomises what he was as a person - his character, his enthusiasm.\"", "url": "https://www.bbc.com/sport/articles/c4n4wx55dleo"}