{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:41:37", "date_modify": "2025-05-21 04:41:37", "date_publish": "2025-04-03 08:21:26", "description": "BBC local radio cricket commentators and online journalists take a look at each County Championship side's prospects for the 2025 season.", "filename": "sport_cricket_articles_c78j96z1p87o_1747802497.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/595b/live/f9decf10-0fc8-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c78j96z1p87o_1747802497.html", "title": "2025 County Championship: Club-by-club guide to the season", "title_page": "2025 County Championship: Club-by-club guide to the season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "2024 season - Eighth in Division Two\nDave Fletcher - BBC Radio Derby\nGiven Derbyshire finished bottom of Division Two in 2024, things can surely only improve.\nThey did at least win a game last year, unlike 2023, but it was another bitterly disappointing watch for the County Ground faithful.\nThey were not helped by an opening round washout against Gloucestershire last season which meant they were playing catch-up from the off.\nThat appears unlikely to be repeated so a quick start – against the same opposition - is essential.\nThey have added Australian opening batter Caleb Jewell to the squad and he will be joined by returning Kiwi quick bowler Blair Tickner, whose spell last season was all too brief.\nThere's a new captain at the helm, too, although it is a familiar figure. Wayne Madsen, who led the side to promotion in 2012, takes over from David Lloyd after his solitary campaign leading the side.\nTickner's return and the presence of experienced bowlers such as Zak Chappell and Pat Brown can only benefit newcomer Harry Moore.\nAlready in the England system, the much talked-about 17-year-old will be starting his first full season in the senior side having already shown he can more than hold his own at that level.\nWinter signings Jack Morley and Martin Andersson will be better for having been with the group last season.\nThe big challenge remains the ability to take 20 wickets a match, something Mickey Arthur's side have to do if they are to repeat the relative riches of his first season in charge in 2022.\n2024 season - Fifth in Division One\nMartin Emmerson - BBC Radio Newcastle\nDurham finished fifth on their return to Division One last season and in general more than held their own. They might be able to improve on that this year. We'll see.\nThey weren't helped by the loss of their entire opening game - at home to Hampshire in April – but there was only really Surrey who turned them over.\nThat was towards the end of the season and the week Surrey retained their title - and they beat a weakened Durham side struggling with injuries.\nFrom a batting point of view they have added Emilio Gay to the ranks. He joined towards the end of last season from Northants, while Will Rhodes chose to leave Warwickshire after seven seasons, despite the offer of a new contract.\nThey will help boost a line-up which includes the leading batter in Division One last season, in South African David Bedingham. He scored 1,331 runs, including a club-record 279 against Lancashire in September. He also became the first Durham batter to score centuries in four consecutive innings.\nOpener Michael Jones has left for Lancashire. His outings last season were limited due to selection choices, so he took the decision to head back home.\nBowling is the key issue. They've had no luck with overseas players in recent seasons. Scott Boland lasted part of one game before returning home to Australia in April. Neil Wagner managed just one game too. Veteran Peter Siddle came in and did well in his four games, while West Indian Chemar Holder didn't particularly pull up any trees in his three matches. Keeping their bowlers fit will be key.\nIt remains to be seen how much of a good signing Sam Conners will be. The bowler has joined from Derbyshire. While he boasted 50 championship wickets in 2022, he took 27 the following year, but only played five Championship matches last season. Australian seamer Brendan Doggett will play County Championship matches in April and May. The 30-year-old seamer plays for South Australia and has 157 first-class wickets to his name.\nThen there's the likes of ever-dependable all-rounder Ben Raine. Matthew Potts is important to the team too, when England allow him to be available. Seventeen-year-old James Minto looks a good prospect and fellow bowler Daniel Hogg will be looking to push on after a career-best 7-66 against Notts in Chester-le-Street.\n2024 season - Fourth in Division One\nVictoria Polley - BBC Radio Essex\nThere's been change at the top for Essex over the winter with Chris Silverwood returning to the club as director of cricket.\nEssex won successive titles (Div 2 & 1) in his previous tenure as head coach, including a first County Championship win in 25 years, before England came calling.\nWith his assistant Anthony McGrath taking over from then up until last season, it will hopefully be a more seamless transition than these changes can sometimes be.\nDean Elgar was vital at the top of the order last season but who will open alongside him is the big question? Do Essex give a chance to teenager Charlie Allison who has impressed in the white-ball formats? They have other options in the likes of Nick Browne or Robin Das, or even bumping Paul Walter or Michael Pepper up higher.\nJordan Cox was also key with the bat last season but has had a torrid winter, denied an England Test debut by a thumb injury. International opportunities could affect his availability.\nAn international call-up still eludes bowler Sam Cook but England's loss is very much Essex's gain - alongside Jamie Porter and Simon Harmer, it's a potent bowling attack.\nIt would've been strengthened with the signing of Shardul Thakur but his late involvement in the IPL has ruled him out of a move to Chelmsford, and Essex continue to hunt for a replacement.\nIt's been six years since Essex last won a County Championship title and they continue to punch above their weight in competing at the top end of the table.\nThey might not have the squad size and budgets of other counties but there's still plenty of talent and experience among the Essex ranks. Can Silverwood add more silverware to his Essex collection on his Chelmsford return?\n2024 season - Sixth in Division Two\nNick Webb - BBC Radio Wales Sport\nThe arrival of Richard Dawson as head coach after the unexpected departure of Grant Bradburn is the main change at Sophia Gardens, with the squad looking remarkably similar to last season.\nThe second One-Day Cup triumph in four years put a gloss on an otherwise disappointing 2024 campaign as Glamorgan showed only marginal improvement in the T20 Blast and fell away in the latter stages of the Championship promotion race.\nKey factors in the Championship will be finding a consistent opening partnership to go with the settled top order of Sam Northeast, Kiran Carlson, Colin Ingram and Chris Cooke, as well as getting the most out of a seam attack lacking raw pace.\nEddie Byrom, unlucky with injury in several seasons, is the most likely starter up top but his partner could be one of four or five candidates.\nSri Lankan Asitha Fernando is likely to partner Timm van der Gugten with the new ball in the opening stages of the season, while it will be interesting to see if on-loan England off-spinner Shoaib Bashir makes an impact as cover for Mason Crane early on when pitches usually don't help the twirlers.\nThere is little doubt that young all-rounder Ben Kellaway will become a regular in all formats sooner or later, but being thrown in as a red-ball opener was maybe a step too far.\nHis ambidextrous spin is a unique selling point added to some hard hitting in the middle order.\nOverall the county needs to manage a fair degree of change in the medium term, with a fair few of their stalwarts well past the 30 mark.\n2024 season - Seventh in Division Two\nEd Seabourne - BBC Radio Bristol\nGloucestershire approach the 2025 season with a renewed sense of ambition, keen to ensure this campaign isn't looked back on as the previous September's hangover.\nWhilst 2024 will always be remembered for the remarkable run to the county's first T20 Blast trophy, head coach Mark Alleyne made no bones about the fact he was disappointed to have ended so far behind the promotion spots in the County Championship.\nDespite the final positioning, significant strides forward were made on the batting side.\nWicketkeeper James Bracey is following a stellar year that saw him achieve the rare double of 1,000 runs and 50 dismissals, and there is increasing competition for spots in the top order.\nThe signing of Australian all-rounder Cameron Green for five matches will only add to that, and there is even hope he will be allowed to bowl towards the end of his stay.\nThe club possesses a group of promising young pace bowlers, including recent England Lions call-ups Zaman Akhter and Ajeet Singh Dale, and newly appointed Championship skipper Cameron Bancroft has spoken of his excitement in working with them.\nThe departure of Zafar Gohar, however, means the squad is without a proven red-ball spinner, and, especially with the dry spring, the serious question will be whether there is enough variety in the attack in its current form to force wins on a consistent basis.\n2024 season - Second in Division One\nKevan James - BBC Radio Solent\nTrying to improve on their second-place finish in the Championship last season may depend on a dip in form from Surrey, but also how Hampshire cope without being able to call upon two very influential players.\nJames Vince, the captain and leader of the batting line-up, has decided red-ball cricket is no longer for him. Mo Abbas, taker of 180 wickets over the past four seasons, has been moved on.\nVeteran Mark Stoneman looks a shrewd signing to partially or maybe fully offset the hole left by Vince.\nOn the bowling front, exciting prospects Sonny Baker and John Turner will be given more responsibility. They will certainly add pace.\nA disappointing T20 campaign will hopefully be turned around by the addition of two hard-hitting South Africans in Lhaun-dre Pretorius and Dewald Brevis.\nPretorius, 19, was the top run scorer in the recent SA20 competition, while Brevis finished the tournament with the top strike rate of 180.\nBy all accounts Pretorius has the potential to be world class very quickly.\n2024 season - 10th in Division One (relegated)\nMatt Cole - BBC Radio Kent\nThe summer of 2024 was a pretty dismal affair for both club and supporters. In the Championship they found themselves outgunned, particularly in the bowling department, and never really looked like they were escaping the drop from Division One they'd so narrowly avoided the year before.\nPerhaps more worrying was the T20 Blast campaign. The Spitfires - perennial contenders for the knockout stages - won just four of 14 games and finished bottom of the South Group. The One-Day Cup didn't add much encouragement for supporters desperate for something to hope for.\nKent come into the new season though with Adam Hollioake replacing Matt Walker as head coach. It's the former Surrey and England all-rounder's first time in the role for a county side and players and supporters alike have received the appointment with some excitement.\nThe playing ranks have been bolstered by new signings – Chris Benjamin moving from Warwickshire hoping to reinvigorate his career as an all-formats batter.\nKent's bowling was the major cause for concern last season, both injuries and lack of form making them look toothless at times. A double signing of seamers just before the start of the campaign is looking to address that – recent Test debutant for Pakistan, Kashif Ali, and experienced South African pace man Keith Dudgeon are in place for the first part of the campaign.\nThey've also added Corey Flintoff – son of Andrew, brother of Rocky – to the squad, the fast-bowling all-rounder joining on a rookie contract.\nWith Aussie bowlers Wes Agar and Tom Rogers returning for the T20 Blast, it appears more of an evolution than a revolution at Canterbury this summer.\nBut if Hollioake can get the best out of the squad they could be among the front-runners for promotion back to the top division of the Championship and a return to upsetting the big budget sides in the Blast.\n2024 season - Ninth in Division One (relegated)\nScott Read - BBC Radio Lancashire\nSince winning the County Championship title in 2011, Lancashire have been relegated four times.\nOn the previous three occasions they've won promotion straight back to Division One.\nThey'll be expected to continue that trend this season and will start as firm favourites.\nEven without James Anderson for the first month, the Red Rose have a healthy blend of senior professionals and young players making their way in the game.\nThe overseas signings of Marcus Harris and Anderson Phillip look like excellent business.\nPhillip, for the first 11 games, will provide some extra pace, Harris for the entire season to open the batting.\nThe arrival of the Australian opener will also allow Luke Wells to bat at six giving Lancashire some much-needed experience in the middle order.\nLancashire have some fine young players who endured a tough season for the club last year. A year on from that, the likes of Matty Hurst, George Balderson and George Bell should prosper.\nFor Hurst, almost 700 runs at an average of 32 in his debut season for a relegated team was an impressive return.\nThere will also be plenty of opportunities for Tom Aspinwall and Rocky Flintoff, who does not turn 17 until next week.\n2024 season - Fifth in Division Two\nRichard Rae - BBC Radio Leicester\nThe return of Peter Handscomb, who made 894 runs in 14 Championship innings at an average of 74.5 last season, the signing of Shan Masood from June onwards, the presence at the top of the order of the talented Rishi Patel and the fact most of the bowlers have legitimate claims to be described as all-rounders, should mean Leicestershire are not short of runs this season.\nNor, if the likes of Patel, Sol Budinger, Rehan Ahmed and Louis Kimber find form, will they score those runs slowly.\nThe big question is whether they have the firepower to bowl teams out twice.\nLast season, Leicestershire took the lowest number of wickets (139) in Division Two by some distance, and some supporters have argued the signing of New Zealand-born Netherlands international Logan van Beek adds to their ranks of bowling all-rounders rather than gives the Foxes the cutting edge they need to break games open.\nTall young left-arm prospect Josh Hull has that potential, but has spent the close season struggling with injury.\nThere is hope in the pre-season performances of the likes of veteran Chris Wright and the promising Tom Scriven, while Ben Green's return from Somerset for the first seven Championship matches adds depth.\n2024 season - Third in Division Two\nKevin Hand - BBC Radio London\nThe signing of New Zealand batter Kane Williamson is something of a coup for a county that are operating under strict financial restrictions imposed by the England and Wales Cricket Board (ECB).\nThe rearrangement of the budget for wage allocation within the squad meant a number of players were released last season, including the tough decision to let the popular former England opener Mark Stoneman go.\nWith the evergreen opener Sam Robson aging well and Leus de Plooy a gun player in all formats, Middlesex have a top order to be feared - probably for the first time since Robson, Nick Gubbins and Nick Compton formed a top three that played a huge part in the 2016 Championship winning side.\nThe mark of the Middlesex team under former director of cricket Angus Fraser, who took charge in 2009, was the regular ability to blast through teams with the ball.\nIn the absence of the retired Tim Murtagh, Middlesex struggled to rattle through the wickets last year and captain Toby Roland-Jones bore a heavy burden on that front.\nIt was refreshing to see the right-armer clear of injury for the season and his team will desperately need that once more if they are to be promoted.\nThe former England international will have his workload eased this year by the arrival of South African seamer Dane Paterson, another crucial addition to the squad that could make a significant difference to a side that looked on course for promotion for most of last season.\nThe signings of Williamson and Paterson to bolster the Championship side are a clear indication that Middlesex want success to return in the shape of promotion this year.\n2024 season - Fourth in Division Two\nAndrew Radd - BBC Radio Northamptonshire\nThe arrival of Australian Darren Lehmann as head coach at Wantage Road has triggered a wave of pre-season positivity in a squad left feeling somewhat bruised by the events of the past couple of years.\nAfter being relegated from Division One in 2023 they failed to register a Division Two win in 2024 until September, by which time Lehmann's predecessor John Sadler had lost his job following defeat in the T20 Blast quarter-finals.\nWith opener Emilio Gay and fast bowler Jack White both heading north, to Durham and Yorkshire respectively, there will be opportunities for others to shine.\nYoung batters Krish Patel (who opened his account with five boundaries on first-class debut at Headingley last September) and Aadi Sharma have much to offer, while the seam attack has been bolstered by the signings of Dom Leech, left-armer Liam Guthrie and – for the four Championship fixtures in May – Harry Conway from South Australia.\nGeorge Scrimshaw and the hugely promising Raphy Weatherall suffered injuries last season and will be eager to re-establish themselves.\nMuch will depend – certainly in four-day cricket - on the tried-and-trusted trio of Luke Procter, Ben Sanderson and Rob Keogh.\nIndian leg-spinner Yuzvendra Chahal had a major impact towards the end of 2024 and returns this year for a longer second-half stint.\nOther key figures across all formats will be Saif Zaib, who – to the relief of supporters – agreed a contract extension until at least the end of 2027, plus a couple of upwardly-trending all-rounders in Justin Broad, son of former tennis star Neil and named the county's Media Player of the Year last season, and Gus Miller.\n2024 season - Eighth in Division One\nDave Bracegirdle - BBC Radio Nottinghamshire\nYazz knew what she was on about, didn't she? 'The Only Way Is Up' was not only a catchy hit single but is also a good place to approach Nottinghamshire's hopes for 2025.\nHead coach Peter Moores has emphasised that it's important to learn from what went wrong last year, as well as draw a line underneath it.\nAs a brief reminder, Notts narrowly avoided relegation from Division One of the County Championship, finished bottom of their group in the T20 Blast and barely raised a pulse in the One-Day Cup.\nSo what might be different this time around?\nThe only domestic signing sees Conor McKerr join from Surrey but with Josh Tongue now fully fit, those two bolster a fast-bowling unit that promises untold riches.\nIf Notts can keep Olly Stone healthy, alongside overseas recruits in Australia's Fergus O'Neill and Pakistan's Mohammad Abbas, throw in the evergreen Brett Hutton and the raw pace of Rob Lord, then their resources seem well stocked.\nTeenagers Farhan Ahmed and Freddie McCann both made their county debuts towards the back end of last season and already carry the weight of expectation.\nThe prodigious spinning fingers of 17-year old Ahmed have already marked him out as a generational talent, while 19-year-old team-mate McCann hit two centuries in just seven innings.\nSome astute observers are already wondering if Kyle Verreynne is the best wicketkeeper-batter in the world right now. The county fought off a lot of competition to secure the services of the South African for the whole campaign.\nThat just leaves the top order. While Trent Bridge members may not see too much of England's Ben Duckett once again, there are guaranteed runs from skipper Haseeb Hameed and the gifted Joe Clarke, both as good as any in the county game.\n2024 season - Third in Division One\nAnthony Gibson - BBC Radio Somerset\nWith a strong and settled squad of players shrewdly captained by Lewis Gregory, and terrific team spirit, Somerset go into the new season with every hope of marking the club's 150th anniversary with a first County Championship.\nInjuries permitting, Matt Henry will be back to lead a powerful seam attack, balanced by the spin of Jack Leach, rising star Archie Vaughan and, once he returns from a loan spell at Glamorgan or his England duties are over, Shoaib Bashir.\nAmong the batters, the only real question is who will partner Vaughan at the top of the order, Sean Dickson being the most likely answer.\nThe three Toms - Lammonby, Abell and Banton - will once again make up the engine room of the batting, with James Rew ready to reinforce his reputation as one of the most promising wicketkeeper-batters in the country.\nUnlike the infinitely talented Will Smeed, who is happily returning to the red-ball fold, Tom Kohler-Cadmore will focus on the white ball and the Blast, so that the firepower which has seen Somerset reach Finals Day in each of the past three seasons remains very much intact.\nFor Somerset's team of youngsters to have reached the One-Day Cup Final last year was a surprise, but they can by no means be discounted. James Rew's younger brother, Thomas, will surely come into that side, and what a prospect he is.\nLast year was a case of so near and yet so far - in contention for all three trophies, ending up with none.\nThe team will have learned from that, and if they can graft staying power onto all their other strengths, this could, at last, be Somerset's season.\n2024 season - First in Division Two (promoted)\nAdrian Harms - BBC Radio Sussex\nThere's much excitement and anticipation on the south coast, as Sussex return to Division One after almost a decade in Division Two.\nDuring that period they have never mounted a serious promotion bid, and it's taken change at the top, and the subsequent appointment of Paul Farbrace to galvanise the club.\nFarbrace has introduced a winning mentality that had been sadly lacking, and crucially supplemented a talented group of younger players with, in his words, \"knarled old pros\" who know how to win, and battle when the going gets tough.\nHowever, this is essentially a young Sussex side most with no experience of first division cricket, and therefore the experience of Australian Daniel Hughes, skipper John Simpson and Ollie Robinson will be crucial particularly during the opening weeks of the season.\nBut don't think Sussex will be a soft touch and are back in Division One for the ride.\nProvided the top order can score enough runs, they have a match-winning spinner in Jack Carson and are especially difficult to beat at Hove, where they haven't lost since Farbrace took the helm.\nSussex have taken nine long years to return to Division One, and the feeling around the club is that's where they want to stay.\n2024 season - Seventh in Division One\nMike Taylor - BBC Radio WM\nA confusing winter followed a confusing summer.\nOften in 2024 it seemed something was going to happen for Warwickshire - they were front-runners in both white-ball tournaments, and frequently built strong early positions in Championship games.\nAnd then nothing happened. No white-ball final, only one four-day win.\nSeveral leading players had outstanding individual seasons - runs for the captain Alex Davies, wickets for Olly Hannon-Dalby, both for Ed Barnard, England calls for Jacob Bethell and Dan Mousley - but the total, somehow, came to less than the sum of the parts.\nA detailed high-performance review had seemed, from the outside, to have also come to no significant conclusion, the exit of performance director Gavin Larsen being unrelated, until head coach Mark Robinson suddenly left seven weeks ago.\nNow, there is both change and continuity. Ian Westwood, a known and trusted leader, is promoted to replace Robinson.\nThe patient, determined approach he showed as an opening bat and captain in testing circumstances should serve him well.\nA collection of overseas players also mixes the familiar and the new. Hasan Ali is already popular at Edgbaston, while Beau Webster has the qualities that should see him thrive mid-summer.\nHopefully all will avoid the bad luck with injuries that has so weighed Warwickshire down in recent years, and has hit Tom Latham before he even arrives.\nEdgbaston is always a busy place, but had become grumpy in the stands by last September, with so much promise unfulfilled.\nHaving seemed at times to be pushing on all fronts at once, they had gone nowhere. The club has a lot of moving parts but no shortage of talent.\nIf Davies and Westwood can steer the team in a clear direction, and maintain a strong challenge at least in one competition, it will be a year of progress.\n2024 season - Sixth in Division One\nGed Scott - BBC Sport online's Pears reporter\nA long, hard, emotional season eventually blossomed into some happiness for Worcestershire in 2024.\nIn between all the trauma of not being able to play their first home game at flood-hit Worcester until 25 May then came the devastating loss of one of their players, Josh Baker, at the tragically early age of just 20.\nBut the spirit the Pears showed in adversity could only be admired.\nThey gave a string of youngsters their chance in an unexpectedly progressive One-Day Cup campaign – and, either side of the mid-summer County Championship break, they produced three huge red-ball victories on the trot.\nThat not only helped them stay in the top flight, it was enough to catapult them up to sixth - their highest finish since two-division cricket began in 2000. Finishing above both neighbours Warwickshire and also Nottinghamshire, where four of their former players are now based, was a source of particular pride and pleasure.\nBuilding on that and again keeping their place in an always competitive division is now the challenge - although they will have to do so without the retired Joe Leach, as well as Kiwi Nathan Smith, who did well over the first half of last summer but then opted to join champions Surrey.\nBut they have another New Zealand fast bowler Jacob Duffy arriving from the second game onwards. They have three more incomers in Ben Allison from Essex, Nottinghamshire spinner Fateh Singh and Australian seamer Ben Dwarshuis for the T20 Blast.\nThey also still have that same marvellous team spirit to fall back on – and a real, genuine hunger.\nLong-term doubts remain over their future at New Road - but, in the short term, prospects at Worcester are brighter than people might think.\n2024 season - Second in Division Two (promoted)\nJonathan Doidge - BBC Radio Leeds\nIt is likely to be a very interesting 2025 for Yorkshire.\nWith financial concerns now, apparently, assuaged at the very moment the team has returned to the top flight of the Championship, plus a new coaching staff and new red ball and T20 captains, there should rightly be an air of optimism.\nJonny Bairstow follows in his late father David's footsteps to steer the Championship challenge. He'd love to have a title as captain on his CV but aside from captaincy, his presence alone with the bat will be huge.\nSimilarly, Dawid Malan is going to be back playing more red-ball cricket, a major plus. Add to that potent opening pair of Adam Lyth and Finlay Bean, plus James Wharton, whose career began to blossom last year in particular, and more established batters like George Hill and that end of the team should be capable of setting up games.\nAs we know, that's no good without the ability to take 20 wickets and in that department there's plenty of encouragement.\nThe outstanding Ben Coad will again lead the line. Overseas input comes from, in particular, New Zealand's Ben Sears plus Will Sutherland (two matches) and Jordan Buckingham (four) also chipping in, while there's also George Hill, Jordan Thompson, off-season recruit Jack White, plus Matt Revis and Matt Milnes, who are on the road back from injury.\nDom Bess looks likely to be this coach's first pick among the spinners, though Dan Moriarty and Jafer Chohan will want a say in that.\nWith Bairstow donning the wicketkeeping gloves, Jonathan Tattersall and Harry Duke are going to have to wait for further opportunities, unless required as batters. You'd certainly have to feel for Tattersall after he led the team back up last season - but this is professional sport.\nWith One-Day Cup centurion Will Luxton awaiting another opportunity, there'll be upward pressure with the bat and I'd be backing Ben Cliff to put some serious pressure on the more senior bowlers in the squad. He could really take his own game to the next level as the season unfolds.\nIn summary, there's optimism that head coach Anthony McGrath can take the team to places it hasn't been for quite some time.", "url": "https://www.bbc.com/sport/cricket/articles/c78j96z1p87o"}