{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:13:52", "date_modify": "2025-05-19 15:13:52", "date_publish": "2015-03-04 14:18:53", "description": "Kevin Pietersen's return to the England team would be \"untenable\", says former one-day captain Adam Hollioake.", "filename": "sport_cricket_31731702_1747667632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81393000/jpg/_81393024_kevin_pietersen_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_31731702_1747667632.html", "title": "Kevin Pietersen: England return untenable - Adam Hollioake", "title_page": "Kevin Pietersen: England return untenable - Adam Hollioake - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England's one-day side are in \"defensive mode\" but Kevin Pietersen's return would be \"untenable\", says former captain Adam Hollioake.\nEngland are struggling to qualify for the World Cup quarter-finals after losing three of their four group games.\nPietersen said he would \"work\" on a return after incoming England and Wales Cricket Board (ECB) chairman Colin Graves refused to rule out a recall.\n\"It would be too distracting to have him back in the side,\" said Hollioake.\nPietersen, who played 104 Tests and 136 one-day internationals, was sacked by England in February 2014.\nThe batsman has not represented England since the 5-0 Ashes whitewash in Australia, which finished the previous month.\nHe released an autobiography in October in which heavily criticised key ECB figures and England players.\nECB managing director Paul Downton said in December \"more bridges have been burnt\", and national selector James Whitaker said there was \"no way\" Pietersen would return to the side.\nHowever, on Sunday, Graves, who takes over as ECB chairman in May, refused to dismiss the idea of a Pietersen recall.\nHollioake, who captained England in 14 of his 35 one-day internationals, told BBC World Service's Stumped programme: \"When he got jettisoned, I thought it was the wrong decision. The whole thing was handled appallingly.\n\"But what he did with his book and his behaviour since then is everything you wouldn't want someone to do if they were trying to regain their place in the side.\"\nPietersen, 34, captained England in three Tests but quit in 2009, external at the same time as coach Peter Moores was sacked.\nMoores was reappointed in 2014 after Pietersen was told he would never play for England again.\nHollioake added: \"Everything is forgivable but, with Peter Moores as coach, I don't know whether it's tenable.\"\nMichael Vaughan, who captained Pietersen during his time in charge of England, has challenged him to \"prove\" he wants to play for his country again.\nBut former team-mate Matthew Hoggard said Pietersen is \"too far removed\" from the team to make an international return.\nDefeats by Australia, New Zealand and Sri Lanka have left England second bottom of World Cup Pool A.", "url": "https://www.bbc.com/sport/cricket/31731702"}