{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:23:19", "date_modify": "2025-04-26 06:23:19", "date_publish": "2025-03-04 00:00:00", "description": "Hull move five points clear of the Championship relegation zone with a routine win over Plymouth.", "filename": "sport_football_live_cgm11e8p04nt_1745648599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fe5/live/2bdc52d0-f93f-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cgm11e8p04nt_1745648599.html", "title": "Hull City 2-0 Plymouth Argyle: Abu Kamara seals Tigers win", "title_page": "Hull City 2-0 Plymouth Argyle: Abu Kamara seals Tigers win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hull City moved five points clear of the Championship relegation zone with a routine victory over a dismal Plymouth Argyle, who are now six points from safety.\nThe Pilgims, perhaps jaded and flat following their impressive display in Saaturday's FA Cup defeat by Manchester City, did not manage a shot on target throughout but held firm to go in scoreless after a dreadful first half.\nBut Joe Gelhardt's tidy close-range strike put the Tigers ahead within three minutes of the resumption.\nAnd a controversial second sealed Hull's first home win of 2025 soon after, Abu Kamara tapping the ball home from a cross by Joao Pedro, who appeared to be well offside when he made his break on the left.\nKamara's clincher, while tough on Argyle and understandably the cause of a furious reaction from boss Miron Muslic, was no more than the hosts deserved and was unlikely to have affected the outcome.\nArgyle have now not won away in 18 Championship games this season, managing just six goals - and they never looked like ending that terrible run after falling behind, even against a Hull side with the division's worst home record.\nThe struggling teams certainly served up a first half worthy of the form guide.\nA couple of long throws and a dangerous free-kick that caused a brief moment of defensive concern aside, Plymouth offered no threat before the break with just three touches in the opposition box and no attempts on goal.\nHull failed to create much either, but they did show far greater adventure and caused several nervy moments from wide areas, having nullified Argyle's wing-backs with some smart and energetic pressing.\nGustavo Puerta should have done better with an inviting right-wing cross from Lewie Coyle but got his timing all wrong, while the Colombian midfielder did much better with his second headed opportunity when he forced Pilgrims keeper Conor Hazard to make the only notable save with his legs.\nThe deadlock - and boredom - was broken with a delightful finish by Gelhardt within three minutes of the restart, the on-loan Leeds midfielder's fine anticipation and awareness allowing him to fire the ball home first time when Sean McLoughlin's strike was half-blocked.\nGood approach work by Coyle and Kamara set up the impressive Kyle Joseph, whose close-range effort produced a fine save from Hazard, but the keeper could do nothing about the second as Kamara had the simplest of tasks to score at the far post and wrap up a second win in three league games.\nHull City head coach Ruben Selles told BBC Radio Humberside:\n\"We looked to perform in the proper way and we did the things we wanted to do in the game today.\n\"One of the key things was to be brave, to get the tempo high and I am pleased everyone got on board.\n\"I was not worried about the first 45 minutes - you cannot expect teams in our position right now to be perfect. I expected the game they prepared for us, but we controlled the game.\n\"The early goal in the second half helped. When you score the first goal it is massive. It gave us more space but we had to carry on playing with intensity.\"\nPlymouth head coach Miron Muslic said:\n\"We simply didn't show up in a game that we knew was a big one for us.\n\"There are too many players who cannot deliver consistently the performances that we need to be competitive.\n\"The reality in the Championship is fighting for every inch on the pitch, and we missed this today completely.\n\"The second goal, with all due respect, this player (Pedro) is one-and-a-half metres offside. I think at this level we should see this.\"", "url": "https://www.bbc.co.uk/sport/football/live/cgm11e8p04nt"}