{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:45:31", "date_modify": "2025-04-26 06:45:31", "date_publish": "2025-03-01 15:21:34", "description": "Jersey Bulls move into the top two of Combined Counties Premier South after a 2-0 win at Guildford City.", "filename": "sport_football_articles_cd0n2kke8eeo_1745649931.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33e7/live/efe920b0-f6ae-11ef-acd4-091c140b24c6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cd0n2kke8eeo_1745649931.html", "title": "Jersey Bulls into top two with 2-0 Guildford City win", "title_page": "Jersey Bulls into top two with 2-0 Guildford City win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jersey Bulls moved into the top two of Combined Counties Premier South after a 2-0 win at Guildford City.\nJersey-bred former professional Kurtis Guthrie needed just three minutes of his debut to help put the islanders ahead - his ball into the box was flicked on by Fraser Barlow and scrambled into his own net by a Guildford player.\nToby Ritzema and Jonny Le Quesne had chances before Guildford goalkeeper Monty Conway made an excellent save from a Luke Campbell header 10 minutes from half-time.\nThe hosts went close soon after the restart while Barlow forced a second excellent save from Conway soon after.\nA minute later Guthrie narrowly missed after a saved Campbell header fell into his path.\nBulls' veteran midfielder Luke Watson missed a 64th-minute penalty after Barlow had been fouled in the box, but the islanders recovered from the miss almost straight away.\nTwo minutes later Guildford had Emmanuel Acheampong sent off for a dangerous tackle on Campbell and two minutes after that Campbell was on hand to double the lead as he tapped in Joe Kilshaw's cross.\nThe win sees Bulls go second in the table above Whyteleafe on goal difference.\nThey remain three points off leaders Redhill, but the islanders have a game in hand on both of their rivals.\n\"We probably didn't play our best football in the first half, but we got to grips with it a lot more in the second,\" Bulls manager Elliott Powell told BBC Radio Jersey.\n\"At this stage of the season it's not too much about performances and much more about results, so I'm really happy with the day's work.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cd0n2kke8eeo"}