{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:35", "date_modify": "2025-05-21 07:05:35", "date_publish": "2025-03-29 00:00:00", "description": "Wrexham take another step towards an historic third successive promotion with a 2-0 win at St James Park to end Exeter City's six-game unbeaten run.", "filename": "sport_football_live_c5y0n0np92lt_1747811135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eee3/live/cfce3fe0-0cc0-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c5y0n0np92lt_1747811135.html", "title": "Wrexham maintain promotion push with Exeter win", "title_page": "Wrexham maintain promotion push with Exeter win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham took another step towards an historic third successive promotion with a 2-0 win at St James Park to end Exeter City's six-game unbeaten run.\nOllie Rathbone's deflected first-half effort put Phil Parkinson's side in control against the Grecians, before Jay Rodriguez's second-half penalty sealed matters.\nOnly briefly threatened, the powerful performance from the visitors was enough to seal a fifth win in six games.\nIt was needed too; with all of League One's top-five winning, the result kept Wrexham in the automatic spots with seven fixtures remaining, three points ahead of Wycombe Wanderers who have a game in hand.\nExeter, beaten for the first time since losing to Charlton in February, dropped to 17th, nine points above the relegation places.\nBut Gary Caldwell's side rarely looked like making this difficult for Exeter after Rathbone opened with his sixth Wrexham goal since his summer move from Rotherham.\nEnjoying the greater possession and pressing hard, the breakthrough came on 23 minutes as a prolonged move eventually saw captain James McClean tee-up Rathbone for a lofted shot, with the final touch off an Exeter head.\nThe hosts' best spell followed, with Alex Hartridge and Joel Colwill both denied by a combination of good goalkeeping from Arthur Okonkwo and the brave interventions of centre-back Eoghan O'Connell.\nParkinson's side continued to show why they have collected 20 clean sheets this season with strong and disciplined defending, but began to look more threatening on the counter after the interval.\nAnd they found the comfort of a second goal on the hour mark when a Rathbone free-kick was not properly cleared and Jack McMillan clumsily felled Rodriguez as the striker chased the loose ball.\nFrom the resulting penalty, the former Burnley and Southampton striker thumped the ball down the middle of Jon Whitworth's goal to seal a second score in as many weeks.\nSteven Fletcher went close as Wrexham searched for a third to match their dominance, but the three points more than sufficed.\nWrexham now travel to Cambridge United on Tuesday with nearest rivals Wycombe welcoming struggling Shrewsbury.\nExeter, meanwhile, travel to Barnsley.\nPhil Parkinson told BBC Radio Wales Sport:\n\"I'm really pleased to follow up last week, we needed to switch our mindset on to a different type of win.\n\"We understood what Exeter are – on a good run, very strong at set plays – and we'd worked on that, but we defended those situations very well which gave us a platform to win the game.\n\"We got the first goal with a good move even if it was deflected, and it was great to get the cushion of the second goal to kill it off like we're capable of.\"\nGary Caldwell told BBC Radio Devon:\n\"I thought it was a fifty-fifty game. I thought the way we set up caused some problems, but we conceded a really poor deflected goal, but apart from that it was nothing in the first-half.\n\"They get a penalty that wasn't a penalty that kills the game.\n\"Those moments went against us but they were better at the basics of football, the quality of the pass, the second balls, but that is the level they are, a team that is going to get promoted and a lesson for us that the gap is there and we have to work very hard to close that gap.\"", "url": "https://www.bbc.com/sport/football/live/c5y0n0np92lt"}