{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:53:05", "date_modify": "2025-04-26 03:53:05", "date_publish": "2025-03-03 09:29:30", "description": "Rangers' Ibrox form 'baffling & painful' - Leon Balogun", "filename": "sport_articles_c07z1jz8ed0o_1745639585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a96/live/383303c0-f80f-11ef-86bb-a924c748a1a8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c07z1jz8ed0o_1745639585.html", "title": "Rangers' Ibrox form 'baffling & painful'", "title_page": "Rangers' Ibrox form 'baffling & painful' - Leon Balogun - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Leon Balogun insists Rangers must \"prove Barry Ferguson wrong\" after the interim manager stressed a repeat of the \"baffling and painful\" Motherwell performance against Fenerbache would end in a heavy defeat.\nFerguson's return to Ibrox didn't go to script as Michael Wimmer's side won 2-1, inflicting a third consecutive home defeat on Rangers.\nUp next for Ferguson's side is a double-header against Jose Mourinho's Fenerbahce in the Europa League last 16, before travelling to runaway league leaders, Celtic.\n\"We have to prove him wrong,\" the defender said.\n\"But, he's making a fair point because, if you can't beat Motherwell, with all due respect to them, at home, I think it's fair to say that Celtic and Fenerbahce are a different type of opposition and probably higher quality as well.\n\"It might actually help that we play the first game away, after what happened domestically, and get supporters back on our side.\n\"But, again, we need to make at least two massive steps forward from Saturday in order to get a result there.\n\"It probably helps that then we play European football again straight after, a week later. So it's a massive chance, a massive opportunity.\n\"We really need to put everything into the game. We have to do it anyway, but now even more.\"\nWhen asked what's the issue with playing at Ibrox at the moment, the former Nigeria international revealed he's \"baffled\".\n\"I wish I could tell you, honestly,\" the 26-year-old added.\n\"It's painful for me personally and I'm sure it is painful for the boys in the dressing room now. It's quite flat.\n\"It certainly is for every supporter because I'm very well aware of what many of them give to be here every week or every two weeks.\n\"We've let them down again.\n\"It feels like every other week one of us is sitting in front of you guys, standing in front of that camera, trying to explain something, but I think people are just tired and so are we.\n\"But, it's in our hands to turn it around. I couldn't tell you if I wanted to right now. It's baffling and it's painful.\"", "url": "https://www.bbc.co.uk/sport/articles/c07z1jz8ed0o"}