{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:06:26", "date_modify": "2025-05-20 12:06:26", "date_publish": "2023-07-25 07:46:12", "description": "Denver Broncos defensive lineman Eyioma Uwazurike is the latest NFL player to be suspended for violating the league's gambling policy.", "filename": "sport_american-football_66298745_1747742786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/BDC4/production/_130508584_gettyimages-1417489793.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_american-football_66298745_1747742786.html", "title": "NFL: Denver Broncos' Eyioma Uwazurike banned for season for violating gambling policy", "title_page": "NFL: Denver Broncos' Eyioma Uwazurike banned for season for violating gambling policy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Denver Broncos defensive lineman Eyioma Uwazurike is the latest NFL player to be suspended for violating the league's gambling policy.\nThe 25-year-old has been banned indefinitely for betting on league games during his rookie season in 2022.\nUwazurike will be out for at least one year and can petition for reinstatement no earlier than 24 July 2024.\nFive players were suspended in April and last month three further players were banned for 2023.\n\"Our organisation fully co-operated with this investigation and takes matters pertaining to the integrity of the game very seriously,\" read a Broncos statement.\n\"The Denver Broncos will continue to provide all members of our organisation with the necessary education, resources and support to ensure compliance with the NFL's gambling policy.\"\nWide receiver Calvin Ridley, then with the Atlanta Falcons, missed the 2022 season for a similar offence but was reinstated in March.\nThe Detroit Lions released Quintez Cephus, CJ Moore and Stanley Berryhill after they were among five players sanctioned in April.", "url": "https://www.bbc.com/sport/american-football/66298745"}