{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:56:58", "date_modify": "2025-05-21 04:56:58", "date_publish": "2025-01-05 10:06:38", "description": "Portadown assistant manager Clifford Adams says his side are \"bitterly disappointed\" with Saturday's Irish Cup exit at the hands of Annagh United.", "filename": "sport_football_articles_c89xzl5lz2po_1747803418.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b948/live/38b6b990-cae7-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89xzl5lz2po_1747803418.html", "title": "Irish Cup: Fifth-round exit 'reality check' for Portadown", "title_page": "Irish Cup: Fifth-round exit 'reality check' for Portadown - Adams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portadown assistant manager Clifford Adams says his side are \"bitterly disappointed\" with Saturday's Irish Cup exit at the hands of Annagh United.\nJames Teelan scored early on for Portadown against the Championship side, but Annagh came roaring back through Ryan Swan, Jack Evans and Stephen Murray.\nSteven McCullough pulled a goal back to set up a tense finish, but Annagh held on to defeat their derby rivals.\nAdams admitted the defeat and manner of goals conceded was \"out of character\" from a Portadown side who have the joint-third best defensive record in the Irish Premiership.\n\"To concede the goals we did was hugely disappointing,\" said Adams.\n\"It gives you a reality check and it gives the boys a reality check.\n\"It's hugely disappointing. We're all going home fuming, if I'm honest with you.\n\"The players are gutted and the fans are gutted. But we can't feel sorry for ourselves and we'll batter on to face Loughgall on Saturday.\"\nIn their first season back in the top flight, Niall Currie's side are fourth in the table while Loughgall are rooted to the bottom.", "url": "https://www.bbc.com/sport/football/articles/c89xzl5lz2po"}