{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-05-21 04:22:05", "date_modify": "2025-05-21 04:22:05", "date_publish": "2025-01-05 23:28:39", "description": "The New England Patriots sack head coach Jerod Mayo after just one season in charge.", "filename": "sport_american-football_articles_c24n08mp136o_1747801325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d843/live/01667730-cbbb-11ef-8639-9b70a770c8e5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_c24n08mp136o_1747801325.html", "title": "NFL: New England Patriots sack head coach Jerod Mayo after one season", "title_page": "NFL: New England Patriots sack head coach Jerod Mayo after one season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The New England Patriots have sacked head coach Jerod Mayo after just one season in charge.\nMayo was informed of his dismissal shortly after the team's final game of the regular season, in which they beat a weakened Buffalo Bills to finish with a 4-13 record.\nThe 38-year-old won one Super Bowl as a linebacker with the Patriots and later served as the team's inside linebackers coach from 2019 until January 2024, when his promotion came.\n\"This was one of the hardest decisions I have ever made,\" said team owner Robert Kraft in a statement announcing Mayo's exit. \"I have known Jerod for 17 years.\"\nMayo succeeded legendary coach Bill Belichick, who won a record six Super Bowls before parting ways with the Patriots after an 8-9 record last season.\nThe Pats were on course to finish with this season's worst record, and therefore have the first pick in this year's NFL draft, but Sunday's win means they will now have the fourth pick instead.\nKraft explained Mayo's short-lived tenure by saying: \"When other teams started requesting to interview him, I feared I would lose him and committed to making him our next head coach.\n\"Winning our season-opener on the road at Cincinnati only strengthened my convictions.\n\"Unfortunately, the trajectory of our team's performances throughout the season did not ascend as I had hoped.\"\nAfter beating the Bengals, the Patriots lost their next six and after a dismal defeat by the Jacksonville Jaguars at Wembley in October, Mayo said: \"We're a soft football team across the board.\"\nThe introduction of rookie quarterback Drake Maye offered some hope, but they had another six-game losing streak before Sunday's 23-16 win over Buffalo.", "url": "https://www.bbc.com/sport/american-football/articles/c24n08mp136o"}