{"authors": ["Michael Emons", "www.facebook.com"], "date_download": "2025-05-20 15:01:25", "date_modify": "2025-05-20 15:01:25", "date_publish": "2023-07-27 12:08:50", "description": "Nigeria come from behind to beat Australia and leave the co-hosts facing a battle to qualify for the last 16 of the Fifa Women's World Cup.", "filename": "sport_football_66290741_1747753285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/244E/production/_130549290_nigeriagoal.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290741_1747753285.html", "title": "Australia 2-3 Nigeria: Matildas risk Fifa Women's World Cup early exit", "title_page": "Australia 2-3 Nigeria: Matildas risk Fifa Women's World Cup early exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nigeria came from behind to beat Australia and leave the co-hosts facing a battle to qualify for the last 16 of the Fifa Women's World Cup.\nAustralia scored first when Emily van Egmond converted Caitlin Foord's pass.\nBut Nigeria equalised soon afterwards with Uchenna Kanu's calm finish, before Osinachi Ohale's header made it 2-1.\nAsisat Oshoala scored after a mix-up between Australia's Alanna Kennedy and Mackenzie Arnold and Nigeria held on, despite Kennedy scoring late on.\nNigeria move top of Group B, level with Canada on four points, while Australia are a point behind both before the last matches in the section on Monday.\nAustralia face Olympic champions Canada in Melbourne and may need a victory to guarantee a place in the knockout stages, while Nigeria play already-eliminated Republic of Ireland at the same time in Brisbane.\nAustralia, ranked 10th in the world, would have secured a place in the knockout stages with a victory, but in the end they were desperately trying to force an equaliser against a side 30 places below them in the rankings.\nThe Matildas saw Kennedy head in a corner from Kyra Cooney-Cross in the 10th of 11 additional minutes at the end of the second half as the majority of a crowd of 49,156 at Brisbane Stadium willed them on.\nBut Australia did not have enough time to get a dramatic equaliser as Nigeria clung to their narrow lead, with some of their players in tears at the final whistle.\nThe competition is being staged by Australia and New Zealand and the two co-hosts have won one and lost one of their opening two matches. Both are likely to need to win their final group games to stay in the tournament, although draws could still be enough depending on other results.\nFor Australia, they will be wondering how they slipped up against a Nigeria side who did not have a shot on or off target in the opening 40 minutes.\nIndeed, the Matildas created 28 opportunities in all, compared to only 11 from Nigeria, and had 15 corners with only two from their opponents.\nAustralia, again without injured Chelsea striker Sam Kerr, took the lead in first-half injury time, but the advantage only lasted five minutes as Kanu provided a calm finish after Rasheedat Ajibade's cross deflected into her path.\nOhale's brave header, which saw her accidentally kicked in the ribs by Kennedy as she headed in from close range, put Nigeria ahead before Barcelona striker Oshoala scored expertly from a tight angle.\nThat came after Kennedy inadvertently headed the ball past her own goalkeeper and into Oshoala's path.\nAustralia piled on the pressure as Kennedy headed over and Alex Chidiac shot too high. With goalkeeper Arnold up for a corner, Kennedy then scored to give the home side hope, but Nigeria hung on for the three points.", "url": "https://www.bbc.com/sport/football/66290741"}