{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-05-21 06:15:00", "date_modify": "2025-05-21 06:15:00", "date_publish": "2025-04-01 10:47:24", "description": "Fan voice: The clinical difference that consigned Hearts to defeat", "filename": "sport_articles_cde2n6345nno_1747808100.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a2d/live/1a361750-0ed9-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cde2n6345nno_1747808100.html", "title": "Fan voice: The clinical difference that consigned Hearts to defeat", "title_page": "Fan voice: The clinical difference that consigned Hearts to defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As we enter the month of April, we'll know in a couple of weeks if the players and staff at Hearts are considered foolish or fully supported by fans as we look to cement our place in the Premiership top six and reach the Scottish Cup final.\nFollowing the 3-0 defeat at leaders Celtic, optimism has taken a slight hit for some Jambos and I can see why.\nHead Coach Neil Critchley's 'big game' record is often brought up in the wake of a defeat, and it's true he has failed to beat Celtic, Rangers, Aberdeen or Hibs in his time in charge.\nThe worst of the lot of course is the Petrocub game and even talking about it now still angers me three months on.\nPeople can look at the result from Celtic Park and shrug their shoulders and say 'What do you expect? You got off lightly,' which is true, considering Celtic sat in park mode in the second half never mind going into first gear.\nCritchley set the team up to press Celtic high and went with a 3-4-1-2, and we fashioned some good first-half opportunities through Lewis Neilson and James Wilson. Both players should have scored but Celtic were clinical, netting with their only three chances in the opening 45 minutes.\nIn fairness, Neilson is only in the team because we had four centre-backs unavailable and Wilson has just turned 18.\nThere's always a mental obstacle for players to overcome when facing Celtic or Rangers away and as soon as player of the year-elect Daizen Maeda scored the opener, you could just tell from the body language that any belief to head back along the M8 with at least a point had evaporated.\nCritchley and the team need to pick themselves up quickly for the visit of Dundee United on Sunday, a match we have to win to keep pace in the race for top six.", "url": "https://www.bbc.com/sport/articles/cde2n6345nno"}