{"authors": ["Nick Godwin", "www.facebook.com"], "date_download": "2025-05-21 07:18:42", "date_modify": "2025-05-21 07:18:42", "date_publish": "2025-01-22 12:05:10", "description": "Tottenham news: Opinion - Nick Godwin finds slim reasons to be positive", "filename": "sport_football_articles_cz7e9e43zqro_1747811922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/706d/live/0ef44ee0-4781-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz7e9e43zqro_1747811922.html", "title": "Opinion - Nick Godwin finds slim reasons to be positive - BBC Sport", "title_page": "Tottenham news: Opinion - Nick Godwin finds slim reasons to be positive - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is no point in describing the current situation at Tottenham as anything other than grim. Terrible form, a dreadful league position and an injury list that keeps getting worse - even though that appeared impossible.\nHowever - and this will not improve the current situation, or relieve the pressure on Postecoglou, or cheer Spurs fans up this week….or next week - it might be worth taking stock of the astonishing development opportunities being handed to some of the young players at the club.\nArchie Gray, Lucas Bergvall, Mikey Moore and Antonin Kinsky have all been thrown into this situation with virtually no Premier League experience.\nGray, 18, is being played out of position, with a partner in Radu Dragusin who has struggled to establish himself as a reliable presence at the back. Bergvall, also 18, now finds himself an increasingly important figure in midfield and seems to relish the challenge. His goal against Liverpool stands out as the biggest moment for Spurs for some time, possibly all season.\nUntil just a few weeks ago, 21-year-old Kinsky was keeping clean sheets for Slavia Prague and has now played in a semi-final, on a plastic pitch and in a north London derby.\nMeanwhile Mikey Moore, 17, keeps finding himself thrown into virtually impossible situations and asked to save the day.\nThere is a danger that these players could be overwhelmed, inflicting sustained damage on their psychological make-up. However, the striking thing is, they are playing pretty well in the circumstances, putting their senior, far more experienced colleagues in the shade.\nIt is clear these positives are not helping Spurs out at the moment. They remain in a difficult position.\nBut one day those youngsters might just look back on this period and be ruefully thankful for the opportunity and the experience.\nIt does not get much tougher than this.", "url": "https://www.bbc.com/sport/football/articles/cz7e9e43zqro"}