{"authors": ["James Law", "www.facebook.com"], "date_download": "2025-05-19 14:31:06", "date_modify": "2025-05-19 14:31:06", "date_publish": "2017-07-05 14:10:45", "description": "Jersey and Sussex batsman Jonty Jenner is named a fielding substitute for England's first Test against South Africa at Lord's.", "filename": "sport_cricket_40505999_1747665066.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C60D/production/_96810705_jontyjenner_gettyimages-695993210.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_40505999_1747665066.html", "title": "England v South Africa: Jersey and Sussex's Jonty Jenner named 12th man", "title_page": "England v South Africa: Jersey and Sussex's Jonty Jenner named 12th man - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jersey and Sussex batsman Jonty Jenner has been named as 12th man for England's first Test against South Africa at Lord's, starting on Thursday.\nThe 19-year-old, who made his first-class debut in June, should become the first Jerseyman to represent England.\n\"It's going to be the most remarkable occasion,\" said Jenner's dad Ward, also chairman of the Jersey Cricket Board.\n\"He's now got to turn up at 08:00 BST tomorrow in a suit, which his mum is flying over to him.\"\nHe added: \"Jonty will meet his mum at Gatwick tonight to get his suit - hopefully it'll be dry-cleaned in time.\"\nJenner, who is yet to make his County Championship bow, scored 68 against South Africa A last month for Sussex having spent most of the season playing for their second team.\nThe 12th man role is given to specialist fielders, with Jenner coming on as a substitute if a member of the team gets injured.\nHis father added that Carl Hopkinson, fielding coach at Sussex, recommended Jenner for the role.\n\"I didn't quite believe it at first, but when he told me more about how it came about there was some logic to it,\" he added to BBC Sport.\n\"Carl recognises, like a lot of people, that Jonty's one of the best fielders in the country. He has close links with the England setup and Jonty was then asked if he fancied it, which he obviously did.\n\"I imagine it's almost 100% certain he'll get on the pitch at some stage.\"", "url": "https://www.bbc.com/sport/cricket/40505999"}