{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:17:23", "date_modify": "2025-05-21 06:17:23", "date_publish": "2025-03-31 08:14:32", "description": "Bournemouth 1-2 Man City: The fans' verdict", "filename": "sport_football_articles_ckgd5w19033o_1747808243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgd5w19033o_1747808243.html", "title": "Bournemouth 1-2 Man City: The fans' verdict", "title_page": "Bournemouth 1-2 Man City: The fans' verdict - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Manchester City's victory over Bournemouth in the quarter-finals of the FA Cup.\nHere are some of your comments:\nBournemouth fans:\nTim: Five shots in the game and none after the 38th minute! Crikey, that doesn't sound like Bournemouth. Let's go all out for league points and recapture the form that has disappeared recently.\nMark: Classic game of two halves. First half intensity slipped away while City's subs made a difference but ours not so much. A must-win home game against the Tractor Boys on Wednesday under the lights.\nMatt: A rollercoaster of emotions ended ultimately in disappointment. Gave it a right go first half, but ran out of steam, ideas and threat in the second. League points now the priority to avoid what would feel like a damp squib of a season.\nZia: I think the first half was the more dominant half for the Cherries but in the second half, they just fell asleep.\nMan City fans:\nBrian: A game of two halves. Bournemouth pushed City all the way but youth won the day in the second half and their belief and commitment shown. City are on track for a cup when a trophy was not at all likely this season. They are so dangerous in attack when the game is played at pace and with one-touch football. The new faces are smiling and that is the investment we need for the future. Defence has its issues and Pep needs to address the goalkeeping frailty. But this was a good day and they have their sights firmly focused on the FA Cup.\nClint: A fair result. City struggled to make inroads in the first half, without being overly-troubled, other than the goal. In the second half there was only one team in it. Nottingham Forest have flattered to deceive this season and Pep will, hopefully, have learned enough about them from the smash-and-grab a couple of weeks back. Would be lovely to finish the season with a cup final.\nGeoff: We beat a nasty Premier League pub team and only suffered one injury - an excellent result.", "url": "https://www.bbc.com/sport/football/articles/ckgd5w19033o"}