{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:26:44", "date_modify": "2025-04-26 07:26:44", "date_publish": "2025-02-27 22:38:06", "description": "Ulster forward Matthew Dalton says his career in recent years has been geared towards returning to play for his native province.", "filename": "sport_rugby-union_articles_cwygwglyw0wo_1745652404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1fa1/live/1798a930-f387-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cwygwglyw0wo_1745652404.html", "title": "Dalton happy to put 'nomadic lifestyle' behind him", "title_page": "Ulster v Scarlets: Dalton happy to put 'nomadic lifestyle' behind him - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ulster forward Matthew Dalton hopes he has put his \"nomadic lifestyle\" behind him after signing for a second spell with his native province in January following a successful trial.\nA graduate of the Ulster academy, the 26-year-old made his senior Ulster debut in 2017 and remained part of the squad until 2019, playing for the senior team 10 times.\nDalton, who can play second row or back row, signed for Utah Warriors but did not make an appearance, then played for Newcastle Falcons between 2021 and 2023 and turned out for French side Soyaux Angouleme from 2023 to 2025.\n\"After the academy I had a few games here, I was in Newcastle, playing in the Premiership there, and then I was playing with the French side there.\n\"All the work away from here has for me been about coming back here eventually. This is my home, this is where I want to play rugby.\"\nDalton is determined to make his mark as he enjoys being reunited with family.\n\"It's amazing, getting settled, seeing family. It's just been a bit of a nomadic lifestyle, a bit back and forth in the past few years so it's amazing getting the opportunity.\n\"I'm focused on being with the team, training hard with them, so that we can build a real strong squad going forward and have a really positive start to next season.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cwygwglyw0wo"}