{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:44", "date_modify": "2025-05-19 14:41:44", "date_publish": "2017-08-12 13:11:57", "description": "DIGIONLY", "filename": "sport_football_40903343_1747665704.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40903343_1747665704.html", "title": "Saturday's League Two reports", "title_page": "Saturday's League Two reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barnet 1-0 Luton Town\nJack Taylor scored an injury-time winner for Barnet as they beat Luton Town at the Hive.\nThe 19-year-old, whose goal was his first in the professional ranks, broke the deadlock with a 25-yard curling effort in the dying embers of the game.\nRossi Eames' side struggled find their rhythm in the first half, with the manager forced to make two early changes due to injuries to Elliott Johnson and Harry Taylor.\nThe latter, who left the field with blood pouring from his head, was taken to hospital.\nThe away side came inches away from scoring early in the first half when Dan Potts directed Alan Sheehan's corner towards goal but Jamie Stephens managed to tip the header onto his crossbar.\nBarnet started the second half well and forced Marek Stech into several good saves, but they couldn't find a way past the Czech goalkeeper.\nThe game looked like it was heading for a goalless draw but Taylor's late strike gave the home side a late lead.\nDespite late pressure from Town, the Bees managed to defend successive corners and hold on for their first league win of the season.\nReport supplied by the Press Association.\nCambridge United 1-2 Carlisle United\nCarlisle earned their first points of the new League Two season with victory at Cambridge United.\nThe visitors got off to a perfect start, taking the lead inside eight minutes when Reggie Lambe swept Hallam Hope's pull-back into the far corner.\nRichie Bennett had already gone close twice for Carlisle, but Cambridge responded well and were level six minutes after the goal through Medy Elito's penalty.\nHe was fouled by Gary Liddle after Jack Bonham dropped a cross and sent Bonham the wrong way to equalise.\nHaving withstood extended pressure at the other end, Carlisle were ahead again six minutes before the interval. David Forde produced a fine save to turn Tom Miller's header onto the bar but the ball fell to Tom Parkes to fire home from close range.\nLooking to respond in the second half, Cambridge's best chances came when Luke Berry hit a firm effort narrowly over before Jabo Ibehre thumped a header onto the underside of the bar from Leon Davies' cross seven minutes from time.\nReport supplied by the Press Association.\nCheltenham Town 1-0 Crawley Town\nMohamed Eisa's fourth goal in three games was enough to earn Cheltenham a League Two win against Crawley.\nThe decisive moment came in the 38th minute when Eisa headed in a fine cross from Kyle Storer on the right.\nCheltenham lost playmaker Jerell Sellars to injury in the first half and Jon Flatt had been called into action several times to keep Crawley out before the opening goal.\nThe on-loan Wolves goalkeeper denied Mark Randall, Lewis Young and Jordan Roberts with smart saves.\nEnzio Boldewijn shot high from a good position for Crawley early in the second half, but Cheltenham then pressed for a second goal.\nCrawley had the ball in the net after 57 minutes, but Thomas Verheydt had fouled Flatt, knocking the ball out of his hands and it was disallowed.\nJordon Forster had to clear off the line for Cheltenham after a corner was met by the head of Mark Connolly, who saw another header bounce just wide.\nSubstitute Matt Harrold also went close to levelling, but Cheltenham held on.\nReport supplied by the Press Association.\nColchester United 1-1 Stevenage\nMikael Mandron netted his first Colchester goal to rescue a point in their League Two draw with Stevenage.\nColchester wasted a good fourth-minute opportunity when Mandron fired over from inside the area, after exchanging passes with Drey Wright.\nStevenage's Danny Newton was denied by U's goalkeeper Sam Walker after 30 minutes while at the other end, Ryan Jackson's effort was saved by goalkeeper Joe Fryer.\nStevenage started the second half strongly and came close to scoring when Matt Godden's strike flashed inches wide of the post, after Dale Gorman had done well to set him up.\nAnd the visitors took a 51st-minute lead when Newton hooked in from close range, after Ronnie Henry had done well in the area to pick him out.\nBut Colchester were level 15 minutes later through Mandron, who finished emphatically after Fryer had raced out of his goal and Wright had crossed.\nStevenage's Fraser Franks twice went close and Walker denied Ben Kennedy late on, as the spoils were shared.\nReport supplied by the Press Association.\nCrewe Alexandra 1-1 Newport County\nCrewe Alexandra fought back to draw with Newport County despite having Perry Ng sent off after 17 minutes.\nFrank Nouble put Newport ahead when he tapped in after Joss Labadie's shot was saved by Crewe goalkeeper Ben Garratt.\nNg had been booked moments before the goal and the defender earned a second yellow for sliding in soon after.\nBut a minute after the dismissal Crewe got themselves back on level terms, when Chris Dagnall converted George Cooper's low cross from the byline.\nGrimsby Town 0-2 Coventry City\nMarc McNulty's controversial goal and a Jack Grimmer header saw Coventry maintain their winning start to the season with victory at Grimsby.\nAfter his hat-trick on the opening day of the season, Jodi Jones almost got himself back on the scoresheet after cutting in from the wing, but James McKeown managed to get a strong hand to the shot to keep it out.\nCoventry took the lead in bizarre circumstances in the 63rd minute, as Nathan Clarke seemingly rolled the ball back to McKeown to take a free-kick, only for McNulty to take it and run towards goal before rolling into an empty net.\nThere were no questions about the second though, as Jack Grimmer rose highest at a corner to head in the visitors' second after 76 minutes and secure their second win in their opening two league games.\nThe hosts' misery was compounded when midfielder James Berrett picked up a second yellow two minutes from time, resulting in Grimsby second red card of the season.\nReport supplied by the Press Association.\nLincoln City 1-1 Morecambe\nWasteful Lincoln were forced to settle for a draw against Morecambe in their first home match back in the Football League.\nThe Imps largely dominated the first half with Jordan Maguire-Drew and Nathan Arnold forcing veteran keeper Barry Roche into stunning saves while Matt Green dragged a good chance wide of the far post.\nHowever, the Shrimps also threatened with only a last-ditch clearance from Sean Raggett denying Garry Thompson a goal and Aaron McGowan hitting the bar with a stunning 30-yard effort.\nAnd it was Jim Bentley's visitors who took the lead in the 53rd minute when Aaron Wildig, having failed to convert a much easier chance two minutes earlier, volleyed home superbly from the edge of the box.\nMatt Rhead, Raggett and Matt Green went agonisingly close to equalising but were denied by excellent goalkeeping, good defending or poor finishing.\nHowever, the Imps finally levelled in the 70th minute when Green broke into the box, held off a defender and fired home from an acute angle.\nReport supplied by the Press Association.\nMansfield Town 2-0 Forest Green Rovers\nTwo goals in six second-half minutes finally saw Mansfield take control as Forest Green lost their first Football League away match.\nAfter being frustrated by Rovers' spoiling tactics in the first half, the Stags grabbed the lead six minutes into the second as Danny Rose headed home a Joel Byrom corner at the far post.\nThe home side doubled their lead on 57 minutes as Paul Anderson, chasing a long forward ball, beat the offside trap to stride through on the left and, although Bradley Collins stopped his first effort, he tucked away the rebound into the empty net.\nRovers keeper Bradley Collins came up with two massive saves to make sure his side went in all square at the break.\nAfter just five minutes he stood up tall to get in the way of Lee Angol's finish after he had robbed Lee Collins to run clear.\nThen on the half-hour mark he got a good right hand to a powerful Paul Digby header from Byrom's corner.\nHome keeper Conrad Logan had only one save to make all game in stoppage time.\nReport supplied by the Press Association.\nNotts County 2-0 Chesterfield\nTwo stunning goals from substitute Jorge Grant earned Notts County their first win of the season as they secured victory over 10-man Chesterfield.\nAfter a forgettable opening 25 minutes, the game burst into life on the back of an off-the-ball incident involving Gozie Ugwu and Elliott Hewitt, for which the former earned a yellow card.\nCounty immediately went on the attack, with Sam Hird denying Shola Ameobi with a fine tackle before he hacked Terry Hawkridge's effort off the line.\nBut the visitors then suffered a setback just before the break when Scott Wiseman saw red for a needless shove on Hawkridge.\nThe challenge facing County was to overcome Chesterfield's stubbornness and they did just that when loanee Grant looped a fantastic header over Anyon in the 60th minute.\nThe 22-year-old saved his best for last in injury time when Hird was penalised for a foul on Jonathan Forte 25 yards from goal.\nGrant took responsibility with the set-piece and bent it over the wall and into the far corner to give Anyon no chance.\nReport supplied by the Press Association.\nPort Vale 2-3 Wycombe Wanderers\nAdebayo Akinfenwa helped fire Wycombe to their first League Two win of the season as they beat Port Vale at Vale Park.\nFirst-half strikes from Akinfenwa and Paris Cowan-Hall put Vale on the back foot in their first league game at home since being relegated from League One last season.\nGareth Ainsworth's men made the best possible start when Akinfenwa nodded in a Joe Jacobson free-kick with just two minutes on the clock.\nThe Chairboys doubled their lead 10 minutes later when Cowan-Hall cut in from the left side of the box and curled an effort past Valiants keeper Sam Hornby.\nWycombe made it three when a Luke O'Nien volley at goal was met by the head of Akinfenwa, who doubled his tally for the day.\nVale got a goal back in the 88th minute when substitute Dan Turner headed in a Lawrie Wilson cross.\nTwo minutes later fellow substitute Ben Whitfield made it a nervy finish for the visitors, smashing a shot into the top left corner, but it proved in vain.\nReport supplied by the Press Association.\nSwindon Town 1-1 Exeter City\nKaiyne Woolery scored on his Swindon debut as they drew with Exeter at the County Ground.\nWoolery struck 10 minutes into the second half to cancel out Liam McAlinden's first-half opener as the points were shared.\nExeter started quickly and almost went ahead 22 minutes in when Troy Brown's effort was blocked on the line.\nThe visitors deservedly took the lead in the 28th minute. Lawrence Vigouroux parried Reuben Reid's strike onto the post, but McAlinden was on hand to volley in the rebound.\nFour minutes later Swindon had the ball in the net, but Harry Smith's effort was disallowed for handball.\nSwindon boss David Flitcroft brought on Luke Norris and new signing Woolery at half-time, and the two linked up to bring the hosts level on 56 minutes.\nNorris' pass sent the former Wigan striker through on goal and he calmly slotted the ball under Christy Pym.\nSubstitute Jack Sparkes nearly won it for Exeter 10 minutes from time when his long-range shot smacked against the post.\nReport supplied by the Press Association.\nYeovil Town 3-2 Accrington Stanley\nOlufela Olomola's brace helped Yeovil to a home win over Accrington in League Two.\nKayden Jackson got the opener for Stanley in the 12th minute with an easy tap-in after a Billy Kee shot from distance was parried into his path.\nThe Glovers made it 1-1 on 26 minutes when Olomola broke into the area to find Otis Khan and, when his shot was blocked, the forward was on hand to score.\nHaving already hit the bar, Francois Zoko then gave the hosts the lead in the 38th minute as the Ivorian turned in a knock-down at the second attempt.\nLess than a minute later it was 3-1 when a long ball eliminated the entire Accrington defence and Olomola did well to loft it over the onrushing Aaron Chapman.\nThe visitors were given a lifeline after 53 minutes when a mistake allowed Jackson in to score again, but despite dominating the second half they could not find an equaliser.\nReport supplied by the Press Association.", "url": "https://www.bbc.com/sport/football/40903343"}