{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-20 13:56:00", "date_modify": "2025-05-20 13:56:00", "date_publish": "2023-07-31 10:41:58", "description": "Britain's swimmers believe they can achieve a record Olympic medal haul at Paris 2024 after impressive performances at the World Championships.", "filename": "sport_swimming_66360194_1747749360.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16C2D/production/_130592239_gettyimages-1574126501.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66360194_1747749360.html", "title": "Paris 2024: Britain seek historic Olympic medal haul after World Championships success", "title_page": "Paris 2024: Britain seek historic Olympic medal haul after World Championships success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New world champion Matt Richards says there is \"no reason\" why British swimmers cannot achieve a record Olympic medal haul at Paris 2024 after impressive performances at the World Championships.\nThe team achieved a landmark total of eight medals at Tokyo 2020, a figure they equalled in the championships in Japan, despite the absence of talisman Adam Peaty.\nRichards was one of several GB swimmers who excelled in Fukuoka, claiming a maiden world 200m freestyle title before helping the men's 4x200m as well as the mixed 4x100m freestyle relay teams to gold and bronze respectively.\nThere were further honours for Tom Dean, Duncan Scott and Ben Proud, while Lauren Cox became the first female British swimmer to claim an individual world medal since 2015.\n\"We're all ambitious, we all want to keep improving and take the sport to another level,\" Richards told BBC Sport.\n\"The team is coming on, from strength to strength, and eight medals here even without Adam a year out from the Olympics - you can't ask for much more than that.\n\"I'd be lying if I said any of us thought this was our limit and there's no reason we can't achieve more next year.\"\nAfter winning a record-breaking four Olympic medals in Tokyo, Scott said the attitude Peaty had brought to the team had been crucial in changing the mindset following a disappointing London 2012 Olympics.\nThat belief and desire to dominate is something five-time world champion and BBC Radio 5 Live swimming commentator Karen Pickering believes remains with the team, despite the Olympic gold medal winner's absence.\nShe cites the positive response to the disqualification of the medal-contending men's 4x100m freestyle relay team on the opening day of the competition as evidence of a mentality shift.\n\"I've been really impressed by their resilience,\" Pickering tells BBC Sport.\n\"In years gone by, if that had happened, the meet would have ended up very differently, but that [Peaty] attitude is now within Tom Dean, Duncan Scott, Matt Richards and others.\"\nAfter securing his first World Championship titles at Kazan 2015, Peaty spoke about his ambition to \"dominate\" the sport and take his event to new levels.\nDean is similar and, after claiming four medals in Fukuoka, aims to win \"even more\" at Paris 2024 - an approach Pickering hopes some of the female swimmers will adopt.\n\"Adam, Tom, Duncan, they're experienced at delivering and, even if they're not doing their best swims, they're still helping other people to do great swims. We haven't really had a 'banker' like that on the female side for a few years,\" she tells BBC Sport.\n\"We have some really good young prospects though, like Katie Shanahan and Freya Colbert [who were fourth and fifth in their respective best events at Fukuoka 2023].\n\"At junior level, there's some great talent too but we need to make sure we do everything we can to help them progress because we seem to be doing better at that with the boys than with the girls.\"\nEuropean junior 200m individual medley champion Leah Schlosshan and silver medallist Phoebe Cooper as well as distance swimmer Amelie Blocksidge, who became British senior champion at the age of 14 earlier this year, are among the prospects.\nBritish Swimming head coach Bill Furniss, who guided Rebecca Adlington to four Olympic medals, admits the women's side has been \"a little bit behind\" the men's in recent years but is encouraged by what he has witnessed recently.\n\"I think it the improvement is typified by not only Lauren Cox, but our relays,\" he tells BBC Sport.\n\"The women's 4x200m and 4x100m [freestyle relay teams] have struggled for some considerable time and now we've had two fourth places, so we're getting closer to that podium.\n\"That shows me how the depth is improving and we're very pleased with how the girls are coming through.\"\nFurniss also confirmed that Peaty, who took time out from the sport earlier this year to prioritise his mental health, is back training in a \"positive\" mindset and believes \"we'll see him again\" competitively before Paris 2024.\nThe idea of Olympic medal success for Great Britain in artistic swimming might have seemed somewhat far-stretched 12 months ago.\nHowever, the introduction of new rules to improve transparency and competitiveness in the sport have proved to be a game-changer for British prospects.\nKate Shortman and Izzy Thorpe claimed an historic European Championship bronze last month and Shortman secured Britain's first world medal in the sport with solo free bronze in Fukuoka.\n\"This year we've performed so well and finally done it on a world stage and hopefully people can see now that artistic swimming in Great Britain is on the way up,\" said Shortman.\n\"We're coming through, we're coming up and we need some funding because we're going for the Olympics next year and we want to medal in that too.\"\nThe next major event for the majority of athletes across the aquatic disciplines will be the Doha 2024 World Championships in February.", "url": "https://www.bbc.com/sport/swimming/66360194"}