{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-20 11:58:45", "date_modify": "2025-05-20 11:58:45", "date_publish": "2023-08-06 09:15:06", "description": "Plymouth boss Steven Schumacher says record signings Bali Mumba and Morgan Whittaker could prove to be bargains if they keep performing well.", "filename": "sport_football_66418269_1747742325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/324C/production/_130667821_balimumbamorganwhittakerrex2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66418269_1747742325.html", "title": "Bali Mumba & Morgan Whittaker: Plymouth record duo's value could go up, says Steven Schumacher", "title_page": "Bali Mumba & Morgan Whittaker: Plymouth record duo's value could go up, says Steven Schumacher - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Plymouth Argyle boss Steven Schumacher says record signings Bali Mumba and Morgan Whittaker could prove to be bargains if they keep performing well.\nThe pair joined Argyle permanently for joint club-record £1m fees last month after successful loans last season.\nMumba scored a fine individual goal and Whittaker also found the net in the 3-1 win over Huddersfield.\n\"They're really young and I still think they've got loads of room to develop and get better,\" Schumacher said.\n\"Who knows where it's going to go? If they play well, we'll be successful as a team, and if we're successful as team then their value's only going to go up.\"\nIncluding pre-season matches, Whittaker has scored five goals in his last five Argyle games, having also netted in his last while on loan in January.\nMumba was a threat for much of the game against Huddersfield, playing in a more advanced role as Schumacher adopted a four-man defence for the first time under his leadership.\n\"We've seen how good they were last year, I believe that they've got the quality to step into this division and show their attributes and play with confidence,\" he added.\n\"I think once they get that backing from me and the coaching staff they go out and express themselves.\n\"Bali wasn't perfect today, but when he gets his moment and when he gets that one v one situation, he trusts himself to do something.\n\"They're two brilliant players, and they're only going to make our team better.\"", "url": "https://www.bbc.com/sport/football/66418269"}