{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-04-26 03:56:35", "date_modify": "2025-04-26 03:56:35", "date_publish": "2025-03-04 15:03:36", "description": "Former boss Stubbs Hibs turnaround under modest David Gray", "filename": "sport_articles_cq5z34dzp0yo_1745639795.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/58e1/live/9987c180-f8fd-11ef-806b-d7666ddeb600.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cq5z34dzp0yo_1745639795.html", "title": "Former boss Stubbs Hibs turnaround under modest David Gray", "title_page": "Former boss Stubbs Hibs turnaround under modest David Gray - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Few folks know the type of person David Gray is better than Alan Stubbs.\nThe pair were, respectively, manager and captain - and goalscorer - when Hibernian ended their Scottish Cup hoodoo in 2016, finally winning the oldest trophy in association football for the first time in 114 years.\nIt's the game where Gray was affectionately christened 'Sir David' after his header secured the victory against Rangers at a sun-kissed Hampden.\nThe adulation and praise he garnered for that goal was not his style. Nor are the rightful plaudits he's receiving now for steering Hibs from the doldrums to delight from the dugout.\nBut that hasn't stopped his former gaffer heaping the praise on his shoulders.\n\"I wanted Dave to turn it around because I think he's a really good guy,\" Stubbs said.\n\"He's someone I've got a lot of respect for, so I wanted the turnaround for him and obviously the club.\n\"He deserves a lot of credit but knowing David, he won't take it. He's the kind of guy who will take a step back in terms of letting the players and everybody else take the credit, but he deserves credit - he just needs to smile a bit more when he wins.\"\nOne to never get too high with the highs or too low with the lows, Gray ought to have shown signs of a grin throughout this 15-game unbeaten run in all competitions his side are on.\nAt the heart of the that has been summer signing Nicky Cadden.\nOnce again on Sunday in the Edinburgh derby, Cadden's cracking crosses and corners were on show. His delivery is deadly and imperative to Hibs' recent success.\nIn the Premiership, no team has scored more goals (20) than Hibs from set-pieces. Nicky Cadden is often hovering over them.\nHaving created 41 chances throughout the campaign, he's been one of Gray's key men.\nShould a few more of his superb deliveries be met by team-mates, the manager's smile make a more frequent appearance.", "url": "https://www.bbc.co.uk/sport/articles/cq5z34dzp0yo"}