{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:27:03", "date_modify": "2025-05-21 07:27:03", "date_publish": "2025-05-20 19:30:58", "description": "Ruben Amorim is not under pressure at Manchester United, but thinks his team may be looked at \"in a different way\" if they beat Tottenham in Bilbao on Wednesday.", "filename": "sport_football_articles_c80kkpxn4y5o_1747812423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1095/live/9a003fc0-35ac-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c80kkpxn4y5o_1747812423.html", "title": "Europa League final: Ruben Amorim thinks Man Utd would be seen differently with win", "title_page": "Europa League final: Ruben Amorim thinks Man Utd would be seen differently with win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was Manchester United captain Bruno Fernandes who stepped in to tell Ruben Amorim he was under pressure heading into the Europa League final.\nThe reality is different - even if Amorim can't explain why.\nBut he does feel his team may be looked at \"in a different way\" if they can beat Tottenham in Bilbao on Wednesday.\nWhile many believe it is likely counterpart Ange Postecoglou will lose his job even if Spurs end their 17-year wait for a trophy and claim a place in next season's Champions League by winning the Europa League title, at Old Trafford faith in Amorim remains high.\nThis is despite United's lowly Premier League position and there is no suggestion defeat by Tottenham will alter that view. It will though rob United of around £100m in revenue and leave them without European football for only the second time since English clubs were allowed back into competition by Uefa in 1990.\nAsked why he is under no pressure, Amorim was about to answer when his captain and fellow Portuguese spoke instead.\n\"He is. Who told you he is not?\" laughed Fernandes.\nThis brought an immediate riposte from Amorim: \"He wants my job. He'll be a very good coach but he has to work on his mindset. He doesn't know how to deal with people.\"\nThe manager added: \"It's strange because you have some coaches here that lose some games and they are sacked... it's hard to explain.\n\"I think people see what we are trying to do, I think that people see that sometimes I'm thinking more about the club than myself.\n\"People understand, especially the board, that we have a lot of issues that in the context, is really hard.\"\nUnited may have only beaten Fulham of the non-relegated clubs in the Premier League since December, and taken two points from their last eight games to lie 16th in the table, but the club hierarchy believe Amorim is effecting change behind the scenes.\n\"There are a lot of things we need to change,\" he said.\n\"They way we do everything during the week at Carrington, the recruitment, the academy. It is hard to point to one thing and it will not be solved by winning the cup.\"", "url": "https://www.bbc.com/sport/football/articles/c80kkpxn4y5o"}