{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:48:44", "date_modify": "2025-05-21 05:48:44", "date_publish": "2025-02-08 19:42:41", "description": "West Bromwich Albion boss Tony Mowbray believes the Baggies were good value for their stoppage-time victory over Sheffield Wednesday.", "filename": "sport_football_articles_cvg87jn4xv7o_1747806524.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96ab/live/48b4e230-e654-11ef-a046-5b66c18424ca.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg87jn4xv7o_1747806524.html", "title": "Tony Mowbray: West Bromwich Albion boss on win over Owls", "title_page": "Tony Mowbray: West Bromwich Albion boss on win over Owls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion boss Tony Mowbray spoke to BBC Radio WM after the Baggies' stoppage-time victory over Sheffield Wednesday.\n\"I thought there were lots of positives We were very good first half, total domination, I think they had one shot,\" he said.\n\"We had lots of the ball, just couldn't break through. Second half was more open, they came more into it, but we had some really good chances.\n\"Ultimately the score is 2-1 to us and we deserved to win over 90 minutes but the injury-time equaliser was a kick in the stomach for us.\n\"Then to score again so soon afterwards is something the lads have been talking about – we don't score many late goals.\n\"It was brilliant movement in the box from Molumby. I felt over the 97 minutes we deserved to win the game. I am pleased for the fans. We just have to keep going.\"\nMowbray on Bartley's post-match red card: \"I didn't know until he came in and said he'd had a red card.\n\"It's really disappointing and frustrating for us. I think he's going to be really important for the team. It's going to be a blow if he's going to miss three games.\"", "url": "https://www.bbc.com/sport/football/articles/cvg87jn4xv7o"}