{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:41:13", "date_modify": "2025-05-21 05:41:13", "date_publish": "2025-04-06 00:00:00", "description": "Chelsea miss the chance to bolster their hopes of qualifying for next season's Champions League as they are held to a goalless draw at Brentford.", "filename": "sport_football_live_c93gp0g9pd7t_1747806073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4d6c/live/adb2c1b0-12fb-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c93gp0g9pd7t_1747806073.html", "title": "Brentford 0-0 Chelsea: Rotated Blues held to goalless draw in Premier League", "title_page": "Brentford 0-0 Chelsea: Rotated Blues held to goalless draw in Premier League - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea rang the changes and failed to fire as their bid to reach next season's Champions League hit another bump with a draw at Brentford.\nThe Blues' latest disappointment away from Stamford Bridge means they have gone eight away games in the Premier League without a victory, while Brentford remain winless in their latest eight at home in the top flight.\nChelsea beat Tottenham on Thursday, but Cole Palmer and Nicolas Jackson, who started that game, were only selected as substitutes by head coach Enzo Maresca for this latest London derby.\nBrentford should have taken the lead in the first half through Mikkel Damsgaard, who put a free-kick over the bar and was then sent clear on goal by Yoane Wissa, only to miss the ball as he attempted to shoot.\nKeane Lewis-Potter forced a good save out of Chelsea's Robert Sanchez when he was left unmarked at a corner, as the Spaniard dived to his right to palm the effort away.\nBryan Mbeumo then went close for Brentford after intercepting Reece James' clearance, driving into the box and cutting on to his left foot before firing wide of Sanchez's near post.\nChelsea improved in the second half with the immediate introduction of striker Jackson, one of five players benched from the line-up that faced Tottenham.\nThe Senegalese striker almost forced Brentford's Sepp van den Berg to turn a cross past his own goalkeeper, Mark Flekken.\nBrentford's Dutch stopper was called into action again soon after, batting the ball away as Blues captain James headed at goal from a Pedro Neto corner.\nEngland forward Palmer also came off the Chelsea bench, but there was to be no breakthrough from either side.\nMbeumo forced Sanchez into action again late on when driving at goal after an exchange with Wissa, with the Spanish goalkeeper saving well.\nVan den Berg headed over from the resulting corner before Wissa steered a header of his own wide soon after.\nA third draw in a row at the Gtech Community Stadium between the two sides kept Chelsea fourth in the Premier League, but they missed the chance to significantly close the gap to third-placed Nottingham Forest, who lost to Aston Villa on Saturday.\nAn eager chasing pack, featuring Manchester City, Villa and Newcastle United, will take note of such results.\nBrentford remain 12th, eight points off the top seven.\nHave your say on Brentford's performance\nWhat did you make of Chelsea's display?\nThe major surprise when the teams were announced was that Maresca had made so many Chelsea changes.\nPalmer and Jackson, who have both recently returned from injuries, made way along with defenders Levi Colwill and Marc Cucurella and winger Pedro Neto.\nPart of the thinking from Maresca was to avoid overloading his two star forwards, with Chelsea having a trip to Poland coming up to face Legia Warsaw on Thursday in the quarter-finals of the Conference League.\nIt was a move that nevertheless frustrated many Blues supporters, given Chelsea face stiff competition as they battle to seal Champions League qualification after two seasons out of the elite competition.\nChelsea mustered just four shots in the first half, none of which tested Flekken.\nWith Christopher Nkunku failing to provide a meaningful threat, Jackson was sent on for the second half and was soon put through by a brilliant Enzo Fernandez pass, only to fire across goal from a tough angle.\nPalmer and Neto joined the fray, with Maresca looking to inject further attacking quality, and of Chelsea's 21 shots in the match, 17 came in the second half.\nNeto forced Flekken to make two saves, but both were rather routine, and for all of Chelsea's momentum they failed to make it count. Palmer's three shots all failed to hit the target.\nWhile the Blues are favourites to win the Conference League, the prize of winning Europe's third-tier club competition does not compare to the fruits that come with Champions League qualification.\nBefore a 2-0 defeat by Nottingham Forest on 21 December, Brentford had picked up a hugely impressive 22 points from their first eight Premier League home games of the season.\nThey have not won a home league game since, totting up a mere three points from a possible 24 in that time.\nOnly relegated Southampton (one) and seemingly doomed Leicester (none) have picked up fewer home points in the same period.\nVictory over Chelsea would have moved them up to 11th, six points shy of Newcastle in seventh. The draw means that, with seven games to go, Brentford are now among the outsiders for places in the Europa League or Conference League.\nBrentford's next three games are against Arsenal, Brighton and Forest, sides ahead of them in the table.\nOne positive that Thomas Frank and his players can take into those games is that this result gave them a first clean sheet at home since a goalless draw with Fulham in May 2024.", "url": "https://www.bbc.com/sport/football/live/c93gp0g9pd7t"}