{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:52:11", "date_modify": "2025-05-20 11:52:11", "date_publish": "2023-08-07 07:48:08", "description": "Bournemouth vs West Ham: Another difficult start awaits", "filename": "sport_articles_c4nr0038l6no_1747741931.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/489b/live/13ca26d0-33d5-11ee-b5b5-2bd0fb3c4fdb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4nr0038l6no_1747741931.html", "title": "Bournemouth vs West Ham: Another difficult start awaits", "title_page": "Bournemouth vs West Ham: Another difficult start awaits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Joe Bradshaw, BBC Sport\nIn 2022-23, Scott Parker’s Bournemouth were given a brutal welcome back to Premier League life, facing Manchester City, Arsenal and Liverpool in their opening four games.\nWe all know how that panned out.\nFor Andoni Iraola, 2023-24 looks slightly kinder although there is the small matter of Liverpool away on the second weekend, where plenty of Cherries players (and supporters) will wish to banish the ghosts of last season’s nightmare.\nFacing four of last season’s top 10 in the opening six fixtures seems tricky, especially with tough away games at Brentford and Brighton.\nAdd in a potentially rejuvenated Chelsea to that mix (they only finished 12th last season) and suddenly the opening stretch is full of pitfalls for a manager taking his first steps in the Premier League.\nIraola has conceded as much, but quietly he will know how important the opening game of the season against West Ham at Vitality Stadium is shaping up to be.\nWin, and optimism from a promising pre-season will only gain further momentum. Lose, and the bubble will be burst before that daunting trip to Anfield.\nThis week he will be taking every necessary measure to make sure Saturday runs smoothly.", "url": "https://www.bbc.com/sport/articles/c4nr0038l6no"}