{"authors": ["Glenn Speller & Paul Grunill", "www.facebook.com"], "date_download": "2025-05-21 05:51:05", "date_modify": "2025-05-21 05:51:05", "date_publish": "2025-04-02 09:58:08", "description": "BBC Sport looks ahead to the 2025 County Championship season and who can challenge Surrey as they seek a fourth successive title.", "filename": "sport_cricket_articles_cn8rvk2r3yjo_1747806665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a834/live/e3b14ff0-0664-11f0-8c34-4f174fb5fd08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cn8rvk2r3yjo_1747806665.html", "title": "County Championship season preview: Who can stop Surrey?", "title_page": "County Championship season preview: Who can stop Surrey? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A new English cricket season is almost upon us but, once again, as we count down to the start of the opening round of County Championship games, the same old question has to be asked - can anyone stop Surrey?\nRory Burns' side have lifted the trophy in each of the past three summers, winning a consistent eight out of 14 matches per season, and losing only five overall.\nThere are new coaches and new captains looking forward to the challenges which lie ahead but, at The Oval, there is unlikely to be any change to the approach that has served them so well, even though former director of cricket Alec Stewart will now occupy a more backseat role.\nIf there was any doubt about Surrey's desire to be the first team to win the title in four successive years since they did it seven times in a row in the 1950s, the recruitment of two internationals - Matthew Fisher and Nathan Smith - has dispelled it.\nWith stakes in The Hundred franchises in the process of being sold for huge sums, principally to the benefit of those counties who host teams, and talk of expanding that competition, it feels like English cricket may soon be undergoing further change, with even more pressure to squeeze in four competitions over the summer.\nBut this year's Championship begins on 4 April and will end on 27 September - and once again we can expect some great action along the way.\n\"I've always looked to strengthen our squad straight after we've won the Championship,\" said Surrey's Alec Stewart after adding Yorkshire fast bowler Fisher to their squad in October.\nStewart may have stepped down from his role but it is hard to see how the title can be wrestled from the grasp of those at The Oval especially with the addition of New Zealand all-rounder Smith from Worcestershire.\nThe one hope for Surrey's competitors could be a raft of international call-ups and prolific seamer Dan Worrall is now qualified to play for England.\nHampshire were the best of the rest last season but will miss James Vince who has chosen to play solely in the T20 Blast.\nFormer England opener Mark Stoneman has been drafted in from Second Division Middlesex but the loss of Pakistan seamer Mohammad Abbas could leave a big hole in their wickets column.\nSomerset and Essex once again led the way for the non-Test venue clubs last year and will have familiar line-ups this summer after what have been quiet winters on the recruitment front.\nAt Taunton, overseas seamers Matt Henry and Migael Pretorius will share a lot of the work, while Essex's preparations were upset with the loss of India fast bowler Shardul Thakur barely two weeks before the start of the season - but they do still have Simon Harmer in their armoury.\nCan Sussex and Yorkshire make a fist of it on their return to Division One?\nSussex are back after nine years away with their homegrown talent very much to the fore, bolstered by West Indies Test bowler Jayden Seales and Australian batter Daniel Hughes.\nAt Headingley, former skipper Anthony McGrath is now in charge, but a period of readjustment can be expected.\nBoth Warwickshire and Nottinghamshire continued to flatter to deceive last summer and considerable upheaval on the coaching front at Edgbaston may not help the Bears, along with the delayed arrival of marquee signing Tom Latham and unexpected early-season injury issues for two of their main strike bowlers, Chris Rushworth and Olly Hannon-Dalby.\nDurham's creditable fifth-place finish last season after promotion gives cause for optimism and they will still be able to rely on the runs of David Bedingham and Ollie Robinson - but Brydon Carse's continued injury problems will leave a lot of the heavy lifting in the seam-bowling department for Matthew Potts.\nWorcestershire, to the surprise of many, survived comfortably last season but the loss of Smith to the champions will not help their cause and it could be a summer of struggle at New Road.\nA lot of eyes in Division Two will be on Lancashire as they look to bounce back from relegation at the first attempt with the help of England's Test wicket record holder James Anderson, who has decided he is not yet ready to turn his back on the game.\nNow 42, he is still a bowler no-one will relish facing in seamer-friendly conditions, although he is not expected to play this month because of a calf injury, and, at the other end of the age scale, there will also be interest in how 16-year-old Rocky Flintoff has progressed after spending part of the winter with England Lions.\nKent were the other side relegated from Division One last summer and have signed Pakistan Test bowler Kashif Ali and South African paceman Keith Dudgeon, with Australian fast bowler Wes Agar not rejoining the club until the end of May as his workload is managed at the end of the Australian campaign.\nThey have also given a two-year rookie deal to Rocky Flintoff's elder brother, Corey, who played for Lancashire's second XI last summer.\nThe signing of South African paceman Dane Paterson makes up for the departure of Ethan Bamber as Middlesex look to go at least one better than last year's third place and it will interesting to see what impact spinner Zafar Gohar will have at Lord's after moving from Gloucestershire.\nNorthamptonshire have South African batter Matthew Breetzke available for the first eight games and, in Ben Sanderson, have one of the most consistent wicket-takers around, but their most important move over the winter was surely the arrival of head coach Darren Lehmann.\nAfter winning only one game last season and drawing 10, Leicestershire will look to a talented - and, in Louis Kimber, explosive - batting line-up boosted by the signing of Pakistan's Shan Masood while the acquisition of Dutch seamer Logan van Beek could also be a shrewd move.\nThe Glamorgan attack will feature England spinner Shoaib Bashir and Sri Lanka's Asitha Fernando in the early part of the season while Gloucestershire hope Australian Cameron Green can provide an early-season spark after last year's seventh place.\nFor Derbyshire, the only way is up and they will hope that last season's under-performing batting line-up can raise their collective game with elder statesman Wayne Madsen reinstalled as captain.\nThere have been six captaincy changes across the County Championship over the winter.\nThe big news just one week before the start of the season was Jonny Bairstow taking over the leadership of Yorkshire's red-ball team and following in the footsteps of his late father, David, who captained the White Rose county between 1984 and 1986.\nWhether this is an acceptance of his England Test career being over, only 35-year-old Bairstow will know but Division One bowling attacks will be on red alert.\nAlex Lees has taken over at Durham with predecessor Scott Borthwick moving into a player-coach position, while former Sussex captain Ben Brown is back in a skipper's role, taking over from Vince at Hampshire.\nIn Division Two, another man returning to captaincy is Madsen at Derbyshire, who resumes the position nine years after stepping down from his first stint.\nGloucestershire have entrusted the captaincy to Australia batter Cameron Bancroft while another Australian, Peter Handscomb, has taken over at Leicestershire, having also led Middlesex in the past.\nOn Thursday, BBC Sport will publish a club-by-club guide to the season with BBC local radio commentators giving their thoughts on each county's prospects for 2025.", "url": "https://www.bbc.com/sport/cricket/articles/cn8rvk2r3yjo"}