{"authors": ["Henry Brownsey", "www.facebook.com"], "date_download": "2025-04-26 07:51:57", "date_modify": "2025-04-26 07:51:57", "date_publish": "2025-02-25 14:47:03", "description": "Ruud van Nistelrooy press conference: West Ham vs Leicester preview", "filename": "sport_football_articles_c0eg449gl40o_1745653917.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2b61/live/eb1c3f30-b0b9-11ef-aff0-072ce821b6ab.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0eg449gl40o_1745653917.html", "title": "Ruud van Nistelrooy press conference: West Ham vs Leicester preview", "title_page": "Ruud van Nistelrooy press conference: West Ham vs Leicester preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "On the departures of coaches Ben Dawson and Danny Alcock: \"It wasn't always the plan. The plan was to start working together with the possibility to bring in my own people. From then, you evaluate and make your own decisions. It didn't have anything to do with results.\"\nHe said this was the \"best solution\" and the club would not be bringing in any more new coaches to replace them.\nOn the morale in the camp: \"The mood is lifted. It's started again in a new week and a new challenge. We have reacted after a bad result - you could say a bad performance - before. The players reacted really well and started the week really well.\"\nHe was asked if this was the biggest challenge of his career: \"Erm, wow! To go through all the challenges I've faced and compare them now... I called it a mountain to climb but life is about climbing mountains and mountains are there to be climbed. That challenge I take. We will keep climbing and we slip sometimes - but we get up and start again.\"\nThe club are doing \"everything they can to get\" James Justin fit for Thursday's game.\nHe said \"it's always the right time to try something different\" but added: \"It's not that we want to change all the time. If we feel it's necessary to do to get the best results, of course [we will].\"\nOn what is needed in the final games: \"We have to be resilient and strong. You have to show your character, reflect, learn and improve. We know the performance against Brentford wasn't good enough, but this team has always reacted and I expect them to do so on Thursday.\"\nOn if he would stay with the club if they were to be relegated: \"I know what contract I signed and it wasn't a contract for five months - it was two more seasons after this. I was aware when I arrived what the challenge was and how difficult it could be. I was aware and committed to the future.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c0eg449gl40o"}