{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:46:58", "date_modify": "2025-05-21 07:46:58", "date_publish": "2024-12-23 16:26:00", "description": "Scottish Rugby views: 'Completely different mindset and mentality'", "filename": "sport_articles_c2exp93zvxmo_1747813618.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c92d/live/594a7da0-c13b-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2exp93zvxmo_1747813618.html", "title": "'Completely different mindset and mentality'", "title_page": "Scottish Rugby views: 'Completely different mindset and mentality'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views after Sunday's 1872 Cup first round at Hampden as Glasgow Warriors sailed past Edinburgh.\nHere's what some of you had to say:\nAnon: Saturday's debacle is just the latest in a long list of calamitous Edinburgh failures that stretch back nearly twenty years. Many will rightly call for a change in coaching setup but who will want to come to a club where indifference and complacency have been allowed to run so deep and for so long?\nRob: The buck has to stop with Edinburgh's coaching team. The players all have the individual skill, but it's becoming pretty clear that there's a disconnect between them and the coaches. I'm not buying the \"they're lazy\" line. They perform brilliantly for the national team, and I credit them with more heart than that.\nPeter: As a Glasgow fan it is the first time ever I have been at a derby match and hoped that Edinburgh would do something to challenge Glasgow! For the good of Scottish rugby they need to be better. Ben Healy and Ross Thompson were promising up and coming players in their former clubs, but now they look bang average - what does that say about Edinburgh?\nJamie: Make no bones about it, Glasgow showed despite significant injuries that they were top dogs. Edinburgh conceded too many penalties and yellow cards in first half followed up with lack of desire, commitment and any pattern of plays in the second. What has happened to Edinburgh?\nHenry: Bragging rights rest in the West but a word of caution - Edinburgh, the other half of the next Scotland team - will give as good as they get on home soil. Having crossed the Warriors line twice late on, they'll be eating raw steak all week. This should be a cracker.\nGeoff: Edinburgh are never the same quality two games pinnacle. they have city players but seem to lack cohesion, consistency and. confidence. You have to look at the coach for that. They need a quality fly half off as well, Glasgow are everything they are not!", "url": "https://www.bbc.com/sport/articles/c2exp93zvxmo"}