{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-04-26 07:27:03", "date_modify": "2025-04-26 07:27:03", "date_publish": "2025-02-27 20:59:09", "description": "Fenerbahce manager Jose Mourinho is banned for four games and fined £35,194 for comments after Monday's game with Galatasaray.", "filename": "sport_football_articles_crmjjdy4e4jo_1745652423.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f896/live/862d6910-f54b-11ef-9acd-4337bb242d8e.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crmjjdy4e4jo_1745652423.html", "title": "Jose Mourinho: Fenerbahce coach given four-match ban for comments after Istanbul derby", "title_page": "Jose Mourinho: Fenerbahce coach given four-match ban for comments after Istanbul derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Fenerbahce manager Jose Mourinho has been banned for four games and fined a total of £35,194 for comments made after Monday's game with local rivals Galatasaray.\nMourinho was accused by Galatasaray of making racist statements after the Istanbul derby and, on Tuesday, Fenerbahce released a statement saying his comments had been taken \"completely taken out of context\".\nThe 0-0 draw was refereed by Slovenian Slavko Vincic after both clubs requested a foreign official take charge of the fixture.\nBut the fourth official was Turkish and Mourinho repeated his criticism of Turkish referees during his post-match news conference.\nThe Portuguese coach, 62, said that he went to the referee's dressing room after Monday's game, telling the fourth official that \"if you were a referee, this match would be a disaster\".\nOn Thursday, the Turkish Football Federation confirmed it would sanction Mourinho, external for two separate disciplinary matters.\nThe TFF said it would penalise him for \"his derogatory and offensive statements towards the Turkish referee\" and because he \"accused Turkish football of chaos and disorder with insulting and offensive statements towards both the Turkish football community and all Turkish referees\".\nThe former Chelsea, Manchester United and Tottenham boss has been banned from the dressing room and dugout for two games and fined 117,000 Turkish lira (£2,543).\nMourinho has also received another two-match ban for \"an act against sportsmanship\" during his post-match news conference and been fined £32,651.\nHis comments included him saying that \"after the big dive in the first minute and their bench jumping like monkeys on the top of the kid... with a Turkish referee you would have a yellow card after one minute and after five minutes I would have to change [substitute] him\".\nThe TFF said \"the statements used towards the members of the opposing team were contrary to the ethics of sports and the concept of fair play, contained expressions that could encourage violence and disorder in sports, were divisive and separatist in society and could cause fan incidents\".\nFenerbahce officials confirmed to the BBC on Thursday that the club will appeal the penalties given to Mourinho.", "url": "https://www.bbc.co.uk/sport/football/articles/crmjjdy4e4jo"}