{"authors": ["Grant Young", "www.facebook.com"], "date_download": "2025-05-21 06:06:36", "date_modify": "2025-05-21 06:06:36", "date_publish": "2025-04-01 13:58:35", "description": "Fan voice: 'Brilliant European tie awaits after Glasgow outclass Lions'", "filename": "sport_articles_cy8q0lpy4w4o_1747807596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16ab/live/f7e83370-0efd-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy8q0lpy4w4o_1747807596.html", "title": "'Brilliant European tie awaits after Glasgow outclass Lions'", "title_page": "Fan voice: 'Brilliant European tie awaits after Glasgow outclass Lions' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I'm not sure what's more impressive - winning by 42 points or holding a team to nil.\nGlasgow had to battle not only the travelling Lions but a 40mph wind that helped in the first half but felt like playing against an extra player in the second.\nThe Warriors were clinical in the opening 40, Nathan McBeth has returned with a bang and has now scored four on the bounce.\nJamie Dobie, out on the wing, deservedly was awarded man of the match. It wasn't just for his two tries, because defensively he timed some incredible tackles that completely ended any Lions momentum.\nAdam Hastings, much criticised for his last two performances, looked to have a greater level of composure after a shaky start and scored his first Glasgow try since returning north.\nHowever, the big headline scorer is new club record holder George Horne, who leaps over DTH Van Der Merve as the player with the most tries for the club. The question now is by how many can he extend the record?\nOn to the Champions Cup next and the visit of Leicester Tigers. It is a special competition and there is always something different in the build-up.\nIt's another chance for those in British and Irish Lions contention to impress against a cross-border rival and, for the club, it almost has the feel of a Scotland v England match.\nLeicester have a wealth of international experience at their disposal and are third in the English Premiership.\nIt's going to be a brilliant matchup as the URC defending champions take on one of the big English sides.", "url": "https://www.bbc.com/sport/articles/cy8q0lpy4w4o"}