{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:21", "date_modify": "2025-05-21 06:07:21", "date_publish": "2025-04-01 20:43:27", "description": "Glentoran move into pole position in the race for second as they beat Coleraine 2-1 at the Oval in their first post-split fixture.", "filename": "sport_articles_cy7083eze6jo_1747807641.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a36/live/c297f850-0f38-11f0-94fb-4f143086dd77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy7083eze6jo_1747807641.html", "title": "Irish Premiership: Glentoran beat Coleraine to go second as Dungannon Swifts hold Larne", "title_page": "Irish Premiership: Glentoran beat Coleraine to go second as Dungannon Swifts hold Larne - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran moved into pole position in the race for second as they beat Coleraine 2-1 at the Oval in their first post-split fixture.\nLarne dropped down to third after they drew 1-1 with Irish Cup finalists Dungannon Swifts at Stangmore Park.\nChampions Linfield, who will be presented with the Gibson Cup on Saturday, eased to a 3-1 home win against Crusaders.\nIn the bottom half of the table, Cliftonville came from behind to make it back-to-back wins against Carrick Rangers.\nBallymena United thrashed basement side Loughgall 5-2, who are edging ever closer to relegation\nPortadown and Glenavon played out a 1-1 draw in the mid-Ulster derby at Shamrock Park.\nGlentoran hit the front early thanks to a mishap in the Coleraine defence.\nDanny Amos delivered a superb cross from the left that Coleraine defender Charles Dunne could only direct into the back of his own net after only three minutes.\nTen minutes later it was almost two. Jordan Jenkins raced onto a long ball over the Coleraine defence, and he tried to lob the retreating Rory Brown in goal from 30-yards out, but the ball dropped wide.\nDespite absorbing lots of pressure, Coleraine could have been back on level terms on 21 minutes.\nFuad Sule chopped down Jamie Glackin inside the area with referee Shane McGonigle pointing to the spot. Up stepped Matthew Shevlin but his effort was saved superbly by Daniel Gyollai.\nMoments later David Fisher flashed an effort from the left, but it crashed off Brown's right-hand upright and away to safety.\nThree minutes after the break Coleraine went close as Shevlin rolled the ball across goal but first Jamie Glackin and then Rhyss Campbell failed to get a clean connection on the ball.\nDespite Coleraine's pressure, it was Glentoran who struck a second on 57 minutes.\nDylan Connolly, who had just arrived on the pitch moments before, sent a low drive from outside the area that whistled into the bottom left-hand corner of the goal, giving Brown no chance.\nColeraine grabbed a consolation through Declan McManus' penalty in injury-time after Shevlin was brought down in the box but it was not enough.\nVisitors Larne hit the front midway through the opening half through an unexpected source – Dungannon Swifts' playmaker Gael Bigirimana.\nThe midfielder did brilliantly initially to block Chris Gallagher's cross from the byline but inadvertently directed the ball onto the woodwork and over his own goal line.\nThe home side responded well to the setback and levelled 10 minutes later with an own-goal of their own.\nAdam Glenny made great ground down the left wing before fizzing a low cross into the danger area where Larne defender Ryan Nolan, in attempting to deny Tomas Galvin, put through his own net from close range.\nThe Swifts came closest to finding a winner in the second period and stand-in skipper Cahal McGinty thought he had netted the winner eight minutes from time.\nSecond half substitute Leo Alves delivered a corner deep to the far post where the captain, completely unmarked, headed towards the top corner only to be denied by a fine reflex save from Rohan Ferguson.\nRobbie McDaid's first half strike gave Linfield a 1-0 lead at the break, with Matthew Fitzpatrick and Kieran Offord adding netting in the second half before Jay Boyd's late consolation for the visitors.\nThe Blues hit the front after just 95 seconds as Jonny Tuffey totally miscued his goal-kick straight to Offord, who rather unselfishly squared the ball to McDaid who could not miss from six yards out.\nThe closest the Crues came to a goal in the first half was through the head of Daniel Larmour, who couldn't keep his effort down.\nDavid Healy's side doubled their lead just before the hour mark as substitute Fitzpatrick fired an unstoppable strike into the top corner after shifting the ball onto his right foot following some close control from Dane McCullough's pass.\nFormer Crusaders loanee Offord added a third for the runaway champions before substitute Boyd added a consolation 12 minutes from time for the visitors.\nDanny Gibson gave the hosts a dream start inside three minutes, latching onto Nedas Macilaitus' incisive through ball before rifling a low strike into the far corner beyond David Odumosu.\nThe Reds struck back just before the half-hour when Arran Pettifer's corner broke loose at the back post, allowing Luke Conlan to force the ball over the line in a crowded penalty area.\nEric McWoods produced a moment of brilliance to tilt the game in Cliftonville's favour late on - driving at the Gers' defence before dispatching a precise, low finish into the bottom corner on 84 minutes.\nWith the home side reeling, the north Belfast outfit struck again. Coran Madden picked out Rory Hale, whose shot was blocked, but Joe Gormley reacted first to slot home from close range and put the result beyond doubt.\nThe away side might've taken the lead even earlier. Pettifer's blistering volley after a deflected Glynn free-kick fell kindly cannoned off the bar moments before the interval.\nMinutes after their leveller, Jim Magilton's men carved out a golden chance. Ryan Curran fizzed a ball across goal, but Ryan Corrigan misfired with the net gaping before Alex Parsons sliced wide.\nPortadown made the breakthrough in the 21st minute through Ahu Obhakhan.\nBen Wylie whipped the ball into the area and Josh Ukek challenged Glenavon goalkeeper Mark Byrne for the ball.\nByrne pushed the ball away from goal, but Obhakhan was on hand to roll the ball under the outstretched arm of the goalkeeper.\nGlenavon then drew level on the 37th minute through a fierce Harry Murphy header.\nPeter Campbell fired in a pinpoint free-kick right onto the head of Murphy, who powered the ball beyond Aaron McCarey and into the Portadown goal.\nThe second half was full of industry but little in the way of clear-cut chances, with James Teelan and Matthew Snoddy threatening late on.\nBut with what was the final act of the game, Teelan should have grabbed all three points.\nUkek cut inside and tried to curl the ball into the top corner of the Glenavon goal. Byrne fumbled the effort, and the ball fell to Teelan, but his headed effort was weak and went wide of the target, much to the relief of Byrne and Glenavon.", "url": "https://www.bbc.com/sport/articles/cy7083eze6jo"}