{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:41", "date_modify": "2025-04-26 06:44:41", "date_publish": "2025-03-01 16:58:42", "description": "Irish Cup holders Cliftonville edge derby rivals Crusaders 2-1 while Dungannon Swifts and Ards also secure a spot in the semi-finals.", "filename": "sport_football_articles_cz031grzll8o_1745649881.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c070/live/db54a3a0-f6b7-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz031grzll8o_1745649881.html", "title": "Cliftonville beat Crues as Swifts and Ards progress", "title_page": "Irish Cup: Cliftonville beat Crues as Swifts and Ards progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Irish Cup holders Cliftonville are through to the semi-finals after defeating north Belfast rivals Crusaders 2-1 at Seaview.\nRyan Curran's header gave the Reds a first-half lead and Alex Parsons rifled into the top corner to double the advantage.\nHarry Franklin nodded home to give the hosts hope but Cliftonville head on to make the last four.\nThey will now face Championship side Ards, who progressed to the semi-finals with Michael Ruddy and Eamon Scannell on target in a 2-0 win over top-flight strugglers Loughgall.\nJohn McGovern bagged a double as Dungannon Swifts came from behind to beat Carrick Rangers 3-1 in the Taylors Avenue quarter-final.\nDanny Gibson put Carrick in front, but the Swifts fought back with Andrew Mitchell also netting for the visitors.\nThey will take on Championship club Bangor in the last four after they booked their semi-final spot on Friday night with a shock 3-1 victory against Glentoran.\nCurran opened the scoring for the visitors for the second game in a row, nodding home in the 38th minute after Jonny Addis cleverly recycled Rory Hale's free-kick, sending a looping header beyond the despairing dive of Jonny Tuffey.\nThe Reds' advantage was doubled just before the hour mark as Parsons ghosted unmarked into the area before unleashing an unstoppable drive that arrowed into the top corner.\nThe hosts responded immediately, Franklin powering home a close-range header after Cliftonville's backline momentarily switched off and breathing new life into the contest after falling two behind.\nThe match started cautiously, with both both teams struggling for rhythm in a disjointed first period.\nJordan Stewart nearly punished the away side's early carelessness, pouncing on defensive hesitation in the eighth minute, but his left-footed effort was gathered comfortably by the alert Lewis Ridd.\nDaniel Larmour came agonisingly close to an equaliser with eight minutes remaining.\nMeeting Ross Clarke's inviting delivery, the defender seemed certain to score until Ridd showcased his reflexes with a spectacular point-blank save, somehow clawing the ball to safety and preserving the visitors' slender advantage.\nWith just three minutes on the clock, Carrick grabbed the opener.\nA long clearance over the top of the Swifts defence was latched onto by Gibson and the striker hooked a superb volley from 25-yards out that zipped past Declan Dunne in goal and into the right-hand corner of the goal.\nTen minutes later McGovern found himself through on goal for Dungannon, but Kurtis Forsythe did brilliantly to slide in and clear the danger.\nRangers should then have doubled their advantage on 25 minutes. Joe Crowe rifled a low cross across the six-yard box finding Jack Hastings who shot on-goal, but Dunne somehow kept it out. Hastings could only find the woodwork with his rebounded effort.\nAt the other end McGovern went close after Rangers failed to deal with a corner, but the forward's volley from six yards went just over the bar.\nWhatever Swifts boss Rodney McAree said at half-time clearly worked as just 10 minutes after the break Gael Bigirimana played a lovely through ball from inside his own half that sent Mitchell clear.\nThe striker slotted the ball past the advancing Jack McIntyre and into the net via the left-hand upright.\nThen on 70 minutes the Swifts turned the game on its head. Dunne punted long downfield allowing McGovern to run onto the ball with McIntyre unsure whether to come out or not and the forward punished the indecision with a calm finish.\nDungann sealed victory seven minutes later - yet another long ball in behind the Rangers defence caused havoc and McGovern was once again the man to benefit.\nThe forward cut back inside Cian O'Malley, showing great footwork before passing the ball into the net at the near post to send the Swifts into the last four.\nArds progressed to the Irish Cup semi-finals for the first time since 1995 thanks to this victory over the Villagers at Clandeboye Park.\nThe hosts made a bright start and were awarded a penalty on the 13th minute when Ruddy fell under the challenge of Ryan Waide in the box.\nRuddy took the resulting spot-kick and made no mistake, firing into the bottom left-hand corner.\nIt was nearly 2-0 shortly after with Scannell's corner looking like it was going to find the back of the net, but it crashed off the crossbar before being scrambled off the line.\nAs the half drew to a close chances became few and far between with Loughgall's best chance coming when Waide headed Pablo Andrade's cross off target from close range.\nBoth sides struggled to push forward after the restart with the first opportunity coming on the 67th minute when Scannell's effort from 25-yards flew just over the crossbar.\nArds doubled their lead on the 78th minute after a clumsy pass from Conor McCloskey left Lee Newell through on goal. His strike was blocked by Berraat Turker, but Scannell was able to convert the rebound.", "url": "https://www.bbc.co.uk/sport/football/articles/cz031grzll8o"}