{"authors": ["Ian Woodcock", "www.facebook.com"], "date_download": "2025-05-21 05:02:01", "date_modify": "2025-05-21 05:02:01", "date_publish": "2025-04-04 09:51:59", "description": "Hull FC head coach John Cartwright says his side face a \"daunting task\" in their Challenge Cup quarter-final against city rivals Hull KR.", "filename": "sport_rugby-league_articles_cj0zjg4q7vvo_1747803721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8de5/live/f2fa7c10-109c-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cj0zjg4q7vvo_1747803721.html", "title": "Hull FC v Hull KR: City rivals set for first Challenge Cup game in 39 years", "title_page": "Hull FC v Hull KR: City rivals set for first Challenge Cup game in 39 years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull FC head coach John Cartwright has said that his side face a \"daunting task\" in their Challenge Cup quarter-final against city rivals Hull KR.\nWillie Peters' side have won all eight of their matches in all competitions this season and are top of Super League, while Cartwright's men are second in the top flight with four wins from their opening six games.\nSaturday's tie, the first time the rivals have met in this competition for 39 years, will be broadcast on BBC One with a 14:30 BST kick-off.\n\"They're a red-hot side. It's not only what they've done this year, it's what they've been able to do in the past three years when Willie has been there. They're probably the strongest they've been,\" Cartwright told BBC Radio Humberside.\n\"It's a daunting task and they'll be short-priced favourites I'd imagine but when you run across that stripe and it's two passionate teams going at one another then favourites go out the window.\"\nCartwright has overseen a tremendous turnaround in the club's fortunes since taking over in the off-season after four years as Brisbane Broncos assistant.\nThe Black and Whites have already won more games in Super League this season than they managed in the whole of their dire 2024 campaign.\nThe Australian has said his side, who fought back from 22-6 down to beat Wigan 26-22 in the previous round, are benefitting from adding steel to their performances.\n\"We didn't go in setting goals or with expectations,\" he said.\n\"We're a whole brand new side and club, it was just about going out and being competitive and not giving up until the end. I think if you do that then you'll be involved in winning most games.\"\nRovers head coach Peters believes his side can draw on their big-game experience in recent years.\nThe Robins have reached the semi-finals in the cup in both of the past two seasons and were beaten by Wigan in last year's Grand Final.\n\"We've played a fair few cup games in the past three seasons and played in a lot of do-or-die games now so we understand what is at stake,\" he told BBC Radio Humberside.\n\"We have to focus on the performance, if we get that right it puts us in good stead to get a result.\n\"This game will be like a final in terms of atmosphere. We'll only have 3,500 there but it will feel like 20,000.\"\nPeters said that his side would also take added motivation from the size of their ticket allocation for the match.\nHull FC gave their rivals 3,708 tickets for the game, which they sold out in less than15 minutes.\n\"It certainly drives us,\" he said.\n\"We know possible reasons and it is what it is but it makes us more determined to give our fans at the game but more importantly who couldn't purchase tickets something to shout about.\"\nHe added: \"It's going to be a cracker of a game. First v second, both teams are in form and it's a local derby. We know the rivalry and what it does to families but it's all part of the fun.\"\nHull KR captain Elliot Minchella is aiming to help the club to just a second-ever Challenge Cup final win this season.\nThe Robins only previous success in the competition came in 1980, when they beat their city rivals in the final at Wembley.\nHe is relishing the \"privileged\" position he and his team-mates have.\n\"Derbies are special for our community and for our club,\" he told BBC Radio Humberside.\n\"It's good to have an influence on so many people's lives. People from east Hull are so passionate about Hull KR and we have a great responsibility that what we go out and do as a job sets people up for the week or the year in some cases. That is a real privilege.\n\"We get to do what we love doing out on the field and put smiles on so many thousand faces. It's cool.\"", "url": "https://www.bbc.com/sport/rugby-league/articles/cj0zjg4q7vvo"}