{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:31", "date_modify": "2025-04-26 06:17:31", "date_publish": "2025-03-01 18:33:12", "description": "Torquay United manager Paul Wotton says he is 'gutted' as his side throw away a 2-0 in the final 10 minutes to draw 2-2 at home to Boreham Wood.", "filename": "sport_football_articles_cq5zwq05vx0o_1745648251.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65d2/live/dbf22180-f6ca-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cq5zwq05vx0o_1745648251.html", "title": "Paul Wotton: Torquay United boss 'gutted' after late 2-2 Boreham Wood draw", "title_page": "Paul Wotton: Torquay United boss 'gutted' after late 2-2 Boreham Wood draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Torquay United manager Paul Wotton said he was \"gutted\" as his side threw away a 2-0 lead in the final 10 minutes to draw 2-2 at home to Boreham Wood.\nThe point means the Gulls have won just one of their past five matches and drop to seventh in National League South, eight points off leaders Dorking Wanderers.\nJordan Young gave the Gulls a ninth-minute lead as he converted Matt Jay's pass before provider turned scorer just before the break as Jay converted from the edge of the box.\nJayden Richardson struck the post for Boreham Wood as they tried to get back into it, and they gave themselves a lifeline when Abdul Abdulmalik scored from distance in the 82nd minute.\nAbdulmalik set up Junior Dixon to slot home from eight yards in the eighth minute of stoppage time to secure a point.\nThe draw came a week after Torquay conceded two late goals to lose 3-2 at Chelmsford City.\n\"I'm gutted. Gutted for the fans, gutted for the players,\" Wotton told BBC Radio Devon.\n\"It's happening too many times.\n\"We had chances in the last three minutes to kill the game off and it's criminal game management.\n\"We've worked on it, that's Slough, Chelmsford, today. It's happening too often.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cq5zwq05vx0o"}