{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:17:59", "date_modify": "2025-05-20 14:17:59", "date_publish": "2023-07-29 14:41:57", "description": "Chelsea are close to signing French midfielder Lesley Ugochukwu from Rennes for 27m euros (£23.2m).", "filename": "sport_football_66349900_1747750679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/133EC/production/_130582887_gettyimages-1247290124.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66349900_1747750679.html", "title": "Lesley Ugochukwu: Chelsea close in on £23.2m Rennes midfielder", "title_page": "Lesley Ugochukwu: Chelsea close in on £23.2m Rennes midfielder - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea are close to signing French midfielder Lesley Ugochukwu from Rennes for 27m euros (£23.2m).\nUgochukwu, 19, has made 47 Ligue 1 appearances for Rennes and has also featured in the Europa League.\nHe is yet to make his senior debut for France but has played for his nation at under-17, under-18 and under-19 levels.\nChelsea manager Mauricio Pochettino said recently that the Blues need to add to their midfield.\nUgocukwu, though, could well be sent immediately back out on to Ligue 1 side Strasbourg if a deal is finalised, after the Blues' ownership group purchased a majority stake in the Alsace side in June.\nChelsea have a plan to sign young talent that have potential to be future stars of world football, while clearing out their bloated squad following a £600m spend in the past two transfer windows.\nKai Havertz, Mateo Kovacic and Mason Mount have all departed the club this summer for Arsenal, Manchester City and Manchester United, respectively, while the likes of N'Golo Kante, Kalidou Koulibaly and Edouard Mendy have moved to the Saudi Pro League.\nRuben Loftus-Cheek and Christian Pulisic both made the switch to Italian giants AC Milan.\nThe Blues are reportedly pursuing a deal for Brighton midfielder Moises Caicedo, but have had a series of bids rejected, while Conor Gallagher has been subject of a £40m offer from West Ham.\nChelsea have already added attackers Christopher Nkunku and Nicolas Jackson to their squad as well as Brazilian youngster Angelo Gabriel.", "url": "https://www.bbc.com/sport/football/66349900"}