{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:31:49", "date_modify": "2025-05-21 06:31:49", "date_publish": "2025-02-08 00:00:00", "description": "Live text commentary from the SSE Arena in Belfast as the Belfast Giants host the Guildford Flames in the Elite League.", "filename": "sport_ice-hockey_live_c0m1gem7lklt_1747809109.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_live_c0m1gem7lklt_1747809109.html", "title": "Belfast Giants v Guildford Flames", "title_page": "Belfast Giants v Guildford Flames - Elite League ice hockey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Giants come from behind to take two points\nBelfast Giants 4-3 Guildford Flames\nScott Conway went from almost villain to hero as he pockets the shootout winner in the sixth round for the Giants.\nWhen you’re in a title chase sometimes it doesn’t matter how you win, just that you do.\nAfter failing to turn up for two periods the Giants delivered a third period that dragged themselves back into the game and with Sheffield and Nottingham both winning, that shootout carried with it a big second point.\nGuildford will count themselves unlucky - two great periods gave them the lead but they’ll regret not taking advantage of the powerplay in overtime.\nIt’s Hockey Night in Belfast\nBelfast Giants v Guildford Flames (19:00)\nWelcome to the SSE Arena in Belfast for tonight’s Elite League clash between the Belfast Giants and Guildford Flames.\nGuildford are looking for their first win here since November 2023.\nOn their last three trips to Belfast, the Flames have only scored two goals, and were shut out on their previous visit this season 2-0.\nLeague leaders Belfast were beaten in Dundee last Sunday, their first defeat in eight games.\nThey lead the league by seven points, although have played a game more than the chasing pack.", "url": "https://www.bbc.com/sport/ice-hockey/live/c0m1gem7lklt"}