{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:26:26", "date_modify": "2025-05-21 06:26:26", "date_publish": "2025-04-01 10:00:52", "description": "Nottingham Forest news: Nikola Milenkovic on season so far and Murillo partnership", "filename": "sport_football_articles_c1wd7w5yex4o_1747808786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/349b/live/5e3f42d0-0e1d-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wd7w5yex4o_1747808786.html", "title": "Nottingham Forest news: Nikola Milenkovic on season so far and Murillo partnership", "title_page": "Nottingham Forest news: Nikola Milenkovic on season so far and Murillo partnership - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nikola Milenkovic says Nottingham Forest must not get carried away by their current position as they approach the closing stages of what has been a memorable campaign for the club.\nForest are third in the Premier League with nine games to play and will appear in their first FA Cup semi-final for 34 years later this month, providing chances to qualify for Europe next season for the first time in nearly three decades.\n\"It is difficult to imagine we could have been in this position,\" Serbia defender Milenkovic told BBC Sport chief football news reporter Simon Stone.\n\"But this is now our reality. We are so happy to be in this position at this moment.\n\"But we need to keep our feet on the ground. We have done nothing yet. We need to keep improving, keep working as a team and keep pushing in the last games.\"\nCentral to Forest's success has been the centre-back partnership between Milenkovic and Murillo.\nDescribing his 22-year-old team-mate as a \"top player\", Milenkovic said: \"We understand each other really well. We complement each other really well.\n\"Our characteristics are different but that helps us to work better together. The relationship between us is very good.\n\"But the defence is all the team. If the rest of the team is defending well, it is easier for the back four and the goalkeeper. It is about the whole team but Murillo is a top player with very big potential - and he will get better.\"", "url": "https://www.bbc.com/sport/football/articles/c1wd7w5yex4o"}