{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:15:48", "date_modify": "2025-05-21 06:15:48", "date_publish": "2025-03-31 09:48:37", "description": "Preston 0-3 Aston Villa reaction: Marcus Rashford's future remains uncertain", "filename": "sport_football_articles_c15vgj5083jo_1747808148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e002/live/354e4770-0e15-11f0-8331-61229d24cb73.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c15vgj5083jo_1747808148.html", "title": "Rashford's future remains uncertain", "title_page": "Preston 0-3 Aston Villa reaction: Marcus Rashford's future remains uncertain - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marcus Rashford ended his 120-day goal drought with a second-half double at Preston on Sunday to help Unai Emery's side set up an FA Cup semi-final against Crystal Palace - so why wouldn't Aston Villa want to make the loan move permanent?\nThe deal United struck with Aston Villa to let Rashford leave is not straightforward.\nThe precise nature of the loan deal is complicated. United have said 75% of Rashford's wages are being covered, although they have not explained exactly how.\nThat could rise to 90% if certain performance-related bonuses are met.\nThat, presumably, will include an extended run in the Champions League as well as the FA Cup.\nUnai Emery's side face Crystal Palace at Wembley next month as the next step in their quest to win the trophy for the first time since 1957.\nIn addition, they are ninth in the Premier League, three points behind fifth-placed Manchester City, who occupy what is virtually certain to be the final Champions League spot.\nThat proliferation of targets underscores why Emery did not really want to talk about the likelihood of Villa triggering their £40m option to turn Rashford's move into a permanent deal.\n\"We can't waste time speaking about that,\" he said\n\"If next year we are in the Champions League, in the Europa, or Conference League or not. Or we don't win a trophy - it is completely different.\"", "url": "https://www.bbc.com/sport/football/articles/c15vgj5083jo"}