{"authors": ["Amy Canavan", "www.facebook.com"], "date_download": "2025-05-21 07:46:02", "date_modify": "2025-05-21 07:46:02", "date_publish": "2025-01-22 07:58:05", "description": "Adam Idah produced more than one heroic moment during his loan spell with Celtic last season, received a hero's welcome when he made the permanent switch, but, so far, he's struggling to reach the same heights.", "filename": "sport_football_articles_c20kxn601kyo_1747813562.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e450/live/af489bc0-d896-11ef-9567-af1f21102465.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c20kxn601kyo_1747813562.html", "title": "What's the script with Adam Idah, Celtic's big-money summer signing?", "title_page": "What's the script with Adam Idah, Celtic's big-money summer signing? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When Adam Idah won Celtic the Scottish Cup last season with his dramatic 90th-minute strike against Rangers, he etched his name into the club's history books.\nFast forward eight months and a permanent contract later, the Republic of Ireland international has his name scribbled across social media by fans left deflated by his season so far.\nAfter nine goals in 19 loan appearances last season, his five-year deal in the summer - even despite his reported eye-watering £9.5 million fee all-in - seemed a match made in heaven.\nHowever, with just eight goals in 31 games, his honeymoon period in the green and white hoops has passed.\nWithout a goal since 30 November, fellow forward Kyogo Furuhashi front and centre of the transfer rumour mill and a recent run of four starts with sparse sniffs at goal all ending in subdued substitutions, is Idah's hefty price tag weighing him down?\nWith the help of Opta, BBC Scotland takes a look at the Celtic striker's numbers this term.\nAs Celtic's number nine, there's a non-negotiable expectation for goals. Even more so when the club have coughed up more than nine million notes for such services.\nWhen Idah first joined the club, nearly a year ago on deadline day, he hit the ground running.\nHe backed up an assist on his debut in Aberdeen with two penalties against Hibs - including one in the 94th-minute - to announce himself to the supporters.\nIn an inspired half-time substitute 18 days later against Motherwell, he dragged the champions from defeat to victory with a pivotal double, before goals against Rangers at Ibrox and the aforementioned Hampden cup final.\nA bunch of heroic moments.\nBut since his hero's welcome upon his permanent arrival in August, there's been more hitting the ground in frustration than picking up where he left off.\nOf his eight goals, five have come in the Premiership from 887 minutes, spread across 20 games.\nCompared to other strikers in the division, he's joint 13th on goals scored. With 40 shots in total, he's eighth on the list with his fellow forwards.\nA deeper look at when those goals have come don't help his case, either. While last season he proved to be the man for the big moments, his finishes against St Johnstone, Motherwell, Hearts and Ross County respectively all merely added gloss to the scoreline.\nIn fact, four came in the 78th-minute onwards, while his goal against County was the fourth in a fantastic first-half showing from Brendan Rodgers' side.\nIn the Champions League, where his minutes have been limited, he's managed just one goal against Slovan Bratislava on matchday one.\nThe big bucks were dished out, but Idah is yet to deliver on the big stage, though he may get the opportunity to change that against Young Boys on Wednesday and Aston Villa next week.\nWith a team-mate like Kyogo, who has 12 goals in the same amount of games as Idah in all competitions - albeit with more minutes - it's important to stress there's more than just goals to Idah's role.\nHowever, with no assists to his name this season, in the league against Hibs, he's not exactly setting them up either, and with 12 chances created, he's joint 18th in the ranking with his fellow top-flight strikers.\nNo wonder, really, since he's not seen a lot of the ball. In the last Premiership game against Dundee, he touched the ball 12 times in total during 61 minutes.\nAgainst Ross County he had six touches in the box, two against Dundee United out of 20 in total and four out of 22 touches against St Mirren were in the area.\nLike most strikers do at some stage, the former Norwich City player is going through a barren spell. And like most strikers, he's a confidence-based player. When the goals aren't coming, the confidence isn't flowing.\nPrior to the last Premiership game, though, manager Brendan Rodgers backed him to come good and stressed he had no concern over his goal drought.\nHowever, in the same press conference, he expressed his delight at Johnny Kenny's return to the club after a successful loan stint at Shamrock Rovers.\nThe 21-year-old replaced his countryman against Ross County and missed a good chance of his own. That cameo, though, and his time in Ireland, has encouraged some supporters to suggest he deserves a start.\nIn recent weeks, here's what a few of you have said...\nPeter: We need a centre forward that can put the ball in the net. Time to give young Johnny Kenny a run of games. Idah will never get enough goals. His stats prove that.\nNeil: Poor finishing is costing us. Idah is a big concern, is the jersey too big for him? We need a quality finisher, new striker please Brendan.\nAndy: Idah is a waste of a jersey. Should have played the young lad Kenny he couldn't have done any worse.\nPatrick: Idah looks too desperate and can't cope with the pressure of his price tag.\nPaul: Idah's form has also been alarmingly poor, compared to his heroics from last season.\nPeter Going forward I would like to see Kenny picked ahead of Idah. I think he may prove more of a goal scorer in the long run.", "url": "https://www.bbc.com/sport/football/articles/c20kxn601kyo"}