{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-20 13:36:33", "date_modify": "2025-05-20 13:36:33", "date_publish": "2023-08-01 16:09:06", "description": "Swansea City captain Matt Grimes says he was sorry to see Russell Martin go, but is ready for a \"fresh start\" under the new head coach", "filename": "sport_football_66376605_1747748193.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5FA0/production/_130608442_cdf_290723_reading_v_swanseacity01.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66376605_1747748193.html", "title": "Swansea City captain Matt Grimes ready for 'fresh start' under Michael Duff", "title_page": "Swansea City captain Matt Grimes ready for 'fresh start' under Michael Duff - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Swansea City captain Matt Grimes says he was sorry to see Russell Martin depart, but is looking forward to a \"fresh start\" under the new head coach\nMartin left for Southampton this summer after two seasons in south Wales, with former Barnsley boss Michael Duff the new man in charge.\nGrimes said on multiple occasions that he thought Martin was the best manager in the Championship.\nThe 28-year-old midfielder was even rumoured to follow Martin to St Mary's.\n\"I think it's a natural thing to link someone who has played almost every game under that manager to that manager, it happens all the time,\" Grimes told BBC Sport Wales.\n\"I have just carried on with my work to make sure I came back to pre-season fit and firing.\n\"Obviously we were upset to see him [Martin] go, we thought he was a brilliant coach, he was brilliant with the lads and brilliant around the place.\n\"It's no secret how much I loved working under him, but football changes and you have to get on with it.\n\"Everyone is entitled to having a crack at any job they want.\n\"Southampton are a massive club, just relegated from the Premier League, so the squad and the fire power that they will have will be right up there with the best in the league, so I can fully understand his reasoning for wanting that challenge.\"\nThe Swans open the new Championship season at home to Birmingham City on Saturday, 5 August having played six pre-season friendlies.\nAfter last Saturday's 4-0 win over Reading, Grimes is confident the squad \"is in a good place\".\n\"Obviously it's been a time of transition for the club, but we have gradually improved throughout pre-season,\" he said.\n\"The result at Reading, and the way we played, I think that was the best we have been, which is what you want in the build-up to the start of the season.\"\nDuff has signed a three-year deal and while he is happy to enforce the club's style of playing, he says it is about getting the balance right in a results-based business.\nWhether last season's top scorer Joel Piroe remains at Swansea is yet to be seen after being linked with clubs such as Everton, Nottingham Forest and Leicester City.\n\"He's such a good player, such a good lad, I actually feel a bit sorry for him with the amount of speculation that surrounds him all the time,\" Grimes said.\n\"It's warranted because he scores so many goals.\n\"If someone comes in and takes him from us, it has to be the perfect deal for him and the club, similar to the way Flynn [Downes] left, there was no animosity at all.\n\"He's a fantastic footballer and a great guy and if he's here absolutely brilliant and if someone comes in, then that's footy", "url": "https://www.bbc.com/sport/football/66376605"}