{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:39:12", "date_modify": "2025-04-26 06:39:12", "date_publish": "2025-03-02 16:27:26", "description": "Cardiff City moved eight points clear at the top of the Adran Premier after victory over Briton Ferry.", "filename": "sport_football_articles_cx20x411q5no_1745649552.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/df03/live/fef51b20-f782-11ef-b744-2fe4be9f666c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx20x411q5no_1745649552.html", "title": "Cardiff beat Briton Ferry to extend Adran Premier lead", "title_page": "Cardiff beat Briton Ferry to extend Adran Premier lead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sunday, 2 March\nChampionship Conference\nBriton Ferry Llansawel 0-2 Cardiff City: Cardiff City moved eight points clear at the top of the Adran Premier after victory over Briton Ferry in the battle of the top two. Ffion Price put the visitors ahead after 15 minutes, as her corner kick from the Cardiff left found its way into the far corner of the net in sensational style. The Bluebirds doubled their lead 10 minutes later when Mackenzie Olden headed home the rebound from Shannon Evans' initial effort. The defeat is just a second of the season for Briton Ferry, who remain two points above The New Saints.\nWrexham 3-1 The New Saints: The New Saints missed the chance to go second as they were beaten 3-1 at Wrexham. Two goals in two minutes from Ava Suckley gave the hosts a two-goal lead approaching the half-hour mark, but Molly Havard pulled one back for TNS before the break. Carra Jones' brilliant strike from an acute angle sealed the win for Wrexham, as they closed the gap on third-place TNS to just two points.\nRelegation Conference\nCardiff Met 1-2 Aberystwyth: Cardiff Met's wait for a Adran Premier win this season continued as they let a lead slip at home against Aberystwyth. Beca Thomas had put the Archers ahead in the first half, and they remained in the lead until past the hour mark. However, Lleucu Mathias drew the visitors level after 64 minutes and Imogen Scourfield's 86th minute strike sealed a crucial win for Aberystwyth. Aber's second win of the season moves them six points clear of Met, who remain winless this campaign.", "url": "https://www.bbc.co.uk/sport/football/articles/cx20x411q5no"}