{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:40", "date_modify": "2025-04-26 06:17:40", "date_publish": "2025-03-01 18:25:04", "description": "Frank Lampard calls for focus from side after reaching fifth place.", "filename": "sport_football_articles_cx290674znwo_1745648260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7702/live/7c0d71d0-f6c9-11ef-a811-cd286d96b2f6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx290674znwo_1745648260.html", "title": "Oxford United 2-3 Coventry City: Frank Lampard calls for focus from side", "title_page": "Oxford United 2-3 Coventry City: Frank Lampard calls for focus from side - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Coventry manager Frank Lampard said his side must remain focussed after victory over Oxford United saw them climb into the Championship play-off places.\nSpeaking to BBC Radio CWR after seeing his side win 3-2 on the road at the Kassam Stadium, the Sky Blues boss said: \"We have made big strides there is no doubt. Performances and results and it's a good feeling.\n\"We just have to continue it because I say the same every week, the minute you rest on a good feeling it becomes difficult in this league. From where we were three months ago to now has been good work.\"\nCoventry were twice pegged back by Oxford and had a penalty saved before Tatsuhiro Sakamoto scored the deciding goal.\nLampard said: \"We were not at our best today but I think that can happen with these sorts of games. Possibly the early goal gave us a sense that we were really controlling the game but that went away.\n\"At this stage when we are trying to churn out results and points you've got to look at the team when you are not at your best can you win games? Three goals and we missed a penalty so we managed to do it.\n\"We lacked that element of control but I liked our reactions to the goals in the second half and the bits of quality.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cx290674znwo"}