{"authors": ["Ben Collins", "www.facebook.com"], "date_download": "2025-04-26 07:34:22", "date_modify": "2025-04-26 07:34:22", "date_publish": "2025-02-27 15:51:50", "description": "Manager Unai Emery says Aston Villa are \"not a contender\" to win the FA Cup this season.", "filename": "sport_football_articles_cx2997zwydgo_1745652862.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b840/live/300f71f0-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cx2997zwydgo_1745652862.html", "title": "FA Cup: Aston Villa not a contender to win trophy", "title_page": "FA Cup: Aston Villa not a contender to win trophy - Unai Emery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manager Unai Emery says Aston Villa are \"not a contender\" to win the FA Cup this season.\nVilla host Championship strugglers Cardiff City on Friday for a place in the quarter-finals.\nLiverpool, Arsenal and Chelsea have already been knocked out and Villa showed their quality by beating Premier League rivals West Ham United and Tottenham Hotspur in the previous two rounds.\nBut Emery said: \"We are not a contender in the FA Cup to win the title, but to try to compete in the competition and have a way to a trophy - and Europe is very important, and prestigious.\n\"Every club, players and coaches like trying for prestige. It could be the best way to qualify for Europe. We have three ways - the Premier League, the Champions League and the FA Cup.\"\nVilla are 10th in the Premier League, with six of the teams above them still in the FA Cup.\nAt least four top-flight teams will go out in the fifth round as there are four all-Premier League ties, and one Championship side is guaranteed to be in the last eight as Preston host Lancashire rivals Burnley.\nAsked why he does not see Villa as a contender, Emery replied: \"We are not contenders. Why? Because there are other teams with more options than us to win this competition.\"\nFriday's game is Villa's fifth in 14 days and they have a host of players ruled out or doubtful through injury.\nEmiliano Martinez came off at half-time in Tuesday's 4-1 defeat at Crystal Palace and Emery said Villa will make a decision on whether the Argentina goalkeeper plays after he trains on Thursday afternoon.\nTyrone Mings, Boubacar Kamara and Amadou Onana are also doubtful, while Emery added that Matty Cash could play.\nDonyell Malen hopes to recover from an illness but Pau Torres and Ross Barkley are out.", "url": "https://www.bbc.co.uk/sport/football/articles/cx2997zwydgo"}