{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:49:59", "date_modify": "2025-04-26 06:49:59", "date_publish": "2025-03-01 08:11:04", "description": "Britain's Ranjuo Tomblin creates more history with men's tech solo victory at the Artistic Swimming World Cup.", "filename": "sport_swimming_articles_cnvz5727637o_1745650199.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c698/live/4e3c3d10-f672-11ef-add6-b1b4246007a3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_swimming_articles_cnvz5727637o_1745650199.html", "title": "Ranjuo Tomblin: Briton wins historic artistic swimming men's World Cup gold", "title_page": "Ranjuo Tomblin: Briton wins historic artistic swimming men's World Cup gold - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Britain's Ranjuo Tomblin has created more history with victory in the men's tech solo event at the Artistic Swimming World Cup in Paris.\nThe 19-year-old, who became GB's first male artistic swimming European champion last year, is now his nation's first male World Cup medal winner.\nTomblin, who has said he wants to change the perception of the sport, scored 214.3966 from the judges for his routine in the opening event of the season.\nEduard Kim of Kazakhstan took silver with 213.8167 while bronze went to Spain's Jordi Caceres Iglesias who finished on 213.5992.\n\"I totally didn't expect it, we just came here to test our routines,\" Tomblin said.\n\"I'm really grateful to have the chance to test our routines at the big competitions, so I'm just really happy and I can't really believe this has happened.\"\nThe victory came in the same city where Kate Shortman and Izzy Thorpe won duet silver last year to claim Britain's first Olympic medal in the sport and their performance has inspired Tomblin.\n\"Kate and Izzy are really opening the door for us as a newer generation of athletes,\" he added.\n\"They've made us realise that Great Britain is actually quite good at this sport, and that has given us a lot of confidence.\n\"When you win medals, it's definitely like, 'oh look, look at what I'm doing' - and it really shows what all the hard work is doing for us.\"", "url": "https://www.bbc.co.uk/sport/swimming/articles/cnvz5727637o"}