{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:07", "date_modify": "2025-04-26 04:16:07", "date_publish": "2025-03-04 09:38:54", "description": "Angelo Harrop believes Chelmsford City have the potential to become an English Football League club after being appointed as their next manager.", "filename": "sport_football_articles_cpwdqxddj5go_1745640967.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e65e/live/b112c540-f8d3-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cpwdqxddj5go_1745640967.html", "title": "Angelo Harrop: Next Chelmsford City boss backs them to be an EFL club", "title_page": "Angelo Harrop: Next Chelmsford City boss backs them to be an EFL club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Angelo Harrop believes Chelmsford City have the potential to become an English Football League club after being appointed as their next manager on a two-year contract.\nThe former Braintree boss will take charge on 19 May when current manager Robbie Simpson steps down after five years in the role.\nHarrop was sacked by Braintree in November, having guided them to promotion to the top tier of non-league football last season with a 4-3 win over Worthing in the National League South play-off final.\nHe takes over a Chelmsford side currently 12th in the NLS table with 10 games left to play, 13 points adrift of the play-off places, but 16 clear of the relegation zone.\n\"I know the club very well because I'm local, living in Colchester, and obviously (because of) the rivalry with Braintree Town,\" Harrop told BBC Essex Sport.\n\"I feel refreshed and ready for the challenge. I definitely needed that little bit of time off just to look after myself and make sure the next club I went to, I was 100% ready to go back in.\"\nHarrop said the potential of Chelmsford is \"absolutely huge\".\nHe added: \"They could potentially be a Football League club. And, after speaking to (owner) Spencer (Gore) and the directors, I don't see why that couldn't happen.\n\"The facilities are fantastic and hopefully I can improve on the great work Robbie has done. For them to choose me, I'm really proud of that and it's my job now to take this club to the next level.\"\nChelmsford reached the play-offs in 2023 and 2024 but were beaten 3-2 by Harrop's Braintree side at the semi-final stage last season.\n\"I don't want to talk about that too much,\" he laughed. \"My Braintree time, I'm so thankful for that. Now is the time to try to bring that success to Chelmsford.\n\"(For the next couple of months) I'll be in the shadows and looking at what things I can keep and what things I can improve - but it gives me time, I can watch a lot of games and the players.\"\nThe origins of Chelmsford City date back to the 1870s but the current club was founded in 1938.\nChairman Spencer Gore bought a 60% majority stake in the club last summer, having first tried to buy the club in 2021 after sponsoring their Melbourne Stadium during Covid.\nOn Harrop's appointment, Gore told BBC Essex: \"We wanted someone that had been successful in National League South and had managed in the league above.\n\"Out of the 100-plus applicants that came in, Angelo ticked all the boxes of our criteria, so it was really quite an obvious choice in the end.\"\nGore has not yet given up on the Clarets reaching the play-offs again under Simpson this season.\n\"Yes, it's going to be hard but we still think it can be done,\" he added.\n\"Mathematically we think 72 points will get there and eight wins will get us that. As long as it's doable, we'll keep fighting, that's how we do things here.\n\"If we get there, brilliant. It would be great for Angelo to start work in the National League, but if we don't, we've given it a really good shot this year. \"", "url": "https://www.bbc.co.uk/sport/football/articles/cpwdqxddj5go"}