{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-04-26 06:32:15", "date_modify": "2025-04-26 06:32:15", "date_publish": "2025-02-27 08:16:42", "description": "Success as players to success as coaches - Wigan assistants Sean O'Loughlin and Tommy Leuluai tell BBC Sport about their role in the club's success.", "filename": "sport_rugby-league_articles_c1enzy4lp6do_1745649135.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e706/live/5e1e90f0-f4ee-11ef-8c03-7dfdbeeb2526.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c1enzy4lp6do_1745649135.html", "title": "Wigan Warriors: Sean O'Loughlin and Tommy Leuluai on coach roles", "title_page": "Wigan Warriors: Sean O'Loughlin and Tommy Leuluai on coach roles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wigan Warriors.\nTitans of northern hemisphere rugby league in 2024, scooping up every trophy they could in an incredible quadruple-winning campaign.\nYet it says a lot about how much of a formidable, cohesive and well-oiled unit they are that no individual figure leaps out as being the reason for their all-conquering season.\nHead coach Matt Peet, with club legends Sean O'Loughlin and Tommy Leuluai by his side as his assistants, has transformed their fortunes in a short space of time.\nBut has the impact O'Loughlin and Leuluai made in Wigan's runaway success been unheralded among the many headlines written in the aftermath of last term?\nBBC Sport spoke to the pair about their coaching journey and attitudes towards success.\nWigan's transformation into world and domestic champions in 2024 began three years earlier when Peet arrived at the club, ready to take charge for the 2022 campaign.\nO'Loughlin had retired from playing at the end of a difficult 2020 season, which was played during Covid lockdowns and finished with an agonising defeat at the hands of rivals St Helens in a stunning Super League Grand Final finale behind closed doors in Hull.\nThat loss brought down the curtain on a 19-year career with Wigan, during which he reached eight Grand Finals, won 10 major trophies, captained England and played 11 times for Great Britain.\nAs one door closes, another opens.\nA pathway to coaching began the following year, which eventually led to O'Loughlin joining Peet's backroom staff 12 months before Leuluai.\n\"I got to find my feet a little bit, but as soon as you're in the deep end of having some ownership about something, it's a tough role to be in,\" O'Loughlin told BBC Sport.\n\"You learn on your feet and you learn as you go. You make mistakes and you try to get better at it.\"\nLeuluai, on the other hand, went right into the cut and thrust of coaching. Having retired at the end of 2022 - itself a positive campaign having won the Challenge Cup just months into Peet's tenure - he stepped in as assistant the following season.\n\"I was really new into it, I hadn't coached much before so I was quite fresh and learning on the run, really,\" Leuluai said.\n\"It's been quite successful for everyone at the club. The first couple of years were obviously successful, but for me it was just a massive learning experience.\"\nIn any professional sport, and particularly having experienced the kind of successful careers O'Loughlin and Leuluai had, it would be understandable if the pair saw the end of their playing days the natural point to try something new.\nThat never seemed like an option, however.\n\"As much as learning coaching is a completely different thing, I think with the rugby side of things, that is something me and Tommy have been involved in for a long time and we feel like we can add a lot to it,\" O'Loughlin offered.\n\"And other than that, I didn't know what else I wanted to do.\"\nO'Loughlin had dipped into coaching while he was still playing, passing on his knowledge to the club's academy during Peet's time as head of youth.\nLeuluai targeted a coaching career ahead of time, too.\nHe said: \"I always wanted to have a crack at coaching. I enjoyed, I suppose, the technical side of the game and breaking down a team. It's something that I've known for a long time.\n\"I played for like 20 years professionally, it would almost be silly just to not stay in and at least have a crack. I've been in the game for that long. I've learned so many lessons, I almost look at it like I am passing on all the stuff that I've learnt down to this new group of players.\n\"There were times in my career where I thought I could have a break from it and leave it. But the opportunity [to coach] came as soon as I finished playing and I just wanted to jump into it.\"\nIn the lead-up to the 2025 campaign, Wigan chief executive Kris Radlinski paid tribute to O'Loughlin and Leuluai's efforts in an interview with BBC Radio Manchester, saying they were part of a long line of \"legendary humble figures\".\nBut does being humble, keeping their head down and getting on with the job at hand mean their roles in Wigan's success are unfairly overlooked?\nFor Leuluai, he would rather not occupy the limelight for his part in what the club has achieved.\n\"I get a bit embarrassed that we must get talked about a lot [more] than other assistants would because we played before,\" he said.\n\"I sometimes get a bit cringe really when they speak about us as players and they don't really do it to other assistants just because we played so well. I would like less attention if I'm honest.\n\"When I think of unsung heroes, I look at people in our staff like [academy head coach] John Duffy and the role he's played in helping me as a coach.\"\nFor O'Loughlin, the change in success mindset from playing to coaching is clear.\n\"We've won stuff as players and we've experienced that and we enjoy watching the lads get that joy and fulfilment from winning trophies,\" O'Loughlin said.\n\"When we win the trophies, I don't feel like I need to get my hands on the trophies to celebrate it. I enjoy watching the lads get hold of the trophy and celebrate it. That's where I get my enjoyment from.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c1enzy4lp6do"}