{"authors": ["Nick Hope", "www.facebook.com"], "date_download": "2025-05-19 15:39:08", "date_modify": "2025-05-19 15:39:08", "date_publish": "2017-07-27 18:24:03", "description": "Three British swimmers miss out on medals by a combined 1.04 seconds on day five of the World Championships in Budapest.", "filename": "sport_swimming_40747376_1747669148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13FB0/production/_97104818_maxlitchfield_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_swimming_40747376_1747669148.html", "title": "World Swimming Championships: Litchfield, Scott & Davies miss out on medals", "title_page": "World Swimming Championships: Litchfield, Scott & Davies miss out on medals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three British swimmers missed out on medals by a combined 1.04 seconds on day five of the World Championships.\nMax Litchfield (200m individual medley), Duncan Scott (100m freestyle) and Georgia Davies (50m backstroke) were fourth, fifth and eighth in their respective events in Budapest, Hungary.\nCompatriot Ross Murdoch, meanwhile, set the third quickest time to qualify for Friday's 200m breaststroke final.\n\"That result has been three years in the making,\" he told BBC Radio 5 live.\nLitchfield, who was fourth in the 400m individual medley at the Rio 2016 Olympics, set a new Commonwealth record - one minute 56.46 seconds - en route to the 200m final in Budapest.\nHowever, the 22-year-old was left disappointed as he clocked 1:56.86 to narrowly miss out on a major medal for the second time in 12 months.\n\"I've mixed feelings as the 400m IM is my stronger event, but it's tough finishing fourth,\" he told BBC Sport.\nChase Kalisz (USA), Kosuke Hagino (Japan) and Shun Wang (China) claimed gold, silver and bronze respectively.\nScott, meanwhile, was fourth in the 200m freestyle earlier in the week and had hoped to challenge for a 100m medal.\n\"I'm hugely gutted I couldn't produce a best time today,\" he told BBC Sport.\n\"I feel like I've maybe taken a step back in this, whilst the 200m has moved on, but hopefully that's a good sign for the relay, where we have a very strong team.\"\nUSA's Caeleb Dressel took gold ahead of team-mate Nathan Adrian, with Frenchman Mehdy Metella claiming bronze.\nDavies was unable to lower the new British record of 27.49 she set during Wednesday's semi-finals, but confirmed herself as a qualifier for the Welsh Commonwealth squad for the 2018 Gold Coast Games.\nBrazil's Etiene Medeiros claimed victory in the 50m backstroke, with China's Yuanhui Fu second and Aliaksandra Herasimenia of Belarus third.", "url": "https://www.bbc.com/sport/swimming/40747376"}