{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:53:51", "date_modify": "2025-04-26 06:53:51", "date_publish": "2025-03-01 00:00:00", "description": "Follow 23 games from EFL League One and Two as Birmingham take on Wycombe and Wrexham play Bolton.", "filename": "sport_football_live_c3vp4e2w66wt_1745650431.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c3vp4e2w66wt_1745650431.html", "title": "EFL League One & Two LIVE: Follow 23 games including Birmingham v Wycombe", "title_page": "EFL League One & Two LIVE: Follow 23 games including Birmingham v Wycombe - live text & score updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "See you Tuesday\n#bbcefl\nQuite a day wasn't it...\nBirmingham City stretch their lead to 12 points at the top of League One, while Charlton Athletic score late in a dramatic 2-1 London derby win at Leyton Orient to move into the play-off places.\nWalsall's League Two implosion continued with their lead at the top, which was once 15 points, now down to four with Bradford City hot on their heels.\nWe'll do it all again on Tuesday shall we?\nBantams closing in on Saddlers\n#bbcefl\nVictory for Bradford and defeat for Walsall means the gap at the top is down to four points with Graham Alexander's Bantams very much in the title hunt.\nDoncaster are third after they beat Newport.\nNotts County move into fourth place as they drew and AFC Wimbledon lost.\nPort Vale also drew and Crewe stay seventh with a win at Chesterfield\nAt the bottom Carlisle beat Barrow on Thursday and are three points adrift, while Morecambe lost at Gillingham, who recorded their first win under John Coleman.\nTranmere's draw with Port Vale keeps their heads above water.\nLeague Two full-time round-up\n#bbcefl\nLeague leaders Walsall suffered a 1-0 defeat at home to Swindon, with a goal from Joel Cotterill decreasing the Saddlers' breathing room at the top of League Two to four points.\nDoncaster secured a 3-0 win against Newport, Robert Street's double and Luke Molyneux securing three points.\nAn 89th-minute equaliser rescued a point for Notts County, who led 1-0 before Fleetwood fought back to lead the game, and it was Alassana Jatta who fired in the leveller to make it 2-2.\nA late penalty kick dispatched by Jack Payne gave Colchester the win against MK Dons, and Crewe looked comfortable against Chesterfield as they won 3-1.\nHarrogate secured a vital three points against fellow relegation-threatened Accrington, goals from Jasper Moon and Josh March gave them a 2-1 win. Gillingham beat Morecambe 1-0 through a Robbie McKenzie goal.\nWimbledon now find themselves winless in three after suffering a 1-0 defeat to Bromley, the goal coming courtesy of Corey Whitely, while Cheltenham and Grimsby finished 1-1.\nIn the lunchtime kick-offs, 10-man Tranmere held Port Vale to a 1-1 draw, and Bradford snatched all three points against Salford in added time courtesy of Michael Mellon.\nThe League One table\n#bbcefl\nCharlton Athletic's dramatic turnaround at Leyton Orient moved them above their London play-off rivals into sixth, with the O's slipping to eighth after a third successive defeat.\nBirmingham City's lead at the top is now 12 points over Wycombe, who they beat 1-0 at lunchtime, while Wrexham stay in third after their goalless draw with Bolton, who drop to seventh.\nStockport have moved to within four points of the top two after a 2-1 win against Blackpool.\nAt the bottom, Cambridge picked up a vital win at fellow strugglers Crawley, while Burton's draw with Mansfield puts them within two points of Bristol Rovers in 20th after they lost 3-2 at home to Rotherham.\nLeague One full-time round-up\n#bbcefl\nBarnsley have made it three successive league wins but having been 4-1 up against Lincoln they were left hanging on to win 4-3.\nStevenage hit the bar in the last minute as Huddersfield came away from the Lamex Stadium with a 2-1 win.\nIcelandic striker Benony Andresson scored twice in the second half as Stockport came from behind to beat Blackpool 2-1.\nReading have kept alive their play-off hopes with Jayden Wareham and Tyler Bindon on target in a 2-1 win at Wigan, where Jason Kerr had given the home side the lead.\nBurton picked-up another point in their battle to avoid the drop as they drew 1-1 with Mansfield.\nSonny Cox grabbed an equaliser for Exeter in their 1-1 draw with Northampton, and a brace from Sam Nombe helped Rotherham to a 3-2 victory at Bristol Rovers.\n'Swindon worked their socks off'\nFT: Walsall 0-1 Swindon\nRoss Embleton\nFormer Swindon Town assistant on BBC Wiltshire\nTo a man Swindon have absolutely worked their socks off.\nThey defended their box really well and worked well off the ball.\nThey should be celebrating after the work they put in today.\nWhat I saw was a personality, energy and maturity to work off the ball.\nI saw the team being really difficult to play against.\nFULL-TIME\nPeterborough 3-1 Shrewsbury\nThe dismissal of Shrewsbury skipper John Marquis after only 13 seconds gave the visitors too much to do, although they did everything they could to claim at least a point.\nThe red card for Marquis was followed swiftly by Tayo Edun scoring straight from a corner for the home side, before the Shrews levelled through Malvind Benning's penalty kick.\nMalik Mothersille restored Peterborough's advantage before the break but after Abraham Odoh had a shot cleared off the line Darren Ferguson's side were left hanging on towards the end.\nJed Steer superbly denied Jordan Shipley before his opposite number Jamal Blackman saved from Ricky Jade-Jones.\nVadaine Oliver sent two headers off target in the 10 minutes of time added on, but they couldn't find the leveller and Chris Conn-Clarke added a third for Peterborough with virtually the last kick of the game.\nFULL-TIME\nLeyton Orient 1-2 Charlton\nWhat. An. Ending.\nJordan Brown struck a sublime opener for Leyton Orient but two goals in stoppage time from Macauley Gillesphey and Kayne Ramsay have given Charlton a dramatic victory.\nA fantastic game of football with a fitting finale. Gut-wrenching for the O's, delirium for the Addicks.\nThat drive back to south London through the Blackwall Tunnel is going to feel all that sweeter after the manner of this victory.\nFULL-TIME\nWalsall 0-1 Swindon\nSwindon have taken all three points at the Bescot Stadium!\nA goal from Joel Cotterill proves to be enough to give Ian Holloway's side a valuable win.\nFor the Saddlers, their lead at the top of League Two is cut down to four points after Bradford City's win earlier today.\nGOAL: Leyton Orient 1-2 Charlton\nKayne Ramsay (90+7 mins)\nUnbelievable!!! Charlton have won it right at the end!!!\nIt's an identical goal to the equaliser... A corner comes in from the left, Orient keeper Josh Keeley completely misses it and Kayne Ramsay is there to head home at the back post.\nAbsolute bedlam in the away end. A huge, huge goal in the play-off race.", "url": "https://www.bbc.co.uk/sport/football/live/c3vp4e2w66wt"}