{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-05-20 11:58:24", "date_modify": "2025-05-20 11:58:24", "date_publish": "2023-06-10 22:26:36", "description": "Ellie Scotney becomes IBF super-bantamweight champion in just her seventh professional fight, while fellow Britons Sunny Edwards and Nina Hughes defend their world titles.", "filename": "sport_boxing_65854807_1747742304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B455/production/_130056164_081a2928.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_65854807_1747742304.html", "title": "British trio Ellie Scotney, Sunny Edwards & Nina Hughes win world title fights", "title_page": "British trio Ellie Scotney, Sunny Edwards & Nina Hughes win world title fights - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ellie Scotney put in a slick performance against Cherneka Johnson to win the IBF super-bantamweight title in just her seventh professional fight.\nThe 25-year-old dominated the majority of the rounds on the way to a unanimous decision victory.\nIn a world-title triple-header at Wembley's OVO Arena, the night ended with three British world champions.\nIBF flyweight champion Sunny Edwards showcased his fine boxing skills to outpoint Andres Campos in the main event.\nEarlier, Nina Hughes retained her WBA bantamweight title with a unanimous decision win over Briton Katie Healy.\nDespite her dominant victory, Catford fighter Scotney, 25, described it as \"one of my worst performances\".\nSpeaking to BBC Radio 5 Live, she added: \"But I'm world champion so it's the start of a big journey.\n\"I'm going home with my mum, putting my feet up in my pyjamas and watching the rest of the boxing.\"\nA card featuring three world championship fights would typically be held at a larger arena, perhaps even a stadium, but a sparse crowd of just 4,000 fans were in attendance.\nPopular Romford heavyweight Johnny Fisher, who beat Emilio Salas on the undercard, sold more than a quarter of those tickets.\nNew Zealand-born Johnson, 28, made an eye-catching entrance accompanied by half a dozen men performing the haka.\nWith Johnson's high guard, Scotney impressed with shots to the body in the opening rounds, landing hurtful hooks to the temple and a thudding right hand towards the end of the third.\nAll six of Scotney's pro fights had gone the distance, but what she lacked in finishing power she made up with terrific movement.\nLight on her feet, Scotney continued to outwork her opponent. But Johnson was also landing cleanly at times, a reminder of the danger she posed.\nThe away fighter may have edged the fifth through work-rate but was badly cut above the right eye in the following round after an accidental clash of heads.\nSensing she was behind the cards, Johnson started to take more risks in the final rounds, opening up opportunities for Scotney - who was also marked up - to land.\nThe crowd were on their feet as the clapper signalled the final 10 seconds, testament to the efforts of both women.\nThe judges' scorecards read 98-92, 98-92 and 97-93.\nScotney's shot at the title was due to take place three weeks ago. The Briton was removed from Katie Taylor's Dublin card, but the wait proved to be worth it.\nFighting under a new promoter and broadcaster, undefeated Edwards took his opportunity to win a 20th consecutive contest, with all three judges scoring it 117-111 to the champion.\n'Showtime' lived up to his alias, showboating within seconds. Each time Campos missed, Edwards mockingly looking in the direction of the punch thrown.\nCampos, 26, may have edged the opening round before it became an Edwards masterclass.\nNonchalantly evading punches, connecting with quick counters and even faster hands, Edwards began to show why many see him as Britain's most technically gifted boxer.\nEach time Campos, bidding to become Chile's first world champion, trapped Edwards against the ropes, the Croydon fighter unleashed stinging uppercuts.\n\"He ain't hitting me now,\" Edwards told his corner at the end of the fourth.\nHe has been slightly guilty of complacency in the past when things get comfortable, and a lack of concentration allowed Campos to land a strong body shot making Edwards wince in the sixth.\nHe began to tire in the second half of the fight and the rounds were becoming closer than they perhaps needed to be, with Campos landing combinations to head and body.\nEdwards found a second wind - or maybe switched back on - in the championships rounds, dancing rings around his opponent who continued to come forward.\nThe champion insisted he needed to not only win, but to win convincingly. He did just that, and next on his agenda is a unification fight with American WBO champion Jesse 'Bam' Rodriguez.\n\"Bam Rodriguez - where are you?\" he said. \"I was waiting. Sign the contract. Eddie [Hearn] said sign the contract.\"\nPromoter Hearn guaranteed a unification fight could be next, while Mexico's Julio Cesar Martinez - who holds the WBC belt - is also an option.\nUnusually for a world championship fight, Healy and Hughes walked to the ring just after 19:00 BST in the first fight of the TV broadcast, with the arena about a third full.\nIn her six previous bouts, Healy had only ever faced opponents with losing records, and the gulf in class was clear from the first bell.\nHughes took the centre of the ring, found her range and landed combinations with ease.\nThe 41-year-old - who upset the odds to beat Jamie Mitchell for the title in November - was effective with the overhand right, particularly in the sixth round as Healy's legs stiffened.\nHealy got her shot after an injury ruled out Briton Shannon Courtenay. \"Do you want to win a world title? Then start punching,\" her corner screamed.\nThe Walsall fighter had pockets of success when Hughes took a breather in the seventh, but it was a dominant performance from the champion as two judges scored it 100-90 and the other 99-91.\nHughes called out Australia's IBF champion Ebanie Bridges, who was ringside, for a unification fight.\n\"That's the fight I want next,\" she told DAZN. \"She's got a belt that I want, and I've got a belt I think she wants.\"", "url": "https://www.bbc.com/sport/boxing/65854807"}