{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:02", "date_modify": "2025-05-21 05:56:02", "date_publish": "2025-02-08 18:30:56", "description": "All six Super League sides in action record away victories in the fourth round of the Challenge Cup.", "filename": "sport_rugby-league_articles_ce8yj3k3lego_1747806962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a566/live/97d42bc0-e63e-11ef-abf5-19b142cf30ba.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_ce8yj3k3lego_1747806962.html", "title": "Challenge Cup: Leeds, St Helens, Hull FC, Warrington, Wakefield, Catalans all win", "title_page": "Challenge Cup: Leeds, St Helens, Hull FC, Warrington, Wakefield, Catalans all win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was a clean sweep of Super League sides through as all six in action on Saturday progressed to the fourth round of the Challenge Cup.\nLast year's runners-up Warrington Wolves won 44-4 at League 1 Whitehaven while Catalans Dragons claimed a hard-fought 14-0 success at Championship side Halifax Panthers.\nWakefield Trinity beat League 1 newcomers Goole Vikings 82-0, while Leeds Rhinos, St Helens and Hull FC all beat amateur opponents.\nLeeds defeated West Warriors 92-0, Saints won 38-0 at West Hull while Hull FC were 52-6 winners at York Acorn.\nCatalans were involved in the hardest game as they were pushed all the way by Halifax at The Shay.\nThere were no points in the first half and it was a penalty goal from Arthur Mourgue that put them ahead.\nFouad Yaha grabbed the opening try in the 64th minute but it was not until the 78th minute that Cesar Rouge's score sealed a hard-fought win for the French side.\nAs the French side toiled, Leeds were the biggest winners of the day as they ran in 16 tries against Wests Warriors.\nThe match with the London-based amateurs was switched to AMT Headingley and it was one-way traffic.\nRyan Hall grabbed a hat-trick on his second Rhinos debut following his move from Hull KR, which was matched by Sam Lisone.\nJack Sinfield, son of rugby league great Kevin, and Morgan Gannon crossed twice each while there were further tries from Riley Lumb, Jake Connor, Cameron Smith, Matt Frawley, Alfie Edgell and Tom Holroyd.\nWarrington emerged victorious from their trip to Cumbria as they began their bid to go one better in the competition than 2024 when they lost to Wigan Warriors at Wembley.\nHooker Danny Walker, with two tries, and one each from new half-back Oli Leyland and Jake Thewlis had them 22-0 up at the break.\nLeyland and Thewlis added further tries after half-time with two more from wing Cai Taylor-Wray. Jay Weatherill scored a consolation try for Whitehaven.\nIn a game played at Sewell Group Craven Park, home of Hull KR, St Helens scored seven unanswered tries in beating West Hull.\nTwo from Jon Bennison, plus tries from George Whitby, Harry Robertson and Matt Whitley had things sewn up by the break.\nSaints eased up in the second half against the amateurs, with only a debut try from new stand-off Tristan Sailor and one from Lewis Murphy.\nThe remaining seven third-round ties take place on Sunday, headlined by Bradford Bulls entertaining Castleford Tigers, in Brian Noble's first game back as Bulls head coach.\nThat match is live on the BBC Sport website (13:00 GMT), while Salford Red Devils and Huddersfield Giants are the other Super League sides in action, along with the four matches not involving the top-flight sides.", "url": "https://www.bbc.com/sport/rugby-league/articles/ce8yj3k3lego"}