{"authors": ["Emma Smith & Neil Johnston & Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:21:22", "date_modify": "2025-05-20 12:21:22", "date_publish": "2023-08-04 06:00:07", "description": "The Women's World Cup has served up plenty of upsets, some shock early exits and a number of thrilling matches - but which 'bigger' nations have impressed so far?", "filename": "sport_football_66381041_1747743682.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D6BD/production/_130637945_bbc-sport-index-imagery-3-split-images-gradient-6f349e95-7a63-49d3-aeac-6ca335a8e4e5.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66381041_1747743682.html", "title": "Women's World Cup: Which of the 'bigger' nations have impressed?", "title_page": "Women's World Cup: Which of the 'bigger' nations have impressed? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Women's World Cup has served up plenty of upsets, some shock early exits and a number of thrilling matches in Australia and New Zealand.\nThree of the world's top 10 are out after the group stages, including two-time champions Germany, who failed to qualify for the last 16 for the first time in their history.\nIt means the tournament is wide open with several teams starting to impose themselves. But which of the 'bigger' nations have impressed so far?\nJapan are blowing teams away and have arguably been the standout team of the tournament so far, having scored more goals than anyone else, while they have yet to concede in 270 minutes.\nIn Hinata Miyazawa, who has four goals in two starts, they possess the tournament's joint-leading scorer but the talent runs deep in this squad, which includes eight players aged 23 or under.\nBoss Futoshi Ikeda started 17 players in the three group games with only goalkeeper Ayaka Yamashita, captain Saki Kumagai, defender Moeka Minami and full-back Risa Shimizu starting all three games.\nThey were a joy to watch in the 4-0 demolition of Spain despite having only five attempts on goal. It was a masterclass in precision finishing as they scored three goals from their first three touches in the box.\nNext for the Nadeshiko are Norway in what will be a battle between two former world champions.\nMeanwhile, one of the biggest surprises of this tournament has been to see the USA, so dominant and powerful over the years, splutter and stumble in the group stage.\nIt is a very different squad to the one that conquered the world in 2015 and 2019. Fourteen of the 23-player squad are at a World Cup for the first time - and it shows.\nBut it is not just the debutants who are struggling to deliver - World Cup veteran Alex Morgan has yet to really impress while Megan Rapinoe has had to be content with the odd substitute appearance.\nThe United States survived an almighty scare against debutants Portugal before scraping into the last 16, and a showdown with Sweden in Melbourne.\nPortugal substitute Ana Capeta hit a first-time shot past Alyssa Naeher in the 91st minute but the ball hit the post.\nThe number one team in the world were inches away from going out, prompting criticism from Carli Lloyd, who helped the USA win back-to-back World Cups in 2015 and 2019.\nThe USA have lacked the form required to win an unprecedented third World Cup in a row - but one thing you never do is write them off.\nWhile Japan have raised eyebrows, European champions England produced arguably the most impressive performance of the group stages in their 6-1 thrashing of China.\nLauren James, 21, has been the star of the show, scoring three goals and providing three assists in two starts at her debut World Cup.\nShe spearheaded England's slick display in Adelaide as Sarina Wiegman's side shrugged off suggestions they would struggle following an injury to instrumental midfielder Keira Walsh.\nGermany's early exit has opened up England's side of the draw and they may not have to face a side ranked inside the top 10 until the semi-finals, should they get that far.\nThe Lionesses had underwhelmed in wins over Haiti and Denmark but comfortably progressed to the last 16 in the end and have now sent a message to their challengers that they mean business in Australia.\nSpain, whose off-field issues have been well documented, were able to put those distractions behind them to record comfortable wins over Costa Rica and Zambia, qualifying with a game to spare.\nBut the defeat by Japan has brought them down to earth. Despite dominating possession, they were open at the back and were picked off constantly by the clinical Japanese.\nIt raises further questions about their off-field harmony, given that 15 players previously refused to play for the team in protest of manager Jorge Vilda's coaching methods (three of those players have since returned to the squad for this tournament).\nHowever, Spain could have a favourable draw, facing Switzerland in the last 16, followed by the Netherlands or South Africa in the quarter-finals.\nElsewhere Sweden, ranked third in the world, had perhaps the smoothest passage through the group stages of any pre-tournament favourites, winning all three games and scoring nine goals in the process.\nThey did leave it late to beat South Africa in their opener, but showed their danger from set-pieces in thrashing Italy 5-0 before seeing off Argentina to seal top spot in Group G.\nFacing world champions the USA in the last 16 should hold no fear - they beat the Americans 3-0 at the 2020 Olympics.\nMeanwhile after a false start in their goalless draw with Jamaica, France look to be a growing threat in Australia and New Zealand.\nThey outfought Brazil in a crucial win in Brisbane, before sharing nine goals with Panama in a remarkable game which confirmed first place in Group F.\nConceding three goals to Panama does raise some concerns about their defensive stability - although centre-back and captain Wendie Renard was rested for that match - and their squad depth, with manager Herve Renard criticising his players for losing concentration.\nBut having seen plenty of the world's biggest teams struggle at this World Cup, France will be relieved they were able to progress with relative ease.", "url": "https://www.bbc.com/sport/football/66381041"}