{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:39:12", "date_modify": "2025-05-21 03:39:12", "date_publish": "2025-04-08 00:00:00", "description": "Runaway League One leaders Birmingham City beat Peterborough United to seal the club’s promotion back to the Championship at the first attempt.", "filename": "sport_football_live_cx2w7nnq0q3t_1747798752.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6693/live/e66428a0-14c2-11f0-a455-cf1d5f751d2f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2w7nnq0q3t_1747798752.html", "title": "Peterborough United 1-2 Birmingham City: League One leaders seal promotion", "title_page": "Peterborough United 1-2 Birmingham City: League One leaders seal promotion - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Runaway League One leaders Birmingham City sealed promotion back to the Championship at the first attempt with six games to spare thanks to victory at Peterborough.\nPosh's Kwame Poku put the party on hold when he equalised three minutes after Alfie May had put the visitors ahead.\nBut Taylor Gardner-Hickman restored Blues' lead eight minutes before the interval with what turned out to be the winner.\nBig-spending City, relegated last season, are 14 points clear of second-placed Wrexham and now cannot be caught by third-placed Wycombe, despite the Chairboys' win at Huddersfield.\nThey have led the table for most of the campaign - boss Chris Davies' first season in management - and have achieved their expected promotion at a canter.\nWith the travelling fans in celebratory mood, May opened the scoring by heading in Gardner-Hickman's excellent ball in from the left.\nPoku then thumped Posh level from near the edge of the penalty area after Birmingham could only half-clear a corner.\nBut Gardner-Hickman sealed the win and promotion by firing under keeper Nicholas Bilokapic from the left side of the box after collecting Marc Leonard's pass.\nBirmingham have only spent five seasons in English football's third tier in their history.\nJust as they did the last time they won promotion from that level, under Barry Fry 30 years ago, they have done it at the first time of asking.\nIt was somehow fitting that Fry, who turned 80 on Monday, was there to see them do it, as Peterborough's long-serving director of football.\nFry achieved a league and cup double in 1995. And Blues will start as favourites to emulate that feat on Sunday when they will face Posh again - this time at Wembley in the final of the EFL Trophy.\nBirmingham City manager Chris Davies to BBC Radio WM:\n\"A special night - obviously it means the world to see the fans celebrate, it really is something special.\n\"I have said previously how the club has suffered a lot, particularly in the last couple of years.\n\"It is about creating memories, bringing them some joy and making them proud of their club and I think we have done that this season, so for me it means the world.\n\"I thought we maintained a good level throughout the game, I thought the subs that came on kept us at that good level and I thought we finished it well.\n\"I have had a lot of ups and downs in football - to come to a club like this and do this is obviously the pinnacle of my career so far.\"", "url": "https://www.bbc.com/sport/football/live/cx2w7nnq0q3t"}