{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 12:14:03", "date_modify": "2025-05-20 12:14:03", "date_publish": "2023-08-04 16:43:46", "description": "Azhar Ali's 78 leads Worcestershire to a four-wicket win over Glamorgan, chasing just 200 despite a brilliant 82 from Ben Kellaway", "filename": "sport_cricket_66384500_1747743243.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1374F/production/_130659697_gettyimages-1569380685.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66384500_1747743243.html", "title": "One Day Cup: Azhar Ali leads Worcestershire to win against Glamorgan", "title_page": "One Day Cup: Azhar Ali leads Worcestershire to win against Glamorgan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Worcestershire eased to a four-wicket win over Glamorgan as Azhar Ali's classy 78 helped them to a modest target of 200 despite a late stumble.\nAzhar and Rob Jones (37) broke the back of the chase putting on 100 for the second wicket.\nKiran Carlson's 4-48 made the final margin more respectable.\nBen Kellaway's brilliant 82 on One Day Cup debut was the only major contribution to Glamorgan's 199 all out.\nKellaway, Alex Horton and Ben Morris made a trio of 19-year-old competition debutants fielded by Glamorgan, who chose to rest experienced pair Sam Northeast and Timm van der Gugten.\nThey were put in under cloudy skies and with the ball moving around, they slipped from 36-0 to 72-4 as Eddie Byrom fell for 25 and key batter Colin Ingram was run out at the non-striker's end, Ben Gibbon's boot deflecting a straight drive.\nThe Rapids were only temporarily held up as Kellaway and Carlson put together a stand of 65 in 12 overs, with Kellaway happy to hit over the top in confident style as he reached his half-century off just 48 balls.\nBut the Glamorgan skipper holed out at long-on off Brett D'Oliveira to start a collapse of four for 15 as spinners Josh Baker and D'Oliveira worked their way through the lower order.\nKellaway, forced to mature fast, had to farm the strike and managed to conjure 47 runs from the last two wickets before he lofted D'Oliveira to deep mid-wicket after a valiant innings.\nD'Oliveira made 22 before Harry Podmore had him caught behind by newcomer Alex Horton, but Azhar and Jones knocked the ball around in unhurried fashion at nearly five runs an over.\nThey had the home side well on course to victory before Jones was brilliantly caught at mid-on by a leaping Tom Bevan off Carlson's off-spin.\nAzhar also fell as he tried to accelerate, neatly stumped down leg-side by England Under-19 player Horton off Carlson, and what looked like a stroll in the park suddenly went wrong as Kashif Ali, Ben Cox and Matthew Waite fell cheaply.\nThe collapse came just too late to inconvenience Worcestershire seriously as captain Jake Libby (24 not out) saw them home in the 42nd over.\nThe two wins already match their total from 2022 to bring some optimism after a string of departures from the county for 2024.\nMeanwhile, Glamorgan could take some solace from Kellaway's performance in a troubled period for the club, as David Lloyd went on loan to Derbyshire and Andrew Salter's retirement was announced, while Mark Alleyne's coaching duties were switched to Welsh Fire and David Harrison was reinstated in charge of the 50 overs campaign at short notice.\nWorcestershire's Azhar Ali told BBC Hereford and Worcester:\n\"It was quite a tough wicket and our bowlers contained the opposition to 200, which was 30 to 40 runs below par so we knew that if we had wickets in hand we could chase that quite easily.\n\"Seeing off the new ball, there was a bit of nip off the wicket so I think everyone deserves credit for the way they went about the game today. We assessed conditions really well with the ball and the bat.\n\"We were very confident at halfway but 200 runs still needed to be chased, so starting well was very important because otherwise you'll put yourselves under pressure.\n\"We started slowly but we wanted to make sure sure we had wickets in hand and to minimise the damage with the new ball so we could start building our run-rate later.\"\nGlamorgan's Ben Kellaway told BBC Sport Wales:\n\"It couldn't have gone any better (with the bat), I really enjoyed getting out there for the first time and the boys in the changing-room really supported me and told me to play my game, so there aren't many better feelings on a day I won't forget.\n\"Having made my debut in the T20 Blast made for a smoother transition into the first-team environment and it was nice to contribute to the team today.\"\nGlamorgan coach David Harrison told BBC Sport Wales:\n\"Ben played unbelievably well on (ODC) debut, there were no nerves.\n(On resting players) \"Some of these guys have played a lot of cricket and we've got three big four-day games, so they'll come back in at some stage during the tournament but it gives opportunities to other players.\n\"(Being head coach) was a bit last minute, I wasn't expecting it with Mark (Alleyne) coming in but it's another great opportunity for me personally, and though today didn't go to plan we've got seven important games coming up.\"", "url": "https://www.bbc.com/sport/cricket/66384500"}