{"authors": ["Ben Dirs", "www.facebook.com"], "date_download": "2025-05-19 15:12:14", "date_modify": "2025-05-19 15:12:14", "date_publish": "2015-02-01 10:53:39", "description": "England crumble to a 112-run tri-series final defeat in Perth, their last competitive match before the World Cup.", "filename": "sport_cricket_31080129_1747667534.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80706000/jpg/_80706769_johnson.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_cricket_31080129_1747667534.html", "title": "Australia v England: Glenn Maxwell helps hosts win tri-series", "title_page": "Australia v England: Glenn Maxwell helps hosts win tri-series - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England were thrashed in their last competitive match before the World Cup, crumbling to a 112-run defeat in the tri-series final in Perth.\nGlenn Maxwell starred with bat and ball for the hosts, scoring 95 and taking 4-46, and Mitchell Johnson took 3-27 on his international return.\nEngland had Australia 60-4 but the hosts recovered to post 278-8.\nJohnson swept through England's top order and Maxwell's off-spinners did the rest as England were 166 all out.\nEngland have now lost 13 of their last 15 one-day internationals against Australia in Australia and have only two warm-up games before they face them again in their World Cup opener on 14 February.\nCaptain Eoin Morgan still has several puzzles to solve, not least his own patchy form with the bat - the left-hander made 121 in the tri-series opener in Sydney but has posted scores of 0, 2 and 0 since.\nThe hosts were 0-1 after James Anderson dismissed Aaron Finch with the third ball of the innings and David Warner followed in the seventh over, deflecting a lifting ball from Anderson to point.\nStuart Broad did for George Bailey, the under-pressure Tasmanian fending a short ball to short-leg to leave Australia tottering on 46-3.\nIn-form Steve Smith batted confidently for his 40 but was stumped by Jos Buttler at the second attempt after coming down the pitch to Moeen Ali.\nBut Maxwell and Mitchell Marsh put on 141 for the fifth wicket, the former demonstrating his full array of strokes and bringing up his ninth one-day international fifty with a reverse pull for four.\nMaxwell hit four boundaries in one Chris Woakes over before falling to Broad in the next, while Marsh was run out for 60 soon after.\nJames Faulkner hit four sixes - including three in one Woakes over - to race to an unbeaten, 24-ball fifty and transform what would have been a below-par total into a testing target.\nAnderson was again the pick of England's bowlers with 2-38 while Woakes's bowling figures of 0-89 from 10 overs were the fourth worst for England in ODI history.\nEngland's openers made a confident start before Ian Bell nicked a fine delivery from Josh Hazlewood and wicketkeeper Brad Haddin snaffled a brilliant one-handed catch.\nEnter Johnson, who took 37 wickets in Australia's Ashes whitewash of England last winter but had played no international cricket in 2015.\nJames Taylor never looked settled before skewing Johnson to gully, where Maxwell took an excellent catch diving low to his left.\nAnd when Moeen fended a wicked Johnson bouncer to second slip and Morgan shouldered arms to a straight delivery next ball, England were in disarray on 46-4.\nFaulkner picked up his 50th ODI wicket when he had Joe Root lbw with his first delivery, but the Tasmanian all-rounder was forced to leave the field soon after with a side injury.\nButtler looked in fine form before reverse-sweeping off-spinner Maxwell to substitute fielder Pat Cummings and Woakes was gone next ball, offering up a simple caught and bowled.\nBroad played some big shots before holing out to deep mid-wicket, Ravi Bopara became Maxwell's fourth victim when he holed out to extra-cover and Hazlewood bowled Steve Finn to wrap up the win.", "url": "https://www.bbc.com/sport/cricket/31080129"}