{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:00:36", "date_modify": "2025-05-20 15:00:36", "date_publish": "2023-07-27 12:35:53", "description": "Essex complete a six-wicket victory over Hampshire to maintain their County Championship title challenge.", "filename": "sport_cricket_66323874_1747753236.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14AE1/production/_130550748_gettyimages-1573927174.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66323874_1747753236.html", "title": "County Championship: Essex wrap up six-wicket win over Hampshire", "title_page": "County Championship: Essex wrap up six-wicket win over Hampshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie Porter claimed the third 10-wicket haul of his career as Essex boosted their County Championship title hopes while destroying Hampshire's chances.\nPaceman Porter followed up his first-innings 5-37 by snaring 5-46 in the second innings totalling up to match figures of 10-83.\nIt was his first 10-for away from the Cloud County Ground, first since 2018, and in his renaissance season now has a Division One leading 47 wickets this season.\nChasing 83 to win, Kyle Abbott claimed 3-23 but Nick Browne's 28 and Paul Walter's 28 not out took Essex to their sixth win of the season with a six-wicket victory.\nHampshire's gamble to ask for a result pitch backfired as the usual Ageas Bowl seam-friendly pitch which flattens out never flattened out.\nThat meant almost incessant seam movement, coupled with invariable bounce, made batting tricky - typified by Nick Gubbins' 45 being the highest individual score of the game and only 506 runs coming in total across the four innings.\nHampshire and Essex both knew going into the match that only the winner would realistically be able to challenge Surrey for the title.\nSurrey will land on at least 167 points - and more likely 183 - after the conclusion of their game with Somerset. Essex are now up to 166 points and Hampshire on 135, with 72 points still available.\nHampshire lost their remaining four wickets for nine runs in 25 balls - with Porter and Sam Cook sharing the scalps.\nJames Fuller's back foot waft was caught behind to the ninth ball of the day before Abbott last four balls before he was brilliantly caught by a one-handed Simon Harmer pounce at second slip.\nPorter added Hampshire to Somerset and Worcestershire in his 10-for victims when John Turner drove to Harmer.\nAmongst the churn of batters, Nick Gubbins was still there having only moved his overnight total from 44 to 45. In seeing genuine number 11 Mohammad Abbas arrive at the crease he aborted his patient style and was bowled attempted to slog across the line. Hampshire bowled out for 131.\nEssex had lost three wickets in their chase of 30 against Kent last week, albeit rushed by incoming rain. They threatened a similar wobble at the Ageas Bowl.\nAbbott picked up Alastair Cook nicking behind a drive to the 10th ball of the innings before Tom Westley - the division's second-highest run scorer - clipped to mid-wicket in the fourth over.\nBut Hampshire's early jubilation was drowned by Browne grafting with Walter - the pair chalking off 33 runs for the third wicket.\nBrowne was put down at mid off by Liam Dawson before eventually falling lbw to Abbas but the damage he had made through his four boundaries was already fatal to Hampshire's chances.\nMatt Critchley had the top of his off stump kissed by a beautiful Abbott in-ducker and Michael Pepper was softly dropped at square leg second ball with 29 still needed.\nBut Pepper and Walter guided Essex to victory in the extra half an hour before lunch.\nHampshire captain James Vince:\n\"The pitch didn't play quite how we wanted it to or expected it to but it was the same for both teams. The 50-run margin in the first innings was a big amount of runs on that wicket and hard to overturn.\n\"You needed a bit of luck on a pitch that was seaming around a bit but, in the end, they coped with conditions better than we did.\n\"As the scores suggest it was tough for batting. It calmed down a traction with the older ball but, even when you felt you had faced a few balls, you couldn't quite trust it. There was always a ball there to get you out.\n\"It is going to be extremely tough to get where we want to be, but not impossible. But I guess it has now been taken out of our control. We are going to be relying on other teams to slip up and for us to step up and beat teams above us.\nEssex head coach Anthony McGrath:\n\"This has to be up there with one of our best wins. Doug Bracewell went down overnight before the first day, Robin Das still had his neck and then Shane Snater went down on a wicket when you needed all the seam available.\n\"To play with 10 men from pretty much straight away and come away on the right side is an incredible effort. Anything over 120 would have been really tough on there.\n\"We also had two guys go down over night with sickness, Walter and Critchley, so we really were down to bare bones so I'm proud of the guys.\n\"Jamie Porter worked really hard in the winter and has come into the season for the first time for the first time fit and in rhythm. When he is fit and bowling in full rhythm he is really hard to keep out especially with the seaming ball.\"", "url": "https://www.bbc.com/sport/cricket/66323874"}