{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:30", "date_modify": "2025-05-21 06:01:30", "date_publish": "2025-04-01 22:57:57", "description": "Wolves 1-0 West Ham: Vitor Pereira reacts to win", "filename": "sport_football_articles_c87p0vdx4vgo_1747807290.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/feb5/live/8971f020-0f3e-11f0-801a-296f2b6075c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87p0vdx4vgo_1747807290.html", "title": "Wolves 1-0 West Ham: Vitor Pereira reacts to win", "title_page": "Wolves 1-0 West Ham: Vitor Pereira reacts to win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves boss Vitor Pereira, speaking to BBC MOTD on win: \"With merit. We deserve this result because we play 45 minutes with high quality. The result at half time must be 2-0 in my opinion. Second half we start to think about the result, they start to put more players on the pitch with different qualities to try to explore the crosses.\n\"In the end, after 80 minutes, we had to think about result and to get the three points. The team, we have true spirit as we showed today. In the moment we can play very good game with quality, but in other moments, especially this moment, we need to suffer together. We help each other and I feel this in my team.\"\nOn Jorgen Strand Larsen stepping up in Matheus Cunha absence: \"You know why? Because we are a team. Matheus is part of team, and for sure with his quality he will help us. But, we are a team and we have very good players.\"\nOn Joao Gomes new contract being important: \"I think so. He is young, has talent and has spirit I like.\"\nOn if gap to bottom three feels like enough: \" No. The target is in our idea, we must play every game to get three points, to compete. If in the end we might not win but we need to feel proud of ourselves and make supporters proud because they are fantastic - this connection between us and the supporters.\"\nOn his connection with fans: \"I'm very simple person. I feel like I belong to the family.\"\nOn receiving yellow card and trying to keep calm: \"[I was] speaking with myself, speaking inside of me, taking care because I cannot keep going like this. I need to be focussed to help my team.\"", "url": "https://www.bbc.com/sport/football/articles/c87p0vdx4vgo"}