{"authors": ["Andrew Aloia", "Angela Rafferty", "www.facebook.com"], "date_download": "2025-05-21 04:54:28", "date_modify": "2025-05-21 04:54:28", "date_publish": "2025-04-04 15:05:14", "description": "Nat Panagarry admits she had doubts about continuing her career before going on to captain Loughborough to back-to-back Netball Super League titles.", "filename": "sport_netball_articles_c985lpwdkgeo_1747803268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c52a/live/be09fda0-115a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_netball_articles_c985lpwdkgeo_1747803268.html", "title": "Nat Panagarry: How Loughborough Lightning captain turned career doubts into back-to-back NSL titles", "title_page": "Nat Panagarry: How Loughborough Lightning captain turned career doubts into back-to-back NSL titles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nat Panagarry admits she had doubts about continuing her career before going on to captain Loughborough Lightning to back-to-back Netball Super League (NSL) titles.\nWhen Panagarry's wife Katie was diagnosed with cancer in 2022, the 34-year-old focused her energy and attention on supporting her.\n\"I wasn't sure if I was going to be able to play again, went really insular, shut the doors and wanted to deal with this ourselves,\" Panagarray told BBC East Midlands Today.\nWhat Panagarry found, however, was that returning to play ensured she was better equipped to support Katie.\nThe decorated centre previously said Loughborough's title charge in 2023 helped her negotiate the \"dark stages\".\nPanagarry says the battle endured by Katie, who is now cancer free but continues to undergo regular checks and scans, has them appreciating life more than ever.\n\"We are closer than ever, living every day and not taking it for granted,\" Panagarry said.\nIt is a feeling that extends to her playing career.\n\"You don't realise you are taking it for granted,\" she said.\n\"But when it actually stopped and I thought maybe I wouldn't be able to do this now or maybe I won't be able to get to Loughborough as much because I live in Leeds and I might have to be there more, the thought of losing it actually made me realise how grateful I am for it.\"\nAnd it was also a realisation that has changed Panagarry as a player.\n\"It has made me more relaxed, and I think maybe I am a highly strung person,\" she said.\n\"Every season, every pre-season and test I weirdly kind of enjoy because this was nearly something that got taken away from me and something I realised I needed more than ever to be the best version of myself I could be.\"\nPre-season at Loughborough this year was spent getting Lightning ready to try to become the first team to win three consecutive NSL titles.\nTheir back-to-back successes and three titles in four years has already distinguished Lightning as one of the most dominant sides in the competition's history.\n\"For us it goes back to zero and the process starts again,\" she said.\n\"Everyone is hunting you down and everyone wants that trophy and we like that. We have been in that position before.\n\"We like thinking that every time we step on the court you think you are going to win, you want to perform well, you want to get top four. We talk about it, we don't hide from it and that is something I love about the club and the culture.\n\"Each year we want to be in that grand final with a chance to win that trophy.\"\nTwo wins in their first three games this season has Loughborough third in the table ahead of their first East Midlands derby meeting with competition newcomers Nottingham Forest on Saturday at their Motorpoint Arena home.\n\"I'm excited and I think it will be a physical battle out there,\" Panagarry said.\n\"Nottingham is an amazing place, we had our opening weekend there a few years ago and I absolutely love that arena. It is one of those where you feel closer to the fans and you can feel the energy and the noise.\"", "url": "https://www.bbc.com/sport/netball/articles/c985lpwdkgeo"}