{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:01:29", "date_modify": "2025-05-21 04:01:29", "date_publish": "2025-01-15 09:52:46", "description": "Former Dragons captain Rynard Landman is banned from rugby for three years after failing a drugs test.", "filename": "sport_rugby-union_articles_c87d88l4x8xo_1747800089.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14b8/live/2bbaac10-d316-11ef-844c-a7207455ca97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c87d88l4x8xo_1747800089.html", "title": "Rynard Landman: Ex-Dragons captain banned after failed drugs test", "title_page": "Rynard Landman: Ex-Dragons captain banned after failed drugs test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Dragons captain Rynard Landman has been banned from rugby for three years after failing a drugs test.\nSouth African lock Landman, 38, was tested by UK Anti-Doping (UKAD) at a Newport RFC training session in August 2024.\nAnalysis of Landman's urine sample detected the presence of the banned anabolic steroid nandrolone.\nUKAD said in a statement that Landman admitted the anti-doping rule violations (ADRVs) but \"explained that he had used nandrolone between June and August 2023 (with his last use in August 2023) while retired from professional rugby union\".\n\"UKAD sought the advice of an independent scientific expert to determine whether Mr Landman's use of nandrolone in August 2023 would result in a positive test result for the substance in August 2024,\" the statement added.\n\"In summary, the scientific expert considered it unlikely that nandrolone would be present in a sample one year after its purported administration.\"\nLandman's ban was reduced from four years to three because he accepted the UKAD charge.\nLandman left Super Rugby side Cheetahs to join Newport Gwent Dragons – as they were then known – in 2014.\nHe made 115 appearances over five years with the Welsh region, becoming a fans' favourite at Rodney Parade.\nAfter a spell in France, he hung up his boots in 2023 before coming out of retirement to play for Newport.", "url": "https://www.bbc.com/sport/rugby-union/articles/c87d88l4x8xo"}