{"authors": ["Thomas Woods", "www.facebook.com"], "date_download": "2025-05-21 05:17:38", "date_modify": "2025-05-21 05:17:38", "date_publish": "2025-01-23 08:52:06", "description": "There could be plenty of goals at Anfield this week so loading up on Liverpool assets is likely to pay dividends, writes Thomas Woods.", "filename": "sport_football_articles_cge7n3zx3l9o_1747804658.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1e0/live/7df2d810-d8d7-11ef-902e-cf9b84dc1357.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cge7n3zx3l9o_1747804658.html", "title": "FPL tips and team of gameweek 23: Mohamed Salah, Trent Alexander-Arnold and Luis Diaz should haul v Ipswich", "title_page": "FPL tips and team of gameweek 23: Mohamed Salah, Trent Alexander-Arnold and Luis Diaz should haul v Ipswich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool are the big Fantasy Premier League story this week, facing an Ipswich team who just conceded six goals against Manchester City.\nMohamed Salah will be licking his lips, dreaming of a hat-trick and he gets the captain's armband back this week.\nDo you dare bet against him?\nThe team of the week is selected based on current FPL prices to fit within a £100m budget, as if you were playing a Free Hit.\nAntonin Kinsky, Spurs, keeper, £4.5m - home to Leicester\nSpurs aren't a defence you'd usually back but Leicester have scored just twice in their past seven games.\nKinsky has impressed so far since signing for Spurs from Slavia Prague and the Czech keeper made four saves at Everton last week.\nWith a bit of luck you could get a clean sheet and bonus-type performance.\nLucas Digne, Aston Villa, £4.6m - home to West Ham\nOnly Trent Alexander-Arnold (13) has created more big chances this season than Digne.\nThe Frenchman is also top three for total crosses and the jury is out on West Ham's attack under Graham Potter.\nFulham gifted them two goals when the Hammers won 3-2 a couple of weeks ago and they failed to break down Palace last week.\nTrent Alexander-Arnold, Liverpool, £7.3m - home to Ipswich\nTwo double-digit scores in his past four games, home to a struggling side and with a double gameweek coming up.\nAlexander-Arnold is about to become essential so put him in your team (if you can afford the whopping price tag!).\nPervis Estupinan, Brighton, £5m - home to Everton\nI'm not buying the idea that Everton will suddenly start scoring loads under David Moyes, despite putting three past Spurs last week.\nBrighton will control possession and that gives their full-backs chance to get plenty of attacking touches.\nEstupinan's underlying data is nothing special but it does tell us that he is Brighton's most likely defender to get a return.\nMohamed Salah (captain), Liverpool, £13.7m - home to Ipswich\nSalah's two back-to-back blanks - well done if you went against him with the armband - have taken his total this season to four.\nFour blanks in 22 games! That is an incredible performance from Salah and the chances of him making it three blanks in a row against a team that just conceded six to \"out-of-form\" Manchester City are very slim.\nYou'd be brave to go against him again this week.\nLuis Diaz, Liverpool, £7.5m - home to Ipswich\nThis feels like the game to attack this week but picking a second Liverpool forward asset is hard.\nGoing for Diogo Jota last week didn't work, as he was injured before deadline. Diaz is probably the next most reliable forward to pick and he has four double-digit returns this season - eg massive upside!\nDejan Kulusevski, Spurs, £6.4m - home to Leicester\nFPL players must go back and forth with Spurs. When in form, you can make a case for picking two attacking assets - they have that many options.\nWhen they put in a bad performance, you wonder what you were thinking backing them.\nLeicester have conceded 27 goals in 10 games on the road (only Wolves with 28 are worse) so I'm backing Tottenham's most consistent asset to produce.\nKulusevski has 10 FPL returns this season and the most interesting stat is his key passes. He's made 56 in 20 starts - 23 more than the next player. #involved\nLeandro Trossard, Arsenal, £6.8m - away at Wolves\nSince Bukayo Saka was injured in gameweek 17, Trossard has stepped up for Arsenal, with two goals and two assists in his four starts since then.\nWolves have conceded three goals in each of their past three games, Arsenal need to bounce back after dropping more points in the title race and you fancy them to score at least a couple at Molineux.\nTrossard has been involved in 67% of Arsenal's goals since the Saka injury.\nAnthony Gordon, Newcastle, £7.7m - away at Southampton\nLast week was his first blank in seven games and, like team-mate Alexander Isak, Gordon has been a star performer during his side's run of six straight wins before they lost to Bournemouth.\nSouthampton have conceded 11 goals in their past three games.\nGordon's 22 shots in the past seven gameweeks is top five for midfielders - only two behind Cole Palmer - and makes him a very good shout for points here.\nLiverpool - Ipswich (h), DOUBLE GAMEWEEK - Everton (a), Bournemouth (a), Wolves (h)\nIt goes without saying that you want three Liverpool players for this upcoming period, with a double gameweek in the mix, unless you are going to put the assistant manager chip on Arne Slot.\nBut who? The only reliable starters are in defence - Virgil van Dijk, Alisson and Alexander-Arnold (although even he is a slight rotation risk).\nThey have an FA Cup game and an EFL Cup semi-final second leg sandwiched between Everton and Bournemouth too.\nSo do you play it safe with Salah and double defence - or take a punt on an explosive second forward who might only start every other game?", "url": "https://www.bbc.com/sport/football/articles/cge7n3zx3l9o"}