{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-05-21 06:10:58", "date_modify": "2025-05-21 06:10:58", "date_publish": "2025-04-01 13:32:02", "description": "Ross County fan voice: 'Bottom-six finish on the cards after poor attacking display'", "filename": "sport_articles_cx27509le01o_1747807858.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c467/live/36e44eb0-0eef-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cx27509le01o_1747807858.html", "title": "Ross County fan voice: 'Bottom-six finish on the cards after poor attacking display'", "title_page": "Ross County fan voice: 'Bottom-six finish on the cards after poor attacking display' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Premiership football returned following the international break, Ross County fans were optimistic their side could make it three home victories in a row and continue their late push for a top-six place.\nCounty faced a Dundee United side who had only won one of their previous eight matches and were looking to make amends for defeat in the Dundee derby.\nVictories against United in Dingwall have been hard to come by for the Staggies, with just one win in 11.\nSunday's meeting was not one for the football purist. It was extremely cagey as both sides battled to take control, but they lacked the quality to carve out any clear chances from open play.\nHowever, in the second half United took a strong grip of the match and looked the far more likely side to find the opening goal.\nIn these types of matches, it's a defensive mistake or a set-piece that can make the difference and it proved to be the latter this time as Ryan Strain's corner was met by Ross Graham, who scored the only goal.\nCounty failed to have any shots on goal in the entire second half, whereas United had 11, including four on target, which emphasises that if either side deserved the victory, it was the visitors.\nOverall, it was a really disappointing performance by County and it now looks almost certain, barring a miraculous run of results, we will be playing bottom-six football when the split comes around.", "url": "https://www.bbc.com/sport/articles/cx27509le01o"}