{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:12", "date_modify": "2025-05-21 05:22:12", "date_publish": "2025-04-03 16:09:08", "description": "Arsenal news: Fan views on Gabriel's injury", "filename": "sport_football_articles_c8jeyd8g9e4o_1747804932.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8jeyd8g9e4o_1747804932.html", "title": "Arsenal news: Fan views on Gabriel's injury", "title_page": "Arsenal news: Fan views on Gabriel's injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Gabriel's season-ending injury for Arsenal.\nHere are some of your comments:\nAaron: It's pretty devastating news and just sums up our season. Bukayo Saka being back for Madrid was a huge boost, but any feelings of optimism have been crushed by losing Gabi. Jakub Kiwior - it's time for you to be a hero!\nAndrew: Gabriel has been a standout performer in a testing season for the Gunners. Due to the injuries in forward areas, goals have been hard to come by. This has meant keeping goals out was crucial in an effort to challenge for the title. The loss of Gabriel alongside the injuries to Ben White, Riccardo Calafiori and Jurrien Timber means a real test of defensive cover against the current European champions.\nJamie: A silver lining - this should give Kiwior a run in the team and the chance to show what he can do leading to either a new contract or getting more money for him.\nCarl: There needs to be an inquest at Arsenal as to why this season we are getting so many hamstring and knee injuries? Something is wrong as other clubs do not suffer in high numbers like us.\nFinlay: I don't think we have a back-up centre-back strong enough to replace Gabriel in a high calibre game against Real Madrid. The odds of victory weren't great before but without him I'd say they are next to none.", "url": "https://www.bbc.com/sport/football/articles/c8jeyd8g9e4o"}