{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:47:47", "date_modify": "2025-05-21 07:47:47", "date_publish": "2024-12-23 16:09:46", "description": "Middlesbrough head coach Michael Carrick believes his side will reap the benefits of his rotation in the second half of the season.", "filename": "sport_football_articles_ce8n675142po_1747813667.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4c5/live/8ab57dc0-c14c-11ef-a0f2-fd81ae5962f4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce8n675142po_1747813667.html", "title": "Michael Carrick: Middlesbrough boss says rotation will benefit squad", "title_page": "Michael Carrick: Middlesbrough boss says rotation will benefit squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Middlesbrough head coach Michael Carrick believes he will see his side reap the benefits of rotating the starting line-up during the second half of the season.\nThe 43-year-old opted to select Tommy Conway ahead of Emmanuel Latte Lath for Boro's entertaining 3-3 draw with Plymouth Argyle on Saturday, one of three changes from the side that started the victory over Millwall seven days earlier.\n\"I think as a whole group the boys have played a lot of games between them and that has been a big plus for us moving through the season,\" Carrick told BBC Radio Tees ahead of his side's Boxing Day sell-out clash with Sheffield Wednesday.\nLatte Lath was a 75th-minute substitute at Home Park, scoring nine minutes after coming on to the pitch, and Carrick believes alternating his top attacking talent will improve his side's chances of a play-off surge in the new year.\n\"Tommy [Conway] scored a goal which was onside which was given offside, it was a good finish from Tommy, and Manu [Latte Lath] took his chance fantastically well and got us right back in the game so, yeah, pleased with both of them.\n\"I would like to think that we'll get the benefits further through the season - I think the boys individually are looking in a good place\".", "url": "https://www.bbc.com/sport/football/articles/ce8n675142po"}