{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:24:49", "date_modify": "2025-04-26 06:24:49", "date_publish": "2025-02-28 22:33:51", "description": "Ulster centre James Hume says he is balancing trying to rediscover his best form after a lengthy injury lay-off with mentoring younger members of the squad.", "filename": "sport_rugby-union_articles_ckgz091eegno_1745648689.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e97/live/d8f28b10-f372-11ef-8402-45d3cf1c2dcb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_ckgz091eegno_1745648689.html", "title": "Ulster v Scarlets: James Hume on returning from injury and mentoring younger players", "title_page": "Ulster v Scarlets: James Hume on returning from injury and mentoring younger players - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ulster centre James Hume says he is keen to find a balance between rediscovering his best form after a lengthy lay-off with a knee injury and helping to mentor the young players in the Irish province's squad.\nThe 26-year-old returned to competitive action after 10 months out in the United Rugby Championship defeat by Benetton earlier this month.\nHume has been undergoing ACL reconstruction and meniscus repair.\n\"It's a tough balance for me to accept at the moment, being a senior player at 26 is pretty mental,\" Hume told BBC Sport NI.\n\"I'm trying to get that balance of getting my own stuff right on coming back from injury but I do want to help the academy lads and the younger lads coming through as much as possible.\n\"That balance of focusing on what I'm good at but also giving them advice and experience when I can.\"\nHume says Ulster's indifferent form this season, which sees them sit 14th in the URC table and struggling to secure qualification for next season's Champions Cup, has made it a steep learning curve for the younger players in the squad.\n\"The position we are in at the moment they [younger players] have a huge role in making the team better.\n\"We're putting everything into everything we're doing – our pitch sessions, our gym, our intensity has risen the past few weeks in training and I just hope that starts translating onto the pitch because we are putting the work in behind the scenes.\n\"It's just a matter of time before that clicks and hopefully we can get into that top eight and secure European rugby.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/ckgz091eegno"}