{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-05-21 05:00:11", "date_modify": "2025-05-21 05:00:11", "date_publish": "2025-01-23 12:56:27", "description": "Carlisle United have brought in 10 players this month in a desperate attempt to avoid relegation to the National League.", "filename": "sport_football_articles_cn7gze8874mo_1747803611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aaa1/live/8cabc5c0-d985-11ef-ba6a-b744abd00a0a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7gze8874mo_1747803611.html", "title": "Carlisle United: Can 10 January signings help avoid EFL relegation?", "title_page": "Carlisle United: Can 10 January signings help avoid EFL relegation? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The January transfer window is that mythical month when every football fan wonders if their club can make the signings to enhance a promising season or save a bad one.\nBut rarely can a club have thrown all their chips on red in the way Carlisle United have done.\nWith still over a week of the window open, the Cumbrians have already brought in 10 new players in an effort to avoid relegation to the National League for the first time since 2004.\nIt is a huge gamble and show of faith for head coach Mike Williamson, but with the club seven points adrift of safety at the bottom of League Two, do they have any other option?\nQuite simply, their season up to now has been nothing short of disastrous.\nRelegated from League One last April after finishing bottom with a meagre haul of 30 points in their worst-ever campaign, the hope was that Carlisle could recover in the fourth tier.\nInstead, they are propping up the table with just 18 points from 25 games, two points behind Morecambe and seven shy of Tranmere Rovers in 22nd place. Their current rate of 0.72 points per game is only slightly better than last season's 0.65.\nWilliamson was brought in to replace Paul Simpson in September, while Rob Clarkson arrived as the club's first ever sporting director the following month in a bid to improve matters.\nWith the club owned by the Florida-based Piatak family since November 2023, such poor on-field performance was not part of the deal when they took over at Brunton Park as they now try to avoid back-to-back relegations.\nWilliamson has overseen only three wins from his 19 games in charge, collecting 15 points.\nCarlisle have only won two games at home all season. They have scored just 19 goals, a rate of 0.76 goals per game.\nOnly two points have been recovered from losing positions, while they last won a game from behind on New Year's Day 2024.\nAnd you have to go back to March 2023 for when Carlisle last won consecutive league matches.\nSomehow former Newcastle United defender Williamson has to drastically improve all these statistics, but with owners telling him 'whatever it takes' to get out of trouble, he now has effectively a completely new team with which to do it.\nWhile these 10 new players have arrived, six have so far departed with others also expected to move on before the end of the month.\nWith such a revolving door, it is perhaps no surprise that Carlisle have all lost all three January fixtures so far as Williamson has to construct a new team in the middle of the season.\nBlending new characters and personalities into a dressing room would be a challenge across the few weeks of pre-season, but the Cumbrians do not have that luxury.\nWilliamson, 41, says that he is spending every waking hour thinking about how to turn things around, but he knows the only realistic way of creating a proper team spirit is by winning.\n\"The biggest job the head coach has is to get everyone to understand that there might be 20, 25, 30 intrinsic motivations to improve or get up the league,\" he told BBC Sport.\n\"Whether that is playing at a higher level, playing in the league, trying to earn yourself a contract, trying to earn yourself offers from another club.\n\"But it has to be a selfless endeavour, doing whatever you can for the football club and the team, first. Then everyone will get their individual rewards off the back of that.\n\"At the moment we have to make sure we rely on our mental toughness and be able to manufacture that belief and confidence that we are going to go on our run.\n\"We've definitely got that quality inside the club now, we've just got to make sure that comes together.\"", "url": "https://www.bbc.com/sport/football/articles/cn7gze8874mo"}