{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:11:52", "date_modify": "2025-05-19 15:11:52", "date_publish": "2015-02-21 18:12:32", "description": "Chelsea boss Jose Mourinho blames four key moments after his Premier League leaders are held to a draw by Burnley.", "filename": "sport_football_31569726_1747667512.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81159000/jpg/_81159686_mourinho.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31569726_1747667512.html", "title": "Jose Mourinho: Four moments changed the game against Burnley", "title_page": "Jose Mourinho: Four moments changed the game against Burnley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea boss Jose Mourinho blamed four key moments for his side's failure to beat Burnley.\nThe Blues had Nemanja Matic sent off as they were held to a late 1-1 draw at home to Burnley.\nReferring to notes in his post-match BBC interview, Mourinho said: \"There are four moments of the game where you can write the story. Minutes 30, 33, 43 and 69. Don't ask me more questions.\n\"I can't go through the incidents. I am punished when I refer to them.\"\nThe key incidents:\nIvanovic is at the centre of the action again. Juan Cuadrado pulls the back back for the Serbia defender and he strikes a first-time shot from the edge of the area which hits the raised arm of Michael Kightly, who is turning his back on the ball. Ivanovic claims handball but referee Martin Atkinson is unmoved.\nThe midfielder is dismissed for a reactive push on Barnes after a late tackle from the Burnley forward. Mourinho said: \"What happened to Matic was in minute 69 and minute 69 had a big relationship with minute 30 because normally that player, if I can call him a player, should have been in the shower in minute 31.\n\"There wouldn't have been a minute 69 if the person in charge had dealt with minute 30 properly.\"\nBurnley manager Sean Dyche defended his players and refused to be drawn by Mourinho's comments.\n\"I've only seen it as it happened. It looked like a coming together at an odd angle. Then Matic reacts in the way he did,\" Dyche said.\n\"I will look back at it again, but I haven't seen it since. But there's more to talk about than that because it was an excellent performance.\n\"Barnes was involved in something earlier in what sense? Playing football? A charge in the back? Is there anything else? The grass was too short?\n\"I have total respect for Jose Mourinho, his players and Chelsea. Fantastic manager, fantastic club.\"", "url": "https://www.bbc.com/sport/football/31569726"}