{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:17:18", "date_modify": "2025-05-21 05:17:18", "date_publish": "2025-04-04 00:00:00", "description": "Relive day one of the 2025 County Championship as it happened as Hampshire bowl out Yorkshire and Essex start well against Surrey.", "filename": "sport_cricket_live_c93k5gzrwg3t_1747804638.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_c93k5gzrwg3t_1747804638.html", "title": "County Championship day one as it happened: Hampshire lead Yorkshire, Essex on top", "title_page": "County Championship day one as it happened: Hampshire lead Yorkshire, Essex on top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Signing off\n#bbccricket\nA great day to welcome back county cricket with blue skies and some intriguing action.\nA century from Jordan Cox means Essex had the better of it against the champions Surrey, while Sussex announced their return to Division One with three figures each for John Simpson and Tom Clark at Warwickshire.\nThe first century of the season came for Colin Ackermann of Durham at Nottinghamshire. Meanwhile, Yorkshire were bowled out for 121 before fighting back against Hampshire.\nKasey Aldridge took five wickets for Somerset against Worcestershire while in Division Two Derbyshire's Luis Reece produced the day's best figures with 6-52 against Gloucestershire.\nYou can get the full lowdown on the opening day on our cricket pages and we'll be back with you from about 10:40 tomorrow with the all the action from the second day's play.\nClose of play at Northampton\nKent 231 v Northamptonshire 118-7\nAndrew Radd\nBBC Radio Northampton\nKent's five-man pace attack enjoyed a superb final session to give their side control at the end of an action-packed day at Wantage Road.\nSouth African Keith Dudgeon - on his county debut - set the tone by shattering the stumps of Ricardo Vasconcelos with the first ball of his second over.\nNathan Gilchrist, Jas Singh, Grant Stewart and Joey Evison also joined the party and reduced Northamptonshire to 118-7 at the close, still 113 behind.\nOnly Rob Keogh - starting his 14th season of Championship cricket with his county - showed the required level of application, compiling an unbeaten 53 as wickets clattered at the other end.\nClose of play at Derby\nDerbys 127-2 v Gloucs 222\nLuis Reece may not have had better opening days as a cricketer as he has produced the day's best bowling figures of 6-52 after Derbyshire won the toss and chose to bowl\nGraeme van Buuren (67) and stand-in skipper James Bracey (48) had threatened a Gloucestershire fightback.\nAustralian Caleb Jewell will have put Second Division attacks on red alert with his rapid 61 from 48 balls and the home side will look to press on tomorrow and build a first innings lead.\nClose of play at Lord's\nMiddlesex 260 v Lancashire 68-0\nLancashire's openers survive the final 25 overs of play at Lord's and they will be well satisfied with their efforts on the opening day of the summer at Lord's.\nMiddlesex were in a good position on 127-1 as Sam Robson (70) and Max Holden (69) added 122 - but thereafter Leus du Plooy's 41 was the only score of note as Tom Aspinwall took 4-32.\nMichael Jones opened with Keaton Jennings for the Red Rose, with Marcus Harris given a middle-order slot, and they shared four singles between them in the final over of play, bowled by Zafar Gohar.\nJennings will start day two 41 not out, with Jones on 17.\nClose of play at Cardiff\nGlamorgan 229 v Leics 65-1\nLeicestershire end day one on top as their batters backed up a strong bowling performance at Sophia Gardens.\nIan Holland (3-40) and Tom Scriven (2-38) did the damage up front for the Foxes to reduce Glamorgan to 132-6 despite 41 from opener Eddie Byrom and Chris Ingram's 32.\nChris Cooke carved out a half-century but was last wicket to fall for 55 when he became the third victim of Leicestershire paceman Ben Mike (3-54).\nThe visitors lost Holland early, but Sol Budinger (36*) and nightwatchman Mike (18*) shared an unbroken second-wicket stand of 47 to stumps.\nThe Foxes trail by 164 with nine wickets in hand.\nClose of play at Utilita Bowl\nHampshire 164-5 v Yorkshire 121\nBen Coad finds extra lift in the final over of play but there is no edge by Toby Albert as the ball flies through to Jonny Bairstow.\nThe Yorkshire captain only managed 10 when his side were bowled out in 34.4 overs earlier in the day - giving his wicket away with a loose uppercut off newcomer Sonny Baker.\nHampshire looked well in control when openers Mark Stoneman (46) and Fletcha Middleton (45) were together, putting on 70 for the first wicket.\nBut Yorkshire stuck to their task, with Jack White and George Hill taking two wickets each, and will be hopeful of restricting Hampshire's lead on day two.\nClose of play at Trent Bridge\nNotts v Durham 370-9\nLyndon James in for his 17th over of a hard first day for the Notts bowlers after Haseeb Hameed won the toss and opted to field first.\nPaul Coughlin and Matthew Potts eke out a single apiece and that's your lot for day one.\nFergus O'Neill (4-74) had the visitors in early trouble at 24-2, but a well-crafted knock of 116 from Colin Ackermann, supported by 52 from Alex Lees, steered the initiative Durham's way.\nThe Notts bowlers continued to chip away and looked well set when O'Neill removed Will Rhodes to leave the visitors 171-5.\nBut the middle and lower orders have shown real fight, as knocks of 45 from Graham Clark and George Drissell held up the home charge.\nClose of play at Chelmsford\nEssex 356-4 v Surrey\nA good toss to win for Essex and they've made the most of it.\nPaul Walter fell five runs short of a third First Class century but Jordan Cox made no mistake with his 117 before being surprisingly bowled by Kemar Roach.\nTom Westley made an attractive 40 and they have power to add with Matt Critchley 45 not out alongside Michael Pepper.\nSurrey tried all their bowling combinations but the Chelmsford pitch was relatively unresponsive although Simon Harmer will have been interested to see Dan Lawrence get the odd one to turn.\nPost\nHants 158-4 v Yorks 121\nWhat a reliable workhorse Ben Coad is.\nHe is called up for his 14th over of the innings and having asked James Wharton to take his life in his hands at silly mid-off, strikes Brad Wheal on the pads.\nIt is too high and Wheal strokes the final ball away through the covers for three to retain the strike. That's what nightwatchers are for at this time of day.\nClose of play at Taunton\nSomerset 187-4 v Worcs 154\nA superb unbeaten 84 from Tom Banton and Tom Abell's half-century have put Somerset firmly in the driving seat after the wickets tumbled in the first two sessions.\nKasey Aldridge's five-wicket haul and three for Craig Overton ran through the visitors who slumped from 70-0 to 154 all out.\nThe Pears looked to be hauling themselves back into the match when they reduced Somerset to 39-3, but Banton and Abell (52) looked untroubled during a 101-run fourth-wicket stand.\nJames Rew (17 not out) then joined Banton and the pair have added 47 runs to move Somerset into a 33-run lead with six wickets in hand.\nPost\nNotts v Durham 368-9\nNotts are plugging away to take the final wicket as we move into the penultimate over of day one at Trent Bridge.\nJosh Tongue's first ball is wide and Matthew Potts helps it past the slip cordon to the third man boundary for his first four.\nPotts drives handsomely but straight to Haseeb Hameed at cover. Five dots.\nDurham have ground out the runs today having been put in.\nOne to go.\n'Soft dismissal' for Prest\nHants 151-4 v Yorks 121\nKevan James\nBBC Radio Solent commentator\nGeorge Hill has just made the batters play, he's just bowled straight.\nHe's been rewarded with the wickets of Mark Stoneman, who he bowled, and now Tom Prest.\nI think Prest will be disappointed there. I'm not sure if he's tried to play it fancy and get it on the outside half of his bat, but I think that's a bit of a soft dismissal.\nWICKET\nPrest b Hill 32 (Hants 151-4 v Yorks 121)\nThat's a fairly limp shot by Tom Prest to a ball which nips back a little off the pitch and he is not the first person to play on at the Utilita Bowl today.\nAre we going to see a nightwatcher? Yes, we are. Here comes Brad Wheal.\nWICKET\nDrissell c Clarke b O'Neill 45 (Notts v Durham 355-9)\nMaximum three bowling points for Notts as George Drissell falls five short of just a third first-class half-century.\nIt's a disappointing end to a good 70-ball knock as he wafts at a ball outside off stump and edges behind to Joe Clarke who takes a low tumbling catch.\nIt also gives Fergus O'Neill a sniff of a debut five-wicket haul.", "url": "https://www.bbc.com/sport/cricket/live/c93k5gzrwg3t"}