{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:43:04", "date_modify": "2025-05-20 11:43:04", "date_publish": "2023-08-06 15:56:40", "description": "Leigh keep up their bid for a top-two finish in Super League as they beat Leeds 13-6 for a first win at Headingley in 39 years.", "filename": "sport_rugby-league_66397940_1747741384.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10885/production/_130671776_leighleedsindexpa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397940_1747741384.html", "title": "Super League: Leeds Rhinos 6-13 Leigh Leopards - Headingley win keeps cup finalists third", "title_page": "Super League: Leeds Rhinos 6-13 Leigh Leopards - Headingley win keeps cup finalists third - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leigh kept up their bid for a top-two finish in Super League as they beat Leeds at Headingley for the first time in 39 years.\nEdwin Ipape put Leigh ahead midway through the first half before Jarrod O'Connor broke through for Leeds.\nTom Amone restored the lead soon after the break, before Ben Reynolds added a penalty after a high tackle.\nAfter O'Connor had a second try ruled out, Gareth O'Brien's drop goal sealed the win with six minutes left.\nIt was Leigh's first success at Leeds since a 24-18 result in the Slalom Lager Championship on 3 April 1984.\nAnd it put the Challenge Cup finalists level on points with second-placed Wigan, while Leeds' play-off hopes suffered another blow as they remained eighth.\nLeeds started well as O'Connor was held up on the Leigh line after nine minutes but the visitors, who defended well throughout, repelled the Rhinos despite three successive sets of six.\nThe visitors took the lead after 22 minutes following a good spell of possession which ended with Ipape powering his way over for his third try against the Rhinos this season.\nAsh Handley should have scored for Leeds when he knocked back Ben Sezer's high kick in the Leopards' in-goal area rather than hold on to it and touch down.\nBut their pressure eventually told as James Bentley's mazy run set up the field position for O'Connor to dart past three defenders from dummy half after 33 minutes.\nA lovely sidestep saw Amone go in under the posts for Leigh five minutes into the second period and Leeds had Sam Lisone sin-binned for a trip on Tom Briscoe soon after.\nLeigh only had a Reynolds penalty to show for the 10 minutes with an extra man and were lucky not to be pegged back when video replays showed O'Connor lost possession under pressure as he went over after it looked as though he had scored.\nO'Brien's drop goal then gave the Leopards a key seven-point advantage as they kept up their superb form following promotion last season.\nLeeds head coach Rohan Smith told BBC Radio Leeds:\n\"It was a good contest, a tough, physical game where we were there or thereabouts.\n\"We got beaten in a couple of critical moments defensively, but I thought our defence overall was excellent against a very good attacking team.\n\"We positioned ourselves but probably didn't execute as well as we'd like at times to find that real inroad and the rest of the game was difficult at times to get a roll on.\"\nLeigh head coach Adrian Lam told BBC Radio Manchester:\n\"It was a really big game for us in the sense of the Super League and where we sit on the ladder.\n\"We kept the momentum going and everyone's got through so we're very pleased.\n\"I was frustrated in the first half. I didn't think we had a chance to play, they had eight sets more than us and a lot of six against, and it wasn't reciprocated the other way.\n\"But a couple of lucky bounces in that second half got the job done.\"\nLeeds: Hooley, Macdonald, Roberts, Martin, Handley, Johnson, Sezer, Oledzki, O'Connor, Holroyd, Bentley, McDonnell, C. Smith.\nInterchanges: Lisone, Donaldson, Sinfield, Sangare.\nLeigh: O'Brien, Briscoe, Chamberlain, Gildart, Nisbet, Reynolds, Lam, Amone, Ipape, Mulhern, O'Donnell, Hughes, Asiata.\nInterchanges: Mellor, Wardle, Seumanufagai, Davis.\nReferee: Marcus Griffiths.", "url": "https://www.bbc.com/sport/rugby-league/66397940"}