{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:04:50", "date_modify": "2025-05-20 14:04:50", "date_publish": "2023-07-31 03:23:06", "description": "Co-hosts Australia keep their Fifa Women's World Cup hopes alive by reaching the second round at the expense of Olympic champions Canada.", "filename": "sport_football_66357325_1747749890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/163F9/production/_130592119_gettyimages-1582565291.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66357325_1747749890.html", "title": "Canada 0-4 Australia: Co-hosts keep Women's World Cup dream alive as Olympic champions go out", "title_page": "Canada 0-4 Australia: Co-hosts keep Women's World Cup dream alive as Olympic champions go out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australia kept their Women's World Cup dream alive as they advanced to the last-16 stage by thrashing Canada.\nHayley Raso scored twice, Mary Fowler was also on target and Steph Catley netted a late penalty as the co-hosts impressed in a game they had to win to avoid elimination.\nThe Matildas finished top of Group B - and did so without Sam Kerr, an unused sub despite declaring herself fit.\nCanada suffered their first Women's World Cup group-stage exit since 2011.\nNigeria's draw with the Republic of Ireland means Australia will go forward to face the runners-up in Group D - who could still be England - at Stadium Australia in Sydney on 7 August.\nFor Australia, this game had involved of the most fraught build-ups possible at a World Cup. The spectre of a humiliating early exit, combined with the dominating question marks about Kerr's fitness, did not make for ideal preparation.\nCaptain Kerr - having missed the first two games with a calf injury - was named on the bench but did not take part in the warm-ups, instead chewing gum and wearing her big coat as she watched the passing drills.\nUltimately, it was the 11 women on the field for Australia who would decide whether they could survive this test - and they rose to the challenge.\nRoared on by a noisy near-capacity crowd at the Melbourne Rectangular Stadium, from the start they were far quicker and more dynamic than Canada.\nThose watching from the stands became noisier when Catley's low cross found Raso in the area and she controlled before firing into the bottom corner.\nFowler appeared to have doubled the lead, firing into the roof of the net after a goalmouth scramble; however, Ellie Carpenter was judged offside after a lengthy video assistant referee review.\nIt left the crowd unsure how to react when Raso turned home following another scramble shortly before half-time. It was only when Canada restarted the game that they celebrated.\nFrom a Group B line-up filled with quality teams, there was always going to be one major name who exited in the first round - whether hosts Australia, World Cup ever-presents Nigeria or Olympic champions Canada.\nUltimately it is the Canadians who bow out, unable to repeat the feats of United States in 1999 and 2015 of holding the World Cup and Olympic crowns simultaneously.\nIt was a frustrating manner of exit, failing to lay a glove on fired-up Australia. The Canadians' best chance came when Deanne Rose was denied by the leg of Mackenzie Arnold in the second half.\nTheir exit means forward Christine Sinclair, 40, was unable to become the first player to score at six World Cups.", "url": "https://www.bbc.com/sport/football/66357325"}