{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:24", "date_modify": "2025-05-21 03:51:24", "date_publish": "2025-04-07 00:00:00", "description": "Follow and watch Mikel Arteta's Arsenal news conference before Tuesday's Champions League quarter-final with Real Madrid.", "filename": "sport_football_live_cr4n2x91lg3t_1747799484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86fa/live/6c9a09f0-13b8-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr4n2x91lg3t_1747799484.html", "title": "Watch Arsenal training before Champions League quarter-final with Real Madrid", "title_page": "Watch Arsenal training before Champions League quarter-final with Real Madrid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio\nAnd with that little recap, this live text has come to an end.\nLots of big lines from both manager Mikel Arteta and winger Bukayo Saka in their news conference earlier and you can recap on those below or by clicking on the summary points at the top of this page.\nWe'll see you bright and early tomorrow as we build up to game day!\nSee you then.\nPost\nHaha not that I would know haha...\nAnyway, with that, the live section of training comes to an end.\nThat's the last we'll see of Arsenal before they are stepping onto the pitch at the Emirates tomorrow night to take on Real Madrid.\nExcited? Nervous? Hopeful?\nAll of the above, Arsenal fans?\nPost\nArsenal v Real Madrid (Tue, 20:00 BST)\nArsenal\nOne thing to note here is that the mood looks absolutely great. Everyone looks to be enjoying themselves and who is surprised with a game like tomorrow's on the horizon?\nThe camera is focused on Mikel Arteta who is the latest with a big smile on his face.\nArsenal train before Madrid tie\nAlex Howell\nBBC football news reporter at Arsenal's training ground\nThe Arsenal team are out training ahead of the quarter-final tie against Real Madrid.\nBen White is there after he continues to build up his fitness following injury.\nThere is also 15-year-old Max Dowman in the session. He’s trained with the first team this season.\nWill Arteta get the tunes on?\nArsenal v Real Madrid (Tue, 20:00 BST)\nArsenal\nI wonder if Mikel Arteta will have any tunes blasting out of the speaker today? I can spot something on the grass which looks very much like a speaker to me.\nMusic has been part of many open training sessions this year for the Gunners.\nArteta has said previously it's to 'build the energy' and 'change certain purposes' they want in the training session.\nWatch Arsenal training\nArsenal v Real Madrid (Tue, 20:00 BST)\nArsenal\nA reminder that we've got access to Arsenal's training session before tomorrow night's quarter-final first leg and we're streaming it for you live.\nMikel Arteta and his side are due out any minute now in the glaring London sunshine.\nClick 'watch live' at the top of the page to tune in.\nWhat did Bellingham do on Saturday?\nArsenal v Real Madrid (Tue, 20:00 BST)\nFor those that may have missed it, Real Madrid and England midfielder Jude Bellingham didn't take too kindly to the VAR monitor after his side's 2-1 defeat to Valencia on Saturday.\nFootage taken from a fan inside the stadium shows Bellingham booting the VAR monitor before walking off down the tunnel after the final whistle.\nIn La Liga, unsportsmanlike conduct or \"acts of aggression against equipment\" are typically handled under the RFEF (Royal Spanish Football Federation) disciplinary code.\nIf a player is found to have intentionally damaged league property (like, in this case, the poor VAR monitor), the league can hand out sanctions, including a 1-3 match ban, fines, or warnings and formal reprimands.\nAttacking riches\nArsenal v Real Madrid (Tue, 20:00 BST)\nReal Madrid\nVinicius Jr, Kylian Mbappe and Jude Bellingham are some of the players that'll need keeping quiet if Arsenal are to head to the Bernabeu in a strong position.\nCombined, the three have scored 41 goals in Spain's top flight this year.\nBukayo Saka was asked about comparisons between himself and Real Madrid's attacking talent. He said he'll \"leave everyone to have their opinion.\"", "url": "https://www.bbc.com/sport/football/live/cr4n2x91lg3t"}