{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-19 15:06:47", "date_modify": "2025-05-19 15:06:47", "date_publish": "2015-02-09 15:15:04", "description": "Former Oxford United chairman Kelvin Thomas will continue in his advisory role at Torquay until the end of the season.", "filename": "sport_football_31299264_1747667207.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80446000/jpg/_80446052_kelvin_thomas_1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31299264_1747667207.html", "title": "Torquay United: Kelvin Thomas to stay on in advisory role", "title_page": "Torquay United: Kelvin Thomas to stay on in advisory role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Oxford United chairman Kelvin Thomas will continue in his advisory role at Torquay United until the end of the current season.\nThomas was brought in last month , external but has previously said that he has no plans to take over Torquay himself.\nGulls chairman Thea Bristow is looking for new investment.\nShe became chairman in 2013, having assumed a role on the board after her husband Paul passed away in 2010.\n\"It's been really interesting find out more about the club and finding out about Thea's role and what she's done so far,\" Thomas told BBC Sport.\n\"I was impressed and moved at what Thea has done, especially with her limited knowledge of running a football club.\n\"Thea has made it clear that she needs some help financially in terms of investment into the football club and that can be a daunting process for someone that doesn't have experience in that.\n\"So primarily, I'll help Thea in that role, meeting with potential investors and the current board to see if there's anyone else interested in coming in and taking the club forward financially and passionately.\n\"Secondly, I'm identifying some areas that need a bit of improvement. I've identified some areas that are great and just need some help along the way, and there are areas where you could not just save money, but also increase revenues.\"\nTorquay have not won a league game since 9 December, when they beat FC Halifax Town 2-1, although they have won four matches in the FA Trophy since then to move into the semi-finals of the competition.\nThe Gulls, who were relegated from the Football League last season, are currently 14th in the Conference Premier, their worst league position since September 2008.\n\"It has been a really good few weeks for me working with Kelvin as I have gained a valuable insight into the club and the options available,\" Bristow said in a statement.\n\"Once we had discussed his findings this weekend, it became obvious to me that for this to work he had to stay involved at least to the end of the season, with a view to both finding new investment and making the club more sustainable moving forward.\nShe added: \"I have been speaking with people about potential investment in the football club or even a possible transfer of my interest. However, it is very important to me that any solution is in the best interests of the club and I am hoping Kelvin, with his experience, will help me with this.\n\"I have no intention of walking away or stepping down without first finding a secure future for the club.\"", "url": "https://www.bbc.com/sport/football/31299264"}