{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:51:49", "date_modify": "2025-05-20 14:51:49", "date_publish": "2023-07-28 00:00:00", "description": "Relive the action as 10-player China beat Haiti in Group D at the Women's World Cup.", "filename": "sport_live_football_66167888_1747752709.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/568D/production/_130575122_china6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66167888_1747752709.html", "title": "Fifa Women's World Cup LIVE: China vs Haiti score, commentary & updates from Group D game", "title_page": "Fifa Women's World Cup LIVE: China vs Haiti score, commentary & updates from Group D game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nFT: China 1-0 Haiti\nThat's all from us today, thank you for joining us for an exciting end to day nine of the Women's World Cup.\nA huge win for China considering they went down to 10 players in the 29th minute.\nWang Shuang's spot-kick was the difference, but Haiti will definitely feel aggrieved at some of those late penalty shouts.\nYou can read Michael Emons' report here.\nThanks again and see you tomorrow for Sweden v Italy, France v Brazil and Panama v Jamaica.\nPost\nFT: China 1-0 Haiti\nFor China, a win over England on Tuesday would ensure they continue their record of making the knockout rounds in every World Cup they have played in.\nEven a draw or defeat might be enough for the Steel Roses, but that all depends on how Denmark and Haiti get on against each other, with both of them also able to qualify.\nIt's all to play for.\n'VAR went to sleep'\nFT: China 1-0 Haiti\nKaren Carney\nFormer England midfielder on ITV1\nI think VAR went to sleep a little bit at the end.\nYou see the challenge on Dumornay, she gets the touch on the ball and the defender just goes through her, no intent to play the ball.\nThe one after it was a bit more dubious, the player is caught by the China defender's arm but it was more of a coming together.\nThe Dumornay one was a nailed on penalty though.\nHaiti still able to qualify for knockout stages\nFT: China 1-0 Haiti\nThe Haiti players look completely dejected. They gave it all they could in injury time.\nBut, it's not over for the Caribbean side just yet. They could still make it to the knockout rounds if they beat Denmark on Tuesday and England defeat China. Even then it would come down to goal difference.\nIt's a tough ask, but as manager Nicolas Delepine said before this match, \"anything is possible\".\nPost\nChina 1-0 Haiti\nNow it's Kethna Louis down in China's box. Is that a penalty?\nLouis is still down injured and it looks like the referee is running over to the monitor.\nBut, no. It's a yellow card for Haiti manager Nicolas Delepine, who is complaining that his side haven't been given a spot-kick.\n'Strange decisions'\nChina 1-0 Haiti\nEmma Byrne\nFormer Ireland goalkeeper on ITV1\nIt's a strange one.\nInitially the decision was a bit soft, not enough in it for me to give a penalty.\nBut once it has been given, you can't put your hands on a player like that in the box, so there isn't enough to overturn it on VAR.", "url": "https://www.bbc.com/sport/live/football/66167888"}