{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:46:35", "date_modify": "2025-05-21 06:46:35", "date_publish": "2025-01-04 11:18:31", "description": "Aston Villa vs Leicester predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_ckg9dx485rjo_1747809995.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c997/live/e8147830-c9f9-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckg9dx485rjo_1747809995.html", "title": "Aston Villa vs Leicester predictions: Chris Sutton on Premier League game", "title_page": "Aston Villa vs Leicester predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 2-0\nAston Villa will be kicking themselves after conceding a late equaliser against Brighton.\nI don't see Villa slipping up here, though, even without suspended duo Jhon Duran and Morgan Rogers. Ollie Watkins will lead the line for them again - he has the jersey and will be looking to show why he should keep it when Duran is back from his ban.\nVilla are strong at home while Leicester's away form is poor, with only one win and two draws from nine games on the road. They are in a relegation scrap and they are going to struggle to stay up.\nThe Foxes played pretty well against Manchester City last time out, and missed some good chances, but they still lost,\nThat defeat was their fourth in a row, and I am expecting Villa to make it five.\nMcCabe's prediction: 0-2\nI am not sure about this one. There is a bit of a Midlands rivalry there, and I reckon Leicester might surprise a few people.", "url": "https://www.bbc.com/sport/football/articles/ckg9dx485rjo"}