{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 05:47:59", "date_modify": "2025-05-21 05:47:59", "date_publish": "2025-04-02 11:55:02", "description": "Leicester post a £19.4m loss in their accounts for 2023-2024 - the season they spent in the Championship.", "filename": "sport_football_articles_c62x9901q92o_1747806479.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4ad9/live/ec7a8130-0fa4-11f0-b696-d3bfdfb825fc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62x9901q92o_1747806479.html", "title": "Leicester City post £19.4m loss in Championship-winning season", "title_page": "Leicester City post £19.4m loss in Championship-winning season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester have posted a £19.4m loss in their accounts for 2023-2024 - the season they spent in the Championship.\nThose latest losses are significantly reduced compared to deficits of £92.5m in 2021-22 and £89.7m in 2022-23 - which led to the Foxes being charged by the Premier League for an alleged breach of profit and sustainability rules (PSR).\nLeicester successfully appealed that charge, arguing that, as they were in the EFL at the time the charge was issued, the Premier League did not have jurisdiction to punish them.\nHowever, there is still a degree of uncertainty over whether Leicester will face a PSR charge for the three-year period up to 2022-23 from the EFL, with a Premier League statement in January saying the issue of \"jurisdiction\" was \"the subject of confidential arbitration proceedings\".\nThe outcome is unlikely to be known before the Foxes - who are 12 points from top-flight safety - discover which division they are in next season.\nPremier League clubs can lose £105m over three years, which is reduced by £22 million for each year in the EFL, with Leicester winning the Championship title in 2023-24.\nUnder EFL rules, clubs cannot exceed £39m losses over a three-year cycle. If Leicester are relegated again their maximum loss for their next accounts to include 2024-25 would be £83m, taking in two seasons in the Premier League and one in the Championship.\nHarvey Barnes' £38m move to Newcastle and Timothy Castagne's £15m transfer to Fulham in 2023 are included in their 2023-24 accounts, while the £10m compensation banked from former manager Enzo Maresca's switch to Chelsea last summer will also ease losses.\nKiernan Dewsbury-Hall's £30m transfer to Chelsea in summer 2024 is also included.\nChief executive Susan Whelan added: \"As a club, we still have work to do to return to the consistent heights of the last 15 years and the ability to successfully adapt to different challenges is a strength we will rely on as we build for future seasons.\"\nLeicester go to Manchester City on Wednesday having lost 13 of their past 14 games.\nThey sacked Steve Cooper in November and replaced him with Ruud van Nistelrooy, but the former Manchester United striker has won just three of his 18 games in charge.\nFans have also protested against the running of the club during the season, with director of football Jon Rudkin coming under pressure.", "url": "https://www.bbc.com/sport/football/articles/c62x9901q92o"}