{"authors": ["Ciaran Varley", "www.facebook.com"], "date_download": "2025-04-26 04:36:29", "date_modify": "2025-04-26 04:36:29", "date_publish": "2025-02-28 11:54:59", "description": "Liverpool: Lijnders on Klopp, Alexander-Arnold and Bradley", "filename": "sport_football_articles_crrdd7rgj7qo_1745642189.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/029b/live/ce72b0d0-f501-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crrdd7rgj7qo_1745642189.html", "title": "Liverpool: Lijnders on Klopp, Alexander-Arnold and Bradley", "title_page": "Liverpool: Lijnders on Klopp, Alexander-Arnold and Bradley - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "One of the success stories of the Jurgen Klopp era at Liverpool is the development of Trent Alexander-Arnold from academy kid into one of the best attacking full-backs in the world, with the most Premier League assists of any defender in history.\nKlopp reveals in a new Amazon Prime documentary that former head of the under-18 academy Pep Lijnders instantly saw the 26-year-old's potential.\n\"I think on day one, Pep told me about Trent,\" he says.\nThe defender has helped Liverpool lift the Premier League, Champions League, FA Cup, Club World Cup and twice the League Cup. However, he says that his debut in 2016 – in a 2-1 win against Tottenham Hotspur in the fourth round of the EFL Cup – remains, \"the proudest moment I've had in football\".\nReflecting on his achievements with his boyhood club, Alexander-Arnold says: \"I owe it to that six-year-old lad who walked through the academy gates the first day. I owe it to the teenager that never went to a party, was doing homework in the back of a bus from training. I owe it to him who sacrificed everything.\"\nWith the 26-year-old's contract at Liverpool due to expire this summer, there has been much speculation over whether the Reds have a potential successor in waiting in the shape of Northern Irish right-back, Conor Bradley.\nThe 21-year-old, who has been at Liverpool's academy since he was a teen, made his debut in the Premier League last January under Klopp, in a 4-0 win over Bournemouth, where he picked up an assist.\nTen days later he scored his first goal for the Reds and provided two more assists in a 4-1 win against Chelsea - earning him the man of the match award - and he has continued to impress when asked to deputise for Alexander-Arnold this season.\nLijnders also reveals in the documentary that he \"really fought\" for Bradley \"to be our number two behind Trent\".\nHe also fell out with Klopp over the decision to send the youngster on loan to Bolton in 2022.\n\"I was really trying to keep him in the club, because I believed that he would be already ready that time,\" Lijnders adds. \"The club makes a decision together with Jurgen to get him out on loan and it really upset me a lot. That was probably one of the only confrontations I had with Jurgen.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crrdd7rgj7qo"}