{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:43:50", "date_modify": "2025-05-20 13:43:50", "date_publish": "2023-08-01 02:55:55", "description": "Welsh freestyle BMX riders James Jones and Hollie Pipe hope to shine at UCI World Cycling Championships in Glasgow.", "filename": "sport_cycling_66337943_1747748630.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1641E/production/_130566119_bmxduo_jones_pipe_bbcsport.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66337943_1747748630.html", "title": "UCI Cycling World Championships 2023: Welsh BMX duo ready for Glasgow games", "title_page": "UCI Cycling World Championships 2023: Welsh BMX duo ready for Glasgow games - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Welsh freestyle BMX rider James Jones is aiming for what would be \"the biggest podium\" of his life at the UCI World Cycling Championships in Glasgow.\nHe will be joined by 19-year-old compatriot Holly Pipe at cycling's biggest ever global event.\nIt features 13 World Championships in seven disciplines, over 11 days.\n\"Ultimately, it's a bit different. The whole of cycling is there not just the BMX version so it's going to be pretty exciting,\" said Jones.\nThe Swansea native's first two World Championships were in China, then in Abu Dhabi, where he had to pull out with an injury.\nJones, 29, is looking forward to have a more \"local\" global championships this time.\n\"Don't get me wrong, a nice 12-hour flight isn't the best before going into a competition!\n\"My fiancee is coming and my family, they'll come up with the rest of the Team GB other halves, so it's nice to have people that can drive and not just spend a fortune to watch you ride.\"\nJones' year has been hampered by injuries.\n\"I've had a few ups and downs this year with injuries which has taken me out of a lot of events and losing points.\n\"I've tried to keep my body in tip top shape, but just like any sport, the slightest trip with a trick I can do every single day can knock you a couple of weeks back.\nDespite those setbacks Jones says he feels \"great\".\n\"I'm ready and I've got my tricks dialled in,\" added Jones.\n\"If you're not progressing in the sport, unfortunately as cliched as it sounds, in sport everyone is replaceable, so you have to keep, if you want to be top, adding things to it.\"\nWith a \"pop-up park\" being built at Glasgow Green, the riders will not know the make up of the terrain until they receive a photograph about a week beforehand.\n\"We're trying to analyse it, but from a photo you can't really get it, so you'll have about an hour practice.\n\"It's a bit of carnage, sometimes there are 30 people in a group, sometimes it's 10. It's fair and I much prefer it.\n\"Nobody benefits [from knowing the park set up previously] and the key is adapting and the more you ride different parks, it's easier.\"\nThe Welshman is aiming for the finals where he says it'll then be \"a roll of the dice\".\n\"If you land it, amazing. Ultimately, I want to be on that podium.\n\"With the injuries I've had this year, I think it will be the most special contest.\n\"I've been on a lot of podiums in my career, but to have that at a World Championship, at a UCI event, obviously with the Union Jack on your back, I don't think there could be a bigger one other than the Olympics.\"\nJones is one of eight riders in the British BMX freestyle park team who will compete in Glasgow.\nHowever, this time he will not be the only Welsh rider, with Pipe, of Caerphilly, set to make her debut.\nShe earned an eighth-place finish at the European Games in Krakow, her first senior final.\nPipe says the result has reassured her, saying: \"It was very important; it was my first taste of 'I can do this'.\n\"It's given me the confidence to go through to the World Championships.\"\nPipe is hoping for a similar course on Glasgow Green to the one she proved herself on in Poland.\n\"I'm hoping to see something similar to Krakow, I really got along with that course and I know the ramps are being built by the same people so I'm hoping it'll be something like that.\n\"I started off when I was very young in the skate park on my little 18 inch bike and then I got sidetracked to scooters.\n\"A year ago we had a competition here [in Cardiff], I gave it a go and ever since then I've been glued to the bike.\nPipe is joined in the women's competition by English pair Sasha Pardoe and Olympic champion Charlotte Worthington, the latter Pipe is drawing experience from.\n\"She's very helpful,\" said Pipe.\n\"She's had many experiences so she can reassure us it's okay, if you do this, you'll be fine.\"\nWhen asked what she was aiming for at her first World Championships, Pipe said: \"I'm hoping for a top 20 result, that's my aim.\n\"Recently in the international events I've got better and placed better so hopefully I can go better than I did in Brussels a few weeks ago. I'm super excited.", "url": "https://www.bbc.com/sport/cycling/66337943"}