{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:13", "date_modify": "2025-05-20 11:57:13", "date_publish": "2023-08-06 11:33:40", "description": "Southend's season-opening 4-0 win over Oldham was a fitting reward after a tough summer, says manager Kevin Maher.", "filename": "sport_football_66405377_1747742233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3704/production/_130648041_gettyimages-1556208649.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66405377_1747742233.html", "title": "Kevin Maher: Southend boss says opening win is reward for everyone after tough summer", "title_page": "Kevin Maher: Southend boss says opening win is reward for everyone after tough summer - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southend United's season-opening 4-0 win over Oldham was a fitting reward for fans and staff after a difficult summer, says manager Kevin Maher.\nThe club remains up for sale and have another date at the High Court on 23 August for the hearing of the latest winding-up petition.\nMaher's pre-season planning was also affected by a transfer embargo which is still in place.\n\"The strength of a football club is its fans,\" he told BBC Essex.\n\"And the staff that have stayed loyal to the football club deserved that as much as anyone.\n\"I'm delighted they come and watch football, the staff get to go their jobs properly and they can all go home happy, because that's what we are here for,\" Maher added.\nSouthend only received a safety certificate for their 71-year-old stadium on 1 August, which meant the game against Oldham could go ahead as scheduled.\nFollowing an early goal by Callum Powell, they added three more in the final minutes of the game in front of a crowd of 5,881 to make it an emphatic victory over an Oldham side that are expected to be among the favourites to push for promotion from the National League this season.\n\"I believe in the players and I believe in the club but I don't think anyone who turned up expected that, we were lucky to have a game on,\" Maher said.\n\"We won't get too far ahead of ourselves but it was, I suppose, an outpouring of relief about the football club that was needed, for everyone,\" he added.\nSouthend only had a matchday squad of 15 players because of the transfer embargo but two of those brought on as substitutes, Ollie Coker and Dan Mooney, were among the three scorers inside the final 10 minutes.\nMaher added: \"Cokes has got great quality, we see that in training. He had to go out on loan [to Aveley] last year to play men's football and we're pleased with how he came back.\n\"Moons, it was a hell of a finish - he's got that in his locker. People talk formations but he's a good player, he can play anywhere, what we've got to do is get him the ball in the right area to get the best out of him.\n\"He can make a difference in the final third where we probably didn't score enough goals last year.\"", "url": "https://www.bbc.com/sport/football/66405377"}