{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:29:56", "date_modify": "2025-04-26 07:29:56", "date_publish": "2025-02-27 00:00:00", "description": "Luke Humphries beats Luke Littler to win the fourth night of the 2025 Premier League Darts season in Exeter.", "filename": "sport_darts_live_crr0jg9nel4t_1745652596.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/672e/live/17992930-f55a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_live_crr0jg9nel4t_1745652596.html", "title": "Recap: Premier League Darts Exeter", "title_page": "Recap: Premier League Darts Exeter - Luke Humphries beats Luke Littler in final - scores, results & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Night darts fans - see you next week!\nOK, that's your lot from this week's Premier League darts, where Luke Humphries took a stranglehold of the early table by grabbing his second weekly win of the season after making a third final in four weeks.\nHe was not always at his best, but managed to find an extra gear just when he needed it in all three matches, while Luke Littler was incredible in his first two games but just faltered in the final.\nRead our report for the full details of how the night went down at the Westpoint Arena in Exeter and make sure you join us next Thursday for more top tungsten as the Premier League's darting roadshow hits Brighton.\nFA Cup of darts starts Friday\nThe big-time darts just keeps on coming as after tonight's Premier League the UK Open kicks-off on Friday from Butlin's Minehead Resort just up the road from Exeter.\nA bumper 158-player field is headed by defending champion Dimitri Van den Bergh in the unique event that sees amateur players mix it with the PDC's top dogs as well as developmental tour stars.\nThe multi-board event really is a feast of darts with all 158 players in action on the opening day, which will see higher ranked player enter round-by-round much like the FA Cup.\nTwo-time Women's World Matchplay champion Beau Greaves is in the field, with the 21-year-old star facing Switzerland's Stefan Bellmont in a fascinating first round tie that will attract plenty of attention.\nHow the Premier League table stands\nTwo nightly wins and three finals for Luke Humphries sees him top the Premier League table and alread he has a healthy lead over Luke Littler in second place but seven points adrift.\nPoor old Stephen Bunting is already getting slightly detatched from the pack so needs to get that first win as soon as possible.\nDream start for Humphries\nMore Luke Humphires talking about his start to the Premier League campaign on Sky Sports:\n\"Honestly it's a great start, on 15 points after four nights you could sit there thinking just win five or six more games and you're in finals night.\n\"Obviously I'd love to win the group but all that matters to me is being in the semi-finals.\n\"Being sat on 15 points after four weeks, that's a dream start to me and hopefully I can keep pushing and keep reeling in the points to guarantee a spot in the top four because that's all that really matters.\"\nMatch stats\nHumphries 6-4 Littler\nLuke Littler started the final in the same manner he'd played his first two matches, but his form dipped heading down the stretch as he finished with a 96.82 average that was well down on his first two efforts.\nLuke Humphries averaged 101.24 and win the 180 battle 6-5 while he was also better on the doubles hitting 6/13 as Littler hit 4/11.\nIt was the strong finish that did for Littler though, who maybe was just feeling that illness he said he was suffering with after all.\nStrong finishes fire Humphries\nHumphries 6-4 Littler\nLuke Humphries on his victory to Sky Sports: \"It felt hard work, but felt good in a weird way.\n\"I felt like my game was in a good place but in certain moments in the game I struggled so it was a bit strange.\n\"Luke played fantastic tonight, he didn't play as great in the final but I managed to step on the gas, like I did in the other two games, right at the end of the game, the last two legs were fantastic as they were against Gezzy and against Rob as well.\"\nHumphries hits back\nHumphries 2-3 Littler\nA 180 for Luke Humphries puts him in charge against the throw but a 180 leaves 80 for Luke Littler, and although he doesn;t finish the pressure is enough to force Humphries to really mess up on 76.\nHold the phone though, as Littler misses double 10 again, twice! He also misses double five as he hardly ever has to hit it, so Humphries takes a scrappy leg to get back into it.\nAnother big fish?\nWe've had a maximum 170 checkout in all three weeks of the Premier League so far, which is quite remarkable given how hard it is to follow those two treble 20s by hitting the Bull.\nBut also because it's not left that often as a finish - although players like Luke Littler are starting to leave it more and more.\nChris Dobey hit one on the opening night, Littler followed him in week two and Gerwyn Price hit one in Dublin last week during his victory.\nWill we get one in tonight's final?", "url": "https://www.bbc.co.uk/sport/darts/live/crr0jg9nel4t"}