{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-04-26 06:45:45", "date_modify": "2025-04-26 06:45:45", "date_publish": "2025-03-01 14:47:07", "description": "England's dismal Champions Trophy campaign ends with a sorry seven-wicket defeat by South Africa in Karachi.", "filename": "sport_cricket_articles_ce8v4qg7rvpo_1745649945.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ef8c/live/4695b980-f6ac-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_ce8v4qg7rvpo_1745649945.html", "title": "Champions Trophy 2025 results: England end with sorry defeat by South Africa", "title_page": "Champions Trophy 2025 results: England end with sorry defeat by South Africa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England's dismal Champions Trophy campaign ended with a sorry seven-wicket defeat by South Africa in Karachi.\nAlready out of the tournament after two losses from two, England were unable to lift themselves after captain Jos Buttler announced his impending resignation a day earlier.\nTheir batting woes deepened as they were bowled out for 179 in 38.2 overs, with Joe Root's 37 the highest score amid a flurry of horrid dismissals. Buttler made 21 in his final outing as skipper.\nThat effectively sealed England's seventh consecutive one-day international defeat by the halfway stage and South Africa took just 29.1 overs to complete their chase.\nJofra Archer took two early wickets but Rassie van der Dussen hit an unbeaten 72 and Heinrich Klaasen 64 from 56 balls as the pursuit became a procession.\nThe Proteas progress as group winners to the semi-finals, where they will play the loser of Sunday's match between India and New Zealand.\nEngland immediately head home after a torrid start to 2025. They have not been on a worse losing run for 24 years and their record in 2025 reads 10 defeats in 11 matches across one-day and T20 matches.\nThis is also the first time they have failed to win a match in the group stage of a global event.\nThere is, at least, a break of almost three months before their next fixture - a Test against Zimbabwe at Trent Bridge which begins on 22 May to mark the start of the men's home international summer.\nCoach Brendon McCullum said on Friday night he hoped England's players could \"put on a show\" to send-off Buttler. No such performance was forthcoming.\nIn defeats by Australia and Afghanistan in Lahore, England were competitive and could easily have won both fixtures had they been better in key moments.\nThis defeat, set in motion by weak batting, ranks among their lowest moments at world events with the players seemingly beaten up by their losses across six weeks in India and Pakistan.\nThe exit and Buttler's resignation allows the rebuild to start immediately with McCullum and managing director Rob Key's first task to appoint a new captain.\nButtler's time began with victory in the T20 World Cup in Australia, at which point England were the holders of both white-ball World Cups.\nThey no longer look like contenders, never mind champions. The road to recovery could be long.\nEngland's slide to defeat began in the first over when Phil Salt, having crashed two fours, tamely top-edged a pull to mid-wicket for nine.\nHis tournament tally of 30 runs in three innings is six better than Jamie Smith's, who ended with a three-ball duck as he departed in identical fashion to Salt.\nThere was to be no rebuild from Ben Duckett and Root this time. The former chipped a return catch to Marco Jansen, who dismissed the top three in taking 3-39, via a leading edge, while Root was bowled by seamer Wiaan Mulder.\nIn between, Harry Brook, many people's favourite to take over from Buttler, offered too much air in attempting to clear mid-wicket and was brilliantly caught by the sprawling Jansen on the boundary.\nSouth Africa's fielding was superb – Lungi Ngidi athletically catching Jamie Overton while running back from mid-on – but a frazzled England were inept in their decision-making.\nThe worst dismissal was that of Liam Livingstone, who charged spinner Keshav Maharaj, attempted a hack to leg, missed and was stumped for nine.\nButtler's final innings as captain ended in tame fashion as he looped Ngidi to mid-off. When Mulder nicked off Adil Rashid to finish with 3-25, England had been dismissed inside their allotted overs for the eighth time in 11 matches this year.\nEngland captain Jos Buttler: \"That was a really disappointing performance. We were so far short of the mark there.\n\"We're just not going on and making those big telling contributions, which has been the story of this side for a little while now.\n\"I don't know why. As a whole group, not just batters, we're not getting the results and that does take away your confidence.\n\"There is no doubt that the talent is there, there is all the makings of a really good side so I do believe it can be turned around.\"\nSouth Africa captain Aiden Markram: \"The boys were really good. The wicket was quite slow, slower than we expected, and changed our initial plans. The boys adapted to the conditions out there and through that, we were able to take wickets throughout the innings and keep the momentum.\"\nOn potentially playing a semi-final in Dubai: \"We'll have to see when we get there what conditions are going to be like. We've got a great squad with great options and ultimately, we'll pick the squad to get the job done on the day.\"\nChief cricket commentator Jonathan Agnew on Test Match Special: \"A wretched performance from England and yet not necessarily unexpected.\n\"It was a dispirited team, zero confidence and the 'we can't wait to get home' attitude was evident.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/ce8v4qg7rvpo"}