{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:54:09", "date_modify": "2025-05-20 12:54:09", "date_publish": "2023-08-01 12:50:43", "description": "Follow the latest news stories from the National League, including transfers and selected contract announcements.", "filename": "sport_football_66374980_1747745649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1267C/production/_116688357_shutterstock_editorial_10948936e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66374980_1747745649.html", "title": "National League news - August 2023", "title_page": "National League news - August 2023 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Sport tracks the latest news stories from the National League, including managerial announcements, new signings and contract extensions.\nCheck out the gossip page for the latest rumours, use our transfers page to track signings made by English Football League clubs or read more National League news from July.\nAldershot Town have signed Southampton goalkeeper Jack Bycroft on a one-month loan.\nThe 21-year-old spent time on loan at National League South side Taunton Town last season, where he kept 19 clean sheets in 48 games.\nManager-less York City have handed a two-year contract extension to goalkeeper Maison Campbell.\nThe 20-year-old has played once this season.\nEastleigh have sacked managed Lee Bradbury and assistant manager Brian Stock with immediate effect.\nThe Spitfires have yet to win in the National League so far this season and are 18th with three draws and two losses - Richard Hill and Jason Bristow will lead the team whilst a new manager is recruited.\nHalifax have signed former Watford forward Jimiel Chikukwa, 20.\nThe Shaymen have not stated how long a deal Chikukwa, who has been without a club since being released by the Hornets in the summer of 2022, has signed.\nWoking have signed Ipswich Town midfielder Zak Bradshaw on loan.\nThe 19-year-old is yet to make his senior debut for the Tractor Boys but has spent time on loan at Chelmsford, Bromley and Braintree.\nOxford City have signed Fulham forward Olly Sanderson on a season-long loan.\nThe 19-year-old spent time on loan with the club last season as they were promoted from National League South.\nGateshead have signed versatile defender Joe Grayson on a one-year deal.\nThe 24-year-old, who is the son of former Blackpool, Leeds and Preston boss Simon Grayson, was a free agent after leaving Barrow at the end of last season.\nYork City have signed Middlesbrough midfielder Jack Stott on loan until 1 January.\nThe 19-year-old could make his professional debut against Dorking on Saturday.\nMaidenhead United have signed former Crystal Palace forward David Omilabu.\nThe 20-year-old, who featured six times for the Premier League club's Under-21 side in the EFL Trophy, becomes the Magpies' ninth signing of the summer.\nDorking Wanderers have signed Matt Everitt following the striker's departure from Brighton & Hove Albion.\nThe 20-year-old Republic of Ireland Under-19 international did not play a senior game for the Seagulls, but did feature in Premier League 2 for the Sussex club.\nRochdale have signed Bolton Wanderers left-back Max Conway on loan until the end of the season.\nThe 19-year-old had a stint with National League North outfit Buxton last season, making 26 league appearances.\nBoreham Wood defender Chris Bush has signed a new two-year contract, with the option of a further 12 months.\nBush, 31, who has been at the Wood since December 2022, will now stay until at least the end of the 2024-25 season.\nAFC Fylde have signed Middlesbrough goalkeeper Max Metcalfe on a three-month loan deal.\nThe 20-year-old, who has represented Scotland at Under-19 level, had loan spell in National League North with Spennymoor Town last season.\nKidderminster Harriers have signed Motherwell midfielder Barry Maguire on loan until January.\nFormer Scotland Under-21 international Maguire, 25, will help cover the loss of Shane Byrne to injury. But boss Russ Penn said: \"We were in conversation with him while Shane was fit, so it's not a replacement, it's an add-on.\"\nSolihull Moors have agreed a deal to sign defender Jay Benn on a season-long loan deal from Lincoln City.\nThe 21-year-old, who came through the ranks at FC Halifax Town before joining the Imps, spent time on loan at Bohemians in the League of Ireland last season.\nBoreham Wood have signed midfielder Liam O'Neil following his departure from League One side Cambridge United.\nThe 30-year-old began his career at West Bromwich Albion, for whom he made three Premier League appearances, and appeared 167 times for Cambridge, scoring seven times, after moving to the Abbey Stadium in 2017.\nChesterfield have signed Macclesfield forward James Berry for an undisclosed fee on a three-year deal.\nThe 22-year-old scored 26 goals in 35 appearances for the Silkmen in 2022-23.\nRochdale have signed winger Jesurun Uchegbulam for an undisclosed fee from fellow National League side Chesterfield.\nThe 22-year-old, who joins on a two-year deal, made a total of 38 appearances for the Spireites, concluding Saturday's 4-3 win over Dorking.\nOldham Athletic have signed defender Kieron Freeman, 31, on a six-month deal following his release by League One side Portsmouth.\nThe former Derby and Sheffield United right-back made just seven appearances for Pompey last season, including just one in the league.\nBromley have signed former Brighton winger Todd Miller on a permanent deal.\nThe 20-year-old made 11 appearances on loan at League Two Doncaster last season, before being released by Brighton this summer.\nWealdstone have signed Newport County midfielder Sam Bowen on a season-long loan deal.\nThe 22-year-old Wales Under-21 international made 14 appearances for the Exiles last season after joining from Cardiff City.\nRochdale have signed midfielder Tommy McDermott on loan from League One side Port Vale until January.\nThe 18-year-old, who made his senior debut last season after coming through the Vale academy, has now made six appearances, including Tuesday's EFL Cup win over Fleetwood.\nAltrincham have signed defender George Burroughs following his release from Championship side Coventry City at the end of last season.\nThe 20-year-old, who came through the Sky Blues' academy, had been on trial with the Robins.\nStockport County have recalled winger Cody Johnson from his loan at Rochdale.\nJohnson, 19, who signed in June and played in all the club's pre-season matches, was part of the Dale matchday squad on the opening day.\nMaidstone United have signed midfielder Liam Sole after a successful trial.\nThe former Watford, Milton Keynes Dons and Nottingham Forest academy player previously played for St Albans City.\nBoreham Wood have signed former Queens Park Rangers midfielder Charlie Owens.\nThe 25-year-old played in three League Cup ties for the R's during his six years at Loftus Road and also had loan spells at Colchester United and Wycombe Wanderers.\nAldershot Town have signed 21-year-old wing-back Olly Scott on a non-contract basis.\nThe left-sided player was most recently at King's Lynn Town, where he played under Shots boss Tommy Widdrington and has also spent time at Blyth Spartans and Consett.\nOxford City have signed former England youth international Nya Kirby for the forthcoming National League season.\nThe 23-year-old, who was part of the England side that won the Under-17 World Cup in 2017, was a youth player at Tottenham and Crystal Palace and also had loan spells at Tranmere Rovers and Blackpool.\nMaidenhead United have signed former Carlisle United striker Toby Sho-Silva and ex-Luton defender Casey Pettit for the 2023-24 season.\nThe 28-year-old Sho-Silva helped Sutton United win the National League title in 2021 and has also played for Dover Athletic, Bromley and FC Halifax Town in the fifth tier.\nPettit, 20, joins after being released by the Hatters.\nChesterfield have signed 31-year-old winger Michael Jacobs following his release by League One Portsmouth.\nSolihull Moors have signed veteran centre-back Richard Stearman on a one-year deal.\nThe 35-year-old, who has made 77 top-flight appearances, was released by League One Derby after two seasons with the Rams.\nChesterfield have signed goalkeeper Ryan Boot on a one-year deal.\nThe 28-year-old had a trial with the Spireites in pre-season after leaving Solihull, for whom he made 193 National League appearances.\nHalifax Town have signed midfielder Jack Evans, 22, after a successful trial.\nThe National League side say they have agreed an undisclosed financial agreement with his former club Hereford.\nOldham have signed midfielder Brennan Dickenson, 30, on a one-year deal after he was released by Carlisle earlier this summer.\nHe suffered an anterior cruciate ligament injury last August and did not feature at all in the 2022-23 season.\nThe Latics also signed James Norwood from Championship side Barnsley for an undisclosed fee.\nMaidenhead United have signed 21-year-old goalkeeper Daniel Jinadu.\nThe former Barnsley youngster spent last season at Dartford and also had a loan spell at Margate.\nAldershot Town have signed Portsmouth's Tanzania international defender Haji Mnoga on loan until the end of the season.\nThe 21-year-old played 17 times for the Shots while on loan last season and has also spent time in League Two at Gillingham.\nGateshead have re-signed midfielder Luke Hannant on a two-year deal.\nThe 29-year-old, who was a free agent after being released by Colchester earlier this summer, previously played for the Heed between 2016 and 2018.\nSouthend United defender Tom Clifford has joined National League North club King's Lynn Town after cancelling his contract with the Shrimpers.\nClifford, 23, who had been with Southend since their EFL days, scored five goals in his 62 league appearances for the National League club.\nStockport County have loaned striker Billy Chadwick to Gateshead for the season.\nThe 23-year-old, who only joined the Hatters this summer after his release by Hull City, spent part of last season at Boston United in National League North.\nAldershot Town have signed midfielder Ethan Burnett following a successful trial.\nThe 21-year-old, who has spent time on the books at Southampton and Reading, made 24 appearances during a loan spell with National League South side Havant & Waterlooville last season.", "url": "https://www.bbc.com/sport/football/66374980"}