{"authors": ["Tom English", "www.facebook.com"], "date_download": "2025-05-20 14:14:12", "date_modify": "2025-05-20 14:14:12", "date_publish": "2023-07-29 19:51:57", "description": "Darcy Graham underlines his importance for Scotland in an otherwise largely forgettable World Cup warm-up win over Italy, writes Tom English.", "filename": "sport_rugby-union_66351484_1747750452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/159E4/production/_130584588_20805073.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66351484_1747750452.html", "title": "Scotland 25-13 Italy: 'Darcy Graham delivers emphatic World Cup message'", "title_page": "Scotland 25-13 Italy: 'Darcy Graham delivers emphatic World Cup message' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was an interesting piece about Bill McLaren in the programme for Scotland's first World Cup warm-up game against Italy at Murrayfield, a fascinating exploration of the great man's connection with the land of the visitors.\nBefore World War Two, Bill played for the Combined Services in Milan and Trieste. He fought in the battle for Monte Cassino, learned some of the language, signed greetings in the local vernacular - Buona Fortuna, Bill McLaren - and, post-War, was billeted in Milan as governor of a prison for civilians.\nWe thought of Bill as we tried to come up with some words to describe fellow Hawick man Darcy Graham's return to international rugby following the MCL injury that took him out of the Six Nations.\nWhen we last saw Graham playing for Scotland he scored a hat-trick against Argentina which was just a week after scoring against the All Blacks in a season that saw him score 16 tries in 14 games for club and country.\nHis double against Italy at Murrayfield on Saturday made it 18 tries in his last 15 games and, in Test rugby, 18 in his 34 caps. Outside of Will Jordan of the All Blacks, that's a return that would stack up nicely against any wing in the world game.\nIn Graham's absence in the Six Nations, Kyle Steyn did a stellar job but here we had Graham delivering an emphatic message to his coach, Gregor Townsend. On an error-strewn day, his contribution stood out.\nGraham's consistency would have brought a gem from Bill if only he was still around to deliver his one-liners. He once brilliantly captured the flying and frenetic Irish winger, Simon Geoghegan, when calling him Bambi on speed, so Lord knows what he would have come up with for a fellow son of Hawick. It would have stuck, no matter what.\nGraham's return is a godsend because he's a classy finisher and Scotland are going to need as many of those types of characters as they can lay their hands on in the coming months.\nThey're huge underdogs to get out of one of the most evil World Cup pools ever imagined, but Graham's ability to execute offers hope. South Africa, who only just squeezed past Argentina by a single point on Saturday, will have a plan to stop him when the countries meet in Marseille in September, but they'll have to catch him first.\nThis was never going to be a flamboyant experience against Italy. A first nod of the season with new combinations, a creaky understanding, a wet ball and a whole load of mistakes. A classic, it was not.\nAll the roads around Murrayfield were closed unusually early ahead of kick-off. Whether that was to stop ticketless fans getting in or ticketed fans getting out is a moot point. It was sloppy out there. Early on, a seagull interrupted proceedings by parking himself on the pitch and allowing the play to happen around him.\nEventually, stadium staff threw a blanket around him and gently carried the bird away for his own good. That kind of treatment might have had a few more takers in the stand at the time, but the stop-start, lack of continuity and tempo and intensity can't have come as a much of surprise to anybody.\nFirst hit-outs in World Cup years are nearly always like this. You win, you report a clean bill of health if you're lucky and you move on. That was the way of it for Scotland. Every man is still standing as France approach next weekend. One game down, three more to go before the glorious circus begins in Marseille.", "url": "https://www.bbc.com/sport/rugby-union/66351484"}