{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-05-20 12:06:19", "date_modify": "2025-05-20 12:06:19", "date_publish": "2023-08-04 20:28:49", "description": "Chris Jordan smashes an unbeaten 70 off 32 balls as Southern Brave beat Welsh Fire by two runs in a last-ball Hundred thriller.", "filename": "sport_cricket_66409245_1747742779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16A7B/production/_130659729_44d4761bd659fd86b84905728b9936e846f114fb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66409245_1747742779.html", "title": "The Hundred 2023: Chris Jordan's explosive hitting helps Southern Brave beat Welsh Fire", "title_page": "The Hundred 2023: Chris Jordan's explosive hitting helps Southern Brave beat Welsh Fire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n4 August 2023\nChris Jordan hit an unbeaten 70 off 32 balls as Southern Brave beat Welsh Fire by two runs to chalk up their first win in this year's edition of The Hundred.\nBrave were struggling on 76-8 before Jordan pummelled seven sixes and three fours to help them post 147-8.\nHaris Rauf snared 3-27 for Fire as he and fellow Pakistan quick Shaheen Afridi (1-16) impressed with the ball.\nDavid Willey's 31 got Fire close but with three needed off the final ball he skied Tymal Mills and was caught.\nWhat else do you need to know?\nJordan hit Welsh Fire left-arm spinner Roelof van der Merwe for three consecutive sixes before he clipped David Payne off his pads for another maximum to bring up his half-century off 26 balls.\nBrave were without Jordan - England's highest wicket-taker in T20 internationals and specialist bowler at the death - when they fielded after he picked up a calf injury while batting.\nLeft-arm quick Mills (2-23) and leg-spinner Rehan Ahmed (2-28) were the pick of the Brave bowlers as they defended a first-innings total which was well below the average winning score (168) for games at the Ageas Bowl in The Hundred.\nWelsh Fire's Stephen Eskinazi scooped his first ball for six before he was stumped for 31 off 18 balls as he joint top-scored with Willey.\n'I haven't seen a better white-ball knock' - what they said\nFormer England batter Michael Carberry on BBC Radio 5 Sports Extra: \"In the circumstances, I haven't seen a better white-ball knock than Chris Jordan's for some time. It was a clever knock. He just had the IQ to know when to put his foot down and then to play smart.\"\nMatch Hero Chris Jordan told Sky Sports: \"I just tried to take it as deep as possible. When I came in a run a ball would have got us up to about 110 and you hope for some boundaries to get up to 130.\n\"We just got on a roll and kept it going. It was just about commitment. The wicket wasn't as easy out there, our top five struggled. It was just commitment to going really.\n\"I would definitely have rather been out there fielding. I thought the boys bowled really well. Everyone stood up. Guys are having to perform different roles and, although it's just been two games, there's a lot of trust in the changing room that somebody will step up and get the job done.\"\nYou can watch Hundred matches on BBC Two and BBC iPlayer every Wednesday and Saturday throughout the competition, alongside both finals on Sunday, 27 August. More details here.\nRelated topics", "url": "https://www.bbc.com/sport/cricket/66409245"}