{"authors": ["Lauren McCann", "www.facebook.com"], "date_download": "2025-05-21 05:56:39", "date_modify": "2025-05-21 05:56:39", "date_publish": "2024-12-24 17:10:55", "description": "Ahead of the traditional full round of festive Irish Premiership fixtures on Boxing Day, BBC Sport NI previews each of the six games.", "filename": "sport_football_articles_c62w0qn63gyo_1747806999.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0257/live/e8b75b20-c136-11ef-b048-3fdcacb3a3ee.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62w0qn63gyo_1747806999.html", "title": "Irish Premiership: Festive football awaits with full round of Boxing Day fixtures", "title_page": "Irish Premiership: Festive football awaits with full round of Boxing Day fixtures - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For Irish Premiership fans the traditional derby games on 26 December are almost as exciting as Christmas Day itself.\nA rare matchday where all 12 teams are playing at the same time and with nearly all games sold out, it is truly a festive highlight for Irish League supporters.\nAhead of the big day, BBC Sport NI has compiled a preview on each of the six games.\nIn addition to radio coverage on Sportsound on BBC Radio Ulster and BBC Sounds, the BBC Sport website will have live text updates, a report, reaction and highlights on one of the most anticipated days of the season.\nSuspensions have hampered Ballymena boss Jim Ervin's preparations ahead of their game away to Coleraine.\nKey men Ben Kennedy and Josh Carson will sit this one out as both were sent-off in Ballymena's 3-2 win against Loughgall on Saturday.\n\"It's a headache I could have done without, but it gives other players opportunities,\" Ervin said.\nThe Sky Blues will be desperate to get a first victory of the season against the Bannsiders, who won 4-2 when the sides met at Ballycastle Road in August and 1-0 at the Showgrounds in October.\nColeraine manager Dean Shiels has had longer to prepare his side for the game as they were not in action on Saturday, and the hosts will hope to end a run of three games without a win in the league.\nTwo sides that have struggled for results lately, both will be looking for a win at Seaview that could reignite their stuttering seasons.\nThe north Belfast rivals played out a 1-1 draw in their first derby of the season in August before the Reds claimed a narrow 1-0 win in November.\nInjuries and suspensions have decimated both squads. The Crues are currently missing eight first-team players, while Cliftonville are without the suspended Jonny Addis and Odhran Casey.\n\"The quicker I get injured players back the better, but we can't feel sorry for ourselves,\" Crues boss Declan Caddell said after his side's 1-0 defeat at Portadown.\n\"Both teams are going through a tough spell at the minute with a few defeats in a row and it's two teams that will look to put things right,\" Cliftonville assistant manager Gerard Lyttle reflected.\nIt's been a torrid season so far for Loughgall, who are six points adrift at the bottom of the table having won just three games.\nManager Dean Smith, however, will take confidence from the fact that the Villagers produced one of their best performances of the campaign when they beat the Swifts 3-1 in October.\n\"It's a derby game and we have to try pick ourselves up for it,\" he said after their latest defeat against Ballymena.\nSwifts boss Rodney McAree hopes his players are ready for Thursday after a quick turnaround from Monday's defeat against Larne.\n\"Loughgall came here and beat us last time, so we have to make sure we're ready and focused and go about our business the right way,\" he said.\nOne side struggling for form at the bottom of the table whilst the other is unexpectedly flying high in second, it has been a tale of two very different seasons for Glenavon and Portadown.\nIn their head-to-head meetings it's one win apiece so far this term with Glenavon claiming a 2-1 home win in October and Portadown a 1-0 victory at Shamrock Park in November.\n\"It's sold out at Mourneview and it's set up for a cracking game. We should take a lot of confidence from our performance against Linfield [a 1-0 loss] into the game,\" said Glenavon boss Paddy McLaughlin.\nMeanwhile Portadown boss Niall Currie will hope his side can continue their great start to the season as they welcome Shay McCartan back from injury.\nThese two sides are yet to meet in the league this season due to Larne's European commitments that has led to them having six games in hand.\nIt will be a first taste of the east Antrim derby for Carrick boss Stephen Baxter, who has had longer to prepare as his side did not play at the weekend.\nLast season Larne had the upper hand in games between the two sides, winning all three games, including an emphatic 4-1 home victory.\nGary Haveron is taking charge of his first Boxing Day derby as boss of Larne and is hoping his side can continue their push up the table with another win.\n\"We need our fans to come out and support us. We want to implement our style of play on them, we know how Carrick play, but we need to focus on what we do well,\" commented Haveron.", "url": "https://www.bbc.com/sport/football/articles/c62w0qn63gyo"}