{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:20:14", "date_modify": "2025-05-21 07:20:14", "date_publish": "2025-01-13 19:02:51", "description": "Bristol Bears may be without Joe Batley and James Williams for their must-win trip to Clermont on Saturday.", "filename": "sport_rugby-union_articles_c334e7r0gy4o_1747812014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8b0/live/cf4cbe00-d1df-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c334e7r0gy4o_1747812014.html", "title": "Pat Lam: Bristol Bears' injured duo may miss must-win Clermont clash", "title_page": "Pat Lam: Bristol Bears' injured duo may miss must-win Clermont clash - Lam - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Bears may be without Joe Batley and James Williams for their must-win European Champions Cup trip to Clermont on Saturday after the pair suffered injuries in the win over Benetton.\nBatley was withdrawn in the opening minutes of their 35-29 victory and replaced by Steele Barker, with coach Pat Lam revealing post-match that his starting lock had picked up a \"potentially serious injury\", believed to be to his ankle.\nSpeaking to BBC Radio Bristol, Lam also said he believes opening try scorer Williams has broken a finger, but that Irish international fly-half Harry Byrne was only suffering with cramp.\n\"You've got to remember, Harry hasn't played many 80 minutes [this season], his calves were starting cramp, and you can see the disruption that happens for us when you lose a quality 10,\" Lam said.\nThe bonus-point win kept their hopes of reaching the last 16 alive, but Lam lamented his side's lack of discipline in the first half.\nHe said: \"We gave over so many turnovers, penalties. We spent a lot of time on defence. We were losing set pieces, lineouts, scrums and we just couldn't get any momentum or foothold into the game.\"\nThe Bears boss continued: \"Once we got the ball and could put some real pressure on, Harry [Byrne] started to cramp and then James Williams I think has broken a finger, obviously Joe Batley has got a potentially serious injury, so the adjustment in the backline causes a few issues and when you're going up against these good, quality players, they opened us up a few times.\n\"There were some calls that were a little bit tough but the thing I'm pleased about is that we found a way, we hung in there and got the win. We could play well and all but ultimately we needed the win and needed the five points, and that's what we got.\"\nAs for the Saturday's visit to Clermont - which comes with a knock-out spot hanging in the balance - Lam continued: \"Now we see what happens; to go to a great place like Clermont, what a challenge. Something we can get excited by.\n\"When you look at the selection there's a lot of guys that haven't played together, so we're building a little bit of that. We'll look at what we've got, dust ourselves, see who's available and pick as strong as we can to hopefully get the job done there.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c334e7r0gy4o"}