{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:18:48", "date_modify": "2025-05-20 14:18:48", "date_publish": "2023-07-29 13:12:21", "description": "Uruguay striker Edinson Cavani joins Argentine side Boca Juniors on an 18-month contract after his deal with Valencia is terminated.", "filename": "sport_football_66347977_1747750728.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11BAA/production/_130581627_gettyimages-1258463917.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66347977_1747750728.html", "title": "Edinson Cavani: Boca Juniors sign Uruguay striker after Valencia contract terminated", "title_page": "Edinson Cavani: Boca Juniors sign Uruguay striker after Valencia contract terminated - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Uruguay striker Edinson Cavani has joined Argentine side Boca Juniors on an 18-month contract after his deal with Valencia was terminated.\n\"Happy to have you home,\" the Buenos Aires-based club wrote on Twitter.\nCavani, 36, had a contract until June 2024 at Valencia after joining from Manchester United last summer.\nBut the former Paris-St Germain player scored just seven goals in 28 games last season for the Spanish side.\nValencia finished two points above the La Liga relegation zone in 2022/23 and have changed their manager seven times in three years.\nCavani remains part of the international setup with Uruguay, and has scored 58 goals in 136 appearances for his country.\nHe left Danubio in his homeland for Palermo of Serie A in 2007, before developing a reputation as an elite goalscorer in spells with Napoli and PSG before his transfer to United in 2020.\nBoca Juniors won their 35th Argentine league title in 2022, but are eighth in this season's table as things stand.\nEx-United goalkeeper Sergio Romero and former Marseille striker Dario Benedetto are the star names in the Buenos Aires side's squad.", "url": "https://www.bbc.com/sport/football/66347977"}