{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:40:07", "date_modify": "2025-05-21 07:40:07", "date_publish": "2025-02-11 00:00:00", "description": "Follow live text commentary, score updates and match stats from Sporting CP vs Borussia Dortmund in the UEFA Champions League", "filename": "sport_football_live_c627e00de89t_1747813207.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c627e00de89t_1747813207.html", "title": "Guirassy stars as Dortmund see off Sporting", "title_page": "Sporting 0-3 Borussia Dortmund: Serhou Guirassy stars as Dortmund see off Sporting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "This will be the fifth meeting in European competition between Sporting CP and Borussia Dortmund, with each of the previous four all coming in the UEFA Champions League group stage; BVB won the first three but the Lions won the most recent in November 2021, 3-1 at Estádio José Alvalade.\nBorussia Dortmund have a better win rate against teams from Portugal (P14 W9 L5 – 64%) than against sides from any other nation they have faced more than 10 times in European competition; meanwhile Sporting CP have suffered more defeats to German opposition than any other nation (P31 W4 D6 L21).\nSporting CP have failed to win all four of their UEFA Champions League matches since Rúben Amorim departed the club (D1 L3) and head into the knockout phase play-offs on the longest winless streak of any team that progressed out of this season’s league phase.\nBorussia Dortmund have won the away leg in just two of their last 12 UEFA Champions League two legged knockout ties (D1 L9), beating Sevilla in the 2020-21 last 16 (3-2) and PSG in last season’s semi-final (1-0).\nSporting CP will be aiming to reach the round of 16 of the UEFA Champions League for just the third time, after doing so in the 2008-09 (lost 1-12 on aggregate to Bayern Munich) and 2021-22 campaigns (lost 0-5 on aggregate to Manchester City).\nOnly Barcelona (28) scored more goals in this season’s UEFA Champions League group stage than Borussia Dortmund (22) with the German side only averaging more goals in single edition of the competition in 2016-17 (2.80) than 2024-25 (2.75). BVB averaged just 1.31 goals per game en route to finishing as last season’s runners-up.\nBorussia Dortmund manager Niko Kovac is unbeaten in each of his six UEFA Champions League away games (W4 D2 with Bayern Munich), the most matches a manager has taken charge of on the road in the competition without suffering defeat.\nSporting CP spent more time in a losing position than any other team that progressed from this season’s UEFA Champions League league phase (339 minutes), while they faced more expected goals per 90 minutes in that game state (1.9) than when in a leading position (1.2) or drawing (1.8).\nSerhou Guirassy was the joint-top scorer during the league phase of this season’s UEFA Champions League (9 – level with Robert Lewandowski). If he finds the net in this game, he’ll equal the record for most goals in a single European Cup/Champions League campaign by a Borussia Dortmund player, along with Erling Haaland (10 in 2020-21) and Robert Lewandowski (10 in 2012-13).", "url": "https://www.bbc.com/sport/football/live/c627e00de89t"}