{"authors": ["Millie Sian", "www.facebook.com"], "date_download": "2025-04-26 04:37:44", "date_modify": "2025-04-26 04:37:44", "date_publish": "2025-02-28 11:02:02", "description": "Fabian Hurzeler press conference: Newcastle vs Brighton", "filename": "sport_football_articles_cjd33ml7n7no_1745642264.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjd33ml7n7no_1745642264.html", "title": "Fabian Hurzeler press conference: Newcastle vs Brighton", "title_page": "Fabian Hurzeler press conference: Newcastle vs Brighton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "He managed to enjoy his birthday \"a little bit\" on Wednesday, but added: \"There is not enough time to relax because I think the next challenge ahead of us will be tough, so we have had to prepare the best we can.\"\nThere are no new injury concerns but there will be no returnees for the FA Cup game. He is looking forward to captain Lewis Dunk being back in contention, even if this game \"will be a little bit too early\".\nJanuary arrival Eiran Cashin will be available after missing out on the squad to face Bournemouth in the Premier League earlier this week.\nIt will be \"very important\" to \"find the balance\" between fielding experienced players and giving younger players a chance: \"The most important thing is that we get the most fresh and most ready team on the pitch.\"\nThis is a \"do-or-die game\" for the Seagulls, who are looking to progress to the quarter-finals of the competition: \"The longer it goes on, the closer you get to the final. It is a chance to win something. We have to go all in and be ready to compete against Newcastle.\"\nWith Liverpool and Arsenal already out of the FA Cup and another four Premier League sides set to exit in the fifth round, he agreed there is \"for sure a chance\" that Brighton could challenge for the trophy due to \"less top clubs being in the tournament\".\nHe added: \"You never know what's going to come next and this year's competition has already proven that. There have been some crazy results, so I won't say the percentage [of us winning it] is increasing but the chance to win something is always a little bit higher if the top clubs aren't there.\"\nHe acknowledged Newcastle United's recent form at St. James' Park: \"They have been impressive. They are a very athletic and dynamic team. They have lots of players who can run a lot of metres at a high speed. It's very special. They can play very intensely because of that, so we have to be ready.\"\nTherefore Brighton's challenge will be to make the Magpies supporters \"as silent as possible\" because \"they are able to support their team in an unbelievable way\".\nHe doesn't want to over-promise during his first season at the club: \"I always try to give everything for the club and I want the club to be the most successful. We can promise our supporters that we try to do everything on the pitch and off the pitch to make them proud, but we can't promise to win a title.\"\nFinally, on whether owner Tony Bloom and chief executive Paul Barber have made their FA Cup expectations clear: \"I always know their ambition and what they want to achieve because it's a regular exchange where we always share our thoughts. They haven't called me before this game to say we have to win it. It's more of a regular exchange. Therefore, I already know their expectations.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cjd33ml7n7no"}