{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:58:34", "date_modify": "2025-05-20 11:58:34", "date_publish": "2023-08-06 09:41:12", "description": "South Africa score 21 unanswered points as they come from behind to beat Argentina in a World Cup warm-up match in Buenos Aires.", "filename": "sport_rugby-union_66420934_1747742314.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80E4/production/_130669923_south_africa_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66420934_1747742314.html", "title": "Argentina 13-24 South Africa: Springboks win World Cup warm-up in Buenos Aires", "title_page": "Argentina 13-24 South Africa: Springboks win World Cup warm-up in Buenos Aires - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "South Africa came from behind to beat Argentina 24-13 in a World Cup warm-up match in Buenos Aires.\nTrailing 10-3 at half-time after a Gonzalo Bertranou try and Emiliano Boffelli penalty, the world champions scored 21 points in the second half.\nMakazole Mapimpi and Canan Moodie touched down and Manie Libbok kicked 14 points for South Africa.\nSouth Africa beat Argentina 22-21 in Johannesburg last week to finish second in the Rugby Championship.\nSouth Africa coach Jacques Nienaber made 13 changes to that side, with several players given the chance to impress at Estadio Jose Amalfitani on Saturday as they compete for a place in the 33-player World Cup squad.\n\"We have given 38 players the opportunity to play (in four games) and it is going to be a very difficult squad selection meeting. Many guys put their hands up over the last few weeks,\" Nienabar said.\n\"We tried to make sure everyone had a proper run of minutes, though, having said that, it is impossible to give each player the same game time because you want to build combinations.\"\nThe World Cup in France starts on 8 September.\nSouth Arica are in Pool B with Ireland, Scotland, Tonga and Romania, while Argentina will play England, Japan, Samoa and Chile in Pool D.\nSouth Africa will play warm-up matches against Wales and New Zealand before they meet Scotland in their World Cup opener on 10 September.", "url": "https://www.bbc.com/sport/rugby-union/66420934"}