{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-19 14:41:00", "date_modify": "2025-05-19 14:41:00", "date_publish": "2017-07-19 16:40:47", "description": "Man City and Chelsea are vying for Real Madrid's Danilo, as Pep Guardiola confirms Sergio Aguero will stay at Etihad Stadium.", "filename": "sport_football_40661051_1747665660.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96BE/production/_97009583_gettyimages-679755882.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40661051_1747665660.html", "title": "Danilo: Manchester City and Chelsea both want Real Madrid defender", "title_page": "Danilo: Manchester City and Chelsea both want Real Madrid defender - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City and Chelsea are vying for the £26m signing of Real Madrid's Brazilian right-back Danilo.\nCity manager Pep Guardiola sees Danilo as someone who can play both full-back positions and in midfield, while Chelsea counterpart Antonio Conte wants to strengthen an area of perceived weakness in his squad.\nBut Conte will not be signing City's Sergio Aguero, according to Guardiola.\nCity's Spanish boss said: \"He's our player. He will remain here.\"\nConte reportedly wanted to sign the striker as a replacement for out-of-favour Spain forward Diego Costa.\nWalker left Tottenham for Man City 'to lift trophies'\nDanilo, 26, joined Real Madrid from Porto in 2015 but was the Spanish club's second-choice right-back for much of last season.\nHe started 17 La Liga matches for champions Real, with Dani Carvajal preferred for most of the big games, including the Champions League final.\nCity, who finished third in the Premier League last season, have already signed four players this summer - goalkeeper Ederson Moraes, right-back Walker and winger Bernardo Silva, plus teenage midfielder Douglas Luiz.\nSpeaking in the build-up to Thursday's pre-season game against Manchester United in Houston, Guardiola said they were talking to \"three or four\" more.\n\"They are young players, with the next three, four, five years in mind,\" he added.\n\"We have options for players coming, but until the deal is done, out of respect for the other clubs I cannot say anything.\"\nAs well as Danilo, City have also been linked with Monaco left-back Benjamin Mendy., external\nGuardiola said: \"Mendy is the same case as Danilo, we have targets and we see what happens. He's a Monaco player so I'm quiet in my comments.\"", "url": "https://www.bbc.com/sport/football/40661051"}