{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:52", "date_modify": "2025-05-21 07:52:52", "date_publish": "2025-01-22 09:47:10", "description": "Bolton Wanderers sack manager Ian Evatt following a poor run of results", "filename": "sport_football_articles_cly4gqj81ggo_1747813972.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f983/live/a1956590-d8a9-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly4gqj81ggo_1747813972.html", "title": "Ian Evatt: Bolton Wanderers sack manager after poor run of results", "title_page": "Ian Evatt: Bolton Wanderers sack manager after poor run of results - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Ian Evatt has left Bolton Wanderers following Tuesday's 2-1 defeat by Charlton Athletic.\nThe latest defeat has left them ninth in the League One table, three points away from the play-off positions and continued a poor first half of the season.\nBBC Radio Manchester reported the decision was taken at an emergency board meeting following the loss at home on Tuesday night.\n\"There comes a point in football when a change needs to happen and the last thing I want is to damage what we have all built together,\" Evatt said in a statement.\n\"I believe the club is still well placed to achieve its goals this season, and I want to give the board and players the best chance of doing that.\"\nThe 43-year-old arrived at the club in 2020 and won automatic promotion from League Two in his first season.\nHe led Wanderers to the EFL Trophy at Wembley in 2023 as well as last season's League One play-off final, where they were defeated by Oxford United.\nHaving challenged for automatic promotion from the third tier last term, Bolton were beaten to the final spot by Derby County on the final day of the 2023-24 campaign.\nThey eventually beat Barnsley across two legs in the play-off semi-final to reach the final at Wembley, but they were uncharacteristically off the pace as Oxford dominated them over 90 minutes and won 2-0.\nEvatt blamed fear on their defeat, which prevented them from returning to the Championship for the first time since 2019.\nBolton carried on that form into this season, with Tuesday's defeat at the hands of Charlton their 10th in the league in 2024-25, a result which left them ninth and three points off the play-off places after 24 games.\nIt has been a tough campaign for Evatt, who claimed in September he had the backing of the club's board after a wayward start to the campaign, while his son also experienced abuse from fans.\nHaving blamed his side's inconsistent form on psychology, his side then registered 10 victories from 17 games in all competitions to claw their way into the play-off places, but Evatt was critical of fan judgement on his side's performances.\nThat criticism came after Brittan pledged her support despite the fact they were well off the pace of League One's automatic promotion chasers following a dispiriting defeat by near neighbours Wigan Athletic, who themselves had been struggling.", "url": "https://www.bbc.com/sport/football/articles/cly4gqj81ggo"}