{"authors": ["Jonathan Agnew", "www.facebook.com"], "date_download": "2025-05-20 13:35:02", "date_modify": "2025-05-20 13:35:02", "date_publish": "2023-08-01 17:07:00", "description": "England were the better side in the Ashes but now face a period of regeneration, says BBC cricket correspondent Jonathan Agnew.", "filename": "sport_cricket_66362295_1747748102.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/149B0/production/_130600448_benstokes-patcummins.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66362295_1747748102.html", "title": "The Ashes 2023: England were best side and now look to future - Jonathan Agnew", "title_page": "The Ashes 2023: England were best side and now look to future - Jonathan Agnew - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was so much hype attached to this Ashes series and, over five thrilling Tests, it delivered.\nThe cricket we have seen over the past seven weeks has been fabulous entertainment. It has been a huge amount of fun and wildly unpredictable.\nThe Ashes has done a huge amount for Test cricket in this country and has been a brilliant spectacle for the new generation following the game.\nThere have been times when the cricket we have seen on the pitch has been flawed, but that only added to the drama. The mistakes made by both sides were the reason for the momentum ebbing and flowing so quickly.\nEngland changed and adapted throughout the series. The way they were batting in the final two Tests at Old Trafford and The Oval was different to the first two at Edgbaston and Lord's, matches they lost.\nBen Stokes' side had no choice but to tweak their method, otherwise they would have lost the series. Anyone who saw them at the end will have seen the alterations and know that England were better for them. They still had a positive mindset, but any hint of recklessness had been taken away.\nThe series ended in a 2-2 draw but overall England were the better team. Australia looked nothing like world Test champions and even some members of the visiting media were surprised at how meekly their team played.\nAustralia were disappointing and defensive, rarely bossing a game and instead waiting for things to happen.\nThey should have entered the Ashes on top of the world after beating India in the Test Championship final, but instead Pat Cummins had the field spread before a ball was bowled. On top of that, their batting did not fire, with Steve Smith and Marnus Labuschagne below their best.\nAustralia leave with questions to answer, not least over the future of Cummins as captain.\nCummins is a very fine cricketer and clearly a decent bloke. He performed admirably in this series and it was extraordinary he was able to bowl so well in the final Test despite playing six matches on the spin.\nBut how can he keep up with such a heavy workload? It might be Australia decide it is not in the best interests of him or the team. The problem is the only other viable candidate for the job is Smith and that opens up a whole new can of worms.\nEngland leave with their own issues to address, but certainly not the position of the captain. Stokes really seems like a man with a long-term plan.\nFor Stokes, coach Brendon McCullum and managing director Robert Key, the retirement of Stuart Broad brings into focus that England are an ageing team. Eight of their players at The Oval were aged 32 or older.\nIt will be Stokes' job over the coming years to mould a fresh group of players, which will be a new challenge for him as a leader.\nThat will be easier because of the groundwork that has been done over the past year or so. When Stokes took over, England were a bunch of losers - they had won only one of their previous 17 Tests.\nIt is a remarkable achievement for Stokes and McCullum to have taken pretty much the same group of players and turned them into a team that can go toe to toe with the best in the world.\nThe decision for Key will be when he pulls the trigger on a fresh start. Next summer, with two low-key Test series against West Indies and Sri Lanka, feels like a good time to put in place the structure of a team that can win in Australia in 2025-26.\nThere is the hole left by Broad and also the question of Jimmy Anderson, who at 41 has not had his best summer but says he wants to continue.\nHe may well be targeting the 10 wickets he needs to reach 700 in Tests, but will need a little faith from the selectors in order to get there.\nEngland are now entering a strange period, with only five Tests in the next 11 months as white-ball cricket dominates the calendar. There are World Cups in the 50-over and 20-over formats before England play their next home Test.\nThe assignment in the early part of next year, a five-Test series in India, is hugely intriguing.\nThere is no point asking Stokes how England will play in India, because he will brush it off.\nEngland will be positive, as they should be, and that is what makes the series so fascinating.\nIndia tours tend to be unique, not only for the atmosphere, but because of the conditions and how they affect team selection. Sometimes in India you see certain players, or a particular balance of team, that you would not see anywhere else.\nEngland often travel to India with trepidation, but their commitment to playing positively will cause more optimism than usual. There is also the prospect of them taking their entertaining style to a country that absolutely adores cricket, raising the prospect of the Test game in India getting a shot in the arm.\nMy last word will go to Broad after that emotional day at The Oval on Monday. I was feeling it for Stuart and his family, who I have known for many, many years.\nI played with and against his father Chris, so after he brought a four-year-old Stuart to my house, I have always taken a keen interest in his progress. I must have seen nearly all of his 604 Test wickets.\nI was thrilled with how it ended which, even by Broad's standards, was utterly remarkable. That ridiculous business with the bails was typical of him.\nBroad always made things happen. He ran in to bowl like his life depended on it and was willing to do anything for his team. He must have been a captain's dream.\nSport is about characters and Broad is certainly one of those. He will be missed.\nJonathan Agnew was speaking to BBC Sport chief cricket writer Stephan Shemilt.", "url": "https://www.bbc.com/sport/cricket/66362295"}