{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 14:12:54", "date_modify": "2025-05-20 14:12:54", "date_publish": "2023-07-26 11:46:36", "description": "With the Netball World Cup starting on Friday, BBC Sport has picked five of the biggest stars who could be influential to their team's success.", "filename": "sport_netball_66289262_1747750374.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CCBB/production/_130511425_gettyimages-1365461772.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66289262_1747750374.html", "title": "Netball World Cup 2023: Five players to watch out for at tournament in Cape Town", "title_page": "Netball World Cup 2023: Five players to watch out for at tournament in Cape Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The 2023 Netball World Cup starts on Friday, with the best teams in the world preparing to face off in Cape Town, South Africa.\nWho will shine on the world stage? Which youngsters are ready to break out on to the global scene? Whose experience could make the difference?\nBBC Sport has picked five of the biggest stars who could have an impact on their team's pursuit of glory.\nFollowing a period of uncertainty with limited match play during the Covid-19 pandemic, Australia found themselves in the unusual position of holding neither the Commonwealth Games or the World Cup titles at the start of 2022.\nHaving set that straight in Birmingham last August, Diamonds captain Liz Watson will look to guide her side to reclaiming World Cup glory and another major title.\nIn a team of such dominance, it is difficult to single out just one player but Watson is widely regarded as one of the best mid-courters in the world and her leadership will also act as the glue for the rest of the team to stick to.\nDoubts around Australia's shooting circle in the absence of the pregnant Gretel Bueta means Watson's role at wing attack of feeding the shooters will be more important than ever.\nBut speed in attack has always been their strength and in Watson, 29, Australia have a player whose work rate is almost unparalleled.\nAt the 2019 World Cup in Liverpool, New Zealand's squad nicknamed themselves 'the fossils' on account of many of the players nearing the end of their careers and several then retired after they won the title.\nBut the Silver Ferns and head coach Noeline Taurua have done a fine job of unearthing young exciting talent to replace them and one of those players is 21-year-old Grace Nweke.\nThe shooter went into the Commonwealth Games with just four caps but impressed on the world stage and was named player of the tournament at the Quad Series earlier this year.\nDomestically, she won the New Zealand league - the ANZ Premiership - with Northern Mystics, scoring a whopping 70 of their 74 goals in the final with a shooting accuracy of 96%.\nShe was also the leading goalscorer for the season with 825 and this tournament could be an opportunity for her to make the New Zealand shooting circle her own.\nFour years ago, defender Karla Pretorius was named player of the tournament at the World Cup in Liverpool.\nFast-forward to now and she is preparing to play at her third World Cup after returning from having a baby in June last year.\nThe 33-year-old had always expressed a desire to start a family then return to playing and, following a successful return in the 2023 season with Sunshine Coast Lightning in Australia, the Proteas vice captain looks sure to play a crucial role at a home World Cup.\nPretorius is known for her athletic interceptions, leadership skills and elusive style of play which allows her to pop up undetected in key moments, with team-mate Lenize Potgieter describing her as \"sneaky\".", "url": "https://www.bbc.com/sport/netball/66289262"}