{"authors": ["Adam Millington", "www.facebook.com"], "date_download": "2025-05-21 06:32:42", "date_modify": "2025-05-21 06:32:42", "date_publish": "2025-01-31 10:53:00", "description": "The Women's Super League's January transfer window has now closed - but who did the best business?", "filename": "sport_football_articles_cy7gv8y6j43o_1747809162.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6600/live/4f307210-dfbe-11ef-a819-277e390a7a08.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy7gv8y6j43o_1747809162.html", "title": "WSL transfer window: Rate every club's business in January", "title_page": "WSL transfer window: Rate every club's business in January - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Women's Super League's January transfer window has closed - so who do you think did the best business?\nChelsea made the statement acquisition of Naomi Girma for a new women's world record fee – while there was late drama as Chloe Kelly's immediate future was decided with her joining Arsenal on loan from Manchester City.\nBBC Sport assesses all the moves made by the 12 WSL clubs this summer - plus have your say on all the ins and outs.\nIns\nJenna Nighswonger (Defender, from Gotham FC)\nChloe Kelly (Forward, on loan from Manchester City).\nOuts\nKathrine Kuhl (Midfielder, to Roma)\nLaura Wienroither (Defender, to Manchester City on loan)\nVivienne Lia (Forward, to Southampton on loan)\nMadison Earl (Midfielder, to Sheffield United on loan)\nFreya Godfrey (Midfielder, to London City Lionesses on loan)\nLaila Herbert (Midfielder, to Southampton on loan)\nArsenal left their recruitment until the last minute, but made two big signings before the window closed by bringing in United States defender Jenna Nighswonger on a permanent deal and England winger Chloe Kelly on loan.\nKatie McCabe is currently the club's main left-back, with Steph Catley tending to be used in the middle instead, so Nighswonger adds another high-quality option for Renee Slegers' side.\nKelly has fallen firmly out of favour at Manchester City, and will be hoping a move to Arsenal – where her career began – will get her back on track in time for this summer's European Championships.\nThe questionable element of the signing is where Kelly will fit into Slegers' team. Arsenal are strong in attack and have ample options, so playing minutes will not be a given for the Gunners, either.\nIns\nKatelin Talbert (Goalkeeper, on loan from West Ham)\nOuts\nAnna Leat (Goalkeeper, free agent)\nKenza Dali (Midfielder, to San Diego Wave)\nFreya Gregory (Forward, to Newcastle)\nGeorgia Mullett (Forward, to Southampton on loan)\nSophia Poor (Goalkeeper, to London City Lionesses on loan)\nAston Villa's biggest arrival in January came when they appointed manager Natalia Arroyo to fill the vacancy left by Robert de Pauw's departure.\nMidfielder Kenza Dali will be a big miss after her move to San Diego Wave in the United States, but they have found a way to fill the gap left when Anna Leat departed by mutual consent, with Katelin Talbert taking the goalkeeper's place, joining on loan from West Ham.\nVilla seem relatively safe in the league, sitting five points above the drop. Their inaction in the window won't help them push higher in the table but it shouldn't make much difference.\nIns\nCaitlin Hayes (Defender, from Celtic)\nNadine Noordam (Midfielder, from Ajax)\nOuts\nComfort Erhabor (Goalkeeeper, to Portsmouth on loan)\nThe Seagulls have played well under Dario Vidosic in the Women's Super League and are currently fifth in the league.\nThey had a very busy summer window, bringing in the likes of Nikita Parris, Jelena Cankovic and Fran Kirby, so they did not need to do much in January.\nRepublic of Ireland centre-back Caitlin Hayes lacks WSL experience but has played well in Scotland and will look to prove herself at Brighton. Nadine Noordam provides another creative outlet in midfield to bolster Brighton's options going forward.\nIns\nNaomi Girma (Defender, from San Diego Wave)\nFemke Liefting (Goalkeeper, from AZ Alkmaar)\nKeira Walsh (Midfielder, from Barcelona)\nOuts\nCharlotte Wardlaw (Defender, to Newcastle)\nLouna Ribadeira (Forward, to Everton on loan)\nJulia Bartel (Midfielder, to Liverpool on loan)\nGreta Humphries (Defender, to Charlton Athletic on loan)\nAimee Claypole (Forward, to Durham on loan)\nLucy Watson (Forward, to Ipswich on loan)\nAniek Nouwen (Defender, to Crystal Palace on loan)\nAlejandra Bernabe (Defender, to Liverpool on loan)\nEve Perisset (Defender, free agent)\nThis has been a statement transfer window from a Chelsea side who are in the midst of a statement season.\nAny worries about potential lapses with Sonia Bompastor taking over as manager from Emma Hayes have been firmly despatched: they are still unbeaten in the league after 12 matches.\nDespite already boasting a stellar squad, they've made huge moves – breaking the transfer record to sign the United States defender Naomi Girma was the ultimate sign of intent.\nIf that wasn't enough, they then recruited England midfielder Keira Walsh from Barcelona, a proven winner who is one of the world's best.\nChelsea don't want anybody knocking them off their perch in the WSL any time soon and they have the Champions League in their sights.\nIns\nClarissa Larisey (Forward, from Hacken)\nRia Oling (Midfielder, from Rosengard)\nAllyson Swaby (Defender, from AC Milan)\nLily Woodham (Defender, loan extended from Seattle Reign)\nAniek Nowen (Defender, on loan from Chelsea)\nOuts\nNone\nCrystal Palace needed to act in January to do whatever they can to push themselves up from the bottom of the WSL and avoid relegation.\nThey are still four points adrift, but they have made some good signings. Clarissa Larisey and Ria Oling both bring significant experience from Sweden's top flight and for their respective international sides.\nBringing in Jamaica defender Alysson Swaby on deadline day should help to bolster their defence, which could be crucial in their mission to avoid dropping points.\nOnly time will to tell as to whether they've done enough to stay up, but their recruitment should help. Extending Wales defender Lily Woodham's loan from Seattle Reign was also important for keeping their side intact.\nIns\nHayley Ladd (Midfielder, from Manchester United)\nKelly Gago (Forward, from Nantes)\nMartina Fernandez (Defender, on loan from Barcelona)\nLouna Ribadeira (Forward, on loan from Chelsea)\nEmma Watson (Midfielder, on loan from Manchester United)\nMaren Mjelde (Defender, free agent)\nOuts\nRylee Foster (Goalkeeper, free agent)\nEmma Bissell (Midfielder, to Charlton Athletic)\nIzzy Hobson (Defender, to Sheffield United on loan)\nEllie Jones (Forward, to Sheffield United on loan)\nMacy Settle (Midfielder, to Blackburn Rovers on loan)\nEverton have been busy in January. When loans are included, they have brought in more players than any other WSL side.\nTheir signings have been of a good quality, too. Nantes forward Kelly Gago and Manchester United midfielder Hayley Ladd joined on permanent deals, with both performing well for Brian Sorensen's side since their arrival.\nHowever, the big question for Sorensen has been addressing Everton's lack of goals and that has not yet come into fruition. Chelsea forward Louna Ribadeira arriving on loan should help when combined with Gago, but the problem needs to be sorted quickly.\nIns\nOlivia Clark (Goalkeeper, from FC Twente)\nHlin Eiriksdottir (Forward, from Kristianstads)\nKarla Torres (Forward, loan from Independiente Santa Fe)\nOuts\nLize Kop (Goalkeeper, to Tottenham)\nEmilia Pelgander (Midfielder, to Rosengard on loan)\nHlin Eiriksdottir's arrival on transfer deadline day should be a big boost for Leicester and help to allay the woes inflicted by injuries to attacking players.\nJutta Rantala and Lena Petermann – the club's two top scorers last season – are both currently sidelined, as is French striker Noemie Mouchon after repturing her ACL in October. Eiriksdottir may be able to fill the void left in Leicester's front line.\nOlivia Clark, meanwhile, is a decent signing, but she will have to battle with the excellent Janina Leitzig for the number-one spot.\nManager Amandine Miquel often rotated between Leitzig and Lize Kop, who departed for Tottenham, so Clark may fill the same role.\nIns\nJulia Bartel (Midfielder, on loan from Chelsea)\nSam Kerr (Midfielder, on loan from Bayern Munich)\nAlejandra Bernabe (Defender, on loan from Chelsea)\nOuts\nNone\nLiverpool have not made any permanent signings in January. That comes after a quiet summer where they brought in just three players.\nBoss Matt Beard does have a solid squad, though, and he has looked to the loan market to bring in two additions this time round.\nScotland midfielder Sam Kerr has played at a high level with Bayern Munich, winning the Frauen-Bundesliga in 2023-24, while 20-year-old Julia Bartel is a promising talent who has not been able to get into Chelsea's team since joining them from Barcelona.\nLiverpool fans may have hoped for a busier January, but it isn't a bad window by any means.\nIns\nRebecca Knaak (Defender, from Rosengard)\nAemu Oyama (Midfielder, free agent)\nKerolin (Forward, from North Carolina Courage)\nLaura Wienroither (Defender, on loan from Arsenal)\nOuts\nSandy MacIver (Goalkeeper, to Washington Spirit)\nAlanna Kennedy (Defender, to Angel City)\nChloe Kelly (Forward, to Arsenal on loan)\nPoppy Pritchard (Forward, to Newcastle United on loan)\nGareth Taylor has made some good signings in January, but Manchester City may have lacked the big move they needed to find a way to get back into the title race.\nBrazil forward Kerolin won an Olympic silver medal and has impressed in the National Women's Soccer League, but it feels like more may be required to catch up with Chelsea.\nRebecca Knaak is a good defender whose main role will be to fill in for England's Alex Greenwood, who is currently out after having knee surgery in December. Aemu Oyama, meanwhile, is a talent for the future.\nAlanna Kennedy departing for Angel City is a blow to their depth at centre-back and means they lose a key part of their defensive line, although Sandy MacIver leaving is less of an issue given her lack of minutes.\nKelly's departure on loan is a boost for Arsenal, but she is so much out of favour at City that its main consequence is providing the forward with a fresh start rather than making any difference to Taylor's side.\nIns\nOlivia Holdt (Midfielder, from Rosengard)\nLize Kop (Goalkeeper, from Leicester)\nJosefine Rybrink (Defender, free agent)\nOuts\nWang Shuang (Winger, to Wuhan Chegu Jiangda)\nAraya Dennis (Forward, to Southampton on loan)\nElkie Bowyer (Midfielder, to Ipswich on loan)\nTottenham's January does not leave much to complain about.\nLize Kop proved herself as a goalkeeper for Leicester, Denmark international Olivia Holdt is a promising player for the future and Sweden defender Josefine Rybrink has extensive experience in her home nation's top flight.\nMore recruitment could have been a bonus, but Robert Vilahamn seems to have built a relatively settled side.\nIns\nVerena Hanshaw (Defender, from Roma)\nEva Nystrom (Defender, from Hammarby)\nOuts\nInes Belloumou (Defender, to Malmo on loan)\nKatelin Talbert (Goalkeeper, to Aston Villa on loan)\nShannon Cooke (Defender, to Birmingham City on loan)\nWest Ham once again find themselves towards the bottom of the league table, but there is not too much cause for concern given that they are six points ahead of 12th-placed Crystal Palace.\nThat position means their relatively limited action in January is not much of an issue. They have opted to use the window to bring in just two players, but those two players are quality additions.\nVerena Hanshaw is a veteran defender who will help to strengthen their back line, while Eva Nystrom has played in Sweden's top flight for a number of years.", "url": "https://www.bbc.com/sport/football/articles/cy7gv8y6j43o"}