{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:51:05", "date_modify": "2025-05-21 07:51:05", "date_publish": "2025-05-18 09:12:48", "description": "Cardiff Devils have signed defenceman Brandon Estes for the 2025-26 season from Danish League side Odense Bulldogs.", "filename": "sport_ice-hockey_articles_cgj85jvq1n3o_1747813865.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f814/live/d6237230-33c0-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_articles_cgj85jvq1n3o_1747813865.html", "title": "Brandon Estes: Devils sign American defenceman from Odense Bulldogs", "title_page": "Brandon Estes: Devils sign American defenceman from Odense Bulldogs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff Devils have signed defenceman Brandon Estes for the 2025-26 season from Danish League side Odense Bulldogs.\nThe American is the first new player brought to the club since the appointment of Paul Thompson as head coach at the start of May.\nThompson led Odense to the Danish Championship title in April with Estes leading the team in scoring throughout the play-offs, grabbing seven goals and 12 assists for 19 points in 17 games.\nThe 28-year-old from Richardson, Texas also led the team in scoring during the regular season with 14 goals and 38 assists for 52 points in 48 games.\nHe was sixth in the League's overall scoring table and leading defenceman in goals.\n\"I'm thrilled we managed to get Brandon to Cardiff, having played for me last season in Odense we know each other very well,\" said Thompson.\n\"Brandon has an unbelievable engine and can log big minutes. He has a high compete level and is a humble man. I might be biased, but he was the League MVP in my opinion and made the difference on so many occasions.\n\"We have secured ourselves a quality person and a high quality defenceman.\"", "url": "https://www.bbc.com/sport/ice-hockey/articles/cgj85jvq1n3o"}