{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:00:36", "date_modify": "2025-05-21 04:00:36", "date_publish": "2025-01-15 09:58:47", "description": "Man Utd podcast: The Devils' Advocate on Altay Bayindir and Joshua Zirkzee", "filename": "sport_football_articles_cvgmxe9e4kgo_1747800036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aea8/live/debb74b0-d26d-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgmxe9e4kgo_1747800036.html", "title": "Man Utd podcast: The Devils' Advocate on Altay Bayindir and Joshua Zirkzee", "title_page": "Man Utd podcast: The Devils' Advocate on Altay Bayindir and Joshua Zirkzee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Altay Bayindir and Joshua Zirkzee \"epitomised\" what Manchester United are about in the club's FA Cup victory against Arsenal.\nOn the latest episode of BBC Radio Manchester's The Devils' Advocate podcast, Gaz, Kim and Jay spoke about the key role they played as United progressed to the fourth round.\nBBC Radio Manchester's Gaz Drinkwater said: \"I will openly admit that I said it was a disgrace that [Bayindir] would start this game, purely because it was the FA Cup and an important game.\n\"Why would you start your back-up keeper? But, [he was] phenomenal.\"\nJay Motty added: \"He was. The one saving grace for Bayindir was that he made that clanger at Spurs and then Andre Onana did something similar a week later.\n\"It wasn't like you had one goalkeeper who was terrible and another who was flying. Onana has been going through a sticky patch although obviously he's the first-choice goalkeeper.\n\"You look at players like Bayindir who had a stinker at Spurs and Joshua Zirkzee, who had a section of fans boo him which was just disgraceful.\n\"To see those players doing well and playing their part in what could be a massive win is great to see.\n\"It's what Manchester United are about - people writing us off and bouncing back and proving everyone wrong. Those two players epitomised that.\n\"You use the word redemption for a reason - it did feel like that.\"", "url": "https://www.bbc.com/sport/football/articles/cvgmxe9e4kgo"}