{"authors": ["Ed Dawes", "www.facebook.com"], "date_download": "2025-05-21 06:41:13", "date_modify": "2025-05-21 06:41:13", "date_publish": "2025-01-22 18:13:05", "description": "BBC Radio Derby commentator Ed Dawes reflects on Derby County's defeat by Sunderland and the club's mounting injury problem.", "filename": "sport_football_articles_c1we3lj792eo_1747809673.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/834b/live/bc873860-d8ea-11ef-96e3-7ddb8edc83e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1we3lj792eo_1747809673.html", "title": "Injuries leave Rams in desperate situation - analysis", "title_page": "Derby County: Injuries leave Rams in desperate situation - analysis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When a siege mentality is automatically instigated, you often end up with a good performance.\nDerby County were better against Sunderland than they were against Watford but sadly it was the same result.\nThe Rams are really suffering from a sudden batch of injuries to key players. The loss of Curtis Nelson is immense and unforeseen, while two probable hamstring strains to Kane Wilson and Dejaune Brown have come in the latest home defeat.\nWilson has been one of the standout improved players this season and his 25 appearances have all been what the head coach Paul Warne describes as a \"gassed out\" effort. Brown has played just 552 minutes of football and his injury cannot be down to wear and tear, just bad luck.\nRams owner David Clowes has signed off on what I understand is a considerable investment in a new centre-half to cover Curtis Nelson's injury, which is a desperate situation now as Derby ended Tuesday night's encounter with just two recognised defenders on the pitch.\nConsistency is very difficult for Derby currently - the level of performance in the second half at Pride Park needs to come from the off, Paul Warne himself said, \"You have to play for more than 70 minutes\".\nThis transfer window is so important for Warne.\nIf he is given the tools to do the job, then he should succeed with keeping them in the Championship.\nAdditions to his squad will hopefully see that next level in performance, which will show the opposition they're not predictable and can be a force to be reckoned with.", "url": "https://www.bbc.com/sport/football/articles/c1we3lj792eo"}