{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:37", "date_modify": "2025-05-21 05:49:37", "date_publish": "2025-04-02 10:40:24", "description": "Wales scrum-half Tomos Williams is in the \"prime of his career\" says Gloucester's attack coach James Lightfoot Brown.", "filename": "sport_rugby-union_articles_cdxnyz6vnk3o_1747806577.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1cb6/live/dcc3a1e0-0fae-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cdxnyz6vnk3o_1747806577.html", "title": "Tomos Williams: Wales and Gloucester scrum-half in 'prime' of career says coach", "title_page": "Tomos Williams: Wales and Gloucester scrum-half in 'prime' of career says coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales scrum-half Tomos Williams is in the \"prime of his career\" says Gloucester's attack coach James Lightfoot Brown, with the club \"reaping the rewards\" of signing him.\nWilliams joined the Cherry and Whites from Cardiff last summer and has started 12 out of 13 Premiership matches this season, scoring seven tries and assisting another eight.\nThe 30-year-old has 64 caps for Wales and also started all five games for his country during the recent Six Nations championship.\n\"Tomos is a world-class player, anyone that has seen him play this season will understand what I mean by that,\" Lightfoot Brown told BBC Radio Gloucestershire.\n\"He's an incredibly gifted, committed man who is currently in my opinion in the absolute prime of his career, playing some brilliant rugby and bringing other people with him.\n\"I think that's the important thing, not only is he doing the bits of individual brilliance but for someone in his position it's so important he brings people with him and he's got the respect of the whole group and we're certainly reaping the rewards of signing Tomos Williams.\"\nGloucester's attack has been transformed this season under Lightfoot Brown, who joined the club in 2023. A scintillating victory against Bristol on Saturday saw them move back into the Premiership top four.\nWilliams tops the Premiership stats, provided by Oval Insights, for the most passes in the league this season (762), while he is second overall for most metres kicked (3,858), and third for most line breaks (20) and most offloads (18).\nAgainst the Bears he provided two try assists including a moment of brilliant skill to jump and collect a ball one-handed, before a no-look pass to Seb Atkinson to score.\n\"[He's] a very committed individual. He'll be the last one out here practicing his kicking, practicing the bits you see at the weekend,\" Lightfoot Brown said.\n\"You bring a world-class player into your environment and I think you're going to reap the benefits of that, everyone is.\n\"Young players, players in the same position, they're all improving without question.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cdxnyz6vnk3o"}