{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:38", "date_modify": "2025-05-19 14:41:38", "date_publish": "2017-08-15 21:19:04", "description": "DIGIONLY", "filename": "sport_football_40923184_1747665698.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40923184_1747665698.html", "title": "Tuesday's National League reports", "title_page": "Tuesday's National League reports - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "AFC Fylde 1-4 Maidenhead United\nDave Tarpey produced a finishing masterclass with a four-goal haul as Maidenhead won 4-1 away at AFC Fylde in the National League.\nHis two first-half penalties were followed by two more strikes after the interval as Maidenhead punished their 10-man hosts.\nJosh Langley was sent off and carried off after committing the foul that gave Maidenhead their first penalty, which was awarded in the 21st minute.\nTarpey, who scored 44 times in National League South last season, converted from 12 yards.\nLewis Montrose gave away the second penalty, with his handball punished by Tarpey's clinical spot-kick, but 10-man Fylde responded when Montrose headed in to cut the deficit to 2-1 at half-time.\nBut Tarpey made the game effectively safe when completing his hat-trick in the 58th minute, going by goalkeeper Rhys Taylor after meeting a pass over the Fylde defence, and Tarpey completed his night's work by rifling in a 78th-minute free-kick.\nMatch report supplied by the Press Association.\nBromley 6-1 Leyton Orient\nLeyton Orient were thrashed by Bromley as the short trip south of the Thames ended in misery for Steve Davis and his team.\nBromley swept ahead after just 11 minutes, with George Porter heading past Charlie Grainger. And despite Orient threatening at times to get back on level terms, the former Football League side slid 2-0 adrift in the 39th minute when Frankie Sutherland's corner was nodded in by home captain Jack Holland.\nThe misery increased for Orient early in the second half, with Bromley stretching their lead after 55 minutes when Josh Rees struck from close range, after an initial save from Grainger. It got worse seven minutes later when Adam Mekki fired the fourth after strong work from the impressive Louis Dennis.\nOrient mustered a consolation when former Colchester man Macauley Bonne scored his first for the club in the 66th minute, but they were red-faced in the 74th minute when Holland struck again and more so when Brett Williams notched Bromley's sixth late on.\nMatch report supplied by the Press Association.\nDagenham and Redbridge 3-3 Ebbsfleet United\nEbbsfleet produced a storming fightback to earn a point at Dagenham as their National League game ended 3-3.\nBoth sides remain unbeaten after four games of the season, but Ebbsfleet finished the game the happier after coming from 2-0 and 3-1 adrift to share the spoils at the Chigwell Construction Stadium.\nCorey Whitely swept a shot into the left corner to nudge Dagenham ahead in the 22nd minute, and the same player saw a penalty saved by Nathan Ashmore later in the first half before team-mate Kevin Lokko made it 2-0 just before the interval as Ebbsfleet failed to deal with a corner.\nJack Powell came off the bench and immediately cracked in a 58th-minute free-kick to give Ebbsfleet hope.\nThey slipped 3-1 behind after Morgan Ferrier curled in a super strike, but the gap was again cut when Luke Coulson found the target, and Danny Kedwell delighted the Ebbsfleet support with an 80th-minute headed leveller.\nMatch report supplied by the Press Association.\nFC Halifax Town 1-2 Dover Athletic\nTobi Sho-Silva netted a last-gasp winner as Dover snatched a 2-1 victory at Halifax.\nIn a dramatic final seven minutes that involved all three goals, the substitute stabbed in Connor Essam's header to secure Dover a third triumph in four National League matches.\nMitch Brundle had broken the deadlock for Dover in the 87th minute as he nodded home Femi Ilesanmi's cross.\nTom Denton thought he had secured the hosts a point when he headed in Halifax's first goal of the season in added time, but former Bromley man Sho-Silva had the final say.\nMatch report supplied by the Press Association.\nGuiseley 0-0 Tranmere Rovers\nGuiseley remain without a National League win this season following a goalless draw with Tranmere.\nReece Thompson had two chances to get his side up and running but failed to beat goalkeeper Scott Davies.\nThe striker wasted a one-on-one in the fourth minute and then headed straight at the Tranmere number one shortly after half-time.\nTranmere's best opportunities came from Andy Cook and Olly Norburn, whose efforts were saved by debutant Joseph Green in the Guiseley goal.\nMatch report supplied by the Press Association.\nHartlepool United 1-1 Chester\nJake Cassidy struck a second-half equaliser but Hartlepool are still searching for their first National League win of the season after a draw with Chester.\nChester made the perfect start when they took the lead in the first minute. Scott Harrison slipped, allowing Ross Hannah to break forward, and James Akintunde was on hand to tuck the ball home after Scott Loach could not hang on to Hannah's shot.\nChester thought they had a second after 14 minutes when Hannah spun and fired an effort into the roof of the net, but the flag was up for offside.\nNicky Deverdics then saw a header come back off the crossbar as Hartlepool looked to get back into the game.\nAnd moments later Deverdics saw another effort come back off the woodwork when his half-volley bounced off the underside of the bar and away.\nIt looked like it was not going to be Hartlepool's night when Carl Magnay's volley from outside the box again came back off the crossbar.\nFinally, Hartlepool managed to find the net after 71 minutes when Cassidy beat goalkeeper Conor Mitchell to a high ball into the box to head home.\nMatch report supplied by the Press Association.\nMaidstone United 1-1 Aldershot Town\nNational League leaders Aldershot dropped points for the first time this season as Maidstone grabbed a late equaliser.\nJai Reason squandered an early opportunity for Maidstone, while at the other end James Kellermann flashed an effort over the bar.\nMaidstone goalkeeper Lee Worgan then pulled off an excellent save to keep out a powerful Matt McClure header.\nThe visitors' pressure eventually told in the second half, with Jake Gallagher scoring Aldershot's goal in the 76th minute after some neat footwork earned him a yard of space in the penalty area.\nHowever, Josh Hare headed an equaliser in off the post in the fifth minute of stoppage time.\nMatch report supplied by the Press Association.\nSolihull Moors 3-3 Barrow\nSolihull Moors collected their first National League point of the season but were denied victory as 10-man Barrow snatched a stoppage-time equaliser in a 3-3 draw.\nBarrow had looked like condemning their hosts to a third straight defeat when Dave Nieskens pounced to score his first for the club after the ball had ricocheted around in the Solihull box.\nDan Jones doubled the visitors' lead in spectacular fashion when he spotted the goalkeeper off his line and scored a 32nd-minute free-kick from the halfway line.\nJoel Kettle headed in a Darren Carter corner on the hour mark to spark a spectacular comeback, with Dapo Afolayan equalising nine minutes later and skipper Carter smashing in a 73rd-minute effort.\nBut Harry Panayiotou converted a penalty deep into time added on to salvage a point for Barrow, who earlier had Jimmy Dunne sent off.\nMatch report supplied by the Press Association.\nSutton United 2-1 Macclesfield Town\nSutton left it late to come from behind and claim a 2-1 National League victory over Macclesfield Town.\nScott Wilson got the visitors off to a flying start with a second-minute opener but Moses Emmanuel levelled after 84 minutes and Tommy Wright popped up to hit the winner a minute later.\nMacclesfield went ahead when Wilson rifled home from 25 yards after being up a throw-in from Koby Arthur.\nSutton hauled themselves level with six minutes remaining when substitute Emmanuel turned the ball home from close range.\nAnd just a minute later the hosts were ahead as Wright swept the ball into the net from 10 yards out.\nTorquay United 2-4 Boreham Wood\nBruno Andrade scored for the third successive game as Boreham Wood beat Torquay 4-2 in a match that exploded into life after half-time at Plainmoor.\nRyan Clarke's superb double save to deny visiting forward Shaun Jeffers and a goal-line clearance from Torquay defender Myles Anderson were the highlights of an evenly-fought opening period, but all the real action came in the second half.\nThe Wood looked to have taken charge when they scored twice in quick succession through Angelo Balanta and Andrade, both times Torquay being hit on the break.\nA frenetic second period continued with winless Torquay pulling a goal back almost immediately through Ruairi Keating in the 58th minute, before Clarke performed more heroics to save Balanta's penalty.\nTorquay then drew level in the 72nd minute when Keating crashed home his second of the night, but the visitors responded by heading straight down the other end and reclaiming the lead through Jeffers before Bradley Sach added a fourth late on.\nMatch report supplied by the Press Association.\nWoking 2-1 Eastleigh\nWoking enjoyed the comforts of home again to claim a 2-1 victory over previously unbeaten Eastleigh.\nThe Cards had suffered back-to-back away defeats since opening their campaign with a home victory over Gateshead, but they made it two wins from two at the Laithwaite Community Stadium after coming out on top in an eventful encounter.\nThe hosts rode their luck in the first half, though, with Eastleigh hitting the woodwork through Ben Williamson and Callum Howe while inspired home goalkeeper Nathan Baxter denied Chris Zebroski on several occasions.\nBaxter's efforts were rewarded as Woking scored twice either side of the half-time break to take control, striker Inih Effiong opening the scoring before turning provider when his ball across the box was turned into his own net by Gavin Hoyte.\nEastleigh spurned a great chance to get back into the match soon after when the in-form Williamson saw his penalty well saved by Baxter, but the visitors were awarded another spot-kick seconds later and this time Ayo Obileye slotted home.\nEastleigh could not find an equaliser, however, and had to play out the final 13 minutes with a man less after losing Hoyte to injury having already used all their substitutes.\nMatch report supplied by the Press Association.\nWrexham 1-0 Gateshead\nLoan signing Alex Reid scored on his debut to give Wrexham their first home win of the season against Gateshead.\nReid's signing was announced less than two hours before the match and he came off the bench to claim the winner.\nGoalkeeper Chris Dunn was another Wrexham hero, pulling off a series of saves late in the game, notably from Robbie Tinkler.\nThe result lifts Wrexham to 10th, one place behind Gateshead on goal difference after four games.", "url": "https://www.bbc.com/sport/football/40923184"}