{"authors": ["Kal Sajad", "www.facebook.com"], "date_download": "2025-04-26 04:18:41", "date_modify": "2025-04-26 04:18:41", "date_publish": "2025-03-04 06:24:12", "description": "Speaking to BBC Sport, Natasha Jonas reflects on the 'sliding doors' moments which led to her becoming a two-weight world champion.", "filename": "sport_boxing_articles_c4g920l7ex8o_1745641121.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fee/live/d6ba00c0-f8c3-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_boxing_articles_c4g920l7ex8o_1745641121.html", "title": "Jonas vs Price: Natasha Jonas on 'sliding doors' moments which led to glory", "title_page": "Jonas vs Price: Natasha Jonas on 'sliding doors' moments which led to glory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Setbacks lead to comebacks. Ages like a fine wine. A happy fighter is a dangerous fighter. Natasha Jonas' career lends itself to plenty of overused boxing cliches.\nA pioneer of women's boxing for more than a decade, the 40-year-old headlines an all-female card at London's iconic Royal Albert Hall on Friday.\nJonas will put her WBC and IBF welterweight titles on the line against Wales' WBA champion Lauren Price.\nPrice, 30, is the unbeaten Olympic golden girl brimming with confidence. To use another stock sporting phrase, she predicts a passing of the torch.\nLet's not write Liverpool's history-maker off just yet, though.\nToxteth-born Jonas was the first British female to ever box at an Olympic Games. She has overcome injuries, disappointing defeats and juggled boxing with motherhood.\nThrough stellar punditry work or as the first black woman to obtain a British Boxing Board of Control manager's licence, Jonas continues to make waves outside the ring too.\nBut her life could easily have panned out very differently. Speaking to BBC Sport, Jonas reflects on the 'sliding doors' moments which led to her becoming a two-weight world champion.\nJonas caught the sporting bug as a four-year-old watching the Seoul 1988 Olympics.\nAlthough her memory of those Games is somewhat patchy, she remembers \"being overwhelmed and excited by all the sport that was happening\".\nTwo decades later she was nicknamed 'Miss GB' for her own Olympic appearance.\nWhen Jonas qualified for London 2012 at an event in China, she shared a heartwarming moment with her mother.\n\"That's when Mum told me at the airport how proud she was and that when I was a little girl, watching the Olympics on TV, I told her one day I wanted to be there,\" Jonas adds.\n\"Sometimes kids have big ideas. Sometimes life and the world gets in the way. But after 24 years and trying hundreds of sports, I got there.\n\"So looking back, I could say the '88 Games was the most pivotal event of my career.\"\nAs a teenager, Jonas dreamed of representing her country on the global stage, but not as a pugilist.\n\"I watched Rachel Yankey and Mia Hamm and always thought 'I'm a well better footballer',\" she says.\nJonas is \"not the most academic\" but buckled down to earn a football scholarship at St Peter's College in New Jersey.\n\"America was the place to be,\" she says, with only a handful of English women's football teams operating at a professional level at the time.\nBut a budding football career was cut devastatingly short when Jonas tore her cruciate ligament while in the States.\n\"If my injury hadn't have happened I definitely wouldn't be getting punched in the face for a living. It was a big turning point,\" Jonas adds.\nHer sister, Nikita Parris, has 72 caps for England and was part of the 2022 Euros winning squad.\nAsked if she would swap her career for a major trophy, Jonas replies: \"I'd rather go on to become an undisputed boxing world champion than a football World Cup winner.\"\nWhen Jonas returned to England she lost friendship groups made through football and, with her knee in a brace, began to put on weight.\nShe briefly worked in call centres but was sacked from all seven jobs.\n\"Now looking back as an adult, I recognise that I was depressed,\" Jonas says. \"I lost my identity. Everyone said I was going to play for Liverpool and England but now I was no longer 'Tasha the footballer' but just Tasha.\"\nIn a bid to regain her fitness, Jonas, aged 21, stepped into the legendary Rotunda Amateur Boxing Gym.\n\"All the lads were like 'who is she?'. They weren't used to having a girl in their gym,\" she recalls.\n\"After a warm-up, the coach asked us to get into pairs to do bags. I thought I'd be the little girl who is last to be picked, like when I used to play football with my cousins.\"\nInstead, Jonas was greeted by the kindness of future light-middleweight world champion Liam Smith - one of the popular boys in the gym. When he saw a deflated Jonas put her head down, he offered to partner up.\n\"I don't know if I would or wouldn't have stuck it out if he hadn't done that, but one little gesture from Liam made such a difference - there was no more awkwardness in the gym after that,\" Jonas adds.\nJonas called time on her amateur career in 2014 with a record of 57 wins and 26 defeats. She gave birth to her daughter, Mila, and was happy to never box again.\nThat soon changed after the pro debut of a trailblazing Irishwoman and a phone call from a former Team GB team-mate.\n\"I did some punditry work for Katie Taylor's debut and Tom Stalker phoned me afterwards,\" Jonas explains.\n\"He said there will be a lot of opportunity for pro females now and asked if I'd ever think of coming back? I said 'shut up, Tom'.\"\nJonas says she was \"happy with her routine\". Mila had turned two and was in nursery and the media work was keeping her busy.\nBut Stalker's words kept ringing in her ear. After speaking to her immediate family, Jonas realised the boxing fire was still burning.\n\"I phoned two cousins, my mum and dad,\" Jonas adds. \"I trusted their judgement and they knew the good and bad side to boxing.\n\"They were there for me when I cried for two days, after losing to Katie in the amateurs.\n\"But they all gave me their support and said I had nothing to worry about, especially as far as the baby is concerned.\"\nTurning pro was a decision that paid off. In February 2022, Jonas stopped Chris Namus to become light-middleweight world champion and has since won all five world-title level fights.\n\"If I could go back and talk to myself in some of those hardest moments earlier in life, I'd say 'chin up, kid, it all works out in the end',\" she says.", "url": "https://www.bbc.co.uk/sport/boxing/articles/c4g920l7ex8o"}