{"authors": ["Andrew Aloia", "Dominic Dietrich", "www.facebook.com"], "date_download": "2025-05-21 06:25:59", "date_modify": "2025-05-21 06:25:59", "date_publish": "2025-04-01 10:28:47", "description": "Ebou Adams says not hiding his fasting from Derby County team-mates helped elevate his performances during Ramadan.", "filename": "sport_football_articles_c62zg05n6n6o_1747808759.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8298/live/2b59a1d0-0ed6-11f0-a3a0-a5d2188117fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zg05n6n6o_1747808759.html", "title": "Ebou Adams: Derby County midfielder boosted by support during Ramadan", "title_page": "Ebou Adams: Derby County midfielder boosted by support during Ramadan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ebou Adams says being open about Ramadan and not hiding his fasting from Derby County team-mates has helped elevate his performances.\nDuring the Islamic holy month, which ended on Monday with Eid al-Fitr – the \"festival of the breaking of the fast\" – Muslims forgo food and drink between sunrise and sunset.\nThe 29-year-old, the only Muslim player in Derby's first team, continued to play and train throughout Ramadan, captaining the Rams in the Championship and featuring at international level with The Gambia.\n\"It's not easy, let's say that,\" the midfielder said when talking to BBC Radio Derby about the demands of fasting while often playing twice a week.\n\"When I was younger I'd hide it. If people asked my why I was not eating, I'd say I'm not hungry. You'd be a little bit in your own shadow.\n\"You just feel like you are the outsider. You keep yourself to yourself and you don't want to bother others with what you are doing.\"\nWhile Adams remains among the footballing minority – figures indicate that there are about 250 Muslim players in first teams and academies across the Premier League and English Football League - his feelings have changed in recent years.\nThe Professional Footballers' Association has delivered Muslim player consideration awareness workshops at English clubs for more than a decade.\nAdams says team-mates and Derby supporters have increasingly taken interest in how he observes Ramadan.\n\"It's really nice,\" Adams said. \"Some of the boys ask me loads of questions about it and some of the fans are interested, which is really good because they don't have to. But because they care about me, and enjoy what I do, it gives me that extra push.\n\"Now the boys are telling me when it is nearly time to eat, or saying 'you can eat now' which is really nice of them because they want to know how it works.\"\nAdams, who started his career at non-league level with Dartford before going on to join Norwich and play for Braintree, Shrewsbury, Ebbsfleet, Forest Green and Cardiff before moving to Derby in January 2024, says he \"really appreciates\" how manager John Eustace and his backroom staff – including nutritionists – have supported him.\n\"As a player it gives you confidence to go and express yourself on the pitch, and I don't take that for granted,\" Adams added.\n\"When I was younger I never really got it and to get that now, it allows you to be yourself and that is very important. Not just me as Muslim but me as a person - no matter what religion you are, to be allowed to be yourself, that translates to the pitch where I can be myself and enjoy my football.\"", "url": "https://www.bbc.com/sport/football/articles/c62zg05n6n6o"}