{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:41", "date_modify": "2025-04-26 06:44:41", "date_publish": "2025-03-01 17:01:38", "description": "Coleraine move to within a point of opponents Portadown following a comfortable 2-0 win at the Showgrounds.", "filename": "sport_articles_cpdez884pyzo_1745649881.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cpdez884pyzo_1745649881.html", "title": "Coleraine ease to league win over Portadown", "title_page": "Irish Premiership: Coleraine ease to league win over Portadown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Coleraine moved to within a point of opponents Portadown following a comfortable 2-0 win at the Showgrounds.\nGoals from Ronan Doherty and Jamie Glackin secured a second successive victory for the Bannsiders.\nThe home side hit the front after just 11 minutes through Doherty's first goal for the club since his January switch from Cliftonville.\nPortadown did well initially to break up a sweeping Coleraine move but when the ball broke to the midfielder 20 yards from goal his deflected strike curled past Aaron McCarey.\nMcCarey denied the hosts a second goal midway through the opening half with a top drawer save to deny Connor Murray while Kyle McClelland and Matthew Shevlin both headed wide from good positions.\nThe visitors created precious little in the opening 45 minutes and Shay McCartan had their only real effort of note five minutes before the break when his free-kick went the wrong side of Rory Brown's post.\nThe Bannsiders doubled their advantage just before the hour with a clever finish from Glackin.\nPlayed through by Shevlin, the playmaker still had plenty to do but he showed great awareness and technique to chip the ball over a helpless McCarey for his fifth league goal of the season.\nShevlin should have done better from a McGonigle cross in the closing minutes but it mattered little as Coleraine eased to victory, only the second time they have recorded back-to-back successes this season.", "url": "https://www.bbc.co.uk/sport/articles/cpdez884pyzo"}