{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:30", "date_modify": "2025-04-26 06:25:30", "date_publish": "2025-02-28 22:01:37", "description": "Harvey Barron's long-range try and Aidan Sezer's drop-goal edge Hull FC to a dramatic comeback win at Huddersfield Giants.", "filename": "sport_rugby-league_articles_c9de52e4gngo_1745648730.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0524/live/9ff8ec70-f61d-11ef-a416-3b7c7b93a27e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_c9de52e4gngo_1745648730.html", "title": "Super League: Huddersfield Giants 10-11 Hull FC", "title_page": "Super League: Huddersfield Giants 10-11 Hull FC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Harvey Barron's 90-metre interception try set up a dramatic comeback win for Hull FC at Huddersfield Giants.\nThe 21-year-old ended a dangerous Giants attack to grab Tui Lolohea's pass and race to the other end, with Aidan Sezer converting and then adding a drop-goal to win it.\nThe home side seemed to be heading for their first win of the Super League season after tries from Jacob Gagai and Adam Swift saw them up at half-time after Lewis Martin had given the Black and Whites an early lead.\nGiants seemed set to build on their lead but Hull dug in, defended well and struck in the final 15 minutes to make it two wins from three.\nBoth sides needed a win, with Hull having been brought back down to earth by their home thrashing by champions Wigan Warriors last week and Huddersfield having lost both of their opening games of the season.\nThe visitors drew first blood, with Sezer the architect of the try. The former Wests Tigers scrum-half put his team on the front foot with a 40-20, and as Hull pressed hard his floated pass found Martin on the left.\nHe seemed to lose control as he rolled over the line in a tackle and referee Tom Grant ruled 'no try' on the field, only for video referee Aaron Moore to decide Martin had retained fingertip control.\nThe home fans did not like the outcome but Giants hit back in some style. Sam Hewitt accelerated through a gap in the Hull defence and drew the cover before slipping the ball to Gagai, who duly delivered his first Super League try after his move from South Sydney.\nHull then lost John Asiata to the sin-bin and Giants took advantage as Lolohea's sharp pass over the top found Swift and he produced an acrobatic finish in the corner against his former club.\nOliver Wilson fumbled the ball over the line after his dubious tackle had caused Sezer to spill the ball as Huddersfield sought to press home their superiority, but the game turned on two Lolohea errors.\nThe Tonga international had run the game, but when he tried a repeat of his first-half looping pass to Swift, Barron was lurking to grab the ball and race to the other end, making the conversion easy for Sezer.\nWith the scores tied, Lolohea went for a drop-goal but fluffed it under pressure and when Hull took play to the other end, Sezer made no mistake when handed a similar chance to win it.\nHuddersfield Giants coach Luke Robinson told BBC Radio Leeds:\n\"We dominated in pretty much every area of the game. We dominated field position, for 95% of the first half we were really good with the ball, controlling where we turned the ball over.\n\"It feels like we've lost it rather than they've won it. They didn't look like scoring, defensively we never really looked threatened.\n\"I don't even know if they scored that first try, if I'm honest. It was a bit of a dodgy decision from the ref. My take was that it was his pinky just scraping it - I'm not sure downward pressure was involved.\n\"I'm a broken record. The effort was brilliant once again, they did themselves proud regarding the defensive effort, we were just a little bit dumb in our game management.\"\nHull FC coach John Cartwright told BBC Radio Humberside:\n\"I knew it would be tough conditions, a hard place to come and play against a determined side that probably smelled a win themselves, so to come from behind was pleasing - and the way they did it, to get back even and set the field goal up, was probably the most pleasing part.\n\"The two wingers (Harvey Barron and Lewis Martin) are doing a fantastic job for us. Their work rate is enormous and defensively they are getting better and better every week.\n\"The first 20 minutes we got ourselves in some good positions but then some high tackles and errors got them back into the game, the crowd got behind them, a few decisions went their way and we had to fight really hard.\n\"Then Harvey's bit of individual brilliance and Aidan (Sezer's drop goal) won us the game.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/c9de52e4gngo"}