{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:06:24", "date_modify": "2025-05-20 12:06:24", "date_publish": "2023-08-04 18:18:53", "description": "Wrexham sign Republic of Ireland midfielder James McClean from Wigan Athletic.", "filename": "sport_football_66411990_1747742784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3792/production/_130662241_gettyimages-1448739715.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66411990_1747742784.html", "title": "James McClean: Wrexham sign Republic of Ireland midfielder from Wigan Athletic", "title_page": "James McClean: Wrexham sign Republic of Ireland midfielder from Wigan Athletic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham have signed Republic of Ireland midfielder James McClean for an undisclosed fee from Wigan Athletic.\nThe 34-year-old, who this summer earned his 100th international cap, has signed a one-season contract with the option of an extension.\nMcClean will not be available for Saturday's League Two opener against MK Dons and will link up with the squad next week.\n\"I'm absolutely delighted to sign for Wrexham,\" McClean said.\n\"It's a project that is very exciting and I'm looking forward to being a part of it.\n\"The club has ambitions to go even further and I'm a very ambitious person. I'm someone who is driven and I want to be a part of that journey.\"\nThe Londonderry-born wide man started his career with Institute and then spent three years with Derry City, before making his move into English football with Sunderland in 2011.\nAfter two seasons in the top flight he moved to Wigan in 2013 - spending two seasons with the Latics - before returning to the top flight when he joined West Bromwich Albion in 2015.\nMcClean made more than 100 appearances across three seasons with the Baggies, before a three-year spell with Stoke City, and then returned to Wigan in 2021.\nHe helped them to promotion from League One in his first season and then was an ever-present in the Championship in the 2022/23 campaign.\nHis two-year second spell with Wigan took him beyond 550 domestic career appearances, scoring 69 goals, while he has netted 11 times in his 100 appearances for the Republic.\nOne of those goals famously came against Wales in October 2017 in Cardiff, earning the Republic a qualifying play-off spot while ending the home side's 2018 World Cup hopes.\nWrexham manager Phil Parkinson said: \"I'm really pleased with the signing of someone with the calibre of James.\n\"As I said in the summer, it's about being patient and getting the players in who can be strong additions to our squad moving forward.\"", "url": "https://www.bbc.com/sport/football/66411990"}