{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:17", "date_modify": "2025-05-21 05:31:17", "date_publish": "2025-04-02 21:24:56", "description": "Arsenal step up interest in Nico Williams, Pep Guardiola is among the names wanted to manage AC Milan, Bournemouth's Dean Huijsen has a trio of high-profile suitors.", "filename": "sport_football_articles_c15v4qzkejwo_1747805477.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/77ba/live/a002b150-1004-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c15v4qzkejwo_1747805477.html", "title": "Football gossip: Williams, Guardiola, Huijsen, Salah, Diao", "title_page": "Football gossip: Williams, Guardiola, Huijsen, Salah, Diao - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal step up interest in Nico Williams, Pep Guardiola is among the names wanted to manage AC Milan, Bournemouth's Dean Huijsen has a trio of high-profile suitors.\nArsenal's new sporting director Andrea Berta met with Athletic Bilbao winger Nico Williams' agent in recent days to discuss a summer move for the 22-year-old Spain international. (Guardian), external\nManchester City manager Pep Guardiola and former Brighton boss Roberto de Zerbi, who is currently with Marseille, are being considered as candidates by AC Milan. (Corriere della Sera - in Italian), external\nLiverpool and Chelsea want to sign 19-year-old Bournemouth defender Dean Huijsen this summer, but will face competition from Real Madrid for the £50m-rated Spain international. (Independent), external\nEgypt forward Mohamed Salah, 32, is set to extend his contract with Liverpool after months of speculation. (Foot Mercato - in French), external\nManchester United, Liverpool and Newcastle are showing interest in Como's 19-year-old Senegal winger Assane Diao. (Caught Offside), external\nLiverpool's 19-year-old Scotland forward Ben Doak, who is on loan at Middlesbrough, could move to Everton this summer in a £30m deal. (Football Insider), external\nArsenal, Liverpool and Nottingham Forest are interested in Algeria striker Mohamed Amoura, 24, who is currently on loan at Wolfsburg from Union St-Gilloise. (L'Equipe - in French), external\nJuventus want to bring Newcastle's Italy midfielder Sandro Tonali to the club, with the Serie A side valuing the 24-year-old at about £70m. (Gazzetta - in Italian), external\nNewcastle will renew their interest in Crystal Palace and England defender Marc Guehi, 24, in the summer. (GiveMeSport), external\nLiverpool have been in contact with representatives of Japan winger Takefusa Kubo, 23, and could make a move in the summer if Real Sociedad fail to qualify for Europe. (Teamtalk), external", "url": "https://www.bbc.com/sport/football/articles/c15v4qzkejwo"}