{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:44:56", "date_modify": "2025-04-26 03:44:56", "date_publish": "2025-03-05 00:00:00", "description": "All the latest football news and reaction to the last-16 of the Champions League as Aston Villa and Arsenal win, plus build-up to Liverpool's clash in Paris.", "filename": "sport_football_live_c743zqkqpwjt_1745639096.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83bc/live/9582a200-f9c3-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c743zqkqpwjt_1745639096.html", "title": "Champions League: Arsenal's thrash PSV & Aston Villa win at Brugge", "title_page": "Champions League: Arsenal's thrash PSV & Aston Villa win at Brugge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Recap: Champions League build-up and latest news\nThank you for joining us today as we brought you the latest football news and for sending in your thoughts throughout the day.\nIf you want to catch-up, click on the links in the summary section.\nThere's four Champions League matches tonight, follow live text updates on the BBC Sport app and website.\nWe will be back tomorrow with Champions League reaction and build up to the Europa League.\nTake care!\nBenfica v Barcelona: What happened last time?\nBenfica v Barcelona (20:00 GMT)\nIn short, it was chaos.\nBarcelona twice fought back from two goals down - and two Wojciech Szczesny howlers - to snatch a dramatic 5-4 victory at Benfica during this year's Champions League league phase.\nThe hosts made a dream start as Greek striker Vangelis Pavlidis hit a 30-minute hat-trick, helped by two mistakes from Polish keeper Szczesny, while Robert Lewandowski replied from the penalty spot for the Spanish side.\nGoals for Raphinha and Lewandowski, either side of an Ronald Araujo own goal, then left Barca one behind at 4-3.\nBut Eric Garcia headed home a late equaliser and in the 96th minute, just after Szczesny had made a fine block from Angel di Maria and Benfica were denied a penalty, Raphinha broke away and slotted past Anatoliy Trubin to leave the home crowd stunned.\nOf the 40 times that Benfica have scored four goals or more in a European home match, this was the only occasion when they’ve ever failed to win.\nBundesliga state of play\nBayern Munich v Bayer Leverkusen (20:00 GMT)\nBayer Leverkusen did the unthinkable last season when they went the entire Bundesliga season unbeaten to be crowned champions.\nThey finished 17 points ahead of Bayern Munich, winning 28 of their 34 fixtures and drawing the other six.\nIt was always going to be a near impossible task to replicate - and this season some normality has returned to the German top flight.\nMunich have reclaimed top spot for now, and sit eight points ahead of Leverkusen in second with 10 games to play.\nXabi Alonso's side have hit form at the right time though. They haven't lost in the league since August and have only one defeat in all competitions since then.\nDembele emerges as PSG talisman\nPSG v Liverpool (20:00 GMT)\nRaphael Jucobin\nBBC Sport in Paris\nLeading the reversal in fortunes has been Ousmane Dembele's newly found confidence in front of goal, with the 27-year-old finally realising the potential of his talent.\nThe France international, despite arguably being the face of the club with Kylian Mbappe gone, has scarcely been given any kind of preferential treatment.\nHe was notably dropped for the trip to face Arsenal in October, for arriving late to training, a move which Enrique later branded more recently as \"the best thing I've done to him\".\nAfter a needless sending off in the defeat by Bayern Munich, Dembele was again relegated to the bench for the following league games.\nWith 18 goals across all competitions since the turn of the year, the 27-year-old has scored more in two months than any single season of his to date.\nPSG's post-Mbappe era, no 'clans' and foreign stars' French buy-in\nPSG v Liverpool (20:00 GMT)\nRaphael Jucobin\nBBC Sport in Paris\nRarely in the past decade and a half of Qatari ownership have Paris St-Germain entered the spring with this kind of confidence.\nWhile the post-Kylian Mbappe era arguably started midway through last season, given that the France captain was mostly spared for high-profile matches at that point, replacing his output and leading role remained the major uncertainty on the eve of the new campaign.\nThat task was made all the more pressing by the absence of a centre-forward in name during most of the autumn.\nPortuguese international Goncalo Ramos was sidelined for three months with an ankle injury, while Randal Kolo Muani was progressively phased out of the team, eventually culminating in his loan move to Juventus this winter.\nInitially, it was Bradley Barcola, from the left wing, who took up the mantle by scoring 10 times in the first 11 league games of the campaign.\nThe Parisians' free-scoring run since January has included 18 goals in four European encounters, with Ousmane Dembele leading the way.\nRead more here.\n'Dangerous game' for Liverpool\nPSG v Liverpool (20:00 GMT)\nChris Sutton\nFormer Premier League striker on the Football Daily podcast\nI think this is a dangerous game for Liverpool and of course with Liverpool they're flying in the Premier League but I think Arne Slot was quite right about the draw, they would have much preferred Benfica. PSG have players who can really hurt Liverpool. Liverpool have had a phenomenal season but I think they've got their work cut out to beat PSG, I really do.\nI think it will be really close, I think it will be tight going to Anfield. I wouldn’t rule anything out in this tie. I think that is the tie of the round and Liverpool have been phenomenal this season.\nCan they do the Champions League double with the Premier League and of course they’ve got the Carabao Cup final coming up. But for them to be in this position, at this stage of the competition, nobody saw this coming from Arne Slot.\nGakpo a big doubt for PSG\nPSG v Liverpool (20:00 GMT)\nLiverpool\nLiverpool forward Cody Gakpo is a big doubt for Liverpool's game against Paris St-Germain after picking up a knock on Tuesday.\nThe Netherlands international is the Reds' second-highest scorer this season with 16 goals in all competitions.\n\"He was close to being ready to play again but unfortunately yesterday he had to block a shot and he felt a bit of pain again,\" Slot said.\n\"We brought him with us to judge how if he can be part of the squad but it will be a close call.\"", "url": "https://www.bbc.co.uk/sport/football/live/c743zqkqpwjt"}