{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:49", "date_modify": "2025-04-26 06:16:49", "date_publish": "2025-03-01 00:00:00", "description": "How the action unfolded as Armagh defeated Dublin a Division One encounter.", "filename": "sport_live_clyzz0rgq09t_1745648209.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/56bc/live/7bb87200-f6df-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_live_clyzz0rgq09t_1745648209.html", "title": "Armagh earn eight-point win over Dublin - as it happened", "title_page": "National Football League: Armagh earn eight-point win over Dublin - as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Final whistle\nFT: Armagh 1-20 Dublin 1-12\nA big win for Armagh with most of the hard work done in a blistering first half from the All-Ireland champions.\nDublin fought back in the second half but Armagh had enough in the tank to see them over the line.\nThat's all from us for now but we'll be back tomorrow for more league action.\nThanks for your company.\nPost\nArmagh 1-18 Dublin 1-11\nAndrew Murnin superbly leaps to overturn a Dublin kick-out and Armagh work it to Tomas McCormack, who adds to their lead with eight minutes to play.\nJemar Hall is on for Armagh in place of Ross McQuillan, whilst Kevin Lahiff - who pointed earlier in the half as a temporary sub - is on for good for Dublin. He replaces Niall Scully.\nGame over or will there be another comeback?\nHT: Armagh 1-12 Dublin 0-3\nThere's a party atmosphere around the sold-out Athletic Grounds, with 'G stands for Geezer' blasting over the tannoy, as Armagh lead by 12 at half-time.\nHowever, 'Geezer' will be spending the interval reminding his team that the game is far from over.\nThey led by eight at this stage against Mayo last week, but were held to a draw.\nConversely, Dessie Farrell will be telling his side that the game is far from over - they came back from the same margin away to Kerry two weeks ago, winning that game by one.\nHalf-time\nHT: Armagh 1-12 Dublin 0-3\nArmagh close the half with one last point but it was so nearly a second goal.\nGreg McCabe was hoping to raise a green flag with his ferocious shot, but Evan Comerford saves the shot over his bar.\nIt was excellent first half display from Armagh and they are full value for their lead.", "url": "https://www.bbc.co.uk/sport/live/clyzz0rgq09t"}