{"authors": ["Karan Vinod", "www.facebook.com"], "date_download": "2025-05-21 04:54:28", "date_modify": "2025-05-21 04:54:28", "date_publish": "2025-04-04 15:07:15", "description": "Kieran McKenna press conference: Ipswich vs Wolves preview", "filename": "sport_football_articles_cx20nx1z4w1o_1747803268.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a85/live/ac9e2280-490a-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx20nx1z4w1o_1747803268.html", "title": "Kieran McKenna press conference: Ipswich vs Wolves preview", "title_page": "Kieran McKenna press conference: Ipswich vs Wolves preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On squad fitness: \"Nothing new from other night [against Bournemouth]. In terms of availability, we'll be leaving some decisions until tomorrow. We had players who played a little bit more than what we would have wanted the other night. It was a physical game and we've got players coming back from injury. It's going to be late judgements on how everyone is tomorrow before we make final decisions.\"\nOn the climax to the season: \"We have nine games left. We broke it down as pretty much a quarter of the season - and we want to have the best quarter of the season in terms of performances and in terms of results. We want to show growth as a team and we want to try to win as many games as we can.\"\nMcKenna also said that he wasn't the biggest fan of VAR but believes that semi-automated offsides could help: \"I don't naturally enjoy it. I enjoy when you score a goal and it's a 100% goal. Other than that, it has brought some benefits. But the time is still an issue and semi-automated offsides would be a step forward.\"\nOn facing Wolves knowing a win would move Town to within six points of the Molineux side, McKenna said: \"We will be ready to go. Everyone knows it's an important game, with not too many games left. We are playing a team that is one position higher than us in the league so it's a game of significance - but every game is. We are going to give our best. It would be a fantastic game to win.\"\nOn Kevin de Bruyne leaving Manchester City: \"He's been incredible and certainly one of the greatest to grace the league. I faced him quite a few times as a coach with United and the biggest part of the gameplan was how to stop him. If he decides it's the right time, it's the right time.\"", "url": "https://www.bbc.com/sport/football/articles/cx20nx1z4w1o"}