{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:32:22", "date_modify": "2025-05-21 07:32:22", "date_publish": "2025-03-28 16:57:50", "description": "Celtic manager Brendan Rodgers believes Rangers winger Vaclav Cerny demonstrated a \"lack of respect\" with his water-squirting celebrations in the Old Firm derby.", "filename": "sport_football_articles_ckgng3lmzkxo_1747812742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bcfe/live/c970b290-0bf3-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgng3lmzkxo_1747812742.html", "title": "Vaclav Cerny water squirt showed 'lack of respect'", "title_page": "Vaclav Cerny water squirt showed 'lack of respect' - Celtic boss Brendan Rodgers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic manager Brendan Rodgers believes Rangers winger Vaclav Cerny demonstrated a \"lack of respect\" with his water-squirting celebrations in the Old Firm derby.\nThe Czech Republic international, who had been withdrawn five minutes before Hamza Igamane grabbed a late winner, aimed the contents of a drinks bottle at home fans as he ran up the touchline in the aftermath of the goal.\n\"I understand the jubilation and Rangers players have every right to celebrate with their supporters,\" said Rodgers.\n\"You come to Celtic Park, like it would be when we go to Ibrox, you win a game of that magnitude, you celebrate. But not in that way.\"\nOn Thursday, Rangers' interim boss Barry Ferguson said Cerny had got a \"wee bit over-excited\", adding: \"I have no issues with that.\"\nBut Rodgers was clear he would not stand for similar actions.\nHe continued: \"It's respect, isn't it? I think it's a lack of respect if somehow a player runs up a touchline and he's squirting a water bottle in a supporter's face. I certainly wouldn't want my players to do it.\n\"Listen, it works both ways, a lot comes into players as well, from the stands, to coaches, managers and players.\n\"But I think we all know there's a line that we shouldn't cross. It is a very emotive game, an amazing fixture, and I thought it was great to have the [away] fans back in, I think that gave it that extra bit as well.\n\"But I just think there's lines we can't antagonise because in this fixture in particular, that can lead to an issue.\"", "url": "https://www.bbc.com/sport/football/articles/ckgng3lmzkxo"}