{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:02:53", "date_modify": "2025-05-20 15:02:53", "date_publish": "2023-07-27 11:25:57", "description": "Liverpool captain Jordan Henderson joins Saudi Arabian club Al-Ettifaq in a deal worth £12m plus add-ons.", "filename": "sport_football_66185472_1747753373.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14F70/production/_130527858_hendo1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66185472_1747753373.html", "title": "Jordan Henderson: Liverpool confirm captain's move to Al-Ettifaq", "title_page": "Jordan Henderson: Liverpool confirm captain's move to Al-Ettifaq - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Henderson had been at Liverpool since joining from Sunderland in a deal worth £20m in June 2011.\nHe played 492 times for the Reds, scoring 33 goals and registering 57 assists, and won seven major trophies with the club.\n\"You are a legend,\" said Liverpool manager Jurgen Klopp in a video on the club's social media channels.\n\"I know people say recently we use that word slightly too often. I can tell you, that it's not in your case.\"\nHenderson, who has signed a deal running until 2026 with Al-Ettifaq,, external will link up again with ex-Liverpool captain Steven Gerrard, who is manager of the Saudi Pro League side.\nThe pair were team-mates at the Anfield club before Gerrard left in 2015.\n\"I know it was a really, really tough decision for Hendo and I was around or with him all the way,\" Klopp told Liverpool's website.\n\"It's sad, absolutely strange, because he is the only captain I had here at Liverpool, but I think it is exciting for him as well.\n\"We will miss him, without a shadow of a doubt, that's clear - as a man and as a player. But, as I said, that's football.\"\nHenderson became Liverpool captain in 2015 and led the side to Champions League victory in 2019 before they went on to win the Uefa Super Cup and Fifa Club World Cup later that year.\nHe was also the Reds skipper when the club won the 2019-20 Premier League to end a 30-year wait for the English top-flight title.\nHenderson's other honours at Liverpool include winning the FA Cup in 2022 and League Cup in 2012 and 2022.\nHe travelled with Liverpool for their training camp in Germany but was not involved in their opening game of pre-season against Karlsruher on 19 July after a deal was agreed in principle between them and Al-Ettifaq.\n\"In the moment, it is absolutely fine but it was already ongoing for a while now, so we had time to adapt to it and get used to it,\" said Klopp.\n\"It is football, it is life, it is normal, these kind of things happen.\n\"Monday, when we arrived back in Liverpool, Hendo was waiting for us to say goodbye properly to the team and to the coaching staff as well, so that was a really nice gesture - a really nice thing to do.\"\nFans posted messages of thanks to Henderson across social media following the release of his goodbye video, while Stonewall, the LGBTQ+ charity which organises the Rainbow Laces campaign, has thanked Henderson, external for his support.\nHowever, Henderson has been criticised by some LGBTQ+ campaigners over the transfer, as same-sex sexual activity is illegal in Saudi Arabia. The player has publicly supported the LGBTQ+ community in the past.\n\"So Jordan Henderson finally gets his move to Saudi Arabia,\" said former Aston Villa midfielder Thomas Hitzlsperger, who came out as gay in 2014, in a social media post., external\n\"Fair play to him, he can play wherever he wants to play. Curious to know though how the new brand JH will look like. The old one is dead!\n\"I did believe for a while that his support for the LGBTQ+ community would be genuine. Silly me…\"\nSaudi club Al-Ittihad made a £40m bid for the Liverpool midfielder Fabinho on 14 July.", "url": "https://www.bbc.com/sport/football/66185472"}