{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:46:28", "date_modify": "2025-04-26 06:46:28", "date_publish": "2025-03-01 13:32:14", "description": "Fenerbahce manager Jose Mourinho has his four-match suspension halved by the Turkish Football Federation on appeal.", "filename": "sport_football_articles_c7983xvj5z5o_1745649988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8145/live/8902cdb0-f69f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7983xvj5z5o_1745649988.html", "title": "Jose Mourinho: Fenerbahce boss has four-match suspension halved", "title_page": "Jose Mourinho: Fenerbahce boss has four-match suspension halved - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jose Mourinho has had his four-match suspension halved by the Turkish Football Federation following a successful appeal by his club Fenerbahce.\nThe 62-year-old Portuguese manager has also seen his fine reduced from 1.6m Turkish lira (£35,000) to 558,000 (£12,200).\nMourinho's club said on Thursday that it would appeal against the penalties after he was punished for two separate disciplinary matters following Monday's 0-0 draw against local rivals Galatasaray.\nThe TFF said it would penalise him for \"his derogatory and offensive statements towards the Turkish referee\" and because he \"accused Turkish football of chaos and disorder with insulting and offensive statements towards both the Turkish football community and all Turkish referees\".\nThe match against Galatasaray was refereed by Slovenian Slavko Vincic after both clubs requested a foreign official take charge of the fixture.\nBut the fourth official was Turkish and Mourinho repeated his criticism of Turkish referees during his post-match news conference.\nMourinho will miss Sunday's match against Antalyaspor, having already sat out a Turkish Cup game against Gaziantep FK.\nThe fallout from Monday's game continued on Friday when Mourinho filed a lawsuit against Galatasaray for 1,907,000 Turkish Lira - about £41,000 - after the club accused him of making racist statements.\nMourinho, who had said the Galatasaray bench had been \"jumping like monkeys\", said their claims were \"completely taken out of context\".\nMourinho's Fenerbahce are second in Turkey's Super Lig, six points behind fellow Istanbul side Galatasaray.", "url": "https://www.bbc.co.uk/sport/football/articles/c7983xvj5z5o"}