{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-04-26 03:56:38", "date_modify": "2025-04-26 03:56:38", "date_publish": "2025-03-04 15:02:24", "description": "Jon Armstrong says he wants to \"push\" for the European Rally Championship title after announcing a full campaign driving a M-Sport Ford Fiesta.", "filename": "sport_motorsport_articles_c8x4vgj0v9wo_1745639798.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/860e/live/0d5fcb40-f901-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_motorsport_articles_c8x4vgj0v9wo_1745639798.html", "title": "European Rally Championship: Jon Armstrong ready for title push with M-Sport", "title_page": "European Rally Championship: Jon Armstrong ready for title push with M-Sport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Jon Armstrong says he wants to \"push\" for the European Rally Championship (ERC) title after announcing a full campaign driving a M-Sport Ford Fiesta.\nThe 30-year-old, from Northern Ireland, recorded four top-10 finishes and earned a podium, second place at the season-ending Rally Silesia in October, in the ERC last season.\nHe was ERC3 champion in 2023, the second tier of European rallying, and is a two-time runner-up in the Junior WRC, which runs as part of the World Rally Championship.\nSupported by Motorsport Ireland, Armstrong will be co-driven by Shane Byrne for the first time.\n\"I'm really looking forward to being back with M-Sport again for the ERC, we can now really build upon everything we learnt from last year,\" said Armstrong.\n\"We had a really good end to the season, so hopefully we can work on the areas we didn't capitalise on last year, try to have a really good season and hopefully push to be in the championship fight.\"\nM-Sport team principal Richard Millener said it was a \"huge pleasure\" to welcome Jon and Motorsport Ireland back to the team for 2025.\n\"We saw some really positive development in his pace and maturity throughout last year in the Rally2 car, and I think we can set our sights on some top results from him and Shane this season,\" he said.\nArmstrong and Byrne will start their partnership at the West Cork Rally from 14-16 March before embarking on their European campaign.\nRally Sierra Morena in Spain opens the ERC season in April before events in Hungary, Sweden, Poland, Italy, Czech Republic, Wales and Croatia.", "url": "https://www.bbc.co.uk/sport/motorsport/articles/c8x4vgj0v9wo"}