{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:13:53", "date_modify": "2025-05-20 12:13:53", "date_publish": "2023-08-04 17:24:24", "description": "Arsenal: 'We are working on a few things' - Mikel Arteta", "filename": "sport_articles_ce4zp5rqz3wo_1747743233.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/075f/live/bbc2c890-32dd-11ee-8f84-d5fed57dc753.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_ce4zp5rqz3wo_1747743233.html", "title": "Arsenal: 'We are working on a few things'", "title_page": "Arsenal: 'We are working on a few things' - Mikel Arteta - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Mikel Arteta wants the \"optimal\" number of players in his squad for \"healthy competition\" as they head into the new season.\nArsenal have already brought in new signings Kai Havertz, Declan Rice and Jurrien Timber this transfer window, but the Gunners boss feels there is still work to be done on the squad.\nSpeaking in his Community Shield pre-match news conference, Arteta said: \"We are in the process, we are working on a few things, we have to make a few decisions and there is still time to do that.\n\"We are very happy with the squad that we have that is for sure, but as well we have to make sure that we can have and we can share the minutes in the right way for the team to have a healthy competition within the squad and we are working on that.\n\"Optimal people and optimal players - that is what I want.\"\nThe Spaniard's side take on Manchester City at Wembley on Sunday, the club who they outbid for the signature of Rice, and Arteta emphasised the importance of being able to bring in players like the midfielder.\n\"We just explained our thoughts to [Rice] - what role he would have in the club and the team. He bought into that, him and his family,\" said Arteta.\n\"The important thing now is that when we have a target that we have the resources that we need to bring that player in - but as well that we can convince him and what we tell him excites him, that he feels inspired and he wants to be part of it.\n\"We are getting that from every player.\"", "url": "https://www.bbc.com/sport/articles/ce4zp5rqz3wo"}