{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:13", "date_modify": "2025-05-21 06:57:13", "date_publish": "2025-03-29 00:00:00", "description": "Live text commentary from the SSE Arena as title-chasing Belfast Giants host the Fife Flyers in the Elite League.", "filename": "sport_ice-hockey_live_c1kjdn7l3k9t_1747810633.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e63/live/17c4f850-08db-11f0-97d3-37df2b293ed1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_ice-hockey_live_c1kjdn7l3k9t_1747810633.html", "title": "Belfast Giants v Fife Flyers", "title_page": "Belfast Giants v Fife Flyers - Elite League Ice Hockey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Giants set up opportunity to win title\nBelfast Giants 9-1 Fife Flyers\nIt’s all over and the Belfast Giants could win the title tomorrow with a win over Manchester and a defeat by Sheffield either tonight, although they lead Dundee 2-1, or tomorrow against Fife.\nIt may not happen tomorrow, but two wins out of three regardless of what Sheffield do or Nottingham who are mathematically still in the race, will be enough.\nWe’ll be back tomorrow from 3.45pm for the game between the Giants and Manchester Storm\nThird period underway\nBelfast Giants 8-1 Fife Flyers\nTo be honest I’m paying more attention to what is going on in Sheffield where the final period against Dundee will be underway shortly.\nCould the Giants be playing for the championship tomorrow?\nWe’re back underway here in Belfast….\nGiants closing in on another big victory\nBelfast Giants 8-1 Fife Flyers\nGiants are going to win.\nNottingham have been beaten by Guildford.\nAttention turns to Sheffield where it’s 1-1 against Dundee after two periods.\nThe Nottingham loss opems up the possibility that the Giants could win the Elite League title on Sunday with a win over Manchester.\nFor that to happen Sheffield need to lose a game - so if that’s tonight against Dundee then victory over the Storm tomorrow will win the league for the Giants.\nHowever the Steelers will travel to Fife tomorrow as well, so a loss there would hand the title to the Giants if they beat the Storm.\nGiants in control after first period\nBelfast Giants 4-1 Fife Flyers\nI’ve seen some weird and wonderful moments in sport down though the years but a Fife comeback to win this game would be up there with the most stunning.\nGiants in total control and on their way to a big win.\nAfter two periods the Panthers trail Guildford 2-0 while Sheffield lead Dundee 1-0 in the first period.\nGiants continue title quest against Fife Flyers\nBelfast Giants v Fife Flyers (19:00)\nIt’s the penultimate weekend of the Elite League regular season and there are three sides chasing the title.\nRight now it’s in the hands of the Belfast Giants. With four games remaining they need to win three, starting with today’s game against Fife.\nWith Manchester visiting tomorrow and Nottingham next Saturday, the Giants can win the title at home.\nAny slip-ups allow Nottingham and Sheffield into the mix.\nThe Panthers are two points behind but having played a game more.\nThe Steelers are three points adrift and need a Giants loss to have a chance.\nThe Panthers are in Guildford tonight while Sheffield hosts Dundee.\nThe Giants beat the Flyers 10-4 here in Belfast on Wednesday night and another two points tonight brings that title one step closer.", "url": "https://www.bbc.com/sport/ice-hockey/live/c1kjdn7l3k9t"}