{"authors": ["Mike Minay", "www.facebook.com"], "date_download": "2025-05-21 07:37:16", "date_modify": "2025-05-21 07:37:16", "date_publish": "2025-05-20 15:01:59", "description": "Man City news: Opinion - De Bruyne tribute from Radio Manchester's Minay", "filename": "sport_football_articles_c0577pdzlv9o_1747813036.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c301/live/20816be0-3ae1-11ef-bdc5-41d7421c2adf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0577pdzlv9o_1747813036.html", "title": "Man City news: Opinion", "title_page": "Man City news: Opinion - De Bruyne tribute from Radio Manchester's Minay - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I've been asked many times in the last week or so: \"What's the one moment of Kevin De Bruyne's time at Manchester City that will stick with you?\"\nIt is quick to think of the pass to Leroy Sane against Stoke, the assist for Oscar Bobb against Newcastle, an FA Cup final goal, a brilliant free-kick, or his goals against Real Madrid. But no.\nFor me, it is on the pitch in Istanbul after the 2023 Champions League final which saw Manchester City win the Treble. Pep Guardiola and De Bruyne embracing with the manager shouting in his midfielder's ear, in tears: 'We did it, Kev. We did it.\"\nThese two, brought to the club to help stimulate European success had achieved their dreams, and fans too.\nKevin had battled through the last two months of that season with his hamstring about to tear at any moment. Key goals, key passes as City surged to Premier League and FA Cup success.\nThere is no time when he is on the ball that you don't prepare yourself for something magic to happen. Even though this season hasn't gone to plan, you know it is still a possibility. What pass will he pick out next? If there has ever been one player you knew could change a game in an instant with just one pass, it is Kevin de Bruyne.\nIn the end, the hamstring gave up. In the Champions League final of all moments. But that didn't stop him then joining Pep on the touchline, as a temporary assistant manager, as they held on to the 1-0 win. He wanted to help that club over the line as much as anybody.\nI have also been asked whether he is City's greatest ever. That's not fair on legends I've never seen: Colin Bell, Francis Lee, Mike Summerbee. It's also not fair to legends I have seen: Sergio Aguero, David Silva, Vincent Kompany. They all played different roles and different times. But, he is up there.\nA decade of passionate, sparkling, critical performances embodied in a smiling, dry-humoured, family man.\nKevin, it's been an absolute delight to call the big moments you've been part of. Thank you, legend.", "url": "https://www.bbc.com/sport/football/articles/c0577pdzlv9o"}