{"authors": ["Mo Allie", "www.facebook.com"], "date_download": "2025-05-20 14:35:39", "date_modify": "2025-05-20 14:35:39", "date_publish": "2023-07-28 15:21:10", "description": "Organisers in South Africa say investigations are continuing at “highest level” after Jamaica captain says she was victim of theft.", "filename": "sport_africa_66341518_1747751739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90D5/production/_130577073_worldcup.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66341518_1747751739.html", "title": "Netball World Cup 2023: Safety concerns in South Africa after Jamaica captain's theft claim", "title_page": "Netball World Cup 2023: Safety concerns in South Africa after Jamaica captain's theft claim - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Organisers of the Netball World Cup in South Africa say investigations are continuing at the \"highest level\" after members of the Jamaica team raised concerns about safety and the team's captain said she had money stolen.\nThe tournament began on Friday with comfortable wins for defending champions New Zealand and favourites Australia, who beat Zimbabwe 86-30.\nIt is being held in Cape Town, the first time in its 60-year history that it has been hosted on African soil.\nIn an Instagram post on Wednesday, which has since been deleted, Fowler said individuals had also tried to access the team's rooms at their city centre hotel.\nThe hotel, one of seven being used to accommodate the 16 teams, is within walking distance of the Cape Town International Convention Centre, the sole venue being used.\n\"This is so unfortunate,\" Fowler posted. \"This place isn't safe. First they stole money from my purse, now people [are] trying to come in on us in our rooms. Really!\nResponding to her captain, team-mate Shamera Sterling said she was ready to leave before the tournament had even started.\n\"Seems like we are staying on the street,\" she added. \"We aren't safe. I'm ready to go home\".\nThe Jamaicans arrived in Cape Town as one of the tournament favourites after winning silver at last year's Commonwealth Games in Birmingham.\nSpeaking at a media briefing on Thursday, Lieutenant-General Tebello Mosikili, chairperson of the National Joint Operational and Intelligence Structure (Natjoints), said: \"I can assure each and every participant taking part in the Netball World Cup, those at all hotels and venues with the security, we will do everything in our power to ensure their safety.\n\"If there is any problem they are encouraged to report as soon as possible.\"\nNatjoints is responsible for safety and security at all major sporting, cultural and recreational events in South Africa.\n\"We have dedicated investigators in the city. We're waiting for the complainants to come forward,\" added Mosikili.\nTournament director Priscilla Masisi has also insisted that security is being taken very seriously at the 10-day competition.\n\"There is a (daily) team managers' meeting, which happens in the hotels. So if there is any issue, it's brought to our attention,\" she said.\nWith the incident threating to mar the start of the World Cup, South Africa's minister of sports, arts and culture, Zizi Kodwa, has also added his voice to those trying to reassure.\nHaving just returned from the Fifa Women's World Cup in New Zealand, where he was watching the country's football team, Kodwa said a conversation with his Kiwi counterpart, Grant Robertson, provided perspective.\n\"There was an incident that happened on the day of the opening in Auckland,\" said Kodwa, referring to a shooting that killed two people and injured six others. The gunman also died after the attack on a construction site.\n\"He said to me that you should never give yourselves a 10 out of 10 because there is always room for improvement.\n\"When you deal with events of this magnitude, when you're a host, you need to give yourself nine out of 10,\" added Kodwa. \"That incident in Auckland has had no impact on the whole event. The World Cup continued, despite the shooting.\n\"Our capability to host as a country should not be in doubt. We are quite happy with the work that has been done\".", "url": "https://www.bbc.com/sport/africa/66341518"}