{"authors": ["Sam Harris", "www.facebook.com"], "date_download": "2025-05-21 05:42:39", "date_modify": "2025-05-21 05:42:39", "date_publish": "2025-01-31 17:10:02", "description": "Neymar has returned to Santos, his boyhood club. BBC Sport looks back at his time with Barcelona, PSG and Al-Hilal, and considers what might happen next for Brazil's record scorer.", "filename": "sport_football_articles_c93q0vr1klxo_1747806159.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3d99/live/526d17e0-e0ad-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93q0vr1klxo_1747806159.html", "title": "Neymar signs for Santos: The prince who never became king at Barcelona or PSG", "title_page": "Neymar signs for Santos: The prince who never became king at Barcelona or PSG - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Neymar's return to his boyhood club, Santos, is complete.\nOne of Brazil's greatest footballing exports, and still the world's most expensive player, has signed a six-month contract that brings him back to Vila Belmiro.\nThe 32-year-old's homecoming follows the termination of his contract with Saudi Pro League side Al-Hilal on 27 January, closing the chapter on an injury-plagued and ultimately unfulfilling stint in the Middle East.\n\"He was desperate to come back to Santos,\" said BBC Sport's Spanish football expert Guillem Balague.\nSantos were eager to bring Neymar back too. They reportedly used an AI-generated voice of club legend Pele, external in a video to persuade him to re-sign.\nBut what will Neymar really bring to Santos?\nAs Balague said: \"Everyone knows where he is now with his relationship to football.\"\nThe relationship has evolved throughout his career, earning Neymar a reputation as 'the prince who never became king'.\nSearch for that nickname on TikTok or YouTube and you will find a flood of compilations with videos of Neymar's best moments.\nThese are not just highlight reels of goals - there are montages of dazzling dribbles, rainbow flicks, and nutmegs.\nA celebration of 'Joga Bonito', the Brazilian ethos of 'playing [football] beautifully', Neymar's game encapsulated the spirit of football as art.\nAdd to that the many hairstyles and the nose tape, his whole aesthetic has enhanced a football culture and lineage that some felt might break when his Brazil counterpart Ronaldinho faded from view.\nBy the time Neymar left Santos in 2013 for Barcelona, the then 21-year-old had scored 136 goals in 225 appearances, won the 2011 Puskas Award for a breathtaking goal against Flamengo and finished in the top 10 of the Ballon d’Or award in the same year.\nUpon his move to Spain, Neymar was perceived by many as the heir apparent, the one who could finally step out of the shadows cast by Lionel Messi and Cristiano Ronaldo.\n\"He's a lovely person - childlike in many ways - but surrounded by good people, and he loved Barcelona,\" Balague said.\nUnder the bright lights of the Nou Camp, Neymar shone in what many consider one of the greatest forward lines in football history.\nIn a front three with Messi and Luis Suarez, he helped to deliver two La Liga titles, three Copa del Reys, and a Champions League trophy.\nOperating from the left, Neymar occupied a role that allowed his brilliance and flair to flourish.\n\"He had to play in that position because of Suarez and Messi,\" Balague explained.\n\"At the time, he didn't realise that being just a left winger would bring out his best.\"\nIn the 2015-16 season, the so-called MSN trio combined for 131 goals and 65 assists, dismantling defences with pace, precision, and audacity.\nNeymar was delivering on the biggest stage, but the dream of dethroning his now team-mate Messi to become the world's best player was looking like just that, a dream. Messi was the untouchable star of the show, with everyone else in a supporting role, even Neymar.\nBalague reflected: \"The day he realised he had to leave Barcelona was their incredible Champions League comeback victory against Paris St-Germain which finished 6-1 in March 2017.\n\"He scored two goals and got an assist for the sixth goal, he was the best player on the pitch, but the main photo after was of Messi. He realised he would not be able to be the number one at Barcelona.\"\nThat summer, Neymar swapped his life in Spain for the capital of France.\nPSG paid a world-record €222m (£200m) fee that remains unsurpassed to this day.\nIn Paris, Neymar often operated with more freedom, shifting into a central role where he orchestrated attacks and created from deeper positions.\nMore freedom on the pitch was coupled with more commercial obligations off it.\n\"His love for the game was taken from him in Paris, he became an industry,\" Balague said.\n\"In fact, when he was at PSG, his contract said he could dedicate days to training and others to commercial opportunities.\n\"After that his head started going in different directions. He would play the PlayStation until three in the morning and wouldn't be able to train properly, but on a matchday he would come out with something genius.\"\nNeymar's time in Paris delivered multiple domestic titles, but it lacked the defining European triumph PSG wanted.\nThe closest they came was the 2020 Champions League final, with a 1-0 loss to Bayern Munich in which the Brazilian played the full 90 minutes.\nAlthough Neymar's individual brilliance flashed at times, injuries and off-field distractions defined much of his time in Paris.\nTensions grew, too, as the arrival of Kylian Mbappe and previous team-mate Lionel Messi complicated Neymar's role in the team.\nSpeaking on a podcast with Brazil legend Romario,, external Neymar said: \"I have my things with Kylian Mbappe. We fought a little, but he was fundamental for us. I always helped him, talked to him, but when Messi came, he got a little jealous.\"\nInjuries compounded Neymar's frustrations, with his last game coming during the 2022-23 season before ankle surgery ruled him out for the rest of the campaign.\nIn August 2023, at the age of 31, Neymar joined Al-Hilal in Saudi Arabia on a reported €150m (£129m) annual deal.\nThat amounted to about six times the salary he had been paid in France.\nBut misfortune followed Neymar to Saudi, with a serious knee injury while playing for Brazil sidelining him for much of his stint in the emerging league.\nHe played just seven games for the Saudi club.\n\"His objective was to stay with Al-Hilal for another six months and play in the Club World Cup this summer,” said South American football expert Tim Vickery on BBC Radio 5 Live.\n“That was supposed to be a huge billboard to the football world that said: 'I'm back baby.'\"\nHe's back all right - but back in Brazil. Neymar has returned to a Santos who have just been promoted back to Brazil's top league.\nShould he stay fit, Neymar's presence could prove invaluable not only for Santos but also for Brazil's national team - who he last represented in October 2023, when the ACL in his left knee ruptured against Uruguay.\nDespite overtaking Pele to become Brazil's record scorer, Neymar might have had an even better international career but for injuries.\nHe sat out the semi-final of the 2014 World Cup in Belo Horizonte, Brazil's successful 2019 Copa America campaign and two out of five games in the 2022 World Cup.\nAs young stars like Vinicius Jr and Rodrygo continue to blossom, Brazil could be among the favourites for the 2026 World Cup. But Neymar's experience and flair would still offer something unique if he can stay healthy.\nNeymar is an inspiration to this generation's hottest young stars, with Barcelona's teenage winger Lamine Yamal having posed in a Santos shirt bearing the superstar's name.\n\"He is loved by players and is Yamal's hero because he did things no other players could,\" said Balague.\nThe 'prince' may not have quite claimed the throne, but his influence on football culture persists.\nAnd perhaps there is one last defining chapter of the Neymar story still to be told.\nHere we have a footballer, not yet a veteran, with the talent to take himself, his club and his country to the very top - a regal talent still targeting a coronation moment.\nAfter Messi's World Cup crowning in Qatar, don't count out Neymar in the United States just yet.", "url": "https://www.bbc.com/sport/football/articles/c93q0vr1klxo"}