{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:33:25", "date_modify": "2025-05-20 12:33:25", "date_publish": "2023-08-04 09:26:45", "description": "'I genuinely don't know who wins it' - McCoist assesses title race", "filename": "sport_articles_c3gml7223ldo_1747744405.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/41c9/live/a9c4de10-32a8-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gml7223ldo_1747744405.html", "title": "'I genuinely don't know who wins it' - McCoist assesses title race", "title_page": "'I genuinely don't know who wins it' - McCoist assesses title race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers legend Ally McCoist believes the Old Firm title race is too close to call this season.\nCeltic, with Brendan Rodgers having succeeded Ange Postecoglou this summer, are seeking a third straight Premiership crown, while Michael Beale takes charge of his first full season at the Ibrox helm.\n\"This is the first year in a long, long time where I genuinely don't know who wins it,\" said McCoist.\n\"Celtic have lost one or two, lost Jota, but Brendan Rodgers is an excellent coach and knows how to set up a team.\n“I thought he was a little bit unlucky and harshly treated at Leicester because I don't think he got the money to spend to replace the real quality that needed replacement. They'll back him at Celtic.\n\"Over at our place, I think Michael Beale has brought in nine players. I watched them against Newcastle in pre-season, did OK. I watched them against Olympiakos, didn't look great. Didn't look good in the first half against Hoffenheim and then looked great in the second half.\n\"So, I don't really know but of course Rangers and Celtic have got to hit the ground running, particularly Rangers with the (Champions League) qualifier coming up.\n\"It is a tough one to call. I don't know how Rangers' players will settle in. They brought them in quickly.\"", "url": "https://www.bbc.com/sport/articles/c3gml7223ldo"}