{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:35", "date_modify": "2025-05-21 04:06:35", "date_publish": "2024-12-29 00:00:00", "description": "Karlan Grant levels to earn West Bromwich Albion a point against Championship high fliers Sheffield United.", "filename": "sport_football_live_cd0eypmj71vt_1747800395.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cd0eypmj71vt_1747800395.html", "title": "Sheffield United 1-1 West Brom: Karlan Grant levels to earn Baggies point", "title_page": "Sheffield United 1-1 West Brom: Karlan Grant levels to earn Baggies point - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion picked up their first point since Carlos Corberan's Christmas Eve departure thanks to Karlan Grant's late first-half equaliser against Sheffield United at Bramall Lane.\nAfter leading thanks to home-grown Blades youngster Andre Brooks' beautifully-worked first goal for the club, the point was enough to briefly take the injury-hit Blades back to the top of the Championship, before Leeds United reclaimed top spot with their win at Derby.\nBut they were denied victory by another lucky deflection involving Tom Fellows, just as happened at the Hawthorns when the two sides drew 2-2 just three weeks ago.\nIt meant the managerless Baggies end 2024 in eighth place, 13 points off top spot, having led in mid-September. Their 12th share of the spoils in 24 league games this season - after a four-game run of two defeats and two wins - also edged Albion back ahead of Preston (and QPR) as the second tier's draw specialists.\nAlbion were having their second game under the temporary three-man caretaker command of Damia Abella, Boaz Myhill and mouthpiece Chris Brunt, back in the city where he began his first-team career with Sheffield Wednesday 20 years ago.\nHaving picked up injuries to Mason Holgate and Alex Mowatt in the Boxing Day defeat at Derby, Albion's caretaker management team ended up making four changes, including only a second league start for Ousmane Diakite, who made his only other full league appearance for Albion also in Sheffield against Wednesday in September.\nBut it was Diakite's heavy touch that led directly to the Blades goal on 22 minutes.\nThe fast-moving Brooks sped in from the right to dispossess him, then carried on his lateral run across the edge of the box, taking a wonderful backheeled return pass from Aston Villa and Coventry old boy Callum O'Hare before slotting in a low left-foot finish.\nBut Albion were level in first-half injury-time when Mikey Johnston's speculative shot from outside the box bounced back off Fellows into the path of Grant and, in space, he drilled a low right-foot shot just inside the left upright.\nIt was Grant's sixth Championship goal of the season, of which five have been away from home, and he was denied another by home keeper Michael Cooper as Albion made a bright start to the second half.\nBut it was the Blades who came close to winning it when O'Hare was flattened in the box by Diakite, only for referee Stuart Attwell to wave play on.\nThe official also then played a part late on when Blades playmaker Gus Hamer, already booked, was involved in a challenge on Callum Styles.\nBut, although Styles went sprawling, he opted not to punish it with anything more than a free-kick and instead it is only the Albion defender who must now serve a one-game ban, having earlier received his fifth booking of the campaign.\nSheffield United boss Chris Wilder told BBC Radio Sheffield:\n\"We are so stretched it's unbelievable, and I'm so proud of my team. I thought we were light at the start of the season\n\"But I've learned so much about their attitude, especially late on. A few of them have not been well this week, but they left everything out there.\n\"We were actually really disappointed to go in 1-1 at half time. But we were pushing and pushing to get a winner. We were bold, We were brave.\n\"Andre Brooks was outstanding. He needed to do more Monday to Friday in training - but I was delighted for him to get that goal.\"\nWest Bromwich Albion joint caretaker boss Chris Brunt told BBC Radio WM:\n\"We were a little bit flat first half on Boxing Day but we carried on from the second-half performance for the whole 90 minutes.\n\"On another day we could have come away with all three points - and I don't think anybody could have questioned that.\n\"The way Karlan Grant has come back this season has been a breath of fresh air. He's been written off by so many but he's been outstanding so far this season.\n\"It's all about keeping the players in the right mindset at the current time. All we can do for now is take each game as it comes.\"", "url": "https://www.bbc.com/sport/football/live/cd0eypmj71vt"}