{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:25:25", "date_modify": "2025-04-26 06:25:25", "date_publish": "2025-02-28 22:13:41", "description": "Harlequins captain Jade Konkel is relishing the latest chapter in their cross-town rivalry with Saracens as the sides meet in the PWR semi-finals.", "filename": "sport_rugby-union_articles_cy4lv8318v5o_1745648725.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/170d/live/6568f0d0-f61f-11ef-b331-b70b782ee609.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cy4lv8318v5o_1745648725.html", "title": "PWR semi-final: Jade Konkel calls for Harlequins to show physicality", "title_page": "PWR semi-final: Jade Konkel calls for Harlequins to show physicality - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Harlequins captain Jade Konkel says she is relishing the latest chapter in their cross-town rivalry with Saracens as the London sides meet in Saturday's PWR semi-final.\nThe two teams contested the first three finals after the women's top flight was relaunched in 2017, but this is the first play-offs meeting since Saracens won their 2022 semi-final.\n\"It has been a great rivalry, ever since I joined the Premiership back in 2018,\" said Scotland number eight Konkel.\n\"It makes it that little bit more special because you know it is going to be two teams properly going after it.\"\nThe two teams have shared the spoils from the regular season, both taking away wins from visits to opposition territory.\nSaracens' 33-10 success at the Stoop was part of a five-match winning streak that propelled them to a second-place finish and a home semi-final.\n\"I was watching that game because unfortunately I had picked up a knock, but we know Sarries are a physical side,\" added Konkel.\n\"We know they will look to bring that physicality to life at the weekend, so it is how we match that. That physicality element is going to be make or break.\"\nWith the 16 March final also being played at the StoneX Stadium, Saracens have home advantage all the way to a potential title.\nCoach Alex Austerberry says that could be crucial for the three-time champions and rejected the theory that last season's semi-final defeat by Bristol on home turf could affect his side mentally.\nSaracens had led 14-0 against the Bears, but were overhauled as the underdog visitors fought back to win 29-21, becoming the first team to progress from an away PWR semi-final.\n\"If you get hung up on incidents and one experience that is quite dangerous,\" Austerberry said.\n\"The big thing is the learning that we took from that game, how we approached things, how we didn't deal with certain situations well.\n\"Am I am not worried about what happened last time? Absolutely not. We revisited when appropriate and now we are very much looking forward to the game against Quins.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cy4lv8318v5o"}