{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:07:26", "date_modify": "2025-05-19 15:07:26", "date_publish": "2015-02-18 10:30:24", "description": "Torquay United sign Exeter City forward Jamie Reid on loan until the end of the season.", "filename": "sport_football_31516397_1747667246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81078000/jpg/_81078015_jamie_reid_empics1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31516397_1747667246.html", "title": "Jamie Reid: Exeter City forward joins Torquay United on loan", "title_page": "Jamie Reid: Exeter City forward joins Torquay United on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torquay United have signed 20-year-old Exeter City forward Jamie Reid on a four-week youth loan.\nReid, a Northern Ireland Under-21 international, began his career at the Gulls' academy and has been hampered by a hip injury for much of this season.\nHe made the last of his 12 appearances for Exeter in March 2014 and has been on loan at Weymouth.\nReid is the second striker to join on loan this week after Oxford's John Campbell moved to the Gulls on Tuesday.\n\"It has been a tremendous couple of days for the club and exciting for our supporters to be welcoming two new faces in the form of Jamie and John Campbell, who signed from Oxford yesterday,\" Torquay manager Chris Hargreaves told the club website.\n\"Both players will join a group of young footballers hungry for success and we are now fully focussed on a massive FA Trophy game at Wrexham on Saturday.\n\"Along with these deals, the club is entering discussions with the existing non-contract players with a view to tying down longer deals.\n\"This certainly doesn't mean that the club is rolling in cash but, with another set of experienced eyes looking at things, it is a little clearer what is available,\" he added.", "url": "https://www.bbc.com/sport/football/31516397"}