{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:43", "date_modify": "2025-05-21 04:59:43", "date_publish": "2025-01-23 13:15:07", "description": "Watford head coach Tom Cleverley reveals the team's latest injury news after defeat at home to Preston on Tuesday.", "filename": "sport_football_articles_cwy1n4d2e99o_1747803583.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a777/live/c7c52360-d988-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy1n4d2e99o_1747803583.html", "title": "Watford could be missing Kwadwo Baah and Festy Ebosele for weeks", "title_page": "Watford could be missing Kwadwo Baah and Festy Ebosele for weeks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford boss Tom Cleverley is facing up to an injury headache after Tuesday's bruising defeat at home to Preston North End.\nCleverley revealed forward Kwadwo Baah and midfielder Festy Ebosele could be out for weeks, while Imran Louza and Kevin Keben will be monitored.\nHe told a press conference, external that Baah had undergone a scan on his thigh on Wednesday and added: \"His injury looks like it could be a fairly significant one – a good few weeks. It's a substantial tear.\"\nCleverley fears midfielder Ebosele could be sidelined for even longer with an ankle ligament injury, which the boss likened to the injury to keeper Daniel Bachmann - who is out for about three months,\nHe said: \"Festy is not good news either, and one that we thought might not be so serious.\n\"There was more than one occasion on Tuesday when Preston recovered possession with tackles coming in from behind that made contact with the player as well as the ball.\n\"Festy's injury looks a lot like Bachmann's from our initial scans, but we'll assess further and go from there.\"\nThe Hornets' head coach added Imran Louza's ankle injury was \"the best – or least worst – of the three\".\n\"We'll be running some more tests. It's not the knee he's been managing, it's lower down, another tackle from behind that's caused a twist of the ankle.\"\nCleverley also revealed defender Kevin Keben's training load was being managed because of a knee issue.\n\"With Kévin, the type of injury he's had means his knee can be prone to swelling,\" he said.", "url": "https://www.bbc.com/sport/football/articles/cwy1n4d2e99o"}