{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:56:24", "date_modify": "2025-04-26 03:56:24", "date_publish": "2025-03-04 15:09:55", "description": "Bournemouth: Andoni Iraola on European football prospect", "filename": "sport_football_articles_cy83k34y1pko_1745639784.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c1e2/live/27bb5a80-f8df-11ef-9628-add78e51db09.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cy83k34y1pko_1745639784.html", "title": "Bournemouth: Andoni Iraola on European football prospect", "title_page": "Bournemouth: Andoni Iraola on European football prospect - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bournemouth manager Andoni Iraola believes it will be a \"challenge\" until the end of the season for the Cherries to qualify for Europe but any \"small dip\" would make the feat \"impossible\".\nIraola's side currently sit seventh in the Premier League and only four points behind fourth-placed Manchester City - who they will also face in the FA Cup quarter-finals later this month.\nSpeaking to BBC Radio 5 Live Breakfast about being in contention for European football, Iraola said: \"I think it's very difficult honestly.\n\"We are there fighting with the teams that are going to be in the challenge until the end but we have been very good, we've performed very well. We've been on the verge every time so if you have a small dip, it's going to be impossible.\n\"We have to keep this level until the end and it's going to be very close. I hope we can talk about this when we have three or four games remaining, but we still have to earn the right to be in this challenge until the end.\"\nThe Spaniard joined Bournemouth in the summer of 2023 from La Liga side Rayo Vallecano and thinks the club have benefitted from this time together.\nHe added: \"To be in the second season is very important - we have been much better, they know me much better, I know them much better. I know where they can perform better, the positions they can cover.\n\"It took some time at the beginning, but I think people talked up that we were bad at the start but we still had 25 points in the first half of last season. They took it quite fast, but we have been solid since then.\n\"The Premier League is very challenging, there are eight or nine teams that are very good and it is difficult. We are fighting with them, but we are not so far.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cy83k34y1pko"}