{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:33:00", "date_modify": "2025-04-26 03:33:00", "date_publish": "2025-03-27 00:00:00", "description": "Barcelona beat Osasuna in their rearranged La Liga fixture to move three points clear at the top of the table.", "filename": "sport_football_live_c20lq002vyxt_1745638380.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e603/live/b46c7da0-0b55-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c20lq002vyxt_1745638380.html", "title": "Barcelona 3-0 Osasuna: Barca go three points clear after rearranged La Liga game", "title_page": "Barcelona 3-0 Osasuna: Barca go three points clear after rearranged La Liga game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Barcelona beat Osasuna in their rearranged La Liga fixture to move three points clear at the top of the table.\nThe game was meant to be played on 8 March but was called off 20 minutes before kick-off after the death of Barcelona's first-team doctor Carles Minarro Garcia.\nBarcelona manager Hansi Flick criticised the timing of this rescheduled match, coming a day after the end of the international break - with 27-goal Raphinha missing out after travelling back from Brazil duty.\n\"It's disrespectful to the club to schedule that match on that date, no matter what club it is,\" Barca defender Jules Kounde told DAZN.\n\"I think that beyond the lack of respect for the clubs, it's a lack of respect for the players, because we have to understand that we're not machines.\"\nKounde played a full 90 minutes plus extra time and penalties in France's victory over Croatia in the Nations League on Sunday.\nOn Thursday, the Catalans were comfortable winners at their temporary Olympic Stadium home.\nFerran Torres slid them into the lead from Alex Balde's cross.\nDani Olmo then won a penalty after being fouled by goalkeeper Sergio Herrera.\nHerrera saved Olmo's spot-kick - but it had to be retaken because an Osasuna player encroached in the box. Olmo scored the second time around, but in a busy first half later had to be replaced because of injury.\nSubstitute Robert Lewandowski headed in a third goal to cap a swift counter-attack.", "url": "https://www.bbc.co.uk/sport/football/live/c20lq002vyxt"}