{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 12:42:03", "date_modify": "2025-05-20 12:42:03", "date_publish": "2023-08-03 15:11:49", "description": "For the first time in their history, Germany fail to progress to the knockout stages of the Women's World Cup - leaving their players stunned.", "filename": "sport_football_66397169_1747744923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1155B/production/_130630017_gettyimages-1589709563.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66397169_1747744923.html", "title": "Alexandra Popp: 'I can't comprehend' Germany's World Cup exit", "title_page": "Alexandra Popp: 'I can't comprehend' Germany's World Cup exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When the whistle went in Brisbane, confirming Germany were leaving the Women's World Cup 17 days before the final takes place, some players fell to their knees in tears while others stared, drifting ghost-like across the pitch, barely taking in what had just happened.\n\"To be honest I can't comprehend it,\" said captain Alexandra Popp immediately after the 1-1 draw with South Korea which confirmed their World Cup dreams were over.\nShe put her hands on her head and puffed out her cheeks in disbelief, adding: \"I don't know what I should really say. I can't really understand what has happened to be honest. Yeah, no idea.\"\nIt is a feeling Germany are not used to.\nThey are two-time world champions and have topped the group in eight of the nine Women's World Cups they have competed in.\nVery few would have predicted the Euro 2022 finalists, ranked second in the world, would fail to progress from a group containing Colombia, Morocco and South Korea.\n\"It is the biggest shock in the women's game,\" former England midfielder Fara Williams told BBC Two.\nEx-Lionesses goalkeeper Karen Bardsley added: \"This might be unprecedented in terms of scale. This entire tournament has been chaotic, it's been turned on its head.\"\nSeeing Germany exit the group stages of a major tournament is always a shock - but to see both their men's and women's teams fail to progress in the space of nine months is unthinkable.\n\"If you want to see a disaster in terms of sport, it's hard to argue against that,\" said Germany boss Martina Voss-Tecklenburg.\n\"What we need to do is rise again and not give up. We love this sport. Of course you cannot expect a deep analysis yet. We need to let it sink in. I don't want to look for excuses in anything.\"\nGermany became the third side ranked inside the world's top 10 to exit the group stages following disappointments for South American giants Brazil and Olympic champions Canada.\nThey began the tournament with a 6-0 thrashing of Morocco, setting an early marker with all signs pointing towards progression until the 2-1 defeat by Colombia set off a few alarm bells.\n\"I didn't need to be the clown for them, to try and cheer them up,\" Voss-Tecklenburg had said afterwards, pushing away suggestions Germany's confidence had taken a hit.\nBut a poor start against South Korea, which Cho So-hyun capitalised on when she netted inside six minutes, and missed chances from Popp, Klara Buhl and Sydney Lohmann, proved costly for Germany.\n\"There were a few questionable omissions from tonight's starting XI but ultimately it came down to clinical finishing,\" said Bardsley.\n\"Germany were sloppy in possession, they were resorting to getting the ball to the back post or wherever Popp would be. That was plan A and there wasn't much of a plan B.\"\nVoss-Tecklenburg said they looked \"nervous\" and tried to \"force things\" as they desperately searched for the winner they knew they needed to match Morocco's result against Colombia, which finished 1-0 in the other game in Group H.\n\"At the end of the day, the score matters. We didn't score enough and we didn't get enough points,\" said Voss-Tecklenburg.\n\"This is not what we expected. We were nervous when we started the game and I think that showed. That's why South Korea took the lead.\n\"Maybe we were trying to force things but there was more a feeling that there was something missing. There was great intention but we lost that ease and confidence.\n\"We did not find our game like we wanted to. We tried a lot but we did not manage to score. We are in charge and responsible for this.\"\nGermany's exit sees another of the game's biggest stars leave the competition, just 24 hours after Brazilian legend Marta played her final match in her sixth Women's World Cup.\nWolfsburg striker Popp, 32, has won over 100 caps since her Germany debut 13 years ago and has netted in her last eight games for Germany at major tournaments, delivering again in Australia and New Zealand with four goals in three group matches - including the equaliser against South Korea.\nBut have Germany come to rely on her too much?\n\"Germany should have more players that should be able to create,\" said Arsenal boss Jonas Eidevall on BBC Two.\n\"Such a good football team should not only be dependent on Alexandra Popp. It's almost been that everything has to go through her. It's only she who can make the difference - and that's a weakness.\"\nHer header on the stroke of half-time meant Germany went in at the break in second place in the group and were unaware that Morocco took the lead against Colombia shortly afterwards, overtaking Germany in the group standings in the process.\n\"We didn't know that during half time. During the second half, we were informed that we needed to urgently score,\" said Popp.\n\"After that, I think we showed a strong desire and grit to go for a goal but somehow it just didn't want to go in.\"\nBut while Popp's goals usually help propel Germany deep into the competition, she could offer little comfort for supporters when asked about the direction of the team going forward.\n\"I can say that Martina [Voss-Tecklenburg] did have to face a lot of emotions,\" said Popp. \"I think we will have to find our composure again.\n\"We will need to analyse what has happened. There was not much said [in the dressing room]. We need a little bit of time now to process what has happened and to be able to find some confidence again.\"", "url": "https://www.bbc.com/sport/football/66397169"}