{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:19:48", "date_modify": "2025-05-21 07:19:48", "date_publish": "2025-03-30 00:00:00", "description": "Robert Lewandowski scores twice as Barcelona re-establish a three-point lead at the top of La Liga with a comfortable victory over Girona at the Olympic Stadium.", "filename": "sport_football_live_cgl0w7e9781t_1747811988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cfa8/live/e8253bc0-0d7e-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgl0w7e9781t_1747811988.html", "title": "Lewandowski scores twice as Barca reopen gap at top", "title_page": "Barcelona 4-1 Girona: Robert Lewandowski scores twice as Barca reopen gap at top - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Robert Lewandowski scored twice as Barcelona re-established a three-point lead at the top of La Liga with a comfortable victory over Girona at the Olympic Stadium.\nLadislav Krejci's own goal had given the hosts a deserved first-half lead against their Catalan rivals, who threatened to cause a shock when Arnaut Danjuma levelled against the run of play early in the second half.\nHowever, Poland forward Lewandowski put Hansi Flick's side back ahead just after the hour mark with an improvised finish, and he then scored his 25th league goal of the season after some fine midfield play from substitute Frenkie de Jong.\nFerran Torres rounded off the scoring late on with a low effort into the bottom corner.\nIt was the perfect response from Barcelona, who watched their great foes Real Madrid fight back to beat Leganes and move level on points at the summit of the Spanish top flight on Saturday.\nFlick's team have now won their past nine matches in La Liga and will head into Wednesday's second leg of their Copa del Rey semi-final with Atletico Madrid - finely balanced at 4-4 - full of confidence.", "url": "https://www.bbc.com/sport/football/live/cgl0w7e9781t"}