{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 07:35:46", "date_modify": "2025-05-21 07:35:46", "date_publish": "2025-01-22 11:48:03", "description": "Celtic don't want to be 'nearly men' - McGregor", "filename": "sport_articles_cj913ln1nvwo_1747812946.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cac7/live/49bae470-d846-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cj913ln1nvwo_1747812946.html", "title": "Celtic don't want to be 'nearly men' - McGregor", "title_page": "Celtic don't want to be 'nearly men' - McGregor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic captain Callum McGregor says the current team don't want to be remembered as Champions League \"nearly men\" and is relishing their \"shootout\" against Young Boys on Wednesday night.\nThree points at home to the side bottom of the 36-team table would all but secure Celtic's place in the play-off stage for the first time since 2013.\n\"Obviously it's a big game, we know what's at stake,\" said McGregor.\n\"You've got to do everything you can to make sure you win these Champions League games and have a positive experience. If we do that then we know what lies ahead.\n\"We've tried and failed pretty much most of the time so it's a big step for the club. Everybody wants to be a part of it and we've done ever so well so far but we don't want to be the nearly team.\"\nA draw against Young Boys, who have yet to pick up a point, could prove to be enough to take Celtic through with a game to spare but McGregor is focused solely on victory.\n''We want to win the game, that's where our mentality is,\" said the midfielder.\n\"It's the same as we approach every game - we want to win no matter the competition. If you set out to play for a draw or whatever then straight away your psyche is not right and you're not quite at the top of the game.\"", "url": "https://www.bbc.com/sport/articles/cj913ln1nvwo"}