{"authors": ["Charles Bannerman", "www.facebook.com"], "date_download": "2025-05-20 11:53:29", "date_modify": "2025-05-20 11:53:29", "date_publish": "2023-08-05 17:34:04", "description": "Holders Kingussie booked the first place in the Tulloch Camanachd Cup final with a 2-1 victory over 2021 winners Kinlochshiel at Bught Park.", "filename": "sport_scotland_66418610_1747742009.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E735/production/_130198195_shintygraphic.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_scotland_66418610_1747742009.html", "title": "Shinty: Kingussie book place in Tulloch Camanchd Cup final", "title_page": "Shinty: Kingussie book place in Tulloch Camanchd Cup final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Holders Kingussie booked the first place in the Tulloch Camanachd Cup final with a 2-1 victory over 2021 winners Kinlochshiel at Bught Park, keeping their defence of last season's Grand Slam intact.\nIn the Mowi Premiership, both newly promoted clubs slipped slightly further into relegation trouble on home ground when Skye went down 4-3 to Caberfeidh. Beauly were edged 3-2 by Oban Camanachd.\nLovat had a 2-0 home win over Glasgow Mid Argyll, while Glenurquhart remained top of the National Division with a 4-0 defeat of Oban Celtic.\nThere was drama at the Bught just before half-time when Kingussie captain James Falconer opened the scoring in stoppage time, but John MacRae still managed to send the teams in level. What turned out to be Ruaraidh Anderson's winner came shortly after the restart.\nKingussie will now meet the winners between Lovat and Oban Camanachd who play on 12 August.\nIn Portree, Caberfeidh went 2-0 up through Kevin Bartlett and Craig Morrison. Jordan Murchison and Ross Gordon brought it level, and Bartlett's second edged Cabers ahead again on the hour.\nWilliam MacKinnon pulled Skye back level once more before Gavin McLaughlan's late winner for Cabers.\nOban Camanachd roared to a 3-0 lead within an hour with goals from Lewis Cameron, Malcolm Clark and Daniel MacVicar. Colin MacDonald and Jack MacDonald struck back, but Beauly were unable to find an equaliser.\nGreg Matheson in the first half and James MacPherson in the second secured the points for Lovat who move up to third place, three points behind leaders Kingussie.\nAt the bottom, Mid Argyll sit on just one point, eight adrift of Beauly and nine behind Skye.\nOne each from Oliver Black and Ryan Porter followed by a David MacLennan double kept Glenurquhart on course in the second tier. Meanwhile, all but one of their closest rivals lost ground in 2-2 draws between Kilmallie and Fort William, and Col Glen and Lochaber.", "url": "https://www.bbc.com/sport/scotland/66418610"}