{"authors": ["Elizabeth Botcherby", "www.facebook.com"], "date_download": "2025-05-21 07:44:36", "date_modify": "2025-05-21 07:44:36", "date_publish": "2025-05-20 12:17:54", "description": "Up to 80,000 Manchester United and Tottenham fans are expected to descend on Bilbao, a city with a population of around 350,000, for Wednesday's Europa League final.", "filename": "sport_football_articles_c1w33q9yx32o_1747813476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b3ef/live/d57519c0-3581-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1w33q9yx32o_1747813476.html", "title": "Europa League final: How Man Utd & Tottenham fans are taking great lengths to reach Bilbao", "title_page": "Europa League final: How Man Utd & Tottenham fans are taking great lengths to reach Bilbao - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "How far would you go to follow your team, and what lengths would you go to?\nUp to 80,000 Manchester United and Tottenham fans are expected to descend on Bilbao, a city with a population of about 350,000, for the Europa League final on Wednesday.\nThe city's airport has reinforced its border control with National Police staff as it prepares to handle three times the usual number of flights, including 174 private jets.\nBut owing to the expensive prices of direct flights and limited accommodation - Bilbao has an estimated 13,000 hotel beds - many supporters are following creative itineraries to be on the ground in Spain for the final.\nFor Manchester United fan Dave, the 33-hour ferry from Portsmouth to Bilbao was a \"bucket-list\" trip.\nTravelling solo to the final, he left his home in Derby on Sunday morning, taking the train to Portsmouth via London Waterloo, and docked in Spain at 07:00 BST on Tuesday, making plenty of new friends along the way.\n\"I'm feeling bright and fresh - not - but it's been a good journey. I've met loads of people. I've travelled on my own, so lots of opposition fans, lots of neutrals, some Americans,\" he told BBC Sport.\n\"It was a bucket-list thing to do this journey. I never got on the Pride of Bilbao [ferry] but I've done it now. I'm looking forward to the sights of Bilbao, the food's apparently quite good. It's my first time in the Basque country.\"\nThough \"nervous\" about United's chances, he hopes the final will be an advert for the best of English football.\n\"I just hope United put a bit of class on the pitch and give us a bit back,\" he said. \"And it's enjoyable for everyone, neutrals and fans alike, to showcase Premier League football.\"\nBen, a Tottenham fan from London, was on the same ferry. After some initial hiccups travelling via train and taxi to Portsmouth, he enjoyed the unexpected wildlife encounters and fan interactions at sea.\n\"The ferry was lovely. Did a bit of whale watching, saw dolphins, which I wasn't expecting,\" Ben said.\n\"There were lots of holidaymakers who were quite surprised when Sol Campbell songs were being sung last night. It was a good laugh - United fans and Spurs fans all sitting together.\"\nFellow Tottenham fan Ryan from Southampton, who is watching his side abroad for the first time, added: \"I felt a bit seasick at the start but it's all good. I'm excited to be here and it's going to be incredible.\n\"We played games on the ferry, sat on the rooftops, a few beers here and there, getting excited for it. I'm hoping we win.\"\nManchester United supporter Sue McGranigan is taking a different route to the final, opting instead to traverse the full length of France by road.\nShe set off by coach at 02:45 BST on Tuesday morning and will arrive in Bilbao around Wednesday lunchtime following a ferry from Dover to Calais, a nine-hour coach to Bordeaux, where she will stay overnight, and a final four-hour coach ride to the Spanish city on the morning of the match.\n\"It's a lot cheaper. It's cost about £350 to come on the coach whereas direct flights were £900. It's a long journey – I've had about half-an-hour's sleep,\" she said, speaking to BBC Radio 5 Live from just outside London.\n\"But the coach is very quiet. It's all United fans and I thought they'd be drinking and singing, but it's really peaceful.\"\nUnited fan Ashley found a picturesque solution to the city's accommodation shortage, booking a pitch on a caravan park overlooking San Mames Stadium.\nHe met up with his son in Madrid on Monday, hired an RV and stayed overnight in Burgos before setting up camp in Bilbao.\nAdam Paterson, meanwhile, will cover more than 2,500 miles to reach Spain. The United fan will leave Manchester with friends Dylan Heath and Will Baldwin on Tuesday afternoon and fly via Dublin, Paris, and Rome before landing in Bilbao just hours before kick-off.\n\"We just thought why not? It's not every week you're in a European final,\" said Adam, explaining his \"weird and wonderful\" journey to BBC Radio Manchester.\n\"That's not even the worst bit of it – we don't even have a hotel. We will just have to pull an all-nighter.\"\nOptimistic Spurs fan Ayhoe, from Ilford, beat the high prices by finalising his travel plans before Tottenham's place in the final was confirmed and arrived in Bilbao four days before the final.\n\"I've been here since Sunday. That was the only way. I came here direct. Getting home is a different journey, but I'm not worried about that!\" he said.\n\"I was there in 1984 [for the two-legged Uefa Cup final against Anderlecht] when we brought it home and we're going to bring it back now. Forty one years of hurt.\"\nArun, Ed, and Justin, who flew from Stansted to Barcelona before hiring a car for the 370-mile drive to Bilbao, took a similar approach.\n\"We booked our flights two weeks before the final in anticipation. Luckily we got here. We had the belief.\" said the Tottenham-supporting trio.\nFor Lewis, a Tottenham fan, his 17-hour journey from Bristol to Bilbao involved a three-hour walk from Madrid's airport to the train station and a rail replacement bus.\n\"I've not got a ticket but I wanted to be there. I'd regret it so much if we got to the final and won it if I wasn't. It's quite a long journey but it's all about being a fan. You follow your badge,\" he said.\nChief constable Mark Roberts, national lead for football policing, says the Football Policing Unit, Greater Manchester Police, and the Metropolitan Police have been liaising with local police and Uefa to ensure all fans have a positive experience.\nMore than 3,000 police officers will be deployed across the city, with a three security rings around the stadium restricting access to ticket holders and local residents from Wednesday morning.\nRoberts encouraged fans without a ticket not to travel to Bilbao and said British police will be on hand to \"act as a liaison\" and assist with information and communication.\nEach team was allocated around 15,000 tickets, with the remainder given to Uefa sponsors or bought by neutrals.\n\"Bilbao is a beautiful city and the local police and people are keen to welcome fans. But it's not the biggest city and the biggest concern is the ability for Bilbao to soak up those additional people if they haven't got a ticket. Our advice would be if people haven't got a ticket, consider not travelling,\" he said.\n\"Some police forces still have an impression of English fans based on the 1980s - it's quite outdated. We're keen to push the intelligence and say treat supporters from this country based on behaviour, not perception.\n\"[My message to fans is] go and have a great time. It's a special event and I'm sure there'll be a great atmosphere, whatever the result. It's a beautiful city - just be a good guest. Everyone's there wanting to support you to have a great time.\"", "url": "https://www.bbc.com/sport/football/articles/c1w33q9yx32o"}