{"authors": ["Timothy Abraham", "www.facebook.com"], "date_download": "2025-04-26 06:40:14", "date_modify": "2025-04-26 06:40:14", "date_publish": "2025-03-02 14:20:11", "description": "World champion Luke Littler wins the UK Open for the first time with a stunning 11-2 victory over James Wade in Minehead.", "filename": "sport_darts_articles_c36w5e1w3p2o_1745649614.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/33c6/live/ca990500-f7b2-11ef-8576-192757e1481c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_darts_articles_c36w5e1w3p2o_1745649614.html", "title": "UK Open: Teenager Luke Littler thrashes James Wade in final to win £110,000 in Minehead", "title_page": "UK Open: Teenager Luke Littler thrashes James Wade in final to win £110,000 in Minehead - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "World champion Luke Littler won the UK Open for the first time with an emphatic 11-2 victory over James Wade in Minehead.\nLittler blew his opponent away as he reeled off nine legs on the bounce from the start of the match, which became a formality after the 18-year-old gave himself such a sizable cushion.\nWade had knocked out world number one Luke Humphries in a thrilling quarter-final and breezed through his semi-final against Josh Rock.\nHowever, the 41-year-old, who won the tournament in 2008, 2011 and 2021, struggled in the face of a clinical Littler masterclass.\nThe Warrington teenager averaged 101.50 - to Wade's sub-par 88.06 - and he wrapped up victory with a 16-dart leg, finishing with double six to pocket the £110,000 top prize.\nLittler's task was made significantly easier by Wade's poor showing - a paltry 11.76% check-out conversion rate highlighting how he froze in the final.\n\"I had a job to do, I just wanted to pick up the trophy and it's one I can tick off the list now,\" Littler told ITV4.\n\"It's one I've wanted to win. It's my third time here, I came here two years ago as a 16-year-old, last year I was in the quarter-final and now I've gone two better this year to win it.\"", "url": "https://www.bbc.co.uk/sport/darts/articles/c36w5e1w3p2o"}