{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 12:59:26", "date_modify": "2025-05-20 12:59:26", "date_publish": "2023-07-26 04:48:19", "description": "Japan have qualified for the Fifa Women's World Cup round of 16 after a routine win over Costa Rica in Dunedin.", "filename": "sport_football_66290694_1747745966.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2FF9/production/_130518221_gettyimages-1571096735.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290694_1747745966.html", "title": "Japan 2-0 Costa Rica: 2011 champions reach Women's World Cup last 16 after win", "title_page": "Japan 2-0 Costa Rica: 2011 champions reach Women's World Cup last 16 after win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Japan have qualified for the Fifa Women's World Cup round of 16 after their routine win over Costa Rica was followed by Spain beating Zambia to ensure both progressed from Group C.\nHikaru Naomoto and Aoba Fujino both scored in the space of three first-half minutes to ease the 2011 champions to three points.\nJapan's victory put them on the brink of qualification but they needed Spain to win to guarantee their place in the knockout stages with one game still to play.\nJapan and Spain, who are the first sides to qualify, both have six points in Group C and will face off for top spot.\nThat game will take place on 31 July, with Japan needing to win to finish first due to Spain's superior goal difference.\nCosta Rica, alongside Zambia, become the first two sides eliminated from the competition. They will also meet on Monday, with both seeking their first ever World Cup victory.\nSince stunning the football world by beating the United States in the 2011 final, Japan have underwhelmed on the global stage.\nBut following the Tokyo Olympics - where Japan were eliminated in the quarter-finals on home soil - Futoshi Ikeda was appointed manager and has put together a side which has impressed with its attacking, possession-focused football.\nJapan will face much tougher tests than Costa Rica and Zambia in their opening game, and they will need to be more clinical than they were at Dunedin Stadium. However, two wins and seven goals cannot be ignored.\n\"We did what we needed to do and we did it well,\" said Ikeda. \"We've prioritised winning points. The players came here with a serious goal in mind and we're all looking towards that same goal.\"\nThis game was settled by the 27th minute - first Naomoto found the far left corner with a low shot from the left of the box, before Fujino shrugged off a tackle on the right wing, cut into the box and beat keeper Daniela Solera at the near post for her first Japan goal.\nIt was a moment of redemption for Fujino following a bizarre incident on 15 minutes where she prevented team-mate Risa Shimizu scoring with an inadvertent sliding tackle as both went to finish a chance.\nCosta Rica were outclassed here just as they were in their opening loss to Spain.\nNervous in possession, they were not technically able enough to play out from the back and inaccurate with long balls, constantly ceding possession to their opponents.\nSolera - who has now made a tournament-high 19 stops at this World Cup - was once again the only factor between Costa Rica and a truly embarrassing scoreline.\nCosta Rica coach Amelia Valverde, who blamed lapses of concentration for the two goals, was asked whether it was time to bring an end to her eight-year reign.\n\"I'm totally focused on having the best World Cup possible in the circumstances,\" she told reporters. \"We still have a match to play and, for us, all matches are important. I don't think this is the right time to talk about that.\"", "url": "https://www.bbc.com/sport/football/66290694"}