{"authors": ["Stuart Brennan", "www.facebook.com"], "date_download": "2025-05-21 07:17:49", "date_modify": "2025-05-21 07:17:49", "date_publish": "2025-05-20 09:51:46", "description": "Former England international Mike Brown announces his retirement from rugby at the end of the season with a message for the sport's rulers.", "filename": "sport_rugby-union_articles_c1kvvejx2eyo_1747811869.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4434/live/80645340-355b-11f0-bf15-094eef773db0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c1kvvejx2eyo_1747811869.html", "title": "Mike Brown: Leicester Tigers' former England full-back to retire at end of season", "title_page": "Mike Brown: Leicester Tigers' former England full-back to retire at end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former England full-back Mike Brown has announced his retirement from rugby at the end of the season - with a parting plea to those who run the game.\nThe 39-year-old, currently with Leicester Tigers, will bring down the curtain on a 20-year career which saw him earn 72 caps for his country.\nHe also made 430 appearances in all for Tigers, Newcastle Falcons and, principally, Harlequins, where he began his professional career in 2005 and stayed for 16 years, winning two Premiership titles and the European Challenge Cup.\nBrown's retirement was announced on the Leicester club website,, external and he made a pointed plea to those who run the game in a farewell address.\n\"Club owners, league executives, national and international governing body senior leadership, my hope is that you come together, think beyond the short term, and make the bold, unselfish decisions needed to allow rugby to thrive once again,\" he said.\n\"We have a responsibility to protect and grow this incredible game, so future generations can experience everything it has to offer - just as I have.\"\nHe also urged other influential voices in the game to pay their part in reshaping the future, adding: \"Media figures, pundits, former players, commentators, I urge you to continue helping shift the negative narrative around rugby.\n\"Let's talk more about the brilliant action, the big hits, the electric tries, the unbelievable skill, the fierce rivalries, and the amazing characters who make our game special.\n\"Rugby is full of passion, drama, and world-class athletes giving their all. By celebrating what makes our sport great, we can inspire the next generation, bring more fans through the gates, grow the game and remind everyone why we fell in love with it in the first place.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c1kvvejx2eyo"}