{"authors": ["www.facebook.com"], "date_download": "2025-05-21 05:37:24", "date_modify": "2025-05-21 05:37:24", "date_publish": "2025-01-08 00:00:00", "description": "Lamine Yamal and Gavi score as Barcelona beat Athletic Club to reach the Spanish Super Cup final.", "filename": "sport_football_live_cn4xkd4vgy1t_1747805844.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cn4xkd4vgy1t_1747805844.html", "title": "Athletic Club 0-2 Barcelona: Gavi and Lamine Yamal on target in Spanish Super Cup semi-final", "title_page": "Athletic Club 0-2 Barcelona: Gavi and Lamine Yamal on target in Spanish Super Cup semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lamine Yamal and Gavi scored as Barcelona beat Athletic Club to reach the Spanish Super Cup final.\nHansi Flick's side made a flying start to the match, held at King Abdullah Sports City Stadium in Saudi Arabia, and took a 17th-minute lead when Gavi slotted in from Alejandro Balde's pass.\nTeenager Yamal got the second seven minutes into the second half when he ran on to a chipped pass before driving past Unai Simon.\nInaki Williams thought he had pulled a goal back in the final minute of normal time for Athletic Club, but it was ruled out for offside.\nBarcelona will face either Real Madrid and Mallorca, who play on Thursday, in Sunday's final.\nThe semi-final came too soon for either Dani Olmo and Pau Victor to play for Barcelona after the club was granted provisional permission to register the pair by the Spanish national sports council (CSD) earlier on Wednesday.\nThe players, both summer signings, were only registered for the first half of the season as Barcelona could not meet La Liga's wage cap restrictions.\nOn Saturday, the Spanish Football Federation (RFEF) and La Liga rejected Barcelona's request to register them.\nHowever, the CSD stepped in on Wednesday following an appeal by the club to grant a precautionary measure and allow the pair to play in the short term.\nThey could now feature in Sunday's Super Cup final.", "url": "https://www.bbc.com/sport/football/live/cn4xkd4vgy1t"}