{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 03:49:45", "date_modify": "2025-05-21 03:49:45", "date_publish": "2025-01-15 11:37:32", "description": "Mirom Muslic says the reception he got from Plymouth Argyle's fans was like something from \"some beautiful dream\".", "filename": "sport_football_articles_c93l8nkj1v4o_1747799385.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/577b/live/6d4e3710-d333-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93l8nkj1v4o_1747799385.html", "title": "Miron Muslic: Plymouth Argyle head coach revels in 'beautiful dream'", "title_page": "Miron Muslic: Plymouth Argyle head coach revels in 'beautiful dream' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New boss Miron Muslic says the reception he got from Plymouth Argyle's fans was like something from \"some beautiful dream\".\nThe Austrian was given a rousing reception by the Green Army when he was introduced to supporters shortly before the 1-1 draw with Oxford United on Tuesday.\nMuslic was appointed as Wayne Rooney's successor as head coach last Friday, having recently left Belgian side Cercle Bruges.\nHe is tasked with trying to secure Championship survival for a Pilgrims side two points adrift at the bottom of the league, having not won a match in the second tier in more than two months.\n\"It was very emotional. If you see the reception - that's something you cannot imagine, maybe you imagine it in some beautiful dream,\" he told BBC Sport after the match.\n\"But when you go out and you feel that, I was very impressed. I was hoping for this, but you never know.\n\"Now I know what it feels like to play a home game and what Home Park and the Argyle fans and the Green Army can deliver.\n\"I have nothing but respect for that, thank you very much, and this will also give us the boost we need and the confidence we need.\n\"It's like a 12th man almost for the future to face the challenge we have in front of us.\n\"The challenge will remain the same. It's never about the game, it's about where we'll be after the last game, and there I'm very confident.\"", "url": "https://www.bbc.com/sport/football/articles/c93l8nkj1v4o"}