{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:14:40", "date_modify": "2025-05-20 14:14:40", "date_publish": "2023-07-29 19:44:55", "description": "Drivers say the poor quality of Formula 1's 'extreme' wet tyre is adding complications when starting races in bad visibility.", "filename": "sport_formula1_66351630_1747750480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C95C/production/_130584515_gettyimages-1576399236.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66351630_1747750480.html", "title": "Belgian Grand Prix: Leading drivers critical of 'pointless' extreme wet tyres", "title_page": "Belgian Grand Prix: Leading drivers critical of 'pointless' extreme wet tyres - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Drivers say the poor quality of Formula 1's 'extreme' wet tyre is adding complications when starting races in bad visibility.\nThey also backed the race officials' call to delay the start of the Belgian Grand Prix sprint because of spray.\nBut Max Verstappen, George Russell and Charles Leclerc all called for improvements to Pirelli's wet rubber.\nMercedes driver Russell said the tyre was \"pretty pointless\" and \"needs to be substantially improved\".\nAll drivers agreed that poor visibility was the main concern when starting races in the wet but added that tyres were also a factor.\nF1 rules mandate that drivers have to start on the extreme tyre when a race begins behind the safety car, as was the case at Spa-Francorchamps on Saturday because of a heavy downpour that delayed the start.\nThe field did five laps behind the safety car in an attempt to clear some of the standing water on the track and improve visibility.\nBut when the race was finally started, 10 cars immediately stopped to fit the more lightly treaded intermediate tyres before they had even crossed the start line, and the other 10 peeled off into the pits at the end of the first lap.\nRussell, a director of the Grand Prix Drivers' Association, said: \"The extreme tyre is really, really bad. It is six, seven seconds slower than the intermediate and the only reason you would ever run it is if you aquaplane on the intermediate. So that needs to be substantially improved.\"\nRussell compared F1's current predicament with the situation in 2007, when the sport was using tyres manufactured by Bridgestone tyres - the Japanese company which is competing with incumbent Pirelli for the next tyre contract period which begins in 2025 - as well as other makes in the junior categories.\n\"I remember watching the old onboard videos of 2007 with [Felipe] Massa and [Robert] Kubica in Fuji,\" Russell said. \"So much water and still [able to] push flat out.\n\"I remember doing test days here in F3 on Michelin and Hankook and aquaplaning wasn't really as thing.\n\"I appreciate we are doing over 200mph and it's not straightforward, but there need to be some significant improvements.\"\nFerrari driver Leclerc added: \"There's some work that needs to be done because we've got extreme tyres that are really slow, but really good for [avoiding] aquaplaning, but we never drive in those conditions because of visibility.\n\"So whenever it's driveable, we need to go on inters. It's quite tricky at the moment. I think the extreme should be faster and closer to the inters so we run more on the extreme than the inters, basically.\"\nPirelli motorsport director Mario Isola admitted on Friday that the performance of the extreme, which is of a new design this year, needed to be further improved.\n\"We already found an improvement with this wet compared to the old one,\" he said. \"But we still miss a little bit of performance to have the right crossover with the intermediate.\"\nVerstappen, who won the sprint, agreed with Russell and Leclerc, but said the tyre was a second-order problem compared to the lack of visibility.\n\"Today I couldn't even see the safety car sometimes and I am the first car. So if we really want good visibility we can't do a race in the wet.\n\"It has become worse since when I started in F1. It is [because of] the wider tyres and the ground effect cars.\n\"But in the junior categories, it was also quite tough, the visibility was very bad.\n\"We had these accidents happen over the years. That is always the unfortunate thing, something bad needs to happen before it really gets looked at. But I remember races in F3 when I couldn't see anything when you raced in the pack.\"\nVerstappen was referring to two fatalities at Spa in the last four years.\nThe most recent of these, involving the 18-year-old Dutch driver Dylan van't Hoft, was also in wet conditions with poor visibility - he was T-boned by another car after coming to rest following a crash on the straight.\nAlpine's Pierre Gasly, who finished third in Saturday's sprint, was a close friend of the Formula 2 driver Anthoine Hubert who was killed in a T-bone accident in the dry at Spa in 2019.\nThe Frenchman said: \"I couldn't see a thing. If Oscar [Piastri] and Max were in the middle of the straight, I would be straight into the side of them. I couldn't even see 10-20 metres ahead of me. You are just hoping for the best.\n\"I didn't feel safe when they restarted. I was really hoping no guy gets off the track or collides and gets stuck in the straight.\n\"It is not really a question of [track] conditions, because the conditions were raceable from the first lap, but the problem is the spray is so huge out of these cars and the water just stays in the air.\n\"I was in sixth and I can only imagine how bad it was at the back of the pack. I wanted to box [pit] anyway for inters, but this just added another incentive to box, to just get some visibility.\n\"You wanna race but at the same time, I'm glad every thing went safely today but all you need is one guy to be stopped in the straight and it can go wrong very quickly.\"\nVerstappen said he agreed with the decision of officials to do the extra laps behind the safety car.\nHe said: \"It was quite a safe view on things but I prefer that than risking it and going too early.\"\nRussell said: \"The FIA did a good job under the circumstances - still incredibly dangerous conditions, doing 300km/h on the straight and can't see 50 metres in front of you.\n\"It is particularly bad at this circuit. I don't know if it's the humidity or the trees but the spray just doesn't seem to disperse. It's like you're driving into a cloud, it really is.\n\"But I felt like those four laps under the safety car didn't really give us a lot. It was the same in Japan [last year].\n\"Maybe a solution in the future would be to give us four laps at racing speed and then bring the safety car out to neutralise the pack and go again because after two laps of racing, things were much better.\"", "url": "https://www.bbc.com/sport/formula1/66351630"}