{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:58:05", "date_modify": "2025-04-26 07:58:05", "date_publish": "2025-02-25 12:01:47", "description": "Junior Firpo says Leeds United must 'stay humble' as the Championship promotion race is 'not done yet.'", "filename": "sport_football_articles_c4g032d3ge9o_1745654285.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c040/live/e86c1440-f35d-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c4g032d3ge9o_1745654285.html", "title": "Leeds United: Junior Firpo says Whites need to 'stay humble'", "title_page": "Leeds United: Junior Firpo says Whites need to 'stay humble' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Junior Firpo says Leeds need to 'stay humble' despite taking a commanding lead at the top of the Championship.\nFirpo scored the equaliser and teed-up the second for Ao Tanaka as the Whites came from behind to win at second-placed Sheffield United on Monday night.\nThe victory took them five points clear of the Blades, with a seven-point cushion in the race for automatic promotion with a dozen games remaining, though the 28-year-old told BBC Radio Leeds \"It's not done yet\".\nHe said: \"We started a little bit slow, a little sloppy, and conceded the goal, but after 25 minutes we started to play.\n\"We went into half-time knowing in the last 25 minutes we are the best team, we have to keep going and create chances like we used to do. The second half was much better.\"\nAfter coming from behind to beat Sunderland in dramatic fashion seven days earlier, Leeds repeated the trick at Bramall Lane to spark wild celebrations.\nFirpo said: \"There's a big togetherness. It's the best group I've ever been in – everyone is focused, everyone is going in the same direction. You can see the reaction from players and staff – players who play 20 minutes, one minute or don't play at all, everyone is together and we have one clear target and I think this win is massive for that happening.\n\"Obviously to win at Sheffield United, second in the league, fighting with us to win the league, to go five points clear feels unbelievable.\n\"There are still a lot of games to play, we have to stay humble, it's not done yet. We want to keep going and win as many games as possible.\"\nSkipper Ethan Ampadu missed the game and is set to undergo surgery on his knee, but led a post-match huddle on the Bramall Lane pitch.\n\"He's the most important player for the squad, we all know this,\" Firpo said. \"He's such a good leader, a good captain, but it's not just him, it's the whole team, it's not just one leader, it's a team of leaders.\n\"Sometimes with Leeds people are too negative and thinking the five points is not enough – it's a good distance but we have to keep humble, it's not done yet.\n\"I have one message (to the fans) – we will go for every game.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c4g032d3ge9o"}