{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:16:00", "date_modify": "2025-05-21 07:16:00", "date_publish": "2025-03-29 07:07:15", "description": "Former Canada men's and women's national team coach John Herdman defends his time at the helm after an independent investigation into his conduct concludes.", "filename": "sport_football_articles_ce343pgvgv8o_1747811760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f29f/live/0d281c70-0c68-11f0-b246-a57376205af8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce343pgvgv8o_1747811760.html", "title": "Canada Soccer drone scandal: John Herdman defends record after 'letter of admonishment'", "title_page": "Canada Soccer drone scandal: John Herdman defends record after 'letter of admonishment' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Canada men's and women's national team coach John Herdman has defended his time at the helm after an independent investigation into his conduct concluded his misconduct warranted \"a letter of admonishment\".\nThe investigation centred around the illegal use of drones to spy on the opposition, which was uncovered before the 2024 Olympic Games in Paris.\nNational team coach Bev Priestman, who previously worked as assistant to the England women's team, was among those banned for a year by world governing body Fifa for her part in the scandal. At the time, Canada Soccer described it as \"a symptom of a past pattern of an unacceptable culture\".\nAn independent inquiry into the matter ended in November but it prompted the launch of disciplinary proceedings for England-born Herdman, who worked for Canada Soccer from 2011 to 2023, initially for the women's team and then, from 2018, on the men's side.\nHis time in charge featured sustained and unprecedented progess on the football stage, culminating in qualification for the 2022 men's World Cup for only the second time in Canada's history.\nHerdman left to join Major League Soccer side Toronto in August 2023, but resigned in November 2024 in the wake of Canada Soccer launching its disciplinary case.\nLate on Friday, Canada Soccer said: \"Mr Herdman was found to have committed misconduct under the Canada Soccer Disciplinary Code. The committee determined the appropriate sanction was a letter of admonishment.\"\nThe governing body did not offer any details around the investigation's findings, which it said were \"final and binding\" and that it was \"analysing the decision\".\nHowever, in his own statement, seen by BBC Sport, Herdman defended his actions and behaviour.\n\"I acknowledge the Disciplinary Committee's decision, which concluded with an admonishment, without suspension or fine, and brings this matter to a close,\" he said.\n\"I want to express my profound appreciation to the players and staff who stood by me during this process. Your willingness to come forward and defend the culture we built together has been invaluable. We created a team united by respect and shared values, and I am thankful for your support.\n\"Throughout my career, I have led with integrity, transparency, and a deep respect for the game. That has not changed. I co-operated throughout the process, including a complete and transparent presentation to the Disciplinary Committee.\n\"Although this has been an incredibly challenging period, I remain proud of my time with Canada Soccer and what we achieved together. I look forward to continuing my journey in the game. I remain focused on my passion - coaching, mentoring, and helping teams reach their full potential.\"\nSources close to Herdman believe the outcome represents an exoneration of the 49-year-old, who is now keen to restart his coaching career, having previously attracted interest from his native England, where he has never previously managed.", "url": "https://www.bbc.com/sport/football/articles/ce343pgvgv8o"}