{"authors": ["Harry Poole", "www.facebook.com"], "date_download": "2025-05-20 11:44:29", "date_modify": "2025-05-20 11:44:29", "date_publish": "2023-08-06 16:14:09", "description": "Dutchman Mathieu van der Poel recovers from a nasty crash to win a thrilling men's road race at the Cycling World Championships in Glasgow.", "filename": "sport_cycling_66360631_1747741469.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16267/production/_130672709_vanderpoel.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66360631_1747741469.html", "title": "Cycling World Championships 2023: Mathieu van der Poel wins men's road race after crash", "title_page": "Cycling World Championships 2023: Mathieu van der Poel wins men's road race after crash - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dutchman Mathieu van der Poel recovered from a nasty crash to claim victory in a thrilling men's road race at the Cycling World Championships in Glasgow, which was earlier halted by a protest.\nThe 28-year-old attacked in the last 25km and held on despite breaking a shoe as he fell on rain-soaked roads.\nBelgium's Wout van Aert took silver and Tadej Pogacar of Slovenia outsprinted Denmark's Mads Pedersen for bronze.\nFive people were arrested after a protest caused a 50-minute delay.\nThe 271.1km route from Edinburgh, which was paused after about 80km of racing for the protest, ended with 10 laps of a 14.3km circuit of Glasgow's city centre.\n\"It means everything. It was one of my biggest goals and to win it today is amazing,\" Van der Poel told BBC Sport.\n\"It almost completes my career in my opinion, it's almost my biggest victory on the road.\"\nOn his fall, he added: \"I was not taking risks, I don't know, all of a sudden I was on the ground. It was super slippery.\n\"To still manage to pull it off, I wouldn't say it makes it nicer as I would have loved to have stayed on the bike.\n\"But if it cost me a world title, I would have not slept for a couple of days.\"\nOne-day classics specialist Van der Poel, winner of Paris-Roubaix and Milan-San Remo this year, countered with an explosive move as Italian leader Alberto Bettiol was about to be caught.\nThe Dutch rider had taken an advantage of more than 30 seconds before suffering a crash after sliding off his bike on a tight right-hand corner with more than 15km remaining.\nBut he immediately got back on to continue his pursuit of gold, with a broken shoe, and recovered to begin the final circuit with a 32-second lead over a high-quality chasing trio consisting of Van Aert, Pogacar and Pedersen.\nVan der Poel, wearing a shredded jersey and shorts because of the crash, was roared on to victory as he made his final ascent of Montrose Street before entering the last kilometre - placing his hands on his head in celebration after finishing one minute and 37 seconds clear in a quality field.", "url": "https://www.bbc.com/sport/cycling/66360631"}