{"authors": ["Ffion Wynne", "www.facebook.com"], "date_download": "2025-05-21 06:14:25", "date_modify": "2025-05-21 06:14:25", "date_publish": "2025-01-14 09:31:01", "description": "England need to find their edge to keep their Ashes hopes alive as they did in 2023 after a pitiful collapse in the second one-day international.", "filename": "sport_cricket_articles_c627j0z4nymo_1747808065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b71/live/685b77a0-d256-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c627j0z4nymo_1747808065.html", "title": "Women's Ashes 2025: England collapse is the same old story after Australia's unlikely win", "title_page": "Women's Ashes 2025: England collapse is the same old story after Australia's unlikely win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When a game of cricket lasts for nearly 93 overs, there are several moments where it is won and lost.\nBut as England squandered a chance to level the Women's Ashes in the second one-day international in Melbourne, the final two balls of their innings summed up the sucker punch that Australia dealt.\nThe final half an hour was chaotic in itself, with the usually impeccable Australian fielders dropping four catches of varying difficulty and all-rounder Annabel Sutherland being taken out of the attack for bowling two waist-high no-balls.\nIt showed that Australia were once again far from perfect as the second of those no-balls came from the final ball of the 48th over, and Tahlia McGrath was tasked with bowling the free hit.\nBut what followed from Amy Jones, who was on 47, was completely inexplicable as she had miscalculated the over, and turned down the single to protect number 11 Lauren Bell - only she did the exact opposite.\nAustralia, the world champions and Ashes holders since 2014, were fired up despite their own mistakes and a team of such ruthless quality will always punish such a catastrophic error.\nThe result? Bell is bowled by Megan Schutt, England are 159 all out, and Australia snatch victory from the jaws of defeat with their characteristically dogged refusal to back down under pressure.\nAnd, frankly, that quality is something England need to learn from.\nBut, we have seen this one before.\nEngland enjoyed a brilliant home summer against New Zealand and Pakistan where they went unbeaten, but very rarely were they challenged. In the subsequent T20 World Cup in the autumn, they crumbled in their final group-stage match against West Indies and crashed out of the tournament.\nFollowing that disappointment, they responded well by thrashing South Africa away from home in all three formats in November and December, but once the pressure was applied in a must-win situation in the heat of an Ashes cauldron, it was the same old story.\nOf course, the defeat is not Jones' or Bell's fault or the fact that England are 4-0 down and facing an enormous uphill climb.\nAustralia are an incredible side packed with world-class talent and Alana King, Ash Gardner and Kim Garth all produced fantastic spells of disciplined bowling to keep England under the pump all the way through their pursuit of 180.\nAnd the pitch erred on the side of \"bowler-friendly\". But even when taking all of that into consideration, it was a game that England lost as opposed to Australia winning. They may not be afforded a better chance to get themselves back in the contest.\nJones battled for 103 balls and should get credit for taking the game as deep as she did when the wickets fell around her, but that does not take away from the fact that, as the senior batter, the mismanagement of the situation when batting with the tail was extremely costly.\nEven before the free hit misjudgement, twice she turned down singles from the fifth ball of an over and then could not keep the strike from the sixth. Gardner's 46th over was blocked out by Bell, and as a result the run-rate spiralled way above a run-a-ball and Jones was backed into a corner to play her shots with more risk than necessary.\nThe tempo of the chase was curious throughout, too, particularly from a side whose leader and coach are constantly telling us how they aspire to entertain, to play a positive brand of cricket and put pressure back on the opposition.\nEngland faced 289 balls out of their 300 available, and 206 of them were dot balls.\nWhen considering moments where the game was lost, that is a pretty damning indicator.\nAnother frustration is the way that England have not addressed their problems against spin.\nGardner was their nemesis in 2023, despite the eventually drawn scoreline, taking 23 wickets across all three formats.\nAlready in this series, she has taken 3-19 and 1-23, while King tied England in knots with a masterful display of leg-spin, a spell of 4-25 fittingly delivered in front of the Shane Warne stand, no less.\nAt the start of King's spell, WinViz was 76% in favour of England. By the end, it was 99% in favour of Australia.\nWith subtle variations of pace and relentless accuracy to get the most out of the gripping surface, King ripped one past Danni Wyatt-Hodge first ball and then had England's star batter Nat Sciver-Brunt caught at cover soon after.\nKing's latter two wickets were gifted to her, but a fair result for the pressure she had built: in the last over of her spell, Charlie Dean perished after a poor ramp shot, caught by Beth Mooney at slip, before Sophie Ecclestone edged behind the very next ball.\nThe dissection of the batting woes unfortunately stole the limelight from England's phenomenal bowling, which was led by Ecclestone and Capsey who took seven wickets between them as Australia were blown away.\nAfter losing six wickets in chasing 203 in the series opener, there appears to be an unusual fragility to Australia's batting line-up which is there to be exploited.\nThe difference is that Australia have got an edge, a killer instinct to dig their heels in and win matches even with their backs to the wall.\nEngland need to find that within them, and quickly.", "url": "https://www.bbc.com/sport/cricket/articles/c627j0z4nymo"}