{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:44", "date_modify": "2025-05-20 14:43:44", "date_publish": "2023-07-28 11:50:37", "description": "Manchester City: Riyad Mahrez completes move to Al-Ahli", "filename": "sport_articles_cpv7xrr0y5vo_1747752224.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0dca/live/acff8a60-2d3c-11ee-8b49-0164025e4cac.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cpv7xrr0y5vo_1747752224.html", "title": "Manchester City: Riyad Mahrez completes move to Al-Ahli", "title_page": "Manchester City: Riyad Mahrez completes move to Al-Ahli - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Riyad Mahrez has completed a move to Saudi Pro League side Al-Ahli from Manchester City.\nThe deal for the midfielder is understood to be in the region of £30m.\nThe 32-year-old becomes the seventh Premier League player this transfer window to make the move to play in Saudi Arabia.\nIt brings to an end Mahrez's five-year spell with City, where he made 236 appearances, scored 78 times, registered 59 assists and won 10 major trophies.\nSpeaking to the club website, external, the Algeria international said: \"To play for Manchester City has been an honour and privilege.\n\"I came to City to win trophies and enjoy my football and I achieved all that and so much more. I have had five unforgettable years with this football club, working with unbelievable players, fantastic supporters, and the best manager in the world.\n\"I've made a lifetime of wonderful memories and the manner of our Premier League title wins and the battles we've had with Liverpool and, last year, Arsenal, underlined our collective desire and mentality to be the best.\n\"Manchester City will forever be a huge and happy part of my life.\"\nCity director of football Txiki Begiristain paid tribute to Mahrez, adding: \"Riyad has been a major factor in our amazing successes over the past five years and his contribution will not be forgotten.\n\"He is a wonderful footballer to watch and leaves us with so many great memories.\"", "url": "https://www.bbc.com/sport/articles/cpv7xrr0y5vo"}