{"authors": ["Adam Pope", "www.facebook.com"], "date_download": "2025-05-21 07:34:05", "date_modify": "2025-05-21 07:34:05", "date_publish": "2025-01-22 10:52:54", "description": "A 12th home league win over Norwich on Wednesday will send Daniel Farke's side back to the Championship summit, so why is he not more popular?", "filename": "sport_football_articles_cp8k5j3j9rko_1747812845.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/70c8/live/81185460-d96e-11ef-a37f-eba91255dc3d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8k5j3j9rko_1747812845.html", "title": "Leeds United news: Opinion", "title_page": "Leeds United news: Opinion - 'Farke still adored by Norwich fans' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A 12th home league win over Norwich City tonight will send Daniel Farke's side back to the top of the Championship whilst extending the club's unbeaten run to 11 matches.\nYet for some Leeds United supporters, it feels like it will not be enough, or that he will never be enough.\nIt is difficult to fathom at times how a manager who has engineered a team which has scored 51 goals and has a goal difference (+32) superior by 10 to any of its rivals, is not universally accepted by the fanbase.\nIt is very much not the case in the eyes of tonight's opponents.\n\"He's absolutely adored by Norwich fans, even now,\" Adam Harvey of the PinkUn podcast told BBC Radio Leeds.\n\"We've had plenty of successful managers, even throughout my lifetime, but none of them are viewed quite the same way as Daniel Farke is.\n\"The connection, the way with words, I think you saw that when he returned to Carrow Road in October with Leeds.\n\"The reception showed the fans still love him even to this day. In that sense he's almost like a (Marcelo) Bielsa figure is for Leeds fans in that can't do anything wrong.\"\nNot being Bielsa appears to be the biggest crime any Leeds manager or head coach can commit it seems.\nThere is no doubt the Argentine performed something of a footballing miracle by coaching players to levels they believed were beyond them.\nEven the brilliant Pablo Hernandez said, despite all his years in the game, he learned something new each day.\n\"Marcelo was the man that changed it all,\" he said.\n\"The plan was not clear until he came in, but he arrived and made us all aware again of how we should play football, and to believe we were always better than the opposition.\"\nNobody can argue that Farke, too, doesn't have a clear plan of how he wants to play.\nA precise formula for success it may be, rather than a swashbuckling riot which had fans holding their breath until the death. But context is important.\nFarke inherited a club and a squad which had spiralled out of the top flight and losing had become endemic.\nHe turned it all around and went as close as Bielsa did by making the play-offs in his first year.\nThis time around he is primed to succeed like he did twice at Norwich.\nIf he does, the question will be whether he is given a fair crack in the Premier League, unlike his time at Carrow Road.\n\"He had to part from the football club in difficult circumstances,\" explains Harvey.\n\"They were difficult spells in the Premier League when Norwich went up but they never really stood a fighting chance.\n\"Some of that was down to the financial power available to him. Norwich had very limited funds at that point.\n\"Now they've had a shift in ownership so maybe the wealth is there a little bit more than was there before. But certainly under Delia (Smith) and Michael's (Wynn-Jones) leadership, it was never really able to push the boat out for individuals.\n\"As is proven now with the Premier League, the three promoted teams are the three in the relegation zone so it's a really tough place to go and be competitive. With a lack of resources that was always a bit of a challenge with Norwich.\n\"But I suppose with Leeds, with a little bit more financial backing, I'd be intrigued to see how he gets on.\n\"He's got all the experience now of the Premier League, he's done it for a couple of seasons. So can he use that to navigate a route to success with Leeds?\"\nFarke has to gain promotion first of course and whether or not his football is everyone's \"tea, coffee and cake\", many will say he deserves to have a decent choice from the dessert trolley at football's top table.\nTo quote Shakespeare's Andrew in Twelfth Night, \"I was adored once too\".\nA 12th home victory for Farke should earn him more adulation if not adoration.", "url": "https://www.bbc.com/sport/football/articles/cp8k5j3j9rko"}