{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:30", "date_modify": "2025-05-21 06:14:30", "date_publish": "2025-01-14 09:47:53", "description": "Alfie Dorrington keen to match James Maddison's impact at Aberdeen", "filename": "sport_articles_c8r5l1lgddvo_1747808070.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe81/live/7b0f7710-d25c-11ef-9dbb-9559c8b74d9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c8r5l1lgddvo_1747808070.html", "title": "Alfie Dorrington keen to match James Maddison's impact at Aberdeen", "title_page": "Alfie Dorrington keen to match James Maddison's impact at Aberdeen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New signing Alfie Dorrington hopes he can emulate Tottenham Hotspur team-mate James Maddison with an impactful loan stint at Aberdeen.\nThe 19-year-old defender has joined the Pittodrie club until the end of the season on loan from Ange Postecoglou's side in search of \"a platform to perform\".\nDown in North London, he shared a dressing room with England international Maddison who spent the first half of the 2016-17 season on loan at the Dons from Norwich City.\nMaddison secured his spot in fan folklore with a sensational last-minute free-kick winner against Rangers in the Granite City, and Dorrington hopes he too can endear himself to the home fans.\n\"I've done my research and saw that James Maddison came here when he was a similar age to me. The impact he had was amazing,\" the centre-back told club media.\n\"I've seen the goal he scored against Rangers in the last minute. It was a big performance from him really.\n\"It was a stepping stone in his career as well, because he kind of put his name on the map and then just gave him the platform to perform on the highest level possible for him.\"\nDorrington wasn't the only signing for the Dons on Monday, with \"versatile\" Alexander Jensen joining on a four-year deal.\nThe 23-year-old revealed \"it's nice to feel so wanted\" by a club like Aberdeen, after Jimmy Thelin revealed the club have been pursuing this deal for months.\n\"Aberdeen is a big club and I feel this is the right step for my career,\" the Swede told club media.\n\"The club were determined in their pursuit of me so it feels nice to be so wanted.\n\"I look forward to playing in front of the supporters and showing them what I can do. I will give everything I can for the team this season and in the future.\"", "url": "https://www.bbc.com/sport/articles/c8r5l1lgddvo"}