{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 07:26:23", "date_modify": "2025-05-21 07:26:23", "date_publish": "2025-03-28 14:11:46", "description": "Manchester City fans accuse the club of being \"tone deaf\" after the Premier League champions announced a global partnership with Viagogo.", "filename": "sport_football_articles_cy8383jv4p4o_1747812383.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6992/live/9c914b80-0bd6-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy8383jv4p4o_1747812383.html", "title": "Man City fans oppose partnership with ticket resale site Viagogo", "title_page": "Man City fans oppose partnership with ticket resale site Viagogo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City fans have accused the club of being \"tone deaf\" after the Premier League champions announced a global partnership with third-party ticket resale platform Viagogo.\nOn Thursday City announced, external that some hospitality tickets for men's and women's games will be sold on the platform, but not standard tickets.\nHowever, there is concern among supporters that hospitality tickets could end up being sold to away fans and that standard tickets could be sold at inflated prices.\nAfter reports of Feyenoord, Manchester United and Real Madrid supporters in home areas of Etihad Stadium this season, the club banned 165 ticketing accounts for touting with 354 suspended and 223 being 'closely monitored'.\nA joint statement from City supporter groups 1894, Trade Union Blues and MCFC Fans Foodbank said that away fans obtaining tickets in home areas has \"caused safety issues and distrust amongst supporters who are unwilling to use the club's [official] ticket exchange in fear of where their ticket will end up - yet another ticket partner may only add to this.\"\nThe groups have asked supporters to boycott the opening nine minutes of City's Premier League match against Leicester City on 2 April and remain on the stadium concourse to demonstrate that \"football without fans is nothing\".\nThe statement claims that City are yet to respond to the open letter signed by seven City supporter groups on ticket pricing seven weeks ago.\nThe Viagogo announcement comes with City yet to confirm season-ticket prices for the 2025-26 season.\nRepresentatives of the club's fan advisory board City Matters went on strike for several weeks because the club did not engage in discussions about season ticket prices. An extraordinary meeting has now been scheduled for Thursday, 3 April.\n\"To sign a ninth partnership with a ticket resale platform is incredibly tone deaf given the strength of concern,\" City Matters chair Alex Howell told BBC Sport.\n\"This is without reference to the well-founded concerns about price gouging and partnering with this particular operator.\"\nCity have approved resale agreements with eight different companies, while Viagogo is an official partner and so has additional promotional and advertising rights.\n\"Plenty of clubs run their own in-house ticket resale platforms allowing supporters to pass on tickets to one another at face value,\" the Football Supporters' Association (FSA) told BBC Sport.\n\"Why does any club need to engage a third party company whose only reason for existence is to push up prices and profit from matchgoers?\n\"It feels instinctively unfair for clubs to penalise supporters for passing on tickets at face value to friends or family members while cosying up to these companies.\"\nEarlier this season City fans took part in nationwide demonstrations about ticket prices organised by the FSA.\nCity say that tickets sold on Viagogo will come from the existing allocation of hospitality tickets, will be subject to a fixed price cap and will not subject to dynamic ticket pricing.\nIn 2021 the UK's competition watchdog the Competition and Markets Authority said that ticket resale firms like Viagogo should face tighter rules.\nEarlier this year the UK government launched a public consultation with a view to capping resale ticket prices.\nIn 2023 Viagogo's boss Cris Miller told the BBC lots of fans actually prefer buying on Viagogo instead of buying tickets directly for events, and that the company provides a \"secure, safe transaction\".\nCity declined to provide a statement when contacted by BBC Sport.\nBBC Sport has contacted Viagogo for additional comment.", "url": "https://www.bbc.com/sport/football/articles/cy8383jv4p4o"}