{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:17:43", "date_modify": "2025-05-21 07:17:43", "date_publish": "2025-05-20 10:01:57", "description": "Man City news: Grealish absence in FA Cup final 'criminal' - Given", "filename": "sport_football_articles_c8d11m7761ro_1747811863.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7460/live/221d0b70-3550-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8d11m7761ro_1747811863.html", "title": "Man City news: Grealish absence in FA Cup final 'criminal'", "title_page": "Man City news: Grealish absence in FA Cup final 'criminal' - Given - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Aston Villa team-mate Shay Given says \"it is criminal\" that Jack Grealish has not played a single minute in the last two FA Cup finals when Manchester City have been chasing the game.\nGrealish has only started 16 times this season in all competitions, and has been on the pitch for 1,520 minutes - fewer than half the amount he played in the 2022-23 season when City won the Champions League.\n\"I have said it before, but I believe he is a generational talent because he is that good,\" Given told BBC Radio 5 Live's Monday Night Club. \"He is a player you want to build your team around, but that was back-to-back FA Cup finals where Manchester City have needed a goal and they have not used him.\n\"When you have got a multi-time winner and international player in the calibre of Jack Grealish, it is criminal that he did not get on the pitch for both cup finals.\n\"The writing is on the wall.\n\"I don't even know why Pep Guardiola brought him to London at the weekend, he may as well have said stay at home.\n\"I am still angry for Jack. You only have a love for football if you are on the pitch.\n\"When he plays, he's a mannequin on the wing and just told to keep the shape. Kevin de Bruyne is leaving this summer and I think they already have the perfect replacement for him - in Grealish - if they want someone to play in the pockets. But I don't think he will ever play for City again.\n\"This is where he is at, so for his career and himself, he has to see what is out there.\n\"He is an amazing talent with plenty of years left in him and someone can get that out from him.\"", "url": "https://www.bbc.com/sport/football/articles/c8d11m7761ro"}