{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-04-26 04:06:26", "date_modify": "2025-04-26 04:06:26", "date_publish": "2025-03-03 16:39:44", "description": "Birmingham City's new goalscoring midfield hero Taylor Gardner-Hickman says the League One leaders will keep going whatever happens next.", "filename": "sport_football_articles_cvg1735xxp5o_1745640386.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90f1/live/c33866a0-f845-11ef-b5bf-275f2ed479cc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvg1735xxp5o_1745640386.html", "title": "Taylor Gardner-Hickman: Birmingham City do it game by game by game", "title_page": "Taylor Gardner-Hickman: Birmingham City do it game by game by game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "He has a name that sounds like an entire three-man midfield.\nHe feels like \"can play anywhere\" for Birmingham City.\nAnd Taylor Gardner-Hickman is currently doing more than his fair share on the goalscoring front for the League One champions-elect too.\nUp until the beginning of last week, the Shropshire-born utility man had only ever scored three goals in his 142 appearances, with boyhood club West Bromwich Albion, Bristol City and Blues, who he joined in the August window.\nNow he has scored two of Blues' last three goals - in successive games.\nThe most recent of them, Saturday's only goal of the game at St Andrew's in League One's top-of-the-table meeting against Wycombe Wanderers, virtually nailed down Blues' promotion back to the second tier.\nWith just 14 games to go, ahead of Tuesday's trip to seventh-placed Bolton Wanderers, the pre-season promotion favourites are now on 76 points from 32 matches, averaging not far short of two and half points per game - 12 points clear of Wycombe, 14 ahead of third-placed Wrexham and they still have a game in hand on both.\nIn the eyes of the rest of the country, they have almost already been waved through - but crucially, where it counts most, that is not the attitude in the Blues dressing room.\n\"As far as we're concerned, it's game, game, game,\" said Gardner-Hickman. \"Each one is the most important. And that goes right until the last game of the season.\n\"It's the last stretch but we just have to keep focused and win every game we can.\"\nBlues' progress this season under boss Chris Davies has been like a relentless juggernaut, knocking off each challenge by the week with seemingly routine monotony against determined opponents who have almost all given them a real game.\nBeaten only twice in the league, at Charlton in October and fired-up bottom club Shrewsbury Town in Gareth Ainsworth's first game in charge in November, they are now unbeaten in 18 League One matches.\nIn fact, it would actually be a surprise if they have not already wrapped up promotion (and possiby the title too) by the time they head for Wembley on 13 April to face Darren Ferguson's Peterborough United (and their old boss Barry Fry) in the EFL Trophy final, when both they and fellow twice winners Posh have a chance to equal Bristol City's record for most wins.\nBut, while it has generally been a route march through League One, Saturday's winner against Wycombe was pure 'route one'.\nA long punt straight downfield by goalkeeper Ryan Alsop saw Gardner-Hickman time his run down the inside-left channel before controlling superbly on his chest and powering a stinging right-foot volley which keeper Will Norris could only parry into the net.\nAnd the 23-year-old admitted that it was all part of a plan.\n\"Wycombe are very hard to break down,\" he said, \"But we'd looked at that in training and worked on it. We'd seen they do leave gaps down the middle and we exploited it.\n\"Ryan's been playing balls like that all season. He deserves an assist and I'm just glad to get him one.\"\nHaving got both his goals in a more advanced role than he was used to in his more defensive early days with Albion, the Shropshire lad, who can also play at full-back, has become even more of a utility player.\n\"This latest role is a left-side wide attacking midfielder, but I feel I can almost play anywhere and I like to think I've proved that,\" Gardner-Hickman said, with Blues confirming in February they will make his loan move from Bristol City into a permanent deal this summer.\n\"But really I'm just happy to play where the gaffer wants me to. And I'm just so glad they took the opportunity to sign me.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvg1735xxp5o"}