{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:27:03", "date_modify": "2025-05-21 05:27:03", "date_publish": "2025-04-03 11:23:52", "description": "Australian hooker Julian Heaven will join Premiership side Exeter in the summer.", "filename": "sport_rugby-union_articles_c62j41x61ejo_1747805223.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/207c/live/91e7d6b0-107a-11f0-8c6c-d990c1c0e96b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c62j41x61ejo_1747805223.html", "title": "Julian Heaven: Exeter sign Australian hooker from New South Wales Waratahs", "title_page": "Julian Heaven: Exeter sign Australian hooker from New South Wales Waratahs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australian hooker Julian Heaven will join Premiership side Exeter in the summer.\nThe 24-year-old arrives from Super Rugby's New South Wales Waratahs having come up through the academy at French side Lyon.\nHeaven is the second Australian player to seal a summer move to Sandy Park after back-row Tom Hooper agreed to join for next season in January.\nExeter have also been linked with Wallabies centre Len Ikitau and added Italy scrum-half Stephen Varney last month.\n\"Julian is a really exciting young hooker with a very interesting story around how hard he's worked to get the opportunities he's had,\" Exeter director of rugby Rob Baxter told the club website.\n\"He's travelled to France to try to get experience there and he's ended up fighting his way into getting some decent recognition with the Waratahs.\"\nHeaven helps fill the void left by Dan Frost's departure to Bath and Jack Innard's move to Gloucester.\nHe will pack down alongside fellow Australia forward Scott Sio, who signed a new deal last year.\nHeaven is eligible to play for England through family connections, as well as Australia and Spain.\nExeter have not disclosed the length of Heaven's contract.\n\"In the last couple of weeks, he's come off the bench or started in some very important games for the Waratahs,\" Baxter added. \"He's a young guy who we think is an exciting character and player.\n\"He's someone who will definitely add to what we're trying to achieve here. We're really excited to have him coming over here as a young guy coming in with stacks to prove.\n\"He wants to win things. His story has already proven he's prepared to take the tough route to get to where he's been – that really impresses me. I can only see bright things for him in the future.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c62j41x61ejo"}