{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-04-26 04:07:36", "date_modify": "2025-04-26 04:07:36", "date_publish": "2025-03-02 22:35:15", "description": "Manchester City manager Pep Guardiola has criticised the balls used in England's domestic cup competitions.", "filename": "sport_football_articles_cj923247gk7o_1745640456.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b196/live/b2781ef0-f791-11ef-ba30-7dc3acc49c5d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj923247gk7o_1745640456.html", "title": "FA Cup ball: Pep Guardiola criticises ball after 20 shots off target", "title_page": "FA Cup ball: Pep Guardiola criticises ball after 20 shots off target - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester City manager Pep Guardiola has criticised the balls used in England's domestic cup competitions.\nHis comments follow those of Arsenal boss Mikel Arteta, who was ridiculed earlier in the season when he expressed his anger over the ball being used in the Carabao Cup after a defeat against Newcastle in the semi-final.\nCity were 3-1 winners in the FA Cup against Championship side Plymouth on Saturday, but had 20 shots off target in the match.\nGuardiola said he was not happy with the Mitre balls used in the FA Cup.\n\"The ball in the Champions League is exceptional, the ball in the Premier League is exceptional, this one isn't,\" he said. \"It's difficult to control.\n\"When you lose it [sounds like] you're complaining, but the ball is not right. In many years it's happened in the FA Cup and Carabao Cup, I know it's a business and they come to agreements.\n\"You know how many shots went over? Look at other games. Normally the ball goes inside from these shots. \"\nNike balls are used in the Premier League, with Adidas balls utilised in the Champions League, Kipsta balls in the Europa League and Puma balls for the EFL Cup.\nIn response to Guardiola's comments, a Football Association spokesperson said: \"Mitre's Ultimax Pro ball - used in the Emirates FA Cup and all other FA competitions - has been tested in accordance with Fifa testing.\n\"All footballs in the professional game are required to meet the Fifa Quality pro accreditation, and this ball delivers against all of the testing requirements.\n\"Alongside Mitre, we understand that preference is subjective, but we're confident that the ball performs well. With over 350 goals scored in the knockout competition so far, it provides an exciting element to such a competitive tournament.\"\nCity's three goals in Saturday's FA Cup game came from 29 shots, of which nine were on target.\nIn their 4-0 Premier League win over Newcastle United on 15 February, Guardiola's side had 11 shots with seven on target.\nClubs are given the relevant balls to train with before cup fixtures.\nIn the weekend's FA Cup action, several Premier League sides had a higher percentage of shots on target than in their previous league matches, including Aston Villa, Crystal Palace, Newcastle, Bournemouth, Wolves and Newcastle.", "url": "https://www.bbc.co.uk/sport/football/articles/cj923247gk7o"}