{"authors": ["Alex Brotherton", "Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 03:42:53", "date_modify": "2025-05-21 03:42:53", "date_publish": "2025-04-06 17:24:17", "description": "What lies ahead for Southampton after becoming the first team to be relegated from the Premier League with as many as seven games remaining?", "filename": "sport_football_articles_cg5qy16e18po_1747798973.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dc8c/live/47adc4a0-1305-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cg5qy16e18po_1747798973.html", "title": "Southampton relegation: 'We have to avoid that record', says boss Ivan Juric", "title_page": "Southampton relegation: 'We have to avoid that record', says boss Ivan Juric - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The inevitable has been confirmed.\nSouthampton's 3-1 defeat at Tottenham guaranteed what everyone had known for a long time now - they will be playing Championship football next season.\nIvan Juric's men have become the first Premier League team to be relegated with as many as seven matches still to play.\nAnd they still need two more points to avoid taking the tag of being the worst Premier League team in history from Derby County's class of 2007-08.\nWith fourth-bottom Wolves 12 points clear, Saints are almost certain to be joined in the second tier by Leicester and Ipswich, with the trio needing another 19 points to avoid becoming the worst bottom three ever in the Premier League.\nNothing else is certain, not least the future of manager Juric whose 18-month contract is believed to contain a break clause.\n\"No, now we will see everything,\" said the 49-year-old Croatian when asked if talks had taken place regarding his future.\n\"We are thinking just about the games now. We will see now what everyone thinks, what I think. The fans deserve much more and we have to understand all of the mistakes we have made and then create something really strong.\n\"It's a difficult day, a tough day but I see the fans, how they love their players and their team - it's something incredible. This experience has to serve to create something stronger than this.\"\nSouthampton's season has been troubled from the start.\nThey lost eight of their opening nine games this term, and after 23 games had just one victory to their name.\nAfter replacing Russell Martin in December, Juric oversaw six straight defeats and has just one win in his 14 league games at the helm.\nSaints were nine points adrift of safety when he came in, but 22 points now separate them from Wolves, who won 2-1 at third-bottom Ipswich on Saturday.\nThey had five points from Martin's top-flight spell this season, one under interim boss Simon Rusk and four so far during Juric's tenure.\nSouthampton are only the third team to lose as many as 25 of their first 31 games of a top-flight campaign, after Sunderland in 2005-06 and Sheffield United in 2020-21 (both also 25).\nThey have conceded the most goals in the league (74) by far, and are the lowest scorers in the top four divisions of English football (23 goals in 31 games).\nNo team has ever had fewer points in the Premier League after 31 games (10), although Sunderland in 2005-06 & Derby in 2007-08 had the same tally too.\nSaints have the same amount of points after 31 games (10) as Derby County did in 2007-08, with Rams going on to achieve 11. Derby's campaign remains the worst in Premier League history, although it's a record Southampton could still beat.\n\"We have to avoid that record, do our best. It cannot happen,\" added Juric.\nGoalkeeper Aaron Ramsdale echoed those thoughts as he said: \"We want to get as many points as we can until the end of the season. No-one wants that record and we will do what we can - but we will do what we can to get more points on the board.\"\nThis is the third relegation Ramsdale has suffered during his career, having gone down with Bournemouth in 2019-20 and Sheffield United in 2020-21.\n\"Some [players] are experiencing relegation for the first time, so there will be a lot of emotions from them over the next few days,\" he added.\n\"The lads who have been here before, we have to try to pick the young boys up. This group did incredible things last season. Nobody will want to jump ship with seven games to go. We are tight and we have just got to pull each other through now.\"\nSaints captain Jan Bednarek was also honest about his team's situation.\n\"We can't change the past, the only thing we can do in the last seven games is to enjoy being in the Premier League,\" he said.\n\"We have to improve as players and as a club. Hopefully we are going to build something great. The best thing is that we can learn, we can work hard and we can improve.\"\nThe die was cast in the summer. Many around St Mary's felt they were going into the season with a weaker squad than the one which took them up from the Championship following a play-off final win over Leeds.\nThere was frustration with the ownership as chief executive Phil Parsons - who joined from Dyson in July 2023 - had limited experience in the game and the club struggled to move quickly enough to get deals done.\nReturning to the Premier League without an experienced sporting director was viewed as a massive error by the ownership, especially following technical director Jason Wilcox's departure to Manchester United. It left a huge question mark over their structure, the ownership's direction and left a hole in the support network for the head coach.\nInterest was reignited in Fabio Carvalho, having lost out to Hull to take him on loan from Liverpool last season, before he went to Brentford for £27.5m.\nA fee of £15m plus £5m in add-ons was agreed with Manchester City for striker Liam Delap, only for Ipswich to offer better wages. Winger Jack Clarke also went to the Tractor Boys from Sunderland, while midfielder Flynn Downes' £15m move from West Ham was also almost hijacked by Ipswich too.\nThree bids for Matt O'Riley, the final worth around £20m, were not enough to tempt Celtic to sell and the Denmark midfielder joined Brighton for £25m, while an offer for Bournemouth full-back Max Aarons was also rejected.\nIn came Ben Brereton-Diaz, Ronnie Edwards, Nathan Wood, Charlie Taylor, Cameron Archer and Ryan Fraser, yet the club circulated several names including Brereton-Diaz, Edwards and Taylor to Championship sides ahead of January in the hope of loaning them out.\nEdwards and Brereton-Diaz joined QPR and Sheffield United respectively, while left-back Taylor, a free transfer from Burnley, has played just 56 minutes since October.\nWinger Maxwel Cornet signed on loan from West Ham but managed just 71 minutes in the league, before returning to the London Stadium in January.\nCentre-back Taylor Harwood-Bellis' £20m move from Manchester City, having joined initially on loan in 2023, was triggered after promotion, but the one-cap England international is expected to leave in the summer.\nThe fall-out to the summer has also continued with head of recruitment Darren Mowbray leaving St Mary's in April, although sources told BBC Sport there was no issue with the players he was recommending.", "url": "https://www.bbc.com/sport/football/articles/cg5qy16e18po"}