{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:50:34", "date_modify": "2025-05-21 07:50:34", "date_publish": "2024-12-23 15:51:56", "description": "Fifa adapts its transfer regulations on an interim basis after the recent Lassana Diarra legal ruling but accepts they could be open to immediate challenge.", "filename": "sport_football_articles_ckgz9524l24o_1747813834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd00/live/38f3dc10-c143-11ef-b208-058c682ba73e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgz9524l24o_1747813834.html", "title": "Lassana Diarra: Fifa adapts transfer regulations after ruling over former France international", "title_page": "Lassana Diarra: Fifa adapts transfer regulations after ruling over former France international - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World governing body Fifa has adapted its transfer regulations on an interim basis after the recent Lassana Diarra legal ruling but accepts it could be open to immediate challenge.\nFifa has been forced to change its rules following a European Court of Justice (ECJ) ruling around Diarra's claim that its regulations restricted his freedom of movement.\nIt requested talks with all key stakeholders before drafting its interim amendments, which have been confirmed and take immediate effect - in time for the January transfer window.\nHowever, there was no representation for the players within the discussions, with Fifa saying the global players' union declined to take part, something Fifpro disputes.\nFifa sources with thorough knowledge of the regulatory process have privately admitted they do not know why this course of action has been taken and feel it could be part of a tactical move for use later in the process.\nOfficials stress their belief that, after seeking clarification around parts of the ruling, they have addressed all the elements of concern highlighted by the ECJ and feel the new rules are legally sound.\nHowever, they accept it is possible they could be challenged immediately or an injunction could be sought to delay the adaptations' introduction.\nThey regard the uncertainty as unhelpful in the circumstances. It is anticipated permanent new rules will be in place for next summer.\n\"Fifa remains convinced that an open, inclusive dialogue with all its stakeholders is the way forward to develop a robust, objective, transparent, non-discriminatory and proportionate regulatory framework for football at a global level,\" said the organisation.\nFifpro said it does \"not agree\" with the temporary measures announced by Fifa, which it says have been \"introduced without a proper collective bargaining process\".\nIt added: \"The measures do not provide legal certainty to professional footballers and do not reflect the judgement by the European Court of Justice.\"\nFifa believes the ECJ judgement reinforced its position as regulator around the transfer system in a number of key areas and the need for contractual stability.\nHowever, it accepted certain aspects of transfer regulations needed to be changed:\nThe calculation of compensation payable in the event of a breach of contract by a player or coach\nThe burden of proof in relation to joint and several liability for compensation payable for a breach of contract\nThe burden of proof in relation to an inducement to breach a contract (and the related sporting sanction against the new club of a player)\nThe procedure regarding the issuance of an International Transfer Certificate\nIn Fifa's own words: \"Any party that has suffered as a result of a breach of contract by the counterparty shall be entitled to receive compensation.\"\nThe compensation will be set taking into account the damage suffered, with each case assessed on its merits.\nHowever, if it is established a signing club induced a player to breach their contract in order to force a move, Fifa says that new club \"shall be held jointly liable to pay compensation\".\nIt has now been confirmed in writing that any club who has either breached a contract or induced a player to breach their contract will be banned from signing players for two transfer windows.\nFormer France international Diarra, now 39, has been mired in a series of legal battles since his contract with Lokomotiv Moscow was terminated by the club in 2014.\nFollowing a dispute with manager Leonid Kuchuk, Lokomotiv alleged Diarra refused to appear at training or accept a lower salary and dismissed him three years before his deal was scheduled to expire.\nIn 2016, a Fifa ruling - backed up by the Court of Arbitration for Sport (Cas) - found Diarra liable for breach of contract, ordering him to pay 10m euros (£8.4m) to Lokomotiv and suspending him from professional football for 15 months.\nWhen Diarra subsequently agreed a deal to join Charleroi, the club sought assurances they would not be liable to pay any compensation to Lokomotiv.\nFifa then refused to issue Charleroi with an ITC, required by clubs across the world to register a newly signed player, so the deal collapsed.\nDiarra's lawyers contested this specific rule - which makes a club wishing to sign a player jointly liable for compensation to a player's old club, and at risk of sporting sanctions, in cases where the player's previous contract was terminated without just cause.\nThey also challenged a rule which allows the national association of a player's former club to withhold an ITC where there was a dispute, which they said also hindered the move.\nThe court has determined that Fifa should not be able to use the ITC system to prevent players who have breached a contract from moving and working where they choose.\nParts of Fifa's transfer rules will have to be revised to remain valid in the EU.", "url": "https://www.bbc.com/sport/football/articles/ckgz9524l24o"}