{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:09:07", "date_modify": "2025-05-21 06:09:07", "date_publish": "2025-01-04 21:28:38", "description": "Liverpool offer Trent Alexander-Arnold a £78m contract, Paris St-Germain want Aston Villa's Jhon Duran, Napoli are negotiating a loan move for Federico Chiesa, plus more.", "filename": "sport_football_articles_c1kexd8epvwo_1747807747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f174/live/0c3723c0-cae0-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kexd8epvwo_1747807747.html", "title": "Football gossip: Alexander-Arnold, Duran, Chiesa, Zirkzee, Rashford, Sane, Cunha", "title_page": "Football gossip: Alexander-Arnold, Duran, Chiesa, Zirkzee, Rashford, Sane, Cunha - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool offer Trent Alexander-Arnold £78m contract, Paris St-Germain want Aston Villa's Jhon Duran, Napoli negotiating loan move for Federico Chiesa.\nLiverpool have offered England right-back and Real Madrid target Trent Alexander-Arnold, 26, a five-year contract worth £78m. (Mirror), external\nParis St-Germain are set for talks with Aston Villa over a cash-plus-player swap deal involving France forward Randal Kolo Muani, 26, and Colombia striker Jhon Duran, 21. (Football Insider), external\nNapoli have opened negotiations with Liverpool and Federico Chiesa's agent to secure a six-month loan for the 27-year-old Italy winger. (Footmercato), external\nNetherlands forward Joshua Zirkzee wants to leave Manchester United, with Juventus interested in the 23-year-old. (Gazzetta dello Sport - in Italian), external\nUnited and England forward Marcus Rashford, 27, has attracted interest from Major League Soccer side Seattle Sounders. (Teamtalk), external\nLiverpool want Bayern Munich and Germany winger Leroy Sane, 28, as a replacement for Egypt forward Mohamed Salah, 32. (Fichajes - in Spanish), external\nWolves are close to extending Brazil forward Matheus Cunha's contract despite the 25-year-old being a January target for Arsenal. (Eduardo Burgos, Diario AS), external\nBrighton have made an offer of about £23m for Palmeiras defender Vitor Reis, 18, as the club look to bring in reinforcements during the January transfer window. (Mail), external\nManchester United left-back Tyrell Malacia, 25, is a surprise transfer target for Italian club Juventus. The Dutchman is seen as a replacement for experienced Brazil defender Danilo, 33. (Daily Star, external)\nReal Betis are in advanced talks to sign 20-year-old Spanish midfielder Stefan Bajcetic on a loan deal from Liverpool.(Fabrizio Romano), external\nManchester City are preparing an offer for Eintracht Frankfurt forward Omar Marmoush, 25, as they bid to beat Arsenal, Tottenham and Liverpool to the Egypt international's signing. (Footmercato - in French), external\nBournemouth have agreed a deal to sign Argentine left-back Julio Soler, 19, from Lanus in a deal worth about £12m. (Uriel Lugt, external)\nCrystal Palace's English midfielder Jadan Raymond, 21, is a target for Dundee and Colchester United in this month's transfer window. (Football Insider) , external", "url": "https://www.bbc.com/sport/football/articles/c1kexd8epvwo"}