{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 07:20:07", "date_modify": "2025-05-21 07:20:07", "date_publish": "2025-01-13 18:50:24", "description": "New Plymouth Argyle head coach Miron Muslic says he has been impressed with the support he has had in his first few days in the job.", "filename": "sport_football_articles_c30dpmr2y6zo_1747812007.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/143f/live/2eda0640-d1de-11ef-80e5-9f0b215d3fef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c30dpmr2y6zo_1747812007.html", "title": "Miron Muslic: Plymouth 'is now my new home' says new Argyle boss", "title_page": "Miron Muslic: Plymouth 'is now my new home' says new Argyle boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Plymouth Argyle head coach Miron Muslic says he has been impressed with the support he has had in his first few days in the job.\nThe 42-year-old Austrian has taken charge of the Championship's bottom side after Wayne Rooney left the club on 31 December.\nMuslic was in the stands for Argyle's 1-0 FA Cup third round win at Premier League side Brentford before returning to Devon alongside members of the club's renowned fanbase.\n\"I'm here for 72 hours and I met a million people in the last 72 hours, but every time I had the feeling 'these are good people, these are honest, hardworking, straight people,\" he told BBC Sport.\n\"Maybe that's why I also felt immediately this connection, because I'm also trying to be hardworking, try to be honest, try to be straight, try to be open minded.\n\"I had a very interesting trip from London to Plymouth on the train for four hours with the Green Army. I know every single supporter in and out, but it was very important for me to be on that train.\n\"I was not expecting this, but at this moment I realised it means a lot to them.\n\"And it means a lot to me. This is now my new home, this is my club, these are my colours, this is also my patch and I'm here to give it my all.\"", "url": "https://www.bbc.com/sport/football/articles/c30dpmr2y6zo"}