{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:31:10", "date_modify": "2025-05-21 04:31:10", "date_publish": "2025-01-18 00:00:00", "description": "Substitute Garath McCleary scores the winning goal as promotion hopefuls Wigan shrug off the loss of former boss Matt Bloomfield by beating Mansfield.", "filename": "sport_football_live_cx25lxgngp2t_1747801870.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx25lxgngp2t_1747801870.html", "title": "Mansfield Town 1-2 Wycombe Wanderers", "title_page": "Mansfield Town 1-2 Wycombe Wanderers: Chairboys boos promotion push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wycombe maintained their title chase despite losing boss Matt Bloomfield to Luton this week as a late winner saw them claim victory at Mansfield.\nSubstitute Garath McCleary snatched the points in the 87th minute after Stags substitute Lucas Akins had cancelled out Richard Kone's opener for Wycombe in an exciting second half.\nMansfield threatened first when George Maris hit the Wycombe bar with a flicked header from Hiram Boateng's sixth-minute free-kick.\nBut it was the visitors who dominated the first half and Mansfield keeper Scott Flinders had to get down to stop Beryly Lubala's low, angled drive after 19 minutes.\nWycombe, under the guidance of caretaker manager Sam Grace, were gifted the chance to make the breakthrough after 57 minutes when Lubala was brought down by Jordan Bowery in the box.\nFlinders dived to his right to superbly keep out Kone's spot-kick, only to see the Wanderers forward sweep home the follow-up.\nMansfield sent on Akins after 66 minutes and two minutes later he had levelled, heading over keeper Franco Ravizzoli from a teasing cross from fellow replacement Stephen McLaughlin.\nStags then almost snatched the lead with 10 minutes to go as a stretching Ravizzoli saved superbly from Will Evans' goalbound header from a Bowery cross.\nEvans came even closer in the 86 minutes when he sent a first-time finish wide with only the keeper to beat from a low McLaughlin cross.\nThose misses were punished a minute later as McCleary fired home from 10 yards after beating two men cutting in from the right, snatching the points for high-flying Wycombe.", "url": "https://www.bbc.com/sport/football/live/cx25lxgngp2t"}