{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:27:43", "date_modify": "2025-05-21 04:27:43", "date_publish": "2025-04-05 12:08:36", "description": "Ulster holders Donegal are firm favourites to win Sunday's preliminary-round game against Derry in Ballybofey.", "filename": "sport_articles_c0elw9jwrdno_1747801663.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f737/live/35389320-1163-11f0-ba60-99b08c2860b3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0elw9jwrdno_1747801663.html", "title": "Ulster SFC 2025: Donegal depth aiding back-to-back Anglo-Celt bid", "title_page": "Ulster SFC 2025: Donegal depth aiding back-to-back Anglo-Celt bid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager: Jim McGuinness: Captain: Patrick McBrearty Fixture: Donegal v Derry – Ballybofey, Sunday 6 April, 14:00 BST\nDonegal will be confident of winning back-to-back Anglo-Celt Cups as they did in 2018 and 2019.\nJim McGuinness' side held their nerve to triumph 6-5 on penalties against Armagh in last year's final to win the Ulster title for the first time in five years.\nThey come into their preliminary meeting with a depleted Derry side as favourites after beating the Oak Leafers, then holders, at this stage of the competition last year and in the league at the start of March.\nThe Tir Conaill men finished fourth in Division One with four wins from seven games, including a 1-22 to 1-19 victory against Derry in Ballyshannon after coming from eight points down with 15 minutes left to play.\nMichael Murphy has been carefully managed since his return to the panel after two seasons out it seems with the intention to have him firing on all cylinders for the championship.\nIn fact, McGuinness has been careful with the majority of his squad, regularly rotating by using 36 players across their seven games.\nAs a result, his panel see primed to go all guns blazing against Derry in the first step on their quest to retain the title.", "url": "https://www.bbc.com/sport/articles/c0elw9jwrdno"}