{"authors": ["Maisie Gallen", "www.facebook.com"], "date_download": "2025-04-26 04:29:06", "date_modify": "2025-04-26 04:29:06", "date_publish": "2025-03-02 08:06:28", "description": "England seamer Jofra Archer is keen to play Test cricket this summer, says head coach Brendon McCullum.", "filename": "sport_cricket_articles_cx2r04gylw1o_1745641746.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd30/live/a05b13f0-f6bd-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_cx2r04gylw1o_1745641746.html", "title": "Jofra Archer: England bowler keen to play Tests again, says Brendon McCullum", "title_page": "Jofra Archer: England bowler keen to play Tests again, says Brendon McCullum - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England seamer Jofra Archer is \"pretty keen\" to play Test cricket this summer, says head coach Brendon McCullum.\nThe 29-year-old has suffered a recurring stress fracture in his elbow and a back stress fracture since he last played Test cricket in 2021.\nThe fast bowler, who has 42 Test wickets since his debut in the 2019 Ashes, returned to international cricket in March 2023 in England's ODI series against Bangladesh but suffered elbow discomfort and then did not play international cricket until May 2024.\n\"We've got to make sure we're always doing the right thing by Jof and understanding the risks involved but I'm pretty sure he's pretty keen to play Test cricket,\" said McCullum.\n\"If you can add him to the battery of fast bowlers you're trying to build then it only strengthens the squad.\n\"Overall, I'm really pleased to see where Jof's at and it's great to see him back playing and injury-free at the moment.\"\nAsked if Archer could play Test cricket this summer, McCullum said: \"I guess so, we'll find out. I'll sit down with some of the players after this [the Champions Trophy] and work out what their ambitions are. I would imagine Jof would be keen to play Test cricket this summer.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/cx2r04gylw1o"}