{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:42:55", "date_modify": "2025-05-21 06:42:55", "date_publish": "2025-01-04 00:00:00", "description": "How the action unfolded as Limavady United, Ards and Annagh shock Premiership opponents in the Irish Cup fifth round.", "filename": "sport_football_live_cy7k2pn030kt_1747809775.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cy7k2pn030kt_1747809775.html", "title": "Shock defeats for Larne, Ballymena & Ports - Irish Cup as it happened", "title_page": "Irish Cup: Shock defeats for Larne, Ballymena & Ports - Irish Cup as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Final whistle\nWhat a day for Irish Cup upsets as Limavady stunned Larne, Ards beat Ballymena and Annagh defeated Mid-Ulster neighbours Portadown.\nAnd there's no doubt what's the pick of the games in the sixth round with Glentoran hosting Linfield in a Big Two showdown.\nThat's all from us for now - we hope you enjoyed it.\nThanks for your company.\nFULL-TIME\nLimavady United 1-0 Larne\nIt's all over at the Limavady Showgrounds where a Ruairi Boorman goal deep into extra-time sends then Championship side through at the expense of the premiership champions.\nBoorman struck five minutes from time when Larne failed to clear a free-kick into the heart of the box.\nIt's no less than the Roesiders deserve following a professional display against a disappointing Larne side.\nPost\nLimavady United 1-0 Larne\nLimavady United are just minutes away from a famous cup upset following Ruairi Boorman's late goal.\nLimavady United swung a free-kick in from the right wing, Larne 'keeper Rohan Ferguson failed to gather and Boorman was quickest to react, prodding home from close range to break the deadlock.", "url": "https://www.bbc.com/sport/football/live/cy7k2pn030kt"}