{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:53", "date_modify": "2025-05-21 07:49:53", "date_publish": "2025-05-18 17:09:50", "description": "Notingham Forest striker Taiwo Awoniyi says he is \"grateful to still be here\" after having surgery on a serious abdominal injury.", "filename": "sport_football_articles_c1kv4egm2kjo_1747813793.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eea7/live/d49a1ad0-3407-11f0-8944-2b1dd2bd7018.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1kv4egm2kjo_1747813793.html", "title": "Taiwo Awoniyi: Nottingham Forest striker 'is grateful to still be here' after surgery", "title_page": "Taiwo Awoniyi: Nottingham Forest striker 'is grateful to still be here' after surgery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest striker Taiwo Awoniyi says he is \"grateful to still be here\" after having surgery on a serious abdominal injury.\nThe 27-year-old was put in an induced coma after being taken to hospital, badly hurt when colliding with the post against Leicester while trying to reach an Anthony Elanga cross.\nAwoniyi had emergency surgery and was woken from the induced coma on Wednesday evening, with medical staff now monitoring his progress.\nForest team-mate Morgan Gibbs-White celebrated with a shirt bearing the Nigerian forward's name after scoring in the vital 2-1 win on Sunday at West Ham.\nNuno Espirito Santo's side also warmed up in T-shirts with Awoniyi's name and number on the back, plus the message \"we are all with you Taiwo\" on the front.\nAnd Awoniyi said on Instagram:, external \"This season has been one of the most difficult of my career but through it all, I have felt the love. With the grace of God, I am grateful to still be here, to still be fighting, to still be smiling, and to be in good spirits.\n\"To my team-mates, coaches, staff and the entire Forest family, thank you for your well wishes, seeing you all on your visit to the hospital lifted my spirits more than words can say.\n\"I'm with you all the way and I can't wait to be back out there with the boys doing what I love.\"\nThe win at West Ham left Forest in seventh place, but just one point behind fourth-placed Chelsea, who they host on the final day of the season, and Aston Villa in the gripping battle for a Champions League place next season.", "url": "https://www.bbc.com/sport/football/articles/c1kv4egm2kjo"}