{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:46:58", "date_modify": "2025-05-21 05:46:58", "date_publish": "2025-01-23 00:00:00", "description": "England face Australia in the second T20 in the Women’s Ashes – follow score updates, radio commentary and video highlights.", "filename": "sport_cricket_live_cy4p9yejygqt_1747806418.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cy4p9yejygqt_1747806418.html", "title": "Australia win Women's Ashes after victory in the second T20 in Canberra", "title_page": "Australia win Women's Ashes after victory in the second T20 in Canberra - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England remain winless after rain-affected T20 defeat\nThat's your lot for today, folks!\nAustralia have won the Ashes outright but it is a gut-wrenching loss for England as the weather arrived to end what slim hopes they had of pulling off a brilliant win.\nFfion Wynne's report on Australia taking a 10-0 lead after a thrilling contest is here.\nGrace Harris has got the Aussies gunning for a 16-0 whitewash, we'll be back on Saturday to see if England can avoid that fate by winning the third T20.\nJoin us for that one at the Adelaide Oval, the game starts at 08:10 GMT.\n'Weather came at the worst possible time'\nEngland captain Heather Knight, speaking to BBC Test Match Special: \"Shame. Awesome crowd in today, it was set to a real thrilling game, it was a real thrilling game.\n\"I felt like it was on, I felt like I was set, obviously the weather came at the worst possible time and we weren't able to see the complete conclusion. It was going to be a tough ask, but I felt like I was set and was going to get it done.\n\"One of those things, we can't really control the weather. Really disappointed I wasn't able to take it to the conclusion of the match, felt like I was in with a good chance but nice to finally contribute with the bat.\n\"I've had a frustrating tour, it's one of those. It is what is, the weather came at the worst possible time.\"\n'Retaining is a loss, we want to win 16-0'\nAustralia all-rounder Grace Harris, speaking to BBC Test Match Special: \"I have, of course, thought about 16-0. A whitewash would be outstanding. England got the better of us in England in the last Ashes series – they won two of the white-ball series and we just retained the Ashes.\n\"To me, it's a loss. A draw is boring. But 16-0... it would be very, very good if we could embarrass this England team because they're actually a very competitive outfit and they've got some really good players amongst them. Let's hope we keep performing as a team and really put them to the sword.\n\"You ask me if you've thought about the 16-0 and I've thought about it tonight, right now, and it would be fantastic!\n\"They're a very competitive outfit so I wouldn’t be surprised if they throw a few punches along the way and get on the board.\"\nPost\nMichelle Goszko\nEx-Australia batter on BBC Sounds\nIt's going to be tough for England after tonight but there was more fight from them.\nThey got a lot closer than the Australians probably thought they would and fought back quite well.\nI just hope we have a good contest in the third T20 and build into the Test match.\n'I’m glad it is not happening in our camp'\nAustralia all-rounder Grace Harris, speaking to BBC Test Match Special: \"It’s not the most common ending I have ever seen. It would have been a little bit sweeter if we had beat them outright but we played well enough to put a really competitive total on the board.\n\"England could say the rain saved us but with 18 off five – how often do they come back from that? We got onto a roll and we had clear plans which we executed most of the time.\n\"I can see both sides of it [the recent criticism around England’s fitness]. Cricket is also a mental game. The fitness aspect comes into making better decisions for a longer period of time and under fatigue.\n\"I think if the criticism had been worded better, it wouldn’t have been taken so harshly. I’m glad it is not happening in our camp!\n\"The Test match will be really exciting and we will be looking for a complete clean sweep. We want to put England to the sword.\"\n'I'm thinking about 16-0 right now!'\nGrace Harris is speaking to BBC Test Match Special and the Australian is not holding back!\n\"It would be very, very good if we could embarrass this England team,\" she says when asked if she has thought about the prospect of Australia claiming a 16-0 whitewash.\nWe will most certainly bring you more from that interview shortly.\n'It was definitely possible for us at the end'\nEngland captain Heather Knight: \"Such a tough way to go. It was disappointing that we couldn’t finish it for the crowd who turned up today. I felt like we were in the game, especially the partnership with myself and Nat [Sciver-Brunt]. I felt personally, like I was set and it was definitely possible for us at the end, for sure.\n\"Danni Wyatt-Hodge and Sophia [Dunkley] were outstanding. The rain break slowed us down and upset our rhythm a lot. But I’m proud of how the girls played and it’s a shame the game didn’t reach its crescendo.\n\"We can take some real positives from today. Unfortunately, we weren’t able to restrict them and we let them run away with it in the last few overs of their innings, but we are proud our ourselves nonetheless.\"\n'We're still not done'\nAustralia captain and player of the match Tahlia McGrath: \"My heart rate has only just settled down, looking at DLS, thinking about the radar. It's a very nice feeling.\n\"A team performance - everyone played their role. Grace at the back end, showed her power, her class. It was tough to bowl in these conditions.\n\"I'm exhausted trying to work out the strategies - glad it's over. We're still not done, but very happy to win the Ashes outright.\"\nPost\nThe captains are being interviewed in the pouring rain in Canberra, somewhat sheltered by an umbrella.\nIt is a rather ridiculous scene, so much so that Heather Knight, who had a face like thunder (fittingly in these conditions) a few moments ago, allows herself the briefest of smiles at the absurdity of it all.\nWe'll bring you quotes from both Knight and Tahlia McGrath shortly.\nAustralia win the Women's Ashes\nAustralia win by six runs (DLS)\nThat's it. A visibly furious Heather Knight shakes hands with Tahlia McGrath and that's that.\nAustralia win by six runs on the Duckworth-Lewis-Stern method to take an unassailable 10-0 lead in the series.\nEngland were still up against it needing 18 from five balls but Knight was batting so well that they did have a chance. The rain denied them that chance.\nPost\nI'd expect England will have plenty to say about when the umpires have or have not taken the players off in this game.\nThey kept them out when there was lightning earlier in the innings and the tourists' batters wanted to go off, now they taken them off five balls shy of the end of the match.\nTo be clear, it is really hammering down so, in almost any other circumstance, you could have no complaint. This time, though, England just might.", "url": "https://www.bbc.com/sport/cricket/live/cy4p9yejygqt"}