{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:48:14", "date_modify": "2025-05-20 13:48:14", "date_publish": "2023-07-31 12:51:47", "description": "Burton Albion boss Dino Maamria says he is looking to the loan market to further strengthen his new-look squad.", "filename": "sport_football_66359811_1747748894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9573/production/_130595283_shutterstock_editorial_13890316bn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359811_1747748894.html", "title": "Dino Maamria: Burton Albion boss open to more additions to new-look squad", "title_page": "Dino Maamria: Burton Albion boss open to more additions to new-look squad - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burton Albion boss Dino Maamria says he is looking to the loan market to further strengthen his new-look squad.\nThe Brewers have brought in 10 new players in a busy transfer window, having released the same number at the end of last season.\nYet Maamria said the Brewers are still working on more potential deals.\n\"We have got 19 players that we will go forward with and we've probably got two or three we're still working on,\" he told BBC Radio Derby.\n\"We know the loan market is still open, we know some good ones are coming on in the next few weeks, when these top teams allow their good loans to come out.\n\"So we have got room for improvement, there's no doubt about that, and there is another month of the transfer window yet.\"\nBurton were beaten by National League side Scunthorpe United in their final warm-up game, and Maamria said he had a good idea of his starting XI for their League One opener at Blackpool on Saturday.\n\"In the next month we will have six or seven games so a lot can change, but ultimately we work on short term then we work on mid-terms, and we have long term as well,\" he added.\n\"We have got our targets. We've been patient with that throughout the summer and if we can make any improvement to the team before next Saturday that would be brilliant.\"", "url": "https://www.bbc.com/sport/football/66359811"}