{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:17", "date_modify": "2025-05-21 08:00:17", "date_publish": "2025-05-19 17:06:59", "description": "Cameron Green's unbeaten fifty helps Gloucestershire reach a target of 162 to beat Kent by three wickets.", "filename": "sport_cricket_articles_cn9j17r2xvgo_1747814417.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b30/live/d276efd0-34cf-11f0-8ca3-49a2defac508.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cn9j17r2xvgo_1747814417.html", "title": "County Championship: Cameron Green helps Gloucestershire beat Kent", "title_page": "County Championship: Cameron Green helps Gloucestershire beat Kent - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cameron Green held his nerve to steer Gloucestershire to a hard-earned three-wicket victory over Kent on the final day of a thrilling County Championship Division Two match at the Seat Unique Stadium, Bristol.\nSet a modest 162 to win in a minimum 57 overs, the home side made heavy weather of the chase as they were reduced to 57-4 and 138-7, Nathan Gilchrist claiming 4-43 to threaten an unlikely Kent comeback.\nBut Australia international Green performed admirably under pressure to post a crucial match-winning innings of 67 not out from 90 balls, including a six and six fours, as the hosts dug in to reach their target with 13.5 overs to spare.\nBen Charlesworth had earlier produced a startling cameo with the ball to set up Gloucestershire's first home win in nearly three years.\nRegarded as an occasional bowler after being restricted by injury in recent times, the right-arm seamer took three wickets in a devastating 14-ball burst as Kent were dismissed for 253 inside 89 overs in their second innings.\nChris Benjamin and Grant Stewart appeared to be making a decent fist of saving the game when staging a half-century partnership for the fifth wicket, only for the latter to fall to Charlesworth shortly before lunch and spark a collapse in which the visitors lost their last five wickets for 20 runs in 10.5 overs.\nThis was Gloucestershire's first home win in 16 attempts since beating Warwickshire at Bristol in September 2022 and this first victory of the season was greeted with glee by long-suffering supporters. The home side banked 24 points to climb the table, while Kent took six after suffering a second defeat in as many outings.\nResuming on 135-4, a slender lead of 43, Kent batters Benjamin and Jack Leaning extended their defiant partnership to 82 in the face of a probing examination from Gloucestershire's seamers, who bowled well as a unit to build pressure.\nImaginative in his field settings, Gloucestershire skipper Cameron Bancroft deployed a short mid-wicket and invited the batsmen to make a mistake. Leaning fell into the trap, attempting to force a ball from Josh Shaw into the on-side and looping a catch up to Ollie Price to afford Gloucestershire the breakthrough they craved. He had contributed a patient 34 from 86 balls and frustrated the home bowlers for best part of an hour on the final morning.\nAhead by 88, Kent were now pinning their hopes on Stewart and Benjamin mustering a repeat of the huge partnership that formed the basis of their first-innings total on day one. Benjamin upheld his end of the bargain, going to a watchful half-century from 129 deliveries. Rather more robust in his approach, Stewart played his natural game, taking on the seamers and scoring 41 at better than a run a ball to dominate a progressive stand of 53.\nThat was the cue for Bancroft to throw the ball to Charlesworth, who effected a crucial double breakthrough shortly before lunch. Stewart's high-risk strategy backfired, the Italy international dragging the ball onto his stumps, and when Charlesworth bowled Jaydn Denly for five soon afterwards, Kent were 241-7, and in trouble. The lead was 149, but the new ball was two overs away and Gloucestershire sensed an opportunity to end their long wait for a home victory.\nBefore even the new ball could be taken, Charlesworth made a further intervention, inducing Jake Ball to send a leading edge to point where a full-length Miles Hammond took a startling catch on the run to reduce the visitors to 243-8. Having previously sent down a mere 33 overs and taken three wickets at an average of 47.3 this season, the 24-year-old all-rounder had doubled his tally in the space of six overs from the Ashley Down Road end to utterly transform his team's prospects.\nThe rout continued after Gloucestershire took the new ball, Singh Dale dismissing Kashif Ali lbw for three on his way to career-best match figures of 9-179, eclipsing the 7-41 he took against Worcestershire at New Road in April 2023. Benjamin was last man out, edging Tom Price to second slip after chiseling 58 from 149 balls.\nIf Gloucestershire believed the route to victory would be straightforward, they were made to think again, losing both openers inside three overs. Pushing half forward to a length ball from Gilchrist, Charlesworth was brilliantly caught by Leaning at second slip, while Ball produced an excellent delivery to have Bancroft caught behind as the hosts slipped to 12-2. Gilchrist then held a return catch off his own bowling after squaring up Ollie Price to further reduce Gloucestershire to 37-3.\nIt was 57-4 soon afterwards, Hammond inexplicably playing at a wide delivery from Stewart and nicking off to Tawanda Muyeye at first slip for 18. Their nerves jangling, Gloucestershire then received a crucial let-off when the diving Leaning put down a sharp chance at second slip off the bowling of Kashif Ali, affording Green a life on three. Gloucestershire managed to reach the tea interval without further loss on 65-4, requiring 97 more to win in 38 overs.\nA period of stability was called for and Green and James Bracey calmed any nerves, raising a 50 partnership from 58 deliveries, and then accelerating as the ball softened and Kent's bowlers wavered. Making good his earlier escape, Green hoisted Kashif over mid-wicket for an imposing six and mustered five fours on his way to a 71-ball half century.\nBut Kent still fancied their chances when Gilchrist returned to take two wickets in as many balls, Bracey holing out to deep mid-wicket for 19 and Graeme van Buuren offering a catch behind to bag a pair as Gloucestershire slipped to 121-6 with 41 still needed. Tom Price pursued a ball down the leg side and was caught behind off the bowling of Stewart to set-up a tense finale, but the indomitable Green and Zaman Akhter carried the home side over the line.", "url": "https://www.bbc.com/sport/cricket/articles/cn9j17r2xvgo"}