{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:12:53", "date_modify": "2025-04-26 08:12:53", "date_publish": "2025-02-26 11:42:13", "description": "Birmingham City winger Scott Wright will not play again this season after suffering a knee injury and Lyndon Dykes is also facing a lay-off.", "filename": "sport_football_articles_c7vzdy6n4ydo_1745655173.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0297/live/74958480-f433-11ef-8241-abbb923a0925.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c7vzdy6n4ydo_1745655173.html", "title": "Scott Wright: Birmingham City winger to miss rest of season", "title_page": "Scott Wright: Birmingham City winger to miss rest of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Birmingham City winger Scott Wright will not play again this season after suffering a knee injury.\nThe 27-year-old has made 20 appearances, scoring three goals, since arriving from Rangers for an undisclosed fee in the summer but went off in the ninth minute of Saturday's 0-0 draw with Reading.\nStriker Lyndon Dykes picked up a calf strain in the same game but boss Chris Davies told the club website that he hoped the Scotland international would return at \"the back end of the season\".\nThe double blow follows leading scorer Jay Stansfield being stretchered off in last week's EFL Trophy semi-final win over Bradford City.\nAll three missed Tuesday's 2-0 victory over Leyton Orient which put Blues nine points clear at the top of League One, with a game in hand on second-placed Wycombe who they play on Saturday (12:30 GMT).\nAlfie May led the line against Orient and although he hit the crossbar, was unable to get on the scoresheet as his goalless run stretched to 11 games.\n\"What they say with strikers is it's about getting the chances. We know Alfie can score and he's had two, three good chances, and they all came because he's in the right position at the right time,\" Davies told BBC WM Sport.\n\"Another day he will score those. I've got no worries about Alfie May scoring goals. The main thing is being in the right positions and he was.\"\nTaylor Gardner-Hickman also hit the woodwork before finally putting Birmingham ahead with his first goal for the club and Davies afterwards praised the midfielder's versatility.\n\"He was in a slightly different role but I think I've played him pretty much everywhere - the only role Taylor's not played is in goal,\" he said.\n\"He's done every position well and there he is as a left-winger popping up with a goal at the back post.\n\"It's great for Taylor, he's so consistent, and works so hard. He's probably the most versatile player in our squad and one of the most (versatile) I've worked with because he's both-footed, he can run, he can physically compete, he can do a bit of everything.\"\nBirmingham's second was scored by Ethan Laird and Davies added: \"You know at 1-0, there's always jeopardy in the game, there's always a long throw, a long ball, a scrappy equaliser round the corner.\n\"We know how football works so for me, to get that goal was huge because they had very little ambition in the game except to feed off a throw-in or a long ball.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c7vzdy6n4ydo"}