{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 05:50:40", "date_modify": "2025-05-21 05:50:40", "date_publish": "2025-01-14 11:38:22", "description": "Maro Itoje replaces Jamie George as captain while uncapped Cadan Murley and Oscar Beard are named in England's Six Nations squad.", "filename": "sport_rugby-union_articles_c2eg7vxdv2ko_1747806640.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5440/live/4d8c2ae0-d26b-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c2eg7vxdv2ko_1747806640.html", "title": "Six Nations: Maro Itoje named England captain over Jamie George", "title_page": "Six Nations: Maro Itoje named England captain over Jamie George - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Maro Itoje has been promoted to England captain for the Six Nations, replacing Saracens team-mate Jamie George in the role.\nItoje, 30, led England to the Under-20 world title in 2014 but only stepped up to skipper Saracens this season in the wake of Owen Farrell's departure to France.\n\"I'm at a point in my career where I feel ready to give my all to serve the team and the fans with the captaincy, and also produce my best on the field,\" he said.\nHooker George and Bristol prop Ellis Genge will serve as vice-captains in Steve Borthwick's 36-strong squad.\nIn-form number eight Tom Willis is called up but Ben Spencer - who started the autumn as first-choice scrum-half - drops out to make way for Alex Mitchell's return from injury.\nLeicester prop Dan Cole, 37, is also omitted, with his clubmate Joe Heyes and Sale's Asher Opoku-Fordjour brought in as tight-head options.\nBath's Ted Hill is selected with his clubmate Sam Underhill set to have surgery on an ankle injury while Harlequins wing Cadan Murley comes in to replace Immanuel Feyi-Waboso, who is facing the possibility of an operation to fix a shoulder complaint.\nOscar Beard and Fraser Dingwall are the alternative midfield options to the first-choice pairing of Ollie Lawrence and Henry Slade, but there is no place for Alex Lozowski.\nNorthampton's George Furbank is still out with a fractured arm, leaving Leicester's Freddie Steward as the sole specialist full-back, although Saracens' versatile back Elliot Daly and fly-half Marcus Smith are options in that position.\nSale loose-head prop Bevan Rodd, who partners Opoku-Fordjour in the front row at club level, fills the vacancy left by the retired Joe Marler.\n\"I've selected a squad where every player brings something unique to the group,\" said Borthwick.\n\"The Six Nations is always a fiercely contested and exciting tournament, and this year will be no exception.\"\nEngland's Six Nations campaign begins away to defending champions Ireland on 1 February and their tough start continues when they take on France at Twickenham's Allianz Stadium seven days later.\nEngland last won the title in 2020 but have not contended since then and finished third last season.\nBorthwick's side endured a difficult autumn - losing to New Zealand, Australia and South Africa in successive weeks - and in total they won five of their 12 games across 2024.\nEngland's performance in the men's Six Nations will be the backdrop to a vote on the future of the Rugby Football Union chief executive Bill Sweeney, which is set to be held in late March or April.\nAfter captaining England Under-20s, making a seamless transition to the senior side and delivering talismanic performances for club, country and the British & Irish Lions, Itoje has long been heralded as a future England captain.\nHowever, it started to look as if the role might never be his on a permanent basis.\nFarrell, now playing for Racing 92 and ineligible for his country, was England's obvious leader for a long time, while 34-year-old George has handled the role adeptly since he took it on.\nFormer England coach Eddie Jones also questioned in a 2021 book whether Itoje was suited to captaincy, writing that the second row was \"very inward-looking\" and did not \"usually influence people off the field\".\nItoje denied Jones' claim that he had taken acting lessons in order to improve his communication.\nHowever, Itoje has led Saracens, who sit third in the Premiership, impressively this season and, with the Lions touring Australia this summer, he has been handed the chance to prove he can do the same at Test level.\n\"I am incredibly humbled and honoured to have been asked by Steve to be England captain,\" Itoje added.\n\"It's reassuring to know there is a group of senior players to support me and help build on the achievements of Jamie, who has led the team brilliantly and who has been a great friend and leader for so many years.\"\nBorthwick, who paid tribute to the \"outstanding leadership\" of George, believes the second-row forward has the characteristics to excel in his new role.\n\"With 88 England caps, Maro has been a central figure in this squad for many years, bringing a vast amount of experience both on and off the field,\" the coach added.\n\"He's a calm, influential leader, renowned for his commitment to upholding high standards and his ability to motivate those around him.\n\"His strong rapport with the squad and coaches, combined with his leadership experience at Saracens, makes him ideally placed to take on this responsibility.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c2eg7vxdv2ko"}