{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:27", "date_modify": "2025-05-21 08:01:27", "date_publish": "2025-03-28 00:00:00", "description": "Watch live coverage of the women's free skating competition at the World Figure Skating Championships in Boston, USA.", "filename": "sport_live_cd92gqw1q5pt_1747814487.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5358/live/9d0b1a50-0c21-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cd92gqw1q5pt_1747814487.html", "title": "World Figure Skating Championships LIVE: Women's free skating", "title_page": "World Figure Skating Championships LIVE: Women's free skating - watch live stream - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Torvill & Dean hoping to pass mantle to Fear & Gibson\nWhat do you get British skating royalty as a retirement gift when they have been ice dancing together for 50 years? A successor would be nice.\nJayne Torvill and Christopher Dean, who won Olympic gold in 1984 and bronze in 1994, never thought they would be doing a farewell tour in 2025 still waiting for Great Britain to win another global figure skating medal.\nThey are hoping the wait may be nearly over with the emergence of Lilah Fear and Lewis Gibson, who Torvill says have \"taken ice dancing in Great Britain to another level\".\nFear and Gibson are three-time European medallists and have come fourth at the past two World Championships. They head into this week's Worlds - which you can watch on the BBC - among the favourites for the podium in a season where they claimed Britain's first ever medal at the Grand Prix final.\nTorvill and Dean have been following their progress with interest for several years since first meeting them on the ice at Alexandra Palace, when the youngsters asked them to look at the programme they were working on.\n\"We sort of added a few little moves here and there, but I think what struck us right at the beginning was how well matched they were as a team, in stature and personality and ability,\" Dean said.\nRead this article in full here\nHow to get into ice skating\nBBC Sport\nIs it for me?\nIce skating is for anybody and easy to learn, whether you just want a bit of fun with friends or are serious about joining a team.\nThere's figure skating and speed skating - sports you may have seen at the Winter Olympics. But skating doesn't have to be competitive. You can put on a pair of skates (which you can hire at rinks) and start gliding across the ice. It's best to make sure you can skate in a straight line before you attempt jumps and turns.\nWhat to expect when I get there?\nIf you haven't skated before, you might be scared of taking a fall on the ice. But don't worry, most people will take a tumble at some point and you'll be surprised at how quickly your balance will improve.\nThere's an emphasis on quick foot movement and supple knees, so you'll also improve your flexibility.\nThe focus on lower-body movement will help build leg muscles.\nConcentration is key, so ice skating can be mentally stimulating.\nYou can start young - Skate Tots, external is a training programme for pre-school children to enjoy.\nInclusive Skating, external is an organisation that is striving to make ice skating accessible, and they have devised a scoring system that allows disadvantaged skaters to compete alongside able-bodied competitors.", "url": "https://www.bbc.com/sport/live/cd92gqw1q5pt"}