{"authors": ["Will Faulks", "www.facebook.com"], "date_download": "2025-05-21 07:36:14", "date_modify": "2025-05-21 07:36:14", "date_publish": "2025-05-20 15:46:06", "description": "Chelsea news: Opinion - Can Enzo Maresca's team cope with 'immense pressure'?", "filename": "sport_football_articles_cn9j1qz1535o_1747812974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e6b/live/e7ef49b0-b628-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn9j1qz1535o_1747812974.html", "title": "Opinion - Can Enzo Maresca's team cope with 'immense pressure'? - BBC Sport", "title_page": "Chelsea news: Opinion - Can Enzo Maresca's team cope with 'immense pressure'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "So, it has come down to this.\nAfter a season of back and forth, during which Chelsea have been both in a title race and in relegation form, one game will decide whether the campaign was a success.\nManager Enzo Maresca might dispute that, and perhaps the club's owners and sporting directors would too. But there is no denying that after three years in charge, and the colossal sums of money spent on transfer fees in that time, finishing lower than fifth in the league could not be seen as anything other than a failure for Chelsea.\nIt is an exciting way to end an unpredictable season. In recent years, most of the Blues' campaigns have petered out in February or soon after. This year, the action continues right up to the final moment.\nAnd it is not going to be easy. Nottingham Forest's astonishing form has faltered, but with everything on the line and a home crowd who have waited decades for a game of this magnitude, the pressure on Chelsea's players is going to be huge.\nThis group of players faltered in similar conditions at St James' Park a couple of weeks ago. Yes, it was Nicolas Jackson's red card in that game which really killed them, but the problems were there from the first minute.\nMaresca's team went out looking miles off the levels of confidence and intensity they needed to get a result there, red card or not.\nChelsea fans will be hoping that the coach has changed something since then. Their team has the talent to win this game, but the question mark is over whether they have the mindset.\nAs much as anything tactical, this week on the training pitch will be spent trying to prepare the group mentally for the immense pressure of a game with so much riding on it.", "url": "https://www.bbc.com/sport/football/articles/cn9j1qz1535o"}