{"authors": ["Ceri Coleman-Phillips", "www.facebook.com"], "date_download": "2025-05-21 06:52:48", "date_modify": "2025-05-21 06:52:48", "date_publish": "2025-03-29 18:43:14", "description": "England may have put a different team out but the result was still the same as the Red Roses ran in 11 tries against Wales in front of a record crowd.", "filename": "sport_rugby-union_articles_c3w1wgvq36do_1747810368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c587/live/4d9b0350-0cd4-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c3w1wgvq36do_1747810368.html", "title": "Wales 12-67 England: Red Roses dominate at Principality Stadium with 11 tries", "title_page": "Wales 12-67 England: Red Roses dominate at Principality Stadium with 11 tries - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England may have fielded a different team but the Red Roses still dominated as they ran in 11 tries against Wales in front of a record crowd of over 21,000.\nEngland head coach John Mitchell made 13 changes to his starting XV, including world player of the year Ellie Kildunne who celebrated her 50th cap with a hat-trick.\nWales got off to a dream start with Jenni Scoble crossing to light up the Principality Stadium.\nBut after the first 10 minutes England showed their class, scoring through every facet of play as they remain on course for a seventh consecutive Six Nations title and a fourth consecutive Grand Slam.\nThere were poignant tries for debutant Abi Burton, who fought back from an induced coma in 2022, and Wales-born Meg Jones, who was playing her first Red Roses game since her parents passed away.\nEngland skipper Zoe Aldcroft and number eight Maddie Feaunati were the only players retained from the win over Italy last weekend, with Feaunati bagging two tries of her own.\nWales, in contrast, made only minor changes, bringing in Gwenllian Pyrs and Gwen Crabb as new head coach Sean Lynn looked for consistency in just his second game in charge.\nThe hosts had not tasted victory over England since 2015, but backed by the biggest ever crowd for a Wales women's team event in Wales (21,186), they got off to a bright start.\nThey asserted early pressure, going through the phases and stretching the defence. Carys Cox had a sniff of the tryline on her wing, but was well marshalled by Kildunne.\nWales kept asking questions but their attack was thwarted by a superb Sadia Kabeya turnover. It should have been an easy clearance for Zoe Harrison, but she knocked on behind her own line and gifted Wales a 5m scrum.\nIt proved costly as Georgia Evans picked up from the base and drove to within inches of the line, with Scoble quick to recycle and crash over.\nTrue to form, England did not take long to respond. Abby Dow, returning after breaking her hand, put a kick through which put the covering Lisa Neumann under pressure. Feaunati took the line-out ball before handing off Abbie Fleming and charging to the line.\nThe second try fell to Cardiff-born Jones, who scooped up a loose ball in the midfield before beating three defenders on her way to score.\nSarah Bern was in shortly after, England had overthrown the line-out but managed to retain possession and nice hands from Feaunati put the prop in under the posts.\nThe bonus-point was wrapped up before the break when England drove Wales off the scrum and the ball came out to Breach, who fed Feaunati in the corner.\nLynn made half-time changes, bringing on Donna Rose and Kelsey Jones in the front row in a bid to compete more in the physical battle.\nAnd the team talk looked to have inspired as Wales once again started the half brightly, but England gave a lesson on how to be clinical as the tries came raining down in Cardiff.\nThe pick was the first from Kildunne, who latched on to a looping ball out wide from Harrison to cross in the corner.\nShe was back in on the opposite corner five minutes later before dotting down for her hat-trick. She left the field to rapturous applause before being deservedly named player of the match.\nA chance then fell to Wales who showed the fight and passion that Lynn had asked for all week. Despite being shoved off their own scrum, the ball came out to Cox who managed to offload to Kate Williams, crossing to give the home crowd something to cheer.\nThe final 10 minutes became the Abi show, with Dow and Burton both crossing for two tries apiece as Wales looked in danger of a record loss to their rivals.\nBut the whistle went to spare Wales as they continue to build under new management.\nWales head coach Sean Lynn said: \"We have to remember we're playing against the best team in the world.\n\"We have to get better, every game we've got to be getting better. We've got France, Ireland and Italy left, and we've got to keep getting better and better. Simple.\n\"I was asking them 'how hard are they willing to fight for each other' and they certainly showed they could today.\"\nEngland head coach John Mitchell said: \"We didn't start particularly well, but we grew into the second half and built some good pressure.\n\"I'm really glad the way we responded to what Wales did to us.\n\"I think we're a side that can't afford to get bored with the basics, because when our basics are poor that lets us down and brings the opposition into the game.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c3w1wgvq36do"}