{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 11:38:26", "date_modify": "2025-05-20 11:38:26", "date_publish": "2023-08-06 21:02:31", "description": "Ellie Challis wins her sixth medal as Great Britain shine on the final day of the Para Swimming World Championships.", "filename": "sport_disability-sport_66422621_1747741106.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1564B/production/_130672678_gettyimages-1596866073.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66422621_1747741106.html", "title": "Para Swimming World Championships: Ellie Challis wins sixth medal as Britain finish strongly", "title_page": "Para Swimming World Championships: Ellie Challis wins sixth medal as Britain finish strongly - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Great Britain claimed three silvers and a bronze to finish the Para Swimming World Championships in Manchester on a positive note.\nEllie Challis won her sixth medal from six events, finishing second in the S3 100m freestyle.\nPoppy Maskill and Bethany Firth took silver and bronze in the S14 100m butterfly to add to their hauls.\nAnd there was a second medal of the week for Suzanna Hext who claimed silver in the S5 100m freestyle.\nIt means the hosts finish in fifth place in the medal table on 38 medals, including 14 golds, with Italy top for the third World Championships in a row with 26 golds, ahead of Ukraine and China.\n\"I didn't expect to win six medals and I have shocked myself,\" said Challis, 19, who ended the competition with three golds, two silvers and a bronze.\n\"I was just trying to go as quickly as I could on that second length but I had nothing more to give on that last 25 metres.\n\"It has been a long week but I am happy with how it has gone and it gives me good momentum going into Paris next year.\"\nMaskill, 18, was edged out for gold by 0.02 seconds in her final by Yui Lam Chan of Hong Kong China, with Northern Ireland's Firth a further 0.28secs back.\nIt was a fifth medal of the week for Maskill - three individual and two relay - and a fourth for Firth.\nHext, who won 50m freestyle gold on Monday, two days after coming out of hospital, found Monica Boggioni too strong in the 100m event with the Italian finishing 1.43secs clear.\n\"Obviously I'm over the moon with how I've swam this week just off the back of everything I've been through recently,\" she said.\n\"If someone said I'd win a gold and a silver medal a week ago I wouldn't have believed them, so just to come away and have the most amazing week amongst team-mates and enjoy myself has been really incredible.\"\nBritish Para Swimming head coach Rob Aubry said the competition had been an important event for his team with just over a year to go to the Paris Paralympics.\n\"This event is a stepping stone for next season and have been a great learning opportunity,\" he told BBC Sport.\n\"It has been a proving ground for some of our athletes and a chance to make some mistakes and now be able to reflect and analyse and move on.\n\"But it has also allowed us to see other nations like China and the athletes that are coming through for them.\n\"We've got some senior athletes still pulling out some great performances, but it is really exciting to see our next generation coming through and pushing for those places but also being supported by those senior athletes as well.\"", "url": "https://www.bbc.com/sport/disability-sport/66422621"}