{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 05:27:34", "date_modify": "2025-05-21 05:27:34", "date_publish": "2025-04-03 11:11:52", "description": "Crystal Palace Q&A: Who might leave this summer?", "filename": "sport_football_articles_cgjl7529z26o_1747805254.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05fa/live/fd9c18a0-0fdd-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgjl7529z26o_1747805254.html", "title": "Crystal Palace Q&A: Who might leave this summer?", "title_page": "Crystal Palace Q&A: Who might leave this summer? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In part two of a special three-part Q&A, BBC Sport football news reporter Alex Howell looks at the worries some have about the club losing prize assets in the summer.\nJim asked: Do you think winning the FA Cup or finishing in a European place would be enough to stop some of the players leaving?\nAlex: It depends at what level of European football that is. The Conference League is probably not enough to stop a player like Marc Guehi leaving the club. Jean-Philippe Mateta wants to play European football to boost his chances of being in the France squad for the World Cup and, at the very least, he would want and need Europa League football for that.\nAlan asked: Crystal Palace and Dougie Freedman, in particular, have done a fantastic job in building a squad of talented players like Dean Henderson, Daniel Munoz, Maxence Lacroix, Guehi, Adam Wharton, Eberechi Eze and Mateta - but how many players are they realistically expecting to lose this summer? Also, what impact will Dougie Freedman's departure have on finding the right quality replacements?\nAlex: I agree the quality pool of players that Freedman and the recruitment team have put together should be applauded. I did a piece at the end of the summer transfer window about how Palace could be the surprise package of the season after the window and I was really doubting that prediction after the first 10 league games.\nAs I said above, Mateta wants to get into France's World Cup squad. Guehi is in his last year of his contract in the summer so it is the only chance for Palace to get money for him unless he signs a new deal. There are two very possible departures.\nEberechi Eze' release clause kicks in again this summer so that is another potential and the club were willing to negotiate underneath the number needed last year.\nI think because of his injuries, Palace will get another year out of Wharton.\nBut it is likely to be a busy summer.", "url": "https://www.bbc.com/sport/football/articles/cgjl7529z26o"}