{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 12:25:12", "date_modify": "2025-05-20 12:25:12", "date_publish": "2023-08-04 12:24:15", "description": "Birmingham City boss John Eustace admits it is exciting times ahead following the Tom Wagner/Tom Brady investment in Blues.", "filename": "sport_football_66373925_1747743912.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C30E/production/_130643994_je.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66373925_1747743912.html", "title": "Birmingham City: Blues boss John Eustace keeps Blues calm after Tom Brady frenzy", "title_page": "Birmingham City: Blues boss John Eustace keeps Blues calm after Tom Brady frenzy - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "John Eustace has just about seen it all in his 13 months as Birmingham City head coach.\nAside from the joy of the 14 league wins and the despair of the 23 defeats (nine of them in two months post-Christmas), there have been two failed takeovers, one successful one by Tom Wagner, a suspended points deduction, a training ground fire, the departure of Troy Deeney, the death of a Blues legend Trevor Francis - and now the arrival of global sporting superstar Tom Brady.\nIt's a lot to handle - but really it's all par for the course of being the Blues boss, who knows that ending City's 12-year occupation of the Championship, as the second tier's current longest survivors, may not necessarily be a quick fix.\n\"I didn't come in with my eyes closed,\" Eustace told BBC Sport. \"I knew there were going to be some real challenging times but we got through it.\n\"And whatever challenges we now have ahead, I'm willing to roll up my sleeves and keep working at it - and eventually this football club will fly again.\n\"The new owners want to make this club a world brand. They want everyone talking about Birmingham City.\n\"And it's a real statement of intent from the club to get Tom Brady, to bring in somebody of that ilk, one of the most famous sports people in the world. For him to be associated with us is very exciting.\n\"But there is still a lot of hard work to be done in the short term on the pitch to make sure we do become successful.\n\"Everything going on off the field is very exciting, but that's all long term.\n\"The short term is about stabilising the club and making sure we're competitive week in, week out in the Championship, so then we can all grow together.\n\"We're still very tight on the budget. We've let 14 go and brought nine in and we're still under FFP (Financial Fair Play) restrictions.\"\nWhat Blues have been through since Eustace took charge in July 2022 is still, in fact, just a microcosm of what the club have gone through over the past two decades. And just how far do you go back when you examine Blues' past?\nThe three successive cruel play-off failures under Francis, followed by his sacking in 2001 - and Steve Bruce coming in to take the team his predecessor had built up just six months later, followed by four seasons in the top flight - and then another when Bruce got them straight back up there again in 2007 following relegation, followed by another 'straight back down and straight back up' under Alex McLeish?\nBlues' new ownership under Carson Yeung who was later jailed for money laundering in 2014? Or the club's third and most recent relegation from the Premier League in 2011, the year they became the last Midlands team to win a trophy,, external the League Cup final victory over Arsenal at Wembley?\nThe failure to get straight back up again when, under Chris Hughton, they lost in the 2012 play-off semi-final to Ian Holloway's Blackpool?\nOr the decision of the second of Blues' Chinese owners to sack Gary Rowett and replace him with a more eye-catching name in Gianfranco Zola in December 2016 when Blues were seventh - and outside the second tier play-offs only on goal difference?\nWithout even going into the subsequent years Blues have since spent under close English Football League scrutiny, becoming the first club hit by the EFL's profitability and sustainability regulations when they suffered a nine-point deduction in 2019, Eustace knows all that history.\nEustace is a lifelong Blues fan, who built his knowledge of management by working in his playing days at Coventry, Watford, Stoke and Derby under strong influences of the calibre of Gordon Strachan, Gary McAllister, Malky Mackay, Tony Pulis, Sean Dyche and Steve McClaren as a player, before honing his skills, first as boss of non-league Kidderminster Harriers, then as number two to first McClaren, then Mark Warburton at Queens Park Rangers.\nThe new owners are already well aware of the job he did last season, not only keeping Blues in the Championship to start this 13th straight campaign at second tier level, but actually managing to get the disillusioned fans realigned with the players.\nIt helps that Blues have a healthy of exciting young talent coming though, all hoping to be the next Jude Bellingham, of Real Madrid, via Borussia Dortmund, or even Jobe Bellingham, now at Sunderland.\nBut Eustace is well aware that his job is a long way from being done. And, although it remains to be seen whether there will be any additions to a thinned squad before the close of the summer transfer window on 1 September, he knows full well that his work is still \"in progress\".\n\"I'm a Birmingham lad,\" Eustace said. \"I'm from Birmingham.\n\"A lot of my family and friends are Birmingham City fans. And, just to be part of this great club is something I'm very proud of.\n\"I said when I came in that I want to build this club. I don't want to be here short term. I'm very committed to the club.\n\"We've now got great owners - and I want to be part of the club going forward. This is a long-term project. I still expect difficult times ahead but, if we stick together, we can get there.\n\"What's going on now is brilliant, but those fans were right behind us last season too, during some difficult moments.\n\"The performances last season - and getting that connection between players and fans - gave the place a real buzz.\"\nNo better illustrated, ahead of Saturday's campaign opener at Swansea, than last season's trip to West Wales in February when, roared on by their travelling fans, Blues struck twice in injury time to win 4-3 and end a run of five straight losses.\nOn 12 August it will be time to welcome new owner Wagner for the first home game of the season against Leeds United in front of a reduced capacity crowd - and Eustace is as excited as anyone about all that.\n\"Going to St Andrew's is still a very hostile place to go, even more so when it's full,\" he said. \"The fans give fantastic support.\n\"And, when the work being down at the ground is complete, to get that place full and rocking again will be very special.\"\nAnalysis - BBC Radio WM sports editor Richard Wilford\nNew ownership has brought fresh optimism to St Andrew's, with American Tom Wagner and his Knighthead group in control - and now the added excitement of a global superstar like Tom Brady, the NFL's GOAT, getting on board too.\nThe lingering stadium repairs are also close to completion. Full capacity is set to be restored by the end of November, a factor that could be a significant boost to Blues' home form.\nTechnical director Craig Gardner has again operated within a tight budget to replenish the squad, with the excesses of the previous owners still being felt when it comes to Financial Fair Play.\nFull-backs Ethan Laird and Lee Buchanan feel like an upgrade and the permanent signing of loanees Dion Sanderson and Krystian Bielik give John Eustace's side a solid spine, while Tyler Roberts and Siriki Dembele add to the attacking threat.\nJapanese attacking midfielder Koji Miyoshi is something of a wildcard, while talented teenager George Hall had a breakout season last time out and could just be the most gifted player in the group.\nExpectations may need to be calmed initially. Another season of Championship safety remains the main on-field priority while all the off-field adjustments are made to rejuvenate the club and re-engage supporters.", "url": "https://www.bbc.com/sport/football/66373925"}