{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:00:39", "date_modify": "2025-05-21 04:00:39", "date_publish": "2025-01-15 09:56:48", "description": "Colchester United goalkeeper Matt Macey accepts \"full responsibility\" after defeat by Cheltenham ends their hopes of reaching the EFL Trophy quarter-finals.", "filename": "sport_football_articles_cgkjxjmxyl4o_1747800039.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/da3f/live/3108a160-d323-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgkjxjmxyl4o_1747800039.html", "title": "Matt Macey: Colchester keeper shoulders blame for EFL Trophy exit", "title_page": "Matt Macey: Colchester keeper shoulders blame for EFL Trophy exit - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colchester United goalkeeper Matt Macey accepted \"full responsibility\" for both goals conceded after defeat by Cheltenham ended their hopes of reaching the EFL Trophy quarter-finals.\nMacey was beaten by Tom Pett's early shot and after Lyle Taylor levelled just before half-time, he was beaten again in added time at the end of the game as the home side won 2-1.\n\"It's a really tough one to take because that's down to my two mistakes,\" Macey told BBC Essex Sport.\n\"It's completely unacceptable to make mistakes like that at this level, we should have won the game 1-0 and be in the next round.\"\nMacey joined Colchester in the summer after leaving Portsmouth and was making his 29th appearance of the season - with clean sheets in 10 of his previous games.\n\"It was black and white. Sometimes it's not as clear-cut and there's (other) factors involved but they scored two goals from nothing and other than that I wasn't overly worked, apart from one header.\n\"It's simple, two clear mistakes from me and all I can do is apologise to everyone involved, the fans coming all this way - they were magnificent as they always are, and all I can do is get my head down and try to rectify it on Saturday.\"", "url": "https://www.bbc.com/sport/football/articles/cgkjxjmxyl4o"}