{"authors": ["James Jones", "www.facebook.com"], "date_download": "2025-04-26 04:06:09", "date_modify": "2025-04-26 04:06:09", "date_publish": "2025-03-03 17:02:48", "description": "West Ham news: Opinion - Fan writer marks Tomas Soucek as a Hammers legend", "filename": "sport_football_articles_c0rz1y8jlw2o_1745640369.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0c2/live/79c50fe0-b62f-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c0rz1y8jlw2o_1745640369.html", "title": "West Ham news: Opinion", "title_page": "West Ham news: Opinion - Fan writer marks Tomas Soucek as a Hammers legend - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When David Moyes left, there were some players many thought would not survive a new manager looking to play a more attractive style of football.\nTomas Soucek was one. His success under Moyes was largely due to his ability to do all the dirty work in midfield, as well as being a crucial part of the team in both boxes. Defensively, he puts his body on the line to block shots while in attack he perfected the art of arriving into the box late. One of the best aerial threats in the Premier League, he was unattractive to watch, but hugely effective.\nJulen Lopetegui tried to create a midfield that did not include Soucek and at first, it appeared our assumptions were right. Surely the Czech international cannot and will not be able to perform in a more possession-based system. But it soon became clear that there's more to his game than anyone gave him credit for.\nEvery time he was dropped, West Ham looked disjointed in midfield. Whenever he was introduced off the bench, the team instantly looked more organised and effective.\nNow, with Graham Potter in charge, we are seeing Soucek restored as a vital player in West Ham's midfield.\nLast Thursday, he scored his 38th goal in claret and blue, his 50th goal contribution for the Hammers in 235 first-team appearances.\nSince signing in January 2020, he has averaged a goal contribution every 4.7 games. As a holding midfielder, that is a remarkable record for someone whose primary job is not to score or create goals.\nWe always knew how good Soucek was in a defensive system, but this season we have discovered that he is much more rounded. Also, he is loved by the fans not just because of his success since joining the club, but also because he epitomises what it means to play for West Ham United. There are not many players left like him.\nThat is why he should be regarded as a West Ham legend at this stage.\nIt is not even up for debate.", "url": "https://www.bbc.co.uk/sport/football/articles/c0rz1y8jlw2o"}