{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 07:55:29", "date_modify": "2025-05-21 07:55:29", "date_publish": "2025-03-27 14:33:23", "description": "Nuno Espirito Santo press conference: Brighton vs Nottingham Forest", "filename": "sport_football_articles_cz7v42dg83vo_1747814129.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e1af/live/755718e0-4923-11ef-96a8-e710c6bfc866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz7v42dg83vo_1747814129.html", "title": "Nuno Espirito Santo press conference: Brighton vs Nottingham Forest", "title_page": "Nuno Espirito Santo press conference: Brighton vs Nottingham Forest - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Striker Chris Wood will miss the match after going to see a specialist for a scan on a hip injury picked up during the international break. Nuno confirmed they will \"wait on information\" to understand the extent of the issue.\nWith the majority of players arriving back from international duty on Thursday, the club still have to assess everyone to see who will be available.\nOn Murillo needing support from fans after a difficult international debut for Brazil: \"We work together today. This is the game - he should be proud. It is not easy to achieve to play for Brazil with all the quality they have. Murillo joined us last season and he has been rising and achieving things as an individual. One of those is to play for Brazil. We are very proud.\"\nDespite not playing any minutes for England after his call-up, Nuno said Morgan Gibbs-White is a \"is a top, top player with so much talent and quality\" and the forward \"doesn't have to prove anybody wrong\": \"This is not the state of mind you should have. [Gibbs-White] needs to play and compete for us and his team-mates and give everything he has for Forest. The other things will come naturally.\"\nOn what individual awards mean after being nominated for the Premier League manager of the month award: \"That the group is working well. Not only the players, but the staff, the club, the fans, everybody who is involved with Forest. This a nomination for everybody.\"\nOn the possibility of reaching Forest's first FA Cup semi-final since 1991: \"We are aware we are going to face a very difficult opponent. What comes after, we will see. We love the cup. We will give everything we can to achieve what our fans expect and desire.\"\nThe Forest boss said \"the big issue still remains\" after the Premier League confirmed the dates for the summer transfer window. He believes it should close before competitive football returns in August: \"The window will still be open when the competition of the Premier League starts, so that battle is not won. What I believe is better for the competition is the moment it starts, the window should be closed.\"\nHe added: \"Yes, that [early window opening] is definitely a distraction - it is not normal. We need to focus on how we are going to recruit as soon as possible so we can start working better.\"", "url": "https://www.bbc.com/sport/football/articles/cz7v42dg83vo"}