{"authors": ["Celestine Karoney", "www.facebook.com"], "date_download": "2025-05-20 15:04:45", "date_modify": "2025-05-20 15:04:45", "date_publish": "2023-07-27 10:18:07", "description": "South Africa's pioneering coach Desiree Ellis on the growth of women's football and leading her nation at a second World Cup.", "filename": "sport_africa_66306626_1747753485.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AA02/production/_130522534_ellisafconmedal-1242155430-1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_africa_66306626_1747753485.html", "title": "Women's World Cup 2023: 'Beyond my imagination' - Desiree Ellis' post-apartheid journey", "title_page": "Women's World Cup 2023: 'Beyond my imagination' - Desiree Ellis' post-apartheid journey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "She's a long-standing icon of African women's football but even so, South Africa coach Desiree Ellis says her journey to a second Women's World Cup is beyond her wildest imagination.\nThirty years after playing in her country's first women's international, Ellis is now guiding the current generation from the touchline, just as she did four years ago at the World Cup in France.\nShe says a lot has changed in those three decades.\n\"It was tears on 30 May, which was 30 years. Some of us were reminiscing about the early days,\" Ellis told BBC Sport Africa before heading to this year's tournament in Australia and New Zealand with her 'Banyana Banyana' squad, a nickname which means 'girls'.\n\"Back in the day, the national team 90% was unemployed. Three of us had jobs and two of us, including myself, lost our jobs playing for the national team.\n\"Now, 99% have degrees, some are playing abroad. It's changed completely for the better.\"\nThere were also tears following South Africa's World Cup opener against Sweden in Wellington on Sunday.\nDespite taking an early lead, Banyana were beaten 2-1 after a 90th-minute winner for their opponents, who sit third in organiser Fifa's world rankings.\n\"To concede at the end was a bit cruel, but that's football,\" said Ellis afterwards.\n\"We're proud of the way we played.\"\nThe result puts extra pressure on Friday's second Group G fixture against Argentina in Dunedin.\nSixty-year-old Ellis is undoubtedly a trailblazer for women's football.\nShe has been in her current role since 2016, initially taking the reins as an interim coach following the departure of Vera Pauw, who is now leading Ireland at the World Cup, after a disappointing showing at the Rio Olympics.\nAfter being given the job full-time in 2018, Ellis helped South Africa qualify for their maiden World Cup - but she was not sure she would last this long, particularly given a run of 13 consecutive games without a win between December 2018 and July 2019.\n\"I thought I was going to be fired,\" Ellis recalls, \"when we didn't qualify for the [2020] Olympics and lost to Botswana.\n\"But God had other plans for me.\"\nOf the 32 coaches at this newly expanded World Cup, Ellis is one of 12 women - and the only female head coach in charge of one of Africa's four representatives.\n\"[I'm] really excited that there's more female coaches, not just myself. That is opportunities given by the federations,\" says Ellis.\n\"Cosafa (Southern Africa Football Association) have a mandate where there have got to be female coaches and a certain amount of female representatives on the bench. And they're really setting the trend for that.\n\"Maybe this needs to go on the continent [Africa]. It's about being given the opportunity but even more getting the support.\"\nAs a player, Ellis' career started as a midfielder in Cape Town in the 1970s - a time when women in the country were not encouraged to take up sport.\n\"I was told that I wanted to be a boy because I wanted to play football,\" Ellis remembers.\n\"I had the support of my late father and the rest of my family and that really helped.\n\"Sometimes my uncle would go to a game and I'd go with him and have my boots in a bag in case I got to play.\"\nThose early years of Ellis' career were also a difficult time politically for South Africa which was then operating under apartheid rule - a system that enforced a racial hierarchy privileging white people.\nDespite the difficulties it caused, her passion for the game never wavered.\n\"At times, when we travelled with provincial teams, they would allow us to go into a caravan park.\n\"When they saw the group of players coming in, they would all of a sudden change their minds and say, 'sorry, the place is full'. All we wanted to do was play.\"\nAs African champions, Banyana have set a target of reaching the second round in Australia and New Zealand.\nAt 54th in the world, they are the lowest-ranked team in Group G - and Friday's opponents Argentina sit 26 places above them.\nNeither side has ever won a game at a World Cup, meaning the fixture is likely to be crucial to any hopes of reaching the last 16.\n\"Getting positive results and getting out of the group stage would be huge,\" says Ellis, remaining as level-headed as ever.\n\"Nothing is impossible but you also have to be realistic.\"\nThirty years on from her role in the birth of women's international football in South Africa, Desiree Ellis is on the verge of yet another historic achievement.", "url": "https://www.bbc.com/sport/africa/66306626"}