{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:20:23", "date_modify": "2025-05-21 05:20:23", "date_publish": "2025-01-31 22:46:58", "description": "Oxford United sign Everton winger Stanley Mills for an undisclosed fee.", "filename": "sport_football_articles_cdxew7n6nldo_1747804823.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/012a/live/d7751d90-e010-11ef-8992-59cb2eb4d7c4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxew7n6nldo_1747804823.html", "title": "Stanley Mills: Oxford United sign Everton youngster for undisclosed fee", "title_page": "Stanley Mills: Oxford United sign Everton youngster for undisclosed fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oxford United have signed Everton winger Stanley Mills for an undisclosed fee.\nThe 21-year-old spent the first half of last season on loan at the U's before a serious knee injury forced him to return to the Premier League side.\nHe made 21 appearances for Oxford in their promotion-winning season, scoring once.\nMills, who is the son of former England full-back Danny, joined Everton in 2018 having been at Leeds United's academy.\nHis two substitute appearances in the Carabao Cup in 2022 were his only first-team experience at Everton.\nOxford have not disclosed the length of contract Mills has agreed with the Championship side.\n\"Oxford United is like a home to me,\" Mills told the club website.\n\"I feel my business here at the club is unfinished. I had the most enjoyable period in my career here last season. Now, I want to pick up where I left off and keep bringing success.\"\nOxford United head coach Gary Rowett added: \"Stan is somebody who was presented to me early on.\n\"Everyone within the club has spoken incredibly highly of Stan as a player, but more importantly as a person. When the chance arrived to sign him permanently, it was one we wanted to take.\n\"What I enjoy about watching Stan is that he is confident playing on both sides of the pitch. He is as comfortable cutting in from the left on his right foot as he is driving down the right to get crosses into the box.\"", "url": "https://www.bbc.com/sport/football/articles/cdxew7n6nldo"}