{"authors": ["Alasdair Lamont", "www.facebook.com"], "date_download": "2025-04-26 03:40:27", "date_modify": "2025-04-26 03:40:27", "date_publish": "2025-03-05 10:06:45", "description": "'Can a Rangers side at lowest ebb transform themselves again in Europe?'", "filename": "sport_articles_c0q18vp5895o_1745638827.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ddf5/live/a8200f30-f9a8-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c0q18vp5895o_1745638827.html", "title": "'Can a Rangers side at lowest ebb transform themselves again in Europe?'", "title_page": "'Can a Rangers side at lowest ebb transform themselves again in Europe?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Europa League and Rangers' performances in it arguably kept Philippe Clement in his role as manager considerably longer than otherwise would have been the case. And now Barry Ferguson must be hoping the players will continue to raise their game for the challenge of European football.\nCertainly the performance turned in against Motherwell was of a similar ilk to the type of display shown all too often under the Belgian, but the question now is whether those same players can continue to transform themselves into an unrecognisable outfit on the European stage.\nDefensively, Rangers look as weak as they have all season and desperately need Leon Balogun and John Souttar available, while Ridvan Yilmaz looks a safer bet than Jefte right now. The jitters even seem to have got to Jack Butland in recent weeks.\nWith nothing to play for domestically, the thought of the European run also coming to a halt must be too much to bear for Rangers supporters right now.\nThursday's meeting with Jose Mourinho's Fenerbahce is not their toughest assignment of the season, but Rangers might be at their lowest ebb yet and will have to rouse themselves perhaps like never before.\nThe players' mentality and desire has been questioned repeatedly this season, with good cause, but they have an opportunity for at least partial redemption if they can record another impressive European result and give themselves a chance of reaching the quarter-final next week.", "url": "https://www.bbc.co.uk/sport/articles/c0q18vp5895o"}