{"authors": ["Mark Mitchener", "www.facebook.com"], "date_download": "2025-04-26 03:50:21", "date_modify": "2025-04-26 03:50:21", "date_publish": "2025-03-05 12:48:06", "description": "Bournemouth news: Opinion - Tyler Adams' impact for the Cherries", "filename": "sport_football_articles_ckg8dwx0ej5o_1745639421.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f341/live/53a1e480-4835-11ef-b74c-bb483a802c97.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckg8dwx0ej5o_1745639421.html", "title": "Opinion - Tyler Adams' impact for the Cherries - BBC Sport", "title_page": "Bournemouth news: Opinion - Tyler Adams' impact for the Cherries - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Tyler Adams keeps being mentioned by Bournemouth fans on this page, so why is the midfielder a topic worth discussing?\nAdams is fast becoming one of the most integral members of Andoni Iraola's squad. It cannot be coincidence the Cherries have improved since the American has put a solid run of games together, having been restricted by injuries in his first 14 months at Vitality Stadium.\nDefensive midfield is probably the least glamorous role in football. Forwards take the headlines, make the most money and command the largest transfer fees. Wingers get fans on their feet with a run down the touchline. Defenders and goalkeepers take the applause for a last-ditch, goal-saving tackle or brilliant save.\nBut in successful sides, the defensive midfielder (or \"DM) is often the player who makes the team tick. The drummer who keeps the band at a steady tempo. The veteran forward who locks the scrum together. The accurate seam bowler who \"holds an end\" – ex-England captain Michael Vaughan described Matthew Hoggard's role from his 2005 Ashes-winning attack as \"sweeping the shop floor\". A thankless task, but a vital one.\nThe DM never attracts – or seeks – the glory enjoyed by others. When another Bournemouth win invariably generates another round of (largely spurious) transfer gossip, it is always the same names involved: Milos Kerkez. Antoine Semenyo. Dean Huijsen. Illia Zabarnyi. Justin Kluivert.\nBut while Adams may not generate the column inches, his absence is hugely felt when unavailable. Having started the league game with Wolves on the bench because of illness, Adams was introduced on the hour (with the Cherries already down to 10 men) and quickly galvanised his side as they searched for an equaliser. With Iraola's gung-ho substitutions leaving him having to play pretty much on his own in central midfield, he held the line.\nA week later, playing 11 v 11 against the same opposition, Adams was in his element with another display full of tackles and interceptions as Bournemouth dominated Wolves and drove them backwards for most of the game, despite needing penalties to finish them off.\nEvery team needs a solid DM. Think of Nobby Stiles for England in 1966. Or Didier Deschamps, famously dubbed a \"water carrier\" by Eric Cantona, skippering France to back-to-back tournament wins in 1998 and 2000.\nAnd back at Bournemouth, in 2014-15, one of the fans' fondest-remembered seasons which ended with the Championship trophy, who was chosen as the players' player of the year? Andrew Surman – the defensive midfielder.\nAs for Adams, Iraola summed up his contribution well in a recent BBC Radio Solent interview, explaining: \"He eats the space. He's very fast to cover the ground for the second ball, and he smells the danger.\"\nWhile disruption remains his primary duty, Adams has contributed going forward too – becoming the first American to record three Premier League assists in the space of two matches (against Newcastle and Nottingham Forest in January).\nHaving skippered the USA team at the Qatar World Cup in 2022, despite losing the national armband to Christian Pulisic since then, the Cherries will hope that their very own \"Captain America\" can help Iraola's team of superheroes make more history this Marvel-lous season.", "url": "https://www.bbc.co.uk/sport/football/articles/ckg8dwx0ej5o"}