{"authors": ["Jamie Lyall & Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 05:20:34", "date_modify": "2025-05-21 05:20:34", "date_publish": "2025-04-03 13:10:32", "description": "Simo Valakari is determined to rebuild St Johnstone after their 16-year Scottish Premiership tenure ends.", "filename": "sport_football_articles_c934766v291o_1747804834.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fdf/live/6845d060-3117-11f0-8947-7d6241f9fce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c934766v291o_1747804834.html", "title": "St Johnstone: Simo Valakari wants to lead 'beautiful' Perth club back up after relegation", "title_page": "St Johnstone: Simo Valakari wants to lead 'beautiful' Perth club back up after relegation - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "St Johnstone have been mainstays of the Scottish Premiership since 2009 – but their 16-year top-flight residence is over.\nDefeat by Hearts in the penultimate game of the season - while Ross County salvaged a last-gasp point at Dens Park - sealed their fate.\nManager Simo Valakari, appointed in October with St Johnstone sitting 10th, has vowed to fight on and announced his intent to lead next season's promotion push.\n\"I want to stay,\" he told BBC Scotland. \"I want to rebuild this club and be successful with this club.\"\nThe Finn has been praised for trying to produce a team playing better football and acknowledged \"big changes\" are required.\n\"We are crying tonight and tomorrow but always looking forward,\" he added. \"This season is history. We need to change things and get this beautiful club back to winning ways.\n\"It's hard to play in relegation battles but it's even harder to play for promotion. That's what our aim is and that's what we start doing the day after tomorrow.\n\"We have already started preparing.\"\nUltimately, it took too long for Valakari's brand of football to be reflected in an upturn of results, though St Johnstone did beat champions Celtic and reach the Scottish Cup semi-finals.\nBut the numbers have long been stacked against them, and you don't have to delve too deeply to see they've been struggling for a while.\nFor former St Johnstone midfielder, Murray Davidson, their troubles have been \"building for years\".\nSo, how did St Johnstone get into this mess?\nWhile the finger is usually pointed at the manager – and he does have to shoulder some blame - you also must bear in mind Valakari was brought in with the summer transfer window long since closed.\nThe Finn has largely had to work with what was already there and, while he was able to make some changes to his squad in January, turning around a ship already heading for choppy waters in a short period of time is a tall order.\nAre the factors that have led to St Johnstone's plight more deep rooted?\nFormer midfielder Davidson, who spent 14 years at McDiarmid Park, believes \"it has been building for years\".\nSt Johnstone had been a picture of consistency since returning to the top division under Derek McInnes in 2009, but Davidson says they went from being \"the most stable club\" to being the \"most unstable\" in Scottish football by the time he retired in the summer of 2023.\nTommy Wright presided over a seven-year spell during which he led the side to their first Scottish Cup win in 2014, as well as European campaigns and top-six finishes.\nThose foundations were initially built on by assistant and successor Callum Davidson, who oversaw a remarkable domestic cup double in season 2020-21.\nHowever, such stability has been lacking of late and has coincided with a downturn in fortunes.\nFollowing Davidson's near three-year spell, the club appointed another rookie boss - former striker Steven MacLean, who lasted just seven months.\nSt Johnstone then turned to veteran Craig Levein, who was in the post for 10 months before being replaced by Valakari in October, becoming their fourth manager in 19 months.\nRegularly changing managers, all with their own ideas and the inevitable churn of players that comes with that, rarely delivers success.\n\"There were players signed who were nowhere near good enough,\" Davidson told BBC Scotland.\n\"And when we signed players that weren't good enough, the next window it was, 'we need to sign four or five players'. It was a snowball effect for five or six windows.\"\nOverly nearly four decades, St Johnstone were transformed under the ownership of Geoff Brown.\nDavidson says the businessman and his son Steve, who succeeded his father as chairman, \"were unbelievable for me and for St Johnstone\".\nHe suggests \"there was a core of 13, 14, 15 players\" and they only needed to add three or four each season to ensure continuity.\n\"They weren't the biggest-paying club, and we weren't going to get the ball and play 30 passes, but everybody bought into what was successful and what it meant to people,\" Davidson said.\n\"Towards the end of my career, that wasn't happening. You were going in, there were two or three of us left, there were people coming in who didn't know the league, didn't know what the club was about.\"\nHaving announced in December 2022 that he was selling the club, it was not until summer 2024 that American businessman Adam Webb took over from Brown.\nThere will inevitably have been a period of uncertainty in the intervening 18 months – and uncertainty rarely creates an environment conducive to success.\n\"The last eight, nine, 10 windows, they have had to panic buy,\" Davidson adds.\nNow the club great hopes they can return to the stability and success of the not too distant past.\nWith relatively new owners at the helm and with a manager who wants to try to play the right way, the future could still be bright for the McDiarmid Park club.\nBut having failed to pull off a Houdini-style escape, that immediate future begins in the second tier.", "url": "https://www.bbc.com/sport/football/articles/c934766v291o"}