{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:05:21", "date_modify": "2025-04-26 04:05:21", "date_publish": "2025-03-03 17:38:22", "description": "Celtic striker Idah relishing Cork return", "filename": "sport_articles_cqx0e717yy8o_1745640321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2fc6/live/81a641c0-f855-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cqx0e717yy8o_1745640321.html", "title": "Celtic striker Idah relishing Cork return", "title_page": "Celtic striker Idah relishing Cork return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Adam Idah is relishing the chance to return to Cork this summer to play against the club he has supported from childhood.\nCeltic will head to Ireland in the summer to face Idah's boyhood favourites Cork City in a friendly.\n\"I haven't played in Cork since I was 15 and didn't think I'd ever come back and play here,\" the striker said.\n\"So to come back in the summer is going to be brilliant.\n\"It will be amazing. There's obviously a massive Celtic fan base in Cork so it'll be like a home game.\n\"It'll be really cool to have the Cork fans and the Celtic fans. It'll be a bit of a strange one because I think everyone will be supporting both sides. But it'll be a fantastic day.\n\"I still support Cork City, they were obviously my team growing up, so it's exciting.\"\nBefore then, Celtic have domestic business to attend to with a Scottish Cup quarter-final against Hibs on the horizon.\nAnd Idah has fond memories of the competition after he scored the winning goal in last season's final against Rangers.\n\"There's no doubt that Hibs are a fantastic team,\" Idah added.\n\"They've won so many games now and they're a really good side. The game now coming up will be an exciting one and we are ready for it.\n\"I'm really looking forward to it. How it ended last season was probably one of the best moments I've had in my career. It's an exciting one for me.\"", "url": "https://www.bbc.co.uk/sport/articles/cqx0e717yy8o"}