{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 07:53:21", "date_modify": "2025-04-26 07:53:21", "date_publish": "2025-02-25 14:03:30", "description": "Alexander Jensen eager to build on impressive start at Aberdeen", "filename": "sport_articles_cy4lp141y1vo_1745654001.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11a7/live/fda0c4f0-f380-11ef-bdb2-df3b1e28059d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cy4lp141y1vo_1745654001.html", "title": "Jensen eager to build on impressive start", "title_page": "Alexander Jensen eager to build on impressive start at Aberdeen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Alexander Jensen says he is still adjusting to the intensity of Scottish football and has plenty of room for improvement despite an impressive start to his Aberdeen career.\nThe Danish full-back, 23, has edged Scotland cap Nicky Devlin on to the bench and started the Dons' past six games after arriving from Swedish side IF Brommapojkarna on a four-year deal in January.\n\"I think everyone around the team has been making it very easy for me to settle here and have helped me a lot,\" said Jensen.\n\"It is very different to Swedish football, more intense and duels, I still have to get used to that. I think there are still a lot of things I can improve and the team can improve as well.\"\nJensen has been key to the Dons' recent upturn in fortunes, with three successive wins in all competitions before Tuesday night's trip to face Celtic.\n\"First of all it was to play at Pittodrie which I enjoy so much, crazy fans and crazy atmosphere there, but of course it is a great game and a big game so I am looking forward to that as well,\" he added.\n\"Every day I feel it is coming as a team and it is coming how we want to play. Everybody is on the same pattern so it is coming on and off the pitch.\"", "url": "https://www.bbc.co.uk/sport/articles/cy4lp141y1vo"}