{"authors": ["Chris Forryan", "www.facebook.com"], "date_download": "2025-05-21 06:05:22", "date_modify": "2025-05-21 06:05:22", "date_publish": "2024-12-24 15:37:54", "description": "Leicester news: Opinion - A fan's moment of the year", "filename": "sport_football_articles_cpvndk3zpdzo_1747807522.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4487/live/4f936c40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpvndk3zpdzo_1747807522.html", "title": "Opinion - A fan's moment of the year - BBC Sport", "title_page": "Leicester news: Opinion - A fan's moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For me, there are three main contenders for my moment of the year.\nThird place would be the sacking of Steve Cooper and the appointment of Ruud van Nistelrooy.\nWhile I wasn't against the appointment of Cooper - in fact I thought he could just keep us up - the fact was we weren't showing any signs of improvement, while the teams below us were.\nThe appointment of the man who masterminded a well below average Manchester United side to beat us twice was - in my humble opinion - an appointment that matched that of Enzo Maresca. It generated a buzz and excitement, which the fans needed, and a hope that things could get better.\nSurprisingly, second place was winning the Championship last season. While it was expected, especially when we were 17 points clear, to do it by just one point was bottom-squeakingly close.\nWhile promotion at any cost was the aim, I really wanted us to win it to go ahead of Manchester City in terms of the number of second-tier titles won. The fact that it means we have probably been relegated more than most teams is something I choose to gloss over.\nSo what is numero uno, then? For me, it is avoiding any points deduction due to PSR. All thanks to Santa - sorry, I mean Nick De Marco KC.\nWhile managing promotion was so vital due to PSR, staying up is just as, if not more, vital. The points deduction, depending on which report you read, could have been between six and 12 points - and that would have killed off our survival chances before we had even kicked a ball.\nBBC Sport's Simon Stone wrote a story titled: \"A 'loophole' not exploited to clear Leicester's charges - De Marco\".\nWell, whatever it was, it is my moment of the year.", "url": "https://www.bbc.com/sport/football/articles/cpvndk3zpdzo"}