{"authors": ["Ged Scott and Richard Wilford", "www.facebook.com"], "date_download": "2025-05-21 07:54:05", "date_modify": "2025-05-21 07:54:05", "date_publish": "2025-01-22 09:24:22", "description": "Birmingham boss Chris Davies says still being top after Blues' successive away trips to Wrexham and Huddersfield would be 'ideal'.", "filename": "sport_football_articles_cq5gwvqq90qo_1747814045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/23d9/live/b73dca70-d82e-11ef-90a6-415e92196211.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5gwvqq90qo_1747814045.html", "title": "Birmingham City: Davies calm ahead of Wrexham & Huddersfield tests", "title_page": "Birmingham City: Davies calm ahead of Wrexham & Huddersfield tests - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Birmingham City boss Chris Davies takes his team to Wrexham's Racecourse Ground on Thursday knowing it could be the start of Blues' most important six days of the season.\nThe Championship leaders face third-placed Wrexham in this season's second League One meeting of what the two club's high-profile owners will no doubt be billing as a 'Rematch' or a 'Sequel'.\nBlues then face another equally tough trip next Tuesday when they travel to West Yorkshire to face fourth-placed Huddersfield Town.\nDavies's side currently lead second-placed Wycombe Wanderers by two points, with two games in hand on both them and Wrexham, three points further back, but three points better off than Huddersfield.\nBut, while two away wins would obviously be ideal, Davies says simply still being top after their two successive away games would be a case of job done.\n\"They're both big tests away from home,\" he told BBC Radio WM. \"But we take them one game at a time.\n\"If we get the results that allow us to stay on top, that would be ideal.\n\"They're both up there and they've both had a good strong season. It's a measure of where we are that that would set us up really well for the run-in.\n\"But you're always cautious not to think too far ahead... 'if we win this one, then that one'.\n\"We went to Shrewsbury who were bottom and had lost their last six games and they beat us.\n\"It's important not to think too much about other teams in advance, just take them as they come on the day.\"\nBlues only needed one Ethan Laird goal - his first for the club - to see off a fairly listless Exeter City at another packed St Andrew's on Saturday.\nBut City were stunned by an early Jack Marriott strike before bouncing back to beat Wrexham 3-1 when the two sides met in September.\nAnd they know they will face an examination on a ground they have not visited since Steve Claridge rescued a late point there after Karl Connolly's opener in a 1-1 draw back in September 1994, Blues' most recent third-tier promotion season under Barry Fry.\nThere have been a lot of lean times since for the North Wales side, including 12 years in the National League.\nBut the Hollywood riches have helped restore the atmosphere to the rebuilt Racecourse which reverberated throughout their glory years in the 1970s and early 1980s, when they regularly played in Europe and spent several seasons in English football's second tier along with the likes of Chelsea, Newcastle United and West Ham United.\nIt was an atmosphere that triggered many a FA Cup exit, chiefly holders Arsenal's demise in 1992, not to mention Wales' famous 4-1 win over England in the 1980 Home Nations Championship eight years earlier.\nRacecourse fever is currently right back to what it was more than 40 years ago. But Welshman Davies is confident his Blues side can handle it.\n\"You can see when you watch their games that they have a good atmosphere,\" added Davies. \"They're on the crest of a wave.\n\"But we put on a real show ourselves. We're used to playing in big stadiums with a big atmosphere. We have that every game at our own stadium.\"\nChris Davies was talking to BBC Radio WM's Richard Wilford", "url": "https://www.bbc.com/sport/football/articles/cq5gwvqq90qo"}