{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:47:30", "date_modify": "2025-05-19 14:47:30", "date_publish": "2015-02-20 11:19:15", "description": "Nottingham Forest make it 10 points from a possible 12 under new boss Dougie Freedman as they thrash his former club Bolton.", "filename": "sport_football_31466192_1747666050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81156000/jpg/_81156623_dougie_freedman.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31466192_1747666050.html", "title": "Nottingham Forest 4-1 Bolton Wanderers", "title_page": "Nottingham Forest 4-1 Bolton Wanderers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest made it 10 points from a possible 12 in the Championship under new boss Dougie Freedman as they thrashed his former club Bolton.\nFreedman, who left Bolton in October, saw Chris Burke and Michail Antonio fire his side into an early 2-0 lead.\nAdam Le Fondre reduced the deficit from the spot after Zach Clough was fouled.\nBut after Bolton had Matt Mills sent off for a second booking, Henri Lansbury's penalty made it 3-1 before Burke added his second with a low shot.\nForest's victory lifted them to ninth in the table, but 12 points adrift of a play-off spot, while Bolton slip to 18th.\nAnd current Wanderers boss Neil Lennon had more to concern him than the result after seeing both keeper Andy Lonergan and defender Tim Ream carried off with injuries, resulting in former England striker Emile Heskey being pressed into service in central defence.\nBolton pulled one back on the stroke of half time when Danny Fox brought down Clough in the penalty area and Le Fondre drove home from the spot.\nAfter losing Ream in the first half, Heskey came on in defence at half time and soon found his side reduced to 10 men when Mills was shown his second yellow card, both for fouls on Antonio.\nLonergan was then injured in bringing down Dexter Blackstock in the area, and, after a six-minute delay, Lansbury beat replacement keeper Ben Amos from the resulting penalty.\nBurke then made the game safe after Heskey made a mess of clearing the ball on the edge of the box.\nNottingham Forest manager Dougie Freedman:\n\"All round, this was a very, very good performance for us. I am really pleased, because this is a fantastic group of players to work with. With their ability and talent they have got, it is really pleasing to see that coming out as a manager.\n\"I am happy because we won the game of football and we played some great football. We scored two wonderful goals in the first 30 minutes and would have had more, if not for a few wonderful saves from their keeper.\n\"Michail Antonio was almost unplayable at times. I like my wide players go and attack players and in the old days at Forest that always used to happen, that is how people were brought up at this club.\n\"Chris Burke took his goals well too. They will be given the freedom to get forward when they can.\"\nBolton manager Neil Lennon:\n\"It was poor. You can talk about working on the training ground to tighten things up, but when people are making individual mistakes, there is not a lot you can do.\n\"We were missing headers, not putting tackles in - we were soft and we need to correct it quickly. We will have to think about things.\n\"We have picked up another three injuries, but that does not excuse the ill-discipline, particularly the ill-discipline of the captain, who had a booking and a warning at half time.\n\"But then we were down to 10 men two minutes after the break and we just keep shooting ourselves in the foot. We tried to be more conservative, so that we were not as open.\"", "url": "https://www.bbc.com/sport/football/31466192"}