{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:02:50", "date_modify": "2025-05-20 12:02:50", "date_publish": "2023-08-06 00:00:00", "description": "Follow text and radio commentary as Southern Brave host Northern Superchargers in the 2023 Women's Hundred.", "filename": "sport_live_cricket_66306808_1747742570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6597/production/_130670062_gettyimages-1596012247.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306808_1747742570.html", "title": "The Hundred 2023 LIVE: Southern Brave vs Northern Superchargers in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Southern Brave vs Northern Superchargers in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nThat's all from this live test as Southern Brave begin a busy day of Hundred action with a comfortable victory.\nWe will return at 14:15 for coverage of Oval Invincibles v Welsh Fire in the women's competition, plus updates from Southern Brave v Northern Superchargers in the men's.\nSee you there!\nPost\nSouthern Brave captain Anya Shrubsole to Sky Sports: \"Really pleased with the way we bounced back from Friday. We were really disappointed with the way we bowled in particular. It was a bit of a scrappy run chase but a win's a win.\n\"Lauren Bell set the tone with her first five balls. To two take two wickets and restrict their runs set the tone.\n\"I was pretty terrible on Friday. I was really disappointed with the way I bowled. But it was nice to be able to come here and put it right.\"\nOn Rhianna Southby: \"I have been winding her up all day. It is like Rhianna Southby day. But she is an exceptional keeper and probably the second-best keeper in the country behind Amy Jones, so we are really happy to have her.\"\nPost\nMatch Hero Southern Brave's Rhianna Southby: \"It is amazing. I've not been anywhere near my best but to show people what I'm capable of is brilliant.\n\"It is tough. I spent a lot of time in the indoor school to try and get used to the low pitches that we've had.\n\"The catch to dismiss Alice Davidson-Richards was my favourite because under-edges are difficult to take because they go low.\"\nBrave 71-1\nWell, that's the last thing Superchargers needed.\nA bouncer from Kate Cross leaps up off the surface, goes over the wicketkeeper's head and fizzes away for four byes.\nIt was also a no-ball as well so two more runs are added to the score plus a free hit, which only yields a single.", "url": "https://www.bbc.com/sport/live/cricket/66306808"}