{"authors": ["James Piercy", "www.facebook.com"], "date_download": "2025-05-21 04:33:40", "date_modify": "2025-05-21 04:33:40", "date_publish": "2025-02-09 12:00:57", "description": "BBC Sport takes a closer look at the loan market and how recalls can often trigger a chain reaction.", "filename": "sport_football_articles_cqjvp9prrz1o_1747802020.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c8ce/live/b97fef80-e656-11ef-bd1b-d536627785f2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqjvp9prrz1o_1747802020.html", "title": "EFL clubs know their place after loan recalls", "title_page": "EFL clubs know their place after loan recalls - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For a stark reminder of the fragilities of operating in the loan market you need only look at how decisions made at Portman Road on deadline day resonated from the Premier League down through the divisions into the National League.\nThe money Ipswich Town spent on West Bromwich Albion goalkeeper Alex Palmer led the Baggies to recall Josh Griffiths from his loan at Bristol Rovers and, in turn, forced the League One club to bring Jed Ward back prematurely from his temporary stay at Forest Green Rovers.\nThree clubs lost their starting goalkeeper, all among their standout individuals of the season, with little room to manoeuvre and pivot to something else, because of one transfer at the top of the food chain.\nIt maybe should not come as a surprise but does highlight a pretty significant fault line when working in such a market, albeit one where the English Football League and non-league clubs simply have no choice given the financial pressures and the comparative low cost to high return of loaning a player in - even with the sporting risks.\nThe chain reaction of the Palmer deal was right at the end of the window - in the weeks leading up to that there were other such examples of recalls which could come to have an undeniable impact.\nNot falling in love with a loan player has never been easier.\nLeicester City's decision to recall Tom Cannon from Stoke City was different in that there was never any indication he was going to start for the Foxes in the Premier League, and his return to King Power Stadium proved a brief one as he was sold to Sheffield United to aid PSR concerns.\nStoke, now a striker short and having paid a significant fee and wage contribution to loan Cannon in the first place, turned to one of their own to fill the void in Nathan Lowe, who had found the target 15 times in 22 games for League Two leaders Walsall, bringing the 19-year-old back early from Bescot Stadium.\nIn League One, Stockport County have been undoubted beneficiaries of Louie Barry's talents as he scored 25 goals in 47 appearances over two spells on hire from Aston Villa.\nBut with his star rising, the Premier League club elected to exercise their clause and place him in the Championship at Hull City.\nIn League Two, Cardiff City's Joel Colwill was Cheltenham Town's joint top scorer, finding the target six times as the Robins established themselves in mid-table for a second half of the season tilt towards the play-offs.\nSuch an ambition may have to be slightly tempered as the 20-year-old was called back to Wales before being placed a division higher at Exeter City.\nIt was a similar case for struggling Accrington Stanley, with Burnley electing to move Dara Costelloe from a relegation battle in the fourth tier to a survival quest a level up at Northampton Town.\n\"There's no loyalty,\" Cheltenham director of football Gary Johnson tells BBC Sport with a knowing smirk.\nDuring his near 40-year career in the dugout with Cambridge United, Yeovil Town and Bristol City, Johnson struggles to calculate how many players he has loaned, but an estimate would be comfortably into triple figures.\n\"It's tricky and you'll win some and lose some,\" he said.\n\"We got Colwill games, played him every week when he was available, and he did very well and we were sorry to lose him, but Cardiff decided to bring him back and send him to Exeter.\n\"We're just pleased we were able to help Cardiff show he was a decent player - he helped us get a lot of points, some good wins and helped put us in a position where we're not having to panic at this stage of the season.\"\nAs Johnson well knows, there is something far more calculated to the entire process now. Every Premier League club has a loans manager or at least a committee whose job is to ensure academy talent or senior players not playing can be relocated to either aid their development or help ease numbers in the first team.\nWhereas recalls previously tended to happen, and the vast majority still do, when a player isn't receiving sufficient game time, the very specific plan around each individual is such that the clubs who take them on essentially become victims of their own success.\n\"It's changed a lot. It's gone from getting players out who aren't playing for certain periods of time - one month, three months, six months - to something more strategic,\" said Rob Newman, the former head of recruitment at West Ham who also spent 12 years in Manchester City's international scouting department.\n\"If they're playing well in the under-21s and they're 18, 19, you come to the conclusion that they need men's football. Is it suitable for the lad to go out?\n\"Because if he's going to crumble under it, then it's pointless, so you're looking at putting him into an environment where he's going to adapt well, so clubs are naturally careful.\n\"Clubs, say, in League One and League Two, will come in with presentations to showcase how they're going to play, how they'd fit a player into that, what they want him to do etc.\n\"Don't get me wrong, there are still some out there who may have personal connections at Premier League clubs and will ring to ask, 'have you got a striker?' just to get a body in.\n\"But, for the most part, there's quite an extensive due diligence process from both the loaning club and those receiving the player.\"\nBeyond the concept of player development there is also a financial consideration as loans departments have financial goals, which drives such moves as Cannon's and George Edmundson's Middlesbrough move, with Leicester and Ipswich ultimately able to make profits on players not part of the first-team picture.\n\"A player will accrue more value playing in the Championship, League One or League Two than they will in the under-21s – that's just a fact,\" Newman says.\nIn the cases of Barry and Colwill, the decision to move them up does seem to be rooted in challenging them at higher levels and answering a question for their parent clubs - can they cut it?\nShould Barry perform in the Championship, he starts to enter the first-team conversation at Villa or, next-best case scenario, becomes more of an appealing asset in the summer transfer market.\nIt's not solely the clubs driving it, though, as Johnson says: \"If you've got a good relationship with the club, they know they're being looked after, getting good training, good advice, good welfare, you've put them in a nice place to live and they're happy, there's every chance they will stay.\n\"But then you get the other part, with the agent, and they might want him to move on because he's doing well and they start contacting other clubs with January coming up.\n\"This is the difference - the agents now have a big say whether they want the player to go to a certain club or not. It's changed a little bit who decides.\"\nDespite the pitfalls and the inability to plan sufficiently beyond January, EFL clubs have little option but to continue to mine the loan market and play the game. Ultimately, not doing so makes life so much harder.\nThere is also a wider picture to consider, as sometimes a loan of a player can be a stepping stone to an even better deal further down the line, should trust be sufficiently built.\nMoney still talks in many ways, when it comes to the Championship attracting the best Premier League under-21 talent with the need to pay a substantial loan fee, but so do previous relationships.\nFor Walsall, who since Lowe left have won just one of five games, there is an understandable licking of wounds.\nBut ultimately he helped put them in the position they now occupy and for the long term has helped to create and enhance boss Mat Sadler and the club's reputation as somewhere clubs can send their players for development.\nThis has been proven with Manchester United sending striker Ethan Wheatley to Bescot Stadium, and Stoke loaning them a second player in midfielder Darius Lipsiuc.\n\"In any shape or form, that was a fantastic loan for us; 30 games, and the productivity of that was brilliant,\" Sadler said of Lowe.\n\"Now we have to find the next one – that's football, that's life. I've got no problem with that. I love the fact that we have a part of Nathan's journey and, as a football club, that's how we work and operate.\n\"What we'll try to do now is be a place where people want to send their players, which I don't think has been the case always.\n\"I don't see it as an evil, I see it as brilliant – he's done well, now we have to get on with the next one.\"\nAdditional reporting by Michael Beardmore and Andrew Moon.", "url": "https://www.bbc.com/sport/football/articles/cqjvp9prrz1o"}