{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 11:42:36", "date_modify": "2025-05-20 11:42:36", "date_publish": "2023-08-06 14:48:21", "description": "Retiring USA forward Megan Rapinoe exits the Women's World Cup stage in tears as the defending champions are knocked out on penalties.", "filename": "sport_football_66391095_1747741356.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16F90/production/_130669049_rap1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66391095_1747741356.html", "title": "Women's World Cup 2023: Retiring Megan Rapinoe makes tearful exit as USA bow out", "title_page": "Women's World Cup 2023: Retiring Megan Rapinoe makes tearful exit as USA bow out - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It was not the ending Megan Rapinoe had planned.\nShe went so far as to call it \"dark comedy\" and a \"sick joke\", such was her dismay.\nAfter 17 years of putting herself on the line for the Stars and Stripes, the two-time Women's World Cup winner was in tears as she departed the global stage for the final time.\nOn Rapinoe's 202nd appearance for the USA, the defending world champions dramatically lost 5-4 on penalties to Sweden after a last-16 goalless draw in Melbourne.\nRapinoe, 38, ranks among the most successful players of her generation and announced before the tournament she would be retiring at the end of the season.\nWith the USA leading 3-2 on penalties on a tension-filled night, substitute Rapinoe missed her spot-kick before Sophia Smith and Kelley O'Hara also failed to score in the shootout.\nWhen Lina Hurtig converted the decisive penalty by the finest of margins, eliminating the four-time world champions, Rapinoe was overcome with emotion.\nDespite the result, Rapinoe bows out a genuine American footballing icon.\nHaving made her international debut in July 2006 in a friendly against the Republic of Ireland in San Diego, she established herself as one of most prominent players in the history of the United States women's national team.\nAfter appearing in the 2011, 2015 and 2019 editions, this was her fourth World Cup. Rapinoe helped establish the USA as the dominant force in the women's game, scoring in the 2019 final as the Stars and Stripes secured back-to-back world titles.\nThat triumphant night in Lyon four years ago, however, seemed a long time ago as a sad Rapinoe, who was named women's player of the year at the 2019 Best Fifa Awards, waved one last time to USA fans before disappearing down the tunnel.\nRapinoe did not start any games at this World Cup, making three substitute appearances and spending a total of 77 minutes on the pitch.\nThe USA are undergoing a generational shift with 14 of manager Vlatko Andonovski's 23-player squad in Australia and New Zealand appearing at their first World Cup.\nHe sprinkled the group with seasoned veterans like Rapinoe, forward Alex Morgan, 34, and defender O'Hara, 35, who were each making a fourth appearance at the World Cup.\nPart of Rapinoe's role at this edition was to encourage, help and guide some of the younger players off the pitch.\nThe United States put players up for interview on an almost daily basis at this tournament and, despite her lack of minutes on the pitch, Rapinoe's turn came on 30 July.\nIt was standing room only in the refurbished 1920s building close to Auckland's waterfront as Rapinoe reflected on her legacy in front of the world's media.\n\"I've always tried to play the game the right way and to go about things the right way,\" she said.\n\"I've always tried to use whatever platform we have - and this platform was built long before I ever got here - to grow the game, to make the world a better place, to use our voices to advocate for more.\n\"I know that I will walk away from the game having got everything out of it that I possibly could and enjoyed every moment, and celebrated, and fought and just laid it all out there.\"\nRapinoe's achievements on the field have been mirrored off it - she is well known for her work on social issues.\nShe publicly came out as gay in 2012 and has been an active advocate for LGBTQ+ rights and gender equality. Last year, Rapinoe became the first football player to receive the Presidential Medal of Freedom.\nShe has also used her platform to speak out on social justice issues, including some of the cultural flashpoints where American public opinion is so deeply divided.\nRapinoe was one of the first prominent US athletes to kneel during the national anthem to protest against police brutality.\nWinning sports teams are often invited to the White House, an honour Rapinoe and her team-mates accepted after the USA won the 2015 World Cup when Barack Obama was president.\nDuring the 2019 World Cup, a video surfaced of Rapinoe saying: \"I'm not going to the [expletive] White House.\"\nPresident Donald Trump did not take kindly to the player's comments and tweeted at her during the tournament that she should win first before making such a remark.\nRapinoe, who was then captain, went on to play a starring role in the final as the United States defeated the Netherlands to secure back-to-back World Cups.\nBut it was not enough for some critics.\n\"She's actually kind of an awful person,\" wrote journalist Brad Polumbo in the Washington Examiner., external \"Rapinoe has soccer skills for sure, but her entitled, flippant, and unpatriotic attitude is the epitome of first-world privilege.\"\nEven at this World Cup, where she spent more time on the substitutes' bench than the pitch, Rapinoe has come under fire.\nThe team in Australia and New Zealand stayed largely silent during the national anthem, prompting US media personality Megyn Kelly, external to say: \"She's [Rapinoe] poisoned the entire team against the country for which they play.\"\nCarli Lloyd - who played at the 2007, 2011, 2015 and 2019 World Cups - was critical after Rapinoe and team-mates danced on the pitch after narrowly avoiding being knocked out by a Portugal side who hit the woodwork in stoppage time of their final group game.\n\"There's a difference between being respectful of the fans and saying hello to your family, but to be dancing and to be smiling?\" said Lloyd on Fox Sports., external\nDespite criticism from some, Rapinoe has proved a hugely popular character inside the USA camp.\nDefender Crystal Dunn was overcome with emotion when asked about Rapinoe and all she meant to her.\n\"'P' is an incredible person, human being, friend, team-mate and...sorry,\" she said before adding: \"She's somebody you can call with the most random stuff.\n\"She has blue hair because I actually sent her a selfie of me having blue hair. We all love her so much.\"\nMidfielder Kristie Mewis, speaking in Auckland last month, said Rapinoe's legacy would live on \"for a long time\".\n\"I keep telling 'P' to do another cycle. Come on, we still need you,\" Mewis said. \"She's just such a presence on this team. It feels weird when she's not around because she has that presence that you crave, that you want and need.\"\nGoalkeeper Alyssa Naeher added: \"She'll do interviews, engage with the media more. She'll take on the hard questions, the difficult things so other people don't have to.\n\"She's unapologetically herself and allows others to be the same and be who they really are as well.\"", "url": "https://www.bbc.com/sport/football/66391095"}