{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:50:28", "date_modify": "2025-05-21 05:50:28", "date_publish": "2025-04-02 10:12:04", "description": "Exeter City say the League One club will earn more than £5m from recent transfers.", "filename": "sport_football_articles_c0jz81n7d9go_1747806628.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30f5/live/4eebb2b0-0fa7-11f0-9f4f-1b858dcfe51a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0jz81n7d9go_1747806628.html", "title": "Exeter City set to benefit from £5m transfer windfall", "title_page": "Exeter City set to benefit from £5m transfer windfall - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Exeter City say the club will earn more than £5m from recent transfers.\nThe Grecians' accounts to the end of June 2024 show they made more than £5m from sales from July last year onwards.\nFormer Exeter academy player Jay Stansfield's move from Fulham to Birmingham City in the summer of 2024 for reportedly £15m with possible add-ons saw the Grecians benefit thanks to a sell-on clause.\nCity also sold striker Millenic Alli for a fee understood to be worth £1.5m in January, while Will Aimson also moved to Wigan for an undisclosed fee in July 2024.\nCity say the funds are payable \"over a number of years rather than being received upfront and allow the club to plan investment in the first team, academy and capital projects whilst supporting the day-to-day running of the business\".\n\"The manager has been able to recruit a number of players to replace those leaving with both loans and permanent transfers,\" City added in their annual report.\n\"The board will continue to do all it can to provide the manager with the resources to support the ambition of the club whilst not compromising the sustainability of the business.\"\nStansfield's move is the latest in a long line of Exeter City academy players who have been sold for big fees in recent years.\nThe club has earned more than £5m from England striker Ollie Watkins' moves to Brentford and Aston Villa, while Ethan Ampadu, Matt Grimes and Joel Randell have all commended fees in excess of £1m.", "url": "https://www.bbc.com/sport/football/articles/c0jz81n7d9go"}