{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:56:03", "date_modify": "2025-05-21 04:56:03", "date_publish": "2025-04-04 14:04:27", "description": "BBC Scotland will again provide live television coverage of the Premiership play-off quarter-finals and semi-finals in May.", "filename": "sport_football_articles_cwy64r25804o_1747803363.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1aec/live/1ecacb90-1153-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy64r25804o_1747803363.html", "title": "Premiership play-off quarter-finals & semi-finals on BBC Scotland", "title_page": "Premiership play-off quarter-finals & semi-finals on BBC Scotland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "BBC Scotland will again provide live television coverage of the Premiership play-off quarter-finals and semi-finals in May.\nThe team fourth in the Championship will host third in the first leg on Tuesday 6 May, with the return leg three days later.\nThe winners then go on to face the league runners-up on 13 and 16 May, with all kick-offs at 19:45 BST.\nThe side left standing goes on to face 11th in the Premiership over two legs for a top-flight place next season.\nSky Sports will broadcast the final matches on 22 May and 26 May.\nIf St Johnstone are involved in the Scottish Cup final (24 May) and the play-off final, those dates will shift to 27 and 30 May.\nWith five matches remaining, Championship leaders Falkirk are on course for a second successive promotion as they sit eight points in front of Ayr United and Livingston, who are already guaranteed play-off places.\nPartick Thistle are fourth, with a six-point cushion over Raith Rovers and an advantage of seven over Morton.\nDundee currently occupy second bottom spot in the Premiership, five points ahead of St Johnstone and one behind Kilmarnock.\nBBC Alba will show the Championship play-off final games on 14 and 17 May and League One play-off final games on 13 and 16 May.", "url": "https://www.bbc.com/sport/football/articles/cwy64r25804o"}