{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:27:17", "date_modify": "2025-05-20 12:27:17", "date_publish": "2023-08-04 07:18:09", "description": "Wolves: 'Shi remains confident despite flirting with relegation last season'", "filename": "sport_articles_c72vlg135e9o_1747744037.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/50ff/live/c43a1c90-3296-11ee-87de-398b4c74543c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72vlg135e9o_1747744037.html", "title": "'Shi remains confident despite flirting with relegation last season'", "title_page": "Wolves: 'Shi remains confident despite flirting with relegation last season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport\nWolves chairman Jeff Shi has attempted to counter questions over the commitment of Chinese owners Fosun in a long open letter to fans.\nThe letter says Fosun have no intention of selling the club.\nHowever, he does outline the financial issues that mean the club have had to be exceptionally cautious with what they spend this summer.\n\"Before the end of 2023/24 season there will be an annual (FFP) test and we are going to make sure we pass it,\" he said.\n\"FFP sets a profit and loss limit for three rolling years, with a loss of £105m the threshold. We were very comfortable on FFP during the years just after promotion and before the covid pandemic, because of a relatively low wage bill, low-cost signings from the Championship and relatively stronger finishes in the league and Europe.\"\nWolves have struggled to make signings this summer - Bristol City's Alex Scott looks like joining Bournemouth despite long-standing interest from Molineux. Big-name players have also left.\nBut Shi remains confident despite flirting with relegation last season.\n\"The Premier League is very unpredictable and challenging, especially with new types of ownership at some clubs bringing unprecedented investment,\" he added.\n\"However, I am very confident in our squad.\"", "url": "https://www.bbc.com/sport/articles/c72vlg135e9o"}