{"authors": ["Mike Taylor", "www.facebook.com"], "date_download": "2025-05-21 06:38:30", "date_modify": "2025-05-21 06:38:30", "date_publish": "2025-01-22 19:09:51", "description": "Wolves news: Opinion - Why Rodrigo Gomes will learn a lot in next period, whatever happens", "filename": "sport_football_articles_cpwx7veppp4o_1747809510.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0e9c/live/c55109d0-4b64-11ef-aebc-6de4d31bf5cd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpwx7veppp4o_1747809510.html", "title": "Opinion - Why Rodrigo Gomes will learn a lot in next period, whatever happens - BBC Sport", "title_page": "Wolves news: Opinion - Why Rodrigo Gomes will learn a lot in next period, whatever happens - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"Rodrigo is a fighter,\" said Vitor Pereira recently, identifying one of the two traits that might make his young winger Rodrigo Gomes a good person to have around for the rest of this season, quite apart from his footballing ability.\nThe other is that he smiles a lot. I found this out when interviewing him after he had scored his first Premier League goal, in Pereira's first game at Leicester just before Christmas.\nLooking at him, you would have thought it already was Christmas, as he beamed and bubbled about his day. On the field, he had celebrated what had been quite a slapstick goal as if it had been a 30-yard screamer in the last minute of a cup final.\nPerhaps one day we will find out how he will react if he does score a 30-yard screamer in the last minute of a cup final. I can't imagine, but it will be fun finding out.\nThis is worth mentioning because a sense of sullenness has descended on Wolves again over the past week or so, after the initial jab of positivity from Pereira's arrival.\nIt was always possible that this section of the fixture list would drag down spirits. Wolves have faced three teams in a row that are competing for European places next season, and conceded three goals to each of them.\nThe next few games are likely to be just as hard and, to make things worse, senior players until recently considered the brightest lights at the club - the captain and the best player - are at the centre of controversies that might ultimately result in both leaving.\nHowever those unwanted dramas play out, Wolves will need everyone who remains to share the load, and keep their heads up.\nGomes is one of those who offers hope of this. With gifts of speed and energy, he caught the eye in pre-season, but faded in the autumn, perhaps considered a little too raw to be risked in a perilous situation.\nBut it may be just that uncomplicated freshness that Wolves will need to show a way forward.\nGomes' goal in the FA Cup tie at Bristol City - a far slicker job than the one at Leicester - was a good sign that he is learning to fit in to Pereira's design.\nHe, and other young players emerging into the harsh light on Wolves at the moment, will learn a lot in the next few months whatever happens, but some natural, bouncy optimism will serve him well.\nKeep smiling, Rodrigo.\nListen to full commentary of Wolves v Arsenal at 15:00 GMT on Saturday on BBC Radio WM (DAB, Freeview 714 and BBC Sounds)", "url": "https://www.bbc.com/sport/football/articles/cpwx7veppp4o"}