{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:16:52", "date_modify": "2025-04-26 06:16:52", "date_publish": "2025-03-01 19:02:28", "description": "Bournemouth 1-1 Wolves (5-4 on penalties): What Vitor Pereira said", "filename": "sport_football_articles_c9q4w5y7djro_1745648212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/931e/live/9ede3f50-f6ba-11ef-84d4-499fadd0dc53.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9q4w5y7djro_1745648212.html", "title": "Bournemouth 1-1 Wolves (5-4 on penalties): What Vitor Pereira said", "title_page": "Bournemouth 1-1 Wolves (5-4 on penalties): What Vitor Pereira said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves boss Vitor Pereira has been speaking to BBC Match of the Day about the defeat: \"I'm proud of my players because we played with a lot of injury limitations. It means it was a very difficult game. Three games in a row, I must feel proud.\"\nOn Matheus Cunha's red card: \"When the situation happened, I was looking for the ball. I didn't see the situation but football is emotional and the level was very high today, not only inside the pitch but outside the pitch. With a lot of pressure, these are things that can happen.\n\"You know he is frustrated. He is better [than that], in my opinion. I never speak to the team when we are nervous or frustrated. It is better to wait one day and think about everything. After that, we can have a talk.\n\"Of course he is an important player, but in the next game we need to start with 11 and play with 11. We had the capacity to equalise the game in the second half and then, after that, it was the injury limitations.\"\nOn the seven minute VAR check: \"I was very calm. I think it was some problem with the machine. I don't know what happened but, in the end, I understand.\"\nOn their Premier League relegation fight: \"It will be a strong fight until the end, but we will be ready to do it.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c9q4w5y7djro"}