{"authors": ["Sara Orchard", "www.facebook.com"], "date_download": "2025-04-26 03:52:38", "date_modify": "2025-04-26 03:52:38", "date_publish": "2025-03-03 10:02:07", "description": "Millie David, Charlotte Fray, Jade Shekells and Sarah Parry are in the England Women's training squad for the first time ahead of the Six Nations.", "filename": "sport_rugby-union_articles_cm2j6r8rl33o_1745639558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1373/live/1d055da0-f814-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cm2j6r8rl33o_1745639558.html", "title": "Women's Six Nations: Millie David among England camp call-ups", "title_page": "Women's Six Nations: Millie David among England camp call-ups - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Millie David, Charlotte Fray, Jade Shekells and Sarah Parry have all been called into the England training squad for the first time before the Women's Six Nations.\nForty-two players have been named, however only 24 women will be available to attend all training camps before the tournament starts.\nEighteen of the named players are from Gloucester-Hartpury and Saracens Women, and will later return to their clubs to prepare for the PWR final on Sunday, 16 March.\nEngland open the Six Nations at home to Italy in York, on Sunday, 23 March.\nThe seven-day turnaround from league conclusion to the Six Nations start was agreed to accommodate the England players' requirement of an enforced rest period before training starts for their home Rugby World Cup this summer.\nEngland also confirmed that Nathan Catt will lead on defence as maternity cover for Sarah Hunter.\nRed Roses head coach Mitchell said: \"Our coaching group remains stronger than ever with the inclusion of Nathan, who has been an exceptional addition from the pathway.\n\"Sarah is an extremely valued member of the Red Roses. Her (current) focus is on being a mum and we're looking forward to seeing her soon.\n\"The objective of this camp is to become organised and get better as a Red Rose ahead of the Six Nations, bearing in mind we will be without the PWR finalists next week.\n\"We are expecting an excited energy in reconnecting again and focusing on the opportunity that this special tournament presents for us.\"\nBristol wing David will get an opportunity to stake a claim for a Red Roses shirt after she was a shock omission from an England training camp in January.\nGreat Britain Sevens player Shekells is also called into the squad.\nThe 2024 Paris Olympian recently played for GB at the Vancouver leg of the World Sevens Series in February but has impressed in a handful of games for Gloucester-Hartpury at outside centre.\nLeicester Tigers' second row Fray is also called in, as is Harlequins 19-year-old centre Parry.\nSaracens scrum-half Ella Wyrwas returns to the squad having missed an earlier January camp.\nEngland rugby league convert Fran Goldthorp and Bristol wing Reneeqa Bonner are dropped from the squad after an initial call-ups in January.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cm2j6r8rl33o"}