{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-19 15:01:31", "date_modify": "2025-05-19 15:01:31", "date_publish": "2017-08-11 21:55:57", "description": "Aberdeen recover from a nightmare start to come from behind and beat Ross County in Dingwall.", "filename": "sport_football_40835316_1747666891.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E359/production/_97310285_dons.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40835316_1747666891.html", "title": "Ross County 1-2 Aberdeen", "title_page": "Ross County 1-2 Aberdeen - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Aberdeen recovered from a nightmare start to come from behind and beat Ross County in Dingwall.\nCounty made a blistering start and Craig Curran headed Christopher Routis' free-kick past goalkeeper Joe Lewis.\nCurran headed over minutes later, and as Aberdeen improved Mark Reynolds volleyed them level.\nThe Dons were relentless in their pursuit of a second goal and Shay Logan headed them ahead, but Jim O'Brien hit the bar as County finished strongly.\nAll eyes were on Aberdeen debutant Stevie May, with Ross Draper also beginning in the Ross County side after completing his move from Inverness Caledonian Thistle.\nHowever, the route to three points came from the unlikely source of two defenders for Derek McInnes' side.\nWhat is perhaps most impressive about the Pittodrie side is the quality and depth they now possess.\nRyan Christie, Nicky Maynard and Adam Rooney all started on the bench.\nCounty looked very impressive in the opening stages and were rewarded immediately, taking the lead within 80 seconds.\nRoutis floated in a wonderful free-kick from the left which Curran expertly glanced into the corner.\nCurran went close again with another header but they relinquished control and were eventually punished.\nTheir equaliser was a stunning volley from centre-half Reynolds who positioned himself on the edge of the box before dispatching a clearance home in style.\nThey dominated much of the second half with Greg Stewart, Greg Tansey and May all going close before they inevitably went ahead.\nGary MacKay-Steven got to the byeline and dinked a cross to the back post, where Logan arrived to nod home from a couple of yards.\nLogan has now scored 14 goals for the Dons, six of them coming against Ross County.\nThe visitors did get a late break before seeing out the win, though, when County's O'Brien cracked a fierce long-range drive off the bar.\nA total of three points from a difficult opening two games is a decent return for Ross County, but manager Jim McIntyre must have hoped more were coming after their opening here.\nRoss County manager Jim McIntyre: \"The first 15 minutes I was really pleased, we really got at Aberdeen. But after that we were guilty of gifting the ball away.\n\"In the second half we were flagging, maybe the extra-time in midweek had an effect, but it's no excuse, we're a fit team.\n\"Aberdeen are a top side. You need to defend well when you come up against good teams and I felt we did that. In the main the boys gave it everything they had, they just didn't have the bit of extra quality.\"\nAberdeen manager Derek McInnes: \"If you're going to lose a goal, lose it in the first minute. It was a gift.\n\"The onus was on us to grab the game. We started to get our game going. Second half, I thought we took charge of the game. Our willingness and determination to make the game go our way was evident in the winning goal.\n\"I thought Stevie May, other than scoring, had a fantastic debut. He was a constant threat, he dropped off, looked after the ball, played on the shoulder. He never gives centre halves a minute.\"\nAberdeen striker Stevie May: \"It was a tough start for us, we should have started much better but we got the job done.\n\"We've got four players in attacking positions there that can play every single place, intertwining. It's only going to get better.\n\"I don't think competition is ever bad, especially in the numbers we've got and quality we've got in the squad. It speaks volumes for the club and ambition of the club. It's always healthy.\n\"It's a good start from my point of view.\"", "url": "https://www.bbc.com/sport/football/40835316"}