{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:57:06", "date_modify": "2025-05-21 04:57:06", "date_publish": "2025-01-14 17:19:45", "description": "Arsenal forward Gabriel Jesus will undergo surgery after sustaining an anterior cruciate ligament injury.", "filename": "sport_football_articles_ce3l17vky57o_1747803426.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4e02/live/9eb74500-d28c-11ef-942b-c3287c803118.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3l17vky57o_1747803426.html", "title": "Gabriel Jesus: Arsenal forward facing operation after injuring anterior cruciate ligament", "title_page": "Gabriel Jesus: Arsenal forward facing operation after injuring anterior cruciate ligament - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal forward Gabriel Jesus will have an operation on his left knee after sustaining an anterior cruciate ligament injury.\nJesus, 27, was taken off on a stretcher during Sunday's FA Cup third round defeat by Manchester United at Emirates Stadium.\nThe Brazilian has made 27 appearances across all competitions this season, scoring seven goals.\n\"Gabriel Jesus has received extensive assessments, scans and specialist reviews which have confirmed an injury to the anterior cruciate ligament in his left knee,\" Arsenal said in a statement.\n\"Gabby will undergo surgery in the coming days and will soon begin his recovery and rehabilitation programme.\"\nJesus, who joined Arsenal from Manchester City for £45m in July 2022, scored six goals in his past seven appearances.\nHe is the latest player to join a lengthening injury list at Arsenal with England forward Bukayo Saka, Ben White, Takehiro Tomiyasu, Ethan Nwaneri and Riccardo Calafiori also on the sidelines.\nArsenal are second in the Premier League, six points behind leaders Liverpool, who have a game in hand, and they host north London rivals Tottenham on Wednesday.\nThe Gunners also return to Champions League action later this month and will attempt to overturn a 2-0 deficit against Newcastle at St James' Park in the second leg of their Carabao Cup semi-final on 5 February.\nManager Mikel Arteta said on Tuesday he was \"worried\" about the extent of Jesus's injury and confirmed the club were \"actively looking\" at signing options this month given key forward Bukayo Saka is also out until March\n\"It would be naive not to do that because there is always an opportunity to evolve the team and improve the squad, so yes, we are looking and let's see what we are able to do,\" Arteta said.", "url": "https://www.bbc.com/sport/football/articles/ce3l17vky57o"}