{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:07:52", "date_modify": "2025-05-21 07:07:52", "date_publish": "2025-01-13 22:30:17", "description": "Manchester City boss Pep Guardiola says he may have made a mistake by telling the club to scrap plans to buy players last summer.", "filename": "sport_football_articles_c4gp2pkz400o_1747811272.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d699/live/a07c7b10-d1d0-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4gp2pkz400o_1747811272.html", "title": "Manchester City manager Pep Guardiola says he should maybe have made summer signings", "title_page": "Manchester City manager Pep Guardiola says he should maybe have made summer signings - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City boss Pep Guardiola says he may have made a mistake by telling the club to scrap plans to buy players last summer.\nCity are expected to dip into the transfer market this month in an effort to stop their season spiralling out of control.\nThey have not made a significant signing in January since the arrival of Aymeric Laporte for £57m from Athletic Bilbao in 2018.\nLens defender Abdukodir Khusanov is on the brink of completing a £33.6m move after City agreed a fee for the Uzbekistan international.\nGuardiola is also hoping to bring in Eintracht Frankfurt forward Omar Marmoush, while Palmeiras' teenage defender Vitor Reis is also on his radar.\nAt the same time, veteran full-back Kyle Walker has been given permission to explore options around a move abroad.\n\"In the summer the club thought about it and I said 'no, I don't want to make any signings',\" said Guardiola on the eve of Tuesday's Premier League game at Brentford.\n\"I relied a lot on these guys and thought I can do it again.\n\"But after the injuries – wow - maybe we should have done it.\"\nHe maintains injuries are the main reason why his side has slipped to sixth in the Premier League, been eliminated from the EFL Cup and find themselves 22nd of 36 in the Champions League table and facing a battle just to secure a top 24 spot and place in the play-offs.\nAccording to Transfermarkt, external, City have had to deal with 15 injury-related absences of two weeks or more, the most damaging of which has ruled Ballon D'Or winner Rodri out for the season.\nDefenders John Stones and Ruben Dias will both miss the Brentford game and Guardiola is still to decide whether Walker should be included.\n\"We knew at the beginning of the season we will have a lot of players over 30,\" he said.\n\"We knew sooner or later, we should do it. Step by step we had to change.\n\"But five or six months ago, they won the Premier League, four in a row, reached the FA Cup final and quarter-final of the Champions League. The amount of injuries we had, I didn't expect it.\"", "url": "https://www.bbc.com/sport/football/articles/c4gp2pkz400o"}