{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 04:20:00", "date_modify": "2025-05-21 04:20:00", "date_publish": "2025-04-05 15:24:04", "description": "Wrexham boss Phil Parkinson tells his history-chasers to keep their focus after League One rivals stumble to leave promotion in their hands.", "filename": "sport_football_articles_c2kv5j0jdkvo_1747801200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ac7/live/20d17650-122a-11f0-a820-05f89b05038b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2kv5j0jdkvo_1747801200.html", "title": "Wrexham told to keep focus as they close on Championship", "title_page": "Wrexham told to keep focus as they close on Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham manager Phil Parkinson has told his history-chasers to keep their focus after they placed the chance of League One promotion in their own hands.\nThe Dragons are aiming to become the first team playing in English football's top-five tiers to achieve three successive promotions.\nWith co-chairman Ryan Reynolds in attendance, the north Wales side enjoyed what could be a decisive afternoon in their attempt to reach the Championship for the first time in more than four decades.\nTheir 3-0 victory over Burton Albion on Saturday saw them move six points clear of third-placed Wycombe Wanderers, who lost 1-0 at Reading.\nIt means Wrexham, who have five fixtures remaining, are now masters of their own destiny regardless of Wycombe's game in hand.\nBut Parkinson, with five career promotions to his name, had already made it clear to his squad that now is not the time to get carried away.\n\"We're in a better place than we were this morning,\" said Parkinson after second-half goals from Steven Fletcher, Sam Smith and Jack Marriott ended 10-man Burton's resistance.\n\"It's exciting to be part of this for everybody. I said to the players after the game, everybody will be talking about Reading beating Wycombe - which is great for us of course - but now our focus on this week's training and being ready for next weekend.\"\nParkinson, a former Reading player, said supporters' reactions – with noise and mobile phones – made him aware of Wycombe's slip-up.\n\"Our job was just to win and nothing was going to change our mindset,\" he said.\n\"It's a bonus, we can't hide away from it, but we're just pleased we took care of our own business and now we have to make sure we're really focussed on what we've got to do.\"\nWhat is needed is navigating their way through the final fixtures, beginning at Wigan Athletic on Saturday before Easter games against Bristol Rovers at the Racecourse and away to Blackpool.\nSome have already eyed the final home game of the season against play-off hopefuls Charlton Athletic as a day promotion could be sealed before the final day at Lincoln City.\nBut defender Eoghan O'Connell, one of a number in the squad hoping for a third promotion medal, says those thoughts have not made their way into the dressing room.\nDescribing the closing stage of the season as a rollercoaster, the centre-back said: \"It's in our own hands in the run-in, but we won't take that for granted.\n\"Any victory at this stage of the season is a big victory, especially after Tuesday night (where Wrexham drew at Cambridge United). In the end it turned out to be a good point but we didn't want to lose momentum. Just to win today is huge.\n\"I suppose it's a swing, but a few weeks ago we were beaten by Leyton Orient and it was the end of the world. The best thing we've done at this stage over the last few years is never get carried away by one result, and we will look to keep doing that with five games to go.\n\"We're enjoying it but we'll enjoy it even more if we finish the job.\"", "url": "https://www.bbc.com/sport/football/articles/c2kv5j0jdkvo"}