{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:05", "date_modify": "2025-05-20 12:51:05", "date_publish": "2023-08-03 00:00:00", "description": "Live text updates from the Europa Conference League second qualifying round, second leg fixtures featuring Crusaders, Linfield, Larne and Derry City", "filename": "sport_live_football_66365144_1747745465.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9CEB/production/_130417104_inpho_02303464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66365144_1747745465.html", "title": "Europa Conference League: Live text commentary from Crusaders, Linfield, Larne and Derry City matches", "title_page": "Europa Conference League: Live text commentary from Crusaders, Linfield, Larne and Derry City matches - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Full-time\nLarne 1-4 Ballkani (Agg: 1-7)\nLarne's European adventure ends at Solitude after defeat to Kosovan side FC Ballkani.\nLarne started the brighter but a quick fire double from Nazmi Gripshi gave the visitors control before Albion rrahmani added a third less than 30 seconds after the break.\nLee Bonis would pull one back from the penalty spot before Almir Kryeziu made sure of the win on the 66th minute firing past Rohan Ferguson from the edge of the area.\nCLOSE!\nLarne 1-4 Ballkani (Agg:1-7)\nLarne go close to their second of the evening.\nSubstitute Michael Glynn's deep cross is nearly turned into his own net by Arber Potoku under pressure from Paul O'Neill but the defender's attempted clearance goes narrowly wide for a Larne corner.\nGOAL\nLarne 1-4 Ballkani (Agg:1-7)\nThe visitors add another courtesy of Almir Kryeziu.\nNazmi Gripshi crosses to the back post before the ball is pulled back for the unmarked Kryeziu just outside the area and he fires first time past Rohan Ferguson.\nFULL-TIME\nRosenborg 3-2 Crusaders (Agg: 5-4)\nWhat an effort from 10-man Crusaders but they just fall short as the final whistle goes to signal a Rosenborg win.\nThe Crues twice came from behind to equalise but after Paul Heatley was sent off at the end of the first period of extra time, the hosts took the game away from them in the second period with Leo Cornic scoring the winner.\nGOAL\nLarne 0-3 Ballkani (Agg:0-6)\nA Ballkani counter-attack puts this one to bed in less than 30 seconds from the restart.\nAlmi Kryeziu with the driving run down the left-wing before finding Albion Rrahmani in the area who slots past a helpless Rohan Ferguson.\nPost\nRosenborg 3-2 Crusaders (Agg: 5-4)\nRosenborg miss a great chance to put the game beyond Crusaders as Adran Pereira fires over the bar from close range.\nAt the other end, the Crues mount a counter-attack and sub Lloyd Anderson has an angled shot well saved.\nGOAL\nRosenborg 3-2 Crusaders (Agg: 5-4)\nIt's heartache for Crusaders as Rosenborg take the lead for the third time in the match.\nMagnus Holte had a shot that was superbly saved by Jonny Tuffey but the rebound fell to Leo Cornic and he lashed it home off the underside of the crossbar.\nHALF-TIME\nLarne 0-2 F.C. Ballkani (Agg: 0-5)\nChampions Larne go in at the interval 2-0 down and will be kicking themselves after spurning two great chances to open the scoring through frontman Lee Bonis.\nNazmi Gripshi hit two in nine minutes to put Ballkani in control after of fine work from substitute Albion Rrahmani in the lead up to both goals.\nHEATLEY SENT OFF\nRosenborg 2-2 Crusaders (Agg: 4-4)\nA hugely dramatic few minutes just got even more dramatic as Crusaders winger Paul Heatley is sent off after being shown a second yellow card.\nWhat a mad end to the first period of extra time!\nIt wasn't clear, but it looked like the second yellow was given for Heatley, who had just scored the equaliser, wasting time by kicking the ball away.\nFair to say he disagreed with the decision.\nGOAL\nRosenborg 2-2 Crusaders (Agg: 4-4)\nWow!\nA minute after falling behind, Crusaders have equalised through Paul Heatley. What a match this is turning into!\nRichard Lecky crossed from the right and Heatley controlled superbly to create space for himself in the box. He got his shot away well and it took a strong deflection that helped carry it into the net.\nWhat a response from the Irish Cup winners!\nGOAL\nRosenborg 2-1 Crusaders (Agg: 4-3)\nRosenborg score and take the lead in extra-time!\nIsac Thorsvalsson scored the goal with a header but had to leave the pitch after clashing heads with Crusaders keeper Jonny Tuffey as he came out to try and clear the ball.\nCan Crusaders come back from that?\nGOAL\nLarne 0-2 F.C. Ballkani (Agg: 0-5)\nIt looks like there's no way back now for Larne.\nNazmi Gripshi gets his second of the day, slotting past Rohan Ferguson after Albion Rrahmani split the Larne defence to find the frontman with an inch-perfect pass.\nLarne have been the side on top for the majority of this first half but Rrahmani and Gripshi have been the difference for the visitors.", "url": "https://www.bbc.com/sport/live/football/66365144"}