{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:37:13", "date_modify": "2025-05-21 07:37:13", "date_publish": "2025-05-20 15:06:31", "description": "Leicester City news: Analysis of alleged breach of the EFL financial rules", "filename": "sport_football_articles_ce9vv2z0082o_1747813033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7306/live/6d91eb00-3584-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce9vv2z0082o_1747813033.html", "title": "Leicester City news: Analysis of alleged breach of the EFL financial rules", "title_page": "Leicester City news: Analysis of alleged breach of the EFL financial rules - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Leicester City's referral to an independent commission after being charged with an alleged breach of the EFL's financial rules, football finance expert Kieran Maguire said: \"It does look as if the Premier League will now pursue a commission for an alleged PSR breach for the three years ended 30 June 2024.\n\"The EFL could, separately, pursue a similar case against Leicester for the three years ended 30 June 2025 should Leicester's financial results end up exceeding the EFL PSR limit, which will be £83m over that period.\n\"Leicester and Bournemouth have previously been found guilty of breaches of EFL PSR rules after they were promoted to the Premier League, and in both cases were given fines.\n\"Had Leicester accepted a points deduction at the start of the season in relation to historic breaches it would not have made much difference to their relegation battle, although they would have potentially finished 19th instead of 18th and received £3m less prize money from the Premier League.\n\"While the Premier League and EFL are in dispute over financial distribution, their willingness to co-operate more in terms of the rules and regulations relating to promoted and relegated clubs will make it more difficult for Leicester to avoid charges by either organisation.\"", "url": "https://www.bbc.com/sport/football/articles/ce9vv2z0082o"}