{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:24:38", "date_modify": "2025-05-19 15:24:38", "date_publish": "2015-03-03 12:05:15", "description": "Dave Whelan resigns from his position as chairman of Wigan Athletic but will remain as owner of the Championship club.", "filename": "sport_football_31711123_1747668278.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81366000/jpg/_81366393_whelan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31711123_1747668278.html", "title": "Dave Whelan: Wigan Athletic chairman resigns after 20 years", "title_page": "Dave Whelan: Wigan Athletic chairman resigns after 20 years - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Dave Whelan has resigned from his position as chairman of Championship side Wigan Athletic.\nThe 78-year-old will stay as owner but his grandson, 23-year-old David Sharpe, will oversee the running of the club.\nWhelan took over at Wigan in February 1995 and oversaw their rise from the fourth tier to the Premier League.\nHe was banned from football-related activity for six weeks and fined £50,000 in December for making racist comments after accepting an FA charge.\nWhelan apologised but denied the remarks he made during a newspaper interview were racist and, prior to his punishment being announced, had stated that he would resign as Wigan chairman if he was \"found guilty of being a racist\".\nThe FA Disciplinary Commission said it was \"satisfied\" Whelan \"is not a racist\" and did not intend to cause offence by his comments.\nSharpe, who was appointed as a director in December, will be formally confirmed as Wigan chairman in the near future.\nWhelan's reign as chairman ends with Wigan 23rd in the Championship and nine points from safety with 12 league games to play, but his impact on the club during his 20 years at the helm has largely been a successful one.\nWigan were bottom of the fourth tier of English football when Whelan purchased the club, but they won three promotions over the next decade to reach the top flight for the first time in their history.\nThe Latics spent eight consecutive seasons in the Premier League between 2005 and 2013 and lifted their first major trophy, the FA Cup, three days before they were relegated from the top division.\nAs well as their success on the pitch, Whelan also funded the construction of a new 25,000 all-seater stadium, which opened in 1999 at a cost of around £30m.", "url": "https://www.bbc.com/sport/football/31711123"}