{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:17", "date_modify": "2025-05-21 06:14:17", "date_publish": "2025-04-01 11:02:44", "description": "England winger Chloe Kelly finds she is \"definitely smiling more\" following her January move to Arsenal from Manchester City.", "filename": "sport_football_articles_cwy69pnkw5ro_1747808057.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7ef2/live/85b78570-0e68-11f0-a16f-bf3e3a129fee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy69pnkw5ro_1747808057.html", "title": "Chloe Kelly: England Lionesses winger 'smiling more' after January move to Arsenal from Man City", "title_page": "Chloe Kelly: England Lionesses winger 'smiling more' after January move to Arsenal from Man City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England winger Chloe Kelly said she is \"definitely smiling more\" since her January move to Arsenal from Manchester City.\nThe 27-year-old said in January she wanted \"to be happy again\" after a difficult first half of the season with City, in which she made just one start in the Women's Super League.\nA deadline day move to Arsenal has so far proved a wise step as it has allowed Kelly to have more regular game time.\nKelly has helped Arsenal reach the Women's Champions League semi-finals, while significantly boosting her Euro 2025 prospects.\n\"I knew I needed to get minutes in my tank and I've definitely done that, so I'm playing with a smile on my face,\" she said in an England news conference.\nThe Lionesses take on Belgium on Friday at Ashton Gate, and face the same opposition again next Tuesday in the reverse leg of a Women's Nations League double-header.\nKelly scored the winning goal in the final against Germany when England created history by winning their first major women's tournament at Euro 2022.\nShe was then a regular in Manchester City's starting line-ups until she struggled for minutes this season.\nIn January, she posted on Instagram that the situation had \"a huge impact on not only my career by my mental wellbeing\" as she expressed her desire to leave.\nAmid heavy speculation, she said her future was not with City and that she wanted to put herself in a position to play for England at this summer's Euros.\nManchester United made an offer for the striker on deadline day that was rejected by City, before Kelly got her move with a loan to Arsenal.\n\"Every decision you make you look back on and hope that it works out for you, and right now I'm enjoying my football and playing plenty of minutes,\" said Kelly.\n\"I'm learning under Renee [Slegers, Arsenal manager] and have now got another opportunity to represent my country.\n\"I'm spending a lot of time with family back down in London and appreciating little things in life.\n\"[It's] important to have a smile on your face as a human. Right now I'm definitely smiling more. I feel really good and I'm happy.\"\nBrighton midfielder Maisie Symonds received her first senior England call-up for the forthcoming matches and explained this week that she almost missed manager Sarina Wiegman's phone call.\n\"The day before, we'd lost a game and I was in a bit of a bad mood,\" Symonds said.\n\"I was about to review the game and I had an unknown caller coming through.\"\nThe 22-year-old suspected it might be \"spam or something\" but chose to answer.\n\"Then Sarina just said, 'Hello Maisie, it's Sarina',\" said Symonds.\n\"I couldn't get the words out to reply to her. I just kept saying, 'Thank you, thank you, thank you'. I almost said, 'Are you sure?'. Luckily I didn't say that.\"\nSymonds attended England's Euros final victory three years ago at Wembley but, unbeknown to her, was suffering with glandular fever at the time.\n\"I just thought I had a cold, but obviously I was going to go to the game,\" she said.\n\"That summer I started pre-season and then it just got worse and worse and worse. I got really, really ill. That was a long thing to come back from.\n\"I think I was out for six months and I got re-injured for most of the season.\"\nOnce a regular for England at youth level, Symonds did not think she would reach the senior squad so soon after her health issues.\nShe said: \"At that moment I probably wouldn't have predicted that I'd be in the squad within a couple of years, but I'm very lucky for the people I've got around me to help me come back from something like that, and I'm really proud to be here.\"", "url": "https://www.bbc.com/sport/football/articles/cwy69pnkw5ro"}