{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:53:56", "date_modify": "2025-04-26 06:53:56", "date_publish": "2025-03-01 00:00:00", "description": "Follow reaction from Saturday's Championship action after Coventry move into the play-offs and Luton climb off the bottom.", "filename": "sport_live_cx2yzxgddqzt_1745650436.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4478/live/8eaca400-f6bf-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_live_cx2yzxgddqzt_1745650436.html", "title": "Championship: Seven games including Middlesbrough v Derby and QPR v Sheffield United", "title_page": "Championship: Seven games including Middlesbrough v Derby and QPR v Sheffield United - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Marching on...\n#bbcefl\nWell February is in the rear-view mirror but March has certainly begun with a bang...\nLeeds saw their lead at the summit chopped back to three points by Sheffield United, who now have a five point cushion of their own in the race for automatic promotion, though third-placed Burnley do have a game in hand after their FA Cup tie today, which ended in disappointment.\nCoventry blazed into the top five after an eighth win in nine, a see-saw 3-2 win at Oxford United, while Blackburn slipped out of the play-off places despite snatching a dramatic point in Valerien Ismael's first game at the helm.\nAt the other end it's been a rare good day for Luton, winners for the first time since 20 December and off the foot of the table after seeing off Portsmouth. Derby fell to the bottom after defeat at Middlesbrough.\nMissing the Championship already? Don't fret, not long to wait, we'll be back on Tuesday night for four more second-tier fixtures, including Burnley's trip to Cardiff and a huge basement battle between Hull City and Plymouth.\nThanks for your company today, we'll see you right back here on Tuesday night. Have a good evening!\n'Disappointed and sad'\nFT: QPR 1-2 Sheff Utd\nQPR\nQPR manager Marti Cifuentes told BBC Radio London:\n\"Disappointed and sad because in many aspects I think we performed at a high level against a very good side. I think we really pushed to get a better result but despite we create more chances and controlled many parts of the game it was not enough.\n\"They scored a quality goal with a great strike but then we kept pushing and dominated large parts of the game. When you play against sides of this quality it is important not to make mistakes and the two goals were something we could have done better.\"\n'We are proud of our away record'\nFT: QPR 1-2 Sheff Utd\nSheffield United\nSheffield United manager Chris Wilder told BBC Radio Sheffield:\n\"It was so disappointing on Monday night because they deserved a little bit more than what happened. It definitely wasn't a 3-1 and we were all pretty down on Tuesday.\n\"But the reaction yet again was first class. It has never been an easy place to come here and we were up against a competitive team. We defended in the second half and maybe learned our lessons a little bit from what happened on Monday night. We still had a threat at the top of the pitch. And Ty's goal was an amazing goal.\n\"I don't agree with the referee over the penalty. He [Harrison Burrows] has turned his back and it's just smashed his arm. We were scratching our heads at the referee's performance from both technical areas today.\n\"But we have done what we needed to do which is get the win. We have the best away record in the division and we are proud of it. It is something we need to hold on to if we are going to keep nudging our points total up.\"\n'The attitude wasn't right'\nFT: Luton 1-0 Portsmouth\nPortsmouth\nPortsmouth head coach John Mousinho told BBC Radio Solent:\n\"It is difficult to sum up really. There was very little in the game. We killed ourselves in the first half, I thought we were dreadful.\n\"I didn't think we did the basics right. The thing that sums up the first half is after about five minutes one of our central midfielders is on a booking for a ridiculous challenge and we are giving away free-kick after free-kick, it is a 180 of the game plan.\n\"The attitude wasn't right. We were much better in the second half but it was too late. It was far from good enough.\n\"I don't think we were getting torn apart by a side that did anything extraordinary, we just made horrendous decisions. The goal came from our free-kick.\n\"Today was a massive opportunity to put a bit of daylight between us and the bottom three and we decided not to take it.\"\n'It is a relief'\nFT: Luton 1-0 Portsmouth\nLuton Town\nLuton boss Matt Bloomfield to BBC Three Counties Radio:\n\"It is a relief to get the first one. It has been too long and took a while. It isn't what I wanted when I joined but it was lovely to share that moment with the supporters at the end.\n\"This result doesn't dissipate the disappointment of recent weeks, that is going to drive us on, but it will build belief.\n\"If you look at recent home games we have started games fast and it is the same today. Getting the first goal proved to be a decisive moment.\n\"I didn't think there were going to be too many goals in it today so to get ahead and give ourselves something to defend was what we needed. I thought the character and discipline in the second half was fantastic.\"\n'They made it difficult for us'\nFT: Middlesbrough 1-0 Derby\nMiddlesbrough\nMiddlesbrough head coach Michael Carrick told BBC Radio Tees:\n\"I think it was a tough game.\n\"I thought we played some good football, especially in the first half, we had some opportunities and they've got as lot to hold on to.\n\"They made it difficult for us and we had to find a way of getting over the line, which we haven't done enough this season, but it was a good step for us.\n\"Everyone played their part and it's just as good winning like that as any other way, to win late in and feel like we've earned it, so a good day.\"\n'Manner we conceded the goal was disappointing'\nFT: Middlesbrough 1-0 Derby\nDerby County\nDerby boss John Eustace told BBC Radio Derby:\n\"I'm very disappointed. I don't think Middlesbrough caused us many problems in the second half and the manner we conceded the goal was disappointing.\n\"In the first half, we had a couple of really good chances on the break but our final pass wasn't good enough. I was pleased with the effort of the group in the second half and I'm just very disappointed that we lost.\n\"This is relentless this Championship. We were up against a top side who could bring on millions pounds worth of personnel off the bench. It was a huge effort from the boys again but I'm disappointed with the goal. There is plenty to work on.\"\n'Last two minutes was like something I've never seen'\nFT: Blackburn 1-1 Norwich\nNorwich City\nNorwich head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"The way we played in the last two minutes was like something I've never seen. We kept giving the ball away in the final third and made silly decisions. If we had just passed the ball to death the game would have been over.\n\"In many ways [it is the perfect away day]. We will look back and to come here and dominate like we did says a lot about where we're at with this group.\"\n'Point feels more like a win'\nFT: Blackburn 1-1 Norwich\nBlackburn Rovers\nBlackburn boss Valerien Ismael told BBC Radio Lancashire:\n\"I wanted to say a massive thank you to the fans for the warm welcome because I feel a positive vibe and energy. And thank you for the players for the great game today.\n\"It was a tough game for us against a tough opponent. We were well-organised until the red card came and changed everything. It meant it was a new game and from there it was tough for the players to concede the goal but they showed good mentality.\n\"In the end, we deserved the point but it feels more like a win because of the boost and the mentality of the players. It shows they are ready to compete in the play-offs.\"\n'Maybe we enjoyed the sunshine too much'\nFT: Leeds 1-1 West Brom\nLeeds United\nLeeds United boss Daniel Farke told BBC Radio Leeds:\n\"Sometimes you have to settle for a draw and we have had to this time against a really good side. West Brom got a foot back into it and you could see it coming.\n\"Tony Mowbray's sides always go for it. They are always brave and have a lot of quality. We had situations to bury the game but the danger was lurking.\n\"You want to win your home games but sometimes if you cannot win you have to make sure you don't lose.\n\"Maybe we were trying to enjoy ourselves a little too much in the sunshine. And, after losing your momentum, sometimes it's hard to win it back.\"\n'We were incredibly competitive'\nFT: Oxford United 2-3 Coventry\nOxford United\nOxford United head coach Gary Rowett told BBC Radio Oxford:\n\"Even in this recent run of form I look at all the games that have been close. It is little moments. I thought we have been incredibly competitive today. You didn't see a team feeling sorry for themselves, we kept going and we kept fighting.\n\"Sometimes it comes down to that little bit of quality like their third goal which was an incredible finish.\n\"But it was nice to get back on it a little bit today and look more dangerous and create more chances.\"\n'I liked our reactions to conceding'\nFT: Oxford United 2-3 Coventry\nCoventry\nCoventry City head coach Frank Lampard told BBC CWR:\n\"We were not at our best today but I think that can happen with these sorts of games. Possibly the early goal gave us a sense that we were really controlling the game but that went away.\n\"At this stage when we are trying to churn out results and points you've got to look at the team when you are not at your best and say 'can you win games?' Three goals and we missed a penalty so we managed to do it.\n\"We lacked that element of control but I liked our reactions to the goals in the second half and the bits of quality.\n\"Jack Rudoni's shoulder dislocated [when scoring]. It popped out and back in again so we will have to have a look at that. Great goal from him and wonderful cross from Tatsu [Sakamoto]. He is looking really sharp at the minute so it will be a shame if we lose him for a bit.\"", "url": "https://www.bbc.co.uk/sport/live/cx2yzxgddqzt"}