{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:33:29", "date_modify": "2025-04-26 07:33:29", "date_publish": "2025-02-27 16:08:14", "description": "The reigning champions face West country rivals Bristol Bears on Sunday for a place in the Premiership Women's Rugby final.", "filename": "sport_rugby-union_articles_cy9ddxqv3w2o_1745652809.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/287a/live/93b86450-f518-11ef-a276-596f7e6218f8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cy9ddxqv3w2o_1745652809.html", "title": "Gloucester-Hartpury: Defending champions 'know how to win' ahead of Bristol semi-final", "title_page": "Gloucester-Hartpury: Defending champions 'know how to win' ahead of Bristol semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Gloucester-Hartpury know the challenge they are up against when they face West Country rivals Bristol Bears on Sunday for a place in the Premiership Women's Rugby (PWR) final.\nThe Bears were the last team to beat the two-time league champions, in a match that also took place on their own turf at Kingsholm in November - rebranded to Queensholm for this weekend's semi-final.\nSince that 19-14 defeat Gloucester-Hartpury have not looked back, winning their past nine games to storm into the league play-offs.\n\"Everybody talks about what you learn from your losses and we learned a lot from our loss that day,\" head of women's rugby Sean Lynn told BBC Radio Gloucestershire.\n\"Everything seems to be going in the right steps [since]. Friday night against Harlequins was really positive. Sport's all about momentum and, hopefully, we can take that momentum from Friday into Sunday.\"\nGloucester-Hartpury are aiming to become the first team to win the PWR title three times consecutively.\nThey finished the regular season at the top of the table for a third straight campaign, with the loss to the Bears before Christmas only their sixth defeat in 54 league matches since the start of 2022-23 season.\nThe hunger for a third title is what has been driving the team, according to prop Maud Muir.\n\"We've experienced it, we know how to win, especially when our backs are against the wall, so I think having those two previous years is so important,\" the England international said.\n\"We know how to win and that's so important and that's what you need to do in knockout rugby, is win.\"\nNo matter the result, Sunday's match will be the last time Lynn takes charge of the team at home before he leaves the club next month to become the new Wales women head coach.\nLynn has been the driving force behind Gloucester-Hartpury's transformation into the dominant team in English women's rugby, having taken charge of the entire women's set-up at the club in 2019.\n\"It's been a great journey, I've really enjoyed it and when I first took the reins at Gloucester-Hartpury it was all about making sure that we can get the pathway right, making sure that everyone coming through the pathway wants to play for Gloucester-Hartpury,\" Lynn said.\n\"We wanted to make Gloucester-Hartpury a very special team and by doing that we've gone back-to-back [titles] and Kingsholm has been turned to Queensholm.\"\nHowever, the Welshman said the focus will not be on him on Sunday.\n\"I've not spoken about it, I'm not going to be speaking about it, it's just that 80 minutes of cup rugby, a semi-final, getting excited.\n\"Driving into the gates it'll be very emotional at times, but it's all about what we do in that 80 minutes.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cy9ddxqv3w2o"}