{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 08:01:13", "date_modify": "2025-04-26 08:01:13", "date_publish": "2025-02-25 10:31:41", "description": "Arsenal will not stop fighting for the Premier League title despite slipping 11 points behind leaders Liverpool, says Gunners boss Mikel Arteta.", "filename": "sport_football_articles_cvgelnlqdelo_1745654473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9d3/live/3f9d5220-f376-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cvgelnlqdelo_1745654473.html", "title": "Arsenal manager Mikel Arteta says club won't give up on Premier League title race", "title_page": "Arsenal manager Mikel Arteta says club won't give up on Premier League title race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Arsenal will not stop fighting for the Premier League title despite slipping 11 points behind leaders Liverpool, says manager Mikel Arteta.\nThe Gunners lost further ground on league leaders Liverpool last weekend following a 1-0 defeat by West Ham at Emirates Stadium.\nOnly three teams in Premier League history have closed a gap of 11 points or more to become champions by the end of the season.\nBut Arsenal still have a game in hand on Arne Slot's side and visit Anfield on 10 May, and Arteta believes his side remain in the title race.\nAsked if he would concede the title, Arteta said: \"Over my dead body. If not I will go home.\n\"Mathematically it is possible. Three days ago we could close a gap and you are like 'you are one and a half games away'.\n\"The difficulty is higher than three days ago but if you are going to win the Premier League you have to do something special.\n\"If you are going to win the Premier League with the circumstances we have you will probably have to do something that nobody else has done in the history of the Premier League.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cvgelnlqdelo"}