{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:42", "date_modify": "2025-05-21 04:03:42", "date_publish": "2025-01-23 22:14:13", "description": "Victor Wembanyama inspires the San Antonio Spurs to a 140-110 victory against the Indiana Pacers at Accor Arena in Paris, France.", "filename": "sport_basketball_articles_cvgp86vz35vo_1747800222.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0d2c/live/8e079ab0-d9d1-11ef-85e4-2f835a169dbb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cvgp86vz35vo_1747800222.html", "title": "NBA: Victor Wembanyama inspires San Antonio Spurs to victory against Indiana Pacers in Paris", "title_page": "NBA: Victor Wembanyama inspires San Antonio Spurs to victory against Indiana Pacers in Paris - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "France's Victor Wembanyama inspired the San Antonio Spurs to a 140-110 victory over the Indiana Pacers at Accor Arena in Paris.\nIn the first of two regular-season NBA games played in the French capital this week, the Spurs ripped up the form book courtesy of Wembanyama, who scored a game-high 30 points.\nWembanyama, 21, played for Paris-based Metropolitans 92 before being selected as the number one overall pick in the 2023 NBA Draft by the Spurs.\nHe was playing in his homeland for the first time since winning a silver medal at the 2024 Paris Olympics.\nIt is the fourth year that the NBA has staged regular-season matches in Paris, with the Cleveland Cavaliers beating the Brooklyn Nets in 2024.\nAs is often the case when the NBA takes to the road in Europe, plenty of high-profile faces turned out to watch, including injured Manchester City midfielder Rodri, Paris-St Germain's Achraf Hakimi, Ousmane Dembele and Presnel Kimpembe and Barcelona trio Pedri, Ferran Torres and Eric Garcia.\nFormer France international footballers Robert Pires and Djibril Cisse and UFC fighter Ciryl Gane were also in attendance alongside former French Prime Ministers Gabriel Attal and Lionel Jospin.\nThe Spurs were underdogs going into the match after losing six of their eight games in 2025, while the Pacers stepped on to court with eight victories from nine since the turn of the year.\nHowever, returning to home soil inspired Wembanyama who put on his highest-scoring performance in eight games.\nSan Antonio's Devin Vassell also chipped in with 25 points and Harrison Barnes added 20 to halt a three-game losing streak.\nThe Spurs, who sit 12th in the Western Conference, and the Pacers, who are fifth in the Eastern, meet again at Accor Arena on Saturday (17:00 GMT).", "url": "https://www.bbc.com/sport/basketball/articles/cvgp86vz35vo"}