{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:45:21", "date_modify": "2025-05-20 11:45:21", "date_publish": "2023-08-06 00:00:00", "description": "Hibernian and St Mirren begin their Scottish Premiership season. Follow radio and text coverage.", "filename": "sport_live_football_66200298_1747741521.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66200298_1747741521.html", "title": "Scottish Premiership: St Mirren earn dramatic victory in thriller", "title_page": "Scottish Premiership: St Mirren earn dramatic victory in thriller - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cheerio\nFT: Hibernian 2-3 St Mirren\nThat's it for the first weekend of the new season and it's been pretty lively.\nCeltic opened with a win, while Rangers slipped to defeat and we were treated to five goals this afternoon at Easter Road.\nRoll on week two...\nPost\nFT: Hibernian 2-3 St Mirren\nStill no sign of anyone from the Hibs coaching staff and Sportsound is now off air.\nLook out for reaction in the match report and on the club page the BBC provides for each Scottish Premiership outfit.\n'It shows how together we are as a squad'\nFT: Hibernian 2-3 St Mirren\n\"First half, we were excellent,\" says a delighted St Mirren boss Stephen Robinson. \"To come here and dominate like we did, to create the chances we did, the game could potentially have been over before half-time.\n\"We were always going to be under pressure for a while. Hibs went very direct to Christian Doidge and he's a big threat. They got back into the game, showed character.\n\"But the character from my players after that. Zach (Hemming) makes a great decision to play it out quickly and it's a super cross from Greg (Kiltie) and a great finish.\n\"Toyosi Olusanya has come back a different man. Alex Greive will have been upset not to get a chance from the start and he comes on to score the winner. It shows how together we are as a squad. That's the most pleasing thing for me.\"\nHibs need more from wide men\nFT: Hibernian 2-3 St Mirren\nJohn Collins\nFormer Hibs manager on BBC Sportsound\nHibs had two wingers on the pitch in the first half (Martin Boyle and Elie Youan) and neither contributed anything. They went up the middle far too often. To win in Europe, they need those wide men to contribute.\nShould Martin Boyle be starting after such a long time out? He looked flat today.\nSwiss mission next for Hibs\nFT: Hibernian 2-3 St Mirren\nHibs will have to find a big improvement for their next assignment, with Swiss side Luzern visiting Easter Road on Thursday for the first leg of their Europa Conference League qualifying tie.\nLee Johnson's side were all over the place in the first half and look very fragile at the back.\nLuzern are 2-1 down away to St Gallen at the moment, with just a few minutes left to play.\nHibs squad still short?\nFT: Hibernian 2-3 St Mirren\nStephen McGinn\nFormer St Mirren & Hibs midfielder on BBC Sportsound\nI don't think Hibs fans will accept inconsistency again this season, with the amount of money spent. For a team that wants to play 4-3-3, they don't have a right-back on the books that the manager trusts. That's a worry.\nI think they have a bit of work to do before the transfer window closes.\nOlusanya takes his chance\nFT: Hibernian 2-3 St Mirren\nToyosi Olusanya was the star of the show in the first 45 minutes, running the Hibs centre-halves ragged and knocking in the second goal.\nThe 25-year-old didn't look like a player who was on loan at Arbroath for the second half of last season, scoring once in 14 appearances.\nAnd remember, he was only added to the starting XI after a warm-up injury for Mikael Mandron.\n'St Mirren didn't wilt under pressure'\nFT: Hibernian 2-3 St Mirren\nStephen McGinn\nFormer Hibs & St Mirren midfielder on BBC Sportsound\nSt Mirren had hardly put a foot wrong before conceding that first goal. Hibs had them on the ropes for a while but that can happen to the best teams in the country here. They held strong, they didn't wilt, didn't concede that third goal - and when Hibs switched off they sensed the opportunity - and what a cross from Greg Kiltie.\nFULL-TIME Hibernian 2-3 St Mirren\nWow! Where do you start? The end is probably the best place, with Alex Greive nodding in the winner on 88 minutes.\nSt Mirren were well worth their 2-0 lead at the interval, albeit the opener came from a very soft penalty.\nThe tables turned in the second half, with Hibs well worth their two goals to level.\nIt looked like the home side had all of the momentum but St Mirren had other ideas.", "url": "https://www.bbc.com/sport/live/football/66200298"}