{"authors": ["Brent Pilnick", "www.facebook.com"], "date_download": "2025-05-21 07:36:59", "date_modify": "2025-05-21 07:36:59", "date_publish": "2025-01-13 16:31:09", "description": "Newly-appointed Plymouth Argyle head coach Miron Muslic says he can secure Championship survival for the club.", "filename": "sport_football_articles_cwy19xdp10wo_1747813019.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6a62/live/1d8a9320-d1c8-11ef-a00c-b776b3393886.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy19xdp10wo_1747813019.html", "title": "Miron Muslic: New Plymouth Argyle head coach targets Championship survival", "title_page": "Miron Muslic: New Plymouth Argyle head coach targets Championship survival - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newly-appointed Plymouth Argyle head coach Miron Muslic says he can secure Championship survival for the club.\nMuslic, 42, has succeeded Wayne Rooney as Argyle head coach with the club three points adrift at the bottom of the Championship.\nHe will take charge of his first game on Tuesday against fellow strugglers Oxford United, four days after the Pilgrims beat Premier League Brentford in the FA Cup for their first away win since April.\n\"It is a challenge no doubt,\" Muslic told BBC Sport.\n\"I think if you just purely look at it without any feelings and you watch the ranking [table], you see it's a task and a challenge, but it's a possible challenge otherwise I wouldn't be here.\n\"I truly believe if we can organise and structure the team in a different way that we are competitive enough to reach all the goals, and the goal is very simple, we want to stay up.\"\nMuslic comes to the Championship as a virtual unknown in England.\nHe led Cercle Bruges to eighth place in Belgium's top flight in his first season in charge in 2023.\nLast season he improved on that as they finished fifth in the regular season before guiding them to fourth place in the end-of-season play-offs.\nIt earned them a place in this season's Uefa Europa League qualifying rounds in which they beat Kilmarnock over two legs before being knocked out by Norwegian side Molde and dropping into the Conference League.\nHe was sacked at the start of last month with Cercle in the relegation play-off places following a loss at bottom-of-the-table Beerschot.\nBut Argyle say they had him on their radar as a possible successor to Rooney - who was only appointed in the summer and won just four Championship matches in his time in charge.\n\"As a club we always go through a very through process, and in this particular case we scoured worldwide really,\" Argyle chief executive Andrew Parkinson said.\n\"We all know that we've always got to have succession planning and we had that very much in mind for a long time.\n\"It was very much a board decision as well, but also involved some football people as well to get a rounded view.\n\"It is a challenge at Argyle, we know we haven't got the biggest budget in the league and we're looking to go further.\n\"We felt that Miron's experience leading a club that was at the bottom of their league and progressing them through was ideal for the position we were in.\"\nMuslic is the fourth permanent manager of Argyle in 13 months.\nSteven Schumacher, who led the Pilgrims to the League One title in 2023, left the club in December of that year to take over as Stoke City boss.\nHe was replaced by former England youth coach Ian Foster, but his three-month tenure saw the Pilgrims drop into the relegation zone, and it was director of football Neil Dewsnip and coach Kevin Nancekivell who guided the side to safety on the final day of the season.\nFormer England skipper Rooney took over in the summer before his half-season in charge which ended on New Year's Eve with the club bottom of the Championship and with the worst defensive record in the English Football League.\nBosnian-born Austrian Muslic is the first foreign manager or head coach ever employed by Argyle.\nBut he believes he is capable of bringing success to the club.\n\"I was asked all the time by colleagues from Austria, from Bosnia, from Belgium, from all over the place, 'where do you see your future? What are you going to do in three years, in five years?'\n\"I was always very clear, it's England,\" he explained.\n\"The way I see football, and especially the way I play football, fits to the English football culture, it fits to the stadium and it fits perfectly to Argyle.\n\"Both competitions are very, very physical, the Jupiler Pro League games (in Belgium) are some of the most physical in Europe.\n\"This (the Championship) is maybe the most competitive league in the world, definitely the most challenging second division in the world where you have teams with a top, top level but also a lot of teams with a similar level.\n\"It's a challenge collecting points, in Belgium, it's the same challenge as collecting points here in the Championship.\"\nBrent Pilnick, BBC Sport, Plymouth\nMiron Muslic has certainly made a good first impression since moving to Home Park.\nA video of a passionate four-minute speech to the players has been widely shared on social media and had positive reactions from the Green Army.\nA relative unknown in England before this appointment, Muslic says he wants Argyle to be more compact and play higher up the field.\nHe goes into his first game against Oxford United on Tuesday with a squad high on confidence after an impressive win at Brentford that has teed up a fourth-round tie at home to top-flight leaders Liverpool.\nBut it is what he can do over the next five months in the league that counts, as Argyle try and claw their way out of the relegation places.", "url": "https://www.bbc.com/sport/football/articles/cwy19xdp10wo"}