{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:07", "date_modify": "2025-05-21 06:22:07", "date_publish": "2025-01-31 12:16:10", "description": "Rangers fan views on win over Union SG", "filename": "sport_articles_cvg4kndd5ylo_1747808527.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/47ef/live/f0b41910-dfc9-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cvg4kndd5ylo_1747808527.html", "title": "Rangers fan views on win over Union SG", "title_page": "Rangers fan views on win over Union SG - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Rangers' 2-1 win against Union SG that earned a last-16 spot in the Europa League.\nHere's what some of you said:\nPeter: A good, hard-fought win, especially against a team like them who are well organised. It's very plain now how much of a defence we really need, I thought the midfield were a bit exposed at times, that's why we need Ianis Hagi on board so he can play in these games. Let's keep Cyriel Dessers as his workrate was good, I'd like someone beside him to pair up.\nLennie: Absolutely fantastic result, ravaged with defensive injuries, where do these performances come from? Definitely need to sign a right-back and another midfielder. Dessers and Hamza Igamane are forming a great partnership, Dessers was immense.\nAllan: A gritty and determined performance with a makeshift defence took Rangers into the last 16. Players who have been berated previously stood up and made it happen. James Tavernier, Nicolas Raskin and Mohamed Diomande were immense, but the man who stood out for me was Dessers. He was everywhere, working very hard and showing plenty of skill. Credit to Philippe Clement.\nBrian: Fortunate to get the win in the end, the defence is so flaky, bordering on panic. Jack Butland always has a mistake in him while Robin Propper is so weak. Great to see John Souttar back. Tavernier played a real captain's role and was easily man of the day. Dessers was excellent, showing real commitment.\nTom: Igamane playing in the wrong position was poor, Nedim Bajrami was invisible, Jefte is a terrible defender and Propper, Tavernier and Butland were weak but we won that game! It's hard to believe watching the panic but we did. Raskin and Diomande were outstanding and Dessers is beginning to believe in himself. With our better defenders we might win more rounds.", "url": "https://www.bbc.com/sport/articles/cvg4kndd5ylo"}