{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:51:40", "date_modify": "2025-05-21 06:51:40", "date_publish": "2025-03-30 00:00:00", "description": "Watch live coverage of Snowboard, Freestyle and Freeski World Championships from St Moritz, Switzerland.", "filename": "sport_live_cwyg424wlwyt_1747810300.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_live_cwyg424wlwyt_1747810300.html", "title": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland", "title_page": "Snowboard, Freestyle and Freeski World Championships LIVE: Watch coverage from St Moritz, Switzerland - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Oh my god, this means everything to me' - Aktins wins women's world freeski halfpipe gold\nGreat Britain's Zoe Atkin pulled off a stunning second run to take freeski halfpipe gold at the Freestyle Ski and Snowboard World Championships in Switzerland.\nThe 22-year-old American-born skier fell at the end of her opening attempt in Engadin but wowed the judges when the pressure was on to score 93.50.\nShe completed the set of medals at the worlds, following up on her silver and bronze at the two previous championships.\n\"Oh my god, this means everything to me,\" said Atkin, who beat China's Li Fanghui by just 0.5, while Canada's Cassie Sharpe claimed bronze with 88.00.\n\"After getting a third and a second, this season I was like 'you know what, I want to go for the gold'.\nRead the full story here.\nWho's in action today?\nBBC Sport\nTaking part in the freeski halfpipe women's final is current 2024-25 Freeski Halfpipe joint-Crystal Globe holder Zoe Atkin. Born in Massachusetts, USA, Atkin represents Great Britain professionally owing to her father being born in England. Atkin made her professional debut at the age of 14 and has gone on to win silver and bronze medals at the World Championships. The Brit made her Olympic debut at the 2022 winter games in Beijing, finishing in ninth place in the final.\nSince, then Atkin has gone from strength to strength, winning gold and silver medals at the 2023 and 2024 X Games in the superpipe event.\nHow to get into winter sports\nGet Inspired\n#GetInspired\nSkiing\nYou fix on a pair of skis to your feet, whilst wearing special boots, and glide down a slope. Many people in the United Kingdom learn the basics of alpine skiing on dry ski slopes or at indoor snow centres, which offer lessons and equipment rental.\nFind your local centre in England,, external Wales, external or Scotland, external to get yourself on the slopes. The Ski Club of Northern Ireland has a useful Facebook page, external too. There's also loads of information at Disability Snowsport, external for anyone looking for inclusive skiing.\nSnowboarding\nSnowboarding will give you an adrenaline rush of speed and you can learn how to do tricks. If you like the cold and being outdoors - although there are indoor slopes all over the country - then give it a go.\nFind your nearest club in England,, externalScotland,, externalWales, external or Northern Ireland., external", "url": "https://www.bbc.com/sport/live/cwyg424wlwyt"}