{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 06:59:46", "date_modify": "2025-05-21 06:59:46", "date_publish": "2025-01-22 15:52:32", "description": "Crystal Palace news: Opinion - The importance of 'elite' Jean-Philippe Mateta to the Eagles", "filename": "sport_football_articles_cdxng0171rvo_1747810786.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b4fc/live/dca69b20-d8d3-11ef-902e-cf9b84dc1357.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxng0171rvo_1747810786.html", "title": "Crystal Palace news: Opinion", "title_page": "Crystal Palace news: Opinion - The importance of 'elite' Jean-Philippe Mateta to the Eagles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jean-Philippe Mateta is continuing to develop into a vital part of Crystal Palace's team and an iconic Premier League striker.\nSince 1 February 2024, Mateta is fifth for goals scored in the league with 22 - behind only Erling Haaland, Cole Palmer, Alexander Isak and Mohamed Salah.\nThat is elite company and this season Mateta has scored 11 goals in 26 games across all competitions.\nBefore his 16-goal haul in the last campaign, the France international had scored just eight goals in three Premier League seasons, but his time on the pitch was inconsistent under Patrick Vieira and Roy Hodgson, starting just 21 games during those periods.\nIn the past two Premier League campaigns, though, he has started 45 games and scored 24 goals - the ratio of an elite forward.\nHe has developed his hold-up play, and his ability to get hold of the ball when the Eagles play direct is crucial to their playing style under Oliver Glasner.\nThe striker is well liked around the training ground - indeed, Glasner said the 27-year-old can be \"too happy\" at times in his post-match interview following the win over West Ham.\nMateta has ambitions to play in Europe and secure a spot in the France squad for the World Cup in 2026, but in his current form his importance for Palace cannot be denied.", "url": "https://www.bbc.com/sport/football/articles/cdxng0171rvo"}