{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:52:23", "date_modify": "2025-05-21 05:52:23", "date_publish": "2025-01-26 00:00:00", "description": "Tottenham suffer a fourth consecutive Premier League defeat as Leicester complete a stunning comeback to climb out of the bottom three.", "filename": "sport_football_live_c93lypjqvxnt_1747806743.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c93lypjqvxnt_1747806743.html", "title": "Tottenham Hotspur 1-2 Leicester City: Jamie Vardy scores as Foxes stun Spurs", "title_page": "Tottenham Hotspur 1-2 Leicester City: Jamie Vardy scores as Foxes stun Spurs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham Hotspur suffered a fourth consecutive Premier League defeat as Leicester City completed a stunning comeback to climb out of the relegation zone.\nThe Foxes, trailing 1-0 at half-time, scored twice in four minutes after the break through Jamie Vardy and Bilal El Khannouss to end a run of seven consecutive defeats in the Premier League.\nBrazil striker Richarlison had opened the scoring for Spurs just after the half-hour mark, heading in a brilliant cross from defender Pedro Porro.\nLeicester captain Vardy equalised from close range a minute into the second half when goalkeeper Antonin Kinsky failed to deal with Bobby De Cordova-Reid's cross.\nRuud van Nistelrooy's side were ahead four minutes later when midfielder El Khannouss curled in a fantastic effort from 25 yards into the bottom corner.\nSpurs poured forward in search of an equaliser but their failure to find one means Ange Postecoglou's side have won just one of their past 11 matches in the Premier League, leaving them in 15th.\nLeicester's win lifts the Foxes into 17th, one point above Wolves - who drop into the bottom three as a result.\nThe anger inside Tottenham Hotspur Stadium was palpable before Leicester's comeback.\nThursday's 3-2 win against Hoffenheim in the Europa League had done little to alleviate the pressure on chairman Daniel Levy.\nThere were chants against Levy from the travelling support in Germany but the animosity towards him reached new levels in north London, as the home fans made their feelings known about the club's progress - or lack of - under his stewardship.\nAs results have worsened over the past few weeks, the pressure has also increased on Postecoglou.\nBut it is clear, from the view of supporters at least, that they feel the problems at the club run far deeper.\nIf the chants were audible when Spurs were winning, they ramped up a notch or two as Leicester took a grip on the game.\nThe Foxes were in freefall before arriving in north London, with manager Van Nistelrooy said to be clinging on to his job.\nThat their victory appeared so comfortable is an indictment not only of Postecoglou, but of the team built by Levy.\nWhile Postecoglou may be running out of credit - Spurs are 15th and have collected five points from the past 33 available - it was Levy who bore the brunt of supporters' anger within the ground.\nWhile results are the main reason for supporter fury, the inactivity of the club in the transfer window is only making things worse.\nCzech goalkeeper Kinsky remains Spurs' only signing of the January transfer window.\nPostecoglou urged the club to show \"urgency\" in the market after the defeat by Everton last weekend.\nWith eight days left in the transfer window, both Postecoglou and Levy are in need of help.\nIf Postecoglou has been feeling the heat, spare a thought for Van Nistelrooy.\nThe Dutchman had guided Leicester to just one league victory in nine matches since taking the hot seat at King Power Stadium.\nHis Leicester side had lost seven league games on the bounce, and defeat in north London would have seen them match a club record of eight consecutive defeats, which was set in 2001.\nReports in the week claimed the former Manchester United forward had a bust-up with midfielder Facundo Buonanotte after the Foxes' defeat by Fulham last week.\nPut simply, the pressure was building.\nEven with Spurs in the form they are in, few expected Leicester to leave the capital with three points.\nBut Van Nistelrooy got the performance - and consequently the result - he has been craving from his players.\nThe former PSV Eindhoven boss has been frustrated with individual errors and lapses in concentration in previous games, which he feels have undermined results.\nBut their display here was the full package for 97 minutes.\nVardy, 38, was a constant threat in behind and didn't allow Spurs' defence to build from the back when Leicester were out of possession.\nHe got his eighth goal of the season by gambling - as he always does - with a run into the six-yard box.\nThe former England striker celebrated like he did when he scored against Spurs in the reverse fixture earlier this season - pointing to the Premier League badge on his arm to remind supporters that he won the league title in 2016.\nIn goal, Jakub Stolarczyk made a number of saves in the first half to keep Leicester within striking distance.\nIt was notable that Van Nistelrooy made a beeline for the Polish goalkeeper on the pitch afterwards.\nIn truth, though, Spurs did not threaten the Leicester goal too much after the Foxes took the lead. Leicester dropped deeper and Spurs applied pressure, but at no point did it feel like an equaliser was inevitable.\nVan Nistelrooy's delight was clear. Not only had he managed to get a tune out of his players, but the result takes the Foxes out of the bottom three.", "url": "https://www.bbc.com/sport/football/live/c93lypjqvxnt"}