{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:43:19", "date_modify": "2025-05-20 11:43:19", "date_publish": "2023-08-06 15:49:31", "description": "Injury-hit St Helens show great character to battle back from behind to beat out-of-form Salford.", "filename": "sport_rugby-league_66397941_1747741399.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/372F/production/_130672141__am20540.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66397941_1747741399.html", "title": "Super League: Salford Red Devils 15-18 St Helens - visitors fight back to claim victory", "title_page": "Super League: Salford Red Devils 15-18 St Helens - visitors fight back to claim victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Injury-hit St Helens showed great character to battle back from 13 points down to beat out-of-form Salford.\nThe home side took a 15-2 lead into the break thanks to tries from Kallum Watkins and Ryan Brierley.\nSaints closed the deficit when Matty Lees forced his way over the line and Tommy Makinson's converted score drew them to within one point.\nThey hit the front with 10 minutes to go through Jack Welsby's effort and held out for the victory.\nLeigh's victory at Leeds meant Saints stay fourth with this win but defeat could have seen them end the day just two points clear of seventh place.\nAs it is, they are now six ahead of Salford, with a game in hand, and any creeping doubts of missing out on a play-off place are all but over, with the Red Devils now having lost their past seven games in all competitions.\nOnce again Paul Wellens' men had to do it the hard way, having edged Leeds Rhinos 22-18 last week.\nSalford put themselves in a good position to claim a first victory since a 42-10 success at lowly Castleford on 9 June after Watkins powered over and Brierley got on the end of a kick to help them to a 13-point lead at the interval.\nThe game swung in favour of the away side after the break though after Dean Cross was sin-binned for the Red Devils and Saints made the extra man count when Lees crashed over.\nMakinson's score closed the lead to just a single point and St Helens kept up the momentum to take the win thanks to Welsby's cleverly taken try.\nSaints face Huddersfield on 13 August in their game in hand on the teams around them, while Salford also face the Giants, and their former coach Ian Watson, in their next match on 18 August.\nSalford head coach Paul Rowley:\n\"That's three home games in a row now where we have been absolutely let down by the officials… it's so hard.\n\"I'm usually quite measured but the gloves are off for me. In the last few games we have been on the wrong side of things.\n\"Pay refs what they're worth to get more people excited about doing it and recruited.\n\"I thought we could have been further ahead. I thought we were the best team throughout, but certainly in the first half.\"\nSt Helens head coach Paul Wellens:\n\"I thought we were absolutely outstanding in the second half.\n\"It was pleasing as a coach that we were able to turn that one around. We put ourselves under pressure from the get-go and Salford are a side with attacking threat who challenge you.\n\"At half-time we said 'we have got to create a game where we are comfortable'. We started to take opportunities and at the back end of the game, we finished a few things off.\n\"We were asking questions and building pressure. When we got that first score we gave ourselves a chance. What we had success with in the second half was being patient and they started to fatigue. It's a blueprint for us.\"\nSalford: Brierley, Sio, Cross, Lafai, Burgess, Croft, Sneyd, Singleton, Ackers, Partington, Watkins, Stone, Addy.\nInterchanges: Ormondroyd, Vuniyayawa, Atkin, Hellewell.\nSt Helens: Welsby, Makinson, Percival, Davies, Ritson, Lomax, Dodd, Lees, Roby, Delaney, Royle, Bell, Knowles.\nInterchanges: Sironen, Norman, Baxter, Mbye.\nReferee: Jack Smith.", "url": "https://www.bbc.com/sport/rugby-league/66397941"}