{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:28:03", "date_modify": "2025-05-20 14:28:03", "date_publish": "2023-07-29 09:59:11", "description": "Newcastle United: Allan Saint-Maximin confirms Magpies exit with social media farewell", "filename": "sport_articles_czrg0k03yryo_1747751283.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eb36/live/6792c220-2df6-11ee-bce6-034a0c6dcbd3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_czrg0k03yryo_1747751283.html", "title": "Newcastle United: Allan Saint-Maximin confirms Magpies exit with social media farewell", "title_page": "Newcastle United: Allan Saint-Maximin confirms Magpies exit with social media farewell - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Allan Saint-Maximin has confirmed he is leaving Newcastle United in an emotional farewell message on social media.\nThe 26-year-old winger is expected to join Al-Ahli in the Saudi Pro League, run by the country's Public Investment Fund (PIF) - which owns the Magpies.\nThe Frenchman has scored 13 goals in 124 appearances after arriving at St James' Park from Nice in 2019.\n\"From the very first months that I met the people of this city, I truly understood them and embraced their unwavering passion,\" said Saint-Maximin.\n\"Believe me, I fell for Newcastle. I had great opportunities to leave during dark days - but that was too late, I was already in love. I wanted, I needed, I had to stay to help save the club from Premier League relegation because it meant the world to me.\n\"I always believed in this club and look where we are today. It's just so beautiful.\n\"I'm leaving Newcastle as it should always have been and that's my greatest trophy because I was a part of it.\n\"Even though this chapter has ended, the story never stops. Newcastle is home now.\n\"I'll continue to be your biggest supporter, I'll watch every game and as long as the club keeps winning I'll be the happiest man in the world.\"", "url": "https://www.bbc.com/sport/articles/czrg0k03yryo"}