{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:55:18", "date_modify": "2025-05-19 14:55:18", "date_publish": "2017-07-04 13:38:13", "description": "World number one Angelique Kerber edges past American qualifier Irina Falconi to reach the second round of Wimbledon.", "filename": "sport_tennis_40496980_1747666518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12A16/production/_96801367_angeliquekerber.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_tennis_40496980_1747666518.html", "title": "Wimbledon 2017: Angelique Kerber struggles to beat qualifier Irina Falconi", "title_page": "Wimbledon 2017: Angelique Kerber struggles to beat qualifier Irina Falconi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World number one Angelique Kerber avoided an early upset as she overcame spirited American qualifier Irina Falconi to reach the second round of Wimbledon.\nKerber, who reached last year's final, has struggled for form in 2017 and lost in the first round of the French Open.\nThough not at her best against world number 247 Falconi, the 29-year-old German came through 6-4 6-4.\nKerber will play Belgium's Kirsten Flipkens for a place in round three.\n\"The first round here is always tough,\" said Kerber.\n\"It was a good match from both of us and it is always good to have a difficult match in the first round. She had nothing to lose; she came from through the qualifiers.\"\nKerber won the Australian Open and US Open in 2016 and reached the final of Wimbledon, where she lost 7-5 6-3 to Serena Williams.\nShe initially showed glimpses of her best form on her return to Centre Court on Tuesday, racing into a 3-0 lead in the first set.\nHowever, 15 unforced errors and an impressive display by Falconi meant Kerber had to work for her place in the second round.\nNine-time Wimbledon singles champion Martina Navratilova\nKerber said the memories of last year's final came back. She came out playing like she did last year in the finals.\nShe needs to get into that mindset more if she wants to get into the final again.\nIt was definitely a much better performance than we have seen so far this year. She still needs to be more aggressive but it was a step in the right direction.\nKerber will lose her number one ranking if she fails to reach the final and one of those who can take it from her, Karolina Pliskova, breezed into the second round.\nWorld number three Pliskova beat Caroline Wozniacki to win the Aegon International at Eastbourne last week and continued her good form with a 6-1 6-4 win against Evgeniya Rodina of Russia on Tuesday.\nMeanwhile, it took Wozniacki three sets to see off the challenge of Hungarian Tímea Babos.\nFormer world number one Wozniacki, currently sixth in the rankings, won 6-4 4-6 6-1.\nPliskova will play Slovakian world number 87 Magdalena Rybarikova in round two while Wozniacki takes on Bulgaria's Tsvetana Pironkova for a place in round three.\nFormer world number one Victoria Azarenka, who has recently become a mother, has complained about the \"tough\" schedule at Wimbledon after having to wait at the All England Club all day on Monday for her first-round match.\nAzarenka, who reached the Wimbledon semi-finals in 2011 and 2012, played on Monday for only the third time since giving birth to her son Leo in December.\nHer match was not scheduled for a specific court on the order of play, filed under 'to be announced'.\n\"I had to be here the whole day, which, for a new mum, is a little tough,\" she said.\n\"Hopefully I won't play like this again.\"", "url": "https://www.bbc.com/sport/tennis/40496980"}