{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:37:54", "date_modify": "2025-05-20 14:37:54", "date_publish": "2023-07-28 13:43:48", "description": "For two decades, whenever Brazilian women's football has been mentioned, one player has sprung to mind - Marta. But with this exciting new generation, that is starting to change.", "filename": "sport_football_66316108_1747751874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6420/production/_130523652_gettyimages-1567345021.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66316108_1747751874.html", "title": "Marta: Women's World Cup contenders Brazil build for future without 'idol'", "title_page": "Marta: Women's World Cup contenders Brazil build for future without 'idol' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "For two decades, one remarkable talent has sprung to mind whenever Brazilian women's football has been mentioned - Marta.\nWhen the forward came off the bench in the final minutes of Brazil's 4-0 victory over Panama to open their Women's World Cup campaign, it marked the sixth global tournament in which she has played.\nIn Australia and New Zealand she is looking to become the first player to score at six World Cups - male or female - to go with her status of record World Cup goalscorer of any gender, with 17 strikes from 21 matches.\nWhat is more meaningful than the stats, however, has been 37-year-old Marta's impact on Brazilian culture.\n\"My wife idolises her,\" South American football expert Tim Vickery told BBC Radio 5 Live's Football Daily. \"My wife was prevented from playing football by her brother.\n\"If her father had found out she was trying to play football he would have thrashed her. Working-class Brazil, women don't do that.\n\"Marta has changed that. She had to fight her brothers to play football. But what she has done with the supporting cast of [former Brazil internationals] Formiga and Cristiane, she has legitimised women's football in Brazil to an extent that the country is now behind it like never before.\"\nBrazil's TV Globo reported an average of 11.5 million viewers watched the game against Panama on Monday,, external which kicked off at 8am local time, while civil servants are being allowed to report to work late when the national team are playing.\nAmid the progress and good feeling around women's football, it is easy to forget how the sport was treated within living memory for many people worldwide.\nIn Brazil, women's football was officially banned between 1941 and 1979, but even after that it was underfunded and ignored.\nThe country's present women's football league did not exist until 2013, with a previous attempt at a national competition running from 1993 until 2001.\nVickery says that doesn't even begin to tell the story of how the country, which has produced five men's World Cup winning teams, treated its female players.\n\"Go back to just before Marta - 1996, the first time women's football was in the Olympics,\" Vickery said. \"The women flew economy class, the men obviously first class. The women are using equipment which was hand-me-downs from the men.\n\"The team were only given enough pennants - the ones the captains exchange before matches - for the group games. They qualified from the group, so the goalkeeper had to teach the captain enough English to apologise to her opposite number - 'Sorry, we don't have any pennants left'.\"\nThis was the scene Marta arrived into in 2002, when she made her senior Brazil debut. Some 176 games and 115 goals later, the circumstances for the team are very different.\nNot only are the Brazil side well funded and well supported, as Vickery says, but they absolutely believe they can win their first Women's World Cup at the ninth attempt.\nBrazil have usually underwhelmed at World Cups, with their only final coming in 2007 - when they lost 2-0 to Germany in Shanghai. In the last two tournaments, they have exited at the last-16 stage.\nBut with double Olympic-winning Swedish coach Pia Sundhage in charge and a series of impressive performances in the build-up - including taking England to penalties at Wembley in the Finalissima - this is a Brazil with renewed belief.\n\"It's got a profile far bigger than ever before,\" Vickery said. \"Even the announcement of the squad was live on TV. It's growing and growing.\n\"There was a moment in the first few years of the century where Brazil were probably the best side in the world, and they kept on falling short at the last hurdle in the World Cup or the Olympics. That was all based entirely on spontaneous appearance of talent, led by Marta. Brazil didn't invest, they were caught up and overtaken.\n\"They have been off the pace badly over the last decade, but now they have brought in Sundhage, who is absolutely steeped in the game as a player and coach. She's got them organised and set up in a different way.\n\"So confidence is sky high, even higher now they have beaten Panama. France next up is a very interesting test.\n\"Brazil really see themselves as one of the candidates [to win the World Cup] and the country is getting behind it, to an unprecedented extent.\"\nWhile this Brazil side may have realistic hopes of reaching a first World Cup final for 16 years, Marta is far from central to their bid.\nThe veteran was on the bench against Panama, sent on with 15 minutes remaining, four goals scored and the points already in the bag.\nShe replaced Ary Borges, who scored a hat-trick and forms part of the exciting new Brazilian guard. Of the 23 women in the squad, 11 are at their first World Cup.\n\"More than anyone else, it is Marta who has dragged this sport along,\" says Vickery.\n\"These days, she is the wise old owl of the team. She can't unbalance defences as she used to, she's not a starter, she comes off the bench.\"\nBrazil face France on Saturday in their second Group F match, knowing a win would put them in the box seat, likely to avoid a match against Germany in the first knockout round.\n\"It is not just about Marta any more - but that is a measure of progress,\" add Vickery. \"Brazil now have other players ready to carry that relay race forward, and they are going to be a real power.\"", "url": "https://www.bbc.com/sport/football/66316108"}