{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:09:37", "date_modify": "2025-05-21 07:09:37", "date_publish": "2025-03-30 11:36:11", "description": "'Yet another meek capitulation by Hearts at Celtic Park'", "filename": "sport_articles_cm243vlwkmzo_1747811377.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e910/live/35755350-0d58-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm243vlwkmzo_1747811377.html", "title": "'Yet another meek capitulation by Hearts at Celtic Park'", "title_page": "'Yet another meek capitulation by Hearts at Celtic Park' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts fans, we asked for your views on the the 3-0 loss to Celtic in Glasgow yesterday. Here's a taste of what you had to say...\nBobster: Tame, gutless, unacceptable. Hearts rolled over again in a predictable 3-0 loss — no fight, no urgency, no pride. Neil Critchley must realise that he is on borrowed time. Fans deserve better than this spineless showing. Why should we accept it?\nJim: Absolutely crazy to move your best defender into midfield against the best team in Scotland. We have no chance of progressing with this guy in charge. Next season will be the same. A mid-table team.\nIan: \"The players did exactly what I asked them to do,\" Critchley said. Did he ask them not to score any goals and concede three by half time? Give us a break! It's been a poor season performance-wise from Hearts, under both managers. The defence is still suspect, midfield over run and poor finishing up front. Two wins will see us in the top six, but then what?\nCounty Jambo: Nothing changes when we go to Glasgow. The shape didn't look right from the off and we took too long to change. Desperate for pace all over the team. Top six is going to be a scrap.\nPeter: Critchley was right to take the initiative and attack from the outset. In doing that, we must capitalise on the chances created, but we did not. Celtic were Celtic, fast at the counter attack, even when under pressure, and our defence is not at full strength.\nThis game was never likely to yield anything and we now focus on winning the next two games as that is all that matters. Results for Hibs and Aberdeen make it much less likely now to secure a European place, but that is not our immediate focus.\nSteve: Our potential player of the year, James Penrice, who plays left-back gets moved into midfield. Our left back yesterday, who's never played in the Premiership gets his debut away to the soon-to-be champions. Playing three central strikers weakened our already static midfield. It looked like a practice match for Celtic. Critchley not the man.", "url": "https://www.bbc.com/sport/articles/cm243vlwkmzo"}