{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:22:09", "date_modify": "2025-05-21 07:22:09", "date_publish": "2025-05-20 07:37:22", "description": "Leicester news: 'Nails a Red Bull can in 10 seconds and goes on to win the game'", "filename": "sport_football_articles_cr4znd5xx6xo_1747812129.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5af4/live/f5ea51a0-348e-11f0-8c0d-7fd09081d16a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4znd5xx6xo_1747812129.html", "title": "'Nails a Red Bull can in 10 seconds and goes on to win the game'", "title_page": "Leicester news: 'Nails a Red Bull can in 10 seconds and goes on to win the game'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Leicester City winger Matt Piper has admitted he will sorely miss commentating on Jamie Vardy.\nThe forward made his last appearance for the club against Ipswich Town and scored his 200th goal in a 2-0 win. Earlier this season, Vardy announced that he would be leaving the club at the end of the campaign.\n\"It's felt like a brilliant day,\" Piper told BBC Radio Leicester. \"I know we have been relegated this season, and it has been a desperately poor season.\n\"But the GOAT - Jamie Vardy - getting to 200 goals in the way and the manner he did it, the player he has been for this club, you have to forget about the relegation for just a day and think about Jamie Vardy.\n\"The incredible player he has been for this football club for the past 13 years - 500 appearances, 200 goals, Premier League, an FA Cup, Community Shield, going deep into the Champions League. He's been a colossal player over the years, the greatest to ever do it in a Leicester T-shirt and he will be missed.\n\"He will certainly be missed by me - said it many times, he's been my favourite player to commentate on over the years. As we sort of head into an era where not that many characters are left in top-flight football, he's definitely one of them.\n\"I am going to miss sitting behind him in a stadium like the Emirates, nails a Red Bull can in 10 seconds and goes on to win the game.\"", "url": "https://www.bbc.com/sport/football/articles/cr4znd5xx6xo"}