{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:39:13", "date_modify": "2025-04-26 07:39:13", "date_publish": "2025-02-27 13:25:53", "description": "Argentina U20s midfielder Claudio Echeverri says he spoke with former Manchester City striker Sergio Aguero before agreeing to join the Premier League club.", "filename": "sport_football_articles_cgl00ze95gno_1745653153.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f6b4/live/33fa7bb0-f505-11ef-9808-4d9b058d1a40.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgl00ze95gno_1745653153.html", "title": "Manchester City: Claudio Echeverri spoke with 'legend' Sergio Aguero before agreeing move", "title_page": "Manchester City: Claudio Echeverri spoke with 'legend' Sergio Aguero before agreeing move - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Argentina U20s midfielder Claudio Echeverri said he spoke with former Manchester City striker Sergio Aguero before agreeing to join the Premier League club.\nCity signed Echeverri for £12.5m from River Plate in January 2024 on a four-and-a-half-year deal, but loaned him back to the Argentine club to continue his development.\nHe spent the start of 2025 at the South American Under-20s Championship, captaining Argentina to a runners-up finish.\nEcheverri, 19, is the 12th Argentine to sign for Manchester City and is now available to play for the club having joined up with Pep Guardiola's squad.\n\"I've spoken to [Sergio] Aguero, I knew about it [the relationship between Argentina and Manchester City]. Aguero, in particular, stands out,\" Echeverri said.\n\"He's a legend here at Manchester City because of everything he achieved and the incredible player he was.\"\nFormer Manchester City defender Martin Demichelis gave Echeverri his senior debut at River Plate in June 2023.\nEcheverri scored four goals across 48 appearances for the Buenos Aires club.\n\"Football has been my life, and my dream was to play for one of the best teams in Europe. Today I am closer to that dream,\" Echeverri added.\n\"Manchester City are one of the best teams in the world. Not only do they win trophies, they play the game so beautifully. They are an example to everyone – they show people how to play football the best way.\n\"My family and I are so proud to be here. My focus now is on working as hard as I can in training to show the manager and his staff I am good enough to be part of this team.\"\nCity also signed Argentina forward Julian Alvarez, who has since departed for Atletico Madrid in an £81m deal, in a similar deal from River Plate in January 2022.\n\"Claudio is one of the finest talents to emerge from South America in recent years. We knew as soon as we watched him play we wanted him to become a Manchester City player,\" said Txiki Begiristain, City's director of football.\n\"All the natural elements are there - his touch, technique, eye for goal and dribbling ability. Our job now is to take those attributes and shape Claudio into a world-class player.\n\"We will provide him with everything he needs to become the best he can be. If he works hard, listens to Pep and gives absolutely everything, I see no reason why he cannot become a top player.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgl00ze95gno"}