{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:36:40", "date_modify": "2025-05-20 13:36:40", "date_publish": "2023-08-01 16:46:43", "description": "Tiger Woods joins the PGA Tour's Policy Board as a player director in a move which will give golfers more control over major decisions.", "filename": "sport_golf_66376028_1747748200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/FC44/production/_130608546_gettyimages-1479374223.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66376028_1747748200.html", "title": "Tiger Woods joins PGA Tour's board as player director in move to give players more control", "title_page": "Tiger Woods joins PGA Tour's board as player director in move to give players more control - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tiger Woods has joined the PGA Tour's Policy Board as a player director in a move which will give golfers a bigger say in major decisions.\nWoods' appointment follows the merger between the Tour, Saudi Arabia's Public Investment Fund and the DP World Tour in June that left players blindsided.\nThe 15-time major winner becomes the board's sixth player director, joining Rory McIlroy and four others.\n\"I am honoured to represent the players of the PGA Tour,\" said Woods, 47.\n\"This is a critical point for the Tour, and the players will do their best to make certain that any changes that are made in Tour operations are in the best interest of all Tour stakeholders, including fans, sponsors and players.\"\nThe players will work with Tour commissioner Jay Monahan to amend the policy board's governing documents so \"no major decision can be made in the future without the prior involvement and approval of the player directors\".\nWoods joins fellow players McIlroy, Patrick Cantlay, Charley Hoffman, Peter Malnati and Webb Simpson on the board.\nIn addition to the the six player directors, the other board members are five independent directors, and the PGA of America director.\nThe player directors will have full transparency and the authority to approve or decline any potential changes to the Tour as part of the Framework Agreement discussions.\nTwo months ago the golf world was left stunned by the announcement of a partnership between the PGA Tour and Saudi Arabia's Public Investment Fund, which controls LIV Golf.\nThe surprise announcement came after a year of unprecedented disruption in the men's game following the launch of LIV Golf, with many top players lured its huge prize funds.\nMasters champion Jon Rahm said players felt a sense of \"betrayal\" that the merger was negotiated in secret, with Monahan facing calls to resign.\nOlympic champion Xander Schauffele also said before last month's Scottish Open that he and other players had lost a lot of trust in Monahan.\n\"I am committed to taking the necessary steps to restore any lost trust or confidence that occurred as a result of the surprise announcement of our Framework Agreement,\" said Monahan.\n\"My job in the negotiations - in partnership with our player directors, PAC (Player Advisory Council) and the broader membership - is to advocate for what is best for the PGA Tour members today and in the future.\n\"Any agreement we reach must be shaped by our members' input and approval earned through our player directors.\"\nThe Tour says 41 players have expressed support for the board changes, including McIlroy, Schauffele, Rahm, Jordan Spieth, Justin Thomas, Shane Lowry and Matt Fitzpatrick.", "url": "https://www.bbc.com/sport/golf/66376028"}