{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:56", "date_modify": "2025-05-21 04:07:56", "date_publish": "2025-04-06 14:25:23", "description": "Kilmarnock fan views: 'Findlay superb & outstanding McKenzie set tone'", "filename": "sport_articles_cglxyg8456wo_1747800476.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c2d2/live/891743f0-12d6-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cglxyg8456wo_1747800476.html", "title": "'Findlay superb & outstanding McKenzie set tone'", "title_page": "Kilmarnock fan views: 'Findlay superb & outstanding McKenzie set tone' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Kilmarnock's 2-0 win against Motherwell.\nHere's what some of you said:\nAmy: As much as Derek McInnes deserved criticism last week, he deserves praise for the win. A brave decision and bringing Rory McKenzie back into the midfield was a masterstroke. Sending off similar to what Corrie Ndaba went for last season so rules are rules. Would rather be in this fight with McInnes than nearly anyone else.\nPeter: Great all-round display from Killie. Stuart Findlay was superb and McKenzie was outstanding and set the tone. Let's take all the positives from this performance and finish the season strongly. Come on Killie.\nAnna: A much better performance and a much more solid defence than we've had. Midfield were decent enough and it was nice to see Bruce Anderson up front with Fraser Murray. And with Kyle Vassell fit again, I feel we have a pretty good chance of avoiding the dreaded relegation play-offs, onwards and upwards.\nRobert: Much improved performance. More energy throughout the team and great to see Danny Armstrong more like himself. Never seen a referee stop a game to allow the goalkeeper to go to dressing room for new gloves? Are gloves compulsory? Not the only weird decision from ref.\nRobert: It was good to have a win, another abysmal refereeing performance, however, it is nice to see Kilmarnock getting a break. Same ref missed the assault on Vassell when playing St Mirren. More fight and glad Findlay and McKenzie were playing.", "url": "https://www.bbc.com/sport/articles/cglxyg8456wo"}