{"authors": ["Matt Gault", "www.facebook.com"], "date_download": "2025-05-21 05:42:37", "date_modify": "2025-05-21 05:42:37", "date_publish": "2025-02-08 20:55:06", "description": "Having already lost Mack Hansen to injury, Ireland are ready for what promises to be another chaotic Six Nations visit to Scotland on Sunday.", "filename": "sport_rugby-union_articles_cq5g141evjpo_1747806157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d72/live/1375f7e0-e65d-11ef-ab42-9dcb25383700.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cq5g141evjpo_1747806157.html", "title": "Six Nations 2025: Ireland braced for more Murrayfield chaos in Scotland showdown", "title_page": "Six Nations 2025: Ireland braced for more Murrayfield chaos in Scotland showdown - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Drama has usually followed Ireland to Murrayfield in recent years.\nEight years ago, it was the now-infamous 'busgate' episode, when Ireland's transport to take them to the stadium on gameday showed up late on, eating into the team's warm-up and enraging the notoriously meticulous Joe Schmidt.\nScotland beat Ireland 27-22 that day thanks to a couple of late Greig Laidlaw penalties. The Irish never fully recovered from that opening-weekend defeat as England won the title.\nTwo years later, the then Grand Slam holders' hopes of leaving Edinburgh with victory were again threatened when talismanic fly-half Johnny Sexton succumbed to injury just 24 minutes in, only for Schmidt's side to prevail 22-13.\nIn 2021, at the end of another hectic afternoon, Ireland needed Sexton's nerveless late penalty to eke out a 27-24 victory.\nPeak Murrayfield mayhem followed in 2023.\nTwo wins from a Grand Slam, Ireland lost both starting hooker Dan Sheehan and his replacement Ronan Kelleher to injury, leading to a hastily cobbled-together rejig in which prop Cian Healy scrummaged as a hooker and flanker Josh van der Flier threw the line-outs.\nCaelan Doris and Iain Henderson also went off hurt inside the opening 25 minutes, but as they often do, Ireland navigated the tumult and won 22-7.\nEarlier this week, scrum coach John Fogarty recalled his panic during the 2023 game and how head coach Andy Farrell surprisingly revelled in the moment.\nWhile Farrell is, for now, shielded from the stresses of organising a group of players for a Six Nations fixture, his interim successor Simon Easterby has been forced into a late reshuffle following Mack Hansen's withdrawal on the eve of the game, with Calvin Nash promoted to the line-up.\nEasterby will hope Hansen's troubles are not a portent for what lies ahead on Sunday with Ireland aiming to overcome a significant hurdle in their quest for a third successive title.\nEngland's thrilling victory over France on Saturday only heightens the stakes. With a bonus-point win at Murrayfield, Ireland will be in the driving seat heading into the down week.\nAs has been widely discussed this week, Ireland's recent record against the Scots is remarkable. They lead 21-4 in Six Nations meetings and have won the past 10, the latter run including a couple of World Cup wins and an Autumn Nations Cup success.\nIn fact, not since that infamous 2017 game have Scotland - then managed by Vern Cotter - got one over on their Celtic cousins.\nIreland, however, have been keen to distance themselves from chat about winning streaks and psychological edges all week. Plenty has been said in the past, but a pre-match war of words has certainly not been forthcoming this week.\n\"I don't think there's any room for that [complacency], given the respect we have for them,\" Ireland skipper Doris said on Saturday.\n\"You hear that outside noise about our record against them, but it hasn't been talked about in here and we've been preparing for a proper Test match.\n\"We've seen what they've been about over the last number of years, most recently last weekend. Especially at home there's that extra element.\"\nDoris is right to point out Scotland's recent form. After losing to Ireland in the final Six Nations game last year, they have won eight out of their past nine Tests and claimed Australia's scalp in November a week before Ireland edged past them.\nThe potency of the Scottish backline - even without injured centre Sione Tuipulotu - has been a big point of focus, too.\n\"Their attack is very dangerous,\" added Doris, who made his Ireland debut against Scotland in 2020.\n\"They attack with quite a bit of width and flair. Their counter-attack, with the wings and back three in general.\n\"You're seeing some of the tries Duhan van der Merwe has scored, Darcy Graham as well is a massive threat and Blair Kinghorn, too. We'll have our hands full.\"\nIn an attempt to withstand the Scots, Easterby has reinstalled firebrand flanker Peter O'Mahony to the starting line-up for the first time since last summer.\nO'Mahony has history in this fixture, and given it will be his first start since being replaced by Doris as captain, the Munster veteran will not be short of motivation.\n\"He loves these games, obviously he loves the Six Nations, he loves representing the nation, and he always adds something different, something a little bit special,\" observed Doris.\n\"He's got 110 caps, 111 tomorrow, so a wealth of experience there, and just a good fella to have around camp. Last week, he was great even though he wasn't involved.\n\"There is a bit of an added edge from him this week as well. He's always someone who I enjoy having alongside me in the back row.\"\nO'Mahony's return adds even more know-how to an Irish side packed with experience, the 23-man matchday squad totalling 1,220 caps compared with Scotland's 864. Fly-half Sam Prendergast is the outlier. It will be the 21-year-old's first away game for Ireland and Scotland will undoubtedly set out to unsettle him.\nIreland's experience told against England, especially during a dominant second half when Jack Conan and Dan Sheehan made huge impacts off the bench.\nNot short of Test experience either, Scotland are also hardened by previous pain at Irish hands. Townsend set up defensively in Dublin last year, but stirred by the home crowd, his side may go all-out to make it another frantic afternoon for Ireland.\nIt will not be anything Ireland have not encountered in the Scottish capital before.\nNavigate the mayhem once more and they will be this weekend's big winners.", "url": "https://www.bbc.com/sport/rugby-union/articles/cq5g141evjpo"}