{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:03:32", "date_modify": "2025-05-21 04:03:32", "date_publish": "2025-01-15 09:14:45", "description": "Northern Ireland will face Sweden in March as Michael O'Neill's team prepare for the start of World Cup qualifying.", "filename": "sport_football_articles_c99yry1kdj9o_1747800212.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e03c/live/47d0ecb0-d1cd-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c99yry1kdj9o_1747800212.html", "title": "Northern Ireland: Michael O'Neill's side to face Sweden in March", "title_page": "Northern Ireland: Michael O'Neill's side to face Sweden in March - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Northern Ireland will face Sweden in March as Michael O'Neill's team prepare for the start of World Cup qualifying.\nThey will travel to Stockholm on 25 March to face the side currently 27th in the world rankings at the Strawberry Arena.\nPlans for a second friendly match to be played before the trip to the Swedish capital are still to be confirmed by the Irish Football Association [IFA].\n\"The game will be a great opportunity to test ourselves against a higher ranked team similar to what we will face in World Cup 2026 qualification,\" O'Neill told the IFA website.\n\"We have made progress in the last 12 months, continuing to introduce younger players into the squad and developing a system and style of play.\"\nNorthern Ireland had a strong 2024 as they topped their Nations League group.\nThe standout result for O'Neill's youthful squad was a 5-0 win over Bulgaria in Belfast in October as Isaac Price scored a hat-trick.\nConor Bradley scored the winning goal as NI collected an impressive friendly win in Scotland in March.\nNorthern Ireland begin their World Cup qualifying campaign in Luxembourg in September.\nSweden last faced Northern Ireland in a Euro 2008 qualifier when the sides drew 1-1. Earlier in the campaign David Healy scored a famous double in a 2-1 win at Windsor Park.\nAs well as the friendlies in March, Northern Ireland will also discover their final opponent in World Cup qualifying as Italy and Germany face off in the Nations League play-off.\nThe winner of that tie will join Northern Ireland, Luxembourg and Slovakia in Group A.", "url": "https://www.bbc.com/sport/football/articles/c99yry1kdj9o"}