{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:31:05", "date_modify": "2025-05-19 14:31:05", "date_publish": "2017-08-26 00:00:00", "description": "Text, images and social media reaction as Floyd Mayweather beats Conor McGregor in Las Vegas to record his 50th professional win.", "filename": "sport_live_boxing_40874881_1747665065.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_live_boxing_40874881_1747665065.html", "title": "Floyd Mayweather v Conor McGregor", "title_page": "Floyd Mayweather v Conor McGregor - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Thanks and goodbye\nWhat a night / morning it has been.\nOn the undercard, Nathan Cleverly lost his WBA light-heavyweight title, but Savannah Marshall made a winning start to her professional career, before Gervonta Davis won, although he he had lost his IBF super-featherweight title the day before when he failed to make the weight.\nAnd the main event did not disappoint. Many gave Conor McGregor no chance, but he made a bright start, before Floyd Mayweather's experience and skill proved crucial as he stamped his authority on the fight before forcing a stoppage in the 10th round.\nHope you all have enjoyed it as much as we have. Thank you for joining us and for all your comments. That concludes the end of this page, so until next time, bye for now.\n'I want to thank all the fans from Ireland'\nMayweather beats McGregor with a 10th-round stoppage\nSome more quotes from the winner Floyd Mayweather. He says: \"I want to thank all the fans from Ireland and all the fans around the world for coming to see this event. I couldn't do any of this without the fans.\n\"Our game plan was to go straight ahead. I said numerous times that I wouldn't back down and that's what I did.\"\nMcGregor v Malignaggi next?\nWhat Mike is referring to is what has been a bizarre sideshow in an already bizarre event.\nAmerican boxer Paulie Malignaggi, a two-weight world champion, was helping Conor McGregor by sparring with him. That was until pictures appeared on social media of Malignaggi seemingly being floored by the Irishman.\nMalignaggi claimed he had only been pushed to the canvas, then the UFC's Dana White produced this video of the pair boxing together.\nThis X post cannot be displayed in your browser. Please enable Javascript or try a different browser.View original content on X\nThe BBC is not responsible for the content of external sites.\nSkip X post\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nThe BBC is not responsible for the content of external sites.\nEnd of X post\nMalignaggi was not exactly impressed with that and now says he wants to fight McGregor on St Patrick's Day - Saturday, 17 March, 2018.\nCould it happen? The fact McGregor put up a good show against Mayweather has probably increased the chances significantly.\n'McGregor is a huge attraction in boxing'\nMike Costello\nBBC Radio 5 live boxing commentator in Las Vegas\nBoxing's reputation wouldn't have been damaged at all by tonight because what we have seen is Conor McGregor show that it is possible to switch between codes.\nConor McGregor is now a huge attraction in boxing. This is my first introduction to a UFC fighter so I won't comment on where he will go with them, but I can see another future boxing contest for McGregor.\nYou've seen the sparring videos and their fall-out, so now Conor McGregor v Paulie Malignaggi on St Patrick's Day next March is a legitimate fight. The build-up for that starts now.\n'Let the man put me down'\nMayweather beats McGregor with a 10th-round stoppage\nSome quotes now from Conor McGregor: \"I took the early rounds pretty handy, he adjusted. He's composed - not that fast or powerful, but boy is he composed and he was making me throw.\n\"Fair play to him, what a career he's had. I thought it was a little early with the stoppage. I would have liked to have hit the floor, he [the referee] should have let me keep going. I was just a little fatigued. He was a lot more composed under the shots - that's what 50 professional fights will give you.\n\"I've been strangled on live TV and came back, so I would have liked him to have let it go. It was some buzz. I thought we were close. It was fatigue. The referee could have let it keep going, let the man put me down.\n\"No-one is taking these kind of risks. I'll take it on the chin, it's another day for me.\"\n'This was my last fight. I chose the right dance partner'\nMayweather beats McGregor with 10th-round stoppage\nSome post-fight quotes from Floyd Mayweather. He said: \"McGregor is a tough competitor and we gave them what the fans wanted to see - I owed them for the Manny Pacquiao fight.\n\"He [McGregor] was a lot better than I thought. He was a tough competitor, but I was the better man. Our game plan was to take our time, let him shoot his heavy shots and take him out at the end.\n\"In the MMA, he fights 25 minutes really hard, and after 25 minutes he starts to slow down. I guaranteed everybody this would not go the distance. Boxing's reputation was on the line.\"\nOn his record of 50-0, beating Rocky Marciano's 49-0, Mayweather added: \"Rocky Marciano is a legend and I look forward to going into the hall of fame one day.\n\"This was my last fight tonight, for sure. I chose the right dance partner. Conor McGregor, you are a hell of a champion.\"\n'McGregor gave Mayweather something to think about'\nSteve Bunce\nBBC Radio 5 live boxing pundit in Las Vegas\nThe stoppage was too early but only by a second or two because McGregor had absolutely nothing left.\nBut what he did have was pure heart and guts. Nobody expected how he came out in those first three rounds.\nFrom round four, Mayweather turned this fight on its head and what a relief it must be for him because McGregor, with the little boxing ring experience he has, did give him something to think about during the fight.\n'Mayweather's smile is one of relief'\nMike Costello\nBBC Radio 5 live boxing commentator in Las Vegas\nIt has been a truly astonishing night. I thought my enjoyment of the fight week will have ended last night but we have had a truly memorable Vegas fight night from two remarkable men.\nBoxing skills are like the elastic in your socks, you'll always have them. Mayweather did try to give us the Mayweather of old but his smile is one of relief as much as celebration.\nMAYWEATHER WINS\nRound 10:\nFloyd Mayweather wins it. He has a 50-0 record. It was a brave, brave effort from Conor McGregor, but in the end Mayweather was just too good.\nThe end comes early in the 10th round. Mayweather attacks again and referee Robert Byrd dives in to save McGregor from any more punishment.\nA powerful straight right sends McGregor spiralling backwards around the ring, Mayweather lands another two brutal shots to the head, with McGregor dazed and not firing anything back, it is all over.", "url": "https://www.bbc.com/sport/live/boxing/40874881"}