{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-05-21 06:01:33", "date_modify": "2025-05-21 06:01:33", "date_publish": "2025-04-01 22:42:51", "description": "Makeshift striker Harry Maguire coming closest to rescuing a point for Manchester United at Nottingham Forest illustrates the attacking struggles of Ruben Amorim's side.", "filename": "sport_football_articles_cjew38v32ddo_1747807293.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4313/live/13c17be0-0f46-11f0-801a-296f2b6075c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjew38v32ddo_1747807293.html", "title": "Manchester United lose at Forest: Is Harry Maguire up front a sign of their demise?", "title_page": "Manchester United lose at Forest: Is Harry Maguire up front a sign of their demise? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With Manchester United trailing 1-0 to Nottingham Forest and needing a goal to avoid a 13th defeat of the season, manager Ruben Amorim turned to the bench.\nHe had already withdrawn Joshua Zirkzee - scorer of three league goals since completing a £36.5m move to Old Trafford last summer - in favour of Rasmus Hojlund, who has contributed 13 league goals since United spent £72m on him in 2023.\nWith other attacking options scarce, Amorim took an approach familiar to coaches at all levels of the game - send on the big man.\nIn fairness, Harry Maguire almost came good as a makeshift striker, his bundled effort in the seventh minute of injury time beating Matz Sels but not fellow centre-back Murillo on the goalline.\nMaguire registered more shots on target during his nine-minute cameo (one) than Zirkzee in 78 (zero) and Hojlund after coming on at the break (zero).\nLittle illustrates United's desperation better than a 32-year-old centre-back being their most threatening weapon in the opposition penalty area.\n\"We tried with good opportunities, but in the last third, the last pass, the last assist wasn't there. Then if we don't have that we cannot score goals,\" Amorim told TNT Sports after the game.\n\"This season is like that. We had a lot of shots on goal, we pushed the opponent to the last third, but in the last third we had a lack of quality.\n\"We know the characters of the [Forest] team and one goal can put them in one situation that they love. We have to score two goals to win a match and that is frustrating as it was the beginning of the game. We helped them to win three points.\"\nGoals are clearly a problem for United - they have scored 37 in 30 league games this season, and are on track to beat their lowest Premier League goals return of 49 set in 2015-16.\nBut goals are far from the only metric that illustrates United's struggles. Are Amorim's side set for their worst Premier League campaign?", "url": "https://www.bbc.com/sport/football/articles/cjew38v32ddo"}