{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:51:29", "date_modify": "2025-04-26 07:51:29", "date_publish": "2025-02-25 15:07:53", "description": "Peterborough United boss Darren Ferguson urges his players to be \"brave\" in order to prevent a Birmingham City v Wrexham final in the EFL Trophy.", "filename": "sport_football_articles_c62z736v26ro_1745653889.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e073/live/aca8a810-f367-11ef-b035-1784fd736ed6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c62z736v26ro_1745653889.html", "title": "Darren Ferguson: Peterborough must 'be brave' in EFL Trophy semi-final", "title_page": "Darren Ferguson: Peterborough must 'be brave' in EFL Trophy semi-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Peterborough United boss Darren Ferguson has urged his players to be \"brave\" in order to prevent a Birmingham City v Wrexham final in the EFL Trophy.\nPosh travel to north Wales on Wednesday, one step away from a return visit to Wembley, where they won the competition by beating Wycombe Wanderers 2-1 in last year's final.\nBut they will have to find a way to unlock the Wrexham defence, having failed to score in either league game against them this season, losing 2-0 at home and 1-0 at the Racecourse Ground in early January.\nFerguson told BBC Radio Cambridgeshire that the \"general perception\" was that most people wanted a Birmingham-Wrexham final because of the extra attention it would attract.\nBut he believes his young side may have an edge in fitness over some opposing sides in the final three months of the 2024-25 campaign.\n\"It's absolutely pivotal that we start using our youth, our energy and how athletic we are because at this time of the season teams will be getting tired,\" he said.\n\"We've got quite a lot of players that are quite fresh - some have had injuries and are fresher than they would have been - so the running stats have got to be right up there because that gives us the best chance of winning.\n\"It's a fantastic chance for us to get back to Wembley. It's exciting, I think it'll be a great atmosphere... we've just got to go there and give a really good performance, a brave performance.\"\nFerguson also guided Peterborough to victory in the 2014 final, when they beat Chesterfield 3-1.\nBut to reach another, he will have to overcome the team for whom he scored the second goal in a 2-0 win over Southend in the 2005 final at the Millennium Stadium in Cardiff - Wrexham's sole success in the competition.\nBased on league form, Wrexham will kick-off as favourites - they are third in League One and pushing for promotion, while Posh are only one place and two points above the relegation places.\n\"It's been a really difficult season for everyone and that (getting to Wembley) would be a real catalyst for us moving forward into the (remaining) league games,\" Ferguson said.\n\"And I do think it would be a big thing for the fans. A day out at Wembley would be a small consolation - and as long as we stay in the league, at least something would will have come of the season.\"\nFive members of the Posh team that started last season's final are no longer at the club, including left-back Harrison Burrows, who scored both goals against Wycombe.\nBut they can make competition history if they reach Wembley and beat Birmingham - who won their semi-final 2-1 against Bradford City last week - on 13 April as no side has ever won in two successive years.\n\"It's always been a tournament I've taken as seriously as I can. Off the top of my head, I've never once gone into one of these games thinking 'we can play around with the team',\" Ferguson added.\n\"I've always had the mindset of winning the first two league [group] games at the start of it and that probably gets you through.\n\"It's been quite a similar run to last season in that we got through our group comfortably, we then had favourable draws and the semi-final was always going to be the hardest game - and that's how it's panned out this season.\n\"Last season, one of our best performances was in the semi-final, so if we can match that again, that gives you a good chance.\"\nDefender Emmanuel Fernandez is available because the league ban he is serving following a red card against Charlton two weeks ago does not apply in the Trophy.", "url": "https://www.bbc.co.uk/sport/football/articles/c62z736v26ro"}