{"authors": ["Glenn Speller", "www.facebook.com"], "date_download": "2025-05-21 06:34:40", "date_modify": "2025-05-21 06:34:40", "date_publish": "2024-12-24 12:54:31", "description": "The first managerial meeting between Frank Lampard and Wayne Rooney headlines a busy day of Boxing Day football in the EFL.", "filename": "sport_football_articles_cy0nk8pqw27o_1747809280.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fdf0/live/cb09d6f0-c1f6-11ef-85a6-81df2cff7ee1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0nk8pqw27o_1747809280.html", "title": "EFL preview: Lampard and Rooney headline Boxing Day bonanza", "title_page": "EFL preview: Lampard and Rooney headline Boxing Day bonanza - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If you'll be waking up on 26 December with the fug of the Christmas Day roast still hanging heavy, wishing you hadn't had that last glass of eggnog before bedtime, what better way could there be to blow away the cobwebs than by digging in to some festive football?\nFortunately, the EFL is on hand to give us all just what we need as, from 13:00 GMT, we can feast on enough drama to get those pulses racing faster than trying to understand the instructions on that new iPad you asked Father Christmas for...\nSomeone at EFL Towers must know a thing or two about the Championship as they have engineered four of the top six meeting each other the day after Christmas.\nThe top four seem to be getting away from the rest and none more so than Sheffield United who are beginning to give out 'inevitable promotion' vibes - despite having two points docked before a ball had been kicked.\nThe Blades are unbeaten at Bramall Lane this season with nine consecutive clean sheets but will surely be stretched when third-placed Burnley pay a festive visit.\nScott Parker has the Clarets purring, on a nine-game unbeaten streak of their own, and they do possess the division's second best away record - yes, Sheffield United fans, you top that table as well.\nIt's 13 seasons since Blackburn Rovers last tasted Premier League football and eight since Sunderland were there.\nBoth clubs have had to dig themselves out of League One in the meantime but a return to the top table for either is not out of the question as they prepare to meet at Ewood Park.\nJohn Eustace had taken Rovers on a six-game winning run before last Saturday's defeat by Millwall but they have hung on to fifth, while fourth-placed Sunderland are unbeaten in their past four with three wins and the top two well within range.\nLeeds United are quietly going about their business in second place although November slip-ups at Millwall and Blackburn have maybe just curbed their efforts to escape those behind them.\nDaniel Farke takes his side to Stoke City, who have managed just one point from a possible 15 and suddenly find themselves only four clear of the drop zone.\nFootball is littered with great players who failed to translate that talent into management - two of England's finest, Bobby Moore and Bobby Charlton, dabbled but quickly realised reputation stands for little when your team doesn't win.\nStep forward Frank Lampard and Wayne Rooney - two of England's best of the recent vintage but finding this head coach lark tricky, although it isn't about to stop them trying as they come face-to-face for the first time as managers.\n\"I have known Wayne well for many years now, have full respect for him, and I look forward to seeing him,\" Lampard said this week.\n\"It was an absolute pleasure to play with him for England - and to play against him. He was a Premier League and England great, and his numbers and performances should never be understated. The level of player he was, was incredible.\"\nLampard's 11-month break from the dugout concluded last month when he took on the job of filling the shoes of the very popular Mark Robins at Coventry City and he has taken seven points from his opening five games.\nRooney's return to management came quicker than his former England colleague as his disastrous spell at Birmingham City failed to deter Plymouth Argyle from handing him the reins in May.\nA run of seven games without a win has every photographer's lens pointing the way of the ex-Manchester United forward and although the 3-3 draw with Middlesbrough failed to prevent them spending Christmas Day propping up the Championship it might give Argyle fans some hope he can turn things around.\nNo matter what happens, you can bet the press box at the Coventry Building Society Arena might be busier than normal.\nUnlike Plymouth, Oxford United and Cardiff City have changed managers this season but they meet on Thursday with both occupying relegation spots.\nThe U's surprisingly dispensed with Des Buckingham despite the boyhood Oxford fan leading them back to the second tier after 25 years away.\nHis replacement is experienced Championship operator Gary Rowett whose job was put into sharp context with last weekend's 4-0 battering at Leeds making it just one point from Oxford's past seven games.\nRowett's first match against Cardiff already has six-pointer connotations with the Bluebirds only above the U's on goal difference and without a victory in nine games.\nHull City hauled themselves out of the relegation zone with a late victory over Swansea on Saturday and they head to a Preston North End side with just one win in their past 12 league outings while Portsmouth, 4-1 winners over Coventry City last weekend, will look to end Watford's unbeaten home record.\nFor all the riches and celebrity owners in League One, it is Stockport County who possess the division's top scorer - well, for the next three games anyway.\nLouie Barry's 14 goals have helped propel last season's League Two champions County into fifth place in the third tier.\nThe on-loan Aston Villa forward has scored 24 goals in 44 appearances for Dave Challinor's side since joining on loan in the summer of 2023.\nHe will return to Villa to \"be assessed\" by head coach Unai Emery but still has three matches to leave Stockport fans with some more happy memories, starting at fourth-placed Huddersfield Town.\nThe Terriers top the division's form table across the past six games and are now in the automatic promotion race.\nBirmingham City put themselves top of the League One tree on Monday thanks to Jay Stansfield's 11th league goal of the season at Crawley and they'll fancy the job at home to struggling Burton Albion.\nSecond-placed Wycombe Wanderers are the surprise package of the season and have not lost an away league game since the opening day - they visit Stevenage.\nThere's also a rematch of one of last season's play-off semi-finals in the north west as Bolton host Barnsley. Wanderers took the honours last season but both are currently outside the top six - eighth against ninth - and the Tykes have just one win from their past seven league outings.\nWith all due respect to the rest of the division a couple of fixtures jump off the page in League Two affecting both ends of the table.\nWalsall against Doncaster Rovers is top against third and with an unbeaten league run of 11 games including four wins on the bounce the Saddlers are going to take some stopping.\nNathan Lowe's 10 league goals have drawn many admiring glances in the direction of the on-loan Stoke forward and it's a worry for Walsall fans.\nGiven the form of his parent club it wouldn't be a surprise if Lowe was recalled in January and thrust into a Championship relegation battle.\nDoncaster ran out of puff in the play-offs last season after a record-breaking run to get into the post-season bun fight.\nTipped to go up this year they are living up to the billing albeit just two wins from the past seven games has found them stuttering more recently.\nIt will hardly be a relaxing Christmas Day for those involved with Carlisle United and Morecambe as the EFL's bottom two meet while desperately trying to avoid slipping through the trapdoor into the National League.\nNormally you will find managers attempting to downplay the significance of an isolated game but Carlisle boss Mike Williamson is almost playing up to it.\n\"I don't need to quantify this game, it's huge,\" Williamson told BBC Radio Cumbria.\nThe Cumbrians know the pain of relegation from the EFL having experienced it back in 2004 while Morecambe are only in their 18th season after winning the play-offs in 2007.\nFestive cheer might be hard to find for the losers at Brunton Park so probably best to wish everyone a Happy Christmas now!\nYou can follow all the EFL coverage on the BBC Sport website with dedicated live text services for the Championship and Leagues One and Two on Boxing Day.", "url": "https://www.bbc.com/sport/football/articles/cy0nk8pqw27o"}