{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:27", "date_modify": "2025-05-21 06:16:27", "date_publish": "2025-03-31 09:15:16", "description": "Ipswich Town forward Natasha Thomas says there will be no let-up in the side's final three games of the season as they move to the brink of promotion.", "filename": "sport_football_articles_clyw35w2j0eo_1747808187.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5712/live/25234430-0e0c-11f0-90cb-6de76cd8d1c0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyw35w2j0eo_1747808187.html", "title": "Ipswich Town Women: Natasha Thomas promises no let-up in promotion push", "title_page": "Ipswich Town Women: Natasha Thomas promises no let-up in promotion push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ipswich Town forward Natasha Thomas insists there will be no let-up in the final three games of the season after they moved to the brink of promotion from Women's National League Southern Premier.\nThe Jamaica international scored both goals in Sunday's 2-0 win over Gwalia United in Felixstowe and three points at Watford next weekend will virtually seal a place in the second-tier Championship next season.\nThey need four points to be mathematically certain of going up but their goal difference is 28 better than second-placed Hashtag United and their three remaining games include a trip to winless MK Dons, who are bottom.\n\"For us as a squad, we're taking each game as it goes because we've come so close a couple of seasons on the trot now,\" Thomas told BBC Radio Suffolk.\n\"We know what we've got to do, we know how many games we've got left, so for me, until it's done we'll keep on providing the goals, keep on providing the performances. We want to ensure we get all the points on the board that we possibly can.\"\nIpswich registered their 15th clean sheet of the season against Gwalia while Thomas' double took her personal goals tally to 16.\nIpswich missed out on promotion two seasons ago on goal difference and victory next weekend would be fitting as it was Watford who pipped them in 2022-23.\nThomas believes extra fitness and conditioning work has really paid off for them this season.\n\"It's just (about) encouraging myself and all my team-mates to keep on doing the right things because it's certainly working, even our max speed and things like that, we're all improving and we're going to need to keep on improving if we want to match that in the Championship,\" she added.\nBoss Joe Sheehan said a 1-0 defeat at Hashtag in their first game of the month had \"galvanised\" his team, who have won four in a row since then and recently attracted a crowd of 10,173 to Portman Road to see them beat Plymouth 3-1.\n\"Our biggest strength is our consistency. If you come and watch us [training] this Tuesday, compared to a Tuesday in October, it's exactly the same attitude, the same way we communicate with each other,\" he added.\n\"They are a really resilient, robust, strong group that like all aspects of the game.\n\"We are absolutely aware we have three games left, we know what we need to do but we won't put any extra pressure or expectation on us to do it next week.\"", "url": "https://www.bbc.com/sport/football/articles/clyw35w2j0eo"}