{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:52:32", "date_modify": "2025-05-21 03:52:32", "date_publish": "2025-02-09 17:23:00", "description": "Manchester City striker Khadija Shaw scores on her return after a mental health break as her side reach the Women's FA Cup last eight.", "filename": "sport_football_articles_cgq0jxkx4nlo_1747799552.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/96c3/live/55908460-e702-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgq0jxkx4nlo_1747799552.html", "title": "Women's FA Cup: Khadija Shaw scores as Man City, Chelsea & Arsenal all progress to last eight", "title_page": "Women's FA Cup: Khadija Shaw scores as Man City, Chelsea & Arsenal all progress to last eight - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City striker Khadija Shaw scored on her return after taking a short break to protect her mental wellbeing after she was subjected to racist and misogynistic abuse.\nShaw, 28, pulled out of Thursday's League Cup semi-final win at Arsenal after the social media abuse she suffered following City's 4-3 defeat by the Gunners in the Women's Super League a week ago.\nShe returned to City's bench on Sunday for their Women's FA Cup fifth-round tie against Leicester.\nThe Jamaica striker, who was introduced at half-time, scored her side's third goal as she nodded home from close range.\nGareth Taylor's side ran out comfortable 3-1 winners with Leila Ouahabi and Kerolin scoring first-half goals. The strike was Brazilian Kerolin's first since she joined from North Carolina Courage in the January transfer window.\nElsewhere, five-time winners Chelsea came from a goal down to beat Everton and keep their quadruple hopes alive.\nThey went behind for the first time at home this season when Sara Holmgaard's free-kick from the right drifted all the way in, but Catarina Macario's penalty pulled them level.\nMayra Ramirez's clever lobbed finish put them ahead before the break, while Maika Hamano's back-post tap-in and Sandy Baltimore's penalty secured the win.\nSonia Bompastor's side are now unbeaten in 23 games. They have a seven-point lead at the top of the WSL and have reached the final of the League Cup and Champions League quarter-finals.\nArsenal, the most successful team in the tournament's history with 14 trophies, won 2-0 against Championship side London City Lionesses, while Liverpool needed two late goals to see off Rugby Borough, who were the lowest-ranked side left in the competition.\nThe WSL's bottom side Crystal Palace overcame Newcastle 2-0, while Sunderland will be the only non-WSL side in the quarter-finals after a 2-0 win at Portsmouth.\nHolders Manchester United and Aston Villa progressed to the last eight on Saturday.\nThe draw for the quarter-finals takes place on the Women's FA Cup YouTube channel from 18:30 GMT on Tuesday.\nLiverpool's trip to third-tier Rugby Borough looked a comfortable one on paper but they struggled to adjust to the 3G pitch and some strong winds.\nThey made nine changes from last week's WSL win over West Ham and a flat performance followed, with Matt Beard's side failing to have a shot on target until the 79th minute.\nBeard made four changes at half-time and their second-half performance was improved with two substitutes securing their passage.\nMarie Hobinger curled home a superb strike from 25 yards, before Mia Enderby smashed in from the right side of the box in stoppage time.\n\"Lee Burch and Rugby Borough deserve congratulations. They had a fantastic performance and they made it difficult for us,\" Beard told BBC Sport.\n\"We know we can do better but the conditions were tough today, cold and windy. It was about getting through to the next round and I'm pleased we did that.\"\nRugby boss Burch said the game was \"close\" but he was \"really proud\" of his side.\n\"We gave it a really good go,\" said Burch.\n\"We have been on a massive transitional journey here at Rugby Borough. To be able to come to a big FA Cup game and perform is really important. These players have had lots of individual journeys.\n\"For us as a group it should bode well massively for the future.\"", "url": "https://www.bbc.com/sport/football/articles/cgq0jxkx4nlo"}