{"authors": ["Matt Warwick", "www.facebook.com"], "date_download": "2025-05-20 13:11:03", "date_modify": "2025-05-20 13:11:03", "date_publish": "2023-08-01 08:25:58", "description": "Mark Cavendish is \"still thinking\" about a Tour de France comeback, but he hasn't had an easy ride to this point.", "filename": "sport_cycling_66368064_1747746663.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8F70/production/_130602763_markcavendish.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cycling_66368064_1747746663.html", "title": "Mark Cavendish Netflix documentary: 'I don't want anyone else to go through what I have'", "title_page": "Mark Cavendish Netflix documentary: 'I don't want anyone else to go through what I have' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's three weeks since Mark Cavendish's Tour de France came to an abrupt and painful end.\nAs things stand, he is set to retire at the end of this season.\nBut the man who remains wrapped in one of the most romantic relationships there has ever been with cycling's greatest race is \"still thinking\" about the final comeback in 2024 he has been offered by his Astana-Qazaqstan team.\nThe carrot is big: the chance to win a 35th Tour de France stage and break the record he shares with Belgian legend Eddy Merckx.\nHe came agonisingly close to doing it this year when he was pipped on the finish line in Bordeaux before a crash on stage eight forced him to abandon with a broken collarbone.\nIt did not stop Netflix releasing Never Enough - the documentary which was probably intended to tell a fairytale that never materialised.\nCavendish is \"really happy\" with it.\n\"I feel it shows good representation of the real me, which anyone wants in a film about them,\" he says. \"Whether for good or for bad, you want real representation. I laid myself quite bare doing it.\"\nThe 'Manx Missile' has, at times, been a fiery character. He takes longer to answer questions these days. He sprints, but he also thinks - and thinking is something he does a lot now he is 38.\n\"I don't think anybody can sit and say they wouldn't go back and change bits and pieces here and there,\" he says. \"But it doesn't matter... you can't.\n\"All you can do is learn from good things you've done and bad things you've done, and put them into practice for shaping you for where you want to go.\"\nCavendish is happy with what he has achieved in his career, too. If he does come back, it won't all be for that record.\nAs he says in Never Enough, \"the media started that, and all of a sudden that's all I'm going for\".\nBut where he has been will always inform whatever the next chapter of his life holds.\nCavendish says it was \"important\" he was open in the documentary.\n\"It's hard to feel anyone can relate to how you're feeling,\" he says. \"It was important to lay myself so open to show that to anybody who could be affected [in a similar way].\"\nAs he processes what he has said, he jokes: \"It sounds like one of those warnings.\"\nBut Never Enough really delves into a period in Cavendish's life which was a far bigger test than any furious dash to the line on the bike.\nEight years and several victories into his glittering road cycling career, the 2016 Cavendish won four stages at the Tour for Dimension Data, before his mental health - and the team cohesion - began to spiral out of control.\nThe clandestine Epstein Barr virus - a terrible fatiguing condition for an endurance athlete to suffer - preceded several crashes, most notably a huge somersault after colliding with a traffic island in Italy.\nIt got to the point where he wasn't racing. He was just riding a bike. After losing his form, he over-trained and avoided eating correctly.\nNothing worked, and eventually the depression affected his family life.\n\"The key point is to show positivity towards where you can go. I never, ever want to deal what I've dealt with again. And I never want anybody to have to deal with these things.\n\"It's not about feeling sorry. I don't feel sorry for myself - I'm very fortunate to have the life I have. But more fortunate to have the people around me that I have, and that's knowing I've had that support network, and that support network is a massive crutch and a massive safety blanket I guess.\n\"You never get 'better',\" he says. \"But if you can see positives and not look back… that's definitely the driving force to live the happiest life you can.\"\nCavendish sought help, and is better for it. Far better.\nAfter proclaiming through tears at the end of a race in Belgium in 2020 that he had \"probably\" taken part in his last event, he was picked up by his old Quick Step team - run by the equally forthright, but warm and charismatic, Patrick Lefevere.\nCavendish wasn't offered much money to race, but his chance to perform with a team already built to complement his explosive riding style and jovial spirit was the spark.\nHe began to win again, culminating in another four Tour de France stage victories in 2021, taking him level with the mighty Merckx.\nA number of his rivals had dropped out of that Tour early on, but he has since beaten the best in a variety of races.\nAt the end of the final stage of this year's Giro d'Italia, Cavendish won brilliantly from a long way out - seemingly never-ending power coming from his ageless legs.\n\"I know I think differently,\" he says. \"But for good and bad, I'm happy I think differently.\n\"If everybody thought the same, I don't think I'd be able to win as many bike races. But you're not really aware of it until you're much older.\"\nFor all the numbers, the records, the green jerseys, the money, perhaps there is one simple reason we could see Cavendish in the Tour de France again.\n\"As a kid, I was always on a bike. It gives me an understanding more now seeing my own kids… the five-year-old in the film - Casper - the one wearing the jerseys… Casper's obsessed with his bike.\n\"He's very similar to how I was. I'm lucky I found racing because I love bikes and I'm fortunate now to have the opportunity to appreciate every pedal rev I do.\n\"Probably most professional athletes would take that for granted. I did. I'm fortunate I'm in a different headspace now. I'm very fortunate to be able to do it.\"", "url": "https://www.bbc.com/sport/cycling/66368064"}