{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:32:11", "date_modify": "2025-04-26 07:32:11", "date_publish": "2025-02-27 16:38:39", "description": "Dundee Utd fan views on defeat by Hibs and controversial disallowed goal", "filename": "sport_articles_ce8vj7eq3rdo_1745652731.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/004a/live/942a83f0-f450-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_ce8vj7eq3rdo_1745652731.html", "title": "Dundee Utd fan views on defeat by Hibs and controversial disallowed goal", "title_page": "Dundee Utd fan views on defeat by Hibs and controversial disallowed goal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "United fans, we asked for your opinions on the 3-1 loss to Hibernian in which Sam Dalby had a goal ruled out for a contentious handball.\nHere's what some of you said:\nJamie: The worst officiating I have seen in 30 years of watching football at Tannadice. A clear goal disallowed after almost five minutes of VAR desperately trying to find a handball that only they seem to be able to see. Time for United to take a stand and walk off the pitch.\nAndrew: What is the point of VAR? Wasn't it supposed to be for clear and obvious errors? The on-pitch referees are as poor as the off-pitch ones. Fouls not given, corners not given. Time taken for VAR decisions far too long and players cool down and more prone to injuries. Nobody in ground knows what goes on. It's a disgrace.\nColum: The concern isn't the United performance, but the sub-standard officiating again. There is nothing for VAR to check for the Dalby goal.\nStephen: That referee and his team absolutely ruined that game. United were well on top and when Dalby scored were rightly 2-1 up. Then it felt like the officials were trying everything they could to chop it off and there are videos showing it's clearly a good goal. We've been done by incompetence.\nDave: Absolute disgrace. No one apart from the VAR assistants can see Dalby's 'handball'. That decision will now likely define our season. Goodwin has also upset our momentum with the January signings, none of whom have contributed much at all. Frustrating.", "url": "https://www.bbc.co.uk/sport/articles/ce8vj7eq3rdo"}