{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:23:20", "date_modify": "2025-05-19 14:23:20", "date_publish": "2015-04-17 13:08:13", "description": "Tom Ince scores twice as Derby come from 3-1 and 4-3 down to secure a thrilling 4-4 draw at Huddersfield Town.", "filename": "sport_football_32262916_1747664600.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/82407000/jpg/_82407491_463130744.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_32262916_1747664600.html", "title": "Huddersfield Town 4-4 Derby County", "title_page": "Huddersfield Town 4-4 Derby County - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County missed out on a chance to improve their play-off chances after a thrilling draw at Huddersfield.\nTom Ince scored early for the Rams, but his side were 3-1 down at the break as Oscar Gobern, Mark Hudson and Reece James took advantage of poor defending.\nBut Derby started the fightback early in the second half as Simon Dawkins converted a Stephen Warnock cross.\nJesse Lingard equalised for the Rams, Nahki Wells put Town back ahead before Ince got his second to salvage a point.\nIt means that Derby, who had led the Championship for much of the season, stay fifth in the division and need one more win to guarantee themselves a play-off place.\nHad they won, though, they would have all but secured their position in the top six as Brentford and Wolves would have been six points behind with two games left and a huge goal difference to recover.\nHuddersfield have lost just one of their last eight games and move above Leeds to 15th place.\nSteve McClaren's pre-game plans for Derby were hit after just three minutes when Craig Bryson was hurt and replaced by Dawkins.\nBut it did not seem to hurt the early Rams rhythm as they opened the scoring a few minutes later when the Ince unleashed a rasping drive from 25 yards into the top corner.\nInce came close a few minutes later from distance before Derby were forced into a second early change as Zak Whitbread was forced off and replaced by Cyrus Christie.\nThe Terriers equalised as Christie was caught in possession and Conor Coady was able to float a long ball forward which found Gobern unmarked in the box, and the former Southampton player chested the ball down and shot past Lee Grant - despite protests from the Derby defence that Gobern had handled the ball.\nFour minutes later Huddersfield took the lead as the unmarked Hudson headed in James' corner at the far post before Derby's first-half defensive woes were compounded as James scored direct from a corner in stoppage time.\nWhatever former England boss McClaren said at half time appeared to have the desired effect as Dawkins got his fifth goal of the season as he slotted in Stephen Warnock's cross.\nThe Rams drew level after an hour as Lingard's controlled low shot from the edge of the box beat Alex Smithies.\nBut when Ryan Shotton gave the ball away to Wells, he played in Sean Scannell, whose shot was saved by Grant but Wells was there to capitalise.\nHowever Ince got his 10th goal since joining Derby in February as he shot into the bottom corner after cutting his way through the Huddersfield defence.\nTown thought they had won it in stoppage time, but Ishmael Miller's goal was chalked off for offside.\nDerby boss Steve McClaren: \"We are crawling over the line and we don't make it easy for ourselves. For the neutrals it was great, for the managers it was a nightmare and for the fans it had ups and downs.\n\"We need one more win and that's our only focus - but the way we are defending at the moment, anyone could beat us. We are not in a good condition but we are scrapping.\"\nHuddersfield boss Chris Powell: \"People say we have nothing to play for but the players showed they care about this club and their own performances.\n\"It's a shame we didn't get the three points our first-half performance warranted but we are building for the future. We can do better and that's the message I will be getting through to the players.\"", "url": "https://www.bbc.com/sport/football/32262916"}