{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:14:38", "date_modify": "2025-05-21 06:14:38", "date_publish": "2025-01-04 20:03:37", "description": "New Stoke City manager Mark Robins knows the full scale of the job ahead of him after failing to break down the EFL's leakiest defence.", "filename": "sport_football_articles_c2ld41k5kzjo_1747808078.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/62d5/live/54202040-cace-11ef-94df-33b0323b7c60.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c2ld41k5kzjo_1747808078.html", "title": "Stoke City: 'A lot to work on' after Plymouth draw, admits boss Mark Robins", "title_page": "Stoke City: 'A lot to work on' after Plymouth draw, admits boss Mark Robins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Stoke City manager Mark Robins knows the full scale of the job ahead of him as Potters boss after failing to break down the EFL's leakiest defence.\nChampionship bottom club Plymouth Argyle have shipped 53 goals in 25 league games this season - 35 of them in 13 away games.\nBut the Potters could not find a way through and, while they did enjoy a third straight shut-out, they have now scored just once in five games - Tom Cannon's injury-time winner against Sunderland in caretaker boss Ryan Shawcross' first game in charge.\n\"There's a lot to work on, clearly,\" Robins told BBC Sport. \"But, when you're coming into a third game in a week, whoever you're playing against, it's difficult.\n\"We created bits and pieces, but there weren't enough clean strikes and enough clean passes in the penalty area.\n\"The boys put a lot of work in. We've drip-fed quite a lot of stuff into them. But I said 'if you can't win it, at least don't lose it'.\n\"We didn't look like we were ever going to win. It looked a real struggle to create anything meaningful.\n\"They tried to execute all we asked them to do. I'm flexible with systems. It's down to the players you have available and the best they can be in a Stoke City shirt.\n\"For a first game, whilst it could be a disappointment to people, it was a reasonable point. It's early days. But you've got to start somewhere. And it's the third clean sheet we've had on the bounce.\"\nStoke are now twice on the road in quick succession, heading for Sunderland in the FA Cup third round next Saturday, followed by the Midlands derby with West Bromwich Albion at The Hawthorns the week after.", "url": "https://www.bbc.com/sport/football/articles/c2ld41k5kzjo"}