{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:32:08", "date_modify": "2025-04-26 06:32:08", "date_publish": "2025-02-27 08:35:19", "description": "Man Utd 3-2 Ipswich: Fan views", "filename": "sport_football_articles_cwyddnld703o_1745649128.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cwyddnld703o_1745649128.html", "title": "Man Utd 3-2 Ipswich: Fan views", "title_page": "Man Utd 3-2 Ipswich: Fan views - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "We asked for your views on Manchester United's victory over Ipswich.\nHere are some of your comments:\nPeter: Not the start you'd hope for but after a little while Manchester United took control and played the best football for a long while. The sending off changed the game and it was all about heart and the will to fight which they showed in abundance.\nPaul: After I've made various comments about team performances and lack of effort, it's nice to get a win with a fighting performance when down to 10 men. But can I please make a request to Ruben Amorim to please, please drop Andre Onana he's just not of a standard for the Premier League.\nMike: Slightly better than previous games but against Ipswich, it should have been much better. Can't understand why Rasmus Hojlund wasn't taken off instead of Alejandro Garnacho.\nSlim: There were some glimpses of tempo. We have some mentality as a team, the ambition is there but we are just not that clinical or maybe there is some level of lacking in determination.\nIain: Patrick Dorgu's red card was unlucky in the sense he was too enthusiastic - in most of the games he's played since arriving, he's shown his athleticism and has definitely been one of our better players. He'll be missed while he's suspended.", "url": "https://www.bbc.co.uk/sport/football/articles/cwyddnld703o"}