{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:23:48", "date_modify": "2025-05-19 15:23:48", "date_publish": "2015-02-09 12:21:08", "description": "Cristiano Ronaldo says Real Madrid will regain La Liga from Atletico Madrid despite the 4-0 defeat by their rivals.", "filename": "sport_football_31254310_1747668228.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/80878000/jpg/_80878614_ronaldo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31254310_1747668228.html", "title": "Cristiano Ronaldo: Real Madrid will win La Liga despite Atletico defeat", "title_page": "Cristiano Ronaldo: Real Madrid will win La Liga despite Atletico defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cristiano Ronaldo is convinced Real Madrid will regain the Spanish league title from Atletico Madrid, despite the 4-0 loss at their rivals.\nReal suffered their heaviest defeat in more than four years but still lead La Liga ahead of Barcelona and Atletico.\nBarca are a point adrift, with Atletico four points back in third.\n\"In my opinion we are a better team than Atletico and we should be showing that on the pitch. I'm sure, in the end, we'll win La Liga,\" Ronaldo said.\nEuropean champions Real are aiming for their first La Liga in three seasons and took control after a 12-match winning streak in the first half of the season.\nBut their four-point advantage over Barcelona was reduced at the weekend as Atletico's win, coupled with the Catalan club's 5-2 success at Athletic Bilbao, reignited the title race.\n\"It was a day to forget but we are still top of the league and we know we'll have to fight right until the end,\" Portugal captain Ronaldo added.\n\"We have to put this game behind us as quickly as possible because Real Madrid can't lose 4-0 to any team.\"\nMeanwhile, Ronaldo's agent Jorge Mendes has defended the player for hosting his 30th birthday party shortly after the loss.\nThe Ballon d'Or winner was seen enjoying the celebrations in a video leaked to the Spanish media.\n\"Ronaldo was devastated after the defeat and people spent two hours trying to cheer him up,\" Mendes told Spanish radio station Cadena Ser.\n\"The fact is that his birthday party had been organised more than a month ago and he had family coming from abroad.\n\"He didn't want to cancel out of respect for the people that came. What is inadmissible is that somebody takes advantage of a private affair to release a video.\"", "url": "https://www.bbc.com/sport/football/31254310"}