{"authors": ["Mantej Mann", "www.facebook.com"], "date_download": "2025-05-21 05:20:03", "date_modify": "2025-05-21 05:20:03", "date_publish": "2025-04-03 13:37:05", "description": "Tommy Freeman scores an impressive hat-trick to further strengthen his claim for British and Irish Lions selection as Northampton Saints cruise past Clermont Auvergne in the Investec Champions Cup last 16.", "filename": "sport_rugby-union_articles_c5ypxzl9260o_1747804803.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ec17/live/d4dd39c0-1196-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c5ypxzl9260o_1747804803.html", "title": "Northampton Saints 46-24 Clermont Auvergne: Tommy Freeman scores hat-trick as Saints cruise through kin Champions Cup", "title_page": "Northampton Saints 46-24 Clermont Auvergne: Tommy Freeman scores hat-trick as Saints cruise through kin Champions Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tommy Freeman scored an impressive hat-trick to further strengthen his claim for British and Irish Lions selection as Northampton Saints cruised past Clermont Auvergne in the Investec Champions Cup last 16.\nFreeman wrapped up his treble on the hour mark at Franklin's Gardens as he continued to demonstrate the attacking prowess which helped him create history last month as the first England player to score in every round of a Six Nations campaign.\nClermont started brightly in the fading spring sunshine as George Moala scored the opening try but the hosts quickly recovered and scored the next four to take control of the tie as the night sky set in.\nFin Smith combined beautifully with his England half-back partner Alex Mitchell to cross for their first before Freeman scored a quickfire double in the wide channel.\nTo further compound Clermont's demise, Sebastien Bezy joined Thomas Ceyte in the sin-bin before Juarno Augustus added Northampton's fourth try from a line-out strike move on the stroke of half-time.\nIt was more of the same after the break as Augustus sauntered in to double his tally following a terrific solo break by George Hendy, before Clermont salvaged some pride with a couple of tries through Alivereti Raka and Folau Fainga'a.\nThe next try felt crucial as Clermont reduced the deficit to 10 points and it was duly delivered by the influential Freeman, who brushed off one yellow shirt in midfield before sprinting clear to dive over.\nHenry Pollock added the gloss by latching on to Smith's clever grubber kick, and Northampton's prize is a return to their East Midlands home next weekend to face either Castres or Benetton in the next round.\nIn a week when Saracens decided to prioritise their pursuit of a Premiership play-off spot over European success by resting their England internationals in the Champions Cup, Northampton opted to ensure their Test stars were on full display.\nSaints have struggled domestically as the defence of their Premiership title has faltered, but this was a ruthless exploitation of their French visitors in a competition which presents their most realistic chance of silverware this season.\nThe opening exchanges were not to script but Northampton's internationals were crucial in wresting back momentum.\nScrum-half Mitchell provided the speed at the breakdown to manoeuvre the Clermont defence, while Smith's control and sleight of hand behind him enticed his outside runners to carry hard and breach the gain-line.\nSmith established himself as England's first-choice fly-half during the Six Nations and he showed just why with the opening try after bursting on to Mitchell's clever pass.\nFreeman did the damage out wide to take the game away from Clermont but the England star who typified Saints' fightback and subsequent dominance was Pollock.\nIt seems unfair to shine the spotlight on a young man who is in the infancy of his career, but there is a reason his name was met by the loudest cheer after it was blared out by the stadium announcer before kick-off.\nIn a crucial play with the game in the balance, Pollock wrapped up the dangerous Raka with a dominant tackle before forcing the winger to hold on and winning the decision at the breakdown.\nThe flanker quickly rose to his feet and tapped the ball for a penalty before setting in motion what ended with Freeman's opening try.\nSurely club and country will benefit for many years to come if his instinct continues to be facilitated and not restricted by the conventions of modern-day kick-heavy game plans driven by data.", "url": "https://www.bbc.com/sport/rugby-union/articles/c5ypxzl9260o"}