{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:43:08", "date_modify": "2025-05-21 03:43:08", "date_publish": "2025-04-06 16:54:24", "description": "Hampshire beat newly-promoted Yorkshire by five wickets in the opening game of both sides' County Championship season.", "filename": "sport_cricket_articles_c62z672x3yno_1747798988.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9f1f/live/7454c750-1306-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c62z672x3yno_1747798988.html", "title": "County Championship: Hampshire beat Yorkshire in opener", "title_page": "County Championship: Hampshire beat Yorkshire in opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Ben Brown era as Hampshire captain began with a five-wicket County Championship win over newly promoted Yorkshire.\nBrown took over as skipper from James Vince – who led the side to a second-placed finish last season – and was given an anxious 148-run victory chase in his opening game.\nYorkshire had been behind the eight ball since being bowled out for 121 on the first day, but Adam Lyth ground out 106 to give them hope of a sensational turnaround victory.\nJack White and Dom Bess' two wickets left Hampshire sweating on 86-4, but Tom Prest eased the worries with a bullish 57 to take his side towards the win with Liam Dawson.\nIt meant Hampshire's fresh start without Vince and influential fast bowler Mo Abbas began with 19 points, while the visitors – with their new-look leadership team of Jonny Bairstow and Anthony McGrath – took three points from the contest.\nLyth had taken 123 balls to strike his first boundary of the innings, but he started day three with a luscious straight drive for four.\nNightwatchman Ben Cliff stuck around for 78 balls, adding 42 with Lyth, before Kyle Abbott found his outside edge during the first over with the second new ball.\nIt didn't blow Yorkshire open. Bess blocked out for 17 balls before Abbott sent his off stump cartwheeling and Ben Coad hung firm for nine off 46 balls.\nBut the main contributor was the experienced Lyth. The 37-year-old went to a 38th first-class century in 263 balls – four short of his slowest.\nYorkshire's 11th all-time leading red ball century-maker brought up the ton with a firm back-foot drive to the boundary.\nNew Zealander Brett Hampton ended Hampshire's toil. Firstly, he got one to bounce on Coad, who edged behind, before Lyth skied straight up in the air.\nInitially, Hampshire looked to be striding towards the winning post, with Fletcha Middleton and Mark Stoneman putting on 47 in 14 overs, but things went south.\nStoneman got frustrated, having been dropped, after only scoring 11 in an hour. He attempted to attack Bess and was bowled.\nNick Gubbins was struck plumb in front on the back pad, and Toby Albert edged behind – both falling to White – while Middleton's 38, which also saw him dropped, ended when Bess had him lbw.\nFour wickets had been lost for 40 runs, and at tea 62 runs were still required.\nPrest got the bit between his teeth and refused to bow to the pressure by trying to knock the runs off swiftly, although he was also put down.\nHis sixth first-class fifty came in 64 balls, a ball before reaching a half-century stand with Dawson. Prest was bowled to give Bess a third scalp with the scores level, to end a 61-run stand, but Brown came in to score the winning run to delight a sun-kissed Utilita Bowl crowd.\nBy Alex Smith, ECB Reporters Network supported by Rothesay\nHampshire batter Tom Prest:\n\"It got a little bit closer than we would have liked, but it is nice to start the season with a win.\n\"I got a little bit of fortune through my innings. It is nice to contribute to a win. I like batting quickly and put the bowlers under pressure, and Dawson helped me out and calmed me after tea.\n\"Ben Brown is a very popular man in the dressing room and very easy to get on with. He backs us younger lads to the hilt. It has started perfectly for him.\n\"He is similar to James Vince – who we will miss – but Brown is perfect to step into the role and has done it before for Sussex.\"\nYorkshire head coach Anthony McGrath:\n\"I think if you take out the first two sessions of the game, where we were poor and gave a lot of wickets away, which sometimes can happen, we were in every session after that, and pretty much won all of them.\n\"To be bowled out for 120 in any game, you're always going to be struggling.\n\"To give ourselves 150 to defend was always going to be tough. The word is frustration, because I think we created eight or nine chances there, and that could have been a lot different.\n\"I don't like to say there are a lot of positives to take when you lose, because we've ultimately lost the game. But if we cut out a few mistakes, bat better like we did in the second innings, I think it's shown everyone in the dressing room, against Hampshire, who are normally up there, that we can compete and there's some good signs going forward.\"", "url": "https://www.bbc.com/sport/cricket/articles/c62z672x3yno"}