{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:46:37", "date_modify": "2025-05-20 12:46:37", "date_publish": "2023-08-03 07:57:41", "description": "Lionel Messi scored twice to help Inter Miami beat Orlando City 3-1 in the Leagues Cup.", "filename": "sport_football_66392849_1747745197.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11122/production/_130622996_gettyimages-1588962530.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66392849_1747745197.html", "title": "Lionel Messi: World Cup winner scores two as Inter Miami beat Orlando City 3-1", "title_page": "Lionel Messi: World Cup winner scores two as Inter Miami beat Orlando City 3-1 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lionel Messi continued his fine start for Inter Miami as he scored twice in a 3-1 win over Orlando City in the Leagues Cup on Wednesday.\nThe 36-year-old's two close range goals helped his side progress to the last 16 of the tournament.\nMiami were winless in 11 games before Messi's arrival, but have now won their last three matches in a row.\nMessi's former Barcelona team-mate Jordi Alba made his Miami debut, coming on as a 64th minute substitute.\nThe pair's former Camp Nou colleague Sergio Busquets has also made the move to Florida, while ex-Barca and Argentina manager Tata Martino is in charge after replacing Phil Neville in the dugout.\nMessi's team-mate and former Newcastle defender DeAndre Yedlin believes the Argentine strikes \"fear\" into rivals.\n\"He just gives everyone around him confidence. You can give him balls in difficult situations and know he's going to make something out of it,\" Yedlin said post-match.\n\"The flipside is that for the teams we're playing against, it puts a bit of fear in their eyes. They're dropping back on their heels a bit and that gives us more space to play.\"\nDavid Beckham-owned Miami will next take on FC Dallas in Texas on Sunday for a spot in the quarter-finals of the Leagues Cup, which debuted in 2019 and sees sides from the United States and Mexico compete in a knockout format.", "url": "https://www.bbc.com/sport/football/66392849"}