{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:04:34", "date_modify": "2025-05-21 05:04:34", "date_publish": "2025-04-04 07:42:00", "description": "Chelsea 1-0 Tottenham: Fan views on defeat at Stamford Bridge", "filename": "sport_football_articles_c4g3x7dgylgo_1747803874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g3x7dgylgo_1747803874.html", "title": "Chelsea 1-0 Tottenham: Fan views on defeat at Stamford Bridge", "title_page": "Chelsea 1-0 Tottenham: Fan views on defeat at Stamford Bridge - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Chelsea's win over Tottenham in the Premier League.\nHere are some of your comments:\nGT: Toothless, passive, hopeless, clueless - take your pick. Ange has no excuse because we have all of our players back. That was shocking.\nJames: Our style of play under Ange has been so laborious, sloppy and littered with mistakes. We put up a reasonable effort but you would normally look to a manager to instil more discipline in how we play. Antonio Conte used to drill the side and we got results. That's what is missing. I'm looking forward to the summer and hopefully a new manager. Until then, we suffer.\nJoshua: Yet another miserable performance. We only showed signs of threat near the end of the game, by which time it was too late. Ange is hanging by his last thread - the Europa League. If he doesn't win that 'trophy in his second year', then I don't see him having a future at Spurs. It was great at the start, but now Ange's reign has to come to an end if we want to improve as a football team.\nAndy: Poor Ange has been out of his depth all season. He is a one-trick pony and the best managers in the world have worked him out quickly. The players look dispirited. We have no chance of winning another game in Europe and even the Southampton game is a worrying fixture.\nDave: The table doesn't lie - 16 games lost. We are wholly incompetent and clueless, on and off the pitch.", "url": "https://www.bbc.com/sport/football/articles/c4g3x7dgylgo"}