{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:43", "date_modify": "2025-05-21 05:25:43", "date_publish": "2025-02-12 00:00:00", "description": "Goals from French duo Enzo Le Fee and Wilson Isidor help Sunderland to three points and send Luton Town bottom.", "filename": "sport_football_live_cr53p599d7jt_1747805143.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr53p599d7jt_1747805143.html", "title": "Sunderland 2-0 Luton Town: Hatters bottom after Black Cats loss", "title_page": "Sunderland 2-0 Luton Town: Hatters bottom after Black Cats loss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luton Town slipped to the bottom of the Championship as they were comfortably beaten by promotion-chasing Sunderland.\nGoals from French pair Enzo Le Fee - his first in English football - and Wilson Isidor maintained the Black Cats' unbeaten home record and kept up their automatic promotion hopes as they matched the wins of the three sides above them this midweek.\nBut with Plymouth Argyle winning, a 12th defeat from their last 13 away games saw Luton fall below them.\nIt is just two points from five games for new manager Matt Bloomfield, and they have only taken two out of a possible 27 since Christmas to leave them facing the possibility of a second successive relegation.\nThe Black Cats had dropped four points in their previous two home games against Plymouth and Watford and were eager to avoid an unwanted treble, and they should have been in front in within four minutes.\nPatrick Roberts found Isidor in space in the area, but he curled his effort wide of the far post.\nHowever, they did not have to wait too long for the opener as Le Fee was afforded time to cut in from the left and bury a shot beyond Thomas Kaminski from 20 yards.\nIt ended a 654-day wait for a goal for the talented midfielder, who is on loan from Roma, since scoring for Lorient in a Ligue 1 victory away to Paris St Germain on 30 April 2023 under Regis Le Bris - now Sunderland's boss.\nLuton's away record is dire with 18 defeats in their previous 21 league games and they were slow to respond, but their first effort of the match almost produced an equaliser as Anthony Patterson pushed Carlton Morris' header onto the post with a fine save at full stretch.\nSunderland head coach Regis Le Bris told BBC Radio Newcastle:\n\"Today we had good control and we were mature in that game.\n\"That's very important as it was a new challenge against a team that can be dominant in the air with many set-pieces and direct plays, but we were dominant.\n\"Then it was a question of disturbing their low block to create chances. In that situation, we needed an X-factor and it was important to have a player like Enzo today to make the difference.\"\nLuton Town manager Matt Bloomfield told BBC Three Counties Radio:\n\"A difficult place to come and Sunderland were very good. We know what they were going to offer, we prepared for that but they made the most of their opportunities.\n\"They dominated the ball but both goals were very avoidable from our point of view. We have to be better in our defending, our shape and our duels as well.\n\"We need to learn the lessons as quickly as possible. We're a short of a little bit of Championship experience right now but the boys are giving us everything.\n\"They're desperate to improve and I'll take that any day.\"", "url": "https://www.bbc.com/sport/football/live/cr53p599d7jt"}