{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:39:45", "date_modify": "2025-05-21 07:39:45", "date_publish": "2025-03-28 11:54:54", "description": "Swansea City: Championship survival is in our hands - Alan Sheehan", "filename": "sport_football_articles_c4g0g0gqlq7o_1747813185.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa4e/live/3db05130-0bca-11f0-af58-ad3b17745e6c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g0g0gqlq7o_1747813185.html", "title": "Swansea City: Championship survival is in our hands", "title_page": "Swansea City: Championship survival is in our hands - Alan Sheehan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alan Sheehan says Swansea City are happy heading into the final stages of the Championship season because they do not need help from elsewhere to ensure they stay in the division.\nSwansea are six points clear of the relegation places with eight games remaining in what has turned into another arduous campaign for the Welsh club.\nThe gap to 22nd place was as big as 12 points only two games ago, but successive defeats – coupled with the successes of others – mean Swansea are looking over their shoulders as they prepare for Saturday's daunting trip to Leeds United (15:00 GMT).\nCaretaker head coach Sheehan, who will stay in charge for the rest of the season having taken seven points from his five games since the departure of Luke Williams, says Swansea's challenge is to maintain the sort of performance levels on show since he took the reins.\n\"Everybody is fighting for their lives down there,\" Sheehan said.\n\"I think the most important thing is it is in our hands what we do. The challenge is to be the best version of ourselves and in the five-game block [before the international break], I think we've been close to that on four occasions.\n\"I think where we are at the moment, we need to keep doing what we are doing but become better at it.\"\nSheehan says a visit to Elland Road means \"probably the toughest game you're going to get in the Championship\".", "url": "https://www.bbc.com/sport/football/articles/c4g0g0gqlq7o"}