{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 07:35:21", "date_modify": "2025-05-21 07:35:21", "date_publish": "2025-05-20 16:05:39", "description": "Blackburn Rovers withdraw from the Women's Championship next season because club owners are unwilling to meet the league's requirements.", "filename": "sport_football_articles_c9wgg8y881lo_1747812921.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c3b/live/2a39c8a0-3593-11f0-8f95-179a79186756.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9wgg8y881lo_1747812921.html", "title": "Blackburn Rovers withdraw from Women's Championship", "title_page": "Blackburn Rovers withdraw from Women's Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers have withdrawn from the Women's Championship next season because club owner Venky's is unwilling to meet the league's requirements on facilities, player welfare and staffing.\nIn an email sent to players by the club's HR department on Tuesday, seen by BBC Sport, Blackburn say they are in \"ongoing discussions with the Football Association (FA) regarding the division we will be competing in\" next season.\nFA regulations state that any club that withdraws from a league can only re-enter the pyramid at least two tiers below that from which they have withdrawn.\nBlackburn's players and staff are unsure of their future, whether they will remain semi-professional or even if their contracts will be renewed.\nThe deadline to decide if the club wanted to meet the licence requirements and retain their tier-two status was on Monday, 19 May.\nThe email went on to say: \"Due to the minimum standards required at the tiers below the Women's Championship, there is a significant impact on the staffing and playing structure moving forward and so your role may be affected.\n\"We understand this may be disappointing to read and we aim to communicate which tier we will be operating in once we have this confirmation.\"\nThe FA Board and WSL Football - the company overseeing the top two tiers of English women's football - are expected to meet later on Tuesday to discuss the next steps.\nIn a statement issued after the news broke, Blackburn said:, external \"The growing financial and operational constraints tied to tier two status, including the requirement to move to a fully professional model, have reached a point where they can no longer be sustained under the club's current financial framework.\n\"Key factors influencing this decision include the significant rise in minimum criteria set by the league, including extended contact hours for players and the requirement for a full-time professional contract model, an increase in staffing levels, leading to further escalating wage costs, and a greater strain on training ground and stadium facilities.\"\nBlackburn's withdrawal could mean reinstating relegated Sheffield United, who sources say have held initial conversations around the possibility of their return to the Women's Championship.\nWSL Football confirmed its \"intention is to ensure\" the Women's Championship - renamed WSL 2 from next season - \"operates with 12 clubs\".\nIt became clear Blackburn were in a perilous position last week, when players said they were told by a team-mate via WhatsApp that there was a \"99% chance the owners will not be financially supporting the team next season\".\nDefender Niamh Murphy, 22, said: \"I have been a Blackburn Rovers player for three seasons and the only consistency there has been is the lack of financial support from the club.\n\"Whilst this season may not look successful to some, we have once again avoided relegation despite having the smallest budget.\n\"This is a huge success and a credit to the women's players and staff.\"\nThe players and staff were awaiting communication from the club at the weekend but sources say a meeting was cancelled on Monday evening and then delayed on Tuesday.\nCoaching staff eventually joined a call with the board and HR department at 15:30 BST on Tuesday and following that, manager Simon Parker informed players of the news.\nSources say there is huge \"frustration\" and \"confusion\" within the playing group at the lack of transparency from the club.\nThe majority of the squad are not represented by the Professional Footballers' Association (PFA) - the trade union for footballers in England and Wales - but some have been contacted with advice and support.\nIt will be the second year in a row a club withdraws from the league because of financial concerns after Reading dropped to the fifth tier in June 2024.\nAll clubs in the Women's Super League (WSL) and Women's Championship must meet licence criteria to create a professional environment.\nThe criteria include minimum standards on aspects such as elite facilities, the number of full-time staff, wellbeing support and contact hours with players.\nA compliance and development review is carried out at each club at the start of the season.\nBlackburn's women have a rich history of developing talent with England internationals Keira Walsh, Ella Toone and Georgia Stanway among those to have come through the club's academy.\nThe club's statement continued: \"We acknowledge the disappointment this may cause to our players, supporters and staff, and extend our heartfelt appreciation for their unwavering dedication last season, but this decision has not been made lightly.\n\"To be absolutely clear, Blackburn Rovers is not walking away from the Women's game.\n\"Like other respected clubs with a proud history in the game, we are taking necessary steps and finding a path that is sustainable and responsible for the long-term future of women's football at Blackburn Rovers.\"\nBut the news about the women's team comes amid wider issues around the club in recent months, including financial pressures.\nWhile Blackburn Rovers' latest accounts, published in March, showed they made a £3.3m profit, that was because of significant sales of players in the men's team such as Adam Wharton, who joined Crystal Palace for £18m. The club was spending 119% of its turnover on wages.\nBlackburn Rovers chief operating officer Suhail Pasha told BBC Radio Lancashire that every year the club was guaranteed to have a £20m shortfall that needed to be bridged by owners Venky's.\nIn March several fan groups called on Pasha and two other leading officials to stay away from men's matches at Ewood Park. They also called on Venky's to sell the club as the men's team fell out of Championship play-off contention and lost manager John Eustace to Derby.\nThe club were also set to host an awards evening in the last week of the season for their men's and women's first teams but it was cancelled.\nThe women's team have played matches at Ewood Park this season in an attempt to grow the fanbase, and in turn matchday revenue, but average crowds remain below 1,000.\nTheir players are currently on semi-professional contracts, with the average salary believed to be £9,000 and the highest £15,000.\nChief executive officer of WSL Football Nikki Doucet said: \"This is a sad day for women's football and our hearts go out to the players, staff and fans at Blackburn Rovers Women affected by this decision.\n\"We have been working with the club all season to prevent this outcome, and we are disappointed it has come to this.\n\"Women's football is on a journey, and whilst it remains in a financially fragile position, the game is growing and there will be brighter days ahead.\"", "url": "https://www.bbc.com/sport/football/articles/c9wgg8y881lo"}