{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:05:22", "date_modify": "2025-05-21 05:05:22", "date_publish": "2025-01-05 12:56:36", "description": "Irishman Paul Hughes responds to comments from Khabib Nurmagomedov on Irish MMA fighters, saying he \"doesn't care\" about the former UFC lightweight champion's opinion.", "filename": "sport_mixed-martial-arts_articles_c5y7nl3l9dvo_1747803922.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3475/live/aeb05970-cb5b-11ef-93a8-6966a864daf4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_mixed-martial-arts_articles_c5y7nl3l9dvo_1747803922.html", "title": "Paul Hughes: 'I don't care about his opinion'", "title_page": "Paul Hughes: 'I don't care about his opinion' - Irish fighter on Khabib comments - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Irishman Paul Hughes says he is unfazed by comments from Khabib Nurmagomedov on Irish MMA fighters, saying he \"doesn't care\" about the former UFC lightweight champion's opinion.\nIn a video posted on X by the Professional Fighters League (PFL), Khabib said; \"Ireland don't have fighters, let's be honest. How many fighters do you know from Ireland, Paul Hughes, Conor [McGregor] and who else?\n\"Ireland level of MMA is not even half of Dagestan level.\"\nThe video was posted to promote Hughes' upcoming Bellator Lightweight Championship title fight in Dubai on 25 January against Khabib's cousin and Bellator champion Usman Nurmagomedov.\nBut Derry fighter Hughes won't pay too much attention to the comments from Khabib, who will be in his cousin's corner for the contest in the United Arab Emirates.\n\"I was out with a friend, and I saw it and thought, 'I don't really care'. It's just fight stuff but it's good for marketing, it's good he's doing that, but I don't really care,\" Hughes told BBC Sport NI.\n\"I respect him as a fighter, but I don't care what his opinion is.\"\nThe 27-year-old admitted, though, that beating Usman would be even sweeter given Khabib will be there to witness it.\n\"Knowing he'll be in Usman's corner, I think when I win, I'll be like, 'I told you so', and that will be pleasurable but that is the competitor in me.\"", "url": "https://www.bbc.com/sport/mixed-martial-arts/articles/c5y7nl3l9dvo"}