{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:06:48", "date_modify": "2025-05-21 04:06:48", "date_publish": "2025-02-01 11:20:39", "description": "Wolves vs Aston Villa predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cz6p8ye8q83o_1747800408.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz6p8ye8q83o_1747800408.html", "title": "Wolves vs Aston Villa predictions: Chris Sutton on Premier League game", "title_page": "Wolves vs Aston Villa predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I would be so disappointed if Aston Villa striker Jhon Duran moves to Saudi Arabia.\nDuran is 21, and coming into his prime. He could go there and earn all the money in the world but he would be leaving the best league there is, just as he has started making a splash in it.\nIt is his prerogative but, as a career move, I think it's the wrong one.\nThis situation, with Arsenal making an offer for Ollie Watkins too, must be very annoying for Villa boss Unai Emery.\nHe has worked hard to get the club into the Champions League, and with two good strikers he can rotate them. It has worked really well, but seemingly won't be an option for much longer.\nVilla have other problems too. They are short of options at centre-half and Emery had to play a midfielder, Boubacar Kamara, there against Celtic on Wednesday night.\nThere are some things to be positive about, however. Morgan Rogers was absolutely superb against Celtic and is an exciting talent.\nBut while Villa have got goals in them, I am just not sure they will keep Wolves out.\nVilla have not won any of their past six games straight after a Champions League tie, and I don't see this week being any different.\nWolves are on a horrible run of four successive league defeats, with 10 goals conceded and just one scored, so even a draw would be a boost for Vitor Pereira's side.\nPereira must also be worried about losing his main goalscorer, Matheus Cunha, before the transfer window shuts on Monday. I am not sure whether Cunha will stay, but I think Wolves will get a point here.\nSutton's prediction: 2-2", "url": "https://www.bbc.com/sport/football/articles/cz6p8ye8q83o"}