{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:59:53", "date_modify": "2025-05-21 04:59:53", "date_publish": "2025-04-04 11:42:58", "description": "Blackburn Rovers left-back Owen Beck is ruled out for the remainder of the season and could possibly return to his parent club Liverpool.", "filename": "sport_football_articles_c7vne7v5n69o_1747803593.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15cd/live/26eab980-1148-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vne7v5n69o_1747803593.html", "title": "Ismael on Beck injury and club turmoil", "title_page": "Blackburn Rovers: Valerien Ismael on Beck injury and club turmoil - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackburn Rovers left-back Owen Beck has been ruled out for the remainder of the season and could possibly return to his parent club Liverpool.\nThe 22-year-old missed seven games before returning to play just 13 minutes of Rovers' loss to Portsmouth at the weekend.\n\"The way I like to play, I need the energy and intensity and I like those profiles. When you've got those profiles in your squad, then you can't wait to see the players,\" head coach Valerien Ismael told BBC Radio Lancashire.\n\"When you lose the player after 10 minutes when he comes back, it's difficult.\n\"I was really excited to work with him but unfortunately, he's going the other way.\"\nDefender Hayden Carter has a calf injury that will keep him out for five to six weeks and may also see his season come to a premature end.\nHowever, Harry Pickering will make his return for the game against Middlesbrough on Friday having been sidelined since Christmas with a hamstring injury.\nThe club is currently in the midst of turmoil with their supporters, with senior figures expected not to heed fan requests to stay clear of the Lancashire club's seven remaining games.\nBut Ismael believes that it will be the \"energy\" from his players that will influence the atmosphere, not the dispute between the fans and its ownership.\n\"That energy we give on the pitch can help us to get the fans on board so the game will dictate the environment,\" the Frenchman said.\n\"It's not nothing new with this fracture, the only thing we can do is be focused on ourselves.\"", "url": "https://www.bbc.com/sport/football/articles/c7vne7v5n69o"}