{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:29:10", "date_modify": "2025-05-21 06:29:10", "date_publish": "2025-01-31 12:44:18", "description": "Norwich City midfielder Oscar Schwartau has drawn praise for his impressive performances so far this season.", "filename": "sport_football_articles_c5y6qv4l0ndo_1747808950.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f2f/live/0803f9b0-dfce-11ef-976a-75f9ab68fe5f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y6qv4l0ndo_1747808950.html", "title": "Norwich City: 'Teenager Oscar Schwartau is an unsung hero'", "title_page": "Norwich City: 'Teenager Oscar Schwartau is an unsung hero' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Norwich City midfielder Oscar Schwartau has drawn praise for his impressive performances this season since joining from Danish side Brondby in the summer.\nThe 18-year-old has made 24 Championship appearances for the Canaries, including in the 5-1 win over Swansea at Carrow Road last weekend.\nSchwartau was one of two teenagers in the starting line-up against the Swans, with 19-year-old Lucien Mahovo also making his first start for the club.\n\"We have to talk about him because actually, for me, he is the unsung hero,\" said Chris Reeve, co-host of BBC Radio Norfolk's The Scrimmage podcast.\n\"He's 18, he's younger than Lucien [Mahovo] and he is brilliant. The ball carrying, the vision, the passing.\n\"And then to contrast Schwartau to Lucien - Lucien has got all of the physical attributes whereas I think Oscar, once he's beefed up in the summer, he's going to be a beast next season.\n\"So, in terms of all the young players, he's my man, he really is.\"\nFellow host Rob Butler agreed and added: \"He is going to be some player.\n\"I think you're right and we've got to say that the Johannes Hoff Thorup connection and Glen Riddersholm [assistant coach] has brought him here, because clearly Ben Knapper [sporting director] got him but the Danish connection helped.\"\nSchwartau has scored one goal so far for Norwich, which came in his excellent performance against Millwall on Boxing Day.", "url": "https://www.bbc.com/sport/football/articles/c5y6qv4l0ndo"}