{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-20 14:57:13", "date_modify": "2025-05-20 14:57:13", "date_publish": "2023-07-27 06:17:09", "description": "Chelsea boss Mauricio Pochettino says he must make tough decisions as he aims to reduce his \"massive squad\" before the start of the new season.", "filename": "sport_football_66316074_1747753033.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6B00/production/_130529372_gettyimages-1563912090.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66316074_1747753033.html", "title": "Newcastle 1-1 Chelsea: Mauricio Pochettino says 'tough' squad decisions must be made", "title_page": "Newcastle 1-1 Chelsea: Mauricio Pochettino says 'tough' squad decisions must be made - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea boss Mauricio Pochettino says he must make tough decisions as he aims to reduce his \"massive squad\" after a pre-season draw with Newcastle.\nThe Blues, who took 29 players to the United States, played out a 1-1 draw in front of more than 70,000 in Atlanta.\nMiguel Almiron cancelled out Chelsea summer signing Nicolas Jackson's 12th-minute opener.\nBut Pochettino said he wanted to reduce the squad before their Premier League opener against Liverpool on 13 August.\nHe added morale could be affected if there were numerous players in the squad not getting regular game time.\n\"At the moment the dynamic is very good, really good guys and they are sharing the time together,\" Pochettino said.\n\"It is difficult because sometimes in every game three, four, five players cannot play and that is difficult because the mood is difficult.\n\"It is about creating a squad with good balance and people who have the opportunity to play and can compete for their place.\n\"That is a big job and challenge for us in the transfer window to build a good relationship and good balance. Then, if players are not happy because they believe they are not going to play, we are going to find a solution with the club and fix the situation.\n\"What we cannot have is a massive squad, players not be involved and then it's going to create a mess in the squad. Maybe less is more and more is less, it is not mathematic. That is why I need to make clear we don't need a big squad.\n\"We need 22, 23, 24 players with some younger and that's it. I am so sorry because maybe the decision will be tough but we need to build a good and a balanced team who want to compete for things.\"", "url": "https://www.bbc.com/sport/football/66316074"}