{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:48:51", "date_modify": "2025-05-20 13:48:51", "date_publish": "2023-07-31 11:21:29", "description": "Derby County boss Paul Warne says there may be an \"opportunity\" for former striker Martyn Waghorn to return.", "filename": "sport_football_66359806_1747748931.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/648B/production/_130593752_shutterstock_editorial_14025585cr.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66359806_1747748931.html", "title": "Martyn Waghorn: Striker training with Derby County after Coventry City release", "title_page": "Martyn Waghorn: Striker training with Derby County after Coventry City release - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County boss Paul Warne says there may be an \"opportunity\" for striker Martyn Waghorn to return to the club.\nThe 33-year-old has been training with the Rams and came on as a substitute in their 3-1 pre-season defeat by Sheffield United on Saturday.\nWaghorn played 123 times in three seasons for Derby before leaving for Coventry in 2021, and is currently a free agent.\n\"I just said, 'look mate come in and train',\" Warne told BBC Radio Derby.\n\"I know he lives locally, I know the club means a lot to him and I just think as a football club you should do that for one of your ex-players, so I'm trying to help him out.\n\"I told him there might be an opportunity for something here that you like, or I might be able to get you fit and someone else might come in for you.\n\"I was completely honest and candid with him as he has been with me. We will have another conversation on Monday and we'll see where it goes.\"\nWaghorn made 13 appearances for the Sky Blues last season before joining Huddersfield in January, where he played a further 13 times to help Neil Warnock's side avoid relegation.\n\"It's not like he's 40, he is still a young man and he played a lot in the Championship last season,\" Warne added.\n\"I spoke to Neil Warnock in the week and he spoke really highly of him.\"\nWarne is keen to add to his \"small\" squad, with a striker top of his wishlist, but has so far been frustrated in his attempts to recruit before Saturday's League One opener with Wigan.\n\"There isn't a new face that I was expecting to have here today so that's frustrating, but you could be very surprised to know that people lie in football,\" Warne said.\n\"You feel you've done a lot on it and you get disappointing news, but hopefully it will flip and the sun will come out tomorrow, and next week, hopefully, we will be able to get the player in.\"\nThe Rams have promoted striker Dajaune Brown from their academy to the senior squad, with the 17-year-old signing a three-year deal until the summer of 2026.", "url": "https://www.bbc.com/sport/football/66359806"}