{"authors": ["Odhran Crumley", "www.facebook.com"], "date_download": "2025-05-21 06:57:03", "date_modify": "2025-05-21 06:57:03", "date_publish": "2025-01-22 16:38:33", "description": "BBC Sport NI assesses the Ulster counties ahead of the start of the Allianz League and the introduction of Gaelic football's new rules.", "filename": "sport_articles_ckgr44x4e68o_1747810623.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8c8c/live/df34b350-d8c3-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckgr44x4e68o_1747810623.html", "title": "Allianz Football League: How Ulster counties are shaping up for 2025 season", "title_page": "Allianz Football League: How Ulster counties are shaping up for 2025 season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A whole new ball game? What will Gaelic football look like in this weekend's opening round of Allianz League fixtures? The answer is...we're not quite sure.\nSince Armagh's unexpected march to the Sam Maguire back in July, Gaelic football has undergone its most radical transformation since the inception of the game back in 1884.\nThe Football Review Committee - chaired by former Dublin boss Jim Gavin - implemented 18 new rules via 49 successful motions at a Special Congress last year, with two-point scores and 1v1 throw-in contests among the package of reforms.\nBBC Sport NI assesses the Ulster counties ahead of one of the most eagerly anticipated league campaigns ever as the public will be exposed to the radical changes for the first time.\nManager: Kieran McGeeney (11th season)\nLast year: Promoted as Division Two runners-up\nFixtures: Galway (A), Tyrone (H), Donegal (A), Mayo (H), Dublin (H), Kerry (A), Derry (H)\nThe difficult second album, the switch from hunter to the hunted. This is what faces Armagh in 2025.\nFirst up for the Orchard men is a repeat of last year's All-Ireland final as they head west to Salthill to renew their rivalry with Galway before a visit of the 'old enemy' Tyrone in their first game back at home as All-Ireland champions.\nTraditionally the previous champions return to training later than others and McGeeney - with his backroom team of Conleith Gilligan and Kieran Donaghy still intact - will look to move through the gears and pick up enough points to retain their top-tier status.\nThe new rules may break up the defensive system that served Armagh so well over the last 12 months but their transitional play has improved considerably over the same period.\nWith forwards like Rian O'Neill, Conor Turbitt and Oisin Conaty imbued with the swagger that a Celtic Cross brings, Armagh will be hoping to set the foundations for a successful title defence later in the year.\nManager: Jim McGuinness (2nd season)\nLast year: Promoted as Division Two winners\nFixtures: Kerry (A), Dublin (H), Armagh (H), Galway (A), Derry (H), Tyrone (H), Mayo (A)\nThe band is getting back together for the Tir Chonaill with the return of their 2012 All-Ireland winning captain Michael Murphy the headline change ahead of Jim McGuinness' second season back at the helm.\nTake two under Jim back in 2012 ended with the greatest success of them all and the return of Murphy will undoubtedly heighten expectations in an already football mad county.\nEoghan McGettigan, Finnbarr Roarty, Eoin McHugh, and Odhran McFadden-Ferry have also returned to the panel.\n2024 served as a great stabiliser for the men in green and gold after a turbulent 2023 with both the Division Two trophy and Ulster title annexed off before falling just short against Galway in the All-Ireland semi-final.\nThe belief in many quarters may be that it was one left behind by Donegal. But with a side now bursting with talent and experience, one of the game's great thinkers in McGuinness and the return of Murphy - who knows the new rules better than most having been part of the Football Review Committee - the perfect recipe for success is there.\nManager: Paddy Tally (1st season)\nLast year: Division One league champions\nFixtures: Tyrone (A), Kerry (H), Galway (H), Dublin (A), Donegal (A), Mayo (H), Armagh (A)\nIt is a measure of how much Derry have improved over the last few years that a season which heralded a Division One title and defeat by Kerry in the All-Ireland quarter-final was considered a massive failure.\nWith Mickey Harte having stepped aside, another Tyrone native in Paddy Tally has stepped in to take over the reins. As fate would have it, his first assignment is a trip to Omagh to face his home county before Kerry, the side he coached to the All-Ireland in 2022, visit Celtic Park.\nThe Oak Leafers will look to find a few diamonds in the rough to extend a panel which looked light of depth over the past few seasons, which perhaps stopped the biggest prize of them all from arriving on Foyleside.\nTally will know the talent at his disposal after encountering his new side up close and personal throughout his time last few years coaching Kerry.\nHe will look to Shane McGuigan, Conor Glass, Brendan Rogers and Ciaran McFaul to spearhead his side's resurgence after the retirement of veteran defender Chrissy McKaigue while Padraig McGrogan remains sidelined with injury.\nManager: Malachy O'Rourke (1st season)\nLast year: Fifth in Division One\nFirst up: Derry (H), Armagh (A), Mayo (H), Kerry (H), Galway (A), Donegal (A), Dublin (H)\n'Things can only get better' will be the belief amongst Red Hand supporters this year after three relatively poor campaigns following a surprise All-Ireland success in 2021.\nExpectations are rising once again in Tyrone with the appointment of Malachy O'Rourke - another former member of the Football Review Committee - as manager and the county's back-to-back All-Ireland under-20 triumphs.\nThe Brian Dooher and Feargal Logan era ended dismally last summer with a first championship defeat by Roscommon in the All-Ireland preliminary quarter-final.\nGiven Errigal Ciaran's run to the All-Ireland Club final, O'Rourke will likely be without Peter Harte, Joe Oguz, Cormac Quinn, Darragh and Ruairi Canavan for Saturday's blockbuster opener against Derry.\nInstead, it will be up to the likes of Niall Morgan, Darren McCurry and the evergreen Mattie Donnelly to lead the charge.\nThe new generation may also play their part and that includes highly-rated forward Eoin McElholm, who will remain in the white and red of Tyrone despite interest from Australian Football League [AFL] clubs.\nManager: Raymond Galligan (2nd season)\nLast year: 3rd in Division Two\nFirst up: Monaghan (H), Meath (A), Louth (H), Westmeath (A), Down (H), Roscommon (A), Cork (H).\nMoving straight into management after hanging up the boots can be a daunting transition but Raymond Galligan managed it seamlessly last year.\nThe Breffni men narrowly missed out on promotion last Spring with heavy hitters Donegal and Armagh taking their place. The championship can be viewed through a positive prism, in Ulster neighbours Monaghan were dumped out before an agonising extra-time defeat to Tyrone.\nThe experience of the round-robin campaign will stand to an emerging county and if they can keep talisman Paddy Lynch fit and firing they will be more than capable of securing promotion to the top tier.\nManager: Conor Laverty (3rd season)\nLast year: Promoted as Division Three runners-up\nFirst up: Roscommon (A), Cork (H), Meath (H), Louth (A), Cavan (A), Westmeath (H), Monaghan (A)\nDown, one of Ulster's sleeping giants, have made it out of the third tier and will be hoping that last year's Tailteann Cup will provide the springboard for further success.\nConor Laverty will only have been able to turn his full focus to inter-county affairs in early December after his playing commitments with his club Kilcoo ended in an Ulster final defeat by Errigal Ciaran.\nRoscommon away is a difficult start as the Rossies will be viewed by many as the favourites to make an immediate return, but any return from that fixture will leave the Mournemen in a strong position to contend.\nOdhran Murdock will once again look to shine and he will be the go-to man if there is to be success.\nA good first season in the second tier may end in consolidating their position and building for a strong championship showing in the summer.\nManager: Andy McEntee (3rd season)\nLast year: 5th in Division Three\nFirst up: Clare (H), Fermanagh (A), Offaly (A), Leitrim (H), Laois (A), Sligo (H), Kildare (A)\nIt is year three for Andy McEntee and he will be hoping to build on a fairly positive 2024.\nThird-tier status was secured via a final day shoot-out with Oisin McConville's Wicklow in Belfast.\nInconsistences blighted the Saffron charge in the league last season but a run to the semi-final of the Tailteann Cup and beating promotion rivals Fermanagh will give Antrim fans enough hope heading into 2025.\nGiven their Ulster Championship opener pits them against All-Ireland champions Armagh, it's likely that consolidation in the third tier and another run in the Tailteann will constitute a successful season.\nManager: Kieran Donnelly (4th season)\nLast year: Relegated from Division Two\nFirst up: Kildare (A), Antrim (H), Clare (A), Offaly (H), Sligo (H), Leitrim (A), Laois (H)\nJust two points separated third place and seventh position in Division Two last term with Fermanagh perhaps feeling hard done by as they fell through the trap door.\nThe Tailteann Cup felt like a bust as they fell to Ulster rivals Antrim but Kieran Donnelly will feel that promotion back to the second tier is attainable.\nThe Ernesiders will be boosted by the presence of Ultan Kelm. The talented Erne Gaels forward visited Freemantle Dockers to explore a potential move to the AFL but is available for Fermanagh in what is a sizeable boost for Donnelly.", "url": "https://www.bbc.com/sport/articles/ckgr44x4e68o"}