{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:06", "date_modify": "2025-05-21 06:32:06", "date_publish": "2025-03-31 17:56:34", "description": "Yorkshire head coach Anthony McGrath confirms England batters Harry Brook and Joe Root will not play in Friday's opening County Championship game.", "filename": "sport_cricket_articles_ckg20375nz2o_1747809126.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/30af/live/6ea535f0-0e57-11f0-935b-db45f1a7a4cb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_ckg20375nz2o_1747809126.html", "title": "Yorkshire: Harry Brook and Joe Root to miss County Championship opener", "title_page": "Yorkshire: Harry Brook and Joe Root to miss County Championship opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Yorkshire head coach Anthony McGrath has confirmed that England batters Harry Brook and Joe Root will not be available for Friday's opening game of the County Championship season.\nThe White Rose face Hampshire in their first match since being promoted back to Division One.\nYorkshire have six Division One games before England's first Test of the summer against Zimbabwe on 22 May, the last of them scheduled to finish only three days earlier.\n\"I know that they're having their appraisals over these next few days, the England guys, so we'll probably know ahead of that Hampshire game where they're looking to play,\" McGrath told the club website., external\n\"I don't think we'll see [them] loads, but hopefully a few.\n\"I don't know if they have camps leading up to that Zimbabwe Test. So I'm not sure when we'll see them, but I don't think it will be the first couple of rounds.\"\nBrook, 26, scored 388 runs in five County Championship games last season, while 34-year-old Root hit 442 in the same number of appearances.", "url": "https://www.bbc.com/sport/cricket/articles/ckg20375nz2o"}