{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:27", "date_modify": "2025-05-21 05:25:27", "date_publish": "2025-02-12 00:00:00", "description": "Follow live text commentary, score updates and match stats from Burnley v Hull City in the Championship.", "filename": "sport_football_live_cqldplxxd4pt_1747805127.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cqldplxxd4pt_1747805127.html", "title": "Burnley v Hull City: Championship stats & head-to-head", "title_page": "Burnley v Hull City: Championship stats & head-to-head - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Burnley beat Hull City to maintain the pressure on their automatic promotion rivals in the Championship, keeping a record-breaking clean sheet in the process.\nThey made a lightning start through defender Bashir Humphreys' fizzing strike from the edge of the area in the third minute, before Zian Flemming's downward header made it 2-0.\nThe Clarets are the first team in the history of the second tier to go 10 consecutive league games without conceding a goal.\nThey remain in third place in the league table, still three points off the top two.\nHull stay 22nd and inside the drop zone, a place below Derby County on goal difference.\nThe game had just started to get going when Lyle Foster cutely laid the ball back to left-back Humphreys, who unleashed a low shot which bounced off the surface and into the bottom corner.\nScott Parker's side threatened to add another goal soon after, with Jaidon Anthony cutting inside and stinging the palms of Tigers goalkeeper Ivor Pandur.\nHowever, the winger's constant threat on the right soon led to Burnley's second, as he dribbled his way into a great crossing position before sending an inviting delivery towards Flemming, whose header narrowly evaded Pandur's dive.\nWith the home side firmly on top, Hull were looking out of sorts as Flemming flashed a shot just wide of the post, before sending a powerful strike over the bar.\nA clear opening for Ruben Selles' side finally came when Kyle Joseph glanced a header off target from Eliot Matazo's defence-splitting ball.\nThe second half took time to get going, with Hull substitute Mason Burstow trying a hopeful effort from range, and Joao Pedro having a shot tipped over by Burnley keeper James Trafford.\nThe Clarets have now kept 23 clean sheets in 31 league games this season and are only two off matching the Championship record of 25 for a full campaign set by Queen Park Rangers in 2010-11.", "url": "https://www.bbc.com/sport/football/live/cqldplxxd4pt"}