{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:33:41", "date_modify": "2025-05-21 06:33:41", "date_publish": "2025-03-31 06:26:24", "description": "All the key BBC coverage details for the Japanese Grand Prix, which takes place on 6 April.", "filename": "sport_formula1_articles_cvged1yq3l5o_1747809221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1c4d/live/f4bcca70-0eb8-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_cvged1yq3l5o_1747809221.html", "title": "Japanese Grand Prix practice, qualifying and race times, UK times, plus weather forecast", "title_page": "Japanese Grand Prix practice, qualifying and race times, UK times, plus weather forecast - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Formula 1 is in Suzuka for round three at the Japanese Grand Prix from 4-6 April.\nMax Verstappen starts Sunday's race on pole after edging Lando Norris in qualifying.\nMcLaren will still fancy their chances and have shown their dominance so far with two wins from two races, Oscar Piastri taking the chequered flag first in China after Norris did so at the season opener in Australia.\nNorris leads the drivers' championship, eight points ahead of Verstappen.\nYuki Tsunoda is driving for Red Bull at his home race after replacing Liam Lawson, who was dropped after just two grands prix, but he could only qualify 15th.\nSunday's race in Suzuka starts at 06:00 BST.\nCommentary of the race will be available across BBC Radio 5 Live, BBC Sounds and the BBC Sport website and app.\nYou can also listen via most smart speakers. All you need to do is say \"ask BBC Sounds to play the Japanese Grand Prix\".\nMake sure to download the Chequered Flag podcast, which previews and reviews every race of the season.\nAll times BST\nSunday, 6 April\nRace: 06:00 (BBC Radio 5 Live coverage from 05:30, BBC Sounds and smart speakers)", "url": "https://www.bbc.com/sport/formula1/articles/cvged1yq3l5o"}