{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:14:31", "date_modify": "2025-05-20 12:14:31", "date_publish": "2023-08-04 15:26:09", "description": "Highfield Princess claims a brilliant three-length victory in the King George Stakes at Glorious Goodwood.", "filename": "sport_horse-racing_66410180_1747743271.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/106EA/production/_130660376_gettyimages-1592081519.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_horse-racing_66410180_1747743271.html", "title": "Glorious Goodwood results: Highfield Princess wins King George Stakes", "title_page": "Glorious Goodwood results: Highfield Princess wins King George Stakes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Highfield Princess claimed a brilliant victory in the King George Stakes at Glorious Goodwood.\nThe 4-9 favourite, ridden by Jason Hart for trainer John Quinn, won by three lengths from White Lavender, with Raasel third.\nHighfield Princess is now about a 2-1 chance to win a second successive Nunthorpe Stakes at York on 25 August.\nEarlier at Goodwood, Frankie Dettori won aboard 6-1 chance Epictetus in the Thoroughbred Stakes.\nDettori, 52 - riding at his last Glorious Goodwood before retiring later this year - won by a length for trainers John and Thady Gosden from 4-6 favourite Nostrum.\nHighfield Princess' win in the 2022 Nunthorpe was one of three top-level Group One triumphs last year.\nHaving placed in the King's Stand and Queen Elizabeth II Jubilee Stakes at Royal Ascot in June, she stepped down to the Grade Two race at Goodwood, and the six-year-old mare won easily after going clear with a furlong to go.\n\"There's no gimmes in this game. All races are hard to win so we're delighted,\" said Quinn.\nSerried Ranks, owned by the King and Queen, provided a second Royal winner of the week when landing the Irish Nursery.\nThe 8-1 shot, ridden by Rossa Ryan, beat 3-1 favourite Starlust as trainer Ralph Beckett claimed a one-two.", "url": "https://www.bbc.com/sport/horse-racing/66410180"}