{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:57:11", "date_modify": "2025-05-21 04:57:11", "date_publish": "2025-04-04 13:32:39", "description": "Swansea City: Club still hopeful over Harry Darling contract", "filename": "sport_football_articles_c1wdq8jlqw4o_1747803431.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b82/live/7cf5e790-1158-11f0-9c64-93da9e1b4cb6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1wdq8jlqw4o_1747803431.html", "title": "Swansea City: Club still hopeful over Harry Darling contract", "title_page": "Swansea City: Club still hopeful over Harry Darling contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Director of football Richard Montague says Swansea City remain in discussions with Harry Darling as they attempt to convince the centre-back to sign a new deal.\nDarling, 25, has made 107 appearances since joining Swansea in 2021 and has established himself as a key figure this season.\nBut as things stand, he will be free to join another club for nothing when his contract expires this summer.\nMontague says Swansea have made Darling what they consider to be a \"fair offer\".\n\"We will do our best to get him to sign as he's a really important player, but our job is figuring what's the amount we want to pay Harry,\" Montague told a fans' forum held at the Swansea.com Stadium on Thursday.\n\"There is an amount he would accept today, but our job is to work out what allows us to spend money we need to spend on the rest of the squad.\n\"We can't spend the entire budget on Harry, but there is an amount that makes sense for us and for him, so we'll work to find that.\"\nMontague says Swansea must accept that they will miss out on potential signings – and fail to convince current players to extend their deals – because of the club's financial constraints.\nAnd he stressed that in future, Swansea would \"be working incredibly hard\" to tie down players before the prospect of leaving on a free comes into view.\nCaretaker head coach Alan Sheehan believes Darling may yet follow fellow defender Ben Cabango's lead by signing a new contract.\n\"I am hoping, we all hope, that there will be positive movement on that,\" Sheehan said.\n\"I love Harry Darling, I don't make any secret of that.\n\"I am quite hard on him at times but we have a wonderful relationship and he has been exceptional in this block of games and we miss him when he's not playing.\"", "url": "https://www.bbc.com/sport/football/articles/c1wdq8jlqw4o"}