{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:55", "date_modify": "2025-05-21 05:53:55", "date_publish": "2025-02-01 00:00:00", "description": "Leeds United thrash Cardiff 7-0 to stay top of the Championship, while Sheffield United beat Derby 1-0 to send the Rams to a seventh straight defeat.", "filename": "sport_football_live_crl3lwgn65wt_1747806835.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_crl3lwgn65wt_1747806835.html", "title": "Championship: Leeds hit seven past Cardiff; Sheff Utd beat Derby", "title_page": "Championship: Leeds hit seven past Cardiff; Sheff Utd beat Derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Marching on together\n#bbcefl\nA red letter day for Leeds United at the top of the Championship after putting seven past Cardiff City - a statement result if ever there was one.\nWas this the afternoon they stamped their credentials to win this division?\nBut Sheffield United matched their win, although Burnley slipped behind after a TENTH goalless draw of the season.\nPlymouth showed big signs of life at the bottom, but the misery goes on for Paul Warne and Derby County after a seventh straight defeat.\nYes, it has been another eventful day of football in the second tier.\nThanks for joining us and we hope you can join us on Monday for that Tees-Wear derby.\nMonday night's derby showdown\n#bbcefl\nThe Championship action isn't quite done for the weekend just yet.\nWe've been served up plenty of goals and entertainment today and in last night's Lancashire derby.\nThere is also another derby on the way on Monday night at 20:00 GMT and it's a big one.\nMiddlesbrough welcome Sunderland to the Riverside for the Tees-Wear rivalry with Boro looking to get back into the play-off spots and Sunderland hoping to keep pace with the top two.\nWe will bring you live text coverage of that one, as always, here on the BBC Sport website.\nI can’t really knock my team for the efforts - Warne\nFT: Derby 0-1 Sheff Utd\nDerby County\nDerby County head coach Paul Warne told BBC Radio Derby:\n“I’m hugely disappointed, as everybody is, and I’m well aware of the situation.\n“But I can’t really knock my team for the efforts they are giving me. And it’s our job as coaches to get as much out of the lads as we can. I’m disappointed we lost because we only conceded one shot in the second half.\n“But we are in that form at the moment where we don’t take any half chances that we get, and any we concede seem to go in. That is what my overriding emotion is.\n“I just think at the moment that this performance, as an independent performance, wouldn’t have been as disappointing. But it's on the back of loads of poor results, I understand that.\n“I do believe in it [being able to turn Derby around] and if I didn’t I wouldn’t stand there.”\nI can only apologise to the fans - Riza\nFT: Leeds 7-0 Cardiff\nCardiff City\nCardiff City boss Omer Riza told BBC Radio Wales: \"Brutal. I'm very disappointed. I can only apologise to the travelling fans.\n\"We knew we were coming up against a tough and resilient Leeds who do not give away too many opportunities and who create a lot and it is a painful result.\n\"To lose 7-0 is unacceptable really, no matter how good the opposition is, but we have to move forwards.\n\"Leeds are very good. But we lacked at really important moments in the game. We said about not giving the ball away cheaply because Leeds will punish you and we did that on numerous occasions.\"\nImpressive scoreline makes it more special - Farke\nFT: Leeds 7-0 Cardiff\nLeeds United\nLeeds United boss Daniel Farke told BBC Radio Leeds:\n\"After a win always relief, but winning with such an impressive scoreline makes it more special.\n\"We have said this league is relentless and to succeed you need to become relentless yourselves and that is more or less what we have shown today.\n\"What I liked a lot about this performance is in the last 20 minutes when we were 4-0 and 5-0 up we still had the desire to sprint back and press and defend the clean sheet and also the intention to create more chances and to score further goals.\n\"We perhaps could have scored even more goals.\"\nThe lads gave everything - Calm\nFT: Millwall 2-1 QPR\nQPR\nQPR assistant head coach Xavi Calm took the post-match press duties with boss Marti Cifuentes suffering with illness and not at the game today.\n\"He's [Marti Cifuentes] OK, not good enough to come to the game,\" Calm told BBC Radio London.\n\"He was on the coach with the blanket, trying to be in touch with us and hopefully he'll recover as soon as possible but today it wasn't possible to be here for him.\n\"[The start to the game was] Tough because we didn't expect to concede this type of goal early in the game. We reacted really well after conceding the goal with an amazing goal but it's always a shame to concede these type of goals that we never concede usually.\n\"The second goal, maybe we were not as good as we normally are. And in the second half we reacted again but we didn't get the one point that we had the feeling we deserved.\n\"In the second half we pushed, the lads did really well. They gave us everything until the end, the bench impact was there and was good but at the end is a 2-1, no point for us and we have to move on and try to get the points on Tuesday [against Blackburn Rovers].\n\"The lads are working hard. They are doing everything to get the points.\"\nOn Jimmy Dunne's absence: \"He's a Queens Park Rangers player. He felt a little bit the groin two days ago and we picked the best team we had available to play the game. He's our player, hopefully he's going to carry on as one of us.\"\nFootball can change quickly - Neil\nFT: Millwall 2-1 QPR\nMillwall\nMillwall boss Alex Neil says today's win over QPR - which was their third on the bounce - \"shows how quickly football can change\".\n\"The last home game here, there was a lot of frustration conceding in the 97th minute [against Cardiff City] which I understand,\" he told BBC Radio London\n\"I think since then we've been brilliant in terms of the performances and results.\n\"It was important to me today that we won at home. Most of our fans come to see us here so I want for them to go home happy and put on a performance and, more importantly, carry a threat and score goals. I think right from the start we did that today.\"\nOn the club's transfer activity: \"The boys have been brilliant. We always knew we'd be bringing players in and Romain [Esse] would be moving on provided someone came in and bought him.\n\"We knew we were going to bring in younger players and develop the style.\n\"The hard bit to with all of that is to do it and win, and we're doing that. We're doing what we set out to do and at the moment it's going really well.\"\n'We lacked something' - Parker\nFT: Portsmouth 0-0 Burnley\nBurnley\nBurnley head coach Scott Parker told BBC Radio Lancashire:\n\"It's a difficult place to come as you see their results over the last few weeks. Portsmouth are a different animal at home, an agressive team, they put you under pressure constantly.\n\"We had to stand up to that and that is the one positive today. This game could have looked very different without that resilience.\n\"But we weren't at our best today, we lacked something. We couldn't really get a foothold.\n\"So it's a good point in the end.\"\n'It has to be a good day for us' - Bloomfield\nFT: Sheff Wed 1-1 Luton\nLuton Town\nLuton manager Matt Bloomfield was delighted to see his side break a run of 11 straight league defeats on the road and feels good signs are there for the Championship strugglers.\n“I can feel the spirit growing, I can feel the confidence growing, but that’s only words from me unless we back it up with results,\" he told BBC Three Counties Radio\n\"A point away from home always has to be respected and I thought there was some really good individual displays in there.\n“First half I thought our shape was fantastic, we limited Sheffield Wednesday to very few opportunities.\n\"I think we tired a bit, we’ve got some boys still working their way back to full fitness, but at any level, you’ve got to defend for your lives at times.\n“I was really pleased that the boys got some reward for their work because they’ve worked really hard this week, at least they’ve got a point and it was nice to share that with the supporters at the end.\n“It’s a stepping stone for us, of course we want to win away from home, but it’s been a long run and to show that character and togetherness and get a point on the road has got to be a good day for us.”\nWe will get better - Wilder\nFT: Derby 0-1 Sheff Utd\nSheffield United\nSheffield United boss Chris Wilder told BBC Radio Sheffield: “It was a little bit disjointed in terms of the performance, which was made by the commitment, the press, the first and second balls by the opposition.\n“The pitch wasn’t great, our transition, when we broke it up first half, wasn’t good and we just needed to take more care of the ball.\n“But when we did, we found a couple of moments and that is all you need and we found the great moment. It was fabulous work from Tom Cannon and fabulous finish from Ben [Brereton Diaz] coming in the back stick.\n“We will get better, and quickly we have to get better. But most important was winning a game of football today. It was a great reaction from Friday night [when beaten by Hull City].”\n'Lots of elements to our win' - Robins\nFT: Hull 1-2 Stoke\nStoke City manager Mark Robins reflected on his first league win in charge, telling BBC Radio Stoke:\n\"That is a big win because we've not felt like that for a while. It's really important and we've got to try and build some momentum somewhere and at some point.\n\"We started a little bit slow and our belief was lacking in a couple of areas where it really cost us in terms of possession. It's having that belief to go and take the game to the opposition like I know they are capable of doing.\n\"I really enjoyed the win at the end of it because there were a load of different elements to it. We stuck in, we dug in, we didn't get overawed, we clawed our way back into it, we got our noses in front, we stuck to that and ended up getting our three points.\n\"That was a collective effort from everybody.\"\n'A very complete performance' - Lampard\nFT: Swansea 0-2 Coventry\nCoventry\nCoventry City boss Frank Lampard felt the Sky Blues were well worth their first win in Swansea since 1950.\n\"Those records are there to be broken and we broke it in style - I thought we were fantastic today,\" Lampard told BBC CWR.\n\"Everything about the performance, other than scoring two or three more goals, but it was a very complete performance from us and we deserved it.\n\"From the first minutes you could see the players were on it and we were very good off the ball, very solid, compact and aggressive, and then we were dangerous through the front men.\n\"The second half we could have scored at least another couple, blocks and good saves from their goalkeeper.\n\"I never really felt threatened by them which was testament to the focus of the team today.\n\"It's important we stay on top of ourselves, don't get too carried away. We're on a good run of form, a good run of results, but to sustain it is another step.\"\n'Fine margins went in other direction' - Selles\nFT: Hull 1-2 Stoke\nSpeaking to BBC Radio Humberside, Hull City head coach Ruben Selles said:\n\"We scored the goal, we continued pushing, we created enough situations to score the second but we didn't.\n\"Then we concede in a situation we should defend better and then the second half wasn't as good but we were still having situations, having chances and then we concede another goal that we should defend better.\n\"The fine margins that went in our direction against Sheffield United have gone in the other direction today. But we need to start to grow in those moments and do better as a team.\"\n'We deserve to be at this level' - Mousinho\nFT: Portsmouth 0-0 Burnley\nPortsmouth\nPortsmouth manager John Mousinho told BBC Radio Solent:\n\"I'm probably slightly disappointed only taking a point, considering the chances we created, but really happy with the performance against one of the top sides in the league.\n\"Building on that is the most important thing next week as we try to move forward. I've tried to emphasise that with the players.\n\"We have these performances and we need to take all the positives and believe in ourselves a bit more as we deserve to be at this level with performances like that.\"\n'We were caught a little bit in between'\nFT: Watford 0-1 Norwich\nNorwich City\nNorwich head coach Johannes Hoff Thorup believed his side didn't know whether to stick or twist in the second half after an attack-laden first period.\n\"It was hard fought, but I'm pleased with the first half,\" he said.\n\"We were good and we were dominant. We should have been one-nil up after two minutes, it was a big chance for Sarge (Josh Sargent).\n\"After the red card the game changed a little bit, we should have done better in the second half. We were caught a little bit in between whether to chase the second goal or whether we should just control the game.\n\"I'm pleased that we really didn't give anything away, but I'm not so pleased with the amount of chances we created.\"", "url": "https://www.bbc.com/sport/football/live/crl3lwgn65wt"}