{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:53:06", "date_modify": "2025-05-21 05:53:06", "date_publish": "2025-01-26 00:00:00", "description": "Fermin Lopez scores twice and provides two assists as Barcelona thrash Valencia in La Liga.", "filename": "sport_football_live_cr46zx5lpnxt_1747806786.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cr46zx5lpnxt_1747806786.html", "title": "Barcelona 7-1 Valencia: Fermin Lopez scores twice in huge Barca win", "title_page": "Barcelona 7-1 Valencia: Fermin Lopez scores twice in huge Barca win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Fermin Lopez scored twice and provided two assists as Barcelona thrashed Valencia to end their four-game winless La Liga run.\nFrenkie de Jong fired low into the bottom corner after two minutes before the hosts increased their lead through a Ferran Torres strike.\nRaphinha was sent clear through on goal and slotted into an empty net as Barca went three goals up within 14 minutes.\nLopez skillfully controlled a long ball over the top and finished past Liverpool-bound goalkeeper Giorgi Mamardashvili before adding a second in first-half stoppage time when he reacted quickest to slot in the rebound from Raphinha's strike off the crossbar.\nDiego Lopez's cross was converted by Hugo Duro for a Valencia consolation just before the hour mark.\nSubstitute Robert Lewandowski finished into the bottom corner for his 17th league goal of the season before Cesar Tarrega scored an own goal, as the hosts recorded their biggest La Liga win since they beat Real Valladolid 7-0 in August 2024.\nIt comes after their extraordinary 5-4 Champions League victory over Benfica on Tuesday.\nBarca have scored 100 goals in just 32 games in all competitions under Hansi Flick, making him the second-fastest manager to reach that figure with the club after Helenio Herrera in 1959 (31 games).\nFlick's side are third in the table, seven points behind leaders Real Madrid while Valencia - managed by former West Brom head coach Carlos Corberan - continue to struggle in 19th.\nBarca host Serie A side Atalanta on Wednesday (20:00 GMT), with their Champions League last-16 place already confirmed.", "url": "https://www.bbc.com/sport/football/live/cr46zx5lpnxt"}