{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:05:55", "date_modify": "2025-05-21 07:05:55", "date_publish": "2025-03-29 00:00:00", "description": "Josh Sargent keeps Norwich City's Championship play-off hopes alive with a dramatic added-time winner against West Brom.", "filename": "sport_football_live_cg5djdj0mj9t_1747811155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e49/live/62437e90-0cc0-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cg5djdj0mj9t_1747811155.html", "title": "Norwich City 1-0 West Bromwich Albion: Canaries beat play-off rivals", "title_page": "Norwich City 1-0 West Bromwich Albion: Canaries beat play-off rivals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Josh Sargent kept Norwich City's Championship play-off hopes alive with a dramatic added-time winner against West Brom at Carrow Road.\nIt was a first victory in five games for Johannes Hoff Thorup's side, while the sixth-placed Baggies were beaten for the first time in seven.\nThey have not won away from home since November and came closest to a goal in the first half when Mason Holgate's effort was disallowed for offside.\nSargent was denied by Joe Wildsmith early in the game, but the Baggies keeper could not keep out his late shot after the US international was played through by substitute Marcelino Nunez.\nThe win lifted Norwich up three places to 10th and cut the gap between them and West Brom to five points, with seven games to play.\nIn the build-up to the game, Canaries head coach Johannes Hoff Thorup insisted that he and the Norwich squad still believed a repeat of last season's run to the play-offs was possible.\nThey had Scotland's Angus Gunn back in goal following a hamstring injury, but were without left-back Callum Doyle because of a calf problem, while West Brom made two changes with Callum Styles and Tom Fellows included in the starting XI.\nThe visitors were first to threaten with Gunn fumbling Karlan Grant's shot just wide of the post and away for a corner but then getting down superbly to his right to keep out a Torbjorn Heggem header.\nNorwich responded quickly with Borza Sainz putting Sargent through for their only on-target attempt of the first half, but Wildsmith saved with his legs and Ante Crnac curled the follow-up just wide.\nGrant again tested Gunn with an effort from outside the box resulting in another corner which led to Holgate finding the net after the home side were unable to clear, only for an offside flag to leave the scoreline goalless at the interval.\nThe Canaries had the first opening after the break as Kenny McLean played in top scorer Sainz, but his shot was straight at Wildsmith, to the frustration of home supporters perhaps anticipating the Spaniard's 19th goal of the campaign.\nThe flow of the game was interrupted by a series of free-kicks in the second half before John Swift flashed a shot over the Norwich bar as West Brom looked to generate some momentum going forwards.\nA foul by Kyle Bartley allowed Norwich sub Marcelino Nunez to line up a free-kick but his aim was not quite good enough, but with a point each looking like the final outcome, the Chilean produced a perfectly weighted ball for Sargent to run onto and he cut inside before firing home.\nWest Brom face two big games next, at home to fourth placed Sunderland and away to Bristol City, who are eighth but level on points with them - while Norwich make the trip to bottom club Plymouth next Saturday before Sunderland are the next visitors to Carrow Road three days later.\nNorwich head coach Johannes Hoff Thorup told BBC Radio Norfolk:\n\"The players definitely think we can give it a late push and based on that, we needed a win.\n\"Knowing that we will be without a left-back for probably the rest of the season was one of the reasons behind the different approach because last time we played against West Brom, (Tom) Fellows on the right side created problems for us.\n\"When you decide to have a five in the backline instead of four, you probably lose a bit of intensity in the first line of your pressing game and that's what we had to accept and do what it takes to be compact as a team.\n\"At the end of the day, everyone just wants to see us win so we do what is necessary - it's not my favourite kind of football, but I'm not that stubborn, not to do what it takes once in a while to get a result.\"\nWest Brom boss Tony Mowbray told BBC WM:\n\"I thought the team played extremely well, as good as in my time here, with the control that we had.\n\"Norwich are a good team with some special individuals but we generally kept them pretty quiet, their keeper was forced to make more saves than ours.\n\"There's lot to be pleased with but what matters in football is the result at the end of the day and we're all left frustrated and disappointed.\n\"Sometimes you don't get what you deserve in football and we definitely didn't, it was a cruel day for us.\"", "url": "https://www.bbc.com/sport/football/live/cg5djdj0mj9t"}