{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:13", "date_modify": "2025-05-21 03:58:13", "date_publish": "2025-04-07 08:34:06", "description": "Former British and Irish Lions and Wales fly-half Dan Biggar announces he will retire as a player at the end of the season.", "filename": "sport_rugby-union_articles_c807ye7v271o_1747799893.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8602/live/43522e10-1386-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c807ye7v271o_1747799893.html", "title": "Dan Biggar: Former Wales and Lions fly-half announces retirement", "title_page": "Dan Biggar: Former Wales and Lions fly-half announces retirement - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former British and Irish Lions and Wales fly-half Dan Biggar will retire as a player at the end of the season.\nBiggar will finish his 18-year career with French club Toulon, who he joined in November 2022.\nThe 35-year-old won 112 caps for Wales in a 15-year Test career and scored more than 600 points. His final appearance was at the 2023 Rugby World Cup.\nHe won three Six Nations titles and a Grand Slam with Wales and was captain during the Wayne Pivac era.\nBiggar went on two British and Irish Lions tours, making three Test appearances in South Africa in 2021.\n\"There comes a point where you just know, not because of anything in particular, but someone once said to me 'when you know, you'll know',\" Biggar said as he announced his decision on social media.\n\"Rugby has given me everything. I threw myself into this game at 17 and it's given me a life that I could never have imagined.\n\"I've lived out my childhood dreams for the best part of two decades and I'm so, so grateful for that.\"\nBiggar started his youth career at Gorseinon RFC and Gowerton Comprehensive in Swansea before playing a season for Swansea RFC in the Welsh Premiership.\nHe made his senior Ospreys debut in 2008 and during an 11-year spell made 221 appearances and scored 2,203 points, making him the region's record points scorer.\nBiggar was also instrumental in securing two Pro12 titles in 2010 and 2012 and paid tribute to a former Ospreys coach in his retirement address.\n\"A special mention has to go to Sean Holley, who took a chance on a young, cocky 17-year-old when public opinion told him to do otherwise. Who knows if things would have turned out if you hadn't, so thank you Sean,\" he said.\nNorthampton came calling in 2018 and Biggar made 69 appearances for Saints, helping them to lift the Premiership Rugby Cup and reach the league knock-out stages in his first season.\nBefore his contract at Franklin's Gardens expired, Biggar took an opportunity to sign for French giants Toulon, where he will see out the remainder of the 2024-2025 season.\nReflecting on his career, Biggar said there had been moments in rugby he would never forget, including winning his first cap for Wales in 2008, becoming a Test centurion in 2022 and a Lion the previous year.\nBut he says those are not been his greatest achievements.\n\"The thing I'm most proud about is being able to give my family opportunities in life, that's what means the most to me and what I'm most proud of,\" Biggar said.\n\"To my amazing wife Alex and my two beautiful boys I can't thank you enough for everything you've done for me. You were always there to pick me up when things were low and have been by my side through everything when I've needed it. I'm very lucky.\"\nBiggar also remembered his late mother, who he described as his \"biggest fan\".\n\"The one person who isn't here to say thank you to is my mum, who sadly passed away four years ago,\" he said.\n\"Everything I've done over the last 18 years is because of her.\"\nBiggar admitted wearing the prestigious 10 shirt for Wales \"hasn't always been plain sailing and easy\", but it helped to make him a stronger person and player.\nHe also reflected on a difficult past year at Toulon.\n\"I also know that the last 12 months haven't quite gone as I'd hoped with Toulon, it's been tough and setbacks teach you a lot more about yourself and over the last 12 months I've learned a huge amount,\" he said.\n\"There's no real perfect moment to walk away, but this does feel like the right one.\n\"I'm choosing to retire, which a lot of sportspeople don't get to do when they're healthy and I feel very grateful and excited about what's coming next.\n\"Rugby will always be a part of me, but now it's time to give a little bit of time back to my family in this beautiful part of the world and see what challenges come next.\"\nBiggar finished by thanking the game of rugby itself, the people, the memories and lessons.\n\"I can honestly say I gave it everything I had and now it's time for something new,\" he said.\n\"Thank you, diolch, merci.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c807ye7v271o"}