{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:47:24", "date_modify": "2025-05-21 05:47:24", "date_publish": "2025-01-31 18:18:47", "description": "Motherwell and Scotland defender Stephen O'Donnell says he has faced sectarian abuse during his career.", "filename": "sport_articles_cn4z120jx1zo_1747806444.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4833/live/68706870-dffa-11ef-bd1b-d536627785f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cn4z120jx1zo_1747806444.html", "title": "'Minority spoil it for the rest'", "title_page": "'Minority spoil it for the rest' - O'Donnell reveals sectarian abuse - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell and Scotland defender Stephen O'Donnell says he has faced sectarian abuse during his career.\nO'Donnell also called for more supporters to call out derogatory language when they hear it in order to stamp it out.\nSpeaking in the wake of Stuart Kettlewell's Fir Park exit, where \"personal abuse\" against the manager was cited by the club, O'Donnell said: \"All the sectarianism, the racism and the abuse is always the minority.\n\"From my experience, a lot of abuse has got better. The sectarian stuff has dialled right down. I used to get it a lot when I first started, so I'm pleased with that.\n\"As a society we can always strive for more. That side of it that hurts me has got better and hopefully we can get better all round.\n\"Society is changing but sometimes you want it to change a bit quicker. Thankfully it has got quieter. When it goes too far and crosses lines, self-policing is the best policy.\"\nThe 32-year-old, who is a former Celtic youth and has also played for Partick Thistle, Luton Town and Kilmarnock, says he has suffered abuse off the pitch as well as on it.\n\"I've had eggs thrown at my window,\" he added.\n\"I don't like saying it's part and parcel because it shouldn't be, but I signed up for it. My kids are too young to understand and my wife doesn't like football, so that's one of the perks.\"\nO'Donnell says Motherwell's players support Kettlewell's decision to resign, but insists it was a small proportion of supporters responsible.\nIn a statement, Motherwell said they reluctantly accepted Kettlewell's resignation and that abuse from the stands during a poor run of form had affected the 40-year-old's family.\nMotherwell have lost three games in a row, have gone four without a victory and have won just one in nine\n\"The vast majority of fans in football are great, but there is always the people that spoil it for the rest,\" O'Donnell said.\n\"We all have weaknesses. When your family are involved, your kids are involved, that is going to take a toll. It's up to the individuals involved to make a decision and the manager has, and we stand by what he decides.\"", "url": "https://www.bbc.com/sport/articles/cn4z120jx1zo"}