{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:58:41", "date_modify": "2025-05-20 11:58:41", "date_publish": "2023-08-06 09:19:57", "description": "Portsmouth head coach John Mousinho says his side \"didn't execute well enough\" in draw with Bristol Rovers on opening day of the EFL season.", "filename": "sport_football_66418835_1747742321.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/182A/production/_130668160_shutterstock_editorial_14039947bo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66418835_1747742321.html", "title": "John Mousinho: Portsmouth boss says they have plenty to 'tidy up' after draw with Bristol Rovers", "title_page": "John Mousinho: Portsmouth boss says they have plenty to 'tidy up' after draw with Bristol Rovers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Portsmouth head coach John Mousinho said they \"didn't execute well enough\" in their 1-1 draw with Bristol Rovers.\nPompey scored an injury-time equaliser at Fratton Park to salvage a point on the opening day of the 2023-24 League One season.\n\"We gave the ball away too much,\" Mousinho told BBC Radio Solent after the game.\n\"We need to get a lot more (shots) on target and take advantage in the crossing areas that we get into.\n\"Ironically the goal came from the best cross we had all day.\"\nNew Pompey signing Kusini Yengi from Australia scored the equaliser with a header from Joe Rafferty's cross in the 92nd minute.\nMousinho said he changed the team's shape in the second half after midfielder Tom Lowry picked up an injury and was replaced by forward Christan Saydee.\n\"Tom is ok it's just a bit of swelling around the knee,\" Mousinho added.\n\"In the first half we were getting the ball into the box well but we weren't getting enough bodies in there.\n\"We thought it was important to get someone closer to Colby [Bishop] because we were hitting him with those longer diagonal balls and he was knocking them down, but he didn't have anything around him so we thought a shape change would help.\n\"I think if we had executed the game plan in the first half we would have been just fine, but Tom's injury gave us the opportunity to change that.\n\"Christian was my man of the match and I think the change made a difference.\"", "url": "https://www.bbc.com/sport/football/66418835"}