{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:20", "date_modify": "2025-05-21 05:31:20", "date_publish": "2025-04-02 21:05:30", "description": "Newcastle 2-1 Brentford: '70% cross and 30% shot' - Sandro Tonali reacts to scoring in win", "filename": "sport_football_articles_cpq7dv132dvo_1747805480.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9a8a/live/c60df610-1005-11f0-a851-e1dd6a174ba8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cpq7dv132dvo_1747805480.html", "title": "'70% cross and 30% shot'", "title_page": "Newcastle 2-1 Brentford: '70% cross and 30% shot' - Sandro Tonali reacts to scoring in win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle midfielder Sandro Tonali, speaking to Premier League Productions: \"The start of the second half was tough and Brentford pushed but we are a solid team as well and we had a good reaction.\n\"This win is nice for the Champions League for us, we have a good week and it is perfect for this week.\"\nOn whether he meant his goal: \"Honestly, it was 70% cross and 30% shot. It was difficult for the goalkeeper and difficult also for me. Also a little bit of luck.\"\nOn Alexander Isak scoring again: \"I am happy for him because Alex is a great striker and maybe one of the best in the world now. I think he scores every game. We work for him because when Alex scores, very often we win the game. We are happy. I think Alex now is the best in the world.\"\nOn the season's ambitions: \"Now we play only for the first five teams, for the Champions League. It is a little bit tough but we are lucky because there are five teams in the Champions League this season. The team is a little bit free so it is much better for me and for the fans. Now we have nine finals to get back into the Champions League.\n\"I think I am happy for the trophy for these fans because these fans deserve it. Every game we have 52,000 people in the stadium and this is amazing for football. I am so happy to play every game in this stadium and with these fans it is amazing.\"", "url": "https://www.bbc.com/sport/football/articles/cpq7dv132dvo"}