{"authors": ["Adam Lanigan", "www.facebook.com"], "date_download": "2025-05-20 14:45:35", "date_modify": "2025-05-20 14:45:35", "date_publish": "2023-07-27 18:31:00", "description": "Luke Wells, Josh Bohannon and Phil Salt hit centuries as Lancashire dominate day three against Northants.", "filename": "sport_cricket_66323880_1747752335.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0799/production/_130554910_gettyimages-1487490137.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66323880_1747752335.html", "title": "County Championship: Three Lancashire batters score centuries against Northants", "title_page": "County Championship: Three Lancashire batters score centuries against Northants - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three Lancashire players hit centuries to set their side up for a final day victory push against Northamptonshire.\nLuke Wells struck 119 and Josh Bohannon made 128, before Phil Salt smashed 105 off only 74 balls as Lancashire scored 377 runs in just 67.5 overs.\nAfter rain had washed out the entire morning session, they rattled along at 5.58 runs per over with the visitors unable to stem the flow of runs.\nIt meant that Lancashire ended the day on 498-7, a lead of 156 over Division One's bottom side.\nThe Red Rose county resumed 221 behind almost 23 hours after they had left the field, but they made up for lost time.\nWells and Bohannon were full of intent from the off and opener Wells, who had begun on 65, reached his first century of the season off 171 balls.\nHe had almost been caught on the boundary for 76, before he eventually departed before tea for 119.\nBohannon was at his typically busy best and Lancashire's leading run scorer in red-ball cricket this year reached his second ton of the summer off 143 balls.\nBy this stage he had been joined by Salt who provided the fireworks. The England white-ball player was attacking from the word go and the pair's 100 partnership came off only 98 balls with Salt getting to 50 off only 35.\nAfter Bohannon departed for a season's best score, Salt carried on in the same vein, reaching his century in style with a big six down the ground from his 74th delivery - his third maximum to go with 11 fours.\nHowever, he failed to add another run as he was caught on the mid-wicket boundary going for another big shot, a third wicket for Jack White, Northants' best bowler.\nThere was a flurry of late wickets towards the end as Lancashire lost 3-25 from 458-4, but they finished in a position of complete dominance.\nWith a lead of 156, the big decision for captain Keaton Jennings to make will be whether to bat on or declare straight away and try to take the 10 wickets they need to force a victory.\nAs for Northants, little has gone right from the position of 266-3 with the bat on the opening day. And with Middlesex winning at Warwickshire, their survival prospects suffered a further blow.", "url": "https://www.bbc.com/sport/cricket/66323880"}