{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:03:22", "date_modify": "2025-04-26 08:03:22", "date_publish": "2025-02-26 16:18:09", "description": "Hartpury College rugby union player Joe Cooper receives a nine-match ban after racially abusing an opponent.", "filename": "sport_rugby-union_articles_cvg58ydyl94o_1745654602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0027/live/e645fe10-f45c-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_cvg58ydyl94o_1745654602.html", "title": "Hartpury College's Joe Cooper gets nine-game ban for racial abuse", "title_page": "Hartpury College's Joe Cooper gets nine-game ban for racial abuse - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "A Hartpury College rugby union player has received a nine-match ban from the Rugby Football Union after racially abusing an opponent.\nJoe Cooper, 20, was found guilty by an RFU independent disciplinary panel earlier this month of \"conduct prejudicial to the interests of the union and the game\" after targeting a University of Bristol player.\nAs well as the nine-match ban, with three games suspended, Cooper has also been enrolled in an online course provided by Accelerate Sport called \"Tackling Racism in Sport\".\nThe incident occurred during a British Universities and Colleges Sport match in Bristol on 22 January.\nAn impact statement provided to the panel by the player targeted read: \"When the words were said, I didn't know how to feel. I was in shock as I didn't expect to hear what I heard, especially in a rugby game.\"\nHartpury College said Cooper \"accepted responsibility for his actions and admitted using the abusive language at the match. He apologised wholeheartedly for his conduct which he candidly accepted was utterly inappropriate.\"\nA spokesperson from Hartpury University and Hartpury College added: \"Hartpury University and Hartpury College unequivocally condemn all forms of racism and discrimination.\n\"We have remained in close communication with the University of Bristol throughout the disciplinary process and fully support the actions taken by the RFU, alongside our own internal disciplinary response.\n\"Hartpury continues to reinforce our commitment to inclusivity and respect within our community, ensuring that our values are reflected in all areas of student life.\"\nA University of Bristol spokesperson said: \"We welcome the outcome of the disciplinary panel and would like to thank everyone involved for the robust and prompt way in which this has been dealt with.\n\"We have been supporting the affected student throughout this time.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/cvg58ydyl94o"}