{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:40", "date_modify": "2025-05-21 06:01:40", "date_publish": "2025-04-01 22:06:38", "description": "Wolves 1-0 West Ham: Graham Potter reacts to defeat", "filename": "sport_football_articles_cq5wexg12qxo_1747807300.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65b1/live/abd07600-0f3e-11f0-801a-296f2b6075c3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cq5wexg12qxo_1747807300.html", "title": "Wolves 1-0 West Ham: Graham Potter reacts to defeat", "title_page": "Wolves 1-0 West Ham: Graham Potter reacts to defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Ham boss Graham Potter, speaking to Sky Sports about his side's first-half performance: \"We had a really good chance, a big chance and we didn't take that one and then they got into the game.\n\"We wanted to be more compact and as a result the first half wasn't a good one for us. We had to adjust things at half-time and we did. We were better in the second half, some other chances as well, but in the end not enough to win the game.\n\"It was a game of two halves. If you look at the big chances of the game, probably more for us ironically. From a performance perspective we certainly weren't happy with where we were first half. Second half was a lot better. Tomas' [Soucek] chance at the end was a big chance. We need to be better if we are to do better.\"\nOn Niclas Fullkrug: \"Really good. Can see what he brings to the team. We can go long into him, he picks up second balls, a threat in the box. For the first time he has played 45 minutes for us in a very long time so that's pleasing.\"\nOn motivation for rest of season: \"The motivation is to get up the table further. To win more points, every game is important for us. We want to get as many points as we can. To do that you have to play well, we didn't tonight in the first half. We have suffered for that ultimately.\n\"Some positives but overall we need to be better.\"", "url": "https://www.bbc.com/sport/football/articles/cq5wexg12qxo"}