{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:37:01", "date_modify": "2025-05-20 13:37:01", "date_publish": "2023-08-01 16:36:23", "description": "Scotland will finish no higher than ninth at the Netball World Cup after they are beaten 55-47 by Tonga in Cape Town.", "filename": "sport_scotland_66375406_1747748221.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A5F0/production/_130608424_barrie.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_scotland_66375406_1747748221.html", "title": "Netball World Cup 2023: Tonga beat Scotland 55-47 in Pool F", "title_page": "Netball World Cup 2023: Tonga beat Scotland 55-47 in Pool F - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Scotland will finish no higher than ninth at the Netball World Cup after they were beaten 55-47 by a powerful Tonga side in Cape Town.\nIt was a fourth defeat in a row for Tamsin Greenway's side, who sit second bottom of Pool F.\nThe Scots came within four points of Tonga in the fourth quarter before their late fightback ran out of steam.\nCaptain Claire Maxwell said \"it was just finishing\" that let her side down against more clinical opponents.\nTonga secured a deserved second Pool F win thanks to a 92% finishing accuracy compared to the Scots' 75%.\n\"We are disappointed with the final result,\" Maxwell added. \"We had some good performances in there.\n\"I think we had more attempts than them and had more turnover ball. Unfortunately, we gave them too much ball. We need to park it quickly and move on to the next match.\"\nScotland face bottom side Fiji on Thursday before the competition reaches its final stage where placings will be decided.\nIt is Tonga's first World Cup, but it was Scotland who went into this game as underdogs considering they are three places below their seventh-ranked opponents in the world standings.\nThe damage was done in the opening quarter, with goalshooter Uneeq Palavi and Hulita Veve combining magnificently to set up a 15-10 lead.\nThe introduction of 17-year-old Emma Barrie up top improved the Scots' accuracy as they drew the second quarter 13-13.\nHowever, Tonga re-established dominance in the third to stretch their advantage to 44-35.\nScotland showed great heart to outscore their opponents in the closing stages, but they had left themselves too much to do.\nPalavi, who ended with an impressive 95% shooting accuracy, said they \"just went out and had fun\" but suggested it was \"redemption\" for previous losses.\nMeanwhile, captain Veve admitted Scotland provided \"a great challenge\" in \"a really tough battle\" in which \"we never gave up\". Tonga next face Malawi with the chance of finishing third in the six-team group.", "url": "https://www.bbc.com/sport/scotland/66375406"}