{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:56:54", "date_modify": "2025-05-21 05:56:54", "date_publish": "2025-04-02 00:00:00", "description": "Royal Challengers Bengaluru face Gujarat Titans in the IPL - follow live scores, radio commentary and updates.", "filename": "sport_cricket_live_cdjy4v4e2jet_1747807014.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eeec/live/c82338f0-089b-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cdjy4v4e2jet_1747807014.html", "title": "IPL 2025 LIVE: RCB vs GT", "title_page": "IPL 2025 LIVE: RCB vs GT - cricket score, radio commentary & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Buttler leads Gujarat Titans to victory over RCB\nJos Buttler said he was motivated by \"a few months of pretty unenjoyable cricket\" as his 73 not out to led Gujarat Titans to an eight-wicket victory over Royal Challengers Bengaluru in the Indian Premier League.\nButtler, who gave up the England white-ball captaincy after their Champions Trophy exit, accelerated after a careful start to expertly steer home a chase of 170 with 13 balls to spare.\nBatting at number three, he took only nine from his first 10 balls before a pull for four and two sixes, the first a top-edge over the wicketkeeper, got him going.\nButtler finished with five fours and six sixes in his 39-ball knock as he put on 75 with opener Sai Sudharsan and 63 not out with Sherfane Rutherford.\nIt came after he dropped RCB opener Phil Salt and missed a stumping chance to dismiss another England team-mate in Liam Livingstone, who top-scored with 54 in the hosts 169-8.\nGujarat in control with Buttler at the crease\nRoyal Challengers Bengaluru kept things tight early on but Gujarat Titans are in control of this chase of 170.\nThey are 82-1 after 10 overs with Jos Buttler unbeaten on 27.\nOnly 33 runs came from the first five overs, bowled by Bhuvneshwar Kumar and Josh Hazlewood, with Bhuvneshwar also having Shubman Gill caught at deep point.\nThe Titans were cautious but are starting to open their arms with Buttler hitting a four and two sixes in the ninth over which went for 18.\nHe is batting alongside opener Sai Sudharsan who has batted excellently for 37 not out.\n88 runs are needed from the last 60 balls.\nLivingstone helps RCB set Gujarat Titans 170 to win\nLiam Livingstone has given Royal Challengers Bengaluru a sniff against Gujarat Titans.\nHis 54 from 40 balls has helped RCB post 169-8, despite being 42-4 and 104-6.\nLivingstone was dropped on nine and England team-mate Jos Buttler missed the chance to stump him on 21 but after starting slowly he hit one four and five sixes.\nThree of his sixes came in one over off Afghanistan leg-spinner Rashid Khan.\nAustralian Tim David took 16 from the last over in a 18-ball 31 to boost the score further.\nMohammed Siraj was superb for his 3-19 against the franchise that released him last year.\nRCB look to extend unbeaten start against's Buttler's Titans\nRoyal Challengers Bengaluru will make it three wins from three in this year's Indian Premier League with victory over Gujarat Titans today.\nRCB, one of the tournament's best-known teams, are still yet to win an IPL but some are starting to wonder after their impressive unbeaten start.\nGujarat lost their opening match to Punjab Kings but were much-improved in a comfortable win against Mumbai Indians last time out.\nThey have Jos Buttler in their ranks. RCB have Phil Salt, Liam Livingstone and, of course, Virat Kohli.\nThe Titans have won the toss and have decided to bowl first.", "url": "https://www.bbc.com/sport/cricket/live/cdjy4v4e2jet"}