{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 08:16:44", "date_modify": "2025-04-26 08:16:44", "date_publish": "2025-02-26 10:31:30", "description": "Crystal Palace analysis: Eagles' momentum continues to build for Oliver Glasner", "filename": "sport_football_articles_crlxk584j5eo_1745655404.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0c76/live/6ed300a0-f414-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_crlxk584j5eo_1745655404.html", "title": "Crystal Palace analysis: Eagles' momentum continues to build for Oliver Glasner", "title_page": "Crystal Palace analysis: Eagles' momentum continues to build for Oliver Glasner  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Crystal Palace have turned a corner after a slow start to the season.\nThe Eagles won just one of their first 10 league games but their fortunes are now completely different and they have suffered just three losses in 15 league games.\nThe 4-1 win over Aston Villa felt key, with a number of milestones for players in the Crystal Palace squad.\nMidfielder Adam Wharton started his first league game since October after injury, striker Jean-Philippe Mateta scored again, playmaker Eberechi Eze looked back to his free-flowing self and summer signing Eddie Nketiah scored his first Premier League goal for the club.\nPalace have the chance to reach the FA Cup quarter-finals when they face rivals Millwall on Saturday, and are now chasing a second successive top-half finish.\n\"We all get the reward and the players get the reward for their hard work,\" Glasner said.\n\"We expected it. I mentioned it quite often that the start would be quite bumpy. Pre-season did not go in the perfect way and many players arrived late, but the most important thing is that we stayed together and worked hard.\n\"We can see the progress and development of individual players, of the system and the players know how we have to play and what we have to do.\n\"One thing is theory and the other thing is transform it on to the pitch. That's one thing they have been doing really well in the past few weeks and months.\"", "url": "https://www.bbc.co.uk/sport/football/articles/crlxk584j5eo"}