{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:22:38", "date_modify": "2025-05-21 04:22:38", "date_publish": "2025-02-01 08:41:40", "description": "Swansea City: Club to hold fans' forum after transfer window", "filename": "sport_football_articles_cvg91y59ylvo_1747801358.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/152b/live/76f70780-e024-11ef-a819-277e390a7a08.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvg91y59ylvo_1747801358.html", "title": "Swansea City: Club to hold fans' forum after transfer window", "title_page": "Swansea City: Club to hold fans' forum after transfer window - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chairman Andy Coleman says Swansea City will hold a fans' forum following the conclusion of the winter transfer window.\nThe market closes at 23:00 GMT on Monday, 3 February, with the Swans still eager to bolster their squad.\nLuke Williams' men announced the capture of versatile midfielder Melker Widell shortly after confirming former captain Matt Grimes' move to Championship rivals Coventry City on Friday.\nSweden Under-21 international Widell - who will not join up with Swansea until next season - is the Swans' second signing of the window following Hannes Delcroix from Burnley.\nAddressing the club's transfer dealings so far, Coleman said in his programme notes ahead of Saturday's league fixture with Coventry: \"The departure of Matt Grimes is obviously a significant change given he had been with the club for a decade but, as Luke himself said earlier this week, we can either view these situations as opportunities or threats, and the only approach we can take is to look at it as an opportunity.\n\"We are working around the clock to strengthen our men's first-team squad and make the right decisions for the club.\n\"I am aware that, at the moment, that is a work in progress, but I remain optimistic about the future, and what is going on behind the scenes as we look to make additions before the transfer window closes.\"\nThere has been growing unrest among Swansea supporters given the club's struggles in the transfer window in addition to poor results on the field of late.\nWilliams' side are yet to win in 2025 and have suffered wretched defeats against the likes of Southampton, Cardiff City and Norwich City since the turn of the year.\nThat has led to many fans calling for the club to be held to account and to explain key decisions made since a change of ownership was announced in November.\nColeman added: \"I am also aware of the concerns that have been raised about improving our communication with supporters.\n\"We are committed to improving our connection with you, I believe in being as transparent as we can be with you, and clearly laying out our plans to take the club forward.\n\"We are planning to hold a fans' forum once the transfer window closes to address your concerns and share our vision. Please do join us for that, and we will be able to update you on a number of areas.\"\nSwansea sit 17th in the Championship ahead of Saturday's meeting contest with Frank Lampard's Coventry.", "url": "https://www.bbc.com/sport/football/articles/cvg91y59ylvo"}