{"authors": ["Nicola McCarthy", "www.facebook.com"], "date_download": "2025-04-26 03:55:47", "date_modify": "2025-04-26 03:55:47", "date_publish": "2025-03-04 15:49:15", "description": "Teenage goalkeeper Abbie Smith says signing a two-year deal with WSL giants Manchester City is a \"once in a lifetime opportunity\".", "filename": "sport_football_articles_cj3nrj440rdo_1745639747.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2558/live/b87ee630-f90d-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj3nrj440rdo_1745639747.html", "title": "Abbie Smith: Manchester City deal 'once in a lifetime opportunity' for teenage goalkeeper", "title_page": "Abbie Smith: Manchester City deal 'once in a lifetime opportunity' for teenage goalkeeper - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Signing for one of the best clubs in the world is the stuff of dreams for a 16-year-old footballer\nFor Abbie Smith, that has now become a reality.\nThe teenage goalkeeper, from Lisburn in Northern Ireland, has signed for Women's Super League side Manchester City on a two-year scholarship deal.\nSmith says it is a \"once in a lifetime opportunity\" as she makes the lead from Crusaders in the Women's Premiership to the English giants.\n\"I'm just excited to get started,\" said Smith.\n\"I went over for a trial in March last year and felt I had done pretty well. I was then invited back in April and I trained with the first team, with Khiara (Keating) and Katie Robinson at the time.\n\"I got to eat with them and go to the gym with them at the City Football Academy. It was an amazing opportunity and then I was offered the scholarship.\n\"It's a whole different environment, it's amazing. It's great to see how the women's game is developing. I just hope there are opportunities for other people.\"\nSmith may only be 16 but her journey to Manchester City has been a long time coming.\nShe started playing at a young age with Hillsborough Boys, before going on to play in the women's game.\n\"I've been kicking the ball around the street since I was about three and then about six or seven, I started I playing alongside the boys for a good while and was successful with them,\" she added.\n\"I joined Crusaders three or four years ago. I've been in with the international squads as well and it's just been going from there.\"\nOriginally playing further up the field, the teenager says she was inspired to take up a position in nets by her dad, who used to be a goalkeeper.\n\"It's always been in the family to be a goalkeeper, also being put into nets by the boys in the street when I was younger,\" she recalled.\n\"My dad deserves a wee bit of credit. He has always pushed me on.\"\nSmith will train with the club's Elite Development Squad (under-21s) as she completes her A-Levels, something that was very important to the Victoria College student.\n\"My school has been very supportive and they have always made sure I have a backup in my education and it was important to me that I was able to continue my studies in Manchester,\" she said.\n\"I want to play football all the time, I want to make a career out of it and I really think this will help me push that on.\n\"Professional football has always been my dream and I want to go as far as I can.\"\nJonathan Tuffey, Crusaders' manager in the Women's Premiership and a goalkeeper for the men's team, said Smith was a \"credit to herself and her family\".\n\"She's very dedicated to her craft. The past few years with us, after moving from Hillsborough Boys, she has been phenomenal and she is more than ready now for our first team.\n\"When we were made aware of the interest from Man City, she got our full support. The hard work starts now for her. I know with her work ethic and the people she has around her, she will take it in her stride. The sky is the limit for her.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cj3nrj440rdo"}