{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:51:00", "date_modify": "2025-04-26 06:51:00", "date_publish": "2025-02-28 17:57:40", "description": "Tottenham news: Archie Gray wins young player of the year at London Football Awards", "filename": "sport_football_articles_cge1ndz2nvlo_1745650260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/16fb/live/8c521dd0-f5f1-11ef-bd6e-cd71c2e1454a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cge1ndz2nvlo_1745650260.html", "title": "Tottenham news: Archie Gray wins young player of the year at London Football Awards", "title_page": "Tottenham news: Archie Gray wins young player of the year at London Football Awards - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Teenage sensation Archie Gray spoke to BBC Radio London after winning male young player of the year at the London Football Awards on Thursday night.\n\"It means a lot to me to be recognised by the people and I'm just grateful to win this award,\" he said.\n\"It's been different - a big jump from Leeds in the Championship to the Premier League and the amount of games that we have had this year. It's definitely been a challenge but I'm grateful to the manager for trusting me and putting me in these different positions.\"\nGray is naturally a midfielder but has shone in the unfamiliar role of centre-back.\n\"I don't really care where I play. Whatever position it is on the pitch, I'll always work my hardest. Wherever the manager puts me, he knows best and I believe in him 100% so I will work my hardest on the pitch. I've got a lot to learn and in every game, I can learn something different. I always watch the games back and analyse what I can do better.\n\"It's a credit to the coaches, they have been helping me out and especially the people on the pitch. Ben [Davies], Kevin [Danso], Cuti [Cristian Romero], Micky [van de Ven], they've always talked me through every game and it would have been difficult if I didn't have those people, such leaders who have such good experience in the game and helped me out.\"\nFinally, Gray said moving to London has been an adjustment but he has found his feet in the capital.\n\"I've been enjoying it,\" he added. \"Obviously it's been different to living in Leeds, there is so much going on, such a busy place especially when you go to the centre of London compared to the centre of Leeds. It's been brilliant so far.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cge1ndz2nvlo"}