{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:49:08", "date_modify": "2025-05-21 06:49:08", "date_publish": "2025-02-08 09:43:01", "description": "Soudal-QuickStep pull their development team out of the Tour du Rwanda later this month amid the ongoing conflict in neighbouring DR Congo.", "filename": "sport_cycling_articles_cdry4ydzyp4o_1747810148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8295/live/d8680630-e5fc-11ef-b66f-3348f165cf1e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cycling_articles_cdry4ydzyp4o_1747810148.html", "title": "Tour du Rwanda: Soudal-QuickStep withdraw development team over safety concerns", "title_page": "Tour du Rwanda: Soudal-QuickStep withdraw development team over safety concerns - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Soudal-QuickStep have pulled their development team out of the Tour du Rwanda because of safety concerns amid an ongoing conflict in the neighbouring Democratic Republic of Congo.\nThe M23 rebel group has captured almost all of the eastern Congolese city of Goma, which is the largest city in eastern DR Congo and borders Rwanda.\nThe Tour du Rwanda is scheduled to take place between 23 February and 2 March, with some of its seven stages passing close to DR Congo.\nCompeting teams are scheduled for an overnight stay in Rubavu, which is located just over six miles (10km) from Goma, between stages three and four.\n\"We looked at the situation yesterday. The start and finish in the risk area, where our hotel is also located, did worry us a bit,\" Soudal-QuickStep chief executive Jurgen Fore told Belgian website Sporza., external\n\"In the end, we made the decision not to send 20 people there if there was no absolute guarantee that this could be done safely.\"\nEarlier this week, Tour du Rwanda organisers released a statement, external saying the race would go ahead as planned and \"riders, teams and supporters can be assured of a safe and enjoyable event\".\nRwanda is set to become the first African nation to host the Road World Championships later this year, with the event scheduled to take place in Kigali from 21-28 September.\nKigali is 60 miles as the crow flies from Goma, while the shortest drive between the two cities by road is a 100-mile route through western Rwanda's mountainous terrain.\nCycling's world governing body, the UCI, has said it has no plans to move the competition away from Rwanda.", "url": "https://www.bbc.com/sport/cycling/articles/cdry4ydzyp4o"}