{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:38:10", "date_modify": "2025-05-21 05:38:10", "date_publish": "2025-01-14 12:02:00", "description": "1956 Olympic high jump silver medallist Thelma Hopkins, who won Empire Games gold for Northern Ireland and held the world record, dies aged 88.", "filename": "sport_athletics_articles_c4gxvj91vnxo_1747805890.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bbb8/live/0cf65340-d26e-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c4gxvj91vnxo_1747805890.html", "title": "Thelma Hopkins: Olympic high jump silver medallist and ex-world record holder dies aged 88", "title_page": "Thelma Hopkins: Olympic high jump silver medallist and ex-world record holder dies aged 88 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "1956 Olympic high jump silver medallist Thelma Hopkins, who won Empire Games gold for Northern Ireland and also held the world record, has died at the age of 88.\nHopkins lived in Canada for many years and she passed away in Edmonton on 10 January.\nThe high jumper, who was born in Kingston Upon Hull in 1936 before moving to Northern Ireland, earned her first Northern Ireland senior titles as a 15-year-old in 1951 when won both the high jump and long jump.\nThree years later, she clinched high jump gold and long jump silver when representing Northern Ireland at the then Empire Games in Vancouver.\nLater in the same summer, Hopkins won the high jump title for Great Britain at the European Championships in Bern.\nHopkins broke the high jump world record on 5 May 1956 when leaping 1.74m at the Cherryvale Playing Fields in Belfast and six months later, the then 20-year-old athlete took Olympic Games silver in Melbourne as part of the Great Britain team.\nA true sporting all-rounder, Hopkins played international hockey for Ireland, earning 40 caps, in addition to representing the country in squash.\nHer Ireland hockey team-mates included Maeve Kyle, who also went on to have a hugely successful athletics career.\nThe then 70-year-old athlete returned to the Cherryvale Playing Fields in 2006 for the unveiling of a plaque commemorating her world record achievement.\nHopkins' Northern Ireland long jump record of 6.11m set in 1956 was only finally bettered in 2013.", "url": "https://www.bbc.com/sport/athletics/articles/c4gxvj91vnxo"}