{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:59:45", "date_modify": "2025-05-20 13:59:45", "date_publish": "2023-07-31 08:24:33", "description": "Manchester United agree a 10-year extension to their partnership with kit manufacturer Adidas worth a minimum of £900m.", "filename": "sport_football_66358793_1747749585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/CB97/production/_130591125_gettyimages-1516289071.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66358793_1747749585.html", "title": "Manchester United agree 10-year extension with Adidas worth at least £900m", "title_page": "Manchester United agree 10-year extension with Adidas worth at least £900m - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have agreed a 10-year extension to their partnership with Adidas worth a minimum of £900m.\nUnited's new deal with the German kit manufacturer runs until June 2035, with their previous 10-year deal having been worth £750m.\nIt is thought to be the largest kit deal in Premier League history, based on revenue per season.\nChelsea signed a £900m deal with Nike in 2016 but that covered a 15-year period from 2017.\n\"The relationship between Manchester United and Adidas is one of the most iconic in world sport,\" said United's chief executive Richard Arnold.\n\"With its roots in the 1980s, our partnership has been reinvented over the past decade with some of the most innovative designs and technology in sportswear.\"\nThe two parties' latest partnership began at the start of the 2015-16 season, with Adidas having previously supplied United's kit from 1980-1992.\nAmerican owners, the Glazer family, are still in talks over selling United, who said that the new deal has \"a minimum cash guarantee of £900m, subject to certain adjustments\".\nAccording to United's latest annual report, the original agreement with Adidas links a part of the yearly payments to the club's participation in the Champions League.\nFailure to play in the Champions League for two consecutive seasons would reduce annual payments by 30%.\nThe three-time winners will return to Europe's premier club competition this season having failed to qualify for 2022-23.\nDespite not playing in the Champions League last season, United said last month that the club is heading for record revenues..", "url": "https://www.bbc.com/sport/football/66358793"}