{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:41", "date_modify": "2025-05-20 14:02:41", "date_publish": "2023-07-30 14:31:55", "description": "Sweden's Sarah Sjostrom passes American great Michael Phelps for a new record of 21 individual medals at the World Aquatics Championships.", "filename": "sport_swimming_66353059_1747749761.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/15DD6/production/_130585598_gettyimages-1580561166.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_swimming_66353059_1747749761.html", "title": "World Aquatics Championships 2023: Sarah Sjostrom breaks Michael Phelps' world medals record", "title_page": "World Aquatics Championships 2023: Sarah Sjostrom breaks Michael Phelps' world medals record - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sarah Sjostrom took another of Michael Phelps' swimming records on Sunday as the World Aquatics Championships came to a close.\nThe Swede took a 21st individual world medal to surpass the American by retaining her women's 50m freestyle title after levelling Phelps' tally on Saturday.\nDuring Saturday's racing in Fukuoka, fellow American Katie Ledecky passed Phelps' records for individual world golds and golds in the same event.\nGreat Britain failed to add to their tally of eight swimming medals.\nThey finished the event with two golds, two silvers and four bronze, while Australia topped the medal table with a record-equalling 13 golds.\nSjostrom broke her own world record in Saturday's 50m freestyle semi-finals and was just one hundredth of a second slower on Sunday, winning in 23.62 seconds ahead of Australian Shayna Jack (24.10) and China's Zhang Yufei (24.15).\n\"I'm super-proud that I was able to handle the pressure again,\" she said. \"I've done this many times now but it's a battle with emotions.\"", "url": "https://www.bbc.com/sport/swimming/66353059"}