{"authors": ["Dan George", "www.facebook.com"], "date_download": "2025-05-21 05:11:09", "date_modify": "2025-05-21 05:11:09", "date_publish": "2025-02-06 17:13:07", "description": "Boxing promoter Eddie Hearn has described both Giorgio Visioli and Taylor Bevan as \"world class prospects\".", "filename": "sport_boxing_articles_czj32d4gd2ko_1747804269.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c337/live/d01aa950-e48b-11ef-89a1-3f5b746fc0a2.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_czj32d4gd2ko_1747804269.html", "title": "Eddie Hearn excited by 'world class prospects' Visioli and Bevan", "title_page": "Eddie Hearn excited by 'world class prospects' Visioli and Bevan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boxing promoter Eddie Hearn has described both Giorgio Visioli and Taylor Bevan as \"world-class prospects\".\nSuper-featherweight Visioli and super-middleweight Bevan have both been with Hearn's Matchroom Boxing for less than two years but have already impressed during their time in the spotlight.\n\"They're two fighters where I'd be astonished if they didn't reach world level, they are both world-class prospects,\" Hearn told BBC Sport.\nThe two boxers have links to Hampshire with Visioli from Aldershot and Bevan born and raised in Southampton.\nBevan, who has Welsh parents, boxed for Wales at amateur level and won a Silver medal a the 2022 Commonwealth Games.\nLast week they added to their unbeaten records with impressive wins in London that both resulted in stoppages.\n\"As I get older it's one of the most pleasing parts of my job,\" added Hearn.\n\"Seeing the younger generation come through, headline their own shows and then go on to get that star studded treatment.\"\nLast Friday, Hearn hosted a card called \"NXT GEN\" in London, headlined by George Liddard and also featured the likes of unbeaten young boxers Junaid Bostan and Jimmy Sains.\nFans packed into the Indigo at the O2 Arena to catch a glimpse of potential future champions as they navigate through the early stages of their careers.\nBevan turned professional with Matchroom and made his debut towards the back end of 2024.\nHe has marked his first two outings with two impressive stoppage victories, both coming in the second round of each respective bout.\n\"As a pro so far Taylor's been just exactly what I want to see, slicing through the competition like a knife through butter,\" Hearn added.\n\"He looks the part, he's carved out of stone and every time I see him weigh in I get terribly depressed because I train everyday and don't even look one per cent of Taylor Bevan!\n\"I look at Taylor and think that in five to six more fights we could headline with him in Southampton and do a 'next gen' show there and he'd bang the whole place out.\n\"The plan is to probably get to 7-0 by the end of the year and if he continues to look impressive probably throw in a US debut.\"\nHis next fight has already been announced with an outing set for the end of March in Altrincham against an opponent unnamed as of yet.\nThe 24-year-old delivered a devastating uppercut to Polish fighter Szymon Kajda in his last contest, putting him down twice before the referee called an end to the contest.\nAround 200 supporters were in attendance to cheer Bevan on, loudly in support of their man from the upper tier of the arena.\n\"I'm really enjoying it so far,\" Bevan told BBC Sport.\n\"Southampton and Cardiff both feel like home to me, I had great support for my debut but I've had even more this time, I really appreciate it.\n\"I want to stay active this year and get more rounds under my belt, I'm always in the gym and will always be ready for any opportunity that comes my way.\"\nUnbeaten super-featherweight prospect Visioli impressed in 2024 as he got his first taste of the professional boxing scene.\nHaving never previously knocked anyone out in a very promising amateur career, he then went on to stop each of his first three professional opponents in impressive performances.\nSince then and following his recent victory his record is unbeaten with six wins and five knockouts.\n\"I got my name out there in 2024, especially with getting the knockouts at the start of my career.\" Visioli told BBC Sport.\n\"My social media blew up with about 1.5million views on one of my videos of those ko's, it really helped to kick-start my career.\n\"I go into each fight treating it like a world title fight, you have to do that and treat it like it's important because all it takes is one punch and your career or momentum can be badly affected, it's not what I would want a this stage.\n\"I genuinely do live the life. I believe I can go a long way in the sport if I keep doing what I'm doing.\"\nLast Friday, he defeated Mexican Francisco Javier Lucero, nearly dropping him in the second round before going on to claim victory in the 5th as his opponent's corner threw in the towel to stop the bout.\nVisioli is trained by Londoner Mark Tibbs and has former flyweight world champion Sunny Edwards as part of his management team and often in his corner during fights.\n\"Giorgio has looked very good for a long period of time now, a lot of people are starting to talk about him.\" Hearn said.\n\"I said to Sunny Edwards that I think he should step up to English title level very soon, I don't see anyone around that level giving him any kind of problem.\n\"Giorgio is miles above the level he's fighting at the moment, let's step him up and move him to 10-round fights soon, I'd like to see him in a position to win a British title by the end of 2025.\"", "url": "https://www.bbc.com/sport/boxing/articles/czj32d4gd2ko"}