{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-20 14:49:52", "date_modify": "2025-05-20 14:49:52", "date_publish": "2023-07-27 23:17:02", "description": "Argentina come from two goals down to draw with South Africa and deny them a first Women's World Cup victory.", "filename": "sport_football_66290748_1747752592.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/48E9/production/_130556681_gettyimages-1558547044.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66290748_1747752592.html", "title": "Argentina 2-2 South Africa: Stunning Argentina comeback denies South Africa first Women's World Cup victory", "title_page": "Argentina 2-2 South Africa: Stunning Argentina comeback denies South Africa first Women's World Cup victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Argentina manager German Portanova told his team to \"play with the love that optimises our football\" before they produced a stunning comeback from two goals down to draw with South Africa.\nSouth Africa were on course to pick up a first Women's World Cup victory in a pulsating encounter in Dunedin but in the end they had to settle for their first point after Argentina scored twice within five second-half minutes.\nKnowing defeat would take Argentina to the brink of elimination, they threw everything at Desiree Ellis' side in the second half and were rewarded for their endeavour.\nSubstitute Romina Nunez headed in Argentina's second goal after a superb half-volley from Sophia Braun had stunned South Africa.\n\"I told them to play, have fun, dribble and play their best games. That's why we are here. They are wonderful players,\" said Portanova.\n\"I wanted to see them playing with that love that optimises our football. We were a bit slow in the first half. In the second half we changed and there was a huge feeling. We moved ahead with self-confidence.\n\"The thing I most admire about these players is the constant desire to grow. I'm really emotional about what they achieved.\"\nGlasgow City winger Linda Motlhalo gave South Africa the lead after being teed up by Thembi Kgatlana, who was shown to have stayed onside following a video assistant referee (VAR) review.\nKgatlana should have scored after the break when she sliced Jermaine Seoposenwe's curling cross wide from close range, but the two combined later for South Africa's second goal.\nIt was South Africa's first point at a Women's World Cup but for large parts of the game, they looked set for a historic win before their final Group G match against Italy.\nArgentina face Sweden next, ranked third in the world, but have at least kept their tournament alive.\n\"We knew [today's game] was at a favourable time slot for Argentina TV so it was important for us to promote women's football and see us playing well,\" added Portonova.\n\"They needed to see happiness in our eyes. I believe that at certain times we achieved this. They had self-conviction and were proud of the national shirt they were wearing.\n\"It was full of Argentinians in the stadium too. It is around 4am in Argentina for the Sweden game. Please follow us, wake up early - we will play our best match possible to win these three points.\"\nIt was a frantic and remarkable contest in New Zealand where South Africa's fearlessness and aggressive pressing dominated the first half.\nMotlhalo and Kgatlana had starred, causing problems for Argentina and combining effectively to give South Africa what appeared to be a strong lead.\nArgentina boss Portanova reacted by making several substitutions and it was two of those who linked up for their second goal - Yamila Rodriguez's cross was headed in expertly by Nunez.\nThere had been few chances for Argentina in the opening hour but Paulina Gramaglia's attempted cross clipped the woodwork when it sliced over goalkeeper Kaylin Swart's head at the end of the first half.\nInstead the majority of the chances fell South Africa's way and during lengthy first-half added time, they had a goal ruled out for offside, before Motlhalo struck dangerously wide of the post.\nRacing Louisville forward Kgatlana spurned a few chances before netting South Africa's second goal and that ultimately proved costly when Nunez, who had earlier volleyed it over the bar from close range, headed in Argentina's equaliser.\n\"That's the problem - we don't take our chances. It comes back to haunt us every time,\" said South Africa boss Ellis.\n\"How many chances did we create? How many final third entries did we have that we did not complete? We were in complete control of the game and we just needed to finish it off.\n\"We lost the ball a lot in certain areas. It's criminal. It hurts a lot. We have to take responsibility - it has to be better.\n\"That was a great opportunity to put us a step ahead [in the group] but it is not all lost. We have put ourselves in this position by not taking our chances.\"\nSouth Africa face Italy in their final group match but could be without captain Refiloe Jane - who was taken off on a stretcher.\nJane's replacement Kholosa Biyana picked up another yellow card and is ruled out against Italy with suspension.", "url": "https://www.bbc.com/sport/football/66290748"}