{"authors": ["Tasnim Chowdhury", "www.facebook.com"], "date_download": "2025-04-26 04:14:31", "date_modify": "2025-04-26 04:14:31", "date_publish": "2025-03-04 11:01:04", "description": "All you need to know about the 2025 Formula 1 season, which begins in Australia from 14-16 March.", "filename": "sport_formula1_articles_c1kmkwl0m77o_1745640871.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d541/live/79e1f410-f82e-11ef-a8b4-b37546a32a57.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_formula1_articles_c1kmkwl0m77o_1745640871.html", "title": "F1 2025 season: Schedule, calendar, drivers, teams & how to follow on BBC", "title_page": "F1 2025 season: Schedule, calendar, drivers, teams & how to follow on BBC - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Battles, controversy and drama – Formula 1 is set to return for a new season.\nLewis Hamilton at Ferrari, rookies in the mix and 24 races across the globe - 2025 is gearing up to be an exciting, action-packed year.\nLast season, Max Verstappen held off Lando Norris to win his fourth drivers' title, while McLaren took the constructors championship glory after a 26-year wait.\nThe new campaign kicks off in Melbourne, Australia, from 14-16 March, but before then, here is a guide to get you ready for lights out.\nThere has been a shake-up with the 2025 grid and only two teams, McLaren and Aston Martin, have stuck with their line-up from last year.\nSeven-time world champion Lewis Hamilton's switch to Ferrari is the biggest change going into the new season.\nSix rookies are set to make their full-time debut. Oliver Bearman caught the eye when he stood in for Carlos Sainz at Ferrari and Kevin Magnussen at Haas last season. The 19-year-old Briton joins Haas on a multi-year contract.\nNew Zealand's Liam Lawson, who made 11 F1 appearances in 2023 and 2024, has the daunting task of being team-mate to world champion Verstappen at Red Bull.\nGabriel Bortoleto, the 2024 Formula 2 champion, will drive for Sauber, while runner-up Isack Hadjar joins Red Bull sister team Racing Bulls, which has been renamed from RB.\nMercedes protege Andrea Kimi Antonelli, 18, comes into the team to replace Hamilton.\nAustralian Jack Doohan is in the Alpine seat after being a reserve driver for two years. He made his debut in the final race of last season in Abu Dhabi.\nA full list of the 10 teams and 20 drivers is listed below.\nA long F1 season features 24 races across 21 countries.\nThere are no new locations in 2025. The races are the same as last season, though some have moved in the schedule.\nAustralia returns as the season opener. Melbourne held the spot almost every year from its debut in 1996, though this will be the first time since 2019.\nBahrain and Saudi Arabia move to rounds four and five in April because of the holy month of Ramadan in March. They were the opening races between 2022 and 2024.\nLas Vegas remains a Saturday race with all sessions brought forward by two hours. The grand prix will take place at 20:00 local time (04:00 GMT on the Sunday).\nBarcelona will host the Spanish Grand Prix for the final time before it moves to Madrid in 2026.\nThe fastest lap point has been removed. A bonus point was previously awarded to a driver in the top 10 that set the fastest lap in the main grand prix.\nThere will also be more first practice running for rookie drivers, four in total.\nPreviously, rookies had two opportunities to drive an F1 car in practice sessions.\nTeams will choose which race weekend a rookie can participate in.", "url": "https://www.bbc.co.uk/sport/formula1/articles/c1kmkwl0m77o"}