{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:40", "date_modify": "2025-05-21 07:27:40", "date_publish": "2025-01-22 12:54:04", "description": "Brighton have appointed Rado Vidosic has been as women's and girls' head of coaching.", "filename": "sport_football_articles_cdry53g0ml6o_1747812460.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2a9f/live/6ce317f0-d8bf-11ef-a303-a344a2a81285.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdry53g0ml6o_1747812460.html", "title": "Rado Vidosic: Brighton name new head of women's and girls' coaching", "title_page": "Rado Vidosic: Brighton name new head of women's and girls' coaching - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brighton have appointed Rado Vidosic has been as women's and girls' head of coaching.\nThe 63-year-old - who is women's head coach Dario Vidosic's father - arrives at the club after six years at Melbourne City.\nRado worked as Melbourne City's academy technical director before taking on the role of women's head coach. He then managed the men's team and won the title with them.\nHe has previous managerial experience in Australia with Brisbane Roar, Sydney FC, Melbourne Victory, and Wellington Phoenix.\n\"This is an unbelievable opportunity and one that I'm really looking forward to,\" he said. \"I'm excited to roll up my sleeves and help as much as I can.\n\"I'm so proud of what Dario and the wider coaching team have achieved so far, I'm here to provide guidance and help where I can.\"\nHead coach Dario added, \"We're really excited to welcome Rado to the coaching staff at Brighton.\n\"We've worked together previously at Melbourne City, and clearly he has had a huge influence on my career. I know first-hand the qualities he possesses which can help get the very best out of the players.\n\"He is a talented coach with a great depth of knowledge of the game and I have no doubt he will be incredibly influential in our aspirations to be successful for the remainder of the season and beyond.\"", "url": "https://www.bbc.com/sport/football/articles/cdry53g0ml6o"}