{"authors": ["Katie Wright", "www.facebook.com"], "date_download": "2025-05-20 14:40:54", "date_modify": "2025-05-20 14:40:54", "date_publish": "2023-07-28 09:28:14", "description": "England midfielder Keira Walsh was taken off the pitch on a stretcher in the 38th minute during the World Cup match against Denmark.", "filename": "sport_football_66333876_1747752054.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2C1F/production/_130559211_walsh_2_getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66333876_1747752054.html", "title": "Keira Walsh injury: England World Cup star leaves pitch on stretcher with knee problem", "title_page": "Keira Walsh injury: England World Cup star leaves pitch on stretcher with knee problem - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England midfielder Keira Walsh was taken off the pitch on a stretcher in the 38th minute during the World Cup match against Denmark in Sydney.\nThe Barcelona player, 26, appeared to hurt her knee and looked in distress before signalling to the bench that she could not carry on.\nShe was comforted by team-mates and appeared to mouth: \"I've done my knee.\"\nManager Sarina Wiegman said afterwards: \"Of course I'm concerned because she couldn't walk off the pitch.\"\nShe added: \"But we don't know yet so we can't make any assumptions. Let's wait until we have a diagnosis then I can tell you.\"\nWalsh left the pitch when the Lionesses were leading 1-0 against Denmark in their second Group D match and they went on to win by that scoreline.\nAsked if Walsh will have a scan, Wiegman said: \"Probably. But I haven't heard anything yet. During the game you have to move on and now it is time to look at how she is and the next steps.\"\nLauren James, who scored the only goal in the match, added: \"Obviously it's disappointing to see one of our most valuable players get hurt but we had to just focus on getting the win and focus on what team that was playing at the time.\"", "url": "https://www.bbc.com/sport/football/66333876"}