{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:11", "date_modify": "2025-05-20 12:57:11", "date_publish": "2023-08-02 23:12:15", "description": "Britain's Andy Murray beats Brandon Nakashima in straight sets to reach the last 16 of the Citi Open in Washington.", "filename": "sport_tennis_66390985_1747745831.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/05E8/production/_130621510_b6f058a2c7ec71ab3ff916ca8105970b77b5078d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_tennis_66390985_1747745831.html", "title": "Citi Open: Andy Murray beats Brandon Nakashima in second round", "title_page": "Citi Open: Andy Murray beats Brandon Nakashima in second round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Andy Murray won his first singles match since Wimbledon by beating American Brandon Nakashima 7-6 (7-5) 6-4 in the Citi Open second round.\nThe 36-year-old Briton, who lost to Stefanos Tsitsipas in the second round at Wimbledon last month, received a first-round bye in Washington.\nMurray, 36, will play Taylor Fritz, who beat fellow American Zachary Svajda 6-3 6-3, in the last 16 on Thursday.\n\"I did well. I hit the ball well from the beginning,\" said Scot Murray.\n\"Brandon serves well, especially his second serve. I was struggling to create many opportunities on return.\n\"But I was just a little bit more solid than him at the end of the tie-break. He made a few mistakes; I put enough balls back in play.\n\"The courts and the balls are extremely slow here, so you're having to work really hard in all of the games. It's not easy to finish points. It was a good one to get through.\"\nBritish number two Dan Evans beat France's Gregoire Barrere 2-6 6-0 6-3, but Liam Brady lost 6-4 6-2 against the Netherlands' Tallon Griekspoor.\nEvans, 33, will face Russia's Alexander Shevchenko in the last 16.\nAmerican Chris Eubanks, who reached the quarter-finals on his Wimbledon debut last month, beat Japan's Sho Shimabukuro 6-3 6-4 to set up a meeting with Australian Jordan Thompson.", "url": "https://www.bbc.com/sport/tennis/66390985"}