{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:57:17", "date_modify": "2025-05-20 11:57:17", "date_publish": "2023-08-06 00:00:00", "description": "Reaction as Sweden knock out holders the United States on penalties at the 2023 Women's World Cup.", "filename": "sport_live_football_66183775_1747742237.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183775_1747742237.html", "title": "Sweden vs USA LIVE: Fifa Women's World Cup score, commentary & updates from last-16 game", "title_page": "Sweden vs USA LIVE: Fifa Women's World Cup score, commentary & updates from last-16 game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Over to you, England...\nSo another big moment in this World Cup as the holders crash out in sensational style.\nRead the full match report here - and join us nice and early on Monday morning (UK time) for England's clash with Nigeria.\nSee you there!\n'We showed heart'\nSweden captain Magdalena Eriksson: \"We're so happy right now. I don't know how we managed to stay in this game.\n\"We didn't play our best game, but in some way we showed we're hard-headed, we showed heart, we never give up. We took it to extra time, we took it to penalties and we managed to win.\"\n'Soccer can be cruel'\nUSA coach Vlatko Andonovski: \" I know we were criticised for the way we played ... I think we came out today and were all about the grit, the resilience.\n\"Unfortunately, soccer can be cruel sometimes. For it to go to penalties and to end in that fashion, with the confusion at the end.\"\nget involved\nGet Involved\n#bbcfootball, WhatsApp on 03301231826 or text 81111 (UK only, standard message rates apply)\nMatthew: The World Cup Final is a fortnight away and from the teams remaining only one Japan has lifted the trophy before, and other than them only Netherlands and Sweden have reached the Final. The World Cup is well and truly up for grabs now!\nLumzy: All Spain's to lose now... Or maybe finally an African country will win a senior World Cup.\n'Penalties suck'\nUSA captain Lindsey Horan: \"A lot went into this performance, we were confident and patient and played beautiful football. We created chances, we didn't score and to be frank penalties suck.\n\"I'm proud of every player who stepped up to take one. I'm very proud of my team.\n\"Some of the young players coming through are killing it.\"\n'For the US it's about winning'\nEniola Aluko\nFormer England forward on ITV1\nThe USA are in transition. They have so many young players coming through.\nOf course for the US it's about winning, they have the most funding, the best resources, they demand such high standards, the players demand it.\nBut in this tournament we've seen Germany go out, Canada go out, Brazil go out...\n'It's over the line'\nEniola Aluko\nFormer England forward on ITV1\nIt's pretty clear, it's goalline technology and it's over the line.\nI don't think Sweden deserved it overall but they got through it in the end.\nPost\nAfter winning their first two penalty shoot-outs at the FIFA Women’s World Cup (1999 vs China and 2011 vs Brazil), USA have lost their last two (2011 vs Japan, 2023 vs Sweden). They are the first team to lose multiple shoot-outs at the tournament.\nget involved\nGet Involved\n#bbcfootball, WhatsApp on 03301231826 or text 81111 (UK only, standard message rates apply)\nLuca: What a game. The underdog going into the match pulls away with the win through their tough work and perseverance, truly incredible.\nBrian: This whole tournament has felt very 'end of an era' for the USWNT. Just about a scraped through the groups with 3 ok/poor performances and couldn't kill off a game they dominated today. Trust them to bounce back by the next WC but with a complete overhaul of the first 11.\nget involved\nGet Involved\n#bbcfootball, WhatsApp on 03301231826 or text 81111 (UK only, standard message rates apply)\nEmma: Wow! This world cup just keeps giving and giving and giving!! No penalties tomorrow, please, Lionesses!!\nJack: Have to give it to Lina Hurting, iffy season for Arsenal, not made much of an impact at the World Cup but pops up with the winning penalty which wasn't even the best penalty in the world.\n'A lesson for USA'\nEniola Aluko\nFormer England forward on ITV1\nThe USA were trying to win a threepeat, the standards are so high.\nThis team is in transition. There are a lot of players who have not played at a World Cup before. This is going to be a lesson.", "url": "https://www.bbc.com/sport/live/football/66183775"}