{"authors": ["Elizabeth Hudson", "www.facebook.com"], "date_download": "2025-05-20 12:46:41", "date_modify": "2025-05-20 12:46:41", "date_publish": "2023-08-03 06:53:48", "description": "Jody Cundy says he has had \"a rough year\" as he prepares to defend his Para-cycling track world kilo title in Glasgow.", "filename": "sport_disability-sport_66343425_1747745201.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17A13/production/_130578769_aw7_4566.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_disability-sport_66343425_1747745201.html", "title": "Para-Cycling Track World Championships: Jody Cundy endures 'rough year' before title defence", "title_page": "Para-Cycling Track World Championships: Jody Cundy endures 'rough year' before title defence - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Paralympic cycling titan Jody Cundy is battling mind and body as he prepares to defend a proud record at the World Championships.\nCundy is unbeaten in his C4 1000m time trial event at the Worlds since making his debut in 2006.\nHowever, by his own admission he has been struggling ahead of defending his title on Friday in Glasgow.\n\"I've had a rough year,\" the eight-time Paralympic gold medallist told BBC Sport.\n\"I think it is a culmination of being around for so long and trying to motivate myself all the time.\n\"After [the Paralympics in] Tokyo, I had injury and illness problems which kept me off the bike for six months and in that time I lost all kind of motivation and ability.\n\"We also had to move out of our Manchester training base while refurbishment work was being done and relocate to Derby, so that added to the upheaval.\"\nCundy, who says the thought of having to seek another job \"scares\" him once his cycling career ends, hopes he has experienced his darkest hour in sport.\nThings came to a head for the 44-year-old when he won the C4-5 1000m title at January's National Track Championships in Newport.\nDespite the victory, Cundy apologised on Instagram for his performance, saying he was at his \"lowest\", was \"struggling\" and wanted help \"to find my way back to the old me\".\nHe explains now: \"At that point I had just lost hope with where we were going, but the support I received off the back of the post has been fantastic.\n\"I didn't feel like I had to do the post, but I was embarrassed by how slow and how poor I performed.\n\"It is the most interest I have ever had in a social media post. I have posted about winning Paralympic titles and not had the same reaction.\n\"I heard from friends who I hadn't been in contact with for a long time and also from people who had support networks they could open up to help with the issues I was facing off the bike.\n\"It was great to have all these different people out there who could offer support and help me get back to my best. I can't thank everyone enough.\n\"I am still on the way up, but hopefully these championships will be a nice kick-start to the next phase.\"\nCundy, who had his right foot amputated when he was three, has enjoyed a stellar career on the bike since making the switch from swimming to cycling after the 2004 Athens Paralympics.\nThree of his Paralympic golds came in the swimming pool but Wisbech-born Cundy has not looked back.\nHe won double cycling gold in Beijing, before his London 2012 experience where he had a controversial DNF in the kilo but recovered to win individual pursuit bronze. Cundy then went on to claim individual and team sprint gold in Rio.\nHe came away from Tokyo in 2021 with individual silver in the C4-5 kilo and along with Kadeena Cox and Jaco van Gass retained the team sprint crown, but Cundy accepts the demands of the sport mean time is not on his side.\n\"Getting back for the Worlds has been about believing I can do what I used to do. As I am getting older, I am finding it harder,\" he says.\n\"I am starting to realise I am coming to the end of my career and at some point I am going to have to find something else to do rather than riding around fast on a bike. That scares me as well and not performing feels like it accelerates this process.\n\"The kilo training is about full effort for a minute or so and that hurts. You feel like you have a limited number of times you can hurt yourself that much before you go 'what on earth are you doing?'.\n\"I'm getting to that point where I am starting to question what I am doing. It's like I have a measured amount of digging into the hole, just enough, but let's see if it is enough to make it to Paris.\n\"Paris would be a nice place to bow out at my eighth Games - if I could get on the podium that would be fantastic but first I have to perform in Glasgow and then at the track Worlds in Rio next year.\n\"I will keep trying to be the best I can be, but it's not going to be an easy journey this time.\"", "url": "https://www.bbc.com/sport/disability-sport/66343425"}