{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:44:01", "date_modify": "2025-05-21 06:44:01", "date_publish": "2025-03-30 19:59:17", "description": "Manchester City's \"legendary\" players find their heart after coming from behind to beat Bournemouth 2-1 in the FA Cup, says boss Pep Guardiola.", "filename": "sport_football_articles_c93g5jv5ke8o_1747809841.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7206/live/bacaf630-0d9f-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c93g5jv5ke8o_1747809841.html", "title": "Pep Guardiola: Man City boss says 'legendary' players made 'step up' against Bournemouth", "title_page": "Pep Guardiola: Man City boss says 'legendary' players made 'step up' against Bournemouth - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City's \"legendary\" players found their heart after coming from behind to beat Bournemouth 2-1 in the FA Cup, said boss Pep Guardiola.\nCity trailed 1-0 at the break but goals from Erling Haaland and Omar Marmoush took them into a seventh consecutive FA Cup semi-final.\nIt remains their only chance of winning a domestic trophy this season, with the club sitting fifth in the Premier League.\nCity have won six of the past seven Premier League titles under Guardiola.\nOf the current squad, goalkeeper Ederson, defender John Stones and midfielders Phil Foden, Bernardo Silva and Kevin de Bruyne were at the club for all of those.\n\"There are minimum requirements that we have to show - respect for your mate, you have to make the effort. And today we did it,\" said Guardiola.\n\"I spoke with the team at half-time so we are good. We are in your hands. We conceded just one shot on target.\n\"That means how Bernardo, Kova [Mateo Kovacic], the senior players, the legendary players that give the most incredible things in the club, they make a step up again and made an excellent performance.\"\nGuardiola has only failed to win a trophy in one season since his managerial career began in 2008 - his first season with City in 2016-17.\nThe ex-Barcelona and Bayern Munich boss was asked why the heart had been missing from his team this season.\n\"It was many things, many things. I will write it in my memoirs. A lot. Not just one,\" he said.\n\"And put Pep first on the list. I should have taken decisions I didn't take in the right moment.\"", "url": "https://www.bbc.com/sport/football/articles/c93g5jv5ke8o"}