{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:43:44", "date_modify": "2025-05-20 14:43:44", "date_publish": "2023-07-28 00:00:00", "description": "Watch live coverage and follow text updates as Scotland face Ireland in the Men's T20 World Cup Europe Qualifier in Edinburgh.", "filename": "sport_live_cricket_66150337_1747752224.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66150337_1747752224.html", "title": "Watch: T20 World Cup Qualifier - Reaction as Scotland beat Ireland by eight runs", "title_page": "Watch: T20 World Cup Qualifier - Reaction as Scotland beat Ireland by eight runs - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bye now\nScotland (213-6) beat Ireland (205-9) by eight runs\nScotland have thoroughly enjoyed their time on home soil in the past couple of weeks, and have put the disappointment of their defeat to the Netherlands in Zimbabwe firmly behind them.\nWhile they will not be at the 50-over World Cup in India later this year, they have qualified for the 2024 T20 World Cup, and in beating Ireland today, they ended this event on a real high.\nThat's all from me today - thanks for your company!\nPlayer of the match - Brad Currie\nScotland (213-6) beat Ireland (205-9)\nFor his remarkable figures of 5-13, player of the match could only go to Brad Currie of Scotland. He has been speaking post-match:\n\"I didn't even dream about that last night, but it was superb. I tried to keep it quite simple - lots of slower balls.\n\"I'm not going to forget that clanger at the end - that's the perfectionist in me.\n\"I've got to get on the plane to the World Cup first, but it's a great feeling.\"\nSCOTLAND WIN BY EIGHT RUNS\nScotland 213-6 v Ireland 205-9\nBrad Currie makes his first mistake of the afternoon, dropping a high catch from the final ball, but it matters not - Scotland win a gripping encounter by eight runs, and have won this T20 World Cup qualifier.\nThey won all six of their games in Edinburgh, and were excellent in doing so.\nPost\nIreland 186-8 (target 214)\nBrad Currie is having a superb game so far. Four wickets up top, and he pulls off a brilliant stop on the boundary - palming back a ball that looked destined to go for six.\nAdair isn't put off though. A top-edge clears short fine leg and skips away for four, before he muscles a big six over Main's head.\nHe's batted incredibly well, and there's more to come, you feel.", "url": "https://www.bbc.com/sport/live/cricket/66150337"}