{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:08:23", "date_modify": "2025-05-21 07:08:23", "date_publish": "2025-01-31 06:52:04", "description": "Ireland back row Josh van der Flier says he is excited to face England's \"brilliant\" Curry twins in Saturday's Six Nations game.", "filename": "sport_rugby-union_articles_c627n798yx7o_1747811303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd6f/live/de3322e0-df47-11ef-a966-f7e4eae5fb03.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c627n798yx7o_1747811303.html", "title": "Six Nations 2025: Ireland v England", "title_page": "Six Nations 2025: Ireland v England - Van der Flier on Curry twins - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland back row Josh van der Flier is relishing his chance to face England's \"brilliant\" Curry twins in Saturday's Six Nations game in Dublin.\nSale flankers Tom and Ben Curry have been selected to start together for the first time by England head coach Steve Borthwick.\n\"They're brilliant,\" said Leinster's Van der Flier, who starts at openside flanker for Ireland.\n\"They come up with some big moments but they work very, very hard, they both seem incredibly fit, strong and they bring a lot of energy - good all-round back rows really.\"\nVan der Flier, who made his Ireland debut against England in 2016, added: \"I've played against Tom a good few times and he's world class, and Ben has obviously showed how good he is as well any time he's been able to put his hand up.\"\nWhile Van der Flier won the world player of the year award for his performances in 2022, the 30-year-old says he \"probably\" feels better than ever after seeking longevity tips from evergreen internationals Peter O'Mahony and Cian Healy, who boast a combined 244 caps.\n\"I wouldn't consider myself old by any means, it certainly is something that once you get past the 30 mark you need to be thinking of and they've been really helpful to me.\n\"They've given me a few tips here and there. You have to be more efficient I suppose.\n\"Up until three or four years ago, I'd probably finish training and stay out for ages afterwards and then you'd be stiff and sore the next day.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/c627n798yx7o"}