{"authors": ["David Currie", "www.facebook.com"], "date_download": "2025-05-21 05:25:10", "date_modify": "2025-05-21 05:25:10", "date_publish": "2025-04-03 13:57:42", "description": "McInnes on", "filename": "sport_articles_czjn7l0jx3go_1747805110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/40d7/live/e480c7c0-1092-11f0-83c2-2342c0bf03a1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_czjn7l0jx3go_1747805110.html", "title": "McInnes on", "title_page": "McInnes on  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "McInnes is confident he'll get the desired response from his team after the \"sore\" 5-1 drubbing by St Mirren and insists: \"We're not feeling sorry for ourselves, we're not rolling over, sucking our thumbs and thinking everything's against us.\"\nHe adds: \"I trust the players. I think no matter what people say, these boys care.\"\nThe Killie boss is seeking to get \"more confidence into the players\" and believes beating Motherwell would help do that.\nMcInnes says this is the first year in his time at Killie that expectations maybe haven't been ''reached''. He adds: \"I think you're judged against your record last season, effectively. That's football. And if you're judged against that, then we have come up short this season, but there's still too much to play for.\"\nManagement isn't all \"sunshine and rainbows\" and you have to get through the \"tough times\", but McInnes believes the time to \"really judge and reflect\" is at the end of the season.\nHe has urged supporters to get behind the team on Saturday \"because it's us against everybody else\".\nMcInnes has stressed the need for Killie to stay calm and, while he wanted them to be challenging for Europe again, the now aims is to \"do our jobs well enough to be the best of the bottom six\".\nKyle Vassell, who has been out since January, is back in training but won't be ready for Saturday and will return post-split. Stuart Findlay's return from injury is a boost.", "url": "https://www.bbc.com/sport/articles/czjn7l0jx3go"}