{"authors": ["Mike Richards", "www.facebook.com"], "date_download": "2025-05-21 06:05:23", "date_modify": "2025-05-21 06:05:23", "date_publish": "2024-12-24 15:37:19", "description": "Everton news: Opinion - My moment of the year", "filename": "sport_football_articles_clyx5jrm4kmo_1747807523.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b550/live/69581a40-b629-11ee-beb5-e1400df560f2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clyx5jrm4kmo_1747807523.html", "title": "My moment of the year", "title_page": "Everton news: Opinion - My moment of the year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been 12 months of ups and downs, with anxiety very much the order of the year.\nFrom the ownership issues, battles with the Premier League and, at times, horrendous run of results, finding a real standout moment isn't easy.\nAmid the doom and gloom, two are worth of the accolade - one on the pitch and the other off it.\nIt is not very often you win three games in six days, and even less so when one of those is against your most bitter of rivals.\nWhen Dominic Calvert-Lewin rose highest against Liverpool in April to score our second goal of the Merseyside derby, I'm not sure I've heard noise like it for many a year.\nIt was goosebump inspiring, spine tingling and ground-shakingly loud.\nA moment deserving of remembrance and will forever hold a special place, especially as we reach the dying embers of our final season at Goodison Park.\nThursday of last week has to be my off-field moment of the year.\nGetting the confirmation that the Farhad Moshiri era was over and we were financially secure once again brought about a sense of relief I never thought possible.\nThose who have not lived the past few years that Evertonians have will not truly understand what new ownership means for us.\nOur club was close to the brink. A financial wreck. Our future looked worse than bleak.\nThis new hope we now have is something I feel we all deserve. It is more than earned.\nThanks to The Friedkin Group and the Fourth Grace on the banks of the Mersey, our club has the opportunity to thrive and compete once again.\nLet's hope we don't blow it (again).", "url": "https://www.bbc.com/sport/football/articles/clyx5jrm4kmo"}