{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:07:56", "date_modify": "2025-05-21 07:07:56", "date_publish": "2025-01-13 22:28:31", "description": "Wales head coach Warren Gatland says he expects a change to be made after the Six Nations if his side continue their record losing streak.", "filename": "sport_rugby-union_articles_crlknrl9zkgo_1747811276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a1b/live/a5afc3d0-d1da-11ef-858a-3ffeee956fe5.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_crlknrl9zkgo_1747811276.html", "title": "Warren Gatland expects change if Wales' losing run goes on in Six Nations", "title_page": "Warren Gatland expects change if Wales' losing run goes on in Six Nations - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales head coach Warren Gatland says he expects a change to be made after the Six Nations if his side continue their record losing streak.\nFollowing an independent review, Welsh Rugby Union (WRU) chief executive Abi Tierney said last month that Gatland's position had been \"on the line\" before announcing the New Zealander would remain in charge for the 2025 Six Nations.\nGatland, 61, has presided over the worst run in Wales' 143-year international rugby history, slumping to a record 12 successive Test match defeats since October 2023.\nWhen asked what motivated him to carry on in his role, Gatland replied: \"I've been asking myself the same question.\n\"I had some discussions with the family and spoke about the challenges.\n\"The questions I was asking myself was, was I at that stage where I needed the negativity in my life or do I just hang up my boots and go to the beach and enjoy myself?\"\nWales open their 2025 Six Nations campaign against France in Paris on 31 January and announced their squad on Monday.\nGatland says the January start means a tight turnaround given that the France game will come just two months after Wales' autumn series finished.\n\"The other thing too is I think, potentially by leaving now and walking away, what sort of difference or what change was going to [happen]?\" added Gatland.\n\"How would that affect the change in a relatively short period of preparation for anyone else taking over.\n\"I'm conscious and well aware if things don't improve, then there's likely to be a change from the union.\n\"I've been pretty straight up about it, it's about rising to the challenge, making sure we go out there and perform well.\"\nGatland says he has done some soul searching after Wales' miserable 2024 results.\nHe acknowledged that there was \"no doubt it has been challenging\" because his job is \"all about performance and results\".\n\"There has been a fair amount of criticism which is completely understandable when you are dealing with professional rugby,\" he added.\n\"You question yourself and think about the things you could implement to improve and make a difference.\n\"It's also about trying to strike a balance between not making radical changes and finding some tweaks to improve things.\"\nGatland's second spell in charge of Wales has contrasted to his first 12-year period at the helm, when the national side won three Grand Slams and four Six Nations titles and reached two World Cup semi-finals.\n\"It's also about looking back historically and asking why have we been successful in the past, what I did that made those teams that won trophies in the past so successful,\" he added.\n\"It's about making sure you don't go away from some philosophies that have made you successful with teams.\n\"Sometimes you can lose a little bit of that. You have to trust your own instincts and experience.\"\nGatland added: \"I've thrived on challenges. In the past when people have written us off and haven't expected us to do well and we've done exceptionally well.\n\"I'm proud of the achievements I've had in sport, whether it's my time at Wasps or with Wales or the British and Irish Lions.\n\"In particular in World Cups, where there's been four campaigns where we've done pretty well, in terms of being unlucky not going further than the semi-finals and potentially making finals.\"\nTierney has said there will be another review of Wales' progress after the Six Nations.\nAfter naming his squad for the tournament, Gatland says he has not been given a set of results which must be achieved.\n\"I've never been given targets before in the past, there has never been a number that's been set about 'you've got to win so many games',\" said Gatland.\n\"It's the way it has always been. Everyone is talking about it being challenging, but we definitely need to show an improvement in performance.\"\nDespite all the pressure, Gatland remains publicly upbeat.\nWhen asked on the Scrum V podcast whether he believes Wales can defy the odds and win the tournament, he replied; \"I think so, yes.\n\"That first game is going to be important for us, I know it's going to be a big ask going to Paris, but we've been there before and traditionally we've had some really good success against France in the past.\n\"They're a team if they're not 100% on their game, a little bit off or underdone in terms of their preparation, if we go there and give a good performance, you can frustrate them, they can make mistakes.\"\nGatland added: \"If we can get a win there then we've got a week in Nice for preparation building into the Italy game, we can go to Rome with some confidence.\n\"You win those first couple of games, you can win this competition because that will create a huge amount of momentum, confidence and self-belief.\n\"That's the real thing that I need to try and create over the next couple of weeks.\n\"How do I get rid of the doom and gloom in terms of the outside noise and the negativity of that and create some self-belief and positivity with the squad, that the big challenge.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/crlknrl9zkgo"}