{"authors": ["Henry Brownsey", "www.facebook.com"], "date_download": "2025-05-21 04:43:22", "date_modify": "2025-05-21 04:43:22", "date_publish": "2025-01-23 14:37:38", "description": "Fabian Hurzeler press conference: Brighton vs Everton", "filename": "sport_football_articles_cr538gy3d0mo_1747802602.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0f5a/live/5ccfa4a0-4909-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr538gy3d0mo_1747802602.html", "title": "Fabian Hurzeler press conference: Brighton vs Everton", "title_page": "Fabian Hurzeler press conference: Brighton vs Everton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Brajan Gruda and Jack Hinshelwood should be fit but Hurzeler said Matt O'Riley and Lewis Dunk are not 100% and may not be available.\nThe injury news about Jason Steele was \"one of the worst messages\" Hurzeler has received, and he said the goalkeeper's importance to the club should not be underestimated.\nHowever, the Brighton manager said he trusts Carl Rushworth after cutting the keeper's loan at Hull City short\nOn Julio Enciso who joined Ipswich on loan earlier on Thursday: \"It's always important to take care of the development of players, especially the young players. That's the way Brighton improve young players - you have to give them the right game time, Julio played some games in the last weeks, but in general when all the offensive players are back, there's a lot of competition so we made the decision together.\"\nOn if Evan Ferguson may leave before the deadline: \"Let's see what happens in the end. There's some players still suffering with small issues. He's not fit yet. We have some days until the window is closed and we have to figure out what the situation is, what we need for the rest of the season and what the players want and make the decision together.\"\nOn the possibility of new additions after a reported bid for Derby defender Eiran Cashin was rejected: \"We have a lot of offensive players - in the defensive line we are suffering a little bit. We always manage to find solutions. No matter who we play at the weekend, we will have a strong team on the pitch. In general, I'm happy with the squad.\"\nOn Brighton not winning at home in any of their past four games at Amex Stadium: \"Home should be our castle, but at the moment we are not able to make it. It's our responsibility to make it back to our castle.\"\nHe described the career of Everton counterpart David Moyes as \"impressive\", labelling the Scot \"a role model\".", "url": "https://www.bbc.com/sport/football/articles/cr538gy3d0mo"}