{"authors": ["Nicola Pearson", "www.facebook.com"], "date_download": "2025-05-21 05:01:59", "date_modify": "2025-05-21 05:01:59", "date_publish": "2025-04-04 09:54:58", "description": "Eddie Howe press conference: Leicester vs Newcastle preview", "filename": "sport_football_articles_cr4nrn1pgdeo_1747803719.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr4nrn1pgdeo_1747803719.html", "title": "Eddie Howe press conference: Leicester vs Newcastle preview", "title_page": "Eddie Howe press conference: Leicester vs Newcastle preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Newcastle do not have any \"big injuries\" from Wednesday's win over Brentford, but do have \"some niggles\" to players like Kieran Trippier, Alexander Isak and Joelinton that they will have to \"wait and see\" on.\nHowe also confirmed they are \"monitoring\" Anthony Gordon after a bad knock he picked up with England because he is \"still not pain free\".\nThe Magpies boss is \"really pleased\" Fabian Schar has extended his contract and added: \"[Fans will] remember him as the unique player he is. Not orthodox, like the goal against Liverpool where he had no right to score that. He has moments where you just go 'wow'. His defensive side has definitely improved and, as a defender, you are always judged against that first.\"\nAsked if statistics show it is a myth that Isak is injury prone, Howe responded: \"Look at my record - I was very injury prone. Alex certainly isn't.\" He added: \"He is very professional. He has a physio he uses in conjunction with the football club that will fly in and out. We back that and have a good relationship with that. It is about building relationships and trust so he knows we are doing right work for him and his body too.\"\nOn the role of Sean Longstaff: \"To be ready, to play and to come on. He has already payed his part. We need the whole squad to help. There are nine massive games to come and everyone needs to be ready to play. I'm not sure on his future, but all I can say is, behind the scenes, he has been very, very good. Training really well with the group and I can't speak highly enough of him as a person.\"\nOn facing relegation-threatened Leicester: \"They are not out of it. They will still believe they have chance. They have been very competitive, but results might not show it... They have good players. [Jamie] Vardy is still a massive threat. Ruud [van Nistelrooy] has got them playing good football, so we will have to be on our guard still.\"\nHowe believes they are in a \"better position\" in terms of profit and sustainability rules going into the summer and on the impact European football can have, he added: \"Europe will play a part but I don't know how yet as there is still lots of football to be played. We will be in stronger position, depending which competition we are in. With the current players, we know what we want to achieve and focus is on that at the moment.\"", "url": "https://www.bbc.com/sport/football/articles/cr4nrn1pgdeo"}