{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:41:16", "date_modify": "2025-05-21 07:41:16", "date_publish": "2025-01-13 15:51:11", "description": "Swansea City: Josh Ginnelly return 'huge' - Luke Williams", "filename": "sport_football_articles_ce85996d967o_1747813276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0f4/live/e5e53120-d1c5-11ef-9f8b-6138f0924d77.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce85996d967o_1747813276.html", "title": "Swansea City: Josh Ginnelly return 'huge'", "title_page": "Swansea City: Josh Ginnelly return 'huge' - Luke Williams - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If there was one positive to come out of Swansea City's comprehensive FA Cup defeat at Southampton, it was the return of winger Josh Ginnelly after 16 months out.\nThe 27-year-old's 11-minute cameo off the bench at St Mary's is a \"huge\" boost for player and club, according to head coach Luke Williams, as the Swans search for fresh impetus during the January transfer window.\nGinnelly will feel almost like a new signing, having been out of action since September 2023, when he ruptured an Achilles tendon during a win over Sheffield Wednesday.\nIt has been a long road back for Ginnelly, who joined the Swans from Scottish club Hearts in July 2023 but made only eight appearances before injury struck.\nHe suffered a number of setbacks in his bid to return to action before Williams sent him on at Southampton.\n\"I cannot explain how it felt to be back on the pitch,\" Ginnelly told Swansea's website.\n\"There are times you feel you have lost everything. There are more lows than highs in football, and when you are injured that's multiplied by 10.\n\"You look back at the times when I couldn't even shower, or go for a walk outside. It makes you grateful for the little things.\"\nWilliams will hope Ginnelly's return helps freshen up Swansea's attack, and that the former Burnley player can recapture the promise he showed when he first signed for the club, scoring two goals in those eight games.\n\"It's huge [to see Ginnelly play again],\" said Williams.\n\"At that point [on Sunday] the game was probably out of reach, so it was a really good opportunity to bring Josh on.\n\"He's had such a long journey back to fitness and that was a huge milestone for him. He's done great.\"", "url": "https://www.bbc.com/sport/football/articles/ce85996d967o"}