{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:57:27", "date_modify": "2025-05-21 06:57:27", "date_publish": "2025-03-29 12:58:15", "description": "Stephen O'Hanlon's inclusion is Monaghan's only change for Saturday's Allianz Football League Division Two Final against Roscommon.", "filename": "sport_articles_c1lpl3nnep8o_1747810647.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c537/live/05456c80-0c9d-11f0-ab49-f3f2440ca034.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c1lpl3nnep8o_1747810647.html", "title": "Allianz Football League Division Two Final: Monaghan make one change for Rossies decider", "title_page": "Allianz Football League Division Two Final: Monaghan make one change for Rossies decider - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Monaghan manager Gabriel Bannigan has made just one change from the defeat by Down for Saturday evening's Allianz Football League Division Two Final against Roscommon at Croke Park (19:15 GMT).\nStephen O'Hanlon is drafted into the attack as Kevin Loughran drops out of the defence with Ryan Wylie switching to right half-back.\nOtherwise Monaghan's starting personnel is unchanged from the home loss against Down, which didn't prevent the Farney men from reaching the final as other results went their way.\nRoscommon also make one change from their draw with relegated Westmeath in Mullingar last weekend with Dylan Ruane is named at wing-back and Daire Cregg dropping out of the matchday squad\nRegular captain Brian Stack remains unavailable for the Rossies because of injury.\nWhen the sides meet in the Division Two round-robin stage at Dr Hyde Park last month, Roscommon secured a 0-25 to 2-14 victory.\nMonaghan: R Beggan; R Wylie, K Duffy, D Byrne; R McAnespie, R O'Toole, C McCarthy; J Wilson, M McCarville; S O'Hanlon, M Bannigan, C McNulty; D Garland, A Woods, J McCarron.\nSubs: D Croarkin, J Irwin, G McPhillips, D Hughes, D Ward, G Mohan, B McBennett, A Carey, B McCaul, S Mooney, K O'Connell.\nRoscommon: C Carroll; C Neary, D Murray, N Higgins; S Cunnane, R Fallon, D Ruane; E Nolan, K Doyle; C Lennon, E Smith, C Hand; D Murtagh (capt), D McKeon, C Murtagh.", "url": "https://www.bbc.com/sport/articles/c1lpl3nnep8o"}