{"authors": ["Nick Hart", "www.facebook.com"], "date_download": "2025-04-26 04:23:44", "date_modify": "2025-04-26 04:23:44", "date_publish": "2025-03-03 13:05:34", "description": "Fan writer and podcaster Nick Hart reflects on Millwall's FA Cup exit at Crystal Palace.", "filename": "sport_football_articles_c99n1lr33n5o_1745641424.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3650/live/7de05560-f82f-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c99n1lr33n5o_1745641424.html", "title": "Roberts challenge 'very poor' but 'lacked malice'", "title_page": "Millwall opinion: Liam Roberts challenge 'very poor' but 'lacked malice'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The 19th century politician Thomas Babington Macaulay once claimed that he knew \"no more ridiculous a spectacle than the British public in one of its periodic fits of morality\".\nAnd after Saturday's lunchtime FA Cup game between Millwall and dear neighbours Crystal Palace, I know exactly what old Macca meant.\nMove over Professor Moriarty, Ernst Stavro Blofeld and Darth Vader, there's a new super-villain in town by the name of Lions goalkeeper Liam Roberts, whose fifth-minute attempted clearance led to Palace striker Jean-Philippe Mateta needing hospital treatment.\nA game changing red card for Millwall.\nLet me state for the record that from the angle of the away section, it was very hard to tell much at all about the incident.\nUpon seeing the TV coverage later and despite Liam getting the ball, yes, I thought it was a very poor challenge - crucially one that lacked malice though.\nAs ever the social media and pundit world has lost its collective marbles, as Roberts has been demonised across the weekend and now on into the slow Monday news cycle.\nFor reasons that are beyond me, Palace chairman Steve Parish was interviewed live on the pitch at half-time, claiming that it was the worst tackle he'd ever seen - and every talk show or social media pundit has gleefully joined the pile-on.\nJust to repeat, the challenge was poor and very regrettable, but as Lions manager Alex Neil said post-match, the kind of accidental impact that sometimes happens on the field.\nAs for the football, I always thought that this would be a tough away game for us.\nI thought Palace attacked us well in the first half and we struggled to contain their side, which looked decent going forwards.\nI, for one, wish Mateta well in his recovery.", "url": "https://www.bbc.co.uk/sport/football/articles/c99n1lr33n5o"}