{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:08", "date_modify": "2025-05-21 07:42:08", "date_publish": "2025-03-28 10:51:15", "description": "Boss Dario Vidosic said \"it is a nice reflection of the programme\" to have three Brighton players called-up to the senior England squad for the first time.", "filename": "sport_football_articles_cd7e7ez8q14o_1747813328.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2a2/live/6cd5fe90-0bc2-11f0-9ca8-c5035ea95420.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cd7e7ez8q14o_1747813328.html", "title": "Dario Vidosic press conference: Three Brighton England call-ups 'a nice reflection of the programme'", "title_page": "Dario Vidosic press conference: Three Brighton England call-ups 'a nice reflection of the programme' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boss Dario Vidosic said \"it is a nice reflection of the programme\" to have three Brighton players called-up to the senior England squad for the first time.\nMidfielder Maisie Symonds received her first senior call-up for the upcoming games against Belgium, Fran Kirby returned to the squad and Nikita Parris was also called-up.\n\"It is a nice reflection of the program to have three current Lionesses and many other nationalities coming from the club,\" he said. \"It's more credit to the girls for the hard work they put in and its deserved.\n\"I got the call from Sarina to let me know and when she mentioned Maisie as well you're even more excited because it's a maiden call-up.\n\"We're all very happy for her. She said she has been very emotional and crying. It shows what it means and I know what it means when you get that phone call. That first one is one you never forget. I know the meaning and the weight it carries when you get to represent your country.\"\nHere are more lines from Vidosic before Sunday's game against Manchester City (14:00 BST):", "url": "https://www.bbc.com/sport/football/articles/cd7e7ez8q14o"}