{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:43:56", "date_modify": "2025-05-21 04:43:56", "date_publish": "2025-04-03 06:52:33", "description": "Former Australia rugby player Jordan Petaia signs with the Los Angeles Chargers as part of the NFL's International Player Pathway.", "filename": "sport_american-football_articles_cj9en8vl0jyo_1747802636.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/650f/live/b9791470-1055-11f0-83e0-7f1080be50ed.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_american-football_articles_cj9en8vl0jyo_1747802636.html", "title": "Former Australia rugby player Jordan Petaia signs with NFL's Los Angeles Chargers", "title_page": "Former Australia rugby player Jordan Petaia signs with NFL's  Los Angeles Chargers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Australia rugby player Jordan Petaia has signed with NFL team the Los Angeles Chargers.\nPetaia, 25, played in 31 Tests and at two Rugby World Cups for the Wallabies.\nHe has joined the Chargers as part of the NFL's International Player Pathway (IPP) after training for 10 weeks at the IMG Academy in Florida.\nPetaia turned his attention to American football after ending his rugby career in December after six years playing for the Queensland Reds in Super Rugby.\nThe Chargers said he would now work with tight ends coach and run game co-ordinator Andy Bischoff alongside the team's other tight ends.\nPetaia, who became Australia's youngest player at a World Cup when he made his debut aged 19 against Uruguay in Japan in 2019, has said playing in the NFL was a dream he shared with his father, who died in 2020.\n\"He'd be looking down and shouting at me to take the opportunity. I think I probably would have regretted it if I didn't,\" Petaia said last year.\nThe NFL's IPP programme launched in 2017 and is designed to offer elite athletes with experience in other sports the opportunity to earn a place on an NFL roster.", "url": "https://www.bbc.com/sport/american-football/articles/cj9en8vl0jyo"}