{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:33:30", "date_modify": "2025-05-20 14:33:30", "date_publish": "2023-07-28 19:13:58", "description": "Stoke City take their summer signings to 10 by bringing in Aston Villa's Wesley and fellow striker Ryan Mmaee from Ferencvaros.", "filename": "sport_football_66343568_1747751610.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1579/production/_130579450_wes.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66343568_1747751610.html", "title": "Stoke City sign Brazilian striker Wesley from Aston Villa", "title_page": "Stoke City sign Brazilian striker Wesley from Aston Villa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Stoke City have signed two strikers in one day, by bringing in Wesley from Premier League club Aston Villa, as well as Ryan Mmaee from Ferencvaros.\nThe arrival of Moroccan Mmaee, 25, for an undisclosed fee on a three-year deal takes Stoke's summer signings to 10.\nWesley, 26, was Villa's record £22m signing when bought by Dean Smith from Belgian side Club Brugge after promotion to the top flight in 2019.\nBut he suffered a knee injury in his first season and spent 15 months out.\nThe Brazilian did figure briefly for Villa at the end of the 2020-21 season, but twice was loaned out in the 2021-22 campaign.\nHe returned to Club Brugge for three months, before following that with a move back to Brazil to join Internacional.\nHe then spent last season on loan with Spanish side Levante in La Liga II.\nWesley and Mmaee, who have been signed just eight days before the start of the new season, follows the arrival of defender Enda Stevens, Bournemouth midfielder Ben Pearson and keeper Mark Travers, Coventry defender Michael Rose, Preston midfielder Daniel Johnson, Portuguese striker André Vidigal, and Wolves duo Ki-Jana Hoever and Chiquinho.\nStoke, 16th in last season's Championship, start the 2023-24 campaign with a home game against Rotherham United.", "url": "https://www.bbc.com/sport/football/66343568"}