{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:02:38", "date_modify": "2025-05-21 08:02:38", "date_publish": "2025-03-27 15:48:42", "description": "BBC Sport football expert Chris Sutton takes on DJ and Aston Villa fan Nathan Dawe with his predictions for the four FA Cup quarter-final ties.", "filename": "sport_football_articles_c89y4lwyq88o_1747814558.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c5fc/live/f53ae460-0a34-11f0-94d4-6f954f5dcfa3.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c89y4lwyq88o_1747814558.html", "title": "Sutton's FA Cup quarter-final predictions", "title_page": "Sutton's FA Cup quarter-final predictions v DJ Nathan Dawe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We are down to the last eight teams in this season's FA Cup, but which of them will lift the famous old trophy at Wembley in May?\nApart from defending Premier League champions Manchester City, none of the quarter-finalists have won any major silverware since the turn of the millennium, and four of them have never won the FA Cup at all.\n\"We all saw how much winning the Carabao Cup meant to Newcastle fans after their long wait for a trophy,\" said BBC Sport football expert Chris Sutton.\n\"Liverpool and Arsenal are out, and City are clearly not the force they were, so this feels like a big chance for the other teams left in it to get some glory - I just hope they try to take it.\"\nSutton has made his predictions for all four sixth-round ties and for this weekend's matches he is up against Brit-nominated DJ and producer Nathan Dawe, who is an Aston Villa fan.\nDawe's new single featuring vocalist Abi Flynn, Here In Your Arms, is out now.\nDo you agree with their predictions? You can choose who you think will win each tie, below.\nVilla have not won a major trophy since the 1996 League Cup but are chasing silverware on two fronts this season and are into the last eight of the Champions League [where they play Paris St-Germain] as well as the FA Cup.\n\"I'm still in dreamland,\" Nathan told BBC Sport. \"I still can't believe I am going to Paris in a couple of weeks to watch us in a Champions League quarter-final.\n\"Honestly, it has not sunk in. I only ever used to hear about these glory days from my dad, but now we are actually able to experience it together. It's just unbelievable.\n\"What Unai Emery has done since taking charge in 2022 is just astronomical, and the players and fans are fully on board with what he is doing.\n\"Even when things are not going so well, it is clear that the team still has full confidence in the manager to have a Plan B or C to turn games around, and we have seen that happen on multiple occasions this season.\"\nVilla are also going for another top-five finish in the Premier League too, which would be likely to bring them Champions League football again next season.\n\"If I'm being honest, I am not sure how confident I am about that, because I think all of the club's attention is going to be on the Champions League and the FA Cup,\" Nathan added.\n\"Winning the FA Cup would be massive, even if the financial rewards are nothing compared to being in the Champions League. It means so much to Villa fans because hardly any of us are alive who have seen us win it.\n\"Even my dad wasn't born the last time we won it [in 1957] and winning at Wembley would be very special.\n\"I've been lucky enough to go there a few times with Villa but other than our play-off win when we got promoted in 2019, it has always ended up in misery.\"\nChris Sutton and Nathan Dawe were speaking to BBC Sport's Chris Bevan.\nThe Eagles are a well-balanced team who seem to be improving all the time under Oliver Glasner - they have lost only two of their past 14 games in all competitions.\nI've found Fulham hard to predict this season because they've been less reliable than usual at home, but they are still having a strong campaign - they are in the mix for the Champions League places, and are only three points behind fifth-placed City.\nPalace are very strong on the road but they have not played for the past three weeks - their game against Newcastle before the international break was postponed because of the Carabao Cup final.\nWe often talk about teams needing a rest, but my concern is how that break has affected their momentum.\nThis is going to be a close game, but I actually fancy Fulham to edge it. Marco Silva's side have got goals in them, and my gut feeling is that they will get through in 90 minutes.\nI just hope both managers go for it properly, and don't prioritise next week's midweek Premier League games [Fulham are at Arsenal on Tuesday and Palace travel to Southampton on Wednesday] instead of this tie.\nFulham and Palace have shown this season they have got enough quality in their strongest starting XIs to go all the way in the FA Cup, especially this year when the competition appears so open.\nThey are both in a great position to finally win a major trophy, so why not try to make history and give their fans something to celebrate?\nPalace's only previous cup success was winning the Zenith Data Systems Cup in 1991.\nI can imagine their fans enjoyed that day a lot, but lifting the FA Cup would be on a different planet, and the same goes for Fulham, who have not even been in an FA Cup semi-final since 2002.\nSutton's prediction: 2-1\nNathan's prediction: It feels like Palace always turn into world-beaters in the last couple of months of the season, and I can see them winning this. 1-2\n7th in Premier League v 3rd in Premier League\nGap = 4\nLast major trophy? Brighton: Never. Forest: 1990 League Cup\nBest FA Cup run? Brighton: runners-up in 1983. Forest: winners in 1898 & 1959\nWatch live on BBC One, BBC iPlayer and the BBC Sport website. Live commentary on BBC Radio 5 Live and BBC Sounds.\nBrighton will see this as the chance to get revenge for their 7-0 defeat at the City Ground at the start of February.\nI am sure some people felt the wheels had come off for Seagulls boss Fabian Hurzeler after that result, but instead his side have bounced back and gone on a great run of six wins and one draw in all competitions.\nSometimes getting thrashed like that can have a positive effect on a team, and clear the air.\nI remember losing 7-1 at Blackburn Rovers in October 1992, when I was a centre-half for Norwich City, but we had a crate of beer on the coach home to put things right and we were still top of the Premier League table at Christmas. I did get moved up front after that though.\nAs for Nottingham Forest, they are the only team left in the FA Cup where I could understand it if they rested players this weekend, because of their league position.\nThey play Manchester United on Tuesday and the finish line is in sight for my boyhood team to finish third and secure Champions League football.\nThat's why it's disappointing to hear about Chris Wood getting injured while playing for New Zealand this week.\nHopefully it is not serious, but it is a blow for Forest if they are without their main number nine for any length of time.\nTheir game plan won't change without Wood - they will sit deep and attack on the break, it is just a question on whether it is their A team who face Brighton or not, and my hunch is that Nuno Espirito Santo will make a few changes.\nSutton's prediction: 2-0\nNathan's prediction: Forest are in such a good position in the league, I have a feeling they are going to be super-focused on that. For that reason, I am going with Brighton. 2-0\nPreston 0-3 Aston Villa\nDeepdale, 13:30 BST\n14th in Championship v 9th in Premier League\nGap = 25\nLast major trophy? Preston: 1938 FA Cup. Villa: 1996 League Cup\nBest FA Cup run? Preston: winners 1889 & 1938. Villa: winners x7 between 1887 & 1957\nWatch live on BBC One, BBC iPlayer and the BBC Sport website. Live commentary on BBC Radio 5 Live and BBC Sounds.\nPreston are hard to beat at home and have not lost at Deepdale since 2 November, a run of 15 games.\nI've seen quite a bit of Paul Heckingbottom's team this season and they will defend deep, set up in a 3-5-2 shape and make themselves hard to break down.\nIt's an old football cliche, but in this case it is very true that the first goal will be extremely important.\nAston Villa have got some brilliant attacking players, but I also always feel like teams can score against them.\nIf they go behind, they could have problems but I do feel their quality should see them through - depending on Unai Emery's team selection of course, with a big league game coming up at Brighton on Wednesday.\nVilla have got their eyes on numerous prizes and there probably hasn't been excitement levels like this at the club since Martin O'Neill signed me in 2006.\nI'm still backing them here, but it is going to be a cagey game, and they might have to wait to make the breakthrough before a couple of late goals get the job done.\nI'm going for Emi Martinez to keep a clean sheet, too. His keepie-uppie antics, external to wind up Brazil while playing for Argentina this week were another reminder of why he is the best goalkeeper in the world. Anyone who can produce moments like that in a game of that magnitude deserves all the accolades you can get.\nSutton's prediction: 0-2\nNathan's prediction: The FA Cup has opened up for us this season, and it feels like we are the favourites now. I just really hope our schedule doesn't take too much toll on the players and we fall short because of that, but I am looking forward to the rest of the season for sure.\nBrighton will be tough on Wednesday so what do we prioritise, even with a quality squad like ours? That part is down to Emery, and he will probably rest a couple of first-choice players on Sunday, but I would love us to go to Preston, put out a strong team and win comfortably. I am not super-convinced that is going to happen anyway though, even if we don't make lots of changes, because Preston will throw everything at us.\nIt won't be as easy as people might think, but I do expect us to go through. 0-1\nBournemouth 1-2 Man City\nVitality Stadium, 16:30 BST\n10th in Premier League v 5th in Premier League\nGap = 5\nLast major trophy? Bournemouth: never. City: 2024 Premier League\nBest FA Cup run? Bournemouth: quarter-finals 1957 & 2021. City: winners x7 between 1904 & 2023\nThis is such a difficult tie to call.\nBournemouth were the team who started the rot for Manchester City when they deservedly beat them in November, for what was the defending champions' first league defeat of the season.\nBack then, they were still 'mighty City', the team who were dominating English football, who hardly ever slipped up.\nWho would have imagined that, five months on, they would have lost eight of their next 19 league games and be in the position they are now, with just the FA Cup left as the only thing they can win?\nThis competition is huge for City now, because it feels so crucial for boss Pep Guardiola to finish such a difficult season with a piece of silverware.\nSo, it helps him that the Cherries are not in great form, with only one point from their past four league games, and also that they are without two key defenders here; Milos Kerkez and Dean Huijsen, who are both suspended.\nCity are still far from convincing at the moment, however, and it is hard to know what their strongest line-up is.\nPhil Foden's struggles for England last week were a reminder of how last season's PFA and FWA Player of the Year has been a shadow of his usual self all campaign, but he is not the only City player to have been well below his best.\nStill, there is no chance of Pep saving anyone for Wednesday's league game against Leicester, even though City have got a real fight on their hands to finish in the top five.\nPep always takes the FA Cup seriously anyway, and he has shown that by reaching the semi-finals for each of the past six seasons - something no other team had done before.\nWill City make it to the last four again? Yes... but only just.\nBournemouth are so good with their press that they won't allow City to easily play out from the back - there are going to be plenty of goals, and I can see it being settled in extra-time.\nSutton's prediction: 2-3 after extra-time\nNathan's prediction: Bournemouth are having a good season but I am still backing City to get through. 1-3\nThere were eight Premier League games played in week 29, the last set of fixtures before the international break.\nSo far, Chris and his guest, Divorce singer Felix, have both got four correct results, with one exact score, giving them both 70 points.\nFor now, it goes down as a win for the BBC readers - using the most popular scoreline from your predictions for each game, you got five correct results, with one exact score, leaving you on 80 points.\nThe remaining two games were rearranged because of the Carabao Cup final.\nNo-one picked up any points from Liverpool's draw with Aston Villa, which was moved forward to 19 February, so the weekly winner will be decided when Newcastle host Crystal Palace on 16 April - Felix has gone for a 2-1 Palace win.\nChris and Felix also made a prediction for the Carabao Cup final, and they both wrongly picked Liverpool to win it.\nThey were not alone, because the majority BBC readers also went for a Reds victory - out of almost 38,000 predictions, 73% of you thought Arne Slot's side would prevail.", "url": "https://www.bbc.com/sport/football/articles/c89y4lwyq88o"}