{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:35:24", "date_modify": "2025-05-21 05:35:24", "date_publish": "2025-01-14 16:00:06", "description": "The former chief executive of Premiership Women's Rugby, Belinda Moore, has been tasked with helping to transform the game in Wales.", "filename": "sport_rugby-union_articles_cwypg3j0pwno_1747805724.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d11b/live/96a9ca40-d26e-11ef-8926-89a9332957ee.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cwypg3j0pwno_1747805724.html", "title": "Moore appointed head of women's rugby in Wales", "title_page": "Belinda Moore appointed head of women's rugby in Wales - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The former chief executive of Premiership Women's Rugby (PWR), Belinda Moore, has been tasked with helping to transform the game in Wales.\nMoore has been appointed the Welsh Rugby Union's (WRU) head of women's rugby, a high profile new post.\nShe will take on the role initially on a nine-month interim basis before helping to appoint a permanent successor.\nMoore will work closely with Wales women's new head coach, who is due to be announced in coming days after Ioan Cunningham's departure.\nHer other responsibilities include improving the pathway into professional rugby, player contracts and preparing for the Rugby World Cup which kicks off in August.\n\"This is a hugely exciting time to be joining Welsh rugby and for the women and girls' game in particular,\" said Moore.\n\"The senior game in Wales has been professional for just three short years and is progressing and advancing at an exponential rate.\n\"These swift advancements of course come with their own teething problems and my eyes are wide open in terms of the challenge ahead, but I am hugely optimistic about what can be achieved.\"\nMoore says she hopes to make a significant impact during her nine months in charge.\n\"I'd love to leave the game in a much more settled place than it is now with a real clear direction and strategy for how we move forward,\" she said.\n\"And players that are happy and excited to be back playing for their national team, and those pathways where young girls and women in this country can see their opportunity to play for the national team as they progress through the rugby pathways.\"\nMoore, the wife of former England hooker Brian Moore, is a significant appointment to the WRU high performance team.\nShe oversaw the transition from the English women's domestic league being owned by the Rugby Football Union to becoming an independent company.\nShe also secured the PWR's current broadcast deal with TNT Sports.\nHer resignation came as a surprise and she has her work cut out in her new role given the turbulent year Wales women had on and off the pitch in 2024.\nWales finished bottom of the Women's Six Nations and only managed one win against Japan in WXV2.\nThis was played out amid a bitter dispute between the WRU and players over professional contracts which led to an independent review and an apology to the players.\nMoore's appointment is one of the key recommendations in the review.", "url": "https://www.bbc.com/sport/rugby-union/articles/cwypg3j0pwno"}