{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:58:07", "date_modify": "2025-05-21 03:58:07", "date_publish": "2025-04-07 08:42:18", "description": "Aston Villa 2-1 Nottingham Forest: Fan views on Premier League game", "filename": "sport_football_articles_c8epd5838yko_1747799887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8epd5838yko_1747799887.html", "title": "Aston Villa 2-1 Nottingham Forest: Fan views on Premier League game", "title_page": "Aston Villa 2-1 Nottingham Forest: Fan views on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your thoughts after Saturday's Premier League game between Aston Villa and Nottingham Forest.\nHere are some of your comments:\nVilla fans\nIan: Talk about a game of two halves! In control in the first half, but should have kept on the front foot and got the third goal to kill game off. But fair play to a very good Forest team, who could have won it in the second half. Eight changes from our last game shows our strength in depth and highlights how far we have come under Unai Emery. We have kept the dream alive, with a massive game at PSG in the week ahead. Keep the faith.\nJay: Difference between the two teams was Forest had no finisher and their bench was lacking in players to change the game. Emery's substitution of Garcia actually gave them more attacking space as Axel Disasi sat back. A worthy win. Despite the number of wild shots they had in the second half, we had better quality chances to finish it, which weren't needed in the end.\nMark: Make eight changes against third in the league and come away with three points... Unai is a genius.\nEmma: What momentum we have! Also, having a full squad and being able to rotate is really helping. Unai Emery is one of the best managers. Now go and do us supporters proud against PSG.\nForest fans\nMichael: As Jimmy Greaves would say, it was a game of two halves. Forest set up in the first half to accommodate some injuries, but it turned out to be all wrong and Villa ruthlessly exposed that inside two minutes. The second half was exactly what you would expect from Forest and they played so much better. Too bad both strikers were out injured.\nGary: Disappointed not to take something from the game as the overall performance was good. A terrible start caused by defence changes, which ultimately cost us at least a point. I'm still positive for the remaining games and we should able to pick up enough points to qualify for Europe.\nKeith: Shambolic defending yet again. We are lacking a leader. Also there are now more question marks around the goalkeeper.", "url": "https://www.bbc.com/sport/football/articles/c8epd5838yko"}