{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:37:19", "date_modify": "2025-04-26 03:37:19", "date_publish": "2025-03-08 00:00:00", "description": "Swansea City's unbeaten run under caretaker boss Alan Sheehan continues as Eom Ji-Sung's fine goal deals a blow to Middlesbrough's Championship play-offs hopes.", "filename": "sport_football_live_c0q1gqq2351t_1745638639.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_c0q1gqq2351t_1745638639.html", "title": "Swansea City 1-0 Middlesbrough: Eom Ji-Sung goal dents Boro play-off hopes", "title_page": "Swansea City 1-0 Middlesbrough: Eom Ji-Sung goal dents Boro play-off hopes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Swansea City's unbeaten run under caretaker boss Alan Sheehan continued as Eom Ji-Sung's fine goal dealt a blow to Middlesbrough's Championship play-offs hopes.\nSouth Korea winger Eom produced a classy run and finish from outside the penalty area.\nEom's first Swansea goal - in his 30th appearance for the club – was the least Sheehan's team deserved for their impressive first-half display.\nTommy Conway came closest to responding for a disappointing Middlesbrough when his shot was saved by Lawrence Vigouroux.\nSwansea's victory means Sheehan has an impressive return of seven points from three games - and no goals conceded - having taken charge following the departure of Luke Williams last month.\nThe latest success further eases Swansea's relegation concerns, with the Welsh side now 12 points clear of the bottom three in 15th.\nBut it was a dispiriting afternoon for Middlesbrough, who are five points adrift of the top six having lost for the seventh time in their past 10 league matches.\nSwansea had dominated Blackburn in Sheehan's first home game in charge, and they did exactly the same thing to Middlesbrough in an opening period which was so one-sided that the hosts found themselves disappointed not be more than one goal up at the break.\nSwansea were by far the sharper side – and were given freedom to play by a lacklustre Middlesbrough.\nMark Travers was in the right place to save Eom's early header and a Zan Vipotnik drive, but the Boro keeper was left grasping at thin air when Eom produced a memorable first goal in English football.\nReferee Reubyn Ricardo might have blown up for a high boot as Harry Darling won a header on halfway, but he waved play on as Eom burst forward before guiding the ball just inside the post from 22 yards.\nSwansea kept coming, with Vipotnik's fierce effort forcing Travers' best save yet before the Slovenian's overhead kick deflected wide off Dael Fry.\nSwansea caretaker boss Alan Sheehan:\n\"Middlesbrough are a team with a lot of quality. A lot of investment has gone into that team and a lot of big money has been spent on these individuals and obviously the manager has done a good job.\n\"You can understand why the preparation for these games has got to be right on point because in these games if you're not perfect, you can lose two or three. So I think it's important to be very, very proud of the players today.\n\"We wanted to compress the space and be aggressive in the right areas because if you are passive against this team, you will get hurt.\n\"What these players are doing right now, I think we've got to be very, very proud of them because they're leaving everything out there on the football pitch.\"\nMiddlesbrough head coach Michael Carrick:\n\"We didn't deserve anything out of the game. I don't think we played well – pretty simple.\n\"We didn't start the game well enough to give ourselves a chance of being in the game enough.\n\"It wasn't a fantastic game but they did more – they were a bit sharper and a bit more aggressive.\n\"We just didn't get up to speed with the game. It's something that we have got to look at because that's not really happened. We have got to make it a one-off.\"", "url": "https://www.bbc.co.uk/sport/football/live/c0q1gqq2351t"}