{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:04:39", "date_modify": "2025-05-21 05:04:39", "date_publish": "2025-01-23 11:50:10", "description": "Bristol Rovers are only playing at 30-40% of what they can do says manager Inigo Calderon as he explains why his side can still improve.", "filename": "sport_football_articles_ckgxq7k28n0o_1747803879.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e74/live/0825d050-d97d-11ef-a7bb-3fe4cd8ea938.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgxq7k28n0o_1747803879.html", "title": "Inigo Calderon: Bristol Rovers only at 40% of potential, says boss", "title_page": "Inigo Calderon: Bristol Rovers only at 40% of potential, says boss - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bristol Rovers are only playing at 30-40% of what they are capable of says boss Inigo Calderon, who believes there is still much improvement to come from his side.\nThe Spaniard was appointed on Boxing Day and saw his side record back-to-back wins in the league last Saturday for the first time during his tenure.\nThe 3-1 win at home to Barnsley followed a 1-0 win away to Cambridge on 4 January.\n\"In the [training] sessions we are maybe 50% and in the games I will say it is still 30%, 40% maximum,\" Calderon told BBC Radio Bristol.\n\"I knew there was a process, I didn't know the time for that, but in the meantime if we can get points that's even better because I cannot talk about the process and the time and not win at all.\n\"We have to find a way to win games; at the moment we are finding a way, but we have to improve a lot of things.\"\nCalderon's first two league games at the helm were both losses, while there was also a FA Cup loss to Premier League side Ipswich this month.\nYet although the Gas remain 18th in League One, they are now seven points clear of the bottom four with a game in hand on two of the teams directly below them.\nThe 41-year-old believes the recent wins are helping the players buy in to his approach and style of how he wants them to play.\n\"For me a good coach is the one who can convince players, and to convince players you can talk and talk and talk and talk but if you don't see the results it's difficult,\" Calderon said.\n\"Just try to [show] when we do things right we get results, that's the best thing - after you show them and they say 'OK, maybe he's making sense what he's saying'. For me that was key.\"\nCalderon praised on-loan Oxford striker Gatlin O'Donkor's headed goal against the Tykes as \"the best action\" the club have had with the ball so far under him.\n\"If I remember against Cambridge [it was] the same, the goal we scored was after trying to play good,\" he said.\n\"We are getting a few good games when we press well so that's the most important thing, to make them believe that is the right thing.\"", "url": "https://www.bbc.com/sport/football/articles/ckgxq7k28n0o"}