{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:52:37", "date_modify": "2025-05-21 07:52:37", "date_publish": "2025-01-13 15:52:23", "description": "Man Utd news: Michael Brown on not getting carried away by win at Arsenal", "filename": "sport_football_articles_c7vd3333p6yo_1747813957.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/970f/live/8c2e9f90-d1bb-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c7vd3333p6yo_1747813957.html", "title": "Man Utd news: Michael Brown on not getting carried away by win at Arsenal", "title_page": "Man Utd news: Michael Brown on not getting carried away by win at Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Premier League midfielder Michael Brown says beating Arsenal \"will build confidence\" at Manchester United but he is cautious of people getting carried away with their small progress in recent weeks.\nThe Reds came into this game without a win in their previous five matches in the league, and Amorim will hope this is the start of a run of form that can get United going under his leadership.\n\"I don't want to give too much credit and I don't want to look too far into it because we've seen this Manchester United show promise before and slip back into their old ways,\" said Brown on BBC Radio 5 Live's Football Daily podcast.\n\"We understand the manager, what he's trying to bring, the energy, the determination and the press.\n\"There are some good players at Manchester United who can score and who can cause problems. But when it is tough, that is when they fell away.\n\"The result will build confidence as it showed determination and the guts that is needed to get through like that. It's a start and it's something good.\n\"But I think there's still a lot of work to do.\"", "url": "https://www.bbc.com/sport/football/articles/c7vd3333p6yo"}