{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:16:26", "date_modify": "2025-04-26 04:16:26", "date_publish": "2025-03-04 09:16:59", "description": "BBC Sport tracks the latest news stories from the National League, including managerial announcements, new signings and contract extensions.", "filename": "sport_football_articles_c5y07d3nw38o_1745640986.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2d2/live/91822510-f8d6-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c5y07d3nw38o_1745640986.html", "title": "National League news - March 2025", "title_page": "National League news - March 2025 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "BBC Sport tracks the latest news stories from the National League, including managerial announcements, new signings and contract extensions.\nCheck out the gossip page for the latest rumours, use our transfers page to track signings made by English Football League clubs or read more National League news from February.\nNational League play-off hopefuls Tamworth have confirmed that Scotland Under-19s wide midfielder George Morrison has been recalled by his parent club, mid-table League Two side Fleetwood.\nMorrison, 19, who arrived in August on a season-long loan, made 34 league appearances for the Lambs, as well as playing in the FA Cup third-round tie against Tottenham Hotspur in January.\nAndy Peaks' Lambs have climbed to within three points of the play-offs after a great run of 16 points out of a possible 18.\nForest Green Rovers have signed goalkeeper Ted Cann on loan from Championship side West Bromwich Albion until the end of the season.\nThe 24-year-old has not made a first-team appearance for the Baggies and has most recently been playing for their under-21 side.\nHalifax Town have signed 20-year-old defender Charlie Hayes-Green from Bolton Wanderers on a deal to the end of next season.\nHayes-Green, who came through Liverpool's youth academy, made an EFL Trophy appearance for the Reds against Rochdale in 2022.\nHalifax Town have signed Middlesbrough forward Daniel Nkrumah, 21, on loan until the end of the season.\nSutton United have signed Gateshead midfielder Kain Adom, 23, on loan until the end of the season after his spell with Fylde was ended by mutual consent.\nMidfielder Harry Kite has joined Yeovil Town until the end of the season.\nThe 24-year-old made 94 appearances for Exeter City after coming through their academy.\nBoston United have signed Hull City wing-back Noah Wadsworth on loan.\nThe 20-year-old made four appearances in a month-long loan spell with National League North promotion hopefuls Chester around the turn of the year.\nMeanwhile, Boston defender Kieran Coates, 23, has joined National League North side Hereford on loan.\nAltrincham have signed Fleetwood Town midfielder Callum Dolan, 24, and Blackburn Rovers full-back Brandon Powell, 19, on loan until the end of the season.\nWoking have signed former Tottenham Hotspur youngster Charlie Sayers.\nThe 20-year-old defender was released by Partick Thistle in January. The length of his contract is undisclosed.\nGateshead have signed midfielder Tim Akinola from Chesterfield on a deal until the end of next season.\nThe 23-year-old played five games for Chesterfield this season and also had loan spells at Dagenham & Redbridge and Solihull Moors.\nRochdale have signed goalkeeper Killian Barrett from Sheffield Wednesday in a loan deal for the remainder of the season.\nIrishman Barrett, 21, had a loan spell earlier in the season at fellow National League side Solihull Moors.\nHartlepool United have brought in goalkeeper Darryl Ombang on loan from Leeds United for the rest of the season.\nThe 19-year-old replaces Owen Foster, who has been moved from parent club Hull City to a loan move at National League South club Torquay United.\nSolihull Moors have extended the loan of defender Reece Hall-Johnson until the end of the season.\nThe 29-year-old initially joined Solihull from Barnet at the end of February and has made five appearances for Matt Taylor's side.\nKwame Thomas has rejoined Aldershot Town on loan from Ebbsfleet United until the end of the season.\nThe forward spent last season with Aldershot, scoring six goals, before signing for Ebbsfleet in July.\nGateshead United have signed Middlesbrough midfielder Brayden Johnson on loan for the rest of the season.\nThe 18-year-old joined the Championship side from National League South club Eastbourne Borough in January and has played six times for Boro's under-21 team in Premier League 2.\nThe Heed have also brought in Ethan Robson on loan from League Two Carlisle United for the remainder of the campaign.\nRobson, 28, has only played eight times for Carlisle since a summer switch from MK Dons, the last of which was on 15 February.\nWoking have signed 25-year-old forward Joshua Osude from Isthmian League club Hashtag United on a permanent deal.\nOsude had spells in the academies of Bournemouth and Leyton Orient before joining Hashtag United in 2019.\nBoston United have signed Hartlepool United midfielder Greg Sloggett on loan for the rest of the season.\nThe 28-year-old, who has made 18 appearances for Pools this season, was available for Boston's game against Southend United on Tuesday evening.\nDagenham & Redbridge have signed goalkeeper Jake Turner on loan from Gillingham until 5 May.\nThe 26-year-old has featured nine times for Gillingham this season, keeping three clean sheets.\nTurner joins Gillingham team-mate Marcus Wyllie on loan at the National League club.\nGhanaian forward Joe Dodoo has joined Solihull Moors on a deal until the end of the season.\nDodoo came through Leicester City's academy and has also appeared for Burton Albion and Doncaster Rovers.\nSolihull Moors winger Jack Stevens has signed a new contract extension into 2026.\nThe 24-year-old has scored 14 goals for the Moors this season having joined from Banbury United in February 2023.\nLeyton Orient midfielder George Moncur has made his loan move to Ebbsfleet United permanent.\nThe 31-year-old has scored two goals in 13 appearances with the Fleet this season.\nBarnet have recalled Joe Rye from his loan at National League South side Chelmsford City.\nThe 21-year-old made 14 appearances with the Clarets, scoring once.\nHalifax Town have signed former West Ham United defender Sean Tarima on a deal until the end of the season.\nThe 20-year-old made two appearances for the Hammers' under-21 side in the EFL Trophy this season before leaving by mutual consent in January.\nEastleigh defender Niall Maher will miss the rest of the season with a serious knee injury sustained against Oldham Athletic.\nThe 29-year-old centre-back has played in all but two of the Hampshire club's National League matches this season.\nEastleigh say there is \"no definitive timescale for his return\".\nMillwall midfielder Sha'mar Lawson has joined Woking on loan until the end of the season.\nThe 21-year-old made six appearances on loan at Ebbsfleet United earlier in the campaign before returning to the Lions due to injury.\nTamworth forward Chris Wreh has returned to The Lamb Ground following a loan spell at Scunthorpe United.\nHe scored five goals in 20 appearances this season for the club before joining Scunthorpe last month.\nGoalkeeper Toby Savin has returned to Shrewsbury Town after his loan at Barnet ended after one month.\nThe 23-year-old made just one appearance for the Bees, in a 4-0 win at Rochdale last month.\nFormer Preston North End boss Frankie McAvoy has joined AFC Fylde's coaching staff for the remainder of the 2024-25 season.\nThe 57-year-old briefly managed the Lilywhites in 2021 and most recently acted as assistant to Steven Naismith at Scottish Premiership club Hearts.\nHe joins interim bosses David Longwell and Chris Neal, who took over on a temporary basis following Kevin Phillips' departure earlier this season.\n\"I've known David (Longwell) for a long time and I was more than happy to come and assist him and the rest of the team whilst we look to remain in the division,\" McAvoy said.\nAltrincham have extended the loan of Norwich City goalkeeper Caleb Ansen for the rest of the season.\nThe 19-year-old has made four appearances since arriving, the most recent in a 2-1 home defeat by Fylde on 22 February.\nDagenham & Redbridge have signed striker Marcus Wyllie on loan from Gillingham until the end of the season.\nWealdstone have added striker Tyler Walker on loan to their squad from Lincoln City for the rest of the season.\nAldershot Town have extended defender George Milner-Smith's loan at Havant & Waterlooville until the end of the season.\nBraintree Town have signed Colchester United forward Kyreece Lisbie on loan for the rest of the season.\nThe 21-year-old joins brother Kyrell, who has scored 11 goals in 33 appearances for The Iron this season, at Cressing Road.\nEastleigh have signed Tamworth midfielder Nathan Tshikuna on a permanent transfer until the end of the season.\nThe 26-year-old scored nine goals in 42 appearances as the Staffordshire side won the National League North title last season.\nAldershot Town have recalled midfielder Keane Anderson from his loan at Havant & Waterlooville.\nThe 21-year-old made 34 appearances and scored four goals in his time at the south coast club.\nRochdale have agreed a one-year contract extension with Tobi Adebayo-Rowling until the end of next season.\nWing-back Adebayo-Rawling, 28, joined Dale last summer from Notts County and has played 33 games for them, scoring once.\nYeovil Town have signed defenders Frankie Terry and Marcel Lavernier on deals until the end of the season.\nTerry, 21, arrives on loan from Colchester United and is the nephew of former England internationals John Terry and Paul Konchesky.\nHe made his first League Two start for the Essex club in January after spending time on loan at Braintree Town.\nLavernier, 24, joins as a free agent having left Forest Green Rovers after more than 18 months where he played 25 games.\nAldershot have signed defender Tariq Uwakwe on loan from Swindon Town until the end of the season.\nThe 25-year-old, who came through the youth academy at Chelsea, moved to Swindon in 2023 from Crewe Alexandra, for whom he made 48 appearances.\nYeovil Town have signed winger Ryan McLean on loan from AFC Wimbledon until the end of the season.\nThe 24-year-old has not played since April 2024 when he suffered an anterior cruciate ligament injury and AFC Wimbledon's director of football Craig Cope said the loan was to help him \"get back up to speed in a competitive setting\".\nSolihull Moors have signed Dutch forward Manny Duku on a short-term deal after his spell with Hednesford Town ended last month.\nThe 32-year-old has scored 19 goals this season and was signed in time for Solihull's home game against Sutton United.", "url": "https://www.bbc.co.uk/sport/football/articles/c5y07d3nw38o"}