{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:21:30", "date_modify": "2025-04-26 06:21:30", "date_publish": "2025-03-04 00:00:00", "description": "Steven Fletcher's second-half goal saw Wrexham beat Huddersfield Town at the John Smith's Stadium in League One.", "filename": "sport_football_live_cedlley484vt_1745648490.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fa17/live/14fb3560-f942-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cedlley484vt_1745648490.html", "title": "Huddersfield Town 0-1 Wrexham: Steven Fletcher goal earns Welsh side victory", "title_page": "Huddersfield Town 0-1 Wrexham: Steven Fletcher goal earns Welsh side victory - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Substitute Steven Fletcher struck his seventh goal of the season to earn Wrexham a crucial League One victory over Huddersfield Town.\nHuddersfield dominated possession early on at the John Smith's Stadium and thought they had gone in front when Josh Koroma fired beyond Arthur Okonkwo on 16 minutes, only for the effort to be ruled out for offside.\nBoth sides struggled to carve out clear openings, but the Terriers missed a fine chance to go ahead before half-time as Dion Charles blazed over.\nJay Rodriguez's powerful strike was well saved by home keeper Lee Nicholls in the second half.\nBut just a minute after coming off the bench, Fletcher lashed into the net from a yard out after Sam Smith's header was saved to earn Phil Parkinson's side a fourth successive away league victory.\nWrexham stay third, two points behind Wycombe Wanderers who are second.\nMichael Duff's Huddersfield - who have failed to score in each of their past six home league games - drop to sixth, just one point and one place above Bolton Wanderers, who are seventh.\nHuddersfield Town boss Michael Duff told BBC Radio Leeds:\n\"A good performance but we ended up having to get disrupted again through injuries.\n\"It's frustrating, and in these big games it's about big moments. I don't think they've (Wrexham) hardly created a chance all game.\n\"There's a foul in the build-up to it (Wrexham's goal) and he's (Fletcher) offside because he's stood on the line, but the actual performance was miles better, it looked more like us.\"\nWrexham manager Phil Parkinson told BBC Radio Wales:\n\"I'm really pleased, it takes some doing in terms of team work and ethic.\n\"I thought we started a little bit slow but we grew into the game.\n\"I thought we really stuck to the job in hand, got the important goal and, against a good side, we didn't feel troubled that much.\"", "url": "https://www.bbc.co.uk/sport/football/live/cedlley484vt"}