{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:55:16", "date_modify": "2025-05-21 05:55:16", "date_publish": "2025-02-01 00:00:00", "description": "Luke Cundle scores on his Millwall debut as the Lions beat Queens Park Rangers in a feisty London derby at The Den.", "filename": "sport_football_live_c9qjnp7pe92t_1747806916.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9qjnp7pe92t_1747806916.html", "title": "Millwall 2-1 Queens Park Rangers: Luke Cundle scores winner on debut", "title_page": "Millwall 2-1 Queens Park Rangers: Luke Cundle scores winner on debut - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luke Cundle scored on his Millwall debut as the Lions beat Queens Park Rangers in a feisty London derby at The Den.\nAaron Connolly's opener inside 30 seconds was cancelled out by Alfie Lloyd's equaliser just two minutes later in a breathless start to the match.\nCundle, included in the starting XI just a day after completing his move from Wolverhampton Wanderers, headed the home side back in front on 25 minutes after George Saville's header came back off the crossbar.\nMillwall keeper Lukas Jensen produced fine saves to deny Koki Saito and Sam Field as the home team survived a barrage of attacks late on to claim their third win in a row.\nWith QPR boss Marti Cifuentes missing the game through illness, assistant head coach Xavi Calm was in the dugout for the visitors.\nJimmy Dunne, who had been the subject of a bid by Sheffield United, was not included in the matchday squad, with Calm revealing after the game the defender had picked up a groin injury.\nAnd it was the home side who got off to a flier when Connolly side-footed in the opener after team-mate Mihailo Ivanovic had mis-kicked while trying to score from Tristan Crama's cross.\nThe visitors responded brilliantly through Lloyd, as Paul Smyth and Kieran Morgan combined well down the right on the break, before the striker fired beyond returning goalkeeper Lukas Jensen via the far post two minutes later.\nRa'ees Bangura-Williams then hit the upright with a long-range left-footed effort that had R's keeper Paul Nardi beaten.\nMillwall continued to get numbers forward and it paid off on 25 minutes as debutant Cundle headed home after Saville's header came back off the crossbar, with Crama again the creator with the cross from the right.\nQPR pushed for the equaliser in the second half, with Millwall dropping deep as they looked to hit them on the counter, with the visitors looking more dangerous in the final third after the introduction of Koki Saito, Michael Frey and new loan signing Yang Min-Hyeok.\nSubstitute Harrison Ashby saw his header deflect behind before Morgan Fox forced a save from Jensen from the resulting corner.\nSaito's spectacular effort was palmed over by Jensen before the Millwall keeper produced an outstanding reflex save to keep out Field's deflected shot as Rangers piled on the pressure.\nThey continued to push but couldn't find a way through, with Field volleying over the bar with virtually the last kick of the game.\nMillwall boss Alex Neil speaking to BBC Radio London:\n\"I think what it [this run of results] does do is it shows how quickly football can change. The last home game here there was a lot of frustration conceding in the 97th minute [against Cardiff City], which I understand. I think since then we've been brilliant in terms of the performances and results.\n\"It was important to me today that we won at home. Most of our fans come to see us here so I want for them to go home happy and put on a performance and, more importantly, carry a threat and score goals. I think right from the start we did that today.\"\nOn club's transfer activity: \"The boys have been brilliant. We always knew we'd be bringing players in and Romain [Esse] would be moving on provided someone came in and bought him. We knew we were going to bring in younger players and develop the style.\n\"The hard bit with all of that is to do it and win, and we're doing that. We're doing what we set out to do and at the moment it's going really well.\"\nQPR assistant head coach Xavi Calm:\n\"He's [Marti Cifuentes] OK, not good enough to come to the game. He was on the couch with the blanket, trying to be in touch with us and hopefully he'll recover as soon as possible, but today it wasn't possible to be here for him.\n\"[The start to the game was] Tough because we didn't expect to concede this type of goal early in the game. We reacted really well after conceding the goal with an amazing goal, but it's always a shame to concede these type of goals that we never concede usually.\n\"The second goal, maybe we were not as good as we normally are. And in the second half we reacted again but we didn't get the one point that we had the feeling we deserved.\n\"In the second half we pushed, the lads did really well. They gave us everything until the end, the bench impact was there and was good but at the end it is a 2-1, no point for us, and we have to move on and try to get the points on Tuesday [against Blackburn Rovers].\n\"The lads are working hard. They are doing everything to get the points.\"\nOn Jimmy Dunne: \"He's a Queens Park Rangers player. He felt a little bit the groin two days ago and we picked the best team we had available to play the game. He's our player, hopefully he's going to carry on as one of us.\"", "url": "https://www.bbc.com/sport/football/live/c9qjnp7pe92t"}