{"authors": ["Nick Webb", "www.facebook.com"], "date_download": "2025-05-20 13:45:02", "date_modify": "2025-05-20 13:45:02", "date_publish": "2023-07-25 18:47:47", "description": "Colin Ingram hits 136 and Zain Ul Hassan a career-best 69 as Glamorgan dominate against Derbyshire to reach 408-6.", "filename": "sport_cricket_66300321_1747748702.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0AC9/production/_130516720_cdf_090423_cf_glam_v_glos_055.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300321_1747748702.html", "title": "County Championship: Ingram leads solid Glamorgan effort at Derbyshire", "title_page": "County Championship: Ingram leads solid Glamorgan effort at Derbyshire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Ingram led the way for Glamorgan with a fluent 136 as they piled up 408-6 after being put in by Derbyshire.\nHe shared a second-wicket stand of 193 with Zain Ul Hassan, who made a career-best 69.\nKiran Carlson (57) and Billy Root (52) added 107 in another solid batting display by Glamorgan.\nDerbyshire's seamers, bowling plenty of short-pitched deliveries, could not show enough consistency to match their hostile intent.\nTheir disappointing day was made worse when Anuj Dal slipped before bowling in the closing minutes and limped off.\nGlamorgan, fifth in the table but just six points off the promotion places, added four batting points with the hope of a fifth.\nBut Derbyshire, without Wayne Madsen on Italy duties, will hope to blunt the visitors' attack in the same way on a pitch whose green appearance was misleading.\nGlamorgan's Derbyshire-bound captain David Lloyd got the day off to a bright start by smashing sixes over fine leg and square leg in Sam Conners' second over, but then edged Zak Chappell behind for 19 off 14 balls.\nThat was Derbyshire's only success in the opening session as the patient Ul Hassan and the more aggressive Ingram built their partnership, with the seamers occasionally beating the outside edge of the bat, but giving too many scoring chances.\nIngram, driving and cutting attractively, continued to dominate the stand in the afternoon session, reaching his first century of the season off 146 balls and allowing Ul Hassan to accumulate quietly at the other end.\nThe home side packed the leg side and banged the ball in to try to buy a wicket, but the second wicket stand was a Glamorgan record against Derbyshire by the time Ul Hassan chipped a return catch to George Scrimshaw.\nThe first bonus point went to Derbyshire as Sam Northeast pulled Chappell to square leg on 13, but it came as a surprise when the persevering Dal got one through Ingram's defences, after he had struck 22 fours and a straight six.\nThat left Glamorgan on 273-4 when rain took the players off but Carlson and Root went for their shots, though Carlson was dropped at gully off Dal on 27.\nDerbyshire delayed taking the new ball by four overs but the run-rate went up when they did, helped by a generous donation of extras.\nThe sparky Carlson smacked 10 fours before driving Luis Reece low to cover, but new man Chris Cooke was able to pull and drive for three fours in the next five balls.\nRoot's 50, off 59 balls, was the fastest of the day and Cooke edged Reece through slip to bring up the 400 and leave Derbyshire looking disconsolate, though they were given a late bonus when Root fell lbw playing no shot to Reece.\nGlamorgan batter Colin Ingram told BBC Sport Wales:\n\"Coming out this morning, the wicket looked like it had a good amount of grass on it, but the way the day unfolded, we've come away feeling really happy this evening.\n\"There were a few balls that had your name on, I was fortunate enough to play and miss a few, so we tried to stay positive and Zain played brilliantly upfront as he chewed up a lot of balls and left well, so our partnership dragged us into a position where we could play more positively.\n\"I tasted some good success and found some things that really worked last season (in red ball cricket), so it's satisfying to come back and put those into play again.\n\"I really did enjoy my time in the middle today and to get three figures was really satisfying.\"\nDerbyshire bowler Zak Chappell told BBC Radio Derby:\n\"We asked for more grass on the wicket and they gave it to us, but we didn't bowl as well as we could have, we didn't field as well as we should have done, and we didn't take catches at crucial times.\n\"They almost let us back in before the second new ball but we didn't have a brilliant last 30 minutes so we're under the cosh again.\n\"When you see a Derby wicket that's green (you bowl) but there's no excuse for it, we didn't take our chances.\n\"In four-day cricket, there's always a way back in, if we take a couple of quick wickets and then we bat well.\"", "url": "https://www.bbc.com/sport/cricket/66300321"}