{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:26:27", "date_modify": "2025-05-20 14:26:27", "date_publish": "2023-07-29 12:12:51", "description": "New Zealand cruise past Australia to win their third Rugby Championship in a row, with Eddie Jones still yet to win a game as the new Wallaby head coach.", "filename": "sport_rugby-union_66348302_1747751187.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/C6F0/production/_130582905_gettyimages-1578346057.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-union_66348302_1747751187.html", "title": "Australia 7-38 New Zealand: All Blacks hammer Wallabies to win Rugby Championship", "title_page": "Australia 7-38 New Zealand: All Blacks hammer Wallabies to win Rugby Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Zealand cruised past Australia to win their third Rugby Championship in a row, with Eddie Jones still yet to win a game as head coach of the Wallabies.\nThe All Blacks' first-half tries came from Shannon Frizell, Codie Taylor and Will Jordan, after Rob Valetini's try had given Australia an early 7-5 lead.\nThe visitors pulled clear in the second half in Melbourne with tries from Caleb Clarke, Mark Telea and Rieko Ioane.\nThe All Blacks retain the Bledisloe Cup for the 21st year in a row.\nThe two sides face each other next weekend in the second Bledisloe Cup game in Dunedin on New Zealand's South Island.\nThe game was played in front of 83,944 people at Melbourne Cricket Ground - the largest home crowd in 20 years for Australia as they looked to bounce back from their shock defeat by Argentina.\nThe All Blacks had the ideal start when Scott Barrett timed his tackle on Australia scrum-half Tate McDermott to perfection at a defensive line-out, with Frizell taking advantage of the dropped ball for the opening try.\nThe Wallabies instantly responded when winger Mark Nawaqanitawase broke through the defensive line before Valetini powered over from close range for the try.\nThe momentum continued to swing in either direction for much of the first half before the All Blacks finally took control, although Wallabies fly-half Carter Gordan struggled on his first start.\nThe 22-year-old was one of 11 players in the starting line-up with fewer than 30 caps.\nQuick thinking from electric winger Telea nearly put Ian Foster's side back in front but the winger was adjudged to have not clearly tapped the ball at a tap penalty and his score was disallowed.\nHowever, the penalty had been conceded by an offside Marika Koroibete at a ruck and he was duly sent to the sin bin.\nHooker Taylor scored from the back of a rolling maul for New Zealand and to make matters worse for Australia, captain Allan Alaalatoa was taken off on a stretcher with a leg injury - a worrying sight with the World Cup just over a month away.\nWinger Jordan finished sharply in the corner for his 23rd Test try in as many games, right on the half-time buzzer, to make it 19-7 to the visitors.\nJones turned to more experience during the second period with James Slipper and fly-half Quade Cooper, who have more than 200 caps between them, entering the field.\nThe All Blacks took advantage of another Wallaby yellow card, this time for Taniela Tupou, as replacement winger Clarke scored with his first touch with a strong pick and go from close range.\nJordan next turned provider for Telea with a brilliant offload, and the try of the night followed as New Zealand went the length of the pitch, the All Black winger goose-stepping past a floundering Koroibete before offloading to Ioane to finish off a dazzling move.\nWorld champions South Africa held on to beat Argentina 22-21 in the final Rugby Championship fixture.", "url": "https://www.bbc.com/sport/rugby-union/66348302"}