{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:16:57", "date_modify": "2025-05-20 13:16:57", "date_publish": "2023-08-03 00:00:00", "description": "Watch live BBC coverage as Morocco face Colombia in Group H of the 2023 Women's World Cup.", "filename": "sport_live_football_66157596_1747747017.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97A5/production/_130412883_lep-wwc23_badges-morocco-v-columbia.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66157596_1747747017.html", "title": "Morocco vs Colombia LIVE: Watch Fifa Women's World Cup plus score, commentary & updates in Group H game", "title_page": "Morocco vs Colombia LIVE: Watch Fifa Women's World Cup plus score, commentary & updates in Group H game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nWhat a way to end the 2023 group stages, and what a round of 16 awaits.\nThis World Cup is wide open. Could 2023 be the year of the underdog?\nWe've got a break tomorrow, but we will be back on Saturday with all the action from Switzerland v Spain and Japan v Norway.\nThank you for joining us and see you again next time.\nWe'll leave you with this bit of Morocco magic...\n'Other nations are moving fast'\nFT: South Korea 1-1 Germany\nJonas Eidevall\nArsenal manager on BBC Two\nDevelopment is fast in women's football at the moment.\nThere's no standing still. We see that with USA, we see that with Germany, we saw that with Brazil as well.\nOther nations are moving fast here now and they believe they can make a difference.\nReport: Two-time winners Germany knocked out of the World Cup\nSouth Korea 1-1 Germany\nTwo-time champions Germany were sent crashing out of the Women's World Cup group stages in the biggest shock of the tournament thanks to a draw with South Korea.\nIt is the first time in Germany's history they have failed to reach the knockout stages.\nOne of the pre-tournament favourites, Germany knew they needed to better Morocco's result against Colombia to progress in Group H, but that match finished 1-0 to Morocco.\nFull report.\nPost\nTwo of the pre-tournament favourites - Germany and Brazil - are out.\nAnd let's not forget there has been underwhelming performances from other teams that were also tipped to lift the trophy, including the USA, Spain and France.\nSo, has the group stage altered your overall predictions? Let us know!\nGet involved #bbcfootball, text 81111 (UK only, standard rates apply) or WhatsApp 03301231826\n'Germany shouldn't only depend on Popp'\nFT: South Korea 1-1 Germany\nJonas Eidevall\nArsenal manager on BBC Two\nGermany should have more players that should be able to create as well.\nSuch a good football team should not only be dependent on Alexandra Popp. It's almost been that everything has to go through her, it's only she who can make the difference and that's a weakness of this team.\n'Germany deserved to go out'\nFT: South Korea 1-1 Germany\nJonas Eidevall\nArsenal manager on BBC Two\nThat structure that we usually associate with the Germans, we didn't see it in the second half.\nEvery time this did cross the ball in, I think that was three occasions, they created something big out of it. Why don't you continue to do that?\nThat's the most disappointing thing with this performance. We didn't see the structure, we didn't see that clear idea on how they were going to score a goal and I think they deserved to go out.\n'The biggest shock in the women's game'\nFT: South Korea 1-1 Germany\nFara Williams\nFormer England midfielder on BBC Two\nWow. I'm in shock, I really am. That is the biggest shock in the women's game.\nFor Germany, European Championship finalist only a year ago to be knocked out in the group stage, having gone into the group stage as favourites. For me it's the biggest shock.\nIt was the most disappointing performance from the Germans in the last two games so it was deserved.", "url": "https://www.bbc.com/sport/live/football/66157596"}