{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:36:18", "date_modify": "2025-05-21 05:36:18", "date_publish": "2025-04-01 08:31:48", "description": "Wolves news: Matheus Cunha comments 'indelicate but not a huge surprise'", "filename": "sport_football_articles_ce3vwyp544yo_1747805778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a04/live/a811aba0-0ec2-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce3vwyp544yo_1747805778.html", "title": "Wolves news: Matheus Cunha comments 'indelicate but not a huge surprise'", "title_page": "Wolves news: Matheus Cunha comments 'indelicate but not a huge surprise' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Was Matheus Cunha out of line, or was his recent interview in which he seemed to imply he needed to leave the club \"misinterpreted\", as he suggested on Monday?\nThat was the debate on BBC Radio 5 Live's Monday Night Club, as Chris Sutton, Rory Smith and Joe Hart all slightly differed on their stance on the situation.\n\"He has probably said a few things that are indelicate and better off being said in June, but I don't think it will come as a huge surprise to Wolves fans,\" said New York Times chief football correspondent Smith. \"It probably won't come as a surprise to Wolves' hierarchy either.\n\"But I think there have been a few instances this season that would make you pause around Cunha's character, given he has had two fairly spectacular tantrums. Would that put buyers off?\n\"It would feel like a giant cross, in my opinion, so I think he will get his move but it won't be where he might want it to be because of his disciplinary record.\"\nFormer Premier League striker Chris Sutton added: \"He is just telling the truth and I think any player is entitled to turn around and say he doesn't want to be scratching around at the bottom of the table. But I agree that he should have waited.\"\nCunha said in an interview with the Observer that he has told Wolves he needs to \"take the next step\" and fight for titles in his career.\nEx-England goalkeeper Joe Hart acknowledged how Cunha was \"very truthful\" to say what he did, but there are bound to be \"repercussions\" for it.\n\"That is the route he has chosen to go down and everyone is entitled to answer questions,\" said Hart. \"People get so frustrated with people not answering things truthfully but that sounds like he has been very truthful. The repercussions of that are difficult though for the club and team to accept.\"", "url": "https://www.bbc.com/sport/football/articles/ce3vwyp544yo"}