{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:57:50", "date_modify": "2025-05-20 12:57:50", "date_publish": "2023-08-02 20:51:12", "description": "Arsenal striker Gabriel Jesus has minor knee surgery and will miss the start of the new Premier League season.", "filename": "sport_football_66389355_1747745870.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9792/production/_130620883_gettyimages-1577713198.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66389355_1747745870.html", "title": "Gabriel Jesus: Arsenal striker to miss start of Premier League season", "title_page": "Gabriel Jesus: Arsenal striker to miss start of Premier League season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Arsenal striker Gabriel Jesus has had minor knee surgery and will miss the start of the Premier League season.\nJesus did not play in Wednesday's pre-season win over Monaco and manager Mikel Arteta confirmed afterwards that the Brazil forward will be out \"for a few weeks\" after a \"little procedure\".\nThe 26-year-old's injury is related to the knee problems he had last season, which also required surgery.\n\"It's a big blow because we had him back to his best,\" said Arteta.\nSpeaking after Arsenal beat Monaco 6-5 on penalties following a 1-1 draw at Emirates Stadium, the Gunners boss said Jesus had felt some pain in his knee for the past few weeks.\n\"Unfortunately he had a little procedure this morning. He had some irritation in the knee and we had to get it resolved. It's not major but he will be out for a few weeks I think,\" Arteta said.\n\"We had to make a decision and the best one is to protect the player and to get him back as quickly as possible, so we decided to do it.\"\nJesus' injury comes four days before Arsenal face treble winners Manchester City in the Community Shield and 10 days before their first match of the Premier League season against Nottingham Forest.", "url": "https://www.bbc.com/sport/football/66389355"}