{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:22:13", "date_modify": "2025-05-21 04:22:13", "date_publish": "2025-04-06 06:02:30", "description": "Amorim is backing misfiring winger Alejandro Garnacho going into Man Utd v Man City derby... but for how long?", "filename": "sport_football_articles_cwy09n42pk8o_1747801333.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/afc0/live/da609130-1146-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy09n42pk8o_1747801333.html", "title": "Alejandro Garnacho: Should Man Utd sell or stick with frustrated forward?", "title_page": "Alejandro Garnacho: Should Man Utd sell or stick with frustrated forward? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alejandro Garnacho has a bit of history with Manchester City.\nLast season, he scored the opening goal as Manchester United stunned their local rivals in the FA Cup final - later posing with the trophy along with his youthful team-mates Amad Diallo, Kobbie Mainoo and Rasmus Hojlund.\nJust over two months later he was back on target at Wembley when he scored in the Community Shield against this weekend's Manchester derby opponents - the first of eight goals in his first 20 games of the season.\nBut then things took a downturn.\nGarnacho did not face City on 15 December after being dropped along with fellow forward Marcus Rashford.\nHead coach Ruben Amorim spoke about it being a selection issue following an evaluation of \"training performance, game performance, engagement with team-mates\".\n\"I pay attention to everything,\" he said. \"The way you eat, the way you put your clothes to go to a game.\"\nUnlike Rashford, who returned to the squad just once and did not play again before joining Aston Villa on loan in February, Garnacho was recalled immediately.\nSources said the issue came down to an interpretation of his reaction to receiving instruction as he waited to come on in a Europa League game\nAmorim believed Garnacho wasn't listening. Garnacho felt he was, while watching the game unfold.\nNew in the job, Amorim felt he had to lay down a marker. Garnacho's speedy return - and continued presence - confirms the matter has been dealt with and forgotten.\nBut his performance levels have dipped. In 21 appearances since the City game, Garnacho has scored one goal and created four.\nAnd after another frustrating performance against Nottingham Forest on Tuesday - during which he had six unsuccessful shots and was shown a yellow card for kicking the ball away in anger - his future became the focus of fan discussion.\nSpeaking to sources around United, a few key points emerge.\nGarnacho's confidence is at a low ebb. Someone with high-level coaching experience, who understands the demands players face at a club of that stature, suggests he is 'nervous'. It is a trait first spotted when he was breaking into the first team.\nThe Argentine is viewed as a player who is at his best when his mind is free. The belief is he is now over-thinking, meaning he snatches at chances.\nUnited legend Paul Scholes - now a pundit - has previously described Garnacho as \"scruffy\" technically and said his decision-making is \"really poor\" at times.\nIt is acknowledged from sources inside the club that Garnacho is feeling the strain, and he was pictured slapping his head in frustration after one wasted shot on Tuesday.\nThis is the first extended dip of Garnacho's career. While to many he 'arrived' with his brilliant bicycle kick at Everton in November 2023, he actually made his debut in April 2022.\nTuesday's game was Garnacho's 132nd for United - 46 of which have been this season. If he stays injury free and remains at the club, he could become one of the youngest United players to reach 200 appearances.\nAll have come during tumultuous times at Old Trafford, and it is worth remembering, too, that he is just 20.\nAs a 'homegrown' player, Garnacho remains one of United's most valuable assets.\nThe Football Transfers website values him at £55m - ninth in the list of under-21 players globally.\nIt is a year ago since United headed towards the summer transfer window in a delicate position with the Profit and Sustainability Rules (PSR) and let it be known they would consider offers for any of their players, aside from Garnacho, Mainoo and Hojlund, who were 'untouchable'.\nThat status was quietly removed before the January 2025 window.\nGarnacho was the subject of sustained interest from Napoli and Chelsea. Garnacho and his camp were aware of it. They also knew that while they weren't pushing him out of the door, United's hierarchy were not exactly putting the lock and bolt on.\nQuite how close a deal came to being struck is not clear, but could certainly be unsettling for the player.\nGarnacho went from being a central component of Ten Hag's squad to becoming part of the answer to United's PSR problems, with any fee being banked as 'pure profit'.\nHe could hardly be blamed for wondering if his future lay elsewhere.\nIt is clear Garnacho's best position - and his preferred role - is as a wide attacking player.\nBut it is a role that does not exist in Amorim's formation, where wing-backs provide the width and inside forwards the penetration.\nHe is trying to adapt - and Amorim's selections and recent quotes suggest he wants him to - but the process is not straightforward.\nOn Friday, he said: \"I think he is doing the right things. Like any player in our team, has to choose better, especially in the last third.\n\"Garnacho is improving the way he defends, the way he runs. He needs more goals and assists, that is clear. He wants to improve and is improving but is not in a great moment.\"\nLast month, the Portuguese said it was \"clear\" Garnacho had talent but he needed to \"learn to play a little bit in a different position\".\n\"He's finding the best way to play in this system. He's improving during training, and I think he changed the way he sees himself. I am trying to find the best position for him.\"\nThe decline in his effectiveness has been spotted elsewhere. After being a regular in the Argentina squad as part of the Copa America win last summer, he was left out for the most recent World Cup qualifiers.\nGarnacho is not hiding on the pitch, but does shun the limelight off it.\nHe has a young partner and child at home, with his wider family in Spain.\nSources told BBC Sport Garnacho is dedicated and showing maturity - reporting to training an hour before Amorim's start time of 10am for individual gym work.\nThough he does not tend to do many external interviews, he has worked hard on his English since he arrived in September 2020 and spent his first weeks in isolation because of Covid-19.\nHe does plenty of 'meet and greets' with fans and will sometimes stop on the way home from training to offer boots or other memorabilia to young fans.\nGarnacho is starting to gravitate towards the older players in the group. Within the squad, he is no longer recognised as a new kid on the block.\nGoing into Sunday's game there are questions around his future, but only time will tell if that lies at Old Trafford or elsewhere.", "url": "https://www.bbc.com/sport/football/articles/cwy09n42pk8o"}