{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:44:25", "date_modify": "2025-05-21 03:44:25", "date_publish": "2025-01-15 11:56:12", "description": "Chelsea news: VAR history made with decision not to send off Brooks", "filename": "sport_football_articles_c87d81xw353o_1747799065.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4136/live/c4a4dd70-d32e-11ef-9bab-e1537b3d246b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c87d81xw353o_1747799065.html", "title": "VAR history made with decision not to send off Brooks", "title_page": "Chelsea news: VAR history made with decision not to send off Brooks - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There were mumours of disbelief from Chelsea fans in Stamford Bridge when referee Rob Jones did not send Bournemouth's David Brooks off after going to the pitchside monitor to check for a red card offence in an incident between him and Marc Cucurella.\nFans have become used to on-field reviews being a foregone conclusion with referees routinely changing their decisions when alerted to possible 'clear and obvious' errors.\nWith the score at 1-1 in Tuesday's 2-2 draw, the video assistant referee spotted Brooks taking out Marc Cucurella off the ball as Chelsea looked to break from a defensive corner with the Cherries winger appearing to catch the Blues defender in the face with his arm before grabbing at his hair.\nJones' decision to just issue a caution to Brooks was the first time in the Premier League that a referee has rejected a red-card review at the pitchside monitor.\nTherefore, it was also the first time a red-card review for an unseen incident has resulted in a yellow card.\nIt is also the first time this season that the on-field referee has gone against the advice of his VAR after a video review.", "url": "https://www.bbc.com/sport/football/articles/c87d81xw353o"}