{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:40", "date_modify": "2025-05-21 05:02:40", "date_publish": "2025-01-23 12:48:03", "description": "Motherwell: Stuart Kettlewell dismisses criticism", "filename": "sport_articles_c2k5qlpn5jno_1747803760.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f769/live/ee5b06d0-d987-11ef-9467-577a0b7c8ee7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c2k5qlpn5jno_1747803760.html", "title": "Motherwell: Stuart Kettlewell dismisses criticism", "title_page": "Motherwell: Stuart Kettlewell dismisses criticism - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Motherwell boss Stuart Kettlewell has dismissed criticism of his tactics by people who have never \"walked in the shoes\" of a manager.\nThe Steelmen were knocked out of the Scottish Cup as they lost meekly 1-0 to the Scottish Premiership's bottom club St Johnstone.\nKettlewell, who takes his side back to Perth on league duty on Saturday with Motherwell in fifth place, has been criticised by a section of his own fans.\n\"There's a lot of experts out there and a lot of people that know better than the folk that have actually walked in the shoes and experienced the trials and tribulations,\" he said.\n\"You get things right, you get things wrong. This time of year – weather conditions, pitches – often dramatically changes from what it looks like on the first day of the season. That has a huge bearing on football.\n\"Last season we had so many plaudits at times for how we were playing, the style of football, keeping possession, creating chances. We went 15 games and never won a game of football.\"\nThe former Ross County manager's side are nine points better off than at the same point last season and he says he cannot afford to pay attention to outside opinions.\n\"You have to blank out a lot of that noise. There's a lot of people that I respect in the game that have that experience, a lot of people that I would listen to their opinion,\" he added.\n\"I'm not disregarding or disrespecting anybody. But it's safe to say I'll not be influenced by any noise or opinions from people that have never done the job and never dedicated their life to this game.\"", "url": "https://www.bbc.com/sport/articles/c2k5qlpn5jno"}