{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-20 14:24:39", "date_modify": "2025-05-20 14:24:39", "date_publish": "2023-07-25 07:12:25", "description": "Manchester United make progress in their striker search, says manager Erik ten Hag.", "filename": "sport_football_66298559_1747751079.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/99D4/production/_130508393_gettyimages-1549706868.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66298559_1747751079.html", "title": "Manchester United making progress in search for striker, says manager Erik ten Hag", "title_page": "Manchester United making progress in search for striker, says manager Erik ten Hag - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have made progress in their striker search, according to manager Erik ten Hag.\nUnited have privately ruled out making approaches for Paris St-Germain's Kylian Mbappe and Tottenham's Harry Kane, who both have uncertain futures.\nAtalanta's Denmark international Rasmus Hojlund, 20, remains their most obvious target, but United are reluctant to meet the Serie A club's £60m valuation.\n\"We make progress but we know how it works,\" Ten Hag said.\nSpeaking in San Diego at the start of a week in which United will play League Two side Wrexham on Wednesday and Real Madrid on Thursday, the Dutchman added: \"What I can say is we do everything in our power to get it done, for me, the earlier the better because we have to integrate him in the team, with the way of play.\n\"In an ideal situation, he was already here but you do not always get ideal situations as a manager and you have to deal with the situation.\"\nUnited scored 58 goals in the Premier League last season - the lowest among the top six sides - and Ten Hag said his side were \"underperforming\" in the area.\nAtalanta are said to have reached an agreement in principle with Spanish side Almeria for Mali forward El Bilal Toure, who had been attracting interest from Everton.\nThis pending club-record transfer is being viewed as paving the way for Hojlund's exit.\nHojlund joined Atalanta in August 2022 and scored 10 goals in 34 appearances last season. He made his international debut in September 2022 and has six goals in six games all in qualifying for Euro 2024.\nEngland forward Jadon Sancho has been operating as a false nine in pre-season so far and scored in United's 2-0 win over Arsenal on Saturday, although the return of Frenchman Anthony Martial from his latest injury is a positive.\nTen Hag has never questioned Martial's abilities. However, he has indicated there is an issue with the Frenchman's attitude.\n\"When you have a player in your squad you have to expect he is available,\" he said. \"Players have to take responsibility. If not, I have to deal with the situation.\n\"Anthony Martial is a brilliant football player. He will help us score goals. And there are other areas, like pressing and combinations. He's a great player. We hope he is fit and he stays fit.\"\nUnited have signed goalkeeper Andre Onana from Inter Milan for an initial £43.8m and midfielder Mason Mount from Chelsea for an initial £55m.", "url": "https://www.bbc.com/sport/football/66298559"}