{"authors": ["Mike Henson", "www.facebook.com"], "date_download": "2025-05-21 07:05:10", "date_modify": "2025-05-21 07:05:10", "date_publish": "2025-02-08 06:53:14", "description": "England suffered a record defeat on France's last visit to Twickenham, but the hosts hope to have struck on a winning fly-half formula in Fin Smith.", "filename": "sport_rugby-union_articles_c4g9v36y5qmo_1747811110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a943/live/1356c840-e57a-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c4g9v36y5qmo_1747811110.html", "title": "Six Nations: England braced for return of France to Twickenham", "title_page": "Six Nations: England braced for return of France to Twickenham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England came to Allianz Stadium in November in search of some home comfort.\nBefore then, Steve Borthwick's reign had been a roadshow. Of England's previous 15 games, only two had been at Twickenham.\nThe jet-set itinerary had included a third-place finish at the Rugby World Cup, wafer-thin away defeats by New Zealand and France and performances of much promise.\nThe two home stop-offs – against Wales and Ireland – had both been wins.\nA return to their rebranded headquarters was where England were to consolidate and kick on.\n\"We want to make sure this is a place that our players enjoy playing, that our fans enjoy coming, because they're seeing an England team performing and an England team winning,\" said Borthwick.\nInstead, the autumn kicked them in the teeth.\nA southern-hemisphere stampede of Kiwis, Wallabies and Springboks delivered three straight home defeats.\nA loss to Ireland in Dublin last weekend took the tailspin to six in seven matches.\nAnd now England return to Twickenham to face a French team who ransacked a record 53-10 scoreline on their last visit.\nThe hope of home advantage has morphed into the fear of home carnage.\nIn 2023, after France had run in seven tries and fans had darted for early exits, Borthwick was clear about the long-term task.\n\"There is a lot of work to do,\" he said.\n\"We have to make sure we are using each day to try and close this gap. That gap is there and evident for everyone to see.\"\nTwo years on, that gap remains frustratingly unbridgeable. England seem trapped, like a tortoise and an ancient athlete,, external in some logic snare; for every advance they claim to make, the opposition always stay just out of reach.\nFin Smith is the man tasked with delivering a quantum leap forward.\nThe 22-year-old, with seven replacement appearances, totalling 122 minutes of Test action, to his name, starts at fly-half against the Six Nations favourites.\nFortunately he has broad shoulders.\nSmith made his debut for Worcester at 18, lost his first 10 games for Warriors and then saw the club go bust at the end of his second season.\nSince then he has twice steered Northampton into the play-offs, winning the Premiership title last season.\nStill it is a bold call. Marcus Smith was the future once too.\nNow, after eight straight starts in the 10 jersey, the Harlequins playmaker is shuffled back into his unfavoured and unfamiliar full-back role.\nThe theory is clear.\nFin Smith is a more conventional 10, playing flat to the line and finding holes with his selection of pass and breadth of vision, rather than Marcus' hot-stepping individual brilliance.\nIt is hoped he will give centres Henry Slade and Ollie Lawrence more of a platform. With fellow Saints Alex Mitchell at scrum-half and Tommy Freeman and Ollie Sleightholme on the wings, Northampton connections should help the team click.\nAgainst a French team that kick for distance, rather than to set up aerial duels, Marcus Smith's ability to pick his way through a broken field will be either a deterrent or a weapon.\nElsewhere the back row is beefed up with the inclusion of Tom Willis, and the bench, which had won a cumulative total of only 81 caps against Ireland, has the experience of former captain Jamie George, with 97, and Elliot Daly, with 69, to guard against England's customary last-quarter fade.\nThat's the theory.\nWhether it survives contact with France's mix of the balletic and the brutal though is another thing.\nCaptain Antoine Dupont's game appears to have been elevated to yet another level by his time with France's Olympic gold-winning Sevens team.\nLast weekend's win over Wales was the mercurial Toulouse star's 24th straight victory as a starting scrum-half in the 15-a-side game – a run stretching back to France's quarter-final defeat by South Africa in October 2023.\nMatthieu Jalibert is a fly-half with devil to his game and a point to prove after being overlooked.\nFull-back Thomas Ramos has been dead-eyed off the tee. Wings Damian Penaud and Louis Bielle-Biarrey have bullet pace.\nTheir pack is anchored by Uini Atonio and Emmanuel Meafou, both up near 23 stone, and number eight Gregory Alldritt was at his rampaging best against Wales last weekend.\nThe bookmakers have made up their minds. France are clear favourite to raid the fortress once more.\nIf they are right, England's most noticeable progress will be past some unwanted markers.\nIt would be the first time France have won four straight games against England in the tournament in nearly 50 years.\nEngland would have lost four times in their past seven Six Nations games at Twickenham, as many as they had suffered in their previous 30 such fixtures.\nThe fixture list has served up the stiffest of Six Nations starts for England.\nScotland and Italy at home on successive weekends before a final-round trip to Cardiff means Borthwick's side are working through last year's table in descending order.\nThis weekend though won't be about home comforts. This Twickenham test, against the form team in Europe, will deliver some home truths about the distance between where England are and where they aspire to be.", "url": "https://www.bbc.com/sport/rugby-union/articles/c4g9v36y5qmo"}