{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 15:04:08", "date_modify": "2025-05-20 15:04:08", "date_publish": "2023-07-27 09:53:28", "description": "Ireland qualify for the T20 World Cup as their qualifier against Germany in Edinburgh is abandoned because of rain.", "filename": "sport_cricket_66316480_1747753448.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/11DC0/production/_130525137_gettyimages-1514106245.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66316480_1747753448.html", "title": "T20 World Cup: Ireland qualify for tournament after Germany match called off", "title_page": "T20 World Cup: Ireland qualify for tournament after Germany match called off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland have qualified for the T20 World Cup after their qualifier against Germany in Edinburgh had to be abandoned because of overnight rain.\nThe point is enough to ensure a top-two finish in the qualifying tournament.\nThe Irish were already on course to qualify after victories over Italy, Denmark and Jersey.\nQualification for next year's T20 tournament comes after failure to secure their place at this year's Cricket World Cup in India.\nIreland face hosts Scotland in their final qualifier on Friday (15:30 BST) in a match which will decide the outright tournament winner.\n\"While it's true that we'd rather have achieved qualification on the field today, we're delighted to have achieved our primary objective of qualifying for next year's T20 World Cup,\" said Ireland captain Paul Stirling.\n\"We came to Scotland with a clear plan and style of play we wanted to implement, and I think we delivered on that front.\n\"So, we'll celebrate job done this afternoon, but there is a trophy on the line tomorrow and we are keen to continue that winning momentum going into the India T20 series next month.\"\nIreland reached the Super 12 stage of last year's T20 World Cup.\nThey beat England but bowed out after defeats by Sri Lanka, Australia and New Zealand, while their match with Afghanistan was abandoned.\nThe 2024 tournament is scheduled to take place in the West Indies and the United States.", "url": "https://www.bbc.com/sport/cricket/66316480"}