{"authors": ["Sean Kearns", "www.facebook.com"], "date_download": "2025-05-21 06:19:58", "date_modify": "2025-05-21 06:19:58", "date_publish": "2025-04-01 05:20:17", "description": "The Premier League is back after two weeks off - here's a reminder of how things stand at both ends of the table... and when the title and relegation can be decided.", "filename": "sport_football_articles_cp8y7rj8md6o_1747808398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5d1e/live/72aafe60-0712-11f0-ba23-3d25664acce9.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp8y7rj8md6o_1747808398.html", "title": "What about relegation?", "title_page": "Premier League permutations: When can Liverpool win the title? What about relegation?  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Premier League is back after a two-week international break.\nAnd just in case you needed a reminder of how things stand at both ends of the table we are here to get you up to speed.\nAt the top, Arne Slot's runaway leaders Liverpool hold a 12-point advantage over second-placed Arsenal.\nAt the bottom, all three promoted sides - Southampton, Ipswich and Leicester - are well adrift in the relegation zone and looking as if they are destined for an immediate return to the Championship.\nIt feels like a matter of 'when, not if' those eventualities play out as we head into the final stretch of the season.\nBut when could the relegation places and title be decided?\nLiverpool are currently on 70 points - and nearest challengers Arsenal can only reach a maximum of 85 points if they win their remaining nine matches.\nThe Reds therefore require 16 points from a possible 27 to clinch their second Premier League title - and record-equalling 20th overall.\nFifteen points could also be enough given Liverpool's goal difference is vastly superior to Arsenal's (currently +42 to +29).\nIn fact, given their goal difference supremacy, Slot's side might only need four wins- as long as one of those is against the Gunners - to secure the title.\nArsenal beat Chelsea at Emirates Stadium in their game in hand over Liverpool before the international break.\nThat victory reduced Liverpool's lead at the top of the table from 15 points to 12.\nBut, in terms of when Slot's side can win the title, it has made little difference.\nThe earliest date Liverpool could win their 20th league title is 13 April, when they play West Ham at Anfield.\nFor that scenario to play out, Arsenal need to lose their next two matches against Fulham and Everton, with Liverpool beating Everton and Fulham in that time.\nThat would leave Arsenal 18 points behind Liverpool with 21 points left to play for.\nA Brentford victory against Arsenal on 12 April would leave the Gunners 18 points behind with 18 points left to play for, leaving Liverpool needing a single point against the Hammers on 13 April to claim the title.\nStatisticians Opta give Arsenal just a 0.8% chance of winning the title, with Liverpool given a 99.2% chance based on their position and remaining fixtures.\nWolves' 2-1 win against Southampton before the international break was a bitter blow to the bottom three.\nVitor Pereira's side are the only realistic candidates to be dragged into a relegation battle but that win took them nine points clear of safety.\nBoth Leicester and Ipswich still retain hope but time is running out for them to close the nine-point gap.\nWith 27 points left to play for, Wolves could secure their Premier League status by collecting 10 points from their next four matches, provided Leicester and Ipswich both lose their next three matches.\nIn that scenario, Wolves would go 19 points clear of the bottom three and there would only be 18 points left to play for.\nSouthampton require a minor miracle to stay up, given they are 17 points adrift with just 27 points left to play for.\nInstead, Ivan Juric's side are fighting to avoid earning the tag of the worst Premier League side ever.\nThat unfortunate title - if we are judging on points alone - belongs to Derby County in 2007-08.\nPaul Jewell's side finished the season on 11 points, fewer than the previous record set by Sunderland in 2005-06 when they finished with 15.\nSouthampton, therefore, need three points in the next nine matches to pass the unwanted mark set by Derby 17 years ago.\nHere's where it gets slightly more complicated.\nAs things stand, finishing in the top four in the Premier League is the only official way to qualify for the Champions League via a team's domestic position.\nBut, it looks increasingly likely that England will be granted an additional Champions League spot thanks to its co-efficient ranking.\nThat means the team that finishes in fifth would also earn a Champions League place.\nThat team is currently Manchester City. But there are just four points between City and 10th-placed Bournemouth - and every team in the top half will fancy their chances of grabbing that extra spot.", "url": "https://www.bbc.com/sport/football/articles/cp8y7rj8md6o"}