{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-05-21 07:14:06", "date_modify": "2025-05-21 07:14:06", "date_publish": "2025-01-13 18:40:38", "description": "Glasner explains reason for Chalobah abesence against Stockport", "filename": "sport_football_articles_c8d9m91vj06o_1747811646.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4cba/live/c979e040-d1dd-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c8d9m91vj06o_1747811646.html", "title": "Glasner explains reason for Chalobah abesence against Stockport", "title_page": "Glasner explains reason for Chalobah abesence against Stockport - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Oliver Glasner has explained why a \"contractual issue\" meant Trevoh Chalobah was left out of the FA Cup third round match with Stockport County.\nThe Palace manager says Chalobah was going to start the tie at Selhurst Park and the centre back was pictured at the stadium.\nThe Eagles only named eight substitutes on the bench and Chalobah was not included in the squad.\n\"It's not easy to explain,\" Glasner said.\n\"It was a contractual issue – we had to take care. This is why he didn't play. I'm not a lawyer, but I was told that in this round, it was better for him not to play.\n\"I found out yesterday evening. It was internal [there was no contact from Chelsea].\"\nThere has been speculation around Chalobah's future with his parent club Chelsea having a recall option on the defender.\n\"I know he wants to stay and we want [him to stay at the club], but there is still 19 days to go in the transfer window,\" Glasner said.\n\"I want this squad to stay together. I know Trevoh [Chalobah] and Marc [Guehi] want to stay – these are the main [talking points] in the last days.\n\"Trevoh is expected to be available at Leicester on Wednesday.\"", "url": "https://www.bbc.com/sport/football/articles/c8d9m91vj06o"}