{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:03:17", "date_modify": "2025-05-21 07:03:17", "date_publish": "2025-03-29 00:00:00", "description": "Jayden Stockley's late header earns high-flying Port Vale a narrow 1-0 win after a tight encounter at local rivals Crewe.", "filename": "sport_football_live_c86pzpz0ezdt_1747810997.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed06/live/dd16e370-0af7-11f0-88b7-5556e7b55c5e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c86pzpz0ezdt_1747810997.html", "title": "Crewe Alexandra 0-1 Port Vale", "title_page": "Crewe Alexandra 0-1 Port Vale - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jayden Stockley's late header earned high-flying Port Vale a narrow 1-0 win after a tight encounter at local rivals Crewe.\nAfter withstanding the hosts' pressure for long spells, the Valiants emerged as a force in the closing stages, wasting two gilt-edged chances before Stockley pounced, although the goal triggered disgraceful scenes as home and away fans clashed with lines of police in one corner of Gresty Road.\nVictory pushed Vale up to third in the table ahead of Saturday's 15:00 GMT kick-offs, but Crewe are now winless in five and remain ninth.\nEarly on, Jesse Debrah thwarted Kane Hemmings' route to goal with a decisive tackle after Chris Long slipped the Crewe frontman through inside the box.\nMatus Holicek was a thorn in the flesh for the visitors and the youngster's low drive just missed hitting the bottom corner.\nVale were grateful to goalkeeper Ben Amos for staying on terms as the interval approached as he made saves from Long and Max Conway.\nThe Alex went close again when Tommy Lowery's volley clipped the crossbar.\nVale only once forced Crewe goalkeeper Fillip Marschall into a save in the opening period, with the Aston Villa loanee beating out Ryan Croasdale's snapshot.\nThe visitors wasted two late chances with substitute Rico Richards skewing a volley past the far post and Croasdale prodding the ball tamely straight at Marschall.\nBut it was Stockley who was lurking to apply a header into the top corner at the far post after the ball ricocheted around the home box for Vale's 86th-minute winner.", "url": "https://www.bbc.com/sport/football/live/c86pzpz0ezdt"}