{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:02:45", "date_modify": "2025-05-20 14:02:45", "date_publish": "2023-07-25 20:43:55", "description": "Larne face a difficult task in the second leg of their Europa Conference League second qualifying round tie against Ballkani after suffering a 3-0 defeat in Kosovo.", "filename": "sport_football_66295697_1747749765.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1735F/production/_130517059_andyryan.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66295697_1747749765.html", "title": "Europa Conference League: Larne face uphill task after 3-0 first leg defeat by Ballkani in Kosovo", "title_page": "Europa Conference League: Larne face uphill task after 3-0 first leg defeat by Ballkani in Kosovo - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne face a difficult task to overturn a 3-0 deficit from the first leg of their Europa Conference League second qualifying round tie against Ballkani.\nThe second leg will be played at Solitude on Thursday 3 August.\nA 25th-minute penalty from Albion Rrahmani had Kosovo's champions ahead in Pristina and Almir Kryeziu fired home his side's second on 33 minutes.\nThe impressive Nazmi Gripshi completed a convincing win by finding the top corner midway through the second half.\nLarne went into the tie on the back of last week's disappointing 3-2 aggregate defeat after extra time at the hands of Finnish side HJK Helsinki in the first qualifying round of the Champions League.\nBallkani lost 4-2 over two legs to Bulgarian outfit Ludogorets in the same competition despite winning their home fixture 2-0.\nTuesday's game at the Fadil Vokkri Stadium was played in temperatures close to 30C and Larne found themselves under pressure for the entire first half.\nThe hosts dominated possession, playing fast free-flowing football, and visiting goalkeeper Rohan Ferguson was forced into a fifth-minute save when he pushed away an effort from Nazmi Gripshi, with a penalty appeal for a subsequent challenge in the area being turned down.\nLarne then failed to deal adequately with a low cross from the right, which was only half-cleared, Ferguson again being called upon to palm away a blistering shot from the in-rushing Gripshi.\nThe home side were awarded a penalty in the 25th minute when the lively Gripshi was brought down by a sliding challenge from Craig Farquhar, who started the game in place of the injured Cian Bolger.\nRrahmani made no mistake from the spot, firing confidently into the bottom left-hand corner of the net despite the despairing dive of Ferguson.\nBallkani earned further reward for their superiority when Gripshi provided the killer through ball into the path of Kryeziu, the winger taking a good first touch and dispatching a drive past the advancing Ferguson.", "url": "https://www.bbc.com/sport/football/66295697"}