{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 07:35:06", "date_modify": "2025-05-21 07:35:06", "date_publish": "2025-01-22 11:58:13", "description": "'Dundee fans dare to dream about Scottish Cup run'", "filename": "sport_articles_c5y2qg78ngeo_1747812906.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6742/live/7eb8ec30-d8a0-11ef-9fd6-0be88a764111.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5y2qg78ngeo_1747812906.html", "title": "'Dundee fans dare to dream about Scottish Cup run'", "title_page": "'Dundee fans dare to dream about Scottish Cup run'  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There is no doubt Dundee have made massive progress since Tony Docherty arrived at the club in the Summer of 2023.\nBut one word that has reared its head from time to time has been '\"consistency\" or a lack of it.\nWhile much has been achieved on Docherty's watch, a failure to put a real run of results together has been something which has often been noted.\nHowever, they certainly appear to have solved that conundrum.\nThe Dark Blues are currently on a run of just one defeat in six games across all competitions, a sequence which has seen them win three times and draw twice against the Old Firm.\nIf they can maintain these sort of levels then you would fancy they have every chance of improving on last season's top six Premiership finish.\nAnd having landed what many would see as a favourable Scottish Cup fifth round draw – at home to Airdrieonians - the Dens Park faithful may just also be starting to dare to dream about reaching the latter stages of that competition.\nBefore a ball was kicked in the half dozen games I have highlighted above, there would have been those looking at those fixtures perhaps questioning how injury ravaged Dundee would fare.\nWell the team has certainly stepped up to the plate and delivered.\nDundee's recent progress will be tested to the limits in their next outing – away to Celtic at the weekend – but on the basis of the last few weeks, you wouldn't bet against them going to Parkhead and really making life uncomfortable for the champions, having taking points off them in the City of Discovery last week.", "url": "https://www.bbc.com/sport/articles/c5y2qg78ngeo"}