{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:29:30", "date_modify": "2025-05-21 07:29:30", "date_publish": "2025-01-22 08:43:30", "description": "Glentoran owner Ali Shams Pour is expecting \"one or two more\" arrivals at the Oval during the January transfer window.", "filename": "sport_articles_cr53829lm09o_1747812570.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2420/live/af19eaa0-d896-11ef-9567-af1f21102465.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cr53829lm09o_1747812570.html", "title": "Glentoran: More January signings 'highly likely' at the Oval says owner Ali Shams Pour", "title_page": "Glentoran: More January signings 'highly likely' at the Oval says owner Ali Shams Pour - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran owner Ali Shams Pour is expecting \"one or two more\" arrivals at the Oval during the January transfer window.\nThe east Belfast outfit won their first trophy since the 2020 Irish Cup when beating Larne on penalties to secure the County Antrim Shield on Tuesday night.\nFormer Waterford winger Christie Pattisson, who joined the club this month, hit the winning spot-kick at Seaview, while Shane McEleney and Ciaran Coll have also been recruited during this window.\nAnd Pour is anticipating more business in the days to come as he seeks to bolster a squad that are now unbeaten in 11 games in all competitions.\n\"We're in talks with quite a few players,\" he said.\n\"There's nothing confirmed yet but one or two more are highly likely.\"\nAfter an inconsistent start to the year, the Glens are up to third in the Irish Premiership, although 16 points behind leaders Linfield, and they face a sixth round Irish Cup tie against the Blues on 31 January.\nThey will also take on Cliftonville in the BetMcLean Cup final in March.\nPour credits manager Declan Devine with \"transforming the club\" since his arrival last March and is already hoping their Shield success can be a \"catalyst\" for more silverware this season.\n\"He's come in and restructured the whole thing,\" he said of the former Derry City and Bohemians boss.\n\"It's such a hard thing to do. He's done a phenomenal job.\n\"He's here for a long, long time. I can see us doing a lot of good things together.\n\"We're very strong contenders for both cups and maybe the league as well. That won't be easy, but the two cups for sure.\"", "url": "https://www.bbc.com/sport/articles/cr53829lm09o"}