{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-05-21 03:54:30", "date_modify": "2025-05-21 03:54:30", "date_publish": "2025-01-15 11:27:58", "description": "Dundee United: 'Do Tangerines stick or twist in January?'", "filename": "sport_articles_c4gpx7q7r9do_1747799670.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/624f/live/035a7f30-d333-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c4gpx7q7r9do_1747799670.html", "title": "'Do Tangerines stick or twist in January?'", "title_page": "Dundee United: 'Do Tangerines stick or twist in January?' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At the halfway stage of the January transfer window, Dundee United perhaps face the dilemma of whether they stick or twist.\nBy 'stick', I mean do they stay with the squad that has served them so well so far this season - sitting third in the Premiership, well be beyond all the Tannadice club's pre-season expectations.\nAnd they have achieved such lofty heights despite being shorn of several key players for periods of the campaign.\nSo one could argue that if it isn't broken, why fix it.\nBut, the 'twist' argument is a strong one too.\nWhile the season may have a long way to run, one thing that is abundantly clear is that third place - and the financial, European and prestige trappings that come with it - is very much in their hands.\nSo do they push the boat out and bolster their squad with a few reinforcements in a bid to try and strengthen their bid to secure such riches?\nYes, manager Jim Goodwin has had to cut his cloth budget wise since he came into the club - and what a fine job he has done so far against that backdrop.\nBut will the United hierarchy be tempted to loosen the purse strings a little bit more as they chase what are now very-much-within-reach financial rewards?\nI guess we will find out over the coming weeks as we countdown to the closure of this transfer window.", "url": "https://www.bbc.com/sport/articles/c4gpx7q7r9do"}