{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:36:17", "date_modify": "2025-05-21 04:36:17", "date_publish": "2025-01-18 00:00:00", "description": "Coventry City extend their unbeaten home run in the Championship to six games with a narrow victory against play-off-chasing Bristol City.", "filename": "sport_football_live_cx2m8xrnn8yt_1747802177.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cx2m8xrnn8yt_1747802177.html", "title": "Coventry City 1-0 Bristol City: Brandon Thomas-Asante gives Sky Blues win", "title_page": "Coventry City 1-0 Bristol City: Brandon Thomas-Asante gives Sky Blues win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City extended their unbeaten home run in the Championship to six games with a narrow victory against play-off-chasing Bristol City.\nBrandon Thomas-Asante's powerful second-half finish was enough to give Frank Lampard's side all three points in a game of few clear-cut chances.\nThe Sky Blues – who also made it three consecutive home league clean sheets for this first time this campaign – move up to 14th in table.\nDefeat for Bristol City, just their second in eight league games, means they remain in ninth and four points off sixth-placed West Bromwich Albion.\nEight points and seven places separated these two sides at kick-off, but there was little to choose between a pair of teams currently fighting for different ambitions this Championship season.\nThe highlight of a quiet opening 45 came early on, when Nahki Wells found himself clean through for the visiting Robins, only for Oliver Dovin to stand firm in the home goal.\nAt the other end, Victor Torp and Milan van Ewijk were both unable to direct efforts on target, the former from just outside the 18-yard box, the latter from close range after firing a shot down into the ground.\nThere was more to keep the 26,000+ in the Coventry Building Society Arena entertained after the break, and there were some nervous moments for the home crowd to sit through as first Scott Twine and then Wells had shots blocked for the visitors.\nEllis Simms set up Jack Rudoni for Coventry after the break, but the midfielder could not adjust his feet in time to trouble Max O'Leary.\nSimms then had a sight of goal for himself, but was unable to hit the target.\nThe eventual winner was one of real quality from Thomas-Asante, who smashed home via the underside of the crossbar from a narrow angle after being played through by Rudoni – a first goal for the former West Brom forward since October.\nHome keeper Dovin was called into action again to prevent Sam Bell levelling things up, while Max Bird fired over as the visitors searched for the equaliser.\nJamie Allen could have made the game safe for Lampard's side, only for O'Leary to deny him.\nThe clean sheet was just the sixth of the league season for Coventry – who avoided a repeat of their previous two games, where they conceded twice in injury time against Norwich last time out in the league, before shipping a late equaliser in last week's FA Cup tie with Sheffield Wednesday.\nBristol City boss Liam Manning told BBC Radio Bristol:\n\"It was a frustrating afternoon, and a difficult game. The pitch played terribly, but in a nutshell, we didn't take our chances and they took theirs.\n\"I thought we had the better opportunities, we found it difficult quality-wise at times, but you have to try and still come away with something.\n\"There are a lot of games still to go and it is up to us to hit the levels we are capable of. There was nothing wrong with the team giving everything today, but the quality was not where it needed to be.\n\"We have to adapt in these scenarios to find a way and execute - we gave away a bit of a soft goal and that was the frustration.\"", "url": "https://www.bbc.com/sport/football/live/cx2m8xrnn8yt"}