{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:29:31", "date_modify": "2025-05-21 05:29:31", "date_publish": "2025-01-31 17:50:49", "description": "Match preview, team news and key stats as defending Six Nations champions Ireland host England in Dublin.", "filename": "sport_rugby-union_articles_cwywv1wldx2o_1747805371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5dd3/live/ad9cba50-e006-11ef-a319-fb4e7360c4ec.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cwywv1wldx2o_1747805371.html", "title": "Six Nations 2025: Ireland v England preview, kick-off time, team news & match facts", "title_page": "Six Nations 2025: Ireland v England preview, kick-off time, team news & match facts - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ireland's bid to become the first side to win three successive outright titles in the long history of this championship gets under way on Saturday against an England team that halted their bid for back-to-back Grand Slams last year.\nThe Irish were below their best in the autumn and are now without head coach Andy Farrell for this tournament because of his Lions commitments, so Simon Easterby is in interim charge.\nEngland, led by new captain Maro Itoje, will be desperate to improve on a 2024 in which they lost seven of their 12 matches, albeit all by small margins.\nSince winning the last of their Six Nations titles in 2020 the Red Rose have finished fifth, third, fourth and third and of their nine wins from 20 matches in that time, four have been against Italy.\nIreland interim head coach Simon Easterby: \"It wasn't easy selecting a squad for this week's game given the quality of those who haven't made the final 23.\n\"Credit to those who missed out on selection for this game, there was obvious disappointment but they all stepped up brilliantly to help prepare the team this week.\n\"England are a talented squad with quality across their panel and we know that we will need to hit the ground running to deliver a winning performance.\n\"We're ready for the challenge and excited to get going.\"\nEngland head coach Steve Borthwick: \"You talk about the Six Nations, is it 10 million people watching it on TV?\n\"You'll have people sitting on their sofas at home with their England shirts on, hopefully jumping up and down.\n\"Hopefully they're going into work on a Monday morning feeling six inches taller because of the way their team played. That's what we want to bring.\"\nSara Orchard: England's victory over Ireland in last year's Six Nations did a lot of heavy lifting for their reputation across a difficult year.\nThis time, though, the fixture is in Dublin and the prospect of a recording-breaking third Six Nations title in a row could spur the Irish to start with a bang.\nThe home side are favourites and are packed with familiar faces that are already gracing some fantasy British and Irish Lions sides ahead of the summer.\nHowever, a stuttering autumn campaign and continuing debate surrounding the future of the number 10 jersey has convinced some they could be vulnerable.\nAs for the visitors, England are yet to find a way of closing out fixtures from winning positions. The selection of the Curry twins will excite fans, as will the introduction of Tom Willis from the bench.\nMeanwhile, a new captain, who is expected to go the whole 80 minutes, is part of the plan to turn near-misses into convincing victories.", "url": "https://www.bbc.com/sport/rugby-union/articles/cwywv1wldx2o"}