{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:49:51", "date_modify": "2025-05-21 07:49:51", "date_publish": "2025-05-18 17:21:00", "description": "Leicestershire beat Middlesex by seven wickets in the County Championship to take their first red-ball victory at Lord's in 45 years.", "filename": "sport_cricket_articles_cm23yx7z44xo_1747813791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cd38/live/16767800-340c-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cm23yx7z44xo_1747813791.html", "title": "County Championship: Middlesex v Leicestershire", "title_page": "County Championship: Middlesex v Leicestershire - Foxes win to break Lord's duck - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Three wickets apiece for seamers Logan van Beek and Ben Green set up Leicestershire's first red-ball victory at Lord's in 45 years, flattening Middlesex to strengthen their position as County Championship Division Two front-runners.\nVan Beek took 3-28 – including two wickets in as many balls – while Green's 3-32 also played a pivotal role in ensuring the home side were dismissed for 143 in their second innings.\nMiddlesex collapsed after Sam Robson and Max Holden's opening stand of 51, losing six wickets for 34 despite Luke Hollman's defiant knock of 42.\nThat left the Foxes hunting a modest victory target of 102 and they got there with three wickets down, skipper Peter Handscomb hitting the winning runs off Hollman to secure his side's fourth win in six games.\nVan Beek's initial spell in the morning was on the costly side, with Robson picking him off three times to the short leg-side fence as he and Holden wiped out their 32-run overnight deficit without loss.\nBut changes of bowling at both ends brought Leicestershire success, with Robson pinned in front by a Green delivery that seamed back at him, although Tom Scriven's successful lbw shout against Holden might have been missing leg stump.\nHollman began his innings brightly, crunching Green through the covers for four, but Middlesex soon became bogged down and their lack of runs eventually gave way to a clatter of wickets.\nDespite avoiding a pair, Leus du Plooy never looked entirely comfortable and was trapped leg before as Van Beek got one to straighten before Ryan Higgins flashed hard at the next and Peter Handscomb clung on at second slip.\nMiddlesex struggled through to lunch at 79-4, but their prospects continued to deteriorate after the interval as Ian Holland drew Ben Geddes into an edge to slip and Van Beek bamboozled Jack Davies with a ball that took out his off stump.\nHollman's boundary off Van Beek was the first in well over an hour of play, but Zafar Gohar quickly added another, thumping Josh Hull to the rope beyond mid-off to lift his side's total into three figures.\nThe seventh-wicket pair ground out a dogged partnership of 40 before Green returned to dismiss both Gohar and then Hollman in identical fashion, jagging the ball back to hit the top of middle and off.\nA brisk undefeated 16 from Toby Roland-Jones hauled Middlesex's slender lead just above 100 before leg-spinner Rehan Ahmed mopped up the tail with two wickets from successive deliveries.\nSol Budinger launched Leicestershire's pursuit with gusto, clubbing Dane Paterson for two boundaries in a quickfire 25 before dragging onto his leg stump, while Holden's well-judged catch over his shoulder as he ran back from cover accounted for Rishi Patel.\nRehan also departed, caught behind off Middlesex's teenage debutant Naavya Sharma, but it was not enough to derail the Foxes as Handscomb and Lewis Hill steered them across the line.", "url": "https://www.bbc.com/sport/cricket/articles/cm23yx7z44xo"}