{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:08:54", "date_modify": "2025-05-21 05:08:54", "date_publish": "2025-04-05 00:00:00", "description": "Barcelona extend lead at top of La Liga to four points despite Real Betis draw.", "filename": "sport_football_live_cvgpl7y0ep0t_1747804134.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d3b0/live/7e3e4330-1262-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cvgpl7y0ep0t_1747804134.html", "title": "Barcelona 1-1 Real Betis: Barca extend lead at top of La Liga despite draw", "title_page": "Barcelona 1-1 Real Betis: Barca extend lead at top of La Liga despite draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona moved four points clear of rivals Real Madrid at the top of La Liga despite being held to a draw at home by Real Betis.\nHansi Flick's side will be disappointed, though, that their dominant performance did not result in victory as their seven-match winning run in all competitions was ended by the disciplined visitors.\nSome brilliant one-touch football sent midfielder Gavi through in the seventh minute and the 20-year-old opened the scoring for the hosts with a composed finish from a tight angle.\nBut Betis were level 10 minutes later as defender Natan headed home Giovani lo Celso's corner.\nFull-back Jules Kounde had Barca's best chance to retake the lead when his strike from close range on his weaker foot was saved by the body of Betis goalkeeper Adrian midway through the second half.\nA draw also ended the visitors' own four-match winning run as in-form forwards Cucho Hernandez and Manchester United loanee Antony failed to fire.\nEarlier on Saturday, Real Madrid were sunk by a 95th-minute Valencia winner as they lost to Los Ches for the first time since 2008.\nBarcelona next host Borussia Dortmund in their Champions League quarter-final first leg on Wednesday.", "url": "https://www.bbc.com/sport/football/live/cvgpl7y0ep0t"}