{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-05-21 07:17:52", "date_modify": "2025-05-21 07:17:52", "date_publish": "2025-05-20 09:38:13", "description": "Ross County fan voice: 'Staggies must make their play-off experience count'", "filename": "sport_articles_cy0jjnqeynno_1747811872.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e655/live/c24c0270-355c-11f0-96c3-cf669419a2b0.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy0jjnqeynno_1747811872.html", "title": "Ross County fan voice: 'Staggies must make their play-off experience count'", "title_page": "Ross County fan voice: 'Staggies must make their play-off experience count' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ross County face the Premiership play-off for the third consecutive year following a bitterly disappointing end to the season.\nAt the start of March, Don Cowie's side moved on to 35 points after a 1-0 victory over Kilmarnock and looked like a contender for a top-six place.\nTwo months and nine matches later, the Staggies have only picked up a further two points and slid down the table to finish 11th for the third season in a row.\nAlong with the dramatic loss of form, injuries to key players have hampered Don Cowie's ability to make tactical or personnel changes during matches.\nIn the 1-1 draws against Dundee and Motherwell in the final two league matches, County were by far the better team in the first half but failed to match those performance levels after the interval when their opponents made changes to provide a different dynamic and threat.\nNow play-off opponents Livingston will be desperate to take advantage of County's frailty and secure their place back in the Premiership.\nLivingston have already got the better of Cowie's side this season, winning 3-2 after extra time in the Scottish Cup in January, so they'll take a lot of confidence from that result as well as their recent run of form of six victories in seven matches.\nThere's plenty of play-off experience among the County squad following the wins over Raith Rovers and Partick Thistle in previous seasons, so they'll need to step up once again to show the character and quality required to secure their Premiership status.", "url": "https://www.bbc.com/sport/articles/cy0jjnqeynno"}