{"authors": ["Jay Freeman", "www.facebook.com"], "date_download": "2025-05-21 04:19:33", "date_modify": "2025-05-21 04:19:33", "date_publish": "2025-04-05 15:34:46", "description": "Hull KR reach the Challenge Cup semi-final having beaten city rivals Hull FC in a thrilling derby despite losing influential half-back Mikey Lewis to injury.", "filename": "sport_rugby-league_articles_c9347gd32ezo_1747801173.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/932c/live/e6bff120-1239-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_c9347gd32ezo_1747801173.html", "title": "Challenge Cup: Hull FC 16-32 Hull KR", "title_page": "Challenge Cup: Hull FC 16-32 Hull KR - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull KR reached the Challenge Cup semi-final after beating city rivals Hull FC in a thrilling derby despite losing influential half-back Mikey Lewis to injury.\nAfter a cagey opening 15 minutes, during which Lewis limped off, the Robins led when Tom Davies went in at the corner.\nJoe Burgess added to their tally moments later and Jack Broadbent gave them a three-try advantage at the break, with Burgess again registering after their return for the second half.\nLewis Martin and Herman Ese'ese touched down to get Hull FC going after Jez Litten had added a try to his goal tally but KR held out to ensure a stunning derby win at the home of their rivals despite Zak Hardaker's late cameo.\nKR occupy top spot in Super League and FC are currently second, which promised a thrilling quarter-final tie on paper, yet both sides looked off the boil in a sketchy opening 10 minutes filled with unforced errors.\nThe visitors were dealt a huge blow after just a quarter of an hour as talismanic half-back Lewis limped off the field with what appeared to be a groin injury.\nRather than resting on their laurels, KR powered on after Lewis headed straight down the tunnel and almost led moments after his exit as Litten sailed a tricky long-range kick just wide of the post.\nThey kept up the pressure and were rewarded when Davies dived in at the corner at the conclusion of a flowing lateral move - and the visitors wasted no time in adding to their advantage as Burgess squeezed through minutes later.\nHull KR virtually looked out of sight just before the half-time hooter as Broadbent went over after some impressive build-up play from Peta Hiku and Sam Luckley.\nBurgess' second came after Hull FC's Jack Ashworth cheaply lost possession and the visitors added insult to injury as Litten - who had come on as a substitute - brought his scoring count to 30 for the afternoon with a fine try.\nBut FC began a late fightback when Martin crossed at the corner from Jordan Rapana's fine offload and they were over again when Ese'ese powered in next to the sticks to set up a highly-charged finale.\nHull KR twice could have wrapped up a thumping derby win in style - first when Tyrone May touched down in front of the travelling supporters before his score was chalked off for a knock on in the build-up, and again when Burgess went over for what could have been a hat-trick try were it not for an obstruction on FC debutant Will Pryce.", "url": "https://www.bbc.com/sport/rugby-league/articles/c9347gd32ezo"}