{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 06:17:46", "date_modify": "2025-05-21 06:17:46", "date_publish": "2025-02-08 13:00:54", "description": "From broken collarbones to national team dreams - Penrice's rise to Hearts stardom", "filename": "sport_articles_cpql3778n89o_1747808266.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/464a/live/6b2a7ee0-e61a-11ef-8f4e-69ca3422ff89.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cpql3778n89o_1747808266.html", "title": "From broken collarbones to national team dreams - Penrice's rise to Hearts stardom", "title_page": "From broken collarbones to national team dreams - Penrice's rise to Hearts stardom - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "James Penrice has been the standout performer for Hearts in what has been, until recent weeks, a turbulent campaign for the Tynecastle club.\nThe 26-year-old defender made the move to Edinburgh in the summer after the expiration of his contract with Livingston and made his competitive debut in the opening game of the season against Rangers which they drew 0-0.\nPenrice says he became aware of Hearts interest in early January last year when they met Livingston in the Premiership.\n\"I hit a good bit of form just before January and I knew I was going to leave but Livingston had offered me another deal,\" Penrice said.\n\"I had to say to David [Martindale] I'm not going to sign it, which he wasn't too pleased with, but he quickly understood.\n\"Then we played Hearts on 2 January. As I'm walking around the pitch, Naisy [Steven Naismith] pulled me aside and basically said that he'll be speaking to me soon. Then after the game there, Clare [Cowan] from the club came up to me and asked what was going on with me and if I'd signed a pre-contract anywhere.\n\"At that point I wasn't really thinking and then they got in touch with my agents. There was talks at other clubs, my agent was talking to a few, but as soon as Hearts was in the pipeline, it was the only decision for me.\"\nPenrice was brought up in Livingston and was a pupil at Meldrum Primary but all he wanted to concentrate on was his football.\n\"My primary school and high school were kind of taken over by what I was doing in my football career,\" Penrice added.\n\"At that time, your club wouldn't really let you play with your school, so it was never a big thing for me.\n\"It was almost a relief when I actually left a couple of clubs and I managed to get to play for the school. My school was the usual black ash pitch. I broke my collarbone on it playing football at lunch.\n\"It was just a really, really good school to be at and it only helped my love for football really. It was kind of just my wait until the bell goes for either break or lunch and then eat as quick as you can and then run outside.\n\"It was a real bad day when it used to rain and we weren't allowed outside. It was like all the kids just sitting in the window looking at the football pitch.\n\"They let us on as much as possible. As I say, I've got probably a couple of cuts on my body from that time, even that early in my life\"\nThe next step for Penrice is the national team.\nThe defender has never before featured at international level at any age group but admits it's one of his burning ambitions in the game.\n\"I think I got maybe in one provisional squad when I was at Thistle but that was the closest I got,\" he said.\n\"It's definitely a dream of mine but I'm under no illusion that the left-back slot at Scotland is a tough gig.\n\"My main focus is to get in and help Hearts. If that was to come in the future, that'd be brilliant.\n\"It's anybody's dream to play for their country. So I'd be thrilled if it happened but I'm not under no illusion that the squad's incredible right now.\"", "url": "https://www.bbc.com/sport/articles/cpql3778n89o"}