{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:24:28", "date_modify": "2025-04-26 04:24:28", "date_publish": "2025-03-03 12:42:06", "description": "Former Wales captain Kevin Ratcliffe says Aaron Ramsey is helping bring the best out of Rubin Colwill after being given the chance to combine in Cardiff City's midfield.", "filename": "sport_football_articles_cgj580xq330o_1745641468.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cf47/live/668805c0-f82a-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgj580xq330o_1745641468.html", "title": "Aaron Ramsey and Rubin Colwill partnership 'brilliant' says Kevin Ratcliffe", "title_page": "Aaron Ramsey and Rubin Colwill partnership 'brilliant' says Kevin Ratcliffe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Former Wales captain Kevin Ratcliffe says Aaron Ramsey is helping bring the best out of Rubin Colwill after being given the chance to combine in Cardiff City's midfield.\nWales captain Ramsey is starting to put his injury issues behind him with his performances for the Bluebirds.\nHis FA Cup outing in the fifth round defeat at Premier League Aston Villa was just his third start since a five-month injury lay-off, with Cardiff manager Omer Riza admitting he is now able to ask more of the ex-Arsenal star.\nThe 34-year-old lined up alongside fellow Wales international Colwill in midfield at Villa Park, catching the eye in tandem as they did in the 1-1 Championship draw at Plymouth Argyle the previous weekend.\nAs well as Ramsey's obvious influence being a welcome boost for Cardiff's bid to avoid Championship relegation, Colwill has also looked more effective as a result.\n\"I was really surprised by the pairing which I wouldn't have thought of ever playing them together – but it worked brilliantly,\" said Ratcliffe.\nRiza, having rested Ramsey for the win over Hull City a week ago, says he is increasing the responsibility on the player who wore the armband at Villa as Cardiff look to find consistency in their final 12 games of a difficult season.\n\"He is playing a big part in the team and the club and it was nice to see him out there,\" said Riza.\n\"He did things with control and I can ask him to do a bit more, have a bit more ownership in the performance and he did that.\"\nRamsey played 60 minutes at Villa prior to Tuesday's visit of promotion-seeking Burnley, while there are hopes the playmaker can be fully into his stride by the time Wales' World Cup qualifying campaign begins later this month.\nWith Ethan Ampadu set to miss the games against Kazakhstan and North Macedonia through injury, Ramsey's availability would be a big boost to manager Craig Bellamy.\nRatcliffe suggested he could also help fill the void left by injury to Fulham's Harry Wilson, while adding that Colwill is also putting his hand up after recent omissions from the senior squad.\n\"The responsibility of playing deeper is completely different - you can't gamble as much as you can when you play further forward,\" Ratcliffe told BBC Radio Wales Sport.\n\"Aaron has that talent to play that pass - but some of the passes Colwill played [at Villa] were second to none and it was lovely to see that he's come on and looks as though he's maturing.\n\"But he has to make that place his own in the Cardiff side, stamp his authority in the team first before he starts thinking of playing for Wales.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgj580xq330o"}