{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:39:18", "date_modify": "2025-04-26 03:39:18", "date_publish": "2025-03-04 21:04:18", "description": "Liverpool are considering a move for AC Milan forward Rafael Leao, Liverpool striker Darwin Nunez was blocked from leaving in January and Manchester City are targeting Leicester's teenage sensation Jeremy Monga.", "filename": "sport_football_articles_czx7wy357dgo_1745638758.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a5be/live/e90df6b0-f949-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czx7wy357dgo_1745638758.html", "title": "Football gossip: Liverpool rival Barcelona for Rafael Leao, but Darwin Nunez had January move blocked", "title_page": "Football gossip: Liverpool rival Barcelona for Rafael Leao, but Darwin Nunez had January move blocked - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Liverpool consider move for Rafael Leao, Darwin Nunez departure blocked and Manchester City target Leicester City teenager.\nLiverpool are considering an approach for Portugal international Rafael Leao, 25, but the AC Milan forward is also wanted by Barcelona. (Teamtalk), external\nBayern Munich have reduced their asking price for Arsenal target Kingsley Coman, 28, as they look to offload the France forward in the summer. (Bild - in German), external\nUruguay striker Darwin Nunez, 25, told Liverpool he was unhappy and wanted to leave in January but a switch to Saudi Pro League club Al-Hilal was blocked. (Football Insider), external\nTottenham believe they are in the driving seat to sign English midfielder Tyler Dibling, 19, who is unhappy with the new contract offered by Southampton. (Talksport), external\nManchester City want to bring in Leicester City's Jeremy Monga but will have to go through a tribunal to agree a compensation fee for the 15-year-old English winger. (Sun), external", "url": "https://www.bbc.co.uk/sport/football/articles/czx7wy357dgo"}