{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:48:08", "date_modify": "2025-05-21 07:48:08", "date_publish": "2025-05-18 18:39:25", "description": "Lancashire build a lead of 285 over Derbyshire on day three of their County Championship match at Old Trafford.", "filename": "sport_cricket_articles_cg5vdn2079qo_1747813688.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/45c7/live/199c2100-3417-11f0-8a73-259bc31e359b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cg5vdn2079qo_1747813688.html", "title": "County Championship: Lancashire to set Derbyshire tough target", "title_page": "County Championship: Lancashire to set Derbyshire tough target - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The final day of this County Championship match at Emirates Old Trafford looks set for an intriguing finish after Lancashire had ended the third evening on 141-6 in their second innings, giving them a lead of 285 and an opportunity to set Derbyshire a target early on the final day.\nBrooks Guest's 77 had helped the visitors avoid the follow-on during an afternoon when James Anderson could add only one more wicket to the two he took on Saturday.\nBut Anderson's 3-53 and Tom Hartley's 3-68 were instrumental in Derbyshire being dismissed for 314 in reply to Lancashire's 458, and aggressive batting by the home side, plus a clatter of wickets, has also set up the possibility of a natural conclusion on the last morning.\nThe first session was dominated by Derbyshire's batsmen who scored 93 runs for the loss of two wickets. In particular, the morning was a triumph for the nightwatchman, Jack Morley, who made a career-best 41 against his former county.\nHe looked in little trouble during his 116-minute innings until six overs before lunch when he chipped a low catch to Keaton Jennings at short mid-wicket off George Balderson.\nGuest and Morley added 76 for their side's fifth wicket but Martin Andersson survived only three balls from Balderson before being incontrovertibly lbw to the fourth for nought.\nAndersson's dismissal was the only serious setback the visitors suffered and they reached the first interval on 205-6 with Guest on 53 and Anuj Dal unbeaten on 16.\nThe afternoon's cricket began far less pleasantly for Derbyshire. They first lost Dal, who had added only three to his lunchtime score when he carelessly cut Tom Hartley to Anderson Phillip. The vital scalp of Guest was then claimed by the occasional off-spinner, Josh Bohannon, who turned a ball inside the batsman's drive, thus taking his first wicket since 2021.\nGuest's dismissal for 77 left his side on 236-8, still 222 runs in arrears, but the resilience of Derbyshire's lower-order batting was demonstrated once again as Zak Chappell and Ben Aitchison added a further 68 runs for the ninth wicket, thereby taking their side to within five runs of saving the follow on.\nAnderson was recalled but conceded four boundaries in his two overs, with the last of these, Blair Tickner's off-driven four, ensuring that Derbyshire saved the follow-on.\nIn the midst of this rough treatment, the former England bowler had Chappell caught at short leg by George Bell for 24 and Aitchison was the last man dismissed when he was caught at midwicket by Bell off Hartley for 45, an innings that had included a four and two sixes off three successive balls from Wells.\nLeft with 33 overs to extend their advantage, Lancashire batsmen went on the attack and lost six wickets in the process. Jennings was caught at third man by Andersson off Tickner for 33, Bohannon made two before skying Morley to Zak Chappell, running back from mid-on and Marcus Harris managed only a single before edging Aitchison to Guest, who took a superb full-length catch.\nWells followed his hundred in the first innings with a half-century off 65 balls but was bowled next ball for 50 by Morley, who took his third wicket of the innings when he caught and bowled Bell for two. And there was further success for Derbyshire two overs before the close when David Lloyd dived full length to take a brilliant catch off Hartley, who made two.", "url": "https://www.bbc.com/sport/cricket/articles/cg5vdn2079qo"}