{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:44:54", "date_modify": "2025-04-26 06:44:54", "date_publish": "2025-03-02 00:00:00", "description": "Follow live coverage of the WSL as Manchester United host Leicester City plus radio & text updates from five other fixtures.", "filename": "sport_football_live_cew5w4r5y9lt_1745649894.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f761/live/35cf6a50-f798-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cew5w4r5y9lt_1745649894.html", "title": "WSL LIVE: Six fixtures", "title_page": "WSL LIVE: Six fixtures - radio, text & score - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "'The support from the fans kept us believing'\nFT: Arsenal 4-3 West Ham\nArsenal\nArsenal boss Renee Slegers speaking to Sky Sports: \"I was saying before that we pride ourselves on clean sheets and being solid to beat defensively, so we put ourselves in a situation that we have not been in before as a team since I was here.\n\"I am very proud of the way that the girls kept calm and composed, found the solutions and kept digging in - I think it shows great strength and character. That is why we are stood here with a win.\n\"When we had positive momentum we were able to capitalise on it in the second half. This game gives us positive feedback on how to deal with hard times.\n\"They had a very tall team on the pitch today. They are strong on set pieces. The pitch was very hard too so that made it hard for us to play. Part of it was the pitch and part of it was us letting the ball in central areas too much where the space was in the wide areas. The ball was in spaces for them to turn it over and counterattack.\n\"I am happy to hear [the players believed in the team] because it is important for them to believe in what we do. As a player it is easier to believe because you can influence it on the pitch and impact what is happening. Also the support from the fans kept us believing. They kept calm and kept supporting.\"\n'We were not prepared to let anything go'\nFT: Arsenal 4-3 West Ham\nWest Ham United\nWest Ham boss Rehanne Skinner speaking to Sky Sports: \"I thought first half we capitalised on our chances really well, showed our pace, got in behind and our set play deliveries were really good. We were not prepared to let anything go, fighting for everything and got goals out of the game. They weren't expecting us to play in a back five and we did it really, really well. I am proud of the players' efforts today.\n\"There was a chaotic moment where I thought there was a lot of direct play from Arsenal and we didn't clear our lines well enough. Unfortunately, the ball kept dropping to them and we did not deal with it. I need to see the third goal back because I'm pretty sure it didn't cross the line, it is important to look back at that. We didn't quite see out that section of the game and that is where it got away from us.\n\"There were so many fouls today that were not given. There are a lot of question marks over that. There was also a pull back on the edge of the box as we were about to shoot and it wasn't given. It is what it is.\n\"We scored three fantastic goals and caused a lot of problems. There are a lot of positives for us to take out of the game heading into Wednesday night.\"\n'I never thought we were going to lose'\nFT: Arsenal 4-3 West Ham\nArsenal\nArsenal defender and Player of the Match Leah Williamson speaking to Sky Sports: \"This sounds cliche but I never thought we were going to lose. We were just getting frustrated in the first half but I thought we would turn it around. We could have moved things a lot quicker and conceding the third goal made it bit harder for ourselves.\n\"Chloe [Kelly] was unbelievable today and when you need an injection of something she has a bit of bite about her. We needed that today to turn things around.\n\"We practice those [corners] all the time. West Ham had 110 corners and they had not conceded yet this year and I was focused on turning that around today. Chloe put the ball on my head.\"\n'The main thing is that we didn't lose'\nFT: Brighton 2-2 Chelsea\nChelsea\nChelsea captain Millie Bright speaking to Sky Sports: \"Every game has been tough. As players we ahve never underestimated any team we have come up against. While some games look easier than others, they are all difficult in their own ways.\n\"It was a sloppy start today, we didn't find our momentum until the second half. If we start the way we finished the game then we would be in a different position.\n\"[Brighton] they are unbeaten at home for a reason, a tough team to play and a tough ground to come to. The main thing is that we didn't lose and we had the mentality to come back and fight and get a point. We could have finished it with a win but we weren't ruthless enough in the final third.\"\n\"At half time we were not in the position that we are usually in or that we want to be in. You have to stay switched on at that point with 45 minutes left to play. We knew we had players that could come on and impact the game and that we had so much more to give.\n\"Our mentality was to win and we could have done that, we just didn't have the final pass or finish. We dominated and we were in their half pretty much the whole time.\"\nOn Naomi Girma: \"I have always said she is a class person, a nice person to have in the changing room. Her qualities on the pitch are great, she is a player who we have not had before, different style and to have that variety is great.\n\"It was a tough game to come into but she is more than capable and I think she did great. It was nice to finally have her on the pitch. There was a lot of pressure for her make the return but she is delighted to get that debut.\"\n'In the first half our intentions were not good enough'\nFT: Brighton 2-2 Chelsea\nChelsea\nChelsea boss Sonia Bompastor speaking to Sky Sports: \"It is frustrating in terms of the result. I just said to my players that they needed to start the game with the same intention that we showed in the second half. I think we had some troubles in the first half because our intentions were not good enough.\n\"This league is very competitive. Brighton made a good start to the game. We scored first but then we were not able to keep the intensity to give them more trouble.\"\nOn half time thoughts: \"Sometimes it is good to possess the ball but then we need to scan and analyse the spaces on the pitch. In the second half we were able to play forward a bit more, made more runs behind the Brighton back line and caused more trouble.\n\"In football it is about scoring goals and being efficient. We scored the first goal but were not in the right mindset to score more.\"\nFatigue after the break: \"It is always difficult after the break, you need to get the players on the same page. Some of them travelled all around the world so it is hard to prepare. But we are Chelsea. With the quality of the players we need to do better than today.\n\"We dropped two points again today and it is important to keep the head up. We have a quick turnaround to Wednesday and we need to be ready for it.\"\nOn Naomi Girma: \"We eeed to assess her tomorrow and maybe do a scan to see what happened with her calf. Never easy for the first game, she needs to find the chemistry with the other players and the rhythm in the league. It is good for her to get the minutes and I hope she will be ready to play again soon.\"", "url": "https://www.bbc.co.uk/sport/football/live/cew5w4r5y9lt"}