{"authors": ["Paul Grunill", "www.facebook.com"], "date_download": "2025-05-20 14:40:21", "date_modify": "2025-05-20 14:40:21", "date_publish": "2023-07-28 10:18:31", "description": "Ahead of a legends fund raising raising match at Rushden & Diamonds, Brian Talbot says managing the original club was a \"golden time\" in his career.", "filename": "sport_football_66332602_1747752021.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EE07/production/_130553906_gettyimages-56037257.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66332602_1747752021.html", "title": "Brian Talbot: 'Rushden & Diamonds raised the bar for non-league football'", "title_page": "Brian Talbot: 'Rushden & Diamonds raised the bar for non-league football' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "As Sheffield United prepare to once again reap the financial benefits of Premier League status, spare a thought for one-time FA Cup opponents Rushden & Diamonds.\nThe Blades can expect a series of full houses at Bramall Lane as the likes of Manchester City, Arsenal, Manchester United and Newcastle come calling over the coming months.\nFor the Diamonds, they just want to raise £25,000 to help tide them over following relegation from Southern League Premier Division Central last season - not even close to a week's wages for a Premier League player.\nTo that end, a legends match will take place on Sunday between players of the original Rushden & Diamonds FC, who once reached the third tier of English football, and the current 'phoenix' club.\nFormer Arsenal, Ipswich and England midfielder Brian Talbot was the man in charge when the Diamonds won a place in the Football League back in 2001 and he will be returning to manage one of the two sides in a game which is part of their 'Save Our Summer' campaign.\n\"I think we raised the bar in England for non-league football,\" Talbot, now 70, told BBC Radio Northampton.\n\"I've been fortunate enough to be involved in football for over 50 years and it was a brilliant time, a golden time for me.\"\nMore than 1,400 tickets have been sold for the game at Hayden Road, home of the 'new' AFC Rushden & Diamonds, who were founded in 2011.\nAnd the two teams will be competing for the Dale Roberts Memorial Cup, named after the former Diamonds goalkeeper who committed suicide in 2010 at the age of only 24.\nThere will be a reunion for several members of Talbot's squad, including Jon Brady, now manager of nearby Northampton Town.\n\"It'll be good to see faces from the past and I'm so pleased Jon Brady has done so well at Northampton with promotion last season. It's fantastic for him,\" said Talbot.\nTalbot's side took on Sheffield United - then in the second tier - in the following season's competition, with the first match at Nene Park and a replay at Bramall Lane both ending as 1-1 draws before the Blades prevailed 6-5 on penalties.\n\"All credit to the players who got us to those ties,\" Talbot recalled. \"We should have beaten Leeds at Nene Park, they'd had a player (Jonathan Woodgate) sent off, we got a corner and we missed a good chance in the last five minutes. Obviously we lost away but they were great nights for the club.\"\nDiamonds won promotion from the Conference in 2001 and after losing out in the Division Three - now League Two - play-offs 12 months later, they went up as champions in 2003 with 87 points from their 46 games.\nTheir spell in Division Two only lasted one season, and Talbot - a member of Ipswich's 1978 FA Cup-winning team - left in March 2004 to take over at Oldham Athletic.\n\"I loved every minute of it and it's a shame it had to end, but that's what happens in football sometimes. Finances got tough and we had to move on, but I thank Mr Griggs and the board of directors for inviting me there and (they) developed a super club,\" he said.\n\"He was a fantastic man, a generous man, he was always very positive, supportive and for the local community it was magnificent what he achieved.\"\nFollowing the collapse of the original club, the new Diamonds began playing in the summer of 2012 and won the United Counties League Premier Division title three years later.\nNext season, though, they will be at step four of the non-league pyramid, playing in Northern Premier League Midlands Division.\n\"Times are hard for all business. Football's no different, and we needed to find some creative ways for the club,\" said current chairman Rob Usher.\n\"This legends day is the centrepiece of 'Save Our Summer', it's the big show. We don't want to go cap in hand to people, we don't just want people to give us money, we want to give them something in return.\n\"We hope Sunday is going to reward everybody who has been a part of the history of Rushden & Diamonds, throughout both clubs.\"\nTalbot also hopes the match will help ease the financial pressures on the club going forwards.\n\"They always had a good fan base,\" he added.\n\"They've moved to a new ground now but (I hope) people can keep it going, because it brings people together, it brings happiness and football clubs in local towns and villages are a big base for everybody.\"\nBrian Talbot was speaking to BBC Radio Northampton's Graham McKechnie and Annabel Amos.", "url": "https://www.bbc.com/sport/football/66332602"}