{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:31:13", "date_modify": "2025-05-21 05:31:13", "date_publish": "2025-04-02 21:27:35", "description": "Rugby Football Union chief executive Bill Sweeney says \"it has not been an easy time personally\" in a letter to clubs after surviving a vote of no confidence.", "filename": "sport_rugby-union_articles_cjdxly29nrno_1747805473.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8543/live/e1f78a70-1006-11f0-a851-e1dd6a174ba8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cjdxly29nrno_1747805473.html", "title": "Bill Sweeney: No confidence vote has 'not been an easy time personally', says RFU chief", "title_page": "Bill Sweeney: No confidence vote has 'not been an easy time personally', says RFU chief - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rugby Football Union chief executive Bill Sweeney says \"it has not been an easy time personally\" after surviving a vote of no confidence last week.\nThe motion, which called for the RFU board to terminate Sweeney's employment, was voted against by 65%.\nThose supporting the motion, such as the referees' union and Championship clubs, had cited various perceived governance failures on Sweeney's watch.\nIn a letter to member clubs, Sweeney says the move took a personal toll but added he is ready to move ahead with a mandate for reform.\n\"The division sowed by those who brought forward the original SGM motion has played out aggressively in the media and it would be remiss of me not to admit that it has not been an easy time for me personally,\" said Sweeney.\n\"However, this role is a privilege and the scrutiny that comes with it is part and parcel of the responsibility.\"\nSweeney, 67, had been widely criticised for taking home £1.1m last year at a time of record RFU losses.\nThe RFU declared £37.9m operating losses last year, only a few weeks after announcing plans to lay off more than 40 staff in the latest round of redundancies.\nA second motion, to expedite governance reform in the English game, was overwhelmingly supported at the meeting.\nLooking to the future, Sweeney continued: \"Ultimately this process will help us to re-engage our membership and push forward changes we have long wanted to implement and our members delivered a clear message that they wanted the leadership team we have here to get on with the job and make improvements.\"\nIn the letter to RFU members, Sweeney listed three areas where change is being prioritised including governance reform, improved communications and more support to grow participation.\n\"It is vital not to lose sight of the many brilliant things happening in rugby and the bright future I fully believe is ahead of us,\" added Sweeney.\n\"We can only do this together and I look forward to a much closer relationship between the Union and all our game's stakeholders in future.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cjdxly29nrno"}