{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:19:28", "date_modify": "2025-05-20 14:19:28", "date_publish": "2023-07-30 00:00:00", "description": "Relive the action as Colombia score a 97th-minute winner to stun former champions Germany at the Women's World Cup.", "filename": "sport_live_football_66183110_1747750768.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37C6/production/_130587241_colombia.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183110_1747750768.html", "title": "FIFA 2023 Women's World Cup LIVE: Germany play Colombia in Group H in the 2023 Women's World Cup", "title_page": "FIFA 2023 Women's World Cup LIVE: Germany play Colombia in Group H in the 2023 Women's World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Post\nHere ends our coverage of the Women's World Cup for today.\nIt's been a rollercoaster, culminating in one of the biggest shocks in the competitions history.\nI'll leave you with some of the colourful and joyous images from Colombia's celebrations.\nWe'll be back tomorrow for more fun and games.\n'Increased professionalism is making game better'\nFT: Germany 1-2 Colombia\nEmma Hayes\nChelsea Women manager on ITV1\nWe've got more professional players all across the world and it these sort of things that are making the tournament more competitive.\nYou see the amount of Colombia players that play in the Spanish league, it is no coincidence [ that the gap between the top teams and developing sides is getting smaller].\nSpecial Caicedo\nFT: Germany 1-2 Colombia\nLinda Caceido is only 18 but her story is already remarkable. She made her international debut when she was 14, was diagnosed with ovarian cancer at the age of 15.\nShe successfully recovered after surgery and was signed by Real Madrid in February. And now she has scored in the first two games of the 2023 World Cup.\nYou can read more about her here.\nAs it stands in Group H\nSo, Colombia move to six points and sit top of Group H all on their own. A point against Morocco in their final group game will seal top spot.\nGermany are second on three points, level with Morocco. The Germans will be favourites to qualify, with their final game coming against South Korea, who have yet to win a point.\nThose games will both be on Thursday at 11:00 BST.\nPost\nGermany 1-2 Colombia\nKatie Smith\nBBC reporter at Sydney Football Stadium\nThe Colombian players begin a lap of honour here in Sydney. They’re being treated like a home side here.\nGermany meanwhile huddle on the near side. The former champions have missed the chance to secure their knockout spot.\nWhat a World Cup this has been already.\n'Exceptional beyond belief'\nFT: Germany 1-2 Colombia\nEmma Hayes\nChelsea Women manager on ITV1\nExceptional beyond belief.\nWe said at half time that Germany had to do something and in the end they didn't do much - flattered to deceive.\nBut Colombia and Caicedo... forget her age, world class. The way she shifts the ball for her goal, sublime feet.\nPost\nFT: Germany 1-2 Colombia\nThe Colombia fans in the stands go wild. On the pitch, subs and staff flood on to embrace their colleagues who have just seen out a big, big win.\nGermany had not lost a World Cup group game since 1995. Colombia had only won one ever until last Tuesday.\nPost\nGermany 1-2 Colombia\nWe've got a stretcher on the field now to carry Jorelyn Carabali off it. A really sad end for her to what is going to be a famous, famous game for her country.\n'Can you believe it?!?'\nGermany 1-2 Colombia\nLucy Ward\nFormer Leeds striker on ITV1\nCan you believe it, can you believe it ??!!\nWhat a header this is, it is all about how much power Vanegas gets on it.\nYou have to be thorough in your marking, and Germany left her on her own there, in the middle of the box.\nWhat a moment.", "url": "https://www.bbc.com/sport/live/football/66183110"}