{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:22:54", "date_modify": "2025-05-21 06:22:54", "date_publish": "2025-03-31 13:59:42", "description": "Man City news: Ruud van Nistelrooy on Erling Haaland's form", "filename": "sport_football_articles_c934yyn7k14o_1747808574.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d5ea/live/06bc0c30-0e38-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c934yyn7k14o_1747808574.html", "title": "Man City news: Ruud van Nistelrooy on Erling Haaland's form", "title_page": "Man City news: Ruud van Nistelrooy on Erling Haaland's form - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Leicester City boss Ruud van Nistelrooy described Erling Haaland as \"a pillar\" in Manchester City's team and \"the best of the best\" when responding to a question about the striker's form this season.\nHaaland has scored 30 goals in all competitions this season in 40 appearances, while last season he netted 38 times in 45 games.\nFormer Premier League striker Van Nistelrooy was asked: \"By his [Haaland's] standards, he's had a difficult season - is it very different as a world class striker to keep that heart and confidence?\"\nVan Nistelrooy replied: \"How many goals did he score so far this season? Yesterday he scored his 30th. Come on.\n\"This is what I mean? 30 goals - he's the best striker in the league. He's proven it. He's won everything possible. He's a class act. He's the best of the best. He has an A mindset, A quality and will continue with that for many more years.\n\"He has signed an extremely long contract and is one City is building around. When you have a guy like that in the building and you're keeping him, you have a guarantee for 30 goals and apparently it's a bad season.\n\"Imagine when he starts to play well - he'll score 60 or 70! He's a pillar in City's current team and in their future, so nothing but praise for him from my side.\"", "url": "https://www.bbc.com/sport/football/articles/c934yyn7k14o"}