{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:11:59", "date_modify": "2025-05-19 15:11:59", "date_publish": "2015-02-27 13:05:57", "description": "Blackpool edge closer to relegation as fellow strugglers Wigan Athletic give themselves hope with a rare win.", "filename": "sport_football_31562249_1747667519.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81312000/jpg/_81312796_malky-getty.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31562249_1747667519.html", "title": "Blackpool 1-3 Wigan Athletic", "title_page": "Blackpool 1-3 Wigan Athletic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Blackpool slipped closer to relegation as fellow strugglers Wigan Athletic gave themselves hope of avoiding the drop with a rare win.\nKim Bo-kyung tapped the Latics into the lead before Harry McGuire headed home Jermaine Pennant's cross.\nWinger James McClean made it 3-0 in the closing stages after slotting past Blackpool keeper Joe Lewis.\nThe hosts did score through Gary Madine but Blackpool are 15 points from safety with 12 matches left.\nWigan, who are one place above bottom of the table Blackpool, remain deep in trouble.\nMalky Mackay's side are nine points from safety but a second win in 11 Championship games at least gives them hope of avoiding relegation to League One.\nThe Latics were on top from the start, with Pennant's corner narrowly evading the head of James Perch who was six yards out at the far post.\nBlackpool's cause was not helped by a serious-looking injury to midfielder Henry Cameron, who was helped off and replaced by Nathan Delfouneso.\nWigan took the lead on the stroke of half-time after profiting on chaotic Blackpool defending, Perch teeing up midfielder Kim to tap home.\nThe hosts looked certain to equalise after 62 minutes when Jamie O'Hara's free-kick was knocked down to Tom Aldred, but his shot from six yards was brilliantly blocked on the line by Emmerson Boyce.\nIt was a crucial moment, with Wigan doubling their lead after 67 minutes when Maguire's header from Pennant's cross was helped into the net by Darren O'Dea on the line.\nWigan made it 3-0 after 79 minutes when McClean slotted past Lewis - triggering a mass exit of home supporters from Bloomfield Road.\nThose disgruntled fans missed Madine tapping home Tony McMahon's cross on 85 minutes.\nBlackpool manager Lee Clark:\n\"It's extremely tough. In terms of the home games and the performances and the results this is the lowest I've been.\n\"It was a great opportunity for us, a big, big opportunity and we blew it. It's another game gone. The gap between us and the other teams has got wider so it's made it a difficult day for us all.\n\"While it's still mathematically possible we've got to keep going, to keep fighting and scrapping for points, but it has made it very difficult.\"", "url": "https://www.bbc.com/sport/football/31562249"}