{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 03:46:06", "date_modify": "2025-05-21 03:46:06", "date_publish": "2025-04-06 06:56:13", "description": "Unified middleweight champion Janibek Alimkhanuly marks his homecoming with a stunning stoppage victory against Anauel Ngamissengue.", "filename": "sport_boxing_articles_cgen7rj4q8do_1747799166.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6584/live/6ecfdbc0-12b2-11f0-8e04-51770ccd4119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cgen7rj4q8do_1747799166.html", "title": "Janibek Alimkhanuly: WBO and IBF middleweight champion retains titles", "title_page": "Janibek Alimkhanuly: WBO and IBF middleweight champion retains titles - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Unified middleweight champion Janibek Alimkhanuly marked his homecoming with a stunning stoppage victory against Anauel Ngamissengue.\nAlimkhanuly dropped Ngamissengue in the opening round and sealed victory in the fifth to retain his WBO and IBF titles.\nIt is the first time Alimkhanuly has fought in his homeland of Kazakhstan since 2017 and extends his unbeaten record to 17 victories.\nThe 32-year-old southpaw has recorded 12 wins by stoppage to further cement his spot as the dominant force in the division.\nAlimkhanuly set the tone early and landed successive overhand lefts to put Ngamissengue on the canvas.\nCongolese-French fighter Ngamissengue was caught again late in the third but held on to the bell.\nThe onslaught continued through rounds four and five as Alimkhanuly targeted an early finish and a statement win for his countrymen at Barys Arena in Astana.\nVictory was confirmed when two snapping left hooks sent Ngamissengue, who was previously undefeated, collapsing to the floor and the referee waved off the contest.\nAlimkhanuly will be looking to add further middleweight gold to his collection later this year, with WBC champion Carlos Adames and WBA title-holder Erislandy Lara in his sights.\nThe Kazakh has also had his sights set on four-weight world champion Saul 'Canelo' Alvarez for the past couple of years.\n\"Canelo! Where are you?,\" Alimkhanuly posted on X.\n\"I am the king of middleweight! You think you are a king too! Let's show the world a fight between two kings!\"", "url": "https://www.bbc.com/sport/boxing/articles/cgen7rj4q8do"}