{"authors": ["Matthew Henry", "www.facebook.com"], "date_download": "2025-05-21 06:22:55", "date_modify": "2025-05-21 06:22:55", "date_publish": "2025-03-31 14:00:17", "description": "England captain Ben Stokes is not expected to play for Durham in the early rounds of the County Championship as he continues his recovery from hamstring surgery.", "filename": "sport_cricket_articles_cd7vxxglng5o_1747808575.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a1a0/live/caf1a380-0e33-11f0-a4bb-6b40441fc890.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cd7vxxglng5o_1747808575.html", "title": "Ben Stokes: England captain to miss early rounds of County Championship as he continues recovery", "title_page": "Ben Stokes: England captain to miss early rounds of County Championship as he continues recovery - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England Test captain Ben Stokes is not expected to play for Durham in the early rounds of the County Championship as he continues his recovery from hamstring surgery, says his county coach Ryan Campbell.\nStokes, 33, tore his left hamstring for a second time in five months in December and, having had surgery in the new year, has not played since.\nHe will not feature when the County Championship begins on Friday, nor will his Durham and England team-mate Brydon Carse, who is still recovering from the toe injury which ruled him out of the Champions Trophy last month.\n\"My expectation is that it'll be zero [early-season appearances] – anything else is an added bonus,\" said Campbell.\n\"They're coming back from serious injuries. The facts are they need to get up and running by the time the Test matches start.\"\nDurham have six County Championship matches before England's first assignment of the summer – a one-off Test against Zimbabwe - begins on 22 May.\nStokes was initially ruled out of cricket for three months after surgery in January and a Durham appearance closer to the Zimbabwe Test has not been dismissed.\nThe all-rounder continued his recovery by training again at Durham on Monday. Ten days ago he posted a video on social media of him having a gentle bowl in the nets.\n\"He's here nearly every single day working his butt off,\" Campbell said.\n\"The guy had hamstring surgery and was in the next day lifting weights, which I couldn't believe.\n\"He's such a hard-working bloke. He'll do whatever it takes to be up and running for England.\"\nBoth as a player and leader, Stokes will be crucial to England's hopes over a huge year in Test cricket.\nAfter Zimbabwe, England play India over five Tests and in the winter travel to Australia for the Ashes.\nStokes is also a candidate to replace Jos Buttler as England's white-ball captain. Buttler resigned after England's early exit at the Champions Trophy – a tournament Stokes missed because of his surgery.\nCarse, meanwhile, established himself as a key member of England's pace attack over the winter with 27 wickets in five Tests after making his debut in Pakistan.\nAn issue with nasty cuts and blisters on his left foot resurfaced during the Champions Trophy, however, meaning he had to be replaced in England's squad and was subsequently ruled out of the Indian Premier League.\n\"We've known about his foot problems for a year now,\" Campbell said.\n\"It's not new, but he needs to get it right if he's going to be playing a lot of Test cricket.\n\"If we look at it, then I think Brydon Carse is probably the number one priority for England right now with what he's shown in Test cricket. He's born for that sort of stuff.\n\"There's 11 Tests over the summer and winter and I think he's going to be number one on England's list to make sure that he's ready to go for that.\"", "url": "https://www.bbc.com/sport/cricket/articles/cd7vxxglng5o"}