{"authors": ["Martin Dowden", "www.facebook.com"], "date_download": "2025-05-21 05:23:07", "date_modify": "2025-05-21 05:23:07", "date_publish": "2025-04-03 15:29:30", "description": "Rangers assistant Neil McCann insists interim-head coach Barry Ferguson has already proven doubters wrong over his suitability for the role.", "filename": "sport_football_articles_c62zle0d1lno_1747804987.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/14b3/live/9a63c250-10a6-11f0-9af0-9909a653fc84.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c62zle0d1lno_1747804987.html", "title": "Ferguson proving people wrong as Rangers boss, says McCann", "title_page": "Ferguson proving people wrong as Rangers boss, says McCann - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers assistant Neil McCann insists interim-head coach Barry Ferguson has already proven doubters wrong over his suitability for the role.\nFerguson was installed until the end of the season after the departure of Philippe Clement in February and has led the Ibrox side into the quarter-finals of the Europa League and to a first win at Celtic Park since 2020.\nRangers followed up that 3-2 derby success with a 4-3 win over Dundee last weekend, coming from 2-0 and 3-1 down at Dens Park.\n\"I think that a lot of people maybe thought from his coaching CV that he maybe wouldn't even be ready to even take this position,\" said McCann of Ferguson, who left his previous post as Alloa Athletic manager in 2022.\n\"I think he's proved that wrong. It's not my place to tell anybody who is to get the job or not (beyond the end of the season). All we can do is work hard.\n\"He's trying to bring the character he had as a player, the demands he had as a player.\n\"I think we're showing that we've got a wee bit of guts about us,\" the former Scotland winger continued. \"We've got a determination.\n\"There's a mindset that I think the gaffer was wanting to change coming in.\n\"He felt that that had to be switched a wee bit and I definitely believe that we've got something there.\"", "url": "https://www.bbc.com/sport/football/articles/c62zle0d1lno"}