{"authors": ["Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 04:27:59", "date_modify": "2025-05-21 04:27:59", "date_publish": "2025-02-01 07:45:24", "description": "Super agent Mino Raiola's cousin Enzo shares memories of the transfer agent, who died in 2022 but whose legacy lives on.", "filename": "sport_football_articles_crk0kp7e710o_1747801679.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0541/live/d04ac620-dd9d-11ef-926a-cbf3c346618d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crk0kp7e710o_1747801679.html", "title": "January transfer news: The legacy of transfer king Mino Raiola", "title_page": "January transfer news: The legacy of transfer king Mino Raiola - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "'Super agent' Mino Raiola and the world of football transfers used to go hand in hand.\nRaiola was probably the most famous agent of all, with a fearsome reputation for negotiating the maximum for himself and his clients.\nHis profile was only enhanced by public criticism from legendary managers like Sir Alex Ferguson and Pep Guardiola.\nBut his death in 2022 could have brought down a transfer empire that Raiola had built up from scratch.\nHis cousin Enzo shares memories of the man he describes as a \"one-man show\" and explains how Mino's legacy lives on.\n\"His passing had been completely unexpected,\" Enzo Raiola tells BBC Sport. \"Even when he was sick, all our attention was on helping him get better.\n\"Nothing was in place, and we didn't think we would need to reorganise everything while grieving - it was extremely difficult.\"\nMino died aged 54 in Milan in April 2022, with tributes pouring in from across the football world.\nManchester City striker Erling Haaland simply called him \"the best\", Italy forward Mario Balotelli said he was his \"second father\" and Zlatan Ibrahimovic said he had \"cried until the last drop finished\".\nBut Raiola's family had to move on quickly or risk losing Mino's business, which was established first by early transfers for Pavel Nedved and Dennis Bergkamp and later featured blockbuster moves on behalf of Haaland and Paul Pogba.\nSuch was the global media interest in Raiola, there were even false reports of his death when he was still fighting for life.\n\"We had our players and media asking how he was - while other agents at rival firms tried to steal our players,\" said Enzo.\n\"We had to restructure and react to everything. All while I was going to the hospital for Mino's final moments.\n\"I was at his side for 15 years. Mino was an inspiration, having done it as the best of the best for 30 years. He was a one-man show. But we couldn't stop and had to rebuild almost immediately.\"\nMino Raiola's death inevitably changed things.\nWhile some big players joined up with Raiola's former business partner Rafaela Pimenta, others went with Enzo - along with Mino's most trusted scout Jose Fortes Rodriguez - in a rebuilt operation titled Team Raiola.\n\"Mino wouldn't let anyone step over him,\" recalls Enzo. \"He would battle in negotiations, or even just in a hotel lobby to get the right room.\n\"He had two strikingly different sides to his personality. In interviews and negotiations, he came across as fiercely competitive.\n\"Yet behind the scenes, with his players and partners he could show a profound sense of compassion and humanity.\n\"Both me and Jose like to get into the ring to protect our players too, but we are not as outspoken in the media yet.\"\nMino Raiola had seen a long list of clients come and go, having been involved in transfer deals for Romelu Lukaku, Marcus Thuram, Matthijs de Ligt, Noussair Mazraoui and Denzel Dumfries.\nDuring our interview with Enzo, Paris St-Germain and Italy goalkeeper Gianluigi Donnarumma calls him for some advice - smiling despite needing 10 staples in a face injury he suffered the previous evening against Monaco.\nJust as Mino started out from humble beginnings in the family pizza restaurant business in Haarlem, near Amsterdam, Enzo came into football having run the family car garage near Naples.\nHe eventually joined his cousin in football during Ibrahimovic's 2006 move from Juventus to Inter Milan, helping Mino move his client from the relegated Turin giants during the Calciopoli scandal.\nAs well as Donnarumma, the reshaped Team Raiola also represents some leading talents in the Premier League - including Tottenham's Micky van de Ven, Liverpool's Ryan Gravenberch and Bournemouth's Justin Kluivert.\nTo match the new generation's expectations, Team Raiola uses a separate company run by Mino's son Mario which specialises in data analytics, media rights, branded sponsorship, social media, and communications.\n\"We just want the top 11 players in our core markets to keep that family-like interaction,\" says Enzo. \"However, we must also not be the same one-man band we were before.\n\"When we go to clubs to negotiate, they are armed with data - you just have to look at how Brentford and Brighton operate. Data is used to scout our next generation, in areas where we have fewer scouts.\"\nJose Fortes Rodriguez - Mino Raiola's long-term scout turned agent - shares some thoughts on three of his Premier League clients.\nMicky van de Ven\n\"Mino called me and said 'I have spotted a really good player in the Dutch second division at Volendam'. I said 'This is not the level of players that we look at', but Mino insisted I took a look.\n\"I had heard stories about Van de Ven. I called Mino after 20 minutes. It took me that long to see enough about the speed and confidence he was playing with.\n\"At that moment, I said to Mino 'We need to take on this player'. I was always thinking he could play in the Premier League as he is mentally and physically very strong.\"\nRyan Gravenberch\n\"When I first saw him at Ajax I fell completely in love with his talents.\n\"I was like 'Wow, wow, wow'. When he was 14 or 15 I kept telling him he can be one of the best players in the world.\n\"He still needs to improve now because Ryan is one of those players who needs to show himself more, he is too polite on the field.\"\nJustin Kluivert\n\"I saw him when he was young and already in the first team at Ajax. Everyone could see he had a big career ahead of him. He was a big personality.\n\"He has played in all the best leagues in Europe and is at Bournemouth, making goals.\n\"I am really happy for Justin that he can do this at this Premier League level, but he has been doing it since he was a young boy.\"", "url": "https://www.bbc.com/sport/football/articles/crk0kp7e710o"}