{"authors": ["Emma Sanders", "www.facebook.com"], "date_download": "2025-05-21 05:28:45", "date_modify": "2025-05-21 05:28:45", "date_publish": "2025-01-23 08:22:43", "description": "Wales midfielder Hayley Ladd has not found things easy this season, but a January move from Manchester United to Everton could be just what she needed.", "filename": "sport_football_articles_c1jg5z62048o_1747805325.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b635/live/9c257440-d8e7-11ef-96e3-7ddb8edc83e8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1jg5z62048o_1747805325.html", "title": "Everton: Hayley Ladd on move from Man Utd", "title_page": "Everton: Hayley Ladd on move from Man Utd - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales midfielder Hayley Ladd has not found things easy this season, but a January move from Manchester United to Everton could be just what she needed.\nThe 31-year-old, who can play in both defence and midfield, made her debut on Saturday as Everton came from behind to draw 1-1 with Aston Villa.\nLadd struggled for regular game time at United this season but said it was \"like music to my ears\" when she heard what Everton's plans for her were.\n\"At United it became obvious that my chances were becoming limited in terms of getting any decent playing time,\" she told BBC Sport.\n\"I wanted to make more of a meaningful impact in the league. It's the way it was and it spurred me on to look at other options.\n\"Once I heard Everton were interested it was a really easy decision. I got to speak to (manager) Brian (Sorensen) and hear about his plans.\n\"He spoke really well. It was like music to my ears at that point. In the background, Wales getting to Euro 2025 spurred on that necessity to get more minutes.\"\nLadd made 110 appearances for United and was part of the squad that won their first major trophy with the 2024 Women's FA Cup.\nShe had been a key player under manager Marc Skinner but began to be overlooked following the summer arrival of Dominique Janssen.\nAfter five and a half years with the club Ladd says she was \"proud to represent\", she admits it was a \"breath of fresh air\" to try something new.\n\"It's part and parcel of the game but it's difficult. It really challenges you as a person and a player. It was a tough time, I won't lie,\" said Ladd.\n\"Hopefully it's made me stronger. The United journey was maybe aligned with mine and you feel emotionally tangled with it.\n\"I advocated for things in the best way I could and I was the best team-mate I could be.\n\"You have to rip off the band aid sometimes and getting out and into something fresh is the best thing you can do.\"\nDuring her time at United, Ladd played in front of a vocal fan base at Leigh Sports Village.\n\"They were my first sort of experience of real women's football fans. I just thought 'this is amazing',\" said Ladd.\n\"The support is just relentless. I've never known anything like it. It doesn't waiver. It's so resilient. It's been such an amazing experience playing with that fanbase.\n\"I'd like to think there was a good connection. I certainly felt it my way. You recognise, even when you're having a tough time, the fan base really support you and pull you through. That's a really meaningful thing as a player.\"", "url": "https://www.bbc.com/sport/football/articles/c1jg5z62048o"}