{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:45:16", "date_modify": "2025-05-21 04:45:16", "date_publish": "2025-04-03 00:00:00", "description": "Build-up to Thursday's Premier League fixture between Chelsea and Tottenham as Enzo Maresca's side look to move back into the top five.", "filename": "sport_football_live_cgrgyzk9wn2t_1747802716.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/49d4/live/383f71f0-109c-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cgrgyzk9wn2t_1747802716.html", "title": "Premier League LIVE build-up as Tottenham go to Chelsea", "title_page": "Premier League LIVE build-up as Tottenham go to Chelsea - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nI think we're going to leave things there. In a few hours the live-texting team will return with more build-up to Chelsea vs Tottenham.\nThank you very much for joining me and the team - a rare shift without any errors from yours truly (and we even talked about leg injuries and VAR decisions against Liverpool - my two weak points).\nWe'll be back tomorrow morning at 07:00 BST to soak up all the Chelsea and Spurs reaction.\nTake care.\nChelsea slipping from Champions League race\nChelsea v Tottenham (20:00 BST)\nOpta's supercomputer is at it again.\nWednesday evening's results in the Premier League saw Chelsea slip to sixth in the table before tonight's game against rivals Tottenham Hotspur.\nThe Blues currently sit on 49 points, two behind Manchester City in fourth, though Enzo Maresca's side have played a game less.\nAccording to the supercomputer, they now have just a 14.0% chance of making the top four.\nTheir most likely end of year finish is sixth (27.6%) while an unlikely end of season surge for third has just a 7.4% probability of happening.\nA win tonight would see Chelsea jump back into the top four, though Newcastle in fifth will have played a game less.\nIs the old supercomputer writing Maresca's men off too early?\n'This is a great game to finish the week off'\nChelsea v Tottenham (20:00 BST)\nThis is a great game to finish the week off. It ended up 4-3 to Chelsea earlier in the season, and there are likely to be a few more goals this time too.\nChelsea have people like Cole Palmer, Nicolas Jackson and Noni Madueke back from injury to bolster their attack, but Spurs have got some key players like Micky van de Ven fit again too.\nTottenham's league campaign has been disappointing - it is winning the Europa League or bust for them - while Chelsea are still chasing the Champions League places.\nSpurs looked tired to me before the international break, so it will be interesting to see what they are like here. We know how exciting they can be on their day, it is just those days have been few and far between this season.\nChelsea have been a bit flat as well, but maybe this is the game where both teams come to life and serve up a thriller - that is what I am hoping for anyway.\nSutton's prediction: 3-2\nRumours about future 'do not consume me' - Postecoglou\nChelsea v Tottenham (20:00 BST)\nTottenham Hotspur\nTottenham manager Ange Postecoglou dismissed further questions about his future as Spurs boss in his news conference yesterday.\n\"I don't deal with it,\" he explained.\n\"It doesn't rock my world - it doesn't consume me. I know my responsibilities are and I am sure if the club decides to go in a different direction, there are some outstanding candidates for it.\n\"And you know what, maybe someone will think: 'Ange Postecoglou is not a bad coach - maybe we'll take a punt on him'.\"\n\"I am passionate about what we're doing,\" he added.\n\"I was brought in to change the way the club plays, rejuvenate the squad and bring success. I am focused on that and that is what I'll keep doing.\"\nget involved\n'It was a decision the officials got badly wrong'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nRob, Cambridge: Another question for Phil M (it's a slow day here!): Do you think the relatively early timing of the Tarkowski tackle in the match may have influenced the decision at all? Was there pressure to not ruin the entertainment of the match with an early sending-off? Would there have been a different outcome had the foul been committed in the 85th minute?\nAgain, Rob we just do not know but I do think the old days of a “free hit” for defenders on an opponent are well behind us.\nI just think it was a decision the officials got badly wrong and the time it happened had nothing to do with it.\nget involved\n'It is just too invasive'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nCeiron: Hi Phil. When/what will change with VAR to make it more robust? When it works it works well generally but there’s still so much major error rate.\nHi Ceiron. You’ve got me on a hobby horse here. I have gone right off VAR after thinking it would be a great thing. We’ve just gone so far from “clear and obvious” and it now seems to me that officials are almost looking for reasons to disallow goals. It is just too invasive.\nI’m happy with semi-automated offside and goal-line technology but remain unconvinced in other areas.\nIt doesn’t stop mistakes either. How could VAR not come to the conclusion that James Tarkowski should have been sent off in the Merseyside Derby?\nget involved\n'it was such a reckless challenge'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nMichael, Liverpool fan in Hackney: Hi Phil, the debate around Tarkowski's tackle is pretty one sided and everyone but the ref and VAR seem to have seen it as a straight red. Additional mitigation for me is that at first glance, it looked like Mac Allister had fouled an Everton player to get the ball immediately prior. I wonder if Tarkowski, as Everton captain, saw that and in the moment decided to react more strongly?\nHi, Michael. Only James Tarkowski would know that, but it was such a reckless challenge and could have caused serious injury to Alex Mac Allister. He was incredibly lucky not to have been sent off.\nget involved\n'It was dealt with at the time'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nAlex: To Phil. What would your stand be on retrospective punishment for not given red card offences such as the Tarkowski challenge where PGMOL have admitted it was an error?\nHello, Alex. No retrospective punishment. It was dealt with at the time – very badly admittedly – but it is done now. This does not stop me saying it was one of the most obvious red cards you will ever see, and quite how VAR studied it and did not recommend the referee to reconsider is beyond me.\nget involved\n'I’m sure Liverpool would love to get their hands on Isak and Kerkez'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nMike, Eastbourne: Who would be your top 3 summer signings for Liverpool?\nHello, Mike. Entering the realms of guesswork and – perhaps – the extremely unlikely here, but mine would be Newcastle United striker Alexander Isak (could Newcastle even dare to part with him), Bournemouth full-back Milos Kerkez and maybe Julian Alvarez of Atletico Madrid.\nIf I was going for four (!) maybe they would consider strengthening in central defence and go back to Bournemouth for Dean Huijsen…sorry Cherries fans.\nShould stress I’m not saying these will happen – but I’m sure Liverpool would love to get their hands on Isak and Kerkez.\nA lot depends, of course, on the contract situations of Mohamed Salah, Virgil van Dijk and Trent Alexander-Arnold.\nget involved\n'We can’t disguise how disappointing the season has been'\nPhil McNulty Q&A\nPhil McNulty\nBBC Sport chief football writer\nMick: Of the bottom eight teams in the premier league, only Spurs and Ipswich have not sacked their manager in a desperate attempt to avoid relegation. Maybe the Tractor Boys can be excused for showing loyalty to the management team who gained back-to-back promotions, but there can be no excuse for Tottenham. It's like \"Call of Duty\" in attack and dereliction of duty at the back, so how on earth is Ange Postecoglou still in a job?\nHi, Mick. First things first. Ange Postecoglou could still win the Europa League this season and get Tottenham into the Champions League. That would have been the aim before the start of the season – with a trophy as well, of course.\nWe can’t disguise how disappointing the season has been in other aspects, but if Spurs did sack Postecoglou now or had done in the past few weeks, who is realistically available and an upgrade, a guarantee of improvement? I don’t see anyone jumping out at me.\nIt’s easy to say “sack the manager” but what comes next is not so easy.\nAnd while I have no particular wish to sound like an Ange Postecoglou apologist, he really has had to deal with an horrendous injury list this season.\nI do accept that if Spurs do not win the Europa League, then I suspect his position would then come under review – but he could still fulfil his promise of always winning a trophy in his second season.", "url": "https://www.bbc.com/sport/football/live/cgrgyzk9wn2t"}