{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:23:51", "date_modify": "2025-05-21 06:23:51", "date_publish": "2025-01-31 12:54:16", "description": "Derby need to find a way to \"grind out results\" and make themselves \"hard to beat\", says ex-Rams goalkeeper and coach Eric Steele.", "filename": "sport_football_articles_cr46ddn947do_1747808631.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cr46ddn947do_1747808631.html", "title": "Derby County: Paul Warne will have a rally cry for his players, says Eric Steele", "title_page": "Derby County: Paul Warne will have a rally cry for his players, says Eric Steele - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Derby County need to find a way to \"grind out results\" and make themselves \"hard to beat\" to get out of relegation trouble, says former Rams goalkeeper and coach Eric Steele.\nThe 70-year-old, who also previously worked on the coaching staff at Manchester United under Sir Alex Ferguson, has been talking to BBC East Midlands Today about the battle for survival that Paul Warne's side find themselves in after six straight league defeats.\n\"Paul Warne will be getting a great rallying call at the moment, and he has got to because his job is on the line and the rest of his staff are on the line,\" Steele said.\n\"The biggest thing is you have to be hard to beat and that, I don't think, has been the case.\n\"That is the first thing you do when you are in a crisis. Can you actually grind out results? Then hopefully that momentum builds.\n\"I hear a lot of doom and gloom, but there is still enough time. But it has to happen in the next two or three weeks because there is a great saying in football that losing becomes a habit and winning becomes a habit. And they need to get that winning habit back again.\"\nHow quickly defender Matt Clarke and striker Lars-Jorgen Salvesen get used to being at Derby and the battle they find themselves in will also be critical, according to Steele.\n\"They need goals from somewhere, and Salvesen has come in scored against Cardiff and looks this big strong leader. A lot is being asked of him,\" he added.\n\"Warne will be saying to [wingers] Nathaniel Mendez-Laing and Corey Blackett-Taylor 'you must now deliver balls into the box'.\n\"Matt Clarke is a good signing, he has been at the club and knows what the club is about.\"\nThe return of midfielder David Ozoh is also seen as another major positive for a side that has struggled to create scoring opportunities this season.\n\"We are lacking a midfield player, we need a controller,\" Steele said.\n\"Ozoh's back. Will he stay fit? We hope he does because he had a really good five or six games influencing that midfield, the link between defence and attack.\n\"If we can get one or two more bodies in, I'm hoping that will be enough.\"", "url": "https://www.bbc.com/sport/football/articles/cr46ddn947do"}