{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:05", "date_modify": "2025-05-21 03:42:05", "date_publish": "2025-04-06 18:10:06", "description": "Max Holden's scores a century as Middlesex fight back on day three at Lord's to set up the prospect of an exciting finish against Lancashire.", "filename": "sport_cricket_articles_c0kx5n8eplko_1747798925.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f150/live/134b58a0-1303-11f0-baa6-cf6d1e060075.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0kx5n8eplko_1747798925.html", "title": "County Championship: Max Holden's century helps Middlesex fightback v Lancashire", "title_page": "County Championship: Max Holden's century helps Middlesex fightback v Lancashire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Holden's sixth first-class hundred led a Middlesex fightback on day three at Lord's to set up the prospect of an exciting finish against Division Two title favourites Lancashire.\nThe left-hander followed up his half-century of the first innings with an unbeaten 135 to rescue his side from the havoc of 7-3 in the wake of Tom Bailey's superb three-wicket opening salvo.\nHolden shared stands of 106 with Ryan Higgins (43) and 163 with debutante Ben Geddes (74) as the hosts reached 288-6 at stumps.\nBailey (3-47) could not add to his pre-lunch heroics, but late wickets with the second new ball gave the visitors the edge once more ahead of day four.\nAll this unfolded after Lancashire added just six to their overnight first innings score to be bowled out for 359, Saturday's centurion Marcus Harris last to go 138, Zafar Gohar finishing with 4-79.\nIt was only two seasons ago Middlesex found themselves 4-4 in the first game of the season with the top four all dismissed without scoring, and while this was not quite as calamitous, Bailey's new-ball spell still caused much scrambling on of pads in the home dressing room.\nNathan Fernandes looked nervous from the start and Bailey soon lured him into fencing at one he should have left alone, allowing wicketkeeper Matty Hurst to gobble up the chance.\nIf Fernandes was culpable, then Sam Robson was undone by a super piece of bowling, Bailey squaring up the former England opener and rapping him on the pad. Any hope it would be considered too high was quickly dashed as umpire Surendiran Shanmugan sent him on his way.\nAnd two balls later 7-2 became 7-3 as Leus du Ploy slashed wildly at a wider ball giving Hurst his second catch in the space of a few minutes. Bailey had taken 3-2 in 15 balls, leaving the hosts staring at the prospect of defeat inside three days.\nCalm heads were required and for the second time in the match it was former England Lions batter Holden who stepped up, employing studious defence with drives caressed through the covers and savage square cuts.", "url": "https://www.bbc.com/sport/cricket/articles/c0kx5n8eplko"}