{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:10:51", "date_modify": "2025-05-21 04:10:51", "date_publish": "2025-04-06 12:02:32", "description": "Coventry City assistant manager Joe Edwards says he was pleased with his side's second-half performance despite a 2-1 defeat by Burnley.", "filename": "sport_football_articles_cn7xgkmle33o_1747800651.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db6c/live/faa2a1c0-12dd-11f0-b182-81b971f8bd66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn7xgkmle33o_1747800651.html", "title": "Coventry City: Joe Edwards pleased with showing in Burnley defeat", "title_page": "Coventry City: Joe Edwards pleased with showing in Burnley defeat - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Coventry City assistant manager Joe Edwards said he was pleased with his side's second-half performance despite a 2-1 Championship defeat by Burnley.\nHaji Wright had put the Sky Blues in front but Jadon Anthony's double secured the points for Burnley, sending them top and Coventry out of the play-off places.\nEdwards, speaking to BBC Radio CWR after boss Frank Lampard was sent off, praised his team for taking the game to a Burnley side who have conceded just 12 goals all season.\n\"When you concede a goal like that against a Burnley side who are capable of shutting up shop, the big marker is what's the reaction going to be like,\" he said.\n\"That was the positive thing for us because, for the remaining 30 minutes, the game was played in Burnley's half.\"\nEdwards admitted he was unsure why Lampard had been dismissed but refused to comment further.\n\"I'm here because Frank was sent off, which I was informed of as we came off the pitch,\" he added.\n\"Frank's received the red card. I'm not entirely sure what for, to be honest. Obviously there was a bit of frustration from everyone in the stadium and it's boiled over and Frank's been punished.\n\"The last thing I want to do is get punished myself by speaking too much.\"", "url": "https://www.bbc.com/sport/football/articles/cn7xgkmle33o"}