{"authors": ["Pat Nevin", "www.facebook.com"], "date_download": "2025-04-26 03:50:01", "date_modify": "2025-04-26 03:50:01", "date_publish": "2025-03-05 13:09:04", "description": "Pat Nevin: From 'unprecedented bad luck' for Hibs to 'joyous times'", "filename": "sport_articles_cdxql3ye2l3o_1745639401.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1d0d/live/52328930-f9c2-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cdxql3ye2l3o_1745639401.html", "title": "From 'unprecedented bad luck' for Hibs to 'joyous times'", "title_page": "Pat Nevin: From 'unprecedented bad luck' for Hibs to 'joyous times' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "I was on BBC Radio four months back when the clamour for the Hibs manager's head was at a crescendo, but I refused to agree that club legend David Gray should be sacked and not just because of that legendary status.\nLooking at their start, they had to cope with a number of injuries to key players. On top of that, there was a run of almost unprecedented bad luck. They were ahead and lost last-minute goals time and again and they had a slew of red cards in games that they would otherwise have won.\nThe manager had to sort these problems out, but they weren't insurmountable and the fact they were often the better side when losing convinced me the essentials were all in place, they just needed time.\nHaving said that, I wouldn't have expected them to go on a run of one defeat in 18 (away at Celtic), rocketing from last to third, beating Celtic and then Hearts at home in quick succession while continuing to improve.\nCatching Celtic and Rangers is just about impossible in Scotland, their financial power precludes that most seasons, but European football is a real possibility now.\nMore importantly for the uninitiated, if you haven't heard the Hibs fans celebrating by Singing \"Sunshine on Leith\" by The Proclaimers (Two Hibees like myself), then what a treat you have in store.\nThe rendition (above) after beating Hearts this week brought a tear to many an eye... not just Hibs fans.\nI still hold that it is the greatest football song ever, even surpassing You'll Never Walk Alone. Though I may be a little biased. Joyous times.", "url": "https://www.bbc.co.uk/sport/articles/cdxql3ye2l3o"}