{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:46:31", "date_modify": "2025-05-21 03:46:31", "date_publish": "2025-04-07 16:17:30", "description": "Josh Tongue's five-wicket haul helps Nottinghamshire beat Durham, despite a second century of the game from Colin Ackermann.", "filename": "sport_cricket_articles_cz013744jmxo_1747799191.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/39ad/live/fac421b0-13c8-11f0-bf82-cb6aee90e3a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cz013744jmxo_1747799191.html", "title": "County Championship: Josh Tongue stars as Nottinghamshire beat Durham", "title_page": "County Championship: Josh Tongue stars as Nottinghamshire beat Durham - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Colin Ackermann's second century of the match was not enough to stave off defeat for Durham, who succumbed to Nottinghamshire by eight wickets after a match-turning spell by England fast bowler Josh Tongue.\nSouth African-born Netherlands international Ackermann made 124 to go with his first-innings 116 as Durham, who had trailed by 201 on first innings, looked to emerge with a draw from the opening round of the County Championship.\nBut Tongue, on a Nottinghamshire debut delayed by a full season because of injuries following his 2023 move from Worcestershire, shattered that ambition by taking 5-66, somehow conjuring four wickets in 12 deliveries from a ball right at the end of its 80-over match lifespan.\nDurham lost their last five wickets for 21 runs, leaving Nottinghamshire needing 89 to win from 40 overs remaining in the match, a task they completed for the loss of two wickets, skipper Haseeb Hameed making 39 and Joe Clarke 35.\nTongue's achievement came after Nottinghamshire's other debut-making fast bowler, Australian international Fergus O'Neill, had taken 5-81 in the first innings. Tongue also made a career-best 55 with the bat in Nottinghamshire's first innings.\nIt was a painful defeat for Durham, who posted 378 in their first innings and had the home side 319-6 in reply only for Lyndon James (125), Matt Montgomery (75) and Tongue to bat the home side into a position of strength.\nIf Durham's approach to the final day was always likely to be cautious, it was confirmed after Pennington opened with a sharp seven-over spell that brought him two wickets for 10 runs.\nAt 87 behind overnight, even with seven wickets in hand on a pitch that had yielded runs at around 3.75 per over, the visitors had at least needed a productively trouble-free morning to consider revising that perspective.\nYet after the pacy Pennington had removed Ollie Robinson via an edge to first slip and Will Rhodes leg before, angling one in from a wide delivery point, Durham found themselves five down and still 78 behind.\nFrom then on, Ackermann and Clark dug in for a long fight and any hope that Pennington's burst might trigger a rapid Durham collapse soon subsided.\nThe sixth-wicket pair reached lunch still together, before clearing the arrears seven overs into the afternoon session with the innings 68 overs old.\nDurham's first-innings centurion completed his second hundred of the match five overs later, a career-first for the 34-year-old and a 28th in all in first-class cricket. Conditions have largely favoured the bat in this match, but Ackermann did a superb job for his side in both innings.\nBy now, Nottinghamshire's best chance of making a breakthrough seemed to be with the second new ball, which was seven overs from being available as the Durham dressing room celebrated Ackermann's feat.\nYet Tongue dramatically changed the picture in what would have been the last over - the 80th - with the old ball, taking wickets with the first and last deliveries of it as Clark was bowled off an inside edge, ending a partnership with Ackermann worth 145, and new batter George Drissell was leg before, beaten for pace.\nNot surprisingly, Nottinghamshire captain Hameed invited Tongue to carry on with the same ball. A wise move it was, the England player repeating the trick in his next over, ripping out Ben Raine's middle stump with the first delivery, beating Ackermann's flick across the line with the sixth.\nO'Neill promptly finished things off with the new ball by inducing an easy return catch with a slower ball to Matty Potts, meaning Durham had collapsed from 268-5 to 289 all out in the space of six and a half overs.\nAfter tea was taken between innings, the home side had 40 overs available to score 89. They lost their own first-innings centurion, Ben Slater, leg before to Potts for a duck, and Freddie McCann to a slip catch off a reverse sweep, but wrapped up victory at 16:55 BST with 22.5 overs to spare.", "url": "https://www.bbc.com/sport/cricket/articles/cz013744jmxo"}