{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:16:41", "date_modify": "2025-04-26 08:16:41", "date_publish": "2025-02-26 10:35:42", "description": "Northampton Saints boss Phil Dowson says he will consider making changes for their Premiership Rugby Cup quarter-final against Ealing.", "filename": "sport_rugby-union_articles_crew8p579dno_1745655401.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0fe4/live/cfce2430-f427-11ef-9822-d3d66c578726.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_crew8p579dno_1745655401.html", "title": "Phil Dowson: Northampton will consider changes for Premiership Rugby Cup quarter-final", "title_page": "Phil Dowson: Northampton will consider changes for Premiership Rugby Cup quarter-final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Northampton Saints boss Phil Dowson will consider making changes for their Premiership Rugby Cup quarter-final against Championship side Ealing Trailfinders.\nSaints mainly relied on their younger players for the group stage of the competition as they won five of their six games.\nBut some members of his squad have not played since their most recent league game on 24 January and the Premiership does not resume until 21 March.\nMeanwhile, South African centre Burger Odendaal has not played since suffering a serious knee injury in last season's title win against Bath.\n\"It's not healthy to go seven weeks without playing before we get back into the Premiership, so you need to be mindful of minutes,\" director of rugby Dowson told BBC Radio Northampton.\n\"And who needs playing who is coming back from injury? Burger Odendaal is there or thereabouts so it's going to be fantastic to get him back in after the journey he's been on.\n\"There's those aspects of guys coming back in and making sure we keep them topped up with minutes, (but) there's the aspect of rewarding players who've been playing well in this competition and understanding that it is a development tool and we want to get the most out of that.\"\n\"There's a balance and we'll continue to use it in that way.\"\nNorthampton beat Saracens 23-9 in the inaugural Premiership Rugby Cup final in 2019 and are aiming to reach a first final since then.\nThey are eighth in the league and facing an uphill task to qualify for the play-offs.\nDowson declined to single out players who impressed him during the group stage, when they scored 230 points in the six games, with fly-half George Makepeace-Cubitt contributing 55 - the third highest individual total in the competition so far.\n\"From an individual point of view, what's been most pleasing has been how emotionally involved and invested all the players are,\" said Dowson.\n\"When it's somebody else's turn to go, the support they get from the rest of the group is top level.\n\"Seeing guys make their debuts and performing really well is a really good sign with regards to our ethos and development plan.\"\nDespite home advantage, Northampton will take nothing for granted against the Trailfinders, who beat them at Ealing in a group game in last season's competition.\nThey are currently 13 points clear at the top of the Championship and beat Saracens twice in their group matches - and could include former Saints wing Tom Collins in their matchday squad.\n\"They've made their ambitions very clear, they want to be eating at the top table and this would be a great opportunity for them to show that they are capable of competing,\" Dowson added.\n\"There's no doubt that they are (a good side), in terms of the quality of their squad and quality of their coaching and how they've performed over a number of seasons now.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/crew8p579dno"}