{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:20:46", "date_modify": "2025-05-20 13:20:46", "date_publish": "2023-07-25 18:56:23", "description": "Julen Lopetegui on Wolves' financial challenges", "filename": "sport_articles_cw91rdzle4po_1747747246.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5779/live/454001e0-2b1e-11ee-b1d7-8fdc93c2782e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cw91rdzle4po_1747747246.html", "title": "Julen Lopetegui on Wolves' financial challenges", "title_page": "Julen Lopetegui on Wolves' financial challenges - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wolves boss Julen Lopetegui hopes the club can \"improve\" its effort in the transfer market as Financial Fair Play rules mean he is unable to even execute what were initially his back-up plans for the summer.\nThe Spanish coach says he was informed of challenging financial constraints in May, having helped the club stay in the Premier League following his arrival last season.\nWolves have sold the likes of Ruben Neves, Raul Jimenez, Nathan Collins and Conor Coady so far this summer but have made loan deals for Matheus Cunha and Boubacar Traore into permanent signings.\nFormer player Matt Doherty has also returned to the club on a free transfer.\nSpeaking exclusively to Spanish football journalist Guillem Balague on his YouTube channel,, external Lopetegui said a brush with relegation must prove to be a \"wake up\" for Wolves.\nOn financial challenges, he added: \"Unfortunately we have this situation. I am not a financial adviser of course but I am a coach and I know we need to be competitive in the Premier League.\n\"I hope that we are going to improve this situation because we need that. The players that are here, they’re committed but of course all of the rest is true.\n“Unfortunately, the situation was reality, it was bad news for me of course. I’m trying in the summer; this is the plan A that we have and after that we have to adapt to the situation to the plan B, trying to think about the players that are cost effective signings in this situation.\n“It is true that in this moment, we can’t develop the plan B either. We lost a lot of players, and it is true that we think the club want to sell more players. This situation, we need players to balance the squad and be competitive in the Premier League for sure.\"", "url": "https://www.bbc.com/sport/articles/cw91rdzle4po"}