{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:28:53", "date_modify": "2025-05-20 13:28:53", "date_publish": "2023-08-02 06:19:12", "description": "Sweden beat Argentina to make it three wins from three at the 2023 Fifa Women's World Cup, setting up a mouth-watering last-16 meeting with the USA.", "filename": "sport_football_66380356_1747747733.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9359/production/_130612773_gettyimages-1586998030.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66380356_1747747733.html", "title": "Argentina 0-2 Sweden: Swedes top group to set up USA last-16 meeting", "title_page": "Argentina 0-2 Sweden: Swedes top group to set up USA last-16 meeting - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sweden beat Argentina to make it three wins from three at the Women's World Cup, clinching top spot in Group G and a mouth-watering last-16 meeting with the USA.\nWith first place essentially guaranteed thanks to a vastly superior goal difference, Sweden made nine changes in Hamilton and lacked the cohesion of their first two games but still had too much for their opponents.\nAfter a fiercely contested hour, Sweden's extra quality shone through, with Rebecka Blomqvist finding space in the box to power home Sofia Jakobsson's cross from close range.\nElin Rubensson put the result beyond doubt with a coolly taken late penalty after Blomqvist had been fouled in the box as Argentina sought to defend a free-kick.\nArgentina depart the tournament having finished bottom of the group with one point.\nThey battled hard here but were unable to hurt the Swedes and claim what would have been a historic double at a World Cup finals - a maiden win and progression to the knockout rounds for the first time.\nSouth Africa join the Swedes in the last 16 after winning 3-2 against Italy in a dramatic game in Wellington.\nAfter a European Championship in 2022 in which they reached the last four but were hampered by injuries and coronavirus, Sweden have looked every inch a side keen to do even better in this World Cup.\nThey are used to going deep in major tournaments, having reached the last four in five of the last six, and have some chastening recent near misses to further fuel them - none more so than their shootout agony in the final of the Tokyo Olympics.\nHaving seen off South Africa and hit five past Italy in their opening two games, Peter Gerhardsson demonstrated the depth at his disposal and the confidence surging through his squad by making sweeping changes but retaining structure and cohesion.\nArgentina - drinking in this tournament's last-chance saloon - made life difficult for the side ranked third in the world with some high pressing and committed tackling, but goalkeeper Jennifer Falk had little to do.\nGerman Portanova's side were also hampered by the loss of Real Madrid midfielder Florencia Bonsegundo, who left the field on a stretcher and in tears after suffering an injury in the first half.\nSweden struggled to show a cutting edge themselves for just over an hour, with Olivia Schough's off-target header the best effort fashioned by either side.\nBut when their big chance came they took it as Blomqvist charged in unmarked to nod home Jakobsson's whipped delivery.\nBlomqvist was again a handful late on as Gabriela Chavez held her in the box as a free-kick was sent in, prompting the referee to point to the spot. Rubensson did the rest with aplomb, calmly and clinically despatching the penalty.\nSweden will need such qualities and more in Melbourne on Sunday when they take on four-time winners and reigning champions the USA in the first knockout round.\nThe Americans have been far from their scintillating best so far in this tournament, but they remain packed with talent and, as they have shown in the previous two World Cups, know how to get the job done.\nThe USA and Sweden will be meeting for a sixth World Cup in succession and a seventh time overall at the finals, going back to each team's first game at FIFA's inaugural edition in China in 1991.\nThe spoils have gone the Americans' way in four of the previous World Cup meetings and 23 of the 42 games between them overall.", "url": "https://www.bbc.com/sport/football/66380356"}