{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:23", "date_modify": "2025-05-21 05:02:23", "date_publish": "2025-01-23 12:21:31", "description": "Glamorgan cricket club have said they now expect to retain their 51% share in the Welsh Fire Hundred franchise.", "filename": "sport_cricket_articles_c93ql597r4vo_1747803743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/80db/live/920c4ff0-d956-11ef-bc01-8f2c83dad217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c93ql597r4vo_1747803743.html", "title": "Welsh Fire: Glamorgan will retain 51% share of Hundred franchise", "title_page": "Welsh Fire: Glamorgan will retain 51% share of Hundred franchise - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glamorgan County Cricket Club say they now expect to retain their 51% share in the Welsh Fire Hundred franchise.\nLast September chief executive Dan Cherry had told the BBC Glamorgan were \"open-minded\" about control of Welsh Fire and their majority shareholding.\nThe eight hosts of The Hundred teams have been given a 51% stake in their respective franchises, which they can sell or keep, while the remaining 49% in each is being sold by the England and Wales Cricket Board (ECB).\nThe ECB, which hopes to raise £500m, is undergoing a three-round process with potential investors from around the globe.\nWrexham Football Club's Hollywood owners Ryan Reynolds and Rob McElhenny are among those who have been linked with acquiring a stake in the Welsh Fire men's and women's teams.\nA January update to Glamorgan members on the process from Cherry has been seen by BBC Sport Wales.\nIn his letter Cherry wrote: \"It is the current thinking of the board that it is very important to retain 51%.\n\"Glamorgan has no immediate necessity to monetise its equity and retaining control is, we believe, in the best interests of Glamorgan at this current time.\"\nCherry adds the Glamorgan board will \"reflect upon this position depending upon the nature of discussions with the round three investors\".\nThe ECB has cast its net wide in courting interested parties to buy stakes in Hundred franchises, speaking to every team owner in the Indian Premier League (IPL) and Women's Premier League (WPL), plus owners of teams in the NFL as well as private equity funds.\nWhen IPL owners have bought teams in other franchise leagues - such as South Africa's SA20 - it has often resulted in name changes, and the expectation is The Hundred will be no different.\nIt has been reported some potential investors would want more than a 49% stake in order to have more control.\nCherry though insists investment must benefit Glamorgan as well as Welsh Fire.\n\"The selection of an investment partner is critical to maintaining the integrity and reputation of Glamorgan CCC,\" he wrote.\n\"Selecting the wrong investment partner could lead to reputational damage, significant cost and time and potentially could lead to an arrangement being terminated which would negatively affect all parties.\"\nThe sale of 49% stakes in The Hundred franchises is expected to be concluded before the end of March 2025 and Cherry welcomed the prospect of fresh investment.\nCherry believes it will help grow both the Welsh Fire and Glamorgan brands globally, boosting sponsorship opportunities and building relationships with players and coaches from around the world.\nThe Glamorgan board also believes it will elevate the growth of women's cricket and that up-front cash investment will enable them to \"strengthen the balance sheet and invest more in both cricket and non-cricket areas of the business in the near future\".\n\"We are looking for a partner who shares our ambition, values, culture and strategy for the franchise and all cricket in Wales,\" wrote Cherry.\n\"We are proud of our position as the only Welsh first-class county and of our category A international stadium in the heart of Cardiff.\n\"Wales is a country where sport is central to our national identity, and we intend to ensure that any partner recognises this USP (unique selling point) and the great tradition and history of Glamorgan CCC.\"\nThe eight hosts that have a 51% share of their Hundred teams are Lord's (MCC/London Spirit), The Oval (Surrey/Oval Invincibles), Southampton (Hampshire/Southern Brave), Cardiff (Glamorgan/Welsh Fire), Trent Bridge (Nottinghamshire/Trent Rockets), Edgbaston (Warwickshire/Birmingham Phoenix), Old Trafford (Lancashire/Manchester Originals) and Headingley (Yorkshire/Northern Superchargers).\nThese hosts can sell all or part of their stake, or keep it all. If they do sell, 10% of the proceeds will go to the recreational game.", "url": "https://www.bbc.com/sport/cricket/articles/c93ql597r4vo"}