{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:08", "date_modify": "2025-05-21 03:42:08", "date_publish": "2025-04-06 17:55:06", "description": "Essex dominate Surrey on day three of their County Championship match despite an unbeaten 92 from Ben Foakes.", "filename": "sport_cricket_articles_c0m914nl8rro_1747798928.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4150/live/132299f0-130e-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0m914nl8rro_1747798928.html", "title": "County Championship: Essex force champions Surrey to follow-on", "title_page": "County Championship: Essex force champions Surrey to follow-on - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ben Foakes defied his former county for four hours and 41 minutes but could not prevent Essex asking reigning champions Surrey to follow on in the County Championship at Chelmsford.\nThe one-time England wicketkeeper, an Essex academy graduate, stood resolutely while wickets fell all around him to remain unbeaten on 92 as Surrey were dismissed for 365 in their first innings, 217 runs in arrears.\nSecond time around, Surrey reduced their deficit by nine runs without loss in six overs at the end of day three.\nIt could have been worse for the visitors. They collapsed from their overnight 109-1 to 180-6, undone by a spell of three wickets in 15 balls amid pre-lunch mayhem in which five wickets fell and the guts were ripped out of the middle order.\nSimon Harmer led the way for Essex with 4-83 from a marathon 47 overs, 34 of them bowled in day three.\nAt the start of an eventful day under clear, bright skies, Ollie Pope lasted just seven balls before he was beaten all ends up by a delivery from Porter that flicked his off-bail. It ended a 103-run stand with Rory Burns for the second wicket.\nJamie Smith made his presence felt with three quick boundaries off Porter but, five balls after cutting Shane Snater's first ball decisively to the square-leg boundary, he essayed a cover-drive, missed and kept walking as his off-stump went cartwheeling.\nThat brought in Foakes, but before he could settle Surrey lost their second wicket in two balls. This time Harmer induced an outside edge off Burns' bat for a caught-behind for 73.\nAnd it became three wickets with just eight runs added as Dan Lawrence's six-ball stay ended when Harmer got one to jump up with the resultant involuntary edge deviating to slip.\nRyan Patel looked completely bamboozled by Harmer. He faced 23 deliveries from the off-spinner, barely getting near any of them, let alone scoring a run, before nudging one into the wicketkeeper's gloves.\nIn addition to his wickets, Harmer was parsimonious in terms of conceding runs, so when Foakes pushed him through the covers it was only the second boundary he had conceded in 26 overs.\nThe scoreboard clicked rapidly when the new ball was taken with 40 runs coming from the first six overs, moving Surrey to their first of two batting points in the process, before Jordan Clark's freewheeling 45 from 88 balls was ended by Cook.\nFoakes reached his fifty when he edged his eighth four just wide of slip off Snater. He had put on 55 for the eighth wicket with Matt Fisher before losing his fifth partner, the recruit from Yorkshire being bowled by one from Hamer that kept low.\nJames Taylor joined Foakes in a time-consuming 22-over stand worth 50 runs before Matt Critchley switched ends for one over and removed Taylor with a googly. He then swapped back to his previous end to account for Kemar Roach lbw and end the innings.", "url": "https://www.bbc.com/sport/cricket/articles/c0m914nl8rro"}