{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:25:39", "date_modify": "2025-05-21 05:25:39", "date_publish": "2025-01-05 09:09:32", "description": "Liverpool vs Man Utd predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cy0n7zdvj2jo_1747805139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5df1/live/016c4580-c9f8-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0n7zdvj2jo_1747805139.html", "title": "Liverpool vs Man Utd predictions: Chris Sutton on Premier League game", "title_page": "Liverpool vs Man Utd predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 5-0\nThe historic rivalry between these two clubs is intense but, on the pitch, the contest is not even close at the moment.\nManchester United boss Ruben Amorim is talking about being in a relegation battle and you can see why.\nHis side were torn apart in the first 30 minutes by Newcastle at Old Trafford on Monday, and why would anything be different at Anfield?\nWhoever Liverpool pick, they have got goals in their team and United have no chance of keeping them out.\nThe scoreline won't hit double figures but anything else is possible - and that is me being nice to United. Liverpool should demolish them, and they will demolish them - it is just a question of how many goals they get.\nUnited will play for pride, play for the badge and for the jersey, and all of that, but it won't make any difference.\nLiverpool are in a different stratosphere at the moment and I feel sorry for Amorim because this is going to be another painful afternoon for him.\nMcCabe's prediction: 3-2\nI think United are going to turn up and this is going to be closer than most people think. I just spoke to our [band's] manager, who is a United fan, and he said it would be 2-0 to Liverpool - but I just have a feeling they will make a game of it. United are that bad at the moment, we could take our eye off the ball against them and that is when they will start playing, so we have to be careful and make sure we put them away.", "url": "https://www.bbc.com/sport/football/articles/cy0n7zdvj2jo"}