{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:42:54", "date_modify": "2025-05-21 03:42:54", "date_publish": "2025-04-06 17:23:06", "description": "Super League leaders Hull KR will face Catalans Dragons in the semi-finals of the 2025 men's Challenge Cup while Warrington meet Leigh.", "filename": "sport_rugby-league_articles_cn5x73zr93do_1747798974.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b26d/live/3223aee0-130c-11f0-bb1f-752fc4c9ccf8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-league_articles_cn5x73zr93do_1747798974.html", "title": "Challenge Cup: Hull KR face Catalans and Warrington take on Leigh in semis", "title_page": "Challenge Cup: Hull KR face Catalans and Warrington take on Leigh in semis - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Super League leaders Hull KR will face Catalans Dragons and Warrington Wolves will take on Leigh Leopards in the semi-finals of the 2025 men's Challenge Cup.\nLes Dracs, the 2018 winners, ensured their spot in the final four by beating financially-stricken Salford Red Devils on Friday, with the Robins defeating Hull FC in an entertaining derby on Saturday to reach the semi-final stage.\nThe Wire, who overcame St Helens on Sunday, will book a place in the final for the second successive season if they defeat the Leopards in the second semi-final, with Adrian Lam's side teeing up the tie by beating Wakefield on Friday.\nThe fixtures will be played on the weekend of 10 and 11 May with the venue and kick-off times for the two ties to be confirmed.\nThe draw was conducted at half-time of the Wire's win against St Helens at the Halliwell Jones Stadium, with former England football captain Stuart Pearce and ex-St Helens forward Jon Wilkin drawing the numbers.\nThe winners of each tie will go through to the final at Wembley Stadium on Saturday, 7 June.\nThe final will be part of a bumper day of sport at the national stadium, with the Women's Challenge Cup Final and 1895 Cup Final and RFL Champion Schools Year 7 Boys Final also taking place.", "url": "https://www.bbc.com/sport/rugby-league/articles/cn5x73zr93do"}