{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:21:17", "date_modify": "2025-05-20 13:21:17", "date_publish": "2023-07-24 13:53:06", "description": "What to expect from day six of the Fifa Women's World Cup, with Colombia facing South Korea, New Zealand playing the Philippines and Switzerland meeting Norway.", "filename": "sport_football_66291338_1747747277.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/28AA/production/_130501401_gettyimages-1560816912.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66291338_1747747277.html", "title": "Fifa Women's World Cup day six: Colombia v South Korea, New Zealand v Philippines, Switzerland v Norway.", "title_page": "Fifa Women's World Cup day six: Colombia v South Korea, New Zealand v Philippines, Switzerland v Norway. - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "History could be made on day six of the Fifa Women's World Cup if South Korea field 16-year-old Phair Casey in their game against Colombia.\nShe would become the youngest player to play in the tournament's history.\nThat is the last game of the first round of group matches.\nNew Zealand get the second round of games under way and could book their place in the last 16 if they beat the Philippines.\nNorway, who lost to the co-hosts on the opening day, need to get something out of their game with Switzerland - who could also reach the knockout stages.\nGroup H | Sydney | 03:00 BST | BBC\nSouth Korea's Phair, who only turned 16 last month, will be the youngest player in Women's World Cup history if she plays in either of their first two games.\nThe uncapped striker, who was born in the United States to a Korean mother, will become the first mixed-race player to play for South Korea.\n\"I've tried to keep Casey away from the press,\" South Korea's English boss Colin Bell told BBC Sport. \"I wanted her to settle in first, to keep her feet on the ground and concentrate on what she's doing.\n\"She's very powerful, very fast, strong. She's got that self-belief, one of the aspects I've always admired from the US girls who go on to the pitch, expecting to win. That's not over-confidence or complacent, that's a clear message for every opponent: we expect to win and that's what we're going to do.\n\"That's what I've been trying to instil into this team for the last four years, and it's not easy because it is a big cultural difference to go from this underdog mentality to a mentality that the expectation is to win.\"\nColombia made headlines before the World Cup when their friendly against the Republic of Ireland was cancelled after 20 minutes, with the Irish saying the South Americans were \"overly physical\".\nNelson Abadia's side, beaten Copa America finalists last year, are looking to build on their one World Cup victory, against France, back in 2015.\nOne of their stars is 18-year-old Real Madrid forward Linda Caicedo.\nRachel Brown-Finnis' prediction: South Korea are very a technical team whereas, from what I've seen of Colombia, they are a little less organised.\nIt's going to be quite tight in terms of who gets out of the group along with Germany, and a draw here would leave things very open. 1-1\nKey stat: Both sides have reached the knockout stages once before, with each of them losing in the last 16 in 2015.\nGroup A | Wellington | 06:30 BST | ITV\nCo-hosts New Zealand beat the Philippines 2-1 last year in a friendly and will be hopeful of repeating the trick now and moving to the brink of the last 16.\nTheir surprise 1-0 win over Norway on the opening day was their first-ever Women's World Cup win.\nMidfielder Malia Steinmetz said: \"It's one of our main reasons why we've been trying to push so hard to play in the way that we do, is just for the younger generation, we want to inspire the country and I think you can see parts of that and we just want to keep the ball rolling and keep inspiring more if we can.\"\nThe Philippines, on the other hand, need to bounce back from a 2-0 loss to Switzerland in their World Cup opener to have any chance.\nTheir coach, Australian Alen Stajcic, said: \"You have to block all that [the home support] out and embrace it.\n\"It's a brilliant occasion, so to be playing in front of such a big crowd and TV audience is a really special moment.\n\"You have to go out there and give it your best shot, so as motivating as it will be for New Zealand, it is for our team as well.\"\nRachel Brown-Finnis' prediction: New Zealand know they are through to the last-16 if they see off the Philippines, which is a huge incentive, and I think we will see them go on the attack straight away.\nThe home crowd will be right behind them again too, and it is going to be tough for the Philippines to stop them. 2-0\nKey stat: New Zealand's 1-0 win against Norway was their first-ever victory at the Women's World Cup, having drawn three and lost 12 of their first 15 such games.\nGroup A | Waikato | 09:00 BST | ITV\nNorway need to recover quickly from their opening loss to New Zealand or they could be in trouble.\nStar striker Ada Hegerberg is looking for her first major tournament goal since 2015, although she missed most of that time because of a self-imposed five-year exile from the national team.\nThe 2018 Ballon d'Or winner said: \"My focus is solely on how can I prepare to be at my best to serve the team in the best position. I truly think about one thing and it's to win. I'm prepared for what's to come and I learn a lot from my experience.\n\"I try to guide with a lot of positivity. It gets very serious in times like this and I think at some point we've got to lower the pressure a little bit, try to enjoy football because I know we can perform at a good level.\n\"We've got the quality to perform, so sometimes you've got to take it down a bit and try to be sound technically and rely on our strengths.\"\nBarcelona winger Caroline Graham Hansen is available following illness earlier in the week.\nSwitzerland's win over the Philippines on Friday was only their second ever at a World Cup, and put them close to the knockout stages.\nThat was Inka Grings' first competitive game in charge, with the Germany playing legend only taking over earlier this year.\nRachel Brown-Finnis' prediction: I've heard rumblings from inside the Norway camp that there are differences in opinion about how they should be playing, and no joined-up thinking in the squad about their style of play.\nThey clearly have some issues to sort out, which is why I can see the Swiss getting the win that would send them through, and put Norway out. 1-0\nKey stat: Having won their first nine Fifa Women's World Cup matches against fellow European sides, Norway have since gone winless in their last five against such opposition (D1 L4).", "url": "https://www.bbc.com/sport/football/66291338"}