{"authors": ["John Haughey", "www.facebook.com"], "date_download": "2025-05-21 05:30:29", "date_modify": "2025-05-21 05:30:29", "date_publish": "2025-04-03 05:19:32", "description": "Tyrone man Nick Griggs resumes running again after battling a \"chronic illness\" precipitated by a fall at the European Cross Country Championships.", "filename": "sport_athletics_articles_c78j9w68nqvo_1747805429.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1e10/live/5fbcc7e0-0fda-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_athletics_articles_c78j9w68nqvo_1747805429.html", "title": "Nick Griggs: Tyrone athlete back training after battling 'chronic illness'", "title_page": "Nick Griggs: Tyrone athlete back training after battling 'chronic illness' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"I'm 20 years old, a professional athlete, should be in the prime of my life and I can't even put my socks on.\"\nNick Griggs recalls a period he admits frightened him, but one he is emerging from after resuming running over the last fortnight. It will be some weeks, however, before he is able to do a full training load.\nThe last time most of us saw the precocious Tyrone talent, he was running his way on 8 December to a brilliant silver medal in the under-23 race at the European Cross Championships in Antalya.\nHowever, the best medical guess is that the knee infection which soon was preventing the Ireland athlete from even bending his right leg began that very day in Turkey after he was pushed to the ground on a congested startline.\nGriggs, who burst into Irish athletics consciousness in 2021 by winning the European Under-20 3,000m title as a 16-year-old, describes his subsequent torment by mid-January when the pain was such that he had to ask his father to drive him from their home in Newmills to Belfast and back so that he could get yet another scan.\n\"I feel like I'm a tough person mentally but it has been challenging. The worst bit was when it did get better and I thinking 'class, I'm getting better' to literally that Tuesday night where I couldn't drive myself to my scan and my dad had to drive me,\" Griggs told BBC Sport NI of that particularly difficult day.\n\"I just sat in my room, staring at my Xbox. It had been almost three or four weeks since I had been able to do any training and it had just gotten worse. I was thinking 'what the hell is wrong with me? I'm in pain sitting here and I can't bend my leg'.\"\nNow that he's coming out the other side of a \"pretty grim\" period, with him set to join his regular training partners in coach Mark Kirk's group of athletes travelling to the Pyrenees next week, Griggs is able to look back at what happened in Antalya.\n\"The gun went and I took one or two steps and I was feeling two hands on my shoulders which literally pushed me to the floor,\" added the Tyrone man, who was up near the front because his previous medal exploits at the event meant he was among the elite performers being introduced to the spectators.\n\"I got up and kept running and finished [second] and then about an hour later, I was in my cool down [run] and I said to Callum [Morgan] my team-mate and regular training partner, 'my knee is really, really sore. I don't know what that is'.\n\"It felt like it was in the bone...I remember thinking that to myself.\"\nBut there was a medal ceremony to do and he wasn't the only Irish athlete who limped his way back to the hotel with Cormac Dixon having got spiked.\n\"A few people said you got spiked. It might swell up a bit but in a week you'll be fine.\n\"I kept training for probably three weeks. Three full training weeks of probably 85 to 90 miles or whatever I was doing at the time but it just got to a point where I literally couldn't run any more.\"\nAmid scans which didn't diagnose why there was a fluid build-up in Griggs' right knee, ice and compression treatment at the Sport Institute of Northern Ireland did initially appear to work in the first half of January.\nHowever, a sudden deterioration soon left the middle-distance athlete effectively back at square one.\n\"The fluid had meant the range of movement was gone, I couldn't run, couldn't cycle, couldn't do anything but this time it was actually different where I could wake up in the middle of the night and it would be throbbing in pain.\"\nAfter yet another scan on the afternoon before Storm Eowyn wreaked havoc, with osteomyelitis, a bone infection, by now having been diagnosed, medics told Griggs he was going to require twice-daily doses of intravenous antibiotics during a two-week hospital stay, followed by a further month of oral medication.\n\"It wasn't an injury, more like a chronic illness. By the time I got into hospital, I couldn't wait to get in there because it was so sore. I would get up in the morning and even putting my foot down would be sore,\" added the Tyrone man, who clocked huge 3,000m and 5,000m personal bests last summer in addition to bettering his 1500m time.\n\"I had osteomyelitis. Mine was in the knee cap. It hadn't spread to the joint or the femur or anywhere else and I got quite lucky that it was quite localised.\n\"If it spreads to the joint, you could be in serious trouble – you wouldn't have to get your leg amputated – but the knee might never be the same again.\"\nThe freakish nature of what afflicted the runner is emphasised by his physio and strength and conditioning coach, in conjunction with the medics who looked after Griggs, now planning to a do a research paper on his case as there is no previous literature on this type of ailment in the sport of athletics.\nAfter being discharged from Belfast's Musgrave Park Hospital on 14 February, Griggs wasn't allowed to do any running for a month with his return to exercise restricted to gentle cycling and walking.\n\"It was just spinning the legs. I wasn't allowed to get my heart rate up because that could have caused the infection to spread again.\n\"For the last two weeks that I was still on antibiotics, I was cycling but doing it five times a week and walking the other days and for the last five minutes, I was allowed to get my heart rate up to 140 which is like an easy run pace.\"\nThe three-time European Cross Country individual medallist was able to resume running just over a fortnight ago and this week is up to a regime of 25 miles, which will be gradually increased if all goes to plan.\n\"I did 50 minutes yesterday and I'll do 55 minutes tomorrow. I'm running every other day at the moment so I'm doing four days this week and I'm still got the cycling,\" said Griggs on Wednesday.\n\"You feel like you're working again and being productive and building fitness. Obviously there's a long way to go but I'm getting there.\"\nGriggs has returned to social media in recent days and is grateful for the messages of support he has been receiving, which he hopes to get round to answering.\n\"You just don't want to go on Instagram when you're lying in a hospital bed with a tube in your arm.\n\"Mentally for me, removing myself from social media was easier than to force myself to look at and see people running fast times.\"\nIn those days, it made more sense for him to fall back on the support of parents Andy and Royanne, his immediate friends as well as his coaches and training partners.\n\"My family and friends who were there to support me and all the team, the coach, physio, S&C coach, the doctors who were involved and everyone in the NHS who attended to me were all unbelievable. Without all of them, who knows what would have happened.\"\nAfter missing out on the indoor season, Griggs is optimistic he will have a summer outdoor campaign, with the staging of the World Championships in September giving him additional catch-up time.\n\"We're still trying to make the World Championships but right now, it's just about trying not to even think about that.\n\"So much can change in a day or two or a week or two which I've learned the hard way over the past few months.\n\"Getting up to those 90-mile weeks, who knows when that could be. It could be in mid-May or June. You don't know what's going to happen.\"", "url": "https://www.bbc.com/sport/athletics/articles/c78j9w68nqvo"}