{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:23", "date_modify": "2025-05-21 05:28:23", "date_publish": "2025-04-03 10:23:48", "description": "Zambia withdraw four US-based players for an upcoming tournament in China because of \"travel measures\" introduced by Donald Trump's administration.", "filename": "sport_football_articles_cp315ppdy10o_1747805303.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c94c/live/f85d6fe0-1070-11f0-a161-1f18bc46c434.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cp315ppdy10o_1747805303.html", "title": "Zambia's women's national team withdraw four US-based players for China trip", "title_page": "Zambia's women's national team withdraw four US-based players for China trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Zambia's women's team have withdrawn four United States-based players from their squad for an upcoming tournament in China because of \"travel measures\" introduced by US President Donald Trump.\nThe Football Association of Zambia (Faz) announced four players - captain Barbra Banda, Racheal Kundananji, Prisca Chilufya and Grace Chanda - would miss the Yongchuan International Tournament this month.\nAll four players play in the National Women's Soccer League (NWSL), with Chanda, Banda and Kundananji at Orlando Pride and Chilufya with Bay FC.\nFaz said its decision was due to the \"additional travel measures introduced by the new administration\" in the US.\nSince taking office for the second time, Trump has signed an executive order to draft a list of countries that will mean a partial or full suspension on visitors from some nations.\nIt is unclear if China is on the proposed list, but non-American residents have experienced increased difficulty in re-entering the country in recent months.\nFaz said it was in the \"best interest\" of the US-based players not to make the trip.\n\"After working through the process instigated by recently introduced measures it was decided that it is in the best interest of our players to skip this assignment,\" Faz general secretary Reuben Kamanga said.\n\"They will definitely be available for future assignments as they were for the last window when we played Malawi.\"\nZambia face Thailand on 5 April before taking on either hosts China or Uzbekistan on 8 April.", "url": "https://www.bbc.com/sport/football/articles/cp315ppdy10o"}