{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-20 13:13:50", "date_modify": "2025-05-20 13:13:50", "date_publish": "2023-08-01 06:00:51", "description": "The Netherlands top Group E ahead of reigning champions the United States as they thrash Vietnam in Dunedin.", "filename": "sport_football_66369501_1747746830.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1522/production/_130601450_gettyimages-1568472866.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66369501_1747746830.html", "title": "Vietnam 0-7 Netherlands: Dutch win Group E ahead of reigning champions United States", "title_page": "Vietnam 0-7 Netherlands: Dutch win Group E ahead of reigning champions United States - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The Netherlands' topped Group E of the Women's World Cup ahead of the United States as they secured an emphatic 7-0 victory over Vietnam.\nEsmee Brugts scored two sublime, near-identical curling efforts, either side of the break.\nJill Roord also netted twice with Lieke Martens, Katja Snoeijs and Danielle van de Donk the other Dutch scorers.\nThe 2019 runners-up will be in action against the runners-up from Group G in the first last 16 on Sunday.\nThe Dutch started the third and final group game second in Group E, behind the United States on goal difference, while Vietnam were already eliminated following a defeat by fellow debutants Portugal in their previous game.\nNetherlands boss Andries Jonker named an unchanged starting line-up from the side that confirmed they are contenders in this tournament when they held reigning world champions the USA to a 1-1 draw.\nThe Netherlands may be missing their all-time top goalscorer in Vivianne Miedema, who is out with an ACL injury, but they had little trouble in finding the back of the net against Vietnam, with five different goalscorers.\nVietnam's quest for a first-ever World Cup goal started brightly, but it proved to be short lived as Martens chested down Dominique Janssen's ball over the Vietnam defence and lobbed keeper Thi Kim Thanh Tran to give the Netherlands the lead after eight minutes.\nIt opened the floodgates with an unmarked Snoeijs adding a quick second before Brugts fired home a wonderful curling shot from outside of the box to give the Netherlands a 3-0 lead after 18 minutes.\nWhen Manchester City summer signing Roord tapped in a fourth it was enough to convince Vietnam boss Mai Duc Chung into a double substitution after only 28 minutes, with Thi Thu Thuong Luong and Thi Loan Hoang the unfortunate pair to depart prematurely, replaced by Thi Kieu Chuong and Thi My Anh Nguyen.\nVietnam went 22 minutes without conceding but an inevitable fifth arrived just before the break as Van de Donk latched onto a rebound.\nThe Golden Star Warriors changed their goalkeeper at half-time, but Thi Hang Khong could do little to stop Brugts' superb second goal, which was an almost exact replica of her first.\nThe biggest winning margin of the tournament so far was completed when Stefanie van der Gragt headed the ball into Roord's path for an easy finish.", "url": "https://www.bbc.com/sport/football/66369501"}