{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:47:35", "date_modify": "2025-05-20 13:47:35", "date_publish": "2023-08-01 00:00:00", "description": "Reaction as the United States survive a huge scare to reach the last 16 as the Netherlands top Group E at the 2023 Women's World Cup.", "filename": "sport_live_football_66183685_1747748855.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1075C/production/_130602476_gettyimages-1584683481.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183685_1747748855.html", "title": "Fifa Women's World Cup LIVE: Portugal v USA & Vietnam v Netherlands", "title_page": "Fifa Women's World Cup LIVE: Portugal v USA & Vietnam v Netherlands - score & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Follow the Lionesses' match with China\nChina v England (12:00 BST)\nThanks all, we're bringing our Group E coverage to an end now.\nBut stick with us for build-up to England's match with China and Haiti's game with Denmark (both at 12:00 BST).\nBuild-up to those matches has just got under way on our dedicated live page.\nSee you there!\n'The small teams getting better is amazing for women's football'\nFT: Portugal 0-0 United States\nVicky Losada\nFormer Spain midfielder on ITV 1\nI think Portugal's style was one of the worst to play against for USA. Sweden is a bit similar to them.\nThey need to analyse, bring their confidence up.\nIt's great to see how the tournament is changing, how the small teams are getting better and I think it's amazing for women's football in general.\nPost\nIn the next round the USA will face the Group G winners - which will almost certainly be Sweden.\nIn the last 16 the Netherlands will play the Group G runners-up. Italy are currently second in that group.\n'It's tough to be second'\nFT: Portugal 0-0 United States\nUSA co-captain Alex Morgan speaking after the match to ITV1:\nOn finishing second in the group: \"It's tough to be second, we wanted to go through first. This team gave everything, we just didn't put the ball in the back of the net.\n\"Players came in and helped the team. It's not the result we wanted but we move forward.\nIt's just not going in the back of the net, we got so many corners, so many opportunities but just so unlucky.\"\n'USA are not flowing'\nFT: Portugal 0-0 United States\nKim Little\nFormer Scotland midfielder on ITV1\nThe USA are not flowing or connecting. Rapinoe made a slight difference when she came on but generally their substitutions didn't make an impact.\nGoing forward into the knockout rounds, that needs to be looked at.\n'I enjoyed watching Portugal'\nFT: Portugal 0-0 United States\nKim Little\nFormer Scotland midfielder on ITV1\nIt is unusual for the USA to be in this position and credit to Portugal for their performance.\nThey tired a little in the second half and they got the chance at the end.\nI really enjoyed watching them.", "url": "https://www.bbc.com/sport/live/football/66183685"}