{"authors": ["Emily Salley", "www.facebook.com"], "date_download": "2025-05-21 04:22:21", "date_modify": "2025-05-21 04:22:21", "date_publish": "2025-04-06 05:36:56", "description": "BBC Sport looks at how close Southampton are to becoming the worst-ever Premier League team and how Derby fans would feel to give up their crown.", "filename": "sport_football_articles_cly8272z90do_1747801341.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04da/live/0528e910-10a9-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cly8272z90do_1747801341.html", "title": "Southampton: What does it mean to be Premier League's worst team and will Saints replace Derby?", "title_page": "Southampton: What does it mean to be Premier League's worst team and will Saints replace Derby? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"If we didn't laugh we'd cry.\"\nWhen Derby County completed the 2007-08 campaign with a mere 11 points - the lowest tally in Premier League history - it seemed like a record that would never be broken.\nThe club have since become the answer to a commonly-used pub quiz question: Who are the worst team in Premier League history?\nBut that unwanted tag could potentially become someone else's burden as Southampton sit bottom on 10 points with eight games to go.\nWhile the Saints have a few more weeks to pick up the points required to avoid that unwanted statistic, their relegation could be confirmed as early as Sunday if they lose at Tottenham.\n\"It's baffling,\" admitted Derby supporter Jake Barker. \"I don't think any Derby fan ever expected anyone to come close, let alone this close.\"\nBBC Sport looks at how close the Saints really are to becoming the worst-ever Premier League team - and how Rams fans would feel to give up their crown.\nDuring Derby's torrid season, they won one game, scored 20 goals and finished with a goal difference of -69.\nThey suffered some heavy defeats, losing by five goals or more to Liverpool, Arsenal, West Ham, Chelsea and Aston Villa.\nDerby player Andy Todd later said many players \"threw the towel in\" during that campaign, while manager Paul Jewell revealed he was advised never to take the job.\n\"The atmosphere was almost pantomime-like at times with chants of 'let's pretend we scored a goal' and 'you're nothing special - we lose every week',\" Derby County fan Amelia Warren told BBC Sport.\n\"Those kinds of things are obviously not what you want to hear your fans chanting, but ultimately we had to make our own fun. If we didn't laugh we'd cry!\"\nIt was such an awful season that Jewell, who arrived in November 2007 and left in December 2008, said his managerial career \"never really recovered\".\nYet Derby fans made the most of a bad situation.\n\"Weirdly, I think Derby fans have worn the 'worst team in history' tag as a badge of honour,\" said Barker, the host and creator of Derby podcast RamsTalk.\n\"The team was awful, got battered most weeks, won one game all season, which I missed, and yet still sold out every week, which in my eyes shows how good this fanbase was and still is.\"\nWhile there are some Derby fans out there who have seen it as an \"honour\" to be recognised as the worst team in Premier League history, it seems the majority would be relieved for Southampton to take the unwelcome title off their hands.\n\"It would be the monkey off the back,\" Derby fan Nick Webster said.\n\"Down in the Midlands, we have our fingers crossed that they [Southampton] don't pick up any more points.\"\nBarker added: \"That 07-08 team was such a shambles on and off the pitch that it felt almost impossible that any team in the modern era, especially with the money that's now in the game, would come anywhere close.\n\"If it happens, I'd argue it's far worse than Derby's 11-point season.\"\nIn the aftermath of Southampton's 1-1 draw against Crystal Palace on Wednesday, defender Taylor Harwood-Bellis said talk of trying to not be the worst Premier League side ever is \"embarrassing\".\n\"We just want to get over it,\" Harwood-Bellis told BBC Radio Solent.\n\"It pains us to even say that is the case. It's not somewhere we expected to be and it's embarrassing - we're not going to shy away from that.\"\nSouthampton have, at least, bettered Derby's 2007-08 win record, with two victories to the Rams' one.\nHowever, Ivan Juric, who took charge after Russell Martin was sacked in December, has challenged his players to prove they are not \"the worst team in the history of the Premier League\".", "url": "https://www.bbc.com/sport/football/articles/cly8272z90do"}