{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-21 04:21:10", "date_modify": "2025-05-21 04:21:10", "date_publish": "2025-04-06 06:39:07", "description": "Red Bull's Max Verstappen sees off a race-long challenge from the McLarens of Lando Norris and Oscar Piastri to win the Japanese Grand Prix.", "filename": "sport_formula1_articles_c33zd0v8mrko_1747801270.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/003b/live/39ac93f0-12b4-11f0-a721-abb44f0253d2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_formula1_articles_c33zd0v8mrko_1747801270.html", "title": "Japanese Grand Prix result: Max Verstappen wins from Lando Norris and Oscar Piastri", "title_page": "Japanese Grand Prix result: Max Verstappen wins from Lando Norris and Oscar Piastri - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Red Bull's Max Verstappen fended off a race-long challenge from the McLarens of Lando Norris and Oscar Piastri to win the Japanese Grand Prix.\nThe Dutchman's fourth consecutive victory at Suzuka was his first of the year and moves him to within one point of Norris at the head of the drivers' championship.\nVerstappen's drive was cool under intense pressure, with rarely more than two seconds between him and Norris, and founded on a quite brilliant pole position lap on Saturday.\nMcLaren had feared that the Red Bull would be difficult to pass if Verstappen held the lead at the start, and so it proved.\nRain overnight and on the morning of the race helped ensure there was no repeat of the grass fires that affected practice and qualifying on Friday and Saturday.\nVerstappen led the two McLarens for the entire first stint, the three lapping closely together.\nThere were questions as to why McLaren pitted Piastri first, when it might have made sense to attack Verstappen with Norris making an earlier pit stop, potentially giving the Briton the opportunity to get ahead.\nMcLaren had already radioed Norris for a 'dummy' stop two laps earlier and Norris was within 1.5 seconds of Verstappen - theoretically just about within range of an undercut - on the lap Piastri stopped.\nMcLaren said they had to pit Piastri because he was at risk of being undercut by Mercedes' George Russell, who stopped on lap 19 and was quick on his hard tyres.\nVerstappen and Norris stopped on the same lap, one later than Piastri, and there was an immediate flashpoint.\nAs Verstappen and Norris pitted, they were separated by just 1.5 seconds. McLaren's stop was faster by a second, and as they left the pits the McLaren was halfway alongside the Red Bull.\nBut Verstappen held his line, and Norris ran out of track, taking to the grass.\nNorris complained about Verstappen's driving, saying he had been pushed off, while Verstappen countered by saying his rival had driven off by himself. The stewards agreed with the four-time world champion.\nAfter the race, Norris said: \"He had the position and he had the right to do what he did, so fair play.\"\nFrom then on, Norris and Piastri tracked Verstappen for the final 32 laps, with just over two seconds separating them most of the time.\nBut Norris could not get within a second of Verstappen, and in fact it was Piastri who looked to have the best pace, sometimes closing to within 0.5secs of his team-mate.\nPiastri suggested to the team that he felt he had the pace to beat Verstappen - a thinly veiled request to be let past.\nBut McLaren did not interfere in their battle and the first three drivers crossed the line in the order they had held all race, separated by just 2.2 seconds.\nPiastri moves into third place in the championship ahead of Russell, and is 13 points behind his team-mate.\nVerstappen said: \"It was tough, just pushing very hard on the last set. The two McLarens were pushing me very hard.\n\"I'm incredibly happy. It started off quite tough this weekend but we didn't give up, we carried on improving the car and today it was in its best form. Starting on pole was very important.\"\nNorris added: \"The pace was too similar to do anything more. Long race, a lot of pushing, flat out from start to finish, but nothing special we had to get Max on. He deserved it.\n\"They were quick, they've made some improvements and we'll have to work hard.\"\nThe top three were in a race of their own and the entire grand prix was pretty static in terms of order.\nFerrari's Charles Leclerc held off Russell for fourth place, while the Briton's team-mate Andrea Kimi Antonelli put in a strong final stint to close to less than two seconds behind his team-mate.\nItalian Antonelli led the race after Verstappen, Norris and Piastri pitted and became the youngest driver in Formula 1 history to do so, at 18 years and 224 days. Verstappen was four days older when he won the 2016 Spanish Grand Prix.\nAntonelli also became the youngest driver to set the fastest lap, again beating Verstappen from the 2016 Brazilian Grand Prix.\nLewis Hamilton, on an alternate tyre strategy, took seventh from eighth place on the grid, getting ahead of Racing Bulls' Isack Hadjar early in the race. It was the only position change in the top 10.\nAlex Albon drove an attacking race, complaining to the Williams team about his strategy, to take ninth, ahead of the Haas of Briton Oliver Bearman.\nIn his first race for Red Bull, Yuki Tsunoda finished 12th with the man he replaced, Liam Lawson, 17th in the Racing Bull.\nBritish racing driver Alice Powell on BBC Radio 5 Live\nThat was perfection from Max Verstappen, as he said. He hasn't got the fastest car underneath him and we didn't expect him to win this race.\nI think Lando Norris will be thinking that he should have slotted right behind Verstappen [on the pit-stop exit]. He had a faster pit stop by a second compared to Verstappen. It could have been a different story to this race if Norris did slot in behind, he would have been only a couple of tenths behind down into Turn One.", "url": "https://www.bbc.com/sport/formula1/articles/c33zd0v8mrko"}