{"authors": ["Alex Brotherton", "www.facebook.com"], "date_download": "2025-04-26 06:39:06", "date_modify": "2025-04-26 06:39:06", "date_publish": "2025-03-02 16:37:58", "description": "Manchester United beat Leicester to keep up their push for Champions League qualification.", "filename": "sport_football_articles_clynz9wmwgno_1745649546.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/348b/live/887f1bb0-f784-11ef-a7e0-1fbd7c9e9e6f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_clynz9wmwgno_1745649546.html", "title": "Man Utd 2-0 Leicester: United continue Champions League push", "title_page": "Man Utd 2-0 Leicester: United continue Champions League push - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Manchester United manager Marc Skinner was dealt a tough hand ahead of his side's WSL meeting with Leicester on Sunday.\nTop scorer Elisabeth Terland was unavailable after picking up a knock on international duty, while some of his players flew halfway around the globe on Thursday night to report back for training on Friday.\nDespite that, United produced the kind of performance that has put them in pole position to qualify for the Champions League for just a second time.\nMelvine Malard made the most of the opportunity afforded to her by Terland's absence, the striker scoring the opener before setting up United's second.\nThough United flagged in the second half - as Skinner predicted might happen - the home side never really looked in danger of throwing away a seventh consecutive league win.\nLeicester came into the match with two wins in their previous three outings, more than in their 19 league matches prior.\nAmandine Miquel can take positives from the way her side went at United after the break, in particular the performance of Nicole Momiki just three days after she scored in Japan's 2-1 win against the United States in California.\nGoals are still an issue for the Foxes, having scored just nine in 15 games this term.\nAfter facing Chelsea on Wednesday, they'll look to exploit the leaky defences of Brighton and Tottenham in the coming weeks.", "url": "https://www.bbc.co.uk/sport/football/articles/clynz9wmwgno"}