{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:32:59", "date_modify": "2025-05-19 15:32:59", "date_publish": "2015-02-04 07:00:22", "description": "Rangers chase sixth signing as St Mirren eye Irish striker...", "filename": "sport_football_31125610_1747668779.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/75814000/jpg/_75814058_gossip_promo_sportfootball(2).jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31125610_1747668779.html", "title": "Wednesday's Scottish gossip", "title_page": "Wednesday's Scottish gossip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rangers shareholder Dave King will outline his vision for the future of the club today at a media conference in Glasgow city centre, where he is set to confront the challenges facing the club, now under the grip of Sports Direct tycoon Mike Ashley. (Daily Record), external\nMike Ashley's Sports Direct is facing a claim for millions of pounds from nearly 300 workers who were left out of a multi-million bonus scheme because they were on zero-hours contracts. (The Herald), external\nNew Rangers signing Remi Streete last night insisted that he and his four Newcastle United team-mates - Haris Vuckic, Gael Bigirimana, Shane Ferguson and Kevin Mbabu - were not forced to relocate to Ibrox by Magpies owner and Rangers shareholder Mike Ashley. (The Scotsman), external\nRangers are looking to sign an out-of-contract player in addition to the five loan additions arriving from Newcastle United. (Daily Telegraph, print edition)\nDefender Remie Streete is confident his loan switch to Rangers from Newcastle United will not be blocked because of Fifa rules. (Daily Record), external\nFrench striker Mickael Antoine-Curier could be in line for a move to China after the 31-year-old was released by Hamilton Academical. (The Sun, print edition)\nSt Mirren are hoping to sign Republic of Ireland Under-21 forward Kieran Sadlier after the 20-year-old was released by West Ham United. (The Sun, print edition)\nMotherwell completed a late £50,000 move to sign Kidderminster Harriers winger Marvin Johnson thanks to the backing of new owner Les Hutchison. (Daily Express, print edition)\nManager Alan Stubbs believes Hibernian's refusal to part with prize asset Scott Allan amid deadline-day interest from Dundee United represents a \"statement of intent\" from the Scottish Championship club. (The Scotsman), external\nMidfielder Darren Fletcher has revealed that Scotland team-mate James Morrison persuaded him to move to West Brom from Manchester United. (The Herald), external\nDarren Fletcher, who joined West Brom on Monday, says Manchester United manager Louis Van Gaal wanted him to stay at Old Trafford. (The Sun), external\nInverness Caledonian Thistle defender Josh Meekings has been left frustrated by the failure to agree a new contract beyond the summer while team-mates Billy Mckay and Graeme Shinnie have secured moves to Wigan Athletic and Aberdeen respectively. (Daily Record), external", "url": "https://www.bbc.com/sport/football/31125610"}