{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:17", "date_modify": "2025-05-20 12:32:17", "date_publish": "2023-08-04 10:09:16", "description": "Jack Taylor believes a Championship promotion challenge by Ipswich is possible, but goalkeeper Christian Walton is out for a few months.", "filename": "sport_football_66405372_1747744337.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5AEA/production/_130647232_gettyimages-1571365017.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66405372_1747744337.html", "title": "Jack Taylor: Ipswich summer signing believes promotion challenge is possible", "title_page": "Jack Taylor: Ipswich summer signing believes promotion challenge is possible - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Summer signing Jack Taylor believes Ipswich have the quality to \"do a Luton\" and challenge for promotion from the Championship this season.\nMidfielder Taylor joined the Tractor Boys from Peterborough and is relishing a second crack at the second tier.\nIpswich will, though, be without goalkeeper Christian Walton for \"a few months\" because of a foot injury.\n\"It's a pretty tough division but I think teams will fear us as well,\" Taylor told BBC Radio Suffolk.\n\"If you make an error, they're going to pounce on it. There are more clinical players and it's obviously a more physical game, but the way we've trained this pre-season, we're more than ready.\n\"Last year no-one would have said Luton would have gone up so why can't we go and replicate that?\"\nThe 25-year-old played 34 games in the Championship for Posh in 2021-22 but was hampered by a number of injury niggles.\nThey were in the bottom three from November 2021 right through to the end of the campaign two seasons ago, but Taylor does not expect Ipswich - who are away to Sunderland on Sunday - to encounter similar difficulties.\n\"It was never spoken about at the start as survival, but when it comes to Christmas time and you're struggling a little bit, it becomes (about) survival. I don't think that will be an issue here,\" he said.\n\"Obviously you want to pick up the wins nice and early, but it's not the be-all and end-all because teams are still figuring out styles of play, new players, things like that.\"\nTaylor scored 10 goals in 52 games as Posh reached the League One play-offs last season before losing to Sheffield Wednesday on penalties.\nHe hopes to contribute a few goals for Ipswich, but said: \"I'm looking to kick on, especially in the defensive side of the game which I need to improve. I think I can go to the next level.\n\"Staying injury free was a massive boost for me last season so I'm looking to do the same this year.\"", "url": "https://www.bbc.com/sport/football/66405372"}