{"authors": ["Niall Keenan", "www.facebook.com"], "date_download": "2025-04-26 06:15:04", "date_modify": "2025-04-26 06:15:04", "date_publish": "2025-03-01 22:20:46", "description": "Down are plunged into further relegation danger after a defeat by Cavan while Fermanagh earn a draw with Sligo and Antrim lose out to Laois.", "filename": "sport_articles_c871p2y0r8vo_1745648104.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4207/live/975f9aa0-f6ea-11ef-a079-3901ac6f42dc.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c871p2y0r8vo_1745648104.html", "title": "Cavan beat Down as Fermanagh draw and Antrim defeated", "title_page": "Football League: Cavan beat Down as Fermanagh draw and Antrim defeated - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Down were plunged into further relegation danger as they suffered a damaging 1-20 to 1-18 defeat to Cavan at Kingspan Breffni in Division Two.\nIn Division Three, Fermanagh fought back from five points down heading into stoppage time to snatch a 0-19 draw with Sligo in Enniskillen to move ahead of Antrim, who fell to a 0-22 to 1-17 loss away to Laois.\nSaturday evening's Ulster derby felt like a must-win game for Down following back-to-back defeats, leaving them only ahead of a pointless Westmeath.\nCavan, meanwhile, had put together consecutive wins to ease their relegation concerns. Raymond Galligan's side kept their noses in front throughout the first half despite Miceal Rooney's 15th-minute goal for the Mourne County.\nA converted mark from Gearoid McKiernan, after points from Cormac O'Reilly and Oisin Kiernan, meant the Breffnimen led 0-12 to 1-6 at the short whistle.\nThe second half was very much tit-for-tat with Down nudging ahead after a Pat Havern two-pointer was followed by a white flag raised courtesy of Daniel Guinness.\nWhen Padraig Faulkner netted on the 45th minute it was Cavan in front once more but the hosts wouldn't lead again until eight minutes from time.\nMcKiernan struck from beyond the arc at a vital time and after Down equalised once more a pair of frees from Oisin Brady squeezed Galligan's men over the line.\nConor Laverty's side stay seventh with two games remaining and could be all but relegated by the next time they take to the field at home to Westmeath before what looks to be a daunting trip to take on promotion-chasing Monaghan in Clones.\nCavan can start looking up the table themselves with an outside chance of making it into the top two.", "url": "https://www.bbc.co.uk/sport/articles/c871p2y0r8vo"}