{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:30", "date_modify": "2025-05-21 06:55:30", "date_publish": "2025-01-04 11:20:11", "description": "Brighton vs Arsenal predictions: Chris Sutton on Premier League game", "filename": "sport_football_articles_cwypqzvjqv2o_1747810530.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b0ed/live/c2a365b0-c9fa-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwypqzvjqv2o_1747810530.html", "title": "Brighton vs Arsenal predictions: Chris Sutton on Premier League game", "title_page": "Brighton vs Arsenal predictions: Chris Sutton on Premier League game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chris Sutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 20, he takes on The Zutons frontman Dave McCabe, who supports Liverpool.\nSutton's prediction: 1-2\nI was very impressed with the way Arsenal beat Brentford without any fuss on Wednesday.\nThe Gunners were without Bukayo Saka and Kai Havertz, and Declan Rice did not start, but it did not matter. They just got on with it and did not seem to panic when they went a goal down.\nWith Brentford's home form being so strong I thought it would be a close game - but it really wasn't in the end.\nIt was a very mature performance and that bodes well for the second half of the season, which is when they really got going last year.\nI would not describe this as an easy fixture for them, especially because they need to win it. Brighton have not won any of their past seven games but they have drawn five of them and are turning into the Premier League's draw specialists.\nBut there is more to come from Mikel Arteta's side and I look at them and think they will get the job done here too.\nMcCabe's prediction: 1-2\nArsenal are looking good. They are calm, even when they go a goal down.", "url": "https://www.bbc.com/sport/football/articles/cwypqzvjqv2o"}