{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:52", "date_modify": "2025-05-20 12:32:52", "date_publish": "2023-08-04 09:53:31", "description": "Ashcroft relishing 'bouncing' Dens as he seeks Dundee consistency", "filename": "sport_articles_crgl19rn8jzo_1747744372.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd0d/live/6bfc61d0-32ac-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_crgl19rn8jzo_1747744372.html", "title": "Ashcroft relishing 'bouncing' Dens as he seeks Dundee consistency", "title_page": "Ashcroft relishing 'bouncing' Dens as he seeks Dundee consistency\n - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tyrone Smith, BBC Sport Scotland\nDefender Lee Ashcroft believes consistency will be the key to Dundee enjoying a fruitful season back in the Scottish Premiership.\nAshcroft was part of the Dark Blues side relegated from the top division in season 2021-22 before helping them bounce back at the first attempt with Championship title success.\n\"Last time we were in the league we didn’t have that consistency,\" said the 29-year-old.\n\"It is going to be tough, there are going to be things that go against us, but hopefully we'll have consistency in our play and we can stick together with the fans and make it hard for teams coming to us.\n‘There are still a few boys here from that [Premiership] season, so hopefully we can use that experience as well as the boys that the gaffer has brought in. We have good experience, good youth and new players to the league.\"\nThe Championship flag will be unfurled at Dens Park on Saturday before the Premiership opener with Motherwell.\n\"I played up here years ago with Kilmarnock when it was flag day and I remember how bouncing the place was. I am looking forward to being part of it as a Dundee payer this time,\" added Ashcroft.\n\"Hopefully we can get a positive start because the fans will turn out in their numbers. Hopefully we can get a result that will stand us in good stead for the season.”", "url": "https://www.bbc.com/sport/articles/crgl19rn8jzo"}