{"authors": ["John Duerden", "www.facebook.com"], "date_download": "2025-04-26 08:15:10", "date_modify": "2025-04-26 08:15:10", "date_publish": "2025-02-26 10:58:38", "description": "Saudi Arabia is becoming a more attractive destination for African footballers, according to Nigeria captain William Troost-Ekong.", "filename": "sport_football_articles_cn9vgpxyrnxo_1745655310.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f83/live/36a7f880-f391-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cn9vgpxyrnxo_1745655310.html", "title": "Saudi Pro League: Africa's growing 'brotherhood' in Saudi Arabia", "title_page": "Saudi Pro League: Africa's growing 'brotherhood' in Saudi Arabia - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "African footballers will play an important role as the Saudi Pro League season moves towards its climax in May, with more than 50 talents from across the continent spread around the division's 18 teams.\nSome are world-famous names such as Pierre-Emerick Aubameyang, Sadio Mane and Riyad Mahrez, but plenty of lesser-known players are also thriving.\nMorocco striker Abderrazak Hamdallah, Cameroon forward Georges-Kevin Nkoudou, The Gambia's Musa Barrow and Myziane Maolida of Comoros have all joined Aubameyang in hitting double figures for goals in the top flight.\nAlongside the well-trodden European path, such accomplishments mean Saudi Arabia is now an increasingly attractive alternative for Africans.\n\"It is a different lifestyle and culture but if you love what you do and love the game, you can sacrifice anything,\" Nigerian winger Henry Onyekuru told BBC Sport Africa.\nAt the other end of the pitch, goalkeepers like Morocco's Yassine Bounou and defenders including Kalidou Koulibaly and William Troost-Ekong, both captains for their respective countries Senegal and Nigeria, have proven just as valuable.\n\"African players are doing well in the Pro League because the climate is similar. We are used to the heat,\" said 31-year-old Troost-Ekong, who is also captain of his club Al-Kholood.\n\"There are often big spaces in games which gives us an opportunity to show our athletic abilities - the power, the speed.\n\"Saudi Arabia is, in general, quite an easy place to adapt, especially from a place like Nigeria where half the population is Muslim.\"\nOnyekuru played for teams including Monaco, Galatasaray, Anderlecht and Olympiacos before his switch to Al-Fayah in August 2023.\nAfter spending the first eight years of his senior career in Europe, he believes the environment in Saudi Arabia can benefit those from his home continent.\n\"The lifestyle and the culture help,\" Onyekuru, who won 15 caps for Nigeria between 2017 and 2022, said.\n\"Some African players like clubbing a lot but here you can't do that. Here it is more about training and then going home, rest, watch a movie, wait for the game the next day, train and so on.\n\"With all this you can focus more. So here you can sleep well, train well and play well.\"\nIn his first campaign in the kingdom, the winger scored 10 goals to help Al-Fayah to a top-half finish and also provided ammunition for Fashion Sakala as the Zambian striker netted 19 times.\nWhile many Africans can adapt to life in Saudi Arabia, Onyekuru accepts that certain challenges remain.\n\"We don't have African restaurants here, but we manage.\n\"When we go home we try to bring those things here so we can make it at home. You don't expect an African player to eat pasta every day.\"\nWhile each Pro League team can sign ten foreign players, two of these must be born in 2003 or later.\nAs the January transfer window demonstrated, this has encouraged the signing of younger players direct from Africa.\nAl-Kholood signed Nigerian midfielder Ambrose Ochigbo from Tunisia club ES Zarzis, while title outsiders Al-Qadsiah brought in 18-year-old striker Jerry Afriyie from Ghanaian second-tier side Thoughts FC.\nAfriyie, however, will not have a say in the destination of the league trophy, having being loaned out to Spanish outfit CD Lugo.\n\"I think the Pro League is becoming more and more attractive to players to make the step directly from Africa,\" said Troost-Ekong.\n\"Ambrose and others are choosing not go to Europe first.\n\"By getting players younger, you have a chance to develop them, coach them and to be part of the project.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cn9vgpxyrnxo"}