{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:30:10", "date_modify": "2025-05-21 04:30:10", "date_publish": "2025-04-05 09:28:05", "description": "Germany great Thomas Muller will end his 25-year association with Bayern Munich when the 2024-25 campaign concludes.", "filename": "sport_football_articles_creq7rp215yo_1747801810.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a19e/live/219ba4f0-11fa-11f0-92c5-9b94116fdc0f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_creq7rp215yo_1747801810.html", "title": "Thomas Muller to leave Bayern Munich at end of season", "title_page": "Thomas Muller to leave Bayern Munich at end of season - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Germany great Thomas Muller will end his 25-year association with Bayern Munich at the end of the current season.\nThe 35-year-old has played the most games in the history of the club with 743, while he is third on their all-time scorers' list with 247 goals.\nThe attacking midfielder, who has also played as a second striker, came through Bayern's academy to make his senior debut in 2008 and has won two Champions Leagues and 12 Bundesliga titles among 33 trophies in total with the German giants.\n\"It's been an incredible journey, shaped by unique experiences, great encounters and unforgettable triumphs,\" said Muller, whose contract ends in June.\n\"I feel immense gratitude and joy that I got to make this career with my beloved club. The special connection to the club and our fantastic fans will always remain.\n\"What I want as a farewell should be clear: titles we can celebrate together, and moments we'll remember fondly for a long time. We're going to give our all in the coming weeks to bring the league title back to Munich.\"\nMuller, who scored 45 goals for Germany in 131 appearances, won the Golden Boot at the 2010 World Cup and was part of the Germany team that won the 2014 World Cup.\n\"I could have easily imagined taking on this role [with Bayern] next year as well,\" he admitted, while club CEO Jan-Christian Dreesen said: \"The most important thing is that we've found a mutual solution.\n\"Thomas Muller is one of the greatest player personalities this club has produced, and therefore it was important to us to find a fair and amicable agreement.\"\nMuller has turned out 24 times for the Bavarian outfit in the Bundesliga this campaign, scoring once, but has only started on eight occasions.\n\"The definition of a legend! It's been a pleasure to share these two years together! Let's make it a perfect ending,\" England and Bayern striker Harry Kane posted on X.\nBayern Munich said they would mark Muller's departure with a testimonial and his final opportunity to play competitively will come during the Fifa Club World Cup in the USA, which starts on 15 June.\nBayern Munich president Herbert Hainer said: \"Thomas Muller is the definition of a Bavarian fairytale career. He ranks among the most outstanding personalities in FC Bayern history.\"\nSporting director Christoph Freund said: \"Thomas Muller: no tricks, no show, just an incredible amount of instinct and extraordinary reading of the game - a pure footballer. There'll never be another one like him, that's for sure, and he internalised FC Bayern from a young age. This decision was extremely hard, as everyone can understand.\"\nBayern hold a nine-point lead over Bayer Leverkusen at the top of the Bundesliga and face Inter Milan in the quarter-finals of the Champions League.", "url": "https://www.bbc.com/sport/football/articles/creq7rp215yo"}