{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:28:39", "date_modify": "2025-05-21 06:28:39", "date_publish": "2025-04-02 00:00:00", "description": "Barcelona narrowly edge past Atletico Madrid on aggregate to set up a meeting with Real Madrid in the final of the Copa del Rey.", "filename": "sport_football_live_c7898eem58jt_1747808919.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0172/live/6d0f4f90-100b-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c7898eem58jt_1747808919.html", "title": "Barcelona edge past Atletico Madrid to set up Copa del Rey final with Real Madrid", "title_page": "Barcelona edge past Atletico Madrid to set up Copa del Rey final with Real Madrid - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Barcelona narrowly edged past Atletico Madrid on aggregate to set up a meeting with Real Madrid in the final of the Copa del Rey.\nIt will be the eighth time there has been an El Clasico in the Spanish Cup final, with the nation's two most successful club sides set to meet on 26 April in Seville.\nFerran Torres' first-half effort proved decisive for Barcelona at Metropolitano Stadium, with the Spain forward poking the ball past Argentine goalkeeper Juan Musso after Lamine Yamal's superb pass had split the home defence.\nIt was no more than the visitors deserved, with 17-year-old Yamal a constant source of danger and Raphinha also twice threatening to extend Barca's lead.\nUnlike the thrilling first-leg tie in February, when Diego Simeone's side twice scored late on in a dramatic 4-4 draw, this was a tighter and more tense affair without the grandstand finish from Atletico.\nThe hosts did have opportunities.\nSubstitute Alexander Sorloth elected to shoot instead of squaring the ball to Antoine Griezmann for a tap-in, while the Norway forward was also ruled offside after rattling in what he thought was an equaliser.\nHowever, in truth, Atletico were second best to Hansi Flick's side for long periods, with the record 31-time winners always appearing relatively comfortable as they extended their unbeaten run to 21 games across all competitions.\nThe Catalan club remain the only side in Europe's top-five leagues yet to lose in 2025 and remain on course for a potential quadruple.\nBarca, who have already won the Spanish Super Cup this term, lead the La Liga table by three points from Real Madrid.\nThey also host Borussia Dortmund in the first leg of their Champions League quarter-final on 9 April (20:00 BST).\nMeanwhile, the final against Carlo Ancelotti's team in Seville will come just over two weeks before a potentially pivotal fixture between the clubs in the Spanish top flight.", "url": "https://www.bbc.com/sport/football/live/c7898eem58jt"}