{"authors": ["Paul Grunill", "www.facebook.com"], "date_download": "2025-05-20 13:48:45", "date_modify": "2025-05-20 13:48:45", "date_publish": "2023-07-31 11:54:51", "description": "The One-Day Cup starts on Tuesday, spearheaded by holders Kent - but not all counties are as affected by The Hundred as others.", "filename": "sport_cricket_66353672_1747748925.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/A1CB/production/_130591414_shutterstock_editorial_13394599bx.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66353672_1747748925.html", "title": "One-Day Cup 2023: All you need to know about county cricket's alternative to The Hundred", "title_page": "One-Day Cup 2023: All you need to know about county cricket's alternative to The Hundred - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "With the World Cup just over two months away, a few eye-catching performances in the One-Day Cup would be timely indeed for any player with international aspirations.\nIn reality, though, it would take something truly remarkable to secure a place in England's squad to travel to India, especially with so many eyes focused on the third edition of The Hundred.\nDespite once again running alongside cricket's newest format, the One-Day Cup - this time with a new title sponsor as Metro Bank replaces Royal London - remains a significant competition for the 18 counties.\nIt provides them with a chance to test some of their younger players in a competitive environment and, of course, there is a nice piece of silverware available, should they make it to the final.\nAs usual, some clubs have been affected more than others in terms of the number of players who will be absent taking part in The Hundred.\nBut there is a chance of a fresh start for those who didn't do themselves justice in the T20 Blast and are, perhaps, struggling in the County Championship - like One-Day Cup holders Kent, who will start their defence of the trophy against Yorkshire at Scarborough on Tuesday.\n\"It's been tough in the Championship for the last two or three weeks, so to take a sideways step into a different competition can help,\" head coach Matt Walker told BBC Radio Kent.\n\"We've got a great three or four weeks here to have a real good crack at 50-over cricket and try to replicate what we did last year.\"\nHe added: \"It was a very strange campaign last year with a pretty slow start, turning it round at the back end of the pool stages and going on to win it.\n\"It's nice to go into the competition as champions, I don't really think that pressure will be a problem, it should give the lads a lot of confidence.\"\nThe 18 teams were all scheduled to face National County opposition on Sunday but Wales against Warwickshire at Caldicot was washed out.\nEight others saw some play but ended as no results, including Kent's game with Hertfordshire at Watford in which the Cup holders reached 311-4 after an opening stand of 167 between Jack Leaning (106) and Ben Compton (93), and Yorkshire's match against Cheshire in which the hosts made 268-9 despite Dom Bess' 4-41.\n\"It's a month we all look forward to because we've got quite a young squad, so there's lots of opportunities to be had - it's an exciting time,\" Yorkshire batter James Wharton told BBC West Yorkshire Sport.\n\"I think we're blessed with the number of all-rounders we've got, so we bat very deep. It also means we've plenty of lads out there as (bowling) options out there for the skipper.\"\nLeicestershire's Colin Ackermann hit 116 off 113 balls but they lost to Staffordshire by two runs via the DLS method and Surrey's Josh Blake made 96 off 96 as they beat Suffolk by 101 runs in another rain-affected game.\nDerbyshire beat Lincolnshire by six wickets, thanks to opener Harry Came's unbeaten 125 off 118 balls, while free-scoring teenager James Rew scored 80 off 57 as T20 Blast champions Somerset defeated Devon by four wickets at Bovey Tracey CC.", "url": "https://www.bbc.com/sport/cricket/66353672"}