{"authors": ["Andrew Benson", "www.facebook.com"], "date_download": "2025-05-20 14:16:20", "date_modify": "2025-05-20 14:16:20", "date_publish": "2023-07-29 16:22:39", "description": "Max Verstappen passes McLaren's Oscar Piastri to win an incident-packed wet sprint race at the Belgian Grand Prix.", "filename": "sport_formula1_66350149_1747750580.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/E18A/production/_130583775_gettyimages-1562790649.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_formula1_66350149_1747750580.html", "title": "Belgian Grand Prix: Max Verstappen beats Oscar Piastri to win rain-hit Spa sprint race", "title_page": "Belgian Grand Prix: Max Verstappen beats Oscar Piastri to win rain-hit Spa sprint race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Max Verstappen caught and passed McLaren's Oscar Piastri to win an incident-packed wet sprint race at the Belgian Grand Prix.\nPiastri, who started second behind Verstappen, took the lead as a result of stopping for a change to intermediate tyres as soon as the race was started following five laps behind the safety car.\nVerstappen stuck with the mandatory full wet tyres for a lap before his own change, and had to ride out a safety car period before blasting through into the lead by passing Piastri on the Kemmel straight.\nThe Australian hung on for second place, his best F1 finish in his rookie season, ahead of Alpine's Pierre Gasly.\nMercedes driver Lewis Hamilton finished fourth on the road but was given a five-second penalty for a collision with Red Bull's Sergio Perez that caused the Mexican to retire, and dropped to seventh just in front of team-mate George Russell.\nHamilton triggered the most exciting racing of the shortened 11-lap distance when he went side by side with Perez through the two right-hand Stavelot corners.\nHamilton drifted a little wide, and had to drop behind the Red Bull for the remainder of the lap, coming under pressure from the Ferrari of Carlos Sainz.\nHamilton then passed Perez around the outside of the first corner, the La Source hairpin, before Sainz went side-by-side with Perez into Eau Rouge and came out ahead.\nSainz's team-mate Charles Leclerc took advantage of the Red Bull's loss of momentum to pass Perez up the straight towards the Les Combes chicane.\nPerez then lost control and slid off the track under pressure from McLaren's Lando Norris at Stavelot and eventually had to retire his car.\nThe race was defined by the drying conditions, which followed a downpour causing a delayed start.\nThe drivers consider it too dangerous to race at high-speed Spa-Francorchamps when there is a lot of water on the track because of the zero visibility caused by the spray.\nSo after a delay, the field was led out behind the safety car, which stayed out for five laps, with the sun now shining, so the F1 cars could begin to dry the track.\nWhen the race did start, the track was ready for intermediate tyres, and half the field decided to pit immediately, leaving half to do a single lap on the extreme wets.\nPiastri led in the changers, Verstappen those who played safe. But in the end it didn't matter.\nVerstappen had to wait for a safety car, caused when Fernando Alonso's Aston Martin crashed at Pouhon on lap three with no harm to the driver, but when the race restarted on lap six, the Red Bull got a run on Piastri through Eau Rouge and was through before he was halfway along the straight.\nVerstappen said: \"It was the safer call. I didn't mind to stay out. We lost a position but we know we are quick and when we got the inters on we were flying.\"\nPiastri said: \"Very happy. We tried our best, but were no match for Max. Apart from Max our pace was really strong.\"\nHe praised McLaren for the progress they have made with their car since an upgrade was introduced at the Austrian Grand Prix at the beginning of the month, since when Norris has had two podium finishes.\n\"Full credit to the team,\" Piastri said. \"The last three weekends we have had it has been very special compared to where we were. To lead my first laps was a day I won't forget.\"\nIt was an emotional day for Gasly, who lost his best friend Anthoine Hubert in a crash in a Formula 2 race at Spa four years ago, and on Thursday led a \"Run For Anthoine\" around the track, stopping to lay flowers at the spot where the Frenchman lost his life.\nIt was Gasly's first top-three finish since he joined Alpine team this year, and a boost for an outfit in something of a crisis following a series of management changes in recent days, including over this weekend.\nSainz, who lost positions to Gasly and Hamilton after being held at his tyre stop to avoid a pit-lane collision, led Leclerc home, ahead of Norris and the demoted Hamilton.\nThe seven-time champion's team-mate Russell moved up after dropping to 12th following the pit stops at the start of the race to finish in eighth and take the final point.", "url": "https://www.bbc.com/sport/formula1/66350149"}