{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:21:43", "date_modify": "2025-04-26 06:21:43", "date_publish": "2025-03-04 00:00:00", "description": "Bradford ease to a comfortable victory over Cheltenham to strengthen their grip on an automatic promotion place in League Two.", "filename": "sport_football_live_clynnj2wrmkt_1745648503.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/83a1/live/23015240-f94a-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_clynnj2wrmkt_1745648503.html", "title": "League Two: Bradford City 3-0 Cheltenham Town", "title_page": "League Two: Bradford City 3-0 Cheltenham Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Bradford secured a record 10th consecutive home league win with a comfortable victory over Cheltenham to strengthen their grip on an automatic promotion place.\nGeorge Lapslie scored twice on his first start for the club since signing from Gillingham in January and on-loan Burnley striker Michael Mellon also netted for the Bantams, who closed the gap on leaders Walsall to two points.\nMellon put an early header straight at Cheltenham keeper Joe Day as Bradford dominated from the start.\nDay threw himself at full stretch to tip away Brandon Khela's powerful half volley, while Jamie Walker went close before the hosts' pressure paid off.\nTayo Adaramola's first cross was blocked but the ball came back out to him and he picked out Lapslie, who headed home from close range.\nLapslie then set up Walker for a shot just past the post as Bradford continue to push forward.\nAnd the forward added a second early in the second half when he converted Walker's low cross.\nMellon forced another save from Day and Lapslie volleyed just over before Bradford scored their third. Walker was again the provider, and his cut-back after a fine run down the right found Mellon, who bundled the ball home.\nCity's win means they now trail leaders Walsall by just two points after the Saddlers drew 1-1 at bottom side Carlisle.", "url": "https://www.bbc.co.uk/sport/football/live/clynnj2wrmkt"}