{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:33:11", "date_modify": "2025-05-21 07:33:11", "date_publish": "2025-05-20 14:38:06", "description": "Wales flanker Alisha Joyce-Butchers announces that she is expecting a baby with wife and team-mate Jasmine Joyce-Butchers.", "filename": "sport_rugby-union_articles_cpqee7jd0d0o_1747812791.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e160/live/36dcfc20-3585-11f0-9b2c-138cad92aeb3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_cpqee7jd0d0o_1747812791.html", "title": "Wales flanker Alisha Joyce-Butchers pregnant and will miss World Cup", "title_page": "Wales flanker Alisha Joyce-Butchers pregnant and will miss World Cup - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wales flanker Alisha Joyce-Butchers has announced that she is expecting a baby with wife and team-mate Jasmine Joyce-Butchers.\nThe 27-year-old was a notable absentee in the 2025 Women's Six Nations and has now revealed: \"We've been keeping a little secret.\"\nThe baby is due in November, meaning Alisha Joyce-Butchers will miss the Rugby World Cup which kicks off in August.\n\"At the start of this year Jasmine and I started our IVF journey. Today I am so happy to say that I am 12 weeks pregnant, and so excited for what's to come,\" she wrote on social media, alongside an ultrasound photo.\n\"We appreciate there has been interest and speculation around my absence from the Wales Six Nations campaign but now you know why,\" said Alisha Joyce-Butchers.\n\"We wanted to let all our family, friends and the Wales squad know before we went public and am sure everybody can relate to that.\n\"The morning sickness has been a new experience, especially while Jaz has been off playing rugby, but we are both delighted with our special news.\"\nJasmine Joyce-Butchers said: \"To say we are excited would be an understatement.\n\"It hasn't been easy keeping it a secret, but once we got married we always planned on starting a family, and we both know this is a new chapter in our lives and it does put everything - including rugby - into perspective.\"", "url": "https://www.bbc.com/sport/rugby-union/articles/cpqee7jd0d0o"}