{"authors": ["Coral Barry", "www.facebook.com"], "date_download": "2025-05-20 14:01:43", "date_modify": "2025-05-20 14:01:43", "date_publish": "2023-07-30 13:39:29", "description": "Terence Crawford could be the greatest fighter of his generation after incredible destruction of Errol Spence Jr in Las Vegas.", "filename": "sport_boxing_66353595_1747749703.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/EF54/production/_130586216_053_spence_vs_crawford.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_boxing_66353595_1747749703.html", "title": "Terence Crawford: 'Beautiful to watch' - Undisputed welterweight champion could be best of this era", "title_page": "Terence Crawford: 'Beautiful to watch' - Undisputed welterweight champion could be best of this era - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "\"For all you guys who said I was too small, I was actually too strong.\"\nIt is a rare sight to see Terence Crawford so animated outside the ring.\nWhile he often prefers a quiet confidence in normal life, he comes alive between the ropes and in the moments after his epic display against Errol Spence Jr he was brimming with joy.\nThe 35-year-old was, simply put, perfect against his most direct rival. Great fighters rise to the occasion in the big fights, but only a special one can make another elite boxer look so average.\n\"It was beautiful to watch,\" Barry Jones said on the 5 Live Boxing podcast.\n\"It was something special. We knew how great Crawford was, but against another great fighter you can't always show the greatness in you, you have to dig out.\n\"But he did - and he made a great fighter look very, very ordinary.\"\nSpecial is a word often overused in boxing, but not in the case of Terence 'Bud' Crawford.\nHe faced - and took down - his greatest adversary. Like him, Spence was undefeated, a long-reigning champion and widely considered a pound-for-pound great.\nAnd yet Crawford made success look so easy, knocking Spence down three times before the referee ended the punishment in the ninth round.\nSpence, for all his talents, couldn't get near him and it was obvious to anyone watching that proving his worth meant a lot to Crawford.\n\"Each and every time I stepped up, I proved you all wrong...each time,\" he said.\n\"Write some great stories about Terence Crawford. Don't hate, don't say nothing negative, just give me my props.\n\"For all you guys who doubted me, this is the Terence Crawford era.\"\nHis team were just as elated. Posing for pictures after the news conference, Crawford handed the Ring magazine belt to his supporting crew to hold and beckoned to some of his children to join them.\nThe Omaha native and his entourage, which includes head coach Brian 'Bomac' McIntyre, are incredibly tight-knit. Crawford is far from the detached superstar and still lives in Omaha, Nebraska, where he grew up.\nSome onlookers felt Crawford and Spence's preference to avoid trash talking and controversy in the build-up meant the event lacked stardust.\nIndeed, with Las Vegas hosting major events like Deontay Wilder v Tyson Fury in recent years it felt as though Crawford v Spence might struggle to reach those same heights.\nBut Wilder and Fury's profile skyrocketed because of their first fight in 2018 that ended in a draw. Their rivalry and deliverance of an all-time wow moment in that opening encounter paved the way for superstardom and a trilogy of epic bouts.\nWith Eminem accompanying Crawford for his ring walk before a performance that will live long in the memory, fight night was truly when the magic happened. As it should be.\nIt was Crawford who was yielding the wand and he who will now reap the rewards.\nHe certainly stakes a claim as the world's best fighter currently. But after 40 fights and 40 wins, 18 consecutive world title fights and the first male boxer to win undisputed titles in two weight classes, Crawford has a strong case for being the best fighter of his generation.\nOn the question of his legacy as an all-time pound-for-pound great, he said: \"I'm up there.\n\"I always want to pay homage to the fighters who came before me. Without them there is no me.\"\nCrawford was always himself before and after the fight. He has an edge, but respect remains paramount to his character. He gives it and expects to receive it.\nHe crossed paths with Spence at the news conference. In between their appearances, and when Crawford personally handed Spence back his WBC, IBF and WBA (Super) titles, he gave him a hug and one final word of encouragement.\nThe pair have been each other's constant shadows in their welterweight years.\n\"This is a fight that's been talked about for many years,\" Crawford added.\n\"When I walk in the store, everybody asking me, 'when you fighting Spence? When you fighting Spence? Dad, this dude say you're scared of Spence'.\n\"Me always having to hear this guy's name, it's like a breath of fresh air that I get to breathe because we finally done it.\"\nBut is it finally over?\nSpence has the option of a rematch, but wants to do it at 154lb as the 33-year-old says he has always struggled to make 147lb.\nCrawford was open to the idea, saying he had considered a move up in weight before tackling Spence.\nIt is hard to imagine who might challenge him at welterweight.\nUndefeated Americans Jaron Ennis, 26, and Vergil Ortiz Jr, 25, may be too green to give a true account of their best against Crawford.\nFollowing Spence to light middleweight might suit Crawford. He has already achieved so much and it is not lost on the American just how long he has been competing at the highest level.\n\"In two months I'll be 36 years old. I've been boxing since I was seven years old,\" he reflected.\n\"I've been doing sports all my life. I've got to sit down with my team and talk about the future. I don't know.\"", "url": "https://www.bbc.com/sport/boxing/66353595"}