{"authors": ["Mandeep Sanghera", "www.facebook.com"], "date_download": "2025-05-21 05:27:10", "date_modify": "2025-05-21 05:27:10", "date_publish": "2025-04-03 11:13:19", "description": "When Liverpool nearly missed out on signing Mohamed Salah, and how adopting the 'Moneyball' strategy revitalised the club.", "filename": "sport_football_articles_c5y0eper8l1o_1747805230.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2f03/live/23d50760-107f-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c5y0eper8l1o_1747805230.html", "title": "Mohamed Salah: When Liverpool nearly missed out on forward, and how 'Moneyball' strategy revitalised club", "title_page": "Mohamed Salah: When Liverpool nearly missed out on forward, and how 'Moneyball' strategy revitalised club - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "A meeting is about to take place at Liverpool and the subject will be Mohamed Salah.\nOn one side you have those providing data and video evidence that Salah is the right signing. On the other side is former Liverpool manager Jurgen Klopp.\n\"Jurgen's preferred option for that summer was Julian Brandt, who was a great player,\" said former Liverpool director of research Ian Graham, who spoke to BBC Sport as part of a documentary released on BBC iPlayer about Liverpool's journey to winning the 2018-19 Champions League.\n\"Jurgen had obviously known him very well, coming from the Bundesliga, and knew the German market very well.\n\"We agreed that Brandt was a very good young player but not a standout in the same way that Mo was. From our data analysis point of view Mo was the best young wide forward in Europe, full stop.\n\"Roma were under pressure to sell because their finances were not in a good place, so we knew he was available for a good price.\n\"He played a forward and wide role that we needed to fill at the time, whereas Brandt was more of an attacking midfielder.\"\nGraham added: \"It's to Jurgen's credit that he engaged in that debate in an honest way with his eyes open to say, 'OK, I'm open to be convinced, show me that Mo is better'.\"\nKlopp didn't need much convincing and Liverpool signed Salah from Roma in June 2017 for £34m.\nThe Reds believed the Egypt international would be a \"future superstar\" and so it has proved.\nSalah, who is yet to agree a new contract with Liverpool beyond this summer, has gone on to become a Liverpool legend.\nHe has scored 243 goals and registered 109 assists for the club in 393 appearances and, under Klopp, helped the Reds win the Champions League, Premier League, FA Cup, League Cup and Fifa Club World Cup.\nGraham was a consultant at Tottenham from 2007-2012 but \"they never really had the ambition to make more\" of data whereas he said \"Liverpool were the first team to have an in-house analytics department\".\nHe was at Liverpool from 2012 to 2023 and was a key part of the 'Moneyball' strategy - the statistical method Major League ­Baseball side Oakland Athletics used in the 1990s to recruit players - that Liverpool owners Fenway Sports Group (FSG) adopted at the club.\n\"Moneyball is really the concept of, 'can we get more value for money out of our squad? Can we get more performance per pound spent? Because, if we can, that means we can compete with clubs with a higher budget than us',\" said Graham.\n\"We started off with about seven or eight different leagues, by the time I left we were probably taking data from about 60 different leagues so that we really understood what players could do on the pitch.\"\nGraham worked under former Liverpool sporting director Michael Edwards, who left the club in 2022 before returning as FSG's chief executive of football in 2024.\nThe pair were part of a transfer committee who, along with Liverpool's manager, would \"come to a consensus decision on the best players to sign\".\nLiverpool had appointed Klopp as manager in October 2015 and his willingness to engage in the use of data in recruitment was in contrast to his predecessor Brendan Rodgers.\n\"Previously, we had robust debates with Brendan about which players to sign and the two differences were our ideas about which players would improve Liverpool were very different to Brendan's ideas,\" said Graham.\n\"Brendan, understandably, put a big premium on Premier League experience whereas we felt those players were quite often overvalued by the market and players from other markets, like Mo Salah and Roberto Firmino, were undervalued.\"\nGraham explained that Rodgers \"came in with a preconception that the player he wanted to sign was the only solution for that position\" and that \"it was very difficult to persuade him otherwise\".\nIn Klopp, Graham said they had found the \"missing piece\" and, in some cases, \"a manager who seemed to see what the data saw\".\nHe added: \"He [Jurgen] is very happy to thank us for our suggestions to have stopped some of the less sensible signings, which at the time caused big arguments but, in retrospect, he could see this was a good process for signing players.\"\nKlopp had managed at Mainz and Borussia Dortmund in Germany, winning the Bundesliga in 2011 and 2012 with the latter.\nHis first trophy at Liverpool was the 2019 Champions League, with data playing \"a big part in signing\" nine of the 11 Liverpool players who started the final against Tottenham - in a game the Reds won 2-0.\n\"The club needed it and, from our point of view, the data approach needed it as well,\" said Graham on that piece of silverware.\n\"Looking back, it is a source of pride and is some validation that data can be of help. It adds to recruitment.\n\"Our data analysis means nothing without the scouts to understand the traditional way of viewing a player, without Jurgen to get the best out of the players, without the ownership to trust in the process and without the sporting director to make decisions based on what the data is telling him.\n\"Jurgen's impact on the Champions League win, it can't really be overstated. His presence at the club attracted some really great players, he got the best out of those players and - by the time of that final - we had a world-class first XI that was quite different to the team that he inherited.\"\nKlopp went on to end the club's 30-year wait for a top-flight title by guiding them to the 2019-20 Premier League crown.\nGraham said: \"Jurgen, coming from the German system, was much more happy to take that compromised approach and it worked out really well for Liverpool.\"", "url": "https://www.bbc.com/sport/football/articles/c5y0eper8l1o"}