{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:37:42", "date_modify": "2025-05-19 15:37:42", "date_publish": "2017-08-18 14:06:34", "description": "Britain's 2010 European steeplechase bronze medallist Hatti Archer is set to be upgraded again after Russia's Lyubov Kharlamova is banned.", "filename": "sport_athletics_40962606_1747669062.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2A0A/production/_97426701_dean.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_athletics_40962606_1747669062.html", "title": "Hatti Archer: GB steeplechaser in line for second 2010 European medal upgrade", "title_page": "Hatti Archer: GB steeplechaser in line for second 2010 European medal upgrade - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Britain's 2010 European steeplechase bronze medallist Hatti Archer is in line to be upgraded again after Russian silver medallist Lyubov Kharlamova was found guilty of doping.\nArcher, who competed as Hatti Dean, was promoted to bronze in 2015 after Marta Dominguez was found guilty of doping.\nThe 35-year-old Briton also competed at the 2007 World Championships in Osaka.\nKharlamova was one of six Russians punished for drugs offences by the country's anti-doping agency.\nFive other Russian athletes and a weightlifter were also given suspensions by anti-doping department, Rusada.\nIrina Sergeyeva, who won a silver medal at the 2009 European Cross-Country Championships, is suspended for two years and six months backdated from May 2015.\nSteeplechaser Ekaterina Doseykina, who took part in the 2015 World Championships in Beijing, is banned for four years starting from December 2016.\nRace walker Zilya Garipova has been given a one-year ban backdated to October 2016 and hurdler Ivan Khudyakov has also been suspended for four years from April 2017.\nWeightlifter Anastasiya Vorobyova has also been punished with an eight-year ban, backdated to 25 July.\nMeanwhile, the Court of Arbitration for Sport announced on Friday that Russian triple-jumper Anna Pyatykh has been banned for four years and has had her result from the world championships in 2007 scrapped for 'violating rules on prohibited substances'.\nThe 36-year-old originally came fourth in the triple jump final in Japan, but bronze medal athlete Hrysopiyi Devetzi was disqualified for violating anti-doping rules.\nPyatykh's ban is backdated to 15 December 2016, when she was provisionally suspended.\nHer results from competitions between July 2013 and December last year have also been wiped.", "url": "https://www.bbc.com/sport/athletics/40962606"}