{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:46:49", "date_modify": "2025-05-20 12:46:49", "date_publish": "2023-08-03 07:12:30", "description": "Trinidad and Tobago is the destination for 49 Scots as they look to follow in the footsteps of some famous names at the Commonwealth Youth Games.", "filename": "sport_scotland_66341117_1747745209.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60EA/production/_130601842_commonwealth.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_scotland_66341117_1747745209.html", "title": "Trinbago 2023: Who will follow in famous Scottish footsteps at Commonwealth Youth Games?", "title_page": "Trinbago 2023: Who will follow in famous Scottish footsteps at Commonwealth Youth Games? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Trinbago 2023 may sound like a fresh update of a computer game, or perhaps even an online travel agency. But it is, in fact, the latest instalment of a real-life event played out by sports stars of the future from around the world.\nAround 1,000 athletes and para-athletes are heading for Trinidad and Tobago for the week-long seventh Commonwealth Youth Games, which starts on Friday.\nAmong them will be 49 competitors from Scotland, which just happens to be the home of the games.\nHere's what to look out for.\nWell, like it's big daddy, the Commonwealth Games, it is an international multi-sport extravaganza for athletes aged 14-18 from former parts of the British Empire that, as the name suggests, remain part of the Commonwealth of Nations.\nWhile the senior event dates back to the British Empire Games held in Canada in 1930, the concept of the youth games was created by Scotland in 2000.\nThe idea behind it was to give young athletes an early taste of a large-scale international sporting event and help develop youth sport within member countries.\nBeach volleyball player Sasha Clegg-McKeown is one of those Scots \"extremely excited\" to be heading to the West Indies. \"This will be a great experience and learning opportunity to help us along our junior beach volleyball career,\" she said.\nCorey Campbell, who will compete on the track at 1500m and 3000m, is another who views it as \"an honour to be selected\" and the runner believes \"my previous international experience will help\".", "url": "https://www.bbc.com/sport/scotland/66341117"}