{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:49:45", "date_modify": "2025-05-21 06:49:45", "date_publish": "2025-02-08 07:48:48", "description": "Belgium's Thomas Detry takes a two-shot lead at the Phoenix Open thanks to a fine 64, while Emiliano Grillo makes a hole-in-one.", "filename": "sport_golf_articles_cwye03xg71xo_1747810185.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e515/live/a2704010-e5ed-11ef-8066-373c01bfb11a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_cwye03xg71xo_1747810185.html", "title": "Thomas Detry leads Phoenix Open, Emiliano Grillo makes hole-in-one", "title_page": "Thomas Detry leads Phoenix Open, Emiliano Grillo makes hole-in-one - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phoenix Open second-round leaderboard\n-12 T Detry (Bel); -10 A Smalley (US), M Kim (US); -9 C Bezuidenhout (SA), T Kim (Kor), J Spieth (US)\nSelected others: -7 S Scheffler (US); -5 R MacIntyre (Sco); -4 D Skinns (Eng); -2 M Wallace (Eng)\nFull leaderboard\nBelgium's Thomas Detry established a two-shot lead at the midway point of the Phoenix Open by carding a second-round 64.\nDetry made eight birdies and one bogey at TPC Scottsdale to move to 12 under par.\nMichael Kim shot a 63 to move to joint-second alongside fellow American Alex Smalley.\n\"I've actually been very comfortable on the greens this week,\" said Detry. \"I did some good work with my coach, and the greens are rolling as good as it gets.\n\"I've been hitting a lot of fairways, as well.\"\nJordan Spieth is three shots off the lead after a 65 while Scottie Scheffler's 66 leaves him five back.\nOvernight leader Wyndham Clark dropped down the leaderboard after carding a 73 - he sits on five under with Scotland's Robert MacIntyre.\nArgentina's Emiliano Grillo made a hole-in-one at the short 16th - which is famous for its raucous crowd atmosphere - during his 69.\n\"You always dream of making a hole-in-one there, so every time that you step in there you're trying to make it,\" he said.\n\"It was loud. It was very loud. There were a lot of emotions.\"", "url": "https://www.bbc.com/sport/golf/articles/cwye03xg71xo"}