{"authors": ["Ian Woodcock", "www.facebook.com"], "date_download": "2025-05-20 12:39:40", "date_modify": "2025-05-20 12:39:40", "date_publish": "2023-08-03 09:40:03", "description": "BBC Sport takes a look at how the three teams relegated from the Premier League last season are shaping up for the new campaign.", "filename": "sport_football_66302766_1747744780.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/920E/production/_130609373_bbc-sport-index-imagery-3-split-images-gradient-a6cbd864-03cd-44e4-af26-d4b5883c4894.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66302766_1747744780.html", "title": "Championship 2023-24: How will Leicester City, Leeds United and Southampton fare in the Championship?", "title_page": "Championship 2023-24: How will Leicester City, Leeds United and Southampton fare in the Championship? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's been a summer of major upheaval for the three clubs relegated from the Premier League in May.\nLeicester City, Leeds United and Southampton have all had a change in the dug-out as well as overhauls of their respective squads, while the Whites also go into the season with new owners.\nThe trio will all be hoping to do what Burnley managed last season and bounce back at the first attempt, but fans will know the road ahead is unlikely to be quite that smooth.\nAfter their previous relegations from the top flight, all three all ended up dropping as low as League One before eventually climbing back to the top table of English football.\nBBC Sport takes a look at how the season is shaping up for the Foxes, Whites and Saints before the south coast team get the EFL season under way at Sheffield Wednesday on Friday.\nWho's in charge? Former West Brom midfielder Enzo Maresca has a big job on his hands in his first role in management in England.\nThe 43-year-old Italian took over at the King Power Stadium last month having spent time working as one of Pep Guardiola's assistants at Manchester City.\nFormer City and Chelsea goalkeeper Willy Caballero has joined him as assistant manager.\nWhat's the squad like? Unsurprisingly, England internationals James Maddison and Harvey Barnes have moved on, with the former joining Tottenham Hotspur and the latter Newcastle United.\nAside from that duo and Youri Tielemans, who has joined Aston Villa on a free, there have not been too many departures from a squad that really should have had enough to stay in the top flight last season.\nOf those still there it will be interesting to see how veteran striker Jamie Vardy, 36, gets on in his first season back at this level since helping the Foxes to promotion in 2013-14, and whether fellow forwards Patson Daka and Kelechi Iheanacho can put together consistent campaigns.\nDefender Conor Coady has come in from Wolves and will bring vital leadership qualities, although he looks set to miss the start of the season with an injury, while midfielder Harry Winks has joined from Spurs with a point to prove after a few difficult years.\nHow will they fare?\nFormer Leicester City winger and Foxes summariser for BBC Radio Leicester Matt Piper\nCoady's probably the only natural leader that I see in this squad at the minute. Kiernan Dewsbury-Hall could become that but he isn't yet. So [Coady's] injury is a huge blow - there's no getting around it.\nWith Maresca's philosophy and style of play, we're going to have to accept that they are going to make mistakes at times.\nIt is going to take time to evolve the way he wants to play and make sure that is transmitted to the players. Coady, Winks and Vardy have said some really positive things about him, so I'm confident in the manager.\nWhat happened? It all started so well, as the Whites took seven points from their first three matches. Thereafter though? Not so good.\nJesse Marsch was sacked in February, a few months after most fans thought his time should have been up, and former Watford boss Javi Gracia was eventually brought in.\nThe Spaniard won three of his first six league games to move them away from the relegation zone, but five of the subsequent six ended in defeat and he was sacked with four matches of the season remaining.\nSam Allardyce was brought in to try and save them but Leeds managed just one point in that time, going down with a whimper in a final day 4-1 home shellacking by Tottenham.\nWho's in charge? Unlike Leicester, Leeds have gone down the tried and tested route with their new boss.\nDaniel Farke has managed three seasons in the Championship and won the title in two of them.\nThe German arrives at Elland Road after a spell in his homeland with Borussia Monchengladbach and will hope he can repeat the successes he enjoyed with Norwich City.\nOff the pitch, 49ers Enterprises - the investment arm of NFL side the San Francisco 49ers - completed a £170m takeover of the club in June having purchased Andrea Radrizzani's shares.\nWhat's the squad like? The list of departures from Elland Road this summer has been lengthy.\nSpain forward Rodrigo has been sold to Al Rayyan in Qatar, while midfielders Marc Roca and Brenden Aaronson plus defenders Robin Koch, Rasmus Kristianssen and Max Wober have all left the club on loan, although it seems unlikely any will wear a Leeds jersey again.\nThe ins so far have been pretty thin on the ground, with Wales international defender Ethan Ampadu and Newcastle goalkeeper Karl Darlow the only ones who are likely to feature in the first XI.\nThat means extra pressure on striker Patrick Bamford to stay fit, while talented forwards Luis Sinisterra, Wilfried Gnonto and Dan James should be a class above for this level.\nThere's no doubt that they could and indeed should add to their squad before the window closes on 1 September.\nHow will they fare?\nBBC Radio Leeds sports editor Jonny Buchan\nPromotion back to the Premier League is the aim and expectation, but not everyone is convinced that is possible just yet.\nOne of the most exciting prospects for the season ahead is the rise of midfielder Archie Gray, great-nephew to club legend Eddie Gray. The 17-year-old has featured heavily in pre-season and will be an exciting watch in the Championship.\nThere is a lot of attacking threat out wide but the final game of the summer schedule saw both Bamford and Georginio Rutter pick up injuries which threaten to keep them out of the season opener against Cardiff City.\nMany feel another striker is a must if the Whites are to be title contenders.\nWhat's the squad like? Skipper James Ward-Prowse's departure seemed inevitable from the moment their relegation was confirmed but, as it stands, he's still at St. Mary's.\nThere's a good chance that changes before the window closes, which is also the case for Liverpool target Romeo Lavia.\nStrikers Che Adams and Adam Armstrong have stellar recent records in this league and should cause problems for most defences if they remain with the club.\nNorthern Ireland international midfielder Shea Charles has arrived for big money from Manchester City and there will be a lot of pressure on him to hit the ground running should Ward-Prowse and Lavia both leave.\nHow will they fare?\nBBC Radio Solent sports editor Adam Blackmore\nIt's hard not to think of Saints as in anything but a state of flux.\nIt's not the club's fault, it's the nature of the beast when you're relegated from the Premier League - your squad is too big, some players will be sold, and you've got four weeks left of the transfer window after the season starts.\nSo Russell Martin, who's made a big impression with players and staff since arriving at St Mary's, doesn't really know how his squad will look yet, and how competitive they'll be. But the club's ambition is to go straight back up to the Premier League, and I think he'll be given the budget to achieve that by the owners.\nWhatever happens, I think Saints will be competitive at the right end of the Championship. As with football in any division, the rest will come down to small margins and a bit of luck.", "url": "https://www.bbc.com/sport/football/66302766"}