{"authors": ["Glenn Speller", "www.facebook.com"], "date_download": "2025-05-21 06:32:13", "date_modify": "2025-05-21 06:32:13", "date_publish": "2025-03-31 17:46:31", "description": "BBC Sport looks at some of the key midweek games in League One and League Two, including the top four meeting each other in the fourth tier.", "filename": "sport_football_articles_cvgplrllqdeo_1747809133.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/66e2/live/1a4ee3a0-0e22-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cvgplrllqdeo_1747809133.html", "title": "EFL midweek preview: Crunch time", "title_page": "EFL midweek preview: Crunch time in League Two promotion race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In the footballing world there are often accusations of the overuse of hyperbole but, if you'll excuse us, Tuesday night feels massive in the League Two promotion race.\nSeven teams are realistically chasing the three automatic places on offer - and the top four face off under the lights.\nIn League One, it is looking more a case of when, rather than if, Birmingham City win the title but the fight for second place is turning into a real arm wrestle between Wrexham and Wycombe.\nMeanwhile, there will be much play-off manoeuvring and relegation scrapping to be played out up and down the country.\nSupporters of teams at a certain level of football can be a miserable bunch, take my word for it.\nWhile those at the top end of the game will bask in boasting about their team, those who follow a more humble club will always expect them to find a way of turning triumph into failure.\nSo, let's all say hello to Walsall. Nine league wins in a row between December and mid-January had Mat Sadler's side 12 points clear at the top and the bookies perhaps ready to pay out.\nAs we enter April, that gap is down to one point - and, perhaps more pertinently, only five ahead of fourth-placed Doncaster Rovers who they visit on Tuesday.\nBut defiant Walsall boss Sadler told BBC Radio WM: \"We know we're a good team - we're at the fun stage of the season and want to be fighting for exactly what we're fighting for.\" Fighting words, indeed.\nDoncaster ended a three-game winless run by beating Carlisle at the weekend and head coach Grant McCann still has lofty targets for the season.\n\"Our focus and eyes are firmly on the title and I'm not worried what people may think because that's what we're trying to do,\" he said\nWith Walsall wobbling, Bradford City and Port Vale are leading the pursuit of the leaders and meet at Vale Park on Tuesday night.\nWhen Walsall went 12 points clear in January, Port Vale were third and now the gap at the top is down to one Vale are, well, back up to third - consistency can be key.\nBradford have stumbled themselves in recent weeks with their 10-game winning streak at home brought to a halt by struggling Tranmere after a defeat by Gillingham the previous week and they drew at Accrington at the weekend.\n\"We've added to our tally and it might be a different game against Port Vale with them being in the top part of the table but we'll need to improve in the top third of the field if we want to go there and win,\" said Bradford boss Graham Alexander.\nSuch is the nature of League Two you can make a case for any of the other three teams in the top seven circumnavigating the lottery of the play-offs.\nThree wins from their past 10 games has dampened AFC Wimbledon's top-three charge as they head to Swindon Town while Notts County take a three-match run without a home victory into their meeting with MK Dons.\nAs if all that was not enough it is ninth against seventh at Gresty Road where last season's beaten play-off finalists, Crewe Alexandra, come up against a Grimsby Town side who have won more points on the road than at their Blundell Park home this season.\nWhile Birmingham City plan the open-top bus parade and pick out a spot on the mantelpiece for the League One trophy, the scrap for second place seems likely to go to the wire.\nWhen Matt Bloomfield departed Wycombe Wanderers for Luton's Championship relegation battle in January, the Chairboys' promotion challenge could have fallen by the wayside - following in the footsteps of a club legend is never easy.\nStep forward Mike Dodds who, in his first permanent role as a head coach has overseen 15 points from a possible 27 to stay in the race as they host rock-bottom Shrewsbury Town having squeezed past Lincoln at the weekend.\n\"You can see the players are playing like they've got something to lose - my responsibility at this time is to be really calm and clear in what we're trying to achieve,\" Dodd told BBC Three Counties Radio.\nWrexham hold a three-point advantage over Wycombe going into their trip to second-from-bottom Cambridge United although the Welshmen have played an extra game at this stage and cannot afford to slip up at the Abbey Stadium.\n\"We can't take any team for granted. In this division, if you're not at 100% and you're not closing down, anyone can look a good player,\" said Wrexham midfielder Ollie Rathbone.\nOh, by the way, Birmingham City are at Bristol Rovers.\nWith all the dramas ongoing at Reading, don't be surprised if, in years to come, a doorstep salesman knocks on your door offering you a series of quality bound books detailing the full story which you can pay for in monthly instalments.\nBut, whatever the outcome of the Royals' ownership tale, neither management nor players are using it as an excuse.\nSaturday's 3-1 victory over Peterborough lifted them into the top six while stretching their unbeaten run to 11 games as they make the long haul up to Blackpool who, with four wins from their past five, are also in the play-off shake up.\n\"Blackpool are a good side with strong players who can hurt you - they have league winners in there who I played with so we've got to go up there and put our best foot forward,\" head coach Noel Hunt told BBC Radio Berkshire.\nStockport and Charlton complete the top six with the Hatters entertaining Stevenage and the Addicks at Mansfield Town.\nThirteen years ago, Wigan Athletic against Bolton Wanderers was a Premier League fixture but on Tuesday night it's mid-table League One hosting play-off hopeful.\nWhile Shrewsbury and Cambridge United can probably start looking at maps to League Two grounds next season, Crawley Town may have put the atlas away for a while.\nWith Scott Lindsey back in town the king is back on his throne, starting with two wins to reignite hopes of a great escape as they meet Peterborough United.\n\"Football has a habit of kicking you in the teeth so we have to stay grounded, measured and ready to go again,\" said Lindsey.\nRotherham United sacked boss Steve Evans on Sunday following defeat by Crawley and will have Matt Hamshaw in charge for the trip to Northampton Town.", "url": "https://www.bbc.com/sport/football/articles/cvgplrllqdeo"}