{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:40:16", "date_modify": "2025-05-21 06:40:16", "date_publish": "2025-01-31 10:01:44", "description": "Watford sign Norway goalkeeper Egil Selvik from Udinese for an undisclosed fee, on a three-and-a-half-year contract.", "filename": "sport_football_articles_c805xx7jrrlo_1747809616.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9d2b/live/eeebba50-dfb7-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c805xx7jrrlo_1747809616.html", "title": "Egil Selvik: Watford sign Udinese goalkeeper for undisclosed fee", "title_page": "Egil Selvik: Watford sign Udinese goalkeeper for undisclosed fee - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Watford have signed goalkeeper Egil Selvik from Italian 'sister club' Udinese for an undisclosed fee.\nThe 28-year-old Norway international had only recently joined Udinese from Haugesund but has now agreed a three-and-a-half-year contract at Vicarage Road.\nHe will plug the gap caused by Daniel Bachmann's ankle ligament injury, which has ruled him out for up to three months.\nSelvik made his first Norway start against Scotland in November 2023 and has so far won four international caps.\nHe joins a Watford side currently ninth in the Championship ahead of Saturday's lunchtime kick-off against Norwich City, three points outside the play-off places.\n\"He's got a good physique, he's athletic, can make saves and he's calm in his distribution,\" boss Tom Cleverley told BBC Three Counties Radio.\n\"He seems like a really good voice, a leader, so that's an added bonus. I've got a decision to make (on who is first-choice), because Jonathan Bond never lets anyone down.\n\"It's a level-playing field for everyone in every position, including that goalkeeper spot. But we have identified Egil as a quality keeper.\"", "url": "https://www.bbc.com/sport/football/articles/c805xx7jrrlo"}