{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:36:56", "date_modify": "2025-05-21 06:36:56", "date_publish": "2025-01-31 10:21:21", "description": "Brighton news: Fan views on Kaoru Mitoma", "filename": "sport_football_articles_cz0lnn1grkpo_1747809416.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5ec2/live/9e5812b0-0915-11ef-b9d8-4f52aebe147d.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz0lnn1grkpo_1747809416.html", "title": "Brighton news: Fan views on Kaoru Mitoma", "title_page": "Brighton news: Fan views on Kaoru Mitoma - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on the news that Brighton had rejected a bid from Al-Nassr for Kaoru Mitoma and what it would take for Albion to sell the winger.\nHere are some of your comments:\nPeter: He is far too valuable to us to sell him even for £90m which some are saying is the improved offer. We wouldn't be able to replace him so late in the window. I don't get the impression he's money-driven anyway (and his career has not ended yet anyway !)\nJames: If we want to compete at the top, then we need to ensure we keep hold of high-value players. Money can only go so far. Take Southampton for example. They sold Van Dijk for £75m - look at them now. I'd rather have the quality Mitoma provides than the money.\nJezz: If Brighton sell Mitoma, they're done. It will show a total lack of ambition. Unless he wants to leave - and he's given no indication he does - we should reject all offers. He's our best player, he's also the fans favourite and one of the most popular in the squad. We'd also lose all our support in Japan, which is worth quite a bit in merchandise sales. All in all, it would be worse than letting Yves Bissouma, Moises Caicedo and Alexis Mac Allister go! He's that important. We shouldn't be selling any of our core players to be honest, not if we want to progress.\nNicolas: Selling Mitoma for the right (high) price isn't something I'm completely adverse to. Although we'd all love to hold onto him, no player is bigger than the team. We have so much talent on the wing, and we've seen success without him. We've also seen the impact that large sums of money from transfers can have on the club's dynamic. I'd love him to stay though, great talent and a great guy.\nDavid: Would be sorry to see Mitoma go but for the right price, and I mean in excess of £100 million, then I don't see why we shouldn't cash in. He isn't such an unknown quantity anymore and while we see him shine against tactically naive teams like Manchester United, we have seen him tamed by teams like Brentford and Everton who know to stick two players on him and mark him out of the game. As for going mid season, we have seen Simon Adingra, Yankuba Minteh, Brajan Gruda and Solly March all playing on the wing this season so we have options. He was never likely to end his career with Brighton so now is as good a time as any for him to leave.", "url": "https://www.bbc.com/sport/football/articles/cz0lnn1grkpo"}