{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:21:41", "date_modify": "2025-05-21 05:21:41", "date_publish": "2025-02-01 00:00:00", "description": "Reaction and highlights as Australia beat England 16-0 in points-based multi-format Women's Ashes.", "filename": "sport_cricket_live_cy53xy4qeg9t_1747804901.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_live_cy53xy4qeg9t_1747804901.html", "title": "Women’s Ashes 2025 reaction: Australia win 16-0 against England", "title_page": "Women’s Ashes 2025 reaction: Australia win 16-0 against England - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England suffer innings defeat to lose Women's Ashes 16-0\nThat's it from us at the end of an extremely one-sided Ashes series.\nEngland had their chances early on, didn't take them and Australia have gone on to blow them away and claim a remarkable 16-0 clean sweep.\nAlana King spun them to victory in the Test at the MCG and you can read Ffion Wynne's report on that here.\nWhere do England go from here? They will spend the coming days, weeks and months trying to figure that out while Australia can celebrate.\nThe series is done but cricket never stops, we'll be back tomorrow for England men's fifth T20 against India - that starts at 13:30 GMT. Be sure to join us then!\nPost\nAlex Hartley\nFormer England bowler on BBC Test Match Special\nI genuinely believe that Heather Knight is capable of taking this team forward. They can't make any decisions whilst it's fresh and raw. They need to take it away and review it all.\nThere will be an inquest into this. Australia won 16-0. Ultimately, they need to get their players playing domestic cricket. They need their players to be playing county cricket so they are used to playing under pressure.\n'It is pretty raw at the moment'\nEngland captain Heather Knight speaking to TNT Sports about her future:\"I don’t know at the moment, it is all quite raw at the moment, it has happened pretty quickly, the next few weeks will be about working out what is best for the future.\n\"We will see, I think it will be something that will be worked out in the next couple of months what the future of the team holds, I guess.\"\nPost\nGeorgia Elwiss\nEngland all-rounder on TNT Sports\nThroughout the whole series, England could never get footholds into the game because as soon as they had those moments, they let them go and Australia snatched them. Australia don't give you any room for mistakes.\nFor England they talk about getting better under pressure and the key is domestic cricket. They need to be playing more cricket to get used to these situations, right at the heart of it.\n'We didn't help ourselves at times'\nEngland coach Jon Lewis, speaking to TNT Sports: \"The first thing I would say is across the series I think Australia have played some magnificent cricket. They haven't let us play the cricket we want to play.\n\"They put us under pressure in home conditions. We had a couple of early chances to create opportunities to win games of cricket and we didn't take them. Once you give a juggernaut team who know their own conditions the opportunity to get on top it's really tricky to come back.\n\"In this Test match their skills were really on point from the start and it was hard for us to stop what was going on. We didn't help ourselves at times, especially in the field. That's a big error of our game which we saw at the T20 World Cup as well. We really need to improve, and it's an area of our game we need to look at.\n\"To be honest we will look at all areas of our game across this tour and the winter itself. We'll review thoroughly, try to pick the bones out of everything and come back stronger.\"\nPost\nMark Robinson\nWarwickshire first-team coach on TNT Sports\nAlana King has been the star of the whole thing with the spin and the drift she got, and she was massively backed up by Gardner.\nThere was a lot of good stuff from England but they could not sustain it, so you end up losing a game you felt you were in.\nBut it wasn’t about today, it was about the whole of this tour and where they go next.\nRecap: Gardner & King seal emphatic win\nIt then became a matter of how long it would take for Australia's spin twins Ash Gardner and Alana King to winkle out England's lower order at the MCG.\nThere were couple of unorthodox dismissals in there as Gardner and King picked up wickets in unconventional ways.\nWith four wickes apiece, and one to take to finish the match, King and Gardner then battled it out to see who would seal the winning moment as Laurens Bell and Filer showed some late defiance.\nKing would eventually provide the moment, getting her name on the honour's board at the MCG, after Lauren Filer chipped to mid-on\nRecap: King puts England in a spin\nAfter England briefly blunted Australia's seamers, and it looked like they might have some hope of batting out the day, the home side's spinners turned the screw.\nIt was mostly the Alana King show as the Australian leg-spinner bamboozled England with some truly spellbinding bowling.\nHer dismissal of Sophia Dunkley, in particular, was a majestic piece of bowling reminiscent of Shane Warne's 'ball of the century' If you only watch one video from this match, make sure it's that one.\nAsh Gardner played a more than useful hand with her off-breaks, too.\nRecap: England show fight with the ball\nHowever, despite Beth Mooney's knock it was largely all England in the first session as they showed plenty of spirit, bowled well to their plans, and actually held some catches.\nLet-arm spinner Sophie Ecclestone, who has shouldered much of the burden with the ball in this match, finished with 5-143 as Australia slumped from 405-4 to 440 all out.\nEngland, who needed to score 270 to force Australia to bat again, lost Maia Bouchier early in their innings as her lean trot in this Ashes series continued but Tammy Beaumont and England skipper Heather Knight rebuilt to reach 79-1.\nPost\nMark Robinson\nWarwickshire first-team coach on TNT Sports\nBeth Mooney is one of my favourite Australian players - she doesn't have a perfect technique of a Annabel Sutherland or an Ellyse Perry but gets everything out of herself.\nShe's super fit and runs you ragged. If you're asleep in the field she will exploit you. With the retirement of some of the great Australian batters she's stepped up in all formats for then. She's right in her prime. Right in her pomp.\n'We shut the door on England'\nAustralia captain Alyssa Healy, speaking at the post-match presentation: \"It's a brilliant feeling. I have to give some credit to Tahlia McGrath for the way she stepped in during the T20 series - it was a joint effort.\n\"I thought the team as a whole... I couldn't be prouder of the group. At every opportunity we thought England were clawing their way back somebody came out and shut the door on them.\n\"Playing at some great stadiums in Australia, getting crowds back, against a really good opposition, has been an amazing experience. The whole series in general was amazing.\"", "url": "https://www.bbc.com/sport/cricket/live/cy53xy4qeg9t"}