{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:50:50", "date_modify": "2025-05-20 14:50:50", "date_publish": "2023-07-25 18:17:30", "description": "Bowlers dominate on the opening day of Hampshire against Essex as 16 wickets fall.", "filename": "sport_cricket_66300269_1747752650.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/AD49/production/_130516344_gettyimages-1491480934.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66300269_1747752650.html", "title": "County Championship: 16 wickets fall on day one between Hampshire and Essex", "title_page": "County Championship: 16 wickets fall on day one between Hampshire and Essex - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jamie Porter claimed five of the 16 wickets to fall on the opening day as Essex took control of their County Championship Division One match against Hampshire at the Ageas Bowl.\nFast bowler Porter took 5-37 to help skittle the hosts for 120 on a bowler-friendly pitch, with Simon Harmer assisting with 3-26.\nEssex replied by reaching 145-6 at the close, taking a 25-run lead into day two, with two wickets apiece for Kyle Abbott and John Turner keeping the visitors in check.\nEssex won the toss and Tom Westley gleefully put Hampshire into bat first on a pitch which appeared to have been prepared to promote a positive result.\nThat outcome is needed for both sides, placed second and third coming into this round of fixtures, in their quests to chase down runaway leaders Surrey, who led Essex and Hampshire by 14 and 29 points with four matches to go.\nHampshire are 50 years without a Championship title and it is the only trophy Rod Bransgrove has not won in his 23 years as chairman - this will be his last chance after announcing his decision to step down at the end of the season before play.\nHampshire openers Ian Holland and Fletcha Middleton were both snared out by Porter before seven overs had been completed.\nBut Essex's early joy was tainted by Shane Snater - who had replaced the ill Doug Bracewell - limping off after five balls, having pulled out of a delivery just before reaching his stride.\nThe loss of a main bowler mattered little as Paul Walter stepped up and angled across James Vince, and with Hampshire eventually bowled out inside 39 overs it meant fewer miles in the legs.\nBen Brown was well caught at first slip by Harmer, Nick Gubbins was loose on the drive off Porter and Liam Dawson top-edged a sweep to fine-leg to leave Hampshire 79-6 at lunch.\nPorter was rewarded for his potent accuracy with his second five-for of the season by spearing into Felix Organ's back pad, before James Fuller advanced and slapped the next ball he bowled to deep cover.\nHarmer wrapped up the tail with Turner edging to slip and Mohammad Abbas slogging to long-on.\nIn reply, Nick Browne was bowled by Abbas in the fifth over as the pitch remained unmoved in its bowling friendliness.\nAbbott picked up Sir Alastair Cook and Walter in a double-wicket maiden to reduce Essex to 16-3.\nBut Essex did something Hampshire could not do and formed partnerships, with Westley and Matt Critchley adding 41 before Critchley and Michael Pepper scored 36 together.\nVince, who managed to negotiate his way to three replacement balls, only called on Vitality Blast hero Turner in the 34th over.\nThe wait had Turner raring to go as he bounded in to crash into Critchley's pads first ball before later finding Pepper's outside edge.\nEssex edged into a first-innings lead with Adam Rossington, on 36 not out, and Harmer reaching the end of the day.", "url": "https://www.bbc.com/sport/cricket/66300269"}