{"authors": ["Jack Skelton", "www.facebook.com"], "date_download": "2025-05-21 04:34:10", "date_modify": "2025-05-21 04:34:10", "date_publish": "2025-04-04 19:31:08", "description": "Lancashire batter Rocky Flintoff will miss the first part of the County Championship season because of a back injury.", "filename": "sport_cricket_articles_cq80qd74wj9o_1747802050.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4fb1/live/9da1efc0-118a-11f0-9c0d-3d00dc5c90d6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_cq80qd74wj9o_1747802050.html", "title": "Rocky Flintoff: Lancashire batter to miss early part of season with back injury", "title_page": "Rocky Flintoff: Lancashire batter to miss early part of season with back injury - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lancashire batter Rocky Flintoff will miss the first part of the County Championship season because of a back injury.\nThe county say the 16-year-old has suffered a \"lumbar stress reaction\", which is why he was left out of the squad for their Division Two opener against Middlesex at Lord's.\nHe felt discomfort in his back during pre-season and is being rested so the injury does not worsen while also having rehabilitation.\nFlintoff, son of former England captain and all-rounder Andrew, became Lancashire's youngest first-class cricketer last season.\nHe has played five first-class matches and seven List A games for Lancashire.\nFlintoff, who turns 17 on Monday, made a century for England Lions against a Cricket Australia XI in Brisbane in January, having become the youngest player to hit a century for England Under-19s last summer.\nHis older brother Corey, 19, signed a two-year rookie contract with Kent last month.\nLancashire have seven County Championship Division Two fixtures before the mid-season break on 27 May.", "url": "https://www.bbc.com/sport/cricket/articles/cq80qd74wj9o"}