{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 08:02:11", "date_modify": "2025-05-21 08:02:11", "date_publish": "2025-05-19 16:00:07", "description": "Pep Guardiola says Manchester City midfielder Kevin de Bruyne is the \"second-best\" passer he has worked with - after Argentine great Lionel Messi.", "filename": "sport_football_articles_cj6r8d4d94ro_1747814531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3489/live/62122060-34b7-11f0-9b93-217cde507f8c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cj6r8d4d94ro_1747814531.html", "title": "Kevin de Bruyne: Manchester City midfielder 'second-best' passer after Messi", "title_page": "Kevin de Bruyne: Manchester City midfielder 'second-best' passer after Messi - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Pep Guardiola says Manchester City midfielder Kevin de Bruyne is the \"second-best\" passer he has worked with - after Argentine great Lionel Messi.\nGuardiola holds the departing Belgian in high esteem, ahead of the likes of other pass-masters he has managed such as Andres Iniesta and Xavi at Barcelona, and former City midfielder David Silva.\nDe Bruyne announced last month he will leave City after 10 years when his contract expires at the end of the season, with his final home game against Bournemouth on Tuesday (kick-off 20:00 BST).\nGuardiola said it would be \"difficult to find\" another player who passed the ball like De Bruyne and hailed him as \"one of the best three\" he has ever seen, before swiftly changing his mind.\n\"One is Messi,\" said Guardiola. \"And the other two, let me think about it...OK, let me put Kevin second.\"\nHe added: \"Messi is the best I have ever seen because Messi has done it really, really close to the box but Kevin is there. It's just the stats, the goals, the assists, that he provides to the team in the final third and the talent.\n\"That is unique, that is why he has been one of the best players this club has had in the whole history. These are big, big words because he has been a special player.\"\nDe Bruyne has won 16 trophies since joining from Bundesliga club Wolfsburg in 2015, including six Premier League titles and the Champions League in 2023.\nThe Belgian has played 258 league games under Guardiola and registered 0.5 assists and created 3.6 chances per 90 minutes during that time - rating higher in both metrics than Messi, Xavi, Iniesta and Silva.\nHis passing accuracy of 82.4% is lowest of the five players, but this can possibly be put down to playing riskier passes in the final third in an attempt to unlock defences.\nWith De Bruyne's City days coming to a close, BBC Sport understands the club are withdrawing their initial interest in Bayer Leverkusen's Florian Wirtz but remain in the market for a new creative midfielder - with Nottingham Forest's Morgan Gibbs-White among the options.\nAsked if De Bruyne will be difficult to replace, Guardiola said: \"There are players who are really, really difficult for many reasons, we know that.\n\"But the season we have done is the season we have done - we cannot deny it. Of course we have to move forward.\"", "url": "https://www.bbc.com/sport/football/articles/cj6r8d4d94ro"}