{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:32:48", "date_modify": "2025-05-20 12:32:48", "date_publish": "2023-08-04 09:54:51", "description": "Manchester City: Can Man City make it four in a row?", "filename": "sport_articles_cz9q7zey6dno_1747744368.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ff0e/live/d078b450-32a8-11ee-9217-27b202a39e56.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_cz9q7zey6dno_1747744368.html", "title": "Can Man City make it four in a row?", "title_page": "Manchester City: Can Man City make it four in a row? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harvey Downes, Opta\nHaving won five of the past six top-flight titles on offer, including each of the past three, unsurprisingly City are favourites in 2023-24, with Opta's predictor model having them at 90.3% to lift the trophy. So, the question remains, with all their fire power, can City be stopped from winning a record fourth consecutive top-flight title?\nManchester United followed up their Treble-winning season by retaining the Premier League in 1999-2000. There's no telling what effect a 61-game season last time out may have had on City's players coming into 2023-24. Rivals can only hope for a Jack Grealish-style hangover to carry into next season.\nCity's spine (Ederson, Rodri and Haaland) played more than 80% of Premier League minutes last season, contributing significantly to their success. In all competitions, only three outfielders managed more minutes for a big five European league side than Rodri (4,478) who was central to Guardiola's plans.\nEvery team has its own life cycle, and a number of City's influential players are either approaching the end or have passed their 'peak years'. Following the departures of Ilkay Gundogan and Riyad Mahrez, there are a number of other potential outgoings on the cards that could result in Guardiola overseeing his biggest rebuild at City to date.", "url": "https://www.bbc.com/sport/articles/cz9q7zey6dno"}