{"authors": ["Kheredine Idessane", "www.facebook.com"], "date_download": "2025-04-26 04:17:32", "date_modify": "2025-04-26 04:17:32", "date_publish": "2025-03-04 07:23:57", "description": "Neil Gourley does not fear anyone racing in the 1500m at the European Indoor Championships despite the \"silly\" standard of athlete, including world record holder Jakob Ingebrigtsen.", "filename": "sport_athletics_articles_ckgnx9kwxr8o_1745641052.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a8c5/live/0fd061e0-f858-11ef-83da-2fe2e32e5a75.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_athletics_articles_ckgnx9kwxr8o_1745641052.html", "title": "European Indoor Athletics: Neil Gourley relishing 1500m test", "title_page": "European Indoor Athletics: Neil Gourley relishing 1500m test - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Great Britain's Neil Gourley does not fear anyone racing in the 1500m at the European Indoor Championships, despite the \"silly\" standard of athlete, including world record holder Jakob Ingebrigtsen.\nThe championships get under way in Apeldoorn, the Netherlands, on Thursday when Gourley will go up against the 24-year-old defending champion Ingebrigtsen in a competitive field.\nThe Norwegian broke his own indoor 1500m world record and indoor mile record in France last month.\nGourley, 30, has also been in good form, winning the UK Indoor Championships last month in a record time for the event.\n\"I'm in a position now where I'll be looking at winning medals, absolutely,\" Glasgow's Gourley told BBC Scotland.\n\"But more than that, seeing how I measure up to the very best guys in the world right now.\n\"Jakob, having just taken down the world record this indoor season, the mile and the 1500m, he's coming in as the heavy, heavy favourite and the man to beat.\n\"But gauging myself against him and a few others who are running quick this indoor season will be an opportunity that I'm relishing.\"", "url": "https://www.bbc.co.uk/sport/athletics/articles/ckgnx9kwxr8o"}