{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:51:51", "date_modify": "2025-05-21 03:51:51", "date_publish": "2025-01-23 16:33:40", "description": "The Bluebirds have so far only added Yousef Salech this month, but boss Omer Riza expects more positive news.", "filename": "sport_football_articles_clykzn5ggzmo_1747799511.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f6ea/live/2e1102c0-d9a6-11ef-98f3-8f799a2ac21a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_clykzn5ggzmo_1747799511.html", "title": "Cardiff City: New signings 'massive' for Bluebirds", "title_page": "Cardiff City: New signings 'massive' for Bluebirds - Riza - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manager Omer Riza says more new signings before the end of the January transfer window will be \"massive\" for Cardiff City's season.\nThe Bluebirds have so far only added Yousef Salech this month, but the striker has already scored in Cardiff colours, a stoppage time equaliser at Millwall in his second appearance.\nBut Riza wants more new faces to help their fight against relegation in the Championship.\n\"Hopefully they'll be to or three more,\" he said.\n\"It all depends on the situation at the clubs, it depends on how quickly we can get things moving or done, but things are definitely moving towards the right direction.\n\"I think it will be massive.\n\"We need a little bit more just to help the group, they've really got a real togetherness, and I think you can see that in the performances, but we need a few more just to push now and hopefully we'll get that.\"\nThe window closes for EFL clubs on Monday, 3 February at 23:00 GMT.\nSalech joined for an undisclosed fee believed to be between £3m and £4m and Riza has pointed to the impact he has made already in just a week at the club.\n\"I wanted him, I've been tracking him for a while now so that was great to have that one done,\" Riza added.\n\"All the other ones that I've suggested are hopefully in the pipeline, so the board have been really good, the owner's been really good with it.\n\"We're all on the same page, which is important. I said we had to be really selective about what we were bringing in, it's important you get it right.\"", "url": "https://www.bbc.com/sport/football/articles/clykzn5ggzmo"}