{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-20 14:47:44", "date_modify": "2025-05-20 14:47:44", "date_publish": "2023-07-28 07:07:12", "description": "After their World Cup dreams were ended by Canada, the Republic of Ireland \"have business to finish\" in their final Group B game with Nigeria.", "filename": "sport_football_66319760_1747752464.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7BC2/production/_130528613_inpho_02298456.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66319760_1747752464.html", "title": "Women's World Cup: Hurt Irish have 'business to finish' with Nigeria", "title_page": "Women's World Cup: Hurt Irish have 'business to finish' with Nigeria - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Park the disappointment. Reset. Go again.\nThat was the message after the Republic of Ireland's defeat by Canada, which ensured their first World Cup will come to an end in the group stage.\nKatie McCabe's inch-perfect corner curled into the net and gave Ireland a surprise lead inside four minutes.\nThe roar from the Irish support, who dominated the 17,000-strong Rectangular Stadium in Perth, is something everyone in attendance will remember for a lifetime. It was proper spine-tingling stuff.\nAs you would expect from Olympic champions, however, there was no panic and Canada showed patience to work their way into the game despite the barrage of Irish pressure in the opening 44 minutes.\nYes, there was a touch of fortune about the equaliser, which touched off Megan Connolly and slid into the goal, but their winner was ultimately a fair reflection of the Canadians' second-half domination.\nCaptain McCabe was like a player possessed in the closing stages, and let out an expletive in the press area when watching back her late chance, where she had dribbled past three Canada players but her goal bound-shot was blocked by Shelina Zadorsky.\nIt was a great block and she knew it. Just like the penalty against Australia or the decisive moments on Wednesday, it was down to the fine margins.\nLong after the team return to Dublin, McCabe's magic moment will be replayed for years to come.\nKids in the parks will desperately be trying to recreate that moment, imitating the Irish captain's inch-perfect swing of her left boot. Muddy pitches, play parks, jumpers for goal posts? It doesn't matter. Everyone will be trying to replicate the touch of genius from a world-class player.\nYou think of all the goals in Irish World Cup history. Kevin Sheedy at Italia 90. Ray Houghton four years later in the USA. Robbie Keane in 2002. McCabe's goal was right up there.\n\"It was unbelievable,\" said goalkeeper Courtney Brosnan, who added the stunning Irish support \"means the world\".\n\"That has been the one time I wanted to run up and join in the celebrations because I'm kind of lonely by myself at the back.\n\"It was amazing. I'm so happy for her and nobody deserved it more than her.\",\nMarissa Sheva, who came on as a second-half substitute, added: \"The bench lost it. We were freaking out.\n\"I mean, it's so fitting that the first goal in a World Cup for Ireland was scored by Katie McCabe. That is so fitting, she deserves that.\n\"I know she won't even consider that a victory because the team didn't come out with a win.\n\"That just shows you what kind of leader she is.\"\nHowever, despite being knocked out, there is still an opportunity to create memories that are much more than one goal, no matter how brilliant it was.\nNigeria, who stunned co-hosts Australia on Thursday, await in the final group game in Brisbane and the match offers one more chance for iconic moments to be created.\nThe pressure is off, although time will tell if the defensive shackles will also be released from the Republic's usual structured style.\nIn their two games, Vera Pauw has put defensive solidity first but her side have been able to pile on the pressure when required. All that has been lacking is a clinical finish or killer touch.\n\"You will never see us give up,\" added winger Sheva.\n\"I am so proud of this team for that reason. We will go into that next game in Brisbane and we will fight like hell.\n\"We will try to come back with a result for Ireland, the fans who came out here to watch us and to show just how good this team is.\n\"You saw it at times. We're so close to being one of the best teams in the world, everyone can see that.\n\"With this being our first tournament, the fact we are so disappointed that we held Canada to a 2-1 and it could have been a very different result, I think you see that.\n\"We'll be back but we definitely have business to finish with Nigeria.\"\nNow that's fighting talk.", "url": "https://www.bbc.com/sport/football/66319760"}