{"authors": ["Sean Byrne", "www.facebook.com"], "date_download": "2025-05-21 05:02:55", "date_modify": "2025-05-21 05:02:55", "date_publish": "2025-04-04 09:22:05", "description": "Andoni Iraola press conference: West Ham vs Bournemouth preview", "filename": "sport_football_articles_cgjl6ldpl78o_1747803775.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5908/live/85292f40-6de2-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgjl6ldpl78o_1747803775.html", "title": "Andoni Iraola press conference: West Ham vs Bournemouth preview", "title_page": "Andoni Iraola press conference: West Ham vs Bournemouth preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "On Ryan Christie's groin injury: \"Christie is going to be out tomorrow. His situation is worrying because he has been dealing with a lot of injuries since the beginning of the season. He wanted to push and even with pain, he wanted to play and he has played very well for us. But it's a situation that we have to analyse because I think it has arrived at a time where his body is telling him not to push too much.\"\nOn if Christie will play again this season: \"There is a situation where we might even decide for him to take his time, recover and be ready for next season. But it's something we have to analyse well.\"\nSpeaking to BBC Radio Solent about Christie's importance to the squad, Iraola said: \"We know how important he is. Even if he is not playing all the games at 100%, he gives us a very high level. But sometimes you cannot have players and you have to adapt, and we will have to think of other options.\"\nOn Justin Kluivert: \"Justin [Kluivert] is going to be difficult. I wouldn't say he is definitely out. We will see today if he can train with us and help us from the bench at least. It is tight.\"\nAn update on the rest of the squad's availability: \"The good news is we have [Julian] Araujo back in the squad. He is training well. He is good. We are recovering some of the defenders who have been out but now the issue is on the offensive side.\"\nOn the midweek defeat by Ipswich: \"Analysing the Ipswich game, the mistake was defensively. It's a game where you cannot concede two goals. They needed very little to score the goals and that is my biggest concern.\"\nOn what needs to change to get a result against West Ham: \"There are things that we need to improve. We now have to do the basics really well - defend well, don't make big mistakes, stay focused and grow from there. That's our focus at the moment.\"", "url": "https://www.bbc.com/sport/football/articles/cgjl6ldpl78o"}