{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:02:42", "date_modify": "2025-05-21 05:02:42", "date_publish": "2025-04-04 09:35:51", "description": "We asked you if you thought Regis Le Bris was the best Sunderland boss since the start of Mick McCarthy's reign in 2003 - here's what you had to say.", "filename": "sport_football_articles_cqx4w5j1y9no_1747803762.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a94f/live/fada9ee0-10b2-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cqx4w5j1y9no_1747803762.html", "title": "'Le Bris is arguably the best since Reid'", "title_page": "Sunderland: Have Your Say - 'Le Bris is arguably the best since Reid' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked you if you thought Regis Le Bris was the best Sunderland boss over the last two decades, starting with the beginning of Mick McCarthy's reign in 2003.\nSome of you think the Frenchman gets top billing, while for others names like Tony Mowbray and Roy Keane still live long in the the memory.\nHere's what you had to say:\nKelly: Tony Mowbray was the manager to weed out the numerous wrongs and pick a players that complemented each other. Not fussy, just simple, straightforward good-quality football. Regis is now benefitting from Tony's team work and has fitted in seamlessly.\nCraig: I think Mowbray is. He did it when the team had lost a manager unplanned, he didn't have any signings and the owners only got him to survive and didn't expect him to be as successful as he was, this meant they had to stick with him until he had a sticky patch.\nI like RLB but in recent couple of months the team have stalled and he isn't showing another dimension to his coaching yet even though these are his players.\nRobert: Impossible to answer. I thought Keane was tremendous. He galvanised us like nobody I have seen and it was a pity he left. He is wasted as a pundit. There's no doubt for me that RLB is the most forward-thinking appointment made since Alan Durban. He's definitely the man to take us forward.\nGeoff: Given the squad he has at his disposal, I reckon he's doing a great job. Peter Reid takes some beating though.\nDavid: RLB is arguably the best manager we've had since Peter Reid. His tactical acumen is impressive, and his post-match honesty is refreshing - he doesn't sugar-coat performances, which is a welcome change.\nHowever, if there's one area for improvement, it's his use of substitutions and the limited opportunities given to players on the fringes of the first eleven. That said, he's had to contend with a significant number of injuries, not to mention the board's frustrating habit of signing players who are already carrying knocks.\nDespite these challenges, RLB has done an excellent job so far. If he's given the right backing and a bit more luck on the injury front, he could be the one to finally take us forward.", "url": "https://www.bbc.com/sport/football/articles/cqx4w5j1y9no"}