{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:55:32", "date_modify": "2025-05-21 06:55:32", "date_publish": "2024-12-24 08:13:20", "description": "Cardiff City: Injuries continue to bite for before Oxford United trip", "filename": "sport_football_articles_cge9x4wdp18o_1747810532.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/941f/live/66355690-c12f-11ef-9f09-23b1103db065.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cge9x4wdp18o_1747810532.html", "title": "Cardiff City: Injuries continue to bite for before Oxford United trip", "title_page": "Cardiff City: Injuries continue to bite for before Oxford United trip - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City's hopes of striking a blow in the scrap to avoid relegation from the Championship at Oxford United will be hindered, once again, by injuries within Omer Riza's squad.\nThe Bluebirds will target a first win in nine league games when they travel to the Kassam Stadium on 26 December (15:00 GMT).\nOxford are winless in their past seven matches – and have registered only one victory in 16 – but will hope to be boosted by the appointment of new head coach Gary Rowett, who leads the U's for the first time against Cardiff.\nBut any prospect of a boost from the treatment room looks slim for Cardiff, with manager Riza suggesting Joe Ralls and Callum O'Dowda are \"probably doubtful\" for the Oxford trip having missed last Saturday's home defeat to Sheffield United.\nPerry Ng and Ollie Tanner will definitely be absent, though neither has yet been ruled out of Cardiff's game at Watford on Sunday, 29 December.\nChris Willock is doubtful for the two festive away trips after he came off during the Blades loss with a hip problem, while the likes of Aaron Ramsey and David Turnbull remain sidelined.\nIsaak Davies and Kion Etete are building towards first-team comebacks having not featured all season, while Riza has confirmed Jamilu Collins has not been involved for selection reasons rather than any fitness issue, amid speculation that he could move on in January.", "url": "https://www.bbc.com/sport/football/articles/cge9x4wdp18o"}