{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:11:00", "date_modify": "2025-05-21 05:11:00", "date_publish": "2025-01-23 10:48:04", "description": "Callum McGregor hopes 'top player' Kyogo stays at Celtic", "filename": "sport_articles_c9w5gzyld4zo_1747804260.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c10f/live/32e811a0-d977-11ef-a7bb-3fe4cd8ea938.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c9w5gzyld4zo_1747804260.html", "title": "McGregor hopes 'top player' Kyogo stays at Celtic", "title_page": "Callum McGregor hopes 'top player' Kyogo stays at Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Is Kyogo Furuhashi edging towards a Celtic exit?\nRumours continue to swirl over the Japan striker's future and the latest links suggest Rennes are closing in on a £10m move, external.\nKyogo, 30, has been a huge player for Celtic since joining from Vissel Kobe in summer 2021 and captain Callum McGregor hopes the club can hang on to him.\nAfter the 1-0 win over Young Boys - in which Kyogo had a first-half hat-trick disallowed - secured Celtic's place in the Champions League play-off phase, McGregor said: \"I understand there is a lot of speculation.\n\"But he's a Celtic player at the minute and obviously we want to keep him for as long as we can.\n\"He's a top player. Again, you see his quality tonight, his movement, the way he sets the tone for the team.\n\"All our good players, we want to keep them for as long as we can. Generally, when there's speculation, then people have done well.\n\"We want that as well. It gets people talking about Celtic and the players that we've got. I'm sure the club will do everything they can to keep him because he's a top player and a top person as well.\"\nAs he reflected on a \"brilliant\" European night, McGregor praised striker Adam Idah, who has struggled for form this season but forced the late own goal against Young Boys after latching on to Reo Hatate's exquisite pass.\n\"He's a key part of the goal. He's done a lot of good work probably without the rewards of the goals,\" the skipper added.\n\"I know from playing with strikers they value themselves on goals so he'll feel amazing about that. But he's actually done some really good work for the team in the last few months since he's come back in. His value to the team is more than just goals.\"", "url": "https://www.bbc.com/sport/articles/c9w5gzyld4zo"}