{"authors": ["Jana McCabe", "www.facebook.com"], "date_download": "2025-05-21 07:27:47", "date_modify": "2025-05-21 07:27:47", "date_publish": "2025-01-22 12:46:20", "description": "Glentoran keeper Andrew Mills was \"lost for words\" after his penalty shootout heroics helped the Glens win their first County Antrim Shield in 14 years.", "filename": "sport_articles_c3rwp9x45qqo_1747812467.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aec/live/aa700a70-d8be-11ef-89b6-372b2b3acad8.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3rwp9x45qqo_1747812467.html", "title": "Glentoran win Co Antrim Shield: Andrew Mills on penalty shootout save", "title_page": "Glentoran win Co Antrim Shield: Andrew Mills on penalty shootout save - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glentoran keeper Andrew Mills was \"lost for words\" after his penalty shootout heroics helped the Glens win their first County Antrim Shield in 14 years.\nA stunning strike from Charlie Lindsay gave Declan Devine's side the lead before Andy Ryan's spot-kick levelled the game with neither side able to find another goal before the end of regular time.\nMills, who has recently signed a new 18-month deal at the Oval, then produced a superb stop during the shootout to divert Levi Ives' effort with all five of Glentoran's penalty takers finding the back of the net.\n\"I'm just delighted and lost for words,\" Mills told BBC Sport NI.\n\"It's been a special night with the way we won it and the way we worked so hard.\n\"To do it in front of the fans and my family who were here - these are the moments in football that you dream of.\"\nThe silverware is the first at the Oval since they lifted the Irish Cup back during the 2019/20 season and also denies Larne from writing their name in the history books as the first side to win the County Antrim Shield for five consecutive seasons.\nDevine, who was confirmed as permanent manager in April after a spell as caretaker boss, tasted success with the east Belfast side as a player in 1996 when he helped the club win the Irish Cup.\n\"Declan Devine brings everything. We trust him to the moon and back,\" said Mills.\n\"If there is one thing about him it's his honesty. When he gives us his honesty, we give him the trust and whether it's good or bad he always tells us it straight and we respect him in the team. You can also see the fans respect him.\n\"I've played in many teams and there is just something special here.\"", "url": "https://www.bbc.com/sport/articles/c3rwp9x45qqo"}