{"authors": ["Luke Reddy", "www.facebook.com"], "date_download": "2025-05-19 14:32:18", "date_modify": "2025-05-19 14:32:18", "date_publish": "2017-08-22 23:42:19", "description": "Conor McGregor says he will remain \"calm and cold\" when he faces Floyd Mayweather on Saturday amid chaotic scenes at the first media event of fight week.", "filename": "sport_boxing_41020155_1747665138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5184/production/_97486802_conor1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_boxing_41020155_1747665138.html", "title": "Floyd Mayweather v Conor McGregor: Chaos at media event in Las Vegas", "title_page": "Floyd Mayweather v Conor McGregor: Chaos at media event in Las Vegas - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "The opening event of a week of build-up to potentially the most lucrative fight in boxing history produced chaotic scenes in Las Vegas, with Floyd Mayweather booed by unhappy fans.\nThe undefeated American arrived and was barely visible, entering amid a large entourage before being largely hidden on stage by a media scrum.\nConor McGregor, his UFC champion challenger, then arrived and made a beeline for an Irish flag in the crowd before performing an impromptu lap of fans, as media and security gave chase.\nOnce on stage, the 29-year-old Irishman said he would be \"calm and cold\" when he met the former five-weight boxing world champion on Saturday.\n\"He needs to be put to sleep,\" said McGregor. \"He will wake up a better man. I am going to do that for him.\"\nBBC 5 live sports correspondent Richard Conway\nThis was hype and showmanship taken to a whole new level.\nWhen Conor McGregor finally walked on, he did so as the self-styled people's champion, strutting around the open plaza as if he owned it.\nLike a presidential candidate on the eve of polling day, he shook hands and high-fived as many supporters as he could reach.\nDressed in a purple suit, he told his expectant audience he would knock Mayweather unconscious on Saturday night, which elicited a huge cheer.\nAs he tried to depart I managed to ask him if he really is, as he claims, going to shock the world on Saturday night.\nNodding, he turned to the crowd and said \"for these fans, I love these fans\".\nMcGregor's legend continues to grow. It increasingly feels like he stands to win big in the long term, no matter what happens in the ring this weekend.\n\"Over the course of the next week, Vegas is Ireland,\" said McGregor, after eventually making it to the stage. \"We run Las Vegas. We are here to take over this whole city.\"\nOrganisers say the bout - which will be broadcast on BBC Radio 5 live - is the most accessible in boxing history, with fans able to watch through social platforms. They estimate around a billion people will watch worldwide.\nIt is expected the bout could generate over $600m and go close to becoming the richest in boxing history.\nVictory for Mayweather, who has come out of retirement for the fight, would take his record to 50 wins from 50 bouts and surpass the late Rocky Marciano's flawless 49-fight record.", "url": "https://www.bbc.com/sport/boxing/41020155"}