{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:20", "date_modify": "2025-05-21 05:22:20", "date_publish": "2025-04-03 16:00:13", "description": "Sunderland boss Regis Le Bris confirms that the Black Cats were keen to keep hold of Brighton-bound Tommy Watson.", "filename": "sport_football_articles_c0qndxkggj4o_1747804940.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8db2/live/fc33fd10-10a1-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c0qndxkggj4o_1747804940.html", "title": "Sunderland boss Regis Le Bris says club has to move on from Tommy Watson", "title_page": "Sunderland boss Regis Le Bris says club has to move on from Tommy Watson - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland boss Regis Le Bris says that the Black Cats were keen to keep hold of Brighton-bound Tommy Watson - but is trying to look on the bright side of the teenager's move.\nWatson, 18, signed for the Seagulls in a deal worth £10m on Tuesday and will join the Premier League side in the summer.\n\"We have to accept the situation. The timing is not ideal but at the same time we know that Tommy had multiple offers from Premier League clubs before,\" Le Bris told BBC Radio Newcastle.\n\"We declined and tried to renew his contract. It wasn't possible in the end. So, it's his decision and we have to move on.\n\"I hope it's a positive output for the club financially at least and for the future of the club, we'll see.\"\nDespite the winger's departure at the end of the season, it does not mean he won't play a role in Sunderland's hunt for promotion.\n\"I think he will be involved because he is professional and this situation is not unusual in football and you have to deal with it,\" Le Bris added.\n\"So, the timing is a little bit weird. I accept that and it's clear, but at the same time we want to push on until the end of the season.\"\nMeanwhile, midfielder Enzo Le Fee and defender Leo Hjelde are both expected to make their return from injury for Saturday's trip to promotion rivals West Brom.", "url": "https://www.bbc.com/sport/football/articles/c0qndxkggj4o"}