{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:52:20", "date_modify": "2025-05-20 12:52:20", "date_publish": "2023-08-03 11:04:00", "description": "Is Declan Rice fee the issue in West Ham transfer window struggles?", "filename": "sport_articles_c0k4jl7j9jzo_1747745540.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cdc0/live/b707b4d0-3159-11ee-831d-d18732f5bd67.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0k4jl7j9jzo_1747745540.html", "title": "Is Declan Rice fee the issue in West Ham transfer window struggles?", "title_page": "Is Declan Rice fee the issue in West Ham transfer window struggles? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nicola Pearson, BBC Sport\nWest Ham have a well documented £100m burning a hole in their pocket and yet, they are the only team in the Premier League not to have made a first team signing this summer.\nDeclan Rice's departure had been on the cards for a number of transfer windows and was all but confirmed by chairman David Sullivan after their Europa Conference League victory.\nThe Hammers proved to be tough negotiators and weren't going to let their prized asset leave for less than they deemed him worth, turning down two offers from Arsenal and one from Manchester City before finally agreeing a deal with the north London side.\nBut are the funds other clubs know West Ham have hindering them in bringing in players?\nIt's not like they haven't tried.\nSince Rice completed his move to Arsenal, West Ham have reportedly had a £45m bid rejected for Fulham midfielder Joao Palhinha, a £40m offer turned down for Chelsea's Connor Gallagher, £20m rejected for Manchester United's Harry Maguire and are now understood to be walking away from a deal to sign Southampton's James Ward-Prowse after a second bid was also turned down.\nOn the one hand, the issue could simply be that the Hammers are chasing players that clubs don't want or need to sell.\nBut, in an already inflated transfer market, there is the chance that other clubs will be increasing the value of their players in the knowledge that West Ham have the Rice transfer income to spend. West Ham's need to find replacements looks all the more pronounced given former Hammer Joe Cole previously said \"everything good that West Ham do goes through\" Rice.\nTime is still on the east London club's side however, with four weeks remaining in the transfer window and options such as Ajax's Edson Alvarez still on the table.\nLondon rivals Chelsea have had to be prepared to sell players for less than they might be worth in their need to get wages off the books and in contrast the Hammers may have to be prepared to pay more than their board had hoped in the pursuit of replacing their former captain before the window shuts on 1 September.", "url": "https://www.bbc.com/sport/articles/c0k4jl7j9jzo"}