{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:22:03", "date_modify": "2025-05-21 05:22:03", "date_publish": "2025-04-03 12:00:05", "description": "Liverpool 1-0 Everton: Stephen Warnock analysis of Merseyside derby", "filename": "sport_football_articles_cewg27x0gl0o_1747804923.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2779/live/e8c8d6b0-105b-11f0-b5c7-a57db5b55315.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cewg27x0gl0o_1747804923.html", "title": "Liverpool 1-0 Everton: Stephen Warnock analysis of Merseyside derby", "title_page": "Liverpool 1-0 Everton: Stephen Warnock analysis of Merseyside derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Liverpool defender Stephen Warnock says there has been a drop-off in performances in the second half of the season and warns they will not want to \"limp over the line\" after such a strong run at the top of the table.\nSpeaking on BBC Radio 5 Live's Football Daily podcast, Warnock acknowledged a terrific bit of skill from Diogo Jota was required to break down Everton's stubborn backline on Wednesday at Anfield.\n\"When you think about the way Liverpool have played this year,\" he said, \"the first half of the season was very controlled and organised so teams found it difficult to break them down. That has been a bit different since the start of this new year.\n\"What we are seeing now is that teams are finding ways to get at them and find a way through.\n\"They rode their luck a little bit against Everton, stayed in the game and waited for the opportunity that can give them that moment of magic.\n\"Of the front three, Luis Diaz was the bright spark but had no end product and Mohamed Salah was non-existent. That is a concern for Liverpool.\n\"You can't limp across the line with your strikers not being at your best. They are making it harder for themselves.\"\nWarnock also highlighted a drop in intensity from those behind the forwards as being something to worry boss Arne Slot.\n\"My main concern is the three midfielders look dead on their feet,\" he said. \"Alexis Mac Allister doesn't look anywhere near the player he was and his passing control in games has run away from him a little bit. Ryan Gravenberch doesn't look like he can get back at players which is different to the driving runs we saw up until the new year.\n\"Slot has struggled to rotate that area more than he would have liked to. I think we will see back-up for those positions come in so that he can rotate.\n\"It is difficult because if you are a successful team then by the end of the season all the minutes you have played catch up with you. That is what we are seeing.\"", "url": "https://www.bbc.com/sport/football/articles/cewg27x0gl0o"}