{"authors": ["Andy Gray", "www.facebook.com"], "date_download": "2025-05-21 06:19:13", "date_modify": "2025-05-21 06:19:13", "date_publish": "2025-01-14 06:30:31", "description": "As interim head coach Simon Easterby prepares to announce his Ireland squad on Wednesday, BBC Sport NI looks at his options ahead of the Six Nations.", "filename": "sport_rugby-union_articles_c8j8y78zwjwo_1747808353.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/418b/live/6e1ea460-d19c-11ef-a14b-8f7223b7d1ef.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c8j8y78zwjwo_1747808353.html", "title": "Six Nations 2025: What could holders Ireland's squad look like?", "title_page": "Six Nations 2025: What could holders Ireland's squad look like? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It is not quite a new era for Ireland heading into this Six Nations, but it does feel like a new chapter.\nWith head coach Andy Farrell now on duty with the British and Irish Lions, Simon Easterby will take charge for this year's tournament.\nIreland are aiming to become the first team to win three Six Nations titles in a row.\nIt will be a big ask for Easterby, but what could his first Ireland squad look like?\nHe will name it on Wednesday, and BBC Sport NI takes a look at his options.\nIf Ireland are to make history with three Six Nations titles, they will need the players who have delivered on the big stage.\nIt is expected that consistency will be key for Easterby and all the big hitters will remain.\nCaelan Doris will lead a whole host of Leinster team-mates, including Andrew Porter, James Ryan, Garry Ringrose, Robbie Henshaw, James Lowe and Hugo Keenan.\nKey prop Tadhg Furlong's return from injury is timely, especially now Ulster's Tom O'Toole is suspended for the opening two matches, but hooker Dan Sheehan has yet to return to action.\nWhile Leinster will dominate, Munster are also likely to be represented in the squad with Tadhg Beirne, Conor Murray, Jack Crowley and Calvin Nash all squad regulars.\nProp Oli Jager could be recalled after missing November's Tests through injury, but Peter O'Mahony is currently sidelined and time is ticking before Ireland's opener on 1 February.\nConnacht will be represented by centre Bundee Aki, prop Finlay Bealham and wing Mack Hansen, who will be free to play against England when his suspension ends.\nThis will not be the first time that Easterby has taken charge of an Ireland side.\nIn September, he led a youthful Emerging Ireland side on a tour of South Africa for the second time in three years.\nThree of the squad went on to earn senior caps in November's internationals. Highly rated fly-half Sam Prendergast is not only in contention for the squad, but also the starting jersey in a battle with Crowley and Ciaran Frawley.\nGus McCarthy capitalised on an injury crisis at hooker and made an explosive debut against Fiji, while Ulster's Cormac Izuchukwu also had a solid first cap against the Pacific Islanders.\nBut who else could potentially be selected for the Six Nations?\nProp Thomas Clarkson also earned a debut in the autumn, while Alex Kendellen captained Emerging Ireland in South Africa and is now a regular starter for Munster.\nHe is tipped for a big future and was in the wider training squad for the autumn series.\nWhile Ulster's form has been poor, centre Jude Postlethwaite could force his way into contention in a stacked centre area and prop Scott Wilson could be a beneficiary of O'Toole's suspension.\nLeinster's Jamison Gibson-Park was Ireland's number one scrum-half under Andy Farrell and that is unlikely to change under Easterby.\nThe question is more over who will be next in line to be back-up to the 32-year-old, who has had a number of injury concerns in the past six months.\nCraig Casey had appeared to have taken that mantle off Munster team-mate Conor Murray, but the 25-year-old is set to miss the tournament with a knee injury.\nMurray is the obvious candidate to be Easterby's number two, but who else could make the squad?\nConnacht's Caolin Blade and Ulster's Nathan Doak made it into squad for the summer tour of South Africa.\nDoak remained uncapped and Blade, who has fallen behind the in-form Ben Murphy in Connacht's pecking order, did not add to his two Ireland appearances.\nLuke McGrath is Gibson-Park's deputy at Leinster and is an option as he looks to win a first cap since 2020 while a recall for Ulster's John Cooney would be a surprise at best.", "url": "https://www.bbc.com/sport/rugby-union/articles/c8j8y78zwjwo"}