{"authors": ["Ethan Hampton", "www.facebook.com"], "date_download": "2025-05-21 06:05:18", "date_modify": "2025-05-21 06:05:18", "date_publish": "2025-04-01 14:43:22", "description": "Fan voice: Familiar failing undid all Dundee's good work against Rangers", "filename": "sport_articles_cwynlv33080o_1747807518.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c953/live/3aff6fb0-0f04-11f0-b234-07dc7691c360.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cwynlv33080o_1747807518.html", "title": "Fan voice: Familiar failing undid all Dundee's good work against Rangers", "title_page": "Fan voice: Familiar failing undid all Dundee's good work against Rangers - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's good to see teams have a go at the Old Firm and refreshing to avoid a full-blown low block/parking the bus.\nThis season I've been pleased with Dundee's efforts against Celtic and Rangers at Dens. It's incredible that across the three games we've scored seven goals, arguably been the better team in each meeting and haven't won any of them.\nWe aren't expected to win these games so the fact we come out frustrated is a sign we're doing something right.\nOn Saturday night it was like we picked up where we left off in the Dundee derby and we looked like scoring every time we went forward. We were well worth the 2-0 lead and going in at half-time at just 2-1 really flattered Rangers.\nAt 3-1 up I thought Dundee were going to hit Rangers for five! It very well could have been the case if Dundee were more clinical – we were made to rue a handful of big chances wasted including two efforts that battered the post.\nThe main worry, though, is the failure to manage a game until the end. This was another trademark Dundee defeat complete with throwing away a comfortable lead and conceding the winner in stoppage time.\nThis has plagued Dundee for the second season running and it's difficult to see when it will be fixed.\nLast season we dropped 25 points from winning positions, more than any other team in the division. At present we are top of that chart again having dropped 23 points from winning positions with six games left to play.\nA slight improvement in game management last season could have been the difference in securing a European place. This season our failure to remediate this has condemned us to the bottom six and a relegation battle.\nThis is the youngest team in the league, but the fans need to see improvement in results on a more consistent basis. That is the only way they'll be convinced the project is going in the right direction.\nSt Mirren at home next, this is our chance to make amends for the collapse against Rangers and look to pull away from the play-off zone.", "url": "https://www.bbc.com/sport/articles/cwynlv33080o"}