{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:39:52", "date_modify": "2025-04-26 03:39:52", "date_publish": "2025-03-05 10:51:55", "description": "Lewis Hall injury: Who should play left-back for Newcastle?", "filename": "sport_football_articles_cj0qm3m96z3o_1745638792.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9a5/live/7dbc45c0-f9a7-11ef-a629-ef88fbd35a13.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cj0qm3m96z3o_1745638792.html", "title": "Lewis Hall injury: Who should play left-back for Newcastle?", "title_page": "Lewis Hall injury: Who should play left-back for Newcastle? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "With Lewis Hall's foot injury ruling him out for the remainder of the season, Newcastle United all of a sudden look light at left-back.\nAfter bringing in Lloyd Kelly from Bournemouth last summer, the Magpies sold him in January and with no other natural option available for Eddie Howe, the manager needs to find a solution, particularly with the Carabao Cup final looming.\nTino Livramento played there in the absence of Hall in Sunday's 2-1 FA Cup loss at home to Brighton and has deputised there in the past, despite primarily featuring as Howe's first-choice right-back this season.\nThat would mean Kieran Trippier returns on the right flank.\nDan Burn is another option having played regularly at left-back during the season where Newcastle qualified for the Champions League and the following campaign.\nHowever, Sven Botman's ongoing recovery from an injury means Burn will likely still be required in the heart of defence.\nIf Burn was to go to left-back, Emil Krafth could come in and partner Fabian Schar at centre-back.\nAlso, is there an opportunity for Matt Targett? The 29 year old has played just 11 minutes of Premier League football this season but is at least a specialist left-back and came on in the FA Cup.\nAlternatively, Trippier has played at left-back for England and Howe has even deployed Joelinton as a left wing-back at times too.\nHall's development has been one of the greatest takeaways from the 2024-25 season so far for Newcastle - and England - so the injury is a blow.\nHowe has shown ingenuity in the past to deal without his best players and, with an important run-in, he must do so again.", "url": "https://www.bbc.co.uk/sport/football/articles/cj0qm3m96z3o"}