{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:24:52", "date_modify": "2025-05-21 07:24:52", "date_publish": "2024-12-23 22:16:09", "description": "Larne boss Gary Haveron is delighted that his side produced a \"dogged\" display in their 1-0 against Dungannon Swifts at Stangmore Park.", "filename": "sport_articles_c5yw59kzyveo_1747812292.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bf7/live/5f447420-c179-11ef-a670-93fff78946a3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c5yw59kzyveo_1747812292.html", "title": "Haveron pleased with 'dogged' Larne display in Swifts win", "title_page": "Irish Premiership: Gary Haveron pleased with 'dogged' Larne display in Swifts win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Larne boss Gary Haveron was delighted that his side produced a \"dogged\" display in their 1-0 against Dungannon Swifts at Stangmore Park.\nMark Randall scored the only goal of the game for the Inver Reds and Haveron was pleased that they were able to restrict the high-flying Swifts to few chances.\n\"It is tough to come down to Dungannon at the best of times, they're flying and Rodney McAree has them playing good football, \"Haveron explained.\n\"We knew we had to come down here with a game plan. be dogged and come away with three points and that's what we've done.\"\nHaveron, who was taking charge of his first league game as manager, also praised his players for building on their historic Uefa Conference League victory against Gent on Thursday.\nLarne are now 22 points behind league leaders Linfield with six games in hand as they look to win their third Gibson Cup in a row\n\"It was important we backed up the Gent performance and result and we managed to do that, we got the goal when we were staring to get on top,\" Haveron added.\n\"We know we need to put a run together to move up the league.\"\nHe also joked that Larne's lucky charm in their last two games have been contract extensions handed out to the subsequent goal scorers on the day of the game.\n\"Tomas [Cosgrove] got the goal on Thursday night and he had a contract extension the same day and then Mark tonight, so we need to get a few more boys on new contracts on the days of games it's been a good omen for us!\"", "url": "https://www.bbc.com/sport/articles/c5yw59kzyveo"}