{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:46:35", "date_modify": "2025-05-21 03:46:35", "date_publish": "2025-04-07 16:11:57", "description": "Former Wales international and Newport RFC legend Brian Jones has died aged 89.", "filename": "sport_rugby-union_articles_c7vnzdmr148o_1747799195.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/82b2/live/ca1ef280-13cb-11f0-bf82-cb6aee90e3a2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_articles_c7vnzdmr148o_1747799195.html", "title": "Newport RFC legend Brian Jones dies aged 89", "title_page": "Newport RFC legend Brian Jones dies aged 89 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Wales international and Newport RFC legend Brian Jones has died aged 89.\nJones, affectionately known as 'Mr Newport', gave 70 years of service to the Black and Ambers, making 330 appearances as a player, while serving as a captain, coach, chairman and president.\nJones had also represented Crawshays, the Royal Navy, the Barbarians and earned two caps for Wales, making his international debut against Ireland in 1960.\nOne of his career-defining achievements was to be only the second player, after Percy Bush, to beat all three major southern hemisphere touring teams on Welsh soil.\nJones played in Newport's famous win over Australia in 1957, helped the Barbarians defeat South Africa in 1960 and then celebrated victory over the mighty All Blacks at Rodney Parade three years later.\nHis legacy extended beyond the pitch as he went on to coach Newport to a Welsh championship in 1969 as well as victory over the Springboks in the same year.\nNewport RFC called Jones \"one of the greatest rugby men of a generation\".\n\"Brian's footprint is etched into the fabric of Newport RFC, and his presence will be deeply missed by all who had the privilege to know him and listen to him recall past glories,\" a club statement said.", "url": "https://www.bbc.com/sport/rugby-union/articles/c7vnzdmr148o"}