{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:16:51", "date_modify": "2025-05-20 13:16:51", "date_publish": "2023-08-03 00:00:00", "description": "Follow text and radio commentary as Northern Superchargers host Birmingham Phoenix in the 2023 Women's Hundred.", "filename": "sport_live_cricket_66306322_1747747011.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/110B6/production/_130641896_gettyimages-1589936050.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_cricket_66306322_1747747011.html", "title": "The Hundred 2023 LIVE: Northern Superchargers vs Birmingham Phoenix in women's competition plus score, commentary, video highlights & updates", "title_page": "The Hundred 2023 LIVE: Northern Superchargers vs Birmingham Phoenix in women's competition plus score, commentary, video highlights & updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Join us for part two of our double-header\nThat's it for the first part of our double-header then as Northern Superchargers claim a dominant win over Birmingham Phoenix off the back of a superb all-round display from Alice Davidson-Richards.\nYou can read Mike Peter's report on the first game at Headingley here.\nWe'll be back for the men's game - it's Superchargers v Phoenix again - at 18:15 BST and the exciting news is that England Ashes stars Harry Brook and Ben Duckett are both available!\nJoin us here at 18:15 BST for that one!\n'Wasn't too shabby'\nMatch Hero Alice Davidson-Richards: \"It has been pretty phenomenal, I'm chuffed for the girls. As days go it wasn't too shabby.\n\"They were playing some lovely shots to start, their top-order will definitely get away some days. It was about keeping it simple and bowling your best ball for as long as possible.\n\"There isn't too much chat about the differences between T20s and this. It's nice that you can't go for that four or six off the sixth ball! The plans were pretty similar.\n\"The other batters did the hard work, I just knocked a few over. It was a slightly slower wicket but it played great.\n\"We were really close [to the knockout stage] last year and it was frustrating. We're definitely aiming for the knockouts. It's about doing what we do best for as long as possible and hope the other team blinks first.\"", "url": "https://www.bbc.com/sport/live/cricket/66306322"}