{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:45:31", "date_modify": "2025-04-26 07:45:31", "date_publish": "2025-03-02 00:00:00", "description": "Follow live text commentary, score updates and radio commentary from Newcastle United vs Brighton & Hove Albion in the FA Cup fifth round.", "filename": "sport_football_live_cq8yk3e02pyt_1745653531.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4b20/live/97e67310-f788-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_live_cq8yk3e02pyt_1745653531.html", "title": "FA Cup fifth round LIVE: Newcastle United v Brighton & Hove Albion", "title_page": "FA Cup fifth round LIVE: Newcastle United v Brighton & Hove Albion - radio and live updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Danny Welbeck scored an extra-time winner as Brighton beat Newcastle to reach the FA Cup quarter-finals after an incident-packed tie that ended 10-a-side.\nThe Magpies thought they had booked their place in the final seconds of normal time, but Fabian Schar's cushioned volley was disallowed for offside by the video assistant referee (VAR).\nNewcastle had taken a 22nd-minute lead through an Alexander Isak penalty, but Yankuba Minteh levelled just before half-time against the club that sold him in the summer.\nBoth teams had players sent off in a dramatic climax.\nNewcastle's Anthony Gordon was shown a straight red card in the 83rd minute for pushing Jan Paul van Hecke in the head – a decision that will rule him out of the Carabao Cup final against Liverpool through suspension.\nBrighton defender Tariq Lamptey was then dismissed in added time at the end of 90 minutes for a second booking following a late challenge on Jacob Murphy.\nThe game looked as if it would be going to penalties before Solly March played in Welbeck with six minutes left and he calmly chipped home keeper Martin Dubravka to send the away fans wild.\nIt was Welbeck's eighth goal of the season and the 34-year-old - who won the FA Cup twice with Arsenal - also netted the winner in Brighton's Premier League game at Newcastle in October.\nThe Seagulls will host Nottingham Forest or Ipswich - who play their fifth-round tie on Monday - in their quarter-final on the weekend of Saturday, 29 March.\nBrighton and Newcastle are both teams for whom winning the FA Cup would mean the world to their fans.\nAlbion, eighth in the Premier League but only a point behind sixth-placed Newcastle, are clearly the best current team in England to have never won a major trophy.\nFabian Hurzeler's side are now two wins from reaching their first FA Cup final since 1983, when they famously lost to Manchester United in a replay.\nThey were not at their best here and could have been more than a goal behind before Gambian Minteh levelled.\nBut level he did. The 20-year-old flicked the ball to Joao Pedro and then raced on to the Brazilian's fantastic through-ball before scoring via a deflection from the sliding Kieran Trippier.\nMinteh – who had brought down Tino Livramento for Newcastle's penalty opener - did not celebrate his goal on his first return to St James' Park, despite never playing a game for Eddie Howe's side before his departure last summer.\nHe joined the Magpies in the summer of 2023, but joined Feyenoord on loan on the same day. On returning, Minteh was sold for £30m to Brighton on 1 July.\nBrighton had several chances to score – and when Gordon was sent off it looked as if they had the edge. But just before the end of normal time, Lamptey clattered into Murphy and followed the England forward down the tunnel.\nWhen Schar volleyed in from the resulting Bruno Guimaraes' free-kick, the Seagulls looked to be out.\nBut semi-automated offside technology showed the Newcastle defender was offside and Brighton had a reprieve – of which they took full advantage.\nNewcastle, battling with Brighton in the league for a European place next season, would have been targeting this as a chance to win a first trophy since the 1969 Inter-Cities Fairs Cup.\nThey have a big chance to end that drought later this month when they face Liverpool in the Carabao Cup final on Sunday, 16 March.\nBut they will have to take on the Reds without key forward Gordon, who was dismissed for a completely unnecessary clash with Van Hecke. The England international laughed at the Brighton defender lying on the ground before seeing the red card come out.\nTo make matters worse, the incident happened after Isak was ruled offside in an attacking move so nothing that happened would have counted – except the punishment for violent conduct.\nIt had started well for Newcastle when Isak, returning from a groin injury, slammed in a fine penalty for his 22nd goal of the season in all competitions.\nGordon had an effort saved and Isak - who went off in the 86th minute - slammed in a stunning shot from a tight angle from Harvey Barnes' pass, but it was ruled out for offside.\nSchar's \"winner\" was also correctly ruled out for offside and, while Newcastle had eight shots in the second half of extra time, Brighton scored with their only one through substitute Welbeck, who was kept onside by Livramento.", "url": "https://www.bbc.co.uk/sport/football/live/cq8yk3e02pyt"}