{"authors": ["Tyrone Smith", "www.facebook.com"], "date_download": "2025-04-26 03:39:56", "date_modify": "2025-04-26 03:39:56", "date_publish": "2025-03-05 10:50:19", "description": "Shaughnessy the 'spark' Dundee desperately need?", "filename": "sport_articles_cwyjkmgm9rwo_1745638796.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b9a/live/cbc497b0-f9aa-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cwyjkmgm9rwo_1745638796.html", "title": "Shaughnessy the 'spark' Dundee desperately need?", "title_page": "Shaughnessy the 'spark' Dundee desperately need? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Dundee manager Tony Docherty declared \"we've stopped the rot\" after the 1-1 draw with Premiership bottom club St Johnstone at Dens Park last weekend.\nHe is correct in terms of ending a run of five straight league defeats. But it remains to be seen if his side have turned a corner and can start to head in the right direction.\nThe Dark Blues remain second bottom, precariously placed just three points above Saints.\nThey also have a tough looking pre-split quartet of games – away dates at Dundee United and Hibs plus home games against Rangers and St Mirren.\nSo there is plenty of work to do, but one positive amid the gloom is the welcome return of skipper Joe Shaughnessy after a lengthy spell out injured.\nThe Irishman made his first start in 11 months against Saints and there is no doubt Dundee are more assured at the back with the 32-year-old on the pitch.\nAs well as his quality as a footballer, the leadership and organisational qualities he brings to the team on the park – as well as off it – are invaluable.\nAnd those are the kind of characteristics needed when a side find themselves in a dogfight.\nOne player doesn't make a team, but maybe the return of Shaughnessy could be the catalyst Dundee need to spark them back to life and help banish relegation fears over the next few weeks.", "url": "https://www.bbc.co.uk/sport/articles/cwyjkmgm9rwo"}