{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:03:59", "date_modify": "2025-05-20 14:03:59", "date_publish": "2023-07-25 00:00:00", "description": "Follow live text commentary as New Zealand face Philippines in Group A of the 2023 Women's World Cup.", "filename": "sport_live_football_66157901_1747749839.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/53DE/production/_130507412_gettyimages-1568835587.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66157901_1747749839.html", "title": "Fifa Women's World Cup LIVE: New Zealand vs Philippines score, commentary & updates from Group A game", "title_page": "Fifa Women's World Cup LIVE: New Zealand vs Philippines score, commentary & updates from Group A game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Follow Switzerland vs Norway\nFT: New Zealand 0-1 Philippines\nThat's all from us. You can follow live text coverage of the other match in Group A where Switzerland can now go through to the last 16 with victory over Norway.\nThis result has also given Norway a pretty strong lifeline. All to play for. That game kicks off in half an hour.\nFollow that match here.\nFULL-TIME\nNew Zealand 0-1 Philippines\nALL OVER. Incredible victory for the Philippines. The substitutes sprint onto the pitch at the sound of the whistle. Players from both sides have got their heads in their hands - the victorious in disbelief and the New Zealanders in disappointment. Huge result.\nThey are the first debutants to pick up a win at this tournament and it might prevent the co-hosts from progressing to the last 16. Wow.\n'Save of the tournament'\nNew Zealand 0-1 Philippines\nEmma Byrne\nFormer Ireland goalkeeper on ITV1\nWhat a save!\nAbsolutely incredible, that's an incredible save by McDaniel. She gets so far down to her left to push it away.\nThat's the save of the tournament so far.\nGREAT SAVE!\nNew Zealand 0-1 Philippines\nThis is an unbelievable save from goalkeeper Olivia McDaniel, who has been excellent all match.\nSubstitute Grace Jale almost finds the corner with a brilliant half-volley but McDaniel stretches and gets fingertips to it. Stunning save!\nPost\nNew Zealand 0-1 Philippines\nHannah Wilkinson is such a threat. She gets a touch on the corner but flicks it wide under pressure from the goalkeeper.\nAnother chance goes begging... Time running out rapidly.\nDISALLOWED GOAL\nNew Zealand 0-1 Philippines\nAnother goal ruled out for offside... And it's the Philippines' Isabella Flanigan who is slipped through but she's gone a yard too early when she slots it past the goalkeeper. New Zealand go up the other end but it's dealt with by the Philippines' plucky defence.\n2,500 watch Lionesses train\nSarah Dawkins\nBBC Sport in Sydney\nEngland have been preparing for Friday's match against Denmark with a community training session at Central Coast Stadium in New South Wales.\nThey are in Terrigal, which is by the coast and an hour's drive north of Sydney.\nThere was an impressive turnout with 2,500 fans coming along to watch the Lionesses train.\nAfterwards, the players were officially greeted with a “Welcome to Country” and smoke ceremony by the Darkinjung group. Players then signed autographs and posed for pictures with fans.\nSUBSTITUTIONS\nNew Zealand 0-1 Philippines\nGoalscorer Sarina Bolden, who has created history here today, is substituted by the Philippines' coach. She gets a high five from all of her team-mates and staff.\nGrace Jale replaces captain Ria Percival in a New Zealand change.\nPost\nNew Zealand 0-1 Philippines\nGood build-up from New Zealand as Rebekah Stott helps switch the play before teeing up Olivia Chance on the edge of the box.\nShe hits it first time but slices it wide.\n'Disaster for New Zealand'\nNew Zealand 0-1 Philippines\nEmma Byrne\nFormer Ireland goalkeeper on ITV1\nTo lose, to not get anything from this game now, would be a disaster for New Zealand now.\nJitka Klimkova must be thinking about a change, New Zealand are starting to look a bit lethargic.\nOn the other side, this will be a massive victory for the Philippines.\nPost\nNew Zealand 0-1 Philippines\nYou can see the frustration starting to kick in. Sofia Harrison comes across to track the run of Hannah Wilkinson, who goes down appealling for a free-kick which she is never going to get.\nPost\nNew Zealand 0-1 Philippines\nThe Philippines have not had a shot since the 24th minute - when they scored.\nBut they are holding on here in Wellington. This would be some result!\nDISALLOWED GOAL\nNew Zealand 0-1 Philippines\nA huge decision which goes against New Zealand as Jacqui Hand loops a header into the back of the net but it's ruled out for offside by VAR. It was great build-up play from Hannah Wilkinson to chip it back into the middle.\nHITS THE WOODWORK\nNew Zealand 0-1 Philippines\nOlivia Chance is really making a difference. She curls in a beautiful ball from the left which Jacqui Hand can take in her stride. She just has the keeper to beat but she pokes it onto the left post.\nIt bounces back out dangerously but goalkeeper Olivia McDaniel reacts to gobble it up.\nSUBSTITUTION\nNew Zealand 0-1 Philippines\nPhilippines teenager Isabella Flanigan, their number nine, is on up front, replacing Sara Eggesvik.\nEggesvik got the assist in the first half so has more than done her part.", "url": "https://www.bbc.com/sport/live/football/66157901"}