{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:15:57", "date_modify": "2025-05-21 06:15:57", "date_publish": "2025-03-31 09:31:57", "description": "Dundee Utd fan views: 'Let's turn a great season into a remarkable one'", "filename": "sport_articles_cyvqpv45z9po_1747808157.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2da/live/9fa99b20-fa7e-11ee-97f7-e98b193ef1b8.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cyvqpv45z9po_1747808157.html", "title": "'Let's turn a great season into a remarkable one'", "title_page": "Dundee Utd fan views: 'Let's turn a great season into a remarkable one' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Dundee United's win at Ross County.\nHere's what some of you had to say:\nDave: The result was all that mattered. The fans at the game didn't care that it wasn't pretty football. You could see that from the reaction of the team and our support at the end of the game. Great scenes. And how come Luca [Stephenson] didn't get a penalty?\nKieran: Not the prettiest game to watch, but we got the job done. Feels great to have that winning feeling back and all but secure top six in our first season back. Massive well done to Jim [Goodwin] and the team. Lets enjoy these final seven games and turn a great season into a remarkable one.\nMalcolm: Top six now looks on which is a great achievement. Hope we don't qualify for Europe, it wrecked us last time. Significant rebuild required in summer with a number likely to be moving on.\nJamie: Vicko Sevelj was outstanding filling in at centre back. Ross Docherty was the cool head dictating play that we've missed for most of the season. But a cut above was Ross Graham. It will be a travesty if he isn't in the Scotland squad for the World Cup qualifiers.\nJohn: Poor quality game but we deserved to edge it. The minimal amount of grass on the pitch didn't help the players on either side. Credit to Goodwin for taking off Craig Sibbald, who had little impact on the game, and replacing him with Louis Moult. His ability to kill the ball and pass up front changed the whole dynamic. Also delighted to see Docherty play a full game. If given a decent pitch he will play a massive part in our final push for a European place this season.", "url": "https://www.bbc.com/sport/articles/cyvqpv45z9po"}