{"authors": ["Katie Stafford", "www.facebook.com"], "date_download": "2025-04-26 06:58:47", "date_modify": "2025-04-26 06:58:47", "date_publish": "2025-02-28 13:18:57", "description": "Pep Guardiola press conference: Man City vs Plymouth FA Cup preview", "filename": "sport_football_articles_cjd3373znxmo_1745650727.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/deec/live/405a9a50-4922-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cjd3373znxmo_1745650727.html", "title": "Pep Guardiola press conference: Man City vs Plymouth FA Cup preview", "title_page": "Pep Guardiola press conference: Man City vs Plymouth FA Cup preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Erling Haaland \"is good\" after recovering from his knee injury.\nGuardiola said forward Oscar Bobb \"is getting better\" and has trained for the last two days so he hopes \"he can help us in the last part of the season\".\nIn response to opponents Plymouth being labelled as 'unknown', Guardiola said: \"It is not unknown if you are able to beat the best team in the country this season Liverpool. They went unbeaten also at Brentford then it is not unknown.\"\nOn new signing Vitor Reis, who is in contention to play on Saturday, the head coach added: \"He is young and he came from Brazil. He has incredible focus. Defenders there [Brazil] have great physicality and conditioning, but are also so clever and intelligent, and this is one of the ones. We are really pleased with the way he is training, behaving and the potential he has.\"\nSpeaking about the future of the older squad members: \"There are players here that their age is over 30 but they are part of the future of this club. Except Kevin [de Bruyne] - and Kevin and the club will decide on his future - everyone who has a contract for next season I expect him to be here. They are going to help us. Next season will be a lot of games. We cannot do it just with our new ones. They will be able to help and be part of our season.\"\nGuardiola would not answer any questions on La Liga president Javier Tebas reporting the club to the European Commission, but did reply when asked why City seem to be a target for other people: \"I don't know. It happened in the past with Uefa and in a few weeks it'll happen in the Premier League, the sentence [to the 115 charges], right? We wait, and after we talk.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cjd3373znxmo"}