{"authors": ["Kate Blakemore", "www.facebook.com"], "date_download": "2025-04-26 08:09:22", "date_modify": "2025-04-26 08:09:22", "date_publish": "2025-02-26 13:19:46", "description": "Leicester news: Has Ruud van Nistelrooy 'given up'?", "filename": "sport_football_articles_cly6jg9l6e8o_1745654962.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4487/live/4f936c40-b629-11ee-bc2f-cb5579b90709.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly6jg9l6e8o_1745654962.html", "title": "Leicester news: Has Ruud van Nistelrooy 'given up'?", "title_page": "Leicester news: Has Ruud van Nistelrooy 'given up'? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Where do I even begin with what we witnessed against Brentford?\nI felt a sense of optimism pre-match that we could get a result against an inconsistent bottom-half team at home. After a bright start, it was not long before Brentford attacked, we recoiled and old habits returned; silly errors, poor possession, robotically playing out from the back like some broken record and the lack of goal threat.\nRepeatedly resorting to the same failed methods is just going to end in the same results.\nThe biggest concern about the performance was it potentially being a cultural issue. It is no secret that standards create behaviour, which in turn creates a culture, and I fear that Leicester's standards have fallen so far in recent years that a new culture has emerged that is not good.\n'Standards' doesn't mean where one finishes in the table, it is more about creating a culture where individuals consistently behave in a way that aligns with the set standards, which then promotes positive outcomes.\nThere is no doubting that this team is tight-knit, but are they holding each other to account to create the standards?\nRuud van Nistelrooy's post-match interview inferred he had given up: \"We are doing everything we can but the level of opposition that we face is too big for us. It's difficult to compete.\"\nWe were in an identical position during the Great Escape season, yet Nigel Pearson would never have spoken in such a manner.\nThe elusive 'standard' seems to be the Rolls-Royce, gold-plated Seagrave training ground - a £100m complex epitomising the elite level of modern football.\nBut many argue that its opening has been the catalyst for our downturn. Players are attracted to it, which is great, but do they feel the hard work is done and the rest will take care of itself upon arrival? A white elephant, perhaps?\nWhatever the reason, we are now staring down the barrel of relegation and, without some major changes in application, this will be confirmed before the end of the season.", "url": "https://www.bbc.co.uk/sport/football/articles/cly6jg9l6e8o"}