{"authors": ["Neil Johnston", "www.facebook.com"], "date_download": "2025-05-20 12:48:28", "date_modify": "2025-05-20 12:48:28", "date_publish": "2023-08-03 05:38:09", "description": "Criticism of defending champions USA's displays at the Women's World Cup is \"noise\", says captain Lindsey Horan.", "filename": "sport_football_66391098_1747745308.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B42A/production/_130622164_horanjoy.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66391098_1747745308.html", "title": "Women's World Cup 2023: USA captain Lindsey Horan says critics have 'no idea'", "title_page": "Women's World Cup 2023: USA captain Lindsey Horan says critics have 'no idea' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "USA captain Lindsey Horan has told critics \"you have no idea\" after the defending champions came under fire at the Women's World Cup.\nThe top-ranked nation in the world have had an underwhelming tournament and only scraped through to the last 16 with a draw against debutants Portugal.\nThat prompted criticism from fans and former players, including two-time USA World Cup winner Carli Lloyd, who said the tactics were \"too predictable\".\n\"It is noise,\" Horan said on Friday.\nLloyd, also a two-time Olympic champion, accused Vlatko Andonovski's team of \"playing as individuals\" after the four-time world champions narrowly avoided being knocked out by a Portugal side who hit the woodwork in stoppage time.\nShe said the player of the match was \"that post\" before telling Fox Sports:, external \"They're lucky not to be going home.\"\nLloyd has since justified her comments and said: \"It is no longer we want to win because we want to win. No, we want everything that comes with winning, and we think we can just roll out and win games.\n\"And that's not the case, and teams see that. They see the arrogance in the US and see that they're not this unstoppable team. They see that they're able to be broken down and beaten.\n\"There's too many distractions. There's too much emphasis on how many followers do I have or doing photoshoots and doing this and doing that.\n\"I'm not to say you can't have all that comes with that, but you have to stay humble throughout the process, because they nearly just crashed out of the World Cup.\"\nHoran said it was \"kind of frustrating to hear\" Lloyd's comments. She was speaking in Auckland, New Zealand, on Thursday before the USA fly to Melbourne, Australia, to prepare for Sunday's game with Sweden at 10:00 BST.\n\"We're going to try and keep the noise out as much as possible - but use it to our advantage too because we are going to go out and fight and do everything that we have done in past World Cups to win this game,\" added the midfielder.\n\"I always want to defend my team and say you have no idea what is going on behind the scenes. You have no idea every single training what we are doing individually, collectively etc, so for anyone to question our mentality hurts a little bit.\n\"But at the end of the day it doesn't really matter. I don't really care. It's about what is going on inside the team and getting ready for the next game.\n\"It's a new tournament starting now.\"", "url": "https://www.bbc.com/sport/football/66391098"}