{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 15:27:29", "date_modify": "2025-05-19 15:27:29", "date_publish": "2017-07-07 10:47:03", "description": "Widnes sign Castleford loanee Rangi Chase on a permanent deal, while hooker Danny Walker agrees a four-year contract.", "filename": "sport_rugby-league_40532318_1747668449.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2C46/production/_96843311_jc_magic_03.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_rugby-league_40532318_1747668449.html", "title": "Rangi Chase signs permanent Widnes deal and Danny Walker agrees new contract", "title_page": "Rangi Chase signs permanent Widnes deal and Danny Walker agrees new contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Widnes have signed half-back Rangi Chase from Castleford on a permanent deal after a successful loan spell.\nChase, 31, has made five appearances for the Vikings since the initial temporary move, having been told he was not part of Castleford's 2018 plans.\nIn addition, Widnes have signed hooker Danny Walker to a new four-year contract after his first-grade breakthrough this season.\nHead coach Denis Betts said: \"The deals represent a real statement of intent.\"\nNew Zealand-born Chase was the 2011 Man of Steel, has played for the Tigers, Salford, Leigh and now Widnes, as well as representing England at senior level.\nIn contrast, Walker, 18, is at the opposite end of his career, with just six professional appearances to his name.\n\"Rangi has made a big impact since his arrival, contributing well both on and off the field,\" Betts added.\n\"He has exceptional abilities and, as an international standard half-back, adds real quality to the team.\n\"Danny is one of the most promising young players in the Super League. His commitment to a four-year contract shows his belief in what we are building at the Vikings.\"", "url": "https://www.bbc.com/sport/rugby-league/40532318"}