{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 06:02:50", "date_modify": "2025-05-21 06:02:50", "date_publish": "2025-04-01 16:18:11", "description": "Man Utd news: Club accounts reveal savings from first round of redundancies", "filename": "sport_football_articles_cy0xg5we0nlo_1747807370.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/af0b/live/62c75430-0ee7-11f0-b234-07dc7691c360.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cy0xg5we0nlo_1747807370.html", "title": "Man Utd news: Club accounts reveal savings from first round of redundancies", "title_page": "Man Utd news: Club accounts reveal savings from first round of redundancies - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have confirmed the club saved between £8m and £10m on the first round of redundancies last year that cut 250 staff jobs.\nUnited have subsequently embarked on a second redundancy round which could see another 200 jobs going.\nIn figures published on Companies House as part of the Manchester United football club accounts - a subsidiary of the club's parent company - that announced a £113.2m loss to 30 June 2024 in September last year, United said they had an average of 937 employees, 659 of whom were involved in administration and other areas.\nMinority owner Sir Jim Ratcliffe has said he is determined to drive down costs and slash losses after claiming the club could go bust by the end of the year unless action was taken.\nAs is normal in accounts of this nature, it is stated the club has \"adequate resources to continue in operational existence for 12 months from the approval of these financial statements\", which were signed off by co-chair Joel Glazer on 31 October.\nUnited confirm the initial staffing reduction was \"substantially completed\" in September 2024 and \"associated costs of between £8m and £10m will be recognised in the first half of fiscal year 2025\".\nIn addition, the accounts confirmed \"net finance costs\" of £42.88m. The club spent £35.3m on interest servicing a secured loan and other credit facilities.", "url": "https://www.bbc.com/sport/football/articles/cy0xg5we0nlo"}