{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:46", "date_modify": "2025-05-21 07:42:46", "date_publish": "2025-05-20 13:28:22", "description": "Multiple-weight boxing world champion Claressa Shields says she is \"done\" with MMA.", "filename": "sport_articles_cy5eenr7d0lo_1747813366.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/581e/live/50c056b0-357a-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cy5eenr7d0lo_1747813366.html", "title": "Boxing: Claressa Shields closes door on MMA career after three fights", "title_page": "Boxing: Claressa Shields closes door on MMA career after three fights - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Boxing world champion Claressa Shields says she is \"done\" with mixed martial arts after competing in three fights with the PFL.\nShields, 30, is unbeaten in boxing and a multiple-weight undisputed champion, but has fought sporadically in MMA since 2021, achieving a 2-1 record.\nHer last MMA bout was a points win over Kelsey de Santis and the American says she will now be focusing on boxing.\n\"It was fun, but I don't have enough time to train for it. It takes six to eight months just to get ready to defend takedowns. Even though I got a lot better and put in the time, I broke my arm twice. It was fun, and I enjoyed every fight I did,\" Shields told Ariel Helwani, external.\n\"I'm already great in boxing, and to be great like that in MMA, I would have to train consistently for at least three to four years.\n\"I did really well in MMA. It was fun, but it was too hard.\"\nShields took a two-and-a-half-year break between her second and third MMA fights.\nThe Michigan native recently added the undisputed heavyweight title to her world title collection.\nShields has become world champion in five different weight classes and is undefeated in 16 fights.\nThe Olympic gold medalist said she did have ambitions of becoming an MMA world champion, but admitted her family were keen for her to focus on boxing.\n\"My family never wanted me to do it,\" she added.\n\"I did it because I wanted to prove a point, and I proved that point to myself three times, though you could say twice because I won twice.\"", "url": "https://www.bbc.com/sport/articles/cy5eenr7d0lo"}