{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:17", "date_modify": "2025-05-21 07:31:17", "date_publish": "2025-03-29 00:00:00", "description": "Follow live BBC Sport coverage, radio commentary and text updates as France take on Scotland in the Women's Six Nations.", "filename": "sport_rugby-union_live_cp8373rqm8mt_1747812677.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4632/live/b44623e0-0ca8-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_rugby-union_live_cp8373rqm8mt_1747812677.html", "title": "Women's Six Nations LIVE: France v Scotland", "title_page": "Women's Six Nations LIVE: France v Scotland - score, updates, live stream & commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye\nFT: France 38-15 Scotland\nThat's where we'll leave things for today as France go top of the Women's Six Nations table with a bonus-point win over Scotland.\nScotland are third after one win and one loss.\nEngland can return to the summit later today when they play Wales in Cardiff.\nYou can follow all the action from that match live on the BBC Sport website.\nThanks for your company this afternoon - bye for now.\n'Super proud of the effort' - Malcolm\nFT: France 38-15 Scotland\nScotland captain Rachel Malcolm tells BBC Sport: \"It was really tough.\n\"At half-time we had a real energy about us, but that 15-20 minutes after half-time they really turned it up a notch. We didn't really react.\n\"We showed we can compete against the best, but if we don't concentrate and keep our intesnity for the full 80 minutes then teams will punish us and that's what they did.\n\"I'm super proud of the effort - to score a try at the death is what this team is all about.\"\n'Crowd were like 16th player' - Feleu\nFT: France 38-15 Scotland\nPlayer of the match Manae Feleu tells BBC Sport: \"I don't have words for the atmosphere we had today, it felt like a 16th player - it was incredible.\n\"We knew we had to build on the first-half performance. That's what we did.\n\"We're expecting a really tough game against Wales and we're excited to play at home again.\"", "url": "https://www.bbc.com/sport/rugby-union/live/cp8373rqm8mt"}