{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:16:54", "date_modify": "2025-05-20 12:16:54", "date_publish": "2023-08-04 14:25:30", "description": "Gareth Delany and Fionn Hand are back in the Ireland squad to face world number one T20 side India in a three-game series at Malahide.", "filename": "sport_cricket_66409310_1747743414.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/167BD/production/_128939029_fionn.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66409310_1747743414.html", "title": "Ireland v India: Delany and Hand return for T20 series at Malahide", "title_page": "Ireland v India: Delany and Hand return for T20 series at Malahide - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Gareth Delany and Fionn Hand are back in the Ireland squad to face world number one T20 side India in a three-game series at Malahide this month.\nDelany returns after breaking his wrist in June and fellow all-rounder Hand is also recalled to the 15-player panel.\nIreland are returning to action after qualifying for next year's T20 World Cup in West Indies and USA.\n\"The Indian side arriving in Ireland is an exciting one for the supporters,\" said Ireland selector Andrew White.\nIndia are returning to Malahide after securing a 2-0 win in a thrilling T20 series last summer.\nWhite added: \"We currently have around 15 T20 Internationals scheduled between now and the World Cup, so it is important that we use each of these to continue to build on areas that the coaching team have identified.\n\"We only have a limited time between now and the end of the 2023 domestic season, so it's also crucial that we use what opportunities we have to provide exposure and experience to a pool of players who we believe are in contention for making that World Cup squad.\n\"Giving opportunities to players also filters down the series themselves, so I would expect that all of the 15 players named in the India series squad will feature at some point.\n\"We showed last year we have the talent and confidence to match India on the field of play and we have high hopes for another fiercely contested series.\"\nThe games will be played at the Co Dublin venue on 18, 20 and 23 August.", "url": "https://www.bbc.com/sport/cricket/66409310"}