{"authors": ["Frank Keogh", "www.facebook.com"], "date_download": "2025-05-21 04:13:48", "date_modify": "2025-05-21 04:13:48", "date_publish": "2025-04-06 08:43:17", "description": "Broadway Boy is to return home after suffering a heavy fall in the Grand National.", "filename": "sport_horse-racing_articles_cwyqj1yx2pzo_1747800828.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95a6/live/b91cf970-12c0-11f0-af7d-630082e03613.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_horse-racing_articles_cwyqj1yx2pzo_1747800828.html", "title": "Grand National: Broadway Boy to return home after fall while leading race", "title_page": "Grand National: Broadway Boy to return home after fall while leading race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Broadway Boy is to return home after suffering a heavy fall in the Grand National.\nThe horse, trained in Gloucestershire by Nigel Twiston-Davies, was leading the Aintree showpiece when he came down heavily at Valentine's Brook on the second circuit.\n\"It sounds a lot more positive and he's coming home. There's going to be a couple of weeks of uncertainty for future racing,\" said Nigel's son and assistant trainer Willy Twiston-Davies.\n\"But it looks a lot more positive than it did yesterday [Saturday] and the most important thing is our horse is coming home and should be OK.\n\"His welfare for the next few weeks is the most important thing and the vets at Aintree did a tremendous job.\n\"Laura Scrivener, who looked after him all night, was fantastic with him and our boy's coming home.\"\nWilly's jockey brother Sam said the horse was \"stiff and sore\".\nFollowing the race, Broadway Boy and Celebre D'Allen - who was pulled up - were walked on to horse ambulances after being assessed on course by vets and taken to the racecourse stables for further assessment.\nBroadway Boy's jockey Tom Bellamy suffered a broken wrist.", "url": "https://www.bbc.com/sport/horse-racing/articles/cwyqj1yx2pzo"}