{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:51:57", "date_modify": "2025-05-21 05:51:57", "date_publish": "2025-04-02 09:24:10", "description": "Wrexham 'not doing too badly' despite Cambridge United draw", "filename": "sport_football_articles_cz95xwvkjp8o_1747806717.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79e0/live/e7ca2d70-0f81-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cz95xwvkjp8o_1747806717.html", "title": "Wrexham 'not doing too badly' despite Cambridge United draw", "title_page": "Wrexham 'not doing too badly' despite Cambridge United draw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Phil Parkinson says Wrexham remain well placed to challenge for a third successive promotion despite a minor setback at Cambridge United on Tuesday night.\nThe Red Dragons could only manage a 2-2 draw against the side that sit second from bottom in League One.\nBut after Wycombe Wanderers were held to a goalless draw by bottom side Shrewsbury Town on the same night, Wrexham stay second in the table - three points ahead of the Chairboys who have a game in hand.\nAnd despite his frustration towards referee Thomas Parsons for his decision to award Cambridge a penalty early in the second half, Parkinson took comfort from Wrexham's league position.\n\"We're 40 games in and we're in second place so we're not doing too badly, are we?\" he said.\n\"Performance level, the process for each game, like we speak about with the lads, keep concentrating on that and we won't be far away.\"\nMidfielder George Dobson fired the visitors in front after just four minutes at the Abbey Stadium.\nLiam Bennett equalised just before half time, with Josh Stokes' penalty shortly after the restart putting Neil Harris' side ahead.\nBut striker Sam Smith's header on 57 minutes ensured the points were shared.\nOn Dobson's strike, Parkinson said: \"Brilliant finish, absolutely fantastic strike. A midfielder's finish, low and hard from the edge of the box.\"", "url": "https://www.bbc.com/sport/football/articles/cz95xwvkjp8o"}