{"authors": ["Nick Mashiter", "www.facebook.com"], "date_download": "2025-05-21 07:37:47", "date_modify": "2025-05-21 07:37:47", "date_publish": "2025-01-13 16:45:31", "description": "Nottingham Forest news: Morato on the title race", "filename": "sport_football_articles_cdxnvnv7w8wo_1747813067.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65cc/live/848432f0-d1ca-11ef-a00c-b776b3393886.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cdxnvnv7w8wo_1747813067.html", "title": "Nottingham Forest news: Morato on the title race", "title_page": "Nottingham Forest news: Morato on the title race - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest are in this season's title race, according to defender Morato.\nThey host Premier League leaders Liverpool on Tuesday knowing victory would move them second and three points behind the Reds.\nNuno Espirito Santo has constantly played down any title talk in recent weeks but centre-back Morato, who joined from Benfica in the summer, believes they should be in the discussion.\n\"We are in this fight for the title because we deserve to be,\" said Morato.\n\"What we have done already has been incredible - the hard work we've put in. Of course, we can surprise people.\"\nForest could match Leicester's extraordinary title win in 2015-16 when the Foxes beat Arsenal to the league by 10 points.\nAfter all, they have 40 points from 20 games - the same amount Leicester were on after the same number of games.\n\"What Leicester did was absolutely incredible and for us to do the same would be incredible too,\" Morato said. \"We are on the right track - it's halfway through the season and there are many matches and five or six months to go.\n\"We are on the right track right now, better than we expected and we will certainly be there up until the last day.\n\"I don't agree [with the doubters]. Each team is different - sometimes experts are talking from having played in different eras.\"", "url": "https://www.bbc.com/sport/football/articles/cdxnvnv7w8wo"}