{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:04:09", "date_modify": "2025-05-21 06:04:09", "date_publish": "2025-01-26 00:00:00", "description": "Follow live text updates as Manchester United host Brighton in the Women's Super League.", "filename": "sport_football_live_c07k1nj92eyt_1747807449.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c07k1nj92eyt_1747807449.html", "title": "Man Utd vs Brighton LIVE: WSL score, commentary, line-ups & latest updates", "title_page": "Man Utd vs Brighton LIVE: WSL score, commentary, line-ups & latest updates - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ella Toone's thigh injury was like \"divine intervention\" as it gave her a much-needed break and chance to return to action refreshed, says Manchester United manager Marc Skinner.\nToone has scored five goals in three games since returning from injury at the start of this year, including the opener as United beat Brighton at Leigh Sports Village to move second in the Women's Super League.\nShe had been ruled out with a thigh problem in November, that kept her out for the end of 2024.\nIt followed a difficult few months for Toone, whose father passed away in September.\n\"There was a point we knew she needed a break, especially given the immense impact from her personal life,\" Skinner said when asked by BBC Sport about Toone's form.\n\"She says it herself, injury was like divine intervention. It is important for Ella that she enjoys herself, if we keep that we will see the best of her.\"\nUnited scored twice in the opening 11 minutes against Brighton through Toone and Hinata Miyazawa, before Celin Bizet added a third with a long-range drive.\nIt continues United's good recent form, putting them seven points behind WSL leaders Chelsea, and maintains momentum from their derby win at Manchester City last weekend.\nBrighton meanwhile stay fifth, eight points off the Champions League places.\nIt might seem contrary to describe a calf injury as a blessing, but that seems to be the case for Toone.\nBefore suffering the injury in training, she had failed to score in six WSL appearances and her place in the England team - and potentially at Euro 2025 - was in danger.\nSince returning Toone has been a player reborn, with performances that will surely have caught Sarina Wiegman's eye.\nToone was instrumental in the 4-2 victory at Etihad Stadium last weekend with her hat-trick and was at the centre of events again as she orchestrated play, with 39 touches in the first half alone. It vindicated Skinner's decision to pick her ahead of England team-mate Grace Clinton in the starting XI.\n\"Ella was fantastic in the derby, we wanted to start with that style,\" he said. \"We felt the team that started the league game against City could really hurt Brighton. For me it's about the right selection to start the game with energy.\"\nHer goal inside two minutes was taken with utmost confidence. When former Brighton striker Elisabeth Terland - making her 50th WSL appearance - slid the ball into the box to Toone, she finished calmly past ex-United keeper Sophie Baggaley.\nAnd it was two shortly after as Miyazawa, top scorer at the last World Cup, showed her finishing touch with a powerful strike into the bottom corner after her first effort was blocked.\nThe points were wrapped up in the 69th minute when Bizet slammed home from 25 yards, over the grounded Baggaley.\nIt was a dominant performance from United, who have now won their past four league games - their best run of form in the WSL since October 2023.\nLeigh has never been a happy hunting ground for Brighton, who have now won just one of their past 12 meetings with United.\nThey never looked truly likely to get a result here after falling behind so early and were indebted to Baggaley who, while caught out for the third goal, had kept Brighton in the match to that point.\nShe made a superb full-length save from Terland in the first half, followed by a terrific double stop when the ball was given away inside her own area.\nBrighton improved after half-time and came close when Nikita Parris fired over from close range, but they have failed to win in their past four league matches as Dario Vidosic's side fall back into mid-table following a promising start.\n\"It seems like we have cloudy minds,\" Vidosic said. \"When we played with clear minds, the spaces are there. Technical errors is the one which is hurting us at the minute.\"\nVidosic made a triple change at half-time to try to inspire his team, but they have now lost four consecutive away league games for the first time since October 2022.\nIt will be interesting to see whether the arrival of the manager's father, Rado Vidosic, as head of women's coaching at Brighton will bring about an improvement in form and fortune.", "url": "https://www.bbc.com/sport/football/live/c07k1nj92eyt"}