{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 12:09:04", "date_modify": "2025-05-20 12:09:04", "date_publish": "2023-08-05 10:44:34", "description": "England will face Australia in their first Netball World Cup final after their historic victory over defending champions New Zealand.", "filename": "sport_netball_66415133_1747742944.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D83C/production/_130665355_netball_gettytwo.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66415133_1747742944.html", "title": "Netball World Cup 2023: England beat New Zealand and will face Australia in final", "title_page": "Netball World Cup 2023: England beat New Zealand and will face Australia in final - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "England will face Australia in their first Netball World Cup final after their historic victory over defending champions New Zealand.\nThe match was level after every quarter but England pulled away in dramatic fashion in the last to win 46-40.\nThere were jubilant scenes on the court as England wound down the clock to edge out the Silver Ferns and reach Sunday's showpiece in Cape Town.\nAustralia, who lost to England in the group stage, beat Jamaica 57-54.\nThe final takes place at 17:00 BST and will be live on BBC Two, BBC iPlayer and the BBC Sport website and app.\nThere has never been a World Cup final without 11-time world champions Australia, who also won Commonwealth gold in Birmingham last year.\nHowever, they will face a stern test in England, who overcame some shaky shooting with solid defence against New Zealand.\nThey will now compete for their biggest title since the 2018 Commonwealth Games, when they beat Australia to win gold.\nAn emotional Layla Guscoth, Roses defender and co-captain, told BBC Sport: \"I can't believe it.\n\"We've had so much criticism over the last year [after no medal at the 2022 Commonwealth Games].\n\"We are so grateful to get the chance to play in a World Cup final. We celebrate, we rest and we come back tomorrow.\"\nEngland have faced a year of criticism after they failed to follow up on gold in 2018 and did not win a medal at the Games in Birmingham last year.\nWhen Jess Thirlby took the reins from former coach Tracey Neville after England had won World Cup bronze in 2019, having been beaten in the semi-final by New Zealand, she said some things would need to change.\nFocus went on developing a full squad of 12 dependable players and at this tournament England are getting their just reward.\n\"I know it is predictable but I just feel just pride,\" Thirlby said after the win.\n\"Sometimes you just have to sit tight through the ups and downs, the wins and the losses, and we have done that.\n\"I think the mental side of our game has massively shifted. Sometimes it takes 58 minutes before you get the reward but they kept at it and got it in the end.\"\nCo-captain Natalie Metcalf agreed, saying it had been a \"tough year\" but they had \"left no stone unturned\" in pursuit of World Cup glory.\n\"It is just pure pride to wear the red dress and line up alongside the girls every day,\" she said.\n\"We've got to celebrate and enjoy the moment, what a moment it is for England netball. But we need to make sure we stick to the processes and remain consistent as we have done the entire tournament.\"\nUntil their final group match against Australia, England had gone under the radar - securing wins but with plenty still to work on.\nHowever, they have now beaten the top two sides at the tournament, having defeated world number one-ranked Australia on Thursday and the Silver Ferns in the last four.\nAn evenly contested and low-scoring match saw momentum shifts in both directions as two impenetrable defences faced off.\nRoses' stalwarts Geva Mentor and Guscoth worked tirelessly in defence to win the ball as England's attackers were made to look hesitant and static against an equally impressive Kelly Jury and Phoenix Karaka in the other circle.\nEngland's shooters also struggled at times, with Helen Housby and Eleanor Cardwell uncharacteristically missing eight of their 54 shots.\nPatience was key as neither side could break the deadlock and, with the score poised at 32-32 going into the final quarter, it was clear a moment of brilliance would be required to prevent extra time.\nThat came when Fran Williams, who also produced the game-changing moment against Australia, leapt from nowhere to snatch the ball away from Gina Crampton, setting up Housby to score and give England a slender lead.\nEngland's bench were on their feet with a minute remaining after Imogen Allison produced another superb intercept and the wheels came off for New Zealand.\nFans in the crowd sensed a place in the final was England's and as the buzzer sounded the players flooded the court, with many in tears as they processed their historic achievement.\nLater on Saturday, Australia overcame Jamaica to give themselves a chance of winning a record-extending 12th world title on Sunday.\nA tense first half ended in stalemate before Australia garnered a slim lead in the third, pulling away by just two goals.\nJamaica clawed back an advantage in the final quarter but a crucial tip from defender Courtney Bruce provided the Diamonds with enough momentum to go on and take victory, setting up a mouth-watering final against England.", "url": "https://www.bbc.com/sport/netball/66415133"}