{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:49:32", "date_modify": "2025-05-20 11:49:32", "date_publish": "2023-08-07 09:22:36", "description": "Former Scotland midfielder James McArthur, who left Crystal Palace at the end of last season, retires at the age of 35.", "filename": "sport_football_66426427_1747741772.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4A7B/production/_130676091_gettyimages-538099256.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66426427_1747741772.html", "title": "James McArthur retires: Ex-Scotland, Crystal Palace & Wigan midfielder ends career", "title_page": "James McArthur retires: Ex-Scotland, Crystal Palace & Wigan midfielder ends career - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Scotland midfielder James McArthur has retired at the age of 35.\nMcArthur, who scored four times in 32 Scotland caps, left Crystal Palace at the end of last season after 253 games in nine years for the Eagles.\nMcArthur made his debut for Hamilton Academical in 2005 and joined Wigan Athletic five years later, winning the FA Cup with Latics in 2013.\n\"After 18 years of playing professional football, the game I love, today I am announcing my retirement,\" he said.\n\"After playing for three amazing clubs in Hamilton, Wigan and Crystal Palace, and representing my country, I can only look back on the past 18 years with immense pride,\" he wrote on social media.\n\"I cannot thank the players, managers, coaches, owners, staff members and fans enough for always supporting me and being a huge part of my journey.\n\"A day that I never wanted to happen, but it's a decision that I know is right for me and my family. I'm not entirely sure what the future holds but I am looking forward to the next chapter in my career.\"\nCopyright © 2025 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.", "url": "https://www.bbc.com/sport/football/66426427"}