{"authors": ["Jared Evitts", "www.facebook.com"], "date_download": "2025-05-20 13:29:50", "date_modify": "2025-05-20 13:29:50", "date_publish": "2023-08-02 05:30:00", "description": "After repeated stress fractures in his back, George Scrimshaw was told his cricket career may be over.", "filename": "sport_cricket_66363865_1747747790.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/60FE/production/_130603842_gettyimages-1419122217.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66363865_1747747790.html", "title": "The Hundred: 'I was told I might never play cricket again' - Scrimshaw", "title_page": "The Hundred: 'I was told I might never play cricket again' - Scrimshaw - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "George Scrimshaw is preparing to lead the Welsh Fire attack just four years after doctors said he might never play cricket again.\nAfter persistent stress fractures in his back, he underwent major surgery in an attempt to save his career in 2019.\nThe year after, he was released by his boyhood county and faced the lonely prospect of rehabilitation in lockdown.\n\"It would have been easier to hand in the towel and stop playing cricket, but I had to keep going,\" he said.\nHaving signed for Worcestershire at 18, Scrimshaw said in the first three years of his career, he only played \"five or six whole games\" due to persistent stress fractures in his back.\n\"It was a really hard time; I couldn't seem to stay on the pitch for longer than a few games,\" the 6ft 7ins right-armer said.\n\"To come back from that was really tough and I had to stay resilient.\n\"I saw a few specialists in 2019 for the back injuries. One said I might never play again, and the other said there is something he could do, but I might not come back as I was.\"\nScrimshaw said he accessed counselling through charity Sporting Chance, external during 2019 and 2020 to help cope with his injuries.\n\"I got asked if it would be worth talking to someone outside of cricket so I could get my feelings out that I might not be able to tell other people,\" he said.\n\"At that point it was important to talk to someone, get things out in the open, and learn how to manage how I was feeling at that time.\n\"It was just about being resilient and having the self-belief to know that I was good enough, because sometimes I did doubt it.\"\nWith so many injuries in such a short space of time, Worcestershire released Scrimshaw at the end of his contract in 2020, meaning despite being injury free, he was no longer a professional cricketer.\n\"After being released, I tried to get in touch with as many people as I could,\" he said.\n\"Thankfully the bowling coach at Derbyshire invited me down. I netted with them for two months and just before the 2021 season they signed me.\"\nHis direction at Derbyshire from then-coach Dominic Cork was simple. Run up, bowl as fast as he could and hit the middle of the pitch.\n\"Some might get you, but a lot of batsmen will struggle,\" Scrimshaw recalled Cork saying to him.\nNow in his third season at the club, he has become one of their key short-format bowlers.\nAfter being one of the leading wicket-takers in the T20 Blast last year, Scrimshaw said he knew he might be in contention for a wild card pick in The Hundred.\n\"I was absolutely buzzing (to be picked), it was all exciting: big crowds and all the games were televised, so it's good exposure,\" he said.\n\"It was brilliant, I embraced playing in front of bigger crowds and knowing people are going to recognise you playing on TV.\"\nAfter impressing in a disappointing campaign for Welsh Fire in 2022, Scrimshaw has been retained by them for the 2023 season.\n\"The Hundred is exciting, and I think it is a good thing for cricket. Not just for the players and the reward, but practising your game against highly skilled opposition,\" he said.\n\"I knew if I didn't give rehabilitation my full chance, I would never see where I'd have got to. With the right people around, and that self-belief, I managed to come out of the other side.\"", "url": "https://www.bbc.com/sport/cricket/66363865"}