{"authors": ["Scott McCarthy", "www.facebook.com"], "date_download": "2025-04-26 04:12:01", "date_modify": "2025-04-26 04:12:01", "date_publish": "2025-03-04 12:38:13", "description": "Brighton news: Opinion - Fan writer on the performances of Adam Webster", "filename": "sport_football_articles_cly8v91x000o_1745640721.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8a79/live/45186dc0-b628-11ee-8f07-bbfdfa890097.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cly8v91x000o_1745640721.html", "title": "Opinion - Fan writer on the performances of Adam Webster - BBC Sport", "title_page": "Brighton news: Opinion - Fan writer on the performances of Adam Webster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "When Lewis Dunk was forced off at half-time of Brighton's 2-1 FA Cup win over Chelsea, Brighton looked in a spot of defensive bother with the only centre-back on the bench being Adam Webster.\nThere were a couple of reasons to potentially panic over Webster coming on. The first was he had played only 159 minutes of competitive football in four months since getting injured in October.\nHardly great preparation for any player facing being thrown in at the deep end against Cole Palmer and co, let alone one such as Webster who, throughout his six seasons at Amex Stadium has always needed four or five matches to shake off the rust after a lay-off.\nThe second reason to panic was what happened the previous time he faced Chelsea. Webster was all over the shop as Palmer plundered four goals in 45 minutes at Stamford Bridge back in September.\nIt looked like Father Time was catching up with him. The Premier League was at too high a quality. Obituaries were written.\nAll of these now need to be cancelled.\nSince Webster took over from Dunk, Brighton have won five games out of five, conceding only twice. One was an absolute rocket from Justin Kluivert against Bournemouth. The other was a penalty in the FA Cup at Newcastle on Sunday.\nWebster has seamlessly replaced Dunk as both centre-back and captain. Albion look more solid than at any point under Fabian Hurzeler with Webster in the team.\nDunk has been injured twice already this season and was almost instantly restored to the starting XI upon his return. That surely cannot happen this time.\nWebster is in arguably the best form of his Brighton career. He is clearly enjoying every moment with that enthusiasm rubbing off on those around him.\nAnd it is absolutely magnificent to watch.", "url": "https://www.bbc.co.uk/sport/football/articles/cly8v91x000o"}