{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:09:48", "date_modify": "2025-05-21 04:09:48", "date_publish": "2024-12-29 00:00:00", "description": "Eberechi Eze scores the winner as Palace come from behind to beat Southampton and move six points clear of the relegation zone.", "filename": "sport_football_live_ce8xrpjyje1t_1747800588.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_ce8xrpjyje1t_1747800588.html", "title": "Crystal Palace 2-1 Southampton: Eberechi Eze scores winner as Palace beat Southampton", "title_page": "Crystal Palace 2-1 Southampton: Eberechi Eze scores winner as Palace beat Southampton - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Eberechi Eze scored the winner as Crystal Palace came from behind to beat Southampton and move six points clear of the relegation zone.\nSouthampton took the lead in the 14th minute when Kyle Walker-Peters beat Daniel Munoz to the ball and his cross was helped on by Adam Armstrong for Tyler Dibling to tap in from close range.\nBut Palace responded 16 minutes later when Trevoh Chalobah headed in a Will Hughes corner.\nThere were appeals from the Southampton players who thought Jean-Philippe Mateta had fouled goalkeeper Aaron Ramsdale as the corner came in, but the goal was cleared by the video assistant referee (VAR).\nEze then scored an excellent goal early into the second half to secure all three points for the Eagles.\nMunoz should have scored when, as the sides were level in the first half, he ran on to Tyrick Mitchell's cross, but his effort from inside the six-yard box hit the back of Walker-Peters with the goal gaping.\nIsmaila Sarr also had a good opportunity in the first period when he raced on to Mateta's flick-on, but Ramsdale saved well before Jefferson Lerma had an acrobatic volley saved from the resulting corner.\nThe Eagles were the better team after drawing level and it did not take long for that dominance to pay off after the break, when Munoz's looping cross was deflected into Eze's path and he drilled a shot into the bottom corner.\nThe result moves Palace up to 15th place - and six points clear of Leicester City in 18th - and means they have now lost only one of their past eight Premier League matches.\nCrystal Palace have been slowly finding their form as they look to climb the table after a tough start to the season.\nOliver Glasner has consistently listed the reasons why he thinks Palace have taken a while to get going, blaming late signings in the summer transfer window and a number of key players at international tournaments until late into pre-season.\nBut the Eagles boss has found a settled side and made key players match fit. Coming into this match the Eagles had lost just once in seven Premier League games (W2, D4).\nPalace have had to adjust without Michael Olise after his move to Bayern Munich and the pressure to fill the void left by him has fallen largely on Eze.\nThe England international, who was with the Three Lions as they reached the final of Euro 2024, has not been at his best in recent weeks, but Palace will hope his goal against Southampton will be the start of a run of form.\nEze's winner was his first goal in the league since 1 September when he scored in a draw against Chelsea away from home.\nPalace take on Chelsea next and will hope to continue their current run of form for a top-half finish to the campaign.\nSouthampton narrowly lost to West Ham last week and will be disappointed to not have taken at least a point against Palace after taking the lead in the game.\nIvan Juric has made clear how he wants his side to play and says he wants his team to \"work hard, press hard, play good, be intense\".\nSouthampton were well organised in their 3-4-2-1 formation and have a clear game plan.\nFor the second match in a row Juric has named 6ft 7in striker Paul Onuachu and the Southampton players looked to find him at every opportunity.\nIt was a cross into the box that led to the Saints opener, but with just one win so far this season they need to start picking up points and quickly if they are to have any hope of getting out of the relegation zone.", "url": "https://www.bbc.com/sport/football/live/ce8xrpjyje1t"}