{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:14:44", "date_modify": "2025-05-21 05:14:44", "date_publish": "2025-04-05 00:00:00", "description": "Hugo Duro's stoppage-time winner for Valencia stuns Real Madrid as the hosts lose ground in the La Liga title race.", "filename": "sport_football_live_c9qwv0rdj4gt_1747804484.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aa0b/live/a3bd4a20-123a-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c9qwv0rdj4gt_1747804484.html", "title": "Real Madrid 1-2 Valencia: Hugo Duro scores stoppage-time winner in La Liga", "title_page": "Real Madrid 1-2 Valencia: Hugo Duro scores stoppage-time winner in La Liga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hugo Duro's stoppage-time winner for Valencia stunned Real Madrid as the hosts lost ground in the La Liga title race.\nWith the clock showing 95 minutes, Rafa Mir put in a sublime cross which Hugo Duro headed home from close range.\nMouctar Diakhaby had opened the scoring for Valencia when he rose highest to head home Andre Almeida's cross.\nIt was a blow for Madrid who had passed up a big chance minutes earlier when Vinicius Jr's penalty was easily saved by goalkeeper Giorgi Mamardashvili after Cesar Tarrega was judged to have fouled Kylian Mbappe in the box.\nShortly after the break, Vinicius atoned for his penalty miss, sending an effort high into the roof of the net to equalise.\nMbappe stabbed an effort just wide but was unable to find the target in a frustrating afternoon for the France striker and his side.\nLa Liga leaders Barcelona drew 1-1 against Real Betis later on Saturday, leaving Los Blancos four points behind them with eight games remaining.\nMadrid have missed five penalties this season in all competitions (11 scored from 16), their highest tally of failures in a single campaign since at least 2013-14.\nWith Thibaut Courtois out with a muscle injury and Andriy Lunin suffering discomfort in his leg during the win over Leganes, 19-year-old Fran Gonzalez became the youngest goalkeeper to make their Madrid debut in La Liga since Iker Casillas did so aged 18 years 115 days in September 1999.\nFor Valencia, it is a momentous win and the first time they have been victorious at the Bernabeu since 2008.\nCarlo Ancelotti's side travel to Emirates Stadium on Tuesday to face Arsenal in the first leg of their Champions League quarter-final.", "url": "https://www.bbc.com/sport/football/live/c9qwv0rdj4gt"}