{"authors": ["Ross Morren", "www.facebook.com"], "date_download": "2025-04-26 03:56:53", "date_modify": "2025-04-26 03:56:53", "date_publish": "2025-03-04 14:48:41", "description": "'Staggies setting sights on top six after brilliant bounce back'", "filename": "sport_articles_c0l14n45zzdo_1745639813.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/57f2/live/a08d5610-f903-11ef-9e61-71ee71f26eb1.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c0l14n45zzdo_1745639813.html", "title": "'Staggies setting sights on top six after brilliant bounce back'", "title_page": "'Staggies setting sights on top six after brilliant bounce back' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Previously, I've described Ross County's recent run of fixtures as season defining.\nThe Staggies looked like they were a side full of confidence following impressive victories against Motherwell and Dundee, where they scored three goals in successive Premiership matches for the first time since December 2015.\nThose two victories meant County fans were full of optimism at avoiding a battle at the bottom for the third straight season, and even dreaming of potentially sneaking into the top six.\nLast Wednesday, supporters were brought crashing back down to earth as the Staggies fell to a 1-0 defeat to St Johnstone in Perth.\nIt was an unrecognisable performance compared to recent matches as they lacked creativity and failed to take control of the match. To add salt to the wounds, the defeat meant County have only picked up a single point in three matches against the Perth side, which could be crucial as we approach the split.\nThat result and performance amplified the importance of County's next match ten-fold, as they faced Kilmarnock in Dingwall.\nIt wasn't a game that'll live long in the memory but Don Cowie's side bounced back from their midweek defeat to pick up a 1-0 victory thanks to Kieran Phillips' first-half goal.\nIn his four home Premiership matches so far, Phillips has scored two goals, assisted another and won two penalties, so he's made quite an impact in Dingwall.\nAt the other end, the defensive trio of Johnathan Tomkinson, Kacper Lopata and Eli Campbell were outstanding.\nThey threw their bodies on the line countless times against a Kilmarnock bombardment. On the rare occasion the trio were beaten, Jordan Amissah was imperious yet again in the County goal and made several key saves to hold on to the clean sheet.\nThe victory moved the Staggies up to eighth and within two points of the top six.\nCowie and his players deserve huge credit for their reaction against Killie to pick up what the manager described as the biggest three points of County's season so far.", "url": "https://www.bbc.co.uk/sport/articles/c0l14n45zzdo"}