{"authors": ["Mike Hughes", "www.facebook.com"], "date_download": "2025-05-21 07:45:25", "date_modify": "2025-05-21 07:45:25", "date_publish": "2025-05-20 12:11:37", "description": "Everton news: 1995 FA Cup anniversary - Royle the architect", "filename": "sport_football_articles_cwy67xy66wzo_1747813525.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b58/live/9796be80-6ea6-11ef-8c1a-df523ba43a9a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cwy67xy66wzo_1747813525.html", "title": "Everton news: 1995 FA Cup anniversary", "title_page": "Everton news: 1995 FA Cup anniversary - Royle the architect - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Under Joe Royle, Everton had slowly but surely got themselves out of trouble in the league with some high-octane victories against teams who were much higher in the table. He'd brought in a style of play that suited the players he had in his squad. Barry Horne, Joe Parkinson and John Ebrell were key figures in a midfield \"Dogs of War\". Everton had become very difficult to beat, but that incredible 4-1 victory against Tottenham in the semi-final was evidence that they were capable of so much more.\nFor the Wembley final Sir Alex Ferguson's team were the 4/7 favourites with the bookmakers and Royle's men were given little chance, seemingly by everyone except their own fans and players.\nThe key moment of the match came on the half-hour. Barry Horne intercepted a Paul Ince through ball on the edge of his own penalty area. Pacy winger Anders Limpar latched on to his clearance and raced forward at the speed of lightening with the ball at his feet, before slipping the ball into the path of advancing right-back Matt Jackson. He ran into the penalty area and checked back to leave Gary Pallister trailing in his wake before slipping the ball towards the onrushing Graham Stuart, who thumped a right-foot shot goalwards. It cannoned of the underside of the crossbar and Paul Rideout reacted quickest to leap and head the ball into the back of the net from close range.\nOn the occasions when United looked dangerous, Everton's goalkeeper Neville Southall was in inspired form, making a series of top drawer saves. The Blues' young centre-back David Unsworth gave a 'coming of age' display and hardly allowed Mark Hughes a kick of the ball. The performance that day was the epitome of the sort of teamwork Royle had introduced. Every individual worked together for the greater good of the whole team. That squad had also become full to the brim with real leaders and much of that stemmed from one of the club's most important post-war signings - Dave Watson. He was an excellent, no nonsense central defender, with a fabulous understanding of the game.\nWatson had been signed by Howard Kendall nine years earlier and had been part of some wonderful Everton teams. He'd also played in some very ordinary ones and I'm convinced that Everton would have been relegated without him. When he walked up those famous 39 nine steps to lift the FA Cup, the Blues fans were in raptures. A season that at one point had almost promised relegation, had ended with not only Premier League safety, but also with a major trophy.\nThere were plenty of heroes that day but the architect of it all was Royle. A man who knew Everton, who understood Everton and who'd transformed the team into something that the fans had not thought was possible. So after one of the most momentous occasions that Goodison has ever witnessed on Sunday, with the most fabulous and fondest farewell, the supporters can remember what happened 30 years ago with much hope that from this day onwards they not going to have to wait that long to see their team lift silverware again.\nListen to Total Sport Merseyside from 18:00 on weeknights and find details here of live Everton match commentaries on BBC Radio Merseyside", "url": "https://www.bbc.com/sport/football/articles/cwy67xy66wzo"}