{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:39:03", "date_modify": "2025-05-20 12:39:03", "date_publish": "2023-08-03 17:30:44", "description": "Beale pursuit pays off as versatile Cifuentes arrives", "filename": "sport_articles_c0vr7zj3d4qo_1747744743.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/eac3/live/54444af0-3223-11ee-8f52-fbf70e4bf742.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c0vr7zj3d4qo_1747744743.html", "title": "Beale pursuit pays off as versatile Cifuentes arrives", "title_page": "Beale pursuit pays off as versatile Cifuentes arrives - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Michael Beale says midfielder Jose Cifuentes had been on his target list since the moment he took charge at Rangers last November.\nHe has now got his man, with Ecuador international Cifuentes becoming Beale's ninth summer signing.\nThe 24-year-old arrives after winning the MLS Cup and Supporters Shield in his final season with Los Angeles FC.\n\"I was originally aware of him when he broke through in Ecuador and I have followed him on his journey with LAFC in the MLS,\" said Beale.\n“He is a midfielder who can play in a variety of roles, both as a box-to-box player and in a more defensive role. He has excelled in the MLS and for his national team.\n“When I returned to Rangers, he was a name that was immediately discussed and one that we knew we would have a lot of competition to overcome if we were to sign him. When meeting to discuss the move, it was clear that we are aligned in our thinking and on his further development.\n“I am delighted we have Jose here at Rangers and I must thank everyone involved in the process of making this transfer a reality.”\nCifuentes, who has 16 caps, said: \"I'm very excited to be here, I think this club is amazing.\n“When I spoke to Michael Beale, he told me about the project, what he wants here for the club, and he told me what he wants from me here so that’s why I joined. I love his project and his vision for football.”", "url": "https://www.bbc.com/sport/articles/c0vr7zj3d4qo"}