{"authors": ["Jane Lewis", "www.facebook.com"], "date_download": "2025-04-26 04:39:27", "date_modify": "2025-04-26 04:39:27", "date_publish": "2025-02-28 09:28:17", "description": "Should 33-year-old captain James Tavernier play against Motherwell at Ibrox on Saturday, it will be his 500th appearance in a Rangers jersey.", "filename": "sport_football_articles_c9813x1l04no_1745642367.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/122c/live/a3254480-f51d-11ef-9d71-cba46b08d97d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c9813x1l04no_1745642367.html", "title": "James Tavernier: Captain set for 500th Rangers game", "title_page": "James Tavernier: Captain set for 500th Rangers game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "James Tavernier spent the first six years of his career moving from club to club, on loan deal after loan deal.\nBut a move to Scotland gave the Englishman the stability he surely craved.\nShould the 33-year-old captain play against Motherwell at Ibrox on Saturday, it will be his 500th appearance in a Rangers jersey.\nThat will leave him just 26 short of Ian McColl in 10th place in the club's all-time appearance list, a feat described by new Rangers head coach and club legend Barry Ferguson as an \"unbelievable achievement\".\nTavernier's Rangers story started almost a decade ago when he was brought to the club by then-manager Mark Warburton on a three-year contract.\nAt the time of his July 2015 move from Wigan Athletic, the right-back said: \"It's a massive club and it was an easy decision for me. I like to get forward and create goals.\"\nHe wasn't wrong, as his records over those 10 years show.\nIn his debut season, Tavernier scored 10 goals in the Scottish Championship, including one that sealed the club's promotion back to the Premiership.\nWith that, he won his first Rangers honour. A second soon followed as he helped them lift the Challenge Cup. More significant trophies would follow.\nSteven Gerrard arrived at Ibrox amid fanfare in the summer of 2018 and gave the goalscoring defender the captain's armband. Tavernier appeared to relish the responsibility, leading by example and scoring 17 times in 57 appearances.\nThe following season, the goals dried up, with just three in 46 games.\nHowever, his scoring feats returned in the 2020-21 campaign amid a memorable title-winning season.\nTavernier scored 12 league goals as Rangers prevented Celtic winning an unprecedented 10 titles in a row, while he was part of a defence that conceded just 13.\nAfter clinching Rangers' 55th league title - the club's first since 2011 - Tavernier's next trophy was the Scottish Cup under Giovanni van Bronckhorst in 2022. It was the first time in 13 years the club had lifted the trophy.\nUnder Philippe Clement - his sixth permanent Rangers manager - Tavernier scored the only goal to clinch the League Cup in 2023-24.\nThe Englishman, who started his career at Newcastle United but made just two Premier League appearances in five years amid six loan spells, has also made a mark in Europe. He scored five times across qualifying and the group stages of the Europa League during his club's title-winning season.\nThe following year, Tavernier surpassed that with seven, becoming the only player with a Scottish club to ever finish top scorer in the tournament.\nThose strikes helped Rangers reach the Europa League final, but despite scoring in their penalty shootout against Eintracht Frankfurt, it ended in heartbreak with a 5-4 loss on spot-kicks after a 1-1 draw.\n\"I'm devastated,\" Tavernier said at the time. \"We wanted to make everyone proud, but we didn't get over the line. We went toe-to-toe with them and to lose on penalties hurts. \"\nThe appearances and the goals continued over the next couple of seasons.\nIn March 2024, a goal against Hibernian ensured Tavernier became the highest-scoring defender in British professional football history.\nHowever, later that year - and into this season - questions started to be asked among some sections of the support over his commitment to the club and his form.\nHe was linked with a move away, with former manager Gerrard supposedly keen on a reunion in Saudi Arabia when the former Liverpool captain was in charge of Al-Ettifaq.\nThat talk was heightened when Belgian Clement substituted him not long after the hour in this season's League Cup semi-final against Motherwell.\nAlthough the manager refused to be drawn on his reasoning, three days later Tavernier was dropped for the Europa League tie against Olympiakos.\nThe captain faced up to his critics, saying: \"I know the position I am in. I am on the frontline, so I am going to get the criticism, but I can fully take it.\"\nNow, with Clement gone, as Tavernier approaches his landmark 500th appearance, he has been backed by yet another manager, with interim head coach Barry Ferguson confirming he remains a big part of his plans.\n\"He's been through a lot in his Rangers career, but one thing I will say about James Tavenier is - he never hides,\" Ferguson said while stressing that criticism was \"part of\" being a Rangers player. \"He's always put himself out there to play.\n\"When you suffer defeats or you don't play well, it's generally the captain that gets it in the neck. But he's big enough to handle those situations. I've been through it as well.\n\"It's not nice at times, but I'm afraid that's the nature of the beast when you play at Rangers. And I thought on Wednesday night, when I moved him from his natural right-back position into the centre-half, he was exceptional. I thought he became a real leader.\n\"And that's what I want from my captain. As I said, we've had a few good chats. He's an important player for me.\"\nThat should ensure he runs out on Saturday against Motherwell for his half millennium of appearances.\nIf he scores in the Ibrox encounter, it will be the 102nd league goal of his career.", "url": "https://www.bbc.co.uk/sport/football/articles/c9813x1l04no"}