{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:35:48", "date_modify": "2025-05-20 13:35:48", "date_publish": "2023-08-01 17:13:22", "description": "Manchester United: Your views on progress in 2023-24", "filename": "sport_articles_c6pn0xj0n99o_1747748148.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ed75/live/ecccdba0-308b-11ee-8f52-fbf70e4bf742.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c6pn0xj0n99o_1747748148.html", "title": "Manchester United: Your views on progress in 2023-24", "title_page": "Manchester United: Your views on progress in 2023-24 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Former Chelsea and Scotland winger Pat Nevin believes it will be difficult for Manchester United to improve on last season's third-place finish, so we asked you for your views on whether the Reds will be better this time around.\nHere are a selection of your comments:\nRowen: I'm not fully convinced by our new signings and also can't help but feel we overpaid for a few of the players. Last year was a huge improvement but I just don't see us doing the same this year.\nGraham: Now we have a striker, a strengthened midfield and have changed keeper, I think we can, we just need to be ruthless in front of goal.\nNeil: For the squad we have and the performances I watched, third was a success. I've not seen enough changes or growth to convince me we'll do any better this season. Meanwhile squads around us have been active and improving in recent years or, like Chelsea, are in transition. I can see us lower than third this season. I'm hoping to remain in Europe.\nKensim: I can't see United improving on last year. It's hard to believe that they will finish above Man City, Liverpool and Arsenal. It will be difficult enough keeping Newcastle and Spurs at bay to finish in the top four.", "url": "https://www.bbc.com/sport/articles/c6pn0xj0n99o"}