{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:00:30", "date_modify": "2025-05-21 08:00:30", "date_publish": "2025-03-27 00:00:00", "description": "Luke Littler wins in Newcastle to extend his lead at the top of the Premier League table - relive the action as it happened.", "filename": "sport_darts_live_c62qlp8g5det_1747814430.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9a79/live/217f84a0-0b5b-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_live_c62qlp8g5det_1747814430.html", "title": "Premier League Darts: Luke Littler's win in Newcastle as it happened", "title_page": "Premier League Darts: Luke Littler's win in Newcastle as it happened - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "That's all from us\nA big thank you to everyone who has stopped by throughout tonight as Luke Littler won his second Premier League night in as many weeks.\nYou can read Phil Cartwright's report from the evening here.\nWe will back this time next week at the slightly earlier time of 18:00 BST, with the Premier League heading to the German capital of Berlin.\nUntil then, goodbye!\n'I've got a few of them, just not Gezzy'\nResult: Littler 6-1 Humphries\nLuke Littler speaking to Sky Sports after beating Luke Humphries 6-1 in Newcastle's final: \"It's another week. More points on the board, another nightly win. More comfortable at the top, loads of points ahead. I'm well set coming into the next weeks.\"\nOn whether he and Luke Humphries were tired: \"Yes, I said to Luke I don't know how we played that game we're both tired. That's what happens when you have to play three games in a night. I dug myself over the line.\"\nOn whether opponents are playing him rather than the board: \"As a player, you should always be playing against the board. When I'm playing like I am now, they are playing me.\"\nOn whether he has the edge over other players mentally: \"I've got a few of them, just not Gezzy.\"\nOn his mentality: \"Just relax, get to the semi-finals and then the final.\"\nOn the final: \"I got to the bottom of the stairs and was tired, didn't want to come up here but I got over the line.\"\nOn whether attitudes from other players have changed since he turned 18 in January: \"There's always been banter, but now I'm on 18 there's more banter I can get involved with.\"\nPost\nResult: Humphries 6-5 Aspinall\nFrom the walk-ons, where Luke Humphries and Nathan Aspinall sang together, to Aspinall starting the match with a 180, you just knew a thriller was on the cards.\nIt ebbed and flowed throughout. Aspinall led 4-2, Humphries led 5-4, Aspinall took it to a decider.\nAspinall knows he could have won that, but both men played excellently and showed why they are two of the best in the business.\nThe Asp lost that semi-final, but he is having an excellent week after his first European Tour win on Sunday.\nLet's take a look at the numbers...", "url": "https://www.bbc.com/sport/darts/live/c62qlp8g5det"}