{"authors": ["John Haughey", "www.facebook.com"], "date_download": "2025-05-21 03:45:39", "date_modify": "2025-05-21 03:45:39", "date_publish": "2025-04-06 15:00:11", "description": "Donegal take control after a bright Derry start to earn a 1-25 to 1-15 victory in the Ulster SFC opener at Ballybofey.", "filename": "sport_articles_cd02j41ddljo_1747799139.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0097/live/bc1030e0-1304-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cd02j41ddljo_1747799139.html", "title": "Donegal 1-25 Derry 1-15: Jim McGuinness' side subdue Derry resistance in Ulster SFC opener", "title_page": "Donegal 1-25 Derry 1-15: Jim McGuinness' side subdue Derry resistance in Ulster SFC opener - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Donegal subdued periods of Derry resistance to earn an in-the-end comfortable 1-25 to 1-15 victory in the Ulster Football Championship opener at Ballybofey.\nShane McGuigan had an early penalty saved by Donegal keeper Shaun Patton and the Oak Leafers missed other potential goal chances as the sides were level at 0-5 to 0-5 after 26 minutes.\nHowever, Daire O Baoill hit 1-4 before half-time helped the home side move into a 1-12 to 1-5 lead by the break even though Dan Higgins also struck a goal for the visitors in the same frenetic period.\nTwo-pointers from Conor Doherty and Brendan Rogers helped Derry - who by now had the wind advantage - cut Donegal's lead to only two after the resumption.\nBut Jim McGuinness' side responded with seven unanswered points to snuff out Derry's hopes as the home side increased their advantage to nine.\nAs the Oak Leafers continued to struggle to win debutant keeper Neill McNicholl's kickouts, Donegal were 11 clear at 1-23 to 1-12 up by the 56th minute, which enabled them to take off Patrick McBrearty after he had contributed 0-7.\nDonegal were able to utilise their far stronger bench in the closing stages as substitutes Oisin Gallen and Jamie Brennan notched scores after coming on.\nIn contrast, Derry's list of substitutes had an inexperienced look but while it was ultimately a comprehensive defeat for the Oak Leafers who suffered relegation from Division One, manager Paddy Tally will take positives from their strong-running efforts in the first half.\nDerry will be immensely frustrated at failing to exploit several scoring opportunities in the opening half - not least McGuigan's seventh-minute penalty miss.\nDonegal were 0-2 to 0-1 ahead with Conor O'Donnell and Ryan McHugh having responded to Padraig McGrogan's opening score when McGuigan failed to beat Shaun Patton from the penalty spot.\nThe spot-kick was awarded for Hugh McFadden's foul on McGuigan after a quick Derry break but the full-forward's weak shot was saved by Patton, with McGuigan hesitating instead of soccer-styling the rebound to the net which allowed the Donegal keeper to block the follow-up.\nDerry continued to chase goals as they were able to make a number of incisions deep into the Donegal defence with Conor Doherty poking wide after losing control of possession following his own charge.\nAt that stage, Derry trailed 0-4 to 0-2 but a Niall Toner point and a McGuigan free had the sides level by 23rd minute and they were soon back on terms when the Derry full-forward responded to a Peadar Mogan point.\nThe remaining nine minutes of first-half action was the key period of the contest as O Baoill's first two-pointer was followed immediately by two more Donegal scores as Michael Murphy and McBrearty pointed frees after referee Brendan Cawley had brought the ball forward 50 metres because of Derry indiscipline.\nO Baoill's second two-pointer in five minutes put Donegal six up and while Dan Higgins' goal, after another lightning Derry break cut the margin to only three, the home side's response was immediate as a Conor O'Donnell point was followed by O Baoill's goal with Derry defenders retreating instead of taking on the Gweedore man before he fired emphatically into the net from 18 metres.\nMurphy's inclusion as he made his first championship appearance since 2022 was one of three later changes to the Donegal starting line-up as McBrearty and Odhran McFadden Ferry were also drafted in with Michael Langan, Niall O'Donnell and Aaron Doherty making way.\nMurphy was relatively subdued in the first half as he was well marshalled by Eoin McEvoy but his more prominent second half included a lovely late score from play as Derry noticeably tired.\nDerry did summon up a big effort after the resumption as a Rogers' point and two-pointer and another score from outside the 40-metre arc by Conor Doherty cut Donegal's lead to only two.\nHowever, yet more Derry indiscipline gifted a relieving close-range free for McBrearty which began a run of seven straight Donegal points which included scores by Shane O'Donnell, Ciaran Moore, Peadar Mogan and championship debutant Finbarr Roarty.\nDonegal: S Patton; F Roarty (0-1), B McCole, C Moore (0-2); R McHugh (0-1), C McGonagle, P Mogan (0-2); H McFadden, M Murphy (0-2); D O Baoill (1-4), C Thompson, S O'Donnell (0-2); O McFadden Ferry, C O'Donnell (0-2), P McBrearty (0-7).\nSubs: M Curran for McFadden-Ferry HT, J Brennan (0-1) for McBrearty 57, J Mac Ceallabhui, O Gallen for C O'Donnell 50, J McGee for McFadden, N O'Donnell for Roarty 66.\nNot used: G Mulreany, S McMenamin, K McGettigan, M Langan, A Doherty\nDerry: N McNicholl; D Baker, B Rogers (0-5), M Bradley; C Doherty (0-2), P McGrogan (0-1), E McEvoy; C Glass, D Higgins (1-0); E Doherty, Paul Cassidy, C McFaul; N Toner (0-1), S McGuigan (0-4), L Murray (0-2).\nSubs: N Loughlin for Higgins 38, P McGurk for E Doherty 57, D Cassidy for McGrogan 66, C McMonagle for Toner 51.\nNot used: B McKinless, B McCarron, M Doherty, C Devlin, R Mulholland, C Diamond, K Quinn.\nReferee: B Cawley (Kildare).", "url": "https://www.bbc.com/sport/articles/cd02j41ddljo"}