{"authors": ["Chris Wathan", "www.facebook.com"], "date_download": "2025-05-21 04:21:16", "date_modify": "2025-05-21 04:21:16", "date_publish": "2025-04-06 06:27:57", "description": "At the age of 38 the former Scotland international is revelling in being \"part of something special\" in Wrexham's League One promotion challenge.", "filename": "sport_football_articles_c98gy32n549o_1747801276.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f1df/live/aeb07f10-12ad-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c98gy32n549o_1747801276.html", "title": "Steven Fletcher: Wrexham's leading man in a supporting role", "title_page": "Steven Fletcher: Wrexham's leading man in a supporting role - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "In true Hollywood style, Wrexham are showing you are never too old to play the hero.\nAs A-list actor and club co-chairman Ryan Reynolds watched on in the 3-0 win over Burton Albion, Steven Fletcher continued what he has called one of the most enjoyable seasons of his long career.\nA latest sequel that means the all-action veteran is so glad he did not retire.\nAt the age of 38, the former Scotland international admits he did not expect to be in the thick of a League One promotion challenge.\nInstead, a game-changing goalscorer again, he is revelling in being \"part of something special\".\n\"I thought it was just going to be nine months and I'd be back home retired and with my feet on the sofa watching football,\" Fletcher said in the club's matchday programme.\nWrexham and their fans, firmly daring to dream of going from non-league to the Championship, will be glad he is not.\nSo too the on-watching Reynolds, whose phonecall from LA helped seal the deal to sign the ex-Premier League striker - for Burnley, Wolves and Sunderland - on a free when he was considering hanging up the boots in the summer of 2023.\nAs Wrexham toiled against Burton's 10 men in Saturday's lunchtime sunshine, Fletcher's 71st minute opener from the spot put Wrexham on course for a victory that opened up a six-point gap between themselves and third-placed Wycombe Wanderers.\nIt was his eighth goal of a campaign that he had not anticipated, matching his total from last year as Wrexham earned promotion to this level - and making him their leading scorer in the league.\nAnd, as with all bar one of that tally, this latest one came off the bench as he stepped in to replace the injured Jay Rodriguez.\nIt means a goal every 118 minutes of football, a ratio better than the division's leading scorers Jay Stansfield of Birmingham City (127) and Wycombe's Richard Kone.\nThe leading man in a supporting role.\nAnd not simply with goals. It is his attitude, aura and experience that has benefited Wrexham. A player prepared to lead the line and lead by example.\n\"He's incredible,\" said defender Eoghan O'Connell of a player who has played more than 200 top-flight games and cost clubs more than £20m in transfer fees.\n\"His performances speak for themselves. It could have been easy for him to come here, getting to the end of his career, and just fob it off - but he's just brilliant and a brilliant person.\n\"The influence he's had on the whole team since he came here, the way he is off the pitch, he's so popular in the dressing room, everyone loves him.\"\nGrouping Fletcher with captain and fellow former top-flight pro James McClean, manager Parkinson praised the standards he sets and the messages he sends.\nThere was credit, too, for the assistance he has given Sam Smith, the January signing who added Wrexham's second on Saturday before Jack Marriott wrapped up the scoring.\n\"He brings us so much,\" said Parkinson of frontman Fletcher, who has made 35 appearances this year, only two of which have been starts.\n\"He understands where he is in his career.\"\nParkinson added: \"His last year was at Dundee United and a club in a difficult situation. I think when he looks back he'll be so pleased he didn't finish his career then.\n\"I think he was fifty-fifty but he's had a real lift from coming here. He's enjoyed it and I've really enjoyed having him.\"\nFletcher suggested in his pre-match interview he may well want that feeling to continue beyond the contract that expires at the end of the season.\n\"When you're enjoying something so much and you still feel like you're making an impact when you're playing I don't see why you would want to stop,\" he stated in the programme.\nFor now, Wrexham will hope his influence remains for a final five games of a season that could yet be another Hollywood success.", "url": "https://www.bbc.com/sport/football/articles/c98gy32n549o"}