{"authors": ["Alex Howell", "www.facebook.com"], "date_download": "2025-04-26 07:57:43", "date_modify": "2025-04-26 07:57:43", "date_publish": "2025-02-25 12:10:56", "description": "England head coach Thomas Tuchel holds talks with Arsenal defender Ben White ahead of naming his first squad next month.", "filename": "sport_football_articles_c1jpg0yk429o_1745654263.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17b9/live/e85ab8b0-f369-11ef-a30e-87a8a95b0cd7.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c1jpg0yk429o_1745654263.html", "title": "Ben White: Thomas Tuchel holds talks with Arsenal defender over England future", "title_page": "Ben White: Thomas Tuchel holds talks with Arsenal defender over England future - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "England head coach Thomas Tuchel has held talks with Arsenal defender Ben White before naming his first squad next month.\nTuchel, who started his role officially on 1 January, said at the World Cup draw in December that he would \"reach out\" to White.\nWhite left England's 2022 World Cup camp in Qatar after the group stage to return home for personal reasons.\nHe has not been in an England squad since making himself unavailable for selection.\nThe 27-year-old has played four times for the Three Lions, with his last appearance in March 2022.\nTuchel has been pictured at numerous games watching players before the World Cup qualifiers against Albania and Latvia at Wembley in March.\nSources told BBC Sport talks had taken place but there is no suggestion that it means White will definitely be in the Three Lions squad.\nWhite made his first appearance for Arsenal since November in the defeat by West Ham at the weekend, following knee surgery.\nGunners boss Mikel Arteta said it is for the England coach to decide if he brings White back into the international fold.\n\"[He is] a player that has given us something very, very special, especially in that right unit,\" Arteta said of White's impact in his Arsenal team.\n\"So, great to have him back, more options, his energy, the way he's around the team, the way he generates - he certainly has been missed.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c1jpg0yk429o"}