{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:30:24", "date_modify": "2025-04-26 07:30:24", "date_publish": "2025-02-27 17:33:44", "description": "Nottingham Forest news: Ryan Yates on draw with Arsenal", "filename": "sport_football_articles_cgm112mgxpxo_1745652624.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4070/live/4e9edc80-f51f-11ef-b1cf-3b30ef6eb80e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cgm112mgxpxo_1745652624.html", "title": "Nottingham Forest news: Ryan Yates on draw with Arsenal", "title_page": "Nottingham Forest news: Ryan Yates on draw with Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Nottingham Forest midfielder Ryan Yates says the \"biggest positive\" from their draw with Arsenal was the clean sheet.\nSpeaking to BBC Radio Nottingham's Colin Fray after the game Yates said: \"It's a good point - I wouldn't say it's a brilliant point.\n\"We want to win, especially at home but we'll take the point and the clean sheet more than anything - I think that's the biggest positive.\n\"Defensively from [Chris] Wood up top to [Matz] Sels in goal, I think we were a bit more compact, we knew they would have a lot of the ball and it was about being disciplined and tight and compact. It was a bit different to how we've been recently but that's how we got the clean sheet.\"\n\"It was going to be tough to break them down with a lot of sustained pressure. My job was to crash the box when I could, make it difficult and try and make something happen. The ball dropped to us a couple of times but we just couldn't get it in - but that's part and parcel, they probably had the better chances but we'll take the clean sheet.\n\"The main thing was to get back and be really resolute and not give away too many goal scoring opportunities - we limited them to a couple and that's top work from the manager and everyone buying into the process.\"\nThe 27-year-old was brought off the bench in the second half, and speaking about the importance of substitutes making an impact, he said: \"I've been on the bench a few times, I know what it's like - especially in the Premier League.\n\"You've got to be straight on it and get yourself mentally prepared more than anything when watching the game and try and work out where you can make an impact on the game as much as possible.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cgm112mgxpxo"}