{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:18:51", "date_modify": "2025-05-21 04:18:51", "date_publish": "2025-01-23 18:46:31", "description": "Nottingham Forest podcast: 'Qualifying for Europe a necessity'", "filename": "sport_football_articles_cn93ydgdnv7o_1747801131.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fcb/live/0f046ad0-3aa4-11ef-bbe0-29f79e992ddd.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cn93ydgdnv7o_1747801131.html", "title": "'Qualifying for Europe a necessity'", "title_page": "Nottingham Forest podcast: 'Qualifying for Europe a necessity' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "David Prutton thinks Nottingham Forest should pursue European football as \"a necessity\" in what is a \"glorious\" spell at the football club.\nBBC Radio Nottingham's Colin Fray caught up with the former Forest midfielder after Sunday's game against Southampton and Prutton said on the Shut Up And Show More Football podcast: \"Given what Nottingham Forest are doing - it's a joyous time to be at the City Ground, the feeling around the place is just glorious at this moment in time.\n\"Given what Nuno brought to the side and the quality of players, there was always an element of progression and consolidation - it's very surprising to see where they are.\n\"In tandem, with so called bigger clubs not hitting their straps, Forest have needed to beat what's in front of them and they've beaten some very big teams and they've played in a way that I find extremely entertaining - and it's just a very likeable bunch of people doing some incredible work.\n\"European football should absolutely be the first port of call. That run for the title - Forest are there in the slipstream, no expectation of getting anywhere near the top of the tree and should really work in tandem with that.\n\"Europe, now you've got to really be thinking that's a necessity and if they're anywhere near the title - that's a phenomenal season.\"", "url": "https://www.bbc.com/sport/football/articles/cn93ydgdnv7o"}