{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:35:00", "date_modify": "2025-04-26 07:35:00", "date_publish": "2025-02-27 15:12:49", "description": "The opening Supreme Novices' Hurdle at the Cheltenham Festival will be renamed in tribute to jockey Michael O'Sullivan, who died after a fall.", "filename": "sport_horse-racing_articles_cz033944kjdo_1745652900.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6bef/live/1ebbfdd0-f520-11ef-896e-d7e7fb1719a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_horse-racing_articles_cz033944kjdo_1745652900.html", "title": "Michael O'Sullivan: Cheltenham's Supreme Novices' Hurdle renamed in memory of jockey", "title_page": "Michael O'Sullivan: Cheltenham's Supreme Novices' Hurdle renamed in memory of jockey - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The opening race at next month's Cheltenham Festival will be renamed in tribute to jockey Michael O'Sullivan.\nIrish rider O'Sullivan, 24, died on 16 February, 10 days after a fall at Thurles.\nThe Sky Bet Supreme Novices' Hurdle - the Festival's first race on 11 March - will now be named the Michael O'Sullivan Supreme Novices' Hurdle.\nO'Sullivan shot to prominence when winning the race aboard Marine Nationale two years ago and he was leading jockey on the opening day in 2023 after following up in the Fred Winter Hurdle on Jazzy Matty.\n\"We are deeply proud of Michael's incredible talent and the legacy he left in the world of racing,\" said O'Sullivan's family.\n\"Renaming the race that marked the pinnacle of his career is a fitting tribute to his skill, dedication, and passion for the sport.\n\"As a family, we have always admired Michael's achievements both on and off the track, and it means so much to us to see his talent recognised in this way. The outpouring of tributes over the past week has been a testament to the impact he had on so many lives.\n\"We would like to sincerely thank The Jockey Club and Sky Bet for giving us this opportunity to honour Michael's memory and celebrate his remarkable career.\"\nO'Sullivan had been riding Wee Charlie at Thurles for trainer Gerard O'Leary when he was one of three fallers at the final fence in a two-mile handicap chase.\nHe was treated at the County Tipperary track before being transferred by air ambulance to hospital, but did not recover from his injuries.\nO'Sullivan's first win under rules came at Cork in 2018 and he turned professional in September 2022 before becoming Irish champion conditional jockey the following year.\nHe rode 95 winners in Ireland and Britain over his career, including 14 in Ireland and two in Britain this season.\n\"When you read the heartfelt tributes paid to him over these past days, you can see how highly regarded he was in the racing community on both sides of the Irish Sea and beyond,\" said Cheltenham chief executive Guy Lavender.\n\"Given that it was at Cheltenham that Michael enjoyed his biggest success as a rider back on that magical Tuesday afternoon in 2023, we felt it was only right to pay tribute to Michael in this way.\"", "url": "https://www.bbc.co.uk/sport/horse-racing/articles/cz033944kjdo"}