{"authors": ["Aled Williams", "www.facebook.com"], "date_download": "2025-05-20 13:05:38", "date_modify": "2025-05-20 13:05:38", "date_publish": "2023-08-02 16:31:55", "description": "Wrexham have finally reached the promised land of the Football League after a 15-year absence but what twists and turns await the Hollywood-owned club?", "filename": "sport_football_66341486_1747746338.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12A63/production/_130578367_gettyimages-1252137638.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66341486_1747746338.html", "title": "Wrexham 2023-24 League Two season preview: Dragons back in the promised land of EFL", "title_page": "Wrexham 2023-24 League Two season preview: Dragons back in the promised land of EFL - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Wrexham have returned from the Land of Promise ahead of their much anticipated return to the promised land of the EFL.\nThe Dragons have enjoyed a high profile and highly successful tour of the United States, which saw them reach out to an ever growing fanbase.\nThey will swap the pre-season of games against Chelsea, Manchester United and LA Galaxy for early season league encounters against MK Dons, AFC Wimbledon and Walsall.\nBut far from coming back down to earth with a bump, it's what Wrexham fans have been waiting for, a 15-year wait in fact.\nBack in the Football League for the first time since 2008, Wrexham is a very different club to the one which suffered the ignominy of dropping into English football's fifth tier.\nRelegation to non-league was in part due to ownership issues - but now under Hollywood owners Ryan Reynolds and Ryan McElhenney the sky's the limit for the third-oldest professional association football team in the world who have made no secret of their ambition to reach the Premier League.\nIt will be a season remembered as one of the most memorable in Wrexham's 159-year history.\nA season which saw the premier of the much awaited Disney+ documentary, Welcome to Wrexham as well as a memorable FA Cup run, in which they came within seconds of knocking out Premier League-bound Sheffield United.\nThe league campaign saw the Dragons go toe-to-toe with Notts County in a National League title race which ebbed and flowed between the two historic clubs.\nThe epic tussle culminated in an Easter Monday meeting at the Racecourse in which Wrexham came out on top 3-2, thanks in no small part to veteran goalkeeper Ben Foster's late penalty save.\nWrexham would set a number of records as they sealed the National League title and promotion back to League Two after so many near misses and heartbreak.\nFoster believes Wrexham are good enough to win League Two, citing the strength of a squad which already boasted a wealth of Football League experience.\nThe bookmakers agree, with the Dragons favourites to win the League Two title and with three automatic promotion spots in addition to the play-offs there are more opportunities to get out of the division than the National League.\nMomentum from last season's National League title winning campaign could carry the side on to further success this season, but they will start the season without talisman Paul Mullin following his much publicised and much discussed injury during pre-season.\nWhether Parkinson will decide to plug that gap by dipping into the transfer market remains to be seen but the Dragons do have the means to add to their ranks should they wish to do so.\nThere will certainly be plenty of plot twists and drama to satisfy the audiences, be it the Racecourse faithful or armchair enthusiasts.\nManager Phil Parkinson's view\n\"It's been a long journey outside the EFL and it's so great to be back in amongst it.. This is what we've worked for and we're looking forward to starting our campaign.\n\"Obviously we're going to aim to be up there at the top end of the table but there's another 20 plus who are feeling the same as we lead into the first game.\n\"We want to be competitive and I feel we've got a strong squad. We've built a team of players who have played at a high level.\n\"The aim when I came in and sat down with the owners is we've got to build a squad, if it gets promoted, be strong enough in the next league.\n\"That's what we've done and we've got players like Elliott Lee, Paul Mullin, Andy Cannon to name just a few, who have played at a higher level.\n\"I'm really excited about seeing them acquit themselves inn what's going to be a competitive division.\"", "url": "https://www.bbc.com/sport/football/66341486"}