{"authors": ["Steve Canavan", "www.facebook.com"], "date_download": "2025-05-19 15:15:39", "date_modify": "2025-05-19 15:15:39", "date_publish": "2015-02-20 11:20:41", "description": "Tim Sherwood's first game in charge at Aston Villa ends in late defeat as Stoke come from behind to win 2-1 at Villa Park.", "filename": "sport_football_31466727_1747667739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81115000/jpg/_81115673_489536739.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31466727_1747667739.html", "title": "Aston Villa 1-2 Stoke City", "title_page": "Aston Villa 1-2 Stoke City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "New Aston Villa manager Tim Sherwood's reign began with a stoppage-time defeat by Stoke, the club's sixth straight league loss leaving them second bottom.\nIn the dugout for the first time since replacing the sacked Paul Lambert, Sherwood saw on-loan winger Scott Sinclair head in Fabian Delph's cross.\nMame Diouf beat Brad Guzan from six yards to level before the break.\nAnd Victor Moses's 91st-minute penalty won it - with Villa's Ron Vlaar shown a red card for bringing down the winger.\nIt meant a disappointing start for Sherwood, who was taking charge of his first Premier League game since May 2014 when, as Tottenham boss, Spurs beat Villa 3-0 at White Hart Lane.\nSherwood was dismissed by Spurs despite boasting the best top-flight win percentage (59%) of any Tottenham boss in Premier League history but his 11-month exile from the game ended when he was appointed Villa boss.\nAnd for long periods, Villa did not look the side that had dropped into the bottom three after losing to Hull on 10 February.\nHowever, Mark Hughes's mid-table Stoke side had a point to prove after successive 4-1 defeats, against Blackburn in the FA Cup and at home to Manchester City in the league.\nBut Stoke levelled before the break when Diouf headed in Stephen Ireland's centre for his seventh goal of the season. Guzan, making his 100th successive Premier League start, had no chance.\nThe visitors always looked the better side from then on and moments after Villa's Ciaran Clark headed narrowly over, the away side won a stoppage-time penalty when Vlaar bought down Moses.\nAfter the Villa captain was shown a second yellow card, Moses confidently converted from the spot to ruin Sherwood's big day and ensure Villa stay in deep trouble.\nAston Villa boss Tim Sherwood: \"You can't take any positives. It is bitterly disappointing to lose the game in the manner we did, right at the death. Both teams were very poor, but I didn't care as long as we won.\n\"There is no point in me getting a big stick out and banging the players on the head with it. It is about me getting the best out of them for the remaining games.\n\"There is a lot of work to be done but we will improve because we need to keep this great club in the Premier League. We are not thinking about going down.\"\nStoke boss Mark Hughes: \"Before the game there was a lot of positivity around Villa and rightly so. I think Tim will be a very good appointment. But today was about what we needed to do as a group and to have a response to the previous weekend at Blackburn when we didn't do ourselves justice.\n\"Not too many people gave us a chance of winning, which we were a bit taken aback by. It was a key game for us on a number of levels and I am delighted with what we produced.\"", "url": "https://www.bbc.com/sport/football/31466727"}