{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:46:45", "date_modify": "2025-04-26 06:46:45", "date_publish": "2025-03-01 13:05:01", "description": "Shayden Morris believes Aberdeen are \"dealing well\" with the pressure of holding onto third sport in the Scottish Premiership.", "filename": "sport_articles_c74kz8z73g9o_1745650005.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d549/live/487cc2e0-f605-11ef-aa28-abbfea60ff44.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c74kz8z73g9o_1745650005.html", "title": "Morris enjoying pressure of third place chase", "title_page": "Morris enjoying pressure of third place chase - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Shayden Morris believes Aberdeen are \"dealing well\" with the pressure of holding onto third sport in the Scottish Premiership.\nThe Dons sit one point above Sunday's opponents Dundee United, and the 23-year-old forward is hopeful that the home support can inspire an important victory.\n\"We're looking forward to the game, we know how big the occasion is,\" said Morris.\n\"They're close to us in the table, we've played them twice this season and both have been really close games with late winners as well.\n\"They're doing well this season, they've got a good coach in Jim Goodwin.\n\"United are a good team, we respect them highly, but being at home, that's a big advantage for us to have the fans behind us like they have been recently.\n\"I feel like it's a good type of pressure, we're a big team in Scotland, so we want to be in third place. We know that there are other good teams so we're not expecting it to be a massive gap.\n\"We're dealing with that pressure well and just trying to take every game as it comes.\n\"We know that from now to the end of the season, every game is a cup final for us, every game we go into is going to be full guns blazing from now on.\"", "url": "https://www.bbc.co.uk/sport/articles/c74kz8z73g9o"}