{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:48:00", "date_modify": "2025-04-26 07:48:00", "date_publish": "2025-02-26 23:04:37", "description": "Kilmarnock 2-4 Rangers: What McInnnes said", "filename": "sport_articles_cvg11dz1gqvo_1745653680.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/39af/live/efdff0f0-f495-11ef-839b-6909acee4532.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_cvg11dz1gqvo_1745653680.html", "title": "Kilmarnock 2-4 Rangers: What McInnnes said", "title_page": "Kilmarnock 2-4 Rangers: What McInnnes said - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Kilmarnock manager Derek McInnes: \"I thought we started the game the way we needed to.\n\"Any time you speak about the importance of getting the first goal, imposing your self in the game and I thought we did exactly that.\n\"I thought we were superior in that first 30/35 minutes, I thought it could've bene more.\n\"It's difficult to maintain that level of energy and aggression and organisation and sometimes Rangers are good enough to pick through you.\n\"In the lead up to their first goal, we make a bad decision and they've got the ability to play through you. For 35 mintues we had the game exactly how we wanted it, we could have added to it and half time came at a good time.\n\"I must admit their second goal wasn't a corner. It might seem churlish but Don Robertson gives the goal-kick but lets the linesman from 30 yards away give a corner when it's not a corner. But they punish us to the full extent. That gave their support a lift, gives the players encouragement they might need.\n\"I'm disappointed with some of the decision making, how excited we got when we needed to stay calm. Rangers are good enough to punish you.\n\"It's the team who finds a bit of consistency that might just nick that last spot for top six. We want to be that team and I think we're capable of it but ultimately when you're in a strong position in the game you need to take something from it.\n\"There's still loads to play for. We still feel there's wins in us, nothing changes from tonight. It's a sore one but you've got to pick yourself back up and go again.\n\"If we can win the game [at the weekend] we damage one of the teams around us so it's important we get something from the game.\"", "url": "https://www.bbc.co.uk/sport/articles/cvg11dz1gqvo"}