{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:19:02", "date_modify": "2025-05-21 05:19:02", "date_publish": "2025-01-31 23:18:31", "description": "World champion Luke Littler cruises through to the second round of the World Masters with a commanding straight-set win over Andy Baetens.", "filename": "sport_darts_articles_c5ye2dlq0gqo_1747804742.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0b3f/live/23e5fe40-e022-11ef-b18b-851a01995a66.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_darts_articles_c5ye2dlq0gqo_1747804742.html", "title": "Luke Littler: World champion cruises through to World Masters second round", "title_page": "Luke Littler: World champion cruises through to World Masters second round - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "World champion Luke Littler cruised through to the second round of the PDC World Masters with a commanding straight-set win over Andy Baetens in Milton Keynes.\nCompeting on home soil for the first time since becoming darts' youngest world champion, teenager Littler completed an efficient 3-0 victory to set up a second round meeting with James Wade.\nLittler, 18, averaged 104.33 and lost only one leg in a statement opener as he outclassed his opponent in just 10 minutes.\nAlso on Friday, World Championship runner-up Michael van Gerwen defeated Bradley Brooks 3-1 and will meet Dimitri van den Bergh next.\nBelgian Van den Bergh beat Scottish 14th seed Gary Anderson 3-1 to progress to the tournament's last 16, which takes place on Saturday.\nWade, the 15th seed, will go into his match against Littler on the back of a 3-2 win over Mike de Decker.\nElsewhere, Cameron Menzies upset sixth seed Dave Chisnall 3-1 to set up a meeting with Nathan Aspinall, who averaged 103.77 in beating Andrew Gilding 3-0.\nRyan Searle overcame 10th seed Chris Dobey 3-1 to set up a meeting with Jonny Clayton, who hit a remarkable 112.77 average in a 3-1 victory over Martin Schindler.", "url": "https://www.bbc.com/sport/darts/articles/c5ye2dlq0gqo"}