{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:06:18", "date_modify": "2025-04-26 08:06:18", "date_publish": "2025-02-26 14:54:35", "description": "Irish Football Association technical director Aaron Hughes says the newly announced National Training Centre could make a \"huge\" difference in developing the country's next generation.", "filename": "sport_football_articles_c78ewg1y85go_1745654778.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4c75/live/920169c0-f44d-11ef-a53f-8184dbe9ec46.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c78ewg1y85go_1745654778.html", "title": "NI's National Training Centre could have 'huge' impact, says IFA technical director Aaron Hughes", "title_page": "NI's National Training Centre could have 'huge' impact, says IFA technical director Aaron Hughes - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Irish Football Association technical director Aaron Hughes has said the newly announced National Training Centre could make a \"huge\" difference in developing the country's next generation.\nOn Wednesday, the IFA confirmed plans to build a new facility on a 50-acre site in Galgorm, near Ballymena.\nHaving found a location for the facility, Hughes says it marks the \"first step\" in a new journey for Northern Irish football.\n\"As a young player coming through, if you had something like this, you'd want to come and train at it, you'd want to be a part of it,\" said Hughes.\n\"You'd feel you'd be able to follow in the footsteps of the players ahead. I think last year, when our under-17s were in St George's in the elite rounds, the England senior team were staying there at the same time.\"\nFormer Northern Ireland captain Hughes, who was appointed IFA technical director in late 2022, added: \"For our young players to be able to train and perform alongside the senior players and maybe create opportunities like that, it's what we've been missing for so long.\"\nSubject to planning permission, the IFA hopes to have up to six training pitches at the new facility, one of which would be covered, in addition to treatment rooms and meeting rooms.\nFor Hughes, having a settled base for their teams will mean greater control and far fewer logistical headaches.\n\"It's a constant struggle we have at the moment, finding facilities,\" added the former Newcastle and Fulham defender.\n\"If you want to start with our senior teams, you're trying to find facilities that are adequate for high performance and it's not always easy.\n\"Even trying to find slots for training, borrowing off other people and using their facility and you're always having to work around the logistical side of it, even from the point of view of the travel time.\n\"There are so many logistical details that we'll solve by having it all onsite.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c78ewg1y85go"}