{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-19 14:41:03", "date_modify": "2025-05-19 14:41:03", "date_publish": "2017-07-25 21:48:14", "description": "Peterhead stun Hearts with a late penalty, while Myles Hippolyte bags a hat-trick as Falkirk wrap up League Cup Group A.", "filename": "sport_football_40721312_1747665663.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17509/production/_97079459_rory.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_40721312_1747665663.html", "title": "League Cup Groups A & B: Peterhead stun Hearts, Falkirk go through as winners", "title_page": "League Cup Groups A & B: Peterhead stun Hearts, Falkirk go through as winners - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Rory McAllister converted a late penalty as Peterhead stunned Hearts with a 2-1 victory in the League Cup.\nJason Brown headed the League Two outfit into an early lead, with Kyle Lafferty levelling with his fourth goal in three games.\nPaul Willis scored late on as East Fife edged out Elgin City 3-2.\nFalkirk wrapped up Group A with a 4-0 win over Forfar, Myles Hippolyte scoring a hat-trick, while Stirling Albion beat Brechin City 2-0.\nThe Bairns made it three wins from three to guarantee seeded status in the knockout phase and Inverness CT need to win at Forfar on Saturday to leapfrog the Binos and hope to claim one of the four best runners-up spots.\nGroup B is still wide open after Hearts' shock defeat at Balmoor.\nThe Blue Toon started brightly and Willie Gibson had curled a free-kick narrowly wide and Jordan McGhee made a goal-line clearance from Russell McLean before they took a sixth-minute lead.\nHearts were caught napping at a corner and Gibson's delivery from the right was met powerfully by the head of Brown.\nThe visitors were level on 17 minutes, Lafferty firing a Michael Smith cross home from close range shortly after Isma Goncalves had sent an effort just wide.\nJack Hamilton fumbled a McAllister free-kick just before the half hour, with Krystian Nowiak doing well to clear.\nHearts then began to enjoy more territory against the part-time hosts and Greg Fleming did well to stop a raking strike from Jamie Walker before Goncalves curled a shot over the top.\nIan Cathro's side were punished for not taking those chances when Arnaud Djoum bundled Jordon Brown over in the final minute after a great run from McAllister and the striker kept a cool head to send Hamilton the wrong way from the spot.\nHearts and Peterhead are level on six points going into the final fixtures on Saturday.\nDunfermline, who sit top of the section on eight points, go to Tynecastle, with Peterhead away to Elgin.\nEast Fife earned their first win of the tournament in a see-saw match in Methil. Willis tapped in the decisive goal after a Nathan Flanagan shot was parried into his path.\nThomas Reilly netted twice for Elgin, with Chris Duggan levelling for the hosts and Mark Docherty on target from the penalty spot.\nHippolyte's first goal at the Falkirk Stadium was stunning strike from 25 yards after just eight minutes.\nNathan Austin then added a header before Hippolyte thumped in another powerful strike.\nThe 22-year-old forward completed his hat-trick five minutes into the second half, drilling home from the back post area.\nStirling Albion sit second in Group A, having completed their four matches with a second victory.\nPeter MacDonald converted a penalty on 40 minutes and Liam Caddis did the same right at the end.", "url": "https://www.bbc.com/sport/football/40721312"}