{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 03:48:24", "date_modify": "2025-05-21 03:48:24", "date_publish": "2025-01-15 11:50:44", "description": "Kelly Cates, Mark Chapman and Gabby Logan will be the new Match of the Day presenters, the BBC has announced.", "filename": "sport_football_articles_ce9nzxe4m18o_1747799304.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5e2d/live/9ae20b00-d295-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ce9nzxe4m18o_1747799304.html", "title": "Match of the Day presenters: Kelly Cates, Mark Chapman and Gabby Logan to host MOTD", "title_page": "Match of the Day presenters: Kelly Cates, Mark Chapman and Gabby Logan to host MOTD - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kelly Cates, Mark Chapman and Gabby Logan will be the new Match of the Day presenters from next season, the BBC has announced.\nIt is the first time the role will be shared between three people.\nThey will split presenting duties for Match of the Day 2 on Sundays and MOTD: Champions League on Wednesdays, as well as Saturday's flagship show.\nGary Lineker has hosted Match of the Day since 1999 and will do so for the rest of the season.\nThe former England striker will continue to lead the BBC's TV coverage of the FA Cup next season and present the men's World Cup in 2026.\nCates, Chapman and Logan will be the sixth set of main presenters for Match of the Day, which is the longest-running football show in the world having launched on 22 August 1964.\nLast season, 33 million viewers tuned in across all Match of the Day Premier League and FA Cup programmes.\nFormer England players Alan Shearer and Micah Richards will continue as regular MOTD pundits.\nBBC Sport director Alex Kay-Jelski said: \"I know viewers will love these three incredible broadcasters and journalists at the heart of our football coverage next season.\n\"They're brilliant at what they do and MOTD viewers can be sure they will be well looked after as the big football talking points are expertly analysed.\n\"Gary has done a phenomenal job at Match of the Day for the last 25 years, he'll be missed greatly and we all still get to enjoy him on our screens across some of football's greatest tournaments.\n\"Outside of Match of the Day we've got some great new shows, voices and surprises lined up for the 2025-26 season across audio, video and digital and we look forward to sharing them with you all later in the year.\n\"It's a truly exciting time for BBC Sport's football coverage.\"\n\"We are all friends and we've known each other for a long time and that's a really lovely part of it,\" said Cates, who will also continue to work for Sky Sports.\n\"Not only is it a great role just on its own but I'm sharing it with two people I really admire, respect and genuinely like. It's a great set-up.\"\nLogan, who first joined the BBC in 2007, has stood in for Lineker on Match of the Day and presented many huge sporting events for the BBC, including men's and women's World Cups and European Championships, the Six Nations and Olympics.\n\"I think what's interesting is although we're sharing the role, we won't actually be working together on Match of the Day,\" she said.\n\"It's really great to share it because we bring different experiences and different interests within the game. We bring different ways of broadcasting and that will mean our pundits are kept on their toes and share different kinds of analysis.\"\nChapman has been the main MOTD2 host since 2013 and works regularly on BBC Radio 5 Live.\n\"People might find this hard to believe but there's absolutely no competition between the three of us,\" he said.\n\"We'll do a mix of everything that works for us all as individuals, and all of us are really keen that it's fair.\n\"This isn't about the three of us, it's about the three of us plus our pundits, plus our editors, plus our analysts and stats people and production people and radio people and online.\"\n\"Match of the Day was always on - I can't remember a time without it,\" said Cates, who is the daughter of Liverpool and Scotland legend Sir Kenny Dalglish.\n\"My earliest memory is of Des Lynam being on it. In fact there's a Scottish version of Match of the Day and I was born just before it came on air, so my dad had time to get home and watch it in the evening. I've always had a good sense of timing when it comes to an evening highlights show!\"\nLogan, who is the daughter of former Wales and Leeds midfielder Terry Yorath, said: \"When my dad was playing, it was the only way you could watch football on TV because there were very few live matches.\n\"That music would play every Saturday night because he would come home from work - playing in a match - and watch his match on Match of the Day. As a very little girl, hearing that music meant I was staying up late on a Saturday night.\"\nChapman said: \"My first memory of Match of the Day was in 1981 watching Manchester United play Ipswich at Old Trafford in the era when not every game was shown on the programme.\n\"I remember Gary Bailey being in goal for Manchester United and saving a penalty with no gloves on. I wanted to go and get in goal in the garden after that. I must have been seven.\"\nCates said MOTD's status as an institution made it \"nerve-wracking\".\n\"It's something that's so well-loved and so well-respected you don't want to be the person that goes in and breaks that,\" she said.\n\"I'm just very excited, I can't wait to get started. I keep thinking about that moment I'll be sitting in the chair and the music starts, and I can't wait for it to happen.\"\nChapman said \"in many ways I'm not doing anything different to what I've done for the last 12 years\".\nBut he added: \"I am excited about the variety that is going to come from the new role.\n\"I just can't wait to be working with two friends, where we've grown up working together and we feel like a team. And to have some Sundays off.\"\nLogan - a rhythmic gymnast for Great Britain before going into broadcasting - described it as an \"iconic show\".\nShe added: \"One of the first things I did when I came to the BBC was fill in on Match of the Day and at that point when I was in that chair at the old BBC studio in London and hearing the music, it was a real hairs-on-the-back-of-the-neck moment.\n\"It's always a real moment [sitting in the chair] because it has such history and it's still so relevant to so many people now and talked about in a landscape where TV has changed so much.\n\"Everybody understands the history of the programme and the consistently huge audiences that watch it. It has more to offer as well - we know how strong the digital offering is and Match of the Day is really relevant to that audience too.\n\"There's an enormous responsibility to make sure we continue to evolve while at the same time respecting the traditions of Match of the Day.\"", "url": "https://www.bbc.com/sport/football/articles/ce9nzxe4m18o"}