{"authors": ["Steve Marshall", "www.facebook.com"], "date_download": "2025-04-26 06:14:47", "date_modify": "2025-04-26 06:14:47", "date_publish": "2025-03-01 23:51:53", "description": "Super League champions Wigan underline their credentials as serious title contenders again this season with an impressive win over Warrington in Las Vegas.", "filename": "sport_rugby-league_articles_cq5zg1j4w43o_1745648087.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/51d1/live/b861ef10-f6ee-11ef-ab2f-ad783c2da37c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-league_articles_cq5zg1j4w43o_1745648087.html", "title": "Super League: Wigan Warriors 48-24 Warrington Wolves", "title_page": "Super League: Wigan Warriors 48-24 Warrington Wolves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Super League champions Wigan underlined their credentials as serious title contenders again this season with an impressive win over Warrington in Las Vegas.\nA repeat of last season's Challenge Cup final provided plenty of points in the first Super League game to be played in the United States, although Wigan always looked in charge after taking the lead.\nTyler Dupree opened the scoring for Warriors after Warrington had an early Toby King effort ruled out.\nAbbas Miski scored a stunning second, before Bevan French and Harry Smith made it 24-0 at half-time.\nJai Field, Jake Wardle and Luke Thompson then put the result beyond doubt, before Arron Lindop, James Harrison and Matt Dufty replied for Warrington.\nLiam Marshall added a late eighth try for Wigan before Matty Ashton went the length of the field for the Wire to complete the scoring.\nWigan's victory lifted them to fourth place in the fledgling Super League table, above Warrington on points difference after inflicting the first defeat of the season on Sam Burgess' side.\nThe pace of the game was relentless from the first whistle in the dry conditions of the domed Allegiant Stadium, home to NFL side the Las Vegas Raiders.\nIt was Warrington who arguably started the brighter and thought they had taken the lead when King challenged Adam Keighran for a high kick, took the ball and touched down.\nIt was given on the field by referee Chris Kendall subject to review by video official Liam Moore, who ruled that as King had gone to ground before going over then the tackle was complete.\nMoments later at the other end, Marshall dropped the ball as he dived for the corner - but once Wigan did score then a flurry of points followed either side of half-time.\nFirst Dupree burst over as Josh Thewlis fumbled a high ball, before Miski acrobatically scored in the corner.\nHe was followed in by French, who showed great hands to collect a loose ball after Sam Walters spilled Junior Nsemba's offload.\nFrench then sent Smith in under the posts for Wigan's fourth try and, immediately after the break, Marshall offloaded for Field to race in.\nWardle walked in the Warriors' fifth try after fine work by French and Field, with French then playing the leading role in setting up Thompson to power over.\nAt 42-0 the game was effectively over, but Warrington did not give up and got on the scoreboard when Lindop grounded George Williams' kick.\nHarrison soon dotted down a second and Dufty crashed over for a third Wire try as four Wigan players tried to hold him up.\nWarriors immediately responded through Marshall, who raced away to dive in the corner, but it was Warrington who had the final say when Ashton intercepted French's pass and raced from near his own goal line to score.\nThewlis added the extras to complete a perfect night for both himself and Wigan's Keighran from the tee.\nWigan Warriors boss Matt Peet told BBC Sport:\n\"It was a huge week for us. We've had plenty of things to contend with and I'm very proud of the team and the performance.\n\"It brings the best out of us, these big weeks and this big stage. Some call it pressure but our lads quite enjoy it.\n\"It's been phenomenal but quite draining so now we can relax and enjoy it. It's pressure but a privilege and I'm really proud of how the team and club have handled themselves.\"\nWigan captain Liam Farrell told BBC Radio 5 Sports Extra:\n\"It's been a great day, a great week and what a way to top it off by getting such a great win.\n\"You can't believe what the week's been like - it's been crazy, but it's a great end. It's disappointing we conceded a few points at the end but overall we have done the club and Super League proud.\n\"The game was quite energy-sapping early on and we knew that once we got on top we would cause a lot of problems and at 20-30 minutes we really put Warrington to the sword and it put us in a position where we had pretty much won the game by half-time.\"", "url": "https://www.bbc.co.uk/sport/rugby-league/articles/cq5zg1j4w43o"}