{"authors": ["Bobbie Jackson", "www.facebook.com"], "date_download": "2025-05-21 04:32:32", "date_modify": "2025-05-21 04:32:32", "date_publish": "2025-04-05 06:28:08", "description": "Luka Doncic and LeBron James help the Los Angeles Lakers to a comfortable victory against the New Orleans Pelicans.", "filename": "sport_basketball_articles_cj459k1wjxjo_1747801952.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/cc04/live/ac0a3b20-11e5-11f0-8bc5-bd5fcf24634f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_basketball_articles_cj459k1wjxjo_1747801952.html", "title": "NBA: Luka Doncic and LeBron James star as Los Angeles Lakers beat New Orleans Pelicans", "title_page": "NBA: Luka Doncic and LeBron James star as Los Angeles Lakers beat New Orleans Pelicans - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Luka Doncic and LeBron James helped the Los Angeles Lakers to a comfortable victory against the New Orleans Pelicans.\nDoncic put on a game-high 35 points with team-mate Austin Reaves adding 30, while James scored 27 points with eight assists in a 124-108 win.\nThe Lakers bounced back from defeat against the Golden State Warriors to further boost their hopes of a top-four finish in the Western Conference.\nIt is the sixth successive win for the Lakers over the Pelicans, including three victories this season.\nElsewhere, Western Conference leaders the Oklahoma City Thunder, who host the Lakers in back-to-back games on Sunday and Tuesday, saw an 11-game winning streak ended against the Houston Rockets.\nJalen Green and Alperen Sengun combined for 65 points to triumph 125-111 in Houston.\nThe Boston Celtics set a new record for the number of three-pointers scored in a single season during their 123-103 win over the Phoenix Suns.\nBoston, the defending NBA champions, scored 14 at TD Garden to take their overall tally to 1,370, eclipsing the previous record of 1,363 set by the Golden State Warriors in 2022-23.", "url": "https://www.bbc.com/sport/basketball/articles/cj459k1wjxjo"}