{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:29:31", "date_modify": "2025-05-20 13:29:31", "date_publish": "2023-08-02 05:18:44", "description": "Former Chelsea, Everton and Scotland winger Pat Nevin invites you to subscribe to BBC Sport's new Football Extra newsletter", "filename": "sport_football_66291022_1747747771.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5845/production/_130579522_dafeca42-25e1-475d-bf2e-843444539aa4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66291022_1747747771.html", "title": "Premier League: Sign up to BBC Sport's Football Extra newsletter", "title_page": "Premier League: Sign up to BBC Sport's Football Extra newsletter - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hi, I'm Pat Nevin and I'm delighted to introduce you to Football Extra - a BBC newsletter that will keep you on top of all the latest news, insights and gossip from the English Premier League.\nI'm a former footballer who played for Scotland, Chelsea and Everton among others. I was also chairman of the Professional Footballers' Association in England and chief executive of Scottish Premier League club Motherwell. Since then, over the past 25 years, I've worked mostly as an analyst.\nI still love the highs and lows of the beautiful game, never having lost that passion for a moment.\nFootball Extra will arrive in your inbox every weekday at 1900gmt.\nOn Mondays, I'll send you my biggest takeaways from the weekend action in the English Premier League. Throughout the rest of the week you'll receive essential reading from my colleagues Jon Barbuti and George Mills, with exclusive interviews, in-depth analysis and community discussions about the hot topics of the day.\nAlready this season we've examined the strange life of a backup goalkeeper, external, reacted to Everton's historic 10-point deduction, external, analysed one of the wildest games in Premier League history, external - and even spoken to Premier League cult hero Paulo Wanchope, external.\nI am enjoying sharing my thoughts on the Premier League with you - and please get in touch with my BBC Sport colleagues if you have any comments on our newsletter. I hope you enjoy it!", "url": "https://www.bbc.com/sport/football/66291022"}