{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:42:40", "date_modify": "2025-05-21 07:42:40", "date_publish": "2025-05-20 13:41:17", "description": "Veteran Doncaster Rovers striker Billy Sharp signs a new one-year deal.", "filename": "sport_football_articles_cx2qq83dxzqo_1747813360.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f3eb/live/e0364d30-357b-11f0-8a3d-319afdf0f64c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cx2qq83dxzqo_1747813360.html", "title": "Billy Sharp: Doncaster Rovers striker signs new one-year contract", "title_page": "Billy Sharp: Doncaster Rovers striker signs new one-year contract - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Doncaster Rovers striker Billy Sharp has signed a new one-year deal with the newly promoted club.\nThe 39-year-old joined Doncaster for a fourth spell last summer and scored nine goals in 43 league appearances as the South Yorkshire side won the League Two title.\nThe new contract will allow Sharp to keep playing beyond his 40th birthday, which falls in February.\n\"I thoroughly enjoyed this season, getting promoted, winning the league - it all fell into place nicely,\" Sharp told the club website., external\n\"I feel wanted here. It's a great dressing room and we're playing a league higher and everyone wants to play as high as they can.\n\"To be able to still be playing League One football at the age of 40 will be a big achievement as well for me.\"\nNo player has scored more than Sharp's 258 league goals in the top four tiers of English football since he made his debut for Sheffield United in November 2004.\nHe went on to have two further spells with the Blades and twice helped them win promotion to the Premier League.\nSharp, who has won six promotions across his career, has also had spells with Rushden & Diamonds, Scunthorpe United, Southampton, Nottingham Forest, Reading, Leeds United, LA Galaxy and Hull City.", "url": "https://www.bbc.com/sport/football/articles/cx2qq83dxzqo"}