{"authors": ["Jess Anderson", "www.facebook.com"], "date_download": "2025-05-20 13:18:30", "date_modify": "2025-05-20 13:18:30", "date_publish": "2023-08-02 11:45:06", "description": "England face world number ones Australia in their final Netball World Cup pool match - but what do they need to do to beat the Diamonds?", "filename": "sport_netball_66375909_1747747110.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8661/production/_130610443_gettyimages-1244347147.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_netball_66375909_1747747110.html", "title": "Netball World Cup 2023: How do England beat Australia in final Pool F match?", "title_page": "Netball World Cup 2023: How do England beat Australia in final Pool F match? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "When England pipped Australia to gold by one goal at the 2018 Commonwealth Games, it confirmed they were finally serious contenders on the world stage.\nFive years on, Australia still represent England's biggest challenge.\nBoth sides have a perfect record at this year's Netball World Cup in South Africa but that will be put to the test when they face off in their Pool F match on Thursday, which starts at 08:00 BST.\nThe result will determine their opponents in Saturday's semi-finals.\nThe Diamonds have long been the dominant force in world netball, with current world champions New Zealand the only nation who have truly challenged them.\nSo what will it take for England to beat Australia?\nAustralia have four Commonwealth gold medals and 11 world titles, having won six of the past eight World Cups.\nThey are seamless across court and able to make substitutions without a drop in team performance, thanks in large part to playing with and against each other in their domestic Super Netball league.\nAfter New Zealand won the 2019 World Cup, Australia found themselves in the unfamiliar position of holding neither the Commonwealth nor world titles.\nBut, having reclaimed Commonwealth gold in Birmingham last year, their motto at this World Cup has been about taking care of unfinished business.\nThey have also dominated England since the 2018 Commonwealth final on the Gold Coast - the Roses have won just one of their nine encounters in the five years since, losing seven and drawing one.\nEngland have lamented their slow starts at this World Cup, coupled with the highest error count of any of the top four sides.\nHowever, they improved in their 89-28 victory over Fiji on Tuesday, with head coach Jess Thirlby describing a \"quiet confidence\" in the group.\nMuch of the talk around England is focused on them building and improving. but they will need to be at their best to challenge the Diamonds.\nFormer England captain Ama Agbeze, who led the side to Commonwealth glory, has highlighted three key areas for the Roses - consistency, a clear gameplan and belief.\n\"Australia are a team that gel as a unit really quickly. You have to try and break those connections that just come so naturally to them,\" Agbeze told BBC Sport.\n\"Having a good gameplan is essential, but also sticking to it. England need to highlight some key players to target and try and create that disconnect.\n\"Consistently doing the basics - you don't have to do them brilliantly but do them well, all the time.\"\nAustralia have not had it all their own way in recent years, which is testament to the improvement made by sides like England and Commonwealth silver medallists Jamaica.\nBut, while Agbeze says the Diamonds \"won't take England lightly\", when it comes to the big moments, Australia have years of experience to build on.\n\"Belief is probably more important than the stuff on court. If you think you can beat them and get on top of them that is huge,\" Agbeze added.\n\"They seem to be having fun off court, which is great, but doesn't necessarily transfer onto court if you don't have that confidence and belief.\"", "url": "https://www.bbc.com/sport/netball/66375909"}