{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:26:51", "date_modify": "2025-05-21 04:26:51", "date_publish": "2025-04-05 21:12:39", "description": "Bayer Leverkusen attacking midfielder Florian Wirtz is wanted by Manchester City, Crystal Palace striker Jean-Philippe Mateta is the subject of a transfer battle, Aston Villa get a boost in their pursuit of Chelsea's Noni Madueke, plus more.", "filename": "sport_football_articles_c4g3pe74pp3o_1747801611.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31ed/live/41a73450-1261-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g3pe74pp3o_1747801611.html", "title": "Football gossip: Wirtz, Mateta, Madueke, Gyokeres, Araujo, Diaz, Rogers, Garnacho", "title_page": "Football gossip: Wirtz, Mateta, Madueke, Gyokeres, Araujo, Diaz, Rogers, Garnacho - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayer Leverkusen attacking midfielder Florian Wirtz is wanted by Manchester City, Crystal Palace striker Jean-Philippe Mateta is the subject of a transfer battle, while Aston Villa get a boost in their pursuit of Chelsea's Noni Madueke\nManchester City have identified Bayer Leverkusen and Germany attacking midfielder Florian Wirtz, 21, as the ideal replacement for departing 33-year-old Belgium midfielder Kevin de Bruyne. (Fabrizio Romano), external\nManchester City are willing to spend £100m to sign Wirtz, but face competition from Bayern Munich for his signature. (Sunday Mirror), external\nManchester United, Nottingham Forest, Juventus, and Bayern Munich are all keen on signing 27-year-old French striker Jean-Philippe Mateta from Crystal Palace this summer. (Teamtalk), external\nLeicester are considering the possibility of appointing former Southampton manager Russell Martin if they sack Ruud van Nistelrooy. (Sun), external\nAston Villa have been given encouragement by Chelsea over a deal to sign 23-year-old England winger Noni Madueke, with the player unhappy about his lack of game time at Stamford Bridge. (Football Insider), external\nFulham and United States left-back Antonee Robinson, 27, leads Liverpool's three-man shortlist for the position before of the summer window. (Mirror), external\nThe agent of Sporting striker Viktor Gyokeres will be at Arsenal's Champions League tie with Real Madrid, fuelling rumours the 26-year-old Sweden forward is poised to join the Gunners. (Football Transfers), external\nLiverpool and Manchester City are monitoring the contract situation of Barcelona forward Lamine Yamal but the 17-year-old Spain international looks set to remain with the Catalan club. (Mundo Deportivo - in Spanish), external\nBarcelona would consider a swap deal involving Uruguay centre-back Ronald Araujo, 26, and Liverpool's 28-year-old Colombia winger Luis Diaz. (Relevo - in Spanish), external\nArsenal have been tipped to make five big signings this summer now new director of football Andrea Berta is at the helm. (Guillem Balague via TNT Sports), external\nManchester City hope to sign Aston Villa winger Morgan Rogers, 22, with Pep Guardiola a huge admirer of the England international, who was previously in City's academy. (Teamtalk), external\nAston Villa are considering selling their Women's Super League (WSL) side because of concerns they might breach the Premier League's profit and sustainability rules (PSR). (Times - subscription required), external", "url": "https://www.bbc.com/sport/football/articles/c4g3pe74pp3o"}