{"authors": ["Ged Scott", "www.facebook.com"], "date_download": "2025-05-20 12:22:21", "date_modify": "2025-05-20 12:22:21", "date_publish": "2023-08-04 14:08:33", "description": "West Bromwich Albion fans promise that any protests will be legal and peaceful - and that they will be right behind the team.", "filename": "sport_football_66407265_1747743741.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5796/production/_129422422_bagfans.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66407265_1747743741.html", "title": "West Bromwich Albion: Baggies fans protests will be kept 'legal and peaceful'", "title_page": "West Bromwich Albion: Baggies fans protests will be kept 'legal and peaceful' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "West Bromwich Albion fans have made a promise that any protests will be kept legal and peaceful - and that they will be right behind head coach Carlos Corberan and his Championship side.\nBaggies supporters protested regularly for most of the 2022-23 season at the way the club has been run.\nBut fans group Action For Albion have now written to Corberan vowing to \"support the team, not the owners\".\nThe Baggies, ninth last season, kick off the new campaign at Blackburn.\nSaturday's opening fixture is then followed by an EFL Cup trip to Stoke, before they host their first home game against Swansea on Saturday, 12 August.\nBut the fans have promised to stay supportive, while remaining concerned about the financial management of the club under owner Guochuan Lai, who is still to repay a £5m debt, from a loan taken out by one of his other companies during the coronavirus pandemic.\nAction for Albion have written an open letter to Spaniard Corberan, which has also been translated into Spanish, assuring them of their support.\n\"We felt that just before the season kicks off, we wanted Carlos and his players to know that the main reason we're here is to support our club and the players that wear the famous blue and white stripes,\" said Action For Albion spokesperson Ali Jones.\n\"Carlos brought a lot of hope back to us as a fanbase last season and we wanted to thank him for that.\n\"I can't speak for every fan but I would like to think we represent the view of the majority of Albion supporters when we say that we appreciate everything he is doing for the club.\n\"As a group, whatever we do through the season it'll be legal and peaceful, but most importantly it'll never be designed to be detrimental to the team and what they are trying to achieve on the pitch.\"\nThe Baggies have made just two signings this summer, on-loan Brighton winger Jeremy Sarmiento and striker Josh Maja.\nBut Corberan, who must spend the first half of the season without injured main targetman Daryl Dike, says that Maja needs a further week of training before he is considered for selection.\nAnd, although both Sarmiento, fit-again midfielder Jayson Molumby and the returning Alex Mowatt, back from a season's loan at Middlesbrough, are fit to start at Ewood Park, he admits his squad still need further bolstering, as first outlined by manging director Mark Miles a month ago.\n\"We still have things to do in the squad,\" Corberan told BBC Radio WM.\n\"The market is still open for a month and we must still improve the squad.\n\"It's important for me to add some numbers to be a competitive team.\"\nAnalysis - Rob Gurney, BBC Radio WM\nFor the first time in two decades, Albion are going into a season without any Premier League money, which has meant a recalibration of expectations from those inside and outside the club.\nAt the time of writing, no firm investment to tempt the vilified majority shareholder Guochuan Lai to sell has been forthcoming, but an admission from managing director Mark Miles that Lai is at least considering cutting his ties, is progress of sorts.\nOff the field, Miles has taken over some of the responsibilities of the departed CEO Ron Gourlay, and his relationship with Carlos Corberan will be key moving forward.\nIn the same interview where he revealed Lai's potential intentions, Miles told me earlier in the close season that the Baggies would be largely dealing in the free transfer/loan market, due to their financial position, and for that reason, they've done well to retain Corberan's services.\nClearly, the Spaniard performed a minor miracle to get Albion as close to the play-offs as he did last season, having been bottom in October, and the reliance on the players buying into him and his methods, while adopting an against-the-odds, siege mentality within the club, will be crucial to their chances of flirting with the top six again this time.\nKeeping first-choice goalkeeper Alex Palmer has been Corberan's first \"win\" of the transfer window, with former Sunderland striker Josh Maja and Ecuador forward Jeremy Sarmiento encouraging signs so far that, at the very least, a campaign of struggle will be avoided, although the loss of key defender Dara O'Shea to Burnley will be a void that needs filling.", "url": "https://www.bbc.com/sport/football/66407265"}