{"authors": ["Marissa Thomas & Emily Salley", "www.facebook.com"], "date_download": "2025-05-20 12:41:27", "date_modify": "2025-05-20 12:41:27", "date_publish": "2023-08-03 16:17:20", "description": "The Women's World Cup is throwing up more shocks and surprises than ever before, as big names go out and underdogs progress.", "filename": "sport_football_66398116_1747744887.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/224E/production/_130628780_gettyimages-1589243696.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66398116_1747744887.html", "title": "A World Cup of shocks: Germany & Brazil out; Jamaica, Morocco & South Africa progress", "title_page": "A World Cup of shocks: Germany & Brazil out; Jamaica, Morocco & South Africa progress - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It has been a World Cup of shocks and surprises.\nThree of the top 10 teams from the Fifa world rankings are out in the group stages while the width of a post stopped defending champions the USA from suffering the same fate.\nGermany, ranked second, have failed to progress past the group stages for the first time in their ninth appearance at the tournament.\nCanada and Brazil, ranked seventh and eighth respectively, have also had their World Cup journeys cut short. Milena Bertolini's Italy were another big side to fall at the first hurdle, losing multiple group-stage games for the first time.\nWhile some of the big hitters and tournament favourites are heading home, Colombia, South Africa, Jamaica, Morocco and Nigeria are taking their places.\n\"Development is fast in women's football at the moment,\" said Arsenal manager Jonas Eidevall.\n\"There's no standing still. We see that with USA, we see that with Germany, we saw that with Brazil as well.\n\"Other nations are moving fast here now.\"\nGermany, Canada, Brazil and Italy are all out in the group stages - something that would have been unthinkable before the tournament began.\nTwo-time World Cup winners Germany started the tournament in style by thrashing Morocco 6-0 and were tipped by many to win it again after that display.\nThey were brought crashing back down to earth after suffering a shock 2-1 defeat at the hands of Colombia and their position in the tournament was under threat.\nGermany's final group opponents were South Korea. Cho So-hyun opened the scoring for South Korea after six minutes and, while captain Alexandra Popp equalised for the Germans, the draw was not enough and Morocco went through at their expense.\nAfter reaching the European Championships final last year, Germany were expected to go deep in this tournament and potentially challenge the USA for a third World Cup title. Despite Popp's best efforts, Martina Voss-Tecklenburg's side are heading home.\nAfter reaching the last 16 of the World Cup in 2019, Canada became Olympic champions two years later.\nHowever, they were drawn in the so-called 'group of death' and duly failed to survive. Group B contained Australia, Nigeria and Republic of Ireland with most predicting co-hosts Australia and Canada would progress. Bev Priestman's side followed up a goalless draw against Nigeria with a win against Republic of Ireland.\nGoing into the last group game, Canada had to beat Australia to advance but lost 4-0 after being thoroughly dismantled by the co-hosts and suffered their first group-stage exit since 2011.\nThe team are one of several at the World Cup who have been unsettled by disputes with their federation over budget cuts and a lack of competitive warm-up matches prior to the tournament.\nMarta's last World Cup ended in huge disappointment as Brazil failed to reach the last-16 stage.\nThey had progressed from the group stages six times in a row and were being tipped as an outside bet to win the tournament.\nBrazil won their first game 4-0 against Panama with typical South American flair but Pia Sundhage's team were unable to replicate that in the next two games.\nThey lost 2-1 to France and then endured a goalless draw with Jamaica when just one goal would have been enough to see them through.\nIn 2019, Italy returned to the World Cup after a 20-year absence and made the knockout stages.\nThis time around, Bertolini controversially left former captain Sara Gama out of her squad and star forward Cristiana Girelli didn't start any of the group matches, despite scoring the only goal in Italy's opening game against Argentina.\nA 5-0 thrashing at the hands of Sweden left Italy in a perilous position going into their final game with at least a draw needed against South Africa to secure their passage to the next phase.\nRanked 16th, they were knocked out by South Africa who are outside the top 50 in the world rankings (54th).\nBanyana Banyana beat them 3-2 with Thembi Kgatlana's stoppage-time winner sealing their passage through to the last 16 at Italy's expense.\nColombia manager Nelson Abadia said: \"We are facing a rival which qualified from a very strong group, eliminated Brazil. But we also had a strong group and we are getting stronger.\n\"They are physical, good on counter and that is why they are in same position we are.\"\nMeanwhile, Sarina Wiegman's Lionesses will be up against underdogs Nigeria, ranked 40th in the world, in their last-16 tie on Monday.\nThe Super Falcons had a turbulent build-up to the tournament, with Nigerian media reporting the team were considering boycotting matches over pay and conditions.\nHowever, they surpassed expectations in an extremely difficult Group B, beating co-hosts Australia and holding Olympic champions Canada to a draw to qualify for the last 16 for a second consecutive World Cup.", "url": "https://www.bbc.com/sport/football/66398116"}