{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:48:42", "date_modify": "2025-04-26 06:48:42", "date_publish": "2025-03-01 11:01:24", "description": "Bournemouth vs Wolves predictions: Chris Sutton on FA Cup game", "filename": "sport_football_articles_czjeevxpgr0o_1745650122.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/561d/live/fbee38e0-d1d4-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_czjeevxpgr0o_1745650122.html", "title": "Bournemouth vs Wolves predictions: Chris Sutton on FA Cup game", "title_page": "Bournemouth vs Wolves predictions: Chris Sutton on FA Cup game - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Wolves won here in the Premier League on Saturday but only after Bournemouth had Illia Zabarnyi sent off in the first half. That completely skewed that result so I am not using it as a form guide for this tie.\nWhat will be more relevant is how many changes both teams make for this game.\nI was at Wolves' win over Blackburn in round four and their manager Vitor Pereira went kind of half-strong there. I can guarantee you he will be prioritising Premier League survival ahead of FA Cup progress, so we will probably see another mix-and-match selection from him.\nAs for Bournemouth, well I have already talked about why Crystal Palace should be trying to win the FA Cup this season, and the same definitely applies to Andoni Iraola's side.\nThe Cherries have only reached the quarter-finals twice before, losing at that stage in 1957 and 2021, and their best moments in the competition are probably as a lower-league giantkiller, such as when they beat Manchester United as a third-tier team in 1984.\nThis year, they are genuine contenders to win it and lift the club's first major trophy, and they have already shown they can beat anyone - especially at home.\nThey are still seventh in the Premier League despite losing their past two matches, and I would be really disappointed - no, actually I'd be angry - if Iraola picks a weakened team in the situation they are in.\nHe has got a responsibility to the fans to try to reach the semi-finals for the first time. Yes they have got a chance of making the Champions League, which would be incredible, but they are only two wins away from their biggest day out ever at Wembley. Why not go for it?\nSutton's prediction: 2-1\nListen to live commentary on BBC Radio 5 Live.", "url": "https://www.bbc.co.uk/sport/football/articles/czjeevxpgr0o"}