{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:31:44", "date_modify": "2025-05-21 07:31:44", "date_publish": "2025-01-13 14:52:49", "description": "Warwickshire sign new Australia all-rounder Beau Webster for three months of the 2025 county season.", "filename": "sport_cricket_articles_c0qwd0n90kvo_1747812704.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8e07/live/5f7ba410-d1bc-11ef-8a2a-b1f18b093115.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_cricket_articles_c0qwd0n90kvo_1747812704.html", "title": "Beau Webster: Warwickshire sign Australia all-rounder on three-month deal", "title_page": "Beau Webster: Warwickshire sign Australia all-rounder on three-month deal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warwickshire have signed Australia all-rounder Beau Webster for three months of the 2025 county season.\nThe 31-year-old Tasmanian will arrive at the beginning of May and stay at Edgbaston until the end of July, playing in the County Championship and T20 Blast.\nWebster had a spell with Gloucestershire last summer and made his Test debut in Sydney earlier this month, hitting the winning boundary as Australia beat India by six wickets.\n\"Having played Birmingham League Cricket in the past, I have great memories of the people and the area,\" he said.\nHe has scored more than 5,000 first-class runs at an average of 38.24 and taken 149 wickets and was Player of the Season in the 2023-24 Sheffield Shield.\nWebster made 13 T20 Blast appearances to help Gloucestershire reach Finals Day at Edgbaston in 2024, although he was not available as they lifted the trophy following an eight-wicket victory over neighbours Somerset.\n\"We're delighted Beau has chosen to become a Bear. Since we first approached him he has made his international debut which shows how highly regarded he is thought of by Australia's selectors,\" said Warwickshire first-team coach Mark Robinson.\n\"As an all-rounder he will give us great balance in both the Championship and Blast.\"\nThe Bears start the new season on 4 April with a home Championship game against promoted Sussex.", "url": "https://www.bbc.com/sport/cricket/articles/c0qwd0n90kvo"}