{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:33:52", "date_modify": "2025-05-21 05:33:52", "date_publish": "2025-04-02 15:55:54", "description": "Southampton news: Aaron Ramsdale on his season so far", "filename": "sport_football_articles_c70z4keg9l3o_1747805632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/94b6/live/c0360150-0fd9-11f0-94e9-65dc0da473ff.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70z4keg9l3o_1747805632.html", "title": "Southampton news: Aaron Ramsdale on his season so far", "title_page": "Southampton news: Aaron Ramsdale on his season so far  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Southampton goalkeeper Aaron Ramsdale has spoken to BBC Radio Solent about his season so far: \"I knew when I was coming it was going to be tough. I signed for a number of reasons - the old manager, the area, and the main important one - to play football in the Premier League and get back into the England squad.\n\"This season was all about playing. There wasn't a plethora of clubs at the time to have my pick from, my main goal was to play week in, week out here. I haven't been able to do that because of injuries for the first time in my career.\n\"I have learned things this season - I know how to help people and help myself. I think when people see you start young and you get to some heights, everyone expects you to stay there - but things move on.\n\"I might find that one club where I stay for 10-12 years, I might have to dot around again, or I might have to knuckle down and go abroad.\n\"I'm 26 and I've played nearly 200 Premier League games. I'm really proud of myself but there's not where I want to end up.\"\nAsked about his record of being relegated with teams - having suffered the experience already with Bournemouth in 2019-20 and the following season with Sheffield United - Ramsdale said: \"\"This relegation thing which gets thrown at me I'm more than happy with,\n\"The first two - the Covid season and the second-season syndrome at Sheffield United - that doesn't affect me.\"", "url": "https://www.bbc.com/sport/football/articles/c70z4keg9l3o"}