{"authors": ["Emma Smith", "www.facebook.com"], "date_download": "2025-05-20 14:18:59", "date_modify": "2025-05-20 14:18:59", "date_publish": "2023-07-30 05:00:09", "description": "Manuela Vanegas scores a 97th-minute winner as Colombia stun Germany 2-1 at the 2023 Fifa Women's World Cup.", "filename": "sport_football_66352255_1747750739.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/D276/production/_130587835_van.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66352255_1747750739.html", "title": "Germany 1-2 Colombia: Linda Caicedo wondergoal and 97th-minute winner stun former champions", "title_page": "Germany 1-2 Colombia: Linda Caicedo wondergoal and 97th-minute winner stun former champions - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manuela Vanegas scored a 97th-minute winner as Colombia stunned Germany at the 2023 Fifa Women's World Cup.\nLinda Caicedo netted a wondergoal to give the South Americans the lead, before Germany equalised with an 89th-minute Alexandra Popp penalty.\nVanegas then headed Leicy Santos' corner past Merle Frohms to send the vast numbers of Colombia supporters at Sydney Football Stadium wild.\nIt condemned Germany to a first World Cup group stage defeat since 1995.\nA manic ending came after Caicedo, 18, had brilliantly curled into the top corner on 53 minutes to shock the two-time world champions.\nThe final round of fixtures in this group kick off at 11.00 BST on 3 August, with Colombia taking on Morocco and Germany facing South Korea.\nColombia need a point to top the group, while Germany may need victory to be sure of reaching the knock-outs.\n\"Obviously, you need to be happy and euphoric because this is a great win for the whole country and we've been feeling this,\" said Colombia assistant coach Angelo Marsiglia.\n\"But look, the game and the tournament still continues so we'll go step by step. We have a very mature team and they know what they want.\"\nGermany's Lina Magull said before this game that they were ready for Colombia's \"passion\" and physicality - but they got far more than they bargained for.\nFacing the two-time world champions, Colombia made the game a real battle with plenty of midfield scraps and tough challenges, with Germany rarely able to find any form of rhythm.\nAfter going behind to Caicedo's moment of magic, Germany appeared to have got away with a point when Colombia keeper Catalina Perez fouled Lena Oberdorf and captain Popp tucked away the penalty.\nColombia however had other ideas, and it was the unlikely figure of full-back Vanegas who sent their supporters into ecstasy.\nHuge numbers of Colombia fans were present at their opening win over South Korea at the same stadium, and they made themselves known again in numbers and noise here. At the final whistle, it seemed Sydney had been transformed into Bogota.\nAged 18 at the 1998 World Cup, England striker Owen streaked through the Argentina defence to score a remarkable individual goal.\nIn 2023, Caicedo twisted and turned to somehow find a yard of space among a crowd of Germany players, before curling the ball unstoppably over keeper Frohms.\nIf the football world did not know the name Linda Caicedo before, they surely do now. And if the football world was not paying attention to Colombia, they surely are now.", "url": "https://www.bbc.com/sport/football/66352255"}