{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:01:38", "date_modify": "2025-05-21 06:01:38", "date_publish": "2025-04-01 22:21:22", "description": "Nottingham Forest 1-0 Man Utd: 'I believe I'm one of the fastest players in the league' - Elanga", "filename": "sport_football_articles_cjdx5v4xvl2o_1747807298.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/79e5/live/77543f70-0f47-11f0-ba12-8d27eb561761.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjdx5v4xvl2o_1747807298.html", "title": "'I believe I'm one of the fastest players in the league' - Elanga", "title_page": "Nottingham Forest 1-0 Man Utd: 'I believe I'm one of the fastest players in the league' - Elanga - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest goalscorer Anthony Elanga, speaking to TNT Sports: \"It is about attacking the space and getting to the opposite goal as quick as I can. I saw the space and I believe I'm one of the fastest players in the league.\n\"The finish is something I have been trying to work on. Left foot or right foot, I am quite comfortable with both feet this season.\n\"All you want to do is keep on improving, coming here is about playing and developing. I appreciate Manchester United so much as I learned a lot there. I am enjoying my football and I want to keep on going.\n\"We have one of the lowest possession in the league, but it has been effective and it is something we have worked on since pre-season. Murillo's block means more than a goal, seeing it on the bench I was like 'wow'.\nOn Forest's team spirit: \"It started in pre-season, the manager came in December last season and when he came we struggled.\n\"He got his ideas across [during pre-season] and we have been able to play different systems. Every player can play any position. That togetherness is important and it says it on the pitch.\"", "url": "https://www.bbc.com/sport/football/articles/cjdx5v4xvl2o"}