{"authors": ["Gabby Logan", "www.facebook.com"], "date_download": "2025-05-21 07:47:12", "date_modify": "2025-05-21 07:47:12", "date_publish": "2025-05-18 21:22:27", "description": "Women’s sport is set to take centre stage with a stellar line-up of major sporting events this summer.", "filename": "sport_tennis_articles_cg4vz70llpzo_1747813632.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/54d8/live/d0c25710-3484-11f0-8519-3b5a01ebe413.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_cg4vz70llpzo_1747813632.html", "title": "Gabby Logan: Will the Red Roses have their Lionesses moment as women's sport takes centre stage this summer?", "title_page": "Gabby Logan: Will the Red Roses have their Lionesses moment as women's sport takes centre stage this summer? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "I was walking my dog recently near some local football pitches and I could hear girls playing a match. When I first moved here 12 years ago that certainly wasn't the case.\nIn a relatively short period of time, that change has come. Those young girls stand on the shoulders of so many incredible women who fought for the right to play football.\nI have worked for the BBC since 2007 and it has had a massive impact in growing women's sport over the past 20 years.\nIn 2019, I felt we had a game-changing summer.\nA lot of women's sport was on the BBC, including the Fifa Women's World Cup. More than 11 million people watched England v USA in the semi-final, which was a record at the time - until Euro 2022 that is. That was a huge audience and it felt like a big shift in people recognising the stars of that tournament.\nFast forward to 2022 and it was when I was heading to Wembley to present the Euro final between England and Germany, I had this moment of realisation of how huge it would be if the Lionesses could win a major tournament.\nI know that seems ridiculous as that is what the aim always is. But having covered men's and women's tournaments for a long time, it had never happened and it really felt as though the Lionesses were on the precipice of something massive.\nSo I opened my laptop and started bashing out some words I hoped I might be able to deliver at the end of the programme, depending on whether or not England had won. If they hadn't, I'd just shut the laptop and I'd never see those words again.\nLuckily, Chloe Kelly made sure I could say them: \"Is this a game-changing moment? Well, the record audiences on TV and crowds in the stadiums have been fantastic, brilliant. But to really move the sport on, we need you. If you've enjoyed it, get yourself along to a WSL [Women's Super League] game this season, even if you only go to one or two.\n\"The Lionesses have brought football home. Now it's down to the rest of us to make sure it stays here. You think it's all over? It's only just begun.\"\nThey came from a place of wanting people to really galvanise the spirit and actually put into action a lot of the words we'd been talking about.", "url": "https://www.bbc.com/sport/tennis/articles/cg4vz70llpzo"}