{"authors": ["Clive Lindsay", "www.facebook.com"], "date_download": "2025-05-21 05:50:49", "date_modify": "2025-05-21 05:50:49", "date_publish": "2025-01-31 15:57:44", "description": "Manager in spotlight: St Johnstone's Simo Valakari", "filename": "sport_articles_cre8314wgz7o_1747806649.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e241/live/d8c36f50-dfeb-11ef-a319-fb4e7360c4ec.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cre8314wgz7o_1747806649.html", "title": "Manager in spotlight: St Johnstone's Simo Valakari", "title_page": "Manager in spotlight: St Johnstone's Simo Valakari - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Two days after losing to St Johnstone, their second defeat in Perth within seven days and third consecutive loss, Motherwell were to lose their manager.\nStuart Kettlewell cited as the reason for his resignation the fan abuse he was receiving despite his side sitting fifth in the table - four places better off than at the same stage last season.\nContrast that with Saints counterpart Simo Valakari.\nSt Johnstone owner Adam Webb admitted this week that, despite Saturday's win, the seven-point gap between themselves and second-bottom Kilmarnock means he has to make contingency plans for possible relegation.\nHowever, he doubled down on the summer appointment of Valakari, even saying \"I can't be happier with Simo\".\nWebb is also backing his manager in the transfer market, with two new arrivals this week and centre-half Jack Sanders, sold to MK Dons, being the latest to exit as the Finn reshapes his squad.\nThat should take some of the pressure off, but the American businessman also stressed that he and Valakari have not given up hope of avoiding relegation and that those two victories over Well - first in the Scottish Cup and then the league - prove \"he's doing the right things to get us to the right place\" despite previous results.\nThey will be hoping those wins mean they have turned the corner after the previous nine games without a victory as they head to Paisley on Saturday.\nHowever, hosts St Mirren also appear to be on the up after ending a four-game losing streak by scoring three times in each of two away victories.\nIndeed, the Perth side, who currently have not won in six away games, losing five of them, have not won in Paisley in 10 visits since December 2018.\nOvercoming their rivals Saints would be further proof of their potential resurrection under Valakari.", "url": "https://www.bbc.com/sport/articles/cre8314wgz7o"}