{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:04:46", "date_modify": "2025-04-26 08:04:46", "date_publish": "2025-02-26 15:33:39", "description": "London Scottish scrum-half Jonny Law joins Harlequins on a short-term loan as injury cover in the position.", "filename": "sport_rugby-union_articles_c2013l3zv0jo_1745654686.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d2e0/live/137af470-f454-11ef-9d52-1b1b29dc5f7f.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c2013l3zv0jo_1745654686.html", "title": "Jonny Law: Harlequins sign London Scottish scrum-half on short-term loan", "title_page": "Jonny Law: Harlequins sign London Scottish scrum-half on short-term loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "London Scottish scrum-half Jonny Law has joined Harlequins on a short-term loan as injury cover in the position.\nQuins are currently without Danny Care, Lewis Gjaltema and Lucas Friday as they prepare for the Premiership Rugby Cup knockout stage.\nLaw, 24, will join up with the squad, which includes fit scrum-halves Will Porter and Jake Murray, immediately.\nHe was called up to play for Harlequins in a friendly against Connacht last week.\n\"It's vital we have depth in an important position heading into the knockout stages of the Premiership Cup and as we build towards the return of the Gallagher Premiership,\" Harlequins head coach Danny Wilson told the club's website., external\n\"Jonny has performed consistently for London Scottish, and he's excited for the opportunity to represent Harlequins.\"\nLaw began his career at Leicester Tigers, where he made five Premiership Rugby Cup appearances, before spending a season with the Jersey Reds.\nHe has made 35 appearances for Championship side Scottish.\nQuins visit Bath in the Premiership Rugby Cup quarter-finals on Friday.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c2013l3zv0jo"}