{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 04:16:34", "date_modify": "2025-05-21 04:16:34", "date_publish": "2025-02-01 12:00:25", "description": "Manchester United sign England Under-19s defender Ayden Heaven from Arsenal on a four-and-a-half-year contract.", "filename": "sport_football_articles_c05l0pryyyzo_1747800994.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1713/live/a342d2c0-e091-11ef-b5a3-1f3f58db284c.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c05l0pryyyzo_1747800994.html", "title": "Manchester United sign teenage defender Ayden Heaven from Arsenal", "title_page": "Manchester United sign teenage defender Ayden Heaven from Arsenal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United have signed England Under-19s defender Ayden Heaven from Arsenal on a four-and-a-half-year contract.\nThe Red Devils say the 18-year-old, who cost an undisclosed compensation fee, will immediately link up with the first-team squad.\nThe teenager joined Arsenal as a 13-year-old in 2019 and made his senior debut as a substitute in an EFL Cup win at Preston in October.\n\"I am incredibly proud to join Manchester United. I'm grateful to everyone who helped make this dream a reality,\" he said.\n\"There is so much that I want to achieve in the game, I'll be giving everything to continue my development and become the best player that I can be.\"\nManchester United technical director Jason Wilcox said: \"We are delighted that Ayden has joined Manchester United. He is already an extremely talented defender who is ready to join our first-team squad in order to maximise his development.\n\"This club has a phenomenal track record of supporting young players and we believe that Ayden is in the perfect place to reach his excellent potential.\"\nHeaven is the second young player to join United from Arsenal this season after 17-year-old striker Chido Obi-Martin moved north in October.\nMeanwhile, Lecce left-back Patrick Dorgu is travelling to Manchester for a medical on Saturday.\nThe Denmark international was an unused substitute in Lecce's Serie A win at Parma on Friday.\nSources have suggested the fee will be less than £30m, including add-ons.", "url": "https://www.bbc.com/sport/football/articles/c05l0pryyyzo"}