{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:35:55", "date_modify": "2025-05-21 04:35:55", "date_publish": "2025-04-04 17:06:52", "description": "'Always something new to achieve' - Jota sets sights high with Celtic", "filename": "sport_articles_c62zwnrvyero_1747802155.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7284/live/07cdd4d0-116e-11f0-a3a8-cd0c869b6aeb.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c62zwnrvyero_1747802155.html", "title": "'Always something new to achieve' - Jota sets sights high with Celtic", "title_page": "'Always something new to achieve' - Jota sets sights high with Celtic - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Celtic winger Jota says his ambitions are limitless after adjusting to life back in Glasgow.\nJota left Celtic in July 2023 to sign for Saudi side Al-Ittihad but struggled for game time before a stop-start spell with Rennes in France.\nHe returned to Celtic in January and has scored four goals in 12 appearances since then.\nThe 26-year-old admits he was not fully fit when he left Rennes, but is determined to kick on as he builds match sharpness.\n\"I think it has been a good couple of games,\" the Portuguese winger said. \"Still trying to be in my best shape and I know that will come definitely. But happy at the moment with how things are going.\n\"We never know how far we can reach, right? So I'm not going to say that I'm aiming for this and then I can actually aim for something else. So I just go day by day working hard and trying to be the best of myself.\n\"There's always things to get better at and obviously winning titles and making very good performances on the Champions League, that's what you aim for in the end.\n\"But there's so many things we can always achieve. When you reach a mountain, the top of the mountain, there's always another one to reach again. You reach something, so there's always something new.\n\"I'm no different to that. I know where I want to go, I know what I want to achieve and that's it.\"\nJota says minutes on the park are the best way for him to keep improving.\n\"There's nothing better than playing games,\" he said. \"You'll develop a lot once you're in the zone in the games and you can actually feel the things that happen over there.\n\"I always say no amount of training will give you what the game can give to you. You can train really hard, that's important, but the game is always the ultimate thing.\n\"For me, it's what I get most passionate about and that's what I want to perform.\"", "url": "https://www.bbc.com/sport/articles/c62zwnrvyero"}