{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:28:52", "date_modify": "2025-05-21 05:28:52", "date_publish": "2025-01-15 00:00:00", "description": "Follow live text and radio commentary featuring Jack Draper and Jacob Fearnley at the Australian Open.", "filename": "sport_tennis_live_cx2nzr7pny9t_1747805332.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_live_cx2nzr7pny9t_1747805332.html", "title": "Australian Open LIVE: Jack Draper v Thanasi Kokkinakis, Jacob Fearnley into third round", "title_page": "Australian Open LIVE: Jack Draper v Thanasi Kokkinakis, Jacob Fearnley into third round - live text and radio commentary - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "See you soon!\nThat's all from us as another dramatic day in Melbourne comes to an end.\nDon't worry, we'll be back again bright and early tomorrow to bring you all main stories and updates from down under.\nAnd, if you don't feel like you've had your fill of tennis today, you can catch up with all the best stories and analysis with our reports.\nDraper wins thriller to join Fearnley in third round\nBritain's Burrage falls short against Gauff\nDjokovic breaks Federer record in Melbourne win\nRising star Fonseca 'will be on list of best players'\n'My little revenge' - Osaka fights back in Melbourne\n'Am I a servebot?' - how Alcaraz's new look is reaping rewards\nThanks for joining us and see you next time!\n'We are taking a lot of positives from it' - Burrage\nGB’s Jodie Burrage’s run ended at the Australian Open earlier against Coco Gauff. She spoke to 5 Live's Russell Fuller: “I'm a little bit disappointed but I’m also very very happy with how I played, I enjoyed that match thoroughly and that’s what I’ve missed this last year, I’ve missed playing on those stages and I’m very happy I managed to get into that match and put some good level out there.\n“Ultimately, I still wanted to win that match and am disappointed with the result but we are taking a lot of positives from it.”\nOn winning four games in a row in the second set: “I think that’s one of the key things I have to improve on is just the consistency of my level and the trust in my game that I can do it for longer than those patches.\n“It’s not easy when you’ve got No 3 in the world coming back at you trying to do the same thing so it’s a lot easier said than done. We can only take positives, especially that chunk in the match.”\nOn playing on the Centre Court for the first time: “It was good fun, the crowd was pretty even actually, I did my best to get them involved and on my side, but I enjoyed every single minute of it.\n“I’m really happy that I actually did enjoy that match, I’ve had it on Centre Court at Wimbledon where I didn’t get to have those feelings. That is where more of these experiences are going to help me and I will definitely keep enjoying them more.\n“I’m looking at where my ranking is sitting now and I’ve not even got to the stage where I’ve got six months of no points and yet it’s exciting and I can believe that my level can get me to higher than 85 and hopefully top 50.”\n'I didn't want to be out here for so long'\nMore from Jack Draper on his off-season: “I didn’t play for a few weeks in the off-season, I was on the side lines not really playing so I didn’t know if I was going to be fit to come here. I know that my tennis is improving, this match would have really helped me again. My first match was four hours, I don’t want to be out here for that long but I’m getting better with each set and I’m really proud with the way I’m going about my tennis.”\nOn feeding off the crowd: “This is what I play for since I was a young guy, I wanted to play in front of big crowds and whether you guys are with me or against me it was a tough atmosphere to deal with. You guys were obviously all with Thanasi but I had a little fun as well. It was so good to be out here and really happy with the amount of support we get here at these big tournaments, it’s unbelievable.”\n'I’m really proud of the way I competed today' - Draper\nJack Draper speaking after booking his spot in the third round of the Australian Open: “That was a really tough match, Thanasi Kokkinakis is an unbelievable player, someone who I have great respect for, every time I play him he brings his best tennis and especially here in Australia he’s so dangerous. I’m really proud of the way I competed today and I eventually came through, I’m very happy about that.”\nOn Kokkinakis’ ongoing injuries: “It’s difficult, credit to him I think he was hurting quite a lot and obviously he pulled out last week and had a really long match in his first match. He came out here and he gave it his all until the end, he obviously was hurting but credit to him, it was a great fight today.”", "url": "https://www.bbc.com/sport/tennis/live/cx2nzr7pny9t"}