{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:59:31", "date_modify": "2025-05-21 07:59:31", "date_publish": "2025-03-27 17:22:50", "description": "Man City news: BBC Radio Manchester Fans' Forum", "filename": "sport_football_articles_c1mnd1klmxjo_1747814371.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d24e/live/fd92cc30-0b2f-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1mnd1klmxjo_1747814371.html", "title": "Man City news: BBC Radio Manchester Fans' Forum", "title_page": "Man City news: BBC Radio Manchester Fans' Forum - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester City fans joined BBC Radio Manchester's fans' forum to discuss the side's campaign so far and their expectations going into the season after winning a record fourth consecutive Premier League title in 2023-24.\nMartin: \"When I looked at the transfers and the squads I thought we were probably favourites for the title. I didn't think Liverpool had really strengthened, Arsenal hadn't. I thought it was probably going to be us [winning the league], but I was OK if we didn't win it.\n\"I don't think it has been a crisis. I know that word has been thrown around and everyone is doing emergency meetings at the moment but it is reality versus expectations.\"\nOwen: \"Man City weren't good enough in the summer. Ilkay Gundogan was brought back to fill a hole that he had left a year before. Why wasn't he just extended? Savinho has turned out to be great but we were taking a gamble on a 20-year-old who had not had much experience of top flight football.\n\"Then there was Oscar Bobb, another young winger. Everyone pinned their hopes on him and expected him to be a star player and you can't do that.\"\nWhat do you think, has it been a season of disaster or one you can accept? Tell us your thoughts here", "url": "https://www.bbc.com/sport/football/articles/c1mnd1klmxjo"}