{"authors": ["Jack Herrall", "www.facebook.com"], "date_download": "2025-05-21 07:59:24", "date_modify": "2025-05-21 07:59:24", "date_publish": "2025-03-27 17:36:37", "description": "Dundee: Docherty on Cameron injury doubt, 'different' Rangers test & 'consistency'", "filename": "sport_articles_cz9nd2qd8qjo_1747814364.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/334f/live/efdf5770-0b0c-11f0-a70a-3789f4a4779e.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cz9nd2qd8qjo_1747814364.html", "title": "Docherty on Cameron injury doubt, 'different' Rangers test & 'consistency'", "title_page": "Dundee: Docherty on Cameron injury doubt, 'different' Rangers test & 'consistency' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Lyall Cameron, who is Rangers bound this summer, is a \"slight injury concern\" and is \"awaiting scan results\" before being assessed further.\nOn Cameron's absence Docherty says it is \"always a blow when your best players are not available\" but \"players are ready to take the opportunity\" if the midfielder is ruled out.\nDocherty thinks his side have had \"good games against Rangers\" this season and says both sides will be \"buoyed\" by their respective derby wins before the international break.\nHe \"absolutely\" expects a different Rangers side to the team they faced before Barry Ferguson arrived, adding the former Ibrox skipper has good experience on his coaching staff.\nDocherty is eager to to make Dens Park as intimidating a place for visiting teams as possible.\nDundee come into the game \"feeling good about themselves\" after their derby win, with Docherty adding there is a \"real buzz and real good feeling\" around the squad in the build-up to facing Rangers.\nWith experienced players coming back into the side it helps the younger players in the squad, and the Dens boss is now seeing a \"consistency in performance\" due to that blend.", "url": "https://www.bbc.com/sport/articles/cz9nd2qd8qjo"}