{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:30:16", "date_modify": "2025-05-21 07:30:16", "date_publish": "2025-03-28 17:41:52", "description": "Crystal Palace news: 'Comfortable' Jean-Phillippe Mateta ready to make Palace return", "filename": "sport_football_articles_c86p60q1qn1o_1747812616.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7620/live/652eb480-0bf8-11f0-8dd7-cb9a32074811.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c86p60q1qn1o_1747812616.html", "title": "Crystal Palace news: 'Comfortable' Jean-Phillippe Mateta ready to make Palace return", "title_page": "Crystal Palace news: 'Comfortable' Jean-Phillippe Mateta ready to make Palace return - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Crystal Palace boss Oliver Glasner has full confidence that key striker Jean-Philippe Mateta will be in good shape to feature against Fulham in their FA Cup quarter-final on Saturday.\nThe France international has not played since he was injured in a collision with Millwall goalkeeper Liam Roberts which left him requiring 25 stitches to his left ear.\nMateta, who has scored 15 times this season, will wear a protective helmet against Marco Silva's side.\n\"If I believed it's a problem, I wouldn't play him,\" said Glasner.\n\"The doctor and the team did a great job finding the right protection. We tried two or three different ones, everything is approved by the Premier League.\"\n\"He feels comfortable [wearing the helmet]. When he scores a header tomorrow then it was the right mask with the right protection.\"\n\"When I've watched JP in training he looks the same like before. He needs to get back into his rhythm, he couldn't train for two weeks. One week he was just at home then he trained for a week individually.\n\"He's been lucky that nothing was fractured, no concussion. It was just the ear. I know it was a terrible injury. Some players say that the ear looks better than before now.\"", "url": "https://www.bbc.com/sport/football/articles/c86p60q1qn1o"}