{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:17:35", "date_modify": "2025-04-26 06:17:35", "date_publish": "2025-03-01 18:28:02", "description": "Manager Valerien Ismael praises Blackburn's mentality after Andi Weimann's late header earns a draw against Norwich.", "filename": "sport_football_articles_c17q58l1rzko_1745648255.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/0971/live/9a00ec80-f6b5-11ef-9c6a-9b6bc9defc65.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_c17q58l1rzko_1745648255.html", "title": "Valerien Ismael: New Blackburn boss applauds his side's resilience", "title_page": "Valerien Ismael: New Blackburn boss applauds his side's resilience - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Blackburn Rovers head coach Valerien Ismael was full of praise for his side's spirit and battling qualities after Andi Weimann's 96th-minute header earned a point against fellow play-off hopefuls Norwich City.\nThe Canaries looked to have snatched victory when Ante Crnac scored in the final minute, very soon after Rovers had been reduced to 10 men when Emmanuel Dennis was sent off - only for Weimann to add to the late drama at Ewood Park.\n\"It was a tough game for us with a strong opponent,\" Ismael said.\n\"I think until the red card, it was really good and we were on top and had the momentum. But the red card changed everything - it's a new game. After that it was tough for the players to concede the goal.\n\"But they showed again a great mentality. I think the season [has shown] a really good, honest, hard-working group to believe in themselves and to make sure we give everything. As I say, a no-regret attitude and they made it today.\n\"We deserved a point but it feels like more a win because the boost and the mentality [of] the players showed me they are ready to compete for the play-offs. We have to keep that going.\"", "url": "https://www.bbc.co.uk/sport/football/articles/c17q58l1rzko"}