{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:02:53", "date_modify": "2025-05-21 04:02:53", "date_publish": "2025-02-09 15:21:15", "description": "Cardiff City: Ethan Horvath hopes for boost from penalty exploits", "filename": "sport_football_articles_c70ky242rr9o_1747800173.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a411/live/1b3dcbc0-e6f7-11ef-a39a-7b0f4e03d69d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c70ky242rr9o_1747800173.html", "title": "Cardiff City: Ethan Horvath hopes for boost from penalty exploits", "title_page": "Cardiff City: Ethan Horvath hopes for boost from penalty exploits - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ethan Horvath hopes his penalty shootout save in Cardiff City's FA Cup win at Stoke City can further his case for more regular first-team action.\nAfter Saturday's game had finished 3-3 after extra time, Horvath made what proved to be the decisive save in the shootout from Michael Rose and Rubin Colwill converted his spot-kick to send Omer Riza's team through to the fifth round.\nHorvath had come into the Cardiff team at Stoke as one of nine changes, having lost his starting place in the Championship to Jak Alnwick.\n\"I want to do my best for the team whenever I get the chance to play,\" said Horvath.\n\"We all know how historic the FA Cup is. It's kind of a no-pressure game, it doesn't count towards the league but we want to go as far as possible.\"\nCardiff can now look forward to a first fifth-round FA Cup tie in 11 years, with the draw to come on Monday.\nHorvath will likely keep his place for remaining cup games, and he will be studying opposition penalty takers after his analysis on Rose helped him to make Saturday's crucial save.\n\"Before every game, as keepers we watch films [of opponents' penalties] and do our homework, try to make the best of the situation,\" the United States international added.\n\"It's not just myself, all the keepers do the homework on the opposition before every game.\n\"All credit to the team, we stayed together and showed how far we've come from the start of this season.\"", "url": "https://www.bbc.com/sport/football/articles/c70ky242rr9o"}