{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:33:26", "date_modify": "2025-05-21 06:33:26", "date_publish": "2025-01-31 10:54:39", "description": "Sandy Ryan has the immediate chance to reclaim the WBO welterweight world title she lost to Mikaela Mayer in September.", "filename": "sport_boxing_articles_cgj2nn057xyo_1747809206.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9227/live/682dcde0-dfbd-11ef-819e-d1f2ca20e9fa.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_boxing_articles_cgj2nn057xyo_1747809206.html", "title": "Sandy Ryan to face Mikaela Mayer in rematch for WBO title on 29 March", "title_page": "Sandy Ryan to face Mikaela Mayer in rematch for WBO title on 29 March - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Briton Sandy Ryan will have the chance to win back the WBO welterweight title against Mikaela Mayer on 29 March in Las Vegas.\nAmerican Mayer took the world title from Ryan in September but the fight was marred in controversy.\nRyan, 31, had red paint thrown over her as she left her hotel on fight night and said afterwards she should have pulled out of the bout.\n\"I'm not making any excuses, but after what happened before the fight last time, I did fight in anger, and it clearly affected my performance,\" Ryan said of the rematch announcement.\n\"It's the biggest fight for both of us, and everyone wants to see it again.\n\"The world will see a focused, determined, and talented fighter in the shape of her life, and I will reclaim my world title.\"\nMayer, 34, won the first fight via majority decision, with one judge scoring the exciting contest a draw.\nDerby fighter Ryan has had terrible luck fighting in the United States. Before the Mayer contest, she fought a controversial draw with rival welterweight champion Jessica McCaskill in 2023.\nIt was a fight many thought Ryan won clearly, but the draw denied the Englishwoman the chance to add the WBC title to her collection and become a unified world champion.\nMayer's victory last year crowned her a two-weight world champion and she said she was happy to take the rematch.\n\"I've never been one to shy away from challenges,\" she said.\n\"I could have taken my belt and moved on, but it was a highly entertaining fight, and if this is what the fans want, then that's what I'll give them.\"", "url": "https://www.bbc.com/sport/boxing/articles/cgj2nn057xyo"}