{"authors": ["Ian Hunt", "www.facebook.com"], "date_download": "2025-05-21 04:18:01", "date_modify": "2025-05-21 04:18:01", "date_publish": "2025-02-09 11:02:08", "description": "Jak Jones did not treat himself to any flash new cars or gold watches after his World Championship final appearance.", "filename": "sport_snooker_articles_cx24g803782o_1747801081.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a6e9/live/a5b2f4f0-e2ed-11ef-861e-2d18b1b22119.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_snooker_articles_cx24g803782o_1747801081.html", "title": "Jak Jones hopes for more World Championship glory", "title_page": "Jak Jones hopes for more World Championship glory  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jak Jones did not treat himself to any flash new cars or gold watches.\nThere was no mad spending spree on anything - apart from a couple of luxury holidays for his parents.\nThe one thing his shock run to the 2024 World Snooker Championship final did buy him? Belief that he can do it again. Or even go one step further and win it next time.\n\"It probably sounds crazy, but I feel more confident winning the World Championship than any tournament on the tour,\" says the Cwmbran potter, who is preparing for his home event, the Welsh Open in Llandudno this week.\n\"The longer formats like the World suit me down to the ground. And what happened last year has given me the belief I'm a top player, and I deserve to be at the top.\"\nJones, 31, almost caused one of the biggest shocks in sporting history when he reached the final as a qualifier and outside bet, with a series of eye-catching victories over the likes of Stuart Bingham, Zhang Anda and current world number one Judd Trump.\nThe fairytale Crucible run ended with an 18-14 defeat to Kyren Wilson, but nonetheless catapulted the Welshman into the world's top 16 and earned him £200,000 in prize money as runner-up.\nBut it is not as if he has been splashing the cash around ever since.\n\"A lot of people think I won a lot more than I did. With the tax you have to pay and stuff like that, it doesn't get you very far these days,\" he said.\n\"So, no, it absolutely hasn't changed my life one bit.\n\"I suppose I could get my parents a couple of holidays that I wasn't able to do before. But I haven't got a new car. I haven't got a new house - or though we are looking at one!\n\"My wife and I are expecting our first baby - a boy - so the money will help with that.\n\"I've been through a lot of tough times on the tour where I struggled (financially), and my parents struggled to support me financially.\n\"So I'm not someone who was going to splash money around as soon as I got it. It was more security, trying to set myself up to be in a better position for the future.\"\nJones' countdown to the 2025 World Championship continues this week with the Welsh Open, which runs from 10-16 February at Llandudno's Venue Cymru.\nIt is an important stepping stone towards Sheffield, with precious ranking points at stake to keep him in the world's top 16 and automatic qualification for the Crucible.\n\"I feel like I could win any tournament I go into,\" said Jones.\n\"Being on the big stage doesn't affect me any more. I have the confidence and belief that I haven't had in the past.\n\"Even though I haven't had a good season, I've got confidence in my break-building, and feel I can switch it on at any moment and beat anyone.\n\"Maybe I'm saving it all for the World Championship - a one-tournament wonder!\"\nThe immediate question is whether Jones can become the first Welshman to win the Welsh Open since Mark Williams did so for the second time in 1999.\nJones starts his campaign on Tuesday with an all-Welsh tie against Matthew Stevens, with 10 Welshmen in all competing for the Ray Reardon Trophy.\nWilliams will be there again, along with the likes of Ryan Day, Dominic Dale and amateur player Dylan Emery.\n2024 winner Gary Wilson starts the defence of his title against India's Ishpreet Chadha.\nThis is the third year running the tournament's been held in Llandudno, having been played exclusively in south Wales previously in either Cardiff or Newport.\n\"Apart from the World Championship, the Welsh Open was probably the tournament I enjoyed the most (earlier in his career),\" said Jones.\n\"It was local (to his hometown Cwmbran), and the support was great - everyone would be shouting 'Come on Jack!' and supporting all the Welsh players.\n\"It's not quite the same being in north Wales, it's such a long way for players based in the south, though that does take pressure off Welsh players.\n\"It's still an amazing tournament, one of the best on the Tour, and I'd love to win it. I feel like I'm capable of winning it. It would be nice to have another Welsh winner.\"\nWorld champion Kyren Wilson will be among the favourites, having won three ranking tournaments this season, including the German Masters earlier this month.\nRonnie O'Sullivan will also be highly fancied to equal John Higgins' record of five Welsh Open wins as the Rocket returns after missing last year's event.\n2020 champion Shaun Murphy is another to keep an eye on after a 147-break inspired a thrilling Masters win over Wilson in January.\nTrying to accurately predict a winner can prove tricky, though, with Gary Wilson's victory last year - against outsider Martin O'Donnell - and Jordan Brown's shock 2021 triumph over O'Sullivan demonstrating the tournament's capacity to produce surprise champions.\n\"The game is changing where the big names are not always the best players anymore,\" said Jones.\n\"There are a lot more players further down the rankings who can play to an extremely high level. Any player can beat any other player, within reason.\"\nOne man who will not be in Llandudno this year is world number one Trump. He is picking and choosing his tournaments in order to be in prime shape for the World Championship in April and May.\nJones will certainly hope he is, too.\nBBC coverage of the Welsh Open will be shown live on BBC iPlayer, BBC Two Wales, the Red Button and the BBC Sport website.", "url": "https://www.bbc.com/sport/snooker/articles/cx24g803782o"}