{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:37:32", "date_modify": "2025-05-21 06:37:32", "date_publish": "2025-04-01 00:00:00", "description": "Promotion-chasing Wycombe can only draw 0-0 against bottom-of-the-table Shrewsbury despite having 30 shots at Adams Park.", "filename": "sport_football_live_c8j0jl9kyd2t_1747809452.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/95b9/live/a45e3960-0eea-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_c8j0jl9kyd2t_1747809452.html", "title": "Wycombe Wanderers 0-0 Shrewsbury Town", "title_page": "Wycombe Wanderers 0-0 Shrewsbury Town - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Promotion-chasing Wycombe could only draw 0-0 against bottom-of-the-table Shrewsbury despite having 30 shots at Adams Park.\nThe hosts missed their chance to close the gap on second-placed Wrexham, who were held at Cambridge and remain three points ahead having played a game more in the League One promotion race.\nThe Chairboys went into the match hoping to achieve their third league win in a row, a feat they had not achieved since November, and dominated the opening half.\nTop scorer Richard Kone went close on two occasions but he dragged his shot wide before heading wide from a Jasper Pattenden cross.\nEx-Wycombe keeper Jamal Blackman was called into action to brilliantly deny Xavier Simons' bending effort from range, whilst Garath McCleary and Cameron Humphreys fired wide.\nFor Shrewsbury, they had two huge chances to take the lead and they both fell to George Lloyd, who wasted both.\nThe second period saw Wycombe throw the kitchen sink, as McCleary, Cameron Humphreys and Kone all went close.\nSimons was once again denied by Blackman while Sonny Bradley, Sam Vokes, James Berry and Jack Grimmer caused mayhem in the Salop box, but Michael Appleton's team defended for their lives.", "url": "https://www.bbc.com/sport/football/live/c8j0jl9kyd2t"}