{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:32:18", "date_modify": "2025-05-21 06:32:18", "date_publish": "2025-03-31 17:30:57", "description": "BBC Sport football expert Chris Sutton takes on Liam Hincks from DJ duo Tigerblind with his predictions for the midweek Premier League fixtures.", "filename": "sport_football_articles_czdn9nr6d77o_1747809138.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/86bc/live/9d696660-0e23-11f0-ba12-8d27eb561761.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_czdn9nr6d77o_1747809138.html", "title": "Premier League predictions", "title_page": "Premier League predictions: Chris Sutton v DJ duo Tigerblind - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Liverpool are out of the Champions League and lost the Carabao Cup final, but how will they respond as they resume their Premier League title bid?\nThe leaders, who host neighbours Everton on Wednesday, are 12 points clear with nine games to go.\n\"I can see this being another explosive Merseyside derby, like the last one was,\" said BBC Sport football expert Chris Sutton.\n\"But after the international break Liverpool will be absolutely bursting to get out there and put things right.\"\nSutton is making predictions for all 380 Premier League games this season, against a variety of guests.\nFor week 30, he takes on Liam Hincks from Liverpool DJ & producer duo Tigerblind, who is a lifelong Everton fan.\nTigerblind have teamed up with world-renowned dance label Ministry of Sound for their latest single, Battery Operated.\nDo you agree with their scores? You can make your own predictions below.\nThe most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.\nA correct result (picking a win, draw or defeat) is worth 10 points. The exact score earns 40 points.\nLiam enjoyed the end of the last Merseyside derby to be played at Goodison Park, when James Tarkowski's 98th-minute goal earned Everton a dramatic point in February, but he is not relishing Wednesday's meeting at Anfield.\n\"I am dreading it, to be honest, for a couple reasons,\" he told BBC Sport.\n\"Firstly, because of the way Liverpool are at the moment - they are absolutely flying in the league - and also because of just how bad our record is there.\"\nEverton won at Anfield in 2021, but that is their only victory there in their past 28 visits in all competitions since 1999.\nThe Toffees do go into this game in decent form, however. They are on a nine-game unbeaten run in the league under David Moyes, who replaced Sean Dyche in January.\n\"I got to know Sean quite well, and he is a lovely guy,\" Liam added. \"He came to see us play at Pacha in Ibiza last summer and he was a really good laugh.\n\"From getting the other side of things from him, I did feel for him when he left. I guess that is football, though, and sometimes things don't work out.\n\"Moyes has come back and he obviously has a connection with the club and a lot of history. He has started to get more of a tune out of some of the players a bit more than Dyche did, especially Beto up front.\n\"I think the biggest thing Moyes has done is to give him confidence. It will be interesting once Dominic Calvert-Lewin comes back from injury to see how he responds to Moyes too, because he hasn't played much under him.\n\"Fair play to Beto, though. There was a lot of pressure on his shoulders with a new manager coming in, and the team not scoring, but the run he has gone on [five goals in nine league games under Moyes] is just fantastic - at any other club he'd be a £60m striker!\"\nChris Sutton and Liam Hincks were speaking to BBC Sport's Chris Bevan.\nArsenal's title hopes may only be faint but they have still got to try to exert a bit of pressure on Liverpool.\nWin this, and they are nine points behind the leaders before Arne Slot's side play again. I want to see Liverpool pushed, and no other result will do.\nIt won't be easy for Arsenal, though - I was at the reverse fixture at Craven Cottage in December, which finished 1-1, and that was a typical Fulham performance in that they were dangerous on the counter-attack.\nThey showed that day what a capable side they are, and they have several former Arsenal players in their squad who will want to prove a point again too.\nMarco Silva's side had a disappointing defeat at home to Crystal Palace in the FA Cup on Saturday, but they actually played really well in the first half of that game.\nIt's hard to know where some teams are at form wise, coming out of the international break, and if Arsenal are not at the races then Fulham are going to to cause them more problems this time.\nI actually think the Gunners will find a way to win this one, though.\nBukayo Saka's return after more than three months out will lift Emirates Stadium even if he starts the game on the bench and, if they need it, he will supply a spark whenever he gets on the pitch.\nSutton's prediction: 2-0\nLiam's prediction: Arsenal will get this done. 2-0\nWolves have got a nine-point cushion above the bottom three but they still have a bit of work to do to make sure they are completely safe.\nTheir best player Matheus Cunha is still suspended, and he is such a big miss. His recent comments about wanting to leave to win trophies are hardly much help to them either.\nWest Ham are only one place above Wolves, but are another eight points clear.\nTheir results have not been spectacular under Graham Potter but when I look at them, I do think they are improving - they came very close to beating Everton last time out, and actually deserved the three points there.\nI'd like to pick a winner but I am not sure that will get me anywhere - this game smells of a draw.\nSutton's prediction: 1-1\nLiam's prediction: I wasn't sure about this one, but I think Wolves might edge it with them being at home. 2-1\nI am concerned how Nottingham Forest will cope without Chris Wood up front if he is out injured. At the moment it is not clear how serious his problem is.\nForest made quite a few changes against Brighton in the FA Cup over the weekend, and still got through without 'the Wood-chopper', but they really need him back as soon as possible.\nSpeaking as a Forest fan, it's especially annoying that he has picked up this injury while on international duty.\nNew Zealand have got an excellent cricket and rugby union team and I wish them every success at football, but do they really need Wood to get through their World Cup qualification campaign against the likes of Fiji and New Caledonia?\nI'd argue they don't need him, and that Wood is better than that. If I was from New Zealand, I'd probably have won about 700 caps, and there are greater priorities for Wood, which are to win the FA Cup and get Forest into next season's Champions League.\nIt will be harder for Forest without him, but I still think they can repeat their win at Old Trafford in December.\nSaturday's FA Cup win over Brighton was not exactly a thriller, but as we have seen plenty of times from Forest already this season, they are not here to entertain - they are here to get the job done.\nAs for Manchester United, it is a big end to the season for their boss Ruben Amorim.\nBruno Fernandes has carried them a bit recently in the league, and he is their best hope of getting a positive result here.\nI am not sure either side will be too bothered about having the ball, but Forest fans are happy for them to sit deep and play on the counter, even when they are at home, and they are really good at it.\nSutton's prediction: 1-0\nLiam's prediction: There are going to be goals in this one, because United always seem to get a goal from somewhere. I am going to go with Forest to win whether Wood is fit or not. 3-1\nBournemouth have lost a bit of form of late, going out of the FA Cup and taking only one point from their past four league games.\nThey really need a positive result to get back on track, so who better to face than an Ipswich team who are struggling badly?\nI thought Bournemouth played well in the first half against Manchester City on Sunday and carried a goal threat - but the mindset of the Ipswich players is likely to be a bigger factor in what happens in this game.\nThe bottom three are doing so badly that we maybe should have relegated them over the international break - it feels like all three of them need a miracle if they are going to survive from here.\nAs I've said many times, I actually like the Ipswich model and how they play, and I am a fan of Kieran McKenna as a manager.\nI have felt for them this season and, out of the bottom three sides, they have given it the best go at staying up, but it is quite a damning statistic that they are the only side in the top five tiers of English football yet to win a league game in 2025.\nMaybe the international break will have done them good but this feels like an open goal for Bournemouth, who are still right in the race for Champions League football next season.\nThe Cherries needed two late goals to win at Portman Road before Christmas but I am not sure McKenna's side will put up the same fight this time.\nIt is starting to feel like they are resigned to their fate, and they might have to think about how they will bounce back next season - if they can keep their squad together then I'd be confident that will happen.\nThere will be suitors for Liam Delap, of course, but if he wanted to move somewhere nice he could just come and live in Norwich - it is quite a long drive to Ipswich though.\nSutton's prediction: 3-1\nLiam's prediction: Bournemouth will be too strong. 2-0\nWhat a season Aston Villa are having, with a Champions League quarter-final and FA Cup semi-final to look forward to.\nTheir recruitment in January has been key - a lot has been made of how well Marcus Rashford and Marco Asensio are playing after joining on loan, and rightly so.\nWhether Villa can turn them into permanent signings in the summer might depend on whether they get in next season's Champions League, however.\nWhile this is exactly the scenario they want, finishing in the top five is going to be tough on top of everything else and it is games like this where everything might catch up with them.\nBrighton drew a blank against Forest in the FA Cup on Saturday but Villa are a bit more expansive, and I feel like the Seagulls will have plenty of chances here.\nSutton's prediction: 2-1\nLiam's prediction: Villa are very strong but Brighton are decent at home. 1-1\nWhat a gimme this game is for Manchester City.\nIt is exactly the fixture they would want after their FA Cup win at Bournemouth, when Pep Guardiola was speaking about his players showing heart and soul, and the desire and passion that they need.\nThe way he was talking shows how much winning the FA Cup means to him, but does it mean they are back on track? I am not sure, and I don't think this game will tell us much either because they should blow Leicester away even if they are nowhere near their best.\nLeicester have not scored a league goal since the end of January, and I don't see that changing at Etihad Stadium. They are at the stage where their fans cheer a corner, let alone a shot at goal - that's desperate, and that's where Leicester are at.\nFrom what Pep was saying, he knows how important this game is for their run-in, as Manchester City look to secure Champions League football next season. I don't think there is any chance they will slip up.\nSutton's prediction: 5-0\nLiam's prediction: Manchester City to win this all the way. I am not sure Ruud van Nistelrooy was the right appointment for Leicester - I've seen a lot of stuff on social media with people saying 'Ruud out, Dyche in'. I'm not sure if that will happen but I think he would do a good job there. 3-0\nHave Newcastle stopped celebrating yet? They have been on the lash for a long time after winning the Carabao Cup, culminating - for some of their fans anyway - with their trophy parade on Saturday. I am sure the players have sunk a few too.\nIt showed how much the club's success means to the city, but now they have to focus on the rest of the season, because getting back into the Champions League would be massive for what comes next for Eddie Howe's side, and how they are viewed across Europe.\nThere will be a fantastic atmosphere at this game too, but the danger with that is we know Brentford are capable of spoiling anyone's party with their attacking threat.\nNewcastle boss Eddie Howe has tried to address that, by speaking about the need to finish the campaign strongly, and this is a great example of where his side cannot afford to take their eye off the ball.\nI suspect they will come out of the traps very quickly against Brentford, lifted by the crowd, and go a couple of goals up before the weekend starts to take its toll on them and the fans too.\nSutton's prediction: 3-1\nLiam's prediction: Brentford are a dangerous team but I just feel like Newcastle will still be on that high off the back of winning the Carabao Cup. 2-1\nLiverpool have had a break since going out of the Champions League and losing the Carabao Cup final, and I don't think we will see them wobble here. Quite the opposite in fact, now their focus is just on the Premier League.\nThe Reds also felt wronged by Everton's late equaliser at Goodison Park in February so there will be all of that bubbling under, and Arne Slot's side will feel they have a point to prove.\nThey are going to put Everton under all sorts of pressure, but the Toffees will be well organised defensively and have an eye on a counter-attack too.\nEverton boss David Moyes has transformed a team that was lacking belief, and he would love nothing more than to go to Anfield and get something.\nI am expecting a typical derby, in that I would not be surprised if this is another emotional game as well as an explosive one, with maybe a couple of players losing their heads.\nThere will be plenty of drama along the way, but I am pretty sure Liverpool will be back to their best form and end up taking the three points.\nSutton's prediction: 2-0\nLiam's prediction: There might be a bit of tension from the Liverpool fans off the back of their two massive defeats and with the rumours about Trent Alexander-Arnold and Virgil van Dijk both leaving. I think Arne Slot has still got everything under control in terms of them winning the Premier League, but if there is any kind of hangover from losing at Wembley and going out of Europe, it will help us.\nSo, obviously being the optimistic Everton fan that I am, I am going to go for the same result we got at Goodison. The form we have been in lately, I think Moyes will have us right up for it and believing we can get something.\nWhat was hilarious about our 2-2 draw in February is that I was one of many fans who had left the ground during stoppage time. I was walking down Goodison Road and next minute it was like there was an eruption. There were people running down the street to see what had happened - we all ran down to the Royal Oak pub which is on the corner, and looked through the windows to find out Tarkowski had scored. It was incredible! 1-1\nLiam on Everton's stadium move: I have not actually been to the new ground yet, purposely, because I want to see it in full flow, at our first home game of next season - I can't wait.\nI will miss Goodison Park, of course, because of the amount of history there - it even smells of football - but unfortunately football is a business and the club needs to evolve and make more money.\nSo, this move is needed, but it is exciting too - it's a new era for us and, from what I've seen and been told, I think it is going to be quite an intimidating stadium for away teams, because of the steepness of the stands - the gradient is twice as steep as the Kop at Anfield - but it is probably going to take time for us to settle in and get the atmosphere going.\nThis is a great game to finish the week off. It ended up 4-3 to Chelsea earlier in the season, and there are likely to be a few more goals this time too.\nChelsea have people like Cole Palmer, Nicolas Jackson and Noni Madueke back from injury to bolster their attack, but Spurs have got some key players like Micky van de Ven fit again too.\nTottenham's league campaign has been disappointing - it is winning the Europa League or bust for them - while Chelsea are still chasing the Champions League places.\nSpurs looked tired to me before the international break, so it will be interesting to see what they are like here. We know how exciting they can be on their day, it is just those days have been few and far between this season.\nChelsea have been a bit flat as well, but maybe this is the game where both teams come to life and serve up a thriller - that is what I am hoping for anyway.\nSutton's prediction: 3-2\nLiam's prediction: I am tempted to say this will be high-scoring but I am going to be conservative. 2-1\nThere were eight Premier League games played in week 29, the last set of fixtures before the international break.\nSo far, Chris and his guest, Divorce singer Felix, have both got four correct results, with one exact score, giving them both 70 points.\nFor now, it goes down as a win for the BBC readers - using the most popular scoreline from your predictions for each game, you got five correct results, with one exact scores, leaving them on 80 points.\nThe remaining two games were rearranged because of the Carabao Cup final.\nNo-one picked up any points from Liverpool's draw with Aston Villa, which was moved forward to 19 February, so the weekly winner will be decided when Newcastle host Crystal Palace on 16 April - Felix has gone for a 2-1 Palace win.", "url": "https://www.bbc.com/sport/football/articles/czdn9nr6d77o"}