{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 08:11:34", "date_modify": "2025-04-26 08:11:34", "date_publish": "2025-02-26 12:00:45", "description": "Exeter boss Rob Baxter says Greg Fisilau could be a future England international after the forward signed a new deal at the club.", "filename": "sport_rugby-union_articles_c2ergy77874o_1745655094.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c96e/live/9749d610-f434-11ef-8c03-7dfdbeeb2526.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c2ergy77874o_1745655094.html", "title": "Greg Fisilau: Exeter forward signs new three-year deal at Sandy Park", "title_page": "Greg Fisilau: Exeter forward signs new three-year deal at Sandy Park - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Exeter boss Rob Baxter says Greg Fisilau could be a future England international after the forward committed his future to the club on Wednesday.\nThe 21-year-old back-row, who has been capped by England's 'A' side and trained with the senior squad, has signed a new three-year contract at Sandy Park.\nFisilau joined Exeter alongside Immanuel Feyi-Waboso in November 2022 from Wasps after the then-Premiership club folded.\nHe has gone on to establish himself as Exeter's first-choice number eight, scoring 10 tries in 50 league and cup matches for the Chiefs.\n\"He's one of the bright, young, talented forwards in the country and has done exceptionally well since he's come here,\" Baxter told BBC Sport.\n\"We promoted him into the first team pretty quickly, that was always going to be the plan with him, and he's just excelled for a young man.\n\"He's 21 years old, he's already played some England 'A' rugby, been involved in the EPS (Elite Player Squad) camps.\n\"He's a fantastic young talent, someone we're planning on building a successful squad around and a good picture [of] where we're going to be heading in the future.\"", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c2ergy77874o"}