{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:30:05", "date_modify": "2025-04-26 07:30:05", "date_publish": "2025-02-27 18:00:32", "description": "WPL 2025 results: Ash Gardner half-century gives Gujarat Giants win over RCB", "filename": "sport_cricket_articles_c9dee6py5y9o_1745652605.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/432c/live/1b7c48e0-f530-11ef-a161-d137c0587442.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c9dee6py5y9o_1745652605.html", "title": "WPL 2025 results: Ash Gardner half-century gives Gujarat Giants win over RCB", "title_page": "WPL 2025 results: Ash Gardner half-century gives Gujarat Giants win over RCB - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Ash Gardner's blistering half-century helped Gujarat Giants to a comfortable six-wicket win over Royal Challengers Bengaluru in the Women's Premier League.\nThe match had been well poised with the Giants 66-3 in the 10th over in pursuit of RCB's total of 125-7.\nHowever, Giants skipper Gardner seized the initiative alongside Australia team-mate Phoebe Litchfield to help her side chase down the total with 21 balls to spare.\nAll-rounder Gardner whacked 58 off 31 balls in an innings which featured six fours and three sixes before she was caught and bowled by compatriot Georgia Wareham.\nLitchfield saw the Giants home with an unbeaten 30 off 21 ball despite the best effort of Wareham (2-26) and Renuka Singh (2-24) with the ball.\nEarlier, RCB's top-order had failed to fire after Smriti Mandhana, Danni Wyatt-Hodge and Ellyse Perry - dismissed by Gardner - all departed cheaply.\nKanika Ahuja top scored for RCB with 33 off 28 balls while Wareham finished unbeaten on 20 as Tanuja Kanwar finished the pick of the Giants' bowlers with 2-16.\nThe Giants now have four points - the same number as RCB - but remain bottom of the table after five matches on net run rate.\nMumbai Indians top the standings with six points having played a game fewer.", "url": "https://www.bbc.co.uk/sport/cricket/articles/c9dee6py5y9o"}