{"authors": ["Lewis Irons", "www.facebook.com"], "date_download": "2025-05-21 07:43:18", "date_modify": "2025-05-21 07:43:18", "date_publish": "2025-01-13 16:49:00", "description": "Fagerson hopes for 'incredible Hampden atmosphere' in Europe", "filename": "sport_articles_cedn9nvy344o_1747813398.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fbc3/live/ac08c6b0-d1ca-11ef-87df-d575b9a434a4.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cedn9nvy344o_1747813398.html", "title": "Fagerson hopes for 'incredible Hampden atmosphere' in Europe", "title_page": "Fagerson hopes for 'incredible Hampden atmosphere' in Europe - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Glasgow Warriors back-rower Matt Fagerson insists it would be \"massive\" if their Champions Cup round of 16 home match was to be played at Hampden.\nThe 26-year-old enjoyed the \"incredible atmosphere\" at the national football stadium last month in the first leg of the 1872 Cup.\nFranco Smith's side have secured a home tie in this round of the European competition the first time, which Fagerson said was \"the goal\".\n\"We set out this year with the goal to do well in Europe, so to do it with one game in hand is massive for us,\" he said while previewing Saturday's trip down south to take on Harlequins.\n\"It's a great achievement but we know we have one more big game to play down in London, so all eyes are on that at the moment.\n\"It would be massive if we could play at Hampden. When we played there it was an incredible atmosphere, 30,000-odd fans there from Glasgow – I think it was the biggest we've ever had.\n\"Hopefully we can do that every year [in the 1872 Cup] and if it comes to these knockout games, doing it at a place like Hampden would be brilliant.\n\"The Hampden staff were awesome, we had our branding all over the place and we could hear the fans – hopefully we'd get the weather next time! But if we could do that again, it would be brilliant.\"\nFagerson added confidence is high among the Warriors group who are still beaming from their URC success last season.\n\"The confidence we got from winning the league last year means this group is full of internal confidence,\" he added.\n\"To come away with a win in the round of 16 would be huge, but again though, this weekend is our only focus.\n\"There's a big difference between confidence and arrogance. Internal confidence is great and every club needs that. If you don't go out there thinking you can win then why are you going out on the pitch?\n\"There's a great buzz around the group at the minute and a great culture that we've driven over these last two or three years since Franco Smith came in. I think we're all excited.\"", "url": "https://www.bbc.com/sport/articles/cedn9nvy344o"}