{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 03:48:19", "date_modify": "2025-05-21 03:48:19", "date_publish": "2025-04-07 12:25:19", "description": "Man Utd news: Casemiro equals United tackle record against Man City", "filename": "sport_football_articles_cedyl9yz786o_1747799299.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5f59/live/5ea149a0-13a7-11f0-8c3e-ab5924cb0c94.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cedyl9yz786o_1747799299.html", "title": "Man Utd news: Casemiro equals United tackle record against Man City", "title_page": "Man Utd news: Casemiro equals United tackle record against Man City - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "At times this season, it has appeared Casemiro's Manchester United career would not last beyond the next transfer window.\nIn September - towards the end of Erik ten Hag's reign - he was substituted at half-time of the 3-0 home loss to Liverpool and heavy criticism followed. The Brazil international's wife came to his defence and reminded people of his stellar, trophy-laden career.\nHowever, despite an inauspicious start under Ruben Amorim, Casemiro has re-established himself in United's starting XI.\nThe 33-year-old played the full 90 minutes in the draw with Arsenal on 9 March and started both legs of the Europa League last-16 victory over Real Sociedad.\nHe started last week's defeat at Nottingham Forest and completed the full 90 minutes in Sunday's goalless Manchester derby.\nAgainst Manchester City, Casemiro made 11 tackles - the joint-most ever made by a United player in a Premier League match.\n\"Amid all the noise - on and off the pitch - around yesterday's Manchester derby, it was interesting to note Casemiro turned in another effective midfield display,\" BBC chief football news reporter Simon Stone wrote about his showing.\n\"Almost without anyone noticing, the former Real Madrid star has eased his way back into Amorim's team.\"\nOn Casemiro, Amorim said: \"If you improve what we ask of them, they have the opportunity. If they play well, they continue to play.\n\"That was the situation for Casemiro. The credit is all [with] the player. He is our player and will continue to be our player.\"", "url": "https://www.bbc.com/sport/football/articles/cedyl9yz786o"}