{"authors": ["Charles Bannerman", "www.facebook.com"], "date_download": "2025-05-21 04:17:25", "date_modify": "2025-05-21 04:17:25", "date_publish": "2025-04-05 17:16:35", "description": "Headline here", "filename": "sport_articles_c3dk5vzd99vo_1747801045.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/34bd/live/a8b2d490-0cc8-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c3dk5vzd99vo_1747801045.html", "title": "Headline here", "title_page": "Headline here - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Kingussie cashed in on the postponement of leaders Fort William's game against Kinlochshiel to return to the top of the Premiership with a 7-1 home win over Caberfeidh.\nOban Camanachd went second when they edged Newtonmore 1-0 at Mossfield.\nThere was heartbreak at Braeview for newly-promoted Beauly, who missed their first point when local rivals Lovat scored the only goal in the final minute.\nSkye also failed to break their duck when they went down 4-2 to Kyles at Tighnabruich.\nDylan Borthwick gave Kingussie the lead in the opening minute and completed his hat trick just before half time.\nEoin Baikie, Ruaridh Anderson and Roddy Young made it 6-0 by the hour before Ben MacDonald pulled one back for Cabers and Toby Thain scored Kingussie's seventh.\nRoss MacMillan delivered the vital strike for Camanachd midway through the second half.\nKingussie now head Camanachd on goal difference with Fort, who have a game in hand on both, a point adrift.\nLewis Tawse grabbed Lovat's late derby winner at Beauly.\nConnor Kennedy opened the scoring for Kyles with a penalty and Dan MacDonald equalised before Will Cowie and James Pringle took it to 3-1 at half time.\nWith 10 minutes left, William MacKinnon gave Skye some hope but Kennedy then completed his double to clinch it for Kyles.\nAfter five games, Skye and Beauly already look in danger of becoming detached at the bottom.\nLochaber extended their lead in the National Division to three points with a 4-2 defeat of bottom side Strathglass at Cannich.\nThe other second tier game produced a 3-2 success for Kilmallie at Inveraray.", "url": "https://www.bbc.com/sport/articles/c3dk5vzd99vo"}