{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:48:16", "date_modify": "2025-04-26 03:48:16", "date_publish": "2025-03-05 15:01:27", "description": "Elliot Daly will start ahead of Marcus Smith at full-back for England's match against Italy on Sunday, with the Harlequins playmaker dropped to the bench.", "filename": "sport_rugby-union_articles_c8e740ddw1jo_1745639296.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5811/live/11cc80e0-f9d5-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c8e740ddw1jo_1745639296.html", "title": "Six Nations 2025: England v Italy", "title_page": "Six Nations 2025: England v Italy - Marcus Smith drops to bench with Elliot Daly at 15 - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Elliot Daly will start ahead of Marcus Smith at full-back for England's match against Italy on Sunday, with the Harlequins playmaker dropped to the bench.\nFraser Dingwall, who won his last England cap more than a year ago, comes into the centres alongside Ollie Lawrence, with Henry Slade left out of the matchday 23.\nDingwall's inclusion means five of the seven backs are from Northampton, with Alex Mitchell and Fin Smith continuing their half-back partnership.\nJamie George starts at hooker as he becomes the seventh player to reach a century of caps for the England men's team.\nGeorge will make his first Test start since losing the captaincy before the start of this year's Six Nations and England head coach Steve Borthwick praised the 34-year-old's attitude since the \"disappointing\" news.\n\"Jamie has been for such a long time, and continues to be, such an incredible player for English rugby,\" Borthwick told BBC Sport.\n\"His impact off the bench in the last couple of games has been there for everyone to see.\n\"Jamie was clearly very disappointed by that news and there is never a good time for a player to receive that. I have also been in that situation.\n\"It's immense credit to Jamie the positive influence he has had around the squad since he has recovered from injury and then rejoined the squad.\"\nLeicester scrum-half Jack van Poortvliet, who scored in England A's win over Ireland's second string last month, is preferred to Harry Randall as the scrum-half cover among the replacements.\nEngland have won all 31 of their previous meetings with Italy but took only a narrow 27-24 victory in Rome last year in the Six Nations.\nBorthwick's side lie third in the Six Nations table, one and four points respectively behind France and Ireland, who meet in Dublin on Saturday (14:15 GMT).\nMarcus Smith's shift to the bench represents a dramatic downsizing of his role in just a few months.\nInitially afforded an opportunity by injury to George Ford, he started all three matches in England's summer tour of Japan and New Zealand at fly-half and continued in the role throughout the autumn.\nHowever, he was shifted to a full-back role after England's opening Six Nations defeat, with the hope he could combine his dangerous broken-field running from back field with the ability to step in as an additional playmaker alongside novice fly-half Fin Smith.\nDaly scored the decisive late try with a well-timed run in England's win over France and appeared off the bench again in the victory over Scotland, but has not started a match at full-back for his country in four years.\n\"I'm looking forward to seeing Marcus enter the field when there are potentially some tiring defenders and maybe a bit of space,\" said Borthwick.\n\"We had a conversation about the role I was asking him to play this week and he has trained wonderfully well.\n\"It's a sign of the calibre of person and the character Marcus is. He is a brilliant rugby player and I've talked about him being a game-changer.\n\"I'm looking forward to seeing him come on and break open some part of Italy's defence.\n\"Elliot Daly has done well and had a real positive impact off the bench in the last couple of games and he has been terrific in training.\n\"Now it's Elliot's time with Marcus coming from the bench and it's a really good position to be in.\"\nLawrence and Slade have been England's 12-13 combination for the past 13 games - a run that stretches back to Dingwall's last start against Wales in February 2024 - however both play the majority of their club rugby at outside centre.\nDingwall has been deployed in both roles but was Northampton's first-choice inside centre in their run to the Premiership title last season.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c8e740ddw1jo"}