{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:27:39", "date_modify": "2025-05-21 06:27:39", "date_publish": "2025-04-01 04:24:10", "description": "Swansea City: Ben Cabango says side making strides after 'wild season'", "filename": "sport_football_articles_c4g8ll5kzglo_1747808859.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2e69/live/ef5b4960-0e38-11f0-bfea-d170975f1d6a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4g8ll5kzglo_1747808859.html", "title": "Swansea City: Ben Cabango says side making strides after 'wild season'", "title_page": "Swansea City: Ben Cabango says side making strides after 'wild season' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Captain Ben Cabango reckons Swansea City are making strides under Alan Sheehan as they look to pull clear of the Championship relegation scrap.\nSwansea responded to successive defeats prior to the international break with a morale-boosting draw at Leeds United on Saturday.\nZan Viptonik's 96th-minute equaliser ensured Swansea came away from Elland Road with something after a courageous display against the promotion-chasing Whites.\nThe Leeds draw means Swansea are seven points clear of the bottom three with seven games to play this season, though the gap will be down to five should Derby County win their game in hand against Preston North End on Wednesday.\nSwansea host 22nd-place Derby on Saturday, before bottom-of-the-table Plymouth Argyle visit four days later.\nThe Swans head into two potentially pivotal fixtures in good spirits after another positive display under caretaker head coach Sheehan.\n\"There's still work to do,\" said centre-back Cabango.\n\"We are trying to get better each game - Shees (Sheehan) has only just come in. We have a big game next week and we need to take the positives from Leeds into that one.\"\nSwansea have taken eight points from six games since Sheehan took the reins following Luke Williams departed in February on the back of a run of seven defeats in nine league games.\nWilliams' side were four points off the play-offs after 24 league matches this season, only for a collapse in form to raise concerns about dropping to League One.\n\"It's been a wild season to be honest, with Luke Williams starting and then Shees coming in - it's been a lot of change,\" Cabango added.\n\"But I feel like Shees has brought some good things in for us. We have all taken it on board and it shows when we go and perform like we did at Leeds that the boys are giving everything for him.\"", "url": "https://www.bbc.com/sport/football/articles/c4g8ll5kzglo"}