{"authors": ["Nizaar Kinsella", "Jonty Colman", "www.facebook.com"], "date_download": "2025-05-21 04:28:21", "date_modify": "2025-05-21 04:28:21", "date_publish": "2025-04-05 11:21:24", "description": "Chelsea confirm they are in talks with Uefa over the club's financial sustainability following their latest financial results.", "filename": "sport_football_articles_c9vekz4m393o_1747801701.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7928/live/13ae2c40-120a-11f0-8780-939f40a90916.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c9vekz4m393o_1747801701.html", "title": "Chelsea finances: Club confirm talks with Uefa over financial sustainability", "title_page": "Chelsea finances: Club confirm talks with Uefa over financial sustainability - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Chelsea have confirmed they are in talks with Uefa over their financial sustainability following a potential breach of the governing body's Financial Fair Play rules.\nThe Blues are in talks with Uefa over a settlement relating to their financial results for the year ending June 2024, where the club posted a pre-tax profit of £128.4m, their first since Todd Boehly's Clearlake Capital consortium took ownership of the club.\nThat figure includes their £200m valuation of their highly successful women's team in a \"repositioning\" as a separate business from the men's team in a deal with parent company BlueCo at the end of the season.\nThe £200m valuation, which would be a record for a women's team, is yet to be approved by Uefa or the Premier League.\nOn Saturday morning, Chelsea released their detailed accounts which stated the club \"has entered into discussions with Uefa regarding mitigating factors affecting their regulatory submissions\".\nUefa's laws prohibit any associated party transactions, therefore meaning money generated from selling the women's team would not be included in their Financial Fair Play figures.\nIt would also prohibit the club including the sales of two hotels to a sister company that were used to comply with the Premier League's profit and sustainability rules (PSR) last season.\nIn last season's accounts, the sales of Chelsea's Copthorne and Millenium hotels were valued at £76.3m by the club. Following the Premier League's assessment, the value of the two hotels was reduced by £6m.\nOver a three-year period, clubs competing in European competitions are permitted a total loss of €200m (£170.1m) by Uefa.\nDuring the 2023/24 season, Chelsea spent £553m on player purchases and generated £208m of income via player sales.", "url": "https://www.bbc.com/sport/football/articles/c9vekz4m393o"}