{"authors": ["Brian McLauchlin", "www.facebook.com"], "date_download": "2025-05-21 06:39:27", "date_modify": "2025-05-21 06:39:27", "date_publish": "2025-01-04 13:18:23", "description": "Hearts: Three points only focus for Craig Gordon on return to Tannadice", "filename": "sport_articles_cm2lqv1v19jo_1747809567.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3aa0/live/871ec610-ca9a-11ef-a078-37769e6d4b12.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cm2lqv1v19jo_1747809567.html", "title": "Hearts: Three points only focus for Craig Gordon on return to Tannadice", "title_page": "Hearts: Three points only focus for Craig Gordon on return to Tannadice - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hearts goalkeeper Craig Gordon says is not daunted by Sunday's trip to Tannadice, the first time he will have played there since a sickening leg break in December 2022.\nGordon, 42, was sidelined for more than a year but has reclaimed his number one spot at Tynecastle this season from fellow Scotland international Zander Clark.\nNeil Critchley's side are 11th in the Scottish Premiership, while Sunday's opponents Dundee United sit third after a magnificent start to the season.\nFor Gordon, the only focus is another three points after victory against Motherwell last time out.\n\"That'll be the first time going back [to Tannadice], but it's just a game of football,\" Gordon said.\n\"I've played there plenty more times other than that one game, so go there and try to get the three points to come back down the road.\n\"They're having a really good season, they're a good team. Jim Goodwin has put together a very solid unit up there and it's going to be a tough one, but we do feel that the positives have been there over the last few weeks, that we are starting to turn things around and we need to prove that.\n\"We need to go up there and and scrap for everything to try to get something.\"\nHaving suffered two serious injuries before his leg break at Tannadice, Gordon says still playing into his 40s is a \"bonus\", but did admit top-level football is starting to take its toll.\nGordon is under contract until the end of the season and insists he is not thinking beyond that point.\n\"This is definitely bonus years, bonus games at this stage of my career and I'm determined to do the best I can with them.\n\"I just want to get us out of this situation, that's the full focus.\n\"I'm fit enough. It's definitely getting harder, but I'm up to the challenge at the moment.\"", "url": "https://www.bbc.com/sport/articles/cm2lqv1v19jo"}