{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 08:01:53", "date_modify": "2025-05-21 08:01:53", "date_publish": "2025-01-22 07:17:27", "description": "Britain's Alfie Hewett reaches the semi-finals of the Australian Open wheelchair singles before teaming up with Gordon Reid to progress to the last four of the doubles.", "filename": "sport_tennis_articles_c0lzn183y08o_1747814513.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3837/live/847ad4a0-d88f-11ef-8de4-5796704f7b49.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_tennis_articles_c0lzn183y08o_1747814513.html", "title": "Australian Open 2025 results: Alfie Hewett through to wheelchair singles semi-finals", "title_page": "Australian Open 2025 results: Alfie Hewett through to wheelchair singles semi-finals - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Australian Open 2025\nDates: 12-26 January Venue: Melbourne Park\nCoverage: Live radio commentary on Tennis Breakfast from 07:00 GMT on BBC 5 Sports Extra, plus live text commentaries on the BBC Sport website and app\nBritain's Alfie Hewett reached the semi-finals of the Australian Open wheelchair singles before teaming up with Gordon Reid to progress to the last four of the doubles.\nSecond seed Hewett, the 2023 singles champion at Melbourne Park, claimed a flawless 6-0 6-0 win over Ruben Spaargaren of the Netherlands.\nReid lost his singles quarter-final 6-3 6-7 (6-8) 6-1 to Argentine fourth seed Gustavo Fernandez, who will play Hewett next.\nHewett and Reid - who are top seeds and have won the Melbourne doubles title together on five occasions - then joined forces to beat Japanese duo Takuya Miki and Daisuke Arai 6-2 6-0.\nIn the women's wheelchair doubles, Lucy Shuker and Japan's Yui Kamiji sealed a 6-1 6-0 quarter-final win over Chile's Macarena Cabrillana and Saki Takamuro, also of Japan.\nAndy Lapthorne and his Dutch partner Sam Schroder defeated Chile's Francisco Cayulef and Gonzalo Enrique Lazarte of Argentina 5-7 7-5 12-10 to reach the semi-finals of the quad wheelchair doubles, but Lapthorne lost his singles quarter-final 6-2 6-0 to Dutch second seed Niels Vink.", "url": "https://www.bbc.com/sport/tennis/articles/c0lzn183y08o"}