{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:16:57", "date_modify": "2025-05-21 06:16:57", "date_publish": "2024-12-24 14:42:40", "description": "Marco Silva press conference: Chelsea vs Fulham preview", "filename": "sport_football_articles_crrwnjyw2x8o_1747808217.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9b67/live/608060b0-6de1-11ef-b970-9f202720b57a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrwnjyw2x8o_1747808217.html", "title": "Marco Silva press conference: Chelsea vs Fulham preview", "title_page": "Marco Silva press conference: Chelsea vs Fulham preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Silva said it was \"still too early to be sure on players\" for the game as they are \"still assessing\" them: \"The games come thick and fast. Less time to recover between games. We will take a decision for Boxing Day's match.\"\nOn Emile Smith Rowe's availability: \"He got a big knock on his ankle so let's see and we will make a decision.\"\nHe also confirmed that Sander Berge took a big knock on his ankle and a decision will be made on his availability on Christmas Day, while Sasa Lukic is probably going to be ready.\nOn Josh King: \"It was a good performance for him [last match]. It was a surprise for some people that he was so composed, but it wasn't a surprise for us. I took the decision [to start him] because I saw that he is ready.\"\nSilva continued: \"He is a really good boy who is focused on his goals and the team's.\"\nOn facing Chelsea: \"They are very, very good. It is quite clear there. A football club that has spent money in such a short period of time, the quality was there. For young players, it's not easy to find a club with so many young players performing. They are very good and very confident to play in that system. They have been dominant in most of their games. It's another big challenge for us.\"", "url": "https://www.bbc.com/sport/football/articles/crrwnjyw2x8o"}