{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:27:05", "date_modify": "2025-05-21 07:27:05", "date_publish": "2025-05-20 19:03:53", "description": "Linfield forward Joel Cooper has been named as Ulster Footballer of the Year.", "filename": "sport_articles_cp8ddmz250zo_1747812425.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9aae/live/05e16fc0-35ad-11f0-b092-712f055def2d.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_cp8ddmz250zo_1747812425.html", "title": "Joe Cooper: Linfield forward named Ulster Footballer of the Year", "title_page": "Joe Cooper: Linfield forward named Ulster Footballer of the Year - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Linfield forward Joel Cooper has been named as Ulster Footballer of the Year.\nCooper, who will join Coleraine in the summer, scored 19 league goals as the Blues won the Gibson Cup before the split.\nHe was also named Northern Ireland Writers Player of the Year and PFA NI Premiership Player of the Year.\nNorthern Ireland winger Danielle Maxwell was chosen as Women's Player of the Year.\nMaxwell scored 11 goals as she helped Cliftonville to an unbeaten Women's Premiership campaign before moving to Burnley.\nBlues defender Matthew Orr was named Men's Young Player of the Year after playing a key role in the title win in his first season with the first team.\nGlentoran striker Kascie Weir won the inaugural Women's Young Player of the Year following a breakout season with the Glens and Northern Ireland.\nIn her fourth cap for her country, the 18-year-old scored the winner against Romania last month in the Nations League.\nLinfield boss David Healy was the first recipient of the Manager of the Year award after winning his sixth Gibson Cup with the club.\nAfter helping Bangor to promotion by scoring 24 league goals, Ben Arthurs picked up the Championship Player of the Year award.\nSean McKinney was awarded Disability Player of the Year after his stellar contributions for the Northern Ireland powerchair football team and his club Belfast Trailblazers PFC.\nDeparting Linfield physio Terry Hayes received the Dr Malcom Brodie Lifetime Achievement award as he brought the curtain down on a 50-year association with the club as both a player and physio.", "url": "https://www.bbc.com/sport/articles/cp8ddmz250zo"}