{"authors": ["Rob Phillips", "www.facebook.com"], "date_download": "2025-05-20 13:23:21", "date_modify": "2025-05-20 13:23:21", "date_publish": "2023-08-02 09:43:06", "description": "With financial uncertainty and notable departures boss Graham Coughlan can expect another challenging season for Newport County.", "filename": "sport_football_66360127_1747747401.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/13A91/production/_130592508_cdf_290723_newport_v_cheltenham_004.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66360127_1747747401.html", "title": "Newport County 2023-24 League Two season preview: Coughlan leads fresh battle", "title_page": "Newport County 2023-24 League Two season preview: Coughlan leads fresh battle - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "It's fair to say Newport County will expect to go under the radar as far as League Two Welsh flag bearers are concerned this season.\nIn so many ways, they are far from old foes Wrexham, whose Hollywood connections ensure they will hog the division's headlines.\nThat may suit Newport. They have so often thrived as underdogs and start this campaign in difficult circumstances.\nA raft of reliable players have departed - notably captain Mickey Demetriou and eye catching right back Cameron Norman - amid a backdrop of off-field uncertainty with high profile board departures and tough financial circumstances underlined by the reporting of a £1.2m loss in the latest set of accounts.\nThe fan-owned club are looking for investment but finding super hero movie stars interested in investing in small Welsh clubs is not easy!\nStill, this is not a situation strange to Newport. They have been 10 years in League Two after 25 years of battling authorities and opponents to move up the pyramid following the old club's demise.\nA fighting spirit has had to become a part of the club's DNA and in boss Graham Coughlan they have the epitome of that.\nThe straight talking Irishman was a warrior as a player and combines those qualities as a manager with organisation on the field and, to date, some shrewd moves in the transfer market.\nAnything but a tough season will be a pleasant surprise. But Newport have defied the odds previously, not just in those headline grabbing cup exploits of a few years ago but all the way back to 2013 when they earned their place in League Two - by beating Wrexham at Wembley.\nMore eventful than had been expected. Amid some optimism after James Rowberry's first season, Newport began the campaign poorly and the hometown boy departed in early October, with the club just three points above the relegation places.\nCoughlan brought a more direct style and first stabilised the ship before gradually making them more durable and the results changed for the better.\nBy the end of the campaign, Newport had risen to mid-table with a 14 point margin between themselves and the bottom two.\nThis position was achieved despite only six wins at Rodney Parade. They actually lost 10 home League games last term - only Doncaster and relegated Rochdale suffered more defeats in front of their own supporters.\nNevertheless Coughlan had made his mark and rightly earned the trust of Newport fans.\nIt's fair to say Coughlan's abilities will be challenged to the full.\nThe departure of a group of senior players would test the resolve of any squad and in Demetriou the club have lost a stalwart on and off the pitch, not to mention a player whose long throw is a useful attacking weapon.\nBut Coughlan, in tandem with head of football operations Chris Finn, showed a promising ability to find the right type of player in last January's window in a very tight financial regime.\nNewport fans will be hoping their summer signings are as effective as January recruit Harry Charsley.\nThey have again tapped into the Cymru Premier to bring back former academy product Nathan Wood from Penybont. His progress will be monitored with interest, as will the development of promising teenager Kiban Rai, who had his first taste of League football last season.\nIn the absence of injured striker Offrande Zanzala, the goal scoring burden will again lie with Omar Bogle, while Coughlan has pulled a real rabbit out of the hat by re-loaning adventurous left sided defender Adam Lewis from Liverpool - a quality addition and a real lift for supporters.\nBudget wise, Newport are among the lowest - if not the lowest - in the League and so have consistently punched above their weight since their EFL return.\nUnless the search for investment bears fruit in a significant way, the capacity to defy expectations will be needed again.\nAn improvement in their home form would be a help, as would fortune with injuries. But the Newport fans refrain about their manager Coughlan - \"In Coco we trust\" has never had more resonance.\n\"You can see the power and the strength of the dollar in League Two at this moment in time. It's scary to be fair and in my career, it's probably the toughest it will be.\n\"There is so much power and so much strength financially in a lot of clubs. They tried to blow us out the water in January and tried to leave us behind, but they didn't. It's not always money that counts.\n\"I wanted to build upon what we had done and push on... but having to come back from the summer and have to rebuild, is probably the most frustrating part.\n\"I'd rather concentrate on the lads that we've we got in and the group of players we're working with.\n\"Good signs on the last few weeks, some really good players we have brought in.\"", "url": "https://www.bbc.com/sport/football/66360127"}