{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-05-21 06:06:39", "date_modify": "2025-05-21 06:06:39", "date_publish": "2025-04-01 13:54:43", "description": "David Moyes press conference: Liverpool vs Everton preview", "filename": "sport_football_articles_crrz5xz7wzno_1747807599.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a963/live/8e719b70-d19f-11ef-94cb-5f844ceb9e30.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_crrz5xz7wzno_1747807599.html", "title": "David Moyes press conference: Liverpool vs Everton preview", "title_page": "David Moyes press conference: Liverpool vs Everton preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Moyes said he is \"hopeful\" Vitaly Mykolenko will be fit but he will \"have to wait and see tomorrow exactly how he is\".\nOn Iliman Ndiaye and Dwight McNeil, who have also returned to training: \"Both of them are coming on great. Illi is a little bit further on than Dwight at the moment, but it is great that they are back in training\".\nDominic Calvert-Lewin is \"the only one who's really behind the rest\" in his recovery: \"No date with Dom yet but he is back on the grass so good signs he's getting back to it.\"\nWhen asked about reports Jarrad Branthwaite may consider his future to help his England chances, Moyes said: \"Phil Jagielka, Leighton Baines, Joleon Lescott all went on to become international players. Jarrad is in the position where he can do that. I see that as a challenge for him. The club has developed a lot of England players in the past and have a very good England goalkeeper.\"\nOn the change in form since his arrival: \"The club and team are in a better trajectory than where we were before. Players have been fantastic, they have picked themselves right up and turned the whole place around, the crowd, the support. They have got everything they deserved.\"\nHe wants a similar performance to the one Everton gave in the 2-2 draw at Goodison Park in February: \"It was good to pull the gulf between the teams together. I thought the players did a great job. We have to do that again. We've got a lot of confidence at the moment. We're playing really well and we have to keep that going.\"\nOn the challenge of visiting Anfield: \"Liverpool's league position shows how they are playing. They've had a couple of tough games but that can happen. It's a big game. It's always been incredibly difficult to go to Anfield and get a result. But, we've got an opportunity to try again. It would be huge for us as a club to get that. It is not something we have done often.\"\nDoes his own record of having never won at Anfield weigh heavily on him?: \"Yeah, I don't want it. I want to win and I want to get rid of it if I can.\"", "url": "https://www.bbc.com/sport/football/articles/crrz5xz7wzno"}