{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 05:49:13", "date_modify": "2025-05-21 05:49:13", "date_publish": "2025-01-14 11:56:07", "description": "Nottingham Forest vs Liverpool: 'Money doesn't play football, people do' - Nuno responds to Slot", "filename": "sport_football_articles_cgmyv44dmmpo_1747806553.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5fde/live/6516bed0-d254-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cgmyv44dmmpo_1747806553.html", "title": "'Money doesn't play football, people do' - Nuno responds to Slot", "title_page": "Nottingham Forest vs Liverpool: 'Money doesn't play football, people do' - Nuno responds to Slot - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Nottingham Forest boss Nuno Espirito Santo has defended the club's success this season saying \"money doesn't play football, people do\", after Liverpool head coach Arne Slot suggested the East Midlands side have spent their way to success.\nA home win over Slot's side on Tuesday would move Forest - who go into the game third in the Premier League - to within three points of the leaders, who would still have a game in hand.\nSlot said on Monday: \"If you look at the money they spent, it's not a complete surprise.\"\nBut Nuno responded: \"I don't know the spending, I don't know the value. That doesn't happen. I look at the player as a human being and how I can make them better.\n\"Money doesn't play football - people do. It's not my issue. We are not concerned about the price tag of things.\"\nNuno has guided his side to six successive victories in the league, with many believing that if they get a result against Liverpool they can be taken as serious title contenders.\n\"We have to play the games,\" added Nuno. \"We are here to compete against all the teams. I think we are doing well and nothing changes in our approach.\n\"If we start thinking about ifs...it's if, if, if, if. At the end of the game, there will be no ifs...\n\"No-one in this room could ever predict what is happening. It is the ambition and desire to do things well, and the hard work of the players and commitment.\"", "url": "https://www.bbc.com/sport/football/articles/cgmyv44dmmpo"}