{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:07:54", "date_modify": "2025-05-21 04:07:54", "date_publish": "2025-04-06 14:37:34", "description": "Rangers fan views: 'We could have world's best manager & still come second'", "filename": "sport_articles_ckg10m9jy8eo_1747800474.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/aea3/live/357e4500-12df-11f0-ac9f-c37d6fd89579.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_ckg10m9jy8eo_1747800474.html", "title": "'We could have world's best manager & still come second'", "title_page": "Rangers fan views: 'We could have world's best manager & still come second' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "We asked for your views on Rangers' 2-0 defeat against Hibs.\nHere's what some of you said:\nAlex: We lost mainly because of Jack Butland's errors and Cyriel Dessers' misfiring up front. Imagine if Dessers had taken his chances and Butland stopped his errors, then a big part of the problem is resolved. Dessers gets chance after chance, there needs to be changes.\nBilly: In a season where the only certainty has been uncertainty, the Rangers performance summed up the attitude of a number of poor performers. Another poor season peters out in disappointment. Hopefully next season can bring positive change all round.\nGerry: Same old same old, that's the Barry Ferguson effect over. Not scared to make changes he says, I hope he's got enough in reserve to do that because they all need changing. None of our players ever make the team of the week on a regular basis, only once in a blue moon, sad demise of a once giant.\nWilliam: What is the solution? It is clear Rangers cannot play with any sort of confidence in front of their own supporters. Are the fans too toxic, as you can see the players hiding in their shells? Only league we have won recently was in front of empty stadiums because of Covid, so maybe that is an indication of the issue at Ibrox?\nRonnie: I said last week give Barry the job, I'm gutted for him after yet another shambles. He is blameless both in his team selection and tactics. These players still do not get it, they think beating Bilbao on Thursday wipes away results like these, it doesn't. We are Rangers, we have lost five home games on the spin, that is totally unacceptable. So many failures in this team over the entire season. Whoever gets the job has a massive task. Will it be Barry? These results do not help the case. Hopefully the fans do not turn on him. He is one of us. Totally gutted.", "url": "https://www.bbc.com/sport/articles/ckg10m9jy8eo"}