{"authors": ["Matty Fairnie", "www.facebook.com"], "date_download": "2025-04-26 04:16:05", "date_modify": "2025-04-26 04:16:05", "date_publish": "2025-03-04 09:46:14", "description": "Hibs fan voice: 'The most impressive turnaround in my time watching the club'", "filename": "sport_articles_c62zvp4d9q9o_1745640965.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/abad/live/ba4dfcf0-f875-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c62zvp4d9q9o_1745640965.html", "title": "Hibs fan voice: 'The most impressive turnaround in my time watching the club'", "title_page": "Hibs fan voice: 'The most impressive turnaround in my time watching the club' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "The Hibs juggernaut keeps on rolling with a convincing derby win putting the cherry on top of the cake that saw Hibs take full points from Celtic, Dundee United and now Hearts.\nIt's a phenomenal time to be a Hibee - not since 1949 had a Hibernian side gone 13 league games unbeaten, a feat achieved last weekend when Jack Iredale's stunning strike flew into the net to win the derby.\nAs we looked forward to welcoming Celtic, very few Hibs fans would have been thinking we would push our way into third place considering we then had a tricky trip to Tannadice before Hearts came calling to Easter Road.\nBut a fine 3-1 win on the road (despite Jim Goodwin's protests about a goal that DID appear to strike the hand of United striker Sam Dalby) and Sunday's derby victory sees Hibs undefeated in 15 games across all competitions and occupying the 'best of the rest' slot in the table.\nDavid Gray was awarded manager of the month, and at this rate he'll be a prime candidate for manager of the season which, frankly, makes mugs of those of us who predicted his time was up after that defeat in Dundee a few months back.\nIt's the most impressive turnaround I can remember in my time watching Hibs. I absolutely love this side, the players give everything for the jersey and the fans give them everything back.\nEvery player and coach deserved to bask in the Leith sunshine on Sunday as the stadium (or three quarters of it, given the speed at which the away ended emptied) serenaded them with Sunshine on Leith for the second time in eight days.\nIt's a trip to Celtic in the cup this weekend, and being honest, the chances are they will bring an incredible run to a shuddering halt, as they did with Aberdeen earlier in the season.\nBut frankly, I don't care - it's rare that any visiting side will win at Parkhead. Sunday's derby win was far more important and I'm certain this team will take any potential setback in its stride and go again when we get back to league action.", "url": "https://www.bbc.co.uk/sport/articles/c62zvp4d9q9o"}