{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 06:47:53", "date_modify": "2025-04-26 06:47:53", "date_publish": "2025-03-01 11:39:15", "description": "South Africa fly-half Handre Pollard will leave Leicester Tigers at the end of the season to rejoin Bulls in his home country.", "filename": "sport_rugby-union_articles_c7vzn8021nlo_1745650073.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a0b9/live/fd8db1e0-f690-11ef-9dad-2d98b18c0719.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_rugby-union_articles_c7vzn8021nlo_1745650073.html", "title": "Handre Pollard: Leicester Tigers back set to return to South Africa", "title_page": "Handre Pollard: Leicester Tigers back set to return to South Africa - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "South Africa fly-half Handre Pollard will leave Leicester Tigers at the end of the season to rejoin Bulls in his home country.\nThe two-time World Cup winner signed for the Premiership club before the 2022-23 season and has made 45 appearances, scoring 395 points.\nBut the versatile back said family reasons and the lure of a club where he started his career in 2014 was too difficult to resist.\n\"It was a hard decision to make, to leave Leicester Tigers, because I love this club and being a part of this group,\" the 30-year-old told the club website., external\n\"After a lot of thought, the opportunity to go home to South Africa after six years in Europe and to be able to return to the club where I began my career was one I felt was right for me and my family to take.\n\"That's really all there is to say for now because I don't really want to start talking like this is already over. There is a lot of rugby to be played and a lot of time left for me at Leicester Tigers, which I am focused on finishing successfully.\"\nPollard made his breakthrough with Bulls in 2014 before a stint at Japanese club NTT DoCoMo Red Hurricanes in 2015 and a spell with French side Montpellier in 2019.\nPollard's World Cup wins came in 2019, when South Africa beat England in the final, and in 2023, when he scored all of the points in a 12-11 win over New Zealand.\nPollard will continue to play for Leicester, who are fourth in the Premiership, until the end of the campaign.", "url": "https://www.bbc.co.uk/sport/rugby-union/articles/c7vzn8021nlo"}