{"authors": ["Dafydd Pritchard", "Nizaar Kinsella", "www.facebook.com"], "date_download": "2025-05-21 05:36:55", "date_modify": "2025-05-21 05:36:55", "date_publish": "2025-01-31 16:38:31", "description": "Cardiff City are working on a deal to sign Leicester City attacking midfielder Will Alves on loan.", "filename": "sport_football_articles_ckgydwgwm02o_1747805815.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7c9/live/df550c60-dff1-11ef-ba4f-b100425dc741.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_ckgydwgwm02o_1747805815.html", "title": "Will Alves: Cardiff City target loan for Leicester City youngster", "title_page": "Will Alves: Cardiff City target loan for Leicester City youngster - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Cardiff City are working on a deal to sign Leicester City attacking midfielder Will Alves on loan for the rest of the season.\nThe 19-year-old is highly rated at Leicester having made his debut aged 16 in 2022, but his progress was hampered by a serious knee injury later that year.\nAlves made a substitute appearance during last month's 2-0 Premier League defeat against Manchester City and the Foxes are keen for him to leave on loan to gain first-team experience.\nCardiff are looking to add to their attacking options and could use Alves as a wide player or a number 10.\nAlves, who worked with Bluebirds manager Omer Riza as part of the England youth set-up, would become the club's third signing of the January transfer window.\nStriker Yousef Salech has joined from Swedish side Sirius in a permanent deal worth at least £3m, while midfielder Sivert Mannsverk has signed on loan from Ajax.\nCardiff have also shown an interest in signing Tottenham striker Will Lankshear on loan, but sources at the Welsh club say that is less likely to happen.\nLankshear has attracted interest from a host of Championship clubs, with Burnley, Middlesbrough, West Bromwich Albion and Luton Town reportedly targeting him.", "url": "https://www.bbc.com/sport/football/articles/ckgydwgwm02o"}