{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 11:41:41", "date_modify": "2025-05-20 11:41:41", "date_publish": "2023-08-06 17:17:44", "description": "Newcastle United: Harvey Barnes stars in win over Villarreal", "filename": "sport_articles_c3gzyqwz5jyo_1747741301.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/106f/live/eaf4b9c0-347c-11ee-9e34-a97962fbbbf3.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c3gzyqwz5jyo_1747741301.html", "title": "Newcastle United: Harvey Barnes stars in win over Villarreal", "title_page": "Newcastle United: Harvey Barnes stars in win over Villarreal - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Harry De Cosemo, BBC Sport at St James' Park\nHarvey Barnes scored twice on his home debut as Newcastle United brought their pre-season campaign to a close with a 4-0 victory over Villarreal to lift the Sela Cup at St James' Park.\nIt was the second game in two days after a different XI secured a win over Fiorentina on Saturday.\nBarnes lived up to his billing as the star attraction, linking brilliantly with Joelinton, who added a third 15 minutes from time before the winger scored his second to complete the win.\nJacob Murphy had opened the scoring with a thunderous strike after five minutes in what developed into quite a hot-tempered affair.\nNewcastle manager Eddie Howe spoke about the difficulty adapting to his intense and “complex” approach, but Barnes did not need any time to get into the swing of things thanks to his trademark energy and directness.\nThe departure of Allan Saint-Maximin for Al-Ahli was an emotional one, but Barnes always felt like a better fit than the French winger, and Newcastle looked a lot more cohesive in attack.\nPre-season ends with Newcastle unbeaten, and in confident mood going into the opening-day fixture with Aston Villa on Saturday. Champions League football offers another challenge this term, but on this evidence they will take it in their stride.", "url": "https://www.bbc.com/sport/articles/c3gzyqwz5jyo"}