{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 07:40:00", "date_modify": "2025-04-26 07:40:00", "date_publish": "2025-02-27 12:59:14", "description": "Aberdeen 'can take positives' despite thrashing by Celtic - Knoester", "filename": "sport_articles_c62xx85x65no_1745653200.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9e55/live/ab4e9760-f509-11ef-8a81-19610c927464.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c62xx85x65no_1745653200.html", "title": "Aberdeen 'can take positives' despite thrashing by Celtic", "title_page": "Aberdeen 'can take positives' despite thrashing by Celtic - Knoester  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Mats Knoester believes Aberdeen's \"brave\" attacking approach at Celtic Park yielded positives despite the 5-1 defeat.\nThe Dons' run of three straight wins shuddered to a halt as they paid for profligacy in front of goal, with substitute Shayden Morris' late consolation all they had to show for their efforts.\nHowever, Dutch defender Knoester, who signed in January from Ferencvaros, is remaing upbeat and said: \"I do think it's a better thing to stick to your way of playing because we still created.\n\"I hadn't played there before, of course, but we had quite a few chances and I've heard that it's not easy there.\n\"A lot of opponents just sit back and they still lose, so I think it's much better to try and be brave and stick to your way of playing football.\n\"The difference is if we could punish them in the beginning, that can be the difference to turning a game around.\n\"It's hard to speak about positive things, but I do think if you look at the bigger picture, we had some big opportunities to score a goal at the beginning.\n\"The biggest difference was they are so clinical.And I think that was basically the story of the first half, that every chance was a goal and we weren't clinical enough. Also sometimes we missed maybe a little bit of smartness, like making a foul, taking the speed out of the game.\n\"But I think we have to take our lesson out of it and not be too negative, even though it was a big loss. I think we could we can still take positives.\"\nAberdeen face Dundee United this weekend and Knoester acknowledged the magnitude of a game against a side vying with them for third spot,\nHe said: \"It's a big game. If we win that, you don't forget about this (Celtic) game, but at least we can turn it into positive again.\n\"So if the result is good this weekend, I think we can say that we took our lesson.\"", "url": "https://www.bbc.co.uk/sport/articles/c62xx85x65no"}