{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:51:45", "date_modify": "2025-05-20 12:51:45", "date_publish": "2023-08-03 11:26:13", "description": "Warrington chairman Stuart Middleton says the club's board made the wrong decision to appoint ex-head coach Daryl Powell.", "filename": "sport_rugby-league_66393488_1747745505.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/10092/production/_130628656_pc1_7956.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66393488_1747745505.html", "title": "Daryl Powell: Warrington board 'made wrong decision' to appoint former head coach", "title_page": "Daryl Powell: Warrington board 'made wrong decision' to appoint former head coach - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Warrington Wolves chairman Stuart Middleton says the Super League club's board made the wrong decision to appoint former head coach Daryl Powell.\nPowell left the club by mutual consent on Sunday just hours after they were well beaten by bottom side Wakefield.\nTheir chastening 42-6 defeat meant they had lost eight out of nine games.\nAsked by BBC Radio Merseyside whether his appointment was wrong, Middleton said: \"Hindsight is a wonderful thing. But probably yes, I think we did.\"\nHe continued: \"We've got to look at ourselves as well and what we got wrong. We had too many changes too quick and I think the way we treated people wasn't quite right. That didn't sit well with me.\n\"I think we've learned that in future we've got to ask a few more questions and not just give somebody a free rein and let them do what they want.\n\"We have to challenge things if we think it's not right. We didn't get it right last year and we have to make sure we don't go through that procedure again.\"\nFormer Castleford boss Powell endured a tough first season in charge of the Wire in 2022, as the club finished second from bottom of Super League having won just nine of their 27 matches.\nHopes were much higher for 2023 after some strong recruitment and they raced off the line with eight straight wins to start the campaign.\nSunday's damaging defeat dented their play-off hopes, leaving them in sixth position and just two points clear of seventh-placed Salford.\n\"I think this has been coming for a while, actually. I think Sunday was the pinnacle. I think we started off well winning the first eight games and then after that we dropped off,\" Middleton added.\n\"The Magic Weekend loss against Hull was disappointing. We had a good start and then just fell apart. Then to be knocked out in the Challenge Cup in the way that we did by Wigan, that caused us to ask questions like 'what's wrong? We've got a good squad on paper, we've got some talented players and why are we dropping off? Let's have a look and see what's going on.'\"", "url": "https://www.bbc.com/sport/rugby-league/66393488"}