{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:04:08", "date_modify": "2025-05-20 12:04:08", "date_publish": "2023-08-05 12:55:07", "description": "Manchester United: Rasmus Hojlund 'receives rapturous reception'", "filename": "sport_articles_c4nr097gxldo_1747742648.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e938/live/297e7f80-338f-11ee-8695-cfc986d0505b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c4nr097gxldo_1747742648.html", "title": "Manchester United: Rasmus Hojlund 'receives rapturous reception'", "title_page": "Manchester United: Rasmus Hojlund 'receives rapturous reception' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Simon Stone, BBC Sport at Old Trafford\nRasmus Hojlund received a rapturous reception as he made his way out of the players' tunnel to the centre circle, where he held up a shirt bearing his name - but no number - before Manchester United's friendly with Lens.\nHis presence has generated a huge amount of attention, with a Danish TV crew flying in solely to cover the moment.\nThe transfer represents something of a gamble for United, who were heavily linked with a move for Harry Kane.\nIn the recent past, they have gone for experienced forwards in the form of Radamel Falcao, Zlatan Ibrahimovic and, most recently, Cristiano Ronaldo.\nHojlund is at the other end of the age and development stage.\nIt will be fascinating to see whether manager Erik ten Hag can develop him the same way he brought through so many excellent Ajax players that he guided to the semi-final of the Champions League in 2019.\nOne game a week for the first four weeks of the Premier League season allows time for Hojlund to settle in.\nIt promises to be a fascinating period for this self-confessed United fan, whose reputation has grown considerably since he cost Sturm Graz €1.5m (£1.3m) 18 months ago.", "url": "https://www.bbc.com/sport/articles/c4nr097gxldo"}