{"authors": ["Shamoon Hafez", "www.facebook.com"], "date_download": "2025-05-21 05:33:01", "date_modify": "2025-05-21 05:33:01", "date_publish": "2025-01-14 13:07:31", "description": "Everton news: Opinion - Off-field issues starting to clear for Blues", "filename": "sport_football_articles_c1ez79222qzo_1747805581.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c815/live/6d37d9e0-d278-11ef-9fd6-0be88a764111.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c1ez79222qzo_1747805581.html", "title": "Opinion - Off-field issues starting to clear for Blues - BBC Sport", "title_page": "Everton news: Opinion - Off-field issues starting to clear for Blues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "There was a feeling of nervousness from Everton supporters when 'PSR verdict day' came around on Tuesday, having fallen foul - twice - last season.\nEverton became the first side in Premier League history to be deducted points for breaching the competition's financial rules, and another charge followed. After the appeals process they were docked a total of eight points.\nBut club officials have been confident there would not be any issues this time around - and they have been proven right.\nThe Toffees have undergone significant cost-cutting measures to ensure they were financially compliant for the 2023-24 season, helped by the sales of Lewis Dobbin and Ben Godfrey before the 30 June deadline - the end of the financial year.\nSince the start of the 2022-23 season, Everton have been hamstrung by strict spending constraints and they are the only Premier League side during that period with a positive net spend, of £80m.\n\"After the points deductions, we were very nervous of making sure we didn't fall foul of those problems again,\" director of football Kevin Thelwell told BBC Radio Merseyside in September.\nReturning boss David Moyes faced the media for the first time on Monday and said: \"Overall I hope we can all get together and find a way of spending some money but, as you well know, we still have a bit of work to do [on PSR] to clear everything so we have to be mindful of that as well.\"\nEverton are beginning to get their house in order off the pitch, with a tick mark next to new manager, new owners, new stadium and PSR compliance.\nNow the task is to start winning games on the pitch to ensure they maintain their proud record of being ever-present in the Premier League.", "url": "https://www.bbc.com/sport/football/articles/c1ez79222qzo"}