{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:07:54", "date_modify": "2025-05-20 12:07:54", "date_publish": "2023-08-06 00:00:00", "description": "Watch & follow text updates as the Netherlands face South Africa in the last 16 at the 2023 Women's World Cup.", "filename": "sport_live_football_66183773_1747742874.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5D4E/production/_130668832_roord_index.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_live_football_66183773_1747742874.html", "title": "Netherlands vs South Africa: Roord and Beerensteyn secure last 16 win", "title_page": "Netherlands vs South Africa: Roord and Beerensteyn secure last 16 win - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Goodbye!\nFT: Netherlands 2-0 South Africa\nThank you for joining us, especially if you stayed up very late in the UK, Netherlands, South Africa or elsewhere. We hugely appreciate it.\nWe'll be back for Sweden v USA, kicking off at 10.00 BST today.\nSee you then.\nRead the match report\nFT: Netherlands 2-0 South Africa\nThe Netherlands secured a quarter-final spot at the Fifa Women's World Cup but not before enduring several anxious moments against South Africa.\nJill Roord, Manchester City's new club record signing, nodded the Dutch ahead in the ninth minute but South Africa went close to equalising several times against the 2019 runners-up.\nBanyana Banyana captain Thembi Kgatlana was once again a real handful and forced four fine saves from Daphne van Domselaar.\nLineth Beerensteyn doubled the lead after a mistake by South Africa keeper Kaylin Swart in the second half.\nYou can read Neil Johnston's match report here.\nPost\nNetherlands 2-0 South Africa\nSouth Africa now the ones having the possesion, playing the ball around the Dutch box.\nNetherlands now the ones digging in and defending, not allowing Banyana Banyana to get a shot away.\nPost\nNetherlands 2-0 South Africa\nOne wonders what might have been had South Africa not been forced into those two first half changes.\nReferee Yoshimi Yamashita has allowed Netherlands to get away with a lot of physical play today.\nPost\nNetherlands 2-0 South Africa\nDanielle van de Donk is absolutely crucial to how Netherlands play.\nShould her team go through here, she will be a massive miss against Spain due to suspension.\nNetherlands fans must hope that is not the last we see of her in Australia and New Zealand.\nPost\nNetherlands 2-0 South Africa\nDanielle van de Donk nods a high cross down for Lieke Martens, but her shot is claimed by Kaylin Swart.\nVan de Donk then almost breaks through the defence, but picks the wrong pass and the keeper is able to rush out to smother the ball.", "url": "https://www.bbc.com/sport/live/football/66183773"}