{"authors": ["Gareth Vincent", "www.facebook.com"], "date_download": "2025-05-20 14:06:30", "date_modify": "2025-05-20 14:06:30", "date_publish": "2023-07-30 19:08:14", "description": "Alex Cejka beats Padraig Harrington at the second play-off hole to win the Senior Open Championship at Royal Porthcawl.", "filename": "sport_golf_66354740_1747749990.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/B980/production/_130588474_gettyimages-1565700783.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_golf_66354740_1747749990.html", "title": "Senior Open Championship: Alex Cejka beats Padraig Harrington in play-off", "title_page": "Senior Open Championship: Alex Cejka beats Padraig Harrington in play-off - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Alex Cejka beat Padraig Harrington at the second play-off hole to win the Senior Open Championship on another day of brutally difficult conditions at Royal Porthcawl.\nGermany's Cejka birdied the par five 18th to claim his third senior major after Harrington could only manage par.\nHarrington had missed an eagle putt to win on the 72nd hole, before the first play-off hole was halved in four.\n\"I can't believe I'm standing with the trophy here,\" Cejka said.\n\"Seeing all those great names on the trophy, coming in here with all the pictures and everything, all the guys who won it before me, now holding it myself, it's surreal.\"\nFor the second successive day, no player in the field carded an under-par round.\nUntil this week, the last Senior Open round in which no player had gone under par was at Royal Aberdeen in 2005.\nCejka's round of 76 and Harrington's 75 meant they finished together at five over par amid near relentless rain and gusting winds on the south Wales coast.\nHarrington's fluffed chip on the second play-off hole opened the door for Cejka to triumph with a two-putt birdie.\nCejka, 52, adds the Senior Open to his two other senior major victories, the 2021 Tradition and the Senior PGA Championship in the same year.\nHarrington's play-off defeat - his second in a senior major this year - means he has finished second in each of his Senior Open appearances.\n\"I hit a tentative putt on the 72nd hole. You have a chance to win the tournament and you have got to hit a great putt,\" Harrington said.\n\"At the end of the day, I was trying to not hit a bad putt. I should have been trying to hit a great putt.\n\"Some of that could be tiredness too. All week, I chipped poorly, I just haven't been myself.\"\nVijay Singh had started the day alongside Harrington on one over, one shot off Cejka's third-round lead. The Fijian finished third as he birdied the last for a 77.\nNew Zealand's Steven Alker had also started at one over but fell away thanks to a final-round 81, while Phillip Archer's 77 saw him finish tied fifth with Wales' Phil Price on nine over.\nPrice made birdie on 18 for a battling 76, while fellow countryman Bradley Dredge finished in a tie for 20th after a final-round 80.\nYE Yang, the 2009 US PGA champion, climbed 44 places to finish tied 11th courtesy of a level par round of 71, the joint best of the day.\nScotland's Colin Montgomerie endured a dreadful Sunday, as a round of 88 left him 22 over for the tournament.", "url": "https://www.bbc.com/sport/golf/66354740"}