{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 13:04:47", "date_modify": "2025-05-20 13:04:47", "date_publish": "2023-07-25 14:24:54", "description": "Salford sign former Abrdeen winger Connor McLennan and bring in goalkeeper Joe Wright from Millwall on loan.", "filename": "sport_football_66302803_1747746287.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12341/production/_130516547_shutterstock_editorial_13483876al.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_football_66302803_1747746287.html", "title": "Connor McLennan & Joe Wright: Salford sign ex-Aberdeen winger and bring in keeper on loan", "title_page": "Connor McLennan & Joe Wright: Salford sign ex-Aberdeen winger and bring in keeper on loan - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Salford have signed winger Connor McLennan following his exit from Aberdeen and loaned goalkeeper Joe Wright from Millwall until January.\nMcLennan, 23, has 11 goals in 150 appearances for the Dons, St Johnstone and Brechin during his career so far.\nHe spent last season on loan to Saints and has now agreed an initial one-year deal with Salford.\nWright, 22, has been at the Championship club since the age of 13 but is yet to make his senior debut.\nHe tasted first-team football with 14 games on loan to Bath City in National League South last season.\n\"It's a great opportunity for me to come to a fairly new club, rising through the ranks,\" Wright said., external\n\"There's great ambition here, so I'm really looking forward to getting started.\"\nOn his move south, McLennan said: \"I fancied a change, I know a few boys down here and Callum Hendry I played with at Aberdeen, I played against a few of them up the road as well.\n\"Coming down here is a new challenge, and once I spoke to the manager it was something I'm really looking forward to doing.\"", "url": "https://www.bbc.com/sport/football/66302803"}