{"authors": ["Emlyn Begley", "www.facebook.com"], "date_download": "2025-04-26 07:47:45", "date_modify": "2025-04-26 07:47:45", "date_publish": "2025-02-26 23:32:31", "description": "Liverpool's march to the Premier League title seems inevitable. When could they be confirmed as champions?", "filename": "sport_football_articles_cz0337ngjdko_1745653665.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c7a6/live/82388970-f4a1-11ef-896e-d7e7fb1719a4.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cz0337ngjdko_1745653665.html", "title": "When will 2024-25 Premier League title be secured?", "title_page": "When will 2024-25 Premier League title be secured? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "THIS STORY IS ARCHIVED AND WILL NO LONGER BE UPDATED.\nA newer version can be found here.\nLiverpool's march to the Premier League title seems unstoppable.\nAfter Arsenal dropped points in their draw at Everton on Saturday, Arne Slot's side could go 14 points clear at the top by beating Fulham on Sunday.\nBBC Sport looks at when Liverpool could wrap up their second Premier League title - and a record-equalling 20th overall.\nIt is fair to say Liverpool are champions-elect now - so it is a matter of when and not if.\nThe Reds, who have lost just once in the league this season, need 11 points out of a possible 24 to guarantee the title, with Arsenal only able to obtain a maximum of 83 points.\nTen points could also be enough given Liverpool's goal difference is vastly superior to Arsenal's (currently +43 to +30).\nIn fact, given their goal difference supremacy, Slot's side might only need two wins and a draw - as long as one of those victories is against the Gunners - to secure the title.\nThe earliest date Liverpool could win their 20th league title is 20 April, when they play Leicester away.\nFor that scenario to play out, Arsenal need to lose their next match against Brentford, with Liverpool beating Fulham and West Ham in that time.\nThen if Arsenal fail to win at Ipswich on 20 April, the Reds would be crowned champions before even playing against Leicester later that afternoon.\nShould the Gunners beat the Tractor Boys, having previously lost to Brentford, Liverpool would win the title by beating the Foxes.", "url": "https://www.bbc.co.uk/sport/football/articles/cz0337ngjdko"}