{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 04:05:20", "date_modify": "2025-05-21 04:05:20", "date_publish": "2024-12-29 00:00:00", "description": "Jorgen Strand Larsen's late equaliser continues Vitor Pereira's unbeaten start as Wolves boss after a chaotic Premier League draw with Tottenham.", "filename": "sport_football_live_cewx8pq5q94t_1747800320.html", "image_url": "https://static.files.bbci.co.uk/ws/simorgh-assets/public/sport/images/metadata/poster-1024x576.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_live_cewx8pq5q94t_1747800320.html", "title": "Tottenham 2-2 Wolves: Jorgen Strand Larsen late equaliser denies Ange Postecoglou's side victory as Vitor Pereira's impressive start at Wolves continues", "title_page": "Tottenham 2-2 Wolves: Jorgen Strand Larsen late equaliser denies Ange Postecoglou's side victory as Vitor Pereira's impressive start at Wolves continues - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Jorgen Strand Larsen's late equaliser continued Vitor Pereira's impressive start as Wolves boss after a chaotic Premier League draw with Tottenham.\nWolves took an early lead when the unmarked Hwang Hee-chan swept the ball low into the corner from the edge of the box after the Spurs defence had switched off at a free-kick.\nSpurs equalised shortly afterwards thanks to Rodrigo Bentancur, who glanced a powerful close-range header beyond Jose Sa from Pedro Porro's corner.\nTottenham were awarded a penalty when Andre brought down the fleet-footed Brennan Johnson only for Sa to guess correctly and deny Son Heung-min\nIt did not stymie Spurs' attacking intent and a neat interchange between Dejan Kulusevski and Johnson inside a crowded area culminated in the latter firing home a low shot.\nTottenham had chances to increase their lead in the second half but failed to take them.\nDominic Solanke was unable to get on the end of a Timo Werner cross into the six-yard box while Kulusevski perhaps should have done better when he broke clear.\nWolves were content to hang in the contest and levelled with three minutes of normal time remaining when substitute Strand Larsen beat Fraser Forster at his near post with a rasping angled shot.\nSpurs piled on the pressure during 12 minutes of added time but were unable to contrive a winner and finish December with just five points from a possible 21.\nWolves are back to doing the basics well under Pereira with a clarity of thought about what an individual player's role is in the collective.\nThat was embodied by the performances of their two strikers, who both got on the scoresheet against Spurs.\nHwang netted a respectable 12 goals in the Premier League last season but has had to contend with a more limited role this season.\nThis was only his third start and his first since August after a combination of injuries meant he struggled towards the end of Gary O'Neil's tenure.\nHwang scored his first goal of the season in a 2-0 win over Manchester United last time out, and he opportunistically netted for the second game in succession.\nOn his 99th league appearance, his pace stretched the high line held by the Spurs defence but when he ran out of steam in the second half Strand Larsen continued to carry the mantle.\nThe Norwegian ended a run of five games without a goal with a clinical strike to ensure Pereira took his unbeaten streak to three games.\nThis season Wolves have relied heavily on Matheus Cunha, who been involved in 11 goals in his last 11 league appearances, scoring seven and assisting four.\nThe Brazilian had a subdued afternoon and was substituted at half-time with a hamstring problem.\nBut it will have been a source of encouragement for Pereira that goals have seemingly returned elsewhere on the pitch.", "url": "https://www.bbc.com/sport/football/live/cewx8pq5q94t"}