{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:12:51", "date_modify": "2025-05-21 07:12:51", "date_publish": "2025-03-30 06:11:39", "description": "England's Charley Hull remains in second place at the Ford Championship in Arizona after matching American leader Lilia Vu's 68 in the third round.", "filename": "sport_golf_articles_c0jzpzv2e0po_1747811571.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7be2/live/42d29260-0d26-11f0-ac9f-c37d6fd89579.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_golf_articles_c0jzpzv2e0po_1747811571.html", "title": "LPGA: Charley Hull two shots off lead in Ford Championship", "title_page": "LPGA: Charley Hull two shots off lead in Ford Championship - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Ford Championship third-round leaderboard\n-18 L Vu (US); -16 C Hull (Eng); -15 A Furue (Jpn), NK Madsen (Den); -14 A Thitikul (Tha), A Corpuz (US), H-J Kim (Kor), H-R Ryu (Kor), Y Zhang (Chn)\nSelected others: -13 L Ko (NZ); -11 N Korda (US); -5 L Maguire (Ire)\nFull leaderboard\nEngland's Charley Hull will go into the final round of the Ford Championship in Arizona in second place, two shots behind American leader Lilia Vu.\nHull matched Vu's four-under-par 68 in a third round played in difficult, windy conditions on the Whirlwind Golf Club's Cattail Course.\nShe steadied herself after bogeying the opening hole, only dropping one further shot following a three-putt at the 14th and picking up six birdies, including two in the closing three holes.\n\"It is what it is and it ain't what it ain't, but nice to finish with a birdie,\" said Hull on making it to 16 under par.\nVu, a six-time winner on the LPGA Tour, also struggled with the conditions as she reached a tournament record 18 under for 54 holes.\nHaving completed the opening two rounds without dropping a shot, she bogeyed the sixth and ninth holes and carded a double bogey at the troublesome 14th, but rallied to close with three consecutive birdies.\nElsewhere, all three of the players who started the day alongside Hull on 12 under fell away, with Denmark's Nanna Koerstz Madsen in a tie for third after making it to 15 under following a round of 69.\nShe was joined by Japan's Ayaka Furue, who shot a 67.\nThailand's Atthaya Thitikul fired a 70 to join a five-strong group on 14 under, while world number one Nelly Korda fell away dramatically with a one-over-par 73 to leave herself seven shots off the lead.", "url": "https://www.bbc.com/sport/golf/articles/c0jzpzv2e0po"}