{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:53:01", "date_modify": "2025-05-21 06:53:01", "date_publish": "2025-03-29 18:32:54", "description": "Le Bris wants solution to penalty problems", "filename": "sport_football_articles_c75dnnd7z19o_1747810381.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f0f8/live/9a953710-0ccb-11f0-bd5c-75dd3ff67252.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c75dnnd7z19o_1747810381.html", "title": "Le Bris wants solution to penalty problems", "title_page": "Le Bris wants solution to penalty problems - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Sunderland head coach Regis Le Bris wants to find a solution to his side's penalty problems with the play-offs looming into view.\nThey beat Millwall 1-0 thanks to Trai Hume's first half strike, but Luke O'Nien's second half spot-kick miss was the big talking point.\nIt came after Romaine Mundle was fouled, with the winger eager to take it, until he was stood down in place of O'Nien.\nLe Bris told BBC Radio Newcastle: \"It's tough. For the end of the game, the second goal would have been easier for us and we couldn't relax until the end.\"\nThe Black Cats' record stands at one scored and four missed this season, including crucial failures from Patrick Roberts at Sheffield United and two in the space of a few minutes from Wilson Isidor at Burnley.\nO'Nien's miss was far less damaging, but it highlighted a key issue if Sunderland's season comes to be decided like this in a play-off semi-final or the final at Wembley, with the side fourth and only needing seven points to secure their spot in the top six.\n\"It's tough. For the end of the game, the second goal would have been easier for us and we couldn't relax until the end,\" said Le Bris.\n\"At the moment, our percentage of success is really low and we have to find a solution.\n\"This is the best situation to score and so far we only score one out of five.\n\"We'll talk about it next week because maybe we'll have a penalty shoot-out at the end of the season and if we work like that, the chances won't be high.\"", "url": "https://www.bbc.com/sport/football/articles/c75dnnd7z19o"}