{"authors": ["Simon Stone", "www.facebook.com"], "date_download": "2025-05-21 07:46:25", "date_modify": "2025-05-21 07:46:25", "date_publish": "2025-05-20 11:34:58", "description": "Manchester United defender Harry Maguire says Ruben Amorim's squad can end a season of suffering with the Europa League trophy.", "filename": "sport_football_articles_cjrn7perr98o_1747813585.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e243/live/13cf9050-34cf-11f0-96c3-cf669419a2b0.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_cjrn7perr98o_1747813585.html", "title": "Europa League 2025 final: Man Utd have \"belief\" to beat Tottenham, says Harry Maguire", "title_page": "Europa League 2025 final: Man Utd have \"belief\" to beat Tottenham, says Harry Maguire - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Manchester United defender Harry Maguire says Ruben Amorim's squad can end a season of self-inflicted suffering with the Europa League trophy - but only if they \"give absolutely everything\" in Wednesday's final.\nThe Red Devils take on fellow Premier League stragglers Tottenham in Bilbao, with a Champions League place for next season the lucrative bonus that goes to the winners.\nFor both clubs, it is an extraordinary opportunity to make amends for desperate domestic campaigns that have left United in 16th and Spurs in 17th.\nWith the end of the season in sight, Maguire says a sixth major European trophy will only come their way if United play to their potential, which has certainly not always been the case this season.\nIn that regard, he accepts United have let down supporters \"far too much\", with their league campaign \"nowhere near good enough\".\nStanding in their way are a Spurs side whose own failings have been glaringly apparent too.\n\"They've suffered as well as us this season,\" said Maguire.\n\"They've had a lot of injuries like us, have not been able to find that rhythm and concentrated on the Europa League as well.\n\"But we believe in ourselves. We have got to make sure we put the percentages in our favour in terms of turning up, giving absolutely everything and performing on the day.\"\nMaguire has been one of United's most consistent performers this season, particularly in Europe.\nHe scored the winning goal during a brilliant comeback against Lyon in the quarter-finals, before helping to set up Casemiro's opener in Bilbao during the semi-final first leg.\nShould he start the final, the England centre-back will be looking to make up for lost time, having sat out the 2021 Europa League final defeat to Villarreal through injury.\n\"Missing that game was the big one for me,\" Maguire said. \"That hurt a lot.\n\"I was captain of the club at the time and a big part of that team. Maybe the result would have been different if I'd been fit. That's what I felt.\n\"We had a good defensive record but I had a nasty ankle injury. There was talk at the time of me making it, but I was nowhere near. I was still struggling to jog, let alone play in a final.\"\nClearly, working out how to get to Bilbao and knowing where they will stay is not an issue to trouble United's players.\nFor many thousands of supporters, a major challenge has been in finding viable and affordable ways of making the journey of just over 1,000 miles by road, with some opting instead for a 32-hour ferry crossing from Portsmouth.\nIt is another example of the backing United have provided across a tortuous campaign.\nSupporters have strongly protested against the ownership but, other than sporadic booing after particularly poor results, have remained behind head coach Amorim and his team.\nMaguire says he and the players are thankful and recognise they have let down supporters who expect success on all fronts.\n\"The fans have been absolutely incredible this season,\" said Maguire. \"We've disappointed them far too much.\n\"We've given them some good times in the Europa League and some great memories in terms of winning the derby at the Etihad, but overall it's even surprised me. They are great fans and this year they've proved that.\"\nThe Europa League final with Tottenham will be followed by the final Premier League game of the campaign against Champions League-chasing Aston Villa, with United nowhere near that race this season.\nBut there will be no immediate rest for United's players, who have more work ahead of them.\nAs soon as the Villa game is over, they will be heading to Malaysia and then flying on to Hong Kong for two matches against local opposition next week.\nThe trip is likely to generate around £7.8m.\nAfter a domestic campaign that will almost certainly result in the club's worst finish since their 1973-74 relegation season, and knowing Premier League prize money alone is worth £3m a place, Maguire accepts the United squad cannot complain.\n\"It is the club's decision and we don't have any right to argue against it after the performances we have put on,\" he said.\n\"As players, we have to take responsibility for the position in the Premier League and the money we have generated this season through that finish, which is nowhere near good enough.\n\"It shouldn't be like that. Two months ago, we should have been in a better position, fighting for a Europa League position or the Champions League positions.\n\"We don't have a right to stand here and criticise the club for trying to generate some money that will hopefully help us next season with signings.\"", "url": "https://www.bbc.com/sport/football/articles/cjrn7perr98o"}