{"authors": ["Luke Reddy", "www.facebook.com"], "date_download": "2025-05-19 15:07:36", "date_modify": "2025-05-19 15:07:36", "date_publish": "2015-02-16 16:48:52", "description": "Xabi Alonso is sent off as Bayern Munich draw with Shakhtar Donetsk in their Champions League last-16 meeting in Ukraine.", "filename": "sport_football_31491686_1747667256.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/mcs/media/images/81073000/jpg/_81073461_alonsoeuropean.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/19/bbc.com/sport_football_31491686_1747667256.html", "title": "Shakhtar Donetsk 0-0 Bayern Munich", "title_page": "Shakhtar Donetsk 0-0 Bayern Munich - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Bayern Munich midfielder Xabi Alonso was sent off in his 100th Champions League game as his side played out a drab stalemate at Shakhtar Donetsk.\nThe Spaniard fouled Alex Teixeira in the first half and carded again for upending Taison in the second period.\nEarlier, Thomas Muller had pulled a shot wide when clean through for Bayern and he fired over before the break.\nBut neither side threatened after Alonso's red in a tetchy game. They meet again in Munich on 11 March.\nThe sides shared 35 fouls and seven yellow cards in addition to Alonso's red, with attacks often cut short by tactical fouls when danger looked likely.\nShakhtar, champions in Ukraine, will be \"heroes\" if they overcome Bayern according to their manager Mircea Lucescu as his side are still playing home fixtures away from the Donbass Arena because of conflict in the area.\nThey have also not played a competitive game since December as the Ukraine Premier League - in which they sit second to Dynamo Kiev - is on its winter break.\nPlaying several hundred miles away from home in the western city of Lviv, they arrived to face a Bayern side who had hammered Hamburg 8-0 on Saturday.\nBut while they conceded the brunt of possession - 64% - Lucescu's side snuffed out dangerous attacks with the energy in their defending and restricted the visitors to few chances.\nThough Muller sprang the offside trap from Arjen Robben's pass in the first half, he could only pull his shot across the goalmouth from 10 yards and he then fired over from a Franck Ribery pull-back late in the first period.\nShakhtar, boasting the tournament's top scorer in Luiz Adriano, played on the break but only got their talisman into the game sparingly and he left the field late on having completed just 44% of his 18 passes.\nAlonso tangled with Shakhtar winger Taison when the Brazilian threatened a break away, prompting a second yellow card, but the Ukrainians failed to make their advantage count and both sides settled for a point.\nThey will reconvene in three weeks' time in Munich, where Bayern have not lost since defeat against Real Madrid in the semi-final of this competition last season.", "url": "https://www.bbc.com/sport/football/31491686"}