{"authors": ["Nat Hayward", "www.facebook.com"], "date_download": "2025-04-26 08:00:02", "date_modify": "2025-04-26 08:00:02", "date_publish": "2025-02-25 10:59:40", "description": "Eddie Howe press conference: Liverpool vs Newcastle preview", "filename": "sport_football_articles_cdel9k768r4o_1745654402.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3e34/live/3814b960-4923-11ef-9e1c-3b4a473456a6.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_cdel9k768r4o_1745654402.html", "title": "Eddie Howe press conference: Liverpool vs Newcastle preview", "title_page": "Eddie Howe press conference: Liverpool vs Newcastle preview - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Sandro Tonali \"came through fine\" in his substitute appearance against Nottingham Forest and Howe \"anticipates he will now be fully fit\" for the trip to the league leaders.\nSven Botman is \"improving quickly\" and will be \"very close\" for the Wednesday's game, while Joelinton \"is another player who could be quite close\".\nMore on Joelinton: \"It's similar to Sven. He is really improving, doing really well and pushing. He has those key aspects we have missed when he's not there. His physicality and strength there is an obvious presence missing in our midfield. Joey is a massive player for us.\"\nOn the \"emotional\" challenge of playing at Anfield: \"We need to be close to a perfect game from our perspective. Psychologically, it's huge. It's an emotional stadium - we're going to need to start well, and we need to have a threat in the game.\"\nMore on facing the league leaders and dealing with Mohamed Salah down Newcastle's left: \"It's always not down to any one individual in the team. It's about the team supporting that area of the pitch.\"\nHowe recalled Nick Pope ahead of Martin Dubravka in goal after his return from injury: \"I had a conversation with Martin. It's always difficult because every player wants to play and I have many difficult conversations with many players on a regular basis. That's part of my job. But Martin's a top professional and he will respond in the right way.\"\nOn Alexander Isak, who has reached 50 Premier League goals faster than Harry Kane, Sergio Aguero and Thierry Henry: \"It highlights how well he's done it when you look at the names. He's come in with a great attitude to the club. He's come in hungry to succeed and eager to help the team. He's not been selfish in that period, he's not thought of himself, he's always played for the team and I'm delighted for him.\"", "url": "https://www.bbc.co.uk/sport/football/articles/cdel9k768r4o"}