{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:35:03", "date_modify": "2025-04-26 04:35:03", "date_publish": "2025-02-28 12:32:36", "description": "St Mirren in contract talks with striker Mikael Mandron", "filename": "sport_articles_c1mnndkye9eo_1745642103.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2de7/live/b85ddfd0-f5cf-11ef-85ee-0589f92b739a.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_articles_c1mnndkye9eo_1745642103.html", "title": "St Mirren in contract talks with striker Mikael Mandron", "title_page": "St Mirren in contract talks with striker Mikael Mandron - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "St Mirren are in contracts talks with in-form striker Mikael Mandron and two other players, manager Stephen Robinson has confirmed.\nMandron, 30, had netted just once this season until a burst of five goals in his past six games.\nThe French forward arrived from Motherwell in summer 2023 and his deal expires this summer.\n\"I think we offered him a new contract so he decided he's going to start scoring goals and try and get more money out of us! I'm sure that's his ploy,\" Robinson said.\n\"But Mika is a very important part of the squad. Even when he is not scoring, he brings people into the game.\n\"He's a character around the dressing room as well and he's a really intelligent footballer. He's added goals in the last month to his game and we're sure he'll continue to do that.\n\"I'm hopeful for everybody to sign but everyone's got options. We're still speaking actively to Mika and two other players as well in the current squad and trying to get business done.\"\nRobinson, meanwhile, expects plenty of twists and turns in the run-in of the top-six chase as his side prepare to host Celtic on Saturday in a game where they have \"nothing to lose and everything to gain\".\nThe Buddies have won only one of their past five games in all competitions - a 2-0 victory over Rangers at Ibrox - and slipped out of the top six with a 3-1 defeat at Hearts on Wednesday.\nFollowing the visit of the league leaders, the Paisley outfit face bottom-six sides Motherwell, Kilmarnock, Dundee and Ross County before the split.\n\"There's five games left before the split, a lot of points to play for and I think there will be a few twists and turns in the next few weeks,\" Robinson said.\n\"I said the three games against Rangers, Hearts and Celtic are all bonus points and there's nothing to fear and as I said before, everything to gain.\n\"People will drop points when we don't expect it and probably gain them when you don't expect it. So it's something to look forward to. It's to be embraced not feared.\n\"Celtic are a very, very good side. But they're not invincible and we have to believe that, we have to turn up and play at the top of our game.\"", "url": "https://www.bbc.co.uk/sport/articles/c1mnndkye9eo"}