{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 06:07:07", "date_modify": "2025-05-21 06:07:07", "date_publish": "2025-01-31 14:54:05", "description": "All-Ireland champions Armagh will aim to open their Allianz Football League Division One account when they host Tyrone on Saturday night.", "filename": "sport_articles_c0lz9jkpnn3o_1747807627.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ce94/live/6ddd5740-dfe2-11ef-980d-87f49f932b9b.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c0lz9jkpnn3o_1747807627.html", "title": "Armagh host Tyrone in big Division One derby", "title_page": "Allianz Football League: All-Ireland champions Armagh host Tyrone in big Division One derby - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "All-Ireland champions Armagh will aim to regroup from last weekend's opening defeat in Galway by accounting for their traditionally biggest Ulster rivals Tyrone in Saturday's Allianz Football League Division One game at the Athletic Grounds (18:00 GMT).\nArmagh started promisingly at Salthill but struggled badly for scores in the closing 50 minutes as they ultimately finished with 14 players after Niall Grimley's red card.\nGrimley is replaced by Jarlath Og Burns with All-Ireland final starter Paddy Burns and Cian McConville taking over from Shane McPartlan and Jason Duffy as Kieran McGeeney names nine of his Sam Maguire Final winning side but is again without Rian O'Neill.\nTyrone go into the game boosted by their opening home win over Derry when Niall Morgan's 'fly goalie' role proved particularly effective.\nFive players - Tyrone men Padraig Hampsey, Kieran McGeary, Peter Harte and Michael McKernan plus Armagh's Greg McCabe - were sent off in the last Athletic Grounds League meeting between the sides in 2022 following a brawl as the home side recorded a 2-14 to 0-14 victory.\nA year later, Tyrone's round-seven 0-18 to 0-16 victory at Healy Park guaranteed the Red Hands' Division One status and relegated Armagh in the process.\nAfter their scheduled opener in Kerry was postponed, Donegal open their Division One campaign on Saturday night in Ballybofey (19:30) against a Dublin side that edged out Mayo at Croke Park a week ago.\nThe big talking point going into the game will be whether Jim McGuinness opts to pitch in Michael Murphy after the Glenswilly man's two seasons away from inter-county football.\nThe Paddy Tally factor will provide the intrigue as Derry aim to open their league account against his former team Kerry in Sunday's Division One contest at Celtic Park (12:30).\nNeither squad has yet been announced but David Clifford is not expected to make the trip north.\nIn Division Two, Down will hope to regroup from their high-scoring defeat by Roscommon when they face Cork at Pairc Esler (13:00) with the Monaghan v Westmeath (14:00) and Meath v Cavan (14:00) clashes also taking place on Sunday.\nThe Division Three games include Sunday's Ulster derby between Fermanagh and Antrim at Ederney (14:30) with the Ernemen having been well beaten by Kildare last week as the Saffrons held on to beat Clare at Corrigan Park.\nArmagh (v Tyrone): B Hughes; T McCormack, B McCambridge, P Burns; Connaire Mackin, A Forker, G McCabe; B Crealey, J Og Burns; O Conaty, R Grugan, Darragh McMullen; C McConville, A Murnin, S Campbell.\nSubs: E Rafferty, G Murphy, C O'Neill, F O'Brien, S Conlon, C Turbitt, R McQuillan, J Duffy, C O'Hanlon, J Hall, S McPartlan, C McArdle, S Gaffney, Darren McMullan, S Renaghan, P Gaffney, J Donnelly, J Burke, F Woods, K Laverty, T McKavanagh, A Cullinane.\nCavan (v Meath): G O'Rourke; N Carolan, B O'Connell, J McLoughlin; P Faulkner, D McVeety, O Kiernan; K Clarke, E Crowe; Ciaran Brady, G Smith, L Molloy; R O'Neill, J Smith, S McEvoy.", "url": "https://www.bbc.com/sport/articles/c0lz9jkpnn3o"}