{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 12:05:34", "date_modify": "2025-05-20 12:05:34", "date_publish": "2023-08-05 12:24:18", "description": "Manchester City: Why did they want Josko Gvardiol?", "filename": "sport_articles_c72wd0kzdljo_1747742734.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2ed5/live/cf8298d0-338a-11ee-b803-6b71a5d482cf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_articles_c72wd0kzdljo_1747742734.html", "title": "Manchester City: Why did they want Josko Gvardiol?", "title_page": "Manchester City: Why did they want Josko Gvardiol? - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Emlyn Begley, BBC Sport\nGvardiol, who is 6ft 1in, is a left-sided central defender, and Manchester City feel he could feature in a back three or in a four-man defence.\nWith Guardiola's management, though, it is hard to always gauge what might happen regarding a player's development. Gvardiol is primarily a centre-back, who has also played at left-back on occasion.\nJohn Stones, Nathan Ake and Manuel Akanji were considered to be central defenders too - but Ake and Akanji played some of last season at full-back and Stones ended the campaign in a hybrid midfield role.\nGvardiol's statistics in the Bundesliga last season are comparable to City's current centre-back contingent. His passing accuracy is slightly lower, but he made more interventions and won possession more often.\nIn Europe's top five leagues, only four defenders touched the ball more times per 90 minutes last season than Gvardiol, with Ruben Dias topping that list.\n\"He's fast, intense, dynamic, really good at changing directions and really good at transitioning from attack and defence and vice versa,\" German football expert Jasmine Baba told BBC Radio Manchester's We're Not Really Here podcast in June.\n\"He's a really good, agile defender and his strength is in passing while he's in possession - even under pressure, he still finds solutions to play it forward.\n\"John Stones has been pushed into more of a midfielder - I can see that happening with Gvardiol too.\n\"It's kind of a no-brainer why someone like Pep Guardiola would want him. He really is a dream prospect at his young age.\"", "url": "https://www.bbc.com/sport/articles/c72wd0kzdljo"}