{"authors": ["Greg Playfair", "www.facebook.com"], "date_download": "2025-05-21 05:32:59", "date_modify": "2025-05-21 05:32:59", "date_publish": "2025-01-14 13:10:37", "description": "Hearts fan column: Searching for a striker and Scottish Cup success", "filename": "sport_articles_c98yemz1dr6o_1747805579.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/006e/live/99b3b540-d276-11ef-94cb-5f844ceb9e30.png", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_articles_c98yemz1dr6o_1747805579.html", "title": "Hearts fan column: Searching for a striker and Scottish Cup success", "title_page": "Hearts fan column: Searching for a striker and Scottish Cup success - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "If there's one thing that won't be dry this January, it's the ink in the pen that's being used for all the transfer activities at Hearts this month.\nThe ink is barely dry after the signings of forward Elton Kabangu and defender Jamie McCart, yet we are being linked with two more additions on a permanent basis.\nAustrian centre-half Michael Steinwender and Kazakhstan winger Islam Chesnokov already have set tongues wagging in Gorgie with their stats and YouTube show reels being passed around social media at speed.\nBoth Steinwender and Chesnokov would be additions in much sought after positions for us this season and the early indications are, they would both strengthen the starting 11, which is what is desperately needed.\nThat's no slight on the defensive pairing of McCart and Craig Halkett, who looked assured in Sunday's stalemate against Aberdeen. Halkett has actually been really good in his last three performances and it's no coincidence that we've picked up clean sheets in such games.\nIn truth, we should've left Pittodrie with three points following a last-minute penalty, but Ross Doohan brilliantly saved Jorge Grant's penalty.\nThe encouraging thing – or frustrating depending how you look at it – is that for the third game this season, we looked more than a match for Aberdeen and leave disappointed not to have finished victorious. To me, it highlights how important this January window is for us to get good options in the squad, as if we were able to bring on better quality attacking players in that second half, we would have won that match comfortably.\nFor the third transfer window in a row, we ought to be targetting a target man to act as another weapon in our attacking arsenal and compliment James Wilson, Kabangu and Lawrence Shankland, for his final six months.\nWe turn our attention to the Scottish Cup and for teams like ourselves, it offers the best opportunity to win silverware in a season.\nA Scottish Cup win would absolutely go a long way to reconcile everyone associated with Hearts from players, supporters to the board room.\nThat said, it's important not to underestimate our opposition on Friday night in Brechin City. Cup games live on the BBC always seem to provide good viewing for the neutral, but I'm hoping it's a one sided affair with Neil Critchley's side dominating the entire 90 minutes.\nThe last competitive match between the sides, was back in September 1992 at Glebe Park and plucky Brechin took us to extra-time before our legendary talisman John Robertson bailed us out with a 108th-minute winner.\nI'm hoping we don't have as close a match this time around but I trust that Critchley will respect this competition and we won't see too many changes. A victory and a fourth consecutive clean sheet will do for me, and hopefully our names inked into the draw for the next round.", "url": "https://www.bbc.com/sport/articles/c98yemz1dr6o"}