{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-20 14:31:15", "date_modify": "2025-05-20 14:31:15", "date_publish": "2023-07-28 21:00:26", "description": "Hull KR maintain their play-off push as they run in six tries to comfortably beat Super League strugglers Castleford Tigers.", "filename": "sport_rugby-league_66301815_1747751475.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/6FAB/production/_130578582_2381888e16dd9674c82f88ed8fe770de397bc496.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_rugby-league_66301815_1747751475.html", "title": "Super League: Hull KR 34-16 Castleford Tigers - Robins maintain play-off push after cup heroics", "title_page": "Super League: Hull KR 34-16 Castleford Tigers - Robins maintain play-off push after cup heroics - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Hull KR scored scored six tries as they comfortably beat Castleford Tigers.\nTries from Tom Opacic, Rhys Kennedy and Kane Linnett saw them open up a 16-0 lead before Castleford responded through Will Tate and Jack Broadbent.\nBut after turning round 16-10 ahead, the home side took complete control with a superb try from loose-forward Elliot Minchella and further scores from James Batchelor and Ethan Ryan.\nGreg Eden's try in the final 10 minutes was scant consolation for Castleford.\nIt was a fourth-straight defeat for Castleford, who remain second-bottom of the table and are just two points off 12th-placed Wakefield.\nTate' try against his former club and Broadbent's score after a break down the right kept them in touch at the break but they were outplayed in the second half.\nRovers won a third-straight game and stay sixth in the table to maintain their push for a play-off spot, as they backed up their victory in the Challenge Cup semi-final last weekend.\nThey took the lead after 15 minutes as Jez Litten's kick to the right corner was batted back into play and Brad Schneider gathered and offloaded to Opacic who did superbly well to reach out one-handed to score.\nA penalty for a high tackle then gave Rovers another attacking set and Litten's flat ball across the defence put prop Kennedy in from five metres out.\nA third try followed before the break as centre Shaun Kenny-Dowall shrugged off two tacklers and offloaded to Mikey Lewis who made ground down the left and passed inside for second-row Linnett to score.\nThe try of the night came moments into the second half as Matt Parcell found a gap 60 metres out and sent Minchella away as he had the pace to see off two defenders.\nBatchelor extended the lead with a powerful break and reach for the line before the game was put beyond doubt as Schneider sent a perfectly-weighed long pass out wide and into the arms of Ryan who walked in.\nHull KR head coach Willie Peters told BBC Radio Humberside:\n\"To come off last week you never know what you're going to get because it was a really emotional ending.\n\"But we've spoken about the next five weeks and today was a step towards where we want to get to.\n\"Cas threw a lot at us and we spoke at half-time to say 'we're in control' and I was really happy with the response after the break.\"\nCastleford head coach Andy Last told BBC Radio Leeds:\n\"I'm really disappointed with the result and the manner of some of the tries we've conceded - we're just not learning our lessons.\n\"It took us 27 minutes to do what we'd practised and spoke about all week and, lo and behold, we then got our rewards.\n\"But we're just not prepared to do that for long enough at the moment.\"\nHull KR: Lewis; Ryan, Opacic, Kenny-Dowall, Senior; Milnes, Schneider; Kennedy, Litten, King, Batchelor, Linnett, Minchella.\nInterchanges: Parcel, Storton, Keinhorst, Luckley.\nCastleford: Broadbent; Wallis, Mellor, Tate, Eden; Dean, Miller; Watts, Johnstone, Griffin, Edwards, Lawler, Westerman.\nInterchanges: Massey, Matagi, Foster, Tsikrikas.\nReferee: Chris Kendall.", "url": "https://www.bbc.com/sport/rugby-league/66301815"}