{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-05-21 07:53:45", "date_modify": "2025-05-21 07:53:45", "date_publish": "2025-01-03 23:56:41", "description": "Tottenham news: Ange Postecoglou says James Maddison going to darts 'no problem'", "filename": "sport_football_articles_c4glrdj8v01o_1747814025.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a76e/live/d4f87d40-c9f5-11ef-852a-9106f8ff2cbf.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/21/bbc.com/sport_football_articles_c4glrdj8v01o_1747814025.html", "title": "Tottenham news: Ange Postecoglou says James Maddison going to darts 'no problem'", "title_page": "Tottenham news: Ange Postecoglou says James Maddison going to darts 'no problem' - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Tottenham manager Ange Postecoglou has said he has \"no problem\" with James Maddison after the playmaker spent Sunday night watching World Championship darts despite reporting ill for the Wolves game earlier in the day.\nMaddison received criticism on social media after being pictured with Spurs team-mate Brennan Johnson at Alexandra Palace.\nThe 28-year-old had come on as a substitute in the 64th minute of the 2-2 draw at Tottenham Hotspur Stadium as Postecoglou's side dropped to 12th in the table going into Saturday's Premier League game against Newcastle.\n\"I've got no problem with that,\" Postecoglou said when asked about Maddison being at the darts.\n\"I've got no problem with the players having lives. It's a lot different trying to play a game of football and living a life. I don't see any problem with that and I don't think it hurt him.\n\"He wasn't 100% and it was a game where we needed someone to be 100%. He was still well enough to play so it wasn't like he was bed-ridden.\n\"If he was bed-ridden, didn't turn up to the game and then still went to the darts, there may be an issue there. But I had no issue with that.\"", "url": "https://www.bbc.com/sport/football/articles/c4glrdj8v01o"}