{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 03:54:26", "date_modify": "2025-04-26 03:54:26", "date_publish": "2025-03-04 17:26:47", "description": "Yorkshire chair Colin Graves says he was \"staggered\" by the fee in the sale of Headingley-based Hundred franchise Northern Superchargers.", "filename": "sport_cricket_articles_c05m6n6rg60o_1745639666.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/76db/live/0ba46930-f90d-11ef-b5c1-27f306935cb2.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_cricket_articles_c05m6n6rg60o_1745639666.html", "title": "Northern Superchargers sale clears Yorkshire debts", "title_page": "Northern Superchargers sale clears Yorkshire debts - Colin Graves - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Yorkshire chair Colin Graves has said he was \"staggered\" by the fee in the sale of Headingley-based Hundred franchise Northern Superchargers.\nLast month the Sun Group, owners of Indian Premier League side Sunrisers Hyderabad, agreed a deal to pay just over £100m for a 100% stake.\nGraves said the county, which is in over £20m of debt, will receive \"somewhere in the region of £50m\" when the deal is completed later this month.\nOf the eight Hundred sides, the Superchargers are one of only two sides to sell up entirely, alongside Southern Brave.\n\"The investors have paid a hell of a lot of money for the teams they are buying into,\" Graves told BBC Look North.\n\"It's staggering the amount, I knew it was valuable but not that valuable.\n\"That is great for cricket because 20% of that money is going into the recreational game, so that is going to help the grassroots.\"\nHe added: \"We would have enough money to clear the debts, that would be priority number one. Number two, we are looking at how we protect the rest of the money and look at how to invest it for the good of the club.\n\"We're in a good position now and I want to make sure Yorkshire never gets into that position again.\"\nThe entire value of the eight Hundred franchises came to about £967m.\nThe total money raised to be shared among the 18 counties, Marylebone Cricket Club (MCC) and domestic game is more than £500m.\nGraves was chairman of the England and Wales Cricket Board when The Hundred format was invented.\nHe says that the recent investments show that the ECB were right to pursue a new approach.\n\"A lot of people were anti The Hundred when we launched it. It took us two and a half years to convince the county stakeholders to allow us to do it,\" he said.\n\"I remember going to a DCMS [Digital, Culture, Media and Sport committee] meeting and getting grilled about why we were doing it and it was going to kill cricket... Where we are today I think it's proven it was the right thing.\"\nGraves' return to Yorkshire at the start of last year was seen as controversial by many within the game.\nHis first spell as chairman between 2012 and 2015 was during the period for which the club was later fined for failing to address the systemic use of discriminatory or racist language.\nIn January 2024, the 77-year-old \"personally and unreservedly\" apologised for the racism scandal.\nYorkshire's members accepted a loan offer to the debt-ridden club from Graves, who previously served as chairman and helped to save them from financial ruin in 2002.\nIn May last year he said the club pursuing demutualisation to become a private structure, rather than being member-owned, was \"essential for the future\".\nDespite the large injection of capital from the sale of Northern Superchargers, Graves still believes that demutualisation is \"the way forward\" and said six other counties are looking at it.\n\"We're not taking it off the table because I believe we still need to look at it and talk about it,\" he said.\n\"This has shown that there are investors out there who want to invest in cricket. If they have invested in The Hundred to the extent they have then why not in the counties?\n\"Every sport needs investment, fine, we're OK now and should be in the future but I want to make sure this club never gets into a financial position again like it has twice in the past 20 years.\n\"Making it into a limited company will allow investors to come in but with certain controls so that one person can't become too dominant. If we go down that road we'll protect the members' rights. The last thing I want to do is take anything away from them.\"\nYorkshire secured promotion back to Division One of the County Championship under outgoing head coach Ottis Gibson last season.\nAnthony McGrath has been appointed as his successor for the new campaign, which begins on 4 April, and Graves called the former Essex coach's return \"a big coup\".\nThe domestic schedule has faced criticism in recent years, with counties playing 14 Championship matches, and at least 14 in the Blast and eight in the One-Day Cup.\nGraves believes the playing calendar needs to be addressed for the good of the game.\n\"I think county cricket will still be around in 10 years but I think the format will change going forward,\" he said.\n\"English cricket has got to look at how it will work better because at the present time it is a congested schedule. Between us everyone in the game has got to look at it and say 'what does cricket need from a members point of view, from an income point of view and from a future point of view?'\n\"The Hundred is going to be a big part of it, it isn't going to go away. The Blast is important from a county perspective, that's a big income point of view. County cricket is the poor relation from an income point of view but it's very important from a members point of view. We understand that, we were all brought up on red-ball cricket but they've got to do look at the schedule.\"\nHe added: \"We've got that younger generation coming in and you've got to look to the future. I'm not being unkind but there's no point in looking back to the 1950s and 60s because it's a different world.\n\"I've said to everybody look forward, don't look back. What is the next 10 years going to look like? Because it's going to be different whether you like it or not.\"", "url": "https://www.bbc.co.uk/sport/cricket/articles/c05m6n6rg60o"}