{"authors": ["Mike Peter", "www.facebook.com"], "date_download": "2025-05-20 11:43:31", "date_modify": "2025-05-20 11:43:31", "date_publish": "2023-08-06 15:56:04", "description": "Welsh Fire dismiss champions Oval Invincibles for just 80 as they win by three wickets in The Hundred.", "filename": "sport_cricket_66411633_1747741411.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/993B/production/_130672293_gettyimages-1596407932.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/05/20/bbc.com/sport_cricket_66411633_1747741411.html", "title": "The Hundred 2023: Welsh Fire beat Oval Invincibles in low-scoring match", "title_page": "The Hundred 2023: Welsh Fire beat Oval Invincibles in low-scoring match - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.com", "maintext": "Published\n6 August 2023\nWelsh Fire dismissed defending Hundred champions Oval Invincibles for just 80 as they won by three wickets.\nSouth African seamer Shabnim Ismail took 3-12 against her former side.\nMarizanne Kapp dismissed Fire's openers within seven balls, before returning to remove Georgia Elwiss and Emily Windsor with successive deliveries.\nFire continued to lose wickets but Elwiss' 33 helped the away side reach their target with 20 balls to spare at The Oval.\nWhat else do you need to know?\nWelsh Fire finished bottom of last year's standings but find themselves top of the early table, with two wins and a no result from their first three fixtures. Oval Invincibles remain sixth after two games.\nInvincibles endured a spell of 45 balls without a boundary as they lost regular wickets. Opener Lauren Winfield-Hill watched all but one of them fall as she was the last player dismissed, bowled by Freya Davies.\nWinfield-Hill was not the only player to see her stumps rattled, with five Invincibles batters out bowled. Ismail accounted for two of those wickets, cleaning up Suzie Bates and Mady Villiers before removing Ryana Macdonald-Gay lbw.\nThe dismissals of Villiers and Macdonald-Gay were one of three untaken hat-trick chances in the match, with Paige Scholfield also seeing off Sophia Dunkley and Laura Harris in successive deliveries.\n'Welsh Fire have been great' - what they said", "url": "https://www.bbc.com/sport/cricket/66411633"}