{"authors": ["BBC Sport", "www.facebook.com"], "date_download": "2025-04-26 04:09:11", "date_modify": "2025-04-26 04:09:11", "date_publish": "2025-03-02 19:37:37", "description": "Hibernian stay level on points with Glasgow City at the top of the Scottish Women's Premier League following a 1-0 victory over reigning champions Celtic.", "filename": "sport_football_articles_ckgnxylxvwzo_1745640551.html", "image_url": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9617/live/84b1cbc0-f79f-11ef-9e61-71ee71f26eb1.jpg", "language": "en", "localpath": "C:\\Users\\vopha/news-please-repo//data/2025/04/26/bbc.co.uk/sport_football_articles_ckgnxylxvwzo_1745640551.html", "title": "Hibs & Glasgow City enter split top of SWPL", "title_page": "Hibs & Glasgow City enter split top of SWPL  - BBC Sport", "title_rss": "NULL", "source_domain": "bbc.co.uk", "maintext": "Hibernian stay level on points with Glasgow City at the top of the Scottish Women's Premier League following a 1-0 victory over reigning champions Celtic.\nThe top four had gone into Sunday's final game before the league splits into two for the final 10 matches level on points.\nCity remain top on goal difference after their 4-0 win over Motherwell, Rangers are now third after being held to a 2-2 draw at home by fifth-placed Heart of Midlothian, while Celtic are fourth.\nIn the bottom half, Queen's Park secured an important point in their bid to avoid relegation with a goalless draw at home to Partick Thistle, while Aberdeen were boosted by a 1-0 win over Spartans.\nDundee United's top-flight survival was handed another blow following a 3-1 defeat by fellow strugglers Montrose.\nAt Broadwood, Hearts striker Bayley Hutchison opened the scoring after just six minutes before following up with a second before half time.\nBut second-half substitute Laura Berry changed the game for Jo Potter's side and pulled one back before setting up fellow forward Rio Hardy for the equaliser.\nMotherwell held on until a few minutes before half-time at Petershill when striker Brenna Lovera opened the scoring for City.\nPaul Brownlie's side conceded three more goals in 16 second-half minutes through Lisa Forrest and Natalia Wrobel, with a double.\nHibs took the lead in the first half against Celtic when forward Eilidh Adams headed home from Tegan Bowie's cross at Meadowbank and the visitors missed chances to equalise.\nIn Aberdeen, forward Emily Kraft's strike gave the Dons the lead after 10 minutes, but they had to sustain serious Spartans pressure as the half played on and had a second goal disallowed before securing the points.\nAn own goal from Megan Burns gave Montrose the lead at Foundation Park after just eight minutes, but midfielder Ashley Robertson found the leveller two minutes before the break.\nSecond-half goals from forwards Neve Guthrie and London Pollard piled even more pressure on United as their survival chances slip further away.\nQueen's Park and Glasgow rivals Thistle played out a goalless draw at Ochilview.\nThistle thought they had taken the lead in the first half when Carla Boyce found the back of the net, but the goal was disallowed.\nQueen's Park are now six point behind Montrose in 10th but four clear of United at the bottom of the table.", "url": "https://www.bbc.co.uk/sport/football/articles/ckgnxylxvwzo"}